[{"title":"For anybody who needs to give their brain a rest","rating":8,"date":"5 May 1999","review":"I Bought a Vampire Motorcycle is the definition of \"Good Bad\", from the title that describes the entire plot, to the broad-brush performances, to the suspension of disbelief that comes when you know the budget is laughably small, but you *don't care*.  Those who love the work of Troma will discover that the British can do the same thing, and with even more gore and humour.<br><br>Neil Morrissey, pre \"Men behaving Badly\", plays Noddy, an innocent young Birmingham motorbike courier who buys a classic Norton with a dark history. What follows provides a hilariously imaginative reworking of every scene you'd expect from a self-respecting vamp flick, but on two wheels and set in Birmingham.  The special effects are zero-budget but enthusiastic, and the title creature in its mutated hunting guise is a highly impressive piece of kit, complete with Ancient Briton-style axle blades. Morrissey looks as terrified and bemused as the script requires him to be, but the film is stolen by Anthony \"C3PO\" Daniels as a camply gung-ho biker exorcist, complete with razor-sharp throwing-crosses.  Michael Elphick provides sterling support as a Sweeney-esque copper with a life-saving taste in snacks.  As the punk rock soundtrack pounds (complete with inevitable theme song \"She Runs On Blood...She Don't Run On Gasoline) and the severed heads of Hells Angels fly across the screen, you will revel in thrills, spills, cheap sexual innuendo, and low comedy.  See it.","user":"Shrike-10","rank":[20,23]},{"title":"Great fun movie, with a \"don't care\" attitude","rating":10,"date":"22 February 2003","review":"I've caught this movie quite a few times and I always enjoy it. It's the tale of a despatch rider (played by Neil Morrisey) who buys a demonically possessed motorcycle that runs on blood instead of petrol. It's a silly idea fleshed out with great characters; a comedy vicar (played by Anthony Daniels) and fine comic copper (Michael Elphick). The films cheap, but resolutely cheerful and the overall effect is very pleasing. Particularly good apres pub viewing. I'd recommend it.","user":"hugodrax","rank":[17,20]},{"title":"Enjoyable","rating":7,"date":"22 September 2006","review":"An enjoyable romp by the cast of Boon who are obviously enjoying themselves in a silly but entertaining horror.<br><br>Not to be taken seriously , not the greatest horror , a definite B-Movie as it was supposed to be , so for me it hits the targets .<br><br>If you liked Boon a motorcycle courier and almost Rockford files English TV programme with Michael Elphick and Neil Morrisey just shot in Nottingham rather than Birmingham which the film is then u will probably enjoy the actors hamming it up.<br><br>Reminded me of some of the old Dracula films by Hammer , but using a motorbike instead of a foreign Count and that i think is what it is a Homage to Hammer by a TV cast using cheap effects and filming worth watching just don't expect too much.","user":"randalthor1812","rank":[8,10]}]