[{"title":"Simple and often lovely","rating":7,"date":"2 June 2002","review":"Fairy tale about the romance between two dogs from opposite sides of the tracks gets colorful, warm, old-fashioned Disney treatment. Cinemascope cartoon unfolds with valentine-like flair, all the ribbons and bows are in place, yet the requisite cutesy flourishes and manipulation inevitably turn up (one dog, thought to have been killed, shows up LIMPING in the next scene!). Yet, it's hard to complain when the rest of the pieces fall into place so snugly. The plot is, by turns, comfortably predictable and still pleasingly reassuring, though a bit heavy with incidental chatter. The Peggy Lee music is delightful, and the \"Bella Notte\" sequence alone, with the spaghetti, breadsticks and the drippy candle, is simply superb. *** from ****","user":"moonspinner55","rank":[39,40]},{"title":"One of the Greats","rating":19,"date":"19 March 2001","review":"I grew up watching this movie. I consider it a wonderful movie for both children and adults to watch. While many of today's animated Disney movies are aimed at kids, this movie is from a time where adults were primarily the target audience. This movie lacks the 'kiddie' humor and tells a wonderful tale of genuine emotion and compassion. The love story between two non-human characters removes most bias that we automatically impose upon human characters. I feel that few movies will ever match this one in quality.","user":"neophoenix","rank":[61,66]},{"title":"The Life and Loves of our Best Friends","rating":10,"date":"22 January 2000","review":"There is nothing as wonderful as the wag of a dog's tale.  The writers, actors and animators, together with Disney magic, capture the unique and limitless variety of personalities that exist in the canine world.   This film takes these wonderful canine characters and shows the world from their perspective. The adorable footage of Lady as a puppy reminds me of the behavior of my own hounds when they were pups.    The beautiful \"Park Avenue\" Lady grows up and falls for the happy-go-lucky, vagabond, Tramp. Add a dog-hating aunt, a baby, some cats, some rats and the adventure is complete.  The songs sung from the dog pound together with those sung by the wicked Siamese cats are the most purely fun of any Disney animation. The song sung at the lover's romantic Italian dinner brings a tear to the eye. Finally, Lady and the Tramp share a spaghetti noodle that leads to one of the most memorable kisses in Hollywood history.  This is a wonderful film that will be enjoyed for generations.","user":"RobertCartland","rank":[28,29]}]