[{"title":"Road of Six Paths and Four Lives Continues","rating":24,"date":"24 October 2001","review":"Kozure Okami:Sanzu no Kawa no Ubaguruma/Lone Wolf &amp; Cub:Baby Cart at the River Styx(1972) is made up of a few episodes from graphic novel series. One part of story is loosely based on an episode called EIGHT GATES OF DECEIT.  The sub plot involving the masters of death is inspired by THE FLUTE OF THE FALLEN TIGER.  The part where Daigoro is used as bait to lure out Ogami Itto is based on another episode known as EXECUTIONER'S HILL. The bits and pieces from the different stories are sown together to form an exciting samurai flick.<br><br>\nFirst few minutes produce a stunning sequence of action mis-en-scene. Baby Cart at the River Styx(1972) is the best of the six film series because of complex character development, interesting story, and outstanding action sequences.  The Chimes heard by Ogami Itto and his son, Daigoro during early moments of film are a reminder for them of their painful past.  Humorous moment occurs when an owner of a hotel inn takes in Itto and son(Lone Wolf gave him gold pieces to watch over) after thinking of not taking them in moments earlier.  There is a brilliant 360 to 180 degree pan of the camera that features an effective tight close up to display expressions of intuition from faces of Ogami Itto and Daigoro.<br><br>\nPlaces a little more focus into the code and demeanor of Ogami Itto than Part One.  Ogami Itto as the Lone Wolf lives by Meifumado as a way towards restoring his family name while at the same time take revenge on the Yagyu clan.  Ogami Itto kills without emotion yet a shed of humanity is somewhere within his soul.  He is an action character of three dimensional depth that is rare for an action picture.  Ogami Itto intriques me as a character of graphic novels and for this instance film because of his strong paternal presence.<br><br>\nIntroduces some tough female ninja assassins that Lone Wolf &amp; Cub have to go up against.  They seem to be untouchable after dispatching a volunteer of the Kurokuwa group until the female warriors face off with Ogami Itto. Ogami Itto is one tough and determined opponent as the female ninja assassins find out when the majority of this group but one is killed off. The face off between Ogami Itto and Sayaka, the leader of the female assassin group successfully played by Kayo Matsuo has a surreal feel to it. Ogami Itto walking through a path of bodies with a baby cart that has a vegetable stuck in the middle front is a nice comic touch.<br><br>\nThe confrontation between Lone Wolf &amp; Cub and the Shogunate's Kurokuwa Ninja group is a combo of artful violent imagery and brilliantly smooth editing. This moment flows smoothly in a way that is hypnotic to the eye and mesmerizing to the brain.  Although the scene does have it share of graphic violence, there is never a crude feel in the action as at moments in Sword of Vengeance(1972).  Fantastic use of cuts and dissolves to make this moment one of the best action scenes from the first two films.  The cinematography used in the action moves with graceful steps.<br><br>\nLone Wolf and Cub:Baby Cart at the River Styx(1972) really gets at the heart of the story with its complex father/son relationship.  The father/son relationship of Itto and Daigoro is what has made the Lone Wolf &amp; Cub stories for so many people.  Ogami Itto and Daigoro are tied together by an unbreakable bond that is indescrible in words.  The bodily expressions tell more about the relationship of Ogami Itto and Daigoro than any sentence could ever do.  An example of this notion happens when the leader of the Kurokuwa Ninja threatens to kill Daigoro is Itto does not give up.<br><br>\nThe graphic violence is much higher here than in Sword of Vengenace(1972). The violent battle scenes of BCATRS stir around with stylistic expression. Maybe not as artisticly refined as in samurai films by Akira Kurosawa, but the violent battle scenes at least never feel bland or boring.  I can see where filmmakers like John Woo got their influences when I watch the battle scenes of LW&amp;C:BCATRS(1972).  The graphic violence in part two and the other films in the series must have played an important influence on the bloody violence in Lucio Fulci's gothic chillers.<br><br>\nOgami Itto and Daigoro follow a path of blood and corpses that is steeped in tragedy.  In living by Meifumado, they are as one who hold a future that is bleak and hopeless.  Only when they completely destroy the Yagyu Clan can the Lone Wolf and Cub return to a path of a hopeful future.  For Daigoro, dying in the well would have been more merciful than living to an unknown future.  Daigoro represents the good, kind side of Ogami Itto whom without would just be cold blooded and ruthless.  The tragic path of the two is an element that is fascinating.<br><br>\nThe most formidable opponets of Ogami Itto are the Bentenri brothers from part two.  The duel between the brothers and the God of Death in the sandy desert is Leonesque.  The head splitting moment is the creme de la creme of the duel.  Tomisaburo Wakayama for this moment reaches the larger than life heights of Toshiro Mifune.  Breathtaking samurai duel with excellent scenery that would have made Sergio Leone proud.<br><br>\nThe actors who play the Masters of Death give their characters an unique quirk to make the Bentenrai brothers fascinating villains.  One of the actresses(Michie Azuma) who plays a female ninja assassin would have a more substanical role as topless female assassin in Lone Wolf &amp; Cub:Baby Cart in Peril(1972). Part One and Part two of LW&amp;C use identical imagery.  Better directed than the first film with fewer slow moments.  Lone Wolf &amp; Cub:Baby Cart at the River Styx(1972) stays true emotionally to the graphic novel that the film is based on.","user":"eibon09","rank":[12,16]},{"title":"Thoughtful and Humourous","rating":10,"date":"10 November 2019","review":"I thought the first movie was extremely grim. This one had a more thoughtful approach. I like that Lone Wolf confronted the sword woman five times. It was interesting that each confrontation was different, and that he spared her life. She was sworn to kill him but respected him, and had compassion for his son, when she could have tried to kill the boy. There were nuances as to their code of honor, their obligations, and their personal morality. There were a couple of funny moments relating to the little boy and his participation in the various battles. The use of the boy for some humor was a plus.<br><br>The fighting scenes were mostly good, but not as good as the Zatoichi movies which I love and have seen them all. The bloody effects were pretty bad in some scenes, as the injured (killed) samurai sometimes started bleeding many seconds after they were stabbed or sliced. In one scene, Lone Wolf impales two guys at the same time. One of them immediately starts spraying lots of blood from his wound. The other guy gets a trickle of blood dripping out. It would have been more impressive if the double-impalement lead to double sprays of blood.<br><br>Several heads were sliced open, and the last one looked like a venus flytrap popping open, and there were no brains, eyes, or other material visible, it looked totally silly. Then a single spray of blood shot straight up into the air from the middle of the head. Laughable and really bad special effects.<br><br>Otherwise, the film was pretty good. It had a lot of action, some good story lines, and some humor.","user":"Johnny_West","rank":[3,3]},{"title":"Blood and Gore, But Also Depth and Development","rating":7,"date":"20 March 2017","review":"Disgraced former executioner Ogami Ittō continues his brooding storm through the Japanese countryside, his three-year-old son Daigoro along for the ride in a booby-trapped carriage. Now some distance into their march to vengeance, the pair have drawn so much notoriety that they risk ambush and assassination at every turn. It's not paranoia, either: Ogami dispenses with blade-wielding enemies at nearly every chapter break, downing at least two-dozen men and women before the film is through. The opportunity isn't abused. In true poppy '70s samurai fashion, each challenger (or cluster of challengers) wears a distinct identity and a unique fighting style, like a colorful garden of deadly blossoms. They all bleed day-glo red, though, often in a towering arc of spray that paints landscape and fallen comrade alike. In Baby Cart at the River Styx, for the first time, we see vulnerability from the master swordsman and a little headstrong personality from his young child. We also see uncertainty from a prominent rival, another first, and restraint in the midst of a bloodlust. Some of the fighting is a little awkward, and the formula is threatening to wear thin, but overall this represents a wonderfully stylish, entertaining continuation of the journey that was so well-established in the first film. An excellent genre-definer.","user":"drqshadow-reviews","rank":[3,3]}]