[{"title":"\"Captains Courageous\" on the trail","rating":14,"date":"14 November 2007","review":"This pleasant ,juvenile Western is a retread of the theme of the classic movie -and Kipling novel upon which it is based-Captains Courageous in that it deals with the education in life of a spoiled rich kid who is taken out of his comfort zone and forced to adjust to new situations and people Chester Graham Junior (a winning performance from Dean Stockwell)is the boy in question .He is left alone in the desert by mischance and can only get back to civilisation by joining a cattle drive bossed by the tough but fair Dan Matthews (the always excellent Joel Macrea).Chester is a fish out of water and struggles to adjust, making his dislike of the situation and his new colleagues all too plain until he sees the error of his ways learning lessons of the trail and life itself from his new boss and grizzled veterans played by genre luminaries Chill Wills and Bob Steele.There is one delightful touch when Macrea pulls out a picture of the woman waiting for him at end of trail -it shows his wife in real life ,Francis Dee, with whom he made a number of Westerns <br><br>Kurt Neumann,not a name usually linked with the genre, directs admirably and the colour photography by Maury Gertsman ,of Death Valley where the movie was shot is superb .Indeed the choice of ;ocation adds immeasurably to the impact of the movie as it is relatively little used in Westerns <br><br>This is not the only trail drive Western to draw its inspiration from a movie in another style -Red River being essentially a variation on Mutiny on the Bounty .This is not in the class of that magnificent movie but it is enjoyable and worth watching","user":"lorenellroy","rank":[16,16]},{"title":"\"Captains Courageous\" out west","rating":6,"date":"24 January 2001","review":"This a neat, colourful \"Captains Courageous\" variation, with veteran Joel McCrea and youngster Dean Stockwell combining really well. The moralising and the sentimentality are underplayed and the action is excitingly staged by underrated director Kurt Neumann (even if some of the 'wild horse' scenes are taken from an earlier Universal-International western - directed by George Sherman - called \"Red Canyon\"). All in all this 78 minute oater is well worth catching.","user":"maughancannes-2","rank":[16,16]},{"title":"Under Joel's Tutelage","rating":7,"date":"30 January 2008","review":"Young Dean Stockwell is one spoiled kid, but with his father Leon Ames running a railroad, he's hardly got time for the kid. After Dean gets lost on the New Mexico desert when his father's train stops to take on water, he's found by Joel McCrea who's the top hand of a Cattle Drive going to Sante Fe. <br><br>That Cattle Drive is the making of young Dean. Under the tutelage of Joel, the kid turns out to be quite a good hand.<br><br>If the story sounds familiar like everyone else who reviewed this film, we all noted the obvious similarity between Cattle Drive and Captains Courageous. <br><br>McCrea and Stockwell had worked well together before in Stars in My Crown for MGM the year before. Though Cattle Drive is a good film, I can't recommend Stars in My Crown highly enough.<br><br>Look also for a nice performance by Chill Wills as the cook on the drive. A man definitely good to stand in with as we learned in Monte Walsh.<br><br>There's no violence in Cattle Drive, there's no women in it either. We do learn Joel does have a girl friend as he shows a picture of Frances Dee to all who will look. <br><br>It's a shame that Cattle Drive is not out on VHS or DVD it's a perfect family film to rent.","user":"bkoganbing","rank":[15,16]}]