[{"title":"Great B movie","rating":21,"date":"21 June 2003","review":"As you watch this film, you will more than likely sit back and say, \"This is so silly.\"  Remember this is an 80's film.  I remember first watching this film as a teenager and saying it was so cool.  Well many moons later, I can see the aweful special effects, and the obvious mistakes made.  The interesting things about \"B\" movies is that if actors know they are in one; it comes through in their acting.  With this film, they try to act as seriously as possible, which makes it more believable.  For people with a poor budget, they did quite well.  The score is still some of the coolest music ever.  It sets the tone for the film, and encompasses Hawk's mysterious nature.<br><br>As a regular film, it is aweful.  As a \"B\" film, it does quite well.  Cult classic.","user":"crow1701","rank":[31,35]},{"title":"Legendary","rating":8,"date":"27 July 2005","review":"Some would say this film is one of the poorest ever made. They would be correct. However it is also one of the most amusing. Such classic moments as 'a bit falls off the set really obviously' and 'the baddies lair is a skanky old tent', and of course the cheesy sound effect/soundtrack make this a great movie, especially when drunk. To assist this, the Hawk the Slayer Unofficial Drinking Game is as follows: Drink when: Anyone says 'Hawk'; Anyone says 'Voltan'; Every time they show a picture for the backdrop instead of a real set; Every time they use the ridiculous electronic sound effect (first used at the start with the sword); Every time someone dies (can be limited to 3 drinks for a fight scene as its hard to keep count); Every time the crazy disco soundtrack starts up; Every time there are poor special effects; Every time there is a cheesy flashback Every time the top of the set is visible.<br><br>Enjoy!","user":"mattcoulshed","rank":[28,32]},{"title":"A 10+ cult fantasy classic!","rating":10,"date":"18 February 2007","review":"I first saw this movie in 1981 at about 4 o'clock in the morning and I LOVED it. I had some friends staying over at my house for the weekend, we were 12 years old and lived to play D&amp;D. About 2 minutes after the movie ended we all set about creating our own Mindswords and automatic crossbows for our characters. Yes, the acting is truly lame, but in a movie like this, who cares? I've always secretly hoped that there was a sequel made, as they totally left it open for one, but I guess that would be too much to ask for. I have always wanted to find the movie on DVD so I can show it to my nephews, who thanks to me, are also D&amp;D players. The greatest cult fantasy movie ever!","user":"kid_called_quick","rank":[31,38]}]