[{"title":"A Gothic, Noirish, Hitchcockian Masterpiece.","rating":10,"date":"19 January 2011","review":"Helen Capel was rendered mute in childhood due to a family trauma, now she acts as a companion to the bed ridden Mrs Warren. She's currently fretful because a serial killer is on the loose and he preys on women with afflictions...<br><br>Based on Ethel White's novel \"Some Must Watch,\" The Spiral Staircase harks back to the days of the \"old dark house\" thrillers and encompasses a German expressionist sheen. The setting is an old Gothic mansion in New England at the turn of the century. Directed by Robert Siodmak, not one spooky house thriller genre convention has been neglected here. The tension builds amid creaking doors and gates, whistling winds, flickering candles, blowing curtains and cut-aways to the eyes of the unseen lurking madman waiting to add poor Helen to his roll call of victims. Mirrors, windows and shadows feature prominently as craftsman Siodmak spins his uneasy expressionistic web.<br><br>The cast are uniformly strong. Dorothy McGuire gives one of her best and most convincing performances as the under threat Helen. While Ethel Barrymore (nominated for Best Supporting Actress), Elsa Lanchester and George Brent all turn in brilliant performances. But perhaps it's not unfair to say that the real stars here are the technical staff? Siodmak expands his talent and knowing from his work at Universal Pictures (Son Of Dracula/The Suspect), Albert D'Agostino's sets are wondrous period delights and Nicholas Musuraca's deep-focus photography has the ability to make one keep looking over the shoulder to see if something is lurking in the room with us...<br><br>There's quite a few changes in this adaptation from the novel, notably the setting was in England and Helen was a cripple and not mute. But few could seriously argue that The Spiral Staircase in silver screen form is anything but a triumphant piece of classic cinema. 10/10","user":"hitchcockthelegend","rank":[32,36]},{"title":"Visuals Add To Already-Excellent Film","rating":9,"date":"19 October 2005","review":"This was an excellent suspense film with outstanding cinematography and interesting characters played by a strong cast.<br><br>There are lots of complimentary adjectives in the above sentence but the film deserves it, particularly the photography (see this on DVD). The lighting is as good as anything I've ever seen in film noir (this is not a film noir, as one reviewer correctly points out). In fact, outside of David Lean's \"Oliver Twist, \" this may be the best-looking black-and-white film I've seen. A good part of the visual treat is viewing the fantastic Victorian house where most of the action takes place. <br><br>The lead character, played beautifully by Dorothy McGuire, is one the viewer cares about which helps get one involved in the story. All the other characters are fun to watch, and are detailed here in other reviews. I go along with most in saying Ethel Barrymore was the most likable.<br><br>There are a few holes in the storyline, to be sure, but one doesn't care since the film movies rapidly, the story keeps you so involved and the visuals and audio are so interesting. This latter also features the longest thunderstorm on record!","user":"ccthemovieman-1","rank":[63,76]},{"title":"The World Has No Place for Imperfections","rating":8,"date":"13 July 2008","review":"In the beginning of the Twentieth Century, a serial-killer is terrorizing a small town, killing women with imperfections. In the Warren manor, the mute servant Helen (Dorothy McGuire) nurses Mrs. Warren (Ethel Barrymore) who is terminal in bed. The newcomer Dr. Parry (Kent Smith) falls in love for Helen and has the intention to take her to specialists in Boston for treatment for recovering her voice and marry her. When the reckless Steve Warren (Gordon Oliver) arrives from Europe, he stays in the mansion with his mother and his stepbrother Professor Albert Warren (George Brent) and has a brief affair with Albert's assistant Blanche (Rhonda Fleming). When a crippled woman is killed in the town, Mrs. Warren advises Helen to leave the house immediately since she is in danger. When a murder occurs in the mansion, Helen does not know who is trustful to help her to call Dr. Parry to rescue her.<br><br>\"The Spiral Staircase\" is a suspenseful stylish movie, with a magnificent black and white cinematography that follows the German Expressionism and wonderful set decoration in Victorian style. It is impressive the use of shadows and lights in many unforgettable scenes, like for example Blanche in the basement or Helen in the spiral staircase. The beginning is an awesome tribute to the earlier days of the cinema. The performances are excellent and it is impossible to individually highlight any actor or actress. The plot keeps the tension until the very end in this great movie. My vote is eight.<br><br>Title (Brazil): \"Silêncio nas Trevas\" (\"Silence in the Darkness\")","user":"claudio_carvalho","rank":[27,31]}]