[{"title":"Solid Kung Fu action","rating":7,"date":"26 August 2005","review":"The fast pace of the film covers a lot of creaky film making. The plot basically follows the heroine as she attempts to get to her uncle after her husband is killed by the Flying Guillotine Squad. <br><br>What does this film deliver? We get a kung fu heroine whose fighting ability scares all the bad guys. We get gimmick kung-fu weapons galore. We get a brief topless woman kung fu fight (we need more of these). And we get well choreographed fights every 5 minutes.<br><br>The director is not in the same class as Cheng Cheh or Liu Chia Liang but the film never runs out of gas so the occasionally strange direction doesn't gets in the way. The director seems more comfortable with the drama scenes. The film is less grim then \"The Flying Guillotine\".<br><br>A good kung fu film, not a waste of time.","user":"ChungMo","rank":[10,10]},{"title":"Top-tier Shaw Brothers action with mild exploitation elements","rating":8,"date":"21 November 2016","review":"THE VENGEFUL BEAUTY is a follow-up of sorts to Ho Meng Hua's FLYING GUILLOTINE, even though FLYING GUILLOTINE 2 was the official sequel. I've not watched either of those two other movies yet, but I can report that this film is a great deal of fun, a tightly-plotted and exciting action adventure that delivers audience entertainment in spades.<br><br>Ho Meng Hua directed some of the more esoteric offerings put out by the Shaw Brothers (OILY MANIAC anyone?) and this can be added to that category. There aren't a great deal of scenes involving the flying guillotines themselves but there's plentiful gruesome fight action throughout, much of it with imaginative touches (the flying bowls, the plastic masks, the bamboo jumping and wall climbing scenes). Ho Meng Hua has a great eye for visually arresting moments and some scenes, such as the battle in the bamboo forest, bring to mind the later likes of HOUSE OF FLYING DAGGERS.<br><br>Chen Ping makes for a decent and interesting vengeful heroine and her character's pregnancy makes her more unique than some others. Norman Chu is good as the dedicated heroic ally and Yueh Hua has a memorable role too. Good old Lo Lieh is here as the bad guy but as with his other appearances in Shaw movies of this era (such as THE DRAGON MISSILE), the writers respect his standing by giving him a more complex role requiring acting ability rather than just casting him as a stock villain as in his non-Shaw performances. The gory action is the inevitable highlight but there are other strong elements such as the three assassin offspring and the mildly shocking topless nudity. Altogether, THE VENGEFUL BEAUTY is a great little film and one I thoroughly recommend.","user":"Leofwine_draca","rank":[4,4]},{"title":"Sequel to The Flying Guillotine","rating":8,"date":"13 May 2005","review":"This is actually the sequel to The Flying Guillotine and sort of takes up where it left off. The evil emperor is still sending out his henchmen to kill anyone who says or writes anything he doesn't approve of. Most of the henchmen are using swords in this movie but there are still some flying guillotine squads running about.The emperor orders Jun his main killer to get rid of Dooby who's married to Pinky Lee the star of the film. Pinky is 2 months preggers with their kid and a martial arts hottie with the WuDang Clan. She goes on the run after her hubby is killed and has some wild battles (one in the tall green bamboo with flying daggers reminds you where House of Flying Daggers got it all from)until she meets up with Giant Forehead (a guy from her old school same master who has a BIG secret at the end of the film) and MA the guy from the first film who quit the flying guillotine squad and now spends most of his time spinning plates and throwing them into people's necks spurt gush). Both these guys have the hots for Pinky but it's MA who gets to make out with her while they're both topless. Ma also gets some topless action from Jun's daughter before she's killed. After a miscarriage Pinky goes back to kill Jun but not before Jun kills MA leaving Pinky walking off into the credits. Lots of great fights swordplay flying guillotine action and smoldering glances between the two guys and The Vengeful Beauty!","user":"joeshoe89","rank":[5,13]}]