[{"title":"Underrated Hong Kong Feature","rating":9,"date":"31 July 2001","review":"Gong Woo Ching/Rich &amp; Famous(1987) fills some requirements for the epic genre with scenes of grandeur and emotional dramatic content.  The epic quality of this picture helps make it one of the top Hong Kong features of the late 1980s.  Although not an epic in the usual sense because of its duration of 106 minutes, Rich &amp; Famous(1987) still uses the epic form on a few aspects.  The scenes move along on an epic pace.  For a lowbudget movie, the film sure looks lavish.<br><br>\nAlthough Chow Yun Fat on the cover of the video is said to be the leading actor, he really isn't.  One of the few co starring roles for Chow Yun Fat in his post A Better Tomorrow(1986) career.  He giveas a very good performance as Li Ah Chai.  Early in the picture Li Ah-Chai is an arrogant person but towards the end he becomes more humaine.  Li Ah- Chai is the Hong Kong equivalent of Don Vito Corleone.<br><br>\nThe main actors of the film are Andy Lau and Alex Man.  The story of Rich &amp; Famous(1987) revolves around two brothers who join an organize crime group in Hong Kong led by Li Ah-Chai.  About how the two brothers evolve thoughout the feature and go their own separate paths.  Andy Lau is cool as the honorable and loyal Kwok.  Alex Man does an ok job as the overly ambitious and power hungry brother, Tang Kat Yung.<br><br>\nA Tale of Two Brothers is a more apprropriate title for this film.  The personalities of Kwok and Yung are like water and fire in comparison to one another.  At the beginning they have a close relationship but by the end they grow apart.  Kwok is someone who would risks his life for people he cares for.  Yung is someone who always gets himself and others into deep trouble.<br><br>\nGong Woo Ching/Rich and Famous(1987) was part of a giant craze in the gangster genre for Hong Kong cinema.  Rich and Famous(1987) and its sequel Tragic Hero(1987) are two of the top twenty five films of the Heroic Bloodshed sub genre.  Some of the cast members had appeared in countless Heroic Bloodshed pictures.  Overshadowed by the more flashier flicks of the popular sub genre in HK cinema.  Only recently has this film begun to get noticed with the continued success of Chow Yun Fat in the cinema.<br><br>\nMore of a dramatic piece than an action crime thriller.  The action is spriinkled throughout Gong Woo Ching(1987) in small portions except in a couple of sequences.  Its sequel, Tragic Hero(1987) is a more action and gun battle orientated motion picture.  Gong Woo Ching(1987) should be watched with plenty of patience because there are more slow moments than fast. The dramatic content is what makes it into a Godfather inspired pic.<br><br>\nThe big action scene comes in the middle of the flick.  The moment when Chow Yun Fat comes out shooting with an Uzi in each hand does he remind viewers of his action antics in A Better Tomorrow(1986).  This sequence is one of three highlight scenes for Rich &amp; Famous(1987).  Starts out slow and ends with a bang.  Its not a flamboyant or flashy action scene like in some Heroic Bloodshed pictures.<br><br>\nThe tragic hero of this story is Mak Ying Hung played by Alan Tam.  This character is greatly misjudged by Li Ah-Chai in the first half.  Mak Ying Hung is played with heart and pathos by Alan Tam.  He proves himself to be a hero by sacrificing himself to save his friends.  The two best acting performances goes to Alan Tam and Andy Lau.<br><br>\nThe direction is average which prevents Rich &amp; Famous(1987) from being a masterpiece.  Weddings in Hong Kong films appears to be synonymous with death.  Carina Lau gives a very good performance as the beautiful and strong willed Lau Po Yee.  Danny Lee is memorable in his sterotypical role of the honest and relentless Policeman.  Would have benefited from having more scenes with Danny Lee because his performance is really good.<br><br>\nOne of a handful of very good and substancial films done by the prolific and average film maker, Taylor Wong.  Its nice to see Shing Fui On in a non villainous role in a Hong Kong film for a change.  An underrated motion picture it is does not mean its a great film.  The flawed areas are overcomed by the good parts of the film.  Gong Woo Ching/Rich &amp; Famous(1987) features some low key and strong performances by most of the actors.","user":"eibon09","rank":[6,7]},{"title":"Pretty good","rating":2,"date":"2 August 2000","review":"As a fan of Chow Yun-Fat and Hong Kong-movies I saw \"Rich and Famous\" yesterday, and I thought that it was pretty good.  The movie wasn`t as good as \"The Killer\" and \"Hard Boiled\"(both 10/10), but then nothing is.<br><br>\"Rich and Famous\" had what I like about Hong Kong-films, namely cool characters and well-choreographed action, but it wouldn`t hurt this movie if it had more action.<br><br>A pretty good film, and Chow Yun-Fat is cool as always. 7,5/10","user":"action-6","rank":[3,4]},{"title":"\"...An entertaining and watchable addition to the genre...\"","rating":9,"date":"14 April 2005","review":"\"Rich and Famous\" is a slow-moving but character driven Triad drama from director, Taylor Wong, very much created in the style of other Wong titles such as \"Triads: The Inside Story\".<br><br>Kwok (Andy Lau), his brother (Alex Man) and some of his friends begin working for local Triad kingpin Li-Ah Chai (Chow Yun-Fat) to eradicate their debt problems. They gradually become more deeply involved with Chai's activities and the goings on within the Triad organization. But problems begin to arise when Tang Kat-Yung, Kwok's brother, begins plotting his own schemes away from Chai and moving towards the company of Chai's enemy, \"Big Eye\" (Lam Chung).<br><br>Taylor Wong creates a very familiar plot here, using all the familiar Triad clichés. Yet he manages to construct a film which is still entertaining, tense, and maintains audience interest. His detached, almost documentary style direction, passively observing the characters, is used once again. The interesting aspect of this style is that it does not generally create an opinion for the viewer but instead presents the characters in their normal states and allows the viewer to decide who is good and who is bad. Nevertheless, the slightly formulaic structure is redeemed somewhat by an excellent ensemble cast. Chow Yun-Fat, Andy Lau and Alex Man all give strong performances, while Shing Fui-On, Pauline Wong and Danny Lee provide powerful support. Danny Lee is in fact on screen far less than one would expect and only really appears in two or three scenes. However, his minor role is actually expanded by his vibrant and colourful depiction of the determined cop.<br><br>Overall, although lacking in originality and inspiration, \"Rich and Famous\" can still be described as an entertaining and watchable addition to the genre and deserves to be seen by all HK film fans.","user":"fourletterfury","rank":[3,5]}]