[{"title":"Never pauses for breath...","rating":10,"date":"6 October 2004","review":"What a movie!<br><br>I literally could not believe how great this movie was once I'd seen it for the first time. After a short intro we are thrust directly into the action and from there on in, it's one thrilling set-piece after another.<br><br>We go from kidnapping to assassination, to car chase, to discovery of plot, to escape from a hotel, to a twist regarding the leader of the enemy, to a wonderful sequence with a hired bodyguard who is in fact an assassin, to a fake kidnapping set up by the heroes, to torture scene, to rescue, to plane crash at sea...<br><br>It's dizzying that this was all intended for one film and when the end credits rolled you really felt like you'd got your money's worth. If I'd have watched this movie when it came out in the forties, I would have praised Hitchcock all night for giving me ten superb movies in one for my dollar.<br><br>In short (although you can hardly call these ramblings short) check this movie out. If you're a fan of escapist, thrilling adventures populated by superb characters (see George Sanders as ffolliot, and Robert Benchley as Stebbins) you will be delighted. This is one of Hitch's lesser seen gems and deserves to be rediscovered without delay","user":"adishavinfun","rank":[80,93]},{"title":"Entertaining, Exciting, and Masterfully Constructed","rating":25,"date":"25 May 2001","review":"While not as well-known today as some of his later films, Alfred Hitchcock's spy thriller \"Foreign Correspondent\" is entertaining, exciting, and masterfully constructed.  Though lacking the star power of some of the great director's more famous movies, the cast is very good, the settings are wonderfully conceived, and the story and writing keep the viewer's attention at all times.  It has everything we hope for from Hitchcock: action, suspense, and a good dose of humor.<br><br>The plot is a complicated one, beginning when American reporter Johnny Jones (Joel McCrea) is sent to Europe just before the outbreak of World War II. Expected to send back news about the possibility of war, Jones stumbles across an espionage ring that is using kidnapping and murder in an attempt to get important government secrets for use in the coming war.  The action goes from England to Holland and back to England, with Jones constantly escaping from danger as he tries to get the details of the spy plot for his newspaper.  It does take some effort to follow everything that is happening, but there are many action sequences and a lot of good writing - with many fine touches of humor - that make it easy to pay attention.<br><br>In the lead role, McCrea performs with the easy-going understatement that typifies the heroes of Hitchcock's earlier films.  Laraine Day is pleasant if unspectacular as McCrea's romantic interest, whose father (played nicely by Herbert Marshall) is also one of the key figures on the international scene.  The supporting cast also has some fine actors.  George Sanders for once gets to play a good guy, Robert Benchley is very funny as McCrea's fellow foreign correspondent, and Albert Basserman is touching as an old diplomat who has seen too much of the world's troubles.<br><br>But it is the action sequences and the settings that really make the film. Hitchcock's expert hand can be seen in almost every setting, and he displays a wealth of creative ideas here equal to any of his films.  Particularly good are the memorable windmill scenes and the exciting climactic sequence in mid-ocean.  This final sequence is not only thrilling, it also perfectly completes all of the film's action and themes.<br><br>\"Foreign Correspondent\" contains plenty of excitement, humor, and suspense, along with some of Hitchcock's best set pieces.  It is highly recommended.","user":"Snow Leopard","rank":[60,70]},{"title":"Thrill Ride On A Mission","rating":9,"date":"12 August 2006","review":"Alfred Hitchcock directed many great movies, but few testify to his ability at marrying suspense, action, and comedy as does \"Foreign Correspondent,\" a film which coincidentally carries Hitchcock's boldest political statement: That neutrality doesn't work when others are bent on war.<br><br>Joel McCrea stars as American newspaperman Johnny Jones, sent to Europe on the eve of World War II by the newspaper's publisher precisely because he's a man of action unschooled in politics and economics, \"someone who doesn't know the difference between an 'ism' and a kangaroo,\" the old publisher declares. Jones goes along with the idea, even with changing his byline to the pompous \"Huntley Haverstock,\" because as he puts it, \"give me an expense account, and I'll cover anything.\" Fate intervenes when a photographer apparently murders Europe's last hope for peace right in front of Jones, spurring the reporter to react in a way that leads to a series of outrageously precarious and double-crossing incidents culminating in a plane crash-landing into the Atlantic Ocean.<br><br>Hitchcock arrived in the U.S. with a flourish, his first Hollywood movie being the Oscar-winning \"Rebecca,\" and this his second that same year, 1940. Some back in Great Britain complained Hitchcock's leaving his native country as it faced Hitler all alone was desertion, but Hitchcock was doing all he could for King and Country, as \"Foreign Correspondent\" pulls all the stops to shake American viewers from their neutrality.<br><br>That sort of desperation would ruin most films, but here it only prods Hitchcock to singular and repeated acts of inventiveness as he shakes the tree. We see Jones climb out the window of the Hotel Europe, knock out the letters \"EL\" to underscore the film's message, and find his way into the hotel room of the girl he has been trying unsuccessfully to woo. There's an assassination in the rain and shot from above so we see little more than wet hats and umbrellas, and a long sequence inside a creaking windmill that has you thinking our hero's about to be discovered by the bad guys every 20 seconds. The film feels more vital for sequences like this: You can't imagine anyone trying to get away with this, yet Hitchcock keeps pulling it off.<br><br>Then there's the other revolutionary element of the film, its humor, ever-present throughout the picture in a way that doesn't cut against the grain of the suspense so much as amplify it, by keeping you off-guard and invested in the action. This is best exemplified by Edmund Gwenn's plummy turn as an evil assassin (no spoiler, he's introduced to us that way) bent on killing Jones, but so affable and borderline-snarky in his menace you can't root against him as much as you'd like to. As Gwenn's Rowley leads Jones up a church steeple to set up an accident, you wonder how Jones will get out of it but still chuckle at how Rowley tries to keep Jones from going back down: \"You must see the 'orse guards!\" Gwenn is one of two fantastic examples of reverse casting, the other being George Sanders as a good guy named ffolliett.<br><br>Hitchcock is very careful in presenting the bad guys. He never says they're Germans, though the implication is obvious. The chief baddie is ruthless but not without decent impulses, in a way that mirrors but goes beyond Willy in his later \"Lifeboat.\" Hitchcock knew when the film was released, he would be attacked by those who wanted to keep appeasing Germany. For \"Foreign Correspondent\" to be successful, it needed to bring the audience along without noticing the ride, laughing with and pulling for Jones right up until the moment he does a radio broadcast in London while bombs burst around him, an eerie foreshadowing of what Edward R. Morrow would be doing for real only days after \"Foreign Correspondent\" opened in theaters.<br><br>You can't help but admire a film that was on the right side of history, but \"Foreign Correspondent\" may play better now than it ever did because of the way its pure cinema techniques work today, a style Tarantino and Leone admirers will no doubt recognize and appreciate, but that anyone can enjoy.","user":"slokes","rank":[53,63]}]