[{"title":"Two Great Stories of Wartime Poland","rating":9,"date":"19 August 2002","review":"I personally think you have to be Polish or have studied a great deal of Polish history during World War II and, perhaps, the cultural history of Poland to understand everything in this film. But, it is a set of brilliant dark commentaries on men in time of war. In our first film, Scherzo alla Polacca, a man runs away from his duty during the Warsaw Uprising. He has been a selfish man and does not adapt well to sacrifice, but he reluctantly makes an attempt to do something for the cause without much real effect. This is dark comedy at its best and pokes fun at Hungarians as well as poking fun at opportunists during wartime.<br><br>Our second film, Ostinato Lugubre, tells the story of a group of Polish Officers encamped in a German Prisoner of War camp and details the everyday life of the men as they deal with their feelings, lack of privacy and their affection for one man who escaped. Did he really escape? This is the plot point that holds this story together so well. We witness brilliant acting and a deeply moving script.<br><br>This is considered one of Munk's great masterpieces and deserves a chance to be released on video. This was part of a festival at the National Gallery of Art in Washington.","user":"nbott","rank":[18,20]},{"title":"Laughter in the Dark","rating":8,"date":"4 January 2007","review":"A fascinating contrast with many other Polish films about the Second World War. This film consists of two separate stories. One, Scherzo alla Pollaca, set in the Warsaw rising, features an venal, opportunistic character- a former black-marketeer, it's made plain- who becomes a hero in spite of himself. None of the characters are very sympathetic, none are very villainous- the \"hero's\" wife flirts with a handsome Hungarian officer, the Hungarians want to change sides at the right opportunity, the Polish resistors practise drill in an air raid, a German soldier hauls the \"hero\" out of a refugee column just to make him carry an old woman's worthless possessions, a German tank creeps up behind the hero to surprise him by a canal and then goes away, raucous laughter echoing from its hull. In the end, even though the rising is defeated and his messages pointless, the hero leaves his penitent wife and returns to Warsaw and probable death.<br><br>The second part, Ostinato Lugubre, is ostentatiously grimmer. Set in a PoW camp in the Alps in the winter of 1945, two new prisoners, from the Polish Home Army, are admitted. Everyone else in the camp has been there from 1939 and they have been psychologically deformed by captivity and the constant presence of others. The camp has one hero, Zawistowski. who escaped and so saved their honour. The only trouble is, he didn't escape but hid from the Gestapo in the hut roof, where he is slowly dying. His friends feed him inadequately and hide his coughs by distracting the others. The other officers grate against one another- shut themselves away, literally or mentally, enforce absurd prewar customs, make insane wagers with one another. In the end, Zak, one of the most disturbed of them all, walks out of the hut in an air raid and is shot by a guard and Zawistowski dies in the hut roof. One of his friends, an artist, arranges for his body to be taken away hidden in the hut's boiler so that no more of the prisoners know he did not escape.<br><br>Both stories are presented as meaningless and futile anecdotes and both could as easily be comedies or tragedies. The second one, especially, has Munk's fascination with faces looked at close to, is more typical of the way we see him.","user":"allenrogerj","rank":[11,12]},{"title":"Eroica-A masterpiece by Polish director Andrzej Munk which shows that heroism is not a virtue for some people in times of war.","rating":10,"date":"16 January 2016","review":"Most people associate war with suffering as no war is devoid of untold misery.It is for this reason most works of art are created with a serious approach in order to understand human suffering which has taken place during the times of war. However, there are some exceptions too. These works have approached war in a lighter vein as the idea in these works has been to reveal the strange mechanisms of human mind. Polish director Andrzej Munk's classic film 'Eroica' is one such work of art wherein war is treated from a comical point of view. His film does its best to provide good laughter through its two sketches which depict Polish people who were caught in war when Nazi Germany attacked Poland. In the first sketch, 'Scherzo Alla Polacca', heroism is completely avoided by an innocent army man who decides that he would like to live at all costs. This episode is funny as it shows how a common man is ready to pay any price in order to stay alive including pardoning his wife who was involved in an affair with an army general. The second sketch, \"Ostinato Lugubre\" doesn't have any trace of slapstick humor but is able to garner some laughter by depicting amusing antics of a group of captured Polish army officers who hanker continually after cigarettes and food. This episode is more serious in nature due to its depiction of two deaths. However, some viewers might have a good laugh at the vain efforts made by these officers to get hold of glory when there is nothing to be had. Eroica seems to suggest that heroism might be a virtue for many but there are many who don't want to make a mess of their lives by pursuing it in vain. However, the danger is that the voices of this silent majority is not heard. It is hoped that after watching 'Eroica', viewers would change their perceptions about this silent minority.","user":"FilmCriticLalitRao","rank":[6,6]}]