[{"title":"If you want to be totally enthralled for two hours just watch 'Rebecca'!","rating":8,"date":"8 July 2004","review":"Hitchcock felt 'Rebecca', his first Hollywood film, was a compromise, but as a viewer I just can't fault it. It's a masterpiece in my opinion, full of suspense, mystery and brooding atmosphere. It's also one of the most romantic movies I've ever seen. I've watched it several times over the years, and even now that I know all the plot twists and turns (quite shocking on your first viewing), it never fails to hook me in. One of the reasons it really works is the flawless casting. I'm not much of an Olivier fan but he's superb as de Winter, with just the right mixture of charm and coldness. And Joan Fontaine is just perfect as de Winter's new bride. I can't spot an unconvincing moment in her performance and can't imagine any other actress in the role. Hitchcock subsequently used her in 'Suspicion' with Cary Grant. She was also excellent in that but 'Rebecca' is a much stronger movie. The supporting cast also includes some brilliant performances, especially Judith Anderson ('Laura') as the extremely creepy Mrs. Danvers, George Sanders who plays Rebecca's slimy cousin, and Nigel Bruce in a typical role as de Winter's bumbling brother-in-law Major Lacy. Sanders subsequently worked again with Hitchcock in 'Foreign Correspondent', and Bruce played Cary Grant's lovable pal \"Beaky\" in 'Suspicion'. I sometimes think that Hitchcock's 1940s movies are overlooked by many because they are regarded as being too \"old fashioned\", but for me movies like 'Suspicion', 'Saboteur', 'Lifeboat' and 'Spellbound' are some of the most entertaining movies Hitchcock ever made, and 'Rebecca' is the best of the lot. If you want to be totally enthralled for two hours just watch 'Rebecca'!","user":"Infofreak","rank":[134,172]},{"title":"What Atmospheric Gothic-horror Should Be.","rating":10,"date":"5 March 2005","review":"Alfred Hitchcock was and is still the undisputed Master of Suspense, and there is a lot of that here in his foray into Gothic horror, as the mystery surrounding the unseen yet omnipresent Rebecca will engage the viewer from its dreamy start to its bleak conclusion. This is exactly what atmospheric is supposed to be about, and in black and white, it shines. This is also what Gothic horror is in essence, and many have imitated yet come up short, most notably M. Night Shyamalan who, in trying to go for a shock twist and purported \"atmosphere\" only creates a bad aftertaste and a hangover the size of Mount Everest. This is, essentially, Hitchcock's first true masterpiece.<br><br>Not one performance rings false, not to the novel or to their respective interpretations. Lawrence Olivier, quite possibly one of the greatest actors that ever lived, portrays a broken man who still lives haunted by the past as he himself were still living in that unending hell. Judith Anderson embodies one of the most coldly sadistic figures in cinema history, her smooth and elegant truculence only exceeded by Anthony Hopkins' rendition of Dr. Hannibal Lecter. One can't seem to understand the way she wallows in her dead mistresses' clearly perverse nature, but that exactly she does, right down to her own end. George Sanders does what he does best: sneer, smirk, and spit line after line of practiced venom, and would be honored 10 years later in ALL ABOUT EVE. Gladys Cooper, still striking in her 50s, plays into her casual cattiness which means no harm, although her rendition of Beatrice Lacy is a little subdued from the novel's version.<br><br>And then there is Joan Fontaine. Not one of the best actresses on film, yet here, playing a role that evolves beautifully from a frightened, weak girl who is put into a situation she does not understand and who turns right at the point of losing it into a much more mature, strong woman capable of holding her own, she carries the weight of the entire drama and comes forth with flying colors. While I would have preferred Anne Baxter who would have been the exact right age for this role, Fontaine exudes so much restraint and nervousness about her character (partially to blame Olivier's treatment of her and Hitchcock's telling her the entire cast hated her), it's almost a relief when she finally decides to confront Olivier about what it the secret of Manderley. Not many roles require such a change and not many actresses would sink her teeth into a part that requires being put-upon until she can't stand no more, and this is one beautiful performance.<br><br>A movie that should have won more Oscars that year, REBECCA has since grown in stature and proved that a film need not trophies to be Timeless and Great.","user":"nycritic","rank":[115,148]},{"title":"A Wonderful Film","rating":11,"date":"11 October 2000","review":"This is one of my favorite movies of all time. Definitely my favorite classic. There are some that come close, such as Citizen Kane, Spellbound, and Psycho, but none quite compare to this amazing movie.<br><br>The first thing that you notice is the outstanding cinematography. You have to remember that this movie was made in 1940, when they didn't have the technology we have now. But that first shot of the water beating up against the rocks grabs you and for one split second you wonder if maybe this isn't part of the movie but rather something filmed just recently. But then you see the familiar face of Laurence Olivier, reminding you that this was made 60 years ago, a fact that forever amazes me. The only oscar it won besides Best Picture was well deserved.<br><br>Another thing that makes it such a wonderful film is the acting. I have debated on whether Laurence Olivier's character, the tortured Maxim de Winter, is the pitiable character or if his second wife played by Joan Fontaine is really the one to feel sorry for. Every time I watch it I see it from a different point of view. Joan Fontaine is excellent. Laurence Olivier is wonderful, but that's no surprise. The only thing that bugs me is that it seems in every movie he's in (well, at least, everything I've seen him in), he always plays the same type of character.  But he's extremely good at it, so I suppose it doesn't matter.<br><br>But although Joan Fontaine and Laurence Olivier are wonderful, Judith Anderson steals the show! The first time I watched the movie, I was immediately grabbed by her stunning performance as the sinister Mrs. Danvers. You hardly notice the other characters when she's in the scene. She acted the part so well that it's strange to imagine that she was any different in real life.<br><br>With a wonderful storyline, and a very surprising ending, Rebecca well deserves the title as the only of Hitchcock's films to win the oscar for Best Picture. Although it may not be the most famous of all his films, it is without a doubt the greatest","user":"sundae","rank":[107,143]}]