[{"title":"Go buy this DVD right now!","rating":10,"date":"26 September 2005","review":"It's very telling that I had to look 15 pages deep into the user comments to find one negative review of this movie. And the negative reviews were from insufferable snots.<br><br>This movie made me laugh as a teenager, but it also makes me laugh as a fully grown adult. Does that mean the humor is dumb or sophomoric? Not necessarily. What exactly is \"adult humor\" anyway? Does it necessarily need to contain graphic depictions of sex and generous uses of profanity to be considered sophisticated and adult?? I contend that it does not, and I cite UHF as an example.<br><br>The laughs here are genuine, and they come from lack of pretentiousness and an honest feeling that one need not take oneself too seriously at any given moment. Al lets us know that it's OK to make fun of yourself as well as the rest of society. Much of what he does is self-deprecating, and UHF is no exception. He doesn't stand around making fun of others and establishing an air of superiority over the rest of society. As George Newman, he becomes the everyman, infusing much of his own personality along with his on-stage comedic persona. And he's not afraid to kick himself around and then proceed to pull himself up via his own bootstraps. Nobody else has to be hurt.<br><br>Plot has never been a big necessity in these spoof/parody movies. \"The Naked Gun,\" \"Airplane,\" \"Top Secret,\" \"Johnny Dangerously,\" and many others have had the most skeletal of plots. Cop must find and bring to justice bad guy who shot his friend. Burned out ex-pilot must save aircraft when crew dies. Rock and roll star must overthrow Nazi plot. Mobster must overcome those who wish to take him down. And in \"UHF\" we have Loser Man must save TV station from evil network exec. The plot is not important; it's just a vehicle to get us from laugh to laugh and set up the next joke.<br><br>UHF's comedy, though basic, rings true, and if you'll drop all of your pretentious airs, you'll get it. (We all know you're not nearly as sophisticated as you think you are anyway.) Who among us can keep from laughing while Raul teaches poodles to fly? Who can stifle a chuckle when Stanley is doing... well... doing just about everything he does in this film? Al admits in his commentaries and interviews that \"UHF\" is no \"Citizen Kane.\" But that's the beauty of it. There's nothing complex here. It's all about the laugh, and there's where this movie really scores.","user":"velcrohead","rank":[66,76]},{"title":"Programming for all to enjoy, and it ain't even sweeps","rating":7,"date":"2 July 2002","review":"Weird Al Yankovic's only excursion into film making proved to be a solid effort on his part. With an off-beat story such as this, the frizzy haired patron of pop polka proves his acting is adequate enough to carry a film such as this. While I feel there could have been more Weird Al songs, the comedy wasn't lacking. Michael Richards had his best role ever as Stanley Spadowski the janitor. All of the children's show sequences were hilarious. While this film isn't for all, it was certainly a movie which I can enjoy on many occasions. 6.8/10","user":"Agent10","rank":[37,46]},{"title":"Comedy at it's best!","rating":10,"date":"20 July 2000","review":"This is probably, by far, the only movie I've seen that really makes me laugh more and more every time I see it. It's one of the only comedies that has good, clean humor. The whole movie is just a joke itself, a mix of original jokes, and many parodies. Michael Richards is perfect as Stanley, the Janitor. Weird Al is his usual comedic genius, who is also perfect for his role as the manager of 'U62'. For anybody who's in for a night full of laughs, UHF is definitely for you. A comedy masterpiece, 10/10!","user":"firehawk15","rank":[50,64]}]