[{"title":"Carol Lynley looking gorgeous in those mini skirts","rating":10,"date":"31 December 2011","review":"I just got the Man From U.N.C.L.E. collection for Christmas. I have seen the movies before and knew they were all really good. I had forgotten how good the action, stories and humor are in the films. All 8 films are basically 2 part shows from the series. A few of the earlier films added some extra footage for the theatrical release. Solo &amp; Illya are wonderful as always, especially Illya. I like David Mccallum a lot because he seems to be a real good guy in real life. I cannot finish the review without mentioning Carol Lynley. She never looked more beautiful in any show or film. And as another reviewer said, she wears some really short mini-skirts. She has maybe the best pair of legs in show business. Check her out in Once You Kiss a Stranger. It's available on the Warner Brothers Archive Site. She walks around in a green bikini for a good part of the film. She showed that she has a great looking body from top to bottom!","user":"RogerMooreTheBestBond","rank":[6,6]},{"title":"\"Hard-hitting spin off from the classic Man From UNCLE series\"","rating":8,"date":"28 August 2003","review":"Napoleon Solo and Illya Kuriyakin hire notorious safe cracker Luther Sebastian (Bradford Dillman) who helps them recover a Thermal Prism from a crazed scientist in Iran. However, Sebastian is the leader of a mystic cult called \"The Third Way\" who believe that they will inherit the Earth when their elderly leader (John Carradine) speaks for the first time in twenty years. Sebastian steals the weapon for himself along with a United States government rocket so that he can launch the prism into orbit and demand that the \"Third Way\" have control of the world. Solo and Kuriyakin race against time to prevent the megalomaniac Sebastian for fulfilling his evil designs.<br><br>THE HELICOPTER SPIES is the seventh big-screen spin off from the popular MAN FROM UNCLE spy series. It was compiled from a season four two-part episode called THE PRINCE OF DARKNESS AFFAIR. However, in the countries where it was released theatrically, the TV version wasn't transmitted thus making it a completely new story for the overseas market.<br><br>After the clumsy slapstick antics of THE KARATE KILLERS (see my review), THE HELICOPTER SPIES marked a welcome return to form with director Boris Sagal bringing a hard hitting approach to the nonsensical material. The pace is fast and entertaining and there are some fine action scenes including the theft of a rocket from a train involving some neat work with helicopters. Bradford Dillman makes a great villain while Robert Vaughn and David McCallam are their usual impressive selves as Napoleon Solo and Illya Kuriyakin. The only downside is that the low budget occasionally shows.","user":"jamesraeburn2003","rank":[5,5]},{"title":"Spoilers","rating":21,"date":"21 October 2000","review":"This has got all my favourite bits and quotes in it. The disciples of The Third Way doing a mini-skirted dance to a psychedelic 60's back drop. Mr Waverly doing his usual stilted delivery probably from queue cards. The MFU series always had great villains. Who could forget Jack Palance yelling \"Miss Diketon!\" And constantly wiping everything with a hanky before use? Here the underrated Bradford Dillman (the 'legend in his own mind' Briggs in the Dirty Harry films) gives his all as Alexander. He's about to end the world when he gets an unctuous call from his wife. \"I guess everybody knows now, my wife just doesn't understand me\" he says. Another favourite is \"I like the way you said that, it gives an air of efficiency. Keep it up!\" Another villain in a top secret bunker is having women problems as well. \"Never trust a women whose always on time, it's always a sign of a much deeper problem\" he muses. Carol Lynley sums up the whole opus while about to be fiendishly drowned: \"You know, you people are really strange!\" But the minor serfs have their moments too. Napoleon Solo has his hair dyed white so as to infiltrate the disciples of The Third Way and the leader takes a shine to him. They are about to embark upon a crazed mission to steal a nuclear missile.\"You'll still have to ride in the back with the others, I can't show favouritism\" he tells Solo. They are convened at a cafe owned by the leader's mother. \"Ma, soon I'll be able to take you away from all this\" he tells her tenderly. \"But I like it here\" the old rat bag protests. \"Yeah, I know, ma\" the leader replies, shaking his head wearily and walking off to his destiny leaving the camera to track into ma's face to deliver her immortal line:<br><br>\"Creeps!\"","user":"Gary-161","rank":[5,5]}]