[{"title":"Okay, One Of Clint's Mokey Movies, But Still Pretty Funny","rating":7,"date":"13 August 2005","review":"If any animal deserved its own trailer, chauffeured limousine and personal trainer, it would be Clyde.<br><br>\"Any Which Way You Can\" proves once and for all the similarities of ape to man (and in some cases, the ape's superiority).<br><br>Basically, this movie is a great improvement over the stillborn humor of \"Every Which Way But Loose\". Clint wisely plays straight man to Clyde, who provides the funniest moments, when not befriending William Smith (\"Big Bill\" Smith from the old biker movies. Go look it up.), then engaging in a bare-knuckle fight with him later on.<br><br>Everyone fares better in this movie, in fact. Sondra Locke is far more graceful, Geoffrey Lewis gets more laughs, even Ruth Gordon is seen as the next Bo Derek (bless her heart).<br><br>And if the Black Widows aren't more menacing this time around, well... that's kind of hard to do when you're wearing fake wigs and have penciled-in facial hair.<br><br>I've seen this movie so many times myself, that I have nearly the entire screenplay committed to memory. What more indelible impression could a filmmaker want to make than that?","user":"gottogorunning","rank":[28,30]},{"title":"The Further Adventures Of Clint And Clyde","rating":6,"date":"8 March 2010","review":"Clint Eastwood fans will correct me if I'm wrong, but I believe hes only venture into screen'comedy are Every Which Way But Locse and its successor film. This isn't the kind of stuff that Cary Grant would have been doing, but the two films do keep with Clint's macho screen image and allow him to slug a few people with some laughs in between.<br><br>Nearly all the characters from Any Which Way But Loose are back in this film Any Which Way You Can. Clint is once again Philo Beddoe who works part time hauling away wrecked cars, but makes his real money in the illegal bare knuckle prize fight racket. Clint lives in southern California, probably in a place not unlike Carmel, California where he was mayor. He lives with his mother Ruth Gordon, his partner in auto collision work Geoffrey Lewis and his pet orangutan, Clyde.<br><br>The last film ended with Clint not winning Sondra Locke, the country singer he lost his heart to. But Sondra's back now and when Clint wants to back out of a bare knuckle fight with reigning eastern champion William Smith because he's tired of the racket, the gangsters backing the fight kidnap her to force him to go through with it.<br><br>As in the last film, Clyde the orangutan gets the lion's share of the laughs. The sex life of the orangutan gets even more screen time, Clint and Geoff Lewis don't just find a zoo with a female orangutan in it for Clyde to mate with, they actually get him an adjoining motel room with Clyde and his lady love in one room and Clint and Sondra in another.<br><br>William Smith has the most interesting part in the film, usually he's a thoroughgoing bad guy in his films, but in Any Which Way You Can he's got a sense of honor and fair play, much to the distress of Harry Guardino and the rest of the gangsters backing the fight.<br><br>Any Which Way You Can has the same sense of rollicking lowbrow comedy that the first film has, maybe more so. As Clint Eastwood moves into his eighties maybe he'll try comedy again. He'd be one great grumpy old man as he proved in Gran Torino.","user":"bkoganbing","rank":[10,10]},{"title":"Guilty Pleasure","rating":12,"date":"12 November 2001","review":"This movie is one my guilty pleasures. I enjoy it a lot, but I know deep down that I shouldn't. I guess the reason I like it is because it has a unique gallery of characters. You've got bare knuckle fighters, a bald biker gang, underworld crime figures, a befuddled couple on their second honeymoon, corrupt state troopers and not one, not two, but three perverted motel managers. On top of all them, the best character in the movie is an orangutan named Clyde! I also like the exciting fight scenes, particularly the climatic fight, well staged in Jackson Hole, Wyoming. It is the rare sequel that is far superior to the original. For many, that is not saying much but it is enough for me.","user":"subcityii","rank":[8,8]}]