[{"title":"A successful marriage is usually based on what a husband and wife don't know about each other.","rating":7,"date":"4 March 2008","review":"An interesting and divisive film noir thriller directed by Otto Preminger and written by Ben Hecht (under the blacklist pseudonym Lester Barstow) and Andrew Solt. Adapted from the novel \"Methinks the Lady\" written by Guy Endore, the film Stars Gene Tierney, Richard Conte, José Ferrer, and Charles Bickford. Arthur C. Miller is the cinematographer and David Raksin, under the watchful eye of Alfred Newman, provides the music.<br><br>The plot sees Ann Sutton (Tierney), the wife of a successful psychoanalyst (Conte), arrested for shoplifting since she has some kleptomania issues. Just when it seems Ann is about to be thrust into a world of scandal, she is saved by smooth-talking hypnotist called David Korvo (Ferrer). Korvo, however, is not what he seems to be, and Ann soon finds herself involved in blackmail and murder and her marriage on the brink of collapse. Confused and emotionally torn, Ann is unsure whether or not she has committed a crime. It looks bleak unless her husband or the police can get to the bottom of the murky mystery.<br><br>Combining a psychological thriller core with overt melodramatics, Whirlpool has still to convince many of the film noir hoards as to its worth. Some critics find the concept of the story silly and hard to take, whilst others have gone a step further to suggest that Preminger and Hecht have merely remade Hitchcock's Gregory Peck starrer Spellbound (Hecht on screenplay duties there too) from four years earlier. Either way, and putting a noirish sheen on a Hitchcock movie is no bad thing by the way, Preminger's movie is a compelling little piece of cinema. The central theme of hypnosis as a weapon gives the film a dark edge and Preminger nicely portrays a world containing sympathetically flawed characters. While in the form of Ferrer's oily slick Korvo, film noir gets a most intriguing Mabuse/Freudian like villain of high entertainment value.<br><br>Tierney doesn't have to do much here, asked to portray confusion and a almost constant state of hypnotism, she delivers well enough whilst always remaining innocently sexy. Conte's woodenness as the husband oddly benefits the story, while also worthy of a mention is the ever watchable Charles Bickford as Lt. Colton, a thinking man's copper, Bickford keeps it serious as the daftness of the plot threatens to submerge and unhinge the drama.<br><br>Frowned upon by big hitting American critics, the film found support from notable Frenchies Rivette and Godard. It seems that like myself, they also liked the quirky and creepy nature of the beast. 7/10","user":"hitchcockthelegend","rank":[20,20]},{"title":"Psychology/Astrology . . . predators of human weakness?","rating":26,"date":"26 January 2005","review":"Part psychological drama, part film-noir. The beautiful wife of the famous psychoanalyst Dr. William Sutton, gets caught stealing an expensive pin from a department store. The infamous astrologer David Korvo comes to her aide but for a price. Through hypnosis, Mrs. Ann Sutton will unconsciously become a party to an elaborate scheme involving murder. What's most interesting about this film is the relationship between psychology and astrology. Are they both pseudo-sciences? Psychological tricksters preying on the weaknesses inherent in the human psyche? Mrs. Sutton suffers from the condition Kleptomania, but is caught between the patriarchal righteousness of her husband, \"Stay as you are, as you've always been - healthy and adorable\" and the cold cynicism of Mr. Korvo, \"A successful marriage is usually based on what a husband and wife don't know about each other.\" Both Dr. Sutton and Mr. Korvo are bright guys adept at exploiting human weakness in others (especially Ann's), but both fall prey to a shared weakness: wounded vanity. An interesting film that is well worth watching. Jose Ferrer as Korvo is a standout but Gene Tierney seems to have lost her fire and ends up sleepwalking through the film, even when she is not hypnotized.","user":"stephen-357","rank":[34,37]},{"title":"Interesting Noir Finally Makes Its Way To DVD","rating":9,"date":"27 March 2006","review":"This film has been unavailable for so many years, so to finally have it on DVD is great. It is an unusual film noir from Otto Preminger and his favorite leading lady, Gene Tierney, who had starred in his classic \"Laura\" and whom had just completed her maternity leave when production began on \"Whirlpool\".<br><br>Tierney gives a fascinating performance as Ann Sutton, the beautiful wife of a prominent psychiatrist (Richard Conte) who suffers from kleptomania but who will do anything to conceal this. When hypnotist David Korvo (Jose Ferrer, very menacing here), gets her out of a jam with the local authorities due to her shoplifting tendencies, he decides to use it as a form of blackmail against her in order to use his hypnotizing skills on her. He gets her to perform all kinds of shady deeds, while succeeding in getting her conscious mind to suppress it. She is strangely drawn to him, while her dumbfounded husband can come to only one conclusion - that she and Korvo are involved in an illicit affair. Ann desperately tries to prove her innocence, and in the process, leads all involved in a potentially deadly trap to stop Korvo.<br><br>There are echoes of \"Laura\" throughout, including the portrait that hangs over the mantle at the home of the ill-fated Theresa Randolph (Barbara O'Neill, best remembered as Scarlett's mother in GWTW), and the final shootout. Definitely an off-beat movie of the noir genre, it is still a very watchable one. Richard Conte is a little unconvincing as Tierney's shrink husband, but he manages to pull it off, with efficient support from Tierney and Ferrer.<br><br>Can a man make a woman do things she doesn't want to do? Watch \"Whirlpool\" and draw your own conclusions.<br><br>A great addition to the Fox Film Noir collection.","user":"Noirdame79","rank":[14,14]}]