[{"title":"An adult movie rated PG","rating":8,"date":"25 January 2005","review":"Sometimes it takes a great shock to remind us what our priorities should be. We may take offense at the suggestion that our ambitions, our lusts, and our greed are more important to us than the health and safety and happiness of our loved ones, but how often do we find ourselves acting as though they are? Sometimes the shock occurs in time for us to rearrange our priorities. Sometimes it comes too late, and we can only regret our foolishness.<br><br>Garry Marshall's Nothing in Common concerns just such a shock. After 34 years of marriage, Lorraine Basner (Eva Marie Saint) leaves her husband Max (Jackie Gleason) because she can no longer tolerate his oppressive silence. Over the course of three decades he has treated her at best as a roommate, at worst as a handservant. Their marriage is barren, devoid of affection and intimacy. Aside from their son David, they have nothing in common anymore.<br><br>Max is devastated by his wife's departure, and too proud to admit it. He would like nothing better than for her to return, but he is unwilling -- perhaps unable -- to protest his love. The shock has come too late for Max and Lorraine, and the blame belongs to both of them. Max has indeed treated his wife shamefully, but she in turn has put up with it. Thirty-four years is a long time to wait before lodging a serious complaint.<br><br>The shock has come just in time for David Basner (Tom Hanks), the clever young adman always ready with a line -- for a client, for a girl. He lives a life of constant change, moving blithely from one presentation or seduction to the next, putting together a reel of 60-second commercials and 90-minute relationships as he goes. In his preoccupation with the surfeit of choices in his smorgasbord life, he has denied himself the opportunity to get to know his parents as people and deprived them of the one thing they still have in common, their son. The shock of their separation reminds him that he is neglecting his responsibility to his parents; the discovery that his father will require life-threatening surgery gives added urgency to his renewed interest in their lives.<br><br>The shock also gives him pause to reflect on the shape of his own life, to recognize that he has nothing in common with the sleeping partners he picks out like actresses at a cattle call and that the childhood sweetheart with whom he can identify may not be available forever.<br><br>Nothing in Common is an adult movie in the true sense of the term. It offers a mature treatment of a subject of extreme importance to adults in a country racked by divorce. It does not resort to nudity, coarse language, or superficial sociological dialogue. It presents the breakup of a marriage as an unmitigated tragedy, not as a grand opportunity for the exploration of narcissism (as is the case with such shallow contemporary films as An Unmarried Woman). It resolutely rejects the irresponsible and amoral lifestyle celebrated in so much of modern culture, and it encourages us to do likewise, by giving us an honest picture of it. Nothing in Common is an adult movie with a PG rating, a fine cast of characters, a skillful director, and an important story to tell.","user":"FRDuplantier","rank":[39,42]},{"title":"Tom Hanks was great, even back then","rating":1,"date":"1 July 2004","review":"The story line is pretty straight forward, and the production was good, especially considering the 80's style of movie making. But Tom carries the movie, with his now-classic mix of rapier wit, sarcasm, and charming humor.<br><br>Tom play David Basner, a talented, slightly arrogant Chicago ad-exec whose parents just split after 50+ years of marriage. Though he has left \"the nest\" and views his parents as a necessary evil to be dealt with as little as possible, he finds himself providing ever-increasing support to each parent, all the while discovering the frailty and human side of each of them, and discovering what his priorities should be.<br><br>A definite watch","user":"avi-4","rank":[17,18]},{"title":"A Great Sleeper","rating":8,"date":"23 July 2005","review":"This is a great movie. It combines several emotional aspects of the human condition. Classic Tom Hanks humor, emotionally touching realism as well as some serious drama.<br><br>Over the years since it was released I have watched this dozen's of times. I never get tired of it. I am moved as David Basner is forced to face the reality of his parents divorce and tries to build an individual relationship with each of his parents.<br><br>I think this is much better than Splash, probably on par with BIG. Of course, just about anything with Tom Hanks is great simply because he is able to carry the load.","user":"sampson-tx","rank":[22,24]}]