[{"title":"Witty Costume Comedy","rating":9,"date":"9 July 2000","review":"A kind of anti-Les Miserables, this sophisticated period comedy inverts conventional morality, following a thief/scoundrel as he rises to become the chief of police of Paris. This makes an ideal showcase for George Sanders at his peak of suavity, which he maintains even in a blond wig while posing for a portrait of St. George [this evolves into a theme of the film: \"In all of us there is a St. George and a dragon\"].  Naturally, Sanders effortlessly spins aphorisms: on adultery, he murmurs, \"Sometimes the chains of matrimony are so heavy they have to be carried by three\".<br><br>Very much a production of displaced Europeans [Sirk, Shuftan, Eisler, Pressburger], the story celebrates a continental tolerance [\"No man is a saint\"]. Douglas Sirk clearly enjoys the subversive charm of the criminal mind which stays sharp by exploring all the possibilities for larceny. However, Sirk is not cruel: the provincial victims are not buffoons; they are just not sharp enough to see all the angles in each situation. He does not mock the cheerful dowager [Alma Kruger] who is eager for more adventurous company, and even the bumbling cuckold [Gene Lockhart] is ultimately touching when he disguises himself as a canary-merchant.<br><br>Like its contemporary, Renoir's DIARY OF A CHAMBERMAID, this sometimes seems like a European film trapped in Hollywood. However, while the first hour sometimes strains to be \"naughty\" [as in a decorous skinny-dipping scene], Sirk is able to unify the tone more successfully than Renoir. If Signe Hasso seems a bit old [at 30] as the wide-eyed ingenue, and Carole Landis struggles through her music hall number, Sirk guides both of them to satisfying moments, justifying their casting. The plot  involving a garter made of rubies, a monkey called Satan, and a Chinese carousel with a giant Pekinese to ride -- develops increasingly clever and surprising twists, to a pleasing conclusion.","user":"rfkeser","rank":[35,39]},{"title":"Very witty, Lubitsch-like comedy from Sirk","rating":10,"date":"23 April 2012","review":"This film is excellent! I don't understand why anyone would call this the \"nadir\" of Sirk's career, as it is far more intelligent than any of Sirk's famous melodramas. While I enjoy those films, this remains my favorite Sirk picture. The story chronicles the misadventures of pretty rascal turned gentleman thief, Eugene Vidocq, played by the eternal screen cad George Sanders. This is one of Sanders' best caddish roles, as he sidles around chateaux and graveyards, uttering lines such as \"sometimes the chains of marriage as so heavy they must be carried by three\". In addition to the witty, frothy humour, there is a dark undercurrent to the film that is evidenced in its noirish photography and the amorality of the lead characters. High recommended to fans of Old Hollywood who enjoy the more eclectic films of that period!","user":"broadway_melody_girl","rank":[16,17]},{"title":"Great vehicle for George Sanders","rating":6,"date":"6 January 2009","review":"\"A Scandal in Paris\" is a 1946 film starring George Sanders, Akim Tamiroff, Signe Hasso, and Carole Landis. Directed by Douglas Sirk, it's based on the memoirs of François-Eugène Vidocq, a thief who became the Chief of Police in the 18th Century. The story begins with Francois being born in a jail and covers his European escapades. At one point, he poses for a painting of St. George and rides off on the horse he sits on; later, a marquise's granddaughter (Hasso) falls in love with the face in the painting and recognizes him when he comes to stay with her grandmother...and steal her jewels.<br><br>A very witty script that is perfect for the elegant, handsome Sanders. This role seems tailor-made for him. The beautiful Carole Landis plays one of his victims, a showgirl with a valuable garter. Sadly, by this time, her career had really stalled out. She's still a bright and glamorous presence. Hasso is an odd choice for an ingénue role, though she does a good job.<br><br>Entertaining film, particularly because of George Sanders.","user":"blanche-2","rank":[14,17]}]