[{"title":"Vampire Magic","rating":7,"date":"7 July 1999","review":"When we think of great vampire portrayals, normally the names of Lugosi and Christopher Lee immediately pop into our heads.  Robert Quarry, however, is as convincing a vampire as both of those great actors.  His performance and demeanor as a Bulgarian Count in this film is truly outstanding.  He lives in a large house somewhere in California and terrorizes young women and their boyfriends.  What makes this picture a better than average vampire film is that it has a very tense and atmospheric plot structure.  We basically know what fate will befall our innocent(just) protagonists, but we become riveted to their actions and those of the Count.  Quarry plays the Count with a charm that is both amiable and yet caustic.  He makes one of the wittiest vampires in film.  The rest of the cast is adequate, and I think Roger Perry does a wonderful job as a blood specialist who goads Count Yorga one evening into talking about the supernatural.  A must see for the classic horror fan.","user":"BaronBl00d","rank":[19,21]},{"title":"Very innovative for its time","rating":7,"date":"7 May 2001","review":"At the time this film was made, vampires were almost always slow and hypnotic.  This was really the first vampire film that treated them as swift and animalistic.  That made this film surprisingly effective.  It was even more surprising since it was originally supposed to be a pornographic vampire film called THE LOVES OF COUNT IORGA.  It is flawed, but I still think it is the most effective vampire film I have ever seen.  And I have seen quite a few.","user":"mleeper","rank":[14,15]},{"title":"Pretty good","rating":7,"date":"10 June 2007","review":"Count Yorga (Robert Quarry), a vampire, comes from Bulgaria to 1970 Los Angeles and starts making a coven of beautiful female vampires. Will their boyfriends be able to stop him?<br><br>This was a huge hit in 1970 because it was the first modern vampire film. Up until then all vampire films had been set in Europe in the 1800s or early 1900s. This was the first vampire film set in modern day. Still it isn't a great film. It was originally shot with soft core sex scenes which were (pretty obviously) edited out and it was turned into a sleazy PG rated film. It was made on a very low budget (it shows) and suffers from some horrible 1970s fashions and dialogue. Also the makeup on the female vampires is pretty poor. Still this isn't a total disaster either.<br><br>The script is actually pretty intelligent considering this was a fairly rushed production. The acting is good--especially by Quarry who makes an imposing vampire. Very subtle performance but he handles the violent scenes quite well too. It moves at a fairly quick pace and has a great bloody climax--pretty extreme for a PG film. This won't impress audiences like it did in 1970 but it's still not that bad.<br><br>The 2000 video version I have has \"Yorga\" spelled as \"Iorga\".","user":"preppy-3","rank":[17,19]}]