[{"title":"A classic childhood adventure","rating":10,"date":"27 May 2006","review":"A classic childhood adventure set in English Lake District in 1929. Four pre-teens travel by train with their mother for a weeks holiday in the Lake District. The children spend their time exploring in a rowing boat &amp; camping on a small island. They befriend two sisters &amp; become involved in an intrigue with their uncle; having adopted a pirates view of their world. The children enter a world of magic &amp; adventure, where their freedom &amp; imagination are the special effects. A charming tale, with exquisitely rendered period detail in a timeless landscape that will have you aching for a simpler age. Do not miss - your inner child will thank you for it.","user":"miss_chanandler_bong","rank":[20,21]},{"title":"One of our family favorites","rating":7,"date":"9 November 2001","review":"Although no one would accuse this film of being great art, it is a delightful, wholesome and reasonably accurate (albeit simplified) rendition of Arthur Ransome's wonderful book. It is nearly impossible these days to find any movies where the children are kind to one another, the parents are loving and the adventures are free of violence. If you love sailing, old boats, and a pleasant easygoing story, Swallows and Amazons isn't a bad choice. It is one of our family favorites.","user":"CLCDrama","rank":[24,26]},{"title":"Natives!","rating":7,"date":"11 March 2005","review":"When this arrived, I'd finished reading all the Swallows and Amazons novels just a few months before. I'd also just seen the TV productions of the two Coots books (click on my name for that review) and read Roger Wardale's \"In Search of Swallows &amp; Amazons\" which interpolates a fair amount of biographical data into a photographic search for the real Lakeland sites in which the fictions take place.<br><br>Much about this 1974 theatrical film is right, and two things -- both casting issues -- grievously wrong. Judging from Wardale's photos and Ransome's descriptions, the lake lands, Wildcat and Comorant Islands, and especially the two landing sites on Wildcat look perfect or nearly. Also right: the two boats of the title swishing across the lake with the camera set low so that the distances and land masses appear as they might in a child's eye. I like that tacking, so important throughout the series, happens clearly and instructively without anyone ever stopping to explain it, whether Roger running otherwise bizarre switchbacks up a lazily sloping lawn, or John doing a hundred-count to tack in the dark. (Believe me it's clear when you see, especially if you know any of the books.) John and Susan, the one groping toward becoming a natural leader, the other painstakingly matronly yet able to break in an instant into a child's sprint, seem well cast and anchor the group. Able seaman Titty's the best cast. She has the most active imagination in the group, always seems more actively and willingly to believe, while the two older children have to work just a little at pretending. Roger, to me, looks a little two Alfred E. Newman, but does no real harm to the film.<br><br>The most horribly miscast is Nancy, the older Amazon. Though a bare year older in the books, here she towers over the others. I think she's at least as tall as the other miscast character, her uncle \"Captain Flint,\" and even has a figure with which she could pass for eighteen or twenty. But worse than that, she's not wild enough. Not until the very end does she utter a single grudgingly weak \"Shiver me timbers,\" or if she did before they were too limp to notice. She seems nearly as \"native\" as the Swallow's mother, while she should have been a driving force, the most vivid pretender, or equal at least to Titty. I'm not sure how to describe to who haven't read. Maybe the closest I can come is Charles Shultz's Peppermint Patty but with a lot more confidence. Reading, I always heard Nancy's \"Shiver me timbers\" as raucous as a parrot's cry.<br><br>Bird-faced actor Ronald Fraser's Uncle Jim, or \"Captain Flint,\" looks like a fifty-year-old petty magistrate. He could never sincerely belong with these kids against the Natives. He IS a native, irredeemably. (Natives are adults, shore people, or in general anyone not in on the frame of mind out of which the term Native comes.) Ransome's Captain Flint is fat and knowledgeable, playful but seldom or never silly. Ronald Fraser condescends in a way that's anathema not just to the real fictional Flint but to Ransome.<br><br>But please take the good of all I've said, and do see this film.","user":"frankgaipa","rank":[26,29]}]