[{"title":"\"Hey Pop, the time you hit Hazen in the mouth, was it worth 30 years?/ For me it was./ Then give me my damn shoe!\"","rating":7,"date":"15 October 2008","review":"Burt Reynolds plays Paul Crewe, a reprehensible character discovering, in a prison, dignity and esteem You see him, at the beginning of the movieas a rising starbeating up a woman, stealing her car, drunken driving, insulting cops in a bar, resisting arrest He's seen so funny when he insulted the miniature cop who's about to arrest him, while the cop's partner is laughing openly <br><br>Eddie Albert was very charming when he meets Paul Crewe at his arrival to Citrus State Prison Aldrich wanted to play Warden Hazen as the guy who had the veneer of normalcy, the veneer of being a good executive, the veneer of keeping it all together till it starts unraveling He really was just a despicable, oily, warden type In one game scene, we see him over and over again, getting up just with that same look of shock on his face <br><br>Ed Lauter (Captain Knauer) is wonderful He runs the football team He is a bad guy and he represents everything that is wrong with that prison system and everything else He changes as a result And to see that is just so delightful He's got the classic Ed Lauter's scene at the end James Hampton plays Caretaker, the character who brings the team all together and pushes Burt's character ahead to win the game <br><br>Ray Nitschke plays the toughest, meanest linebacker in football Richard Kiel, Bob Tessier, Charles Tyner, Michael Conrad, and Harry Caesar give the film a certain veracity, you almost thing you are in jail","user":"Nazi_Fighter_David","rank":[29,37]},{"title":"A classic of the genre.","rating":8,"date":"15 June 2005","review":"You just can't get away with this stuff anymore. In the first ten minutes, Burt Reynolds has beaten his girlfriend, stolen her car, gone on a massive police chase, dumped the sportscar off a bridge, then attacked two cops. Oh, and he's the hero of the movie, too.<br><br>Nowadays the remake -- starring Adam Sandler -- is rated PG-13 and he's a total wimp. Back in the '70s you could get away with being vicious, sexist, homophobic and racist and live to tell about it. In 2005, Adam Sandler says the F-word in one of his movies and parents are banning the film companies.<br><br>Yup, this film is clearly racist, homophobic and misogynist. Women are treated as sexual objects throughout, from the opening to the part where a prison warden's intern requests sexual favors from Burt Reynolds in return for handing him a movie-reel he needs.<br><br>African-Americans are portrayed as racist tough guys who are better than the whites at football, and they call whiteys \"honkies\" and other such words. In return all the whites are racist towards the blacks and it creates an interesting tension.<br><br>The homophobia sneaks into play when it's suggested one of the inmates is in love with Burt Reynolds. Quite a funny scene, actually.<br><br>\"The Longest Yard\" was one of Robert Aldrich's most successful films and many claimed it was him \"selling out,\" but viewed 30 years later this really does stand apart from many of the other sports-comedy films of the decade. What is so special about \"The Longest Yard\" is probably that it plays like a mix between \"Cool Hand Luke,\" \"One Flew Over the Cuckoo's Nest\" and \"Smokey and the Bandit\" -- it's got car chases, it's got sports, it's got funny stuff, BUT it also spends a lot of time developing its characters and creating some very dramatic sequences.<br><br>This is well directed, gritty, and fun -- not as much a \"comedy\" as you might expect, it is actually more serious. By the end of the film we've come to root for a bunch of murderers and rapists and even Burt Reynolds, and let's face it -- when was the last time you saw Burt Reynolds in a movie and actually LIKED his character?! A classic of the genre.","user":"MovieAddict2016","rank":[43,60]},{"title":"Football and prison is a recipe for brutal mirth.","rating":9,"date":"13 July 2008","review":"Disgraced former pro football quarterback Paul Crewe is sent to prison after a drunken night to remember. The prison is run by Warden Hazen, a football nut who spies an opportunity to utilise Crewe's ability at the sport to enhance the prison guards teams skills. After initially declining to help, Crewe is swayed into putting together a team of convicts to take on the guards in a one off match, thieves, murderers and psychopaths collectively come together to literally, beat the guards, but Crewe also has his own personal demons to exorcise.<br><br>This violent, but wonderfully funny film has many things going for it. Directed with style by the gifted hands of Robert Aldrich, The Longest Yard cheekily examines the harshness of gridiron and fuses it with the brutality of the penal system. The script from Tracy Keenan Wynn is a sharp as a tack and Aldrich's use of split screens and slow motion sequences bring it all together very nicely indeed. I would also like to comment on the editing from Michael Luciano, nominated for the Oscar in that department, it didn't win, but in my honest opinion it's one of the best edited pictures from the 70s.<br><br>Taking the lead role of Crewe is Burt Reynolds, here he is at the peak of his powers (perhaps never better) and has star appeal positively bristling from every hair on his rugged chest. It's a great performance, believable in the action sequences (he was once a halfback for Florida), and crucially having the comic ability to make Wynn's script deliver the necessary mirth quota. What is of most interest to me is that Crewe is a less than honourable guy, the first 15 minutes of the film gives us all we need to know about his make up, but much like One Flew Over The Cuckoo's Nest the following year, The Longest Yard has us rooting for the main protagonist entering the home straight, and that is something of a testament to Reynolds' charm and charisma.<br><br>The film's crowning glory is the football game itself, taking up three parts of an hour, the highest compliment I can give it is to say that one doesn't need to be a fan of the sport to enjoy this final third. It's highly engaging as a comedy piece whilst also being octane inventive as an action junkie's series of events. A number of former gridiron stars fill out both sides of the teams to instill a high believability factor into the match itself, and the ending is a pure rewarding punch the air piece of cinema. 9/10","user":"hitchcockthelegend","rank":[14,17]}]