[{"title":"For Dog Lovers Everywhere","rating":10,"date":"30 September 2002","review":"A magnificent British collie struggles to cover the hundreds of miles that separate her from the family she loves.<br><br>LASSIE COME HOME is one of the truly great family films. Crafted with care by MGM and based on the classic novel by Eric Knight, it will strike a warm response in the heart of anyone who has ever loved a dog.<br><br>The production values are first rate and the color photography is spectacular. While the scenery &amp; filming locations are strictly Western North America, they nevertheless make evocative stand-ins for the settings in the book. It might be worth the viewer's time to check the relationship of the Yorkshire Moors with the Scottish Highlands on a map, so as to better appreciate the phenomenal journey which the dog undertakes.<br><br>The casting is excellent throughout: Donald Crisp, Elsa Lanchester &amp; Roddy McDowall as the poor, proud family which must sell their only treasure, Lassie; Nigel Bruce as the gruffly tenderhearted Duke which buys the dog; a young Dame Elizabeth Taylor plays his lively granddaughter. J. Pat O'Malley portrays the brutal dog handler employed by the Duke.<br><br>Along her journey Lassie encounters old folks who need her companionship (Dame May Whitty &amp; real-life husband Ben Webster, in his last film role), a traveling tinker who values her protection (Edmund Gwenn), and suspicious sheepmen on the watch for killer dogs (Alan Napier &amp; Arthur Shields).<br><br>Lassie is played by Pal, a male dog trained by the celebrated Rudd Weatherwax (1907-1985), who was responsible for generations of Lassies which appeared in movies &amp; television. Pal gives a remarkable performance, providing the very heart &amp; soul of the film.<br><br>*************************<br><br>Eric Mowbray Knight was born in Yorkshire, England, on April 10, 1897. Moving to America in 1912, he became a student in New York, but left to join the Canadian Armed Forces with the outbreak of World War One. In 1932 he published a collection of his wartime letters - Portrait Of A Flying Yorkshireman. Later came two novels which made good use of authentic Yorkshire dialect: Invitation To Life (1934) and Song On Your Bugles (1937). He didn't think much of his 1940 children's book, Lassie Come-Home and was very surprised at its great success. His next novel, This Above All (1941), a World War Two romance, was also popular. Knight joined the United States Army and rose to the rank of Major. Working with an Army film unit under the direction of Frank Capra, Eric Knight was tragically killed in a plane crash off the coast of Suriname on January 15, 1943. MGM dedicated LASSIE COME HOME, which was released later that year, to his memory.<br><br>*************************************<br><br>The snatch of ballad Edmund Gwenn is singing while shaving in his first scene is \"I Dreamt That I Dwelt In Marble Halls\" from the 1843 operetta The Bohemian Girl by Michael William Balfe (1808-1870).","user":"Ron Oliver","rank":[40,40]},{"title":"A Boy and His Dog","rating":9,"date":"20 August 2007","review":"Lassie makes a remarkable screen debut. Under the guidance of trainer Rudd Weatherwax, the dog will become one of the most popular and enduring animal \"stars\" ever. It's easy to see why, in \"Lassie Come Home\". The collie, and its descendants, performed this basic role for some decades to come.<br><br>When the story begins, Lassie must be sold, by the poor Carracloughs: father Donald Crisp, mother Elsa Lancaster, and their boy Roddy McDowall. Mr. Crisp loses his job, and can't afford to keep the pet. Though Lassie is sold, his real emotional \"owner\" is the boy Joe, played by Mr. McDowall. McDowall's performance is terrific, and the others are no less than competent. The MGM color cinematography is gorgeous, and the story understandably sentimental. Interestingly, Elizabeth Taylor appears in her second film role; she will become Lassie's owner for the third series film, \"Courage of Lassie\" (1946). <br><br>If \"Lassie, Come Home\" doesn't raise some emotion, you may not be human. <br><br>********* Lassie Come Home (1943) Fred M. Wilcox ~ Roddy McDowall, Donald Crisp, Elizabeth Taylor, May Witty","user":"wes-connors","rank":[20,20]},{"title":"a definite weepy!","rating":10,"date":"14 August 2005","review":"I love this movie. If I even watch a minute of it I'm guaranteed to cry. My favourite bit where I'm really howling my eyes out is near the end when Lassie has arrived at the cottage, looking like she's been through the wars, well, if you watch the movie, you'll know that she has!. The mother of the house attempts to feed her the last bit of food that they have in the house. The Lord who has bought the dog comes looking for lassie on the off chance that she will have traveller the hundreds of miles to be where she truly belongs. he recognises that it is indeed lassie but proclaims that there's no way that this bedraggled dog could possibly be Lassie and leaves, offering the man of the house a job looking after his dogs. Then the clock strikes four on the mantelshelf and Lassie who looks like she is unable to walk the length of herself gets up and makes her way limping pathetically toward the door. (By this time I'm working my way through the tissue box, howling \"God love her\") The mum and dad try to dissuade her but she keeps scratching at the door until it's opened. she makes her way toward the school to meet the boy (Roddy McDowell) and when he sees her (cue another load of tissues) he says Lassie, you've come home. It all works out in the end, the Dad gets his job with the lord looking after the dogs, Lassie has pups and the boy becomes friends with the lord's granddaughter. This movie should only be watched by people who enjoy a good greet!","user":"Judie64","rank":[16,16]}]