[{"title":"Tippi Feathers With Mother","rating":10,"date":"5 February 2005","review":"Seems silly to give a 10 to \"The Birds\" what can I give to \"Notorius\" then? Or \"Rear Window\"? A 20? It doesn't matter, a 10 shouldn't mean the best but one of the best. Best as in degrees of enjoyment, best as in time of enjoyment, 10 for the kind of enjoyment. \"The Birds\" is a ten for all of the above. Hitchcock's world varied consistently, it depended very much on his travelling companions. Writers first and foremost then composers. There is no music in \"The Birds\" so most of my questions are directed to the eclectic Evan Hunter who dissected Daphne de Maurier's original story and transformed it into something that not even Hitchcock had attempted before. A lyrically surreal horror soap opera kind of thing. It visits many of Hitchcock's obsession's of course, an icy blond and a castrating mother. Tippi Hedren follows a long line of Hitchcock blonds, from Madeline Carroll and Ingrid Bergman to Grace Kelly, Kim Novak, Janet Leigh, Eva Marie Saint and Doris Day as Jessica Tandy follows Madame Constantin, Jesse Royce Landis and Louise Latham not to mention Mrs. Bates. Evan Hunter was behind films like Richard Brooks's \"Blackboard Jungle\" and a semi forgotten gem Frank Perry's \"Last Summer\" As well as having Akira Kurosawa based his film noir \"The Ransom\" on one of his novels. Here, he follows Hitchcock's needs with religious reverence and at the same time comes out with something quite unique. I love the light weightiness of the heaviness. I've always loved the daringness of the pacing. The car trip to to Bodega Bay or the long shots of Jessica Tandy's truck driving away in horror from the farm. This movie is also a reminder to the filmmakers, depending in special effects, that effects tend to age a movie far too fast. The effects should be at the service of the characters and not the other way round. Rod Taylor, a charming, versatile matinée idol with a brain and the scrumptious Suzanne Pleshette ad to the many pleasures this 10 of a film will keep in store for generations to come.","user":"don_agu","rank":[251,405]},{"title":"A terrifying work of beauty","rating":8,"date":"17 December 2013","review":"I don't think anyone was prepared in 1963 for the unexplained horror Hitchcock unleashed here (hell, I wasn't; and I first saw it 25 years later). Now, 50 years later, it's still absolutely unique and remains a stand-alone picture which doesn't cease to amaze me.<br><br>The tension Hitchcock slowly builds and the atmosphere of impending doom he creates are mesmerizing. This was probably the first true apocalyptic nightmare ever put on screen; a shocker, and the terror this film inspires is greatly enhanced by the fact that it refuses to give the viewer any answers. Nature just turns on humanity all of a sudden, and although it's just those adorable tiny creatures called \"birds\" that we see go amok, I was left with the impression that this might just be the start of something bigger, much much worse.<br><br>This was Hitchcock, the man who - next to Chaplin and Disney - probably had the biggest impact on the evolution of cinema from the twenties to the early sixties, at the peak of his creativity. <br><br>A terrifying work of beauty. My vote: 8 out of 10<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[72,109]},{"title":"A true puzzle without an answer; brilliant","rating":10,"date":"8 May 2003","review":"One of Hitchcock's most enigmatic and fascinating films, a true puzzle without an answer. Hitchcock chucks away all but the barest conceit of DuMaurier's story, and instead constructs an elegant little comedy of manners so dry it'll sting your lips. Tippi Hedren's spoiled rich girl makes a trip to a west-coast fishing town to play a joke on a smartass lawyer who still lives with his mum, and things get complicated. In the movie's first half, the director layers on the sexual tensions and the bitchy wit until you're at the screaming point--and then unleashes a cataclysmic natural horror so unspeakable it could be something out of the Bible. <br><br>All technical elements are superb. Hitchcock, so well known for his use of music, shows here how terrifying silence can be, and 'The Birds' remains an intensely quiet picture, even punctuated, as it is, by sudden noisy violence. The set pieces, like the fireplace scene, the playground scene, and the visit with Dan Fawcett, are studies in perfection. The cast is smooth down to the tiniest roles, with the proto-Altman ensemble scene in the diner being one of the most memorable segments in a film chock-full of them.<br><br>And it is literally impossible to imagine better-cast actors in the leads. Hedren is perfect as Melanie Daniels, the party girl who, while not nearly as clever as she thinks she is, may just be telling the truth when she says she's looking for something more meaningful in her life. Rod Taylor is charming and somewhat inscrutable as the local-boy-made-good who thinks he knows what he wants. Suzanne Pleschette is smoldering as the cynical (and perhaps sexually ambiguous) schoolteacher who takes Melanie in.<br><br>And perhaps most important, Jessica Tandy is a searing, twitchily hypnotic presence as Lydia Brenner, surely one of greatest supporting characters in the Hitchcock pantheon.<br><br>As the movie runs on, the director gleefully ignores one loose end after another, leaving the viewer with an epic catalogue of unanswered questions at the climax (the most important of which is articulated by the diner's birdwatching crone: Why?). And if you're the kind of moviegoer who likes having everything neatly explained, you'd best try something else. But if you like ambiguity (and a healthy dose of existential nightmarishness), it doesn't get any better than this. 10 out of 10.","user":"kintopf432","rank":[88,136]}]