[{"title":"Another horror classic from Hammer.","rating":9,"date":"20 March 2006","review":"Frankenstein escapes the guillotine and flees to Carlsbruck where he passes himself off as Dr Victor Stein and makes a living as a general practitioner.Three years later,while working in the town's hospital for the poor where he carries on his experiments,he is recognized by a visiting physician,Dr Hans Kleve and the two decide to work together on creating a new artificial man.Using donors from the hospital,Frankenstein has built a new body into which he agrees to transplant the brain of his hunchbacked assistant Karl.Once completed and given life,the new creature is left in the care of the poor hospital where a well-meaning nurse releases it.As the new Karl tries to destroy his old body,a sadistic janitor savagely beats the creature and his brain is badly damaged,triggering cannibalistic urges...\"The Revenge of Frankenstein\" is one of the best horror films from Hammer.It has many of the components of traditional Hammer horror(secret labs full of bubbling beakers,foggy streets and of course another great performance by Peter Cushing),but it also has a surprisingly gentle monster whose story is as much sad as it is horrifying.Recommended.9 out of 10.","user":"HumanoidOfFlesh","rank":[21,25]},{"title":"Outstanding Sequel to \"Curse of Frankenstein\"","rating":9,"date":"17 August 2009","review":"Released just a year after \"Curse of Frankenstein,\" \"Revenge of Frankenstein\" chronicles the further adventures of Baron Victor Frankenstein (Peter Cushing) as he miraculously escapes the guillotine (his fate at the end of the first movie), relocates to a new town (Carlsbruck), assumes a new identity (Dr. Stein), and seemingly becomes a respectable citizen. Before long, however, the doc is up to his old tricks, collecting body parts and transplanting a brain into a new stitched-together creature. This time, his experiment seems to be a rousing success. However, things soon go awry.<br><br>Like the 1935 Universal classic \"Bride of Frankenstein,\" this is one of those rare sequels that surpasses the original. Although \"Revenge\" is not quite in the same league as \"Bride,\" The Creature (played by Michael Gwynne) is a much more complicated, and therefore more interesting, character than Christopher Lee's Frankenstein Monster, who was basically just a homicidal maniac. Karl (The Creature) is not evil, merely misunderstood and terribly unlucky.<br><br>Peter Cushing's Baron Frankenstein is also a much more sympathetic character than he was in \"Curse of Frankenstein.\" There he did not hesitate to engage in cold-blooded murder to further his goals. Here we have a kinder and gentler Baron, resolute to be sure but not murderously ruthless. This remarkable character transformation is never explained nor even alluded to. But it makes the Baron a character we can root for, something that we could never do in the original movie. In that regard, the title is somewhat misleading, since revenge is not a major theme and the Baron is not out to get those who may have wronged him.<br><br>The same steady hands who guided Hammer's first \"Frankenstein\" film to box-office success -- Terence Fisher as director and Jimmy Sangster as screenwriter -- are also at the helm in this one. Cushing's presence adds a certain gravitas to the proceedings, and the other actors, particularly Gwynne, also turn in first-rate performances. Although there are few scares, the movie is well written and maintains the viewer's interest throughout.<br><br>It should be noted that, like most of Hammer's Frankenstein sequels, this one chronicles the further adventures of Victor Frankenstein and not the Frankenstein Monster. In that respect, they are quite unlike the Universal sequels, where the Monster eventually ran out of things to do and ended up being a virtual parody of himself. The original Monster would, in fact, return in the next Hammer sequel, \"The Evil of Frankenstein,\" and again a few years later in \"Horror of Frankenstein,\" which was a remake of \"Curse\" (this time with Ralph Bates as the Baron) rather than a sequel. Both of these films, while enjoyable in their own way (particularly for Hammerphiles), are inferior to this one and, in my opinion, not as good as the other sequels (most notably \"Frankenstein Created Woman\") that do not feature the original Frankenstein Monster.<br><br>Highly recommended.","user":"tomjeffrey2001","rank":[11,12]},{"title":"\"They Shall Never Be Rid of Me!","rating":9,"date":"15 June 2007","review":"If you have seen, Curse of Frankenstein, then you must follow up with this excellent sequel. The magic which is in the Hammer Films allows that aura to continue in this follow-up story. In this second chapter of the infamous doctor who nearly wills his creature to live, we see that he has somehow escaped death by guillotine. Once again, we have the superb talents of Peter Cushing, who played Dr. Victor Frankenstein, in the original and successful 1957 version. In that prequel, the good doctor was sentenced to death and last seen approaching the guillotine. In this follow-up film, we see, he has somehow survived execution, and has chosen a new name; Dr. Victor Stein. Arriving in a new city, he sets up practice but is shunned by the city's medical authorities, who send a representative to demand he join their union. Francis Matthews plays the envoy, Dr. Hans Kleve, a fine doctor and a member in good standing with the union. In time however, he suspects the mysterious visitor is not only an superior doctor, but perhaps the greatest medical genius ever and wants to join him as his assistant. What follows is the the perhaps the best adaption of the Shelley story as we learn that Hans proves Dr. Stein correct. Dr. Kleve proves to be an excellent pupil and Dr. Stein proves equally prophetic. They will never be rid of Dr. Frankenstein! A great film and earns its place as a classic****","user":"thinker1691","rank":[18,22]}]