[{"title":"The memory of love","rating":10,"date":"3 January 2010","review":"Von Bohm is from East-Prussia, his two \"weaknesses\" are \"East-Prussian human beings and West-Frisian tea\", he tells to Lola's mother who works as his house-keeper after he has been elected as the new head of the construction department by the city of Coburg. Coburg - as any German city in the time of the \"Wirtschaftswunder\" - is a place \"where people have an outer and an inner life, and both have nothing to do with one another\". Although Von Bohm agrees, he has not a ghost of an idea that the elegant and beautiful young lady who gets his hand-kiss is in her \"inner\" life the attraction of the local bordello where the \"crows\" (major, police president, politicians, heads of the governmental departments) and the \"vulture\" (Schuckert) reunite every evening while their wives are knitting at home or are already asleep.<br><br>It is amazing what Fassbinder made out of the Heinrich Mann-Von Sternberg drama \"Professor Unrat\" or \"The Blue Angel\", respectively. Fassbinder's Lola is not a man-murdering and at last unreachable \"beauty\" like the (not so beautiful) Marlene Dietrich, but a girl who has to nourish her little daughter and still has the hope for a better live. She is \"open\" for everybody and does not flirt with the distance. In the opposite: On the stage she goes from hand to hand and is something like a collective propriety of the \"Creme De La Creme\" of the little city. (The figure of Esslin - whose name is close to Enslin -, who quotes Bakunin in Lola's Boudoir, is probably the rest that remained from the original protagonist character of Professor Unrat.) Therefore, Fassbinder's Lola is not about the decrease of a society member by entering the \"wrong\" society, but about her way to become a part of her society and Von Bohm's desire to possess his beloved \"object\". This is managed in an almost fairy-tale-like style, typically (and ironically) for the Germany of the Adenauer-era, so that in the end everybody looks happy, since everybody got what he wanted: Lola says to Mrs. Schuckert: \"Now I belong to you\". Schuckert earns his 3 millions of D-Marks from the \"Lindenhof\", the Mayor will be reelected, and Von Bohm gets Lola. Then, Lola's little daughter asks him: \"Are you happy now?\". Von Bohm answers a bit hesitatingly by \"Yes\". Unlike Professor Unrat, he does not pay with his life for his love, but probably with his soul.","user":"hasosch","rank":[17,18]},{"title":"Lola gets her man {Rainer Werner Fassbinder}","rating":21,"date":"21 July 2011","review":"Satirical to the core, this movie is interesting in its realistic illustration of post-war small time corruption. Fassbinder has an extraordinary light touch, and it is a fascinating ride through the endemic connivance's of the petit-bourgeois wheeler-dealers of a small German city. One can actually hear Fassbinder giggling in the background as he brings the universal character of the average conformist-hustler to the screen.<br><br>Barbara Sukowa as Lola, is a magnificent actress, especially where she accepts the humiliations of her life, but will not allow them to transform her into the brutalized animal level of behavior, that she observes all around her. Always optimistic, she pursues her goal {to escape from the prison of degradation, she is in}. We, {the viewers}, follow her journey, as she overcomes obstacle after obstacle, to eventually triumph, and take her place as a citizen of her particular Peyton Place. <br><br>How she does it is colorful and informative. Fassbinder gives you all the different strata of class prejudice, as the money men are in cahoots with the bureaucrats, who are all, in turn, driven by libidinal desires. Mixing up cabaret elements, together with the controlling power of money, blended in with, the huge heart of those that earn their crust as sex workers {this, is so obviously where Fassbinder's sympathies lie}. Fassbinder has used high cinematic values in this movie, where all the characters, {ultimately}, believe that \"Cash is King\". Kitsch is displayed with the usual Fassbinder panache and as with many other movie portrayals of prostitution, the more sordid side, such as violence and intimidation, and the risk to health, are not mentioned, giving the otherwise sharp satire of the corrupt financial world, a rather fairy tale gloss.<br><br>Fassbinder, who always understood the paramount need to entertain, still manages to convey the malaise, that the aftermath of the Nazi demolition of all moral standards, which had left an entire nation bereft of a natural ethos of right and wrong. Fassbinder gives you entertainment and awareness, a difficult tightrope to straddle.<br><br>Fassbinder, like Diogenes, was always in search of an honest man. He had a celebratory attitude to life, and his mirth is infectious.","user":"Stanley-Becker","rank":[16,17]},{"title":"Lorelei and the Man Who Understood and Admired Her","rating":10,"date":"11 August 2006","review":"\"Lola\" (1981), the second chapter of Fassbinder's BRD Trilogy is an update and a remake (in a way) of \"The Blue Angel\"(1930) directed by Josef von Sternberg with magnificent Marlene Dietrich as a singer Lola Lola but Fassbinder's film is marvelous by itself. Like \"Marriage of Maria Braun\" (1979) and \"Veronica Voss\" (1982) \"Lola\" tells the story of a strong and beautiful woman and her survival and search for love, success and happiness in postwar Germany. It's superb and dazzling and I kept smiling all time while I was watching it. It's an old story (and what is new in this world? Carmen had been dead and Lola Lola is old) but the style, the approach, the times, the place, his use of colors that seem to sing, to smile, to scream and to touch you gently are unique. Did he sell his soul to the Devil for these colors? The dresses, the songs, Barbara's voice, her legs that grow from the ears, her hair, oh my God, her and Hanna's (in \"Marriage of Maria Braun that I will finish watching tonight) golden hair, these witching Loreleis, the walking sensuality - Fassbinder understood and admired women and I admire him for this.<br><br>\"Lola\" is a combination of many genres- satire, drama, comedy, and musical. It mixes glamor with very serious themes. Striking Barbara Sukowa is a singer-whore Lola who sets up to seduce the incorruptible local building commissioner, unbelievably blue-eyed Armin Mueller-Stahl. Lola went through many losses, humiliations, and disappointments during the war and right after it and she wants to be an independent business woman for which she decided to win over the man everyone kept telling was not for her.<br><br>As Barbara Sukowa recalls, Fassbinder told the critical stories but he did not make them dry or theoretical. He did not use the intellectual or academic approach to his stories. He hated gray \"kitchen\" naturalism and he was mixing Hollywood glamor with specific German realities creating his own style that was sexy and appealing. While many German film makers of his generation were influenced by the American directors like Martin Scorsese and John Cassavetes, Fassbinder was very impressed by Douglas Sirk and his style.<br><br>Rainer Werner Fassbinder died at the age of 37 just as he was completing his last movie, \"Querell\". He had made over 30 films during 12 years. He began directing in 1969 revealing in his work New Germany, often heartless and materialistic. Fassbinder's talent and the quantity and quality of his output are incredible. It is like he knew he would die young and he was obsessed by finishing as many films as it was physically possible, majority of which (including \"Lola\") were way ahead of their time.","user":"Galina_movie_fan","rank":[44,52]}]