[{"title":"A film about the NORWEGIAN resistance","rating":8,"date":"8 February 2000","review":"'The Heroes of Telemark' tells the true story of how a group of men from the Norwegian resistance, managed to halt a German attempt to produce heavy-water at a hydro-electricity plant in Telemark, Norway. Earlier attempts by British elite troops had failed, and in an attempt by the US Airforce to bomb the plant, they hit a nearby village killing several local inhabitants. The film is in many ways removed from reality. It portrays the event in true Hollywood style, with stout and brave resistance men versus scar-faced villainous Germans and of course the obligatory spectacular pyrotechnics. In the real event, not a single German soldier was killed, in fact, not a single shot was fired.","user":"lars.gustavsen","rank":[45,51]},{"title":"Subdued but fairly interesting war thriller.","rating":6,"date":"6 February 2003","review":"The Heroes of Telemark is based on a real-life story. It follows a unit of the Norweigan resistance in their efforts to destroy a German occupied factory, where the Germans are drawing near to creating the first atomic bomb. Kirk Douglas plays an academic from the University of Oslo who is brought in to help them because he is an expert on atomic science. Richard Harris plays the leader of the resistance fighters, a strong willed and courageous man who is always thinking of the best way to be a thorn in the side of the Nazis. There are other decent characterisations too, such as Ulla Jacobsen as Douglas's ex-wife (they parted because he seduced one of his students) and Eric Porter as a power hungry Nazi.<br><br>The film is quite good, but it might have been better still. For much of the running time, it seems curiously subdued, with lots of scenes which don't quite screw home the tension as far as they could. The sequence in which the resistance fighters infiltrate the factory and attempt to destroy the German's heavy water supply should have been unbearably tense, but it kind of comes and goes without generating the necessary atmosphere. The closing sequence aboard a boat full of children is very well done, though, and there's another taut bit where Douglas and Jacobsen are almost caught snooping around the factory but manage to convince a passing guard that they are merely  young lovebirds trying to find a quiet spot for a bit of private love-making.<br><br>The Heroes of Telemark tells a worthy story and is reasonably entertaining, but it could have been a touch better if the maker's had concentrated slightly harder on the suspense.","user":"barnabyrudge","rank":[21,23]},{"title":"See it for the action, not the history.","rating":12,"date":"12 November 2005","review":"This is a British Movie that received the Hollywierd treatment.One of my many peeves is \"historical \" movies that hoke things up, make things up, change things around. The real story is far more exciting and dramatic, why fictionalize it. The first attempt at attacking the Norsk Hydro plant, \"Operation Freshman\", a British glider commando raid, ended in disaster, one tow plane crashed killing its crew and commandos, the other glider crashed, those who weren't killed in the crash were captured and shot by the Gestapo under Hitler's \"Commando Order\" which authorized the execution of Allied commandos even when they were in uniform. An attempt by the USAAF to destroy the Norsk Hydro plant from the air failed, the British then turned to the Norwegian section of SOE. eight of them attacked the plant, did tremendous damage, escaped without loss. The Germans then decided to move the heavy water and its production equipment to Germany, it was American born Knut Haukelid and an another Norwegian who planted the charges than sank the ferry Hydro and defeated the Germans' attempt to build an atom bomb. I am not sure why the Norsk Hydro plant made heavy water, there were no Norwegian atomic scientists at the time. Nuclear physics was still a very theoretical subject. As with so many movies, see it for the action, then read the history. Best part of the movie is the portrayal of the sinking of the Hydro.","user":"rudge49","rank":[41,48]}]