[{"title":"Mmmmmm....good","rating":1,"date":"1 August 2001","review":"\"Hollywood Chainsaw Hookers\" is one of the best examples of those trashy, cheesy, horror/spoofs of the 80s (Toxic Avenger and Blood Diner would be included in there as well) that I so fondly adore.  The movie is short, sweet, and to the point but I enjoyed every excruciatingly bad B-movie moment, which by the way, is accompanied by the corniest one-liners you've ever heard since Freddy Krueger.  Hollywood Chainsaw Hookers concerns (what else?) a cult of chainsaw massacring babes who use fresh limbs from their victims to serve to their \"master\" (I'm assuming this is where Gunnar Hansen comes in).  And boy does he look embarrassed.  One classic scene involves a nude Michelle Bauer messily hacking up some poor old sap while listening to Elvis Prestley.  The look on her face is priceless.  Blood, a wooden Gunnar Hansen, laughs aplenty, cheesy rock music, scream queens Michelle Bauer and Linnea Quigley (her shining moment is the \"dance of the double chainsaws!\") all wrapped into one...don't miss it.","user":"hamburger","rank":[15,15]},{"title":"One of the best of its genre, and surprisingly clever","rating":10,"date":"16 June 2002","review":"Hollywood Chainsaw Hookers is easily one of the best films of the d-grade comedy-horror genre.<br><br>It's a send up of film noir thrillers with offbeat comedy in the vein of \"The Naked Gun\" films and is genuinely hilarious from start to finish. The story revolves around Jack Chandler, a private eye in Hollywood who is hired to find a missing girl. However, his search leads him to a cult of chainsaw weilding prostitutes led by none other than Gunnar Hansen (Leatherface from The Texas Chainsaw Massacre).<br><br>There are plenty of weird and wacky scenes, pieced together by corny film noir narration and music, and the narration and dialogue in the film is extremely witty.<br><br>Definitely one of the best films of its type. If you are after a fun little comedy/horror film with the typical fix of nudity, corny one liners and gore which is genuinely funny and clever, this should be on top of your list.","user":"T-Bag82","rank":[24,27]},{"title":"The Virgin Dance of the Double Chainsaws!","rating":7,"date":"14 February 2002","review":"A cult of chainsaw-worshipping prostitutes headed over by pleasantly plump guru \"The Master\"(Gunnar \"Leatherface\" Hansen\") are out to make human sacrifices to their god \"Anubis\" and cut into poor guys just looking for a good time. Jay Richardson (very funny here) is dry, thick-witted detective Jack Chandler, who's searching for a young runaway (Linnea Quigley) and stumbles onto the cult. The film is played out as both a spoof of film noir (with some Columbo/Perry Mason-style detective shows thrown in) AND horror films (naturally THE TEXA S CHAINSAW MASSACRE), and it actually succeeds! Of course, you also have to be willing to deal with some bad lighting and grainy photography associated with budget restraints, but that's forgivable, I think.<br><br>I agree with the mention of choreography--this has two hilarious (and damn sexy) dance sequences with Michelle Bauer and Linnea Quigley in the buff (the latter doing the \"Virgin Dance of the Double Chainsaws\"), that should please their fans. Richardson is a howl and Hansen gets a few funny moments in there as well, though he's not nearly as animated as the leading ladies or Richardson. Nearly every line of dialogue is extremely campy and whoever scripted this thing has a playful ear for puns and wordplay. There's also plenty of blood/gore (I think Steve Johnson did some of it), a few AIRPLANE-style gags and a great mock- Elvis song for Michelle to dance to. In short, a must see for fans of B-movies and probably Fred Olen Ray's finest hour.<br><br>Score: 7 out of 10.","user":"capkronos","rank":[20,23]}]