[{"title":"Nixon did indeed see this movie.","rating":24,"date":"24 December 2002","review":"In response to the reviewer who wondered if Nixon saw this movie, He did indeed.<br><br>Richard Nixon viewed the movie before it was released and changed his phone carrier because he objected to the movie's portrayal of him and Watergate. (AT&amp;T was the sponsor)  As I recall, prior to the movie's broadcast to the nation, AT&amp;T released a prepared statement in response saying that they valued all of their customers including Mr. Nixon but that they believed that the film's portrayal was fair and accurate.<br><br>I would have to agree.  Indeed I found the film's treatment of Nixon to be sympathetic to the man without being an apology of his actions.<br><br>Lane's performance was brilliant and was well supported by the rest of the cast.  I give the screenplay high marks for its historical accuracy and effective pace.","user":"KenClement","rank":[8,8]},{"title":"Haven't seen it since 1989, but remember it as being excellent","rating":8,"date":"28 May 2010","review":"Thirteen years before it was filmed as a TV-movie, \"The Final Days\" was the title of a bestselling book, whose 1976 publication \"just happened\" to coincide with the cinematic release of \"All the President's Men\" (based on an earlier book by the same authors). The Final Days book was noted for its complete reliance on anonymous sources, and for its witheringly negative portrait of Nixon and his personality, even including humiliating details about the Nixons' marriage. Shortly after it was published, Pat Nixon determined to read the book (against her husband's advice), and suffered a stroke within a day or two after she started on it. She was in hospital for about a month. All in all, TFD was probably the most sadistic literary attack ever leveled on a living ex-President up to that time.<br><br>With all that background, it seems very unlikely to me that Nixon, personally, sat through the TV-movie version of \"The Final Days\" when it came out in 1989. My guess is that he had one or more staff aides watch it; possibly Tricia/Julie and/or their husbands, but that he himself couldn't bear the thought of it. But who knows for sure. Nixon's office put out a press release at the time, saying that sponsor AT&amp;T should change its slogan to \"Reach Out and Smear Someone\", which (IMO) was rather clever.<br><br>The movie itself was highly praised by William F. Buckley, Jr., who specifically singled out the performance of Lane Smith as impeccable. Despite misgivings about the source-material, I watched it (I think it was broadcast on ABC, if I remember correctly) and was mesmerized. The whole show was simply brilliant from start to finish. Smith's performance as Nixon is, indeed, flawless, and the overall atmosphere of the last 15 months of the Nixon White House was nicely judged, in my view. \"The Final Days\" is absolutely one of the small handful of TV- movies with an abundance of dramatic power and credibility, and with the ability to withstand repeated viewings.<br><br>The Watergate Affair, of course, is simply too complex of a story to be dealt with adequately in this format, so people who do not already know the ins-and-outs of that scandal should know that this is not the place to learn about it, except in very basic outline. But if the movie paints Watergate with (necessarily) broad strokes, at least those strokes were true, in my recollection.<br><br>A couple of minor details that seemed off-key: The Washington Post newspaper was renamed as the \"Washington Herald\" or something like that. I'd like to know why that change was made. Also, I have no complaint with David Ogden Stiers as a performer. But there's just nothing about the man -- in appearance or personality -- that resembles Alexander Haig. A curious casting decision.","user":"mobile707","rank":[6,6]},{"title":"Eerie portrayal","rating":9,"date":"22 February 2001","review":"Lane Smith who played Perry White on the Superman TV series is positively riviting as Nixon.  He has Dickie's mannerisms down pat and is even better than Anthony Hopkins was in Stone's \"NIXON\".  This is a great follow-up to All The President's Men and shows how it all fell apart around Dick at the end.  The scene of Nixon &amp; The Russian Premier in the Lincoln Continental at Camp David is priceless.","user":"BILLYBOY-10","rank":[9,10]}]