[{"title":"Something you didn't know about Jewish immigrants","rating":8,"date":"11 August 2003","review":"This is an engrossing thriller -- clearly in the vein established by Hitchcock -- and very much like Brian De Palma's carefully structured style. This is the first Jonathan Demme film I saw and I expected him to work more in this genre.  Fortunately, he directed a cornucopeia of film in various styles that vary between intriguing and amazing:  including \"Melvin and Howard,\" \"Stop Making Sense,\" \"Philadelphia,\" and one of the best films for repeat viewing, \"The Silence of the Lambs.\"  This film stands out from the standard murder mystery in that it presents a non-standard view of Jews who immigrated to the US.  To divulge more would spoil the film.  Roy Scheider is perfect and Janet Margolin is beautiful.  In addition , now -- nearly 25 years later -- it is fun watching Chris Walken, John Glover and Mandy Patinkin early in their careers.  It is funny to realize that Margolin, Walken and Glover were all in \"Annie Hall\" two years earlier.","user":"myschrec","rank":[21,22]},{"title":"Surprisingly Good,Cultish Hitchcockian Thriller","rating":7,"date":"2 June 2006","review":"A very decent effort from director Jonathan Demme before he went on to better things,LAST EMBRACE is inevitably compared to the works of Alfred Hitchcock,with many scenes derivative from many of the master's most famous works(VERTIGO,THE MAN WHO KNEW TOO MUCH,STRANGERS ON A TRAIN,etc.),but this is actually an effective suspenser in it's own right,with an intriguing plot,good performances and an exciting finale.Roy Scheider plays a Secret Agent just released from care after suffering a breakdown after his wife was killed in a shootout in a restaurant.After finding a woman(Janet Margolin)who has moved into his flat,he begins to suspect someone is trying to kill him after sinister messages in Amharic keep turning up.<br><br>The film would've been more superior with more humour and better pacing,but nevertheless this isn't at all a bad Hitch imitation,with the bird imagery(a motif Hitchcock used frequently in his films)and a fine musical score by Miklos Rozsa(who had himself worked with Hitchcock on SPELLBOUND)adding to the atmosphere.The performances are fine,especially Ms Margolin,an undervalued and lovely actress who never quite made it to the top,making her character quite pitiable despite her actions.Her early death at the age of 50 in 1993 was indeed a sad loss for a film performer who deserved better.<br><br>LAST EMBRACE was made shortly before Hitchcock's death in 1980;one wonders did he ever see this film? If so,I think he would have quite enjoyed the homage on view,not great,but fairly respectful and entertaining.","user":"BJJManchester","rank":[19,20]},{"title":"Last Embrace: When Harry Met Ellie","rating":8,"date":"10 December 2010","review":"Although Jonathan Demme's 1992 Oscar-winner THE SILENCE OF THE LAMBS was his first major suspense thriller, it wasn't the first film he'd ever made in that genre. That honor goes to Demme's 1979 thriller LAST EMBRACE (LE), which I first saw and loved during its original theatrical run. At the time, LE was touted as a romantic Hitchcockian thriller. While LE definitely has strong elements of VERTIGO and other Hitchcock classics, I've always considered it to be more of a paranoia thriller with film noir touches, which I guess makes LE what might be called \"film shachor.\" :-) Cool, craggy yet suave Roy Scheider had long been one of our family's favorite tough-guy actors; to many fans. At first glance, he might not seem vulnerable enough to be convincing as a beleaguered paranoia film hero. However, Scheider proved to be perfect casting as Harry Hannan, a government agent with more baggage than Louis Vuitton. Harry is still heartbroken and guilt-ridden about his beloved wife getting killed while she accompanied him as cover on one of his assignments. After he spends time in a Connecticut sanitarium recovering from his nervous breakdown, Harry has barely had a chance to lose his institutional pallor when he's almost shoved in front of an express train. When he returns to his spy agency in New York City, his slippery spymaster Eckart (Christopher Walken) keeps him at arm's length; maybe Eckart thinks Harry's sharp cream-colored suit makes him too conspicuous for undercover work. Worst of all, Harry discovers he's one of several Jewish men getting death threats written in Biblical Hebrew from an unknown \"Avenger of Blood\"and so far, he's the only one still alive.<br><br>Everyone scoffs at poor Harry's jitters. Who can he trust? Certainly not his brother-in-law (Charles Napier), a fellow spook who blames Harry for his sister's violent death (\"You're careless with people, Harry\"). Our hero eventually joins forces with Ellie Fabian (Janet Margolin), a pretty New York graduate student who sublet his apartment while he was in the sanitarium. But the vulnerable Ellie seems to have her own issues and secrets. Will that spell doom for both Ellie and Harry? And how does a turn-of-the-20th-century Jewish brothel figure in the sinister fix Harry has found himself in? Scheider and Margolin had fine chemistry together; their characters' sensitivity and wariness made me feel for them, and they even had playful moments along the way. Ms. Margolin was at her loveliest, too. (Sadly, she died of ovarian cancer in 1993 at the age of 50. Janet, we hardly knew ye.) Scheider, Margolin, and Walken are aided and abetted by a rogues' gallery of stellar New York character actors, including John Glover as Ellie's insecure professor boyfriend; Marcia Rodd as Harry's nervous agency contact; David Margulies as a rabbi with connections; Joe Spinell and Jim McBride as thugs; Captain Arthur Haggerty as a bouncer waiting to use the phone; Mandy Patinkin and Max Wright in bit parts as commuters who may or may not have some 'splainin' to do; scene-stealer Sam Levene as the crotchety but likable head of a secret Jewish society; and director Demme himself cameo-ing as a stranger on a train.<br><br>Some critics complained that despite Demme's obvious affection for the Hitchcockian material, LE could have used more of The Master of Suspense's zest and verve. I won't deny that the pace slows down at times, but with Roy Scheider at his peak and Janet Margolin's touching, multifaceted performance, I was willing to be patient. Demme and screenwriter David Shaber (adapting Murray Teigh Bloom's novel The 13th Man) make up for the film's flaws with plenty of appealingly quirky Demme-style characterization. Judaism's key role in LE's plot was fresh and intriguing, as well as making excellent use of an elaborate, well-crafted red herring. The settings contribute to the film's Demme-ness; his ace Director of Photography Tak Fujimoto really makes the New York City and Princeton, NJ locations integral to the plot and its Hitchcockian motifs, especially the bell tower sequence and an exciting climax at Niagara Falls (I can hear you making lewd jokes :-)). The film brims with only-in-New-York characters and situations; for instance, the competition for living space in Manhattan provides amusing undertones to Harry's first awkward encounters with Ellie. Miklos Rozsa's swooningly romantic yet foreboding score pulls together the film's emotional undercurrents beautifully. Between LAST EMBRACE and STILL OF THE NIGHT, if I'd been Roy Scheider, I'd have stayed out of Central Park and environs for fear of elusive assailants! LAST EMBRACE is also available on DVD: http://www.mgm.com/view/movie/1084/Last-Embrace/","user":"dtb","rank":[9,9]}]