[{"title":"If it looks good, you're halfway there. Stewart is great, the plot routine but excellently routine...","rating":31,"date":"31 August 2011","review":"The Far Country (1954)<br><br>Anthony Mann and Jimmy Stewart made a few movies together, and one is a cool black and white affair, but this is one of his searing Technicolor productions. It almost has a comic flair even as the world is cut and splintered in the first twenty minutes until the real story begins--cattle driving in Alaska. Stewart of course plays a congenial sort, but his character Jeff Webster has a history of killing a couple men and having a little vengeance in his heart, and when he is coerced into this new job you know it isn't going to go smoothly.<br><br>This is an odd story told with an odd tilt to it, and that's a good thing overall. And it's set in Alaska (near the Yukon), which gives it more of a frontier/prospecting feel than a standard Western. In addition to Walter Brennan who is his usual quirky best, the leading woman is Ruth Roman, who had a career something short of stardom, and she plays a tough but elegant frontier woman well. And there is a perky younger women (a French actress named Corinne Calvet), a kind of tomboy who has the hots for Webster. It doesn't quite work, but it's fun, and it's part of the series of conflicts all operating at the same time.<br><br>There are some small flaws you have to overlook, like the day for night that is more day than night (which is only emphasized by some brilliant night filming at the end of the movie, night for night done to perfection). But there is a bigger tension that keeps things really interesting, too. Two extremes of women after one singular guy--that's enough for any movie. And there is the sheriff and judge and power-monger in town who is ruthless with a laugh and cackle, and he makes a great villain.<br><br>I'm not interested in movies for their scenery, but it's worth noticing the amazing mountain country that is the setting here. There are also the standard moments that don't really add to the plot, but to the mood--some barroom singing, some riding through the scenery. But what really makes the movie is Stewart's role as an individualist, a man who is looking after himself first and last. Brennan acts as his conscience, reminding him to be a good guy, and Stewart, to his credit, listens.<br><br>Heroics come slowly in a Mann Western. You suspect Webster is a good person deep down, but his goodness has a slow coming out. And in a way, even by the end, the ambiguity is there--it's the good townspeople who rise up and get their justice. <br><br>A good movie, a very good Western.","user":"secondtake","rank":[23,26]},{"title":"\" And I want that coffee ground.\"","rating":7,"date":"8 June 2008","review":"Stewart is a Wyoming cattleman who dreams to make enough money to buy a small ranch in Utah ranch His only real companion is his sidekick Ben Tatum, the great Walter Brennan To accomplish that, they drive the cattle clear to Alaska and on to Dawson, in Canadian territory, where they sell them...<br><br>Along the way they meet the man who runs the gold-crazy town behind a dishonest lawman John McIntire... He attempts to steal them the herd... Later, in Dawson, McIntire and his gang reappear, this time interfering with Stewart's gold claim... <br><br>Captured by Mann's camera in the wonderful scenery of the Canadian Rockies, Stewart is a thoughtful loner forced into violence by his need to get rid of the treacherous actions of a corrupt entrepreneur robbing local miners of their claims<br><br>In this entertaining, beautiful Western, Stewart has two leading ladies to struggle with: Ruth Roman, a bit too valuable to describe as a sexy woman resisting the worst vicissitudes of the territory and the more docile, the French Canadian girl Corinne Calvet who does create a nice portrait of a likable girl with the ability to form a judgment... In spontaneous manner, Stewart is lost between the ostentatious saloon owner and the wife-candidate...","user":"Nazi_Fighter_David","rank":[41,51]},{"title":"Is there something you want, Mr. Gannon?","rating":8,"date":"19 November 2009","review":"Cunning Western from a director who had few peers in the genre. Much like other Anthony Mann pictures, The Far Country blends a potent pot boiling story with an adroit knowing of impacting scenery. Both of which play out amongst some of Mann's peccadilloes like honour, integrity, betrayal and of course, death!<br><br>The story sees fortune hunting partners Jeff Webster (James Stewart) and Ben Tatum (Walter Brennan) travel to Oregon Territory with a herd of cattle. Aware of the blossoming gold-boom, they plan to make a tidy profit selling the cattle in a Klondike town. Arriving in Skagway they find self-appointed judge Mr. Gannon (John McIntire) ready to meet out justice to Webster on account of Webster having fractured the law, all be it with honest cause, along the way. In punishment Gannon takes the partners herd from them, but they steal them back and head across the Canadian border to Dawson - with Gannon and his men in hot pursuit. Here beautiful women and a meek and lawless town will fill out the destinies of all involved.<br><br>Interesting from start to finish, The Far Country benefits greatly from James Stewart's bubbling (anti) hero in waiting portrayal and Mann's slick direction of the tight Borden Chase script. The cinematography from William H. Daniels is superlative, though not done any favours by current DVD prints, and the film has a few surprises and a \"will he wont he?\" core that's reeling the viewers in.<br><br>Paying dividends on re-watches for hardened genre fans, it still remains something of an essential viewing for first timers venturing into the wonderful, yet dark, Western world of Anthony Mann and James Stewart. 8/10","user":"hitchcockthelegend","rank":[27,35]}]