[{"title":"Realistic Performances","rating":6,"date":"23 April 2005","review":"While this one came out around the same time as other 'Body Swap' movies, and is usually blown off by most people as an inferior product. I just want to defend this flick for a bit.<br><br>Yes, it's a bit predictable, the script isn't the best out there, and it will never be considered a great classic, but the performances of Messrs. Reinhold and Savage are completely believable. In fact, I thought Reinhold's work in this one got overlooked. I'm not complaining about Tom Hanks' job in 'Big,' but I thought that since Hanks was playing an adolescent boy in a man's body, he played it a bit young. Reinhold, on the other hand, was playing a 9 or 10 year old boy, therefore his portrayal was easier to buy into.<br><br>Fred Savage does a very good job as the thirty-something man trapped in the body of a boy. The real selling points of these portrayals is in the details. Watch as Savage gives his 'son' encouragement, or Reinhold's uncertainty in dealing with the world.<br><br>As I said, a classic? Nah, but a fun afternoon of family entertainment? You bet!","user":"jew_59","rank":[22,22]},{"title":"The best of the bunch","rating":6,"date":"6 March 2003","review":"This movie is not the one people think of when talking about those \"body switching\" comedies that came out between '87 and '89. Big always gets the attention, but for my money Vice Versa is funnier, smarter and more memorable.  Judge Reinhold didn't get the Oscar nomination that Tom Hanks scored, and more or less dropped off the face of the earth after making this movie (except, of course, for \"Daddy's Dyin'...Who's Got the Will\").  He was in several '80s blockbusters and stole many scenes in them (Fast Times at Ridgemont High, Beverly Hills Cop and its sequel, Ruthless People....)  But this movie is his shining hour, where he is believable and funny as both the uptight adult and the 11-year old kid. Fred Savage is equally good--very convincing when he becomes his dad.  The movie builds up its jokes nicely, and has a Capra-esque quality to it.  It also makes terrific use of character actors Swoosie Kurtz and David Proval, who is light years away from his Sopranos character.  The fact that this movie is lumped in with lesser films like 18 Again and Like Father Like Son baffles me.  This one is definitely in the league with Big.","user":"drosse67","rank":[34,37]},{"title":"Hilarious comedy/fantasy","rating":9,"date":"20 September 2001","review":"\"Vice Versa\" is a very funny, very sweet comedy about a father and son who switch bodies thanks in part to a mysterious Thai skull that they both just happen to be touching at the same time (not to mention making an unintentional wish that they could trade places with each other). Judge Reinhold (\"Beverly Hills Cop\") and Fred Savage (TV's \"The Wonder Years\") are dynamite in their roles as the father and son who have to get used to doing things that they're not used to doing (the father goes to school; the son goes to work, etc.). \"Vice Versa\" has lots of big laughs and is perfect for the entire family. The film, shot almost entirely in Chicago, also uses the Chicago locations to good effect. A hilarious film from start to finish, and it's easily the best of the body switching movies that came out in 1987/1988 (\"Like Father, Like Son\", \"18 Again\", and \"Big\" were the others). I still can't understand why this movie flopped at the box office in 1988. The thing that shocks me is that \"Like Father, Like Son\" was the worst of these movies, and it made more money than \"Vice Versa\". I can't figure that one out. \"Vice Versa\" has 100 times more laughs than \"Like Father, Like Son\" ever had. Sometimes I can't understand these moviegoers. And in this case, the fact that \"Vice Versa\" faired poorly at the box office when released in 1988 to me remains an enigma. I saw this movie in a packed movie house on it's opening weekend and everyone (including myself and a friend of mine) was laughing out loud while watching it. It's that funny of a movie.<br><br>\n***1/2 (out of four)","user":"jhaggardjr","rank":[19,21]}]