[{"title":"Sharp and outrageously entertaining","rating":10,"date":"26 December 2013","review":"I never really bought into the Kubrick hype. I mean: don't get me wrong; I like all of his films very much - but to me, they all feel somewhat over-constructed and lack a natural flow. And then I finally got to see 'Dr.Strangelove'. Wow. What a terrific, pitch black satire. This film is so wild and mean and funny - and Peter Sellers gives THE performance of his career. Unlike in any of Kubrick's later works, there's a sense of playfulness here that gives the whole movie a crazy kind of energy; I'm guessing that Seller's love for improvisation forced Kubrick to ditch his usual perfectionism to a certain degree (and the film is all the better for it). Sharp, outrageously entertaining comedy/satire by one of the most revered directors of the past century. 10 out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[147,167]},{"title":"\"Gentlemen, you can't fight in here! This is the War Room.\"","rating":10,"date":"29 July 2017","review":"DR. STRANGELOVE.... is a satirical black comedy or rather an ironic approach to decisions and information in the Cold War madness. The smart choice is the mother of all wisdom. It is loosely based on Peter George's novel \"Red Alert\".<br><br>A crazy American general has ordered, due a bizarre reason, a nuclear attack on the Soviet Union. A bit absentminded captain has realized that a general has lost his mind. Meanwhile, a President meets with his top Pentagon advisors, including a passionate super-hawk general, who sees this as an opportunity to do something about Communism in general and Russians in particular. However, the Russians have an \"automatic\" response...<br><br>This film loses all touch with the reality on the one side, and yet, it directly affects an image of a disturbed political reality on the other side. The irony stems from human stupidity, irresponsibility, suspicion and arrogance. Mr. Kubrick has created a satirical hopeless situation, through a conflict of mentality and a sense of patriotism, after which, a bizarre - moral winner rises. The highlight of satire is that world diplomacy rejects itself on multiple occasions.<br><br>However, there is a lot of questions. Why give so much power in hands of a few people? One of them, I mean all, are mostly crazy. Why use energy resources to build nuclear weapons? Probably because we do not have better things to do. Is it wise to make fun of a defense system of the strongest force in the world? Of course it is, one day, we have to stop being afraid of each other.<br><br>That's why this film is a satirical warning in an universal time, because we live in a time of a political satire with very serious consequences.<br><br>I am thrilled with a fact that this film does not have a trace of cynicism. Of course, there is plenty of satire, sarcasm, irony, perhaps exaggerated caricature, but there is no cynicism. Mr. Kubrick, you're a genius! The characterization is excellent.<br><br>Peter Sellers (Captain Lionel Mandrake, President Merkin Muffley and Dr. Strangelove, the wheelchair-using nuclear war expert and former Nazi) is simply awesome as a kind of voice of reason, incompetence and insanity at the same time. It is a strange kind of patriot, savior and avenger.<br><br>Sterling Hayden (Brigadier General Jack D. Ripper) is a paranoid ultra-nationalist, who shows his madness through a serious facial expression.<br><br>George C. Scott (General Buck Turgidson) is the personification of chauvinism. He expresses his anger and paranoia of communism in a very comical way.","user":"elvircorhodzic","rank":[33,37]},{"title":"Laughing at Fear","rating":10,"date":"14 August 1998","review":"What makes this film so powerful is the message that it made at the time of its release. This film came out at a height of paranoia of the nuclear age and the Cold War, right around the time of the Cuban Missile Crisis. This film depicts a horrible, tragic incident in which a breach in the government and a few diplomatic mistakes result in nuclear holocaust. So, why didn't this film inspire panic? Because of the brilliant way in which Kubrick presents it... as a satire. The scariest thing about this film in retrospect is not how it depicts the impending doom of the Cold War, but how it makes you laugh at it. By presenting it with humor, it conveys just how much of a farce the nuclear arms race was in real life. And I don't think that any other film has captured the absurdity of war nearly as well as this one has. And I am not likely to believe that one ever will. In my opinion, Kubrick has never made a better film since. And kudos to George C. Scott for his astounding performance, as well as Peter Sellers for the most versatile acting I've seen from an actor in one film, and to Sterling Hayden, for performing the most serious, yet the most hilarious role in film with perfect accuracy. Beware of fluoridation!","user":"Sickfrog","rank":[357,470]}]