[{"title":"Blazing a New Professional Trail for Women","rating":21,"date":"21 August 2007","review":"Barbra Streisand has referred to herself as 'an actress who happens to be a singer'. I doubt I am alone in viewing her professional legacy in the reverse: as a great singer who happens to be an actress . . . director, producer, screenplay writer, musical score composer, humanitarian, and lately, concerned with using her production and direction talents to bring out important social issues (like ageism--\"The Living Century\" is about centurions--people a hundred years old or more).<br><br>\"Yentl\" marks the beginning of a woman blazing a new trail as a director, singer, composer, her hands in the screenplay, and production. She's spoken in a segment on \"The Directors,\" about how various cultures have treated her as a result of her deliberate transcendence of Hollywood's gender-biased boundaries. One of her most interesting points reveals how well she was treated in England by the British filming crew. Since gender-bias against women is not even comparable to gender bias in the US, because England is so far advanced beyond gender discrimination because one is a woman, Streisand remarks how much easier it was for her to accomplish her goals on the set because the British film crew treated her without gender-bias, and with the respect she is certainly due.<br><br>\"Yentl\" royally upset the AFI in the US because Streisand entered into no woman's land when she had a hand in nearly every aspect of the motion picture. \"Yentl\" has some of the most memorable, touching, humanely familiar music and lyrics, yet it received no Academy Award. The direction was brilliant--no Academy Award. The screenplay was one that was serious, hilarious, religious, spiritual, and even addressed the issues of gender-bias head on--no Academy Award. Streisand's and Amy Irving's acting was stupendous--no Academy Award.<br><br>Streisand paved the way and took the non-recognition by the Film Academy without stopping. This musical motional picture pales many that are classics. The story is an extra interesting one, the likes of which have not been reproduced with anything close to as much skill and class.<br><br>I'll give this classic about six Academy Awards, including several that go to Streisand alone.","user":"BetteDavis08-89","rank":[51,72]},{"title":"A TREMENDOUS ACHIEVEMENT","rating":10,"date":"29 September 2004","review":"Reading the few awfully and derogatorily negative reviews for this film here on the IMDb, it still befuddles me about the total oppression and negativity that people throw out of their mouths without expressing themselves in a more precise and intelligent manner, mainly on a film that presents such important issues and social commentaries. Even though the film is set in the past, all it says is still very noteworthy and easy to relate to in the past few decades and definitely in the decades to come.<br><br>YENTL is a film to be shared and enjoyed regardless of ethnicity, religion or background. Its universality speaks and raises voices to different generations and social groups.<br><br>Motivational, moving and exquisitely shot with rich period flavor and mood (AND THIS IS WITHOUT HAVING SEEN THE DVD YET, SINCE IT IS NOT AVAILABLE, AND MS. STREISAND HERSELF NOTED THAT THE COLOR TINT ON THE VHS TAPE IS INCORRECT, SOMETHING SHE HAD CORRECTED FOR THE UPCOMING DVD), this is the type of story about conquering your fears and stop at nothing to achieve your dreams that is fatally missing from films in our present time.<br><br>If there is an aspect to this movie that is the most formidable, it's the music and songs in it that's what is most successful about it, since they carry the story as it progresses through its tale of passion, love, struggle and perseverance.<br><br>Ignorance has kept the film from being enjoyed and appreciated by several groups and individuals. Hopefully someday they will find the courage and wit to understand such incredible gem.<br><br>\"NOTHING'S IMPOSSIBLE\"","user":"joelovesbabs","rank":[76,115]},{"title":"An absolute triumph","rating":10,"date":"20 April 2006","review":"Streisand's directorial debut is easily her most passionate and personal film to date. It was hailed by Steven Spielberg as the \"best directorial debut since Citizen Kane,\" and I am in complete agreement. Streisand worked for more than 15 years on bringing this film to the big screen, and it was well worth the effort. YENTL is an absolute triumph Every single aspect of the film works flawlessly: the story is clever, the dialogue is extremely well-written, the cinematography is beautiful, and the performances are first-rate.<br><br>Many critics and fans found Streisand's performances in A STAR IS BORN and THE MAIN EVENT to be labored and overly-mannered. However, there is little doubt that she once again emerges as a true actress in Yentl. As a matter of fact, Streisand's pitch-perfect portrayal of Yentl/Anshel is quite possibly the best performance of her legendary career - I simply cannot think of any way her performance could be bettered. Broadway tenor Mandy Patinkin is terrific as the object of Yentl's affections; it is a role which should have made him a huge screen star. The character of Haddass could have easily turned into a thankless role, however Amy Irving brings a layered depth to the part that many other young actresses could have glossed over.<br><br>YENTL is also showcase for the wonderful music of Michael Legrand (with outstanding lyrics by Marilyn and Alan Bergman), and the film uses these songs to brilliant effect. There are no production numbers, nor singing out in the street. Except for the finale, Streisand only sings when she is completely alone or silently as a voice-over. The songs take the place of spoken soliloquies and represent Yentl's private thoughts. This device has a great Shakespearean feel to it and (along with Streisand's ever passionate singing) help cement the film into the realm of fantasy. Though YENTL was infamously snubbed by the Academy Awards, justice was served when Streisand was awarded with the Golden Globes for Best Picture and Best Director, the first female to ever win the latter honor.<br><br>Appropriately for a musical, the film's song score is first-rate. Composer Michael Legrand is an unrecognized genius, and his score is both complex and inviting. Alan and Marilyn Bergman have penned the lyrics to many of Streisand's best-loved recordings (the #1 hits \"The Way We Were and \"You Don't Bring Me Flowers,\" just to name a few), but they really outdo themselves here. Their words and Legrand's music complement each other perfectly, and their collaboration is largely the reason the film's score is as consistent and as cohesive as it is. <br><br>However, the main factor to YENTL'S artistic success is the phenomenal vocal performance of Barbra Streisand. The songs for this film were recorded twenty years after her official studio debut, and she has never sounded better than she does here. Whether the tone of the song is anguished (\"Where Is It Written,\" \"Tomorrow Night\"), euphoric (\"This Is One of Those Moments\"), or incredibly sensual (\"The Way He Makes Me Feel\"), Streisand's hushed restraint and dramatic range are nothing short of incredible. Her phrasing is put to excellent use in \"Will Someone Ever Look At Me That Way\" and the three renditions of \"No Wonder\" (each with different lyrics and a different meaning), while both \"No Matter What Happens\" and \"A Piece Of Sky\" are terrific showcases for Streisand's astonishing vocal prowess. <br><br>YENTL also marks the first appearance of \"Papa, Can You Hear Me,\" which instantly became one of Streisand's signature songs due largely to her intensely soulful performance. YENTL is a motion picture that is very close to the heart of many Streisand fans. It is a project that Streisand believed in with all her soul, and both the film and its soundtrack remain near the top of the list of the best things any popular artist has ever done.","user":"robb_772","rank":[32,48]}]