[{"title":"Dreams of a young girl","rating":10,"date":"20 August 2004","review":"A \"coming of age\" story like no other, this Czech Gothic fairytale is possibly the most lyrical film ever made. Valerie, a 13 year old staying with her grandmother while her parents are away has her first menstruation, triggering a series of interlocking dreams about lustful vampires who prey upon her youth. Despite the monstrous goings-on, the film is a buoyant and sensual pleasure to watch. The camera-work and composition never ceases to amaze and the energy of its tuneful folklike score propels the convoluted story forward effortlessly. And much credit should be given to Jaroslava Schallerova as Valerie who inhabits the role with the right balance of knowledge and wonder","user":"mobia","rank":[72,81]},{"title":"One of the best movies I have ever seen!!!","rating":10,"date":"8 May 2000","review":"Awesome is not the correct word for this movie; I just did not want it to end. This film will have me searching for everything Jaromil Mires directed. The movie is great because of so many reasons. The camera angles that hover overhead, or come from the ground looking up. The surreal affects that make each scene magical and wonderful. The awesome photography with elements mixed with candles, water, fog, smoke, and yes-even cobwebs. A movie that is erotic in nature, with surreal images that cross between Vampires, Alice in Wonderland, Little Red Riding Hood and the Zombies. It turns each second of this movie into a living masterpiece.<br><br>I won't mention the plot, however I WILL mention the sheer beauty of 13-year-old Valerie. What a beautiful girl, she makes this movie. Valerie And Her Week Of Wonders... you have my vote!!!","user":"steveo-21","rank":[37,45]},{"title":"Coming of age has never been so terrifying","rating":10,"date":"17 April 2010","review":"Beautiful, disturbing, erotic, dreamlike... These are a few words that can sum up Jaromil Jires' deliriously bizarre fairy tale \"Valerie and her Week of Wonders\". Just like Richard Blackburn's sinister \"Lemora, a Child's Tale of the Supernatural\", \"Valerie\" is a 'coming of age' tale told through a monstrous metaphor: vampires, who prey on the young to drain their innocence. Despite similarities theme-wise, these two films are quite different, and \"Valerie\" is clearly superior - a film that will definitely haunt you for life, with images so shocking today as they were back in 70's when it was released. It is 'horror' of rare ethereal beauty and poetry, and definitely one of it's kind - perfectly capturing the fear, the curiosity and the pleasure of a little girl's sexual awakening. Jaroslava Schallerová is spellbinding as the title character - a combination of Lewis Caroll's Alice and Vladimir Nabokov's Lolita, and manages to convey both the purity and the sensuality that the role requires. Kudos for her doing such 'depraved' scenes involving incest and lesbianism, that are surely unthinkable today. Helena Anýzová also gives a harrowing performance in the role of the grandmother, and her gradual transition from repressed Catholic old lady to a seductive, sex-crazed vampire is exquisite. Last but not least, Jires' excellent direction and Jan Curik's lush cinematography that highlights the film's \"fever dream\" tone help create this brilliant work of art that captures the essence of the ethereal and lyricism on celluloid unlike any other.","user":"matheusmarchetti","rank":[17,19]}]