[{"title":"THE CENTURY'S MOST UNDERRATED FILM","rating":10,"date":"13 September 1999","review":"I saw Heaven's Gate on its opening week nearly twenty years ago. Tickets were sold in advance based on the great anticipation of seeing Cimino's long in the making follow up to his 1978 masterpiece \"The Deerhunter.\" The reviews came in and critics trashed the film with vehemence. An influential New York film critic led the way and most critics followed suit, and the 3hr. 40-min. film was pulled from distribution. United Artists had Cimino shorten the film by about an hour and it was re-released many months later to equally horrible reviews and to dismal business. The film at that time cost about 40 million dollars (now considered low budget) making it one of the most expensive in history and Cimino had free rein on the project with endless retakes despite it being only his third film. \"The Deerhunter\" had also received a negative backlash based on a perceived political ideology, which was not popular. I mention all this to present a possible bias building up against Cimino.                        At the time I thought the film was very good and when I saw the shorter version it was still very good only less so. The film showed up again in a museum in the early 1990's. They were supposed to show the long version but they could not find an existing print. Nevertheless, seeing the film years later I now thought Heaven's Gate was a masterpiece. Finally, the long version started to appear in a few select cities, I got to see it recently and it was well worth the wait. Heaven's Gate begins with the graduation ceremony at Harvard University. Two of the graduates are Kris Kristofferson and John Hurt and we some of the flaws in their characters early on. Despite the mandate Joseph Cotton gives in his speech to the graduating class to use their education to enlighten and improve their country, many of the graduates behave as if they are part of an elite country club. The film flashes ahead 20 years to Johnson County in Wyoming. A cattle company called \"the Stockholders Association\" has hired poor people to shoot 125 poor immigrants claiming they are cattle thieves. Kristofferson sides with the immigrants while John Hurt is part of the Association. Although Hurt is totally against this insane action he is too ineffectual a character to do anything about it.                             A massacre takes place but the immigrants do well in defending themselves. A United States Cavalry comes to the rescue of the Association  to allegedly arrest them after most of the damage has been done when in fact they sanctioned the mass killing. Kristofferson also suffers a great personal loss and the film ends with him years later as part of the elite class of his Harvard days married, bored, on a yacht, living but dead on the inside.<br><br>This is a very complex film which is brilliant in every department such as it's themes, structure, direction, cinematography, writing, music, editing, set designs, and acting.   Kristofferson, Walken, Hurt, Huppert, Dourif, Bridges, Waterston, and Cotton are all excellent portraying very complex characters. Some of the major complaints I read about this film state that is ugly to look at, incoherent, too long, that the characters make no sense and that the words are often unintelligible.             In its defense, Heaven's Gate has the look of photographs of that period just as \"McCabe &amp; Mrs. Miller\" did. Some of the scenes are smoky looking to suggest the industrial revolution or sometimes horses, wagons, people are passing by from all sides creating a sense of reality.(The critic who called it one of the ugliest movies ever made likes to use his thumbs a lot.) But in spite of all that, the composition of each frame and the cinematography are impeccable.                                                     The film makes a great deal of sense if you pay attention to it.  Everything is not spelled out for the viewer and one has to observe closely to understand the motivations of the characters or its themes. As to its length, it is a beautifully structured piece,  at times moving, poetic, exhilarating, or devastating with virtually one great scene following another. At times some of the words are unintelligible especially in some of the scenes bustling with activity. But one could understand such a cinematic film as this through its use of film language, the glances between characters or their actions. One day soon this film should be re-released in its full length so that people and critics could give it a second chance. Do not let Michael Cimino become another Orson Welles- under appreciated in his lifetime and not able to make the  kinds of great films he is capable of making.","user":"travis-46","rank":[204,283]},{"title":"don´t knock it til you have tried it","rating":8,"date":"24 February 2001","review":"I seriously don´t know why this movie got such a hostile reception when it was first released. Sure, it´s overlong and somewhat gratuitous in its depictions of sexuality and violence but so are lots of well regarded movies. I seriously don´t think that the people who hated \"Heaven´s Gate\" really understood it. \"Heaven´s Gate\" in its uncut form, much like \"The Deer Hunter\" shows the gross differences of living an insecure and dangerous life (like the immigrants and Averil in Wyoming) and living in comfort and privilege (like the settled \"Americans\" in Wyoming and Averil in the prologue and epilogue). Living a hard life is painful but it can also be invigorating as opposed to the dull life Averil leads in the epilogue. Also, as Michael Cimino took great pains to make the picture historically accurate , it is fascinating as a document of (and maybe indictment of) American life in Old West Wyoming. The dialogue is often genuinely clever and emotional. Combined with great music and cinematography, the movie works like a truly poetic work of art. Granted, \"Heaven´s Gate\", with its refusal to patronize the viewer, is not for all tastes. However, Hollywood turns out so much commercial dreck each year which is so much easier to dismiss as mindless eye candy (even when an example of it becomes a blockbuster) that \"Gate\" and Cimino really do deserve more respect.  All people should see the uncut version at least once and then they should make up their own mind.","user":"Cherubin","rank":[119,175]},{"title":"As the good book says, many are called but few are chosen... and most are damned.","rating":9,"date":"21 January 2007","review":"I first saw this film when released in 1980. From other sources, I've learnt that the only release of the 219-minute cut was in New York City, after which it was severely cut to 149 minutes. So, I guess I saw the shorter version first which, at the time, I thought, was a very interesting anti-Western, if a trifle confusing...<br><br>So, it was with even more interest that I finally obtained a DVD of the full-length version. I'm glad I did because this second viewing has confirmed for me that the movie is a true classic, and the critical vitriol poured on Michael Cimino was unwarranted, to say the very least.<br><br>Yes, it's a long movie, but so have been many others. For example: Once upon a time in America (1984) at 227 minutes; Cleopatra (1963) at 320 minutes; The Ten Commandments (1956) at 220 minutes; Spartacus {restored version} (1960) at 198 minutes; Gone with the Wind (1939) at 222 minutes and others. So, it can't be the fact of running time that made so many froth at the mouth way back, when Heaven's Gate came on the scene.<br><br>But note this: all of those above movies have everything to do with reinforcing myths about history and heroes.<br><br>Not so Heaven's Gate: in this narrative, the American West is shown in all its grim and unrelenting harshness, injustice, and poverty. And that's probably the first reason why so many disliked this film: it laid out the circumstances of the Johnson County War of 1892 in Wyoming, showing how the Wyoming Stock Growers Association hired 50 assassins to hunt down and murder a large group of European immigrants accused of cattle rustling; and all with the assistance and conniving of authorities, right up to the President of the United States. For an essay on that war, with the background and what happened, there is a link at Wikipedia under Johnson County War.<br><br>Very few like to be reminded of the really dirty periods in their country's history, and which fly in the face of what the country is supposed to be. Had it been a documentary, it would have been barely palatable for most; as entertainment, it was almost bound to fail commercially and be torn to shreds by the shrill and infamous.<br><br>Leaving aside the socio-political diatribe, for a moment, that Cimino launched herein, what about the narrative  the story of the three main characters? Well, it probably wasn't unusual for men of that time to fall for a local prostitute, just as it's probably not unusual now. It's a fairly standard love triangle whereby Ella must choose between the two men, and ultimately decides upon the younger man, Nathan, who, although not above resorting to cold-blooded murder when it suits him, shows more spirit and commitment than the older James (or Jim, as most people in the film say). For some, that part of the story threads too slowly, perhaps; in the context of the wider narrative about the war, however, it is, I think, entirely appropriate.<br><br>And that war is depicted graphically, viciously and cruelly with scenes of carnage that are exquisitely staged and edited flawlessly  although in the final massacre between the Association and the immigrants, I'm certain that some scenes of wagons blowing apart are repeated. A minor point and perhaps brought about when the 219-minute cut was restored? Any way you look at it, though, it hits you in the face with the noise, dust, chaos and confusion of war...<br><br>Which brings me to another criticism by others: the noise and dust is such that it's often difficult to hear the dialog and even see clearly what is happening. I'll admit that I found that to be a trifle annoying at first, even backtracking to replay parts to try to catch the image or the words  until I realized that really wasn't necessary if you accept the director's intent: life is chaotic, it is difficult to hear and see in crowded situations and, in war, it's the sine qua non of this mise-en-scene. In short, it's as though you truly are present in and within the scenes...<br><br>And what of the title? From Shakespeare, it refers to a figurative nearness to God and so, if you equate God with the natural world, the stunning scenery that pervades the movie  and it is stunning, hauntingly equal to that of David Lean's Doctor Zhivago (1965)  is a useful metaphor. I tend to think, however, that Cimino had something more to say, namely the idea that the brave immigrants  the God-fearing salt of the earth  were denied entry to heaven on earth and the freedom to build a life for themselves in the land that espouses to be freedom's champion.<br><br>Was that Cimino's intent  to gut the myth of the American West? To show how, in America, only the rich get rich while the poor are massacred, one way or another, throughout history? Is that anything new? Not really, as we all know. Where it really hurt, however, is in showing how America was not and, by implication, is not the land of the free and the home of the brave. Instead, after absorbing this narrative, we are left with an impression that the underpinnings of America have more to do with a land of dispossessed slaves and a home for knaves...","user":"RJBurke1942","rank":[120,182]}]