[{"title":"First class gorefest from the notorious Lucio Fulci.","rating":14,"date":"14 April 2002","review":"Like most of Fulci's horror movies and Italian horror in general, plot and logic take a back seat to gore and stunning visual set pieces. I don't think that 'City Of The Living Dead' quite reaches the heights of Fulci's best ('The Beyond') but apart from a few dull patches it comes closer than you would expect. The simplistic story, which tips it's hat to H.P. Lovecraft, is really just an excuse for another zombie move, and regardless of his shortcomings, Fulci certainly came up with some of the most repulsive and horrible zombies ever, so this is essential viewing to fans of the genre. The movie includes two unforgettable gore sequences ( the drill and vomit scenes), a chilling scene in a graveyard, and an odd, unexpected ending. Recommended to fans of Italian horror. Others might be puzzled if they haven't experienced the style/period before, it's quite a trip!","user":"Infofreak","rank":[39,49]},{"title":"Fulci's splatter film inspired on H.P. Lovecraft about the dead coming back to life at Dunwich","rating":6,"date":"18 September 2010","review":"This is a genuinely frightening story with correct utilization of images-shock , skill edition and eerie images . Lucio Fulci's main great success along with ¨Zombie 2¨ , is compelling directed with startling gory visual content . It's a creepy horror film plenty of brutal frames and gory events. Fulci's horror film about the dead coming back to life on a small location of Dunwich with inspiration on famous novelist H.P. Lovecraft . A journalist named Peter Bell (Christopher George), a psychiatrist (Carlo De Mejo) and a psychic named Mary Woodhouse (Catriona MacColl , Fulci's fetish actress) race to close the Gates of Hell after the suicide by hanging of a priest caused them to open , allowing the zombies to rise from the tombs . Gory, gruesome , pretty repellent , and ghastly gory-feast in which the stumbling flesh-eating stiffs are relived by an ancient curse .<br><br>Chilling Italian terror flick full of screams, shocks, chills, thrills and lots of blood and guts . Astonishing , mesmerizing , very repellent , and scary mess in which the living dead are reanimated and committing horrible murders . This is a classic excruciatingly terror film in which the intrigue,tension, suspense, horror appears threatening and lurking in every room, corridors , cellar , morgue, streets, cemetery and many other places . Watch for the great highlights as the alive burying and the pick-axe coming dangerously close to her head ; as when a drill punctures the face an unfortunate young -a Fulci's mark who repeats ad nauseam - and clergyman's mesmerizing stares making eyeballs bleed . And as always brief appearance of Lucio Fulci, in Alfred Hitchcock cameo style , as Police Inspector and a young future director of terror movies , Michele Soavi as hapless victim . Good make-up and special effects by makeup artist named Rufini replacing the usual maestro Gianetto De Rossi. Produced on a tight budget by Giovanni Masini and the same Fulci . Moody photography Sergio Salvati on location in Fort Lee, New Jersey, New York City, Savannah, Georgia, USA . Eerie musical score composed and conducted by Fabio Frizzi in Goblin style. The motion picture is realized by one of the most controversial filmmakers of terror movies ,Lucio Fulci , in his ordinary style with flaws and gaps but is professionally made because being a skilled craftsman . Reviewers are divided over booth the morals and talents of Fulci (1927-1996) who sometimes directed under the alias ¨Louis Fuller¨. For some critics many of his movies are cruel and shockingly violent , yet their gory surface often conceals religious, social commentaries or intelligent issues. Whether he should be viewed as a cheap sensationalist or just a genius Fulci has a loyal fan base and undeniably has an important and unique influence on the terror genre , creating great works on a low budget such as proved in ¨The Beyond¨, ¨Manhattan baby¨, ¨Gates of Hell¨, ¨Island of the living dead¨, ¨New York ripper¨ , among them . This is one more imaginative , though imperfect horror/splatter picture in which the camera stalks in sinister style . It's just one long unrelenting guts-feast and passable budget horror movie that still packs a punch for those who appeal to be terrorized out their wits . This gore-feast that tried to disguised itself under many other titles as ¨City of living dead¨ will enjoy to Lucio Fulci aficionados.","user":"ma-cortes","rank":[15,19]},{"title":"Nightmarish Vision","rating":11,"date":"11 October 2000","review":"Paura Nella Citta Dei Morti Viventi/City of the Living Dead(1980) was Lucio Fulci's followup to his international breakthrough and ultra violent zombie classic Zombie Flesh Eaters(1979).  Fulci ups the ante in violent imagery compared to Zombie(1979).  Unlike Zombie(1979), The Gates of Hell(1980) focuses more on atmosphere and dreamy landscapes then on story.  The film begins and ends with the scream of the main actress.  The opening scene is done with some skill.<br><br>\nThe scene where the hanged priest is superimposed between the iris of Mary Woodhouse is brilliant.  There is a medical element that is prominent in all of the director's horror films.  After all, Lucio Fulci at one point studied to be a doctor and spent some time in Medical school.  Lucio Fulci has a small cameo as a hospital examiner.  The zombies look cool and creepy.<br><br>\nThe Gates of Hell(1980) has some flaws in it.  one flaw is the sometimes erratic editing.  Another flaw is that there are a few dull moments that offset the film's brilliance.  Also, it has the look of a film that went through a rushed production.  Finally, the ending seems as if it was put together in the last second.<br><br>\nSergio Salvati did an excellent job as the director of photography. Although some scenes are too dark, most of the film is still well photographed.  The scenes with the camera moving around town are eerie with its light blue white fog and empty streets.  The shots of the underground cemetery is one of the film's eeriest parts.  The camera in The Gate of Hell(1980) as in Fulci's other horror films forces the audience to take a hard long look at the carnage occuring on the big screen.<br><br>\nThe make up effects are done with flamboyance by Gino De Rossi as Gianetto De Rossi was not available to do the effects.  The Gates of Hell(1980) would be the first in a three film series of gothic horror that included L'Aldila/The Beyond(1981), and Quella Villa Accanto al Cimitero/The House by the Cemetery(1981).  Anchor Bay Entertainment did the best job they could possibly do with what seemed to be an average print.  The Gates of Hell(1980) like many gothic novels were thought of as barbarous and crude. Lucio Fulci's next feature, The Beyond(1981) would focus more completely and fully on atmosphere and pure imagery then The City of the Living Dead(1980).<br><br>\nPaura Nella Citta Dei Morti Viventi(1980)'s refusal to have a linear plot and its violence are some of the things that divide audiences and critics like with many of Lucio Fulci's work.  After the success of Inferno(1980) in Italy, there were many people who would use the film's non linear structure as a guide line for their films.  Fear is the main theme of The Gates of Hell.  It is fear that brings about the demise of different characters  from the film.  The movie was a way for the audience to attempt to overcome their own perosnal fears.<br><br>\nThere are four outstanding set pieces in this flick.  First, the semi realistic sequence where a woman pukes out her guts.  Second, the drill through the head scene.  Third, the buried alive sequence which pumps the tension like a ballion until its pops.  Finally, the rising of the dead in the underground cemetery.<br><br>\nCatriona MacColl does a good job in what was the first of three films that she would do for Lucio Fulci.  This is the third film along with The Exterminator(1980) and Enter the Ninja(1981) that Christopher George suffers a violent death.  Christopher George adds a sense of humor to the film's gloomy landscape.  Daniela Doria really was puking out something out of her mouth as you watch that infamous sequence(this makes her a brave actress for doing this scene).  The drill scene is one of the most cruel and realistic death scenes that the director has ever filmed.<br><br>\nCity of the Living Dead(1980) has many things in common with Don't Torture A Duckling(1972).  One, the murderers in the two films are priest.  Two, the non conformist are blamed and brutally murdered by the victim's family or friends.  Three, the film takes place in a desolated and isolated town. Four, in both films a reporter and a blonde woman are the main protagonist.<br><br>\nThe Gates of Hell(1980) also has some similar qualities with Phantasm(1979). First, the cemetery is the main source of evil. Second, a member of the local church is the cause of the evil doings around town.  Third, the two films focus more on set pieces then on character and plot.  Finally, The Gates of Hell(1980) and Phantasm(1979) are played out like a nightmare where a person has entered and is unable to exit.","user":"eibon09","rank":[39,57]}]