[{"title":"The Western, Distilled to its Essence...","rating":9,"date":"27 July 2007","review":"Howard Hawks was once asked about his recipe for making a great film. His reply: \"Three good scenes, no bad scenes\". I would humbly add two other rules: A great film is one where no additional scene is needed, and no existing scene could have been cut. Few competent directors violate the first rule. The mark of a great director is the ability to follow the second. Many inferior directors are too shallow or too vain to understand this - they constantly strive to include superfluous or redundant scenes - Just To Make Sure You Got The Point - when it is wiser to let the audience decide what is important. John Ford was the master at this. Hawks, Wilder, Eastwood, also come to mind. With Commanche Station, Budd Boetticher showed that he knew how to distill a great story (with many elements of a Greek tragedy) to its most basic human elements - Obsession, Greed, Loyalty, Irony, and above all, Honor.<br><br>Not only did Boetticher direct a great film, Burt Kennedy (later to become a fair director himself) constructed a great script. <br><br>Some good scenes: A conversation between a woman who was taken captive by Commanches (and held for a time) and the stranger who has just paid her ransom... Nancy Lowe: If-if you had a woman taken by the Comanche and-and you got her back... how would you feel knowing? Jefferson Cody: If I loved her, it wouldn't matter. Nancy Lowe: Wouldn't it? Jefferson Cody: No ma'am, it wouldn't matter at all.<br><br>Or two friends, hired guns both, contemplating the need to commit a horrible crime for money: Frank: You want to go to work, do you? Dobie: Work? Frank: Making an honest living? Dobie: Oh, no, I don't think I could do that. I could cowboy some. Frank: Well, what will that get you? You work yourself to death for somebody and likely they will have to take up a collection to bury you. <br><br>Or a conversation between an honorable man and a young man trying to decide whether he will try to become one: Dobie: A saddle and a shirt, that's all Frank had. It sure ain't much. Jefferson Cody: Sure ain't. Dobie: It wasn't his fault, though. Jefferson Cody: No? Dobie: No, he never knew anything but the wild side. Jefferson Cody: A man can cross over anytime he has the mind. <br><br>As for the performances, they are uniformly good. Nancy Gates, Skip Homier, Richard Rust, and Claude Akins hit the right tone - never going too far for a laugh or a tear. <br><br>And Randolph Scott was perfect - A word I do not use lightly. Roger Ebert once said that Marlon Brando and Paul Newman started out on the same path: Both came on the scene in the early 1950s, both studied the Method, both looked good in an undershirt. But Brando went on to see what else he could throw in to his performances while Newman went on to see what he could leave out (Newman once said that he was dissatisfied with many of his early performances because \"you could see the acting\"). In Commanche Station, Randolph Scott provided the inspiration for such an approach. This is what makes a performance (indeed, a film) memorable - by distilling your performance to only that which is necessary, you allow the viewer to remember what is important to them, not what they are told should be important to them. <br><br>If I were held to only half a dozen westerns to be labeled as essential, this would be one of them (The others: My Darling Clementine (1946), Shane (1953), The Searchers (1956), The Man Who Shot Liberty Valance (1962) and Unforgiven (1992)).","user":"ttbird2000","rank":[24,25]},{"title":"Good Boetticher/Scott Western.","rating":8,"date":"18 October 2004","review":"Something seemed to come together on the half dozen or so cheap Westerns that Oscar \"Bud\" Boetticher made with Randolph Scott and writer Burt Kennedy, and shot mostly among the stucco crags at Movie Flats, California. It all seemed to work out pretty well.<br><br>I think this may have been their last joint effort and it's one of the better examples. The scripts seemed to fall into two general types -- town stories and journeys. This is a story about a journey, not too different from the one Scott took in \"Ride Lonesome,\" I think it was. The one with Pernell Roberts.<br><br>There is always an interesting villain, not entirely unsympathetic, who has a code of his own. In this case it's Claude Akins, accompanied by two younger men who have known each other for a long time. The two youngsters provide a good deal of the humor. The two stand before a couple of posters nailed on a wall and one of them reads aloud an announcement about the stagecoach route, stumbling over the words. The other stares at him open-mouthed and exclaims in genuine wonder, \"Why, I didn't know you could READ.\" <br><br>In fact a lot of the humor comes from Kennedy's script, wittingly or otherwise. He's given to phrases that enjoy a colorful twist. <br><br>\"Ma'am, if you was mine, I'd of come for you even if I'd of died in the doin' of it.\"<br><br>\"He rides a little on the gentle side. Maybe too gentle.\"<br><br>\"A man can break with the wild life.\"<br><br>And Kennedy gives us a Scott who is a man of few words and doesn't use them over and over again. He has a tendency to answer a declaratory sentence with a doubtful question. \"It wasn't MY fault.\" Scott: \"It wasn't?\"<br><br>But the humor is in the acting as well. Claude Akins, admittedly, is no barrel of laughs. He's played too many scoundrels for us to accept his jokes. But the two youngsters are likably ingenuous. Planning to kill their woman hostage, one tells the other, \"It's a waste. It ain't like if she was all ugly. It's a shame to do a woman as pretty as that.\"<br><br>And Scott is the most amusing character of all. He's funny because he plays it all absolutely straight. He smiles only grimly, and then only once or twice. He understates outrageously. Akins: \"If the Comanche cut our track, we'll be between a rock and a hard place.\" Scott: \"You CAN say.\"<br><br>By the way, if they're a day's ride from Lordsberg, New Mexico, they shouldn't have to worry about Comanches, who were living in Texas, but they might have to worry about Mimbrenos Apaches.<br><br>The Indians are treated in an entirely uncomplicated manner. They are wild animals who butcher whites, including the women and children. (\"Surprising what a buck will do for a piece of calico.\") Well -- okay -- there IS a reference to Akins having murdered a village full of \"tame Indians,\" which one imagines are kind of like \"tame black panthers\" or something.<br><br>The score is generic, as in all the Boetticher/Scott films, but that's okay because it fits in with the other constituents. It's tawdry and simple. There is a \"major theme\" which plays while this merry group ride their horses around the rocks. During chases, the same theme shows up but up tempo. As I say, it all works out. <br><br>Anyway, it's a fun movie, an interesting way to spend an hour and a half.","user":"rmax304823","rank":[30,34]},{"title":"Gallant Knight of the Plains","rating":8,"date":"24 May 2006","review":"Comanche Station is the last of several films Randolph Scott made for Budd Boetticher with Columbia pictures. This would have been his last film, but for being lured to do just one more, the immortal Ride the High Country.<br><br>The film combines elements of The Naked Spur and Two Rode Together and blends them successfully. Scott is a man with one obsession, to get his wife back from the Comanches who kidnapped here ten years earlier. Whenever he hears of a white woman being put up for trade by the Indians he heads out with trade goods and buys her in the hopes of finding his beloved. <br><br>On this trip he ransoms Nancy Gates away from the Comanches. Later on he runs into an old enemy Claude Akins traveling with two young guns, Richard Rust and Skip Homeier. It seems as though Nancy's husband has put up a ten thousand dollar reward for her. <br><br>Akins is a truly malevolent figure, a scalphunter who kills Indians and sells their scalps for bounty. Unfortunately the two have need of each other in hostile Indian territory.<br><br>Randolph Scott's western heroes usually have an edge to them, they are not pure heroes as Joel McCrea's are. But in this film he's poaching on McCrea's territory in gallantry. His behavior towards Nancy Gates is at all times chivalrous. I wouldn't be surprised if there was a medieval origin to the plot of Comanche Territory.<br><br>Had Scott not come back to do Ride the High Country, Comanche Station would have been a good film to go out on.","user":"bkoganbing","rank":[25,28]}]