[{"title":"Underrated & Little Known Western.","rating":7,"date":"30 May 2009","review":"\"If the world was made of gold men would die for a handful of dirt\". So goes the theme of this somewhat unusual western directed by Henry Hathaway in 1954. With lovely locations in Mexico this was Fox's first western in the then new process of Cinemascope and Stereophonic sound and boasted a top notch cast in Gary Cooper, Susan Hayward and Richard Widmark.<br><br>From a fine screenplay by Frank Fenton - Cooper and Widmark together with Cameron Mitchell and Victor Manuel Mendoza are four adventurers contracted by Leah Fuller (Hayward) to go back with her into the wilds of Mexico to rescue her husband (Hugh Marlowe) who is lying trapped and injured in a gold mine. They journey to the mine and perform the rescue but on their way back they are pursued by Apaches (a brilliant chase sequence) and must ward them off in a well staged attack on a hazardous cliff-face trail.<br><br>A good adventure yarn if a tad slow in parts but the widescreen picture looks great and the small cast are excellent. Cooper as Hooker is at his laconic best, Hayward is as gorgeous as ever, Mitchell in a good part as a temperamental and impatient young gun, Mendoza as the likable and amiable Mexican companion and Widmark shines as Fiske the droll and garrulous gambler who cuts for highest card to see who goes and who stays behind.<br><br>Beautifully photographed in Cinemascope and colour by Milton Krasner it is all excitingly handled by Hathaway. The picture also has an excellent score by the ubiquitous Bernard Herrmann. This was the only real western Herrmann ever tackled if you discount Burt Lancaster's early frontier epic \"The Kentuckian\" (1955) and some obscure episodes of TV's \"The Virginian\" in the sixties. Herrmann scored the film rather as a conventional adventure story and avoided the usual clichéd style of writing associated with westerns except perhaps the theme for Hooker (Cooper) where the composer hints at a \"cowboy\" tune with its wonderful long loping Americana tinged melody. But the score is mainly an intense and strident work full of suspense and foreboding. The main theme, first heard over the credits, is a brilliant defiant statement for full orchestra and is played in different guises throughout the movie. Particularly clever is the ominous figure on the octave flute which points up the unseen but ever watching Apaches. There is no love theme as such but tender music in the composer's gentlest manner underscores the Hayward character. All the stops are pulled out for the brilliant climactic music cue for the chase sequence (where the Apaches are in hot pursuit of the interlopers). It is a sensational swirling and thundering piece calling for some virtuoso playing from the magnificent Fox orchestra which they zealously deliver.<br><br>\"Garden Of Evil\" is available in a small Fox western box set along with two other western classics - the wonderful \"Rawhide\" (1951) and Henry King's \"The Gunfighter\" (1950). Enjoy!","user":"jpdoherty","rank":[36,42]},{"title":"Not their best effort despite the talent","rating":4,"date":"22 April 2018","review":"I'm having a problem understanding all the reviewers who call this film 'under-rated'.\nIn fact, for me at least, the reviews it received are, if anything, a little too high.\nI love Cooper and Widmark generally as actors but Cooper's performance is wooden and he seems to be just reading his lines in places while Widmark is a caricature of the gambler/adventurer and comes across as unreal.\nHayward is HORRIBLY miscast as a tough, resourceful woman and we never do see the love and devotion that is supposed to be driving her to rescue her 'husband'...she sure doesn't otherwise act like a devoted wife.\nThe writing, despite the normally skilled writers is quite lackluster and bland and there are far too many long shots which do nothing for the story development and are just window dressing and filler using the lovely landscape shots.\nThe scene involving Cooper putting a whooping on our young bounty hunter is laughably pathetic as he falls and STAYS down in the fire over and over......cringingly terrible and I couldn't help but laugh out loud.\nI think this movie was justifiably overlooked by time....it's a second rate effort by otherwise skilled actors and it's clear they didn't 'gel' at all.","user":"geordiesdad","rank":[8,8]},{"title":"A well-done character piece, concentrating on the evil influence of gold..","rating":8,"date":"24 June 2002","review":"While Cooper's career spanned ninety-two feature films, in which he appeared as everything from a masked Cossack to an Italian Renaissance explorer, a foreign legionnaire, a baseball great and countless sophisticated romantic adventurers, he is best remembered as a Western star...<br><br>'Garden of Evil' tells the story of three American adventurers (Cooper, Widmark, and Mitchell) who are stranded in a Mexican fishing village after the ship that was taking them to California is put out of commission... <br><br>All three were headed for the Californian gold rush... Instead, they are now in Puerto Miguel, approached by a woman in trouble, a Spanish-speaking American woman, Leah Fuller (Susan Hayward), who offers to pay them handsomely if they escort her through hazardous Indian territory to rescue her husband who is hurt and trapped in a gold mine up there in the hills...<br><br>The mention of gold makes them agree and, together with a Mexican macho man named Vicente (Victor Manuel Mendoza), begin their long, arduous journey...<br><br>Emotions become tense when Leah discovers Vicente marking trails and, later, finds herself fighting off the crude advances of one of the three soldiers of fortune...<br><br>When the group arrives at what the Indians call the Garden of Evil, a sacred grounds atop a high mountain where the mine is located, they found Fuller (Hugh Marlowe) still alive, but embittered and with a broken leg... <br><br>The group's troubles grow when they discover they are in danger, practically harassed by savage Indians... <br><br>\"Garden of Evil\" was Cooper first motion picture in CinemaScope... Along the way, he proves himself a powerful leader with a commanding performance...<br><br>Susan Hayward kept her thoughts and her affections pretty much of a secret, remaining skeptical about her motives... This was her second movie with Gary Cooper since her appearance in William A. Wellman's superb, high adventure 'Beau Geste,' and her third with director Hathaway...<br><br>Richard Widmark proceeds his ways of gambling with a neat line in cynical cracks; Cameron Mitchell fails in his unwelcome sexual advances; Hugh Marlowe uses a variety of both conscious and unconscious processes to deal with his angry feelings; Victor Manuel Mendoza gets intensely angry after being hit; and Rita Moreno delights the environment with her sweet voice...<br><br>Hathaway was one of the great Hollywood veterans still in harness, a versatile director whose Westerns have been as variable in quality as his other films... Filmed on location in Mexico, his 'Garden of Evil' is a beautiful spectacle to behold... The vistas are strikingly clear and vivid... The film is a well-done character piece, concentrating on the relationships of the characters as on the evil influence of gold...","user":"Nazi_Fighter_David","rank":[41,54]}]