[{"title":"A FILM TRIBUTE TO A VERY SPECIAL PLACE AND TIME","rating":8,"date":"3 March 2002","review":"During June of 1954 in New York City, I graduated junior high school and, to celebrate the event, joined three of my classmates on a forbidden sojourn to the city's famous Greenwich Village.  Exiting the subway station at Christopher street, we were amazed at the apparent ordinariness of this place we'd heard so much about from older adolescents and adults.<br><br>\nIn fact, at first glance, nothing extraordinary seemed to be happening there, with the sole exception of more White people being present than four Black teenagers from Harlem were were accustomed to seeing.<br><br>\nFor you see, this was the mid 1950's, Dr. Martin Luthor King Jr. had as yet to lead any freedom marches, Southern schools were as yet to be integrated, and in many Southern states Black people were lynched on Saturday nights as town entertainment. But three hours later, we knew that everything we'd heard about Greenwich Village was true and more.  For this was a place far ahead of it's time.<br><br>In the Greenwich Village of the 1950's, racial integration had been in place for well over two decades.  But far more important, forbidden talk of sexual liberation, interracial sex, homosexuality, along with political, artistic and literary freedom at all levels were openly discussed, flouted and displayed for all to see; performed to a background mixture of new age Jazz, early Rock and Roll and Folk Music.  Virtually nothing was excluded from the social or musical menu this incredible place had to offer.<br><br>\nI can't speak for the rest of my friends on that day, but I immediately fell in love with the place and remained so, until it's untimely demise at the hands of the high rise-high priced real estate industry toward the mid 1970's.  By then, the people who had made the place justifiably famous and notorious for what it was, could no longer afford to live there.  So the Village remained,in name only, as it is today: a mere shadow of what it used to be.<br><br>Joyfully, director Paul Mazursky has managed to capture on film, a moving snapshot of the social life and time of a remarkable neighborhood, in what was probably the last fifteen to twenty years of it's legitimate life. And I do remember it so well.  The rent parties for starving (sometimes talented) artists, the ubiquitous book shops, the coffee houses featuring impromptu poetry readings, the fashion statements (or blatant lack thereof), the mixing and making of all sorts of colorful characters who, even in their farcical attempts to parody themselves, were more alive and real then those who would put them down. This was the Greenwich Village of the 1950's and of legend.<br><br>This magical place was for me and many others (as was for the director who produced this film as an ode to his time there), our first real awakening and taste of adult life. And far more important, a fortuitous preparation for the new social order that was, in time, to come.<br><br>The place, as it was, is truly deserving of this wonderful little gem of a film.","user":"sataft-2","rank":[64,68]},{"title":"Get off at Christopher Street & experience this film...","rating":11,"date":"11 April 2002","review":"This is a bittersweet film about family, leaving \"the nest\", friendships, dreams, hope, &amp; finding yourself. A young man from Brooklyn leaves home to become an actor in 1950's Greenwich Village. Lenny Baker is very good as Larry Lapinsky &amp; Ellen Green is wonderful as his girlfriend. The quirky characters &amp; situations around them add an ambiance to this movie that makes you believe it was filmed in the 1950's, &amp; not the 70's, when it was actually made. A lot of attention was paid to detail &amp; it shows. Shelly Winters is loud, obnoxious, funny &amp; convincing as the typical Jewish mother (I love the scene when she shows up at his apartment with a chicken). This movie makes you wish you could jump into the film &amp; sit with these characters, have coffee with them, ride the subway, go to one of Larry's rent parties &amp; experience the progressive, offbeat world of New York's Greenwich Village in the 1950's.","user":"Blooeyz2001","rank":[22,23]},{"title":"Next Stop, Greenwich Village","rating":9,"date":"27 December 2006","review":"Slice-of-life piece about a young Jewish man, Larry Lapinsky(Lenny Baker), with designs on being an actor, struggling not only to make ends meet so he can carry out his profession and grow as an actor through a studio teacher, but also overcoming the domineering presence of his overbearing, at-times maniacal mother(\"She invented the Oedipus complex\" says Larry) Fay(Shelley Winters, outstanding as always). The setting is Greenwich village in the 50's amongst the art crowd where Larry becomes immersed in the lifestyle. We see how his life changes as Larry becomes good friends with several various people(a young Chris Walken as a poetic Lothario who enjoys bedding all kinds of women;Lois Smith as a suicidal painter;Ellen Green as Larry's love-interest Sarah;Antonio Fargas as a gay wannabe actor whose whole life is one big lie).<br><br>It's a breath of fresh air, this movie, and a break from the doldrums of typical Hollywood cinema. This is the kind of film that allows actors to spread their wings and create vivid, realistic characters. The film feels so fresh and authentic. You really are a vital part of these people's lives and dreams thanks to Mazursky's intelligent portrait. You can really see how much Mazursky loves New York City(specifically Brooklyn and Greenwich Village)and these people that live there.<br><br>Jeff Goldblum has a very funny role as a smart-mouthed struggling actor whose loud-mouth is like a leaky faucet which can not shut itself off.","user":"Scarecrow-88","rank":[9,9]}]