[{"title":"Great Fun","rating":9,"date":"8 December 2005","review":"I make no appologies. I LOVE Kaiju films. Period. Godzilla meister Honda- along with special effects guy Tsubaraya are at the top of their form here.After confining the worlds greatest monsters to monsterland- an island where they can run wild yet not do any harm all is not well. It seems that space aliens are controlling their minds and sending them on many city bestroying rampages. Mothra in Beijing, Godzilla in New York, Rodan in Moscow, etc, etc.Meanwhile on the moon-a rocket crew is observing a UFO. Does this have anything to do with the monster attacks? Back at monsterland, the control crew are replaced by the aliens{Who take on human traits} After much intrigue, the alien base is discovered and the fun begins.The special effects are superior. The rockets and UFOs have a pulp magazine quality that was somewhat dated in 1968, but for some reason it works in this film. Especially cool is the tank like vehicle the rocket holds. Even the model work is of the first order and although it would probably would not pass muster with todays computer generated FX fans, it gives this film an immaginative quality that is sadly lacking in most of todays films.And the climactic monster fight with all the genres all time greats is really a blast! Whenever I1m feeling down, I just pop this one in the VCR and bingo! I feel better again.No deep thinking, just fun on a monster size scale.","user":"loufalce","rank":[21,23]},{"title":"Monster free-for-all: fun stuff","rating":7,"date":"7 July 2006","review":"Toho decided to throw a block party for monsters in Tokyo, and invited every creature they could get to sign on to do the flick. Their three biggest mega stars are featured: the lovable giant fire-breathing lizard Godzilla, the supersonic bird who stirs up hurricane winds, Rodan; and the evil three-headed serpent King Ghidora. Throw in the talents of several other monsters and you have a Battle Royale that's a feast for the eyes.<br><br>Aliens want to conquer the Earth. So they use hypnosis chips on both key humans as well as the giant beasts, forcing them to assist in a sinister scheme. The human actors, although intentionally upstaged by their larger co-stars, make for an interesting invasion from within story. The actors really do a good job showing urgency in this battle for Earth, (in spite of the sometimes questionable dubbing job). The action moves fast and furious, leading to the inevitable climactic monster showdown.<br><br>The film incorporates the monster back stories as much as possible; considering how many creatures get in the act, that's quite an accomplishment. It's fun to see them all together; and they put on several good destruction and battle scenes. The TV reporter doing a sports play-by-play in the decisive battle is a great touch, giving us great lines such as, \"Listen to the monsters, with their cries of horror and sudden death!\" <br><br>Fun stuff for Japanese monster movie fans or anyone who likes a good, campy, action filled flick.","user":"MartianOctocretr5","rank":[20,22]},{"title":"What Final Wars Should Have Been","rating":9,"date":"30 September 2010","review":"This film was supposed to have been the finale of the Showa series of films, but Toho saw how successful it was and plowed forward. How ironic that they followed this up with one of the, if not THE, worst Godzilla movie, \"Godzilla's Revenge\". But yeah, this film was the last to feature all four fathers: Akira Ifukbe, Ishiro Honda, Eiji Tsubraya, and Tomiyuki Tanaka When you have them all you know you're in for a treat. One might say the series should have ended here, but then we would've never have seen the creation of some fan favorites, like Gigan and Mecha Godzilla.<br><br>I'll start by saying the single blunder of the film; its run time. It's exactly 88 minutes, as long as \"Mothra vs. Godzilla'. That film had a total of four monsters. This film has almost tripled that, so how is it possible that they're the same length. Less characterization apparently, the same flaw crippled \"Tokyo S.O.S.\" in comparison to its predecessor \"Godzilla X Mecha Godzilla\". A factor because this one's heavy on the sci-fi, heavier than usual. Eight minutes in we have our action start with the siege of Monster Land but in the end it won't bother most.<br><br>I won't even bother going into detail about Baragon and Varan, two monsters who didn't do sh*t in the whole movie. Although Baragon was supposed to attack Parisso, Varan, why are you here? Godzilla has a new friendlier look, but it is far better than the laughable 1966 and 1967 suits, and the result is a great suit all in all. Rodan looks terrible in close ups sad to say despite his screen time but otherwise (or rather afar) he's okay. Anguirus looks fantastic and has lots of personality I must say. Kumonga, Mothra, and Gorosaurus pretty much remain the same, but look great. Manda has lost a few of his \"Atragon\" facial features but I still love him in the movie. Minilla, wish King Ghidorah had killed his ass, but whateverThe characters are pretty legit and the story involves them quite well. Some have called \"Final Wars\" the 2004 version of this film, but hardly. The human action in that film was Matrix rip-off type crap. Here we simply have the drama of a man and his alien-controlled sister. Plus nice shoot outs, but no over the top sh*t. Plus unlike in 2004, the leader isn't a cheesy annoying pric. This film beats \"Final Wars\" on that hands down.<br><br>Another aspect where the 50th anniversary failed is with the monster action. Godzilla basically killed everyone in a one-by-one killing frenzy. Somewhat cool, but I like what we see here better. Like the Tokyo stomp scenes, or the grand finale at Mt. Fuji. That's what we wanted to see in \"Final Wars\"!! All the monsters gathered in one spot, fighting the \"demon of our galaxy\", King Ghidorah! It was F*ckin awesome! Not to mention it's a brutal and bloody battle. The cinematography and SFX are epic for their time. To top it all off, Akira Ifukbe delivers one of the best Showa scores ever. I love this film to death. The end battle can never be topped and so I rest my case.","user":"gigan-92","rank":[10,11]}]