[{"title":"A magnificent obsession indeed","rating":10,"date":"14 March 2005","review":"My unashamed love for the films of Douglas Sirk may be described as an obsession, but it is to me, of course, a magnificent obsession. My attempts to influence others as to Sirk's genius have mostly failed. He's a director whose work you either get, or not. Those who view his works as camp masterpieces are very much missing the point. What is intrinsic in works of camp is the end product being appreciated in a manner that the creator had not intended. However, every camera angle of each frame, every nuance, indeed every color in every shot is totally intentional in all of Sirk's major films.<br><br>\"Magnificent Obsession\" is far from Sirk's best work, but it is perhaps his most important. Though he had made films in many genres, it was \"All I Desire\", his 1952 melodrama that paved the way for what would become his special place in cinema history. In the often ridiculed genre of so called \"woman's movies\", Sirk discovered there was great scope for artistic expression as well as social criticism and much more in this apparently vacuous genre. \"Magnificent Obsession\" is the first film in which this vision is realised.<br><br>To understand why this happened at all one must remember that Sirk was under a long term contract with Universal throughout the fifties, when they were by all accounts an inferior studio. As an European immigrant in need of work, Sirk signed to Universal, with the full understanding of the type of projects that would be offered to him. His intellectual and rich theatrical background would be put to use in clearly inferior material. When asked about this, he gave the example of how many of Shakespeare's plots are weak and uninteresting in themselves; it's the language that makes them art. Sirk was a master of cinematic language in all its aspects. The plots of his movies are often truly abysmal, but the language always pure joy to behold. \"Magnificent Obsession\" is a prime example of the abyss between screenplay and the cinematic language employed. <br><br>After reading the script of \"Magnificent Obsession\", Sirk called the plot \"crazy\" and did not want to make it. But as a contracted director, he had little sway with the studio heads and was persuaded, as always, to make the movie. It should be noted that he never had a bad word to say about Universal, even after he left Hollywood. He fully understood the contract he had made and simply made the best of his situation. It should also be noted that he gave Universal some of their greatest commercial successes of the decade, and created for them a star leading man, something they were in desperate need of. That star was Rock Hudson. \"Magnificent Obsession\" was Hudson's breakthrough film. He made eight films together with Sirk.<br><br>The magnificent obsession in question is the quest for spirituality; not exactly high on the agenda of materialistic, picture perfect, upper class American society of the fifties. Bob Merrick (Rock Hudson) is a shallow, womanizing, heavy drinking, spoiled playboy. The movie charts his journey towards spirituality. He is guided on this path by an older intellectual artist, Edward Randolph (Otto Kruger). Many critics have noted the physical similarities between Kruger and Sirk himself. It's almost irresistible to develop this notion. It is Randolph who despite Merrick's crass behavior perceives a potential for greater things and leads him towards self fulfillment.<br><br>Similarly it was Sirk who first spotted Rock Hudson's star potential. Under his guidance and direction, Hudson would in a matter of two to three years, become one the most popular actors in Hollywood. Having worked closely on eight films, it would seem absurd that Sirk was not aware of Hudson's homosexuality. This did not deter Sirk, (who himself was not gay). Moreover it fits well with his fascination for what he termed \"split characters\". It's the embodiment of fifties picture perfect appearance shielding a very different reality that is central to much of Sirk's work. <br><br>Edward Randolph quietly removes himself when he realises his protégé has finally found his new self. His work is done. While Hudson was no heavyweight in the acting stakes, under Sirk's direction he gave some very respectable performances, \"Magnificent Obsession\" amongst his best. His post Sirk career would soon take him to Doris Day territory, a far cry from the likes of \"Written on the Wind\", \"Tarnished Angels\" and \"Battle Hymn\".<br><br>All of Sirk's films are worth taking a close look at, particularly from \"Magnificent Obsession\" onwards. There are a handful of directors who so well grasped the possibilities of film making and possessed the know how in using the many elements that make up this art form.","user":"grahamclarke","rank":[66,79]},{"title":"Launching A Second Screen Heartthrob","rating":8,"date":"4 May 2007","review":"Back in the Thirties the first screen adaption of Lloyd C. Douglas's novel Magnificent Obsession was the career breakout film for Robert Taylor. Universal had borrowed Taylor from MGM and cast him as playboy Bob Merrick opposite Irene Dunne. The film made his career.<br><br>Though Hudson was already a star because he'd been first billed in some westerns and action films, this second version established Hudson as Universal Pictures romantic star for the next dozen years. This time the break came to one who was under contract to that studio.<br><br>Lloyd C. Douglas was a minister turned novelist who specialized in writing romantic stories with a religious tint to them. Even his novel The Robe which was set in biblical times was a romance between a Roman Tribune and the ward of Emperor Tiberius and how Jesus's crucifixion affected the relationship.<br><br>Magnificent Obsession is set in modern times. Former medical student Rock Hudson who now wants to live fast, die young, and leave a good looking corpse inadvertently causes the death of a respected physician and later the blinding of his widow, Jane Wyman, in separate incidents.<br><br>Under the tutelage of wise old Otto Kruger, Hudson decides to get serious with his life and start being of service to his fellow man. Nowhere apparently can you do better good works than in the medical profession which seems to be what Douglas is saying besides being a minister. <br><br>Douglas Sirk's direction can get some soggy performances from players at times, but it's a tricky bit of business here. In less capable hands Hudson would look like he was stalking Wyman. But that's how good the two of them are. Wyman in fact got an Oscar nomination for Best Actress, but lost to Grace Kelly in The Country Girl.<br><br>Hopefully one of these days TCM will show the Robert Taylor-Irene Dunne version of Magnificent Obsession and we can compare the two.<br><br>I think this version will definitely stand up under comparison.","user":"bkoganbing","rank":[16,18]},{"title":"Tissues required!","rating":7,"date":"23 August 2005","review":"Douglas Sirk directed a lot of films that capitalized on the melodramas that were highly popular in the fifties. In \"Magnificent Obsession\" he shows why he was probably the man that was born to direct this film, as well as others of the genre. This is a remake of the film of 1935, which had been a vehicle for Irene Dunne and Robert Taylor.<br><br>Jane Wyman and Rock Hudson seemed to be unlikely candidates for playing a romantic couple in the movies. After all, Ms. Wyman was older than Mr. Hudson and clearly appeared to be in the film. The story, which is based on LLoyd Douglas novel, has a little bit of everything.<br><br>\"Magnificent Obsession\" proved to be a hit for its stars. In a way, it's easy to see why fans were attracted to it, with its many twists and turns and the impossible love between Helen and Dr. Bob Merrick, the playboy who becomes contrite after he causes the accident that makes Helen blind. Also in the cast the magnificent Agnes Moorehead, who has great moments in the film.","user":"jotix100","rank":[21,27]}]