[{"title":"The Ay-Ay-Irish Senor","rating":9,"date":"31 May 2005","review":"Alvarez Kelly, Mexican national, has just sold a herd of cattle to the North during the American Civil War. Yankee Major Stedman insists he accompany the cattle all the way to Richmond where they're to feed Grant's troops besieging the city. Only Confederate Cavalry hero Tom Rossiter has different ideas for the cattle and for Kelly.<br><br>William Holden as Kelly and Richard Widmark as Tom Rossiter settle down in roles familiar to them. Ever since Sunset Boulevard Bill Holden has brought us a fine line of cynical protagonists to the silver screen. Holden's good, but he's not breaking any new ground here.<br><br>Richard Widmark as Rossiter is a bit more idealistic than Kelly, but only because he believes in a cause. He's no less cynical than Kelly in his methods of getting Kelly's cooperation in his scheme. The scheme being to get the cattle passed union lines to Richmond. We're not talking here about slavery and the causes of the Civil War. Just the prevention of disease and starvation.<br><br>The only other larger role of note is Patrick O'Neal as Major Stedman of the Union Army. He is such and unctuous and boring man and written deliberately so by the writers that we will understand why Kelly is tempted by the Confederate offer. Of course Widmark uses other forms of persuasion, but you have to see the movie for that.<br><br>It's a nice action film by two very capable male stars who were passed the peak years of their respective careers in the Fifties. Also you will not be able to get the title song, sung by the Kingston Trio over the opening credits out of your mind. Very catchy indeed.","user":"bkoganbing","rank":[37,44]},{"title":"Loosely based on actual historical event","rating":6,"date":"24 October 2007","review":"In the early 1960's, there was quite a bit of interest in the Civil War during the centennial observances of events over the four-year period. Quite a few films were released either about the war, or which had the war in the background or as preludes to western films, which were very popular at the time. This film fits within that genre - both as a \"civil war\" film, which is also a bit of a \"western\", considering the cattle-rustling angle.<br><br>This movie is (loosly) based upon an actual event. In September of 1964, Lee's Army of Northern Virginia was besieged by Grant's forces in entrenchments which stretched along the eastern side of Richmond, then south across the James river, then along the southern border of Petersburg, Virginia. A confederate scout noticed a large heard of cattle (approaching 4000 head) located at Coggins Point on the James River, not far from Grant's headquarters. In the army parlance of the days before refrigeration or canning to preserve meat, this was referred to by the commissary services as \"beef on the hoof\".<br><br>Confederate Lt. Gen. Wade Hampton organized a raid which swung wide around the Union lines, traveled through Union-held territory to the site, overcame the small guard, and herded 2,468 cattle back into the Confederate lines where it became a welcome addition to the scanty rations the Confederate troops normally received. The Confederate losses were quite small - 10 killed, 47 wounded, and 4 missing, according to Hampton's official after-action report.<br><br>The raid went down in history as either \"Hampton's Cattle Raid\", or simply \"The Great Beefsteak Raid\".<br><br>Of course, the lead character \"Alverez Kelly\" from the movie has no real counterpart in history of which I am aware.","user":"rhp6033","rank":[16,18]},{"title":"How the North Almost Lost the Civil War","rating":7,"date":"20 April 2007","review":"This is a peculiar western turned American Civil War film. William Holden is Alverez Kelly, a citizen of Mexico of Irish ancestry, and a gentleman cattle herd leader. He has, we learn, had involvement with the U.S. before 1861 - 64. His father, the owner of a large estate in Mexico, was killed in the \"Mexican War\" (Holden says it has a different name in Mexico) by American troops, some of whom are now Confederates. But he is totally uninterested in the results of the war: he is a foreign citizen intent to sell cattle to the best payer. This means, however, that he has to deal with the Union more than the South (at one point he is asked if he doubts the value of Confederate currency, and starts telling the Confederate Secretary of War what one could do now with Confederate currency). <br><br>It is Holden's fortune that he gets a Union Army contract for 4500 steers that it takes him three months to bring up from Mexico. Unfortunately he is met by Major Steadmen (Patrick O'Neill) at the point where Holden felt he was supposed to deliver. Steadman is one of the most obnoxious men one can mingle with. A citizen of Boston, he was a lawyer before the war. He prides himself on being able to manipulate people by his brains (an example I will give in a moment). He drew up the contract, and in very fine print (he does apologize for it's tiny size), he had a clause added that the commanding General in the area that needs the meat can insist it be delivered there before payment. That is General Grant: the cattle have to be brought to Richmond.<br><br>Holden has no choice, but he will be paid. Unfortunately this leads to a 1,400 mile railway trip from Texas through the Midwest to Maryland and into Virginia - accompanied by Steadman. Earlier we saw Steadman as a stiff type - he had to wait an additional ten days for Kelly to appear at the point Kelly thought was delivery point, and does not like being kept waiting (even though the army would have been footing his bill in the border town). But on the ride he tells Kelly his \"war stories\" about being a lawyer in Massachusetts. The one we hear the great tail end of is about how he trumped a judge on a legal point in a case by use of a writ of certiorari (this legal document demands to know from the judge what is the statutory power the judge is using that is the grounds for his decision). I'm sure that most people would love to hear this type of story....<br><br>I'd love to know who the Masssachusetts Judge was. Hopefully, for Steadman's career sake, it was not Lemuel Shaw, the Chief Justice of the Commonwealth, a man of formidable mind and presence. He looks it from his photos. He was also the father-in-law of a one time sailor and writer, later a customs house man named Herman Melville. Shaw, had he been embarrassed by some idiotic glory seeking lawyer would have swallowed and remembered the idiot. And the idiot would have paid in the long-run throughout Massachusetts' court system.<br><br>The cattle are delivered at a plantation now in Union hands outside Richmond. But after Kelly is paid, he becomes a target of southerners led by Colonel Tom Rossiter (Richard Widmark). Rossiter sees all that wonderful meat nearby and wants it for the folks in Richmond and for Lee's forces. So he kidnaps Kelly (with the help of the plantation owner Charity Warwick (Victoria Shaw)), and Kelly soon is in Richmond being offered a chance to do the Confederacy a small aid by stealing the herd back. <br><br>Rossiter is no sweet guy, but a genuine patriot who has already sacrificed an eye for the Confederacy.* He uses methods as vile in their way as Steadman's (including intentional minor maiming) to force Kelly to help him. The interest in the film really centers on the mental warfare between Rossiter and Kelly, as each tries to see how far they can force the other back on track or off track. For Kelly sees that Rossiter's plan is a desperate last chance - and a long shot that he has no real concern about.<br><br>(*There actually was a noted Confederate Cavalry leader, General Thomas Rosser, who survived the war in tact and ended his career as an engineer on U.S. and Canadian railways. His last military action was in 1876 - he heard his pal George Custer (army differences forgiven) was killed at Little Big Horn. Rosser took leave from his job to join the U.S. forces seeking Crazy Horse's army)<br><br>The film is well acted and plotted actually - far better than other mad last gasp Confederate tales are (witness VIRGINIA CITY). Kelly finds a way to avenge his maiming through an act of kindness to Elizabeth Pickering (Janice Rule) Rossiter's fiancé. But in the end he is the one who wins - by getting the cattle to the right place, and finding out his own finer senses.<br><br>Also note the performances of two favorite character actors from television (usually), Howard Caine and Roger C. Carmel. Caine (best recalled as the nasty S.S. Major Hochstadter on HOGAN'S HEROS) is a northern spy who gets most of the cards in his hands, and deals the wrong answer out. Carmel (best recalled for his role as Kay Ballard's husband on THE MOTHERS - IN - LAW, or as Harry Mudd on STAR TREK) is Captain Fergusson, a clever Scotish Blockade Runner (for profit of course - like Rhett Butler was too). Both help enliven an above average adventure flick.","user":"theowinthrop","rank":[13,16]}]