[{"title":"The movie that defined the 'New Hollywood' generation and the greatest cinematic era ...","rating":10,"date":"27 June 2011","review":"She's restlessly lying in bed, naked, like a capricious girl her parents just punished, impatiently waiting for 'something to happen'. The monotony is eventually broken when the beautiful blonde girl catches a handsome young man about to steal her family's car. When a bored girl meets a strange newcomer, it's not properly what we'd call a 'love at first sight' but there's obviously a mutual attraction, fascination. And the man has more than his dandy charm to offer, from his pockets he carefully unveils a gun that the girl sensually touches like a phallic trophy. The days of 'old-school' cinema are numbered.<br><br>But showing a gun is one thing, the guy must use it to assess his manhood, so he robs a store and runs away with the girl, and they finally exchange their names. Warren Beatty is Clyde Barrow and Faye Dunaway is Bonnie Parker, the rest is legend  The two young lovers escape from their condition in a sort of existential impulse and leave the boredom of small rural towns behind them. No place in their hearts for the Great Depression. And you can easily draw the parallel between \"Bonnie and Clyde\" and cinematic history. When the gap between the baby-boom generation and their parents got wider, when cinema was marked in the 60's by an abundance of dull musical comedies and classic block-busters, when sex and violence were still taboo in America, I guess people felt like Bonnie in the opening shot ... before two guys, Michael Benton and David Benton, came up with a script, recommended by the French New Wave authority, François Truffaut himself. Then Arthur Penn made his entrance with a gangster film that exuded violence and sexuality in an unusually indecent way, during the ground-breaking year of 1967. A cinematic Revolution was marching in.<br><br>\"Bonnie and Clyde\" was a break-through film in its fast paced, entertaining and bold portrayal of violence and sex. The times of \"Cleopatra\", \"My Fair Lady\" or \"The Sound of Music\" were definitely over, American cinema reached its maturity with Arthun Penn's masterpiece that consecrated the anti-heroic figures, a model that would enrich the 'New Hollywood' era with some of its greatest and most iconic characters. We root for Bonnie and Clyde as they are the epitome of anti-system rebellion. And never seems their violence gratuitous or cold-blooded. We're far from the John Wayne's stud figure with Clyde who obviously uses his gun to compensate his sexual problems, or to impress his girlfriend. And in the famous pivotal moment, where they meet the farmers ruined by their bank, they're transformed into modern 'Robin Hoods'. Indeed, the iconic line \"We rob banks\" is more than a simple statement; it's the affirmation of this rebellion against the system. It's pretty ironic that Penn 'sold' the film to Warner Bros majors as a homage to the gangster films of the Golden Age, which is not totally untrue, except for the Hayes Code from which film-makers were freed in 1967.<br><br>Maybe we could blame Arthur Penn's for the liberties he took with the characterization of notorious gangsters, and the deliberately romantic portrayal of Beatty and Dunaway. Maybe Bonnie is too gorgeous in a glamorous way, maybe Clyde is too good-hearted as he would express many grieves all through the film, highlighting the fact that he feels as much a killer as a lover. But take into consideration that for a long time, the Hayes Code prevented bandits and gangsters from being portrayed in a sympathetic way, except maybe for comedy. This is why analyzing \"Bonnie and Clyde\" should always take the context into consideration. In these days, when Americans were getting killed in Vietnam for a war that was proving to be pointless, who could really point his finger in something and say 'this is good and this is evil'? The Vietnam war made the youth question its own approach to good and evil, and it's less an alibi to root for Bonnie and Clyde, than an element that explains, not justifies, how their figures could have been so popular. The audience was mature enough to identify with \"Bonnie and Clyde\" as movie characters.<br><br>And to be honest, it's hard not to find this film appealing, as soon as the gang is constituted by its core before being joined by Michael J. Pollard, as C.W. Moss, Gene Hackman as the good-hearted brother Buck Barrow and Estelle Parsons as his wife Blanche (with an interesting note that all the members of the Barrow Gang will be Oscar nominated), the whole film embarks us in a road adventure with the banks of the Depressed America as so many stops, and the same exhilarating banjo music as the film's musical signature. It's difficult not to feel like belonging to the gang, seated in the numerous cars they ran away with. Dede Allen's fast-paced editing provides unforgettable thrills, reasonably punctuated by necessary and relationship-developing pauses. But progressively, as the adventure is looking more like a cat-and-mouse chase, as we feel getting closer to the end, the levels of realism the violence reaches gets more and more disturbing, and heart-breaking, as to remind us that whoever lived by the gun, die by the gun, and antiheroes didn't have the monopoly of violence.<br><br>Indeed, the movie doesn't end with banjo music, with no music actually and this is another testimony to the movie's legendary value, something that was waiting to explode on screens after so many decades of repressed violence, where gunshots hardly made blood spilling, where the portrayal of death was just acrobatic moves with a possible 'aargh' for the bad guy and more solemnity for the good one. Arthur Penn opened the Pandora Box that would inspire \"The Wild Bunch\", \"The French Connection\" and \"The Godfather\" and only for that cinematic accomplishment, he deserves respect and admiration. <br><br>\"Bonnie and Clyde\" is a landmark and definitely one of the most important films of American history.","user":"ElMaruecan82","rank":[47,58]},{"title":"A masterpiece that dares to be excessive!","rating":9,"date":"8 February 2009","review":"'Bonnie and Clyde' is not a film about two real people famous for so many bank robberies and murders across the big country... It shows a new kind of fury in which people could be harm by weapons... The film, however, manages to carry the impression that these two youngsters took great pleasure in robbing banks and stores... It also suggests that it was very easy for them to fool the lawas certainly occurred in real life... Though merited punishment caught up with them, audiences laughed at their remarkable deeds and wanted them to get away...<br><br>In 'Bonnie and Clyde,' Penn created an emotional state, an image of the 1930s filtered through his 1960s sensibility... The sense of this period reflects Penn's vision of how the 1930s Depression-era truly was, and for all the crazy style and banjo score, this vision is greatly private...<br><br>What is also personal about 'Bonnie and Clyde' and constitutes its incomparable quality, is its unusual mixture of humor and fear, its poetry of violation of the law as something that is gaiety and playfulness...<br><br>'Bonnie and Clyde' is both true and abstract... It is a gangster movie and a comedy-romance... It is an amusing film that turns bloody, a love affair that ends with tragedy...<br><br>A modification between pleasure and catastrophic events is important to the essential aim of the film... In their second bank robbery, a daring and joyful action goes morosely embittered when Clyde is forced to kill an executive in the bank, and real blood pours out from his body...<br><br>Bonnie and Clyde take self-gratification posing for photographs with their prisoners But when surrounded by detectives in a motel, they turn into vindictive bandits struggling for their lives... C. W. Moss, specially, brings to mind Baby Face Nelson, when he murders policemen with a blazing machine gun...<br><br>One of the stimulating moments in the film happens when Clyde chases Bonnie through a yellow corn field, while a cloud transverses the sun and slowly shadows the landscape... Here the characteristic quality of the Texas countryside and the vague aspect of the story are beautifully communicated......<br><br>Penn's masterpiece nominated for ten Academy Awards, including Best Picture, won two Oscars, one for Best Actress in a Supporting Role and another for Best Cinematography...","user":"Nazi_Fighter_David","rank":[75,101]},{"title":"Good, but with some issues","rating":7,"date":"1 July 2008","review":"Bonnie and Clyde takes place in 30s depression stricken Texas and other central states. This film was among the first or perhaps the very first film to show real blood and realistic violence. Films like Bonnie and Clyde helped bring down the strict grip the censors placed on films. Bonnie and Clyde takes you through an adventure in violence and wrongdoing. And at the end they get what they deserve. Although the ending is nothing new, the brutality and grotesqueness of it was groundbreaking for its time.<br><br>I do wish more time was taken to develop the characters and their partnership. It seemed like the film just rushed in to the shooting and violence. I thought the two lead characters did a fine job. But I did not however, like the roles of Hackman and Parsons. Their overacting was a distraction. Particularly that of Parson, who's screaming and yelling is annoying. Also, the kid's role to me was a mystery. He was little more than a background distraction. Except for those things, the movie was good overall.","user":"bull-frog","rank":[13,15]}]