[{"title":"Not as wretched as reputed, but good for a few laughs","rating":6,"date":"14 May 2002","review":"This film was almost hooted into oblivion by the critics at the time of its release, so when I saw it on one of the Cinemax channels last night, I was surprised that it wasn't much worse. A few months ago I saw the highly acclaimed docudrama on Fidel on Showtime, and this film, while not as good as the Showtime drama, is not all that much worse either.<br><br>First the bad stuff. Jack Palance's portrayal of Fidel Castro must rank as one of the worst performances ever to appear on screen. During the first half of the film, he spends most of the time rolling a lit cigar around in his mouth and making weird facial grimaces, most of which he seems to have forgotten by the second half. Moreover, he makes Castro come across as a dim-witted doofus who is always helped to see the right course by the brilliant Che, rather than portraying Castro as the brilliant strategist and tactician he was. Secondly, although the film is in English, much of the spoken dialogue sounds like a dubbed movie. Maybe that's because one of the principal supporting actors is Italian.<br><br>That having been said, the film's history is, quite surprisingly, fairly accurate. It accurately depicts how Castro's forces were almost completely wiped out after the arrival from Mexico, and Castro was left with a force numbering less than twenty. Nevertheless, he survives and gradually wins the support of the peasants, so that eventually he has a guerrilla force numbering in the thousands. The fact that Guevara was unable to pull off the same feat in Bolivia, due largely to his own megalomania that prevented his listening to the Bolivian peasants, is accurately portrayed as well. This isn't available on video and isn't likely to come to a theater, so you can probably see it only on cable. If it comes along, it's worth a watch.","user":"wjfickling","rank":[18,22]},{"title":"A major miscalculation on every level","rating":28,"date":"28 September 2003","review":"If you are determined to see CHE! no matter what, I highly suggest you first pick up and read a good book about the man, Fidel Castro, and the Cuban revolution itself. Otherwise, you'll be utterly confused. The movie starts with the rebel invasion of Cuba, without giving us any idea about what Che had been doing up to that point of time. (Like: Why was he convinced to follow Castro?) We also don't really see what the political situation was exactly like in Cuba at the time. (How can we understand the rebels if we don't know what they are fighting against?) The movie continues to be confusing by subsequently not making it clear just how the rebels were able to build in force after being almost completely wiped out... or just how exactly they were able to weaken the government forces... or how Che transformed from a weakling into a strong leader (it seems to happen overnight!)... or why exactly Che got tired of being in Cuba.<br><br>\nThe subsequent unfolding events do get somewhat clearer once Che gets to Bolivia and starts his doomed campaign there, but you still don't understand the man. And with Richard Fleischer at the helm - a director who was usually only as good as his script - the movie sinks deeper into badness. The fact that Fleischer shows a complete inablility to film action scenes is just the least of his problems.<br><br>And talk about miscasting! Omar Sharif as Che?!? He looks understandably confused and cowed in the role - deadly for someone who was reportedly a charismatic and cunning leader. But his performance is brilliant next to that of Jack Palance. Palance is unbelievably goofy as Castro, who was a strong leader in his own right. Reports at the time of filming state that Palance asked that Castro's \"buffoonery\" in the script be changed. Apparently that didn't happen. I can imagine that Palance subsequently decided to take revenge by hamming things up, especially since he also stated to the press after filming that he regretted ever being involved in this production.","user":"Wizard-8","rank":[18,26]},{"title":"Sensitive Performance by Sharif Hoists It","rating":7,"date":"27 December 2007","review":"It was brave of the makers of this film to release it in 1969 when the U.S. war against Communist North Vietnam still raged. It does depict a **failed** attempt to foment revolution in the Third World and on balance it is a negative portrayal of a professional revolutionary. Given the times, any depiction of Guevara and Fidel Castro showing them as human was a bold move. <br><br>In the U.S. most publicity has been garnered by Castro's bitterest enemies (those wonderful folks who brought you the **Elian** affair). Fidel has his supporters here, and around the world, also. Many of them seem to have posted comments at this site. The title of this movie is \"Che!\", not \"Fidel!\". Naturally, Castro's role will be a secondary one, a decision Castro's supporters seem unable to forgive.<br><br>Everyone knows how the story ends, and that is where the movie starts, with Che Guevara's body being transported by helicopter down from the one-room schoolhouse where he was apparently executed after being wounded and captured by an elite unit of the Bolivian Army. It's a strikingly beautiful, almost elegiac shot with the slopes of the Andes stretching to the horizon in the background. The movie proceeds in a semi-documentary style, the story told in flashbacks by Guevara's old Comrades (and some old enemies). Some of the Comrades, visibly aged, give their interviews from prison cells.<br><br>While Guevara's early life in Argentina isn't depicted, there is a soundless, striking scene early in the film of Cuban women protesting the dictatorial Battista regime, only to be massacred by Cuban soldiers (\"We heard you calling, Cuba and we came...\") that well explains what motivated young Ernesto and other youths from Latin America's upper classes to join the Cuban revolutionaries. From there we trace Che's transformation from idealistic medical graduate to hardened guerrilla fighter--summed up in a moment when in the heat of battle he picks up a rifle and leaves his doctor's kit on the ground.<br><br>I also disagree with the many criticisms of the portrayal of Fidel Castro by Jack Palance. Palance's movie career was distinctly on the down slope when he accepted the part, but he always had **macho**. Here he captured the 6'4\" Castro's dominating physical presence in a land of mostly short statured people. <br><br>It is a real pity that this motion picture has completely disappeared. There is not a commercial version of it available anywhere. In the future, perhaps after Omar Sharif has died, this portrait of one of the twentieth century's most charismatic figures will be recognized as the rare achievement it is.","user":"kayaker36","rank":[15,22]}]