[{"title":"An Important Look At How The Theater Mirrors Life And How Life Mirrors The Theater","rating":23,"date":"23 December 2003","review":"`After the Rehearsal', a film by Ingmar Bergman, is a reflective look at the art of theater and its practical implications in our lives.  Bergman keeps to a relatively tight plot and cast - there are a total of three characters and one setting that endure over the course of 79 minutes. More than anything, `After the Rehearsal' is a study of our actions: their sincerity, what drives us to them, and how they are mirrored in the theater. It attempts to define human relationships and their high level of self-interest, at times appearing quite existentialistic.  `After the Rehearsal' brazenly takes a look into social psychology, aging and theater. The story in `After the Rehearsal' focuses on playwright and director Henrik Vogler, his current star actress, Anna Eggerman, and her mother and Henrik's former lover - Rakel Eggerman.  It all occurs after a rehearsal for Henrik's latest `Dream Play' when he is awoken by Anna Eggerman who is looking for her bracelet - a mere pretension to spend time with Henrik. While her desire for Henrik is obvious - he continuously refuses to yield to her flirtations.  In the middle of the film, there is a long flashback where we witness Anna's alcoholic mother Rakel arguing with Henrik on the same backstage.  Towards the end of the film, Henrik and Anna frenziedly create a romantic story of their future together, passionately delving deeper into their improvised story until Henrik stops it - he will never be able to carry out his desires in person at his age. Bergman's `After the Rehearsal' is not about a plotline, but rather, about unearthing the truth of our actions.  During the course of the film, Henrik, while in conversation, will have a voice over which lays bare his thoughts and feelings towards who he is currently addressing.  His dialogue is always an act - trying to make his words match his thoughts and thereby amassing a waste of energy.  His words betray his thoughts and we learn how truly detached and distant he is from his surroundings.  His words become no more than lines in a play; trying to express a thought in the most pleasing and successful way.  Anna Eggerman is no better off than Henrik - she purposely lies to him so as to manipulate him and witness his various emotional responses.  Rakel also epitomizes this separation from society by her professed desire for affection and company but consistent alcoholism and belligerent actions aimed towards Henrik - she is a mourner who has damned herself to wallow in her own pity. It would be accurate to dub `After the Rehearsal' as an existentialist work.  Not only does it focus on man's separation from one another and the pointlessness of his actions, but it attempts to define why man acts as he does.  In a self-revelation, Anna Eggerman supposes that she is acting only to please others - and that since childhood she has merely put on a stage face to get her own way.  She is so absorbed by her subconscious actions that she does not realize she has become an actress offstage. Furthermore, it describes the plight of Henrik.  In addition to the isolation Henrik suffers from the world, he is also plagued by his old age.  As age has taken its toll, he no longer has the energy to have a relationship with Anna and can merely imagine it.  His (and the film's) final words most exemplify his incapacity and detachment from the world, occurring when Anna tells him she can hear the church bells tolling as he says `I only wish that I was able to hear the bells'. `After the Rehearsal' is a meditative film that is not afraid to ask questions and propose answers.  It eloquently expresses its views through a tightly-woven story that does not fail to hold its audiences attention. It dissects why man functions as he does through intense confrontations, philosophical ponderings and quiet revelations.  Bergman unmasks the existential themes of distance and cold self-interest that lurk underneath our every word.  `After the Rehearsal' is a complex and vital look at humanity that everyone should sit through at least once.","user":"robertiscool34952","rank":[18,19]},{"title":"If ever there was a way to spend 72 minutes with Bergman, it's here","rating":10,"date":"23 January 2005","review":"Fanny and Alexander, to Ingmar Bergman, IS his last released film, written and directed by him. But this film, which was originally meant only for Swedish television, found its way to the USA and abroad, and (excluding Saraband, which was a film that just had to be made by its maker) is a welcome piece of theater, about the theater. After the Rehearsal is a short, but extremely satisfying take on what it means to be a director, and what it means to act, or to just be in the profession of the imitation of life. Bergman gives us only three actors (two kids, who pop up only for a few moments, one of which the child who wonderfully played Alexander in the above title, is one of them), and all that happens is talk, and talk. <br><br>To one who may not be familiar well with Bergman, it may not be wise to go immediately to this film. That is, unless one is very much in love with the theater. The filmmaker, who was also a major producer and director of countless theatrical production, is able to suffuse his personal views, good and bad, on the process, or the lack thereof. Interesting too is how his lead male, Henrik (Erland Josephsson, one of Bergman's most recognizable and accessible talents), has a conversation not just with an aspiring actress (Lena Olin), but also his ex-wife (Ingrid Thulin, also one of the magnificent women from Bergman's repertory company), to explore his past and present difficulties.<br><br>There is so much that Bergman brings to the table to discuss about the theater in this film, and in such a short running time, that it might be moot to delve very far into his what certain things may or may not 'mean'. Like many of the director's films, it's dramatic structure that tries to get behind the surfaces of what lies in seemingly one or two-sided characters. Henrik, at times, is given voice-over narration where he questions what he's saying, sometimes in anger or despair, to this young actress. Or, when his love (Thulin) is shown to be somewhat compassionate even as she seems a little crazed or, in fact, lonely. As Henrik and his pupil talk (not rehearse, of course) about why they are there, it becomes strikingly existential even when it's not meant to be. Olin is brilliant in the opposing side of Josephsson's often calm but boiling persona, as she tries to figure out what it is this director wants out of her.<br><br>When it comes down to it, Bergman is not only asking questions about the theater and the people in it, but also about human nature in its role of the theater. While this could sound like subject matter to scare or (worse) bore away some viewers, if you give the film enough patience for the 72 minutes (that seem to fill each minute with enough substance for an average work twice its length), it serves its purpose well enough to not be disregarded as an important later work in Bergman's career. And, by the way, if you're young (i.e. under 17) and have some reason to want to check this out, don't let the R rating deter you; it's one of the most un-necessarily R-rated films ever (for a brief flash of nudity, which could very well even be given a PG rating). A+","user":"Quinoa1984","rank":[22,24]},{"title":"Much more than a minor work","rating":9,"date":"28 December 2012","review":"I may be biased though as I love and admire Ingmar Bergman. After The Rehearsal mayn't be among Bergman's very finest films, but it does deserve to be much more regarded as just a minor work. It could have done with being longer perhaps but all the things that make a Bergman film work are here. The cinematography from none other than Sven Nykvist is tight and helps to intensify After the Rehearsal's intriguing drama, while the setting looks beautiful yet realistic. Bergman as he always did directs with discipline, never once is there a sense that his heart was not in it. The scripting is intelligent and provokes a lot of thought, likewise the story is insightful in regard to art and emotion- I always admired how ambitious the themes in his films were- and almost autobiographical in structure. I have seen and heard people remark that they were indifferent to the characters, now the characters in Bergman's films are not always that likable but considering how realistically compelling they are(especially the women) you do get the sense that they weren't meant to be. Adding to this is how superbly acted After the Rehearsal is, you get that expectation seeing as we are talking about some of Sweden's finest ever actors and never here are you disappointed. All three leads, very hard to single out a standout, are really captivating and immerse themselves totally into the characters. All in all, very, very good. 9/10 Bethany Cox","user":"TheLittleSongbird","rank":[6,6]}]