[{"title":"Early performance by Lorre, dark film","rating":8,"date":"18 May 2009","review":"Josef von Sternberg directed this version of \"Crime and Punishment,\" starring Peter Lorre, Edward Arnold, and Marian Marsh in 1935. It's an updating of the great novel, with Lorre as a man tortured by his own conscience.<br><br>It's a fairly dreary-looking affair, quite dark, with impressive use of shadows. The most interesting aspect of the way it was filmed to me is how Lorre's small stature is emphasized, as if the staircase, for instance, was over-sized. The incomparably beautiful Marian Marsh is the prostitute who tries to help him, and she gives a very gentle and heartfelt performance. Edward Arnold is the bombastic head of the murder investigation of the pawnbroker (Mrs. Patrick Campbell) - he's plenty scary. I don't blame Lorre for being a complete wreck.<br><br>Lorre is excellent playing a character who vacillates between arrogance one minute and fear the next. Definitely in the top ten of unusual faces and voices in film history, his hooded eyes show the torture the character is suffering.<br><br>Definitely worth seeing for von Sternberg's direction, Lorre and Marsh.","user":"blanche-2","rank":[35,36]},{"title":"remarkable film","rating":9,"date":"11 May 2013","review":"I read the book so long ago that I'd forgotten many details, which was fine - I watched it as a rainy afternoon film presented by Ted Turner, and it is indeed a Turner Classic Movie. <br><br>Slammed by many, it is in fact very well written, extremely well acted, and a revelation of Peter Lorre's range. He carries the film brilliantly. It's essentially a long dialog between Raskolnikov, a brilliant, impoverished writer on crime, and Inspector Porphyry, nicely interrupted by Raskolnikov's thoughts on crime, interludes with his family, and his love-life. Made on a low budget, it proves yet again that money isn't everything. Intense, excellent acting, direction, editing and camera work do the job, as with so many low budget European films. It's about people and ideas, not special effects and stardom. <br><br>What you get is a minor classic with no empty spaces and nothing extra. The narrative drive is cumulative and very human. Deprived of Dietrich, von Sternberg has no problem, and gets the best out of Edward Arnold and Marian Marsh (and everyone else) as well as Lorre. No weak spots, all class. It's also the perfect demonstration of how to find an excellent film in a great novel: by not trying to include everything, but going to the heart of the matter.","user":"bfrostaing","rank":[18,18]},{"title":"As a film adaptation","rating":7,"date":"14 July 2009","review":"I have spent my entire adult life reading and teaching the works of Dostoevsky, and as such I often approach film adaptations with a great deal of trepidation. Cinematic adaptations of ambitious Russian novels inherently involve a tremendous amount of compromise and reduction. At worst, they become embarrassing comic-book imitations of the original, and, at best, they become representative distillations, provocative fragments.<br><br>If one wants to see the best attempt at the latter, one should see the 1970 Kulidzhanov film version, which hews as close as possible to the original spirit and themes of the novel.<br><br>This 1935 von Sternberg version does not fall neatly into either category. It certainly makes some wrenching changes to the original-- not just in terms of plot details (such changes are inevitable for the cinematic form), but even to the thematic spirit of the original (Roderick receiving such high honors at the outset; Roderick entering a such a strident Napoleonic phase _after_ the crime; the momentary 180-degree reversal in Sonia's final speech), but what does come through successfully is a kind of gestalt rumination on the original novel. If Dostoevsky's novel was an exquisitely perfect, ambitious symphony, this film is a jazz rhapsody on the theme of the book; it borrows and rearranges motifs and creates its own new song, a song nothing like the original in particulars, but a worthwhile song on its own merits.<br><br>The film certainly seems to make full use of the serendipitous similarity in appearance between Lorre and Napoleon in his most famous portraits (Lorre even hams it up by sliding his hand under his vest at one point, which is the stereotypical Napoleonic gesture). And the decision to set the story in no particular city, it seems to me, was a judicious one, as it eliminates much of the painful artificiality that inevitably comes when Anglophone films attempt to portray Russian society.<br><br>In short, I do think this is a worthwhile film if it is judged as a creation unto its own-- not the novel per se, but a kind of Hollywood, proto-noir inspired by the great book.","user":"Local Hero","rank":[34,36]}]