[{"title":"Supernatural slasher with some stylish touches.","rating":7,"date":"11 August 2012","review":"Conrad Radzoff is more or less a combination of Vincent Price and Christopher Lee:two famous Gothic horror icons.He sleeps in his coffin like Bela Lugosi and he considers himself a superstar.Unfortunately the times of his stardom are falling apart as he only gets silly roles in commercials.So Conrdad kills his director and after murder he suddenly dies.His body is kept in creepy Gothic mausoleum.A group of university students decide to steal his coffin and defile his corpse.But Conrad isn't really dead.He rises from his slumber and kills defilers one by one...\"Frightmare\" by Norman Thaddeus Vane is a likable supernatural slasher with few gory deaths including decapitated Jeffrey Combs.The storyline is absurd with standard scare techniques,but if you like supernatural slashers with levitating coffins give this one a chance.7 horror stars out of 10.","user":"HumanoidOfFlesh","rank":[5,5]},{"title":"Gothic Gore","rating":15,"date":"15 October 2003","review":"Frightmare is an interesting attempt to combine the old thirties style horror with eighties slasher. Ferdinand Mayne stars as Conrad Ragzoff, an arrogant old ham horror actor who dies of a stroke. Some of his fans steal his body from his tomb(what fans!) and all heck breaks loose. Mayne is lots of fun, appearing on a special monitor in the tomb and taunting his soon to be victims. The opening parts of the movie are wonderful; showing Conrad's old movies, him taking care of an unlikeable director, etc. The scenes in the old house, where Conrad stalks the kids, are a little more basic, but still entertaining.<br><br>Jeffery Combs is good, but the movie really belongs to Mayne. He seems to enjoy himself and makes the movie lots of fun. So basically, it's not one of the great horror movies or anything like that, but still well worth seeing for fans of eighties horror.","user":"Sanguinaire","rank":[12,17]},{"title":"Only a tiny bit underrated...","rating":11,"date":"11 October 1999","review":"Although I do agree that Frightmare is underrated, it isn't something to put too much work into finding.<br><br>The storyline is a semi-interesting twist on the life after death theme: A legendary horror actor [Conrad] dies mysteriously in his bedroom.  At the funeral his 'last film' is shown: a short with him stating that there is life after death and that he's watching all of the people that are watching the film.  A little later, a group of horror/drama kiddies decide to steal Conrad's corpse and bring him to the house where some of his movies were filmed.  The kids slowly start to disappear, one by one...<br><br>The first few death scenes are the only downright amazing thing about this movie.  It was nice to see some regular, down to earth 'mental murder' after watching two gore filled movies beforehand.  But even that can't save it -- the murders start to get bloody in a very cheesy way, and them themselves become as boring as the movie itself.<br><br>I'd suggest renting this only if you have the money to blow and you aren't expecting a masterpiece.  There's better horror films, but every once in a while you need to see something average to remind you of that.","user":"b. koski","rank":[9,14]}]