[{"title":"Literally","rating":8,"date":"14 June 2006","review":"There may be better directors than German New Wave auteur Werner Herzog, but if viewed entirely in terms of how interesting they are personally, Herzog stands above all. His tales of working with deranged German actor Klaus Kinski are the stuff of legend: from filming deep in the jungle using real natives to pushing a ship over a waterfall for Fitzcarraldo to apparently earnestly plotting to kill his star. Or, more recently he saved Joaquin Phoenix from a car crash and then disappeared before he could be thanked. His personality even transfers over remarkably in this short film directed by Les Blank.<br><br>We learn that Herzog apparently was friends with Errol Morris. While Morris was still a struggling young filmmaker, Herzog had made a bet with him that if he ever got his film made, the former would eat his shoe. Well, in 1979 he finally does make a film, Gates of Heaven, and Herzog comes to live up to his promise. The film chronicles Herzog as he garnishes, cooks, and eats one of the shoes with some salt and garlic on stage during the film's premiere. This all happens and Herzog still has time to say things like how we must declare holy war on what we see every day on television, talk shows and Bonanza; and how it requires some self-degradation in order to be a director, all in 17 minutes.<br><br>So for a short film it works quite well at capturing his essence. It's also up on YouTube to watch for free and in its entirety. This is a good thing, as it is not even available on Netflix. So if you have 20 minutes to spare, it's well worth watching.","user":"dreamsarefreemofo","rank":[11,12]},{"title":"\"Old whiskey shoes\"","rating":10,"date":"1 October 2006","review":"This is a little documentary prepared by Les Blank about Werner Herzog's sort of bet to Errol Morris that he should make a movie, but if he did with the luck that he would need as a first time director, he would literally eat a shoe. Herzog adamantly says in the documentary that he's only doing it in support of Morris and his film (which at the time this doc was released didn't yet have distribution despite its great acclaim at festivals), though there's something sublimely absurd about it all, even through Herzog's deadpan/serious talks to the camera. He talks a bit about Morris and his film too, and his praise for it is all well and good. But it's even more interesting to see a) Herzog's views on commercialism and film-making and the lack of \"adequate images\", and b) director Les Blank's inventive cross-cutting between the on-stage eating of the show, footage of Charlie Chaplin doing the act in a silent, and Herzog talking to the camera. It's funny once or twice, perhaps unintentionally from Herzog's words (i.e. \"it's not self-destructive to throw yourself into a pile of cactus\"). But for the most part it's meant as a very serious act of foolishness not just for Morris but for filmmakers everywhere. If you can find it- and it's now available on free sites like you-tube- it's worth a look, especially if you're a fan of Herzog. And for Morris fans too there's a quick treat in an outtake from Gates of Heaven spliced in at one point. That song, by the way, of which I quote in the one-line summary, is awesome.","user":"Quinoa1984","rank":[14,17]},{"title":"Short, strange, fun","rating":9,"date":"27 May 1999","review":"Werner Herzog has put his mark on the world of movies, even though you may not know the name right away- he made \"Fitzcarraldo\" the movie about the opera fan who halls a boat over a mountain. This documentary is shot by Les Blank and details a bet Herzog made to a friend that he would eat his shoe if his friend completed a film. Well, Herzog does have to eat his shoe. And it's very weird, but Herzog is a bit of an odd guy himself. It's a short enough documentary and fun to watch. This documentary is one of two about Herzog- the other is an award winning \"Burden of Dreams\" about the filming of Fitzcarraldo. I highly suggest checking it out if you enjoy this.","user":"kulaboy","rank":[10,12]}]