[{"title":"A bit dated now but great stuff!","rating":7,"date":"15 June 2009","review":"I've got to be honest here: I first saw this movie in my teens and loved it, so I might be a bit biased here, ignoring it's flaws. Just saw it again, over 10 years later, and I gotta say, while it didn't have the 'wow' effect it gave me before, It still holds up as a decent movie. This movie is fast paced and just crammed with awesome ideas that sometimes work, and sometimes could have been used more effectively.<br><br>What do we have? <br><br><ul><li>An insane serial killer - This guy just oozes evil, amazing bad guy. </li></ul><br><br><ul><li>A very cute psychic - man did I have a crush on her!</li></ul><br><br><ul><li>Plenty of mysterious happenings and scares (though not very scary for seasoned moviegoers)</li></ul><br><br><ul><li>Cool action sequences. That ceiling fan scene is so awesome. </li></ul><br><br><ul><li>Satanic superpowers. How is that not super cool? </li></ul><br><br><ul><li>The pacing is great, with lots of interesting scenes. </li></ul><br><br><ul><li>Nice touches of humor now and then.</li></ul><br><br>So What could be better?<br><br><ul><li>The ending is a bit unsatisfying. </li></ul><br><br><ul><li>Things could be bigger and more epic. </li></ul><br><br><ul><li>While decent, Lou Diamond Philips could be replaced with many other actors, and there are more charismatic ones out there. </li></ul><br><br><ul><li>Seeing it again, it wasn't that scary, but I remember that it was the first time. Could be scarier though, I guess.</li></ul><br><br><ul><li>If you analyze things too much, there are lots of small plot holes.</li></ul><br><br>This movie is like an older, more low budget version of 'End of Days' with Arnold Schwarzenegger (which I liked as well). If what I told you sounds interesting, this movie is a great way to spice up a boring Sunday evening!","user":"le_wubster","rank":[15,21]},{"title":"Piggy piggy.......","rating":7,"date":"17 October 2016","review":"Patrick Channing,born out of an incestuous relationship, and living through an emotionally scarring childhood, gives in to Satanic forces and becomes a murderer known as The Pentagram Killer.<br><br>He becomes the main target of Detective Russell Logan, whom engages in a battle of wits with Channing in life and after death.<br><br>It appears that Channing can't be stopped, because sentencing him to death gave him the titular power...<br><br>If the summary sounds familiar, that's because it was remade in 1997 as the Denzel Washington film 'Fallen'. And while that film is the better known and has the bonus of a more 'talented' cast, this one is by far the most fun.<br><br>Finally after years of being sandwiched between Kiefer Sutherland, Diamond Phillips gets his own action vehicle, and he's loving every minute of it.<br><br>His Logan is your atypical yuppie late eighties cop. Wearing trousers up to his chin, holding a gun in a very silly way while running down dark alleyways with Melanie Griffiths less famous sister.<br><br>And the film gets straight to the point with an outstanding film stealing performance from Kober as the antagonist. Kober must have known that this would have been a breakout performance for him, so he gives it his all, absolutely owning every scene that he's in.<br><br>Phillips is good, but he's just playing the straight second fiddle cop to the maguffin of the film, namely the killer. So whilst we are following the narrative from Logans point of view, what your really waiting for is what he will discover next, and whose body will be taken over next.<br><br>It's a good looking film, especially when you consider the budget, and the fact that it could have easily have been stuck in a fashion/music time capsule (there is the trousers though).<br><br>some of the stunt work is pretty jaw dropping, even today, particularly the car chase, the way once the killer is reborn he knows martial arts, and the films standout scene, the jump from the building, which is alone worth watching the film for.<br><br>So all in all, it's a forgotten slice of early nineties cheese, but thanks to the recent release of the Blu Ray, it may finally get the recognition it deserves.","user":"FlashCallahan","rank":[9,12]},{"title":"fast paced supernatural thriller","rating":8,"date":"11 June 2006","review":"You can only see a movie for the first time once and so I have to admit that THE FIRST POWER worked on me the first time I saw it in theaters. It moved with such lightning speed that I didn't have time to ponder its snowballing silliness. The director, Robert Resnikoff, knows how to construct an action film--the cinematography is first rate and the editing superb-- he just doesn't know when to stop. There are car chases, horse and buggy chases, foot chases and innumerable shoot-outs, and at one point the killer even brandishes a ceiling fan as a rather laughable weapon and all the action movie huggery-muggery sits rather uneasily on top of the supernatural elements.Lou Diamond Philips, though a tad young-looking to be such a seasoned detective, gives a competent performance. Jeff Kober is obviously having fun playing the killer and it shows; he has a toothy menace that's suitably creepy. Probably the best thing going for THE FIRST POWER is a truly unnerving and effective soundtrack from Stewart Copeland. The director pulls off some nasty mind-trips on the character played by Philips, one where he wakes to find his apartment seemingly covered in blood and another in a confessional booth when he goes to get some answers from a local priest.","user":"raegan_butcher","rank":[13,20]}]