[{"title":"Best Version of Kipling Tale Put To Film.","rating":8,"date":"4 January 2007","review":"A young child wanders off into the woods and is lost. With the dangerous, bloodthirsty tiger Shere Khan lurking about, the little boy is adopted by wolves and raised in the jungle. Later embroiled in a jungle feud with Shere Khan, the partly grown boy is driven out of the jungle back into the world of man where he seeks a tooth (a knife) with which he can once and for all strike down his arch nemesis. However the world of man offers many unseen dangers and man isn't inclined to follow those laws of the jungle to which the animals abide.<br><br>Personally I feel this is the best adaptation of the \"Jungle Book\" Rudyard Kipling story put to film. I prefer this over the Disney versions because it never fully loses sight of its overall message, doesn't fail to show the key differences between man and beast, and isn't bogged down by comedy or musical distraction. It's also fun and adventurous, boasts real animals in the familiar roles who give surprisingly believable performances. Lead Sabu as Mowgli is a natural to the role while character actor Joseph Calleia does quite well as lead villain Buldeo. Calleia made quite a career out of playing such roles. By far the silliest moments here have got to be the result of the talking snakes with the human voices. They are the only critters in the film to talk in such a fashion. While the information they relay is vital to the plot of the movie, I'm not sure we really needed to actually hear it spoken aloud. Also the romantic subplot doesn't quite fit in the story either and that it's introduced and never resolved is somewhat disappointing. Still at the end of the day, you want jungle adventure excitement done right, you won't go wrong with 1942's Jungle Book.","user":"Space_Mafune","rank":[27,29]},{"title":"Memorable Star, Brilliant Art Design--And Incredibly Dire DVDs","rating":7,"date":"4 August 2005","review":"Loosely based on the Rudyard Kipling \"Mowgli\" stories, the 1942 JUNGLE BOOK offered war-weary audiences brilliant Technicolor, elaborate sets, numerous action sequences, exotic animals, lost treasure, and a climatic firestorm--not to mention charismatic Indian-born star Sabu in a persistently and titillating half-naked state. It was easily one of the most popular films of the year, a two-hour respite from some of the darkest days of World War II, and its style was so admired it easily won two Academy Awards for best color cinematography and best art direction.<br><br>Seen today, however, JUNGLE BOOK is considerably less enchanting. Much of the film's original appeal arose from audience interest in seeing \"jungle beasts\" in full color--and while several of the animal sequences (particularly those relating to tiger Shere Khan) are classics of their kind, most modern audiences have seen many such scenes in many later films. Further undercutting the animal-interest is the film's use of several animal \"dummies\" that seemed realistic in 1942 but which are now very obvious in their artificiality.<br><br>What remains, however, are Sabu and the overall design of the film, both of which are quite remarkable. Sabu (1924-1963) was an extremely unlikely star, plucked from complete obscurity in India by the Korda brothers to star in the 1937 ELEPHANT BOY. Fluent in English, unexpectedly charismatic, and with a handsome face and impressive body that the Kordas displayed to great effect, Sabu's greatest success would come with the 1940 Korda brothers' production of THE THIEF OF BAGDAD, and he would remain a popular actor in exotic roles throughout World War II. Although not his best film, JUNGLE BOOK captures Sabu at the very height of his appeal--and that is saying a great deal indeed.<br><br>The design of the film is equally notable and provides a perfect backdrop to Sabu's charms. Filmed largely on soundstages where producer Alexander Korda, director Zoltan Korda, and art director Vincent Korda could exercise absolute control over every aspect of the film, JUNGLE BOOK is a study in the art of the Technicolor process and easily ranks among the finest color films of that decade. The sets, particularly the complex jungle and \"lost city\" scenes, are both remarkably fine and beautifully photographed, and the firestorm that climaxes the film retains considerable power.<br><br>Unfortunately, however, there doesn't really seem a single DVD edition of the film that presents the film in its full 1942 glory. JUNGLE BOOK is among a number of famous films that has fallen into public domain--and the result is a host of incredibly dire releases to the home market. I have seen, either in full or in part, at least a half-dozen DVD releases of the film, and in each instance the colors are extremely muddy and the picture very fuzzy, often to a point at which the movie is virtually unwatchable. And sadly, given the obscurity of the film in the wake of the popular Walt Disney animated feature, we are very unlikely to see anything better.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[27,29]},{"title":"The brothers Korda","rating":19,"date":"19 March 2009","review":"When the Second World War began three brilliant Hungarians Jews who had made a name for themselves in London -the impresario/director Alexander and his two brothers Zoltan, also a director, and Vincent, artist and art director-- escaped to Hollywood and started making movies. After the international success of their superb London Film Productions, among them \"The Thief of Bagdad\" (1940), \"Rembrandt\" (1936) and \"The Private Life of Henry VIII\" (1933), the three began all over again in distant Hollywood. With its Indian themes and actors, few viewers today have recognized that most of this production was shot in 1941-1942 on Hollywood sound stages, primarily the low-budget Hollywood Center Studios on No. Las Palmas, not far from the more luxurious Paramount Studios. Producer Korda with his brother Zoltan as director were brave enough to mix a native-born Indian actor, Sabu (\"Elephant Boy\") with two Hollywood star character actors, Spanish-born Joseph Calleia (\"Touch of Evil\") and Sicilian-born Franco Puglia, both heavily made up. Eternally loyal as the Kordas were to their native countrymen, they never forgot to hire their fellow expatriates: the astonishing music is by Budapest-born Milklos Rozsa (\"Spellbound\") and orchestrated by Eugene Zador; the second-unit work, the animal sequences and those probably shot on location in India, were directed by Andre de Toth, born in Mako in old Austria-Hungary. American born Bill Hornbeck who edited the Korda's \"Scarlet Pimpernel\" in London did the cutting and Lee Garmes (\"Night of the Hunter') and the Technicolor pioneer, W. Howard Greene, did the cinematography. The excellent sound effects are not credited.","user":"ilprofessore-1","rank":[10,10]}]