[{"title":"well-acted study of a dead marriage","rating":9,"date":"13 December 2004","review":"THE HAPPY ENDING might not seem special today, and may well seem very dated in some ways, but we must remember this is the pre-DIARY OF A MAD HOUSEWIFE era. I'm sure the film seemed pioneering in its day, questioning the role of the traditional housewife and demanding that women are entitled to the same satisfaction and autonomy that men expected. Writer-director Richard Brooks often dealt with social issues and political themes--that he took on women's issues is no surprise. The film is especially an acting tour-de-force: Jean Simmons as the unsatisfied woman; John Forsythe as the non-understanding but well-meaning husband; Teresa Wright as Simmons' mother; Dick Shawn and Tina Louise as a miserable couple; Shirley Jones as the woman who survived by having affairs with married men; Lloyd Bridges as a married man with Jones as his mistress; Bobby Darin as a lost and lonely gigolo looking for that one big score. I was also impressed by the film's structure--with two parallel stories a year apart and various flashbacks all presented in such a way that the details of the relationship's coming apart are given to us a little at a time, and we are gradually brought to the point where we understand WHY the present state has become what it is. It's quite well-paced and creates tension throughout. Also, the unexpected and non-traditional ending is perfect. It's tempting to wonder what these rich people are whining about when people in the same community are working two jobs, sixteen hours a day, or starving, or dying of cancer, but Ms. Simmons' performance makes us care about and sympathize with her character. The film would perhaps also be of value as an educational tool for future generations who want to understand the ending of the pre-feminist era. Those who enjoy the teaming of stars Jean Simmons and Shirley Jones and director Richard Brooks should also check out his excellent film version of Sinclair Lewis' ELMER GANTRY. Those who know Shirley Jones only from The Partridge Family might be shocked to see what a fine dramatic actress she is!","user":"django-1","rank":[35,38]},{"title":"One of my favorite films","rating":9,"date":"3 April 2014","review":"When I first saw THE HAPPY ENDING, back in 1970, I was blown over by the film's sensitive portrayal of an unhappy housewife trying to decide what to do with her life. I took family and friends to see it and most people liked the film, finding it unusually frank as a portrayal of a failed marriage. I still find THE HAPPY ENDING very good. It is aesthetically rooted in the late sixties but that does not diminish its essential value. The all-star cast is excellent (Jean Simmons, John Forsythe, Teresa Wright, Nanette Fabray, Shirley Jones, Bobby Darin, Lloyd Bridges, Tina Louise) and Jean Simmons might have shared the Oscar with Maggie Smith that year. Both actresses deserved to receive acting honors for their respective roles. I love the jazzy music score by Michel Legrand; Marilyn &amp; Alan Bergman's beautiful song-theme for the film is a perennial favorite of mine as far as romantic songs are concerned. All in all, I will always have a special place in my heart for THE HAPPY ENDING.","user":"ricbigi","rank":[11,11]},{"title":"In typically ironic '60s fashion, nobody here has the capacity for happiness","rating":6,"date":"3 April 2001","review":"Pauline Kael, film critic for the New Yorker, quipped about this film, \"It's the kind of liberation movie that never liberated anyone.\" That's a clever line, but it isn't exactly true. Writer-director Richard Brooks shows the upwardly mobile as stiff dullards with drinks in their hands, the upper middle class as stifling bores. There's wry wit in these vignettes, but the trouble with Brooks' film is the central character. As played by Jean Simmons, she's one of those bored and lonely housewives who desires MORE! Simmons is repressed of her emotions, yet even when she makes her escape, she's still a pinchy drag. The supporting characters aren't written any better, but the performers themselves are more interesting: Bobby Darin is terrific as a phony gigolo, Tina Louise excellent as an acerbic society wife, Shirley Jones lovely as a single woman trying to remain casual about her married lover. John Forsythe gives his standard controlled performance as Simmons' confused spouse (he doesn't know how to reach her, which is a sympathetic quality since we don't either). The title means to tell us that we make our own happy endings--that we can't find them through other people--and the final scene between husband and wife is a tricky little chess-move that leaves us up in the air. I liked many things in \"The Happy Ending\", but its parts are better than the sum. **1/2 from ****","user":"moonspinner55","rank":[33,38]}]