[{"title":"Entertaining British horror anthology.","rating":7,"date":"2 February 2004","review":"Roy Ward Baker directs this horror anthology from the pen of macabre master Robert Bloch. Dr. Martin (Robert Powell) is a psychiatrist who wishes to work at an asylum for the incurably insane. In order to gain employment he is set a task by the house chieftain Dr. Rutherford (Patrick Magee) whereby he must discover the identity of a former doctor-turned-patient. Dr. Martin speaks to four different patients in an attempt to discover who used to be the psychiatrist and each patient relates to him their own particular terrifying story.<br><br>Robert Bloch, the man responsible for writing the novel of one of horrors greatest movies, Psycho (1960), writes for us four intriguing and pleasurable short horror pieces bound together wonderfully in the confines of an asylum. The film (produced by Amicus studios and now available in the UK in a wonderful box set) has a distinct feeling of a Hammer Horror production to it. The emphasis is on the story and artistic merit rather than cheap shocks and Roy Ward Baker does an excellent job throughout the production of building tension so that each shock has a desirable effect on the viewer. Each segment benefits from a marvellous cast which features the undeniable talents of the legendary Peter Cushing in The Weird Taylor and the beautiful Britt Ekland in Lucy Comes to Stay. Britt Ekland would go on to co-star as the seductive landlords daughter Willow in the classic British horror The Wicker Man just one year later.<br><br>The various segments themselves vary in quality, although not too dramatically. The opening segment, Frozen Fear is a deliciously campy story about a man whose murdered wife seeks revenge on him and his lover. This particular segment may be a little too silly for some horror fans but it works as a perfect mood setter for the rest of the movie. The directorial style is what makes this segment worth watching. There are some wonderfully flowing shots which seek to give the short segment a distinctly unsettling edge despite the short falls of the script and story. A wonderful performance from Barbara Parkins of Valley of the Dolls (1967) fame in the role of Bonnie caps the segment exquisitely and the climatic scene back in the asylum following the story give the segment an overall horrific nature.<br><br>This segment is followed by The Weird Taylor which stars Peter Cushing as a devastated father who turns to the occult to resurrect his deceased son. He enlists the help of Bruno (Barry Morse), a taylor desperately in need of money, to make for him a suit to specific instructions. This segment is possibly the weakest of the four yet remains enthralling as the viewer cannot help but wonder just where this particular story is headed. Once again Roy Ward Bakers direction during this segment is powerful as he creates a dark and despairing atmosphere despite the limitations of time and the story. Cushings performance is certainly memorable as is Barry Morses. The climax of the story is well portrayed but is unfortunately harmed by an air of unnecessary camp. Still, The Weird Taylor is entertaining nonetheless but may be off-putting due to its overly slow nature.<br><br>Up next is Lucy Comes to Stay which tells the story of a young girl (Charlotte Rampling as Barbara) who apparently has been recently released from a mental institution for her schizophrenia. She is still haunted by her imaginary friend Lucy (Britt Ekland) who soon makes an appearance and convinces her to leave the safety of her brothers house. Murder and mayhem follow and the despairing Barbara reaches breaking point pretty quickly. This particular segment works more on the basis of the storyline rather than direction as there is little in the way of atmospheric build-up. Britts on-screen presence is commanding and powerful and her portrayal of a horror villain is so good that one wishes this segment had been made into an entire feature length movie as opposed to the short segment that it is. The shock scenes are blended into the story seamlessly with a superb accompanying soundtrack. This is my favourite of all the segments.<br><br>The film finally finishes with Manikins of Horror where a former doctor believes that he can make and control little dolls. This segment takes place wholly back in the asylum and unlike the previous three stories there are no flashbacks to past events. This segment is possibly the most original of the stories and could even be possible influence for Childs Play (1988). Unfortunately, the story falls short as it becomes hard for one to suspend their disbelief yet the segment works as an excellent precursor to the genuinely surprising and shocking ending. Undeniably camp yet strangely intriguing this is a fitting ending to a generally entertaining horror film. For those who like horror anthologies and Hammer-style productions, one cannot go too far wrong with this entertaining British horror film. The film fails to maintain quality from start to finish but does not fail to entertain, surprise or shock. To sum up - an entertaining piece of horror anthology fare with some excellent direction, beautifully atmospheric scenarios and accompanying music and a strong cast who all give credible performances. My rating for Asylum (1972)  7/10.","user":"Snake-666","rank":[50,53]},{"title":"A lost classic","rating":7,"date":"12 February 2007","review":"Very good photography, acting, dialog set this horror anthology above most others. There is a clever beginning which then evolves into 4 separate stories of individuals inside an asylum. The 1st story is the most gruesome. The 2nd story is the most intriguing and also has Peter Cushing in it doing a excellent job as usual. The 3rd story is the weakest and the 4 th story ties into the twist ending. With each story only lasting an average of 15 minutes, they keep the viewers interest. This also has a nice soundtrack { something almost totally missing from todays horror crap,remkaes and sequels} . For those of us who like style, originality and solid acting in our horror films, this deserves a look.","user":"lucky_dice_mgt","rank":[18,19]},{"title":"Very entertaining horror anthology with a first rate cast.","rating":18,"date":"18 February 2004","review":"'Asylum' holds a special place in my heart as watching it on TV as a kid in the 70s is one of my earliest horror memories, along with Rod Serling's almost forgotten series 'Night Gallery' and the underrated Cushing/Lee movie 'The Creeping Flesh'. I watched 'Asylum' the other day for the first time in oh, twenty years at least, and while it wasn't anywhere near as scary as I remember it to be, it's still one of the better horror anthologies of the period. It's helped considerably by having Robert Bloch adapt his own stories, Roy Ward Baker ('The Vampire Lovers', 'Dr Jekyll and Sister Hyde') as the director, and it features a first rate cast including horror legends Peter Cushing, Patrick Magee, and Herbert Lom. The most effective stories for me were the two in the middle - the one with Barry Morse as a tailor with a mysterious client (Cushing), and the other with a fragile Charlotte Rampling being led astray by the sexy Britt Ekland. 'Asylum' has a few flaws sure, but it's still a very entertaining film, and horror buffs will enjoy it.","user":"Infofreak","rank":[14,15]}]