[{"title":"Direct sequel to Mad Doctor of Blood Island is much better if seen as part of a double feature program with the first film","rating":7,"date":"21 October 2006","review":"This the direct sequel to Mad Doctor of Blood Island. Its the fourth (or third if you don't count the unrelated Terror is a Man) in the Blood Island saga. Literally picking up hours after the first film, the film begins on the boat sailing away from Blood Island. As John Ashley waxes poetic about his time on the island fighting monsters the man beast from the first film appears (he was seen to have secreted himself in a lifeboat at the end of Mad Doctor) and a battle occurs which destroys the ship and leaves Ashley as the only survivor. A year or so later Ashley heads back to Blood Island to investigate stories that weird things have begun to happen again despite the death of the evil Dr Lorca. On the island Ashley finds that many people he believed dead survived the final battle of the first film and that some how the \"green men\" have returned. It isn't long before its realized that Dr Lorca is back and up to his old tricks.<br><br>Finally watching this in close proximity to Mad Doctor I found that the film plays much better than it does as a stand alone film. I was never a big fan of this film prior to the back to back viewing because I always felt that it was missing something. What it was missing was the set up that the first film gives it.If you watch the two films together I think you'll find it a better film than when it's viewed all alone.<br><br>A sequel it is, but its not as scary (nor as gory nor as titillating). Sure there are some horrifying moments, but on some level this is more an adventure/ mystery film than a real horror movie. The man-beast is effectively off camera for most of the film following the opening battle (I have to say the make up here is infinitely better than in Mad Doctor). Some of Lorca's victims do cause mayhem, but the majority of the film concerns trying to find Lorca and the kidnapped reporter. Its not bad, but if you are expecting a straight horror film you may end up very disappointed, despite a great monster.<br><br>What can I say, I took it on its own terms and I liked it, high art its not. Definitely worth seeing especially as part of a double feature with Mad Doctor of Blood Island.","user":"dbborroughs","rank":[19,20]},{"title":"Teenage Memories","rating":10,"date":"6 December 2008","review":"Please forgive me but what follows are my memories encountering this movie 30ish years ago as a teenager of about 13 who had never seen an R-rated movie. I suspect only those of you who lived in the middle of North America cut off from the coasts will really appreciate this story. I lived in Winnipeg, Manitoba Canada just above the barren expanses between us and North Dakota so that map goes. One of our main contacts with the outside world was a US border TV station with the call letters KCND. KCND knew Canadian advertising was central to its bottom line. It served admirably as a cross border institution serving both southern Manitoba and Northern North Dakota with offices in both countries before switching call letters to CKND. I don't know if K/C-C/K-ND survives today either as a US or Canadian outlet. Anyway this station had a movie on Saturday night at 10:30 PM which I think was called Chiller Theatre or something like that. As I remember, the movies were the usual stuff for the time, mostly 1950's fare which I still enjoy to this day. Then one night Beast of Blood appeared. From the opening I knew this movie was completely different. The camera effects, a hideous and to this day still frightening, dripping, oozing chlorophyll monster, a guy falling into a pit of wooden stakes pumping-- no gushing-- blood from his wounds... and John Ashley and Celeste Yarnell naked. I had never seen anything like it. The other two \"Blood\" movies followed on CKND one of which featured the mamorable, I mean memorable, Angelique Pettyjohn from Star Trek naked with John Ashley. Beast of Blood stayed with me for 30ish years. Then I saw the DVD and confirmed that in in the 70s my prairie TV station showed it completely uncut! I miss the renegade drive-in days. This, even though I saw my drive-in movies on TV.","user":"edwstraker","rank":[15,16]},{"title":"A Fitting Close to a Pulpy Trilogy","rating":5,"date":"3 February 2007","review":"Although the second film in the Filipino Blood Island trilogy, \"The Mad Doctor of Blood Island\" (1969), has no relation at all to the original picture, \"Brides of Blood\" (1968), \"Beast of Blood\" (1970) picks up mere seconds after part 2's conclusion. In this final part of the trilogy, John Ashley returns to Blood Island, in pursuit of the chlorophyll monster that had wrecked the ship he'd been sailing on. He is accompanied this time by a sassy newspaper columnist hot on the trail of a possible scoop, and played by the scrumptious Celeste Yarnall. Once back on the island, we learn that Dr. Lorca (played here by Eddie Garcia, not Ronald Remy) survived the inferno that had culminated part 2, and is keeping busy by trying to attach a new head onto the chlorophyll monster's torso. (Well, everyone needs a hobby, right?) Anyway, this film is as pulpy as can be, and dishes out more of the same mix of blood, guts, mutants and jungle adventure that were the hallmarks of the previous installments. It manages to incorporate maggots, quicksand, pitfalls, cobras, gorgeous native girls, gross-out surgical sequences, and a battle royale with hand grenades, knives, spears, machine guns and rifles...all to guarantee a rousing show. The chlorophyll monster himself is not given much screen time this go-round--the picture is more of a jungle adventure, and was filmed, Celeste tells us in an interesting interview segment on the DVD version, four hours in from the nearest dirt road! I'm happy to report that the great Bruno Punzalan returns in this, his third Blood Island film, and will likely strike most viewers as a kind of Filipino Oddjob. Please don't get me wrong...these films are guilty pleasures at best, and are hardly exemplars of the cinematic crafts. Still, they're presented with a good deal of panache, and \"Beast of Blood\" brings the series to a fitting close. Plus, hearing that gorgeous Filipino gal say \"un-com-FORT-a-ble\" is worth the price of admission itself!","user":"ferbs54","rank":[9,9]}]