[{"title":"Overwritten and overacted -- what's not to like","rating":7,"date":"24 May 2005","review":"\"The Big Knife\" is really a stage play recorded on film. It's a Hollywood soap opera that features a lot of good actors eating the scenery. Rod Steiger and Everett Sloan are great as the monstrous studio honcho and weaselly agent, respectively. Jack Palance is a competent actor but was woefully miscast as the sensitive, tortured matinée idol -- nobody would ever confuse Palance with a matinée idol. Nevertheless, he does an adequate job.<br><br>The power of the studio system in the '50s is well depicted, if a bit overwrought. Steiger's performance is particularly delicious as his toweringly self-centered character cries, wheedles, and intimidates his underlings into doing what he wants.<br><br>The movie is showing its age but its excesses, especially its colorful language, are a lot of fun. Recommended, 7 out of 10.","user":"gws-2","rank":[41,47]},{"title":"The studio system","rating":7,"date":"5 June 2009","review":"\"The Big Knife\" caused a sensation when it came out. After all, no one in his right mind would dare to criticize the movie industry, after all, it was the studio and its ruthless executives that were exposed as the bad guys, even at the time where the old studio system was disappearing.<br><br>Clifford Odets wrote the original play, which under Robert Aldrich direction doesn't translate to the screen because it feels claustrophobic in many aspects. The movie treatment was by James Poe, did not make the material come alive because of the theatricality of the source.<br><br>Charles Castle, an actor working in Hollywood, is about to commit himself to a renewal of his contract to a major studio. That means another seven years of his life working in whatever pictures the higher ups have in store for him. It couldn't come at a worse time; his wife, Marion, who evidently hasn't a good relation with Charles, is fed up with the idea of staying in Bel Air. Marion pleads with him to give up the movie business so they could have a normal life bringing up their young son.<br><br>Castle has had his share of adventures in Hollywood, something that Marion is aware of. In addition to that, he has a dark secret, something that involved a terrible accident for which his publicist has taken the blame and has even serve time in jail. A couple of women are also in the picture, threatening Charles' marriage.<br><br>To make matters worse, Charles is visited by the head of the studio, Stanley Hoff, who has brought his assistant, the oily Smiley Coy, to help him convince Castle to sign the contract. Charles Castle is finally defeated at the game as Stanley plays his cards right since he has the upper hand. The result is a bitter loss for the actor, who sees no way out of the situation at hand.<br><br>Jack Palance, who, up to this film, had only minor parts, rose to the challenge of playing Charles Castle, who in a way, he had the background, having been a boxer, to play. His work, although a bit unsure, was a revelation to the movie going public at the time. Ida Lupino, an excellent actress, is probably the best thing in the picture. Rod Steiger shows up as the studio head Stanley Hoff, a man that knows well his opponent's weaknesses and uses all in his power to get his way. Wendell Corey, in a small part, also does good work. Jean Hagen and Shelley Winters also contribute to the film.<br><br>Ernest Lazlo's cinematography works well, as does the musical score by Frank DeVol. Robert Aldrich, a man with a lot of experience in the business, was a natural choice to undertake the direction of this picture. His only problem was a basic one, how to open the play to cinematic terms.","user":"jotix100","rank":[15,16]},{"title":"Adaption of Odets play a classic.","rating":10,"date":"4 February 2005","review":"This 1955 film was adapted from a play by Clifford Odets and James Poe. It is a dark study of the seedier side of Hollywood of it's time. Making all involved not such pleasant people. It centers around a top movie star, Charlie Castle (played brilliantly by Jack Palance) who wants out of the movie limelight in order to move on to better high grade films. But, the movie studios are not that eager to lose their sexy star. Most of the film is about Charlie and his struggle to come out ahead. With the studio boss (one of Rod Steiger's better roles), his wife (the wonderful Ida Lupino in another terrific performance); the sleezy studio promo man (Wendell Corey in a delicious underplayed role); and the agent (one of Everett Sloane's best performances). Also rounding out this stellar cast are Jean Hagen, as the wife of Charlie's best friend, and a gal out to get Charlie in bed, and Shelly Winters, who does well as a sort of dumb blonde being used by the studio to entertain executives. Thinking this is the way to become a movie star.<br><br>Robert Aldrich directed this classic with a deft touch and excellent interplay with his cast. A simple set allows the actors to do their work without the Hollywood tinsel. Made in black and white, this is drama at its best and the stars at their best. See this amazing film if you're an actor. It will teach you much.","user":"guilfisher-1","rank":[35,41]}]