[{"title":"Good Scary Fun!!!","rating":8,"date":"8 April 2004","review":"I am not going to go into all the controversy surrounding this movie...everybody knows about the various deaths of cast members, as well as questions over who actually directed \"Poltergeist\". What I will decribe in this review are my feelings concerning the movie.<br><br>  \"Poltergeist\" is a good scary picture which will not only entertain you, but will make you wonder what originally occupied the land where your home is currently standing. This movie makes good use of foreshadowing and building of tensions to move a viewer to believe what they are actually seeing is really happening. While giving the \"funeral\" for the pet bird, Robbie asks if they can later dig it up so they can \"see the bones\". At the end of the film he is indeed treated to seeing \"dug up bones\", only they were not ones he had in mind. <br><br>  Great movie, great acting, great scary fun!   A+","user":"cairn6","rank":[47,59]},{"title":"Better than a 7.1","rating":10,"date":"25 October 1999","review":"Horror films often do not get their do, and the 7.1 rating for Poltergeist shows that this trend will most likely continue. Clearly an influential film by Chainsaw director Tobe Hooper, Poltergeist reached for, and achieved, everything that the earlier Amityville Horror failed to be; namely, scary, credible, and well acted.<br><br>Poltergeist, in a nutshell, is a story of suburban California family that discovers the darker side of the American Dream when their youngest daughter, Carol Ann, makes contact with evil spirits through the family television set. \"They're here\", never fails to send chills down my spine as I recall seeing this film for the first time as a teenager.<br><br>Perhaps 10 to 15 more years will finally lend the credibility to this film to finally place it among the classics in modern horror cinema.","user":"tornado-10","rank":[138,186]},{"title":"One of the best horror/thrillers of the decade","rating":8,"date":"3 March 2004","review":"In 1982, Steven Spielberg pulled off an incredible feat.  In June of that year, Spielberg released two films only weeks apart that were both highly successful yet diversely different in both subject matter and their target audiences.  One went on to become the highest grossing film of all-time (E.T.), the other spawned a franchise (Poltergeist).  <br><br>Poltergeist had a screen credit of being directed by Tobe Hooper (The Texas Chainsaw Massacre), but history has revealed that it was Spielberg's vision, editing and overall command of the shooting that was really behind the making of this extraordinary film.   Poltergeist brought back the traditional haunted house genre that lay dormant and restless since The Amityville Horror in 1979.  The story surrounds a family's house that has been punctured by the spirit world that seem keen on the youngest daughter of the clan  Carol Ann Freeling, played by newcomer Heather O'Rourke.  At first, the family meets the strange happenings in the home with playful pleasure, but in an instant the poltergeists intentions turn against the Freelings, and their daughter is captured and taken back to the supernatural world where communication is possible only through the bedroom television.<br><br>The Freelings waste little time and soon contact a paranormal group, well over their heads, to help them rescue their daughter from the unseen captures.  It becomes clearly evident however, that the group is over matched, and they call in a poltergeist expert, Tangina Barrons (played with relative enthusiasm and wit by Zelda Rubinstein) to assist with the phenomena.   Tangina then leads the Freelings through the unknown, both calming their fears and eventually finding a portal that may be the key to retrieving their daughter.<br><br>Poltergeist works as both a horror and a thriller.  The cast, lead by O'Rourke, Jo-Beth Williams, Craig T. Nelson and Oliver Robins have real chemistry and are believable as a family unit, and unlike most horror films, they make sound judgments and know their limitations.  When Carol Ann's bedroom becomes overtaken by the ghostly spirits, they lock the room and keep away rather than trying to fight something they cannot contain.  And when things begin to look bleak, they call for help and look for experts in the field.  This is an intelligent horror that doesn't have people running up the stairs when they should be running out the door.<br><br>Put together with a modest budget of less than $12 million, Poltergeist stretched it's dollars to provide us with an incredible array of special effects that still hold up well after 20 years of viewing.  Sure, the scene where a scientist literally pulls his face off or when the bedroom is opened and we see items flying at random as if in a ghostly tornado, might be better served with CGI if made today, the effects still keep the story progressing with a sense of credibility.  <br><br>Probably what keeps things so rooted in acceptability is how simplistic some of the special effects were in the larger scenes.  A closet full of strobe lights are all that is required to convince us that it is a portal to another world and a fan gently blowing the hair of mother Williams' is believable as the spirit of her child flying past her.    Simple plausible.<br><br>Whatever the reasons, Poltergeist works.  One of the few screenplays written by Spielberg from one of his own stories, Poltergeist has all the elements that we now associate with the master director.  There is a strong family unit, a child as the central character, above average production values and most notably, not one fatality in the entire film despite all the jilts and jolts.  The closing scenes of chaos including a pool of skeletons (later revealed to be authentic), is pure movie magic with frantic pacing and edge of your seat suspense.  <br><br>Since it's release, a lot has been made of the back stories and the curse surrounding the production of the franchise.  Heather O'Rourke tragically died at a young age due to an internal infection and Dominique Dunne (who played a smaller role as her sister) was murdered the same year as the films release.  The subsequent sequels have also included characters that died shortly after their films completion. Truth or fiction, lore or legend, these stories add to the mystique and mystery surrounding the film.  Having knowledge of the curse' makes it even scarier and gives it kind of a feeling like Naomi Watts' character must have experienced in The Ring, as if just by watching, you are contributing to the ongoing haunting.<br><br>Like most movies successful in the late 70's early 80's, there were sequels that were made with considerably higher budgets but less than stellar results (Superman III anyone?).  Neither of the Poltergeist sequels or subsequent television programming could come close to capturing the essence of the original.  Besides, how can you top what is now one of the most famous movie tag-lines of all time `They'rrreeee Here'?<br><br>Strong recommendation.","user":"gregsrants","rank":[66,87]}]