[{"title":"A crime kingpin re-enters the underworld upon his release from prison!","rating":9,"date":"4 October 2011","review":"This film for many will be too much and by that I mean in every way possible; the amount of grim and grime in Abel Ferrara's portrayal of New York City at the turn of the '90's, the perpetual display of crime and gang activity, the almost impenetrable bad language, the shocking violence and the in-your-face portrayal of hard life and sudden death from the perspectives of both criminals and cops. Saying that, this is one of the first and few greats from writer and director Abel Ferrara, notorious creator of schlock-horror trash 'Driller Killer' and I love it for all the reasons that people tend to hate it.<br><br>The inimitable and irreplaceable Christopher Walken plays Frank White, whose Lieutenants - led by intimidating and possibly demented Jimmy Jump played by Laurence Fishburne - have been guarding his territory, awaiting his return from prison. But when he gets out and goes back home to see that the streets have become every man's nightmare and every crackhead's dream, he decides that through rebuilding his empire, he will clean up the streets and give back to the community what the gangs have taken.<br><br>What results of this new resolution is the start of an unprecedented bloodbath in White's attempt to rid the streets of these crack dealing gangs and this catches the attention of Roy Bishop - White's nemesis, a jaded New York cop - who proceeds to chase the kingpin with the help of his toughest men Gilley and Flanigan, played with integrity and even a clever hint of villainy by David Caruso and Wesley Snipes.<br><br>Ferrara's distinctive independent style of filmmaking truly comes to fruition in this one, as it did with 'Bad Lieutenant', giving the audience a glimpse of everyday life on the grimmest streets of New York, while allowing his characters to run wild. There seems to be no clear line in the sand designating who is supposed to be the villain here as both Frank White and Roy Bishop seem to be corrupted characters with little redeeming features, the same not exactly applying to their supporting characters.<br><br>White is a man with no qualms in spilling blood for what he sees as the greater good because he targets only the lowest of the low throughout the film until the cops' war with him becomes personal. Bishop's war with him is nothing but personal however and the only thing that suggests he isn't the true villain of the film is the fact that he's a cop. Fishburne's character, Jimmy Jump, is a devil with no need for disguise, a loyal animal that never questions the man he works for because the only kick he needs is to kill who he sees as the bad guys, even though he is possibly the most intimidating face in 'King...' And Gilley and Flanigan, as straight and clean-cut as they seem throughout the film, are in fact corrupted. Corrupted by hate, by the need for revenge and through the grudges that they bear.<br><br>If anything, Ferrara's crime thriller is a film study applying an old philosophy to modern social politics. That philosophy being, \"he who fights monsters should see to it that he too does not become a monster in doing so...\" The film relies on the talents of its actors as physical and emotional forces of nature, as their performances run along on little comprehensible dialogue in relation to the plot but this is strengthened by a simplistic plot with easily picked out references to classic crime thrillers and although we see where the film is headed from the start, personally found myself excited and in awe of how it got there and honestly didn't see the end coming. It goes far beyond where others dare to go and still keeps it real.<br><br>In the end I find myself thinking, this is the kind of film 'The Untouchables' and 'Carlito's Way' didn't have the balls to be!","user":"DanLives1980","rank":[24,26]},{"title":"A Monster","rating":10,"date":"26 July 2010","review":"Abel Ferrara created a monster here and Christopher Walken grabbed it by the neck and made it one of the best gangster movies ever made. A truly faultless performance by Walken. The scene where his crew first see him after his release from prison is superb, he may try to act as one of the boys but his unnerving manner is there for all to see.<br><br>Considering this film was released in 1989, the cinematography is highly impressive. The shots of Walken as he looks cold-eyed into the night are tremendous, as are many of the New York shots. This movie has a very dark feel and edge to it and I thought the score complemented this superbly.<br><br>Larry Fishburne also does an excellent job as a drug-fuelled punk and the drug deal scene is one of the films many highlights. What impressed me most about this film is that not one scene is wasted. It is short, sharp, action packed and to the point and it is one of those rare gems that actually has a fantastic ending.<br><br>Well done Ferrara, this movie is one of the greats.","user":"codchops","rank":[42,48]},{"title":"Finally. A \"Cult classic\" worth your time.","rating":9,"date":"27 November 2010","review":"The King of New York should be boring, it moves slowly and deliberately for much of the film, the look of the film is quite washed out with drab backgrounds and much of the background music is quiet and orchestral.<br><br>But the movie also has some great action sequences, and some of the more visceral and impacting acts of violence committed to film. This is quite unlike 90% of action films made in the last 2 decades, and it's better than almost all of them.<br><br>Frank White is released from prison, by Christopher Walken, who is white - even for a white guy.<br><br>In fact in this movie I am convinced that Walken glows in certain scenes he is so pasty, they actually could have used him for lighting.<br><br>So back to Frank White, now a free man Frank decides to \"get straight back into it\" in every respect. In the initial scenes the various \"Its\" include his limo, the crime business - and various women including his lawyer.<br><br>Frank obviously has a way with people, he is disarmingly honest (where possible) and direct, and he is very loyal to his gang. And they reciprocate. Frank also moves in different circles, as well as the lower socioeconomic area that he resides in, and does business with, he also spends time with the cities' elite, pressing the flesh and trying to broker deals of a different nature.<br><br>There is the initial montage that goes along with reestablishing turf, various rival dealers and kingpins are dealt with, the violence in these scenes is quite immediate and realistic, no amazing stunt leaps or protracted death rolls here, you are shot and you fall down, there are no dramatic final carefully scripted words. (These scenes reminded me a lot of Beat Takeshi and his films, especially Brother, which coincidentally enough had a non-black guy running a crime gang staffed mostly by black guys.) <br><br>Frank also turns an attempted mugging into an impromptu recruitment drive. This sounds odd, but is even odder when you factor in that he was interrupted mid titty-squeeze on the subway!<br><br>The difference between Frank and say Nino Brown or Tony Montana, is that Frank actually seems determined to help the very same group of people that is selling to, one of his pet projects is personally funding a hospital in a poorer area using 16M of his own money.<br><br>When he tries to co-opt a rival gang leader into assisting he is met with scorn and derision. Here we learn another thing about Frank, if you knock back a deal, he'll get what he wants anyway, just through other more violent means.<br><br>As Frank and his crew expand and become more successful, he attracts the attention of two groups, rival gangs wary of losing turf and customers, and the cops. We already know how Frank and co deal with rival gangs, let's talk about the cops.<br><br>The cops are both a strength and a weakness in this film. In the early sections we meet them all, Roy (Victor Argo) is the time-weathered Boss, determined to nab Frank but rendered almost powerless by the system. Tommy (Wesley Snipes) and Dennis (David Caruso) are the younger hotheads that are willing to do \"anything\" to keep the streets clean, there is also a fourth newly-wed cop who anyone (who has seen an action movie at least) knows is only there to be killed.<br><br>The cops have a minor victory when they manage to find a real living witness to a crime committed by Frank's henchman, most notably Jimmy Jump (Larry Fishburne, more on him later). In a show of loyalty Frank plumps up the sizable bail to free his men, and this is where things change.<br><br>The cops, realizing that the normal \"legit\" channels just don't work, decide to go to a slightly more shady Plan B, from here on in everything moves along towards the inevitable conclusion. Only in a film like this we can never be sure who will actually triumph, after all the criminal is loyal, honest and wants to maintain a valuable hospital servicing the inner city with his own money, and the cops are willing to use illegal means to get what they want.<br><br>There is an exceptional car chase, a shoot out and some well written and impeccably timed one-liners in the concluding sequences, though this isn't your standard action/crime film. Key characters on both \"sides\" are killed, often abruptly and violently, and loyalties are tested.<br><br>The film ends in a slow languid scene that is in obvious contrast to the hectic action that preceded it, and the scene is quite fitting for a crime film in which there are no real winners.<br><br>The King of New York is deservedly seen as a cult classic, and while many so called cult classic are of the \"sh*t films that people saw when they were high so they talk them up\" variety this one is truly worth your time.<br><br>Now, as alluded to earlier, even though he was given scant mention in the above write up Larry Fishburne as Jimmy Jump must go down as one of the coolest MFs to ever appear in a film. Larry plays him as animated, chirpy yet also skittish. He is a cold-blooded assassin that also runs around like a 7 year old full of green cordial, and in one of the shootouts near the close of the film he moves effortlessly through the scenery, even while pumping rounds into other bad guys (and unfortunately some cops).<br><br>Final Rating – 8.5 / 10. Deserves to be more well known, but for now check out The King of New York. At least you'll get to know how good it is. (Thank me later.) <br><br>If you liked this review (or even if you didn't) check out oneguyrambling.com","user":"oneguyrambling","rank":[19,22]}]