[{"title":"Utterly Irreparable Heartbreak","rating":8,"date":"13 July 2011","review":"Marine biology scientist Dr. Jake Terrell, his wife Maggie and a crew of ecologists for the last few years have been financed by an organization to study confined dolphins on a distant Florida island. They've conditioned a male and a female dolphin to say \"fa,\" \"ma,\" \"pa\" and other basic vocabulary, and to comprehend English sufficiently enough to have simple dialogue. But Alpha can't be trained to think in English. He can merely mimic, until Jake teaches him a lesson about loss. He introduces a female dolphin, Beta, watches Alpha fall for her, then splits them up until Alpha can demand her, in English. The wholesale sequence showing Alpha swimming frantically around, thrashing his tail on the enclosure that divides them, is heartrending.<br><br>Jake is like the classic father of the baby-boom bracket, unwavering in teaching valuable lessons even when he feels his child's anguish, in this case a dolphin who loves him like a father. When Alpha at last begs for Beta by name, it's an intensely gratifying moment, exemplifying the identity-related idea of language as a conciliation intuited out of loss. And, much to our grief, Alpha is now disposed to all kinds of anthropomorphic cognizant suffering.<br><br>And naturally, trouble lies ahead in the form of a thriller plot true to the pinnacle era of conspiracies and rogue government. Initially, a young Paul Sorvino's slippery pollster blackmails his way onto Dr. Terrell's island, and before long, a sinister regime faction is revealed to intend to use the newfound capacity for communication in these dolphins to their advantage by abducting them for function in a presidential assassination, of all things.<br><br>In training Alpha and Beta to verbalize, Jake destines them for humanity, initiating them into ceaseless yearning and unlocking the floodgates to advantage being taken of them. In due course, with the purpose of thwarting Alpha and Beta more exploitation, Jake must make a decision that is inconceivable to the living, beating heart. Pure as they are, dolphins comprehend mere absolutes. How can you make a dolphin understand not only that humans can be both good and bad, tell lies and kill their own, but that rejection, abandonment can still mean undying love, ultimate sacrifice? \"Men are bad,\" he tells them, hardly suppressing his utterly irreparable heartbreak, and ours. \"All men bad.\"","user":"jzappa","rank":[11,11]},{"title":"\" If word get's out before I can explain my work, it will turn into a freak show \"","rating":8,"date":"23 April 2009","review":"Throughout the motion picture business there is many a thespian who truly believes in their role. Some more than others and is why a few become exceptional. The original script called \" The Day of The Dolphin \" was delivered to several actors, prior to the film's inception. When the principal actor read the interesting dialog between himself and his subject called Alpha, he was not only intrigued, but anxious to begin. The story centers around a Research Scientist named Dr. Jake Terrell (George C. Scott) and his wife Maggie. (Trish Van Devere) Their secret island project concerns a special Dolphin, whom they have raised since birth. In an amazing feat of Phonetic science, laboring on the cutting edge and years of patience instruction, they have taught their unique Dolphin to speak English. However, their financial benefactors are not men with lofty ideals like Dr. Terrell or his staff. Indeed their primary goal is to use the amazing oceanic mammal to swim underwater undetected to a secured location where the President of the U.S. is vacationing and eliminate the Chief Executive. Although it's Harold DeMilo (Fritz Weaver) the C.E.O. of the funding institute who plans on subverting Dr. Terrell's innovative project, it's a strange, mysterious and uninvited visitor, Curtis Mahoney (Paul Sorvino) whom they suspect is behind the theft of their special Dolphin and a midnight murder. Trust is not inherent between the characters, indeed the audience is in for a surprise or two. However it's this very element which gives the film it's dramatic texture. The cast is incredible and delivers a dynamite performance which as a result allows this film to become a Classic. Excellent movie. ****","user":"thinker1691","rank":[11,12]},{"title":"Fa Love Pa","rating":6,"date":"24 July 2014","review":"George C. Scott has taught a pair of dolphins to understand and speak English. But he didn't realize the foundation funding him is actually a covert government agency. Now the agency has taken the two dolphins and plans to use them as assassins. Okay, this all sounds just ridiculous I know but it's actually pretty good. It's directed by Mike Nichols, which is somewhat surprising, as he is not well-known for sci-fi or thrillers. It's written by Buck Henry, who is more known for comedies. Despite stepping out of their respective comfort zones, I think both do a fine job. The cast is good. The story is very interesting. The dolphin scenes are wonderful. Perhaps it's a little giggle-worthy at times but ultimately it's a smart, entertaining film that's pretty unique.","user":"utgard14","rank":[7,7]}]