[{"title":"Offbeat & vicious","rating":8,"date":"8 January 2009","review":"A vamp by the name of Caleb Croft rises from his crypt in a cemetery and happens upon a couple making out in their car. After killing the man and having a few sips of his blood, Croft rapes the woman in an empty grave. Eventually, the woman gives birth to a half human, half vampire baby. In order to feed him, she uses a syringe to extract her own blood, eventually leading to her demise. Her now grown son seeks vengeance against his father and is determined to track him down. Did I mention that Croft is now teaching night classes on the occult?<br><br>This offbeat vampire film has many interesting twists in it's storyline. One of Croft's students longs to be a vampire, for instance. As the vile vamp himself, Michael Pataki comes across as cold-blooded and cruel. While the film isn't very bloody, the acts of violence he commits seem more vicious than the norm. William Smith plays the son, and he reminded me more of a bump on a log than anything. I suppose that's just the part, that of a secluded outsider with no world experience. There's a fight towards the end that is surprisingly well-done. The film isn't as good as director John Hayes earlier effort, \"Dream No Evil\", but it's a unique addition to the vampire sub-genre all the same.","user":"Cujo108","rank":[24,26]},{"title":"Very creepy 70's vampire flick","rating":7,"date":"30 April 2006","review":"I wasn't really expecting Grave Of The Vampire to be very good. I bought it because I found it in a bargain section for only a couple of bucks. I must say, that it was well worth what I paid for it. Grave Of The Vampire has one of the most atmospheric graveyard scenes that comes to mind. Weird lighting, fog, and sinister music really make the opening scene in an old cemetery quite effective. Michael Pataki makes a great vampire. Actually, he looks like a zombie vampire during the opening scene, which I really liked. The film is very dated, so don't go into it expecting it to be comparable to something like Blade for example. However, for a good, spooky night movie it certainly hit the mark.","user":"yashicad","rank":[28,32]},{"title":"Somber and dead serious--but good","rating":7,"date":"12 February 2006","review":"A couple are making out in a graveyard. For some reason a vampire awakens. He kills the man and rapes the woman (in an open grave no less). She gets pregnant, has the baby--but the baby will only drink blood! She provides her own and eventually dies. The boy grows up and vows to find his father and kill him for what he did to his mother. They do meet and things go out of control.<br><br>OK--you have to ignore logic with this one. At one point a policeman knows it's a vampire who raped the woman and who he is--but how? And a vampire is teaching night school (!!!). And WHY would a vampire rape a woman to begin with? Technically--he's already dead! Push those aside and you can actually enjoy this.<br><br>The film has a very downbeat, somber tone--as it should. No jokes or winking at the camera. Michael Pataki is very good (and scary) as the vampire father. William Smith has a few good moments as his son. The rest of the acting is just terrible. Still this movie works. It's well-directed, has an eerie music score by Jaime Mendoza-Nava and some really creepy sequences (the one near the beginning where a woman discovers a vampire in her basement made me jump). A pretty unknown little horror film that's worth seeking out. I give it a 7.","user":"preppy-3","rank":[26,30]}]