[{"title":"One of Monroe's most natural and appealing performances...","rating":13,"date":"13 August 2001","review":"Cinemascope was at the height of popularity when Fox decided to cast Marilyn Monroe and Robert Mitchum in a story set against the scenic splendor of the Rockies. Marilyn even gets to sing a few fetching song numbers (her saloon song atop a bar is a standout and she delivers a totally professional job). Sleepy-eyed Mitchum makes a good partner for Monroe and little Tommy Rettig scores as the adoring little boy who watches wistfully as Monroe strums a song on her guitar.<br><br>Into the story, slight as it is, is an Indian attack while Mitchum and Monroe battle the rapids. It's all very routine going, for the most part, but the chance to see Monroe strut her stuff in a tight pair of jeans and Mitchum give a sturdy, likeable performance is enough to make the movie a pleasant way to spend a couple of hours. <br><br>Nothing great here, but a very satisfying performance by Marilyn who does a more than competent job on her less than inspired songs. And the scenery helps. <br><br>Otto Preminger's direction is not as taut as it should have been for a tale of this sort--in fact, the whole film has a lumbering pace that seems to make some parts of the story seem more like filler material than anything else. And poor Rory Calhoun has little to do.","user":"Doylenf","rank":[44,54]},{"title":"White Water Rafting With Marilyn and Mitch","rating":6,"date":"29 June 2007","review":"Of all of Marilyn Monroe's leading men, Robert Mitchum was the only one who knew her back when. In 1941 before he made his screen debut in a Hopalong Cassidy film, Mitchum was among other things an aircraft factory worker and one of his friends was one James Daugherty. Of course Jim had a wife Norma Jean at the time and Bob and Dorothy occasionally socialized.<br><br>He knew all about her psychological problems and when it came time to do a film with her when both became screen legends, Mitchum was not about to get himself involved. That probably helped because during the shooting Marilyn and director Otto Preminger stopped speaking and would only communicate through Mitchum. <br><br>Marilyn's a saloon gal involved with a no good gambler/drifter in Rory Calhoun. Calhoun and Monroe nearly drown on a river when Mitchum rescues them and their raft. No good deed goes unpunished so Calhoun takes Mitchum's horse and Mitchum, Monroe, and Mitchum's son Tommy Rettig use the raft to go after him. They're kind of forced to because the Indians are on the warpath.<br><br>She's certainly quite a distraction for a man on a mission and at one point Mitchum does give into lust ever so briefly. Which does make River of No Return one of the more realistic westerns ever done.<br><br>Twentieth Century Fox decided to go whole hog on this one, shooting the film up in Banff. But with Marilyn and Otto feuding it was not a happy set. Otto walked off the picture and Jean Negulesco finished it out. Joe DiMaggio flew up to the set because of rumors of Mitchum and Marilyn, that were completely unfounded, but Joe was the jealous type. As for Mitchum legend has it that he and another legendary drinker, Murvyn Vye, killed many a bottle during the long evenings.<br><br>Done in cinemascope and 3-D, River of No Return should be seen on the big screen. Not even a letterbox DVD does it justice. And 3-D was definitely the medium for Monroe. Marilyn even has some nice songs to sing in this one.<br><br>It's not a great western, still it's entertaining enough especially in those rafting sequences. But it was a film Otto Preminger shuddered about when recalling.","user":"bkoganbing","rank":[52,69]},{"title":"Great movie, Classic Western, Classic, and best, Monroe","rating":8,"date":"15 January 2006","review":"I just love this movie, except for that one scene (everybody knows which one). It's a very good venue for Mitchum and perhaps the best Monroe ever had. Really great actors make you forget that they are either actors or stars. These two do that quite well in spite of a loosely written script and a bit too much sweetness in the person of the boy. I think I love this movie as much for the fact that someone finally let Monroe act as I do for the fun of watching it. She did a good job of bringing her character, rather than Marilyn, to the screen. I enjoyed the scenes between her and the boy. She was very believable as a nurturing, protective figure. She would have done well as an actress. This movie is just a small sample.. Lonestar","user":"socw20","rank":[38,51]}]