[{"title":"That's a person named Eunice?","rating":21,"date":"21 January 2001","review":"What's Up Doc is one of six movies I use to offset ANY bad mood. I have seen it countless times and still can't keep the suitcases straight.<br><br>\nThis film is full of visual humor and one liners; Madeline Kahn screaming and taking on all comers while dragging the doorkeeper across the ballroom floor; the hotel crook using his \"charm\" to drop Mrs. Van Hoskins in her tracks; Eunice hiding in the bathroom because snakes \"live in deathly fear of tile\"; the promise of Howard conducting an avalanche in A Flat.<br><br>My only regret about this movie is that it began endless failed efforts by television and movie makers to replicate the chase through San Francisco. No one has. That sequence is the best example of humor, timing, backdrop, and action, of the chase genre. It has never been equalled by either serious or comedic directors.<br><br>Little mentioned in these reviews are Kenneth Mars and Austin Pendelton, two fantastic character actors who are the emeralds surrounding the diamonds of Streisand and O'Neal in the glorious setting of this jewel.<br><br>Thank goodness no one in What's Up Doc knows the meaning of the word \"propriety!\".","user":"annmason1","rank":[74,79]},{"title":"Superb 70s Screwball Comedy","rating":10,"date":"14 August 2004","review":"Great 70s comedy stars Barbra Streisand and Ryan O'Neal in a remake of the classic BRINGING UP BABY with bits of TO HAVE AND HAVE NOT and CASABLANCA thrown in. Fun all the way in this updated story that has O'Neal playing a doofus professor up for a grant and Streisand as the madcap college dropout who plagues him. Madeline Kahn is hilarious as Eunice Burns.<br><br>A great team---and backed by Kenneth Mars, Austin Pendleton, Michael Murphy, Sorrell Booke, Mabel Albertson, Graham Jarvis, John Hillerman, Randy Quaid, and especially Liam Dunn as the judge, in one of the best comedy performances ever. Great chase scenes thru San Francisco. The court room scene is hilarious.<br><br>Others in the cast include Garahm Jarvis, M. Emmet Walsh, Eleanor Zee, Philip Roth, Stefan Gierasch, Stan Ross, and Kevin O'Neal.<br><br>Streisand sings \"You're the Top\" over the opening credits and \"As Time Goes By\" from atop a piano. Funny film has perfect timing all the way, thanks to direction from Peter Bogdanovich. A must see.","user":"drednm","rank":[59,64]},{"title":"I Always Wanted To Marry Eunice Burns","rating":10,"date":"3 December 2004","review":"Well I simply can't resist to join what at a glance seems to be a very affectionate army of fans of this film - which is not only in my top three favourites of all time, but most definitely the funniest hour and a half ever registered on celluloid. I first saw it in 1974 - I was nine - and instantly fell under the spell. Frisco never looked prettier, flairs were fluttering, volkswagen beetles were zooming around, the muzak coming out of lifts and hotel lobbies is just as I remember it, the hair was only beginning to get big, but the aspirins were already huge...in the midst of all this, Streisand delivers like a sniper and actually looks sexy and desirable, O'Neal does his bespectacled Iowa music professor with all the dizziness of sex on legs that he was, and the cast generally glide through two separate crescendos of stupid situations, fuelled by dialogue in break neck speed, each more hilarious than the previous, all inexorably slipping into general uproar and mayhem at every turn. <br><br>But it's due to Madeline Kahn's ability to send one into hysterics with as much as opening her mouth that the film is a screwball comedy masterpiece, far superior than \"Bringing Up Baby\" to which it's nauseatingly compared to. The relish with which she bites into the character of Eunice Burns, in a role made for her down to the last breath in the script - is spectacular, as is its result on screen. In my mind it only compares to Jean Hagen's Lina Lamont effort in \"Singin' In The Rain\" - the only other single funniest female episode on screen. <br><br>Other than that, one liners, with which this stuff is packed to the rafters are still in circulation today - kept alive by enthusiast fans of seemingly all generations. This is a true comedy classic that hasn't lost any of it's breeziness, funk, sexiness and freshness with years. Dumb, twisted and invigorating all at once it's a true gem. Watch it and feel your I.Q. drop, and get hooked by all means. Or miss at your own peril.<br><br>In fact, I think I might just watch it again - now.<br><br>10/10, full on. :-)","user":"Oggz","rank":[52,60]}]