[{"title":"Good stuff all around","rating":8,"date":"31 January 2004","review":"A bit of a departure for Alfred Hitchcock, somewhat lighter and with less of the trademark suspense. Thoroughly enjoyable, though. Cary Grant was playing Cary Grant by this time, and no one could do it better. And Grace Kelly, what eye-candy! The snappy dialog with the sexual innuendo was done perfectly. And huge kudos to Brigitte Auber, who was gorgeous and very good. An interesting aside was that Grant's character, while pretending to be someone else, claimed to have been an American circus acrobat, which Grant sort of was early in life (albeit English, not American.) Grant (with his accent) could really never be mistaken for an American, even though he usually played one. Also it was a little eerie to see Grace Kelly driving so fast on those French Riviera cliffside roads, in light of what happened to her later. (Of course, she obviously wasn't doing so, they were using back-projection) Anyway, this film is a must for fans of Hitchcock, Kelly or Grant. Grade: A","user":"smatysia","rank":[79,99]},{"title":"Hitchcock's Charming Romantic Bubble","rating":8,"date":"21 May 2005","review":"There is much to like about Hitchcock's TO CATCH A THIEF: Cary Grant and Grace Kelly at the height of their appeal, a witty script that offers Jessie Royce Landis one of the funniest roles ever seen in any Hitchcock film, and excellent cinematography designed to show off the beauties of Monte Carlo--all packaged in a lightweight tale that is two parts romance, two parts travelogue, one part comedy, and just enough classic Hitchcock suspense to keep this lighter-than-air confection from flying apart.<br><br>The well known story concerns a string of jewel robberies along the Riviera which lead local officials to suspect that a famous and long retired cat burglar (Grant) is once more on the prowl--but rather than hope the authorities will find the real culprit Grant elects to protect himself by unmasking the thief for himself. In the process he encounters an icy beauty (Kelly) who takes considerable pleasure in tantalizing him with her charms, her jewels, and her knowledge of his criminal past, and her mother (Landis), who is perhaps the best of the \"clever matrons\" to appear in any Hitchcock film. As the police close in, the three of them devise a plot to expose the thief and clear Grant, with whom Kelly has now fallen in love.<br><br>Unlike most Hitchcock's most famous films, TO CATCH A THIEF offers nothing dark to trouble our thoughts, and it is perhaps best regarded as a romantic fantasia, the director's vacation from his more typical material. While it will never compete with the more famous VERTIGO and REAR WINDOW of the same period, it is extremely well done and quite a bit of fun to watch. Viewers seeking a pleasant film with a romantic touch will enjoy it a great deal.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[45,55]},{"title":"Not 'great' Hitchcock,' but a 'Hitchcock' after all!","rating":8,"date":"21 September 1999","review":"We are taken by Alfred Hitchcock to the French Riviera where a series of robberies are occurring, and women screaming that their precious jewels are stolen... A black cat - in each robbery - is roaming stealthily in fear and shame along the roof of the elegant Carlton..<br><br>From there, Hitchcock introduces us to John Robie (Cary Grant), a retired jewel burglar known as the 'Cat' who is living in peaceful isolation in Cannes...<br><br>Robie is seen upset, bothered,, and worried because the 'Cat' prowls again... But, who is the 'Cat'? Surely someone is imitating his old style, using his ability and skill, almost his cleverness and talent...<br><br>Naturally, the police in Cannes is blaming him... They had his hallmark stamped and classified... They would like to catch him in the act and finish with him in jail...<br><br>Robie is worried how to catch the real thief being himself subject to harass! The characteristic plot of Hitchcock: To chase and to be chased at the same time...<br><br>John Williams (H.H. Hughson) whose Insurance Company has been victim of great robberies, gives Robie what he wants: A list of their wealthy clients whom might be future candidates on the list of the skillful thief...<br><br>Here we discover a future victim, the rich Mrs. Stevens (Jessica Royce Landis) and her cool, beautiful and sensual daughter Frances (Grace Kelly).<br><br>Four scenes, depicted by the master of suspense, catch our attention:<br><br><ul><li>The classic fireworks shot when Frances and Robies expressed their passion joining their lips in a torrid kiss, igniting the fuse of a chain of explosions in sensation colors and in VistaVision...</li></ul><br><br><ul><li>The annoyance of Hitchcock towards eggs: Mrs. Stevens, in her hotel's room, extinguishing her cigarette in the yolk of the fried egg...</li></ul><br><br><ul><li>The Gala night: An extravagant festival of precious stones (diamond, emerald, ruby and gold) displayed in all its beauty and rarity on the neck of women dressed in multicolored and multifarious costumes... Also a close-up for clear identification of the police and gendarme who are ready to capture, to hit, to surprise the famous thief...</li></ul><br><br><ul><li>The climactic classic roof-top chase sequence between Roby and the thief seen before in \"Saboteur,\" and much later in \"Vertigo,\" and \"North By Northwest.\" </li></ul><br><br>With meticulous coiffure and fancy clothes, Grace Kelly plays her role with elegance and fashion... She is gracefully refined and polite showing good taste and style... In the French Riviera she meets her future husband Prince Rainier of Monaco... After finishing the filming of \"The Swan,\" and \"High Society,\" she becomes Princess Grace...<br><br>The film captures the aerial shooting of the automobile chases on the Riviera Corniche, the Cote D'Azur, the flower market, the grandeur of the rugged coastal scenery, the sea with much sunshine sparkling flashes of wit and gaiety... It is a pleasant entertainment, a 'Hitchcock Champagne' indeed!<br><br>Grace Kellycontributing with our ideal romantic hero in catching his thief, was in fact scheming to catch him...","user":"Nazi_Fighter_David","rank":[37,45]}]