[{"title":"Bogart, the hero who was exactly right for his time","rating":9,"date":"22 April 2005","review":"The Forties were the years when Hollywood decided that the mystery thriller deserved big-budget, big-star treatment, threw up a new kind of hero who was exactly right for his time: they were the fabulous years which established the private eye adventure as the irremovable all-time favorite in the whole field of suspense The field was so rich, the choice so lavish in that decade, that it was difficult to know where memory should stop and call \"Encore\".<br><br>As the author of the screenplay, Huston made every effort to do justice, and remain faithful, to Dashiell Hammett's novel But in remaining faithful, the newest version asked audiences to accept the complicated plot at its full strength and that is where the film's main flaw occurs Names, murders, and intrigues turn up so quickly that it is extremely difficult to understand exactly what is happening in this tale of an assortment of characters in search of a fabulous jewel-encrusted statue <br><br>Probably in no other film will a viewer find a gallery of such diverse human beings whose perfect1y constructed portrayals remain permanently locked in one's memory <br><br>Mary Astor's Brigid O'Shaughnessy is a striking picture of feminine deceit and betrayal Able to shed tears on command, she is a confirmed liar who can be as deadly as she is beautiful; she can make passionate love to Bogart, but wouldn't hesitate a moment to kill him if it suited her plan Her performance is surely one of the screen's most brilliant portrayals of duplicity masked with fascination <br><br>Sydney Greenstreet, in his movie debut, was equally memorable as the menacingly mountainous man behind the search for the elusive black bird, and almost stole the picture Cunning, determined, appreciative of the fine arts, Greenstreetwho seemed to get more dangerous as he got more imperturbably politeis a man who would devote his entire life to a single quest if need be <br><br>Peter Lorre's Joel Cairo was a resolute picture of classic villainy With curled hair and impeccably clean dress, he is an unpredictable accomplice of Greenstreet, difficult to deal with <br><br>But it is Bogart's portrayal of Sam Spade that remains classic in its construction Obviously cynical, he still maintains his own code of ethics which he adheres to faithfully He is doubtful, but not foolhardy He is courageous, but not without fear Spade uses everyone he comes in contact with He wins not because he's smarter than his enemies, but because he is the only character in a central position Spade is every bit as ruthless as the crooks who try to use him His tactics in dealing with them, however, are necessary for his survival...<br><br>His treatment of the two women in the film seems equally as harsh, but neither is a wide eyed innocent and both attempt to deceive him in one manner or another His exchanges with Brigid O'Shaughnessy are electric... Their mutual attraction is undeniable... But Spade will play the fool for no woman He is a loner, but he has contacts, and knows where to go for what he wants Even with very little money, he is totally incorruptible He has no apparent friends He is laconic, but he can throw a wisecrack as fast as he can throw a punch...<br><br>\"The Maltese Falcon\" molded the image we remember of Bogart all through the early years of the Fortiesan image elaborated upon and reinforced in \"Casablanca,\" and the one which all Bogart fans remember with great affection and admiration","user":"Nazi_Fighter_David","rank":[80,91]},{"title":"The Fat Man Cometh","rating":4,"date":"4 November 2007","review":"Considered by many film historians as the very first noir film, \"The Maltese Falcon\" is cinematically important also for making Humphrey Bogart into a Hollywood star, and for being the debut of John Huston as film Director.<br><br>The film's story is complex and convoluted, typical of detective films of that era, and involves a valuable statuette. The plot stalls and meanders throughout most of the film, as we encounter an assortment of strange characters and side issues. But this is not a plot-driven film. It is character-driven.<br><br>And the main character, of course, is PI Sam Spade (Bogart). He's not a particularly nice guy. He comes across as overconfident and egotistic. He smirks a lot. But he's tough as nails. And he knows how to nail the bad guys. A big part of the film is Spade's relationship to femme fatale Brigid (Mary Astor). They engage each other in a battle of wits. And there's more than a hint of romantic involvement between the two. But Brigid is the one who propels Spade into the deceiving and double-crossing world of bad guys who yearn with greed for the priceless Maltese Falcon.<br><br>Enter Kasper Gutman, that thoroughly rotund and intimidating (in a gentlemanly sort of way) king of greed, portrayed with verve and panache by the inimitable Sydney Greenstreet. Gutman, AKA the \"Fat Man\", is nothing if not erudite and self-assured. In one scene, Sam Spade makes a bold offer. Gutman responds articulately: \"That's an attitude sir that calls for the most delicate judgment on both sides, because as you know sir, in the heat of action, men are likely to forget where their best interests lie ...\".<br><br>And Peter Lorre is a hoot as Gutman's mischievous elf, Joel Cairo, who tries, without success, to threaten Sam Spade, but only succeeds at getting on Sam's nerves.<br><br>The film's high contrast B&amp;W lighting renders an effective noir look and feel, one that would be copied in films for years to come. Acting varies from very good to overly melodramatic. The script is very talky. For the most part, the film is just a series of conversations that take place in interior sets.<br><br>Stylistic and cinematically innovative, \"The Maltese Falcon\" has endured as a film classic. I suspect the main reason for its continued popularity is the continued popularity of Bogart. But I personally prefer the performance of Sydney Greenstreet, the enticing fat man. Yet, together they would reappear in later films, one of which would follow, in 1942, as the classic of all classics.","user":"Lechuguilla","rank":[45,53]},{"title":"Noir at its best","rating":30,"date":"30 April 2003","review":"Humphrey Bogart died nearly fifty years ago, but polls still put him at the top of all-time Hollywood stars. What turns a man into a legend?  The man himself wasn't much: a slight build, not too tall, no Stallone muscles to swell his suit.  What he had in classic films like `The Maltese Falcon' was a voice that cut through a script like a knife. \t`The Maltese Falcon,' directed by John Huston in 1941, reprised Dashiell Hammett's thriller. (It had been filmed before.) Hammett practically invented the tough guy so deep in cynicism nobody could hope to put anything past him. The novel, thick with plot, wasn't easy for director John Huston to untangle. Few people who cherish this film can summarize its story in a sentence or two. I'll try. San Francisco private eye Sam Spade (Bogart) is pulled into the search for a fabulously valuable statue by a woman who seeks his help. First, his partner is killed, then Spade pushes through her lies to uncover connections to an effete foreigner (Peter Lorre) and a mysterious kingpin (Sydney Greenstreet). The story unfolds like a crumpled paper. But the whodunit becomes less important than how we respond to the strong screen presence of Bogart and his co-stars. \tThat's what makes `The Maltese Falcon' a classic. We see more and appreciate more each time we watch it. The art of Huston and Bogart doesn't come across until a second or third viewing. Huston invented what the French called film noir, in honor of Hollywood films (often `B' movies, cheap to make, second movies in double features) that took no-name stars into city streets to pit tough guys, often with a vulnerable streak, against dangerous dames. Audiences knew that when the tough guy said, `I'm wise to you, babe,' he'd be dead within a reel or two. \tBogart was luckier than most noir heroes, but it cost. Struggling to maintain his own independence  against the claims of love or his own penchant towards dishonesty  the Bogart hero can do little better than surrender, with a rueful shrug, to the irony his survival depends on. The climax of `The Maltese Falcon' ranks with the last scene of `Casablanca,' another Bogart vehicle, in showing how the tough guy has to put himself back together after his emotions almost get the better of him. That assertion of strength, bowed but not broken, defines the enduring quality of Bogart on screen. \tFor Huston, telling this story posed a different problem. Telling it straight wasn't possible  too many twists. Huston chose to focus on characters. One way to appreciate Huston's choices is to LISTEN to the movie. Hear the voices. Notice how in long sequences narrating back story, Huston relies on the exotic accents of his characters to keep us interested. Could we endure the scene in which Greenstreet explains the history of the Maltese falcon unless his clipped, somewhat prissy English accent held our attention? Also, we watch Bogart slip into drug-induced sleep while Greenstreet drones on. Has any director thought of a better way to keep us interested during a long narrative interlude? And is there a bit of wit in our watching Bogart nod off during a scene which, if told straight, would make US doze? \tAll of this leads to the ending, minutes of screen time in which more goes on, gesture by gesture, than a million words could summarize. He loves her, maybe, but he won't be a sucker. The cops come in, and the emotional color shifts to gray, the color of film noir heroes like Bogart. Bars on the elevator door as Brigid descends in police custody foreshadow her fate in the last image of Huston's film. But after the film, we're left with Spade, whom we like and loathe, a man whose sense of justice squares, just this once, with our own, maybe. Black and white morality prevails in a black and white movie, but Sam Spade remains gray  and so does our response to this film classic.","user":"relias","rank":[149,189]}]