[{"title":"My brief review of the film","rating":22,"date":"22 July 2005","review":"The screenplay is the most interesting element of this film: it presents an original tale with some bits of humour along the way. It is a bit too verbose and talkative now and again, which is very distracting from what is happening on screen, but it very amusing whenever it is amusing. The movie is filmed in a play-like fashion, separated into three acts, and narrated in part. This makes the film feel more like a play, and it does limit Bergman to how much skill he can show as a director. There are still nevertheless some well set up shots, in particular in relation to framing, lightness and darkness. The ending is a tad weak, but the bulk of the film is oddly engaging - atypical and yet still admirable Bergman.","user":"sol-","rank":[15,16]},{"title":"A Finnish youngster's look at the Devil's eye","rating":10,"date":"30 June 2004","review":"A clever comedy; Satan permits Don Juan a leave of absence from hell to cure a sty in the Devil's eye which is caused by the virginity of a young earthly woman. It's a very funny movie - without being intentionally \"stupid.\" It has a very theatrical feel, but tastefully so, and brings everything needed from Jarl Kulle as Don Juan. Nils Poppe (known best as \"Jof\" from \"The Seventh Seal\") and Bibi Andersson also contribute with an additional display of their usually skillful performances. The plot is light, but brilliant, and will probably shock regular Bergman fans. For some reason \"Smiles of a Summer Night\" is talked about as Bergman's \"best\" or even \"only\" comedy, but although I really like that film too, and have watched over forty of his movies, and must say that this is the funniest by a long shot. A highly enjoyable, but sadly underrated (possibly misunderstood) movie. At the time of my writing this, Djävulens Öga is not yet a DVD item in the US or the UK.","user":"Patrik_Lemberg","rank":[21,25]},{"title":"The mirrors which reflect God","rating":9,"date":"21 April 2016","review":"Full disclosure - I tend to like movies with the devil in them. I also love brooding characters, and weighty questions about life and love, and this film has all of the above.<br><br>The premise is that in keeping with an Irish proverb, the Devil has a stye on his eye because a woman is about to be married, but is still a virgin. In this case, she's the daughter of a vicar. He sends Don Juan and his sidekick back to earth along with a demon to oversee them, with the mission of deflowering her before the wedding. Things get complicated when Don Juan quickly develops real feelings for her, and his sidekick falls for and begins seducing her mother.<br><br>Don Juan is brooding, hating both God and the Devil equally for the morality game they play. On the one hand he boldly says \"the lack of principles is my principle, vice my virtue, debauchery my asceticism, godlessness my religion.\" On the other hand, he betrays real sadness when he says \"Those capable of love are very few. Their suffering has no limit. I am told they are mirrors which reflect God, and make life easier for us wretches in the dark.\" Such brilliant dialog is Bergman at his best.<br><br>The vicar's wife is a complicated character as well – wondering about her husband's love, whether he would be sorry if she died, and telling him that life \"is like a comedy – you see me in one part, others see me in another. No one sees my real self\", as she seriously ponders whether to sleep with the sidekick. Such a poignant scene, especially as the vicar is a paragon of virtue, desperately wanting to understand her, saying he'll still love her if she sleeps with another, and later overcoming the demon's temptation to try to catch her in the act.<br><br>So both women, mother and daughter, are faced with the temptation of adultery – one just before her marriage, and the other in middle-age. Both are swayed by pent-up passion, sweet words, and pity – but their feelings and actions are far from simple. Will love be enough to shield them from temptation, even when it truly touches their hearts? I won't spoil it.<br><br>In addition to all of that, I loved the little touches in the movie, including the ministers in hell advising Don Juan on the art of seduction, the demon morphing into a black cat, and the punishment of Don Juan in hell which consisted of nightly dreams of rendezvous with sensuous women, only to be woken up before he could get his satisfaction (\"the performance is over, Don Juan\"). One of his later punishments is somewhat shocking given the movie was made in 1960 – he's forced to listen to a demon gives a play by play description of the sounds the one woman he cares about is making while having sex, starting with her panting and ending in an orgasm so violent she's weeping tears of joy. My goodness.<br><br>Playful, weighty, sacrilegious, creative, well cast, and well filmed – 'The Devil's Eye' may not be Bergman's best movie but it's quite good. I think it's unfair to knock it down based on his other classics – imagine if it was made by someone else! But no, with all of the elements we see here, this is distinctive Bergman.","user":"gbill-74877","rank":[10,11]}]