[{"title":"one of my favorite 60's movies","rating":8,"date":"11 February 2000","review":"I think that \"Send Me No Flowers\" is the best of these \"Technicolor marvel\" comedies from the 60's, but this is one of my favorites. (By \"Technicolor marvel\" I mean those films that were shot in primary colors even more intense than something like \"The Adventures of Robin Hood\", with unnaturally uniform lighting and sets and locations, but mostly sets, that are DisneyLand-clean-and-orderly. Doris Day seemed to be in about half of those movies, at least in my recollection.)<br><br>The movie is about James Garner as an oil-man having a run of bad luck, so he goes to New York to make some quick money. He finds big bucks and romance, and it makes me laugh. The fact that Louis Nye plays a parody of Jackson Pollock, and that Phil Harris, Chill Wills, and Charles Watts act as a sort of Greek chorus to Garner will give you some idea of how inconsequentially silly this movie is. There's even a securities trial at the end (the judge makes a comment at the beginning that is just thrown away -- I missed it the first time I saw the movie -- which I laugh about every time I think of it).","user":"hbs","rank":[24,29]},{"title":"Fast-paced fun","rating":8,"date":"13 September 2001","review":"Good old fashioned comedy that exploits every classic cliche about Texas oilmen. After years playing Bret Maverick, James Garner has the fast-talking con man character down pat. Old timers Phil Harris, Chill Wills and Jim Backus form sort of a Greek chorus of old money Texans eager to see what the brash newcomer's next scam will be.<br><br>All the fun is in the wheelin' and the dealin', Garner explains at one point. \"Money's just a way of keeping score.\"","user":"proffate","rank":[23,29]},{"title":"Chez Henri Tyroon","rating":10,"date":"7 April 2004","review":"This may be the best comedy movie to come out of the 1960s. Wheeler Dealers features James Garner at the top of his game, Lee Remick doing her best Doris Day imitation, and a wonderful cast of some of the best character actors ever assembled.<br><br>Of all the characters James Garner has created for the screen, I think I like Henry J. Tyroon the best. Cowboy oilman and conman par excellence, he moves skillfully from one situation to the other in business, but really comes up against it with Lee Remick in the romance department.<br><br>The supporting cast is soooo good I don't know where to begin to single anyone out. If put to torture I suppose I'd have to mention Louis Nye, \"the boss wrangler of the Henry Tyroon collection\", and John Astin the manic SEC investigator.<br><br>As Mr. Garner puts it: \"Only the taxman loses in a Henry Tyroon deal\". Even a the most dedicated and humorless IRS agent will find laughs in this classic comedy.<br><br>\"I'M INTERESTED IN THE ECONOMICS OF ANY SITUATION\"","user":"bkoganbing","rank":[29,38]}]