[{"title":"The original car-jack classic.","rating":11,"date":"11 March 2001","review":"I've only seen trailers for the Summer 2000 release of GONE IN SIXTY SECONDS.  But the trailers show a big budget, MTV style editing, and big stars.  What it didn't show was that this thriller about a master car thief is a remake of this 1974 no-budgeter by auto man Halicki. The 1974 GI60S's charm is that it is very low budget.   Some scenes, such as the auto auction in the run down lot, or the Radio DJ's cramped little studio add to some crisp atmosphere.  However, the first half of GI60S is rather amateurish (One entire scene is terribly out of focus) and we have trouble following Halicki's unprofessionally written plot.  The second half of the film is a car chase that has to be seen to be believed! In 40 minutes, close to 90 cars are destroyed in  a massive auto chase spanning several cities, freeways, parks, lots, you just name it. For all it's sloppiness, the original 1974 version of GI60S has a neat charm.","user":"boris-26","rank":[38,43]},{"title":"Watch it for the Cars, Not the Cast","rating":10,"date":"10 November 2001","review":"A \"great movie\" is not necessarily one that combines superb acting, character development, intelligent comedy and artistic direction. Instead, a great movie is one that succeeds in doing what it set out to do, and therefore the original Gone in 60 Seconds is great indeed.<br><br>The car chase scenes in this movie are superior to all others. The 40 minute chase at the end of the movie is obviously cinematic history, but the chase that excited me the most was when the tow truck was trying (and succeeding) to outrun the police.  Critics of this movie fail to understand the joy that is brought to a car-loving audience such as myself when a tow truck with an actual car in tow powerslides and fishtails and eventually gets away.  This is not something you see in modern high-budget car chase movies. This is the type of genius you see only in a movie created by a guy who really knows the subject matter.<br><br>If you want quality acting, well-written drama, and striking cinematography, go elsewhere... it's as simple as that. The world only needs one Lawrence of Arabia. But if you want to be stunned with incredible action scenes featuring REAL cars (instead of oh, say a Lincoln Navigator like the one in the remake), pick up a copy of this movie. And if you must have something to accompany the car chases, listen closely to the dialogue; while it may not be poetic enough for some people's ears, it'll make you laugh whether the writer intended it or not.","user":"angrytexan","rank":[45,55]},{"title":"The best car-chase film of all time","rating":9,"date":"6 June 2005","review":"The original \"Gone In 60 Seconds\" will be remembered by many viewers as the best car-chase film of all time. It will also be remembered as the film that featured lots of destroyed cars in a 40 minute chase. As said in the film's IMDb trivia: \"93 cars are crashed in this 97 minute movie.\" <br><br>The best part of this whole movie is the 40-minute chase scene. So many cars are crashed and destroyed during the chase, including original city police cars. What's more, the chase scene had absolutely NO special effects, meaning that all the crashes and smashes were real. Furthermore, H.B. Halicki himself wrote, directed, and starred in the movie. He even drove the \"star car\" (the Mustang) throughout the chase!<br><br>My only negative comment about the film is that the beginning of the movie is very slow; so slow that you may be very eager to get to the 40-minute chase scene. However, if you have the DVD, you can just watch the film starting from the chase scene if you want to.<br><br>Overall, this movie had an awesome chase scene. It is the best chase scene ever filmed in a movie. It has to be seen to be believed.<br><br>P.S: This movie is much much better than the awful remake.","user":"ShadySovereign","rank":[42,52]}]