[{"title":"A timeless Christmas film","rating":9,"date":"22 December 2003","review":"\"A Christmas Story\" is a rare film about children yet for adults.  While kids will definitely enjoy this Christmas-themed saga, adults will find a deeper level of depth than they may remember from seeing the film at a younger age.<br><br>The movie strikes a sharp contrast between the exaggerated, polysyllabic narration of Ralphie, filled with nostalgia and lucid memories, and the soft, high-pitched childlike wonder of Ralphie's spoken word.  The narrator is clearly not the same character as the one portrayed on film, but a character wholly outside the story, reliving his childhood emotions and anecdotes.  Yet he is the heart of the film, the true center of gravity. This is because the movie is not about a scary Santa Clause and a BB gun - it's about childhood memories and the feelings they evoke.  To that end, \"A Christmas Story\" is flawless.<br><br>\"A Christmas Story\" tells of the epically materialistic journey of Ralphie (Peter Billingsley) as he searches for the golden, upheld idol of all red-blooded American boys:  A Red Rider Air Rifle.  Ralphie spins an intricate web of cunning and deceit as he plots to get his hands on it - including an essay, a trip to Santa Claus and more.  The movie also shows us a glimpse of his family - his irritable, foul-mouthed father with a good heart, his whiny brother Randy, and his sweet, all-American mother.  It is not so much a continuous story as a series of vignettes, but it ultimately serves the movie's purpose.<br><br>This is a funny film.  The narration by Jean Shepherd is filled with love for this story.  He absolutely captures the emotions and logic of childhood. In a subtle but amusing moment, Shepherd intones the incomparably eloquent pouring forth of thought into writing - only to have Billingsley note in his awe-filled, high-pitched voice that \"I think everyone should have a Red Rider BB gun.  It's very good for Christmas.\" (paraphrased).  Most of the humor is similar - the natural exaggeration of a child as expressed by Shepherd's consistent string of hyperbole.<br><br>Also, there's a reason why it's played constantly on cable TV throughout the Christmas season - it's a movie everyone can relate to.  There are moments of such pure truth here that few can deny their power.  I'm sure that there is a scientific law left unwritten that determines that every kid must at some point fantasize about his parents feeling absolutely terrible and forever regretting some unutterable punishment they inflicted on their child - in this case, the immortal washing of a mouth out with soap.<br><br>Obviously, \"A Christmas Story\" is not a film that can be compared to Casablanca or Citizen Kane.  It simply excels at its simple goals, and comes together as an extraordinarily entertaining piece of cinema.","user":"JPTaylor","rank":[119,146]},{"title":"Christmas Classic","rating":10,"date":"8 December 2005","review":"A Christmas Story touches my heart as does no other film, and I know the reason for this is because it reminds me so much of my own 1950's boyhood. For sure it strikes a nerve in persons of my generation. This is Bob Clark's masterpiece and I know I am not the only person who feels this way. <br><br>I am going to assume that, if you are reading this, chances are you have seen the film; indeed, probably have seen it countless times as I have. This is not a film review in the normal sense. It is more a reminiscence and appreciation of a great story captured for all time in moving pictures which, in turn, captured the essence of the time and place of its setting; that time and setting being a typical town in Indiana during Christmas season in the 1940s as we observe a typical family (the Parkers) with two young sons named Ralphie and Randy. <br><br>Most of us over the age of 50 can relate very well to the story's key elements. I recall vividly family outings to crowded downtown sidewalks, Mom and Dad squeezing in a season's worth of shopping in one day and doing it under the nose of one who had a visit to Santa Claus on his mind. Staring at the prominent HIGBEES sign in the downtown square, I could almost see the words John A. Brown in its place. Browns was the main department store in my hometown of Oklahoma City and the place where I would make my annual visit with Santa Claus.<br><br>I am sure most who have seen the film realize this is Ralphie's story, but Melinda Dillon as the typical 1940's stay-at-home mom and Darren McGavin as the grumpy but kindly father made the story work. The stove in the Parker's kitchen reminds much of the one my grandmother had, and the rest of the house reminded me of the home my other grandparents lived in. As you see, viewing A Christmas Story is always a magical experience for me. It is almost as if Mr. Clark made this film with Tom Fowler in mind. <br><br>There are so many comments to make. It will be impossible to relate them all in a short review, but here are some that I know people my age will be most familiar with:<br><br>Beautiful toys displayed in department store windows. The agonizingly long wait for toys ordered via mail and learning too late they are not quite what was expected. The excitement of buying a Christmas tree, the joy of setting it up and how much bigger Christmas trees seemed then. Neighborhood bullies who were not nearly as tough as they seemed. Ralphie wanting a BB gun more than life itself. Mom covering trouble for Ralphie to his dad, and the same mom making him eat soap for uttering words -- learned from Dad. Randy sitting underneath the kitchen sink when depressed. A panicky visit to a tired Santa. An unwanted gift from a well-meaning aunt. The furious unwrapping of gifts on Christmas morning. I could go on and on. I will make two more observations and then will sign off and let somebody else speak.<br><br>In the film's sweetest scene, we see Dad coming through for his son at the last possible moment. To see the look on young Ralphie's (ably played by Peter Billingsley) face as he unwraps his best and last gift is one of filmdom's true golden moments. <br><br>But, for me the best moment was the last. Ralphie is in bed at film's end. We see snow outside and Ralphie dreaming of his wonderful gift, as the story's author and narrator Jean Shepherd, speaking as the grown up Ralphie, realizes this was the best Christmas he ever had, or ever would have.<br><br>If you are middle age or older and have not seen A Christmas Story, you are perhaps unaware that you have cheated yourself. Buy or rent the 2003 20th anniversary DVD. It will be the best money you spend this Christmas -- or any Christmas.","user":"Tommy-5","rank":[90,111]},{"title":"The funniest, most touching family Christmas film of ALL time!","rating":15,"date":"15 March 1999","review":"I lived the life of Ralphie!  Even though I'm a girl and was born in the late seventies, my Christmases were much the same as Ralphie's.<br><br> From playing Santa on Christmas morning to sipping my Dad's Christmas cocktail to visiting Santa at the department store, I lived the very same Christmas memories.  This movie brings out the true essence of Christmas happiness.  Everyone, young and old, can relive the magic of being a child.<br><br>Ralphie's vibrant imagination and inventiveness in his ploys to seduce his parents into buying him the ultimate gift are \"pinch-his-chubby-cheeks\" adorable.  And Randy...need I say anything??  He is the perfect picture of the baby brother!<br><br>This movie is universal in its appeal to audiences of all ages, race, and nationalities.  My husband, who grew up in Lebanon and who's first language is Arabic, even knew the famous \"oh fudge\" line when I first played this movie for him here in the States.<br><br>I get giddy every time I sit down to watch this movie.  Curling up with a warm cup of cider in front of the fireplace, wrapping Christmas presents, making Christmas cookies, or writing a letter to Santa Claus...those are all perfect times to watch this classic family film.  This has been and always will be my all-time favorite Christmas film.","user":"Kimta","rank":[110,148]}]