[{"title":"Classic","rating":10,"date":"24 April 2006","review":"Consider the range and the capture of characters in one movie, Colors delivers multiple plot lines from a number of sides. <br><br>I remember when this movie first came out I was in Jr. high school. Colors was a controversial movie talked about by teachers, principles and parents because, believe it or not, it had a tendency for glorification and encouraging gang membership. <br><br>To my surprise, the movie has little glorification in it and was a grim summary of Los Angeles gang life (and even that of law enforcement.) The movie does not spoon feed its audience, save for a few minor comments that were cheesy at their worst and cleverly woven in at their best. <br><br>In some cases the portrayal of gang life in LA might have been TOO broad and sophisticated for many viewers. The title COLORS and its implication was meant to explain the rival Crip and Blood gangs but in fact that was merely a pretext. Soon into the movie the viewer is taken into various other neighborhoods as well as other gangs, including WHITE FENCE and 21st Street. <br><br>For those that denounce this movie as being outdated, cheesy or otherwise, it's hard for me to understand what you are paying attention to. If you remember the 80's in the slightest, it was a time of decadent and flamboyant neon glow ala Prince, Michael Jackson and various other nonsense. The irony is that COLORS portrays a world that was virtually isolated and separate from the 80's because that is what it was MEANT to point out. This was gang life at its peak, before any of the gangster rap hit white suburbia and became a marketable fad. This was BEFORE white folks thought it was cool. It was isolated from the look and feel of the rest of the 80's because this world was isolated from the general population.<br><br>For this reason I am surprised that anyone would call the movie outdated in any way. \"Timeless\" is the word I use to describe it.<br><br>Despite all this, Hopper manages to incorporate the storyline between Duval and Penn. Not only is this a brilliant interaction between two great actors, it also has a more marketable value to a white audience that would otherwise have been turned off by the subject matter and considered it, unfairly, as a \"blacksploitation\" film. Let's face it, Hollywood is big business. The ability to market this movie with ANY semblance of a good plot line but making it even remotely realistic is an amazing achievement. <br><br>Hopper goes beyond doing both. I would not be surprised to see this movie in the classics section, someday.","user":"arnold_benj","rank":[68,76]},{"title":"A surprisingly very good and very underrated movie.","rating":8,"date":"1 August 2016","review":"Colors is a movie that shines brightly with quality actors Sean Penn and Robert Duvall headlining the movie and Dennis Hopper sitting in the director's chair for the first time since Easy Rider (1969). The film could have easily been dismissed as a routine action movie but the end result is a gritty crime drama that highlights a major problem across the USA.<br><br>Colors focuses on the Los Angeles Police Department's CRASH Division (Community Resources Against Street Hoodlums) combating the gang wars that could explode across Los Angeles at any moment. Amongst the CRASH officers are the 19 year veteran Officer Bob Hodges (Robert Duvall, The Godfather) who treats all the gang members hard but fair yet approaches every problem with a sense of diplomacy. Hodges is partnered with Officer Danny McGavin (Sean Penn, Fast Times at Ridgemont High) a young police officer who is highly capable but has a very short fuse and proves to be his own worst enemy with his aggressive approach to police work, much to the chagrin to Hodges. Hodges and McGavin must work together to prevent an all out war on the streets of Los Angels between the Bloods and the Crips.<br><br>Sean Penn made his mark with Fast Times at Ridgemont High (1982) and since then has gone from strength to strength with movies such as Bad Boys (1983), The Falcon and the Snowman (1985) and At Close Range (1986) which was met with acclaim from critics and audiences alike. Improbably cast as an LAPD officer, Sean Penn turns in an excellent performance as Danny McGavin which sees him continue to come of age. Ironically, Sean Penn found himself on the wrong side of the law during the filming of Colors when he was jailed for punching an extra who photographed him and Robert Duvall without his permission.<br><br>The ever reliable Robert Duvall who never puts a foot wrong no matter what role he plays or what movie he appears in. Duvall does a fine job as veteran officer Bob Hodges who strives to keep the peace on the streets of Los Angeles as well as keeping his young hotheaded partner in line.<br><br>María Conchita Alonso (The Running Man), Don Cheadle (Traffic), Damon Wayans (The Last Boy Scout), and Glenn Plummer (Speed) also appear in small but effective roles in Colors and support Sean Penn and Robert Duvall very well.<br><br>The late Dennis Hopper was a surprise choice as director given that in his stellar career (Apocalypse Now, Blue Velvet, Speed) he has only directed a handful of movies with Easy Rider (1969) being his only successful movie as a director. Here in Colors he has done a quality job bringing the movie to the big screen.<br><br>Colors was a surprisingly very good movie that is sorely underrated. Thankfully critics did not dismiss this as rubbish and gave the movie credit where it was due. It was also boosted by the star power of Sean Penn and Robert Duvall under the direction of Dennis Hopper. It is gritty and uncompromising, but Colors shines.<br><br>8/10.","user":"The Grand Master","rank":[13,14]},{"title":"Unflinching","rating":8,"date":"13 April 2006","review":"My generation remembers these times...This is before Rodney King and the riots, before the relentless moralizing of Spike Lee and John Singleton. Back then, urban gang warfare was comfortably distant. This is before cell phones, bling, rims, before the thug life became a marketable commodity.<br><br>Colors is distinctive for Hopper's tight focus, his honest approach and complete lack of sentimentality. The world depicted here is horizontal, and filmed horizontally; it is ugly and unironic, and in a way egalitarian; there are NO courts or lawyers, every introduction of ethics is literally shot down. <br><br>It's hard to imagine anything being made like this in today's multiculti/PC world, any such attempt would immediately provoke shrieking and clutching of skirts at the sight of 'racism'. <br><br>This paradigm of movie-making didn't survive, it disappeared like Duvall's soul in that departing helicopter shot. Unfortunately, the trend went the way of \"Boyz n the Hood\".","user":"jldmp1","rank":[60,76]}]