[{"title":"Mister Laurel & Mister Hardy Arrive In A State Of Confusion","rating":10,"date":"23 June 2002","review":"Two War buddies - BLOCK-HEADS both - create complete chaos in &amp; around a fancy apartment building.<br><br>Stan Laurel &amp; Oliver Hardy are once again up to their usual high jinks, dealing with frightful wives, dangerous neighbors and the homicidal tendencies of nearly every inanimate object with which they come into contact. At this point in their partnership the Boys' were firmly established as screen legends; they worked together like well-oiled machinery, producing one laugh after another.<br><br>Billy Gilbert &amp; James Finlayson - the Boys' greatest nemesis - are on hand and in very fine form as Ollie's highly belligerent neighbors. Gilbert's Great White Hunter (`I don't bring em back alive. I bring em back dead. I come back alive.') is especially funny. Patricia Ellis as Mrs. Gilbert &amp; Minna Gombell as Mrs. Hardy add to the merriment.<br><br>Movie mavens will recognize OUR GANGer Tommy Bond as the mean kid with the football.<br><br>The film's opening sequence, with newsreel footage of World War One battles, is unexpectedly grim for a comedy. Fortunately, the laughs start quickly. Best bit - Ollie, thinking Stan has lost his right leg, insists on carrying him everywhere. Stan lets him.","user":"Ron Oliver","rank":[11,11]},{"title":"The Last Great Comedy By A Wonderful Two-some!!","rating":10,"date":"21 April 2004","review":"The last genuine, hilarious Laurel and Hardy comedy has no plot at all!! Just a series of hilarious gags that come thick and fast.. I would rate this feature(their last for Roach / MGM) as possibly their very best, only Way Out West comes near!! It's such a pity that after this film the decline really set in.. I would recommend Block-Heads to any Laurel and Hardy fan.. that said it is not going to change your mind if you don't like L&amp;H as the boys are wonderfully true to type.. the ending is a reworking of Unaccustomed As We Are (their first sound movie) and in my opinion is much better here.. Don't miss the scene with the great James Finlayson!!  If you get the chance to see it.. DON'T MISS IT!!","user":"nick300870","rank":[8,8]},{"title":"Stan in the war","rating":27,"date":"27 April 2000","review":"It's the year 1938 and the war has been over for twenty years. But Stan is still patrolling in the trenches without knowing that the war is over.Stan's good buddy Oliver sees his friend's picture in the paper and goes to the veterans' home to get his buddy. Block-Heads is a hilarious Laurel and Hardy comedy.The movie offers you lots of laughs with the boys.Who could forget the scene where Ollie carries Stannie because he thinks Stan has lost his leg in the war.But Stan has the leg underneath him in the wheelchair.And the scene in the stairs.Block-Heads is one of the best Laurel and Hardy movies.Just watch the movie and it's non-stop laughing from the beginning to the end.","user":"Petey-10","rank":[14,16]}]