[{"title":"\"I Am An Actor!\"","rating":10,"date":"11 June 2006","review":"This film proves with JUST TELL ME WHAT YOU WANT that Alan King was capable of a good film career. The story here does not deal with secretive billionaires and their angry mistresses, but with a man who left his family in New York City decades before to pursue a career in Hollywood. But Abe has never been more than a background extra. When his son Abie (Billy Chrystal) is recovering from a heart attack, he goes to Hollywood to see his father for the first time in years. Abie discovers that his father has never even had a real speaking part (the closest is when he was the sixth or seventh man in SPARTACUS to yell \"I am Spartacus!\"). Naturally, given the shattering effect that Abe's abandonment of the family had, it does not seem to Abie that his father had much to show for it. Abe, who has become part of the Hollywood community (he is usually seen with his fellow extras, but we see he does know Sean Connery by first names). He is reasonably happy - but Abie keeps dismissing him as a hack, not an artist.<br><br>The arrival of Abie's girlfriend Lisa (JoBeth Williams) does not help matters at first, but she manages to bridge the anger and contempt that the son feels for his father, and slowly they do find some degrees of similarities. Abie loves playing the trumpet, for example, and does it well. But Abie discovers that there is something physically wrong about his father - a sudden memory problem causing the father to recite a scene he liked from INHERIT THE WIND. The prognosis is grim. So Abie decides to help his father accomplish his greatest wish: get a full scene in a movie with actual dialog.<br><br>Most of the comments here have been fairly negative, insisting that it is a very lachrymose and overly sentimental tale. There is no denying that it is (ultimately) a tragic story - but the performances (particularly King as a proud and touchy man, who will not admit that his life has been less than a success) are good for the three leads. King's performance mingled pathos and comedy quite well. Witness the scene where he was trying to choose among his friends for the extras in a science fiction film, where he is dressed in a lobster costume. King shows his sauciness at a self-important assistant director, but he also shows the start of his mental/physical collapse in the same sequence (quite a change of pace). Similarly his interview with the casting director for the speaking part that Abie sneaks into is done with great charm and dignity. It was a first rate performance - and proved that King was an actor.","user":"theowinthrop","rank":[11,11]},{"title":"Doesn't leave behind any good memories...","rating":4,"date":"30 July 2002","review":"Billy Crystal co-wrote, co-produced and stars in this extremely safe and comfy comedy-drama about fathers and sons, adult irresponsibility and growing old. Billy plays a heart surgeon who has a heart attack (ha ha) which causes him to seek out his estranged father (Alan King), a movie-extra who fancies himself a big star. The screenplay is sub-Neil Simon--with one-liners galore--while Henry Winkler delivers a flat, inexpressive direction (stuck in sitcom mode). Crystal and King try their best, but King is overeager and frequently over-the-top. JoBeth Williams has another one of her thankless roles, but manages to bring her innate, down-home class to the proverbial girlfriend character. It's a comedy, I guess, but one that blinks back the tears...shamefully. ** from ****","user":"moonspinner55","rank":[8,9]},{"title":"I Cried Like a Baby","rating":16,"date":"16 November 2000","review":"Okay, the movie really isn't that good but it really does make me wail like a newborn.  It's the whole father/son relationship thing that works in this film.  I'm not a big fan of Billy Crystal but he's okay in this.  Alan King is the real star and he shines pretty bright.  Give it a chance.","user":"dvdfan-10","rank":[8,10]}]