[{"title":"A Classic! Worth Watching for Performance of Geneviève Bujold!","rating":18,"date":"18 November 2005","review":"The second of the six wives of Henry VIII and the mother of the future queen Elizabeth I, Anne Boleyn is a tragic footnote to the lives of these two famous Tudor monarchs from English history.<br><br>\"Anne of the Thousand Days\" gives Anne Boleyn the belated respect she deserves due to the sparkling performance of the actress Geneviève Bujold. The screenplay draws upon the successful 1947 stage play by Maxwell Anderson, who also wrote plays on the lives of Elizabeth I and Mary of Scotland. But this is his most famous historical drama, and it is unfortunate that Anderson did not live to see this fine film adaptation.<br><br>The film covers major events and figures from the early Tudor age, including Henry's controversial divorce from Catherine of Aragon, the rise and fall of Cardinal Wolsey, the courageous ethical stance taken by Sir Thomas More in opposing the will of the king, and the unscrupulous Thomas Boleyn, who played the role of pimp and go-between in the trysts with his daughters and the king.<br><br>While the movie proceeds at a deliberate pace in recounting the various subplots, it is the figure of Anne Boleyn who ties together the different plot strands related to the king's \"Great Matter.\" Bujold's multi-layered performance reveals an Anne Boleyn with heroic virtues and deep ethical concerns. <br><br>The film takes license with a non-historical scene where Anne confronts Henry after she has been convicted of treason, adultery, and incest and is imprisoned in the Tower of London. The deluded Henry has come to believe that he was \"bewitched\" by an enchanted Anne, and the scene in the Tower delivers a thundering dramatic climax to the film. <br><br>Bujold's performance is all the more remarkable as she is playing opposite one of the great actors of the previous century in Richard Burton. Not only does Bujold's Anne set Burton's Henry straight, but she takes a stand on matters of conscience from which we can still learn today. Geneviève Bujold and this dynamic scene in the Tower of London alone make \"Anne of the Thousand Days\" a classic.","user":"lavatch","rank":[35,40]},{"title":"A Sixties Classic Reveals a Rare Achievement","rating":8,"date":"5 January 2007","review":"With a surprisingly strong script and good performances, the film delivers as a late 1960s production that reveals a cinema that was in transition into the modern era. As a historical drama it deserved its one Oscar win and 9 other nominations. It avoids the plodding performances of most costume dramas of the time, while not quite delivering the stunning intimacy that was achieved by the BBC two years later in its landmark \"Elizabeth R\" mini-series 1971 - (achieved through micro-direction, dedication to detail and precision use of the small screen close-up - who ever said film is the same medium as broadcast television?)<br><br>Richard Burton turns in arguably the best performance of his career as Henry VIII. Had his performance revealed just a shade more gravitas and reflection, he surely would have picked up an Oscar.<br><br>I'm glad to say that British commercial TV managed to air a decent print of this picture over the Christmas season 2006, even though the cinema-scope frame edges were cut off. Well worth watching, but if you shop for a DVD, do make sure it is in the correct format so the full 35mm squeeze / 70mm letterbox frame is visible. A classic from the '60s and a rare achievement.","user":"john-ruffle","rank":[14,15]},{"title":"Passionate, historical and sombre","rating":10,"date":"20 August 2001","review":"It is a memorable film, well nominated, exquisitely costumed. I like Richard Burton best of all in this one. He takes up the role of Henry VIII and gives it many subtle shades of feeling so that you almost understand what might have really transpired in such a king's turbulent soul. He was somewhere between a rock and a hard place and rushed headlong into history with his determined efforts to change the rules of kingship.<br><br>Anne Boleyn, here played by Genevieve Bujold, was caught up in these events and ultimately became a casualty of circumstances. I'm not a history buff so can't fill in the true story but it's obvious there was much political intrigue taking place. Also, it rather reminded me of \"Othello\" in which the ill-fated Desdemona was victimized by Iago's slander. Genevieve portrays Anne with deep conviction and her tremendous vehemence at times sweeps us along through happy moments as well as fiery clashes with family, king, and authorities.<br><br>I was enthralled by the excellent supporting actors who formed the king's entourage, and hope to know them by name one day. In particular was their exchange of witty dialogue in the captivating scene which ended in a reference to a \"venison haunch.\" I believe one of these actors later appeared in \"Mary, Queen of Scots\" (1971) as I recognized the same wonderful voice, and I think it's Vernon Dobtcheff. Well, it's a bit of detective work I must do to confirm.<br><br>Anthony Quayle's portrayal of Cardinal Wolsey was right on. Oh the glories of power in high places, so many titled positions he held! Yet in the end the Cardinal could hold onto none of them in a true sense. I feel this is one role where Quayle really excelled as an actor and a very dramatic presence.<br><br>For me this film goes hand in hand with \"A Man for All Seasons\" and \"Mary, Queen of Scots\" for some great drama on screen.","user":"lora64","rank":[27,32]}]