[{"title":"What an adorably little monster-baby!","rating":6,"date":"9 December 2005","review":"French cinema isn't exactly known for its many horror masterpieces (the exceptions that prove this rule are \"Les Yeux Sans Visage\" and the more recent \"Haute Tension\") but, as much as in every other country, there are always some gore-loving genre fanatics that sooner or later direct their own independent cult gem. Alain Robak clearly is such an enthusiast filmmaker and his \"Baby Blood\" is a hugely entertaining and cheerful splatterfest, despite the poor and inept screenplay. The relatively unknown but impressively voluptuous Emmanuelle Escourrou (what's in a name) stars as the unhappy fiancée of a circus artist who gets impregnated by a parasite that burst out a newly imported cheetah. The fetus growing inside Yanka is pure evil and demands her to kill men so that it can feed on their blood. This results in some of the most over-the-top bloody and sadistic massacres ever shot on film, with cut off heads, slit throats and many outrageous knife-attacks. Of course, this exaggerated amount of bloodshed makes it all blackly comical and \"Baby Blood\" therefore shouldn't be taken too seriously. This isn't the fist horror film handling about ferocious fetuses/infants (there's also \"It's Alive\", \"I don't want to be Born\" and even the premise of \"Rosemary's Baby\" is remotely similar) but \"Baby Blood\" is much more creative and tongue-in-cheek than anything you've ever seen before. The camera-work is quite nifty and there are several cameos of eminent Frenchmen, like Jacques Audiard (director of \"Read My Lips\") and Alain Chabat (who played Caesar in \"Asterix\"). The script is very man-unfriendly, which is quite a new approach for exploitation! Nearly every male is presented as a weak and imbecile creature whereas Yanka gets stronger with every murder she commits. \"Baby Blood\" is ingenious, somewhat bizarre horror fun.","user":"Coventry","rank":[17,18]},{"title":"Absolutely brilliant twist on the killer baby theme!","rating":24,"date":"24 June 2002","review":"'Baby Blood' is a superb overlooked French horror movie that deserves a much wider audience. The beautiful and voluptuous Emmanuelle Escourrou stars as a circus performer who is impregnated by some kind of mutant monster. On the run, her unborn \"child\" begins to speak to her and demands blood - lots of it. Reluctantly she complies by murdering  men she encounters. Eventually she develops a strange love/hate relationship with the monster within her.<br><br>\nThis is a brilliantly entertaining variation on the killer baby theme (see 'The Unborn' and 'It's Alive'), with plenty of gore and nudity from the stunning Escourrou. I say steer clear of the American dubbed version as it is cut. 'Baby Blood' is one of the most underrated horror movies of the last twenty years. I thought it was a classic piece of exploitation and I can't recommend it highly enough!","user":"Infofreak","rank":[19,22]},{"title":"French art-house gore flick is better than you'd expect","rating":6,"date":"16 October 2015","review":"Over the years, plenty of film fans have turned director and churned out ultra-cheap gore-fests which go out of their way to desensitise the viewer with endless bloody murders and guts splashed all over the place. Most of the time, these independent filmmakers come from America or the U.K., and thus the '80s and '90s are full of little-seen films like THE ABOMINATION. BABY BLOOD is a French take on this sub-genre of movie-making, a dark little splatter film with a bizarre plot that capitalises on the late '80s/early '90s trend in \"evil baby\" films, perhaps set off by US flick THE UNBORN. While it's cheap and sometimes badly acted, BABY BLOOD tells a simple story that moves along at great speed. Essentially, it's about a woman possessed by her primeval baby, who turns out to be a slithery Lovecraftian creature with a penchant for blood.<br><br>Along the way the woman becomes a blood-drinking maniac who, in a distinctly feminist angle, goes after the men who slight her, before turning her sights on all men in general. After a series of murders and vehicle accidents, the baby is born with predictably disastrous consequences. BABY BLOOD succeeds in creating some eerie moments, mostly in the creepy voice of the killer baby (word has it that Gary Oldman dubbed this role for the American release). As the heroine, the voluptuous Emmanuelle Escourrou isn't afraid to spend much of the film in the nude, adding to the exploitation value, and she transforms her character from an attractive and fragile victim to a blood-soaked maniac with a certain level of convincingness. The male characters in the film are all pretty stupid and sleazy, so it's hard to work up empathy when they get their guts torn out.<br><br>At heart, this is a gore film and director Alain Robak focuses on the bloodshed throughout. There are knife murders, people getting crushed and run over by cars, bodies being torn to shreds and severed heads galore. The blood is liberally sprayed all over, pushing the boundaries of good taste on many occasions, and the low budget special effects are surprisingly decent. One of the most disturbing sequences is a nightmare in which the heroine sees bloody hands emerging from her stomach – a truly stomach-churning and weird moment. Robak also creates a brilliant and offbeat sequence of the heroine staggering down the street, where the actress is shot from a low angle and there's a look of animation to the shot. I can't quite describe it, but it's one of the most inventive things I've ever seen. Bizarrely, despite the downbeat, degrading nature of the story and all the darkness and brutality of the murders, the baby turns out to be quite a humorous creation and engages in some comedic question-and-answer sessions with its mother as it tries to find out more about the human world. The final set-piece, on a bus full of drunken footballers, is well-executed with some memorably slippery special effects work, and the final shots are neatly portrayed. BABY BLOOD won't rock anybody's world, but it is a well-made and distinctive little shocker.","user":"Leofwine_draca","rank":[6,6]}]