[{"title":"Amazingly close to history","rating":8,"date":"21 June 2009","review":"The first few times I saw this movie, I hadn't read the history of the Lincoln County Land Wars.<br><br>However, in recent years, with the convenience of the internet at hand, I read the histories along with watching the movie. Compared to the amount of factual change that most movies based on a history put on film, this movie is not far from being spot on.<br><br>In fact, the amount of direct action that John Wayne's character, Chisum, took in the film, is probably the element that is the most out of place.<br><br>Billy the Kid really did work for an English rancher involved in the dispute. His boss really did fund a rival general store with a lawyer. Both the English rancher and the lawyer were murdered by the faction controlled by the rival general store.<br><br>Billy the Kid really did get his outlaw career kicked off in seeking vengeance for his boss and mentor's murder. Pat Garret really was supported for sheriff by John Chisum, who somehow managed to stay out of the thick of the feuding even though his use of huge tracts of public grazing land was part of the heart of the dispute.<br><br>So history buffs can safely enjoy this movie knowing that history is just bent a little, and not ripped completely asunder as the case would be with most movies. LOL That said, this is a very entertaining western. John Wayne is on top of his game as a cattle baron, and the supporting cast does a fine job. It includes a bit of everything: rustling, gunfights, stampedes, crooked sheriffs, greedy bad guys, heroic good guys. It has more plot surprises than the normal western (and that is precisely because it kills off certain characters approximately when and how they died in the real events).<br><br>All in all, an enjoyable and surprisingly informative film about a real \"old west\" feud.","user":"vranger","rank":[26,29]},{"title":"\"No matter where people go, sooner or later, there's the law.\"","rating":7,"date":"19 April 2008","review":"McLaglen's western showcases Wayne as John Simpson Chisum, an historical figure who was the largest owner of land, of horses and cattle in New Mexico territory around 1878 The Pecos River runs through the middle of his land He lets the water flow to all the ranches, big and small If another man, with more appetitelike Lawrence Murphy (Forrest Tucker) owned that land he'd control a territory bigger than most states and some countries The story is based on the bloody Lincoln County cattle war <br><br>Things come to 'one hell of a fight' when Murphy's men kill Chisum's friend Henry Tunstall, mentor to Billy the Kid, and have Alex McSween, manager of their general store, with Billy and some men, trapped in<br><br>Forrest Tucker plays Chisum's enemy who really thinks himself skillful enough to 'own' the law <br><br>Christopher George (Dan Nodeen) plays the half-crazy bounty hunter who gimps because of Billy the Kid<br><br>Ben Johnson has one of the most impressive records of any supporting Westerner He came here to support Chisum all the way<br><br>Andrew V. McLaglen has built up a reputation as one of the most promising of post-war directors of Westerns, but has yet to fulfill that promise with a really major work","user":"Nazi_Fighter_David","rank":[33,38]},{"title":"Old Style Western entertainment","rating":10,"date":"15 October 2005","review":"One of the last of the old-style Westerns (it always amazes me that it was made as late as it was). John Wayne doing his stuff as only he can - huge shoot-outs, classic fist fights, goodies and baddies amazingly clearly defined, thumping score, oh and that amazing landscape.<br><br>If you like Wayne you'll love this, if you don't then you'll hate it. Simple as that. Ben Johnson is superb - as ever, a much underrated character actor.<br><br>Someone mentioned the 'silly' title song. I have to disagree. I love those amazingly long opening titles and the grandiose pomposity of the theme tune and its voice-over. All moving into that classic opening shot of Wayne like an immovable great rock on horseback and the horizon. Probably (no definitely) my favourite opening to a movie.<br><br>True to history - if it ever is then its by accident. But what do you expect - its a classic old-style western! Finally, was this the last US movie to feature characters with (allegedly) British accents as heroes. ;-)","user":"Crimpo2","rank":[31,36]}]