[{"title":"Good clean fun with a touch of heartache","rating":10,"date":"8 September 1999","review":"This is my favorite Disney movie of all time. It is, in my opinion, one of their finest. Why do I think so? First, I like its realism. It is not some fantastic fairy tale, nor is it some good-against-evil-good-eventually-triumphs story. There are no heroes or villains in this story. This lack of good and evil made the story and the characters seem more alive than the ones you usually see.<br><br>I also like the message this movie gives. It is simple yet powerful. The two main characters wanted only the most innocent of things - friendship. Yet society couldn't allow this friendship to be. This movie tugs at your heart, and it doesn't stop tugging. And the realism didn't diminish any by the movie's close. The main characters' problems remained unresolved, yet each finished the movie in contentment. I feel that this lack of a \"everything's okie-dokie again\" finish like you see in traditional animated movies gave this story a powerful element.<br><br>If you're looking for songs your children can sing over and over again, you've come to the wrong movie. Each song is sung in a flavorful yet discreet manner. Little orchestration. Yet if you're looking for memorable characters, you've come to the right movie. Each character is very well developed, motivated by true emotions and the things that the everyday person wants - love, food, companionship. Each character is vibrantly drawn, and this vibrancy is matched by the character's personality. I saw a real person within the animal. Nobody is created in an idealistic image.<br><br>From realistic characters come a realistic story. Nothing felt written or hacked. Everything felt like it was supposed to happen. There was nothing outlandish about the entire story. And if you're looking for comedy, you'll find none. This is pure drama, yet it's drama that kids can easily understand. This movie had a story that seemed like it could've easily happened to the average person. This is a rare and endearing quality.<br><br>Basically, I loved this movie for what it had, a heart of gold, but also for what it lacked, a traditional formula. If you're looking for a story with a difference and a bittersweet flavor, this is the movie for you! It is nice, quiet, yet provocative and emotional. To sum it up, it is good clean fun with a touch of heartache, a true drama!","user":"pmcollectorboy","rank":[90,93]},{"title":"Adorable","rating":10,"date":"11 February 2004","review":"The Fox and the Hound, one of Disney's forgotten treasures, I honestly don't know why this movie is more noticed by people. This is one of my favorite animated movies of all time, it's innocent, it's simple, it's lovely, and just a wonderful tale about the most unlikely pair becoming the best of friends. The Fox and the Hound, yeah, it does go a little overboard on the cuteness factor with baby Tod and baby Copper, but this is when Disney really did mean well and came up with such a sweet and wonderful story that is classic.<br><br>After a young red fox is orphaned, he is adopted the Widow Tweed, she names him Tod. Meanwhile, Tweed's neighbor, a hunter named Amos Slade, brings home a young hound puppy named Copper and introduces him to his hunting dog Chief. Tod and Copper become playmates, and vow to remain \"friends forever.\" Slade grows frustrated at Copper for constantly wandering off to play, and places him on a leash. While playing with Copper at his home, Tod awakens Chief. Slade and Chief chase him until they are stopped by Tweed. After an argument, Slade says that he intends to kill Tod at his first opportunity. Hunting season comes and Slade takes his dogs into the wilderness for the interim. Meanwhile, Big Mama explains to Tod that his friendship with Copper cannot continue, as they are natural enemies, but Tod refuses to believe her. Months pass, and Tod and Copper reach adulthood. On the night of Copper's return, Tod sneaks over to meet him. Copper explains that he is a hunting dog now and things are now going to be different between them.<br><br>The Fox and the Hound is such a great movie, honestly if you don't like this film, I don't know what's wrong with you, but you need to get something checked because everything about this film is just wonderful. The songs, animation and characters are just lovely. Plus there are some fun jokes, I loved seeing Chief constantly chasing after Tod and then Slade runs over to Tweed's house to scream about the fox but she just kicks his butt and tells him to get off her property. This is such a great movie, I highly recommend you see it if you get the chance.<br><br>10/10","user":"Smells_Like_Cheese","rank":[107,112]},{"title":"The best Disney Animated feature of its generation","rating":9,"date":"31 August 2004","review":"Halfway through production, Don Bluth mutinees, taking most of Disney's best animators with him. Another bunch resign. One dies. Drawings are stolen. Production is delayed endlessly. You would think that if ever a Disney feature were destined for disaster, this was it. Instead, 'Fox and the Hound' is probably the best Disney animated feature of its generation. You could clear a space about 10 years either side of it before you ran into something that gave it serious competition.<br><br>We start with an orphaned fox kit - pardon me as my jaw doesn't drop in amazement. There have been, what - TWO Disney films where both parents survive? And, well, he is adopted by an elderly widow named Tweed, he develops a friendship with a hunting dog owned by Widow Tweed's crochety neighbor, and he starts to grow up, and life suddenly becomes very difficult, dangerous, and emotionally complicated.<br><br>I won't give it away, in case you haven't seen it, but for my money this movie has close to the saddest, most desolate, tear-jerking scene in any Disney film I can think of. But don't worry, it bounces back well and truly. This is a long way from being a morose film. In fact it's an excellent balance of drama, action, pathos and humour. My only minor complaint is that there are a couple of comic sidekicks in this movie that are pretty annoying and contribute just about nothing to the story.<br><br>Coming after 'The Rescuers', 'The Fox and the Hound' might have been the start of a Disney resurrection, but perhaps Bluth's departure really was a body blow. As it is, 'Fox and the Hound' is a moment of beauty and brilliance in the otherwise pretty murky first 20 or so years after Walt's death.<br><br>Although it didn't cause much of a stir at the time, it has developed a deserved base of loyal fans in the twenty-three years since it was made.<br><br>The film tackles themes of conflicting loyalties, friendship, love, identity, and somehow does it with a minimum of schmaltz and a maximum of heart. It's one of Disney's best, and you owe it to yourself to see it.<br><br>9 out of 10<br><br>\nHistorical Note: Mickey Rooney plays the adult Tod, the fox in 'Fox and the Hound'. According to Rooney's 1991 autobiography, when he was 5 years old he wandered into an office at Warner during breaks between shooting in one of his child-star films, and introduced himself to a bloke who turned out to be Walt Disney, and who was in the process of drawing a new mouse character, who he decided on the spot to name after Mickey. It just tops it off nicely, doesn't it?","user":"Lupercali","rank":[38,40]}]