[{"title":"Fascinating to look at","rating":26,"date":"26 November 2001","review":"HE WALKED BY NIGHT (1948) has such a raw, bare-bones feel to it, a real \"you are there\" aura.  A cheerless loner (Cold as an ice bomb Richard Basehart) kills a policeman.  The search of the killer begins.  This little B-film has so many unforgetable scenes, they drive in one after the other.  (The police picking up every vagrant in the city searching for the cop killer, the look on the targeted cop's wife's face when she gets the bad news)  My favorite scene is one that does not move the plot along, but creates such an uncomfortable mood.  In it, Basehart tries to fish a bullet out of his arm at his sink as his dog yaps and whines in the background. <br><br>\nWell worth catching.","user":"boris-26","rank":[57,58]},{"title":"Doing It By the Numbers","rating":8,"date":"4 August 2006","review":"Richard Basehart shoots down an LAPD officer one night after the offduty patrolman stops him for some suspicious activity. The officer who paid with his life had every reason to be suspicious, Basehart was attempting to break into an electronics store.<br><br>The shooting sets off a manhunt that takes more than a month. Captain Roy Roberts and Detective Scott Brady lead the investigation which takes both men into some unexpected places in trying to track down the culprit.<br><br>This was Richard Basehart's breakthrough role in He Walked By Night. He plays a really diabolical stone cold killer in this one who apparently has no liking for humans. His only companion in the world is a dog.<br><br>This clever little noir thriller is done in the documentary style that seemed to be in vogue after World War II. I'm also sure that the final chase scene through the storm drain must have inspired Carol Reed to put it in The Third Man where the idea got more notice.<br><br>The lack of really big name stars gives this film a realistic approach. Look for Jack Webb in a supporting role as a police lab technician. I Don't doubt he got the idea for Dragnet from working on He Walked By Night.","user":"bkoganbing","rank":[27,27]},{"title":"The Noir Blueprint For \"Dragnet\"!","rating":2,"date":"2 September 2001","review":"Based on a true 1946 Hollywood Police Department case, \"He Walked By Night\" is an early attempt at a \"police procedural\" film. It has a semi-documentary look combined with many of the conventions of film noir (thanks partly to cinematographer John Alton). Many of the outside scenes were filmed in or around actual locations. Richard Basehart plays a loner who is well-versed in electronic technology, guns, and police procedures. He's able to stay one step ahead of the cops because his paranoia and attention to detail keep him in a constant state of alert. It's also helpful that he listens in with his police-band radio. For a time he confounds the Hollywood cops because he changes his modus operandi. He begins as a break-in artist who steals electronic equipment, but when he kills a suspicious young policeman and loses some of his tools, he turns to armed robbery of liquor stores. Nobody can find him because he travels through Los Angeles in its underground storm drains, where he has hidden stashes of guns and other survival equipment. We also follow the cops as they make use of whatever little information they're able to gather on Basehart's character, and slowly they do close in after several missed opportunities and track the killer into the storm drains, where the play of light and shadow really takes over. One of the cops in \"He Walked By Night\" is played by Jack Webb, and there's no question he got the inspiration for 'Dragnet\" from this film. For starters, \"He Walked By Night\" begins with a sky pan of Los Angeles and scenes of everyday Hollywood while the narrator gives a kind of \"this is the city\" speech. The police scenes are often very quotidian (sometimes to the point of being overly detailed), with cops tossing in small talk like \"how's the missus? glad to hear it\" before they ask other questions. Much of the pacing, attitude and overall feel of \"Dragnet,\" which began as a radio show a year after this film and then moved to TV in 1952, is already here. The final scene in Los Angeles' storm drains (\"seven hundred miles of hidden highways,\" according to the narrator) provides probably this film's most memorable images. Its set-up and execution are remarkably similar to Orson Wells being chased through the sewers of Vienna in Carol Reed's \"The Third Man,\" which was filmed a year later and likely inspired by \"He Walked By Night.\" And who knows, it might also have given a few ideas to the makers of \"Them\" a couple of years later when they revisited the L.A. storm drains with their giant ants. Ultimately, Basehart's character remains an enigma. We never learn that much about him. \"He Walked By Night\" isn't a great film, but it's an enjoyable look at postwar police work and primitive forensics.","user":"jimddddd","rank":[51,53]}]