[{"title":"The Jeff & Geena Trilogy","rating":28,"date":"28 April 2004","review":"Former real life Hollywood couple Jeff Goldblum &amp; Geena Davis made 3 films together, two of them comedies, one of them serious. The first film, also the film where they met, was the horror movie spoof \"Transylvania 6-5000\" (which I keep looking for but can't seem to find), in which Jeff played a reporter sent to Transylvania to follow a story with partner Ed Begley Jr. and Geena played a sex starved nymph who was convinced she was a vampire. The 2nd one they did and also the only serious one was the 1986 remake of \"The Fly\", in which Jeff played a good natured but lonely mad scientist who turned into a giant fly monster (that looked nothing like a fly and something more like a killer praying mantis) and Geena played his journalist lover. Then after boldly going where no Hollywood couple had ever gone before in said remake of \"The Fly\", they returned to light hearted comedy with our film here \"Earth Girls Are Easy\".<br><br>I've often theorized that the reason celebrity couples do films together is because it gives them a chance to spend time together and work together (seeing as how the hectic Hollywood schedule tends to keep people apart for long periods of time) and because studios can cash in on the respective fan bases of both stars. Well, for what it's worth this is a hell of a lot more fun to watch than most celebrity couple films.<br><br>Anyway, in this their third and final film together, Geena plays a beautiful but romantically unhappy manicurist Valley Girl who's doctor boyfriend Ted is cheating on her and Jeff plays the blue furred ringleader of three furry aliens, the other two being yellow furred Damon Wayans and pre-movie stardom red furred Jim Carrey (with his hair dyed blond!). Furry aliens Jeff, Jim and Damon crash land in Geena's pool the day after Geena discovers how unfaithful Ted's been and the sight of them understandably throws her for a loop. With their ship down for repairs the boys will have to stay with Geena and, doing her part for interplanetary relations, takes them to her ditzy manicurist cohort Candy (Julie Brown, who also helped write the film) to give the guys make overs so they can pass for Earthlings. Guess what? Geena eventually falls in love with Captain Jeff.<br><br>In an unrelated subplot that never quite went anywhere, Julie Brown's character fell for Jim Carrey's alien. Watching this back when it was made, who would have guessed that Jim Carrey would eventually go on to become one of Hollywood's biggest comedic stars and possess a career that would overshadow stars Jeff Goldblum and Geena Davis?<br><br>May not be brilliant comedy but like so many other comedies of the 80s this is still a reasonably funny, good natured romp with the cast making the most of it. Geena's easy to like and Jeff's a good straight man to the wild antics of Jim and Damon, who both appear to be having a good time as the nuttier aliens. I don't know why people keep saying bad things about Jeff's performance here, as his quirky style makes him an ideal alien stranger in a strange land and manages some of the film's best bits, like when he uses his \"love touch\" to get two cops stuck on each other. There's also a funny scene where Jeff offers to make love to Geena to make her feel better about herself and get her mind off her cheating boyfriend and she tries to explain that them making love might not work on account of the fact that he's not of the Earth so not everything may work the same way and the whole time he's undressing off camera and then she gets a look at him and his \"equipment\" and just sort of trails off. Of course, she has to make sure he doesn't get the impression that \"Earth Girls Are Easy\".<br><br>Bit of a shame that Jeff &amp; Geena's marriage didn't work out.<br><br>There are also some funny musical bits.<br><br>\"Mac is Mr. Right?\" - Jeff Goldblum as Mac","user":"DarthBill","rank":[47,50]},{"title":"Aliens Crash Land In Woman's Swimming Pool, Help Her With Failing Relationship. Story At 11.","rating":11,"date":"11 July 2004","review":"'Earth Girls are Easy' is a B-52's kind of style musical. Well, it's sort of a musical. It's sporadic musical numbers and dance acts that have to keep this movie plugging along. If you know the Julie Brown song, Earth Girls are Easy, then you know the story. <br><br>Clueless Valerie (Geena Davis) of the Valley discovers that her idiot fiancee, Ted (Charles Rocket), is cheating on her about the same time that some aliens crash land in her swimming pool. With Ted gone, she doesn't mind entertaining a few aliens (Jim Carey, Damon Wayans, and Jeff Godlbum) for a while. Actually, the results are pretty funny, since basically she tries to get them to assimilate to 80 Californian culture as she knows it. She first does by shaving off their hairy exterior so that they look like humans (of course). It sure doesn't occur to their blonde, braindead Valley Girl friends, that there is something wrong Wiploc, Zeebo, and Mac (especially considering that they repeat everything people tell them and don't say much else) so long as theyre good dancers, party animals, and good in bed, of course. In the course of everything, including her creepy fiancee trying to weasel his way back, Valerie falls in love with Mac (played by her then-husband, Jeff Goldbum). <br><br>It is an amusing little romantic comedy that seems to have taken some cues from Susan Sneideman's 'Making Mr. Right' which you might also enjoy if you like this movie, although that is not quite as funky in the B-52s sense of the word. Not that the B-52s had anything to do with this movie, either, but I think they are most closely associated with the style of comedy and atmosphere I'm referring to.<br><br>This is not a movie for everyone, obviously. Earth Girls are Easy is a funky 80s b-comedy recommended for real 80s fans, though it'll probably appeal more to us female audiences. Just waste your brain, wax your board, and pray for waves!","user":"vertigo_14","rank":[18,18]},{"title":"Jim Carrey was certainly showing his comic chops early on","rating":7,"date":"20 May 2005","review":"Everyone loves a good (or bad) alien movie, and \"Earth Girls Are Easy\" doesn't disappoint. Valerie (Geena Davis) is an every-woman in southern California whose life is turned upside down when three aliens, Mac (Jeff Goldblum), Wiploc (Jim Carrey) and Zeebo (Damon Wayans), land in her swimming pool. She quickly gets them made up to look human, but they continue acting like non-humans. She has to explain sex to Mac, while Wiploc and Zeebo are still wacky.<br><br>In a way, the whole movie is an excuse to be silly. But believe you me, they come up with some really funny stuff (Jim Carrey does a great James Dean impression). You'll wish that some aliens could land in your swimming pool, or wherever near your house.","user":"lee_eisenberg","rank":[24,27]}]