[{"title":"Looking for an original unedited version of this movie.","rating":7,"date":"7 January 2001","review":"I saw this movie originally when it was first released at the theaters. I again saw it later when it made it to cable, eg. HBO, Cinemax. ect. I loved the movie but then saw the edited version when it came to network. They cut out a lot of the adult humour. Examples: When Bette says \"Gee, you thought I was going to go in and pee on him.\" verses edited version \"Gee, you thought I was going to go in and spit on him\". Then the tobacco shop scene: Bette says: \"How about a blow job\" and then the edited version: \"How about a party\". Also several scenes cut from the edited version: Bette with Peter Coyote having sex in a chair, seen from behind the chair. The scene at the police station where Bette tells the cop needle dick, pencil dick, ect. when she is trying to make him get the picture. My point is that for some reason this edited version is the only one you can get on tape now. I bought one from Hastings music store and it was this edited version- 99-100 minutes version. Don't know why you can't get the original unedited version of this movie, my favourite comedy of all times.","user":"khucke","rank":[9,9]},{"title":"Cheesy but funny as hell.","rating":10,"date":"16 December 2004","review":"This is one of my favorite movies. It is a little cheesy, but that's what makes it really funny. Bettey Midler and Shelley Long are hilarious together.<br><br>One of the funniest scenes is where they are in the whorehouse looking for Their boyfriend. They put their ears to the door, and hear sexual noise coming from the first door. When they put their ears to the second door, they hear a goat. Finally, they recognize his \"Oh God, Oh God, Oooooh Yeeeeeeah!\" as he passes out.<br><br>There are many other hilarious scenes in this movie. If you're in the mood for a good laugh, you will not be disappointed in this movie.","user":"Elmware","rank":[11,12]},{"title":"enough laughs despite implausibility","rating":18,"date":"18 November 2000","review":"By the end of the 80's they were churning out countless male buddy pics, so why not a female one? This one features Midler when she used to make funny big budget movies and Long when she used to make movies period. Just like any buddy film, the two hate each other on first sight, Midler the foul-mouthed antagonist and Long as the goody two-shoes. Things are set in motion when the two discover they were \"boffing\" the same man (Coyote) and decide to find him when they realize his death was staged. They set out on an oddyssey across several states and end up fighting for their lives when he shows us he's not only a spy but somewhat psychotic! There's a great, if contrived, climax set atop skinny vertical rocks that are about 10 feet apart and 100 feet off the ground. But what you look for in these types of movies you find, well-written bickering that should make you giggle plenty of times. Though guys should look out, with this written by a woman, there's a large dose of on target man bashing. Pretty much Long and Midlers last best comedy offering.","user":"mcfly-31","rank":[11,12]}]