[{"title":"I've always liked it","rating":28,"date":"28 April 2003","review":"I know that I am in the minority here, but I've always really liked this movie. I fondly recall viewing it in the theater with my parents when i was 6 years old. Maybe I am blind when it comes to the film, but i don't see any major problems with it. It's not a perfect film, but it is quite enjoyable. Let me put it this way, there are many films out there which are much worse!<br><br>I think what i liked the most was the music score, that theme song was haunting to my ears and one of the few that stayed fresh in my mind for so many years. John Barry truly did a marvelous job on this one, and many other movie scores over the years as well. I wish i could find the original theme song on CD, or at least on MP3.","user":"Katatonia","rank":[38,42]},{"title":"I Liked This Movie","rating":14,"date":"14 March 2006","review":"I thought Klinton Splsbury was a good Lone Ranger and Michael Horse was a good Tonto.<br><br>The magic of this film, for me, is the first half, when we see how John Reid becomes the Lone Ranger.Also, a great scene where he finds a wild white horse, breaks him, and names him Silver. But a later scene just blew my mind away.<br><br>In that scene,after Reid and Tonto bury his brother and the other ambushed Texas Rangers, he decides to wear a mask so the bad guys won't recognize him. He tells Tonto the mask will be a symbol of justice. At this point, we have not yet seen his alter ego.<br><br>That changes when we see him from the back kneeling at his brother's grave and vowing to avenge his death. Then he puts his hat on, turns around, and as we see him in his mask for the first time, blaring trumpets sound out the start of the William Tell Overture. Being a Lone Ranger fan, this literally sent shivers down my spine.<br><br>The scene continues as they both ride away to more of the overture, and, of course, we hear \"Hi yo, Silver, away.\" <br><br>Breathtaking!","user":"sonny_1963","rank":[41,49]},{"title":"Where have all the heroes gone?","rating":5,"date":"5 May 1999","review":"The well-deserved negative comments about this beautifully-filmed fiasco have all but obscured one important good deed: the attempt to update the Lone Ranger on the wide screen, in all his majestic conservatism. Where the studio, in my mind, failed, was in treating the Ranger as \"someone we know.\" For anyone who grew up in the late '40's or early '50's, and remembers Brace Beemer's voice [one God would have envied], or even his predecessor's [Earle Graser], or remembers how naturally Clayton Moore assumed the role for television, the expensive exposure of Klinton Spilsbury was cruelly unnecessary.  Why trifle with the Masked Man's origins? He was perfect as we knew him! The Ranger, for all you out there in cyberspace, was NEVER named John; that his last name was Reid was well-known, but to give him a first name [and an unremarkable one at that], was to snatch away some of the mystery and aura surrounding the character. The Wrather Corporation, which bought the rights to the Lone Ranger from George W. Trendle, made this foolish mistake, and they robbed the Masked Man of any heroic pretense by making him, in essence, one of us. If someone bought the rights to the Superman character, changed his planet from Krypton to some other location, and did away with his earthly name of Clark Kent, can you imagine the reaction? The Wrather Corporation robbed themselves of a valuable property by re-tooling the Lone Ranger, and the result was this cinematic fiasco. It could have worked well, even without a \"name\" actor. The film was shot through with admirable creative strokes. Two come to mind. First, the racist attack on the young Tonto, second, the planned gang-rape of Amy Striker on the hijacked stagecoach, neither of which could have been broadcast nor televised in the '40's or '50's. Even the scene in the confessional could have proved a brilliant stroke [indeed, we saw it imitated in the 1998 \"The Mask of Zorro\" to wonderful effect]. The point is that it all could have worked! The sadistic ambush of the Texas Rangers at Bryant's Gap was realistic and moving, but could have been dealt with far more effectively by means of flashbacks. The film failed because the studio didn't care enough to probe the reasons for the Ranger's motivation [the superficial one of revenge for the massacre at Bryant's Gap wasn't enough] and Tonto's reasons for his remarkable and deeply humane devotion to his friend. A re-orchestration of the Republic and classical overtures would have heightened the film [as expensive as this might have been] from an ordinary Western into something else; a retelling of a classic myth and cultural icon. We Ranger fanatics are much the poorer because a rich corporation bought the rights to a character without understanding caring] about the emotional underpinnings of the legend. American audiences were ready for a \"modern\" Lone Ranger in 1981; I'm not certain that anyone cares anymore, and that's the tragedy.","user":"witch king","rank":[51,63]}]