[{"title":"Good low budget oddity, hard to find these days","rating":29,"date":"29 November 2003","review":"A weird and obscure little film from exploitation director Cimber, The Witch Who Came From The Sea gained a degree of notoriety some years ago when it appeared on the UK's controversial 'video nasties' list. With its prominent themes of child abuse and castration that's not surprising, even though in the event much of the objectionable material is fairly low-key. Mollie Perkins plays Millie, whose treatment at the hands of her father when young has left her emotionally scarred, even though she half-idolises his memory. At the time the film opens she is supporting two children, works in an \"advice centre\" (a bar) and is in an off/on relationship with the owner, Long John (Lonny Chapman). Soon two footballers are castrated and killed, while Millie enters into a obsessive relationship with McPeak (Stafford Morgan), a film star appearing in a frequently run shaving commercial on TV.<br><br>\nCimber's film is focussed on what is presumably Millie's downward spiral of mental collapse, and this is its biggest weakness. Haunted by a series of painful flashbacks (in which it becomes more and more clear exactly what was the nature of her traumatic childhood experience), Millie's inner torment is otherwise rarely articulated to the audience, although Perkins does her best to project some sympathy into the character. These days the two castration scenes, fake blood, cutaways (no pun intended) and all, are far less provoking to an audience than those of child abuse. In a modern production, typically issues would be 'dealt with' from a psychological standpoint. She remains curiously mute however, and we miss the catharsis. \"Millie's the captain of her own ship,\" says Long John, who recognises this distant quality of his employee/lover - one who, even in bed with him, cannot confide her sexual history. But while keeping her own confidence may suggest inner strength, this woman who 'looks liberated' is ultimately as much a mystery as when we first see her. <br><br>Without any internal keys to Millie's psychology, apart from her murderous compulsions, the audience is forced to look for answers elsewhere. Fortunately the film is full of enough symbolism, Freudian and otherwise to give ample hints, considerably enriching the narrative and providing its principal interest. 'The witch' in question does not refer to supposed supernatural skills of the heroine. Millie is human and emotionally damaged. Much is suggested when she admires a reproduction hanging on the wall of a lecherous male admirer. Botticelli's well-known Birth of Venus features a female figure standing on a shell, incidentally reminiscent of the mermaid tattooed on her father's chest. (Millie shortly thereafter has a copy done on her belly.) Venus' \"father was a god\" we learn, and \"they cut off his balls, the sea got knocked up, and Venus was the kid.\" The Botticelli neatly encapsulates the themes of consummation and emasculation running through the film. It's the tension between the two that ultimately wrecks Millie, ruinously torn between admiration of her father and knowledge of what men can do. <br><br>Castration of course is an obvious form of unmanning, as demonstrated by Millie's treatment of the footballers, then McPeak (the second instance achieved, remarkably, through the misuse of a safety razor). Her first lover, the aptly named 'Long John', has a beard. He and it remain thankfully intact at the end of the film. In Cimber's film, shaving is associated explicitly both with sex (\"Someday I'd love to shave you.\") as well as with explicit genital injury. Like a peculiar Delilah to various Samsons, Millie quickly reduces men by her barbering attentions, destroying their vitality, and thence their threat to her. Her fantasises run along the same lines from the very first. The viewer initially sees Millie on the beach, reassuring her children about their grandfather's heroic status, while absent-mindedly staring at bodybuilders working out - in effect going from groyne to groin. We assume that her fixation on their bulging swim shorts is straightforwardly sexual. Only later do we realise that crotches are targets in more ways than one. <br><br>All of the performances are adequate, though none are outstanding. In the central role Mollie Perkins, despite the aforementioned drawbacks of her part, gives a reasonable impression of a divided and damaged personality, emotionally numbed by her own demons. During one key scene, the murder of the football players that features drug abuse, bondage then castration, she looks remarkably unfazed by the material - assisted by the nightmarish feel created by Cimber's direction. Perkins had come to this film after appearing in some Monte Hellman films, notably his outstanding existential westerns Ride The Whirlwind and The Shooting (both 1965), and perhaps felt that more such off-the-wall material suited her style. Certainly after this period in her career she was unable to find such striking material again. (Cimber's next film was with Orson Welles in the Pia Zadora turkey Butterfly, 1982)<br><br>\nThe Witch Who Came From The Sea has a quiet ending, but one that is nevertheless apt and poetically very effective. Scriptwriter Robert Thom (whose previous two credits were for the classic B-movies Crazy Mama and Death Race 2000, both in the previous year) builds on the seafaring imagery already featured throughout the film to send his heroine on a last voyage of her own. Millie's departure, in the bosom of her family and friends, is far away from the Grand Guignol conclusion common to the genre. It is as if formal justice has no part to play in a sad tale, which revolves almost entirely around the wounding of the psyche, and in line with this, the police investigation during the film is remarkably muted, and un-cynical. Remarkably hard to find these days, presumably because of its downbeat subject matter, this is a film that still holds up well. A stronger supporting cast would have made it into a mini-classic. As it is, it still serves as a reminder of the imagination possible from a low budget film, a novelty from a period rich in bargain basement experiment.","user":"FilmFlaneur","rank":[37,40]},{"title":"Plays like a lost and degraded artifact of horror/art-house cinema","rating":21,"date":"21 May 2011","review":"Molly (Millie Perkins) is a girl who is haunted by a childhood of sexual abuse at the hands of her now dead father. These images are however, repressed by her, and she constructs a fantasy world where he did in fact die at sea - as he was an explorer of the sea. This we later find out is drawn from the euphemistic term Molly's father used to describe the abuse: \"Molly, lets get lost at sea\".<br><br>This fantasy that Molly creates is also perpetuated in sequences that almost appear as if they are happening only in her broken mind. After seeing a couple of professional footballers on the TV (she describes them - and other men - as beautiful creatures to her two nephews), she seems to drift into a day-dream in which she ties the two up to a bed, in a pre-empted plan for sexual endeavour, but she proceeds to cut the penis off of one with a razor blade. As we later discover, these two footballers actually died. Whilst we are certain as an audience that Molly surely did this act, we seem to have no hard evidence of this. Is Molly simply imagining this?<br><br>The film is punctuated with short, and increasingly graphic depictions of Molly's rape as a child by her father. These haunting sequences are exacerbated by the increasing volume and amount of perpetual seagull noises filtered through an echo effect. As these moments become more frequent, we find out that Molly's father died of a heart attack during an attack on her. So in Molly's own mind, as her father died during this act - an act he has a euphemistic phrase for - did indeed die at sea.<br><br>Molly floats somnambulistically through the majority of this film. She seems almost not to be aware of the events that she is involved in. We seem to follow this path too. But we are also aware of her increasing breakdown. She becomes more erratic and confused about the people around her. She seems obsessed with television, and its ability to display the most beautiful people.<br><br>This is no masterpiece, not by a long shot. But it is an interesting piece of cinema. Director Matt Cimber (who has made no other work of significance) unfolds the rapid mental breakdown with a little bit of style. The production values aren't the best, but they are suitable for the content. I did enjoy its mix of seeming supernatural and grindhouse- style elements. It almost plays like a lost and degraded artifact of horror/art-house cinema.<br><br>This film bizarrely made it onto the UK's video nasties list (or at least the DPP list), where I can only assume was clustered with the more horrific films (such as 1972's Last House on the Left, 1977's I Spit on Your Grave) due to it's quite intense, but never graphic depictions of male castration.<br><br>www.the-wrath-of-blog.blogspot.com","user":"tomgillespie2002","rank":[7,7]},{"title":"Unique, surreal and disturbing, but exploitative","rating":8,"date":"16 April 2000","review":"This one's a real weirdie. It's unique, surreal and genuinely disturbing, and Millie Perkins gives a memorably intense and bizarre performance as Molly. It goes out of its way to shock the viewer, and largely succeeds. It also features the single most upsetting childhood trauma flashback I've ever seen.<br><br>It's probably too much for most people's tastes, but if you enjoy flawed one-of-a-kind low budget '70s horror, it's worth a look if you can find it. I am a bit dubious about the exploitative way it uses the subject of child abuse device to shock and disturb the viewer, so be warned.","user":"pearceduncan","rank":[19,25]}]