[{"title":"Excellent epic","rating":10,"date":"16 December 2012","review":"This is one of the best epic super-productions of all time, with a beautiful cinematography, a majestic score and a solid and dynamic direction. <br><br>Still many people have put it down as a folly with no real depth or substance, and others for its historical inaccuracy. Yes, it is not one hundred per cent historically accurate, but then, how much do we really know about an 11th century warrior when very few written documents of the era survive today? We only have a few of the old cantigas (poems to be sung) and the Poema de Mio Cid at the Spanish national archives. <br><br>Many Spaniards tend to put this great film down only because it was made by a bunch of American and Italian \"philistines\" with no knowledge of the legend at all but for the only purpose of creating an epic to rival with \"Ben-Hur\" and \"Spartacus\". That is a childish way to see it. <br><br>At least we should be grateful that someone came up and took the challenge of making such a film in the first place. That man was Samuel Bronston. <br><br>This self-made movie mogul not only had the confidence and charm to persuade other people to lend him huge sums of money but he also got Franco's ultra-Catholic fascist regime to approve the making of a film about their national hero where the main character was to be played by a foreigner who was also a Protestant. Of course, Bronston succeeded easily through bribery in a corrupt country, as well as through the willingness of Franco to allow American business to settle in Spain and help revive its obsolete economy. Franco would use \"El Cid\" to promote Spain around the world as a touristic destination during the Sixties. <br><br>Bronston wanted to make an unique epic, a high quality production with sheer spectacle and credited with some historical veracity. So he hired the best people he could think of: cinematographer Robert Krasker, who used the radical and innovative Technirama70 format that magnified the endless open spaces of the Spanish plateaus, Miklos Rozsa for the score -his last great triumph, which should have won him another Oscar- and Anthony Mann, who had cut his teeth making Westerns with James Stewart. Finally, as technical adviser Bronston hired the illustrious Spanish scholar Ramon Menendez Pidal, the greatest living authority on El Cid at that time. Don Ramon was also of great assistance to Rozsa during the composer's careful and thorough research on Spanish medieval music. Rozsa visited the libraries and archives of old monasteries and was given special access to documents dating back to the 13th and 14th centuries. Not many film composers would have gone through such painstaking research work, but Rozsa was a perfectionist and probably the greatest composer of all. <br><br>When we think of the leading male stars in Hollywood at that time, Heston had become world famous and highly bankable after the huge success of \"Ben-Hur\" and the Oscar it won him. So he was the ideal man for the role. <br><br>Bronston wanted Loren because of her fast-growing popularity, as well as by the the fact that hiring her would please the Italian investors and that would mean more money into the budget. Then enter the British, and what a fine supporting cast they are: the smoky-voiced Genevieve Page as Urraca(it is the Spanish word for jackdaw, by the way) who always reminds me of Lauren Bacall; the gentlemanly and self-composed Michael Hordern as Rodrigo's father, the handsome blue-eyed John Fraser as the arrogant but vulnerable prince Alfonso, Gary Raymond as prince Sancho, Douglas Wilmer as Rodrigo's Arab ally, and finally the recently deceased, excellent Czeck-born character actor Herbert Lom as the black-clad villain, a role initially offered to Orson Welles and who turned it down when he learnt that audiences wouldn't see his masked face. The great Orson needed the money very much to finance his own projects, but sometimes his ego was bigger than him. <br><br>\"El Cid\" was a huge box-office hit all around the world and made Bronston a very rich man. The profits of the film were used to start preparing \"The Fall of the Roman Empire\", but then the refusal of Heston to work again with Loren -they detested each other- set in motion the snowball that would sweep the Bronston empire. Although three more epics were made: the exotic and spectacular \"55 Days at Peking\", the splendid but failed \"The Fall of the Roman Empire\" that bankrupted Bronston, and the minor and much cheaper \"The Magnificent Showman\", which was his swansong, he never again reached the heights of greatness and success he had reached with \"El Cid\". <br><br>And then think that the tournaments and battles you see here were staged for real, with real armours, swords, catapults and everything, and thousands of people taking part -entire companies of the Spanish army and entire villages of civilians were hired as extras. Today you will never get that in a film: too costly and too complicate to coordinate. And of course, all of the Health and Safety rubbish laws that there are nowadays... If you play knights of the Round Table you can cut yourself, mind you. So enter CGI.<br><br>But at least we have \"El Cid\" in all its glory. <br><br>And please, let them not make a remake! Let them not destroy the old magic and beauty of cinema.","user":"Rueiro","rank":[23,23]},{"title":"Heston embodies a mythical figure of legendary proportions","rating":9,"date":"30 March 2008","review":"Aroused by a fanatical Moorish warlord, emir-king attack a Castilian village, where they are captured by Rodrigo Diaz de Vivar <br><br>Vigorously brave and compassionate, the noble Rodrigo hates bloodshed and vows to see his country at peace, frees the prisoners on their solemn pledge never again to attack Castile <br><br>For this act of courage and mercy, one of the Emirs, Moutamin, calls Rodrigo \"El Cid,\" and pledges eternal friendship to the Cid of Vivar And so, in freeing the Moors, Rodrigo, accidentally, stumbled onto a battle, not to his luscious bride, but to a battle that will change his whole life <br><br>In the court of King Ferdinand, Rodrigo's act of clemency is misinterpreted, and he's accused of treason by his rival Don Ordonez for refusing to turn over to him the captures Moors <br><br>Unfortunately, Rodrigo's aged father, Don Diego, is slapped by the Champion of the king, Count Gormaz, father of his beloved Chimene Rodrigo begs Gormaz an apology; it is refused A duel begins and the champion is badly wounded Before he dies, however, he asks Chimene to avenge his death <br><br>Chimene's wish is fulfilled when King Ramiro of Aragon challenges King Ferdinand for the possession of the city of Calahorra by the outcome of a single combatEl Cid convinces the king to permit him to fight Don MartinThus, according to the custom of trial by combat, God would judge Rodrigo's guilt or innocence <br><br>\"El Cid\" is an intense film, lavish and spectacular, bigger than any in terms of cast and impressive as any in visual terms Miklós Rózsa gave a new dimension to the emotion that Anthony Mann was trying to express <br><br>Mann gives us a human story with a love story balanced with the most strongly image of a hero the world has ever seen He presented a man of honor who thinks always of his wife, his country, and his king first Even in death, his thoughts are for others and not himself <br><br>El Cid insults kings and noblemen in the name of justice and integrity and does what he knows to be right He battles the king's living sword in respect of his father He accepts the challenge of a champion of a king to prove himself innocent of treason and other things He shows a prince how any man can kill and only a king can give life He fights 13 knights, at the same time, to free a prisoner Yet he is in addition to all of this an extremely principled leader He accepts exile for life from the country he loves, and yet he is the only man in Spain who 'could humble a king and would give a leper to drink from his own pouch' <br><br>The joust sequence called \"The fight for Calahorra,\" is perhaps the most rousing, exciting, one-to-one combat ever filmed The battle scenes at Valencia are taken on an epic scale But the value of Anthony Mann's movie is the characterization in which Charlton Heston played El Cid's life For this reason alone, the film is of greater value than most any other motion picture experience","user":"Nazi_Fighter_David","rank":[42,48]},{"title":"Grim, Ponderous, Moving, Magnificent","rating":30,"date":"30 April 2004","review":"Grim, Ponderous, Moving, Magnificent<br><br>I'm a girl and have a girl's taste in movies. If I'm going to watch a movie with a lot of sword fights, oppressed peasants, and corrupt kings, I want it to be a swashbuckler, preferably one starring Errol Flynn. Swashbucklers bring a lot of humor to otherwise unbearable dramatic situations.<br><br>\"El Cid\" presents unbearable dramatic situations, and it is not a laugh riot. I saw the three-hour plus, uncut version and never felt tempted to laugh once. This is the Middle Ages without Monty Python, without the levity of an Errol Flynn - Olivia De Haviland romance or comic relief of a Little John.<br><br>Boy oh boy was this grim. And long. You could have almost filmed the entire film with three colors: white, black, and red. Lots of red.<br><br>\nBut \"El Cid\" did to me what it wanted to do. I really believed in Rodrigo and Jimena as star-crossed, larger-than-life lovers. I really believed that the little girl who leads them from her well to her farm house lived a thousand years ago. I really believed that something like the mouth of hell itself was opening up as Ben Yusef invaded. I really believed in Rodrigo's relentless nobility and heroism. Neither Charlton Heston's strangely artificial looking hair nor the obvious non-Arab status of a couple of the \"Moors\" (Douglas Wilmer, who later played Sherlock Holmes, was one especially unconvincing Arab) interfered with my willing suspension of disbelief. I cried. Several times.<br><br>There's a lot to cry about. In almost every scene, someone is either crying, usually Sophia Loren, or gritting his teeth, often Charlton Heston, but others grit their teeth a lot, also. Actually Loren doesn't so much cry, but, rather, huge, luminous tears quiver, poised, on her lower eyelid. In her final scenes, the teardrop dancing on her right eyelid is so huge, black and luminous it begins to look like a second pupil. <br><br>If the sound of horse hoof-beats does something for you, you will love this movie. There are many horses. Many, many, many. And they are always thundering off to somewhere, more often than not, over cobblestones. Lots of horse hoof-beats on this soundtrack. <br><br>Some viewers found the plot hard to understand; they, perhaps, saw the cut version. Having seen the uncut version, I found the plot entirely comprehensible. <br><br>\"El Cid\" is like a ballad. There is one grim face-off after another, escalating in gravity, in which the hero proves that he is growing into his own heroism, through every choice he makes. Each choice is harder than the last one, until his final choice, which is truly impossible, but which he fulfills anyway. If you like medieval ballads, you may love this movie. It has the same grim beauty and power and inexorability, the same insistence on throwing whatever is divine in naked human character up against the impossible demands of earthly life. <br><br>For such a long movie, there is scant dialogue. With few words, people prove their true character through their actions, just as characters in ancient epics did.<br><br>One viewer complained that this movie bore no relation to the \"real\" El Cid legend. If that is true, the movie is all the more remarkable. The filmmakers managed to create, from scratch, a convincing and moving medieval narrative.","user":"Danusha_Goska","rank":[72,95]}]