[{"title":"\"Sono tornato!\". Excellent Giuliano Gemma","rating":7,"date":"7 April 2006","review":"The director Duccio Tessari, who began his career as a sword and sandal movie maker, made his second western \"Il Ritorno di Ringo\" with a crew almost identical to that of his first western \"Una Pistola per Ringo\". But I personally prefer this \"Ritorno\" definitely to \"Una Pistola\": While the style of \"Una Pistola\" was still very similar to sword and sandal movies, and therefore didn't appeal to me especially, in \"Ritorno\" one sees a new style clearly differs from sandal movies: a high wind blows sands and hay through a town, the pictures , and the sore as well, are more melancholy and gloomy.<br><br>Tessari nevertheless doesn't hide his 'sword and sandal origin': the plot was taken from the last part of Homor's Odyssey, and in fact he well succeeded in transferring the Greek legend into a western. No wonder, as who could better treat Greco-Roman Classics than educated Italians? Giuliano Gemma in this movie is excellent. I cannot imagine how an other spaghetti western star would play the role of Ringo, while Ringo of \"Una Pistola\" could be, I think, played by anyone other (for example George Hilton or Terence Hill?).<br><br>And please let me give a tip for male viewers: If you wished to enjoy spaghetti westerns together with your wife, your girlfriend or your daughter, please begin with Gemma's westerns. She would like him. Actually Gemma was so popular with Japanese girls in the 60s/70s as Leonardo DiCaprio now. I know very well, because I myself was one of those girls at that time.","user":"aliaselias","rank":[12,12]},{"title":"an excellent euro-western","rating":9,"date":"9 December 2007","review":"This movie is the follow-up to \"A Pistol For Ringo\"(Una Pistola per Ringo), but it is not a sequel. All of the main actors return for this story, but they play completely different characters, and while Giuliano Gemma portrays another character called Ringo, this protagonist has nothing in common with the first \"Ringo.\" It may seem unusual to those who haven't watched a lot of these movies, but that kind of thing is quite common in the spaghetti western genre.<br><br>This Ringo is not an outlaw like the one in the previous movie, yet he is much more serious and deadly, because he has been wronged on a very personal level, and is seeking justice and revenge. This gives the movie a much more somber tone than the previous film. It's a gripping story without a single boring moment.<br><br>All of the main actors are at the top of their game in this one. Antonio Casas is especially good as the dysfunctional sheriff who pulls himself together with the help of Ringo. Giuliano Gemma is even better in this movie than in the previous film, and I can't say enough about Nieves Navarro. Not only does she do a wonderful job portraying \"Rosita,\" she looks even more incredible in this film than in the last one, which is a feat I would not have thought possible. She is quite possibly the most amazingly beautiful woman to ever appear in a western.<br><br>Morricone's music score is also an improvement over the one he wrote for the first Ringo movie. There is more music in this film, and the tunes are more memorable. I especially like the theme song.<br><br>Although \"A Pistol For Ringo\" wasn't bad, it was apparently just a warm-up for the filming of this movie, because \"The Return of Ringo\" is a much better film on all levels. It's not completely without flaws, but the imperfections here just add to the movie's charm and appeal. I consider this one to be a must-see for spaghetti western fans.","user":"spider89119","rank":[9,10]},{"title":"Fearless Men!","rating":8,"date":"17 September 2017","review":"Il ritorno di Ringo (The Return of Ringo) is directed by Duccio Tessari and Tessari co-writes the screenplay with Fernando Di Leo. It stars Giuliano Gemma, Fernando Sancho, Hally Hammond, Nieves Navarro, Antonio Casas, George Martin and Manuel Muniz. Music is by Ennio Morricone and cinematography by Francisco Marin.<br><br>After fighting in the American Civil War, Ringo (Gemma) returns to his home town of Mimbres to pick up his life from pre the conflict. However, he finds the town is in the grip of Mexican bandits run by brothers Paco (Martin) and Esteban Fuentes (Sancho), their control over things extending to Ringo's wife, Helen (Hammond)...<br><br>No Entry For Dogs, Gringos And Beggars. <br><br>A sequel of sorts to A Pistol for Ringo (1965), with the same makers, cast, locations etc reconvening for a different story and scenarios, this ranks as one of the better follow up movies going. After a wonderfully sang title song opens up proceedings and we get introduced to Ringo (officially Montgomery Brown) via a bit of gun play and story setting, pic quickly identifies itself as a mournful revenge and rescue piece. We are deftly placed on the side of the protagonist, rooting for him to claim back his life and in the process rescuing his loved ones and vanquishing the whole town from racist bloody tyranny. It's a classic Western tale told with style at a suitably unhurried pace, the characters are formed because they get time to breathe, all relevant to the journey and the final destination that Tessari is taking us to.<br><br>I've come back Paco Fuentes!<br><br>With Sancho and Martin delightfully vile as the villains, it falls to Gemma to turn in a good one as our hero, and so it is. Ringo is a great character as written, his world turned upside down, and he has been funeralized as well! Ringo gets beaten, stabbed and emotionally battered, but he fights with guts and cunning. He is really cool as well, during adversity he can climb a rope one handed, cock his rifle the same, he is even prone to free falling from rooftops to enact skillful kill shots. For sure this is a Spaghetti Western hero for the ages. The natural beauty in the tale is obviously in the form of Hammond (socko gorgeous) and Navarro (socko sexy), these both dovetail nicely with the more grungy aspects of story and character actions and moral standards. While the makers enjoy filling the play with colourful support characters, such as a camp florist, alcoholic sheriff and a fortune telling whore.<br><br>Tech credits are very high. Tessari has a superb eye for a telling eye catching scene or sequence, cue Ringo doing a slow walk down the street, his form transformed via a number of coloured glass windows, scenes such as the way Ringo and Helen's initial recognition is lighted for ultimate worth, Ringo rapid fire with bandaged arm as a rest, strategic motifs like a knife thrown in a heart drawn on a tree, and of course the justifiably famous scene of Ringo in a doorway with dust storm raging around him, a scene that's as chilling as it is thrilling. Stunt work is great as well, in a sub- genre of film known for its exaggerations, it's pleasing to see so many falls enacted with genuine believability, none more so than for the exhilarating last quarter of film. This last quarter brings our hero into his pomp, all while bodies and buildings are way laid by bullets (get that wicked Butterfly monikered artillery repeater!), an action prelude to the final outcome that we want, in fact demand!<br><br>Then finally there's Morricone, whose score is one of his non Leone best. It's a swirl of emotions, darting in and around the main character, occasionally rising to thunderclap status for key dramatic scenes, with a music box tie-in that's heart achingly effective. Morricone's work is the cherry on the cake, for this is a superb Spaghetti Western of blood, brains and balls, and worth seeking out by anyone interested in the better half of this mixed sub-genre of film. 8.5/10","user":"hitchcockthelegend","rank":[5,5]}]