[{"title":"To Define True Madness, What Is't But To Be Nothing Else But Mad?","rating":2,"date":"2 November 2004","review":"I'd put off viewing this version of \"Hamlet\" for a long time, because I'd heard that they'd turned this most cerebral of plays into an \"action movie\", but I ended up quite liking it.<br><br>I should begin by saying that I approve of ALL interpretations, because each choice reflects different possibilities all of which are supportable by the text; no one vision can encompass every potentiality inherent in the play. And the text per se, of course, will always exist in absolute form despite the number of hands that manipulate it.<br><br>All productions (except Branagh's) cut certain elements as a sacrifice to tighter (though narrower) focus. And the use of film rather than stage allows (even necessitates) different types of dramatic development. Films unfold at a different pace than stage plays. Zefirelli's adaptations WORK as film-making, without detracting from (or unnecessarily supplementing) Shakespeare's language. For instance, the little \"prologue\" scene showing the internment of the dead king. It is original to the movie, and yet the dialogue is still from the play; it doesn't misrepresent anything about the characters in its new context. And perhaps most importantly, it \"works\" in the movie that the director is making. But on to the substantive comment...<br><br>Mel Gibson was, in my opinion, too old to be Hamlet (making Glenn Close, by extension, too young to be Gertrude), but the issue of Hamlet's age has always been a problem. He's 30 in the text (this version leaves out that calculation), but that makes some of his relationships (with Ophelia, for instance) seem a little... immature. And yet if he's portrayed too young, his depth of thought is almost impossibly precocious. But I thought he was convincing nonetheless, particularly in expressing something that I've found central to my understanding of the play but I all too rarely see dealt with in Hamlet's portrayal, which is this:<br><br>Hamlet IS quite mad. 'Tis true: 'tis true 'tis pity, and pity 'tis 'tis true. From his first meeting with the ghost onwards, he is profoundly disturbed. It is irony that he then puts an 'antic disposition' on, because he has in actuality gone quite 'round the bend.<br><br>Mel Gibson not only gives the first convincing portrayal of Hamlet's \"pretended\" madness that I've seen, but he also shows us the desperation of the character in his quiet moments. Hamlet is not, as Olivier posited in his 1948 version, merely \"a man who could not make up his mind.\" Gibson's Hamlet spends much of the film alternating between mania-induced impulsiveness and paralyzing inability to act. The Dane is not merely melancholy, he is certifiably manic-depressive. (Claudius, I believe, sees this.)<br><br>Over all, I believe that this would be a good introduction to the story of Hamlet for those who otherwise would have had no contact with it, although as I said it can then be supplemented by other adaptations (and of course there's no substitute for, ultimately, reading the text).","user":"PseudoFritz","rank":[76,87]},{"title":"A genius adaptation","rating":16,"date":"16 April 1999","review":"Zeferelli, although cut some seemingly vital parts to the play, made it his own, and created a beautiful tribute to Shakespeare. I am sure if the Bard had a camera, he would have filmed and wrote the screenplay somewhat the same.<br><br>Mel Gibson has portrayed Hamlet in the most true-to-human nature as anyone ever has. His brooding and depressing personality is realistic. Gibson doesn't allow the madness to overcome him. He is passionate, powerful and the epitome of the son who has gone through hell over his father's death and incestuous marriage of his mother. His performance brings tears to my eyes.<br><br>Glenn Close is amazing; her motherly attitude and sincerity toward Hamlet is so much that one sometimes cannot feel anger towards her. Close gives life to Gertrude that no one has been able to before or after. She is a real character, with traits both despicable and kind.<br><br>The other performances are astounding, especially when it comes to Helena Bonham-Carter's moment of lunacy in Ophelia. Her reaction to her father's death is so convincing and terribly sad that I cry at merely seeing her.<br><br>The interpretation of the story is a perfect one that required surely a great amount of thought and reading of the very play. Zeferelli interprets it so well, that it flows like real life. Every aspect comes together to form a very real event.<br><br>Zeferelli is a master filmmaker, and I highly suggest this film to anyone who has ever marveled at the human spirit portrayed through film, and literature as well.","user":"CitizenKane","rank":[52,63]},{"title":"I love this Hamlet!","rating":9,"date":"26 October 2007","review":"This film was my first introduction to the story of Hamlet, and though condensed and simplified it did a magnificent job. I was only 11, but it made me fall madly in love with Hamlet. After reading it, it quickly became my favorite Shakespeare play. I love how clear and defined the film is, while still having the essence of Shakespeare's intent. The acting is so intense, yet believable. I love the interpretation of the era, and how the delivery of the lines made them so easy to grasp without losing the authenticity. The play is really long and repetitive, so I think this movie did a fantastic job of really getting the meat. In some other Shakespeare film adaptations I've seen the lines are stale and rehearsed, and it really shocks me that someone could accuse these actors of being out of touch with the dialog. I found it to be quite the opposite. So many of the scenes are just so juicy. They really capture the story's power and depth. Plus, I'm really into that period, so I found it difficult to get into Branagh's film, no matter how good it was, *and* I really can't stand to watch Kenneth Branaugh. He really irritates me because I feel like he uses this same set of annoying expressions for every couple phrases. Huge apologies to all those out there who worship him. It's just how I feel. This version is just more my cup of tea in so many ways.","user":"denniswalsh","rank":[22,25]}]