[{"title":"A victim of mistaken expectations","rating":24,"date":"24 August 2004","review":"It is such a major tragedy that one of the greatest directors in the history of film, David Lean was so savaged by the critics after pouring vast stores of time, energy and devotion into this production.  It has long been clear to me why \"Ryan's Daughter\" was so poorly received.  After Lean's previous epics, everyone was certain that, with all the time and money that went into this film, and with its lengthy running time, it would simply have to be a similar type of show.  When people bring such expectations to a movie and are confronted with something so daringly different, they often focus on what they didn't see and miss the virtue of the picture they saw.  This film is too \"slow\", too absorbed with the subtle dynamics of the interaction between its characters for a viewer who is burning to see vast battle scenes, mighty parades and mobs of extras caught up in violent historical struggles.  The \"spectacle\" in this film (and spectacle it is indeed) comes from the exquisite widescreen lensing of stunning Irish coastal scenery. The fabulous storm sequence with villagers battling raging surf in their efforts to retrieve floating contraband is, in my opinion, unmatched in all the thousands of movies I have seen.  The drama of the central characters' lives and the depiction of the way the eternal conflicts that continue to trouble their nation work to destroy normal existence for them....this all works for me.  I guess there are going to be many who just can't buy into the whole thing, but I can only feel sorry for them.  To me, Lean did create an epic here, but not the traditional kind that everyone came to see.  It is a \"feast-for-the-eyes\", intimate epic of the tumultuous emotional life of a little village caught in a swirl of hatred, suspicion, prejudice and seething conflict with an occupying army.  One of my dearest hopes is that I may live to see a handsome DVD release of this splendid masterpiece before too much more time elapses. It should NEVER be viewed in some pan-and-scan edition on an ordinary TV!  Seen this way with all that glorious cinematography cropped and miniaturized, \"Ryan's Daughter\" could indeed be seen as a failure.  I always wonder how many magnificent David Lean films we will never see as a result of the unproductive years that resulted from the crushing effect on the director of the widespread rejection of this wonderful creation.  What a travesty!","user":"david-greene5","rank":[155,164]},{"title":"Lean's most underrated film","rating":30,"date":"30 September 2006","review":"It's not hard to see why the critics disliked Ryan's Daughter so much. Films like Midnight Cowboy and Easy Rider had come along and made lots of money and won lots of plaudits. Therefore Ryan's Daughter, a three-hour, 70mm epic must have seemed like something of a fossil  it certainly wasn't hip or trendy. But while Midnight Cowboy and Easy Rider have dated pretty badly, Ryan's Daughter seems timeless.<br><br>That's not to say that Ryan's Daughter is without its faults. The story is wafer-thin, some of the writing (surprisingly for Robert Bolt) is lacklustre and the film runs out of steam before the end. But I'm more than able to forgive the film its faults, as it contains some wonderful scenes and some of the best visuals in cinema.<br><br>My fondness for Lean's much maligned film is secured in the first few frames. In a long wide shot we see a cliff with a microscopic figure running towards the edge. Then we see the film's heroine, Rosy Ryan (Sarah Miles), chasing a black umbrella that is floating down towards the sea. It's a breathtaking start with some of the best photography committed to film  the skies, in particular, are gorgeous.<br><br>And it's the start of the film that I enjoy the most. At the beginning the film is quite light and it has lots of energy. It also presents you with a central character who is full of hope for the future  I like the way Rosy, skipping along to Maurice Jarre's magnificent score, tosses her trashy romantic book into the sea, thinking that she wont have to live vicariously through other people anymore. And then when this is cut against Charles (Robert Mitchum) arriving on the outskirts of the village by bus, you realise what everything means  Rosy's white knight is arriving.<br><br>But the film doesn't stay light and breezy for long. In fact, things go downhill on the wedding night  after expecting great things from her husband and this curious piece of human behaviour called sex, Rosy only gets a minute or so of love from Charles. It's not like it is in the books she read.<br><br>After this you're introduced to Major Doryan (Christopher Jones), a shell-shocked English soldier who's been sent to Ireland. Right from the first moment you know he and Rosy are going to get involved. Therefore it's a good decision on Lean's part not to delay the inevitable. And I think the scene in the pub where Rosy and the Major meet and begin their affair is easily the best in the film, and certainly one of my favourites in cinema. It's just so imaginatively done. The photography, the editing and the scoring are perfect.<br><br>I also like Rosy and the Major's first sexual encounter. It's done without any dialogue (well, until Rosy has come twice) and again it's impeccably shot. And although I'm sure all the critics scoffed at the nature shots, Lean makes it work. And Lean makes it work because he was a genuine romantic. I mean, the reason why the vast majority of romantic films are risible are because they're not sincere  they feel incredibly cynical. But Lean can film a sex scene with shots of forest canopies and not make it laughable. But the scene also works because of Miles' superb acting. Her face captures all the trepidation and excitement that such an encounter would inspire.<br><br>It's actually criminal that Miles didn't win an Oscar for her performance (she was nominated). She makes Rosy, a woman who is cheating on her good-natured husband, both despicable and understandable  it's to Miles' credit that she isn't afraid to show Rosy's ugly side; sometimes she's a petulant brat.<br><br>And I also think that Mitchum's performance is underrated. He makes a dull character interesting. But I think it helps if you're familiar with Mitchum's work. I mean, it's strange to see the original Max Cady play a cuckold. And it's even stranger to see him last seconds in the sack and get beaten up.<br><br>And although his performance gets a lot of stick, I think Christopher Jones is fine in the film. He certainly looks the part. And although a lot of his dialogue had to be cut because the man was a mess on set, it actually works for the character. I mean, with hardly any dialogue it make his romance with Rosy a lot less banal  it gives it a bit mystery. Plus, what would an English officer and a poor Irish schoolteacher's wife have to talk about? The relationship makes much more sense as a sexual one  Rosy may love her husband but the Major gives her what she's missing.<br><br>Another refreshing element of Ryan's Daughter is the portrayal of the English and the Irish. All too often in any film set in Ireland, the locals are universally pure hearted while the English are universally loathsome. Here you have small-minded Irish peasants and English soldiers who are just doing their job. You also have an IRA that kills police officers in cold blood. Yeah, the film may be simplistic, but at least it doesn't have a sentimental, misty-eyed view of the common man.<br><br>And how can I talk about Ryan's Daughter and not mention the storm sequence? It's quite a remarkable piece of film and again it features some breathtaking photography  there's one shot where the waves crashing against the cliff seem to be blown backwards and another where the spray is sucked upwards into the sky. Anyone with a pair of eyes should enjoy it.<br><br>However, as much as I love the film, I do think it splutters towards its conclusion. I certainly don't mind it being three hours long, but the film does seem to run out of ideas towards the end. But that's only a minor complaint. On the whole, I think the film's fantastic.","user":"Ricky_Roma__","rank":[23,23]},{"title":"Human longing for life, bare and simple on the screen","rating":16,"date":"16 December 1999","review":"I love this movie. Saw it again last night on the big, wide screen at the Astor, from a beautiful new print. There is much to deserve love: the artistry of the film making; unspeakably fine cinematography; superb use of music and sound (hearing nothing but the wind in the trees during the forest scene is breathlessly sensual); and major and minor characters who each in their own way reflect the eternal enigma of human longing for life and transcendence. The film's evocation of human lives caught up in the inexorable forces of nature and history at this particular moment and place is profoundly arresting. There's a timelessness about this movie which makes the criticisms I've heard - about miscasting, stiff acting and the like - melt away into irrelevance, or even shows them to be virtues. I love the way the film maintains narrative integrity but has a foreordained, mythical quality as well: the overwhelming, all-penetrating power of nature and fate seems to make the human doings at once piercingly real and immediate, yet disconnected, almost surreal. But the touches of humour and sharp, immediate visual detail (often wittily drawn from the visual history of paintings and caricatures of village life) save us from any kind of authorial portent or angst: the greatest wonder of this artful work is that there is nothing between us and the story, except perhaps the icy whip of the ocean wind gainst our faces. The range of characters both in kind and in how we experience them is enlivening - from the formidably down to earth Father Collins, to the captivatingly tragic and symbolic figure of Doryan. And Michael the retarded angel  is the ultimate figure of grace.","user":"lfsutherland","rank":[49,52]}]