[{"title":"Dim Alfred, the vampire killer's apprentice has to learn fast if he's going to save the beautiful daughter of the Innkeeper.","rating":10,"date":"24 January 2007","review":"Brilliant movie - beautifully shot and with Polanski's eye for detail. Very funny/quirky and atmospheric. I loaned it to a work colleague who thought Polanski only made horror films like 'Rosemary's Baby', she was amazed when confronted with this one. She thought it was great. Everyone is always very impressed with the ballroom scene with all the mirrors and the vampires dancing. The colours are fabulous and the outside scenes remind one of s Christmas card. If it's ever on t.v. it's always on around midnight or after, so I had to buy the DVD. Definitely one to watch late at night when you're alone!! It took me years to find it on DVD. I think the one I eventually bought was an import.","user":"funnybunny-7","rank":[44,53]},{"title":"Great horror/comedy","rating":10,"date":"11 July 2002","review":"I love Roman Polanski's \"The Fearless Vampire Killers,\" which is surprising to me now because for most of my life I thought it was dreadful.  I missed the original release back in 1967, but I was only eight years old then, and the version released in the U.S. was a truncated travesty of what Polanski intended.  I've read that the movie was considered an almost complete fiasco because the executive producer, Martin Ransohoff, best known for \"The Beverly Hillbillies,\" wanted a very different film and cut 16 minutes out of Polanski's 107 minute cut, inserted a short cartoon before the titles (so people would know it was supposed to be a comedy; Ransohoff thought Polanski botched it that badly), and even re-dubbed some of the actors.  He also added the awful tag line to the title, \"Or, Pardon Me, But Your Teeth Are in My Neck.\"  This must have been the version I saw on TV in the early seventies and thought so terrible.  Thankfully this abomination doesn't seem to be in circulation anymore.  However, despite its flaws \"The Fearless Vampire Killers\" gained a cult following over the years, to a degree due to the morbid fascination with the murder of Sharon Tate, but also because the movie is really very good.  Paramount's Robert Evans recognized this back in '67 and thought Polanski the right director for \"Rosemary's Baby.\"  He was right and the success of that film showed Hollywood what a master of the language of film Polanski is.<br><br>In 1983 MGM/UA Home Video released Polanski's original cut on cassette and on laserdisc (remember those?).  On laserdisc it was letterboxed so you could enjoy the full Panavision frame, and included the alternate main title sequences from the bastardized version as an extra.  For some reason, though I wasn't a fan of the film, I thought this was a disc I had to get, but after I first viewed it I wondered if I hadn't wasted my money.  I still couldn't see what was so great about it.  However, I didn't get rid of the disc and over the past nine years I've viewed the movie several times.  I can't remember when I started to appreciate it, but now \"The Fearless Vampire Killers\" is one of my favorite movies.<br><br>Right from the main title sequence this film is really quite wonderful. Christopher Komeda's score is weird and haunting.  The day-for-night shots of the snowy countryside are a bit distracting, but kind of fit the fairy tale quality of the film's isolated, late 19th century Transylvanian winter never land.  The movie is extremely well-mounted with wonderful sets, especially the vampires' castle.  All the performances are excellent.  Jack MacGowran's Professor Abronsius is an absolutely incredible characterization, unlike anything else MacGowran ever did on film.  The same is true of Alfie Bass' Yoine Shagal, possibly the world's first Jewish vampire, and a terrible lecher.  Sharon Tate was probably never lovelier than in this movie, and Roman Polanski is very good as Alfred, in fact amazing when you consider he was also directing.  It is a tour de force on his part.  Finally, Ferdy Mayne's Count Von Krolock is a king vampire equal to any screen Dracula, while Iain Quarrier is also appropriately creepy as his gay vampire son, Herbert.<br><br>Like the drinking of blood (I would imagine!), appreciation of \"The Fearless Vampire Killers\" is very much an acquired taste.  I don't know what to say to those that don't like it except, Why don't you try watching it again? It might grow on you as it did me.  This movie also has one of the best one-sheet posters from the sixties, with art by Frank Frazetta.  I hope this movie comes to DVD soon, especially with commentary by Polanski, but I've read that MGM considers the elements in need of restoration, so it may be a while.  However, it should look great when it does get to DVD.  I can't wait.","user":"haristas","rank":[32,40]},{"title":"One of the all-time great horror spoofs","rating":24,"date":"24 June 2000","review":"When I first saw this film on TV in the early 70s, I thought it was so cheesy I gave it very little attention.  Then in the early 90s it was released on laserdisc in a letterboxed version and I bought it on a lark. After I viewed in the first time I still didn't think much of it and thought maybe I wasted my money.  But then, as the years passed, I would look at it every so often and now I love the film.  It is an acquired taste.  You first have to love vampire films -- the old-fashioned, Gothic kind.  Next, you need to appreciate Polanski's style and his understated approach.  It's also best to watch this film late at night with the lights off, and especially with a snow storm outside.  Give it a chance and this film will creep up on you. Hopefully it will come to DVD soon.","user":"stew100","rank":[59,79]}]