[{"title":"Significant Disney Movie!","rating":25,"date":"25 March 2001","review":"The really significant part of this movie has nothing to do with the players, but the producers.  This is the FIRST ever PG movie released by Disney - after almost 35 years a G-only releases.<br><br>I saw this movie as a kid.  It had a catchy song - slightly memorable plot and ... well not much else.  Not horrible or good.  OK.<br><br>Sadly, as Disney movies go - you'll notice on the DVD cover - no mention of Disney.  Professionals admit their mistakes, are humble in their successes and remain proud about the rest.  Walt Disney would have.  Eisner doesn't.","user":"firelight","rank":[6,7]},{"title":"ordinary","rating":4,"date":"25 May 1999","review":"After a promising opening ten minutes, highlighted by some good gags, this movie quickly slips into dreariness and never recovers. It's not that there's anything particularly wrong with this film, it's just that there's nothing particularly good about it either and it wastes a potentially interesting leading duo.<br><br>The best thing that can be said about it is that it's inoffensive and easy to take but it's also totally forgettable and one of the more uninventive films you're likely to come across.","user":"Marco_Trevisiol","rank":[11,15]},{"title":"Sweet and charming","rating":7,"date":"4 September 2000","review":"I remember seeing this movie as a kid and loving it.  Recently, I watched again as an adult and found it to still be a sweet, charming little movie. The basic plot has Elliot Gould's character signing a pact with the Devil (Bill Cosby)to recruit three good souls and thus saving his own from eternal damnation.  Gould gets three young people including an aspiring young singer (Julie Budd)and a fatherless young boy (Adam Rich), to sign a contract with the devil in exchange for making their dreams come true while on Earth. It all works out happily as all Disney films do, but there are several laughs, touching moments, and lesson learned along the way.  I was really intrigued by Julie Budd after this film who more than resembled a young Barbra Streisand in both looks and talent.  Loved the song that she sang in the film \"Any Fool Can See.\"  I wonder what happened to her after this film. Seems she never worked again.","user":"ML368","rank":[6,9]}]