[{"title":"A forgotten gem","rating":9,"date":"20 January 2007","review":"This is one of those rare gems that never got the accolades from the mass public other horror films (Halloween, Friday the 13th, etc) garnered. I saw this as a kid and it scared the bejesus out of me. Some 30 years later, I still love this film. Dated, yes, but it possesses a strange creepiness that you almost can't put your finger on. Its premise is of a man and wife starting life anew in a small town. The wife Jessica, played wonderfully by Zohra Lampert, has recently recovered from a nervous breakdown. They decide to move out of the hustle and bustle of the big city to a small apple farm and bring their friend with them. From the onset, Jessica clearly struggles with her past demons and tries to convince herself that her mental breakdown was in the past. She starts to question everything she sees as to whether it's real or not. They get to their new home, only to find a strange girl occupying their property. The girl, Emily, played by Mariclare Costello, is truly frightening and plays the role of this mysterious girl to perfection. To anyone under the age of, perhaps 35, this movie will most likely do nothing for you. It is from the 70s and IT SHOWS, it contains no CGI, no bloody slasher gore, no \"strap them down in a chair and torture them\" scenes, and no famous big name people. It is a quiet, intense ride where you have to actually FEEL the emotions that grip Jessica. I've read comments here where others think it's lame, or complain about Lampert's clothes. How clothes can affect someone's view of this movie floors me, but whatever. This movie isn't lame. It's a classic gem of a thriller in a sea of garbage that's churned out by Hollywood these days. I think I'm going to go watch it now!","user":"cleoew","rank":[89,98]},{"title":"Scared me 30 years ago and scares me now. Very effective.","rating":10,"date":"14 December 2004","review":"The scariest movie you will never see on TV. This movie should have been a hit. Since it wasn't, it should have 'cult' status. Why it doesn't, I don't know. Genre - horror. Sub-genre haunted house, return from the dead, psychopath, strange little town. Filmed on location in CT with that great \"B\" movie feel. The lack of special effects and gore make it all the more effective. Simple but amazingly good soundtrack. I saw this movie 30 years ago and it really haunted me. I found an import on DVD for which the quality is quite good. Many viewers see the movie as an enigma or riddle. Having seen it several times now I think the title says it all. Pay close attention to who either gets or almost gets killed. Why is the little town populated only by men? The actress playing Emily needs no makeup to look like just what she is playing in the movie. A few things about the movie don't hang together and the continuity might suffer a little. But have no doubt, it is one very scary and effective film.","user":"gwsteph","rank":[61,69]},{"title":"super-creepy","rating":13,"date":"13 August 2004","review":"I first saw this movie as a somewhat hacked up, scratchy, blotchy, variably-colored, crapophonic late movie on a then-independent station (now a FOX affiliate) when I was a teenager in the '80s, and that is still how I remember it. Even the gorgeous print available on home video doesn't dull \"Jessica\"'s ability to make you feel really uneasy.<br><br>Make no mistake, horror fans brought up on Freddy and Jason are going to think this is supremely lame. There are no wisecracking psychos, unless you count Mariclare Costello's mildly swaggery hippie-vampire Emily, and there is very little in the way of gore, no nudity to speak of, hardly any profanity, and no ass-kicking. It's SLOW. So what gives?<br><br>I'll tell you what gives. This movie is SCARY. Not gross, but scary. I can't put my finger on it exactly, but there is a thread that runs under everything that put you slightly off balance and makes you feel icky inside, something that makes even broad daylight seem deathly black and menacing. Credit Bob Baldwin with some nicely atmospheric photography. I'll say this much: a lot of it is in the sound. From the constant wind to the creaks in the farmhouse, from the plaintive minor-key acoustic guitar plucking to the WONDERFUL, unsettling electronic noises by synthesizer pioneer Walter Sear-one of my absolute favorite aspects of this movie-what you hear is almost as important as what you see (or don't see, in this case). The rough edges caused by a miniscule budget make for plenty of continuity errors for the movie buffs to catch, but also somehow make it all seem that much more real.<br><br>You keep waiting to be impressed with the slick Tom Savini or Rob Bottin special effects and there are none, you could be watching a documentary road-movie-gone-amuck the way \"Jessica\" is shot.<br><br>And what about Jessica herself? As played by Zohra Lampert, who I believe was primarily known as a comedic actress and did Broadway a lot, she is the portrait of a pointedly average lady who is coming apart at the seams after a breakdown and can't seem to escape from whatever it is that drove her off the cliff. Lampert projects frailty, indecision, optimism and despair, and above all paranoid terror, but managing to keep herself from falling into cliché hysterics and making her character absolutely believable, even if her inner-voice monologues sound pretty hokey. Someone else mentioned that her performance was Oscar material...well, if they had a separate Oscar for B-movies she'd have won hands-down for 1971.<br><br>Surrounding Lampert are a bunch of equally talented character actors you've seen many other places, not given as much to do. Barton Heyman (the doctor in The Exorcist) comes across well as the somewhat asshole husband who's had it up to here; Kevin O'Connor appropriately spacey as a laid-back quasi-hippie friend of the family, Alan Manson aggressively square as the local antique dealer, and Gretchen Corbett (yup, from \"The Rockford Files\") ethereal but pitiable as a mysterious mute girl wandering through the countryside like a warning ghost. Most interesting is Jessica's friend/nemesis, red-haired hippie chick Emily. She's charismatic, hip, funny, far-out, and very pretty...except that she's maybe a shade too pale of skin...and she scares the bejesus out of poor Jess. And those awful things she does, well, does she really? Mariclare Costello plays Emily perfectly; I really wish she had done more major movie work as she is a very appealing actress, although I understand she was a regular on \"The Waltons.\"<br><br>The problem with all these characters is that, compared to Jessica, they seem artificial. In particular, they are all almost, but not quite, sorta-hippies--they're too old, and they seem to square for the hip dialogue. Either miscasting, or bad writing. The clumsy insertion of every horror cliché in the book (seance...check; empty rocking chair rocking...check; jump out of the silent shadows...check) doesn't help, nor does some pretty hokey dialogue. It's too bad, because there's a lot of good, cerebral stuff in here, subtext, but it seems like a sloppy first draft script rather than a polished, tight, finished one. Given more work, the script could have been A-list.<br><br>Finally, credit must be given to director John Hancock for pulling these uneven ingredients together and making a masterful job of it. The guy hasn't made many films (\"Prancer\" is probably his best-known), but he certainly is a talented fellow and he pulled off a major hat trick with this bleak little chiller.<br><br>One more thing, people: lay off the '70s accoutrements. Yes, you can make fun of Heyman's sideburns and O'Connor's greasy mop-I'd join you-but does it really make a difference?","user":"billys","rank":[75,87]}]