[{"title":"Candy is dandy!","rating":8,"date":"7 August 2000","review":"\"Summer Rental\" is a very pleasant comedy vehicle from director Carl Reiner and star John Candy. Candy stars as Jack Chester, an air traffic controller under alot of stress. His boss tells him he needs some time off from his job. So he packs up his family and heads for Florida hoping to have the time of their lives. But it doesn't go exactly that way, especially for Candy. He experiences about as much stress vacationing as he does at work. The funniest part of \"Summer Rental\" is the opening 5 minutes, with Candy exhibiting the kind of stress that causes his superiors to suggest a vacation. This part is a riot, and the movie is very funny for the first half. The film loses a little of its comic edge in the second half, when Candy takes up sailing and tries to win a bet against one of the locals, an obnoxious yachtsman played gamely by Richard Crenna. The second half still has some funny moments, but not as much as in the first half. Still, \"Summer Rental\" is a nice little movie, with the late John Candy giving one of his better leading performances. Karen Austin is very good as Candy's supportive wife Sandy; a very young Joey Lawrence (several years before \"Blossom\", back when he was starring on Nell Carter's '80s sitcom \"Gimme A Break!\") shines as Candy's son Bobby; Rip Torn is somewhat amusing as Scully, owner of a local restaurant on a boat who becomes Candy's good friend; and \"Night Court's\" John Larroquette also makes an appearence in a bit part. \"Summer Rental\" is one of director Reiner's better films, and it gets to show off Candy's considerable comic talents that are sorely missed today.<br><br>*** (out of four)","user":"jhaggardjr","rank":[24,26]},{"title":"A true classic","rating":3,"date":"3 December 2003","review":"This movie is from a time that I sorely miss.  It is about having a good time, and nothing else.  There's no violence, no crude sexual comedy, just the legendary John Candy doing what he did best.  Given, the music and clothing are extremely dated, but this is without a doubt the best feelgood lighthearted movie I've ever seen.  All of the characters come together perfectly to tell us the tale of Jack Chester.  One of the most memorable is Scully, the sailor/pirate.  To this day, I see Scully whenever I see Rip Torn in any movie.  This story just makes me feel good for days after I see it.  John Candy is surely one of the best comics of the past 30 years, pulling this move together.","user":"MaximumCheese","rank":[33,37]},{"title":"John Candy and Carl Reiner: what could be a better combo?","rating":7,"date":"12 August 2005","review":"For most of his career, John Candy played a bunch of rather silly roles that - while they were completely goofy - were great nevertheless. \"Summer Rental\" is one such role. Candy plays overworked air traffic controller Jack Chester, who takes his family on vacation in Florida. Naturally, it ends up being not as much of a vacation as they hoped. Finally, Jack and his family decide to take one last chance to restore their dignity.<br><br>I will admit that \"Summer Rental\" is pretty much a big excuse to be silly, but you gotta love it. This is John Candy doing what he does best. It's really too bad that he died; he really had a good track record.","user":"lee_eisenberg","rank":[17,19]}]