[{"title":"As a film, awful-- as a document, outstanding.","rating":11,"date":"11 January 2002","review":"It's fine to appreciate this film through the sieve of nostalgia. Even I have a hard time viewing this film without reciting all the words- I've seen it many many times. But the important thing to note here is that while Harry Belafonte made a noble effort to shape a story out of the Bronx's greatest cultural export, it's only successful half of the time. The result is a film that garners lots of groaning through scenes while waiting for the 'good parts'. Rae Dawn Chong is flimsy and ineffective as usual, in the role of the dance school instructor who 'discovers' Lee and KK. The ensuing romance that KK and Tracy have is terribly trite and makes for sleepy viewing. Likewise the sopping wet story of Ramon and his girlfriend, who have a child and disapproving parents. Heavy handed and poorly acted to boot- even for the time period. All the graffiti was designed by stage painters, and looks like it- distant and plastic. This is a depiction of a corny world indeed.<br><br>What Beat Street is notable for, is managing to compile many notable music artists and b-boys/b-girls in performance. The Rock Steady and NY Breakers footage, the Us Girls group assembled for this film, Busy Bee, Melle Mel and the Furious Five, Bambaataa &amp; Soul Sonic Force, Tina B., Brenda Starr, Treacherous Three and Doug E. Fresh- there's loads of it which greatly outweighs the mindless fluff of the so-called plot. The soundtrack (co-produced by Arthur Baker of \"Planet Rock\" fame) is extremely notable as well. It was originally sold in 2 volumes, and while each record has several watery ballads, the classic songs like \"Frantic Situation\", \"Son of Beat Street\", \"Santa's Rap\" and \"Battle Cry\" are very much worth the purchase. <br><br>If you're like me and miss 'old New York' (it was only 20 or so years ago but NY is totally different) it's really great to see painted trains, old street scenes and the Roxy. Beat Street has been contrasted to Wild Style many times, especially with the scorn of Beat Street being the Hollywood retread of Wild Style's gritty budgeted reality. This might be the case, but it would seem that Beat Street has a better focus on b-boying (breakdance) whereas Wild Style's actual graffiti by famed writers remains the strong point of that film. There's a hokey wholesomeness present in Beat Street that just isn't realistic. Regardless, Beat Street is certainly worth viewing- particularly when it pops up on TV- but be prepared for some stale, hackneyed drama strewn into the great music and killer scenes. <br><br>\"Beat Street Breakdown--- RUAHHH!!!\"","user":"tonypuma","rank":[26,32]},{"title":"The best of all the breakdancing films.","rating":8,"date":"21 June 1999","review":"Of all the breakdancing / hip-hop films released between 1983 and 1986, the 1984 film Beat Street is unquestionably the best one.  The story follows a DJ, his younger breakdancing brother, a graffiti artist and a wanna-be showbiz promoter through one winter in which they try to break out of the ghetto using their \"street\" talent.  The acting isn't always up to par and the characters aren't fully drawn out, but they are more than compensated for by down-to-earth dialogue, a plausible story, fantastic dancing sequences and a timeless hip-hop sound track.  It should be noted this film was shot in the birthplace of breakdancing (\"This ain't New York, this is the Bronx!\"), and features appearances by the fathers of breakdancing, dance troupe Rock Steady Crew and rapper Afrika Bambaata.  Rock Steady Crew provide the best scene in the film when they dominate a dance battle at the premiere breakdancing club of the early 80's, the Roxy.  A must see for hip-hop lovers.","user":"JawsOfJosh","rank":[20,24]},{"title":"Bronx Old School","rating":26,"date":"26 September 2002","review":"Great time-capsule of the Bronx and 'hood in the 1980s, and the b-bop culture/dress/dance. Kids walking the snowy streets, abandoned buildings (sealed with concrete, then broken into), marked-up subway cars...New York as it was then. It's a well put-together, but not \"slick\", movie, with a good, believable story and characters with some depth. The breakdancing is \"real\" and pretty thrilling. I taught at Roosevelt High in the Bronx at this time, and this movie catches the scene. Interesting to note how upbeat, pleasant it all was, too, vs. today's more sinist","user":"murphyguide","rank":[17,20]}]