[{"title":"Adventuresome desert film","rating":8,"date":"20 April 2013","review":"Released in 1962, \"Escape from Zahrain\" is a survival-in-the-desert flick that takes place in the fictitious Arabian country of Zahrain. Yul Brynner plays Sheriff, a righteous Arab revolutionary, while Sal Mineo plays his young disciple who sets him free from captivity and certain death. An Arab nurse (Madlyn Rhue), an embezzling oil worker (Jack Warden) and a mad Arab (Anthony Caruso) are also along for the ride. Can they make it to a bordering nation and freedom or will they all perish in the desert? <br><br>Although it's Grade B (and cartoony) in comparison to the way more popular and sophisticated desert film \"Lawrence of Arabia\" (also from '62), \"Escape to Zahrain\" is actually more compelling, which is different than saying it's better, it's not. It's just more immediately satisfying. Two other survival-in-the-desert films that \"Zahrain\" brings to mind are \"Flight of the Phoenix\" and \"Sands of the Kalahari\", both released in 1965. If you like those two films, you'll definitely like this one. As great as they are \"Zahrain\" is as good or better.<br><br>There's some serious action at the beginning and end of the film, but the heart of the picture is the long trek through the desert and the interplay of the characters. Sheriff (Brynner) and Ahmed (Mineo) have had it with the corrupt officials of Zahrain who rape the land with the technology of the Americans but then greedily keep the cash for their own filthy rich lifestyles; meanwhile the citizenry wallows in poverty and ignorance. The nurse (Madlyn) was educated in Europe and doesn't understand the reckless passion of the revolutionaries. She's against them because she's nursed the wounded &amp; dying followers of Sheriff, mostly youths. The American, Huston (Warden), is viewed as part of the problem by the revolutionaries, but they need him to escape and survive. And then you have the freakin' crazy Arab, Tahar (Caruso), also called \"Frankenstein\" or \"Franky\" by Huston. Is he friend or foe, or neither? Also on hand is a pleasant cameo by a major star from that time period, but I don't want to give it away.<br><br>The film was shot in the Mojave Desert, California, but you'd hardly know as the filmmakers did a great job of giving the illusion that it's somewhere in the Middle East. My wife, for instance, guessed that it was shot in Egypt.<br><br>At 93 minutes the film doesn't overstay its welcome.<br><br>FINAL WORD: Despite being a serious Grade B picture, \"Escape from Zahrain\" is Grade A in heart. The film is bookended by quality action sequences, but its core is character-driven. You get to know these characters as they trek through the sweltering desert. Their strengths and weaknesses are revealed and you can't help but start to care for them, just as they develop a sense of community amongst themselves.<br><br>Criminally underrated and unknown, \"Escape to Zahrain\" ranks with the best desert films, Grade B though it is. It's also one of Yul's best and the other principles. No kidding.<br><br>GRADE: A-","user":"Wuchakk","rank":[10,10]},{"title":"Not a bad \"fugitives in desert\" film","rating":6,"date":"15 February 2007","review":"Not at all a bad film, reminiscent of \"Ice Cold in Alex\", in that an ambulance and its occupants have to make a perilous journey across inhospitable terrain. At first the colour seemed a bit garish, but I was interested to see that outdoor filming was in the Mojave Desert, which was a very convincing substitute for the Middle Eastern country of \"Zahrein\". Madlyn Rhue seemed a bit insipid as the nurse, and James Mason stole the short scene he was in (which contributed nothing to the plot, save to allow Jack Warden to steal his whisky, the consumption of which did add something later on).<br><br>Quite why the treacherous Anthony Caruso (\"Tarah\") was tolerated by his fellow fugitives was a bit puzzling. The final action sequence was not convincing, in fact it was contrived.<br><br>But overall an enjoyable film to watch.","user":"Marlburian","rank":[8,8]},{"title":"Better than most people give it credit for","rating":7,"date":"8 October 2006","review":"This was the third English movie that I saw as a kid, after \"Jungle Cat\" and \"Absent Minded Professor\". I thought that it was an excellent action adventure film at the time. Yul Brynner is always good to watch and Sal Mineo's death particularly upset me since he looked so young. Although I could see the holes in the plot line when I saw it again as an adult, I still think that it is better than a lot of other movies of the genre, with some good photography and sound effects. The climactic scenes were particularly well done and the acting overall was quite good. Pity that it is still not available as DVD. I hope that Paramount Pictures take note.","user":"Oblomov-2","rank":[6,6]}]