[{"title":"A Film For All Time","rating":10,"date":"26 December 2010","review":"There are movies made of every kind, of many different genres. While quite a few are entertaining, some films can actually be life changing. \"My Dinner With Andre\" is one of those films. I first saw the film in the early 1990s, around a decade after it was made. Caught in a vortex of corporate America office work drudgery as a single parent, the movie inspired me then to really examine my life and actively work to change it.<br><br>I struggled to understand how a theater director (Andre) could ever become disenchanted with his life enough to drop out and search for more meaning. For me, the ability to do anything artistic to earn a living was a dream come true. As I watched the film, it became apparent how even someone in the arts could become disconnected - in fact, even more so than other people, who had resigned themselves to live the way that they were expected to according to standards they didn't agree with. I came away with the conclusion that it is the artists in society who have an obligation to cast truth's light on culture and how it affects humanity. This is a huge responsibility, and it is often frustrating for creative people to have to confront the mundane aspects of life which can create soul crushing circumstances, driving people to behave in the most inhumane of ways.<br><br>Seeing the film again recently, it had a whole new meaning for me. Now that I am on the other side of the spiritually deadening life in corporate America - I can see how my goals and decisions to change my life were extremely necessary - in fact, imperative to my existence. Since the film was made, people have spent decades engaging in all manner of robotic and soul deadening activities - many to the detriment of themselves and everyone around them. We have also seen a technological surge that helped to liberate people to a certain degree, while further enslaving others. Regardless of which type of person one happens to be, at the end of the day, most everyone should work toward doing the things that give them joy - without harming others in the process. While this is much easier said than done, it doesn't make the goal any less important to accomplish. In fact, on a very basic level, it is just as necessary as eating, breathing and sleeping. Maybe even more significant, since human apathy, in its own way, can systematically destroy and sully the spirit driven intention of others.<br><br>\"My Dinner With Andre\" is every bit as relevant now as when it first premiered, perhaps even more so. A conversation about the meaning of life and how people choose to live it, along with all of the outside forces that exist to complicate it, will never go out of style. This is a beautiful masterpiece of a film, that can be watched many times, to produce different points of view which provoke interesting, engaging and enlightening discussions by those who experience it. This is very apparent as Shawn's character, who on the surface seems to disagree with a lot of what Andre says. Yet by the end of the film, on his way home, his eyes observe things in his environment as though a new light was been cast upon them.","user":"cinemaniac2002","rank":[91,99]},{"title":"2 great storytellers keep you entertained through a 2 hours conversation","rating":8,"date":"27 September 2010","review":"This movie is mainly a conversation between 2 people. There isn't much music, barely any camera work, there actually is barely any acting because both actors play themselves!... it can barely be called a movie, but it still is one - and a very entertaining one at that. Both Actors have a gift for languages and are amazing story tellers. My native language is not English (you probably guessed it while reading this review), but even I have been amazed by the beautiful language and their amazing skill to talk.<br><br>From a philosophical point of view, there is nothing new. I heard all the thoughts before. - The great strengths of the movie is the way those ideas are expressed. Even the most simple thought is coated by meaningful and beautiful words. You almost feel enlightened while watching this movie! But after the movie is over, you realize, that you actually learned nothing. It still has been a great experience. And I wished that there'd be more movies like this one.","user":"kneiss1","rank":[41,48]},{"title":"Existential Paradox becomes Celluloid","rating":10,"date":"21 March 1999","review":"MY DINNER WITH ANDRE is one of the greatest movies of all time because it works on a seemingly infinite number of levels.  Yet at the same time it is one of the biggest failures in film because it only succeeds in connecting to the most insightful of its audience. The resulting paradox only serves to prove the film's lesson to be true.  Brilliant!<br><br>This is either a movie you will turn off after fifteen minutes, or it is a movie you will watch over and over again to pick up all the things you missed in previous screenings.  The former will be bored and lost by the endless, meaningless talk.  The latter will find gold in every word, and veins left to be mined time after time.<br><br>In simple terms, the question is understood \"If life is a stage, are you going to be an actor, a director, or a playwright?\"  It is the viewer's choice.  Wally is a struggling playwright who has fallen back on acting. Andre is a former actor and director who has left the theatre entirely. Wally and Andre meet for dinner, and Andre recounts his experiences since leaving the theatre.<br><br>But one of the ironies is that their dinner itself is theatre, and both Andre and Wally have roles to fill. [Notice they wrote the script and use their real names.  They are not playing characters.  They are necessarily playing themselves.]  And summarily the viewer also has a role to fill.  If life is a stage, viewing the theatre is in itself theatre.  The viewer is now in a place of choosing the role.  And will that choice be made mechanically or deliberately?  Mechanics is acting.  Deliberation is playwrighting.<br><br>This is a brilliant, brilliant film.  One of the greatest movies of all time.  And its resolve is purely subjective to the individual viewer.  The goal is to deliberate and come away enlightened (literally).  Unfortunately the majority of viewers will act mechanically and turn it off.","user":"fideist","rank":[163,211]}]