[{"title":"A very dear film to my gory, blood-filled heart","rating":26,"date":"26 October 2003","review":"This is the splatter anticlassic all us sickos know and love. The non-plot is, well, pretty simple and it's only an excuse to cut loose with loads of very extreme gore and sadism. Fuad Ramses (Mal Arnold), an Egyptian maniac of pagan bloodlust, must serve up a \"blood feast\" to Ishtar, his horrible goddess of gory days gone by. Y'know, back when chicks used to get their hearts yanked out on altars IN BLOOD COLOR! How does he get the morsels for his feast? It's an easy guess! Tongues pulled out. Limbs cut off. Brains hacked out in a blood-splattered mess. It's the grand-daddy of all the sickest stuff you've ever seen, and even though it's pretty stupid and bad, it sure is fun! It's even funny on purpose (as well as the other way around). For those of you who dig this unsavory and depraved type of junk the way I do, find this bad mother as soon as possible and surrender to the forbidden pleasures of the first splatter-comedy ever! (I think...)","user":"one4now4","rank":[41,46]},{"title":"Check out this ancient Egyption feast!","rating":8,"date":"8 January 2001","review":"Oft-credited as the first traditional \"gore\" pic, 'Blood Feast' establishes all of typical conventions of the genre; including nubile, young women (including a Playboy Playmate), excessive blood and guts, and even some dark humor (including the \"hamburger\" line and the trash-compactor ending). It's also inept in every way, from the atrocious acting and horrible directing to the dumb-as-dirt characters. Hell, the most intelligent character in this movie is the murderer, Faud Ramses - what, with him having penned a seemingly popular non-fiction work and running a bang-up catering business to boot - and even he is not too bright, which unfortunately catches up with him in the end.<br><br>If you love bad movies in that MST3K kind of way, than this is one to see. It's laugh-a-minute riot (and you've go to love the score). So put down that copy of 'Ancient Weird Religious Rites' and check this movie out.","user":"jurb84","rank":[27,30]},{"title":"The granddaddy of gore","rating":7,"date":"1 September 2003","review":"This is where it all started.  And it's also the first of what's known as Herschell Gordon Lewis' \"blood trilogy\" of gorefests.  <br><br>\nYeah the acting's terrible.  Yes, the special effects are awful and yeah, it looks like it was filmed on a shoestring budget, but that's what makes this thing so great!  (laughs)<br><br>A series of young women are slaughtered in Miami by a local crackpot named Faud Ramses (Mal Arnold).  He only takes one part of the woman's body each time by cutting off a leg or a heart or using a machete and cutting out a woman's brains on a dark Miami beach and leaves the local police (led by Bill Kerwin) baffled and clueless.<br><br>Ramses is also the local, exotic caterer who uses these woman's body parts to serve his customers without them knowing about it.  And that includes a party thrown by Kerwin's girlfriend's (played by 1963 Playboy Playmate, Connie Mason) mother.  Connie looks better here than she later did in TWO THOUSAND MANIACS.  <br><br>The Something Weird DVD uses a crisp master print taken from the original negative.  It's real clean without any scratches or damage.  The sound is as good as can be expected from the original mono source.  It also has 45 minutes of rare outtakes that that are almost as interesting as the film itself with topless scenes that weren't shown in the film. <br><br>\nIt also includes a short industrial film starring Kerwin and Harvey Korman (yes, that Harvey Korman) called \"Carving Magic\" that was done around the same time as this film.  We learn the fine art of 'meat' carving so I guess it's supposed to tie into the irony of this film, right?<br><br>This is camp as it's best, folks.  (laughs)<br><br>7 out of 10","user":"macabro357","rank":[11,11]}]