[{"title":"grand dark feeling of emptiness","rating":10,"date":"2 October 2010","review":"I grew up in the frames of \"Vigil\". Not to say that I was born in New Zealand - rather, I spent my early years in the lonely valleys and hillsides of Nova Scotia. But this film captures the desperate sense of isolation, the profound and perfect life buried beneath year after year of aching dreamtime, heartwaking nights beneath stars, mornings of fog that weigh you down with the power of all the heavens.<br><br>\"Vigil\" understands childhood. From the confusion of relationships, to the expression of emotion, the distance of adults, and the impetuosity and irrationality of youth. The wisdom of the young, held back without even the slightest consideration for right and wrong. The final answers to questions like \"Why was I born?\" and \"Why am I me and not someone else?\". The final answers that are really just acceptances. Eternal questions. For most of my life, since I was the very same age as the girl depicted in this story, I've been looking for a film that captured children as they really are, as they really behave, instead of just some adult's idea of how they act. This catches that elusive sense. For the first time, it puts me inside the childlike mind, lets me see through the same eyes that I once had. Unlike so many, I haven't forgotten what it was like to be this age, what it was really like. No other film understands childhood with such straight purity as this.<br><br>The sight of \"Vigil\" is like riding in a car with snowy windows. Like finding yourself in a poorly insulated house as the glass develops ice crystals and blurs your vision of the outside world. \"Vigil\" is life through a glass darkly. Alun Bollinger, the cinematographer, seems to see beyond the level of possibility. Beyond what naturalistic photography can conceivably capture. He takes the solid and safe and turns it deadly. Takes the inanimate and makes it breathe. It's as if horses were dreams and you find yourself riding nightmares in the pasture. It's dark and cold, yet full of life and light. Even the shadows tell of light. For if one is capable of perceiving the beauty of light, there is no end of it to be found in a film like \"Vigil\".<br><br>If a man like Vincent Ward had an achievement in life, a reason to be an artist, this film is that. He creates a tale of such perfection, such breath and personification, that I never realized how desperately I'd been searching my whole life for it to come around. With his co-writer, Graeme Tetley, a story of believability and human understanding has been woven together so tight, so pure, that I can't even speak of cinematic considerations. I can't think of undue questions or dissections. The reality is complete. For scene after scene, a solid image is perfectly presented, composed. Faces, houses, a derelict car, a jousting match. Nothing is weak. Nothing is unimportant.<br><br>This is the fifth film I've seen by Vincent Ward. One of them (What Dreams May Come) engaged me, but the visuals kept a distance. Two others (River Queen and Map of the Human Heart) were held back by unconvincing performances, though they were engaging otherwise. The Navigator, which he made four years later, is another truly great film - though of a much different style. But I'm not thinking of other films tonight. I'm dreaming of this world, and taking my vigil at the window. Tonight is calm, and the early Autumn air has settled outside my home in the Annapolis Valley. I'm thinking of the images I've seen, feeling changed and refocused, picked up out of my depression. This story has re-awoken the most desperate parts of my soul. It has left me with, to quote a song, \"that grand dark feeling of emptiness\".<br><br>For more of this feeling: Days of Heaven (1978), The Black Stallion (1979), Never Cry Wolf (1983), Tender Mercies (1983), The Stone Boy (1984), Ironweed (1987)","user":"BERSERKERpoetry","rank":[15,18]},{"title":"Hauntingly beautiful coming-of-age film","rating":9,"date":"17 August 1998","review":"A slow-moving film, exquisitely shot, that to me is the best of pre-1990's New Zealand films.  Mystical, magical, haunting, poetic, moody, moving...these words come to mind when trying to describe the film.  Best images:  Toss in the ballet tutu and gumboots; the unexpected spurt of blood on Toss's face when docking the lambs; Mum at the window; \"Beans to God\".  Applause for script, cinematography, direction, and Fiona's remarkable performance as Toss.","user":"Kiwi-7","rank":[12,14]},{"title":"Recently seen the movie","rating":10,"date":"21 January 2007","review":"At the starting scene of the movie, I did not know what to expect..as I continued to watching..I began to drawn to each character in their own way in the movie as in the connection between the mother, the grandfather, the poacher (the stranger).All together in one. But the real star in the story is TOSS- the little girl who witness her father's death. Throughout the whole movie, one begin to see how she is coping by her father's departure and somewhat feel alienated she wore an hawk-like hat to cover her face from the rest of the world ..and coming of age to discover who she really is and most of all the value of her womanhood.<br><br>The movie is a bit slow but it has a nice background based on its time, kinda bluish-gray mixing with different weathers during the scenes which made it magnificent and captivating to watch..Don't expect drama or actions..This movie is somewhat for the innocent. Just a feel-good movie. Go your nearest store; buy or rent it. You will enjoy it..","user":"Citizenkenn_1-1","rank":[10,12]}]