[{"title":"A very underreted solid decent third Superman sequel and that not a bad one","rating":8,"date":"7 October 2016","review":"Superman III (1983) is very extremely underrated bashed hated film and I am going to defend this film today! It is one of my personal favorite Superman movies of all time. Yes you read the title I love Superman III it is my childhood movie, I grew up watching this film and it was the first film I saw as a kid. Since I saw half of the second film Richard Lester version. Christopher Reeve will always be Clark Kent Superman for me no one else can replace him I don't care what anyone says. <br><br>I kept wining to my parents that I want to see Superman movie and in the video store a lady video store owner gave me Superman III on VHS when I was a kid and it was the only movie she had. Superman III is MILES way better than crappy lame Zack Snyder's Man of Steel and Batman V Superman: Dawn of Justice I hate those movies. I find this film enjoyable, well-done, and extremely underrated. The effects &amp; technology are extremely dated (especially the computers), but this is still a decent, well-done film. <br><br>Plot: Synthetic kryptonite laced with tobacco tar splits Superman in two: good Clark Kent and bad Man of Steel. <br><br>Thing's I love in this movie, why I gave the most highest rating in this film and why I am defending it:<br><br>Christopher Reeve is and always will be the only SUPERMAN! No one could play Clark Kent/Superman like Christopher Reeve, If anyone could be Superman, It is Christopher Reeve! <br><br>The opening sequence with the \"fools of Metropolis\" was amusing, in a slap-stick way; this intentionally reminded me of some of the old slap-stick routines from years before (Laurel &amp; Hardy; Three Stooges; etc.). And, sure, a lot of Superman III was comedic, but a lot of this was just in line with the Gus Gorman (Richard Pryor) character. <br><br>Superman/Clark going back to Smallville for his high school reunion &amp; running into Lana Lang (Annette O'Toole), etc. Very cool sequence, and I liked seeing Superman return to his \"roots\". Also, based on the reunion you get an idea of the character's ages - i.e., the reunion said \"Class of 1965\" &amp; since the film came out in 1983 (and supposedly was set in \"real time), then Clark &amp; his class-mates were all around 36 years old at that point.<br><br>This film focus more on Lana Lang, Clark's first love, Lois was Clark's eternal Love but Lana was his first love. Annette O'Toole was perfectly as Lana Lang after long 18 years Annette was cast as Martha Kent in Smallville. <br><br>In Superman: The Movie Lana Lang was played by actress Diane Sherry and she only had a cameo scene and than she disappeared from the rest of the film. Here we find out more about Clark and Lana's love! I saw Clark and Lois in the first two films but now we see more Clark and Lana's love story. <br><br>Superman save's Ricky (Paul Kaethler) Lana's son in the corn filed from the tractor that scene was really serious, the kid could have been seriously crushed, it that could have happened in real life. <br><br>This film was filmed and released in year of 1983 the year that I was born. This was my first Superman movie and it is my childhood film, I love it to death and I will always cherished. <br><br>The whole sequence where Superman was exposed to the \"Red Kryptonite\" (though they didn't call it that in the episode) and became dark/somewhat evil. They did a great job of transforming Superman/Clark to look dirty/unshaven/burned out (even his costume was darker!), and not only disinterested in helping others - but also being somewhat malicious as well. I especially liked the battle that Superman had with his good &amp; bad selves in the junkyard; I'm guessing this battle may have been metaphorical. It was also interesting on another level, because we saw what would happen if Superman had been evil instead of good. That scene was also used in Smallville Season 2 Episode 4: Red Clark was exposed to Red kryptonite and he evil. <br><br>Richard Pryor as the scam artist Gus Gorman was good and hilarious the same time - obviously, because of his inclusion many fans probably dismissed the film as a comedy; however, his presence brought a light-heartiness to the film that was reminiscent of the comedic Ned Beatty character from Superman I &amp; II. <br><br>Christopher Reeve was perfect as Clark Kent/Superman he acted brilliant his character, he is the only Superman and superhero for me.<br><br>This is Richard Lester original version film and he didn't had to re shot scenes from Richard Donner. <br><br>The rest of the actors did a solid job and I really didn't had any problems with them. <br><br>Robert Vaughn was a great villain I am glad the franchise had a new villain in all films Lex Luthor was five time the villain in all Superman franchise movies.<br><br>Ross Webster was a great villain and the scene where Vera (Annie Ross) becomes a robot and she becomes evil really scares me. <br><br>Brad Wilson played by Gavan O'Herlihy: Lana's former boyfriend, the character from the first film also returns in the first film he was played by Brad Flock.<br><br>Superman III is a 1983 British superhero film directed by Richard Lester, based on the DC Comics character Superman. It is the third film in the Superman film series and the last Superman film to be produced by Alexander Salkind and Ilya Salkind. <br><br>I love this film to death and it is my second favorite and the last good Superman film.","user":"ivo-cobra8","rank":[56,71]},{"title":"Not very \"Super\"","rating":5,"date":"22 June 2006","review":"After two successful films, the Superman franchise was unable to sustain momentum with Superman III. Superman III continues the series slide that was slightly evident in the otherwise solid Superman II from a mix of drama, action and sly self-referential humor to more slapstick oriented, silly entries. Superman III almost wants to just be a comedy, and the film's dramatic elements are fairly lacking.<br><br>As Superman III opens, Clark Kent (Christopher Reeve) is headed for a high school reunion in Smallville where he crosses paths with an old crush of his, Lana Lang (Annette O'Toole, who years later would essay the role of Martha Kent in the series Smallville), who is divorced and living in Smallville with her son Ricky (Paul Kaethler). Clark rediscovers his attraction to her and they begin what seems to be the road to a relationship. At the same time, Gus Gorman (Richard Pryor), an unemployed man who discovers he has a knack for computer programming, gets a job with Webscoe Industries and performs some hacking to inflate his paycheck. The company's head, Ross Webster (Robert Vaughan), discovers Gus' \"creative accounting\" but instead of firing him, decides to use his abilities to attempt to take control of the world's energy supplies. When Superman thwarts' Ross' plans, he has Gus use satellites to analyze the location of Krypton and determine the elements that make up Kryptonite, Superman's weakness, and plans to synthesize a version of it.<br><br>Gus is unable to replicate all the elements and substitutes tar was the missing item, which produces Kryptonite that doesn't kill Superman, but instead alters his personality, causing him to be come evil and selfish. With Superman no longer helping people, Ross' plans go forward and Gus makes a request: he has designed a supercomputer that he wants Ross to build for him that will allow him to control all the computers in the world.<br><br>With the presence of Richard Pryor, it is unsurprising that Superman III has a more strictly comedy directed bent, but frankly, turning the Superman series into a much more campy variety of film just doesn't work. After the first two films were able to be somewhat tongue in cheek without losing their dramatic strength, Superman III doesn't even really try to match those films. Almost everything in Superman III is played for laughs, and not even good laughs. A majority of the humor falls flat, and the whole experience proves relatively lame.<br><br>A significant loss is the virtual removal of Lois Lane (Margot Kidder) from the film. She makes a brief appearance at the very beginning of the film and the very end, but is missing from the rest. She had a disagreement with the producers over the firing of Superman director Richard Donner on Superman II and so they all but removed her from Superman III. In her place they introduced Lana Lang, and Annette O'Toole is capable in the role, but the Clark/Lana relationship doesn't have the chemistry of the Clark/Lois relationship in Superman and Superman II.<br><br>Superman III also suffers from lackluster villains. Ross Webster is a rather bland adversary, with Robert Vaughan attempting to channel Gene Hackman but coming up a bit short. His performance isn't terrible, but it's not great either. Gus Gorman isn't a villain, per se, more of a misguided soul, so the film somewhat vacillates between making him a bad guy and thus sucks any possible menace from him. That plus he is portrayed by Richard Pryor, who is a capable comedian, but has absolutely no ability to play a villain. He's just too nice a guy.<br><br>About the only places Superman III still hits are with the still solid performance of Christopher Reeve as Superman, who manages to mostly escape unscathed, and the film's visual effects are still up to par. Otherwise, Superman III under whelms on almost every level. Not so Super, indeed.","user":"rparham","rank":[8,8]},{"title":"Like Office Space With a Super Hero","rating":6,"date":"17 September 2006","review":"After making two fairly decent Superman movies, things took a slightly different turn with Superman III. Gene Hackman was nowhere to be found, Lois Lane has such a small part that she's essentially not even in the continuity anymore (Clark apparently forgets all about his love of Lois when he re-meets Lana Lang). And things became really funny, or were at least supposed to be. If you consider \"campy\" to be funny.<br><br>Superman faces off against himself, after being exposed to a new form of kryptonite that has tobacco tar mixed in. Can the world trust a Superman who destroys oil tankers and sleeps with random women on top of the Statue of Liberty? The best part of the \"Evil Superman\" sequence is when we see Superman drunk, if for no other reason than the thought of Superman getting drunk (or even having the ability to become intoxicated) is a most unusual thought. Good thing Superman doesn't drive a car.<br><br>I really enjoyed the entrance of Lana Lang into the film. Lana, in my opinion, was always the more appropriate match for Superman and there is no exception in this movie. She shares a history with him, is more caring than Lois and less dominant. I'm curious where the Lois/Lana thing will go in Part 4, if it goes anywhere. (I am not suggesting dominant women are bad, by the way. But the fact of the matter is anyone dating Superman is going to have to be comfortable with being second fiddle.) What sold me on this movie (and almost scored it a 7 instead of a 6) is the tie-in with \"Office Space\". In Office Space, Superman III is referenced for a computer program that takes fractions of a cent and puts them in a bank account. The scene in this film was great, and really made me appreciate the way Mike Judge used it many years later.<br><br>With nicotine and tar being the secret ingredients in the new kryptonite, was there some message being sent? Richard Pryor was great. He was funny and made the entire film more of a comedy with kitsch than the serious films we had seen before. Many people really didn't like the campiness, I guess, but I thought it was enjoyable for the most part (though they did go over the top just a bit). In my mind, Superman was the light story and Batman the dark story, so I'd rather see a silly Superman than a silly Batman.<br><br>The new villain to replace Lex Luthor was okay, but why bother making a new villain if he's going to be the exact same character? I would hope after fifty years of comic books, there would have been at least one other super villain they could have chosen (although the new \"Superman Returns\" focuses on Luthor again, so I guess creativity is minimal in the Superman world).<br><br>If you've seen parts one and two, you may as well see this. But do keep in mind that the world of Superman turns a little \"bizarro\" for the next two hours of film time...","user":"gavin6942","rank":[41,55]}]