[{"title":"So what if it's a cliche","rating":7,"date":"11 July 2003","review":"It's a fun action-comedy and that's that!  You can make all the arguments you want.  This is definitely not for the discerning viewer.  Maybe I'm just easily satisfied by the buddy cop genre.  Plus, I love Arnold Schwarzenegger's movies, in general.  His action scenes are always fun to watch, and he always seems to come up with great one-liners.  In this case, he spouts out a few dryly humorous lines as his stonefaced Russian character.  Jim Belushi provides most of the laughs, though, as his unorthodox partner.  They both do a good job, though Arnold's Russian accent seems quite strained.  Then again, as the film heats up, you really don't pay attention to details like that.  Also look out for the beautiful Gena Gershon in an early performance.  Those in the mood for \"Henry V\" should definitely steer clear.  Those in the mood for mindless buddy cop fluff that'll keep you excited and keep you laughing should check this movie out. <br><br>\nMy score:  7 (out of 10)","user":"MovieLuvaMatt","rank":[55,63]},{"title":"Good Movie","rating":7,"date":"26 March 2008","review":"I really liked this movie. I have a thing for late 80's action flicks like Beverly Hills Cop or 48 hrs. I thought this was pretty good movie. One of the members on here said Belushi's character was the worst part of the movie. I thought Belushi was pretty good and comedic. I love the dialogue in the movie between Danko and Ridzik at the coffee shop. Overall I would definitely recommend this movie. I also find the content to be appealing. Russian Mob and drug smuggling. I also thought the bad guy Viktor was a really cool part played by Ed O'Ross who also plays Dutch Schultz right hand man in Hoodlum which is not nearly as good as Red Heat.","user":"matthew-t-shelton","rank":[23,26]},{"title":"From the golden period of Schwarzenegger","rating":8,"date":"12 December 2009","review":"The movie is a very good and stylish action, but such movies are not appreciated in comparison with the recent action movies which is pretty strange. For example, even the rating of awful Transporter 3 is higher than Red Heat. You probably know that critics hate Schwarzenegger, Stallone and Van Damme, also they hate action genre probably, so according to them, Schwarzenegger is an untalented muscle mass who can impress only children and his movies are shame. Schwarzenegger is not a Jack Lemmon or Sean Penn or Brad Pitt, but he has a pulling power and is great acting necessary for action movies? I ask this already asked question. By the way, I think that his performance in The Terminator 2 was outstanding. And as an action star, he is much better than new action stars. He made very bad movies yes, but everyone does that, doesn't? One of the criticisms of the critics is that he kills people, so the movie supports individual justice (killing criminals instead of imprisoning etc.) Well, most of action movies are like that, but they do not object, when it comes Tarantino movies or David Cronenberg movies like A History of Violence. Red Heat does not include a lot of action scenes, or action scenes are not 'big', but it is very stylish thanks to Walter Hill, one of my all time favorite directors and fun. There is a key scene, when I was a child, I used to become Arnold Schwarzenegger and do what he does in the scene. He was one of my childhood heroes. Those days and his films are pleasant memories for me. Returning to Red Heat, it is from Schwarzenegger's golden period. Today, they cannot make action movies like Red Heat.","user":"Ziya90","rank":[21,24]}]