[{"title":"Sixties giallo with Seventies Sleaze","rating":6,"date":"21 October 2017","review":"After a lovely animated credits sequence, we are plunged into the unhappy married life of Ruth and Miguel. I thought at first that they were unhappy because their mansion on the coast with a private beach, butler and cook wasn't big and expensive enough, or maybe their open top sports car weren't up to date, but I was wrong. Ruth just doesn't love Miguel no more, and she tells him so, also saying \"Oh, by the way, my new lover is moving in, he's played by Jean Sorel as well.\" So Jean moves in and we get a fairly long sequence of these two in love – rolling about the beach, water skiing, painting ceramic dishes, snogging while Jean hangs upside down from a tree. Jean even buys Ruth a pet swan which makes for some ridiculous visuals. It should be noted here that this film is lush looking even by the usual high standards of this genre – Jean takes Ruth to this nightclub and we get dazzled by the garish colour schemes, and an early shot of a disco ball! Around this point Jean's friend Roland also shows up and starts making eyes at Ruth, some lady (whom I initially thought was Miguel in drag, which means I've been watching too many of these films), moves in next door and keeps spying on everyone, and someone starts trying to kill Ruth! First her brakes don't work on her car, then someone drains all the fuel out of her SCUBA diving gear.<br><br>She's naturally inclined to think that Miguel is responsible for this, and it doesn't help when he turns up shortly after this, but when she accidentally overhears a couple of characters discussing the rest of the plot in great detail, your left wondering what direction the plot is going to take, seeing this happens only forty minutes into the film.<br><br>Did you get any onya? This film is very much in the style of those late sixties gialli starring Jean Sorel and/or Carroll Baker, but with a total overdose of visual style and weird camera angles. Plus, when have you ever seen Jean Sorel chase a swan around while wearing a daft mask. Please not however there is scarcely a drop of blood in this one but if you're a sleaze fan you might want to hang about to the last fifteen minutes.<br><br>Didn't need to see a guy harpoon an octopus though.","user":"Bezenby","rank":[6,6]},{"title":"Starts slow, gets much better","rating":5,"date":"1 November 2017","review":"Whether you call it In the Eye of the Hurricane, Lusty Lover or Suspicion, this film starts with plenty of style and 70's morality.<br><br>Ruth and Paul are a new couple, but Ruth is still married to Michael, who thinks their trial separation will get them back on the same page. Ruth obviously has no interest in that — she instantly runs away with Paul to a seductive Mediterranean beach.<br><br>Their love is shot in crazy colors, upside down kisses, swans in the hot tub being given as gifts, discotheques for two, making pottery together, a stone swan filled with caviar and champagne yeah, Ruth isn't going back home.<br><br>This is a film of bad memories, strange moments of a new relationship, not getting introduced to people and it feeling weird, swirling camera shots around a dancing couple ala DePalma's Body Double (but 13 years early), bearskin rugs in front of the fire (it is 1971) and suspicion.<br><br>Soon, Ruth is involved in a couple of accidents; her brakes fail while driving and her oxygen tank runs out while diving for an octopus (while Paul drinks wine on the boat with his dog and pours wine all over the coral!). Ruth gets paranoid and believes that Paul may be trying to kill her. Or is it his war buddy Roland, who seems to care about Paul a little too much (and the dude has scars from a lion on his chest!)?<br><br>Oh yeah — Paul even goes underwater to get her some coral, where we reveal Danielle, a redhead who is a rival for Paul's affections. And Michael, Ruth's husband, comes back to visit.<br><br>Oh hey! There's Paul and Roland, just randomly shooting things in the yard. Nothing strange there! There's a great ending where Michael challenges Paul to show him how good he is. He holds up a magazine as the camera goes from the model's face to his to Ruth's. A shot rings out and it goes right between the model's eyesand the hole reveals Ruth! What a great shot!<br><br>Oh wait — Paul, Michael and Danielle are all in it together, as they are working together to kill Ruth, who tearfully listens to their plans. Ruth runs back to the house, debating calling the police, before deciding on grabbing a gun. From there on out, it's all big zooms in on the eyes and ominous music!<br><br>Ruth writes a note to Paul that says that she knows he is coming back to kill her and she won't stop him. He was the man she was looking for all her life and she put all of her faith, trust and love into him. He represented her whole being, but now, she knows why he approached her. She never imagined anyone could be capable of such hatred and it all makes her exhausted. Now, she feels that she has to pay the price for her mistakes, as she has lost all of her faith and willpower. She sees this act as suicide and begs him to hurry.<br><br>What follows is a selection of quick cuts — a black gloved hand with a gun, swans, red faces, worried faces and then Paul appears behind her, telling her that he was going to curl up with her. A phone call breaks the silence and the police call to say that Michael has been killed.<br><br>But wait — does Ruth have a plan of her own? The dog has died and the ice cubes she made earlier are the culprit. Paul moves Danielle into their home and they begin bullying her, trying to make her confess to the fact that she murdered Michael to protect Paul. They even force themselves on her in bed in a scene that's shot more like a horror film than a romance. Ruth just lies here, mouth wide open in terror, trying to fight them off. She finally runs and hides in a corner before her ex-husband and his new love consummate their relationship.<br><br>Ruth calls the police, who come with the news that Michael was killed with a chemical from Ruth's pottery supplies that she had just asked Paul to get for her. She set everyone else up to survive and walks down the beach with Michael's friend Roland as the film closes.<br><br>I've read that this film steals a lot from Umberto Lenzi's Orgasmo and A Quiet Place to Kill, which I need to find and watch. That said — there are some moments of interest here and once you get past the slow opening, it all gets rather exciting.","user":"BandSAboutMovies","rank":[3,3]},{"title":"Tame but entertaining Spanish/Italian thriller","rating":24,"date":"24 January 2007","review":"A woman leaves her husband and immediately takes up with another man . But her new beau has a strange friend that he knew from the \"war\", he and also seems to have some kind of relationship with the beautiful bisexual woman next door. Meanwhile her estranged husband is still lurking around, and someone seems to be trying to kill her.<br><br>This rather odd giallo came out after Dari Argento had set the template for the genre with \"Bird with Crystal Plumage\". Strangely though, it seems to be a throw-back to the earlier Umberto Lenzi/Carroll Baker gialli like \"Paranoia\" or \"A Quiet Place to Kill\". The beginning is almost unforgivably slow with romantic longueurs of very beautiful idle rich people frolicking on the beautiful Cote de Azure beach while 60's Europop tunes play on the soundtrack (the movie often resembles a more staid French thriller like \"La Piscine\" than a Spanish/Italian gialli) . The plot, when it finally kicks in, is actually pretty good, but this movie is not as deleriously stylized nor is it anywhere near as violent as your typical giallo of that era. And it's tame even compared to the earlier gialli as far as sex goes--there's a long, ridiculous scene where the lead actress goes topless but the view is always obstructed by something (which resembles a running gag in \"Austin Powers\" more than anything else). It's hard to believe that three years later this same Spanish director would do the uber-sleazy \"Beyond Erotica\".<br><br>Still, tame does not necessarily translate to bad. This film has some good twists to it and is pretty entertaining when it get's going.","user":"lazarillo","rank":[11,18]}]