[{"title":"European Travel before the EU and the euro,","rating":8,"date":"8 June 2008","review":"While not a laugh-out-loud comedy, \"If It's Tuesday, This Must Be Belgium\" is a humorous, affectionate take on group travel that will resonate with anyone who has been on a European bus tour. Ian McShane is the British guide for World Wind Tours Number 225, which will sweep through nine countries in eighteen days. McShane's American tourists include such comedic talents as Norman Fell, Marty Ingels, Reva Rose, Peggy Cass, Pamela Britton, and Sandy Baron. Although not well known for comedy, Murray Hamilton, Michael Constantine, and Mildred Natwick are spot-on funny as well and fill out the bus-load of stereotypes. Murray Hamilton stands out as the congenital cynic who was dragged away from his comfy couch for the trip. Hamilton's expressions and delivery capture the feelings of every male who has submitted to his wife's desire for a cultural experience in a foreign land.<br><br>The photography by Vilis Lapenieks captures the beauty of a Europe that flits by faster than the group can either absorb or appreciate. Strangely enough, only the Marty Ingels character, who is obsessed with photographing beautiful women to inspire jealousy among his male friends back home, appears to carry a camera. Predictably, a romantic liaison develops between tourist Suzanne Pleshette, who is as lovely as ever, and guide McShane. The Pleshette-McShane relationship, however, shines in contrast to the bloodless attraction between teens Hilary Thompson and Luke Halpin, who had better chemistry with dolphins. However, when the movie hits its target, it is engaging and oddly nostalgic, which the wistful title tune by Donovan underscores. For many, a quick glimpse of European wonders is a once in a lifetime experience whose memories must endure, and McShane emphasizes to Pleshette that tourists like her get an enormous return for their money.<br><br>Unfortunately, younger viewers may not react to the satire and sharp observations, because the film is firmly set in the 1960's. Veterans of World War II are increasingly rare and few make trips back to the battlefields. Hotels no longer monogram their towels for sticky fingered guests. Carnaby Street is no longer a mecca for mod fashion, and inoculations are unnecessary for European trips. However, anyone who has crossed the pond will recognize that Rome will never be a place to rent a car, American franchises abound in European cities, and yodeling is still an acquired taste. \"If It's Tuesday, This Must Be Belgium\" is a time capsule for those who want to relive or catch a glimpse of European travel before the EU, the euro, and the proliferation of the English language homogenized the continent and stole some of the fun away. With a bit of nostalgia, some talented comedians, and director Mel Stuart's pacing, which is nearly as fast as the tour bus, the film is gentle fun and above average entertainment.","user":"dglink","rank":[22,23]},{"title":"This movie has to come out on DVD!","rating":9,"date":"16 March 2005","review":"Even though I was born a couple of decades after this movie was released, I wanted to watch it when it played on TV because it was given a perfect 5/5 rating by my local newspaper's TV listings. When I tuned in, I was even more excited when I found out that it was a David Wolper and Mel Stuart collaboration because I really loved 'Willy Wonka and the Chocolate Factory.' It's a shame that 'If It's Tuesday This Must Be Belgium' is not available on DVD. Even though it was made about 30 years ago, the misadventures of the ensemble cast are as funny as ever. The fine balance between the witty humor and acerbic banter in this movie is something that is rare in movies today. The only movies that come close are a few of Wes Anderson's (Rushmore, Royal Tenenbaums, The Life Aquatic), but instead of being faux retro, 'If It's Tuesday This Must Be Belgium' really is retro. It shows all of Europe's fabled landmarks in the tongue-and-cheek manner that you can't get from any movie unless it really was made in 1969. I liked the part when the group was at a cheese market in Amsterdam and the tour guide says, \"There's an auction of gouda cheeses and edam cheeses. And pretty good-a edam cheeses they are.\" That is like so corny it's funny. After watching this movie, I actually did want to take a European bus tour! But the best thing about this movie is its great cast, particularly the beautiful Suzanne Pleshette and the devilishly handsome Ian McShane.","user":"jemdoll","rank":[26,28]},{"title":"A fun film filled with a lot of great character actors","rating":31,"date":"31 May 2003","review":"I was nine when I first saw this film, when it first came out, and loved it ever since. Funny even with it's vintage 60's songs, and an appearance of pop star Donavan, it hasn't dated at all. In fact it's more like a time capsule of it's time, which was 1969.<br><br> The film is about a bunch of Americans taking a european tour is ten days. We have a large assortment of characters played by some expert character actors. There's the WWII veteran played by Michael (My Big Fat Greek Wedding) Constantine who has taking the tour because it goes to the same places he went to in the army. Then there is the typical ugly American (Murray Hamilton) who was forced to come on this tour by his wife(Peggy Cass), he hates every minute of it till Rome where.. no you got to see it for yourself. There is a poor husband, Norman (Mr. Roper) Fell who gets separated from his  wife (Reva Rose) when she gets on the wrong tour bus and tries to find a way to get her back. Then there is Miss Sam (Suzanne Pleshette) who has decided to take a vacation from her fiancé, to get her head straight, but then becomes the object of tour guide Charlie(Ian McShane)'s advances. Also wonderful in the film is Sandy Baron, Mildred Natwick, Pamila Britton, Marty Ingles, and Aubrey Morris.<br><br>It was directed by Mel Stuart who followed this up with the classic, \"Willy Wonka And The Chocolate Company\". I ended up seeing this film three times in the theaters.It gets better with every viewing.","user":"allenblank","rank":[18,19]}]