[{"title":"Misunderstood","rating":9,"date":"22 April 2004","review":"MINOR SPOILERS<br><br>Misunderstood classic remains one of Henson's finest and most personal films. It may seem funny to call a movie as beloved as this one 'misunderstood,' but people do seem to remember this one mostly for Jerry Juhl's snappy screenplay and Paul Williams's knockout songs. Now while these things are admittedly great, as is the movie's formal playfulness (screenplay-within-the-screenplay, film break, etc.), what distinguishes 'The Muppet Movie' from the other Muppet films is the serious, wistful thread that runs through the picture. It's a road movie, all right, but like most road movies, the pleasure is in the getting there, and the achievement of the characters' goals is tempered by uncertainty, and by the knowledge that they can never really go back again. Throughout the film, we are shown the down side of show business, even before the Muppets have 'made it': Piggy abandons Kermit without a second thought at a phone call from her agent, Gonzo expresses the loneliness and regret of a performer's life on the road in his haunting 'I'm Going to Go Back There Someday,' and, worst of all, Kermit is continually tortured and tested by Doc Hopper, who wants him to commercialize his art for the unholiest of purposes. (One can only wonder what Henson would have made of his family's management of the company after his death.) Kermit himself agonizes over his choices in the desert conversation scene, and the final 'Magic Store' number questions whether it's all been worth it, before concluding that it probably doesn't matter either way. All this is punctuated with the expected Muppet chaos and satire and deliciously awful jokes, and of course the serious stuff wouldn't work if it weren't. But 'The Muppet Movie' isn't just another jokefest, as the rest of the diminishing-return Muppet films would become. No, it's a lovely, gentle metaphor about the relationship between art and entertainment and business, and it's every bit as effective today as it was 25 years ago. 9.5 out of 10.","user":"kintopf432","rank":[78,82]},{"title":"Write your own ending: Existential awareness in hand puppets","rating":10,"date":"28 January 1999","review":"In many ways, the perfect movie. The \"Incredible Journey\" and Horatio Alger tale come together for a positive spin on the usually depressing subject of existentialism. In essence, the travails of the muppets boil down to the finale song of the movie: \"Life's like a movie, write your own ending, keep believing, keep pretending.\" They create their own reality, which has all the trappings of every epic tale: a lofty goal at the end of what is necessarily a obstacle-laden journey; an ever-increasing group of like-minded individuals for camaraderie; a nasty set of villians who are not beyond all redemption; and a big-budget Hollywood ending because, darn it all, they CAN.<br><br>Only Jim Henson could pull this off. He walks the line between sentimentality and philosophy without swerving too long or too hard into either. Of course it seems odd that invest such weight into a film starring puppets, but in the end perhaps they are the perfect, uh, puppet to make these points. The movie's atmosphere allows for the pure enjoyment of the Hollywood dream, the \"happy\" ending, unnecessary cameos, and bursting into song at the drop of a hat. Usually these aspects are anathema to quality in film, but the self-deprecating manner under which the story is delivered makes for guilt-free viewing. One of the few films that can truly be called \"suitable for all ages.\"<br><br>The other muppet-related films (including \"The Empire Strikes Back\"), while palatable, do not touch the simple grace of this film. Take, for instance, the musical number \"Hope that Something Better Comes Along,\" the duet of Kermit and Rowlf. Amusing in its vaudevillian goofiness, yet makes a bitingly crucial point about the motivations behind life choices. Brilliant.","user":"Mr Pants","rank":[57,62]},{"title":"Life is a Movie","rating":31,"date":"31 May 2000","review":"We all lost something important when Jim Henson died. But his magic alone wasn't sufficient to do more than clever skits, both before and after this gem. Some fated match of director, writers, songwriters and puppeteers came together to create an underappreciated masterpiece.<br><br>Forget the kids -- this is a great work, period. Among the best story-films ever. And nowhere is the enfolding of reality and fantasy more rich than here. Naturally, you have the mix of humans (accented by celebrity cameos) and puppets. And some puppets are of humans, some of human-like animals, and some of animal-like animals. But that's just the tokens.<br><br>The real novelty comes in the story. It is a film about the making of itself, with a wonderful sequence at the end where the film is represented in cartoonish props contrasted with a `real' rainbow. Throughout, one weaves between being in the story and observing the story. Kermit (Henson's alterego) says `I hope you appreciate I'm doing my own stunts.' Think about it.<br><br>The songs, themselves self-referential, are important frosting: `why are there so many songs about rainbows?'<br><br>`Life is a movie, write your own ending, keep believing, keep pretending...' You don't get that in common fare. If you have kids, this is the most educational exposure you can give them among the kiddie offerings. There's nothing more powerful than the ability to perform abstract reasoning and the foundation of that is the play between what things are and what things represent them. Thanks and God bless you, Jim.","user":"tedg","rank":[57,63]}]