[{"title":"wonderful","rating":9,"date":"21 December 2005","review":"This is a classic, with one of the great slapstick scenes of all time (in an automat) and wonderful innuendo and great timing throughout the film. Jean Arthur is a splendid comedienne, just lighting up the screen with a wry innocence, and Ray Milland is perfectly cast as someone a little debonair, a little too bourgeois, but ultimately quite charming. Finally, Edward Arnold is a lot of fun to watch as he chews up the scenery. As a long time fan of Preston Sturges who was quite happy to see \"Miracle at Morgan Creek\" finally released on DVD, I have to say, it is A CRIME that this little gem isn't available on DVD, just ridiculous.","user":"tobybarlowny","rank":[36,38]},{"title":"An Expensive Gift On A Mystery Woman","rating":9,"date":"1 August 2009","review":"According to a recent biography of Jean Arthur, Easy Living only got a so-so reception from the movie-going public of 1937. Today it is rightly regarded as a screwball comedy classic from the era that invented and defined that genre. The miracle was that it got made at all.<br><br>Jean Arthur was obligated to Columbia Pictures and the dictatorial Harry Cohn and she was allowed to make outside films. But Cohn determined when and where. So Easy Living may have been a great fit for her, but it didn't fit into his plans. Jean had to go to court before the film was made and a settlement was reached.<br><br>Easy Living also gave an outlet for some unknown comic talents of Edward Arnold who usually played some serious villains in films. Arnold is a Wall Street investment tycoon whose every bit of noise be it wisdom or flatulence is recorded for posterity. One day in fit of pique against his spendthrift wife Mary Nash and wastrel son Ray Milland, Arnold throws a most expensive mink coat from out the townhouse window and on to a passing working woman in Jean Arthur. He tells her to keep the thing and count her good fortune. But folks are in the habit of recording Arnold's every move, including one bestowing an expensive gift on a mystery woman.<br><br>That starts about 90 minutes of non-stop hilarity in which the very foundations of our financial institutions are rocked due ultimately everyone misconstruing a relationship between Arnold and Arthur. One does get going however with Arthur and Milland when she finds him working at an automat because Arnold's dared him to get a job. That ends in an incredible burst of hilarity, you think Animal House had a great food fight, check the one in Easy Living out.<br><br>Directed by Mitchell Leisen and written by Preston Sturges, Easy Living has all the earmarks of a Preston Sturges directed movie, in fact Sturges's stock company was somewhat assembled here if you look down the supporting players. My favorite is Luis Alberni whose white elephant of a hotel finally gets going due to some accidental rumors.<br><br>We're the richer for Easy Living being made even if Jean Arthur had to take Harry Cohn to court to do it.","user":"bkoganbing","rank":[17,17]},{"title":"Jean Arthur, Preston Sturges and Mitchell Leisen make a fine, funny screwball comedy","rating":8,"date":"3 June 2008","review":"When an expensive sable coat, thrown from a penthouse balcony by Wall Street tycoon J. B. Ball (Edward Arnold), lands on the head of office clerk Mary Smith (Jean Arthur) while she's riding to work on the top deck of a city bus, we're off on a fine screwball comedy that nails class assumptions to the wall. (The wall being a fabulous suite of the Hotel Louis.) Ball, known as the Bull of Broad Street, threw the coat to spite his extravagant wife. Although it was a mistake, as soon as word gets around that Mary Smith has a coat from J. B. Ball, it's not long before people begin to assume that Mary must be the Bull's mistress. And although she loses her job, almost instantly all those who want a piece of the Bull are falling over themselves to make Mary happy. She winds up in the Hotel Louis in a suite that could only have been dreamed up by Hollywood designers. Clothes and jewels are delivered; a car and chauffeur show up. Mary is mystified by all this, but happily accepts. When she meets a young man who works at the automat, well...we know, of course, that the young man is Johnnie Ball (Ray Milland), son of J. B. Ball, and that he earlier had stormed out of the family mansion determined to prove he could be his own man. It all gets sorted out, but only after a new Depression may get started fueled by more loony assumptions. <br><br>Preston Sturges, who wrote the script, brings all the social satire and clever dialogue to Easy Living that he brought to the films he directed and wrote later. Mitchell Leisen, the director, gives the movie a sweet speed. The slapstick moments are like the whipped cream on top of the ice cream sundae. There is a food fight in the automat that is so witty and filled with pratfalls that it makes Animal House look like the work of...hmmm...juveniles. <br><br>Jean Arthur and Edward Arnold take above-the-title billing, and they make a compelling set of screwball actors. That Arnold's J. B. Ball is irascible is putting it gently. Yet Arnold makes the tycoon funny and human, and there's no doubt that he really cares for that wife of his. Jean Arthur, of course, makes the movie work. What a one-of-a-kind actress she was, with that air of surprised innocence and that vaguely husky voice with the hint of a squeak now and then. It's worth remembering that Jean Arthur, who was born in 1900, paid her dues in more than 50 silent films, movies with titles like Biff Bang Buddy, Bigger and Better Blondes, and Twisted Triggers. She was 35 when she hit major stardom and stayed at the top through her last movie, Shane, in 1953. That innocent sexiness, acting skill, instant likability and that voice allowed her to consistently play 10 to 20 years younger than her age. For me, Jean Arthur at 53 and playing Marian Starrett, a woman probably 20 years younger, is the real center of Shane. She gives a deep reality to what all those homesteaders stand for. And she, without saying a word, is what motivates Ladd as Shane to do what he must do. In my opinion, Arthur gives the best performance in the movie. That's something you can say about almost every movie Jean Arthur was in. <br><br>And let's not forget some fine character actors who help make Easy Living as funny as it is. Among them is Mary Nash as the Bull's wife, who really does love J. B. (as he does her). By the end of the movie we like them both a lot; Luis Alberni as Mr. Louis Louis of the Hotel Louis, who is energetically ethnic; Franklin Pangborn as Van Buren, the prissy (of course) proprietor of an exclusive hat shop; William Demarest as Wallace Whistling, gossip reporter; Esther Dale as the Bull's unimpressed and decidedly matronly secretary; and Robert Greig as Graves, the portly, imperturbable butler in the Ball household. They all have a chance to shine, and shine they do.","user":"Terrell-4","rank":[14,14]}]