[{"title":"Very Strange and Interesting Film","rating":8,"date":"13 May 2006","review":"This version of the Phantom of the Opera is by far one of the stranger films in its genre. Mixing elements of 80 slasher and old time horror this movie works on many levels and fails on a few. Now, everyone knows the story of the Phantom of the Opera, Right? Well, this story is basically the same except for a few differences. For one, a late 80's version of Christine is trying out for the lead role in an opera. During her addition, she is hit over the head and knocked out. When she awakens, she is back in time in late 1800's London. She seems to have no recollection of even going into the past. The rest of the story is traditional Phantom except for name changes and how disturbed this Phantom is and his origin. I really have to hand it to Robert England as the Phantom or Eric. This is by far one of the best roles I have ever seen him in. And the make-up job for him is astonishing. The fact that this Phantom makes a mask out of human flesh is actually quite creepy. And physically, he makes his character of Freddy look like a silly mess.<br><br>Now, for fans of the musical and the original versions of the movie, I don't know if you would really like this version. But, for fans of 80's slasher mixed with some atmosphere, a good soundtrack, and good acting, I would have to recommend this. I give it an 8/10.","user":"CMRKeyboadist","rank":[25,26]},{"title":"Superb as usual!","rating":10,"date":"18 August 2003","review":"~Semi-spoilers~<br><br>Robert Englund delivers another great one! In this film he's more of a romantic hero rather than just a murderer, as he was in all the Nightmare on elm street movies, but he pulls this off beautifully as he does with all his other work! This man is a genius as well as an accomplished actor, as any of his fans would be thrilled to agree with. If your a fan of Robert Englund, and lets face it, most of us are, or if you're just looking for a different twist on \"The Phantom of the Opera\" movies then you'll definitely love this one!","user":"Akura69","rank":[15,15]},{"title":"A Total Guilty Pleasure","rating":9,"date":"3 January 2006","review":"My friend, a fellow Phantom Phan recommended this to me. I had my doubts when I picked this up but I sat down to watch it at about midnight, Ha! biggest mistake of my life. This was possibly the most disturbing, gory, creepy interpretation of Phantom ever, and you know what? I LOVED it.<br><br>This is possibly one of my favorite film versions of this story, giving even Lon Cheney a run for his money. Robert Englund's Erik was insane but brilliant and amazingly witty. He had the most amazing lines (\"Love and music are forever\").<br><br>The story begins in modern day New York City when Christine Day and her friend Meg discover two pages of Don Juan Triumphant in an old archive, written by the mad genius Erik Destler. When Christine sings the piece for her audition, a sand bag falls on her and she passes out and is swept back to her past self and finds herself the object of the obsessive Erik.<br><br>An amazing film in it's own right with beautiful music. But remember everyone, you are not sitting down to classic literature, you are sitting down to a gory slasher/horror film. It was a refreshing change from Andrew Lloyd Webber's musical which quite frankly I both hate and love. <br><br>I'm a Leroux purist when it comes to Phantom but still this movie is one of my favorites.","user":"Neko_Allenby","rank":[20,21]}]