[{"title":"my forty-year search rewarded","rating":10,"date":"30 January 2005","review":"There is little to add to the eloquent appreciations of Wild River by other users. Still, I want to pay my tribute. My father took me to see the film when I was a little girl and it made such an impression on me I have been searching for it for years. Odd, since I remembered nothing of the plot, retaining only fleeting images of autumn colours, Lee Remick's autumnal hair, the old ferry, an indelible impression of Montgomery Clift's face, the old woman surrounded by still 'figures in a landscape'. And the creation of a unique atmosphere so tangible, so lyrical, so elegiac it stayed with me for 40+ years. I've been wanting to know why it clung to me so. And wondering why it seemed to have disappeared without trace. This Christmas, in the fullness of time, my niece presented me with the DVD and I have at last seen it again. Why did it affect me so profoundly? That one's easy. Why had the film disappeared. That one's complex, as you know. What I hadn't expected was that stunning performance from the incomparable Jo Van Fleet. No Oscar? Were they mad? It is intensely interesting and sobering to reflect how politics can hold art hostage.","user":"gayeshortland","rank":[62,70]},{"title":"A masterpiece of American cinema.","rating":10,"date":"26 June 2005","review":"I found this little gem to be an exquisite piece of ensemble work by some of the best screen actors to ever to be in front of a lens. Elia Kazan impeccable direction and a performance by Jo Van Fleet that could be a learning tool for some of these putrid so-called actress that now are being lauded as the neo-contemporary actress's of the day. When you see a film of this artistic magnitude you can easily understand the dumbing down process of the American cinematic media. Not one of the so-called stars of today could measure up to Lee Remicks complex and sensitive portrayal of Carol in Wild River. Montgomery Clift an actors actor , there will never be another. A master of controlled raw emotion and body language. Gone are the days indeed when this kind of movie production will return. Not special effects or remake after loathsome remake or some equally obnoxious star or starlet will match this cinematic jewel.","user":"l-john206","rank":[51,58]},{"title":"The movie is great","rating":10,"date":"11 January 2008","review":"I had to say this movie was so stunning for me. The beginning black and white newsreel of a man who lost his three children in a flood is actually a real clip and it is my grandfather, so I was so amazed to see this. He passed away in 1972. My father lost his brothers and sisters in the flood which was in the 1930s Trumansburg, NY. I believe is was the flood of 1935. How amazing to see an actual news reel of my grandfather!!! I had a hard time finding the movie until I come across it on ebay. My father once had it, but he ended up losing it as the movie was not marked it was a blank VHS and it was unfortunately thrown away. I am holding onto the movie that I got until his birthday. It will make a unforgivable gift.","user":"llmann-1","rank":[31,34]}]