[{"title":"Love This Movie, Even Though it's Terribly Flawed!","rating":5,"date":"19 May 2011","review":"I saw this Schockley horror film a half of dozen times since the 1970's and although anyone who seen it would have to admit it very flawed, it to me was a lot of fun to watch! It is an old school type of horror film,doesn't go to far with the blood and gore and relies on spooky atmosphere, music, and sound effects! And man was that atmosphere spooky, especially the opening score! In my own personal opinion, the opening score was one of the spookiest ever in a horror film, and I have seen many! The music from the chorus, the creepy looking house and paintings, the sound effects, and showing how each Beale family member died make that intro very, very, scary! If the rest of the film was as good as the introduction this film would have been a classic, but they didn't seem to want it to be that way! But, for some reason, I still love this film and hope someday they make a remake of it, with the same atmosphere, music, sound effects and creepy mansion, this time focusing on the Beale Family and what lead to their demise!","user":"daleja-dale","rank":[18,19]},{"title":"House of the Bad Comments by IMDb Users!","rating":5,"date":"8 January 2008","review":"I am honestly confused by most of these reviews and comments. There is nothing really THAT BAD about this film. It plays like an extended version of an episode of \"Night Gallery.\" There is obvious comparisons to \"Children Shouldn't Play With Dead Things\" and other genre films but this film really doesn't belong in those categories. I am a fan of the 70's horror genre and did not expect much when I sat down to re-watch this film after twenty years. (DID NOT EXPECT MUCH-GOT THAT!) I would not call it boring or confusing. Too many people enjoy writing overly critical reviews of movies that were never intended to be masterpieces. Too many reviewers also feel the need to compare all movies to each other rather than seeing them for what they are really worth individually. In all of it's \"stiffness\" this film is still more entertaining than the CGI crap Hollywood dumps on the public in 2008!","user":"daveydalek","rank":[56,68]},{"title":"Strangely Hypnotic","rating":1,"date":"1 June 2003","review":"After watching a few foreign new wave horror/mystery/suspense films, including Ringu and its sequels, Audition, Open Your Eyes and The Eye I was in the mood for something that did not require reading subtitles for the length of a film. Where could I find such brainless fun? Obviously the old Italian zombie movie was my first choice, then I came across this old flick and found it strangely engaging. The House of Seven Corpses is an atmospheric supernatural/zombie film that deserves rediscovery.<br><br>SPOILERS AHEAD ... The story involves a group of filmmakers, who unwisely raise evil forces with the use of an old book of spells and conjurations (ala Children Shouldn't Play with Dead Things or The Evil Dead). The fascist director, who screams and shouts at his cast at the drop of a hat, decides to make his film in an old house with a sinister history of murder and mystery. It's in the last quarter of the film that most of the action takes place, but until then tension, atmosphere and twists develops well enough to keep viewers involved in the well conceived film-within-a-film narrative. There's little gore, relying more on mood and eerie shots of a dead body floating along a stream, Carradine wandering amongst gravestones and the silhouette of the zombie creeping through the old house. With its downbeat ending and interesting-for-the-time plot, House of Seven Corpses established itself as an enjoyable experience and I was happy for not getting what I originally ordered.","user":"Krug Stillo","rank":[18,20]}]