[{"title":"sumptuous, sensuous, symbolic","rating":8,"date":"13 February 2004","review":"Here's another sumptuous-looking, highly atmospheric and sensuous fantasy from Spanish art-exploitation director Larraz, who was responsible for Vampyres, the finest of modern vampire movies. The scenes are bathed in soft-focus greens and ochres, emphasising the dreamlike pastoral setting and highlighting the players' striking emerald and almond eyes. The three main characters are gorgeous in unique ways, the Spanish guitar score is a perfect complement to the mood, there is one memorable surrealistic image, and the story is absorbing and quite unpredictable. Only the rather arbitrary ending is a let-down. A perfect example of the heights reached by 70s Euro-fantasy, with psychological and cultural subtexts intensifying the conventions of the erotic and horror genres.","user":"goblinhairedguy","rank":[19,22]},{"title":"A dream like, magical journey.","rating":9,"date":"27 November 2018","review":"Fantastic, sublime piocture, concerninmg two mysterious folk of Gypsy origin. The soundtrack which is not credited, is one of the all time best. At first was not sure of the soft focus but as you watch, it kind of seduces you into the powerful, erotic events that unfold. I have only seen the cut version (alas) but please ignore the terrible reviews to this one. Even if you don't like this type of material, the music alone is a haunting masterpiece. The cover poster (pictured), is original/incredible. An uncut, remastered version would be very most welcomed.","user":"RatedVforVinny","rank":[5,5]},{"title":"Good example of the euro-trash genre","rating":17,"date":"17 August 2003","review":"Larraz is one of those directors who succeed in making a picture with virtually no money (e.g. Jesus Franco). By using some unorthodox images like a naked man on a horse, and by doing some smart editing, he manages to give this film a creepy feeling that shows you don't need millions to make a decent picture.<br><br>This does not mean this is a good movie, although it had some strong scenes, including the infamous horse-with-woman-inside scene, it has a weak ending, a couple of standard middle-of-the-road sexscenes and the acting is (as always in eurotrash cinema) rather amateuristic.<br><br>I'd recommend this to anyone who has seen every Franco 70s movie available and wants to see something similar. However, Larraz made a much better picture with Vampyres which stands much higher on my all-time top eurotrash list.","user":"tim_age","rank":[15,21]}]