[{"title":"UNDERRATED SUPERNATURAL THRILLER","rating":13,"date":"13 October 2002","review":"Hmm. Some of the reviewers here have complained about the film's slow pacing.  Well, yes...compared to the MTV style edited movies of the past 5 years, I'd have to agree.  But, the pacing is also necessary in order to show the slow psychological breakdown of the lead character.  It's a slow burn type of story, and the filmmakers were much more concerned with building a creepy atmosphere than bombarding us with CGI effects, blood and gore, and whatever else passes for supernatural horror these days.<br><br>Besides, Richard Burton on a bad day is better than most actors at their best. <br><br>If \"Jason X\" and other hollow, special effects driven films are your idea of horror...then this isn't the film for you.  The Medusa Touch is a methodically paced thriller, aimed at genre fans who enjoy a more thoughtful kind of horror film. If you enjoyed \"Don't Look Now,\" then this is the type of film for you.<br><br>If you have the rare opportunity to catch this obscure film, you should at least give it a fair shake. Then you can decide for yourself.","user":"creativeguy0123","rank":[90,103]},{"title":"Dark psychological thriller","rating":9,"date":"13 August 2002","review":"\"The Medusa Touch\" is a typical seventies \"devil conspiracy\" movie like the popular \"The Exorcist\" and \"The Omen\" series combined with the typical paranoia and disaster movies between \"Earthquake\" and \"Airport\". The late Richard Burton plays an obsessed psychic who tries to convince a psychiatrist (Lee Remick) of his demonic power to kill people and to cause disasters just by the strength of his thoughts. Being a victim of an assassination and a coma patient in a hospital, his mad thoughts are causing even worse attacks on buildings that are causing the death of hundreds of people. French cop Lino Ventura, working as a guest policeman in London, tries to find out the mystery of Burton's dark life.<br><br>Although there's not much action, this horror movie is thrilling and dominated by the convincing performances of the actors. There is a sinister atmosphere of terror and paranoia all around, and you expect the unexpected in every single moment. A fine psychological terror movie in typical seventies style that is worth being watched!","user":"Mikew3001","rank":[48,55]},{"title":"well directed, well cast, excellent adaptation of book","rating":8,"date":"6 December 2004","review":"The manner in which the film was chronographed was somewhat unique. In real time the main character, Morlar, is comatized by severe head trauma. In fact the movie opens with his attempted murder. The unfolding of events in the ensuing investigation are presented with smooth transitions from flashback to present in order to create a sense of fatalistic inevitability. The director takes a very difficult path to achieve this but I think he pulled it off very effectively. Look for little tricks to smooth out the staccato chronological transitions. Small similarities between outgoing and incoming scenes create a more seamless effect.Also, the sounds of a former scene would linger for a couple of seconds after the transition, further uniting past &amp; present to emphasize the inevitable hopelessness of the inspectors situation. It also serves to demonstrate Morlar's indomitable, fatalistic will.<br><br>All the characters are well (and cleverly)cast, particularly Richard Burton as Morlar. VonGreenway's book comments on the intensity of Morlar's character and his riveting gaze. Burton was obviously intimately familiar with the text as his rendition of Morlar is, to say the least, riveting.<br><br>The apocryphal elements added by the director, the cataclysmic disasters vastly improve the story's big-screen appeal, even if they were a bit of a departure from the text. The director simplifies the text by only indirectly referring to Morlar's political agenda. To follow the text in this would be setting up an entirely different story and would distract from the immediacy of the peril Morlar represents for the inspector and the psychiatrist.<br><br>The \"tongue in cheek\" manner in which these two meet serves to show a comprehensive understanding of the text, it gives clear notice (to those familiar with the book) the text cannot realistically be followed in every way. \"I'm sorry I was expecting a man.\" the inspector explains his reaction to her. \"That's alright, I was expecting an English Inspector.\" She responds. This, of course, was a reference to the characters as they appeared in the book.<br><br>This is a well directed film, making sense of a difficult text in an acceptable time frame. Richard Burton was an excellent choice as Morlar, he has a dominating presence that lends well to the character. These things along with an excellent rendition of a sensational, compelling story make the Medusa Touch one of the best suspense films ever.","user":"ginish666","rank":[52,62]}]