[{"title":"Stephen King meets George A. Romero!!","rating":9,"date":"26 October 2004","review":"Creepshow (1982) was a horror fan's dream come true. Two of the masters in their respective fields joining forces to collaborate on a movie. Several tales filmed in an anthology style based upon the E.C. Comics that the two enjoyed reading in their youths. With Stephen King writing and George A. Romero directing plus Tom Savini creating the gory special effects how can you go wrong? You just can't and the aforementioned duo delivers the goods.<br><br>The story begins as a young kid is being punished by his overbearing and brutish father for reading \"trashy filth\" and is punished. During the night the tossed out comic book comes to life and plays out all the stories (in comic book form) with the \"Creepshow Ghoul' leading the way. Black comedy has never been funnier.<br><br>All the stories are excellent and well directed. The set pieces are very well designed and are brilliantly executed. You have to love the lighting schemes. The cast is a mixture of new actors and classic ones. George A. Romero stated that he finally got to work with Fritz Weaver and Hal Holbrook and E.G. Marshall. Leslie Nielsen, Adrienne Barbeau, Ted Danson and Ed Harris co-star as well. A couple of Romero regulars such as his wife Christine, Tom Savini and who can forget Stephen King as Jordy Verill.<br><br>Creepshow is a true modern day horror classic. I have enjoyed this as a child and I still consider this movie one of my favorite horror films. Sadly the two could never capture the magic they once had. Maybe they'll work together directly in the near future. This movie was near flawless in design. They set out to recapture the old E.C. Comics aura and they succeeded. Followed by a absolutely bad sequel. <br><br>Highly recommended!","user":"Captain_Couth","rank":[70,81]},{"title":"Creepily Comical.","rating":8,"date":"29 July 2006","review":"\"Creepshow\" is a unique, funny, and creepy horror anthology from Stephen King and George A. Romero. The film centers around five stories - consisting of a murderous revenge tale of a father on fathers day ; a redneck (played by Stephen King himself) who begins growing a green substance on his body after coming in contact with a meteor ; a man who buries his wife and her lover up to their heads on the beach as the tide begins to come in ; a strange monster that lives in a crate that was discovered beneath a stairway ; and a Scrooge-like businessman who lives in a purely sanitized apartment that can't get rid of pesky cockroaches.<br><br>Each of the stories displayed in this movie are a little bit corny to a certain extent, but they are still well done and are quite amusing. There is a very good cast, including Ed Harris, Leslie Nielsen, Ted Danson, Adrienne Barbeau, and E.G. Marshall, whom all give good performances in the movie. The whole movie is tied in with the classic E.C. comics from the 1950s, each story as if it were from a comic book. I thought that whole comic aspect was pretty unique, and I liked the stories in the film (\"The Crate\" is by far the best of them all, the one with Leslie Nielsen is my runner up for second place).<br><br>Bottom line - if you are expecting some serious, intense horror movie, this is not for you. This movie isn't scary at all, I watched it when I was very young and it failed to even scare me then. \"Creepshow\" is a comical, campy, and well-done horror anthology. I only recommend it if you like this sort of thing, because it is more comic than horrific. Otherwise, it's really quite good for what it is. 8/10.","user":"drownnnsoda","rank":[37,44]},{"title":"Classic!","rating":9,"date":"17 December 2001","review":"George A.Romero(\"Dawn of the Dead\",\"Day of the Dead\",\"Martin\")after huge success with \"Dawn of the Dead\" directed his another masterpiece-an anthology of five short stories called \"Creepshow\".The script was written by Stephen King,and the special effects were made by F/X wizard Tom Savini(\"Martin\",\"Maniac\",\"The Prowler\").The first story \"Father's Day\" is so-so-nothing special,but the zombie looks terrific;the second story \"The Lonesome Death of Jordy Verril\" is the funniest,Stephen King steals the show as a Jordy,a goofy farmer,who finds a strange meteor;the third story \"Something To Tide You Over\" is my favourite-it's ghastly,creepy,funny and a little bit disturbing,again great make-up of the drowned zombies;the fourth story \"The Crate\" is the longest and goriest-there's a lot of suspense and plenty of gore mixed with black humour.Finally we are getting to the last story \"Creeping Up On You\"-an enjoyable story about cockroaches with some rather gross special effects.Overall I must say that I love \"Creepshow\"-surely they don't make them like this anymore.This is a REAL horror,not a teen-oriented garbage like \"Scream\" or \"Urban Legend\".Check it out.","user":"HumanoidOfFlesh","rank":[48,62]}]