[{"title":"Alexis and Basil","rating":8,"date":"24 April 2006","review":"Nikos Kazantzakis' novels lend themselves to cinematic treatment. Jules Dassin made a great adaptation of \"He Who Must Die\", and Michael Cacoyannis was equally successful in bringing \"Alexis Zorbas\" to the screen. Watching this film for a second time puts into perspective a lot of things that escape many a viewer the first time around.<br><br>Michael Cacoyannis changed the order of events in the book, as well as Nikos, who he transforms into Basil, the Englishman. The changes are not without merit since all the elements contribute to blend well together in the finished product. The director was fortunate to find such collaborators as Mikis Theodorakis, the genial composer of the music score and Walter Lassally, who photographed the barren area where most of the action takes place. Viewing the film on cable recently, shows Lassally's crisp black and white photography in mint condition.<br><br>The film is totally dominated by Zorba, who is a figure larger than life, as he takes Basil under his wing from the start. Anthony Quinn was a perfect choice for playing the title character. Mr. Quinn had worked with other brilliant directors, Federico Fellini, being one of them. It's almost impossible to think of Mr. Quinn as being an American because the magnificent transformation he undergoes here to portray Zorba.<br><br>Alan Bates, who is seen as Basil, the Englishman of Greek descent, who is going to Crete to see the family's land and mine. By underplaying Basil, Mr. Bates set the right tone, in sharp contrast with Anthony Quinn's exuberance. Alan Bates, in the end, made perfect sense with the way he played Basil.<br><br>Lila Kedrova is another surprise in the film. She is the tragic Madame Hortense, who has lived in the island for quite a while. It's ironic that love always eluded her until she finds in Zorba a reason for keep on living. Irene Papas is equally intense as the widow who is haunted by all the men in town. She has little to say, but just a look from her smolders the screen, be it, for the lust she felt for Basil, or the hatred for the town male population.<br><br>Michael Cacoyannis uses these men, as a sort of Greek Chorus, so important in Greek tragedies. The same could be said of the older women of the town who resent the arrivals of strangers. The Greek cast one sees is quite effective in the context of the movie.<br><br>\"Alexis Zorbas\", or \"Zorba, the Greek\", is a film that will stay with the viewer for quite a while because of what the director accomplished with it.","user":"jotix100","rank":[57,67]},{"title":"A joyous affirmation of life","rating":10,"date":"15 September 2006","review":"OK, I admit I've seen this movie a dozen times. But it never fails to inspire. Was there ever a man who lived life as fully as Alexis Zorba? Was there ever a character who understood so much about living and dying, women and men? Zorba ripping a piece of lamb from the spit and biting into it with joy and verve, dancing in pain or dancing from joy, expressing his wonderment at the sight of a dolphin, gives this character a special place in movie history.<br><br>If the rich storytelling and great Quinn performance were not enough, we get the young Alan Bates in a fine part doing a fine piece of acting, and the extraordinary pair of performances by Lila Kedrova and, especially, Irene Pappas, who need not speak a word to convey an entire menu of emotions.<br><br>The final scenes are among the best in movies. The music is among the best. Indeed, the MOVIE is among the best.<br><br>A GREAT movie.","user":"zitrinr","rank":[54,66]},{"title":"A Greek Poem Of Love And Frienship","rating":9,"date":"12 March 2018","review":"Anthony Quinn's Zorba became a point of reference, in fact I'm writing this review 54 years after its first release. He is everything and more. Alan Bates is outstanding walking that very thin line but totally committed to that duality that makes him so human, so real. Lila Kedrova won an Oscar for her performance, deservedly so. Simone Signoret had been offered the part and she was the one who suggested Lila Kedrova to the director, Michael Cacoyanis. I love that story. Zorba has also the power of Irene Papas who makes her silent calling absolutely riveting and the contagious Mikis Theodorakis's score all together in a beautiful, savage, compelling film that doesn't show any signs of aging","user":"ggallegosgroupuk","rank":[30,36]}]