[{"title":"Wonderful Mason And Bloom Chemistry","rating":8,"date":"31 December 2007","review":"Carol Reed and James Mason...it's Odd Man Out, isn't it? Wrong! Reed and Mason also teamed up for the rarely-seen, relatively inferior, yet quite valuable The Man Between six years later. While the film is nowhere near the masterpiece that Odd Man Out is, it has a number of redeeming virtues and is a must-see for James Mason fans.<br><br>Reed again focused his plot on his events that occur in city in turmoil. Last time it was Belfast and Vienna (The Third Man. Now it's post-war Berlin, and Germany divided into two. Reed liked these atmospheric, shadowy, morally bleak settings (they become almost a \"character\" in the film), and the physical (the East-West divide in Berlin, the zones of Austria) and emotional (the attitudes of the citizens of Belfast)barriers that engulf and separate people.<br><br>The Man Between was filmed in both Berlin and London, as Odd Man Out was also in Belfast and London and The Third Man in Vienna and England. Yet it doesn't have the visual pull of the other two films- perhaps because Robert Krasker is missing, but probably more so due to a smaller budget. The photography is nowhere near as inspired as in the other two films, and the filming in the first half of The Man Between is rather flat and ordinary. Once we get to the \"love-on-the-run\" scenes however, it picks up markedly and we start getting the trademark Reed camera tilts, shadowy streets and inspired visual flair.<br><br>Claire Bloom, that lovely, intelligent, graceful and ethereal actress, gives a wonderful performance as Sussan Mallison, a young English girl who travels to Berlin to visit her brother and his wife Bettina (the excellent German actress Hildegaarde Neff, looking strikingly like Ginger Rogers!). The film is really about Susan's personal journey, as she goes from seeing things in black-and-white at the beginning of the film to falling in love with Ivo Kern (James Mason), a criminal.<br><br>Ivo Kern immediately draws comparisons to Harry Lime in The Third Man and many have referred to Mason's performance (and the overall film) as a pale imitation of the earlier film, and a desperate attempt by Reed to repeat the success of The Third Man. Well, I have to disagree. Of course Reed wanted to make another film as successful, but he doesn't tell the same story in this film, no. The narrative is much more focused around the romance between Sussan and Ivo, whereas Lime is callous in his treatment of Anna (Valli), telling Holly Martin \"to be good to Anna, you'll find that she's worth it\". He only really sees her as a person that he can use; Kern wants to protect Sussan. And Kern, even though he is delved into post-war crime activities, still maintains his moral core...he seems tired, an unwilling accomplice in the attempt to get hold of Kestner.<br><br>Perhaps the film falters in that's it's themes and concerns are not as powerful as Odd Man Out or The Third Man, Reed seems to be lacking inspiration at times here. But the performances are excellent- Mason and Bloom are a joy to watch.Apparently Mason fell deeply in love with the young actress at the time of filming. And the chemistry shows. They seem so intuitive together in their acting-its the quiet moments, the glances and the touch of a hand, that almost give it away. They only kiss once, but it's still probably Mason's hottest screen kiss. It is lovely to watch these two work together, and so poignant (when you know about the off-screen stuff) to watch their final scenes together (\"Will we ever meet again, Ivo?\").<br><br>Perhaps the film's main flaw is that the first half is much too plot-driven, you really have to pay close attention to the film to know what is going on with the Kestner plot, otherwise you'll be confused (the heavily accented English from the German actors makes it even harder, though Neff is a clear and wonderful speaker). Mason too affects a German accent, similar to what he did with Rommel in The Desert Rats (he sounds a lot like one of my Uni lecturers who is German, so he must have been doing something right).<br><br>See it for the wonderful Mason and Bloom performances, chemistry and their scenes together. It's a good little film.","user":"jem132","rank":[26,26]},{"title":"Snow Covered Streets of Post-War Berlin","rating":10,"date":"12 October 2006","review":"This taut film noir when compared to Carol Reed's masterpieces of that genre, Odd Man Out and The Third Man, is a flawed gem, but still that - a gem.<br><br>Filmed in Berlin just eight years after WWII ended, and eight years before the Wall went up, it stars James Mason and Claire Bloom as star-crossed lovers in a city still digging itself out of the rubble made by Allied bombs, and still taking refugees from the east of Europe. The story tells of Susanne Mallison, a young Englishwoman who has arrived in Berlin to visit her older brother Martin, an army physician in the British sector of the city, and his German wife Bettina. It is while Susanne and Bettina are spending a day in the eastern sector, that Bettina finds herself reluctantly introducing Susanne to an old friend, the suave and handsome Ivo Kern. Susanne doesn't like Ivo at first -the audience isn't supposed to either - and she immediately becomes suspicious that he and Bettina are having a clandestine affair. She is curious though about the man, but will she learn the truth about Ivo and his mysterious background? <br><br>Meanwhile off the set of the film there was more going on behind the scenes between the two stars. From the book 'James Mason - A Personal Biography', by Mason's former sister-in-law and life long friend, Diana de Rosso: \"I was to observe another side of his character, rarely disclosed, when he came to London to finish filming The Man Between. He was a frequent visitor to our London home and he began to bring with him increasingly, his ethereally lovely co-star Claire Bloom...He showed a marked interest in the young actress. There was a quality about her, a stillness and tranquillity which set her apart from most artists her age, yet she had a pointed wit and a fine intelligence, virtues which appealed to James - and it was quite apparent that he was in danger of losing his heart. In truth I believe his heart was lost...His attachment to Claire was purely romantic. They used to sit on the floor together in our house, hand in hand, plainly adoring each other...\"<br><br>But as with Ivo and Susanne, it was the same with James and Claire. Mason did not divorce his estranged wife Pamela Kellino, and de Rosso was surprised that he didn't, but she has some theories. When he finally did get his divorce a few years later, Claire had moved on to other things in her career and private life. Still, when they met again several years later, it was clear that Mason still was very fond of her and she likewise.<br><br>When I first saw this film I questioned whether Mason's German accent was very good, but when I lent it to a pair of friends who are German, they said that he did a good job. As for the German supporting cast, it is the best, especially the lovely Hildegard Neff, and the hauntingly beautiful musical score catches the bleak feeling of the city during a cold winter. They are also reasons I list this as one of my favourite film noir productions.","user":"kitsilanoca-1","rank":[50,53]},{"title":"Painting The Light in Post War Berlin","rating":8,"date":"16 May 2008","review":"Sometimes a good movie blows you away from the get-go. This one took the light of the next day. Carol Reed cleverly disguises his picture with post war intrigue and ambiguous alliances / conspiracies in the first half, but this is ultimately at its heart the story of an impossible romance attempted at an impossible time. While it takes a good half of the movie to get to the real plot, once it cooks, it sizzles. The extended chase sequence in the last third of the movie probably tops the far more famous THE THIRD MAN, though it is a little less frantic and far more deliberately cat and mouse.<br><br>All of the cast is excellent, including the fetching and intriguing blonde wife, the mysterious young bicyclist, and the rotund, scheming elder German kidnapper. Leads James Mason and Claire Bloom (never prettier or sexier) have amazing chemistry as the picture develops, and one really wishes they had gotten together an hour earlier, because this is the heart of the matter and the meat of the movie.<br><br>Another major star of this movie is the location photography. The light and shadows draped on the characters flitting in and out of the jagged yet beautiful exo-skeletel ruins and debris of the once-glorious, cosmopolitan city of Berlin are hypnotic and amazing. The cinematography is remarkable; there is great POV work of the snow-covered kidnap vehicle stalking Bloom, but even better camera angles and lighting creativity in the bravura chase in the last 20 minutes (shockingly good given this film's relative anonymity.) <br><br>This isn't THE THIRD MAN or ODD MAN OUT, but it contains most of the best elements of each movie, plus a better romance than either of those. Interesting that Claire Bloom is forced to watch helplessly as James Mason is shot down at the end of MAN BETWEEN. Only about eight years later she would share the same fate at a similar location on the Berlin border in the searing THE SPY WHO CAME IN FROM THE COLD. A heartbreaking must for fans of postwar noir, Mason or Bloom.","user":"secragt","rank":[18,18]}]