[{"title":"One of Mickey Rourke's best performances in a darkly funny film","rating":9,"date":"15 January 2006","review":"\"Barfly\" was a fairly successful film when it was released and garnered generally favorable reviews. Roger Ebert gave it four out of four, and along with \"Angel Heart,\" it helped solidify 1987 as the Year of Mickey Rourke.<br><br>However, almost twenty years later it isn't talked so much about anymore, and I feel it deserves to be. Rourke gives one of his finest performances as Henry, a loner who walks hunched over like the Hunchback of Notre Dame. Henry works at a bar as a runner - delivering orders and such. But he's always getting into drunken brawls with the bartender, usually losing.<br><br>One day Henry's life takes a turn when he meets a downtrodden woman (Faye Dunaway) and they embark on a relationship.<br><br>\"Barfly\" is a great film. Rourke was vocal later on in his career about his dislike of director Barbet Schroeder, but Schroeder's direction is part of what makes this film so good.<br><br>However, the absolute best aspect of the movie is Rourke's performance. Embodying the late writer Charles Bukowski (whose work this was based upon, and who had a brief cameo in the film), Rourke is unrecognizable - like Billy Bob Thornton in \"Sling Blade,\" his entire demeanor and physicality seems to change.<br><br>I highly recommend \"Barfly\" - it's funny, dark, witty, touching and downright enjoyable. One of the best films of the '80s.","user":"MovieAddict2016","rank":[65,72]},{"title":"Bukowski's Only Hollywood Screenplay!","rating":10,"date":"28 June 2005","review":"What can we say about Barfly? A great picture. That's what we can say. A friend of mine recommended Barfly to me. I watched the start and it said \"Some people never go crazy, what truly horrible lives they must live!\" After that I was hooked, I knew this guy Bukowski wrote from the gut. I bought as many Bukowski books as possible. Pulp, Hollywood, and Women (my favourite!). I like his novels and short stories more than the poetry. But some of the poems are intense! The movie is also excellent. The two leads are great-Faye Dunaway is in high acting form here. So is Mickey Roarke who seems to have gotten under Bukowski's skin for the role......a side note he did the movie sober! This movie is directed by Barbet Schroeder who also did Reversal of Fortune. He also made the 4 hour Charles Bukowski Tapes (which I own) and it is good, but way too long! Bukowski drinks and reads poems. Back to the film-good supporting actors in this one. The beautiful Alice Krige (from Haunted Summer) is in this as well as David Lynch regular Jack Nance. Lynch was actually on set one day. Bukowski has a funny cameo a barfly in the bar where Mickey meets Faye. I heard that Dennis Hopper wanted to direct this and have Sean Penn star. Schroeder fought hard for it though. Hopper states Schroeder couldn't direct traffic! I guess he proved him wrong. Schroeder went into a production office with a power saw and threatened to cut off his pinky finger if they didn't put more funding into the film. Obviously a labour of love. So check it out if you can, the writing is top notch stuff.......Highly recommended. Thanx.","user":"moviefiend69","rank":[37,43]},{"title":"Not your typical Golan-Globus production","rating":8,"date":"25 April 2000","review":"Barfly is a rarity in American cinema: a character study that doesn't worry about telling a story with a beginning, middle, and explosive end. Mickey Rourke is excellent as Henry Chinaski, a writer and habitue of skid row who isn't so much slumming as soaking in it. The real surprise here is Faye Dunaway as his love interest: it's easily her best performance since Chinatown and proves she still has it. Also of note is Frank Stallone as Eddie, the barman who keeps getting into one sided fist fights with Henry. A triumph and one of the best American films of the eighties.","user":"JohnSeal","rank":[37,44]}]