[{"title":"Defending Chuck Norris my favorite underrated bad-ass action war flick","rating":8,"date":"7 May 2017","review":"In Thursday 4th May Chuck Norris arrived in Ljubljana Slovenia and he visit us to make a car commercial. He stays by us till tomorrow then he returns back to his homeland. I love Chuck Norris I grew up watching his movies and Missing in Action defines my childhood and I grew up watching this movie. I am writing this review in honor of Chuck Norris. Slovenia loves Chuck Norris! <br><br>Missing In Action is an underrated solid, very decent, good, pure bad-ass action war flick. It is my number 1 favorite Chuck Norris movie! I love this movie to death and I have it on Blu-ray in Hi-def in my collection. I love the music score from Jay Chattaway it is a beautiful score. it is rated Hard-R RRRRRRRRRRRRRRRRRRRRRRRRRRRRR. It is not for kids it is a pure sample entertaining flick, it has explosions, a lot of gun shootouts, martial arts, climbing the electric wire and walls, you have even bobby traps, you see a lot of boats on the water, a lots of jungle and it is one-man army action hero type. One man on a mission to find American POW's who are still imprisoned in the country. You'll see lots of heavy automatic and explosive weapons, and you'll see them used well. This is my favorite Chuck Norris film for the simple fact that it has one of the best action hero moments ever with Braddock coming out of the water in super slo- mo and blasting bad guys to pieces.<br><br>Missing in Action and Missing in Action 2: The Beginning were made back-to-back, with part 2 being ready first, so they released it as this movie, Missing in Action. I am defending this film: Why I am keep hearing from film critics and assholes like Maziun who has no dick about movies how bad this movie is, it is as a rip-off of the Rambo film series. Rambo was better, Rambo was looking for American POW's and blah, blah, blah! Shut up all of you!! Missing in Action and Chuck Norris is not yours kind of type action hero or his movies, they are just not for you so f**k You! <br><br>\"It was more like 20,000. Why don't you tell us why there was a price on my head?\" *For your war crimes, of course.* , \"For killing assholes like you!\" <br><br>I am big fan of Rambo movies I love all of them, but Missing in Action is different Vietnam action-War movie who is really fictional portrayed. The movie is not perfect, it is not great, realistic, or the best it does have a plot holes which I am little confused but I love Colonel James Braddock I love the character portrayed. Chuck Norris does a fine and solid job as the hero. I love the action the rescue mission I love this movie from the 80's and I miss these kind of action movies today. They don't make'em like this anymore. He saves people, he saves 4 American POW prisoners and he help them I love the ending of the movie. I love the jungle I love how Col. James Braddock (Chuck Norris) uses the M60 during the POW rescue mission and he opens fire with the M60 mounted on the fast boat classic scene and he blast all the bad guys away.<br><br>There's a lot of Chuck Norris sneaking around in this movie more than Norris smashing guys, but that's present too. Norris doesn't take any crap, and I love the muscle duel between him and one enemy where Chuck slaps a knife right into his heart, literally. James Hong makes an appearance as General Trau as the villain and he's good at his job. He constantly taunts Braddock until Braddock literally attacks Trau in his sleep! The movie really lets you know where they stand on the issue of whether or not there are POWs being secretly kept in Vietnam with its exhilarating, \"In your face, Vietnamese government!\" ending.<br><br>Missing in Action get's 8/10 it my favorite Chuck Norris film a brisk action/adventure with good old Chuck playing a stoic American super soldier fighting for America's freedom no matter the risks. It's a great Regan-era action flick, unapologetic and brutal.<br><br>Missing in Action is a 1984 American action film directed by Joseph Zito and starring Chuck Norris. It is set in the context of the Vietnam War POW/MIA issue. Colonel Braddock, who escaped a Vietnamese prisoner of war camp 10 years earlier, returns to Vietnam to find American soldiers listed as missing in action during the Vietnam War. The film was followed by a prequel, Missing in Action 2: The Beginning (1985), and a sequel, Braddock: Missing in Action III (1988).<br><br>8/10 Grade: B Studio: The Cannon Group, Inc. Starring: Chuck Norris, M. Emmet Walsh, Lenore Kasdorf, James Hong Director: Joseph Zito Producers: Menahem Golan, Yoram Globus Screenplay: James Bruner Story by John Crowther, Lance Hool Based on the characters by Arthur Silver, Larry Levinson, Steve Bing Rated: R Running Time: 1Hr. 42 Mins. Budget: $2.550.000 Box Office: $22,812,411","user":"ivo-cobra8","rank":[37,40]},{"title":"classic....","rating":8,"date":"28 January 2005","review":"CLASSIC.........bad movie. It does all the things that critics would laugh at and more. It has bad acting, and a lame story. However, it's a lot of fun for those of you that enjoy lazy afternoon cheeseball films (such as myself).<br><br>The best scene has to be the slow motion shot of Chuck Norris emerging from the swamp water with a rifle letting rounds off and keeping a \"stone face\"...hahahaha.<br><br>Oh wow, how i love this movie. You really cannot argue a movie's credibility with a powerhouse lead actor such as Chuck Norris.<br><br>RATING: 8/10 - Because it's an entertaining bad movie...great for those times when you're bored out of your mind on a rainy day.","user":"siektwo","rank":[55,80]},{"title":"Quit Your Whining, Liberals--It's a Guy's Flick","rating":10,"date":"3 November 2003","review":"After reading all the Bin Ladens here claiming that \"Missing in Action\" is a \"pseudo-patriotic\", \"racist\" or jingoistic film, I thought I'd weigh in: \"M.I.A.\" was made for the same audience that all overdone, action-packed, unreal, B-films are, AND for the same purpose--pure entertainment. I'm no mind-reader but the people watching \"M.I.A\" aren't doing it for a serious understanding of past social and political issues or controversies. They're watching it to see guys get beaten up with karate moves or shot up by M-60s, or to see completely naked women make total asses out of themselves by dancing around or strutting their stuff. I pity those who use their review of this film to make some grand, anti-American political statement. If you know what Norris flicks are like and you can't stand them, why the Hell did you pop this one in!?","user":"yarborough","rank":[70,118]}]