[{"title":"Use only as directed...","rating":7,"date":"12 May 2006","review":"*batteries not included is a very underrated movie, especially among reviewers on the IMDb. The pros, such as Roger Ebert seem to give it some respect (along with 3 thumbs up). There was nothing sugar coated about the performances of the 5 main characters in *batteries not included. Jessica Tandy gives one of the best performances of her career as Faye Riley who appears to be in the early-to-mid stages of Alzheimer's disease. Hume Cronyn is Faye's husband Frank, owner of a small diner with no customers. Elizabeth Peña is Marisa Esteval, a single soon-to-be mother who clings to her statue of the Virgin Mary for what little hope she has. Dennis Boutsikaris is the cynical artist/painter Mason Baylor, who has a heart as big as his artistic talent, yet no one other than Marisa seems to acknowledge his talent. Finally there's Frank McRae as the former boxer extraordinaire Harry Noble, now living in the basement of the building that houses each character and the Riley's diner. Oh... Harry watches way too much TV... especially the commercials. His only lines (which were few) in this movie were lines from commercials. This movie represents a cross section of people who are on the verge of losing their homes to a real estate developer, who will stop at nothing to get them out of their building. After throwing large sums of money at them (to no avail), the developer hires Carlos (Michael Carmine) to run them out using whatever means are necessary, including force. The characters are developed to the point that you actually care for all 5 of them. Just when it looks hopeless for our friends, small spaceships, compliments of Industrial Light and Magic show up and start fixing everything. And flipping burgers in Riley's Dinner. They also wash dishes, repair broken Virgin Mary statues and stopwatches and they replicate using spare pots and pans and electrical appliances, fused together by at least 1.21 gigawatt's of electricity. Although the aliens are portrayed as mechanical beings with heart, they certainly give hope to the residents, and help bind them together. The visual effects are a treat... especially for those of us who have tired of CGI effects that look more like a cartoon than reality. There's something about filming a real model, built by human hands against a blue screen, then matting it into the film that makes it look more realistic than computer animated visuals. Many have written that this movie tries to suck the viewer in, using emotional techniques, as opposed to making it an intellectual masterpiece. I believe it takes more talent to get the audience to emotionally invest themselves in a movie than to create eye candy. Thanks to great acting, a decent-enough script, good cinematography and an equally emotional score from James Horner, this picture works in every way... even 20 years later. If you haven't seen this movie in 20 years, go ahead and give it a spin. It's as good today as it was in 1987! Prices may vary in Alaska, Hawaii and Puerto Rico...","user":"jimbo700","rank":[70,77]},{"title":"Sweet","rating":7,"date":"22 November 2001","review":"This movie sticks out of my memory from my childhood, because I remember it as a heart-warming tale, touching and tender. Today, I still like it, it continues to be a sweet story about ordinary people who find the extraordinary. Jessica Tandy and Hume Cronyn are very good, and make the acting juice of this movie. Liked it, and am still able to see it anytime!","user":"Dockelektro","rank":[33,36]},{"title":"Excellent, light hearted science fiction","rating":10,"date":"4 June 2003","review":"This film does, as suggested, bear semlence to Cocoon, however it contains a far richer storyline and a generally superior level of acting.  This film while not specifically being a comedy tells a relativly amusing story of a group of residents of an old building, targeted for demolition, visited by alien 'devices' (the nature of which remain undisclosed throughout), who help them by fixing everything in their path in exchange for some power and spare parts. As for the level of comedy, well it depends on your sense of humour, I certainly found the funny bits, well, funny, and not in the usual 'in your face' american comedy style.","user":"john_braham","rank":[47,55]}]