[{"title":"a maligned minor classic","rating":18,"date":"18 May 1999","review":"This remake of Ernst Lubitsch's wartime comedy has often been dismissed as a ham-fisted and unnecessary vanity exercise. This is grossly unfair, as the Brooks' version is in fact a deft and funny comedy that stands up well in comparison to its forebear. Mel Brooks and Anne Bancroft make their own the roles of the Bronskis, a Warsaw theatrical duo (\"world famous in Poland\")who star in revues at the Bronski theatre. When war breaks out the Bronskis become brood-hens to an ever-growing community of Jewish refugees while staying one step ahead of the Nazis. Brooks and Bancroft are fine in the roles of the battling Bronskis, particularly Mel Brooks who finds a touching level of vulnerability beneath the bombast and bluster of Frederick Bronski. Despite the farcical and improbable plot twists, the narrative is sound and genuine pathos registers throughout the film. Those with fond memories of Jack Benny and Carole Lombard in the lead roles may have boycotted this on first release, but they have denied themselves a rare treat - a sure-footed and genuinely entertaining film.","user":"Jamie-58","rank":[42,49]},{"title":"Definitely meant \"to Be\"...","rating":10,"date":"9 February 2000","review":"I haven't seen the Ernst Lubitsch original of this gem but if I had, I might have been prejudiced in my decision of this being one of the finer films that Mel Brooks has been in.<br><br>Though not written by or directed by Mel, he and wife Anne Bancroft take center stage as Frederick and Anna Bronski, Poland's most famous acting family.  When the Nazi war machine overtakes Warsaw, they and their acting troupe use every actor's trick in the book to escape and make their way to England.<br><br>All this, of course, while Anna becomes smitten with an American pilot (Matheson) who helps them both to freedom.  In the meantime, there are threats from a devious doctor (Ferrer), a lecherous Nazi colonel (Durning) and a command for the troupe to perform for the Nazi Army with Hitler in the audience.<br><br>There are so many classic moments here that to list them would be a dis-service to the movie.  Let me just say that I enjoyed this whole film from opening to closing and even the closing had some doozies. <br><br>\nThe Nazis are seen as complete buffoons and the exchanges between Durning and his head officer (Lloyd) are classic.  In fact, I can see why Durning was nominated for an Oscar for his role here; not just anyone could have pulled it off as well as he.<br><br>Everyone here has a good scene or two, including Mel's regulars (Graham, Wyner, Riley) and the dialogue even manages to get the proper sentiment and tension out of the proper scenes.  A great effort by all involved. <br><br>\nPurists of the Jack Benny original may disagree, but this \"To Be or Not to Be\" is the \"to Be\" for me!<br><br>Ten stars.  Mazeltov!","user":"Mister-6","rank":[37,44]},{"title":"Homage to Jack Benny","rating":9,"date":"24 December 2006","review":"Actually, when interviewed about this movie, Mel Brooks said it was an homage to Jack Benny. And if you look, the Bronskis live on Kubelsky Street, Benny Kubelsky is Jack Benny's real name. There are many other touches that also show Brooks' love for the original. Anne Bancroft is a true treat. Her comedic talents shine, she was truly a rare actress, and will be missed.<br><br>It was well done, with Mel Brooksian flair, and respectful of the original. I won't add comments about the acting, there are so many pros and cons at this point, one more won't make a difference. But if you have some free time, see BOTH of the movies. It's not sacrilege to like them both.","user":"kb2uoe","rank":[20,23]}]