[{"title":"It doesn't get any better than this: this is movie history","rating":10,"date":"24 December 2013","review":"This one only gets better with each viewing. Leone's masterful storytelling and Morricone's crazy, beautiful, epic soundtrack; desperate, haunted faces which look like the barren landscapes the story is set in and a plot that unfolds with impeccable pacing to culminate in THE ultimate western finale.<br><br>As in Leone's previous films, music isn't just used to add to the atmosphere but is essential to the story, or perhaps even more: Morricone's main musical theme plays the actual role of a (or rather: the) protagonist in the film. <br><br>Anyone who thought that the so called \"Spaghetti westerns\" were nothing but cheap, violent B-movies had to reconsider after seeing this film. It doesn't get any better than this: this is movie history; iconic, classic, unforgettable, epic. For this film, I just run out of superlatives.<br><br>My vote: 10 out of 10<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[191,213]},{"title":"No western has ever come close to this one....and no western ever will.","rating":10,"date":"23 June 2002","review":"I can't quite find the words to even come close to describing the pure brilliance of this movie. When this movie was made, the western genre was dominated by the big hollywood studios. The western was taken by these studios and transformed into an opportunity to portray classic superheroes like John Wayne and Burt Lancaster in their fight against all sorts of smalltime crooks and outlaws in smalltime stories and smalltime towns. It was a genuine effort to portray 'Americanism', the American Way, along with a romanticised view of the west as 'Frontier country' where good always triumphed over bad and where the life was hard but honest. It was the American Way.<br><br>And then came this film. The title, 'Once Upon A Time In The West' must have seemed to mean nothing more than 'just another western' to the unexpecting viewers at the time. Oh boy were they wrong. With this movie, Sergio Leone singlehandedly redefined the western genre and no American western would ever match the brilliant spirit in which it was made. While the story is basically the same as in any other western, it is the WAY in which it is presented that so clearly distances this western from others. Whereas other westerns are simply stories that are designed to entertain, this movie is an emotional masterpiece that will move your heart. Sergio Leone takes the ordinary western and replaces words with looks, and conversations with feelings and emotions. With his brutal but honest portrayal of the sheer hardness of life and death in those times he thoroughly destroys the old romantic idea of the west as a 'generally-hunky-dory-kind-of-scene with the occasional bad guy and indian' and replaces it with an eerie, dark, hot and dry place where life is cheap and only the strongest will survive.<br><br>I cannot adequately convey in words the way in which Sergio Leone deepens and defines the characters by pure means of visual persuasion. It starts with the three gunman in the beginning of the movie, waiting for some reason at a train station for someone or something that obviously is going to be on the next train. No explanation, no conversation; not a word is said. Even the stationmaster is ushered into captivity without a single audible threat. Then comes the waiting... Any other director would have skipped directly to the moment of arrival, but Sergio Leone takes minutes of boredom and translates it into a visual feast, deepening the characters that are portrayed and making them more human, more real to the viewer, while at the same time encompassing us with a deep dark sense of foreboding. This way in which the story is not just augmented but in times completely replaced by the sheer visual drama, is perfected by the absolute fantastic music, directed by Ennio Morricone. Who needs words and explanations when the combined forces of cinematic mastery and heart-tearing music are not just able to carry the story, but pick it up and push it up to such heights of excellence that it has no equal in it's genre?<br><br>Another great feat that adds to the power of this movie is the minimalistic way of portrayal of the characters as real, emotional people. Not a single word is said that isn't required for the understanding of the story, yet the characters feel more true than those in movies where whole conversations are added merely to explain their motives. Instead of words, the camera focuses on the characters...so that you can simply read the emotion off their faces. Often no explanation is given other than than a mere facial expression. No superheroes or supercriminals, just real, desire-laden, traumatised, obsessed people that act upon motives inherently understood by the viewer.<br><br>All in all this is without a single doubt in my mind the greatest western of all times, and even though Sergio Leone has made many more mindblowing, heart-shattering westerns like this one, like 'A Fistful of Dynamite', 'The Good The Bad and The Ugly', and 'For a Few Dollars More', none could equal 'Once Upon A Time In The West' in sheer magnitude of perfection. Western has never been the same since....<br><br>I only wish I'd have been there in 1969 when the movie was new and see it, for the first time with fresh innocent eyes and an unexpecting mind..just like 2001: A Space Odyssey (also of 1969, a year of legends).<br><br>A tip for those who have never seen this movie: Bribe, beg, borrow, or steal yourself into possession of a Videobeam and Hifi-audio equipment if you can't find a cinema that is showing this movie. Turn the audio up WAY HIGH (never mind the neighbors) and prepare never to be the same again.........<br><br>I (obviously) gave this movie a 10 because no matter how hard I try I can't find anything less than perfect about it.","user":"daniken","rank":[794,999]},{"title":"Art","rating":10,"date":"21 January 2016","review":"This is my fav film. It is more like watching a piece of art. The look is fantastic. The director does a perfect job. The acting is wonderful. The story is not the strongest ever but it should be watched to experience it. If your a film lover you can't fail but admire this film.Charles Bronson is the perfect broody loner. Henry Fonda surprises everyone by giving a strong performance as a bad guy. The close up of his eyes is stunning. The camera work and close ups have never been done better. The music is as good as anything you will find in a movie. Throw in the scenes when you first see Henry Fonda. The scene at the railway station which the water dripping on the hat. The sound of the spinning water tower. To me the closet movie to ART i have ever seen and i have seen a lot of films.","user":"daxsir","rank":[47,55]}]