[{"title":"Still Has Its Magic","rating":27,"date":"27 September 2004","review":"Judy Garland's portrayal of Dorothy, Dorothy's oddball Oz friends, \"Somewhere Over the Rainbow\", and the rest of this fine production of \"The Wizard of Oz\" have lost little of their magic over the years. While it has become oddly fashionable in recent years to deride this kind of classic, innocent fantasy, the movie itself has aged very well, and it is likely to retain an appreciative audience for some time to come.<br><br>There's no doubt that part of the appeal of the story and the characters comes from them being such old friends to so many cinema fans, but there are also good reasons why they have endured for so long, and have been able to hold up even after becoming so familiar. Although Dorothy is not a particularly complex character, she represents an innocent but deep yearning that is easy to identify with. Likewise, the 'Oz' characters are bizarre enough to remain interesting, but there is a core of substance that again is easy to believe in. Who does not feel that he or she could use at least one of the things that Dorothy's friends want?<br><br>The adaptation from the original story is done quite well, making fine choices for the characters and episodes that would work on film. The settings and visual effects may not impress the devotees of today's computer imagery, but in their time they certainly demonstrated a great deal of skill and planning, and even now, in their own way they are more believable than are most of the computer tricks that have become so overused.<br><br>The popular story has also been used for a number of more recent adaptations, and some of them have had some good points of their own. But this Wizard remains by far the most wonderful of the versions of the classic tale.","user":"Snow Leopard","rank":[104,117]},{"title":"A true cinematic milestone","rating":10,"date":"7 May 2006","review":"Where to begin? MGM's elaborate adaptation of L. Frank Baum's 1900 fantasy classic THE WONDERFUL WIZARD OF OZ not only became an institution among itself (and practically defined the concept of modern popular culture), but is reported to be the most viewed film ever made. A sharp screenplay effectively condenses the novel's text into a workable film, and director Victor Fleming (along with countless other behind-the-scenes technicians) craft a visually stimulating fantasy world that surpasses the expectations of even the most imaginative viewers. Brimming with stunning visual effects (the film's fierce tornado is an FX feat that has yet to be surpassed by CGI), witty dialogue, and eye-popping Technicolor, THE WIZARD OF OZ truly lives up to it's reputation as a once-in-a-lifetime film where every element comes together flawlessly.<br><br>The cast could not be improved upon. The quivery-voiced, solemn-faced Judy Garland will always be Dorothy, the little lost farm girl on the road to Oz, clutching her beloved Toto (impressively portrayed himself by the female canine performer Terry, the terrier). It seems inconceivable that MGM had originally wished to cast Shirley Temple in the role, as Temple's doe-eyed, cutesy-voiced shtick would have been a catastrophic ill-fit for the tone of this picture. Conversely, Garland is perhaps the screen's quintessential woman/child; always seemingly just one step away from reaching full emotional maturity. It is her sadness that transfixes viewers to the screen, the exact same quality that made the film's most memorable Harold Arlen/E. Y. Harburg number \"Over the Rainbow\" into one of the most exquisite marriages between artist and song ever to be recorded.<br><br>The remainder of the cast is similarly exceptional, many of whom perform perfectly even under the most debilitating make-up and costumes. Frank Morgan is marvelously versatile in no less than five roles, the insanely energetic Bert Lahr mugs brilliantly, the handsome Jack Haley swoons sweetly, Billie Burke lends the film an ornate ethereality, and Ray Bolger's gravity-defying physical presence nearly steals the entire picture on several occasions. Perhaps most notable is former schoolteacher Margaret Hamilton's transformation into the wickedest of wicked witches, which certainly remains among the vilest and most terrifying portrayals of full-throttle evil ever to be seen. No matter how it is analyzed, scrutinized, or satirized, the 1939 production of THE WIZARD OF OZ is a top-notch example of how to turn a great story into a fabulous, milestone of a film.","user":"robb_772","rank":[102,118]},{"title":"A Wiz of a film, if ever a Wiz there was","rating":11,"date":"11 August 2003","review":"The NBC Peacock began unfolding its wings.  \"The following program is brought to you in living color--with portions in black &amp; white--on NBC.\" That exclusive intro began my exposure to color television at Grandma's in 1968.  When Dorothy stepped out into Technicolor, I'll bet my eyes just popped.<br><br>This is the Movie of All Time, folks--a status achieved during its long run as a huge annual TV event during that classic era whose programs now show up on TV Land network.  In the 1970s, Peter Marshall once read the answer on Hollywood Squares as to the program seen more times by more people than anything else ever shown on television.  It was \"Oz.\"  Likewise, no movie has the hold on popular culture that this one does.  What lion character ever since (i.e., Snagglepuss) hasn't been an impersonation of Bert Lahr going, \"Put 'em up, put 'em uuuuup!\"<br><br>Few musicals offer an equal combination of lovable music and engaging story. Perhaps \"The Sound of Music.\"  Hard to think of many Hollywood musicals where the story gets as serious as it does here when the Witch informs Dorothy that, \"The last to go will see the first three go before her...and her mangy little dog too!\"  Yikes!  In contrast, even the best of other Hollywood musicals seem to serve up fluffy, forgettable story lines that are mere backdrop to the song numbers that typically put the plot on hold.<br><br>I can't say that \"Oz\" doesn't have technical flaws or story element inconsistencies.  It's just that the astonishing production values all around so overwhelm the shortcomings.  The tornado sequence is a 1939 special effects tour de force--incredible.  And the Nutcracker-quality musical score offers songs tastefully interwoven with the action.  Certain numbers like \"Merry Old Land of Oz,\" I never get tired off, though I like each of the songs.<br><br>Oz should be viewed in the lightness of spirit that it deserves.  I mean look, we have Frank Morgan as the Emerald City gatekeeper, then seconds later as the cabbie with the Horse of a Different Color, then the Wizard's palace guard, and then the voice of fire-and-smoke Wizard of Oz who bellows, \"Step forward, Tin Man!\"  What other film could put an actor go through 4 quick-changes within 10 minutes to such an endearing result?  \"Oz\" is as magic as those sparkling ruby shoes.<br><br>The early Technicolor process utilized triple nitrate negative strips--separately recording each primary color in light.  This was done due to the lack of a suitable \"color film\" in 1939.  That would quickly change--but films from years following suffered from hues that faded with the years, even original negatives.  Because \"Oz\" was actually filmed on a black-and-white base film, the negatives never faded.  So now we have home videos/DVDs of breathtaking color quality.  Now, the tinted filters in the cameras that separated the colors onto the negative strips meant that intense illumination was required, rendering the filming experience miserably hot for the actors involved, especially Lahr.  But they all hold up amazingly well.<br><br>\"Oz\" has a valuable message.  As the pop group America once said, \"No, Oz never did give nothin' to the Tin Man....that he didn't, didn't already have.\"  If we have truly search, we can find within us--or create through trial, like the Lion's courage--what we think we most lack.  The Wizard (like the Lord) helps those who find help within themselves.<br><br>I feel sorry for the Almira Gulches who can't treasure this film experience. They need to visit the Emerald City to get their own ticking Testimonials and find their hearts.<br><br>Didn't bring your broomsticks with you?  Well, I'm afraid you'll have to walk.","user":"DonFL","rank":[127,152]}]