[{"title":"A \"gem\" from the 80's","rating":13,"date":"13 January 2004","review":"This is a lost gem of a movie from the generation of \"E.T.\", Indiana Jones, Star Wars, etc...<br><br>When a friend showed it to me on VHS in 1984 I loved it for its originality, warmth &amp; humor, as well as being impressed with the first-time computer-generated special effects for this kind of sci-fi film.<br><br>When I saw the 'special edition' DVD in Widescreen I snatched it right up and found that I enjoyed it as much as I did 20 years ago! The movie's special effects still looked good to me, especially the \"Star Car\" (my personal favorite).<br><br>But the special effects are not the centerpiece of this film. It has plenty of charm of its own to offer in plot, story, warmth, humor &amp; good performances.  Craig Safan's music score for this film is one of my all-time favorites.  It almost outsizes this movie but it fits just the same.<br><br>\"Starfighter\" is a real gem from the 80's I will treasure in my movie collection.","user":"dirvine-2","rank":[99,105]},{"title":"Cool really cool","rating":10,"date":"8 June 2005","review":"Another film from my youth and fabulous. A kid from a trailer park is recruited to fight in an intergalactic battle against an evil madman and his unstoppable armada in a star fight to the death. And he doesn't want the job. I really got into this one it's totally enjoyable. There is a lot of humor and action mixed quite well. Robert Preston is like butter he's good no matter what. He delivers the quips and jokes with just the right amount of wit and energy. And he warms your heart. I miss that guy I was very sorry to find out he had passed on. I remember him from many films like Beau Geste and the Music Man. I simply cherish this film and many other people do too.","user":"arthurclay","rank":[46,48]},{"title":"Fantastic Sci-Fi Movie that captures the spirit of 80's Cinema","rating":10,"date":"23 June 2005","review":"The story is simple and has probably been retold in every heroic setting possible. It's also a bit of wish fulfillment for those of us that grew up pumping quarters into arcade video games.<br><br>In my opinion the acting is above average for a movie like this. It is much helped by veteran actors Robert Preston and Dan O'Herlihy. Lance Guest does a great turn as Alex as well.<br><br>The effects were not appreciated at the time, I think, but hold up fairly well. They were drawn on that Holy Grail of computers to us children of the 80's; a Kray Supercomputer.<br><br>The score is well done, the humor timed well and the overall good feeling I get from watching it never fades. You can't go wrong with this gem.","user":"seanboud","rank":[78,84]}]