[{"title":"Unfairly kicked around by its critics","rating":9,"date":"10 June 2000","review":"This is probably one of the most offensive masterpieces ever made. There's no reason to argue with many of the objections against it, but the main criticism- that Hoffman is battling his Amy's rapists for sexual mastery of her- is unfair. Many of the film's critics don't seem to realize that what the audience learns about events is completely different from what Hoffman knows. He never learns that the villagers raped his wife; and he's never completely sure that Nyles, the villager he's defending, *didn't* rape a girl. He never realizes that the villagers are hypocrites for raping his wife and then hunting down Nyles as a \"perverted animal.\" And he never realizes that his wife wants to throw Nyles out not because she's an immoral coward, but because, after being raped once, she doesn't want to defend an accused rapist. Amy is not the object of his fight, which is why he asks her if she wants to leave in the middle of it. She's as irrelevant to him as the villager he's defending. Hoffman's only concern is his house, which Peckinpah views as the symbol of his manhood. They're both under construction and assault by the villagers. When Hoffman has finally defended his house, he decides that he doesn't really know his way home; his manhood is worthless to him. It's difficult to understand why the film's critics view its climax as an expression of Peckinpah's supposed belief that women must be seized through violence. Hoffman never even knows that Amy's part of the contest, and even though we do, we're left with the impression he's lost her, not earned her, because of his battle.","user":"Mark-574","rank":[195,228]},{"title":"\"This is where I live. This is me. I will not allow violence against this house.\"","rating":8,"date":"25 February 2007","review":"Sam Peckinpah's 'Straw Dogs' begins peacefully enough, offering only a few subtle hints of the graphic rape that would form the centerpiece of the film, and unbridled violence that would comprise the harrowing final act. David Sumner (a brilliant Dustin Hoffmann, 'All The President's Men'), an American mathematician, arrives in a quaint Cornwall town to be met with a certain level of hostility. He and his British wife, Amy (Susan George), have moved back into Amy's hometown to escape violence and crime in the United States. The irony of this motivation, even at the beginning of the film, is not lost.<br><br>David is very much an introvert. The job of a mathematician requires hours of quiet time to think and ponder, something he just can't get. His wife Amy is immature and disruptive, though we can't blame her; David has little time for her amidst all his mathematical calculations, and he treats her cries for attention as one treats a child, at one point telling her \"you act like you're fourteen years old.\" As days go by, David and Susan face increasing levels of harassment from the local residents, most particularly the four young local men who have been employed to build their garage. The harassment begins quite modestly, with David  the outsider  becoming the butt of local jokes, whether it be because he has trouble trying to start his battered old car, or because he tries to enter it from the wrong side. On his first visit to the pub, David requests \"any American brand of cigarettes,\" an unwise move if you wish to make friends amongst the fiercely patriotic country folk of Cornwall. He would later buy the stone-faced men around him a round of drinks, but doesn't sit around to enjoy it with them.<br><br>After a somewhat leisurely opening thirty minutes, we suddenly recognise that things are getting serious when Susan's cat goes missing. This event in itself is not particularly ominous, since the cat goes missing all the time. However, when David pulls on the light switch in his bedroom closet, he is understandably startled to find his strangled cat dangling limp from the cord. Despite his insistence that \"it could have been anyone passing by,\" we already know who murdered \"kitty.\" David vows to confront the four local men, endeavouring to \"catch them off guard\" and force a confession. However, given David's typically shy and pacifistic nature, he subsequently loses his courage and backs down.<br><br>David's \"confrontation\" invariably ends in his accepting an invitation to go hunting the following day. Whilst David takes pot-shots at the passing birds (with little result), one of the men, Charlie Venner (Del Henney), a former lover of Susan, drops into the house. Susan demands that he leave, but he casually casts aside her pleas and starts to kiss her. Susan resists at first but, shockingly, at times she appears to return his affection. Nevertheless, the rape scene is difficult to watch, and Peckinpah masterfully intercuts the quickly-cut scene with images of David standing obliviously amongst the scrub, still actively trying to shoot down ducks. Another of the men arrives at the home, and a second uncomfortable rape scene follows. Once it is all over, we find David finally shooting down a bird, only to find that it isn't a duck. Disappointed that he has made such a careless mistake, he drops the dead bird into a bush, no doubt assured that the worst thing to happen today was his inability to hunt. When he next sees Susan, she says nothing to him; and she never will.<br><br>When a mildly mentally-challenged local man, Henry Niles (David Warner, who was uncredited due to insurance complications), also a convicted child molester, accidentally murders a teenage girl who made advances towards him, the drunken father of the girl wants his retribution. Niles, stumbling through a heavy onset of fog, finds his way in front of David and Susan's car, and they bring him to their home until medical assistance can arrive. However, the murdered girl's father and the four men who had been building David's garage turn up outside his house with only one thing on their minds: getting inside that house and getting to Niles. The previously mild-mannered David, on the other hand, has alternative plans for these men.<br><br>The title of the film is drawn from a common translation of 'Tao Te Ching', an ancient Chinese philosophical treatise: \"Heaven and Earth are impartial; they see the ten thousands things as straw dogs. The wise are impartial; they see the people as straw dogs.\" Many ancient Chinese ceremonies included the use of grass-woven dogs, which were revered and respected during the ritual, but afterward discarded and burnt. Perhaps the title symbolises David's underlying attitudes towards human lives as the men begin to invade his home  we are all straw dogs, made only to be destroyed.<br><br>Whilst David's moral reasoning for defending his home is to prevent Niles' bloody death at the hands of the mob, he appears to take grim satisfaction in murdering the intruders himself. Once all are good and dead (the most nasty mode of death involving a fully-sprung bear trap), David stands aside, a peculiar grin evident upon his face, exclaiming to himself, \"Jesus. I got 'em all!\" He is not disgusted or sickened by the deaths he has forced himself to orchestrate  he is actually satisfied, invigorated. He is proud of his achievements.<br><br>What could have possibly precipitated this sudden change in David's character? From a logical, mild-mannered, peaceful man arose a methodical killing machine, who shockingly takes pleasure in his multiple kills. Then we suddenly realise. These qualities were within David the entire time. Indeed, they subconsciously inhabit the hearts of all men. He just required the horrific circumstances of that night to bring about the alarming conversion.","user":"ackstasis","rank":[24,26]},{"title":"Fantastic thriller that holds its own after 30 years","rating":8,"date":"24 May 2003","review":"Straw Dogs is an intense thriller that shows what can happen when you push even the most mild mannered man too far.  Dustin Hoffman plays a mathematician who temporarily moves to a house in a rural village in England with his wife, a former resident of the town, played by Susan George.  The two withstand incessant needling from several of the townsfolk until George is raped and assaulted and Hoffman is pushed over the edge.<br><br>\nIncidentally, right after watching this film I found a documentary on cable about filmmakers from the late '60s to late '70s and one of the directors profiled was Sam Peckinpah.  I had always considered his films to be violent and vaguely shocking, which never surprised me, knowing that he was a hard-living maverick who did things his way - an element that is resplendent in most of his films.  A brief mention of Straw Dogs was included in this documentary, where they described it as a \"sexist film\".  There are obvious scenes in the film that could support this criticism, but I think that is overanalyzing the film with a political correctness that is out of place. While the two female characters are both victimized, Susan George also has her moments of empowerment. I may be a female, but I don't consider Peckinpah's tendency to make testosterone-driven films any more sexist than anything that Tarantino puts out, and I'm a big fan of his work as well. It's a dangerous line to draw when one labels a film due to what is *not* included in a film.  <br><br>What this film does contain is much more stellar - Hoffman is beyond incredible in this film.  His character development is amazing to experience.  One criticism of the film that I heard from a friend who saw it before me was that it \"dragged.\"  I couldn't disagree more.  The development of the story until the extremely violent climax is a perfect pace because it made me feel like I was sitting in a dentist chair, knowing that this low boil could explode at any time.  After the dust settles, the viewer is left to decide whether Hoffman's character made the right decision, and left to speculate on the ramifications of the choices made.  This is by far one of the best films I've seen in recent months and plan to seek out the newly released Criterion edition in my quest to find out as much about this film as I can.<br><br>--Shelly","user":"FilmOtaku","rank":[68,80]}]