[{"title":"Charming, and a wonderful for lovers of theatres.","rating":20,"date":"20 December 2002","review":"'THE SMALLEST SHOW ON EARTH' may not have been exactly that since there were certainly smaller, but it was a case of a fictional small \"electric theatre\" (the once British way of differentiating a movie theatre from a legitimate theatre or 'music hall,' as they designated their version of the American vaudeville). This delightful British film is as heart warming and sometimes hilarious as the other reviewers here describe, but it is the wonderful interaction between the story, the sets, and the actors that balance the film and make it a classic. This 19th century 'kinema' was styled in the manner of the traditional British 'music hall' of live performers, but held early projection equipment (hence the double entendre about projectionist Peter Sellers' 'equipment.') Such asides will be over the heads of the kiddies, but the pleasant pacing and careful dialogue of the actors will please the adults for whom this comedy is intended.<br><br>The story of a young couple inheriting a cinema and finding that it is not quite the money-maker they imagined would have been prosaic were it not for the clever settings and the three fossils who maintained the old \"Bijou\" (French for 'jewel'). If it were ever a jewel, it had lost its luster as the years passed and patrons flocked to the newer nearby movie palace, the \"Grand.\" Desperate to keep their jobs, the 'fossils' (veteran scene-stealers: Peter Sellers, Margaret Rutherford, and Bernard Miles) took pains to refresh the old place to please new owner Bill Travers, a too seldom used actor of mild presence but uniquely suited to this role. The character of the Bijou's \"commissionaire\" (doorman, janitor, and boiler keeper) Miles in the end tries too hard and creates the only jarring note in the film, which is otherwise tender and memorable. The device of having latter day elevated trains roar past the cinema was inspired and created some memorable scenes, as when the building shakes to the slow start up of the train, or when Bill Travers' character is almost rattled off the ladder as he attempts to relight the old roof sign. There are many wonderful sight gags and other fine bits that one will long remember.<br><br>For those who also like old theatres, it may be of interest to know that the exterior of the Bijou was actually a set created at the meeting of two existing elevated train bridges on Christchurch Ave. at the Kilburn LT station in London. The interior was also a set, but so well done that you would swear that you were in a real 19th century 'opera house.' The design is thought to be derived from the real Palace of Varieties at Camberwell. The movie palace with the pipe organ - \"the Grand\" - was actually the Gaumont Palace (later the Odeon, now Apollo) in Hammersmith, London. And the use of the fictional name of \"Sloughborough\" for the town is another little joke since it means 'low place or mire.' These details can be confirmed in the journal of the British \"Cinema Theatre Association's\" magazine \"PICTURE HOUSE,\" No. 19, Winter 93-94, pages 37 and 38, (where there are photos in this and the previous issue) furnished to this reviewer courtesy of Mr. Brian J. Hall of England.<br><br>One reviewer said that the only flaw was that the story was too short and I must concur in that, and that is the only real flaw I can find in the film as well. There is a difficulty, however, in appreciating the quality of the film from the most common versions of the VHS-NTSC format videos now available. IMDB/Amazon lists two ASIN numbers of versions made by the same French Canadian firm, Madacy, which produced them in EP speed, rather than the usual SP speed that allows for quality. Since Amazon never indicates the speed of a tape, I cannot tell if their third variation produced by 'VCI Classics (American Prudential)' is also in this slow speed of poor quality. Not only is the image poor, but the sound is downright difficult to understand! Amazon's sister company, The Internet Movie Data Base, now lists two CD versions about to be released, and we can but hope that they were made from restored masters and are the pleasure that the original film is.<br><br>P.S.: Two years before the movie \"Majestic\" (starring Jim Carrey) debuted, the director wrote on the THEATRE HISTORICAL SOCIETY'S web site that he was searching for information about historic theatres for his forthcoming unnamed movie. This reviewer responded with information and said that the description of it he gave sounded something like \"The Smallest Show on Earth.\" He responded that he was amazed that anyone remembered the 1956 British film, but that it was indeed an inspiration for his movie. Look closely at the lobby in \"Majestic\" and you will see it clearly resembles that in the 'Bijou,' even if the facades were much different. These films turned out very differently, but at least the architecture rewards lovers of theatres","user":"jimor","rank":[38,38]},{"title":"A very funny movie","rating":29,"date":"29 November 2004","review":"I am happy to read all the kudos from other film buffs for this little gemstone of a movie. It will seem corny and boring to those brought up on Hollywood in the past 30 years but if they would open up their minds to dry humor and sweetness there is much to enjoy in 'The Smallest Show on Earth.' First off the cast are top-drawer English comedians that are now extinct, sadly. Margaret Rutherford, Bernard Miles and Peter Sellars crown the story with their three highly eccentric and touching portrayals of the old hands at The Bijou, better known as The Flea Pit, an old opera house turned \"Kinema\". Bernard Miles, especially, gives a highly subtle and often moving portrayal of an aging janitor who lives on for a new uniform. Nowadays he'd be tossed in a home to rot, suffering from \"dementia\" or some such thing the medical profession has created to niche people for more convenient disposal. But in the days of the making of this movie people like old Tom (Miles) were allowed to continue with their lives, dotty as could be, but happy and earning a living, happy with his cats and his new uniform.<br><br>The \"straight\" couple, the new owners of the Flea Pit, are wonderfully done by the very handsome and under-rated Bill Travers and his real-life wife Virginia McKenna. Travers had the timing sense of Cary Grant, and was much better looking into the bargain. At 6'6\" tall he had an engagingly masculine yet vulnerable way about him. He and McKenna have some of the cornier lines and the jokiness can be a bit \"eye-rolling\" but aside from that period humor this movie is filled with a dry wit that has always been beyond the abilities of Hollywood screen-writers to pen.<br><br>There is one scene in particular that sticks in the mind. The three old hands are alone at night in the old theatre. A silent film is playing, Mrs Fazackalee (Rutherford) is at the tinny old piano in the orchestra pit, Old Tom (Miles) is sitting with his cat in the front row. Mr Quill (Sellars) is in the control booth. Only Sellars speaks briefly to the new owners as they arrive upon the scene, lost in the \"old days\" of the kinema. Just the sight of Rutherford at the piano improvising music to the old love story on the screen, and Miles and his cat in the front row is enough to evoke tears. Longing for lost innocence I suppose.<br><br>This movie is loaded with a high humor, no vulgarity, sex or profanity comes into it. A very memorable little film that is long overdue for release on DVD. I was lucky enough to find a good quality VHS copy at Facets in Chicago in case anyone's had trouble rounding up a copy. An excellent miniature masterpiece portraying a more innocent and lovely period of time in our benighted 20th century.","user":"pekinman","rank":[51,52]},{"title":"A comedy which is truer to life than some may imagine.","rating":10,"date":"7 January 2000","review":"The younger generation of filmgoers, used to the antiseptic cleanliness of the multiplexes, may not realise that \"fleapits\" like the Bijou in \"The Smallest Show On Earth\" did actually exist in post-war Britain. Starved of resources during the war and with restrictions on non-essential building in force until the mid fifties, many small cinemas were in a very sorry state with broken seats, threadbare carpets, antiquated projection equipment and even torn and patched screens.<br><br>It is against this background that this charming comedy is set with wonderfully eccentric characters played by Peter Sellers, Margaret Rutherford and Bernard Miles.<br><br>The principal character is, however, the Bijou itself. This was a set, the exterior having been temporarily constructed between two railway bridges in Kilburn, a London suburb. The rival cinema, the Grand, was, in fact, a real cinema - the Gaumont at Hammersmith, also a London suburb. If you look closely, it is possible to see that the new name is rather clumsily superimposed.<br><br>To someone brought up in the fifties, this film brings back fond memories. To the younger viewers it gives an intriguing glimpse into the past by showing a way of life gone forever.","user":"Sylvester","rank":[33,33]}]