[{"title":"Damn Good 70s Cop Flick!","rating":8,"date":"3 March 2002","review":"I caught part of this 1973 flick one late night on TNT. I was intrigued because it was supposed to be Peter Hyams' first theatrical effort. So I went out and bought a copy on VHS. At first this film may not seem much. Just an updated version of the old police procedurals from the 1940s and 50s. But after a couple more viewings I was hooked. There's a certain indescribable quality to it (see Walter Hill's \"The Driver\" and you'll know what I mean). A hang-dog, left coast version of the French Connection. Very laid back, but deadly serious. The viewer feels the same frustrations the Gould-Blake teams feels in the up-hill struggle to rid their beat of society's scum. The duo risks life, limb, and personal and professional humiliation trying to nail the vile crime boss and galvanize indifferent peers/supervisors. Brisk dialogue, thoughtful direction, excellent photography by Earl Rath, sleazy LA locales and a fine cast make this forgotten film a winner. Give it a try!","user":"ndrejaj1969","rank":[14,16]},{"title":"Busting out in style.","rating":14,"date":"14 March 2002","review":"I first saw this in the mid '80s and thought: 'what a stylish thriller!' It seems to have been filmed in a low-grade film stock, which has given it a grainy/soft-focus look which also adds to it's realism. Elliot Gould, who stars as one of the hard-bitten cops also appears in another Peter Hyams opus, Capricorn One.  Robert Blake who plays Gould's partner, later featured in his own TV detective series called Baretta.<br><br>There are some wonderful set-pieces in the movie, the best in my opinion involving our heroes chasing some bad dudes from a seedy hotel, and through a supermarket on the streets.  It's classic Cat-and-Mouse fare, as the villains take a hostage while Gould 'n' Blake have them firmly in their gunsights. This moment is ingeniously realised by Hyams' use of a wide-angled lens.  There are also brilliant car chases galore to marvel at.<br><br>Anyone who is a fan of this type of gritty cop thriller with a downbeat ending, would enjoy another good example: William Friedkin's 'To Live and Die in LA' (1985) which stars C.S.I.'s William Peterson.","user":"buckaroobanzai50","rank":[16,19]},{"title":"\"You guys disgust me!\"","rating":6,"date":"2 July 2010","review":"Elliott Gould and Robert Blake are a surprisingly affable team in this blood-spattered crime-flick written and directed by Peter Hyams, which stays loose and shaggy and doesn't wrap itself up too much in seriousness or pretensions (until the finale). Two Los Angeles vice cops, tired of seeing their prize busts going unrewarded by a police commissioner who is on the take from a sleazy crime czar, use their down-time to shake up the kingpin, whom they are sure is about to pull off a major drug exchange. The leads are a lot of fun, particularly Gould, and Hyams keeps the camera moving-moving-moving until you feel convinced he must have his cinematographer strapped to the back of a motorcycle. There are the usual cheap shots, titillation asides, a blatantly moronic judge, and the proverbial exasperated sergeant who keeps saying things like, \"My ass will be in a sling!\" Hyams is really tough on Los Angeles, and one might come away from the picture asking: if the police force were so corrupt, wouldn't that be a bigger story than the one we're getting? Still, the combination of good performances, an interesting script, a goofy undermining, and a down-and-dirty scenario makes the movie a rowdy ride with exciting sequences. **1/2 from ****","user":"moonspinner55","rank":[8,10]}]