[{"title":"One of the best British films of the last twenty years","rating":3,"date":"3 February 1999","review":"Terence Davis moving, harrowing and elegantly artistic masterpiece is one of the few Britsh films of recent years to embody a distinctly British identity. The plot involves a family wedding in working class Liverpool just after the second world war and the various episodes in the family's past dealing with their sometimes brutal and disturbed father. The beauty of the film lies in the deeply artistic composition of various shots, coupled with Davis' enduring compassion and understanding for the chararcters, especially the father played brilliantly by Pete Postlethwaite. It is an incredible evocation of family life and even though at times it makes for hard viewing, this is a film that must be seen.","user":"dominic-9","rank":[30,32]},{"title":"Amazing","rating":10,"date":"16 October 2007","review":"This film caught me 14 years ago when I first saw it.. and yesterday I was really touched by it again. A registration of 'forgotten' times somewhere during....the first half of the 20th century in Britain...a Totally Overwhelming sense of melancholy filmed in an extraordinary way by Terence Davies.A true work of art. The excellent idea of calling up emotions by letting the characters sing the sing-along songs of the era.... Then there is the photography of this film...seldom have i seen a modern day movie that brings up past times as this piece of wonder.... very , very tastefully done...the coloring and costume designs , the decorations...everything works to give you the idea that you'r staring into a timemaschine...wow.. amazing ! Heartbraking story of 'normal lives , by normal people , who are all gone and 'forgotten'... Still one of the most amazing pieces of cinema around !","user":"Moviespot","rank":[16,17]},{"title":"why are these films not on DVD","rating":20,"date":"20 December 2006","review":"Both distant voices and the long day closes are remarkable films for their style, and insight into the subtlety of human feelings and failings. They certainly won't be to everyones taste but as pieces of classic cinema they are priceless. Because of their limited appeal it is maybe understandable that they are not films to bring in millions, however it is tragic that they are not available on DVD so that at least they can attract a wider audience. I have the original VHS copies of these films, (bought when they were available - they are not now) and will have to dig these out of storage and have them transferred to DVD.","user":"boundandgagged1","rank":[10,10]}]