[{"title":"The \"lost\" Scorsese film","rating":9,"date":"3 December 2003","review":"This was a real change of pace for director Martin Scorsese--he decided to do a drama/love story with music set in the 1940s. But he wanted a DOWNBEAT film. It was released in 1977 (after about 20 minutes were cut out by the studio) and was torn apart by the critics. It was reissued in 1981 with all the cut footage restored (it now runs 165 minutes) and the critics raved about it! Go figure. After that, however, it seemed to disappear. Too bad--it's actually good.<br><br>It's about clarinet player Jimmy Doyle (Robert De Niro) falling in love with Francine Evans (Liza Minnelli). She's a singer and they preform together in the same band. But Jimmy has serious temper problems and when Francine gets pregnant things go out of control.<br><br>The film is certainly stunning to look at--the sets and cinematography are just great. Some of the sets are (quite obviously) fake but it actually works in this movie. It seems to be a homage to the big, splashy Technicolor musicals of the 1940s and 1950s--but has its characters act like real people and deal with adult situations. The direction by Scorsese is (of course) wonderful. What's especially surprising is his directing of the big \"Happy Endings\" musical number (which was originally completely cut)--who knew Scorsese could direct a musical?<br><br>The acting is good--almost too good. Minnelli is very good as Francine--she's just magical when she sings and there's a powerful sequence when she just explodes in the back of a car. De Niro plays Doyle as an insensitive jerk--and that's the main problem with this film. His character is loud, immature, obnoxious and always pushing Minnelli around. More than once I wanted her to turn around and punch him out. His character is so unlikable it's hard to really give a damn about him. But Minnelli is beautiful and likable and the sets are unbelievable. The music is great and when Minnelli sings \"New York New York\" you can't take your eyes from the screen. Also old time stage actor Larry Kert (who sadly died on AIDS in 1991) pops up at the \"Happy Endings\" sequence--what a voice!<br><br>A lot of people find this film sick and too dark--it is, but it IS a Martin Scorsese film. It should be reissued again and find a new audience. It's been over 20 years. Well worth seeing.","user":"preppy-3","rank":[80,93]},{"title":"Often Brilliant In Spite of Major Flaws","rating":7,"date":"24 March 2005","review":"Released in 1977, Martin Scorsese's NEW YORK, NEW YORK instantly divided critical response--and, facing box office competition from no less than STAR WARS, proved a major financial failure. A significantly edited re-release followed not long afterward but proved even less well received and even less profitable. Although a double VHS release eventually brought the film to the home market, the film remained unpopular and made barely a ripple in public consciousness. In 2005, however, NEW YORK, NEW YORK received an unexpected release to DVD. At long last it may begin to reach a significant audience.<br><br>As a story, NEW YORK, NEW YORK draws from a number of oddly \"Noir-ish\" musicals made at Warner Bros. in the late 1940s. Most particularly, according to Scorsese's commentary, it drew from MY DREAM IS YOURS, a film that not only starred Doris Day but actually reflected her life in its tale of a talented big band \"girl singer\" trapped in an abusive marriage with a musician. Although the film force-fed the audience a happy ending, later films would not. In the mid-1950s, Doris Day's LOVE ME OR LEAVE ME and Judy Garland's A STAR IS BORN offered stories of a gifted female vocalists locked into disastrous romances that played out to a very distinctly unhappy ending, and NEW YORK, NEW YORK draws from them as well.<br><br>Scorsese not only repeats the basic stories and themes of these films, he also repeats the artificially heightened visual style typical of Hollywood films of the 1940s and 1950s--it is no accident that Liza Minnelli looks and sings remarkably like mother Judy Garland in this film--but he does so to an entirely unexpected end. The bravado performing style of such films is completely snatched away, and the characters are presented in an almost documentary-like realism. In theory, each aspect of the film would emphasize the other; in fact, however, this was precisely what critics and audiences disliked about the film when it debuted. They considered it extremely grating.<br><br>But perhaps the passage of time has opened our eyes on the point. I saw NEW YORK, NEW YORK in its 1977 release and, music aside, I disliked it a great deal. I expected to retain that opinion when I approached the DVD release, but I was greatly surprised. It holds up remarkably well, and most of the time the balance of artifice and reality works very well. But there are significant flaws. In a general sense, the film has a cold feel to it that occasionally becomes so downright chilly you begin to detach from it. But even more difficult is the character of Jimmy Doyle, the abusive husband of the piece.<br><br>The recent DVD release includes a noteworthy director's commentary, and Scorsese states that both he and actor Robert De Niro sought to push the character far beyond the extremes of MY DREAM IS YOURS, LOVE ME OR LEAVE ME, or A STAR IS BORN. They were perhaps more successful than they expected. The result is a character you actively do not want to watch or hear, and although we are eventually allowed to see beyond his annoying qualities that moment comes much too late in the film to make him acceptable in any significant way. It makes for more than one bout of uphill viewing.<br><br>Overall, I recommend the film--but it is very much a \"Hollywood Insider\" film that is probably best left to those who know a great deal about film history and who can recognize the numerous antecedents from which it draws.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[54,62]},{"title":"Does Marty love 'em or hate 'em?","rating":1,"date":"1 November 2004","review":"There *are* things to love in NYNY. But over and over again I kept coming back to this thought: does director Martin Scorsese (a genius storyteller) really love musicals, or is he, in fact, satirizing them here? I can't find any other explanation for the creation of a leading character (DeNiro) so self-absorbed, rude, brutish, and jealous of his future wife's (Minnelli) growing fame, while at the same time trying so hard to establish his own fortune with a tenor sax. It's like there's a highly pitched voice of reason trying to remind the audience that in real life, people aren't so happy as they always seem to be in musicals. I know everyone doesn't love (some of you proudly hate) musicals, but usually one can find something redeeming in the characters who populate the stories. For 2 1/2 hours of film, we are presented with a love story which borders on spousal abuse, and somehow be expected to care about the husband. It doesn't work. And yet, Scorsese bends over backward to recreate the 1940's musical/big band atmosphere, from Hawaiian shirts and two-tone spectator shoes to sumptuous big band pieces, not to mention a charming pair of dancers (channeling Gene Kelly and Vera-Ellen?) spotted on a subway ledge or a sultry torch singer in a Harlem nightclub (a cameoed Diahnne Abbott, whose 11th-hour performance of 'Honeysuckle Rose' tips a well-fitted hat to Billie Holiday). One critic seemed to personally resent the channeling of mother Garland through daughter Minnelli (particularly in the supper club where the title song is stunningly performed with all guns blazing), but I think that was very much on purpose. Even though she got much bigger acclaim for \"Cabaret,\" I think Minnelli reached the peak of her musical talents in this film. I loved her. I just didn't love them, and unfortunately, that kept me from loving the whole project. Watch it on DVD, and skip to your favorite parts.","user":"movibuf1962","rank":[32,36]}]