[{"title":"Loneliness is a Stake Through the Heart","rating":10,"date":"12 November 2008","review":"VERY BIG SPOILERS!!! YOU'VE BEEN WARNED!!! I explain the entire film here, so if you don't want to have it explained, read no further!!<br><br>I did receive an e-mail from the screenwriter of this film, thanking me for understanding his movie after I posted this comment on Amazon years ago. I really think it's an underrated film that people misunderstand and everyone can relate to on some level.<br><br>Vampire's Kiss\" is an overlooked and misunderstood dark comedy, and an allegory for the isolating fear of intimacy that can mimic being \"undead.\" It features an amazing physical comic performance by Nicholas Cage as Peter Loew, which deserves recognition. I've read reviews wherein people feel that the character of Peter Loew has descended into madness as a result of being a jilted lover. But his madness is more about his crushing loneliness in a world where everyone around him seems to be happily and easily paired off. In spite of his solitude, he is emotionally unable to connect to anyone. <br><br>One night, he brings a woman back to his place, but while in the throes of passion, a bat flies into his apartment through an open window. The mystery and excitement of fighting off the bat becomes more erotic and interesting to him than the willing beauty in arms. <br><br>Terrified of the closeness he craves, he sabotages any opportunities he has for actual relationships in favor of elusive fantasies and hallucinations. His fear of commitment manifests itself as a vampire lover in the form of Rachel (Jennifer Beales), a woman he has had one conversation with in a bar, but has never made it with, except in his own fantasy world. There, she is a dominatrix of a vampire, sucking the life out of him, making him a prisoner of her demands, hungers, and lusts, distracting and preventing him from any real intimacy, promising him that soon, he will \"be with her.\"<br><br>The vampire is the only one to whom he can say \"I love you,\" and she doesn't even exist--not really. She represents the promise of something more exciting right around the next corner. Peter simply cannot commit to anything else when love and immortality are so close, but so far...<br><br>Vampires seem human, but they aren't human; they FEED ON humans. They're dead, cold, and isolated from the warmth of human existence--which is exactly how Peter feels, and why he believes he's becoming one. Plus, he is suicidal, and he seems to have found a way to receive deliverance in the form of his secretary Alva, who he begins to torment in earnest once he discovers she carries a gun, hoping she'll (justifiably) use it on him.<br><br>It's over the top and a little hard to understand, but I found this movie so engaging, and Cage's performance so funny and astonishing, in spite of the dark subject matter, that I have watched it over and over again. I have used this movie as a compatibility test for potential mates (which is sort of Peter-ish, I guess), and if they like it, I know it's a good match. If it had been performed another way, by another actor, I don't know if I would like it at all. But Cage brings brutality, vulnerability, tragedy, and all-out desperation together to create a complex character the like of which I have never seen before or since. <br><br>Sure, there are violent scenes; but are they real, or are they his imagination? We'll never know. So much of \"Vampire's Kiss\" happens in Loew's mind that all we know for sure is that he's desperately alone. So alone, he's willing to drive someone else over the edge to help ease his pain. He's so cowardly and childish that he uses terror as a way to achieve relief from his horrible solitude--death is less frightening to him than actually getting close to a real person. Therein lies the horror, and the sadness, of \"Vampire's Kiss.\" And in Cage, lies the performance which makes this story watchable, and actually very funny.","user":"MSStMarie","rank":[68,76]},{"title":"One of a kind","rating":8,"date":"14 August 2000","review":"After reading so many comments who put this film down, I just had to write something to its defence. True: the film is confusing in many ways; you get confused what is real and what is not for example. But some of the hilarious scenes in this movie is more than worth it. In one of his most remarkable, over-the-top performances, Nicolas Cage transforms from an up-tight snob to a complete lunatic. This is one of the most original and unconventional movies I have ever seen. Those of you who want predictable Hollywood movies should steer away; for the rest of you this can be an enjoyable experience!","user":"pisces-6","rank":[97,112]},{"title":"The plot summary has it ALL WRONG","rating":10,"date":"11 May 2003","review":"This movie is NOT about vampires; there isn't a single vampire in it. Instead, it is about a man (played by Cage) who loses his mind and begins to think he is a vampire after an unsatisfying series of one-night stands that make him feel empty.  It's a metaphor about relationships, and this is one fantastic black comedy.  Check it out and thank me later.","user":"KevinMHagerman","rank":[154,188]}]