[{"title":"Start of the winning streak!","rating":10,"date":"23 January 2007","review":"Howard Hawks is one of our finest and most underrated directors. I believe it was Leonard Maltin who stated that Hawks is \"the best director you've never heard of\". Meaning that Hawks is commonly not mentioned with the likes of Ford, Hitchcock and Welles. This is probably because Hawks usually made \"popular\" films that focused on dialogue, character development, and speed (whether action or comedy) to set himself apart. Hawks had complete confidence that the audience liked what he liked.....and most of the time he was right! Beginning in 1939 Hawks began a streak of hits that would continue into the early 50's. After making Bringing Up Baby (something of a flop...now a classic) Hawks departed RKO after being replaced as director of Gunga Din (whose story he had a big hand in developing) and made this film at Columbia. Hawks intention was to make a film about the daredevil attitudes and experiences of pilots flying the mail in South America. The safety conditions for these pilots are non-existent and as a result they live each day as though it was their last.<br><br>More than most movies this film is often pointed to as a summation of the \"Hawksian\" style. A group of men working closely to accomplish a common goal who are united by the dangers involved. These men are not \"family men\" or people with long term aspirations. They live in the moment and find their meaning through their comraderie and understated support of each other. As with most Hawksian dialogue (Jules Furthman would become a regular Hawksian writer after this one) it is understated and never overly emotional. The fun begins in Hawks films when a woman arrives who is often more than a match for the man she's in love with! (this pattern prevailed in the comedies as well). <br><br>In this film Cary Grant, who is one of the greatest \"Hawksian\" actors, plays Geoff the head of the air mail airline who has sworn off women because they just don't seem to deal with his dangerous lifestyle. Therefore Geoff deals with women in a very cavalier way. Jean Arthur is American woman who arrives and turns his world upside down. But this film is not just a romance. There are multiple relationships between the characters that keep the viewer engrossed. Thomas Mitchell is most intriguing as the \"buddy\" who has been with Geoff for a long time and is quite subtle in his dedication toward his friend. Richard Barthlemess is outstanding in a late career role as the pilot with a checkered past who has to win over the trust of the other flyer's. (he's already won over the trust of Rita Hayworth, which is nothing to sneeze at!)<br><br>Only Angels Have Wings is one of Hawks best, and perhaps most personal stories. Hawks claimed that it was one of his most \"true\" films in that he had been a flyer in World War I and was very interested in the dynamics between the early daredevils of aviation. The film moves along at a crisp pace and contains many tense, gripping scenes that keep the viewer entertained despite the Hawksian emphasis of character/dialogue over plot. <br><br>Angels was a huge hit for Hawks and was the beginning of his most successful decade in Hollywood. In terms of influence Hawks would give ANY golden age director a run for his money. Directors such as Quentin Tarantino, John Carpenter, and Martin Scorcese would agree! Hawks films are worth studying and \"Only Angels have Wings\" is a textbook sample. I highly recommend it! 10 Stars!!!!!!!!","user":"jargonaut73","rank":[36,40]},{"title":"A Notch Above The Rest In Its Era","rating":8,"date":"17 March 2006","review":"To quote to the movie cliché on the back of the VHS cover, this is old-time adventure, \"the kind they don't make anymore.\"<br><br>Well, they've always made good adventure stories through the years but you get the message: it's simply a good, solid story done well on film .<br><br>What puts this a notch above other adventure tales of its day are: 1 - excellent cinematography; 2 - interesting aerial scenes with neat-looking planes flying in the fog and around and above the treacherous Andes Mountains; 3 - a top- notch cast featuring Cary Grant, Jean Arthur, Rita Hayworth, Richard Barthelmess, Thomas Mitchell, Allyn Joslyn, Sig Ruman, John Carroll and Noah Beery Jr., and 4 - a story that is generally interesting.<br><br>I say \"generally\" because there are a few dry spots, mainly Arthur's continued pining over Grant, but most of it fun to watch and it gets you involved in the story. Ruman and Barthelmess were especially good in their supporting roles. Hayworth's role, one of her first, was not that much.<br><br>In all, a solid adventure-romance tale, and I'm shocked it gets so little attention on this website, with under 20 reviews as of my writing.","user":"ccthemovieman-1","rank":[43,49]},{"title":"It is all about respect","rating":10,"date":"29 April 2005","review":"If you ever wondered what all the fuss about Howard Hawks was all about, this is the film to catch. It is a first-hand lesson in what the Hawks universe was all about, and it is unsurpassed entertainment from the word go. Two hours of undiminished tension, action-wise, sexually, whatnot.<br><br>New York showgirl Bonnie (Jean Arthur) is on a stop-over in small-town Barrance somewhere in South America. Here she meets Geoff (Cary Grant), the leader of a small band of mail pilots having to cross a perilous mountain pass on a daily basis, and casualties are to be expected. Within little more than ten minutes of screen-time the young man, who had asked Bonnie out to dinner, is dead in a spectacular crash scene, and from there on the plot and the action pick up space. Bonnie is dismayed by the way the dead pilot's colleagues seem not to care about his death, they just go about their business and pretend he was never there in the first place, so as not to be reminded of their own mortality. \"Joe died flying\", says Geoff. \"That was his job. He just wasn't good enough. That's why he got it\". Dismayed as she may be, though, Bonnie cannot leave, since she is falling in love with Geoff but fast.<br><br>In this confined space, made even more confined by the dense fog and pouring rain that characterize the local climate, the scene is set for one of Hawks' perceptive gatherings of a group of people to have us observe the dynamics of people interacting, different ethos at work in a seemingly laconic male environment, the love, the rivalry, the camaraderie. The fear. Further upsetting the close-knit community is the arrival of a new fryer (Richard Barthelmess in the best performance of his mature years) who has to prove himself doubly because once in his life he turned yellow. With him he has Rita Hayworth, Geoff's old girl-friend ...<br><br>This is quintessential Hawks, just in the way that Barthelmess' character has to strive to earn any ounce of respect from his peers. But in every frame it is a deserved classic, and great performances abound.<br><br>8/10","user":"mik-19","rank":[58,68]}]