[{"title":"Missed Opportunity","rating":3,"date":"9 July 2002","review":"Early in the film, there is a great scene where Wings Hauser is confronted by a couple of thugs in a car. They punch him in the gut, put a gun to his head, shove him through the car window and tell him to go back to New York.<br><br>Unfortunately he ignores their warning and the film drags on for another hour.","user":"helfeleather","rank":[5,6]},{"title":"Wings Hauser is the man!","rating":5,"date":"14 July 2011","review":"What we have here is a typical run-of-the-mill eighties crime/action/thriller from the somewhat lower budget regions. The plot involves a (very active) serial killer running amok in L.A. One of the apparently random victims, being killed at the very start of the movie, is the granddaughter of an ex-thief. Granddaddy then calls in the help of Stoney Jackson Cooper (Wings Hauser), a former hard-boiled cop from the L.A. police force who doesn't like playing by the rules. When he arrives in L.A., the authorities, local criminals as well as his (soon-to-be) ex-wife are not too happy with his return. But Stoney doesn't care. He's got a job to do and a promise to keep: track down the vile killer and put a stop to his activities.<br><br>The story bounces to the left &amp; the right at an uneven pace, but still manages to be quite coherent and even turn in a twist at the start of the third act (albeit one you'll probably see coming). Wings Hauser is in top shape in this one and pretty much owns the movie. One scene has him relaxing in a bath tub, and then going after the killer butt-naked after the whole loft has been shot to pieces during the killer's surprise attack. Even a pretty decent but obviously very standard climax is added to the mix (Wings vs. the killer, after his true identity is exposed). Other forms of entertainment, aside from shooting &amp; killing, are included also, like a soft-core sex-scene (Wings &amp; Joyce Ingalls) and an obligatory car crash/explosion. Yes, \"Deadly Force\" does its best to play it right.<br><br>Sadly, one of the worst aspects of \"Deadly Force\" is the musical score. The main theme - if you can call it that - doesn't work at all. It's too rocky &amp; funky and is used too often &amp; inappropriately (even during the climactic fight &amp; chase scene at the end). It gives the film a much sillier &amp; dated vibe than it should have. A more gritty &amp; tense analog synth score would have worked wonders, I'm sure. But in the end, \"Deadly Force\" is much more entertaining than it's poor rating on here would lead you to believe. And it's mainly thanks to Wings Hauser and a typical B-movie script that at least tries to make things work.","user":"Vomitron_G","rank":[3,4]},{"title":"Strictly by the book, rogue cop, action film ..........","rating":4,"date":"16 November 2010","review":"\"Deadly Force\" has everything you would expect from a cop kicked off the force film, and that is the problem. Wings Hauser is the renegade cop investigating a series of apparently random homicides, committed by perhaps the least developed, and least interesting villain in screen history. The overly simplistic story really has nowhere to go, so it is well padded with gratuitous car chases and explosions. I will say however, this is the first time I have seen the game of \"rat roulette\" played, and it looks more interesting than the rest of \"Deadly Force\". This strictly by the book action film might be worth a look for Wings Hauser fans but others beware. - MERK","user":"merklekranz","rank":[3,4]}]