[{"title":"An entertaining, detailed thriller","rating":7,"date":"27 July 2000","review":"One of Wes Craven's best, \"Serpent and the Rainbow\" is as much a psychological thriller as a horror movie.  Some horror fans may find it too slow (it takes its sweet time to come to a climax) but it's worth it... the journey is entertaining and interesting.  This is a polished, professionally filmed movie with higher production values than the average for its genre.<br><br>I've never seen a film before that went quite so in-depth into the subject of voodoo.  Filmed on location in Haiti, this movie goes into a lot of detail about various voodoo practices and introduces the voodoo versions of the good and evil magician, the houngon and the bocor.  If you have any interest at all in this subject matter (or the supernatural in general), I recommend the movie on that basis alone.<br><br>Acting is uniformly solid throughout, if nothing really outstanding.  We do not come to care very deeply about these characters, so their trials, tribulations and deaths do not bother us much... but Craven's attention to detail really shows, and there isn't a moment of this movie that lacks entertainment value.  7/10.","user":"The_Core","rank":[58,60]},{"title":"For horror fans","rating":5,"date":"5 January 2005","review":"Wes Craven's \"The Serpent and the Rainbow\" is one of the more original and ambitious horror movies to come out of the '80s. Not only does it seek to reconnect cinematic zombies with their voodoo roots, ala classics like \"White Zombie\", but it also uses the creation of zombies as a political allegory. The film is set in Haiti during the last days of the dictatorship of \"Baby Doc\" Duvalier.<br><br>Based - very loosely one surmises - on a true story, the plot follows Dr. Dennis Alan (Bill Pullman) as he investigates a powder that is said to turn people into zombies. He is aided in his quest by Dr. Marielle Duchamp (Cathy Tyson), who he quickly falls for, and Louie Mozart (Brent Jennings) an expert in voodoo. Dargent Peytraud (the chilling Zakes Mokae) is the snarling villain of the piece, a man with sinister powers both government-sanctioned and supernatural.<br><br>The film abounds with creatively gruesome imagery - a man is buried alive, screaming, in a coffin as it fills with blood, a fiendish hand reaches out from a bowl of soup - this is one of those rare films that genuinely makes your skin crawl. Horror fans should not miss it. It's a shame that the film runs just a little longer than it should and becomes disappointingly routine in its final moments.<br><br>There is a sense that this movie was aiming a bit higher than it ending up reaching. I can't quite hold that against it.","user":"sparklecat","rank":[52,57]},{"title":"Do you believe in voodoo?","rating":8,"date":"19 April 2001","review":"The story of a chemist who is investigating a rumoured drug that brings people back from the dead. This is a great movie which keeps you in suspense right through. Not a horror movie but more of a suspense type movie that enters the world of black magic and voodoo. Very underrated movie and well worth watching, great plot and the story works.","user":"tezshouse","rank":[37,45]}]