[{"title":"Superior Hammer Thriller In a Not so Bloody Vein","rating":8,"date":"12 September 2007","review":"Vastly under-rated (no doubt due to it's lack of release and being regarded as just another Hammer Horror) it is yet another offering from that studio that shows just what crafted film-makers the team from Bray studios actually were.<br><br>Director Cyril Frankel extracts first-rate performances from the leading performers, with Janina Faye worthy of special mention as the key victim in the saga.<br><br>Production values are the usual high standard from the Hammer team of the late 50's - Early 60's, Bernard Robinson's production design triumphant transforming Pinewood's Black Park locations into a small Canadian town. <br><br>Freddie Francis does his sterling filter work yet again, adding menace to the lakeside finale and offering more in monochrome than could have been achieved in colour.<br><br>Considerably superior to most films that broach the subject matter and (although the copy I have seen is no better than average quality) it is hoped that the upcoming DVD release will restore the widescreen ratio thus allowing us to see it as it was intended.","user":"stephen-alexander-2","rank":[22,22]},{"title":"Very suspenseful B-picture","rating":9,"date":"22 August 2000","review":"I saw this on video as \"Never Take Candy from a Stranger,\" under which title it was apparently released in the U.S. It was the one serious film produced by Hammer Films, famous for its Gothic horrors, and I found this much more suspenseful, as well as much better made, than the lot of them. It begins with small tensions of frustration and mild dislike among members of the academic community in a small town and gradually, subtly builds to an atmosphere of dread that catches in the throat. Every character, down to the bit parts, has something of interest to say, and what they say and do, and how their actions combine, lead step by step to the harrowing conclusion. The only fault is the over-simplicity of its social viewpoint, as expressed by the main character and justified by the events of the story, which are by no means unbelievable but not inevitable either. Apart from that, I thought it was a first-class B-picture, a small film in the good sense, compact and economical, with all its resources, human and otherwise, firmly in hand. Also, it has the grey photography that once used to give films of this type the aura they needed: the grey of rain and fog and dusk and uneasy feelings.","user":"galensaysyes","rank":[38,40]},{"title":"A more than interesting smaller Hammer flick!","rating":8,"date":"12 February 2007","review":"Never Take Sweets from a Stranger is yet another small scale and less popular Hammer film, but still one that gives the studio's more well respected efforts a run for their money. This film is macabre in a way unlike most other Hammer movies. The frightening things about this film don't come from overly maniacal characters or fantasy monsters - but from a threat that has become more widespread in the past few decades. The main theme here is paedophilia, and it feels odd watching this film as the attitudes expressed towards the hideous act are nothing like they are today. Because paedophilia is more often heard about now, the film isn't quite so frightening - but somehow it feels like it wasn't as frightening back in 1960 as it must have seemed like quite an outlandish idea. The plot follows a couple of young girls. One of them loses her 'candy money' and the other says she knows where they can get some free candy. They go to Mr Olderberry's house, but when the young girl comes home saying that the old man made them take their clothes off and dance for candy - her parents, new in town, decide to take the powerful Olderberry family to court.<br><br>Aside from showing a real life monster, the film would also appear to want to serve as a warning against immoral lawyers manipulating the truth to get the wealthy off the hook. Director Cyril Frankel seems to want to take a moral stance on these issues, and that's no bad thing. There is a macabre atmosphere in the film, but the bulk of it happens in a courtroom. Hammer may be famous for horror, and this film does feature some towards the end - but on the whole it's more of a courtroom drama than anything else. This isn't a bad thing, however, as the courtroom action is always interesting and this is backed up by an undercurrent of terror as we get to watch a guilty man walk free. The acting is pretty decent, with Janina Faye standing out the most. It's hard to judge the production values as my copy wasn't exactly great, but I doubt that the film was short on budget; and there's nothing in the film that would have been particularly expensive anyway. Overall, Never Take Sweets from a Stranger is a damn good lesser known Hammer flick that boils down to a terrifying and memorable conclusion, and it therefore comes recommended to anyone who enjoys a good thriller!","user":"The_Void","rank":[28,29]}]