[{"title":"Cult Movies 20","rating":6,"date":"8 November 1998","review":"20. THE TRIPLE ECHO (war-drama, 1973) England, WW2: Homesteader Alice (Glenda Jackson) has been left a widow by the war so now has to work the farm on her own. Soldier Barton offers to help her out. They eventually become friends then lovers. Not wanting to go back to the front, Barton goes AWOL. Alice helps him by disguising him as her 'sister Katy'. Successfully fleeing detection, their relationship turns sour, as Barton becomes accustomed to his new femininity. Even worse when visiting 'Sergeant' (Oliver Reed) takes an interest at 'Katy'.<br><br>Critique: Bizarre, at times unpleasant little film has stuck with me ever since I saw it. Maybe my impressionable age at the time contributed to its lasting impact but after watching it for only the second time, I find it very original, exciting and tragic. It also reminded me of Ed Wood's infamous 'Glen or Glenda' (one of the earliest cross-dressing films), and of Sydney Pollack's Oscar winning 'Tootsie' (starring Dustin Hoffman). In those, and many others since, the emphasis is based on the whole plot's comedy-plus value. The interplay struggle to inhibit their natural desires, disgust at dressing up, and shedding their 'machismo'. <br><br>Our film's hero, however, is further enticed into the role and even his personality changes. Jealousy, drama and a sisterly-type relation develops. It is only too late that he discovers what a mess this has gotten him into.<br><br>Perplexing study of isolation benefits from a good cast. Oliver Reed's brutish 'Sergeant' is the standout. The surprising ending adds to the film's abstract nature.","user":"TYLERdurden74","rank":[16,18]},{"title":"An echo of three lonely souls","rating":8,"date":"22 February 2013","review":"I have loved this film ever since I first saw it, so much so that I had bought a VHS tape AND the player, as this forgotten gem is unfortunately still not available on DVD. I will not explain the plot, as the synopsis is covered rather detailed on the first page, but concentrate on the specifics. Michael Apted, from the first shot, creates a certain mood of the film which is very effective that once in, the viewer is fully engaged to the end (despite certain plot and screenplay shortcomings) and that is isolation and loneliness. And this emotion is shared by all three central characters, shaping their decisions and actions. A fitting title, as well, as we do have a three-way character development here. They all want the same things. Brian Deacon's loneliness is in his alienation and is very much a need to belong. Oliver Reed's is purely physical and Glenda shares both. All the actors are very good in their portrayals. However, Glenda Jackson's performance is what glues the whole story together. A brilliant turn, and probably her most subtle that I have seen. The silent looks that she gives are priceless. Alas, this is a forgotten gem. I don't think it will ever get a DVD release, unfortunately. But a must see, for sure. Especially if you like for those rare, character and performance driven dramas, all too rare in today's market. 8 1/2 out of 10","user":"EJverh","rank":[6,6]},{"title":"Enjoyable, almost unbelievable, film about army deserter in WW2.","rating":8,"date":"31 July 2006","review":"Triple Echo, based on the H E Bates story, is a well-directed and well-acted film about a lonely woman (Jackson) on a farm who is visited by a young soldier (Deacon) and they soon become lovers. He decides to avoid being captured as a deserter by dressing as a woman and pretending he is Jackson's sister. A surly sergeant-major (Reed) falls for her (his) charms and invites the 'sisters' to a Christmas dance at the barracks. In a back room, Reed discovers 'her' real sex. The soldier escapes but is eventually caught. It is one of Reed's best performances, and although the plot is barely believable, the film is highly entertaining.","user":"dennis-422","rank":[6,7]}]