[{"title":"\"I believe it because I *want* to believe it..\"","rating":8,"date":"17 June 2005","review":"\"I believe it because I want to believe it\". This one line speaks volumes about what the movie (and the original novel) was trying to say. The concept of Shangri-La, a place where people work and live in peaceful harmony, is as relevant today as it was in the post-World War I era that James Hilton wrote 'Lost Horizon', where the world was still in turmoil following a devastating war and another was on its way.<br><br>In these days of war, humanitarian devastation and disease, how many people are there who dream of getting away from it all and living out their lives in a remote paradise just like Shangri-La? The High Lama's words to Conway resonate strongly even today.<br><br>\"Look at the world today. Is there anything more pitiful? What madness there is! What blindness! What unintelligent leadership! A scurrying mass of bewildered humanity, crashing headlong against each other, propelled by an orgy of greed and brutality.\" On a more cinematographic note, the movie is visually stunning in an age before CGI and astronomical budgets. The beauty of Shangri-La, the stunning mountain landscapes and the overall settings of the movie make us believe that such a wonderful place can exist. All the actors are commendable in their portrayals (though some characters are different to those in the original novel) and their interaction with each other add a real sparkle to the movie.<br><br>'Lost Horizon' is a beautiful adaptation of James Hilton's masterpiece and captures the very feeling of the novel and I would highly recommend it to anyone who has ever dreamed of escaping from the hectic world in which we live.","user":"darkpixie1980","rank":[76,81]},{"title":"`Lost Horizon' is indeed a remnant from the golden age of cinema.","rating":9,"date":"22 May 2003","review":"There is an aura that seems to surround classic films made before the days of computer generated visual effects and intense marketing campaigns. It was a time when motion pictures depended on grand stories, superb performances, and great direction to catapult their success. This was exactly the case of `Lost Horizon,' a film from director Frank Copra (`It's A Wonderful Life'). With elaborate set designs, excellent performances by Ronald Colman, Jane Wyatt, John Howard, Thomas Mitchell, and Edward Everett Horton, `Lost Horizon' is a story of survival and ultimately finding a way home, that cannot be forgotten. `Lost Horizon' is a tale of five castaways who inadvertently find themselves in Shangri-La after their plane crashes in the mountains of Tibet. They are lead into the place of eternal youth, natural beauty, and free from strife by members of the region. They are treated as guests, and although they want to leave and find their way back to the world as they know it, porters are hard to find. It all leads to a notion that none of them want to admit; that they were meant to be in Shangri-La. Out of the thousands of movies that have been produced in the past 100 years, only a few afford of the privilege of remembrance. What's more, only a few seem to survive due to the nature of celluloid prints breaking down over time. A similar problem plagued `Lost Horizon,' in that after decades of worthy theatrical re-issues, the prints depreciated, with many withering away. As such, a preservation program was set in place to save copies of the film. Thanks to the works of countless individuals, this classic has been restored, to a certain degree, with some of the footage missing, replaced by still shots of the actors and recorded dialogue. From a critical standpoint, `Lost Horizon' has stood the test of time to be one of the greatest adventure classics ever produced by Hollywood. What is astonishing about this film is the attention to detail. As the film begins, a battle is taking place somewhere in China where we meet our protagonist, Bob Conway (Coleman). As the film continues, the scene changes to a scene on an airplane where our characters are trying to leave the war torn region. At one point, the crew is at a high altitude where the temperature is very cold. As such, we can see their breath in the shot as they speak. Normally, this kind of feature is ignored as the scene is short, but it adds a touch of realism that can't be denied. Incredible detail went into the creation of Shangri-La. With its large sets, beautiful costume design, the film takes on an epic proportion only rivaled by the grand designs of such Biblical epics as `Ben-Hur,' and `The Ten Commandments.' Truly, director Capra wanted to create an image that audiences would be astounded byand he truly succeeded.<br><br>One can't help but admire the characters-they are all a bit naïve, but all intriguing in their own ways. Conway (Coleman) is a British diplomat and explorer whose fame is well deserved. His brother, George (Howard) presents a great deal of fear for the unknown Shangri-La. The characters of Henry Barnard (Mitchell) and Alexander P. Lovett (Horton) add a real sense of humor to the film. There are some minor inconsistencies in the story and various tasks that the characters try to pull off, but it's hardly worth complaining about because the film is such a treasure among other films. After 66 years, `Lost Horizon' remains far better than most of the adventure films that play in cinemas nowadays. One can only wish that they could have been present to see this in a theater during its original run. How amazing it would have been to see this epic tale of survival and the human struggle against itself back in 1937. `Lost Horizon' is indeed a remnant from the golden age of cinema. ***1/2","user":"ilovedolby","rank":[82,88]},{"title":"Colman of Tibet: An attempted key to \"LOST HORIZON\"","rating":10,"date":"9 October 2005","review":"Along with A TALE OF TWO CITIES, THE PRISONER OF ZENDA, and THE LIGHT THAT FAILED, LOST HORIZON represented the best performance possible out of Ronald Colman. And his Robert Conway is the most modern of them (up to the time the films were made). LOST HORIZON is set (as James Hilton intended) in the 1930s, in war torn China. It is not the only reference in the story to the 1930s that Hilton puts into his fable of a paradise on earth.<br><br>Hilton had reason to fear about the world he lived in. The Great War (as the First World War was generally called in the 1930s) was still a savage and recent nightmare. The 1920s and 1930s saw dictatorships seize control of European and Asian state, and Democracy retreating everywhere. \"Look at the world\", says the High Lama (Sam Jaffe), \"Is anything worse?\" The High Lama is correct - the world is collapsing, and the so-called panaceas (Communist Russia, Nazi Germany, Fascist Italy and Spain, Imperial Japan and it's \"Greater Asiatic Co-Prosperity Sphere\") are worse than the seeming ineptitude and drift in badly divided France, weakened Britain, and recovering American. <br><br>Hilton took Conway, his brother George, Professor Edward Everett Horton, suspiciously quiet businessman Thomas Mitchell, and consumptive Isabel Elsom to an oasis (possibly the oasis) on that troubled old earth - Shangri La, or \"the valley of the Blue Moon\") where contentment and peace reigned and people could live, if not forever, far longer and more happily than in say 1937 Germany, Britain, France, Russia, Italy, the U.S., or Japan.<br><br>On the whole Capra catches the spirit of the novel - his sets were dismissed as being far to simplistic, but as simplicity is the hallmark of life at Shangri-La the critics seemed to miss the point. As a matter of fact, his sets (in a temperate valley in the Himalayas - a real impossibility) are more acceptable than the idiocies of the future world in the contemporary science fiction film THINGS TO COME, where H.G.Wells believes we should live in cities built in caves.<br><br>The acting is very good, particularly Sam Jaffe's ancient High Lama (always shot in shadows). Remember, he is over two hundred years old. Today, because Jaffe had a long career in Hollywood (despite being blacklisted in the 1950s), we think of him as an old man in THE ASPHALT JUNGLE or as \"Dr. Zorba\" in the series BEN CASEY. So we think he must have looked old in real life when LOST HORIZON was shot. Actually, he was in his thirties or forties, so he was not that old. But he gave a performance that suggested he was an old man.<br><br>Another member of the cast that I would wish to bring up for consideration is John Howard. He is not recalled by film fans too much, but Mr. Howard was a good, competent actor. That he played Hugh \"Bulldog\" Drummond in a series of \"B\" features in the late thirties makes it ironic that he played the younger brother of Ronald Colman here, who had begun the talking picture segment of his career with the same role. Howard does not have a British accent, but he does show the adoration of the younger brother for his famous sibling, and the growing anger and contempt he develops when brother Robert fails to plan for their leaving this prison they were dragged to - note how he wants to return with a bomber to destroy Shangri-La. It is one of the two roles in major films that John Howard is remembered for, the other being \"George Kittridge\", the erstwhile fiancé of Tracy Lord (Katherine Hepburn) in THE PHILADELPHIA STORY, who is pushed aside by both Cary Grant and James Stewart.<br><br>As it is one of Howard's best roles, it is nice that when the film was restored (as well as possible) in the 1980s, Howard (one of the three surviving cast members) was able to appreciate it - many of the missing sequences were his scenes. Howard was very happy at the restoration result.<br><br>Now, one or two notes that may help appreciate the film a little more. Who is Robert Conway supposed to be? He is called, by the High Lama, \"Conway, the empire builder.\" He is supposedly able to do impossible things - hence the admiration of his brother. When he returns to Shangri-La at the end, the comment of the man telling the story is that Conway's journeys by himself back to his valley was beyond what ordinary men could do. So who is Conway? Well, in 1937, the model for Robert Conway was dead, from a motorcycle accident, for two years. It was, of course, Thomas Edward Lawrence \"of Arabia\", who had never been in Tibet (officially, anyway) but had served time in the Indian subcontinent area on government business in the 1920s. Quite a model for an empire builder.<br><br>The character played by Thomas Mitchell is also based on a real person. Harry Barnard's real name (which I have forgotten) is that of an international financier whose vast empire collapsed ruining thousands of investors. It turns out Mitchell's character is based on Samuel Insull, a mid western utilities empire builder (out of Chicago) whose financial doings brought about his collapse in the Great Depression. Insull fled in disguise to Greece, but was found on a dirty freighter, and returned to the U.S. (where he would stand trial for fraud, but be acquitted). Edward Everett Horton's anger at Mitchell when he learned the latter's identity is understandable. Mitchell's involvement in installing new pipes in Shangri-La mirrors Insull's early days, when he was an electrician, and an assistant to Thomas Edison.<br><br>The use of these two real figures as the basis of the characters helped contemporary audiences to accept the background of the plot of the film.","user":"theowinthrop","rank":[61,65]}]