[{"title":"Entertaining and engaging adaption of a gothic classic","rating":9,"date":"22 August 2001","review":"A thoroughly engaging adaption of the brooding classic, this film rises above the turgid tone often imposed on other classics brought to the screen. Joan Fontaine turns in a brilliantly deceptively understated performance, and Orson Welles restrains from the scenery chewing that marred some of his own projects; there is surprising chemistry between them. At times, Welles is a downright \"sexy\" leading man! The script (credited to John Houseman and Aldous Huxley) captures the right \"tone\" of Victorian cruelty and repression.<br><br>Under Robert Stevenson's direction Fontaine/Welles seem to capture the essence of two abused outsiders resisting their attraction for one another, trying to adhere to convention. A strong supporting cast. There are brief though memorable appearances by Agnes Moorehead, Elizabeth Taylor and Peggy Ann Garner as \"young\" Jane.<br><br>George Barnes' camera captures appropriately stark images of Ross Dowd and Thomas Little's sets. Charlotte Bronte's grim novel is well suited to the excellent B/W, cinematography: a memorable scene early in the film has young Jane being punished by being forced to stand on a stool that is nearly in the center of a fan of shadows cast by the stair railing, It is almost reminiscent of expressionist German films of the Weimar years.<br><br>The film manages to entertain as well as inform. Purists may object to the last 3 lines of the film which hint at a slightly happier denouement than the book offered. In spite of that, Jane Eyre is still a nearly flawless film.","user":"maxwellhoffmann","rank":[54,59]},{"title":"Fine Cast in a Pretty Good Adaptation","rating":31,"date":"31 July 2001","review":"This version of the classic novel is most distinguished by its fine cast. The adaptation itself is pretty good, although the first part (Jane's childhood) comes across better than the main part of the film.  The original novel is a complex story and character study, and it would be quite a job to squeeze everything into a film of under two hours - all things considered, this version does a pretty good job despite eliminating some significant parts of the book.<br><br>There are a lot of fine actors in the cast, and Orson Welles is ideal for the role of Rochester.  Joan Fontaine is good too as (the adult) Jane, although the character in this version is somewhat less interesting than in the novel, so she has less to work with than Welles does.  There are some fine performances in the early part of the movie, and some excellent casting, including Agnes Moorehead as Jane's mean-spirited aunt, the icy Henry Daniell as Brocklehurst, and a young Elizabeth Taylor as Jane's school friend Helen.  That part of the film works perfectly.<br><br>Although the last part is not quite as effective, overall the movie still offers several good reasons to watch it.  You get to see a fine cast in action, and if the film is not the masterpiece that the novel was, it's a good picture and certainly worth seeing.","user":"Snow Leopard","rank":[30,33]},{"title":"Beautiful, classic film!","rating":9,"date":"7 November 2001","review":"Reading the novel before seeing the movie, I had my own ideas about the characters of Miss Bronte's book.  The movie leaves quite a bit of the story out, but dutifully makes up for it with a strong actors and incredible cinematography.<br><br>Joan Fontaine portrays the shy, demure Jane Eyre. (or is she?)  I always believed this was the story of a woman forced to be what society felt a woman should be. Once Jane becomes the governess of Mr. Rochester's ward, she feels free to be the woman she truly is: strong-willed, opinionated and passionate.<br><br>Truly, they just don't make movies like this anymore. Not just a love story, this is a tale of finding oneself and realizing one's true destiny.","user":"Mandice","rank":[31,36]}]