[{"title":"Leisen + Sturges = classic","rating":9,"date":"4 November 2007","review":"It's fascinating to speculate what Preston Sturges would have done with this film had he directed it himself. He reputedly disliked Mitchell Leisen's treatment, but in this he only proves he was a better creator than a critic.<br><br>I suspect Sturges wanted to deliver a typically cynical social satire; something about how the rigidity of law must inevitably give way to the caprices of love (with a plot boldly swiped from Camille). But Leisen brought to the project all the delicate sentiment that Sturges would have shied away from, and turned Sturges' clever parable into a heart-rending, almost Dickensian Christmas fable.<br><br>Just as Sturges was a genius of dry wit, Leisen was a master at tweaking the heart-strings, and of creating a magically timeless mood. (See Death Takes a Holiday, for instance.) So in Remember the Night we have a one-of-a-kind fusion of opposites. What results is a remarkable film: understated and clever, yet emotional and heroic. And somehow, amazingly, both hopeful *and* downbeat.<br><br>Remember the Night is one of a handful of absolutely indispensable Christmas classics: it deserves to be counted right alongside It's a Wonderful Life, Miracle on 34th Street, A Christmas Carol and The Bishop's Wife. It's less-known than the others doubtless because it's less mystical, less whimsical, and most importantly, because it fails to provide the mandatory Happy Ending. But that's exactly its greatest value.<br><br>We've come to set impossible standards for Christmas, and bring only disappointment upon ourselves, year after year. Remember the Night reminds us that Christmas is, after all, just one part of the cycle. It can't magically endow us with Joy Everlasting... but it can allow us a chance to raise our sights just a little bit as our lives tumble inevitably onward into the new year. And that's a *real* miracle, not a storybook fantasy that requires angelic intervention to make it come true.","user":"fung0","rank":[48,51]},{"title":"Dewey Wouldn't Approve","rating":8,"date":"13 December 2008","review":"Watching Remember The Night I remembered something else that audiences might have forgotten in 1940 in seeing this film on screen. The District Attorney of New York County was one Thomas E. Dewey who was definitely not one for mixing business with pleasure. If one of his Assistant District Attorneys went bail for a prisoner he was prosecuting and took her home for Christmas and across a few state lines to boot, that man would not have had a job and Dewey wouldn't have cared about reasons of love.<br><br>But with a script by Preston Sturges and direction by Mitchell Leisen you could forget about reality and concentrate on Christmas romance. Leisen assembled a great cast of character players in this very charming comedy/drama. And you can't miss with leads like Fred MacMurray and Barbara Stanwyck in the first of four films they did together.<br><br>MacMurray's the ADA who's prosecuting Stanwyck for shoplifting and this ain't her first offense. But a combination of her beauty and charm and one flannelmouth defense attorney has him feeling sorry for her and then going her bail and taking her home because, after all it's Christmas.<br><br>They have an eventful drive to Indiana where they both coincidentally hail from and MacMurray himself winds up a fugitive from a speed trap in a hilarious sequence. And the two see the kind of homes each came from, something that prosecutors and criminals don't often see from each other's point of view.<br><br>Beulah Bondi and Elizabeth Patterson play MacMurray's mother and aunt and are quite the contrast to Georgia Caine who is Stanwyck's cold hearted mom. Spencer Charters does a good job as the speed trap judge in Pennsylvania.<br><br>My favorite however is Stanwyck's attorney Willard Robertson who is really carried away with himself as her lawyer. He's giving her a defense on the shoplifting charge that Clarence Darrow gave Leopold&amp;Loeb. Man does love to hear himself talk. But his talk keeps the trial over the holidays allowing cupid to work.<br><br>Stanwyck and Sturges became friends and he confided in her that he would be directing as well as writing soon and next year he might just have a project perfect for her. The project turned out to be The Lady Eve according to a recent biography of Stanwyck.<br><br>Remember The Night is a charming film by some charm masters. But I suspect that Thomas E. Dewey probably hated it.","user":"bkoganbing","rank":[39,42]},{"title":"Home for the Holidays","rating":9,"date":"28 December 2001","review":"REMEMBER THE NIGHT (Paramount, 1940), directed by Mitchell Leisen, is a sentimental drama with doses of comedy, compliments of screenwriter, Preston Sturges, shortly before winning fame as top 1940s comedy director with such madcap classics as THE LADY EVE (1941), THE PALM BEACH STORY (1942) and MIRACLE OF MORGAN'S CREEK (1944), among others. It also marked the first of four movies to pair Barbara Stanwyck and Fred MacMurray, with their most famous being DOUBLE INDEMNITY (Paramount, 1944), but REMEMBER THE NIGHT is certainly a movie to remember.<br><br>Set in New York City during the Christmas shopping rush, Lee Leander (Barbara Stanwyck), a classy lady wearing fur coat and gloves, manages to purposely walk out of the store with a diamond bracelet. After heading to another store to possibly do some more lifting, she is recognized by the store-owner and kept there until the police arrive. Lee goes on trial defended by O'Leary (Willard Robertson), with John Sargent (Fred MacMurray) as an assistant district attorney whose job is to send this third time offender to prison. Because it is Christmas Eve, the case gets postponed until January 3rd. Feeling sorry for Lee for having to spend Christmas in jail until her case comes up again, John arranges to have her bailed out. Because she has no place to go, John, learning that Lee is originally from Indiana, his home state, and since he is planning to drive home there to spend Christmas with his family, agrees to take Lee with him and leave her at her mother's home, and pick up her again on his way back to New York. After John witnesses Lee's mother's (Georgia Caine) cold-hearted reception towards her daughter, who has never forgiven her for her past misdeeds, he decides to take her with him to spend the holidays with his family. Upon meeting John's mother, Sarah (Beulah Bondi), his aunt, Emma (Elizabeth Patterson), and their farmhand, Willie Sims (Sterling Holloway), Lee is greeted like one of the family, which changes this hard-boiled dame after being given a real Christmas she never had, and learning a lesson of humility. On top of that, she starts to fall in love with John, in spite of a trial awaiting her upon her return to New York.<br><br>REMEMBER THE NIGHT is a well-written comedy-drama that is unjustly ignored as one of the Christmas packages of annual holiday delights, not as well known as the most famous treasures of revivals, such as Frank Capra's IT'S A WONDEERFUL LIFE (1946) for example. Like IT'S A WONDERFUL LIFE, REMEMBER THE NIGHT blends comedy with sentimentality. It also has its moments of darkness, such as the scene where Lee (Stanwyck) is reunited with her cold-hearted mother, now remarried. After leaving the home where she was raised, she goes outside on the front porch to cry with John by her side. At the same time, the camera, which focuses on the central character, also picks up Lee's mother looking sternly through the curtain of the glass door, shutting off the lights and going about her business, as Lee tells John that she wishes that she had broken her neck upon falling from a tree at the front of the house when she was a child. On the humorous side, the street-wise Lee succeeds in outsmarting a yokel farmer (John Wray) and a small town judge (Thomas W. Ross), which avoids her and John from spending time in jail for unwittingly trespassing on the farmer's property and taking milk from his cow. Then on the lighter side in the Sargent household, there is Willie (Holloway) taking time to sing a nice song, \"The End of a Perfect Day.\"<br><br>In the supporting cast are Charles Waldron as the New York Judge; Paul Guilfoyle as John, the district attorney; Frederick \"Snowflake\" Toone as John's valet, Rufus; and Tom Kennedy as \"Fat Mike.\" Barbara Stanwyck, who gives an excellent performance, as usual, is presented with charm and beauty, especially the scene on Christmas day where she sits by the Christmas tree looking at John's baby picture while John is playing the piano singing \"Swanee River.\" It's a beauty and glitter in Stanwyck that is more noticeable here than any of her other movies. Look for it. Other songs heard in the movie include: \"Nothing in Life But You\" and \"My Indiana Home.\"<br><br>REMEMBER THE NIGHT, which was formerly presented on cable TV's American Movie Classics from 1993 to 1994, and part of the the Disney Channel's former \"Best of Hollywood\" in the early to mid 1990s, and distributed on video cassette about the same time through MCA (and Turner Classic Movies where it premiered December 17, 2006). Anyone tired of the overplaying of the same Christmas movies presented on TV year after year, and looking for something new and different from Hollywood's golden age, and worthy of rewatchability, REMEMBER THE NIGHT is the one worth seeing. (***1/2)","user":"lugonian","rank":[67,76]}]