[{"title":"Fight for Freedom","rating":8,"date":"12 December 2010","review":"In 1933, in Kyoto, the academic freedom is under attack and the spoiled daughter of Professor Yagihara (Denjirô Ôkôchi), Yukie Yagihara (Setsuko Hara), is courted by the idealistic student Ruykichi Noge (Susumu Fujita) and by the tolerant Itokawa (Akitake Kôno). When the academic freedom is crushed by the fascists, Professor Yagihara and the members of the Faculty of Law resigns from their positions and Noge is arrested. <br><br>Five years later, Noge visits Professor Yagihara and his family under the custody of the now Prosecutor Itokawa and tells that he is going to China. Yukie decides to move alone to Tokyo and years later, she meets Itokawa in Tokyo and he tells that Noge is living in Tokyo. Yukie visits Noge and they become lovers. <br><br>In 1941, Noge is arrested accused of ringleader of a spy network and Yukie is also sent to prison. When she is released, sooner she learns that Noge died in prison and she decides to move to the peasant village where Noge's parents live and are blamed of being spies by the villagers. She changes her lifestyle and works hard with Madame Noge (Haruko Sugimura) planting rice and earning the respect of her mother and father-in-law. With the end of the war, freedom is restored in the defeated Japan and the flowers blossom again. <br><br>Japanese militarists used the Manchurian Incident as a pretext to press the public for support to invade the Asian mainland. Any opposing ideology was denounced as \"Red\". The Kyoto University Incident a.k.a. Takigawa Incident was one example of this tactic.<br><br>Using this historical event and the Japanese tradition as background, Akira Kurosawa released in 1946 the fictional \"Waga seishun ni kuinashi\" a.k.a. \"No Regret for Our Youth\" to disclose the lack of freedom in Japan of those years. I do not recall in this moment any other film of this great director with such strong female character. Further, Kurosawa seems to be influenced by Yasujirô Ozu disclosing the relationship of Yukie with her family first and with Noge's parents in the second half of his story. My vote is eight.<br><br>Title (Brazil): \"Não Lamento Minha Juventude\" (\"No Regret for Our Youth\")","user":"claudio_carvalho","rank":[16,16]},{"title":"Political Passions Flared by Kurosawa and Hara in Post-WWII Japan","rating":8,"date":"17 April 2008","review":"I could hardly believe the actress playing the mercurial Yukie would soon be playing the serene and self-effacing Noriko in Yasujiro Ozu's home drama classics such as \"Early Summer\" and \"Tokyo Story\". Such was Setsuko Hara's versatility and malleability that she could move easily between Ozu's saintly goddess and Akira Kurosawa's passionate, reluctant heroine in this 1946 anti-war melodrama. In his first post-WWII film and the only one he ever made focused on a female protagonist, Kurosawa (with co-writer Eijirô Hisaita) has fashioned an emotionally ripe, politically charged and time-spanning story around Yukie, the daughter of a college professor, a one-time idealist who loses his job in face of the growing fascism engulfing Japan in 1933. Beautiful and skating precariously on the surface of her life, she finds herself caught between two men, both former students of her father - Noge, the son of peasant rice farmers, who becomes a secretive anti-war activist, and Itokawa, the conservative prosecutor and a symbol of the passive conformity that allowed Japan to enter a no-win war.<br><br>Yukie is excited by Noge's political passion, and they begin an intense, inevitably short-lived affair. When Noge goes to prison, she becomes politically enlightened to Japan's oppressive state, and after he dies, she decides to take his ashes to his parents and stay with them to work the fields. She endures a great deal of hardship, both from his uncaring parents and neighbors, who harass the family of a \"traitor\". Against the odds, Yukie endures and triumphs and despite a brief sojourn back to Kyoto, realizes her life is far more fulfilling with the peasants. Much of the plot is rather convoluted and the storyline jumpy, as the politically motivated Kurosawa seems more interested in drawing certain emotional responses from the viewer. Clarity is only a secondary consideration here, as he busily applies much of the visual flair that he would exhibit with greater impact in his later masterworks like \"Rashomon\" and \"Seven Samurai\".<br><br>Even at this early stage in his directorial career (it's only his fifth film), there are a number of his stylistic touches evident - a series of quick freeze shots to illustrate Yukie's traumatized response behind a closed door to Noge's surprise departure; the use of a slow exposure camera that causes an unearthly (and sometimes irritating) blurring effect when people are in motion; people lying in a pastoral setting staring skywards (mimicked recently by Chinese filmmakers like Yimou Zhang); Yukie's oddly exaggerated, out-of-sync piano playing; and large crowds rushing down steps in an Eisenstein-like manner. However, the film gains real emotional heft toward the end when Yukie struggles in the rice fields with Noge's mother (played almost unrecognizably by another Ozu regular, Haruko Sugimura) under Yukie's mantra of the dead husband/son, \"No regrets in my life, no regrets whatsoever\". It's a moving sequence which brings the story to its resonant conclusion.<br><br>Proving why she was one of Japan's favorite post-WWII film stars, Hara is superb in showing Yukie's initial flightiness and evolving political consciousness. The other performances are reasonable but hardly as memorable - Susumu Fujita as Noge, Akitake Kono as Itokawa (whom Yukie rejects at the end as unworthy to know where Noge's grave is due likely to his pro-war stance) and Denjiro Okochi as Yukie's father. The combination of the illustrious Kurosawa and the incandescent Hara is certainly compelling enough to warrant viewing.","user":"EUyeshima","rank":[24,27]},{"title":"Heartfelt story of Personal Courage","rating":9,"date":"1 September 2004","review":"The technical aspects of the film are very good. The camera used in this film uses abnormally slow shutter speeds causing the most slight (yet noticeable) distortions in movement, lending to the film a certain artistic sense that others do not have. It gives almost an eerie sense to it, and often times it seems to be somewhat drab, however: it seems to add very much to the mood of the story.<br><br>In addition to the artistic filming itself, the script truly drives the story and leads us to believe more of what Akira Kurosawa believed -- anti-Fascism, anti-Militarism, through the portrayal of events concerning Japanese imperial rule in the film. Through the eyes of Yukie we learn what it is like to be oppressed, and we learn the strength of the human spirit in its' resolute resistance to the militarism and fascism of her day; the power of the will is truly highlighted in this film, and the persistent commitment to doing good (similar to that portrayed by Watanabe in Ikiru) is very present. <br><br>The flashbacks to youth, the conjuring of memories, and the portrayal of the good times right next to the bad times, and the depth of human emotion that is revealed truly makes this film something worth watching. Some of the emotionality of the scenes (especially Yukie's emotional moments) portrays the existential angst that we all have, and her strength &amp; perseverance represent everything we would like to have. It was a truly impacting story.<br><br>I was especially keen on the ability of Akira Kurosawa to take some of the most inward, personal moments of extreme sadness and put them into the film and, without any seeming prior explanation, the viewer is able to relate in their own way. This film highlights a philosophy of oneself against the world, and the importance of being true to one self. The message was portrayed very clearly and the end result is a masterpiece of Cinema that is greatly overlooked.","user":"jmverville","rank":[19,21]}]