[{"title":"A movie I could watch 100 times and it would never get old","rating":10,"date":"28 September 2003","review":"This is a great Tonino Valerii &amp; Sergio Leone film featuring Henry Fonda &amp; Terence Hill. This is a take on the Trinity character Hill has done in the past, not the same character but a variation of it. This movie is a lot more serious than the Trinity(s) but still provides some very very funny scenes &amp; plenty of them. The more serious side is a great story, a man (Fonda) who is a living legend, especially in the eyes of a stranger (Hill) who will do everything he can to see his hero get written in the history books. It is adventurous, touching, and hysterical. All the elements of a perfect film for me. Also features an amazing soundtrack by none other than Ennio Morricone. Both the film &amp; its score are gems. Worth watching over &amp; over. A true 10!","user":"AriSquad","rank":[81,90]},{"title":"The Good, the Bad and the Good looking","rating":10,"date":"1 March 2005","review":"Great movie. From an idea of Sergio Leone, the guy from the good, bad and ugly trilogy. Terence hill is awesome. Fonda is himself. truly a great movie, in the best of the A-class spaghetti western tradition. Recommend for lovers of bud Spencer and Terence hill, but even more for lovers of Clint Eastwood and Sergio Leone and Ennio Morricone. the soundtrack is also fantastic. I found brilliant the way the director combined the lightheartedness of Hill and the stare-down gunfight angle of traditional Eastwood westerns. Also look for they called him trinity and sequel, also great movie, and those include bud Spencer. The movie is actually filmed in New Mexico, Acoma and surroundings, so the scenery is also fantastic. The original language is English, even though most of the cast is Italian, and both the Italian and English version are great. However, in the best spaghetti tradition I believe the Italian might capture some fine details better than the original. Ultimately I believe Terence Hill could have become a famous star of the caliber of Eastwood had he pursued that path instead of continuing the career as Bud Spencer's partner in crime.","user":"viperpaolo","rank":[71,89]},{"title":"great film","rating":8,"date":"5 March 2004","review":"I'm surprised i had never heard of this film before, i only got it because I'm a big fan of Henry Fonda. This movie reminds you of Once upon a time in the west and all the other spaghetti westerns but with a sense of humor and a great soundtrack. The movie stars out in 1899 with Henry Fonda playing a gunfighter named Jack Beauregard who just wants to get enough money so he can retire. Terence Hill plays another gunfighter named nobody who is obsessed with Beauregard. He's always following him around and wants him to fight the wild bunch, a group of 150 men, so he can be in the history books. This movie was produced by Serigo Leone and this was Henry Fonda's last western.","user":"kyle_furr","rank":[54,67]}]