[{"title":"Very under rated Stallone movie, whose storyline accurately fits his acting credentials.","rating":21,"date":"21 May 1999","review":"Lock Up I feel is one of Stallone's better movie's. The storyline seems to fit the acting character of Stallone very well. Sutherland's depiction as the Warden \"Drumgroole\" also was excellent. As always, Stallone seems to epitomize struggle in movies very well. In the movie Stallone is a convict just trying to ride his time out, but the warden makes it very hard on him. John Amos also depicts the caring but hard as nails Prison guard \"Micon\" very well. In my opinion Lock Up is a Top Level Stallone film, and didn't get nearly the credit it deserved. I certainly would recommend this film. One word that can describe this film would be \"EMOTIONAL\" If you like a tough, gritty prison movie, then you will certainly like Lockup.","user":"macnjnc","rank":[46,56]},{"title":"All you want from a Sly Stallone movie is right here.","rating":7,"date":"4 March 2008","review":"Have to say right off that I can't believe the low rating for this one here, because it delivers everything that a Stallone fan would want, if one is loading this into the player then surely they know what to expect?<br><br>Frank Leone (Sylvester Stallone) only has a few weeks to go before being released from prison, he is no hard core offender, he is a loving man and is ready for a new life with his gorgeous girlfriend Melissa (Darlanne Fluegel). During the night he is whisked away to a maximum security prison on the orders of a sadistic warden out for revenge because Leone was the only man to have ever escaped from his prison, thus setting in motion the wheels of revenge.<br><br>We then follow Leone as he is pushed to the limits by crazy warden Drumgoole (Donald Sutherland) and all the sadistic guards under his command. He also enlists the help of resident inmate beefcake Chink Weber (Sonny Landham), and they all in turn try to break Leone at all costs to ensure that he never leaves prison again. There certainly is nothing here that hasn't been done before in the prison film genre, and only an idiot would expect anything other than the ending we get, but this is a Stallone movie and it's full of guts, testo macho action, and it should be noted that Sly here puts some depth to the character of Leone. He garners our sympathy quite quickly, and considering the bloke is built like the proverbial brick outhouse, it's quite an achievement.<br><br>The supporting players are a mixed bunch, this is Tom Sizemore's first motion picture and he does really well with the character of Dallas, Sonny Landham is his usual scary menacing self, whilst Frank McRae as Eclipse does just enough right to make his mark. So it's something of a surprise to me that the best actor on show is actually the film's weak link. Donald Sutherland does overplay it to the point that he goes beyond pantomime villain, it's a real teeth itching performance that he would only outdo with the dreadful Jamie Lee Curtis starrer, Virus, 10 years later, but in a film with such primal fun/action intentions, it doesn't ruin the film and leaves it all told as a fine genre piece.<br><br>No awards here for sure, but when I watch a film about a man played by Sly Stallone in prison then I think I know what to expect, and it delivers all that I hoped for, so hooray for the beefcake I say. 7/10","user":"hitchcockthelegend","rank":[28,33]},{"title":"Great movie, strong plot ~ very entertaining!","rating":7,"date":"8 September 2002","review":"I often find myself disagreeing with the critics, but in this case I am in agreement with the other reviewers on this page... This is a terrific movie, pure entertainment. I am frankly tired of so many modern movies that are nothing but violence, nudity and special effects. Well, this movie is not one of them -- it actually has a good plot. Oh, what a rare treat!<br><br>The best acting is not Stallone's (no surprise there) but that of Donald Sutherland's portrayal of the sadistic and bloodthirsty prison warden. And the scene with the Mustang nearly made me cry. <br><br>If you haven't yet seen this film... What are you waiting for? You're missing what is probably Stallone's best films! Run, don't walk, to your nearest video store! :-)","user":"fiera121","rank":[43,53]}]