[{"title":"Madcap Pythonesque mock-up of Hollywood's \"Asians\"","rating":8,"date":"24 September 2005","review":"A side-splitting spoof of western perceptions of Asian culture as presented by Hollywood, beginning with Charlie Chan and Fu Manchu in the 30s and 40s and then straight through to the James Bond and early kung-fu era. <br><br>No need for any sort of substantive plot as we chuckle along at the antics of bumbling inspector Hoku (played by Zero Mostel) as he follows the trail of robot-thieving criminals (this is supposed to be set in Japan after all). Along the way our hero meets up with various unexpected dangers from Japanese keystone cops and a police captain bent on suicide (played by veteran Japanese actor Frankie Sakai). The \"action\" is frequently interrupted by our hero's fantasy dream sequences of his previous incarnation as a great samurai and moments of Zen-fortune-cookie clarity. Fans of Japanese cinema will also note that experienced actress Keiko Kishi makes an appearance as the hero's love interest.<br><br>Great fun for some of us, but the humor, and especially the parody, may well not be to everybody's taste, especially those already deeply offended by the subject of ridicule, one of Hollywood's largest and oldest sub-genre catalogs. <br><br>I don't think the 1976 date stated above is accurate, as the film was made much earlier. As noted above, it was never released in theaters. It has appeared as the late-night movie on North American television occasionally before being released on VHS in 1999. <br><br>It should be noted that Hollywood was still churning out various strange representations of Asian culture well past the time this movie was made. It's too easy to see Cato (as played by Bruce Kwouk) of the Pink Panther movies in harikiri-deathwishing Captain Yamada, just to cite one example.<br><br>Well worth an 8.0 for those of us who really enjoy this kind of silliness","user":"raktratt","rank":[11,11]},{"title":"Take a bow, Mr. Clyne!","rating":8,"date":"15 June 2016","review":"(Terence Clyne's only movie script to date was set for a May, 1970, release, but as it happened, the completed movie was rejected by every first release theater in the country and didn't actually surface in mainstream cinemas until 1976. One of the problems was the film's original running time of 131 minutes. It was eventually cut to around 101 minutes): An odd film. As a whole, it tends to misfire – the result of crude scripting and unsympathetic direction – but the word to emphasize her is \"tends\". Much of the film is very funny, very inventive, and very amusing indeed! Zero Mostel and his cohort of Japanese police have a real flair for comedy as they attack apartment doors and recalcitrant desks and form revolving guards of honor. Even the slapstick finale introduces a few switches of genuine wit, and the glimpses of Tokyo form a rare background. As usual, Mostel is in fine form and receives some excellent support. On the other hand, Jules Munshin's role is rather small. In fact, he's simply wasted. But all in all, the film's fascinating and funny moments hold the attention and help us to surmount the rougher spots. In fact, the movie is worth seeing for its credit titles alone! Music score, photography and other credits such as art direction, are nothing less than commendable. Yes, it's a mixed bag, but definitely an enjoyable one. I wouldn't mind seeing \"Mastermind\" again. Indeed some of the jokes and comic situations deserve to be savored more than once!","user":"JohnHowardReid","rank":[2,2]},{"title":"Completely unfunny comedy","rating":2,"date":"27 December 2018","review":"This obscure comedy was made in 1969, but shelved for 7 years before getting a limited theatrical release, and remained quite hard to see afterwards before earlier this year getting a release on DVD and Blu-ray. Seeing the movie, it's easy to see why there wasn't exactly a demand for it to be widely available. Even given the different attitudes when this movie was made, it's still pretty insulting to see a Caucasian actor made up to look like an Asian and act in a very stereotypical Asian manner. Quite possibly the movie could have been made palatable had it been funny, but it's quite the opposite. There are NO laughs to be found in the movie. Certainly, the gags based on stereotypes aren't funny, but the gags that are slapstick or any other nature fall flat as well. There is absolutely no comic energy (or any other kind of energy) in the movie, and as a result the movie threatens to put viewers in a trance when it's not being insulting. Also, the movie's interiors have a cheap untheatrical look akin to Hollywood television productions of the era. The only reason why I am not giving the movie the lowest possible rating is the few minutes of interesting exterior footage of 1969 Kyoto.","user":"Wizard-8","rank":[2,5]}]