[{"title":"Funny!","rating":8,"date":"3 September 2002","review":"I'm surprised by all the negative comments - this was the first National Lampoon movie I saw, so I came to it fresh.  OK, so it's not a great work of art, but I thought it was side-splittingly funny in places, and cleverly parodies all the national stereotypes that people tend to use.<br><br>As a great fan of visual humour, my favourite moment in the film has to be the scene where, having had all their clothes stolen, the family go shopping in a boutique in Italy and emerge on to the street dressed in absurdly over-the-top designer creations.  It really is one of the funniest sights I have ever seen in a film.  I defy anyone with a sense of humour not to laugh.","user":"td550","rank":[36,49]},{"title":"Not a vacation to remember","rating":5,"date":"14 February 2011","review":"The Griswold's (mis-spelled here as Griswald) European Tour is far inferior to their cross-country trek to Walley World. First time around Clark had a goal, a destination, and pay-off for the audience when he finally got there. Second time around he's just wandering aimlessly from country to country, and it doesn't make for great entertainment I'm afraid.<br><br>The Griswold's win the grand prize in a humiliating TV show called 'Pig in a Poke' and are sent to England, France, Germany, and Italy on an all expenses paid trip. The bulk of the humor is a scatter-shot approach to comedy that abuses tired clichés and cultural stereotypes for quick, easy, cheap laughs.<br><br>Director Amy Heckerling may have used the first Vacation as a reference, but she doesn't have the control over the film that Harold Ramis did, and frequently allows the actors to ad-lib with the assumption that whatever they do might be funny. Even comedy actors need direction, and Heckerling's poor effort ruins many scenes that had potential. Even her camera placing and angles seem awkward and unbalanced. The grainy, low-key photography is also completely inappropriate for a film featuring such a wide range of scenery. Her use of stock footage is bad too (a shot of the Statue of Liberty shows no Twin Towers of the WTC, which were built in 1972!), and heightens the slapdash nature of the production. A few scenes seem to be edited out of order too, which leads me to believe that the script flowed a little differently before being rewritten (Clark leaves the London hotel, moves literally five feet down the street, then asks for directions back to the hotel).<br><br>John Hughes' influence on the script was obviously minimum. Vacation and Christmas Vacation were ficionalised accounts of his own family's experiences. But European Vacation feels like a quick cash-in on the original's success, and co-writer Robert Klane doesn't know how to inject the pathos and satire that was so easy for Hughes.<br><br>The European trip is definitely lagging far behind Walley World, Christmas and Las Vegas. A better director and a tighter script would have saved it. But Chase is as watchable as ever, and the only reason to sit through this poorly-made drivel.","user":"CuriosityKilledShawn","rank":[28,40]},{"title":"I wondered whatever happened to Jack? :D","rating":7,"date":"19 September 2005","review":"OK, was this the best Vacation sequel? No, not really. But it still had a great amount of a laughter. I can't believe that some people really didn't like this film. Don't you have moments where you just want to sit down and laugh? Don't think, just laugh and have a good time with the film? The Griswalds are back and they are in Europe! They have won an excellent trip to London, Paris, Germany(they don't state where), and Rome. Of course they do manage to get into trouble, otherwise it wouldn't be a comedy. Clark still has the \"father-knows-best\" policy and becomes more obsessed with having a good time with the family than listening to them and their ideas. Ellen has become a famous naked model in Europe because of some undeleted footage that was stolen from Clark on his camera. Rusty is opting for a lot of booty in Europe and Audrey just won't shut up about a not all that boyfriend, Jack.<br><br>This movie has non-stop laughter that you have to admit is catchy. They did recycle some jokes from the first, but I think you need to let go and have some fun. This was an enjoyable film.<br><br>7/10","user":"Smells_Like_Cheese","rank":[29,42]}]