[{"title":"Intelligent, poignant satire on the the meaning of heroism","rating":10,"date":"1 January 2004","review":"Simply put, this is one of my all-time favorite movies. I can't possibly agree with the individual who wrote this was possibly James Garner's worst movie. The exact opposite is true. The character of Charlie is callous, and self-serving, but he has a dedication to the admiral that is logical and touching. It is the admiral, after all, who saved Charlie from the realities of war.<br><br>Listen to Charlie's speech about how he got there. He started off by going to war with all the ideals of any other Marine, but in the teeth of war he realized he wasn't the man he thought he was and \"the glory\" certainly wasn't worth it. Charlie is a coward, but not a deserter. He has priorities, which he lists to Emily. <br><br>Garner does a fine job in communicating the role of an outwardly selfish and uncaring man struggling hard to suppress his principles.<br><br>Julie Andrews' Emily is just the person to bring those principles out. And James Coburn is outstanding as the one person who actually takes the admiral's plan for a sailor to be the first casualty on Omaha Beach seriously. <br><br>Very good acting by all. Fine comic performances in a film that is easily overlooked by today's audiences because it isn't the type of humor that hits you over the head with a baseball bat to make its point. Instead, it uses characterization and intelligence.<br><br>How sad we are that we are no longer required to think about movies, since so many of them have no thought behind them other than making money. <br><br>\"The Americanization of Emily\" is definitely worth a look if you like smart, intelligent characters with something to say.","user":"wdbrown","rank":[103,109]},{"title":"Paddy Chayefsky, what a writer!","rating":9,"date":"13 March 2018","review":"Think of Network or The Hospital, Paddy Chayefsky was seeing into the future and what he saw was ugly. Here we have an insane admiral and how his men, who know he's crazy, stand in line to follow his wishes/commands. An anti war film without sentimentality. Julie Andrews is a total delight as the tough cookie with a razor sharp mind. James Garner has the best lines of his career. His tea with Joyce Grenfell is a superb written scene. Joyce Grenfell as Julie's mother is divine, yes, divine! Melvyn Douglas as the crazy man in charge is the Howard Beale of the situation and what he does with it is pure genius. Highly recommend it.","user":"claudiaeilcinema","rank":[31,32]},{"title":"A black comedy about the excesses of war set against the backdrop of D-Day.","rating":9,"date":"19 June 2005","review":"I first saw this movie in 1964 at the Air Force base where I was stationed. At the time I thought it was an odd choice to show on base, but in those days, I guess the military wasn't so sensitive that they had to censor the films shown on base. The movie practically disappeared for 40 years, and I was pleased to see that it is now released on DVD. I watched the DVD this weekend and was happy to find that the film still seemed fresh and had aged very well.<br><br>Watching this movie reminds one of why James Garner and Julie Andrews became stars. They are both extremely likable and have good chemistry together. Garner's character, Charlie Madison, is just a rift on his Maverick TV personae, but is well suited to the character. Andrews, in a non-singing role, is luminescent. She plays a British war widow the way all Americans think of British women. It is a classic portrayal. The star of this film though, is the script by Paddy Chayefsky. Snappy, witty dialog and that strong dose of black humor amply illustrate why Chayefsky should be considered on of the finest script writers of all time. This is equal to his work in Network.<br><br>The DVD extras are sparse. There is a 6 minute 1964 MGM featurette on the filming of the Omaha Beach scene. It is only notable by comparison of Mr Garner's treatment during filming to how today's over-indulged, ego-inflated, and under-whelming movie stars are treated. Recommended.","user":"llsee46","rank":[49,53]}]