[{"title":"He poured, he reigned; at the box office at least.","rating":7,"date":"16 January 2010","review":"Tom Cruise stars as Brian Flanagan, who is fresh out the army and finding that landing an executive job in the big city isn't as easy as he thought. Taking on a course for a business degree, he winds up working part time at a cocktail bar under the tutelage of bar tending philosopher Doug Coughlin (Bryan Brown). A new world is about to open up for both of them.<br><br>Right, I have the softest of soft spots for this movie. That doesn't mean I'm not aware of its many failings, most notably the heavy weight of predictability that pounds down on the head from the very first frame. But as simple as it may be (oh this is plot line simplicity decorated in flashy booze bottle twiddling), and the obvious cash in on Cruise's box office appeal that it was (note that his next film was the considerable shift to Rain Man), it's fun (thanks to Bryan Brown's mugging) and sweetly romantic (thanks to Elisabeth Shue being sweetly romantic). Yeah it's a hard sell I know! But Cruise charms in a way that has his haters swigging the Alabama Slammers by the dozen, and guys! Kelly Lynch pops up wearing a thong. Yeah I'm pretty shallow where Cocktail is concerned, sue me...<br><br>All together now, \"This magic moment\" 6.5/10","user":"hitchcockthelegend","rank":[23,27]},{"title":"Theoretically, Flawless in its Design","rating":10,"date":"13 September 2005","review":"Cocktail is a lot of things. It's a classic love story about finding the right \"rich chick\". It's a sorted tale about an aging down on his luck bartender who finds a reason to live. And it's also a feel good film. It teaches you how to respect the desire. Be careful around Elisabeth Shue. \"And pretty soon, days get shorter and shorter, nights longer and longer, before you know it, life is just one long night with a few comatose daylight hours.\" And in the end, no matter how shitty you are to people, they will always forgive you. Bryan Browns masterpiece and Cruise is electric. It's another one of those movies you could watch over and over. And in a little while, your want to watch it again. If anyone hasn't seen this movie and doesn't plan on it, than they are just retarded. Do yourself a favor, run down to the store and buy it. You'll thank me.","user":"JFHunt","rank":[113,185]},{"title":"...but if you wanna get loaded, then why don't you just order, a shot","rating":9,"date":"19 November 2015","review":"Wow this movie really has taken a beating from the IMDb reviewers. I think the several one star marks it received, is a little harsh but OK, I'll try to highlight the good things about this movie rather than the bad. I've always been of the, if you haven't got anything good to say, don't say it, school of thought.<br><br>I think some people watch movies needing them to evoke a strong emotional responses. They want to be moved, they want a journey, or at the very least they want the plot line to be extremely engaging &amp; flawless; Godfather, Shawshank, Schindler's list etc or those of similar ilk are classic examples. If a movie does not do that, or doesn't meet a preconceived criteria, they feel short changed. These are the \"I just wasted 90 minutes of my life\" people, the short attention span people, the people that fall asleep 10 minutes in unless there's a court jester juggling in the isle. They are not people that watch all kinds of movies all the time as their primary way of unwinding. When they watch a movie they want it to knock their socks off, pure &amp; simple. A fair point, but Cocktail like many others, is not that kind of movie.<br><br>Movies are like eating, there's something for every mood. I've been to New York &amp; like millions of others, it's one of my favourite cities (where half of the movie is shot) &amp; I've been to the Caribbean several times (where the other half is shot), both great locations. I love the electricity of a good bar atmosphere, having a few drinks &amp; a wiggle, the prospect of maybe getting lucky, or at least getting drunk &amp; having a sing song, don't we all? This movie includes all the above and more. The classic rock &amp; roll sound track is great, Everly Brothers, Big Bopper, Little Richard, Hippy Hippy Shake etc... &amp; there's some nice mellow reggae ones thrown in as well.<br><br>For the above alone, this deserves more than 1 star. It was never meant to garner dozens of Oscar Nominations, set records or change the face of cinema, It's just good fun. We can vicariously live through Toms charming, cocky &amp; confident Brian Flanaghan as he rises to the top of New York's upper east side bar scene &amp; from then in the Jamaican paradise of Montego bay, lazily serving cocktails on the beach. And for the ladies there's plenty of romance.<br><br>No major studios got behind this &amp; it obviously didn't have a massive budget, so like a lot of movies around this time it suffers a bit with production values. There's a section where Cruise has obviously been called back for pickups to strengthen the interview montage at the start. He goes from Cocktail hair, to Rain Man hair, to Cocktail hair again. Same thing happens to Michael J. Fox in Secret Of My Success &amp; that's one of my favourites. I find this comical more than anything else, it's just a period thing. I guess that's because I have a happy, sunny disposition, it's the glass is half full thing again isn't it.<br><br>Plonk Tom in front of a camera &amp; he'll never disappoint &amp; Elizabeth Shue Is adorable, plus there's great work from the supporting cast. If you are one of the less judgemental &amp; cynical among us, who liked the 80's, a simpler time before technology dictated our every move &amp; who can handle the odd 6 out of 10 without getting their underwear in a twist &amp; having to take half an hour out of their lives to write a scathing review, then go for it.<br><br>\"This is the upper east side, the saloon capitol of the world, the big time. Are you ready for the big time Mr Flanagan?!\"","user":"pfisher-32275","rank":[6,7]}]