[{"title":"Hurrah for the POM POM GIRLS!!!!","rating":7,"date":"8 November 2000","review":"THE POM POM GIRLS was a huge sleeper hit in it's day and it's easy to see why. Thousands of stoned kids across the land with beer in hand at the drive-in, watching this documentary-like fun fest on being a high school kid in the mid-70's. What a wonderful life these kids have! Drive around drinking or high, get the girl, have sex where ever you want, and not worry about any diseases or repercussions whatsoever. And football. You get to play a lot of football.<br><br>I love this film. If you tried to make a movie like this today, you couldn't do it without some killjoy saying you couldn't have them drinking and driving. But kids do that. Some die and a majority don't. These kids are not repressed sexually. They are free to make love to whoever they choose and don't worry about death and condoms. They seem to be having fun and enjoying life, and that's why this film really couldn't be made today, because it shows people, teens especially, enjoying life in an innocent, yet rebellious, drug-addled, highly sexual way. Nobody dies, nobody gets hurt, and they do everything they were told they shouldn't do. It's a social time capsule for an extremely fun and liberated time.","user":"blackxmas","rank":[27,29]},{"title":"Definitely worth a watch","rating":8,"date":"8 November 2002","review":"\"The Pom Pom Girls\" is more about the two guys on the football team (one being the great Robert Carradine, always a blast to watch) and the antics they lead the girls into, whether it's making out, stealing a fire truck, causing grief for the rival school, and other assorted tomfoolery. Unlike many other movies of the type, this one is actually interesting and fun to watch, and even the cheesy early 70's music they chose for the movie is decent and adds to the atmosphere. And the girls are rather pretty as well. And for car lovers there's a lot of cool old cars to see, especially Carradine's '55 Chevy (there always seems to be a '55 Chevy in so many of these films). Definitely a good showcase of when life was more carefree and a lot less complicated. Nice to even have it on DVD, although a widescreen release would have been better than fullscreen.","user":"stevenfallonnyc","rank":[12,13]},{"title":"A slice-of-life from the 1970s","rating":5,"date":"2 April 2006","review":"I attended the school(s) at which this movie was made. THE POM POM GIRLS was filmed at the two (junior and senior high school) campuses of Chaminade College Preparatory (in Chatsworth and West Hills (née Canoga Park), California). At the time of filming the production went by a far less sensational title (PALISADES HIGH, I believe), and the administrators of the fund-grubbing Catholic school were excited to have a movie lensed on their properties. Interiors and exteriors were shot at both campuses, and I attended classes in the rooms shown in the movie. Believe me, it's weird and wonderful (and a bit sad) to look back in time, watching this movie and reminding myself of what it was like to grow up during the 1970s and go to (this particular) school. THE POM POM GIRLS is certainly not a great movie by any stretch of the imagination, and it outraged the school PTA when it was released as a tits&amp;ass, soft-core, teensploitation flick (the school was under the impression it was going to be a lot cleaner and more meaningful...HA!). But I have a strange fondness for this movie, as difficult as it can be to sit through for its sheer inanity. The film does succeed on one level, however. Every decade has its share of \"teen\" oriented movies showing kids misbehaving, falling in love, getting into trouble, etc. These films manage to depict popular culture of the time perhaps better than any other genre film. THE POM POM GIRLS captures that slice-of-life of the 1970s as well as any other film from that era I know of. And at the same time idealize it to mythic proportions. I can honestly say I didn't have nearly as good a time in high school as the characters do in this film -- I only wish I had! -- but I did observe other kids leading this sort of lifestyle -- skipping class and driving to Malibu or wherever...getting high in the backs of vans...and being promiscuous. If I had it all to do over again...(sigh). Incidentally, the mud-pit scene in the movie was a ritual which took place annually at the Chaminade high school campus as part of a week long initiation (seniors versus sophomores). By the time I became a sophomore (a year after this film was made), the mud pit had been done away with -- rumor has it someone put broken glass in the pit and injuries occurred. As the saying goes, it's all fun and games until someone gets a fork in the eye... And that's what THE POM POM GIRLS feels like: all the fun and games that happened *right before* someone got that fork in the eye. THE POM POM GIRLS is not a good movie, but it's an entertaining \"drive-in\" flick -- excellent to \"make out\" to. As a genre film it appears loosely based on the Juvenile Delinquent films of the 50s and 60s but it lacks The Message (moral) that pervades most of those films. Look at HOT RODS TO HELL (1967), for example, which was a morality play about youngsters living hard and fast (\"for kicks, man!\") and learning -- by the end of the film -- that smart-ass antics can result in tragedy. THE POM POM GIRLS, on the other hand, goes so far as to include a \"Chicken Suicide Race\" at the climax (lifted right out of REBEL WITHOUT A CAUSE), but even that's just a red-herring for another of Johnnie's pranks. Just when it looks like the film might have a message (and some real meaning) the rug is pulled out from under you. This results in a film that ultimately feels empty-headed, hedonistic, and shallow. \"Carpe Diem\" and all that. Consequently, a certain sweet sadness hangs over this movie -- you know that, sooner or later, Johnnie and his band of friends are going to face things like the draft, unwanted pregnancy, STDs, Real Life (including the unemployment line), etc. I still chuckle to myself about this film because it may lack significance to many, many people...except, perhaps, to all the teachers, parents, and Marianist priests and brothers of Chaminade Prep whom it scandalized (hee hee hee!).","user":"weho90069","rank":[6,6]}]