[{"title":"Highs and lows","rating":6,"date":"28 March 2008","review":"After a great short (\"Couro de Gato\", included in the omnibus film \"Cinco Vezes Favela\") and a hit documentary (\"Garrincha Alegria do Povo\" about 2-time World Cup champion soccer player Garrincha), director Joaquim Pedro de Andrade makes a visually striking but highly irregular fiction feature film debut with \"O Padre e a Moça\", a story of forbidden and doomed love between a young Catholic Priest (Paulo José) and an abused girl (Helena Ignez) in a tiny village in the hinterland of Minas Gerais (Southeast Brazil), in an liberal adaptation of the poem by Carlos Drummond de Andrade.<br><br>The film suffers from pace problems: the first half is great, the second half drags on purposelessly. The characters are sketched to remain mysterious (it's all suggestions, nothing is defined), but you could also call them underdeveloped. Carlos Lyra's music is either in the wrong places or missing in scenes that begged for a score. The chiaroscuro cinematography by Mário Carneiro has extraordinary moments, but sometimes the film simply \"stops\" for the sake of beautiful framings and compositions. The film benefits immensely from all-location shooting in the tiny village of São Gonçalo do Rio das Pedras, with its ruined vestiges of 18th century grandeur (it used to be a diamond exploitation site), Brazilian colonial architecture and rococo churches. There's also an effective use of the local population in bit parts, adding to the film's sense of realism.<br><br>Above all, it's a chance to see the striking debut of actor Paulo José, who was summoned two days prior to shooting as a replacement for another actor who fell ill. A stage actor, Paulo had no previous film experience, but -- bingo! -- with \"O Padre e a Moça\" one of the best ever Brazilian film actors was born, and in the following year he would become a full-fledged star with Domingo de Oliveira's hit \"Todas as Mulheres do Mundo\". There isn't one single false note in his portrayal of the repressed, anguished priest, and he has one of the those faces you don't get tired of watching. Helena Ignez was never lovelier and is thoroughly believable as the beautiful, stifling, abused girl who entices men's desire and women's envy. Mario Lago is perfect as the village's big-boss who abuses everyone and plays father-lover to the girl. Fauzi Arap lends nervousness to the confusing part of the drunkard who claims to have an affair with the girl (though there's a strong suggestion he's impotent).<br><br>Recommended for Cinema Novo fans and viewers who don't have problems with slow-paced and Catholic-guilt films, \"O Padre e a Moça\" is the flawed but honorable fiction debut of an important filmmaker whose next film would take Brazilian cinema by storm: the iconoclast, trend-setting, revolutionary masterpiece \"Macunaíma\", the biggest hit of the Cinema Novo movement.","user":"debblyst","rank":[10,12]},{"title":"A Forbidden Romance","rating":6,"date":"10 February 2004","review":"In a small village in the interior of Minas Gerais, a young priest (Paulo José) arrives as the substituted for Priest Antônio, who is almost dead. There, he meets the old man Fortunato (Mário Lago), who is the local leader and lives with the young woman Mariana (Helena Ignez) as husband and wife. The priest decides to take the girl to the city of Diamantina, but they both fall in love for each other. In my opinion, the characters of this very slow movie are not well developed. The dilemma of the young priest is very clear, but the feelings of Mariana are very confused. I indeed expected much more of this story. In Brazil, this film is only available on cable television. My vote is six.<br><br>Title (Brazil): `O Padre e a Moça' (`The Priest and the Young Woman')","user":"claudio_carvalho","rank":[8,16]}]