[{"title":"\"Do you think you could learn to love me?\"","rating":8,"date":"10 August 2006","review":"It's curious that Buster Keaton, whose training was in a knockabout vaudeville act and slapstick comedy shorts, was so good at playing pampered, effete young millionaires. He just happened to be one of nature's aristocrats. Buster appreciated the comic possibilities of this characterstarting out so helpless allowed plenty of room for dramatic development--and the role also suited his innate gentleness and quiet dignity. <br><br>Buster played wealthy idlers in several of his movies, including The Navigator, but he was never more placidly twitty than in Battling Butler. For the first half of the movie he looks like a 1920s fashion plate, exquisitely groomed, demonstrating What the Well-Dressed Man Will Wear for hunting, fishing, etc. He is Alfred Butler, whose tycoon father, annoyed by his son's languid existence, sends him an a camping expedition to toughen him up. In the mountains, he sleeps in a vast tent complete with bed, wardrobe and tiger rug; his faithful valet lays out his clothes, draws his bath, and serves his meals on silver dishes. This is my idea of roughing it! While attempting to hunt (obliviously missing every animal in the forest) and fish (capsizing his boat in pursuit of a bobbing duck), Alfred encounters a pretty \"mountain girl\" (Sally O'Neil.) They fall in love, but her family won't accept this sissy as an in-law until Alfred's valet tells them that his employer is actually Alfred \"Battling\" Butler, a boxer contending for the lightweight title.<br><br>Alfred goes along with the ruse for the sake of the girl. Then he encounters the real \"Battling\" Butler, and after a misunderstanding involving the boxer's wife, \"Battling\" tells Alfred that HE can fight the title bout with the \"Alabama Murderer\"or he'll blow his cover. The rest of the film follows Alfred's difficulties as the trainers try to turn the playboy into a fighter. Along with the athletic sequences in his later movie College, these scenes offer the most sustained focus on Buster's extraordinary physique and what he could do with it.<br><br>With his small stature, Buster could convincingly portray a milquetoast as long as he kept his clothes on, but once he strips down to boxing shorts it's all too obvious how exceptionally fit he was. In the opening shot of the training sequence, he's obviously supposed to look puny and defenseless; instead he looks like he could easily be a boxer. Despite his sculpted body, Buster plays these scenes with a realism that renders them almost painful to watch. He reacts the way any normal, soft-bellied human being would to being mercilessly pummeled. He shows hurt and exhaustion, and displays his own nearly limitless endurance of both. Buster had, it must be said, an unhealthy capacity to take punishment. It wasn't masochism, just that his pride in his physical abilities and the authenticity of his stuntwork outweighed any concern for his own well-being. He must have been used to pain: as the star of an act renowned as the roughest in vaudeville, he'd been \"taking it like a man\" ever since he was a toddler.<br><br>At the end of the movie, \"Battling\" attacks Alfred viciously, and finally Alfred retaliates and beats the boxer unconscious. Many people dislike this fight, feeling it's uncharacteristic for Buster to triumph through brute force, sheer slugging, rather than ingenuity or pluck. The fight was Keaton's own addition to the play that was the source for the movie. The original ending simply let Alfred off the hook without having to fight, which Buster felt was dramatically unsatisfying. Pushed too far, humiliated too deeply, his meek character finally responds with fury and violence. It is uncharacteristic, but maybe he liked it for just that reason. Off-screen, Buster had a troubling passivity, especially in his unhappy married life, and he must have enjoyed playing a character who effectively fights back.<br><br>Still, I prefer the first half of the movie, with its gentle pace, low-key jokes and elegant touches. Alfred's valet is played by Snitz Edwards, a tiny actor (he makes Buster look imposing) with a goblin face and a delicate performing style. Cute as a button, Sally O'Neil makes one of Buster's most effective leading ladies. In a sweet image typical of Keaton's sophisticated film-making style, when Alfred parts from his wife, as he drives away her face remains framed, like a cameo, in the oval window at the back of the car.<br><br>Battling Butler was one of Keaton's most successful movies when it was released. Like Seven Chances and College, it lacks the otherworldly originality of his best work, but I've always liked it better than the other two and considered it a handsome, mature and underrated work. Lacking any large-scale set-pieces, this film rests almost entirely on Buster's performance. \"Do you think you could learn to love me?\" he asks Sally O'Neil. She replies, as I would: \"I have.\"","user":"imogensara_smith","rank":[23,27]},{"title":"A knock-down success","rating":9,"date":"23 February 2006","review":"Neither the prospect of eighty minutes of biting headwind nor snow showers has been able to keep me from the National Film Theatre over the three weeks so far of its Buster Keaton season, and every time the films have yet to disappoint: \"Battling Butler\" is no exception! I'd instantly give this a 9 if only I could justify it relative to the early scenes; despite the pitch of enthusiasm I'd reached by the end of the film, I'm still not quite sure in all fairness that I can.<br><br>It definitely takes a while to get up to speed (at the start, I took the father to be a doctor giving his sickly son only three months to live!) and for the initial reel or so it depends largely on a single extended gag -- the elegant fop's complete unsuitability for an outdoor environment. Alfred's elaborate al-fresco living arrangements echo Keaton's trademark fascination with complicated contrivances, and there's one very typical bit of misdirection where we wait for the shotgun's recoil to knock Alfred backwards into the water, only for a somewhat different turn of events to prove his downfall; but this film doesn't come properly to life until its hero engages our sympathy as well as being a walking joke. In \"The General\", we engage with Johnnie Gray almost immediately -- in \"Battling Butler\", Alfred remained a cipher for me until the moment when he nervously rehearses \"Beatrice Faircatch\"'s newspaper advice on making a proposal, with such an earnest air: it's funny, but it's also touching, and it's no coincidence that it is with his subsequent first steps towards standing on his own two feet -- tearing up and throwing aside the useless newspaper column -- that Alfred Butler may finally be said to have progressed beyond a simple one-dimensional character, and the film can really begin.<br><br>From here on the picture becomes a Keaton classic, sweeping the hapless hero further and further from the cushioned normality of his life with a series of escalating and plausible coincidences. Ultimately the worm will turn, of course -- but not in the time and manner that we are expecting. And Keaton acts here not just with that famous face but with every line of his whole body: triumph, exhaustion, despair, apprehension, indignation, timidity, pugnacity... and finally, in the last scene, sublime confidence in his own skin, modelling a costume so incongruous that only Buster Keaton could carry it off with such genuine elegance! <br><br>The scenes of Alfred's ordeal are hilarious and moving by degrees -- it's almost impossible to analyse Keaton's appeal. 'Sweet' is quite definitely the wrong word, as is 'lovable': Buster is no Little Tramp. 'Bittersweet' might be closer to the mark... or 'poignant'; the metaphor of the man who gets knocked down but keeps on trying has never been more apt. There is a brief vivid moment when Alfred, bewildered and worn out, turns his face aside into the arms of his second with such a hopeless little air that instead of a laugh, it raised a murmur of pity from the auditorium. But Keaton never allows himself to milk the audience for sympathy -- the best of his films may mingle laughter through tears, but he never falls into the trap of sentimentality.<br><br>I'm not sure if this is among the best of Keaton's films... but it's certainly one of those I've ultimately enjoyed the most so far. I've changed my mind: I'll give it a 9 after all, and say I'm dropping a mark down instead from a 10! :-)","user":"Igenlode Wordsmith","rank":[14,16]},{"title":"Size over Class","rating":24,"date":"24 September 2004","review":"A nice little comedy about a wealthy young man with nothing to do. He finds himself taking a trip into the mountain country to put some adventure into his life. It is here where he meets a young Mountain girl played by actress Sally O'Neil. Soon, Keaton and O'Neil fall in love and want to marry. The problem is O'Neil's father and brother are giant of men and won't allow her to marry such a small man. It is Keaton's butler / servant who gets the idea to lie to her parents by telling them that Keaton is a professional boxer (who happens to have the same name as Keaton's character (Butler). One lie leads to another as Keaton as to pretend he is a boxer. A nice story with some moments of comedy, Battling Butler is a Keaton comedy with very little stunt work from Buster Keaton. Besides the moments spent in the ring, Keaton hardly does any stunts. Most of the comedy comes from Keaton's silent comedy as oppose to his physical (stunt) comedy.","user":"caspian1978","rank":[9,10]}]