[{"title":"A B-Movie on purpose, and it's a beautiful thing","rating":8,"date":"25 October 2004","review":"This movie occupied most my junior high years. Action, suspense, cheesy diaologue, and martial arts galore. What more could you ask for from a b-movie that is clearly a b-movie? Carpenter and the cast and crew must have had a blast on this film because I can't think of a single movie that combines some of my favorite things about movies: Action, comedy, violence, martial arts, and a small tour bus driver named Egg who also knows a little magic. Magic indeed. This is movie magic. Agree or disagree, you can't deny that Carpenter succeeded on all levels when he made this movie. Saturday matineeish? Yes. B-movie cheese? Yes. Pure movie-going fun? Absolutely. Watch and enjoy.","user":"rog21","rank":[230,257]},{"title":"Do you believe in magic?","rating":31,"date":"31 August 2004","review":"Despite his recent slide into mediocrity, John Carpenter is responsible for what could be termed some of the biggest cult movies of the 1980's. Following his resounding success with Halloween he went on to direct a number of quirky yet excellent movies that began to tail of toward the end of the 80's with the release of such dross as Prince of Darkness. Carpenters movies are probably some of the most under appreciated pictures of recent cinema history on a commercial level, and none more so than perhaps one of his finest, the delightfully absurd action movie Big Trouble in Little China. <br><br>The plot is as daft as they come. Loud mouthed truck driver Jack Burton (played by Carpenter's long time collaborator Kurt Russell) arrives in San Francisco's Chinatown where he agrees to help out old friend Wang (played by Denis Dun) by driving him to the airport to pick up his green eyed fiancé. Things quickly go south however when a band of street punks kidnap the girl and the motley duo set off in pursuit. The pair soon find themselves caught in the middle of gang war that takes on a decidedly mythical bent and are forced to flee while Jack's truck is stolen. All this occurs within the first fifteen to twenty minutes. <br><br>If there's one thing you can say about Big Trouble, it's that it's action packed. The plot (such as it is) moves at an incredible pace and the film rarely slows to take breath as it rolls from one action set piece to the next. In such movies, normally the dialogue, and subsequently the acting suffer from a lack of any real attention. Not so here. Carpenter balances everything so perfectly that it's a wonder his career took such a slide. Although the actual story may be incredibly absurd and at times suffers from some rather obvious gaps of logic, the dialogue never fails to sparkle. Russell gives his very best wise ass shtick as Burton, the confused have a go hero who's so out of his depth he should really be fish bait, while Dun excels with a character who is consistently more heroic and capable than the lead. Another wonderful turn comes from an appearance by a young Kim Cattrall (of Sex and the City fame) as Gracie Law, a downmarket lawyer with an ability to talk at incredible speed. Some of the scenes between these three are pure comic genius, as Dun and Cattrall rattle out plot information at a rapid staccato pace while an increasingly bewildered Russell tries desperately to keep up. <br><br>Despite such positive remarks, Big Trouble was perhaps one of Carpenter's biggest commercial flops. While many of the movie's fans find this difficult to understand I do not. The reason for its failure is really incredibly simple. In terms of its style and the underlying comedy behind the piece, Carpenter's loving part tribute, part send up of all things Kung Fu was way ahead of the curve in every important respect. Take the relationship between our 'hero' Jack and his 'sidekick' Wang. The true dynamic of this relationship is a wonderfully post modern slant on the cliché buddy dynamic that existed in the 80's and it was done long before post modernist humour became truly fashionable in films (the most obvious example of post modern piece of cinema being Scream). Despite receiving star billing, Russell's Jack is actually a sidekick to Wang. While Wang has the knowledge, the skill and the courage to make him a true classic hero figure, Jack lags behind, being brash, ignorant and of little actual use in a fight. Similarly the action, although remarkably quaint by today's standards in both its look and execution, is a surprisingly accurate foreshadow of the current Hollywood move toward the more graceful, balletic chaos exhibited by movies like The Matrix and Crouching Tiger, Hidden Dragon. <br><br>Ultimately Big Trouble in Little China is a movie that survived thanks to the home video market and for that we can only be grateful. While its looks may have aged, its sense of humour and style is as fresh today as the day it first rolled out in cinemas. In short, it's pure escapist magic.","user":"mastac-1","rank":[215,245]},{"title":"A classic action film in a John Carpenter style!","rating":10,"date":"31 October 2015","review":"Big Trouble in Little China (1986) is one of the best movies ever! A true classic action film from the 80'! After 20.years watching again this movie it is still a classic sci-fi action film. Kurt Russell rocks also there is theme music from Escape From New York (1981) my favorite classic film that Kurt Russell and John Carpenter worked on it together.Clever one liners that will keep you rolling. This movie has it all, high kicks, low kicks, laughs, ghouls, demons, girls, and much more. Oh and did I mention Chinese black Magic? This movie will definitely engulf your living room in green flame and keep you asking for more. Big Trouble in Little China is amazing. Action, adventure and comedy are all here, and the result is one of the best cult classic films of all time. I must have seen this movie 50+ times, and it never gets old. Jack Burton (Kurt Russell) is the character that everyone would like to be just for a day (maybe more). Driving around in The Pork Chop Express, beating up the bad guys, scoring with the ladies.....it's all in the reflexes for OI' Jack Burton! This is one of the most entertaining movies of the 80's, possibly ever!<br><br>I grew up watching this film, seen now after 20.years of watching this film later, It is still my favorite awesome action film! Mainly because of Kurt Russell the man can kick ass! He has humor, charm and can do a good things. He was so funny and hilarious in this film. Gosh the film is wonderful and I just love it so much. Is actually my fourth best John Carpenter/Kurt Russell film and I just love those four movies so much! I Love Big Trouble in Little China to death and It was hard to get this film on Blu-ray. It is one of John Carpenter's awesome adventures. Kurt Russell plays the egotistical Jack Burton extremely well, delivering the cheesy macho lines in the way they were intended. Beautifully filmed (the fight scene in the alley), this has been one of my favorites from Carpenter for a long time with Escape from New York, Escape from L.A. , The Thing, Prince of Darkness, The Fog and Vampires. <br><br>Special effects are great, wonderful and outstanding! It is favorite Kurt Russell's performance, underrated gem of a movie, and one of the most quotable too. I love how this all started because Wang lost a drinking game to Jack. To this day I haven't seen anything like it.That's movie magic right there. Jack Burton should be in the top 10 movie characters ever!. San Francisco, CA-Jack Burton is possibly the greatest hero to ever walk the Earth at least in his own mind!!! The chemistry between Jack and Wang is so believable you want to see more adventure between the duo. This movie has a lot of fun, it is enjoyable flick it has imagination, great acting from all the actors, they all lightning us up with great performances. The action and adventures are super amazing, it is like you want to be in this movie! It has super fun characters in here and a cool awesome monster!<br><br>Big Trouble in Little China is 80's classic! I love everything that it is in this film. I love the score, especially in the underworld. The battle in the alley when the 3 storms turn up is awesome. Don't see many films that transcend this many genres as well. I heard they are also planning to remake this film Big Trouble in Little China (2016) with Dwayne \"The Rock\" Johnson in it! Why? Only to get more money? Why remaking or rebooting this film?, when we already have a classic action film here! This film does not need any reboot or remake, leave it alone the way it is! \"Gosh\" <br><br>Big Trouble in Little China is a 1986 American action comedy film directed by John Carpenter. It stars Kurt Russell, Kim Cattrall, Dennis Dun and James Hong.<br><br>The basic plot about this film is about Jack Burton (Kurt Russell) a simple man who doesn't believe in ghosts or magic until he's swept into a mind-boggling adventure deep within Chinatown's mysterious underworld. Burton's pal, Wang Chi (Dennis Dun), is trying to rescue his kidnapped fiancée. Egg Shen (Victor Wong), an enigmatic tour-bus driver seems to know a lot about ancient Chinese magic for a simple tour-bus driver. <br><br>They do battle with an outlandish array of human and inhuman adversaries under the command of Lo Pan (James Hong), a 2000-year-old evil magician who has the power to transform himself from a wheelchair-bound old man into a seven-foot-tall mystical menace. It does involves black magic and mystical forces of darkness.","user":"ivo-cobra8","rank":[54,59]}]