[{"title":"\"Living things like us are here  what will become of us?\"","rating":8,"date":"23 April 2007","review":"I Live in Fear, more accurately translated from the Japanese as Record of a Living Being, marks a move towards gloomier, more pessimistic works from Kurosawa. It is, as far as I know, the earliest film to deal head-on with the issue of nuclear weapons. While Japan's own Godzilla (1954) and US films like Kiss Me Deadly (1955) made metaphors for the destructive capabilities of the bomb, I Live in Fear looks directly at the unspoken social terror by which those other allegorical films were inspired.<br><br>But this is not a one-issue film. Kurosawa also rails against the problems in a typical patriarchal Japanese family  both with the family elder's demanding control over his children and also the younger generation's disrespect for the old man. However, an overarching theme seems to be an attack on individualism. Niide, the patriarch seeks only to save himself and his family. Throughout the picture we are reminded that there is a wider society out there, beginning with the opening shots of crowded streets scenes (which remind me of the beginning of The Public Enemy). So Kurosawa puts several of his political eggs in I Live in Fear's basket, but the points are skilfully woven together around the theme of the nuclear threat.<br><br>While we aren't confronted with an actual demonstration of the effects of nuclear war, the imagery of total destruction is there in subtle ways. The iron foundry which Niide owns resembles a ruined, burnt out city. At one point, Niide is startled by the beginning of a thunderstorm  the perfect metaphor for a nuclear strike; a flash, a boom and rainfall (in other words, the radioactive fallout after the explosion). It's a slightly obvious device, but the timing is perfect. One of the most haunting images comes towards the end, in a scene where a dusty wind is blowing through Niide's house, flapping through the pages of a book he has left open on the floor.<br><br>Kurosawa's regular leading man Toshiro Mifune is daringly cast as the elderly Niide. With makeup ageing his features, the thirty-five year old is in a role unlike any he had played before. He's perhaps a little too lively to convince as an old man, but what counts is that he brings as much power to the performance as he did to his role as Kikuchiyo in Seven Samurai the previous year. His standout scene is the one in which he confronts Dr Harada after getting off the bus, and confesses that he is now terrified. Kurosawa cleverly amplifies his speech by having it take place under a road bridge. Kurosawa's favourite supporting actor, Takashi Shimura, plays Dr Harada, and turns in a strong performance as a kind of consistent voice of reason throughout the picture.<br><br>One criticism I sometimes have of Kurosawa is that in his effort to make a point, he occasionally forgets to make a film enjoyable for the audience, and this is somewhat the case here. I Live in Fear is not the most entertaining of Kurosawa's pictures. On the other hand, it's not all that long, and there's a slightly hysterical tone to it that occasionally makes it spellbinding. Kurosawa said this was the picture that he was most proud of, and you can see why. It was a flop at the Japanese box office, and has never been all that popular, but as a record of the atmosphere of the times, it really deserves more recognition.","user":"Steffi_P","rank":[25,26]},{"title":"Somewhat underrated","rating":8,"date":"5 November 2005","review":"Based on reviews I had read, I was expecting either a facile ban-the-bomb message film, or a story about greedy relatives trying to have an old man committed so they can get his money.<br><br>I should have known better. Part of Kurosawa's genius in his great middle period (1950-1965) is that he refuses to insist on anything. He fairly presents a series of events and invites us to decide what, if anything, they mean.<br><br>Everyone in this film has a point. No one here is really a villain. Even those who are jerks (notably the second son, Jiro) are really trying to do the right thing. And the film reminds me a little of THE CAINE MUTINY in that it very artfully moves our sympathies in one direction for most of the film before presenting us with events that make us wonder if we were wrong.<br><br>Toshiro Mifune gives a fine performance as Nakajima, but to tell the truth, I wish Kurosawa had given the role to Takashi Shimura, not only because I think Shimura would have played the role even better, but because it would have given him one more tour-de-force leading role in a Kurosawa film, coming directly after IKIRU and SEVEN SAMURAI. Granted, though, that such a move probably would have caused problems with both Toho and Mifune.","user":"counterrevolutionary","rank":[18,21]},{"title":"excellent, moving film","rating":10,"date":"22 November 2004","review":"\"I Live in Fear\" is a thought-provoking, moving film about love, greed and fear, framed as only Kurosawa could. If you're a fan it's a must see, as it explores new and old themes in a stark, interesting manner. Excellent acting through-out, and please look carefully--Mifune wears no make-up, just huge glasses and a perpetual scowl; his talent and intensity were all he needed. This film also gives us an interesting look at Japan after the bomb, and the different ways people chose to deal with the fear they all in fact felt. The film does not judge, sympathizing with the children even as it highlights their selfishness. A good movie to make you think about where we've been, and where we might be headed.","user":"sleepdeprived","rank":[14,16]}]