[{"title":"Ozu's negative take on the \"corporatization\" of private life","rating":9,"date":"18 May 2003","review":"Soshun aka Early Spring (Yasujiro OZU, 1956)<br><br>This was made after a more than two-year gap following his preceding film, \"Tokyo Story\" (during which period he spent a lot of time working on a film that was to be directed by Kinuyo Tanaka -- which had become bogged down by all sorts of business politics). Ozu re-visits the world of the young \"salaryman\" for the first time since the 30s -- and doesn't particularly like what he finds. Ozu looks at the corrosive impact of the transition to a corporation-centered existence on white collar working men.<br><br>Shoji Sugiyama (Ryo IKEBE) and Masako (Ckikage AWASHIMA) have been married around 7 or 8 years, but are childless (their only son having died several years earlier). Shoji has shifted his focus to his career and pretty much disregards his wife (or at least takes her very much for granted). After Shoji becomes involved in dalliance with a co-worker, Chiyo, better known as \"Goldfish\" (Keiko Kishi), Masako decides she's had enough...<br><br>This film is one of Ozu's most earnest. While there are some touches of humor (for instance, Shoji's reunion with his army buddies, after which he is followed home by two of them), the overall tone is serious. Kumeko Urabe provides some earthy practicality as Masako's mother (now a noodle shop vendor -- unclear what she did prior to her husband's death years before) and Chishu Ryu (as Shoji's mentor, in business exile in the boondocks -- but not entirely regretting it) provides quasi-paternal guidance.<br><br>This film teaches a message Japan largely ignored, business relationships are not an adequate substitute for family ties. With the recent recognition (in Japan) of the phenomenon of \"death by overwork\", the message of the film might be considered especially timely.","user":"kerpan","rank":[31,37]},{"title":"Early Spring: The Promise of Happiness","rating":10,"date":"8 July 2007","review":"Early spring is a time to renew one's hopes, to believe once again that happiness is possible. Sometimes that hope takes the form of betrayal: an extra-marital affair may appear to be the answer to a life that is insufferably routinized and devoid of the thrill of adventure. The \"salaryman\" (in the US: \"white-collar worker\") is someone especially vulnerable: he enters the corporation filled with hope for his future, but, we are told, he soon discovers only disillusionment and \"dissatisfaction\" (a word that surfaces throughout the film). There are, of course, the blandishments of Japan's new consumer society: Note the presence of posters advertising foreign destinations throughout the film (Paris, Colombia, Finland); and note the reference to the withering of the plum trees (Japan's own) on a rich man's estate while bouganvilleas (a foreign import) thrive. But there's little to indicate that Ozu thinks these foreign bagatelles can bring happiness. Indeed, the film has a spareness about it, reflecting a world that has yet to become hopelessly cluttered with objects, which is, as we know too well, the other (the American) solution to dissatisfaction and disillusionment in human relationships and work. Each character tries to shape a life of work and relationships into something satisfying, but there's no simple formula to be found here for happiness in the modern world. There is only the dignity (or lack of dignity) of each individual in their attempt to find happiness. Ozu has brought to life characters who never gush in emotion, who don't even touch one another in the most intimate of reunions (the final husband and wife scene), and whose very restraint makes us feel all the more strongly about them. We feel honored to have shared a part of their lives.","user":"palmiro","rank":[11,12]},{"title":"Lacking The Director's Usual Quiet Magic, But Will Worthwhile","rating":3,"date":"3 March 2013","review":"I consider Yasujiro Ozu one of the worlds most significant and distinctive directors, a man who eschews false dazzle in favor of examining the human condition, human relationships; most of his films are quietly incisive portraits of people coming to conclusions and making decisions which will permanently affect their lives. Ozu imparts subtlety to his characters, his sense of time and place are impeccable, and his respect for his characters unparalleled. All of that said, I think that Early Spring is one of his least effective--one easily sees the point he makes about corporate behavior and marital infidelity, but this one, rather than quietly contemplative, struck me as merely slow. The characters too often lack any redeeming qualities, and yet we are apparently supposed to care about them for more than two hours, difficult when there is so little to work with--Early Spring is certainly not a stinker, by any means, but for me, a lesser Ozu, and if you want to start with something more characteristic, begin with either version of Floating Weeds, or with his masterpiece, Tokyo Story.","user":"museumofdave","rank":[10,11]}]