[{"title":"Pretty accurate","rating":8,"date":"18 August 2006","review":"Story about four teenage girls growing up in California. Jeanie (Jodie Foster) is the most level-headed of the bunch--but wants to move out of her house where she lives with her divorced mother (Sally Kellerman). Annie (Cherie Currie) is addicted to drugs, alcohol and bad boys and is beaten up by her father. Madge (Marilyn Kagan) has overprotective parents. Deirde (Kandice Stroh) thinks she's more mature than the rest of them.<br><br>This is nothing new from what we've seen plenty of times before--but this one has one big difference--it's accurate. I graduated from high school in 1980 (when I first saw the film) and I was surprised at how realistic it was. They got the dialogue, clothes and attitudes down completely right. Even the main song of the movie (\"On the Radio\" by Donna Summer) was a big hit before this came out. This film hit me harder than any other teen film of the time because I could understand and relate to the characters. I knew girls in high school who were just like this! The film is (of course) dated but it captures a time we will never see again.<br><br>The acting is good on all counts with Foster giving the best performance. The relationship between her and Kellerman (who was excellent) was realistic and well-done. Even Scott Baio (who has a small role as a friend of the girls) more or less realistically played a teen boy.<br><br>A very good movie--essential viewing if you came of age in 1980. The film has a deserved R rating (plenty of drug use and swearing) but should be seen by all teens. I give it a 8.","user":"preppy-3","rank":[31,35]},{"title":"\"Don't it kind of strike you sad when you hear our song?\"","rating":7,"date":"18 January 2001","review":"Four teenage girls in a suburb of Los Angeles get into all kinds of trouble: parties, drugs, cops, mixed-up parents, older boyfriends. Jodie Foster, the group's level-headed mother hen, tries keeping everyone together \"like a family\" (like the family unit she's never had), and the heartbreaking thing about the movie is that she can't. Slowly, everyone grows up and goes away. THAT precise plot point, though underscored throughout, is unfortunately tampered with. Did we really need a long sequence with Scott Baio outracing a car full of thugs on his skateboard? Or an even longer sequence--also with Baio--where Foster has a strange soliloquy about pain as an illusion. Some of the dialogue in fact is downright loopy, and I didn't much care for an edit in the third act which segues clumsily from a death to a wedding. But these are nitpicks in what is basically a very sensitive story about the loss of a tight bond. And Jodie's face at the ending speaks volumes. If viewers do get choked up, the movie has earned this. The film doesn't pander for tears or ask for sympathy--it shows us an example of friendship and hopes we understand. *** from ****","user":"moonspinner55","rank":[25,28]},{"title":"Lived the life","rating":11,"date":"11 June 2008","review":"One of the best portrayals of being a teen in the late 70's early 80's. Jodie Foster is simply wonderful as the one who tries to hold all of her friends together through the difficult times of being a teen in Califirnia; actually this could have been set in any city. I lived this life of parties, concerts and excess during this same era. Being 44 and looking back it is like looking back into my own memories of kids I went to school with and the things we experienced. Though the look of this movie is dated, big hair, satin jackets etc, however it certainly is still relevant. Donna Summer's \"On the Radio\" is such a great song and is a vital part of the fabric of this move. This is movie is so much better than the teen sex farces that seemed to proliferate after this movie came out - because it is a pretty close portrayal of what being a teen at this time was like with absent parents and lots of free time.If you haven't seen it you should...","user":"cvoci-1","rank":[24,28]}]