[{"title":"Underrated, but still not entirely realized","rating":8,"date":"10 July 2002","review":"This remake of the 1946 film which starred Lana Turner and John Garfield is significantly better than its reputation. The script, adapted from James M. Cain's first novel, is by the award-winning playwright David Mamet, while the interesting and focused cinematography is by Sven Nykvist, who did so much exquisite work for Swedish director Ingmar Bergman. An excellent cast is led by Jack Nicholson and Jessica Lange, whose cute animal magnetism is well displayed. Bob Rafelson, who has to his directorial credit the acclaimed Five Easy Pieces (1970) and The King of Marvin Gardens (1972), both also starring Jack Nicholson, captures the raw animal sex that made Cain's novel so appealing (and shocking) to a depression-era readership and brings it up to date. Hollywood movies have gotten more violent and scatological since 1981, but they haven't gotten any sexier. This phenomenon is in part due to fears occasioned by the rise of AIDS encouraged by the usual blue stocking people. Don't see this movie if sex offends you.<br><br>Lange is indeed sexy and more closely fits the part of a lower-middle class woman who married an older man, a café owner, for security than the stunning blonde bombshell Lana Turner, who was frankly a little too gorgeous for the part. John Colicos plays the café owner, Nick Papadakis, with clear fidelity to Cain's conception. In the 1946 production, the part was played by Cecil Kellaway, who was decidedly English; indeed they changed the character's name to Smith. Also changed in that production was the name of the lawyer Katz (to Keats). One wonders why. My guess is that in those days they were afraid of offending Greeks, on the one hand, and Jews on the other. Here Katz is played by Michael Lerner who really brings the character to life.<br><br>Jack Nicholson's interpretation of Cain's antihero, an ex-con who beat up on the hated railway dicks while chasing any skirt that came his way, the kind of guy who acts out his basic desires in an amoral, animalistic way, was not entirely convincing, perhaps because Nicholson seems a little too sophisticated for the part. Yet, his performance may be the sort better judged by a later generation. I have seen him in so many films that I don't feel I can trust my judgment. My sense is that he's done better work, particularly in the two films mentioned above and also in Chinatown (1974), One Flew Over the Cuckoo's Nest (1975) and such later works as The Shining (1980) and Terms of Endearment (1983).<br><br>The problem with bringing Postman successfully to the screen is two-fold. One, the underlying psychology, which so strongly appealed to Cain's depression-era readership, is not merely animalistic. More than that it reflects the economic conflict between the established haves, as represented by the greedy lawyers, the well-heeled insurance companies, the implacable court system and the simple-minded cops, and to a lesser degree by property owner Nick Papadakis himself, and the out of work victims of the depression, the have-nots, represented by Frank and Cora (who had to marry for security). Two--and this is where both cinematic productions failed--the film must be extremely fast-paced, almost exaggeratedly so, to properly capture the spirit and sense of the Cain novel. Frank and Cora are rushing headlong into tragedy and oblivion, and the pace of the film must reflect that. A true to the spirit adaptation would require a terse, stream-lined directorial style with an emphasis on blind passions unconsciously acted out, something novelist Cormac McCarthy might accomplish if he directed film. I think that Christopher Nolan, who directed the strikingly original Memento (2000) could do it.<br><br>For further background on the novel and some speculation on why it was called \"The Postman Always Rings Twice\" (Cain's original, apt title was \"Bar-B-Que\") see my review at Amazon.com.<br><br>(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)","user":"DeeNine-2","rank":[51,61]},{"title":"Grubby film noir","rating":7,"date":"25 July 2011","review":"This novel adaptation was the second after a first movie in the 1940s. This one retains the period setting but ups the ante in terms of sexual content, featuring one of the most explicit sex scenes ever shown in a mainstream film which goes far further than any film before - or since.<br><br>The plot is simple in the extreme: the wife of a Greek man who runs his own diner, bored and neglected by her husband, begins a torrid affair with a drifter her husband employs as his mechanic. From there on in, the story gradually develops in often fascinating ways as the two lovers realise that only one thing's stopping their happiness: her husband.<br><br>The film is shot through with a grim and gritty emphasis, best realised by Nicholson's grubby mechanic. He's nobody's idea of a sex symbol, although Jessica Lange is quite ravishing as the object of his attentions. This focus on realism over Hollywood fantasy is what makes the film so watchable and, in places, uncomfortable as it becomes clear that the lovers have something of a sado-masochistic relationship.<br><br>Things move into courtroom-drama territory later on (featuring some terrific acting work from Michael Lerner as the lawyer) whilst handing a number of blink-and-you'll-miss-em minor parts to familiar faces (John P. Ryan as a blackmailer, Angelica Houston as - bizarrely - a circus owner, cult favourite Don Calfa as a circus hand, Brion James as a thug and Christopher Lloyd as a salsman).<br><br>I found the film to be sometimes compelling and never boring. It's one of those films you watch to find out just what happens to the central characters, a curiosity bolstered by the feeling that they're never going to unentangle themselves from this mess. Come the surprise climax, well...you'll have to see for yourself.","user":"Leofwine_draca","rank":[15,17]},{"title":"Postman is right, the second time around","rating":8,"date":"23 January 2004","review":"Twice is nice.  Hollywood had to try twice to get this story right.  Lana Turner was beautiful in the 1946 version, but Jessica Lange was something to kill for opposite Jack Nicholson.<br><br>Such raw sensuality would easily persuade a man to lose his very soul. Nicholson's part is certainly unscrupulous to begin with, but in Jessica Lange he finds a confederate with even less scruples.   The legal loose ends that dangled in the earlier version are avoided this time with a more plausible chain of events... and the story ends when the story ought to end, instead of being dragged on.<br><br>Wonderful character and situation development, intriguing and engaging, even when you know the story.  Nice twists of the story from the Lana Turner and Italian (\"Ossessione\" 1943) versions.","user":"jeffcoat","rank":[31,40]}]