[{"title":"Authentic POW war movie","rating":8,"date":"13 August 2005","review":"THE CAPTIVE HEART was the first WW2 film to be partly produced in Germany since the war started. The prison camp scenes were reconstructed at Morlag POW camp in Westertimke, Germany, and are very authentic. Karel Hasek (Michael Redgrave), a Czech Officer, has assumed the identity of a dead English Officer, Captain Geoffrey Mitchell, but gets captured and is interned in a German POW camp. He is forced to write to the dead man's wife, disguising his writing by injuring his hand on purpose. Mrs. Mitchell (Rachel Kempson) is pleasantly surprised by the warmth of the letters, as her marriage was on the rocks before the war started. Others in the POW camp include two former building trade partners, Corporal Ted Horsfall (Jack Warner) and Private Dai Evans (Mervyn Johns), who learns that his wife has died during child birth. Lieutenant David Lennox (Gordon Jackson) loses his sight and breaks off his engagement to Elspeth (Margot Fitzsimmons), while Lieutenant Stephen Harley (Derek Bond) is distraught after receiving a letter which states his wife is being unfaithful. Private Matthews (Jimmy Hanley), a former burglar, puts his questionable skills to good use when everyone is handcuffed in a reprisal by the orders of Herr Forster (Karel Stepanek), by immediately releasing all the prisoners. Repatriation arrives at last, and Matthews sacrifices his freedom by allowing Hasek to go in his place, and he visits the home of Celia Mitchell. She is shocked when hearing of her real husband's death, but eventually she falls in love with Hasek. Lennox and Harley are reunited with their loved ones, and Evans meets his daughter for the first time. Working as a technical adviser on THE CAPTIVE HEART was Sam Kydd, who also had a bit part as Private Sam Grant. This was Sam's first film appearance since his own experiences of captivity in a POW camp, which he related vividly in his book \"For You The War is Over\". If you can manage to get your hands on a copy of this marvellous book you will be rewarded for your efforts. It works as a perfect compliment to THE CAPTIVE HEART, and gives a greater understanding of the life of a POW in WW2. THE CAPTIVE HEART is a mature and realistic war film and is highly recommended. One of the scriptwriters, R.N.V.R.Lieutenant Guy Morgan, had actually been a prisoner at Morlag. The movies original title was \"Lover's Meeting\", but at the suggestion of future British TV stalwart Jack Warner, the title was changed to THE CAPTIVE HEART.","user":"James_Byrne","rank":[23,23]},{"title":"A low key, but highly charged stiff-upper-lip flick","rating":8,"date":"31 October 2003","review":"Great plot, excellently under-stated performances, writing and direction. The fact that this film was made in 1946, so close to the events its depicts, seems to add an almost documentary-like  quality to this film. Indeed, in the opening credits, the line 'Filmed in the British Zone of Western Germany' suggest that the realistic prison-camp scenes were probably shot in genuine locations. The cast is almost a repertory company of British 1940s actors - but no-one is taking an easy ride. There are fresh and challenging performances, even though the faces are familiar. What struck me is how the film is free of the gung-ho 'smart prisoners, dumb Krauts' type of prison camp film that dominated the genre later on. This film is the product of a people tired of war. At the same time, it retains some of the stiff upper lip feel of many British wartime films, but with the confidence of victory, it does not need to indulge in the 'beastly Hun' elements. Moving without being sentimental. A very 'human' film, only a few steps short of a masterpiece.","user":"steve-raybould","rank":[42,44]},{"title":"One Ringer Among The Prisoner","rating":7,"date":"8 September 2008","review":"In Stalag 17 there's a famous scene and line where the audience who now knows that Peter Graves is an agent is pitching horseshoes and trying to obtain information, as he lands one, an off screen voice says 'that's a ringer.'<br><br>The British prisoners, mostly from Dunkirk, who because of capture sat out the war have a ringer among them in The Captive Heart. It's Michael Redgrave, but his is not an espionage mission. He's a Czech who's escaped from a concentration camp and found himself on the battlefield where the defenseless British have surrendered. He takes the identity and uniform of a dead officer and is then 'caught' by the Germans.<br><br>To keep up the deception Redgrave writes letters back to his 'wife' in the United Kingdom, played by his real life wife Rachel Kempson. She and her real husband have not gotten along and truth be told his call up for war was greeted with some relief. But Redgrave wrote such poetical stuff she falls for him by correspondence.<br><br>Although Redgrave's story is the main plot line, there are others that are nicely acted. Young Gordon Jackson goes blind because of lack of proper care for his wounds and he gives a touching performance. And chief officer of the prisoners, Basil Radford is an inspiring leader among them, trying to keep up morale as best he can.<br><br>The Captive Heart is a tandem pulling of the strings on the auricle and ventricle of the viewer. It's a fine wartime romantic drama with equal accent on the war and the romance. It was done just as Michael Redgrave was reaching his heights as one of the United Kingdom's premier players. Try not to miss it if it is broadcast.","user":"bkoganbing","rank":[29,31]}]