[{"title":"Come on, don't be a curmudgeon.","rating":8,"date":"15 April 2005","review":"You have to take this movie for what it is and when it was released. The characters are likable and the dialogue doesn't try too hard to be funny; it just is.<br><br>Granted, some of the appeal may be nostalgic at this point; it's hard to imagine how this looks to a first-time viewer today. OK, some parts are bound to be ridiculous; there is a break-dancing scene and accompanying music that are hopelessly dated... then again break-dancing does appear to be making a comeback.<br><br>I'm not a huge Andrew Dice Clay fan, but this movie is where the \"Diceman\" character originated.<br><br>The actor who plays Palmer Woodrow wrote the movie The Burbs, as it turns out.","user":"gavin_imdb","rank":[14,17]},{"title":"Somewhat better than you'd expect","rating":8,"date":"8 March 2003","review":"Determined to watch every Golan-Globus movie ever made, I finally sat down to watch this years after it was released. To tell the truth, I wasn't expecting much. However, I was pleasantly surprised that it was pretty painless to sit through. The movie didn't have the crude edge of other teen comedies of the '80s, the cast was made up of a likable bunch of individuals, and there were several genuine laugh-out-loud moments. The funniest bits come from Walter Olkewicz's coach character; even though he was probably cast because he greatly resembles John Belushi, he is really funny, and it's a shame that he almost completely disappears from the second half of the movie.<br><br>However, the movie is far from perfect. Much of the time the movie seems to be spinning its wheels, where scene after scene goes by with little to absolutely no advance to the plot. It's almost like you are seeing a bunch of deleted scenes from the \"special features\" section of a DVD. At the same time, there are a lot of scenes that seem to finish much sooner than they should, as well as a lack of explanation about some things. Since the movie runs 105 minutes (quite long for a comedy), my guess is that the original cut of the movie ran much, much longer than 105 minutes. Then when they tried to cut down the movie to an acceptable running length, a lot of material that would have made the movie make more sense had to go.<br><br>As problem-filled as this movie is, there is something likeable about it all the same, enough so that you can't help but wonder what \"Tourista\", the sequel announced during the closing credits - that ultimately never got made - would have been like.","user":"Wizard-8","rank":[6,7]},{"title":"Are we grading on a curve?","rating":5,"date":"24 January 2000","review":"SEE Judd Nelson break-dance!  SEE Andrew \"Dice\" Clay before he got more famous and less funny!  SEE what ALL '80s teen comedies were like, more or less!<br><br>\"Making the Grade\".  Let's see... basically, a loser student (Olsen) pays off another loser (Nelson) to pretend to be him so he can pass his classes and graduate (for some inheritance or something, I don't know - this is not one of those movies that celebrate the joys of higher learning).<br><br>And, of course, all the hips trends of 1984 are there for you to drink in till you're positively drunk from all the flash, trash and splash of the Gimmie Decade.  Not just the aforementioned break-dancing display, but also some of the tackiest clothes you've seen since your last garage sale, an almost ALL synthesizer sound track and a Brat Packer! <br><br>\nIf you love the '80s, you gotta catch \"Making the Grade\".  Not for the story, mind you...just for \"the experience\".<br><br>Five stars.  \"Making the Grade\" - barely passing, needs work on its social skills, recommend less time around the Diceman.","user":"Mister-6","rank":[8,12]}]