[{"title":"One thousand chicken","rating":8,"date":"14 January 2005","review":"Giulio Questi's early giallo is very different from the genre, but it can be called giallo since it has a mystery audience has no idea about until the very end. But the mystery doesn't involve the identity of the possible murderer but the various and altering relations between the characters. Marco, Anna and Gabrielle live together and work together, in a huge chicken farm / factory owned by Anna. Soon it is clear all three, plus their friends, have another things in their minds; they act what they don't say and vice versa. This gives the director Questi a great opportunity to handle topics of greed and money that easily blind.<br><br>The way how Questi handles his theme is very satiric, thus making the film close with Mario Bava's Reazione a catena / Bay of Blood 3 years later. Both films have serious theme about man's ability to turn violent in his search for monetary benefit and freedom and both films discuss this satirically, with maximal effect since comedy is often at its best when the subject stays serious and universally important. As a pure giallo mystery, the film is also quite rich since the audience has no idea what is going on until the very end when it is revealed. Questi uses very interesting editing technique that makes many of the scenes \"broken\", using flashbacks, dreamy/nightmarish moods and so on. This forces us to dive deeper inside the characters and their varying points of views.<br><br>The film has also an interesting topic about man's subconscious and instincts. Main character Marco is considered \"morally corrupt\" due to his unusual sexual preferences. But at the same time Questi shows how much there is inside human brain, needs, wills, desires, we don't necessarily want to talk about in fear of unacceptance or being classed as \"sick.\" We are not as civilized, as perfect, as the moral codes of society try to suggest when they go after \"the morally sick\" Marco. There's also a very harrowing and unforgettably absurd scene at the experiment lab of the factory. The doctors have created a manipulated type of chicken that would be commercially extremely profitable to the factory while at the same time the manipulated monsters are a plentiful spitting at nature's face. Marco is against this, against the others around him while he has been named \"morally wrong\" and bad. Questi had important things and questions in mind and also the ability to turn them into a film.<br><br>Real themes in a giallo thriller are quite rare and Questi has done it very well. This is among the earliest but also among the very best of the giallo.","user":"Bogey Man","rank":[20,23]},{"title":"Murders at the Chicken factory","rating":10,"date":"20 September 2000","review":"This has to be one of the most cutting edge film's made to date , its wholly surreal and has a dreamlike quality that hypnotises me. When i first saw this film I don't think I blinked , then I watched it again straight off, it has an addictive charm that should be open for everyone too see, why its not being picked up by a distributor I will never know. The plot is an odd one , a mixture of industrial terrorism (who killed the new headless mutant chickens that yeild so much meat), Romance , Perversion and just plain odd. In the opening scene in a hotel while a prostitute is being brutally murdered we cut to a man covering his head in tape , someone pouring out toothpaste and various hideous rich people snorting with laughter. From the start it gives the message that everybody is mad, with their hidden psychosis and more obvious ones. Going any further into the plot will spoil the film so I will say nothing. Its worth trying to find this one , I got mine in Greece in the late 80's , but there must be some out there , somewhere.","user":"sirarthurstreebgreebling","rank":[19,24]},{"title":"\"Diabolique\" on acid (and with a lot of chickens)","rating":20,"date":"20 January 2005","review":"Like many other European thrillers this early Italian giallo was obviously very influenced by the French film \"Diabolique\" with it's basic plot of a wealthy husband, wife, and mistress all scheming against each other. And like the later film \"So Sweet, So Perverse\" the movie throws another man (Jean Sorel)into the mix as a kind of a fourth side to the main triangle. This movie is no conventional thriller, however. For one thing it has kind of psychedelic, surrealist pop-art late 60's sensibility to it that always threatens to overwhelm (and occasionally does) the rational story-line. For another thing, it has a VERY bizarre setting, a fully-automated chicken plant. (There's a scene where the scientists at the plant create \"monster\" chickens without wings or beaks that really makes one want to swear off poultry for life). This unusual setting adds a whole industrial conspiracy angle and, moreover, a weird sort of social commentary to the proceedings.<br><br>The acting is all very good. Jean-Louis Tritigant plays a similar role to the one he'd later play in \"So Sweet, So Perverse\", but here he also might be a serial killer who is offing prostitutes in a roadside motel. Latin sex symbol Gina Lollabridga makes a rare appearance in this kind of film (which is actually much more entertaining than some of the bigger-budgeted movies she starred in)as the domineering wife. The young mistress is believably played by Ewa \"Candy\" Aulin, although she is not quite as enjoyable when she's not naked and not speaking in her natural (undubbed) heavy Swedish accent. (Aulin also appeared in another excellent, if even more obscure, giallo called \"The Double\"). The best thing about the movie though is the ending where EVERYBODY manages to get their just desserts--and then some. Definitely check this one out.","user":"lazarillo","rank":[10,13]}]