[{"title":"Funny & Entertaining","rating":8,"date":"26 December 2001","review":"I agree with the previous note. There's some cool appearances by Gösta Ekman and Björn Gustafson in this pic, they're the ones to lift it off the ground making it one of the Swedish comedy classics. For instance, seeing Gösta, \"Sickan\" or \"Charles Ingvar\" as the character likes to be called, attempting not to be seen by the security guard while facing that his hideout; a giant lamp hanging from the roof, slowly but safely slides downwards since it can't carry his weight - that scene is a real classic. This is a movie I'd recommend anyone to see. It's more fun than most american comedy movies I've seen, and I've seen many.","user":"synthesite","rank":[4,4]},{"title":"Underrated movie, a classic!","rating":10,"date":"24 January 2008","review":"When i was young i didn't really care to much for this sequel it was decent nothing more. Last year i got the DVD and i really, it really was a masterpiece underrated though but a very good movie.<br><br>It has that touch of greatness when you watch it. Ragnar Grippe made an great soundtrack for the movie especially the intro sequence sounds awesome making it sound like an serious criminal movie.<br><br>I think if this movie could had become a big movie if it wasn't released a year after the first one. It has been underrated for too long, many find this movie the bad sequel in the series since they have not founded the greatness of it.<br><br>The jokes are good as always. This was also the last Jönssonligan movie Nils Brandt would ever be in.","user":"vato129","rank":[5,6]},{"title":"Gösta Ekman made this movie","rating":6,"date":"8 October 2006","review":"(r#80)<br><br>Make no mistake: this is a Swedish movie and it is a sequel among many other sequels, to a crime comedy which wasn't all that good in the first place. It's not exactly Kubrick, or even Schumacher for that matter, but it is a fun little film that doesn't try to be anything it isn't. It also has one of the best endings ever in a comedy. The cast is excellent; the combined comic talents of Gösta Ekman, Björn Gustafsson, Nils Brandt and Ulf Brunnberg make a rather mediocre script much funnier on-screen than it has any right to be. Ekman is at the top of his game as Charles-Ingvar \"Sickan\" Jönsson and as usual, he's got a plan - timed and ready, down to the tiniest detail.<br><br>The plot is not important in a movie of this kind - it's all about the performances from the main actors, and they're hilarious. Their dedication to their characters is more than the movie deserves, and it really makes it a pleasure to watch.<br><br>Love them or hate them, the Jönssonligan movies are a part of Swedish culture. This series isn't exactly high art - it's just a pretty funny franchise. If you can forget that this series spawned a myriad of awful kiddie comedy sequels, you will enjoy this flick. Besides, where else can you see Gösta Ekman as a German businessman??","user":"Torgo_Approves","rank":[5,6]}]