[{"title":"\"Bow to the Patroon!\"","rating":21,"date":"21 April 2004","review":"At the time that the people of the United States were gearing up for  Westward Expansion (and the Mexican War was about to begin), and when  the clipper ships were beginning to revolutionize our merchant marine,  the biggest problem facing the nation was the slavery issue. But it  wasn't the only social issue of the day with vast political and  economic repercussions.  New York State was struggling too - with the end of the economic system  that had been in the upstate counties since the days of the Dutch  colony of Nieuw Amsterdam, and it's governor Pieter Stuyvesant. This  was the large estates of the patroons - people like the Van Courtlandts  and the Schuylers and Livingstons (some of them were English, not  Dutch). A series of local battles (literal battles) between small  farmers and the patroons' men finally led to the state constitution  ending these estates, which had been aristocratic remnants of a dead  past. They disappeared by 1848, just in time for the slavery issue to  drive all other social problems into the dust.  This subject is not one of the biggies in history movies in America. So  DRAGONWYK is one of the few films to tackle it - witness the scenes  when Vincent Price is collecting rents from his farmers while seated in  his special \"patroon\" throne. Harry Morgan (far from his kindly  \"Colonel Potter\" role in television's M.A.S.H. here) is one of the more  outspoken (and ultimately deadly) foes of Price and this antiquated  system of organized peonage.   The film is a dandy little Gothic, centering on the seemingly sane,  charming Price (Nicholas Van Ryn) who invites his cousin (Gene Tierney)  to his home for a visit (her father, Walter Huston, is properly  suspicious of the aristocrat - Huston being a democratic, small  farmer). There she meets his somewhat fat wife, who eventually gets  ill, and dies (the doctor is not sure what illness killed her). And  Tierney is wooed by Price, and marries him, and discovers the monster  inside him - one seeking a wife like a man seeking a good breeding sow  or horse. Drug addiction even gets into the story. But it does follow  the end of the patroon system.  Oddly enough though, the novel by Anne Seton was different from this  story. Nicholas was as villaninous and crazy in the novel as in the  film - but deadlier. Seton knew her history, and arranges to remind the  reader of the anti-foreign \"Nativist\" movement of the 1840s and 50s  (which is more memorably dealt with in GANGS OF NEW YORK). It seems  Nicholas, in chasing an enemy, fires the gun that causes the Astor  Place Riot of 1849, which caused the deaths of several dozen citizens  of New York City (supposedly opposed to a British actor playing  MACBETH). The novel also ends with the burning of the steamboat HENRY  CLAY in 1852, also caused by Nicholas, which killed scores of  passengers (including former Mayor Stephen Allan of New York City, and  Andrew Jackson Donaldson, the landscape architect who helped plan  Central Park). It's a pity these bits were left out, but the film still  is good without them.","user":"theowinthrop","rank":[54,57]},{"title":"Dragonwyck an excellent movie","rating":10,"date":"28 July 2005","review":"This is one of my favorite \"gothic\" romance movies of the 40s. There is a haunting melody throughout and it captures the tragedy and mystery that is Dragonwyck. Gene Tierney is wonderful in the starring role of Miranda, going from love-struck and strong-willed to heart-broken and resigned throughout the course of the movie, playing each scene to perfection.<br><br>A side note to Ms. Tierney's portrayal of Miranda in this film - The actress Gene Tierney had a fling with the young John Fitzgerald Kennedy, and first laid eyes on him, watching her, while she is playing a scene with her father, the great actor John Huston, reading the bible to her to determine her course of future action - should she accept the proposal of her cousin, or not. She looked up and there he was, clearly smitten with the beautiful Ms. Tierney, and they began to see each other directly after that - or so Ms. Tierney comments in her marvelous autobiography.<br><br>The bible figures prominently in another scene when the imperious Nicholas first makes his appearance, played to haughty perfection by the very tall and very talented Vincent Price. Very dramatic and memorable! The great Jessica Tandy also has a significant role as Miranda's feisty maid. And, what better actress to play the role of the wise and comforting mother, but the marvelous Anne Revere.<br><br>See it, if only for the atmospheric and haunting music that stays with you after the film is ended. See it, if only for the beautiful and talented Gene Tierney. See it, if only for the great actors, Vincent Price, John Huston, Anne Revere and Jessica Tandy. It is a little gem of a film!","user":"twinkyeelover","rank":[47,51]},{"title":"Excellent early Price in a brilliantly Gothic mood piece","rating":8,"date":"26 October 2005","review":"With shades of Hitchcock's Rebecca, Dragonwyck is a lushly Gothic melodrama; abound with themes of social class; centring on the struggle between the rich and the poor in nineteenth century America. The most striking thing about Dragonwyck is the beauty of the piece. The sets are brilliantly Gothic, while director Joseph L. Mankiewicz keeps the atmosphere thick and foreboding, which in turn ensures that the film succeeds in capturing the best of it's locations. The film reunites the two strongest cast members from Otto Preminger's masterpiece 'Laura' - Gene Tierney and the master of the macabre, Vincent Price. These two are both great thespians, but it is Vincent Price that shines the most. Many people pass this great man off as merely a camp horror movie actor, but with his performance here; along with the vast majority of his later ones - Price proves that he is far more than that. His voice and mannerisms make up a lot of his performances, but it's the subtleties that he hints at beyond his immediate performance that really make him great. Just like he did with The Fall of the House of Usher; Price plays one thing, while all the time hinting at a darker side to his character.<br><br>The plot follows a young farm girl (Tierney) who goes to stay with her mother's cousin, Nicholas Van Ryan (Price), in his castle upon his request. It isn't long after her arrival that she hears strange things from the servants, and it's not long after that she realises all isn't quite right with Dragonwyck. The plot is rather thinly spread, but the film always manages to stay interesting because of the fact that it doesn't let you know anything until you really need to know. Things are hinted at throughout the film, but the audience never really knows anything for sure. Even by the time the film reaches it's climax, there are several things that have been left open. Vincent Price's performance here stands out from the rest of his oeuvre because he manages to be charming at the same time as being dark and brooding. After having seen the likes of The Abominable Dr Phibes, it's hard to imagine the man being charming; but here it's hard to imagine why Gene Tierney wouldn't fall for him. Dragonwyck has a few problems, but on the whole this is a quality forties melodrama and comes with high recommendations, especially to the Vincent Price fan.","user":"The_Void","rank":[44,48]}]