[{"title":"A Glorious Movie With An Unusually Developed Cast!","rating":10,"date":"25 February 2002","review":"This is, by far, one of the most underappreciated Disney classics of all, and one of the most developed as far as the character and the story.  Basil is a perfect portrayal of Basil Rathbone as Sherlock Holmes, and many don't know that it was based off a book about a mouse who lived the life of his idol, none other than Sherlock Holmes.<br><br>Personally, I love this movie because it has a colorful, developed cast of characters.<br><br>Basil is not your average Disney hero, having no love interest at any point in the movie; he is also a super-intelligent character and often bursts into fits of scientific observation.  His facial expressions are timed well and are very well done, as well as his general movement.  He is very excitable and you can tell he adores working on cases.  He doesn't really like children, as you can see from the way he treats Olivia in the beginning. You really get a feel for Basil when watching him, and he's not easy to forget.  Kids may not understand half of the things he's saying, but it's fun to watch.<br><br>Olivia is the little heroine mouse who starts Basil on his case, losing her father to a mysterious peg-legged bat of whom Basil is aware of.  She is extremely plain-drawn and has no emphasis on her gender really, save for the bow in her hair and her voice, making her very realistic.  She also acts alot like a realistic little girl, in her laugh, in the way she reacts to things, even in the way she exclaims \"father!\" when reunited with her toymaker father.  Her curiosity is classic, and she has a high adoration for Basil, though he doesn't appreciate her at the start of the story.<br><br>Dawson is the elder mouse who finds Olivia looking for Basil of Baker Street.  He isn't sure of who Basil is, but they end up finding him together.  Dawson is, of course, Watson in mouse form, and helps Basil in his first case, being this movie.<br><br>Ratigan is the villain played by the late horror film star Vincent Price, and quite well in my opinion.  He has the likeness of Mr. Price in the way he moves and acts.  Of course, nothing is weirder than hearing him sing, but it happens twice in the movie-- \"The World's Greatest Criminal Mind\" and \"Goodbye, So Soon\" were both written specifically for Price.  He is not one of the more frightening villains as far as his looks, and is unique in that up until the climax he uses his intelligence to battle Basil, instead of the strength he obviously posesses.  On a special note, Ratigan dislikes being called a rat for some reason, though I cannot remember why.<br><br>Fidget is probably one of the darkest villain henchmen in a Disney movie. He is frightening to children in appearance and voice, and the music accompanying him adds a comical aura.  Fidget is by far my favorite Disney henchman, just because he's funny.  The one thing that bothers me, though, is that a few times in the movie, his peg leg switches from right to left. I think it was just for the reuniting scene in which Olivia steps on his only foot, so it was switched.<br><br>The movie has many fast-paced scenes, including \"Investigation At The Toy Shop\" and \"Big Ben Chase\", among others.  My personal favorite is \"Big Ben Chase,\" because it is one of the longest Disney climaxes and it is a very unlikely setting.  The movie itself is about Olivia's toymaker father being kidnapped by Fidget, and her turning to Basil for help.  Basil's nemesis, Ratigan, is linked to the bat, and Basil, who was reluctant and annoyed by Olivia's protest at first, jumps at the oppertunity to see if he can finally defeat Ratigan.  The movie goes from there with its \"many twists and turns\", to quote Basil.<br><br>If you want a fun-filled, unpredictable adventure, The Great Mouse Detective is your best bet.  Especially if you're a Sherlockian or Eve Titus fan who has yet to see this exiciting portrayal of Basil of Baker Street.","user":"mistressofbasil","rank":[51,57]},{"title":"A forgotten Disney masterpiece.","rating":10,"date":"17 October 2003","review":"This is probably one of the most unknown Disney classics.<br><br>For the time the movie was quite new and revolutionary and it doesn't quite fit in with the other movies Disney made in that period., perhaps that's the reason why it has been forgotten. But \"The Great Mouse Detective\" deserves to be known and seen.<br><br>The characters are real classics and one of the best to have ever appeared in a Disney movie. Actually Professor Ratigan (voiced by the legendary Vincent Price) is quite possibly my favorite movie villain of all time. No wonder that it was Vincent Price's favorite role. His style and humor is priceless and it cracks me up every time. But the other characters are also very memorable. I especially like the character of doctor Dawson.<br><br>The story is good and very pleasant and very mature compared to other Disney's from that period. But of course the idea of making a story about the mouse version of Sherlock Holmes alone is already good enough to make a fun movie about.<br><br>One of the other things that makes this movie different compared to other Disney's from that period are the songs or better said the lack of it. The movie features only one song (3 if you count the bar song and the goodbye, so soon song.). But it's not a miss. The surprising magnificent musical score by famous composer Henry Mancini make up for this loss.<br><br>The movie has a very spectacular final on and in the famous Big Ben. It's by far my favorite Disney movie ending.<br><br>Certainly a fun movie to watch over and over again.<br><br>10/10<br><br>P.S.: If you're Dutch speaking, I highly recommend that you watch this movie Dutch spoken. Believe it or not it's even better and more fun then the English version! Believe me, just give it a shot.<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[52,59]},{"title":"A very cute Disney movie, one of my favorites!","rating":10,"date":"27 January 2004","review":"The Great Mouse Detective is one of my favorite Disney films of all time, it's also one of the most under rated in my opinion. I think just because I love the story so much and it always brought up good memories, this was the funniest Disney animated movie I had seen at the time. It's just such a cute film, it has fun animation, catchy songs, and such a touching story that anyone could easily fall in love with. My parents and I watched this movie together all the time when I was a child, still to this day, I don't mind sitting down to watch it, it's just that much fun.<br><br>A young little mouse girl and her toy shop father are celebrating her birthday, but her father is quickly taken away by a rotten gang of mice who are led by a giant rat, Ratigan, who is planning to over throw the queen and become leader of the mouse world. Olivia, the daughter, goes to Basil of Baker Street, he's a mad detective who has been chasing Ratigan for a long time. Along with the help of an average mouse, Dr. Dawson, Olivia, and Basil go after Ratigan to make sure that his plan fails.<br><br>The Great Mouse Detective is such a cute film. I'm very sure that you'll enjoy it, it's one of my personal favorites, I really do think this is one of the better Disney films and is an under rated treasure. I just loved Basil, his madness was just so funny and enjoyable to watch. I also loved Ratigan's song of why he is so great, not to mention how he thinks he's a mouse is just priceless. This is a fun family film to watch, I highly recommend it.<br><br>10/10","user":"Smells_Like_Cheese","rank":[32,36]}]