[{"title":"One of the first things I saw as a little kid- and it can stick with you","rating":9,"date":"2 December 2004","review":"Rudolph's Shiny New Year can be striking, and entertaining, if you're watching it when you're little - little enough that by the time you're my age you have no clear memory of the first time you watched it, just that you did over and over. As a kid you get introduced to claymation someway or another (even those of today who don't have Gumby get Wallace and Gromit), and this plays for a fine hour for the little ones, but can perhaps be of worth for the parents here and there. The story of Rudolph saving the \"baby new-year\" from the clutches of Eon, a vulture looking to keep December 31st on a loop, is pretty simple, with conflicts and characters that are typical and funny enough to take. But what can be memorable for a child is how some of this special is dark (with Eon) when it's not cute (most scenes with the baby). It's also interesting as a kind of sequel-cum-remake of the original Rudolph story, as the baby has to contend with having big ears- something that a child might find more relatable than a shiny nose. The songs are also a bit of a treat, if dated, and Red Skeleton does a fine double-job with the voicing of Father time and the little Bear on the island. Basically, it's the kind of special that is worth checking out with the kids for a few minutes, and if they get into it, it may prove a treat, and if not, there's still Nickelodeon.","user":"Quinoa1984","rank":[20,21]},{"title":"Rudolph's Shiny New Year is a classic!","rating":10,"date":"4 February 2012","review":"I grew up watching Rudolph The Red Nosed Reindeer for a very long time. Rankin Bass and of course Romeo Muller have made such a great icon that was a classic for a very Long time. And Rankin Bass Jr. also helped out on the production and as it seemed i enjoyed this forever.<br><br>At Christmas time i watch many classics such as Frosty the Snowman. But Rudolph The Red Nosed Reindeer has been my most favorite that i have watched. I enjoyed it a lot and sometimes read the books about it. But Rudolph has been the best hero and leading Santa's sleigh was also a nice deed.<br><br>Despite what i have to say. I love Rudolph and i like his story. And since childhood i used to watch many cartoons starring him in it and I'm glad to say that it definitely pleased me. Rudolph was popular and was the best reindeer of all. And since seeing the original movie. I went on to seeing Rudolph's Shiny New Year because i thought it was a great masterpiece.<br><br>Of course being that. Rudolph has to save Baby New Year's Eve who is also teased because of how large his ears appear to be by the other kids. But also that they have to avoid the vulture who is mean and really is not nice at all.<br><br>Even though Rudolph is my favorite character since childhood and when i was a child watching the stuff before. He will continue to please me at Christmas time. Rudolph is a beloved and a great hero that has one simple message. Never be teased or alone when trying to join a group. Always be who you are and everything will be alright. This is what Rudolph will say if you are really sad.<br><br>The greatest holiday hit for Christmas ever. - Rudolph's Shiny New Year deserves to be on the most great holiday Christmas masterpieces of all time. Though if you are still a child this should entertain you. And may i say the characters such as Father Time and Rudolph himself will. The story was great, The animation was dazzling, And the concept and the look of the characters was awesome. This is not a movie to pass up on when Christmas is around the corner. You need to see this for yourself. You will be pleased, Definitely something i would recommend for both kids and grownups who are fans of the show.","user":"haxleyandrew","rank":[8,8]},{"title":"\"Rudolph's Shiny New Year\" was a nice sequel to the previous Rankin/Bass claymation special","rating":8,"date":"8 January 2009","review":"Just finished this, the sequel to Rankin/Bass' \"Rudolph the Red-Nosed Reindeer\". With Red Skelton as narrator Father Time as well as the Baby Bear, Frank Gorshin as the knight Sir Ten-To-Three, Morey Amsterdam as the caveman-O.M. (One Million), Hal \"Great Gildersleeve\" Peary as the whale Big Ben, Paul Frees as various voices, Don Messick as Papa Bear, Iris Rainer as Mama Bear, and, returning as Rudolph, Billie Mae Richards. Written once again by Romeo Muller, \"Rudolph's Shiny New Year\" is a wonderful Tall Tale about how the reindeer with the shiny nose managed to make sure that it didn't become December 31st forever. Even as an adult, I was enthralled by the way Muller kept making things up as the story went along and didn't care a lick about logic or stuff like that as long as it was still believable. Although when Red said this story took place just after the events in the previous special, I did question why Rudolph's antlers had shrunk to when he was a kid. Other than that, I still highly enjoyed \"Rudolph's Shiny New Year\". P.S. I just found out Frees and Amsterdam were born in the same city as I, Chicago, Ill.","user":"tavm","rank":[7,7]}]