[{"title":"The reason that I got into films in the first place!!!","rating":10,"date":"28 December 2003","review":"In film school it is not cool to say you like David Lynch. Film students claim he is just a poor mans version of Luis Bunuel. Yes, I would say that Bunuel is more talented and is the king of surrealism. But Lynch is very good and his films do challenge the viewer. I actually have a deep affection for his films. When his films work, they really work! However, when they do not work, for example, Twin Peaks, Fire, Walk with Me or Lost Highway then they quickly launch themselves into self parody. Many people claim his material is too inconsistent and indulgent to be really liked very much.<br><br>  What I find strange is that one reviewer here states that he feel duped by Lynch. Duped? Why? The films all have a story. They just have a narrative that works differently to conventional film making. If you look hard at the film and try to understand the subtext then you will pick up  on what the film is about.<br><br> I saw this when I was 16. I knew nothing about films or film making then. A friend and I were bored so we decided to see a movie at capitol cinema. Capitol cinema used to be a cinema that played arty or small independent films. They used to play midnight showings of eraserhead. There was always someone smoking a joint in that place. However, you don't need drugs for this film. Lynch is drugs. This film just buzzes you out.<br><br>\n I had no idea what Eraserhead was about. I had never heard of Lynch and knew nothing about surrealism. I went in and was just totally blown away! Before this I had only really seen commercial blockbuster movies. Lynch gave me a whole knew perspective on what cinema is capable of. Eraserhead is the stuff of dreams. Lynch believes that watching a film is entering a dream state. Both my friend and I did not know what the hell was going on. I was fascinated...   <br><br> Later I would learn this is a film about Lynch's own obsessions. His hatred of Philadelphia. His fear and anxiety at being a father. The film is just full of a kind of a compulsive, paranoid neurosis. It is a waking nightmare. He also seems to parody the nuclear family. 'Did you have sexual intercourse with my daughter?' Meanwhile that weird blond woman in his radiator seems to represent his escape. A way to transcend from his grim world. What I also find bizarre is that people then accuse him of having no sense of humor! What? There are always funny moments in his films. 'Did you have sexual intercourse with my daughter?'<br><br>Jack Nance is also very good as the main character. He seems to be playing the director and he gives a performance that is distant, spaced out and yet emotionally vulnerable. A really strange mix. The imagery is just brilliant. Black and white in an industrial wasteland. There is smoke here of course. It wouid not be a Lynch film without smoke! It also has a cool, grating industrial soundtrack that sets your nerves on edge. This is perfectly effective for the bleak tone of the film. It is so visually striking that the viewer will not forget the imagery quickly. There is a reason that this is a cult film. The other distinctive feature of this film is the long lingering shots. This reminds me of Jim Jarmusch and his movies like Dead Man and Ghost Dog. The length of the shots seems to have the effect of immersing the viewer in this strange industrial wasteland.<br><br>I have my own copy that I lend to friends. They then normally give it back to me saying that they only got through the first half hour. They also normally tell me that I am a weirdo for liking it. I think what frustrates people most about Lynch is that he will not give any explanations of what the film is about. So any interpretation is as good as any other. People want the film to be explained so they can understand it. Who said films must be understood or comprehensible? Why can't a film be abstract piece of art like a painting? Lynch's films are like an acid trip. To quote the great gonzo, Hunter S Thompson, 'buy the ticket, take the ride and if it gets a little heavier than what you  had in mind, then put it down to forced consciousness expansion.' <br><br> So in other words, relax, stick it on and just run with it. Travel into someone else's nightmare for a change...","user":"Skeptic459","rank":[459,569]},{"title":"Cinematic genius, but definitely NOT a date movie.","rating":9,"date":"30 January 2000","review":"I can think of very few films that have sound as their most commendable feature. The Exorcist is one, a film that, aside from infrequent strains of `Tubular Bells', adopts minimal incidental music. This is laudable in a horror genre where shocks are clearly signposted  and predicted  by overgenerous musical stings. The Exorcist may be flawed, but its avoidance of this field cliché is worthy of praise.<br><br>Eraserhead is the other film that excels in sound. A frankly disturbing concoction of industrial score and white noise with undercurrents of musical hall and sonorous church organ, it is almost an extra character in the film, and easily it's most prominent factor. <br><br>Yet Eraserhead is to be recommended for more than its incidentals. An impenetrable and gloomy work, what is it actually about? Who is the credited `man in the planet' who pulls levers that control giant spermatozoa? Many questions like this permeate a film which perhaps has to be seen several times to get over the initial shock of it's avant gardism. Lynch extracts the everyday and supplants it with the exceptionally bizarre. The experience of meeting a girlfriend's parents for the first time is never worse than here, where the parents in question gyrate spasmodically to the animated legs of a blood-spitting chicken. It's these scenes  along with the deformed mutant baby  that could lend the film the air of an abortion debate. Birth and repressed sexuality thrive throughout the film, from suckling puppies to the seductive appeal of the `beautiful girl across the hall' and a mother-in-law that gets too close for comfort. I guess the entire film could be a man's mental breakdown when faced with the premature responsibilities of marriage and fatherhood. Though to be honest I couldn't even begin to imagine what it's really all about.<br><br>Encroaching blackness fills every scene, where lights are intermittent at best, and at worse fail completely. Often sets  particularly the bedroom when `Mary X' is feeding the child  are like prison cells. Two of the most eerie segments involve a title-explaining dream (?) where Henry's (Nance's) head is carved into pencil rubbers and an unsettling musical number from the `lady in the radiator'. This is the same lady with two candyfloss-like lumps on her cheeks that alternates her stage appearances between stamping on giant sperm to singing with religious convictions.<br><br>Direction and cinematography are brilliant throughout, though the climax is the ultimate extension of a film that borders on darker, extremely unpleasant aspects of reality. I took a girl to see this film once, where the conclusion formed the final straw in what could be seen as a cycle of repellent imagery. I wonder why I never saw her again?","user":"The_Movie_Cat","rank":[227,292]},{"title":"Ask six people exactly what Eraserhead is about, and you will get six different answers","rating":10,"date":"1 June 2005","review":"I sometimes dream of waking to a completely dark world, a world with no sunlight and minimal artificial light. My vision is blurred, but there is nothing to see. The streets are virtually empty, and my friends and family are lifeless; sitting, standing or even walking, but with nothing to do or say, and nowhere to go. No questions are asked because there is nothing to learn, nothing is discussed because nothing is interesting. And it is this dismal reality I am faced with, only partially aware that there is anything better.<br><br>The existence I dream of is somewhat reminiscent of the world of Henry Spencer, the main character in Eraserhead, who becomes father to a hideously deformed baby. That's what the film is about at face value, but the very style in which it is portrayed is the real beauty of it. The setting and scenery makes the film one of the most desperately depressing I have ever seen. And although Henry seems to be devoid of any spark of personality, we can't help but sympathise with him throughout the film.<br><br>Similar to my dream, the only form of light is artificial, the streets are virtually empty, and the only person in the entire film who has any personality is the father-in-law, and the only thing he has to talk about is his poor health. He also seems to be the only one with any link to better times. (\"I've watched this city turn from pastures to the hell-hole it is now.\") The city they live in is completely industrialized, and the only plant life seen is dead, and in a pile of soil on Henry's bedside table.<br><br>Some have suggested it is based after a nuclear holocaust, but nothing is explained to any conclusion. One of the beauties of this film is that it practically begs the viewer to decide for themselves what any of it means, and there are many theories. I warn you not to read the message board of Eraserhead before you see the film, as it is so much more powerful and chilling to experience it first-hand.<br><br>The first time I saw Eraserhead, I was completely confused. It is possible that David Lynch just put a load of random imagery together and called it a film. Maybe he wanted the viewers to put it all together and make their own sense of it (or not). On the other hand, there might actually be a set formula behind it and only the very open-minded and discerning audience can properly decipher it.<br><br>One viewing of Eraserhead is enough to raise about a dozen questions, and to leave you gasping for answers. Two viewings are probably enough to give you theories about some of the cryptic depictions hauntingly portrayed. Three viewings might be enough to give you a completely different set of theories, battling persistently against your previous conceptions, but still leaving just a few details that don't quite seem to fit in. The truth is that there may be parts that don't make sense in one interpretation, but fit in perfectly to another. You could probably watch Eraserhead several times, and each time see a slightly different story. Or if you were to ask six different people exactly what Eraserhead is about, you would get six different answers, each equally correct in their own right, and each equally confused.<br><br>That being said, this definitely isn't a film for everyone. This is the first Lynch film I have seen, and it certainly won't be the last. But there will no doubt be many who see this purely as a lot of clever mind tricks and special effects (for its time, anyway.) There will be those who don't like much to think about, and want it all explained bit by bit in perfect detail. Well, Eraserhead is an epitome of everything such moviegoers will hate. I will say this for certain: If your favourite films are 'Love Actually' or 'Dude, Where's My Car?', you probably won't get much out of Eraserhead. But for those who like their concepts challenged once in a while, this film will probably be one to watch again and again until you understand. This is also not a film to be forgotten easily. Love it or hate it, Eraserhead will stay with you for a very long time.","user":"B-J-C","rank":[277,360]}]