[{"title":"Anything for Society!","rating":3,"date":"3 August 2010","review":"Beverly Hills teen Bill Whitney (Baywatch's Billy Warlock) is good at sports and popular at his high school, but he feels alienated from his upper crust family. His parents are indifferent towards him while lavishing favor upon his sister. Sometimes he even feels like they're conspiring against him, but is he just paranoid?<br><br>This was Brian Yuzna's first film as director, and it's still his best. My love for this thing knows no boundaries. It's such a wonderfully unique mixture of social commentary, the 90210 lifestyle and incredibly warped horror. Oh, is the horror in Society ever warped! It's always fun showing this to first-timers and seeing their reactions to what unfolds on the screen. Horror aside, the film also works as both a joke on the rich and a scathing indictment regarding their tendency to leech off of the have-nots.<br><br>Even though it's pretty clear right from the start that things aren't what they seem, there's a great sense of paranoia present in Society. Is Bill's rich family plotting against him? Are they even human? You wouldn't expect a former Baywatch star to be an alienated sort, but in the context of the film, it works. The pitch black humor works too, though there are a few more juvenile attempts at comedy (the kids on the beach) that are admittedly lame. In a way, however, they do add to the film's bizarre tone. I used to see the weirdo mother character as another pointless attempt at low-brow humor, but the more I've thought about it, she's likely there to represent a mishap through the shunt. Former Playboy centerfold, Devin Devasquez, plays her quirky daughter, Clarissa Carlyn. She's very appealing in the role, and it's refreshing to see a rich beauty portrayed as something other than an evil vixen for a change.<br><br>The climactic scenes involving the big shunt are really something to behold. Words cannot do justice to the madness of this sequence. Spectacular, glorious madness! Nope, even those words don't do it justice. The very idea is quite perverse, and the special effects by Screaming Mad George are jaw-dropping. I'd be hard-pressed to come up with another horror film that comes close to rivaling Society's climax.<br><br>I also can't go without mentioning the sinister reworking of the \"Eton Boating Song\" which plays over the film's opening credits. It's pure gold, and since the Anchor Bay DVD's menu has it playing on a loop, I like to leave it on the menu for a bit after I've finished the film. <br><br>Society has a never-ending charm that's impossible for me to tire of. I'd probably rank it somewhere among my top ten personal favorite horror films if I were to make such a list. I remember trekking all over the metroplex just to find a copy back on the DVD's release date (the same day Near Dark hit DVD from what I remember). Good times!","user":"Cujo108","rank":[45,50]},{"title":"You just gotta see it to believe it!","rating":8,"date":"7 January 2006","review":"Billy Whitney is a troubled kid who's seeing a shrink because of his fear of loved ones and those that are close, which he has a hard time fitting in with his wealthy family as he feels he doesn't belong with them. He's also a student at Beverly Hills Academy who's running for president and is dating the head cheerleader, so things aren't all bad. Although things suddenly change for the worse when Billy's Sister's ex-boyfriend convinces him there's something strange about his family. Now Billy gets pulled into a very frightening world that's filled with surreal images and where the paranoia is finally tearing him apart. But what's to come for Billy will be more shocking than what he can comprehend.<br><br>After watching a horror-mystery the day before I decided to put my teeth into another, Yuzna's 'Society'. You'll think that Society comes across as usual pure 80's trash in the very cheesy kind. And it does look like that and actually descends into that pattern. But firstly the way it started off you might think otherwise, as it does open proceedings rather eerily with an tight prologue and then a haunting tune through the opening credits, but soon it takes a real sharp turn from its beginning and heads into familiar 80's horror territory, with the usual corny dialogue, gratuitous nudity, camp performances and over-the-top humour. Although when it comes to the final 20 minutes or so, you totally are blown off your feet and possibly are in a state of bemusement. During this stage it turns disturbing and rather disgusting, while there's classical music streaming along. I know that I was left with a bewildered impression on my face and I would be surprised if you don't get the same feeling too. Meaning it's a good idea to make sure your not eating when coming up towards the film's perverted climax.<br><br>The odd but fun story does play out like a teen flick with nice amount of mystery and yep I say it, satire. This story has more to it and that shows in the hidden agendas and subtle dialog that all seems to come together perfectly. On a second viewing you would easily pick up on these hints within the script. You got your sick in-jokes, lame pun and plain wicked tone. Back onto the satire now, which this story is an allegory on the rich looking down on the less privilege and finally screwing over the poor. These amusing pot-attacks are scattered across the story, while also worked into the mystery side of the story with Billy trying to figure what's going on and what's this 'society' is. Some moments you see have you contemplating if what he sees is a figment of his imagination. The reason why you question this is because his seeing a shrink so is it just in his head or is this nightmare for real. This is presented in a very good manner and that's because of the man behind the camera. <br><br>Brian Yuzna who produced the great 'Re-animator (1985)' makes his directorial debut here and does an extraordinary job. No real atmosphere is generated, but he paces it with such elasticity that there's no labouring about and he ups the suspense with assured handling and control. The humour and horror balance is a bit uneven, at times it felt oddly out of place, but it doesn't destroy the fun mood. Camera placement is rather sharp and well executed, with a nice eye for shots and moods. Going with it all is a likable heroine played by Billy Warlock from 'Bay watch' fame. While, the rest of the acting is nothing out of the norm for a film like this. Everyone was effective in their parts and contributed to the enjoyment that followed. The production is incredibly slick and that's evident by the locations and Screaming Mad George's mind-blowing special effects. Those messed up effects that come out of the blue are what makes this film memorable in its inevitable outcome! <br><br>There's nothing really creepy about this real jokey 80's horror flick, but when it gets to the ending credits you'll be left with one real lasting impression I assure you!","user":"lost-in-limbo","rank":[28,32]},{"title":"What the...?","rating":7,"date":"9 March 2004","review":"This is one of the weirdest movies I have ever seen, somewhat akin to watching a Lovecraft tale as told by John Waters. I think I liked it. Yeah, I'm pretty sure I did...I guess.<br><br>Billy (Bill Warlock of soap opera fame) is nearly 18, and has spent his youth living a life of privilege with his wealthy family in Beverly Hills. However, he senses that something is wrong. He does not look like his mother, father or sister, and indeed, they treat him as though he were an outsider. Oh, they're always very pleasant and polite, but they're somewhat distant and rather cold, displaying no real emotions towards him or anyone else. Tragic news is met with blank expressions and vacant smiles. Billy's girlfriend is too busy obsessing about parties to care about Billy's mounting concerns, and his psychiatrist dismisses his worries with prescriptions. When Billy hears an audio tape recorded by his sisters' most recent dumpee, his worst fears are confirmed: something unnatural is happening, something incestuous and profane. But the dumpee disappears, the tape recording alters itself, and Billy finds himself being slowly and deliberately cornered by The Society.<br><br>For all that this film is a dark comment on the soullessness of the upper classes, it never really takes itself seriously. Indeed, if it had, this movie would have died a quick death and taken up residence in the discount PVT bin at Blockbuster Video, cursed as it is with all the hideousness of the 1980s, denim and synth music and helmets of bleached hair everywhere. But this movie is so odd and freaky with the most morbid sense of humor running all the way through it that it works, and works pretty good. The special effects look a bit dated, but they're so hilarious that you won't care. (insert \"butthead\" scene here.) The \"shunting\" scene is still difficult to watch for people like me who have a low tolerance for sadism and gore, but I've seen gorier and the concept was so innovative that I had to appreciate it. <br><br>If you ever wanted to see one of those sappy teen movies from the 80s, (preferably the ones that starred Michael J. Fox or Molly Ringwald) tortured, dismembered and publicly humiliated, then this might just be the film for you.","user":"Gafke","rank":[59,72]}]