[{"title":"A Mission To Mars That Wasn't","rating":8,"date":"20 March 2013","review":"The notion of conspiracy within the bowels of the U.S. government was very much on people's minds following the triple traumas of the JFK assassination, Vietnam, and Watergate. Even something as noble as manned space flight couldn't escape the grasp of the conspiracy theorists out there, as many of them didn't believe that the Apollo 11 moon landing of July 20, 1969 ever took place, and that it was all done on a Hollywood soundstage. In 1978, one film took this conspiracy all the way to Mars and back. That film was CAPRICORN ONE, a fairly taut combination of science fiction and conspiracy thriller elements that, in some ways, presaged later TV shows like \"The X Files\", and, perhaps inadvertently, also accelerated the conspiracy theorists' attacks on America's manned space program.<br><br>James Brolin, Sam Waterston, and O.J. Simpson portray the three men who are about to embark on a ten-month space voyage whose ultimate goal is a manned walk on Mars. But just minutes before their ship, Capricorn One, is to lift off from the Kennedy Space Center, they are immediately ordered off; and the spacecraft launches to Mars without them. Bewildered and upset, they are then told by NASA's director (Hal Holbrook) that the life support system built into the spacecraft was faulty and that it is likely that it would have failed before the ship could ever get into Mars' orbit. They are instead ordered to \"fake\" the landing and the Mars walk on a soundstage in a hangar somewhere in the Mojave Desert, much against their principles though under the threat of their families being killed. But when the spacecraft they are supposedly coming home in loses its heat shield upon re-entry, everyone presumes that the three men have been incinerated. The trouble is, of course, that all three men are actually alive and well, and Holbrook knows that the space program's continued success is incumbent upon them never appearing anywhere in public again.<br><br>In steps an enterprising news reporter (Elliott Gould) who, against all odds and some very sardonic colleagues, investigates the Capricorn One incident and uncovers the truth, only to be pursued by military personnel in Blackhawk choppers. In the meantime, Brolin, Waterston, and Simpson break out of the hangar and escape into the Mojave Desert. Only Brolin is able to evade capture or death, however; and it is only through the quick thinking of Gould and an eccentric crop-dusting pilot (Telly Savalas) that he is able to sort everything out for the world.<br><br>Writer/director Peter Hyams, whose later sci-fi forays included the HIGH NOON-inspired 1981 opus OUTLAND, and the much-underrated 1984 film \"2010\" (the sequel to the 1968 Stanley Kubrick classic 2001: A SPACE ODYSSEY) directs with a good flair for suspense sequences, especially Brolin's struggle for survival in the desert as he is chased by government agents, including loose homages to both Kubrick's DOCTOR STRANGELOVE and Hitchcock's NORTH BY NORTHWEST. He also gets good performances from his cast, however, not only from Brolin, Simpson, and Waterston as the beleaguered would-be heroes, but also from Holbrook, who does a typically solid turn as the NASA bureaucrat with a mess on his hands. The Mars landing sequences, though done on a soundstage for obvious reasons, have a crazy kind of realism to them, thanks to the special effects work of Bruce Mattox, Henry Millar, and Robert Spurlock, and the solid cinematography of Butler, who worked on Steven Spielberg's 1975 suspense masterpiece JAWS. Goldsmith, who had won an Oscar for THE OMEN in 1976, and whose sci-fi credits include PLANET OF THE APES, also provides a tense and dramatic score, with almost Stravinsky-like menace.<br><br>CAPRICORN ONE is not necessarily the perfect science fiction film; one can spot a number of implausible situations right off. That said, however, it was definitely one of those films that was right for its time, in that it managed to attach something as honorable as manned space travel to a Watergate-type of cover-up scenario. Even if the plot doesn't hold up to 21st century standards (and it may have bee hard to imagine even back in 1978), it still (rightly) made a big deal about how our government too often attempts to dissemble the truth.","user":"virek213","rank":[19,20]},{"title":"Thrilling Conspiracy Film.","rating":7,"date":"29 August 2013","review":"What if a televised Mars landing was an elaborate hoax? And what if, because of an accident, the \"astronauts\" are believed killed when their capsule burns up in the atmosphere? Why, they would become expendable if the government was ruthless enough to kill them, which for the three \"astronauts\" of this film(James Brolin, Sam Waterston, and O.J. Simpson(!) is exactly what happens, though they manage to escape by plane into the desert, being pursued not only by the corrupt head of the project(played by Hal Holbrook) but also investigative newspaper reporter Elliot Gould, who risks his career and life to track them down, and get his story.<br><br>Despite the fanciful premise, this a smart, taut, and breathless film from Peter Hyams,that involves the viewer both emotionally and intellectually, leading to a most satisfying ending.","user":"AaronCapenBanner","rank":[23,26]},{"title":"Capricorn One: a real Gem-ini of a movie. I'm Apollo-ed that it's not rated higher.","rating":8,"date":"17 August 2014","review":"\"Capricorn One\" is one of the last great 70s thrillers, alongside \"The China Syndrome\", \"The Andromeda Strain\", \"Coma\", heck maybe even \"The Exorcist\". Perhaps taking their cues from Stanley Kubrick (2001: A Space Odyssey, Clockwork Orange, etc), all of these classics are presented with an artistic, slightly off-kilter, brightly creepy vibe that encapsulated the end of 60s flower-power optimism and the beginning of 70s cold cynicism.<br><br>Stylistic examples include wide angle shots and slow, mechanical camera movements that give the viewer a disturbing feeling of voyeurism or disconnection from humanity (à la \"Open the pod bay doors, Hal.\" \"I'm sorry, Dave, I'm afraid can't do that.\"). This quiet yet bone-chilling style is the opposite of MTV-type filmmaking which made heavy use of flashy, closeup, disorienting camera shots cut together so quickly that you feel like someone slipped some magic pixie dust in your Kool-Aid. No, the 70s classics, in particular \"Capricorn One\" and other films by Peter Hyams, instead give you long, deliberate shots from a distance, allowing you to absorb every bizarre detail that was meticulously laid out for you.<br><br>If you get bored easily, then this isn't for you. But if you're looking for a film that slowly reels you in without any gimmicks, carefully building momentum for the 1st hour leading to an explosive, roller-coaster finale, then look no further. It's best if you know nothing about the story, so I won't say anything about the plot except that it centers around a mission to Mars. But this is not a sci-fi flick, it's closer to a political thriller.<br><br>\"Capricorn One\" won't necessarily scare the pants off you like some of the other films, but the story will definitely keep you on the edge of your seat wondering what's going to happen. The director never telegraphs the ending, so you're never quite sure if things will turn out good or if it'll be a miserable tragedy. You have to ride it out to the very last scene.<br><br>Two things won me over immediately. First is the careful, artistic approach to cinematography which is evident in the opening scene: a slow rusty sunrise behind the colossal silhouette of the Capricorn spacecraft. Many other shots are as powerful, whether they're outdoors or indoors. Hyams frequently does a neat little trick where he establishes a shot and leaves the camera where it is but slowly, over the course of 2 minutes or more, moves the camera in or out of the action, creating a thick suspense.<br><br>The 2nd thing that won me over was something many thrillers overlook: HUMOR. There are some priceless scenes that had me rolling, and it's all due to the great script and lines delivered by great actors. Telly Savalas makes an appearance as a grumpy old airplane pilot, and his rapid fire volley of dialogue with Elliot Gould is like something straight out of a Cary Grant-Catherine Hepburn comedy. Another hilarious rapid-fire comedic scene is Elliot Gould arguing with his boss, played by David Doyle (\"Bosley\" on the original Charlie's Angels). Big laughs without disrupting the tension of the story. It takes a bold filmmaker to put such comedy in a serious film, and Hyams &amp; his acting troupe succeeded brilliantly.<br><br>A final note that's worth mentioning: there's a scene where a snake meets with an unfortunate fate. While the snake is real (hats off to James Brolin for having the guts do the scene), the snake's stunt double was a dead carcass they had found. No snakes were harmed. So animal lovers as well as 70s thriller lovers, have no fear. Once you start watching \"Capricorn One\", nothing will make you Sat-turn the channel! (wow that was lame)","user":"rooprect","rank":[27,32]}]