[{"title":"Atmosphere, atmosphere, atmosphere!!","rating":8,"date":"22 June 2005","review":"There certainly are elements in this film that could have been left out, and the film would have been better off for it; why the cheap monster/demon makeup?(The increasing blisters are great though..) Why having that obnoxious fatso-brother appear in the film at all? And let's face it, the special effects in places were not exactly state of the art either, neither were the editing. So why give it an 8 then? Well my rating couldn't have been any lower, and this is based solely on the fact that the film positively reeks of unique and creepy atmosphere, atmosphere so dark that I put it up there with the Kane-scenes in \"Poltergeist 2\", and the atmosphere in \"Exorcist 3\". There truly are some psychotic and memorable scenes. Two that stands out are when the mother of the family tries to \" connect the dots\" on Cyrus's back, the other is when she sits quietly in the living-room sowing, and then starts to jam the needle and thread into her hands! Excellent! Not to mention the infested fruit and vegetables! All in all,there is in this film a disturbed and unsettling tension that you seldom get to witness in other horror flicks of the same decade, and certainly not in contemporary and crappy Hollywood blockbusters, that's for sure. If you are just curious, rent! If you are a true horror-fan, buy!","user":"glyptoteque","rank":[28,30]},{"title":"\"Hail Mary full of grace, how's your garden grow?\"","rating":6,"date":"6 March 2002","review":"The Curse is a grotesque vision of H. P. Lovecraft's \"Colour out of Space.\" Most Lovecraft adaptions suck (save the Gordon-Yuzna-Combs collaborations), but I happened to like this one. And it looks like I'm in the minority on that. Why do people hate this movie so much? Yes, it has flaws. David Keith's direction isn't great. He's an extremely likable actor and he should stick to what he's good at. I feel like the prologue part should have been saved for the epilogue. It would have been a fitting end, it was not a place to start. Some of the acting is also hammy, mostly the supporting cast. As actors go, Wil Wheaton does a fine job, as does his sister. And they're the only characters you are supposed to care about. The mother character freaks me out as she changes during the film. Horror Director Lucio Fulci produced, and maybe influenced, this one. There are scenes of gore present that rival Fulci's own. Not of the \"flesh-ripping\" variety, but of the \"lets see what disgusting things we can do to food\" type of gore. The Curse is not a film to eat during. I suggest that you ignore most of the comments, see the movie, and make your own decision as to whether it's good or bad.","user":"Backlash007","rank":[30,33]},{"title":"Bizarre 80's science-fiction...","rating":4,"date":"4 October 2004","review":"This movie is about a family living on a farm in the country: a husband, wife, and two sons and a daughter. The father, being an EXTREMELY religious type, finds out that his wife is cheating on him. Not long after that, a meteor hits the backyard (how stereotypical can you get?) and begins to pollute the water and the vegetables. Those who eat the vegetables and drink the water slowly turn into hideous, slime-spewing homicidal mutants!!!<br><br>Duh-Duh-Duhhnn! I'm guessing that maybe this meteor is supposed to be a punishment from God (or so the husband says.) <br><br>Everyone but the younger brother and his sister eat the food and drink the water from the farm. First, the fruits and vegetables start to rot/become infested with insects/fill up with brownish fluid. Next, the chickens attack the daughter, and the horse kicks one of the brothers. After that, the cows become sick and start spewing up maggots. By this time, the mother, who was infected first I'm guessing, starts to break out in these nasty little blisters. Eventually, she starts talking in gibberish, eats with her fingers and tries to stitch a cloth to her hand, then she tries to kill her husband. The husband puts her in the shed for the next few days. The next person to show signs of infection is the brother, who starts acting like more of a buttmunch than usual. A dog on their farm kills a traveling salesman's assisstant, and the wife ends up munching the salesman's guts. When the husband finds out he moves his wife to the attic. Meanwhile, the main character (Will Wheaton) tries to figure out how to save his sister from his now-criminally insane family. That night, his father finds him in the shed looking for his mother. Then he notices that his son has a backpack filled with evil, sinful, store-bought food. His father tells him he's unappreciative and tries to beat him. When that fails, he tries to kill him. The brother is able to hold him off until the house starts collapsing. A friend of the family comes by to save Will Wheaton and his sister, but Will says he has to save his mother. He goes up to the attic, and in one of the most creepy scenes of the movie, he watches his mother rot away into a puddle of black goo. He escapes just in time to watch the house sink into the ground, sending his unholy kinfolk into redneck hell!<br><br>I liked this movie, it WAS poorly acted, but it was far-fetched to begin with. There are some genuinely nasty moments that will make your skin crawl. For instance, after the chickens attack the little girl the camera zooms in as their eyes collapse in the sockets and start bleeding this nasty yellow goop. Or the scene where the cow's udder splits open and locusts fly out. Or the scene where the mother cuts open a head of lettuce to reveal it's putrid, rotting innards (and lettuce doesn't even HAVE innards!). The film is very dark in atmosphere and there is a sense of impending doom throughout the whole film, not unlike that of Poltergeist. I give it 6 1/2 out of 10 because the acting, other than that of Wheaton and Akins, was horrendous.","user":"leathaface","rank":[13,14]}]