[{"title":"An all time classic - see it!","rating":22,"date":"22 April 2000","review":"The blatant plug first: If you haven't seen this film, you have deprived yourself of one of the great performances of all time. Do not miss the opportunity, order it, buy it, or just plain rent it at once.<br><br>When I was a boy my father introduced me to this version of Scrooge. I can remember how we had to all sit very quietly whilst he recorded the soundtrack from our TV using a mike onto his tape recorder. From there on in, every year at Christmas the tape would come out and we would listen to the soundtrack complete with the introduction music to the adverts. Eventually the tape became a cassette and then we had the video.<br><br>Now I am the owner of this magical film on DVD and there has not been a year pass me by that I haven't sat and watched the film at least once.<br><br>The joy of watching this version has never left me, and as other commentators have remarked, Alastair Sim as Scrooge, seems to provide everything that you could want in the part. The transition from miser to benefactor is handled well, with Sim fighting the spirits all the way: \"I'm too old to change\". The dizzy happiness of the final scenes in stark contrast to the character in the opening of the film.<br><br>Everytime I see this film I find myself captivated by the way Sim manages to find an inner character to Scrooge, one that has not previously revealed itself. The young Scrooge played by George Cole, may not be the nasty money grabbing character whilst interacting with his sister, working for Fezziwig, or courting Alice, but he doesn't have that intoxicated happiness, there is still something sour about him.<br><br>Perhaps that is what truly makes this film. If the novel is about redemption and a rediscovery of humanity, then Alastair Sim finds it in abundance within his portrayal.<br><br>I cannot reach the end credits without undergoing some form of renewal myself. The characterisation carries you with it. I have seen and heard this film at least 50 times and I still smile to myself whilst waiting for the words : \"Cratchit! you're late.\" the attempt to keep up the old Scrooge breaking down very quickly.<br><br>Perhaps some more people in the world could do with a revelation such as this Scrooge undergoes. Would it be so bad if we all felt at times that: \"I don't deserve to be so happy\".<br><br>The other part I have always enjoyed is that of Kathleen Harrison as Mrs Dilber. Throughout she plays the put upon house keeper with great style. The comments she makes at Old Joe's are telling in their rightness and her initial reaction to the transformed Scrooge is bewilderment and terror in equal measure.<br><br>I am relieved to read that I am not alone in this world in being able to quote almost every line, and some of the these have become catch phrases in my family: \"I always know\" seems to be a favourite of my father :-)and a meal cannot pass without \"ha'penny extra\" being put forward if more bread is requested.<br><br>So to finish - let the enthusiasm of the other contributors and myself encourage you to at least try this film. And now to get this in the post: \"I'll send it to Bob Cratchit. Label, label, label, label, must have a label.\"","user":"smg.rhill","rank":[109,114]},{"title":"A Christmas Gift","rating":10,"date":"7 May 1999","review":"If I could take only ten movies to a desert island, this would be one of them. This movie captures all the things that \"A Christmas Carol\" is supposed to be. Watching Alastair Sim interpret the role of Scrooge and then looking at other actors, I see his incredible facial expressions, the loss of soul that haunts him, the vulnerability (yes, I mean it; he is actually pitiable at times), the loss of love from his once betrothed, and the terrible loneliness suffered at the hands of a vengeful father and the loss of his kind and loving sister, Fan. Then there are the wonderful images and the haunting music. The excellent supporting cast. Mervyn Johns is an excellent Cratchett, multi-dimensional and fun loving. Michael Horden as Jacob Marley (definitely the best performance as the ghost). Scrooge is shown to be calculating at every juncture, but seems to know that in many ways he is wrong. His avarice becomes his mistress and he can't forsake her. There are wonderful little scenes that I remember. When he stops to have dinner at the restaurant and is told more bread will cost extra, he decides to deny himself a little bit of warmth. There is the scene where Fezziwig loses his business to Scrooge (not a part of the original book but it works fine in the film). Scrooge hesitates for a moment and then barges on, and shows his insensitivity by retaining a worker at a reduction in salary. The scene where Marley is dying and Scrooge waits till the end of business. He then comes to the house and asks \"Is he dead yet?\" We all know the ending, but there is a joy, a blissful excitement not found in any of the other films. This is all attributable to Alastair Sim. He carries every moment. He shows us what real acting is all about. I treat myself to this movie a couple times a year and it never tires me. See it if you never have.","user":"Hitchcoc","rank":[94,100]},{"title":"The definitive Christmas story","rating":10,"date":"20 November 2006","review":"Scrooge is the definitive Christmas story. Ebenezer Scrooge is a wealthy businessman in Victorian London and a miser. One Christmas Eve he is visited by the ghost of his ex-partner Jacob Marley, as well as three Christmas spirits who gradually convince him of the error of his ways. As a result, he awakens on Christmas morning transformed into a veritable champion of the season and all that it stands for.<br><br>This 1951 version of A Christmas Carol (Scrooge) remains the best for an important reason: of all the versions made before or since, this is the only one that got it absolutely right.<br><br>The story--as so many have misread it--is not about an evil tightwad who hates everything and is suddenly scared into being a saint by the spirits of Christmas. It is, instead, about a good man whose life has turned him in on himself--made him bitter and miserable--primarily through the death of his beloved sister, Fan. He is not, therefore, changed in the end, but rather, restored to himself, his innate good nature emerging renewed from its cocoon of self-imposed misery.<br><br>Of course, the Spirits of Christmas must do the job for him since Scrooge can't rely on his own sense of reason and fair play to save him from himself; his position is technically valid. The opening scenes demonstrate how everyone is expecting something from him in the name of Christmas, but not in the name of what's fair: A debtor wants more time to pay--in the name of Christmas. A charity wishes him to donate money--in the name of Christmas, and Cratchit wants the day off , with pay--in the name of Christmas. As Scrooge points out, if he were to dock Cratchit's pay half a crown for a day without work, Cratchit would feel ill-used, but it's perfectly alright to ask for a day off--with pay--from Scrooge. That it is all done in the name of Christmas hardly counts as an argument, either, since Scrooge has lost sight of what Christmas is all about.<br><br>That is Scrooge's illness, and A Christmas Carol recounts this classic Dickens tale of the cure.<br><br>Thanks to Alastair Sim's wonderful performance, we can almost feel sorry for Scrooge. He suffers more from his miserly nature than anyone else. We are introduced to a reasonable man who simply wants to be left alone and we can empathize with him--in part at least. We see him, a man of great wealth, deny himself a piece of bread simply because it would cost an extra half-penny. Lit by a single candle and warmed by a meager fire, he sits alone and lonely on Christmas Eve in his large and empty house. Sim also adds a wonderfully droll sense of humor to his portrayal, thus making Scrooge more of a character than a villain, and therefore much more sympathetic from the outset.<br><br>Come Christmas morning, we celebrate with Scrooge because we know him. In spite of ourselves, we liked him even before his rebirth, and now are delighted that he is finally happy. His acts of humility and generosity come from a familiar soul and we are touched by them.<br><br>I first watched this film in 1955 on television, Christmas day. I have not missed a Christmas in the fifty-plus years since then and always find it wonderfully entertaining and inspirational. Aided by a wonderful cast and careful adherence to Dickens' original dialogue and concept, it has deservedly become a Christmas classic. I can't imagine that there is someone who hasn't seen it, but if you haven't, I certainly recommend it.","user":"Bob-724","rank":[45,48]}]