[{"title":"So funny, one of my new favorite comedies!","rating":8,"date":"16 May 2008","review":"I have heard of Bachelor Party a couple times, once on VH1's I love the 80's and also in Clerks 2 there was a small reference. The weird thing is, I'm more used to a dramatic Tom Hanks, other than Big and A League of Their Own, I've never seen him in a raw comedy movie, so it was a little weird to think of Tom Hanks as this very funny male lead in a movie. But I decided to go ahead and give the movie a look, I have to tell you, I haven't laughed so hard and so out loud in a movie like this in a long time. Then I check out the rating on IMDb, 5.7?! Are you kidding me?! This movie is just so beyond funny, I know that it is cliché'd eighties, but come on! I just couldn't believe that anyone else would not find this to be a funny film. If you're telling me you did not find Brad to be funny, you have got to get your funny bone checked because Bachelor Party is non stop laughs from beginning to end.<br><br>Rick is about to get married to beautiful Debbie, his friends who live to party are throwing him the biggest bachelor party they can have. Debbie's rich and snobby family definitely don't want Rick to be apart of their lives, so Debbie's dad will do anything, including her ex-boyfriend, Cole, who wants her back, to split them up. But the bachelor party night has arrived, and things are going more crazy than the boys have expected.<br><br>Bachelor Party is seriously funny, it's predictable and silly, especially the end, but it's all in good fun. This is perfect 80's humor, it's the humor I miss and I'm sure others do too, because it's raunchy but doesn't over do it and just has fun with the audience. This cast looked like they had an ultimate blast and Tom Hanks was just brilliant, his character could be a jerk, but such a great guy at the same time, so he's real and likable. This is just a funny movie that I would recommend, it's a lot of fun and the rating on IMDb is just too harsh. Come on, let's get this rating up.<br><br>8/10","user":"Smells_Like_Cheese","rank":[50,62]},{"title":"A great comedy that deserves more credit","rating":10,"date":"31 March 2004","review":"Tom Hanks' career began in comedy, and this film is a shining example of his comedic talents.  Hanks delivers a satisfying and enjoyable performance as groom-to-be Rick Gassko, and his supporting cast couldn't have been better selected.  Many of the film's co-stars had worked with Hanks in the past, most notably on TV's Bosom Buddies.  The chemistry is apparent here, as the actors are all very comfortable in their roles, as the dialogue is executed with a smooth, yet expedient wit.  The jokes all work in this film - outlandish as some of them may be.  There is never a dull moment in Bachelor Party, as each scene is well-constructed to deliver an inevitable laugh, without the premeditated one-liners that seem so forced in today's trash comedies. The events of the film were based on Producer Bob Israel's real life bachelor party experience, and the realism of the story can be felt in the film, as the viewer rarely has to suspend disbelief.  This movie can best be appreciated by the movie fan who enjoys witty, smirk-inducing comedies such as Porky's, Animal House, Police Academy, Summer School, and Weekend At Bernie's.","user":"tenohtwo","rank":[32,41]},{"title":"Classic!!","rating":9,"date":"28 February 2006","review":"First of all, if you are thinking that this will be some wonderful, well thought out, well crafted artwork starring Tom Hanks, put the movie down and back away from the rack. Now flash back to 1984, when movies were inane and entertaining--solely for entertaining!!! As far as raunchy 80's humor goes, you won't find anything better that Bachelor Party. Yes, the humor is predictable. Yes, the sight gags are predictable. But this movie does it better than anyone else in it's genre (that would be raunchy comedy). Good girl falls for bad boy, plan to get married, but first the guys must be guys. \"Let's have a party with liquor and drugs and guns and hookers and cops!\" and they do. Don't ask for more than this movie can deliver, yet appreciate it for what it is!","user":"nursenicki2002","rank":[36,50]}]