[{"title":"Disappointing","rating":18,"date":"18 February 2003","review":"In a lot of ways, \"The Big Sleep\" must have seemed tailor-made for a remake in 1978. The first movie version, while justly famed for the chemistry between Bogie and Bacall, really didn't come close to doing justice to Raymond Chandler's original novel. A lot of that had to do with the fact that Hollywood in 1946 just couldn't show a lot of the things that Chandler did in his 1939 novel. The nudity, the drugs, the pornography, the homosexuality were all a little too strong for a mainstream movie of that time.<br><br>In addition, Chandler's convoluted plot (originally derived from two or three separate short stories) didn't offer an easy screen translation, even before all the \"juicy parts\" were excised.<br><br>So this must have seemed like a great idea. Robert Mitchum had successfully played Philip Marlowe a few years earlier in \"Farewell, My Lovely\", and the MPAA ratings system meant that they could be as explicit as they wanted; the filmmakers could be more faithful to Chandler's novel *and* show us Candy Clark nude! How could we go wrong?<br><br>In lots of ways, unfortunately. First up, Mitchum didn't seem to fit the role of Marlowe nearly as well in this movie as he did in \"Farewell, My Lovely\". This makes me suspect that the earlier story was more deftly tailored to Mitchum's age and acting style, with lots of references to how old and tired Marlowe feels. In this case, the script sticks very closely -- basically scene-by-scene, almost line-by-line -- to the original novel, but Mitchum doesn't fit the part as well, somehow. In the book, Marlowe was very much \"in your face\", giving a hard time to everyone from the cops to Eddie Mars to the Sternwood girls. That means that in this movie, Mitchum's nonchalant style doesn't fit with many of the scenes he has to play. Bogart was \"nonchalant\" too, I guess, but in a different way. Bogie's tough guys would feign casualness, but they always seemed like they were waiting for the other guy to start something, and when Bogart dug in and got to work, he took it seriously. Mitchum just seems like he couldn't care less one way or the other. It doesn't work for this story, where the second half is driven by Marlowe's desire to find out the truth even when he isn't being paid to do so.<br><br>The move from L.A. to London didn't bother me at all. It made an interesting, coincidental \"bridge\" between the classic films noir and more recent movies about London gangs like \"Snatch\".<br><br>But the deepest problem with this film is that while it follows the externals of Chandler's novel much more closely in terms of the plot and (most of) the dialogue, it fails utterly to capture the real heart and soul of the novel. Of course, the earlier movie version did, too -- this novel may well be unfilmable -- but at least it had Bogie and Bacall. This one has Mitchum and Miles. And Candy Clark nude. And not much else.<br><br>Take a look at the beginning of the movie. The second scene, where Marlowe visits General Sternwood in the greenhouse, is probably one of the classics of 20th century popular literature. Few other novels begin with a scene which so completely evoke their characters, and atmosphere, as Marlowe sweats, gags on the scent of orchids, and converses with a tired, bitter, old, rich man clinging to his miserable life. Chandler is hitting you hard with every trick in his bag, and his timing, dialogue and characterization are flawless. Howard Hawks' screenwriters were smart enough to leave much of his original dialogue in this scene. By contrast, in the Mitchum film, scene after scene features lines taken verbatim from the novel, but for some reason, they chose to leave out some of the best: \"How do you like your brandy, sir?\" \"Any way at all.\" or the all-time classic, \"A nice state of affairs when a man has to indulge his vices by proxy\". If the screenwriters chose to leave in lines about Pekineses and loogans, how could they possibly leave these ones out?<br><br>Maybe they thought that such lines wouldn't sound right coming out of James Stewart -- they were probably right -- but that just shows what an inept choice he was for this part. General Sternwood is supposed to be incredibly bitter, yet we're given a typical Stewart performance; he almost looks perky, certainly not broken by life. He looks physically weak but hardly seems cynical or jaded enough to have produced two such screwed-up daughters. It wasn't even made clear why he was sitting out in the greenhouse, and Marlowe doesn't seem particularly uncomfortable while he's out there (although a later reference to Rusty Regan \"sweating like a pig\" is left in). It's just a mess, and does nothing at all to set us up for what follows.<br><br>To cite one further example, another key scene manages to miss the point completely while still following Chandler's plot closely. The scene where Harry Jones finally approaches Marlowe in Marlowe's office is the turning point of the entire novel. The case is closed, Marlowe is literally signing the check to deposit it, and Jones walks in with the exact piece of information Marlowe's been missing the entire time. Like so many scenes in the novel, this one is simply brilliant, overflowing with great dialogue (\"She's too big for you\"), and in some ways tying together the entire story. Yet after following most of the scene very closely, the script inexplicably stops short of some of Chandler's best writing:<br><br>\"'This Regan was a cockeyed sort of buzzard. He had long-range eyes. He was looking over into the next valley all the time. He wasn't scarcely around where he was. I don't think he gave a damn about dough. And coming from me, brother, that's a compliment.'<br><br>\"The little man wasn't so dumb after all. A three for a quarter grifter wouldn't even think such thoughts, much less know how to express them.\"<br><br>The filmmakers may have closely followed the plot of the original novel in this version, but the fact that they could leave out writing like this, while clinging almost religiously to most of the rest of the book, shows that they couldn't have been more clueless about the real \"core\" of Chandler's writing. Alas, it appears that we are still waiting for the definitive movie version; this one manages to reduce \"The Big Sleep\" to a barely-above-average TV movie-of-the-week with Candy Clark, nude.","user":"McGonigle","rank":[87,100]},{"title":"No classic like the superior original but still worth a look.","rating":19,"date":"19 November 2001","review":"Warning: This review may contain spoilers.<br><br>When Michael Winner decided to remake Howard Hawks's 1946 classic version of Raymond Chandler's mystery novel \"The Big Sleep\", he must have known that comparisons to the original film would materialize and that the majority of them would not be in favor of his 1978 screen retelling. The majority was correct. This 1978 version can't compare to the Hawks original(**** out of ****) in terms of style or entertainment value.<br><br>That stated, this \"Big Sleep\" does make for worthwhile viewing after one has seen the original. While I haven't yet read the book I believe Chandler fans who say this version is more faithful to the original novel despite its updating from 1940s Los Angeles to 1970s London. This version benefits from writer/director Winner's tight screenplay that makes more sense than the earlier one penned by William Faulkner, Leigh Brackett and Jules Furthman. After screening it, so many things that baffled me after even multiple viewings of Hawks' version became clearer resulting in a more coherent and intellectually satisfying viewing experience. Therefore, I recommend this one after seeing the stylish original to help better understand Chandler's complex story.<br><br>Other benefits include  relatively handsome production values and a good cast: Robert Mitchum(in his 2nd performance as detective Philip Marlowe), James Stewart, Sarah Miles(who unfortunately sports a very unflattering Donna Summer-style hairdo but hey it was the late '70s), Richard Boone, Joan Collins, Oliver Reed, John Mills and  Richard Todd. Contrary to the advertising on the current video release, Miss Collins doesn't play the female lead. That honor goes to Miss Miles who co-starred with Mr. Mitchum previously in David Lean's \"Ryan's Daughter\"(1970). Don't expect the same playful chemistry that Humphrey Bogart and Lauren Bacall shared in the original as the Marlowe/Vivian (or rather Charlotte as the elder Sternwood daughter character is named this time around) relationship is decidedly different.<br><br>Warning: parents, pay attention to the R rating. Certain subject matter only hinted at in the 1946 version is portrayed much more graphically  this time around. Definitely a film for adults only.<br><br>Final rating: **1/2 out of ****.","user":"s007davis","rank":[18,20]},{"title":"As a literary adaptation, it is superior to the Bogart version","rating":8,"date":"7 March 2005","review":"You may regard the 1946 version as a classic because of the Bogart-Bacall pairing. As a literary adaptation, this version, however, is much better.<br><br>First of all, the plot stays true to the novel, whereas the older version had a plot ruined by the restrictions of the Hayes code, so that it contains numerous loose ends and unexplained developments.<br><br>Secondly, Robert Mitchum impersonates Marlowe much better that Humphrey Bogart. Bogart essentially recycles his role of Sam Spade in \"The Maltese Falcon\". Yet, Spade and Marlowe are very different characters. While Spade is a cynic who just barely remembers the remnants of morality (and Bogart is brilliant in that role), Marlowe is way beyond that point. He walks around people in a distanced, almost detached way. Only when he spots a glimpse of humanity in his fellow men, he is willing to engage himself (as with General Sternwood in \"The Big Sleep\"). Mitchum plays this character with great understatement, as it should be done, while Bogart makes Marlowe just another hard-boiled detective, which could be replaced by any other one.<br><br>Finally, both Sarah Miles and Candy Clark (while not being necessarily great actresses) bring over the lunacy of the Sternwood daughters beautifully. While the scenes between Bacall and Bogart a great, they are out of place in this plot, in which there is no place left for romance. It might have been appropriate for the characters of Marlowe and Linda Loring in \"The Long Goodbye\", but hardly in a movie adaption of a novel, in which Marlowe remarks \"both Sternwood women were giving him hell\".<br><br>So, while this movie transfers the plot to another time and another place, it is a much better adaption of the novel than the version often regarded as a classic.","user":"Robert-Lander","rank":[48,59]}]