[{"title":"Battling Babes at their best","rating":8,"date":"27 May 2005","review":"A revolutionary a film for kick starting and defining the Battling Babes genre, in the same way 'Zu' was for the fantasy swordplay movies, 'Yes, Madam!' combined the best of Hong Kong action cinema with a fresh, sexy and exciting look. Rarely ever had women played such dominant roles and kicked as much butt as they do here, while still being allowed to show a coy, feminine side.<br><br>Both Yeoh and Rothrock made their action debuts in this film, and they couldn't have been picked at a better time. The action choreography in HK was entering a new, fast and brutal phase while both girls were at the peak of their physical fitness. The end result is not only the definitive femme-fatale flick, but also one of the finest actioners to leap on to the screen in the mid 80's. The final fight scene alone is more than worth the cost of the DVD and puts Hollywood to shame with its raw power and inventiveness. The best offered in the West at the time was a macho Sigourney Weaver in 'Aliens', but even she wouldn't have been able to touch these girls! Also known as 'In the line of Duty 2' following the later produced 'Royal Warriors' aka 'In the line of Duty' (1986) 'Yes, Madam!' set a new trend in the later 80's whereby attractive women such as Cynthia Khan, Moon Lee, Yukari Oshima and many more were given free reign to dish out the pain, being made to look like the greatest screen fighters ever courtesy of rigorous training from the likes of Dick Wei, Yuen Kwai and Yuen Woo Ping. Even today we are reaping the rewards as female faces, new and old, do battle on the screen in modern classics like 'Crouching Tiger, Hidden Dragon'.<br><br>Entertaining cameos from Sammo Hung and Richard Ng as well as great fighting performances from the likes of Chung Fa and Dick Wei makes this a testosterone junkies dream! Ultimately lacking in great cinematography or even much of a plot, the name of the game is to excite the audience in as many ways possible, whether it's with lingering shots of a luscious, young Michelle Yeoh or an animated, head and arm cracking La Rothrock - this movie should not be missed by anyone interested in action - \"Hong Kong style\".","user":"tpr007","rank":[15,15]},{"title":"Rothrock + Yeoh = Dead Dealing Action!","rating":2,"date":"2 March 2001","review":"The first chapter of this movie (In the Line of Duty 1) was a hit in Asia in the '80 years. So the producer company (D&amp;B: famous producer company of martial arts and Made in Hong Kong movies) decided to make a sequel.<br><br>Michelle Yeoh (Khan) is not a real martial arts expert like Cynthia Rothrock. M.Yeoh was a Chinese ballet. Cynthia Rothrock was 5 years undefeated female karate champion of USA.<br><br>The story is simple. But the action scenes are perfect. What would you except more than action from these two dangerous-dead dealing women? They are showing us all their martial arts techniques. If you like martial arts movies then this is your `must to see movie'.<br><br>If you decide to watch this movie then find a Cantonese version. English translated version is very bad. Check out for Rothrock 's Scottish accent in English version. I would like to know who made this terrible translating in English.<br><br>Also recommend for all Cynthia Rothrock fans, like me.Michelle Yeoh is still the best partner of Cynthia Rothrock. .I hope that Michelle Yeoh and Cynthia Rothrock ever will play in a movie again.","user":"ersin1","rank":[8,8]},{"title":"Police Assassins On Da Payroll!!! Cynthia and Michelle are just too vicious!!! YES MADAM!!!","rating":3,"date":"3 February 2004","review":"Hong Kong Cinema has to be the best to happen to action film history. Well, I'll say Asian Cinema has had a tremendous impact period. Hollywood just can't stop duplicating their style (Matrix for example). Hong Kong action films in the 80's should be given a lot of praise because of what has been accomplished. I'm very happy to say that I'm a martial arts FANATIC!!!<br><br>\nYes Madam! (A.K.A. Police Assassins) kicked A**!!! I loved the way Michelle and Cynthia connected with each other. I have a lot of respect for those 2 ladies along with Cynthia Khan (another female heroine). The last fight says enough, it doesn't need to be explained. When I saw this movie for the first time, I rewinded that same scene at least 12 times to get that rush again. This is the type of action that action films are missing today. There are too many digital effects and wire work in today's line of work. I wish Hong Kong action films would repeat this formula again along with other movies.<br><br>About the content of the movie: Well, the movie is kind of on and off with action scenes. At times, I think the movie didn't know whether to be serious or be comedic. The scene with Sammo Hung, David Chiang, and Richard Ng should've been omitted. I liked the fact that Tsui Hark was in this movie. This is the only movie where I've seen him acting. He did a good job though. He interaction between aspirin and strepsil was funny enough. The first 5 minutes of the movie was off da hook!! Michelle shows off her bad a** cop skills. Cynthia shows off some moves at the airport. And then..... THE FINAL SCENE!!!! To tell the truth, I bought the movie because of the final scene. Those 2 ladies were so graceful with the fight scenes at the end. I enjoyed every punch and kick. <br><br>Its amazing how Michelle's dancing skills helped so much with her martial arts training. IMPRESSIVE!!!<br><br>My Overall Judegement: 3.5/4 stars","user":"jrat6200","rank":[6,6]}]