[{"title":"One of the greatest films never seen","rating":24,"date":"24 July 2002","review":"\"The Iceman Cometh\" was part of American Film Theatre, an experiment by producer Ely Landau. The idea was for top-flight casts and creative talent to film classic plays. Then selected theaters would show one film a month, but only on two days (consecutive Tuesdays, if memory serves) before returning to their regular programs until the following month, when the next AFT release would be put up for two more days.<br><br>The program was nothing if not high-tone and ambitious. Productions included Edward Albee's \"A Delicate Balance\" with Katharine Hepburn, Paul Scofield and Lee Remick; \"Lost in the Stars,\" the Maxwell Anderson-Kurt Weill musical based on \"Cry, the Beloved Country\"; Eugene Ionesco's \"Rhinoceros\" with Zero Mostel and Gene Wilder; and Chekhov's \"The Three Sisters\" directed by Laurence Olivier. Unfortunately, the project as a whole was an unmitigated disaster. For one thing, most of the films were uninspired, some were mediocre, and a few were downright awful. But most of all, the whole idea flew in the face of motion picture economics: how could any movie (or live play, for that matter) possibly break even when it ran for only TWO DAYS?<br><br>\nAll things considered, it's a tribute to Landau's skill as a promoter that the AFT managed to limp through two \"seasons,\" 1973-74 and 1974-75, before collapsing in a tangled heap of debts, lawsuits, and countersuits. But collapse it did, and the legal can-of-worms that it left, with the AFT's liabilities mixed with the rights of authors and their estates, is probably what keeps the films out of theatrical circulation and unavailable on video.<br><br>In the case of most AFT productions, truth be told, that's no great loss. But \"The Iceman Cometh\" is head-and-shoulders above all the rest put together (I suspect Landau knew it, too: that's no doubt why he put his best foot forward by making it the premiere production). It is, in fact, a great movie -- a great play with a once-in-a-lifetime cast (it was Fredric March's last movie, and Robert Ryan died even before it came out) under the hand of a fine director (John Frankenheimer) who cut his teeth on live drama during the Golden Age of Television.<br><br>Nobody connected with this film ever did better work -- not Ryan, who was brilliant and deserved a posthumous Oscar nomination for it; not March, one of Hollywood's greatest; none of the supporting cast; not even Jeff Bridges, who was only 23 and just at the beginning of his career (he once said that this was the film that made him realize he was serious about being an actor).<br><br>A special case is Lee Marvin in the pivotal role of Hickey; he was much disparaged by critics at the time, but the tone was one of<br><br>how-dare-this-B-movie-thug-lay-his-unclean-hands-on-a-role-that-belongs-now- and-forever-to-Jason-Robards. Meaning no disrespect, but Robards was hardly infallible; Lee Marvin never did anything as bad as Robards's Brutus in \"Julius Caesar\" (1970). An impartial viewing of Marvin in \"The Iceman Cometh\" shows he was entirely up to the role, even in the demanding, shattering 25-minute monologue where Hickey's self-loathing hypocrisy slips out against his will.<br><br>\nI was lucky enough to see this film twice in a theater -- once on its premiere in November '73, and again in the spring of '75, when Landau tried (in vain) to recoup his losses by giving a general release to selected AFT films. I've never forgotten it, and there are moments as fresh in my mind as if I saw them yesterday: Robert Ryan's anguish when he snarls, \"You think you'll get me to admit that to myself?\" and Marvin replies, \"But you just did admit it, didn't you?\"; Jeff Bridges's tormented profile as he sits at the table with Ryan trying to sort out his life; Fredric March as the doddering saloon-keeper venturing outside for the first time in years; Lee Marvin's ironic little dance as he calls himself \"a happy-go-lucky slob like me.\" All, and so much more, unforgettable.<br><br>I am dismayed to read in another comment here that there seems to be a three-hour version of this film out there somewhere. This would be outrageous enough if the original version were readily available, but since the original is not, it's intolerable. Any cutting of this film (which already judiciously edits O'Neill's original text) can only be a mutilation. Accept no substitutes, and DO NOT watch this film, regardless of its length, if it is shown on TV with commercial breaks. See it ONLY in its 239-minute version, uninterrupted except for the two intermissions O'Neill intended (this was, by the way, the first movie with two intermissions) -- the cumulative power of the play demands it, and a movie this great deserves nothing less.","user":"luannjim","rank":[75,85]},{"title":"The Denizens of Harry Hope's Waterfront Dive","rating":10,"date":"27 May 2007","review":"The Iceman Cometh is one great film to go out on for not one, but two of the best players ever. This turned out to be the last performances for both Fredric March and Robert Ryan. In the case of Ryan he knew he was terminal and his performance has real poignancy.<br><br>Of course you can't beat the material that was given to them and the rest of the cast. It's been argued that The Iceman Cometh is the greatest work from the pen of America's greatest playwright Eugene O'Neill and I'm not going to argue the point.<br><br>Some would give the honor of O'Neill's greatest play to Long Day's Journey Into Night. That particular play was Eugene O'Neill's remembrance of his childhood and family. The Iceman Cometh is also about a family of sorts, the community that's been established around Harry Hope's waterfront bar and SRO flophouse. It's owner Harry Hope played by Fredric March, is a former Tammany politician who's not set foot outside his establishment because he's in mourning over his late wife Bessie.<br><br>The whole usual crowd of boarder/drinkers is awaiting the arrival of one of the regulars who apparently likes to go slumming there. It's Hickey, a gladhanding traveling salesman Lee Marvin who spends like a Diamond Jim Brady and is generally the life of the party. But it's a new and somber Hickey that comes to bar that day.<br><br>A stranger arrives that day also, Jeff Bridges a young anarchist is on the run he says from the Pacific Coast where his mother among others has been picked up. He's looking for an older leader of the movement Larry Slade who is played by Robert Ryan. Ryan is a beaten and tired man and of all the people in the bar he's the one with the most realistic assessment. It's the last stop for this crowd before the Grim Reaper.<br><br>But the somber Marvin, still full of salesman's guile gets them all to reassess themselves and their 'pipe dreams' even for a little while. He also reveals a terrible secret about himself and Jeff Bridges has even bigger cross to bear and Bridges can't bear it.<br><br>I was blown away by the performances of everyone in the cast. Marvin came in for some criticism at the time, attempting to serious a part and one that Jason Robards, Jr. was given acclaim for as his career role. But there was nothing wrong in Lee Marvin's performance that I could find. Young Jeff Bridges more than held his own with the veteran cast. My favorite among the supporting parts is Bradford Dillman who plays a lawyer who graduated from Harvard Law and for whatever reason, broke down and is now here.<br><br>One member of the cast in this production was in the original Broadway cast when The Iceman Cometh premiered on Broadway in 1946. That was Tom Pedi who played the bartender Rocky Pioggi who also doubled as a pimp for some prostitutes who hang out there. Next to Ryan, the women who we don't learn anything about really, seem to have the most realistic ideas about the patrons there. Pedi's performance in a part he grew to own is pretty special also.<br><br>Bridges is the outsider, he had a cause, a revolutionary cause and O'Neill in his youth hung around with that crowd as we learned in Warren Beatty's Reds. We also learned that while O'Neill liked the people he was less than optimistic about the beliefs they had. If Bridges is a failed John Reed, O'Neill in Ryan's character of Larry Slade is looking back over the years when he drank in such places as Harry Hope's. The rest of the cast is no doubt modeled after people he knew back in the day.<br><br>In his own way, O'Neill loved these people a whole lot more than he did his own family. And it's to them and for them he wrote The Iceman Cometh. And it's for us to see a small part of New York in 1912, some folks who might have passed unnoticed by time, but for the fact that a literary genius passed among them.","user":"bkoganbing","rank":[33,36]},{"title":"Remarks","rating":10,"date":"27 October 2003","review":"Can I tell you that I have waited 30 years to see this movie?  When I was in my late teens, I received a brochure in the mail advertising the American Film Theater series. One of the films in the series that made my eyes pop was the promise to show Eugene O'Neill's \"The Iceman Cometh\".  I was a big fan of O'Neill's work, but felt cheated by AFT's disastrous marketing concept of showing it's films to season subscribers only, and then only giving them two days to see the film.  I was forced to take a pass, but mourned my loss ever since.<br><br>This play is rarely performed.  At four hours, it would task most theater companies, and Hickey's 25 minute soliloquy in the last act requires only the best actors to pull off.  I was fortunate to have seen this play, once in my life, performed on the stage.  This was Chicago's Goodman Theater production starring Brian Dennehy as Hickey in 1990.  I felt fortunate, but came away from that production dissatisfied.  Dennehy was a \"good\" Hickey, but not a great one, and the rest of the cast left me a little shallow.<br><br>\nHow glad I was then to discover that this film had been re-released.  By pure chance, I saw a notice in the paper that this film would be showing at the Gene Siskel Film Center in Chicago.  I couldn't let this opportunity pass by a second time.  I attended the screening and was absolutely stunned. It exceeded my expectations.<br><br>First of all, the cast was stellar.   Robert Ryan played his last film role here, and it was perfect.  I don't say something like that very often.  I cannot imagine a better Larry.<br><br>Fredric March played his last role here too, as Harry Hope. Also an excellent performance.<br><br>The question everyone would be asking about is Hickey, played by Lee Marvin. Was he up to the role?  To my surprise, Marvin couldn't have been a better choice.<br><br>Hickey was a salesman, and a rare one at that.  He was the type of salesman that could knock on your door and convince you that what he had to sell was what you needed.  A salesman like that had to exude a sense of complete self confidence.  They would have to be totally sure of themselves and show it.  Lee Marvin did that perfectly.<br><br>The tragedy of Hickey was that he was his own best customer.  He was a tortured soul until he came across a solution that made him feel that he could live with himself again, thus creating his own pipedream.  His mistake was to think he found a solution that would save humanity.<br><br>Unfortunately, in Harry Hope's dive, pipe-dreams and illusions were the only thing the patrons had to live for.  Tampering with that created disaster.<br><br>\nLee Marvin convinced me that he was Hickey, and in a play like this, that is quite an accomplishment.<br><br>By the way, I discovered that this film is now available on VHF and DVD. I am getting a copy.","user":"deannolan","rank":[43,48]}]