[{"title":"An incomparable classic","rating":29,"date":"29 July 2001","review":"After reading some of the negative comments on this film,I felt I must add a comment or two,myself. God bless you,Carl Reiner for taking one of the most laugh out loud novels (By Robert Klane) and turning it into my favorite black comedy classic. My mother,God rest her, was,in many ways very similar to Ruth Gordon's masterful portrayal. While my Mother was still alive,I found many reasons to laugh at some of her shennanagins,especially her treatment of me,and now that she's passed,I have fond,funny memories that if it were not for this film,I'd have spent a lot more time in therapy than I had to. Criticising the film,It's direction,or any of the actor's performences is,to me,ridiculous and can only be a lack of knowledge of the art of acting or cinema in general. Is it the greatest comedy ever produced? No. But it certainly is among the most unique. On newer prints,however,I would avoid the last few minutes of the film,as it does change the overall flavor,and should have ended as it did in it's theatrical releases. Just turn the tape off as you hear the song,\"I Don't want to go like this,so I'll just go like that...\"","user":"clemenza51","rank":[21,24]},{"title":"One of the funniest movies of all time","rating":10,"date":"19 July 2008","review":"I saw this movie originally in 1970. It was a co-feature with a movie called Sunday Bloody Sunday which is what we actually went to see. When this film came on my first reaction was, What the hell! Within minutes I was laughing and the laughs never stopped. I lived in Seattle at the time, but I had grown up in New York City, so the events of the film had a special cache for me. The parts that occurred within Central Park were incredibly funny, and the Taxicab scene is a true classic. I have seen a lot of films in the intervening years and have attempted several time to find a copy of this film (I was finally successful this morning). Despite the years since first seeing it and all that I have seen since nothing has ever topped this film for just plain fun. Carl Reiner is a true comic genius.","user":"gitano1","rank":[9,10]},{"title":"A True Comic Classic!","rating":9,"date":"6 June 2002","review":"The brothers Hocheiser make a solemn promise to their dying father that they will \"never put their mother (Ruth Gordon) in a home.\" But brother Gordon (George Siegel) gets stuck with the old dingbat and she is wrecking his life. His law practice is falling apart, his sex life nonexistent, and he can't even hire a nurse to take care of the wacko. Then, suddenly, a nurse-- the girl of his dreams comes along, but mother has other ideas. This wonderful, creative, hilarious 1970 classic comedy directed by Carl Reiner with its gallows humor could not be made today. We have lost much of our artistic freedom to political correctness, commercial timidity and lack of creative talent. But don't take my word for it, ask Mel Brooks who has remarked that some of his movies could not be made today either. Fortunately we can get the video. The movie does require a somewhat offbeat taste to appreciate. Everything and everyone is in a kind of reality warp, the Hocheiser family, the Central Park muggers, the police, the nurse Louise (Patricia Van Devere). The movie is also comment on life in America in 1970, and on how family members manipulate each other with guilt. Finally, I like the ending the movie was released with, it really does work better artistically. <br><br>9/10<br><br>1970 87 minutes Rated:R CC.","user":"VivienLeighsnumber1fan","rank":[16,21]}]