[{"title":"three rugged mountain men take jobs scouting for the army","rating":8,"date":"17 March 2006","review":"Ordinarily, Anthony Mann made westerns with 'the big guys' - James Stewart, Gary Cooper, Henry Fonda . . . the A list cowboy stars. But in this B+ film, he tackled something notably different and had quite a bit of success with what turned out to be a truly one of a kind western. The main character, played by Victor Mature, is a trapper/ mountain man, and ordinarily they are romanticized in films - Robert Redford in Jeremiah Johnson, that sort of thing, where the hero is not in fact a typical mountain man but a clean cut heroic figure who hangs out with real mountain men. Not here. For once, a true mountain man - vulgar, crude, animalistic - is the central figure, and it's something to see, giving Mature one of his better later roles. The real acting chops are provided by Robert Preston, excellent as a self-absorbed Custer type cavalry commander, and James Whitmore, the poor man's Spencer Tracy, as another of those old timers who feel themselves trapped between ever more hostile Indians on the one side and the oncoming force of civilization on the other. Even more impressive is a very young Anne Bancroft as the officer's wife, who is initially repulsed by the very sight of Mature's grisly character, then finds her own veneer of civilization slipping away as she begins to realize, to her own shock, that she's attracted to him. Rarely if ever has a remote frontier fort been so accurately realized on screen, without the romantic allure that John Ford gave such a place in his masterful Fort Apache. The battle sequences are big scale and notably violent, and particularly impressive if you seen them in widescreen format. Good show, and underrated movie, all around.","user":"dougbrode","rank":[36,40]},{"title":"Succeeds in Spite of Itself","rating":8,"date":"31 July 2003","review":"`The Last Frontier' is a superior western that overcomes numerous deficiencies in weaving its tale of trappers Jed (Victor Mature), Gus (James Whitmore) and Mongo (Pat Hogan) and their relationships with the army, particularly Captain Riordon (Guy Madison), Colonel Marston(Robert Preston) and Corrina Marston, colonel's wife (Anne Bancroft).  Hired as scouts after losing their supplies to the Indians, Jed, Gus and Mungo adjust to living the `civilized' life within a fort on the edge of the `last frontier.' Jed, who has been raised by Gus, both inspires and looks up to the `older' Gus and Mungo, and has an especially difficult time dealing with `civilization.' His real problems start after he becomes strongly attracted to the colonel's wife, Corrina. Colonel Marstonis a reckless man, who endangers every one around him with his dreams of  ruthless victory over any opponent. Corrina, a woman repressed by her station and sense of responsibility, loves her husband for what he could be and Jed for what he is. Caught in the middle is Captain Riordon, a brave and likeable man torn among his duty to the army, his strong friendship with Jed and his fear of the likely disastrous consequences of the colonel's recklessness. <br><br>What makes this movie so interesting (as well as entertaining) is that, in most cases the weaknesses and the strengths of `The Last Frontier' are EXACTLY the same elements (forget the insipid title and dated music)<br><br>First, the screenplay. Almost all of the subplots (particularly, the reckless Colonel) have been done better elsewhere, but have rarely been assembled with such eccentricity.  Just when you THINK you know what is going to happen next, this one takes off in a DIFFERENT direction. POSSIBLE SPOILER:  `The Last Frontier' being a `Production Code' movie (back in the day the word `virgin' was taboo), it's very surprising that the adultery factor was handled in such a mature, tolerant manner. I expected either Jed or the colonel's wife to reap some retribution for their sin. I was surprised and a little disappointed the movie didn't exploit that expectation to create a less predictable ending.<br><br>Second, the casting. Mature is at least ten years too old to play the part of Jed, the wild-eyed innocent raised in the woods'.  James Whitmore, who plays Gus, `the man who raised Jed' is actually five years younger than Mature. Nevertheless, Mature is very endearing, playing a character who is innocent of civilization but is in no way stupid. Although there were several actors who could have played the role at the time (most notably, Burt Lancaster and Kirk Douglas), none could have played Jed better. Preston (also Mature's junior) plays Colonel Marston, missing the tics and affectations one would expect from such a driven man. However, Preston perfectly captures the sense of honor someone must have seen in Marston to promote such a reckless fool to colonel's rank. Bancroft is an especially shrewd choice as Corrina. Bancroft's dark hair has been died blonde, and this achieves the same effect as it did for Winona Ryder (`Edward Scissorhands') and Christina Ricci (`Sleepy Hollow'). That is, I felt conflicted about the character without knowing exactly why; I believe the answer is that blondes and brunettes have considerably different skin tones and eye shades. Further, Bancroft has always projected a toughness that borders on hardness (here the blonde hair softens her up a bit, though). This enables the 24 year old Bancroft to stand toe to toe with both the 40 year old Mature and the 37 year old Preston; yep, she could be a colonel's wife. Madison walks a careful balancing act as Riordan, handling a complex role and sometimes ackward dialogue.Playing a role similar to that of John Wayne in `Fort Apache' Madison does a more skillful job at it.<br><br>\nThis movie has a `Silverado' type camaraderie. That alone makes it worth seeing.  It also has memorable performances, beautiful scenerary and great action and direction. I just hope a letterbox version is available (many have been lost), because this movie takes full advantage of that format.","user":"Bob-45","rank":[21,25]},{"title":"Civilization and Its Malcontents","rating":8,"date":"28 July 2011","review":"Victor Mature plays Jed Cooper, a rough-and-tumble mountain man, ostensibly in need of a few social graces, who, along with his two companions, is hired on as a civilian guide at the local army installation, a fort on the edge of nowhere. He wants two things: a soldier's uniform, and commander Col. Frank Marsden's wife, Corinna (a blonde Anne Bancroft). She isn't altogether turned off. Her husband has been shuffled as far west as possible by the Army to escape his quaint reputation as the \"butcher of Shiloh\". A sizable native army, just beyond the fort, is waiting. Marsden dismisses them as stupid savages with no concept of military strategy, then falls into one of their bear traps.<br><br>\"The Last Frontier\" is about civilization and what it means to be civilized. Jed is an outsider and he wants to belong. For him, to be civilized is to wear a uniform and to attain domesticity. He grapples hard with this civilization thing and learns that there are some confounding complexities. Col. Marsden flaunts the veneer of civilization, but he's a rule-toting bully.<br><br>I've probably said too much already, but I love the dry, adult westerns of Anthony Mann. For all his tackling of a complex theme Mann doesn't forget the action scenes. The climactic Indian attack is exciting, with the dust that's whipped up providing a nice visual touch, and Jed's one-on-one fight with a Marsden flunkie is raw and brutal. The fort in this movie appears to be authentic and detailed, and we get to see its layout. Victor Mature's performance as a rough frontiersman is well realized and convincing, a far cry from the oiled-up Samson wrestling a stuffed lion in a certain Cecil B. De Mille soaper. A special nod to Guy Madison for his portrayal of a sane, all-round nice guy. This is hardly a \"lesser\" Mann picture. It's up there among his best.","user":"rpvanderlinden","rank":[13,16]}]