[{"title":"\"Guess you didn't hear the lady....did you boy?\"","rating":16,"date":"16 July 2004","review":"Coogan's Bluff ranks as one of my favorite Eastwood films. Partly because of the time period &amp; location which the story takes place. It's an excellent period piece. Late 1960's New York city in all it's Glory. I live in NYC and it's was nice to see the Pan Am Building in the backdrop. It's now the Met Life building. The Pan Am building was also the location of the final scene where the helicopter takes off. <br><br>The other reason I like this movie is that Eastwood is essentially playing Dirty Harry before Dirty Harry. Coogan is just like Harry Calahan without the 44. magnum. The story is solid but it's the locales and the  situations that Coogan finds himself in that sell the movie. Who cares of it's dated? Of course it's dated but that's part of the experience. Actually most movies made more than 20 years ago (or less) are dated. If you look at it in the context of the time it was made then you'll enjoy it. Ignore the negative reviews and check it out.","user":"Nic_hse","rank":[61,69]},{"title":"A smart career move for Clint","rating":21,"date":"21 August 2002","review":"Clint Eastwood has always been one of the most career-savvy superstars of all time.  Looking over his filmography, since his career breakthrough it is obvious he has never done a film strictly for the money and has solid reasons behind every film he has made.  Even his worst films have a purpose: \"The Rookie,\" for instance, which most people would agree is a career low, was obviously made to satisfy the brass at Warner Bros. by delivering a modern-day Dirty Harry clone so he would be left alone to work on his Academy Award-winning classic \"Unforgiven,\" which came out two years later. So it is with \"Coogan's Bluff,\" which most viewers would probably dismiss as second-rate Eastwood, but in reality served as a savvy bridge from Westerns (the type of genre he was primarily known for at the time) into more modern day roles.<br><br>As directed by his mentor Don Siegel, \"Coogan's Bluff\" actually opens in the Arizona desert, which strongly resembles the background of his spaghetti westerns.  Indeed, the first character we see is a loincloth-attired man, who appears to be Indian, so the audience is tricked into thinking they're watching a western.  Then, we see a jeep driving down a dirt road, with a stetson-wearing Clint at the wheel.  He is Dept. Sheriff Coogan, and there we see our first view of Clint as a modern lawman.  It isn't long before he's in New York City, chasing down an escaped extradited criminal (Don Stroud), romancing a beautiful parole officer (Susan Clark) and butting heads with a strong-willed police captain (Lee J.Cobb, a terrific, yet sadly forgotten character actor of the day).  Therefore, in a matter of fifteen minutes, Siegel cleverly introduces Eastwood as a contemporary figure, a transition that will be complete when he returns to modern times three years later in his most famous role, \"Dirty Harry\" Callahan.<br><br>But \"Coogan's Bluff\" is an enjoyable film on its own terms.  Eastwood at times is very funny here--his retort to an unethical cab driver is priceless--and the film moves along at a brisk pace.  Just don't expect action galore or a high body count.  Clint doesn't kill anybody here; there's no broad conspiracy or mystery to solve; his job is simply to find the prisoner and take him home.  In fact, the film is at its best when its dealing with Coogan as a fish-out-of-water, dealing with various New York thieves, crooks, drug dealers, hippies, and the aforementioned cab driver. There is, however, a well-choreographed fight scene in a bar and an exciting motorcycle chase for a climax, but that's as much action as there is.  It's also pretty short for an Eastwood film:  where most of his films run over two hours, this one clocks in at a brisk 94 minutes, next to \"Joe Kidd\" and \"The Dead Pool,\" one of his shortest adventures.<br><br>So there you have it, a \"minor\" effort that served a \"major\" purpose in what has become an important Hollywood career.  *** (out of *****)","user":"jimu63","rank":[57,66]},{"title":"\"Nobody Calls Me Mister With My Boots Off\"","rating":6,"date":"24 July 2009","review":"Coogan's Bluff marked the first of six films that Clint Eastwood was to do with director Don Siegel, the most famous of them being of course Dirty Harry. The film will also contain no shots of the former location of the legendary Polo Grounds which were at that spot on Manhattan island. <br><br>Clint Eastwood's charisma is what carries this film through because he's playing one of the most dislikeable characters he ever essayed on the right side of the law. He's a deputy sheriff from Piute County, Arizona who has his own way of doing things. When we first meet him instead of following sheriff Tom Tully's orders and staying at a roadblock, Eastwood follows a hunch and captures fugitive Indian Rudy Diaz in the inimitable Clint fashion.<br><br>That he got the man doesn't cut it with Tully. He sends Clint on assignment to New York to extradite Don Stroud wanted in Arizona. When he gets to New York, Stroud is in Bellevue Psych Ward. There are procedures to get him out says Police Lieutenant Lee J. Cobb, but Clint cuts through them and while Stroud's in custody, he effects an escape.<br><br>Seduce them for clues is Eastwood's investigative technique as he works on parole officer Susan Clark and Stroud's girlfriend Tisha Sterling. Tisha proves to be a formidable adversary and bed partner, yes she's both. Tisha's pretty unforgettable as the amoral hippie chick from the era.<br><br>Also unforgettable is Betty Field in what proved to be her final big screen role as Stroud's tramp of a mother. Clint doesn't quite have to get down and dirty with her, but I think he would have been up to it if needed.<br><br>A lot of attitudes that were later exhibited in Dirty Harry are in Coogan's Bluff. Walt Coogan has the same attitude towards criminals and the rules that prevent him from dealing with them as he'd like.<br><br>Some nice location shots of New York, including an unforgettable chase scene through Fort Tryon Park in the upper reaches of Manhattan. Not as good as some of Clint Eastwood's other films, still Coogan's Bluff is a must for his fans.","user":"bkoganbing","rank":[21,24]}]