[{"title":"The Five Venoms get caught up in a civil war","rating":7,"date":"7 August 2001","review":"KILLER ARMY (1979) is one of the better entries in the series of films starring the five actors-martial artists collectively known as the Five Venoms (from their first film together, FIVE DEADLY VENOMS). It's a lavish historical kung fu adventure shot entirely on the sprawling studio sets of the Shaw Bros. Hong Kong studio. It has a strong script, excellent performances and an abundance of kung fu action featuring the three most colorful of the Venoms.<br><br>Set during a time of civil war in China, it focuses on the adventures of three refugees (played by Kuo Chui, Chiang Sheng, and Lo Meng) who manage to get jobs, thanks to their kung fu skills, at a time when most refugees are brutalized by the various military and civil factions ruling the city. The emotional tone is set at the beginning as we see hordes of bedraggled and hungry refugees enter the city only to suffer the cruel whims of nasty and rapacious guards. We first meet one of the hero refugees, Kuo Chui, as he hides under a restaurant table eating stolen chicken and fights off the guards who catch him.<br><br>Later, when an army colonel is killed and the blame put on the three refugee heroes, the various factions scour the city searching for the three. One faction, the martial unit, believes the refugees' story and breaks with the other factions to shelter them. When a female brothel worker is forced to lure the three into a trap, the stage is set for a sprawling final battle amidst large sets representing the courtyards and dock areas of the city. Four of the Five Venoms are involved in the battle, along with various sword- and spear-wielding opponents.<br><br>The three main performers, Kuo Chui, Chiang Sheng and Lo Meng, are all superb fighters and fine actors. The fight scenes are as good as any Venoms fights I've seen, with lots of straight kung fu as well as assorted weapons work including Kuo Chui's expert use of a three-section staff. The remaining two Venoms, Lu Feng and Sun Chien, play the leaders of different factions and do a relatively small amount of fighting. They are joined in the villain department by frequent Venom co-star (and unofficial 6th Venom) Wang Li. Overall, this is a must-see for Venoms fans, although the current version in regular distribution in the U.S. is missing about 12 minutes of footage.<br><br>ADDENDUM: In 2006, Celestial Pictures (HK) released a restored and remastered edition of this film on Region 3 DVD under the film's original title, THE REBEL INTRUDERS, in Mandarin with English subtitles. The film's running time on this DVD is 95 min., which is 8 min. longer than the Ground Zero VHS edition cited above.","user":"BrianDanaCamp","rank":[5,5]},{"title":"\"The Rebel Intruders\" aka \"Killer Army\" - Passable Venom Flick","rating":6,"date":"31 October 2006","review":"Most of the Venoms, minus Pai Wei (Snake), reunite for this convoluted gang action film. A lesser effort from Chang Cheh and the Venoms who apparently choreographed their own fight scenes if the credits are to be taken seriously.<br><br>The movie starts with scenes of refugees pouring into the city as a warlord from the north makes his way into southern China. The southern warlord through his general puts the local kung fu gangs in charge of keeping the city in order and making sure the refugees stay in line. Played by Lu Feng, the top gang leader puts the other three gangs in charge of the different directions in the city. Each gang has a kung fu specialty, one does \"Fast Swords, another \"Sword and shields\", another \"Iron Fist\" which is a strange small fist shaped club and finally the very odd \"rubber spring\" Spear. The next ten minutes is devoted to depictions of torture or compassion towards the refugees by the gangs. That out of the way we finally meet the heroes, Phillip Kwok, Lo Meng and Chiang Sheng. All refugees they immediately get into fights with the gangs but are rewarded with jobs for their good kung fu. The movie ambles along with an extended fight scene in a gambling house. Finally the plot kicks in as the gang leader decides to double cross the southern warlord, kill the southern general and blame our heroes for the deed. Our heroes escape but have to pass each gang before they can get to the safety of Mr. Deng, played by Sun Chien, a kindly gang leader.<br><br>The plot is no great achievement, it's rather standard for Chang Cheh films for this period. The interesting refugee angle is swept under an unremarkable gang story. The earlier \"5 Deadly Venoms\" or \"The Crippled Avengers\" have much better plot lines. The fight scenes are elaborate and contain a lot of the Venom action you want, however the choreography is erratic. Phillip Kwok is very good and is usually fighting with a bench of some sort or a three section staff. Lo Meng is his usual hard fighting style. Chiang Sheng does his usual acrobatics but doesn't really get going until the finale. The action is good but doesn't come close to the inspired fighting in 'Crippled Avengers\". Many scenes seemed to be written to showcase some fighting gimmick, like ropes or the mentioned rubber spears. Overall the pacing of the film is stiff with too many scenes waiting for the costumed gang members to walk across the shot and get into another standing position. There is some classic Cheh style gore for those who care.<br><br>Good for the Venom action but not much else.","user":"ChungMo","rank":[3,4]},{"title":"\"Killer\" ensemble...","rating":10,"date":"15 August 2011","review":"Both figuratively and literally, the opening scenes of KILLER ARMY/THE REBEL INTRUDERS are dark: starving refugees fleeing some warlord's heavy-handed politics are snatched up off the streets and subjected to some Bush-Cheney-Rumsfeld \"enhanced interrogation\" techniques (the end result of which is death, of course). When Kuo Chui finds himself among a group of starving refugees being routed by soldiers as they try to feed, he quite literally turns the tables on them, nimbly using a bench as a weapon. He flees to a brothel, where he's offered a job by the \"head mistress.\" Meanwhile, Meng Lo ducks into a kung fu school doorway to get out of the rain and is accosted by a pair of students- who he proceeds to enlighten. Needless to say, he's hired on as an instructor (at one point, it's mentioned that he's a praying mantis stylist). Chiang Sheng, our third protagonist, gets caught tossing stolen food over a wall and is forced to display his amazing acrobatic skills. The owners of the gambling den from which he pilfered the food decide to hire him. The three hook up, of course, and become blood brothers by drinking a broth of their mixed blood. Our heroes get framed for murder and some great action ensues. There are some genuinely suspenseful scenes of soldiers and local gangs searching the streets at night in search of our trio. Still more action ensues. In the hands of someone like Kuo Chui, the three-sectioned staff is a thing of beauty on screen; and Chiang Sheng's nonstop tumbling and leaping and pin-point precision swordplay, not to mention Meng Lo's superb hand-to-hand combats, make for a rousing finale as the default rebels must fight for their lives. (The version I saw was clearly edited, but was still spectacular.) Highly recommended.","user":"poe426","rank":[2,3]}]