[{"title":"The best classic underwater Sean Connery's Bond film my all time favorite","rating":10,"date":"17 November 2017","review":"This is the best Bond with Sean Connery his fourth film. It is my second favorite James Bond 007 Sean Connery film. This is my all time favorite Bond film. It has everything: great villains, awesome gadgets and beautiful women. It is Connery at his best. The first one will always be Goldfinger this one will be the second one. Underwater Bond seriously one of my favorite James Bond 007 film from Sean Connery I grew up watching this movie even as a kid. This movie is underwater Bond seriously a classic one of the best Sean Connery films ever. I love Goldfinger to death this movie in my opinion is a classic! It is really, really a good movie I have enjoy it every minute. It is a fun film I only wish it wouldn't have been so long.<br><br>Thunderball (1965) the fourth James Bond 007 film and the fourth Sean Connery film. Seriously this movie is my second favorite Sean Connery film I had a blast with this film. It is in my top 10 James Bond films.<br><br>The film follows Bond's mission to find two NATO atomic bombs stolen by SPECTRE, which holds the world to ransom for £100 million in diamonds, in exchange for not destroying an unspecified major city in either the United Kingdom of Great Britain or the United States of America (later revealed to be Miami). The search leads Bond to the Bahamas, where he encounters Emilio Largo, the card-playing, eye patch-wearing SPECTRE Number Two. Backed by CIA agent Felix Leiter and Largo's mistress, Domino Derval, Bond's search culminates in an underwater battle with Largo's henchmen.<br><br>This movie is awesome it is real Bond film I have enjoy it. SPECTRE's Number Two has a house in which he has two poles. One pole is empty the second one has sharks in it. In which he push the button and kills one of his informants sharks eats him. You have in the beginning scene in which James Bond kills Colonel Jacques Bouvar, a SPECTRE operative.<br><br>Bond uses for a escape a jetpack. We see a jetpack in this movie. SPECTRE's Number Two and his henchmen hijack the plane and they put it right above the sharks. Movie reminds me on Deep Blue Sea I love movie about Sharks I love them. That is why this movie is so interested. Bond goes to Nassau for searching two stolen warheads. Here he meets sexy babe girl Domino Derval (Claudine Auger) in which he later reveals to her that her brother is dead and he was ordered by Emilio Largo (Adolfo Celli) to be killed now she want's revenge and she helps Bond to recover those two stolen warheads. She later kill's Largo with a harpoon. There is another girl Fiona Volpe (Luciana Paluzzi) who is a SPECTRE agent and she follows James Bond around. There is another girl Paula Caplan (Martine Beswick) Bond's CIA ally.<br><br>The movie has a huge impact on me it has incredible underwater scene including climatic action packed battle between US Air Force and Largo's henchman. James Bond has much more to do then in the first two movies.<br><br>Adolfo Celi as Emilio Largo SPECTRE Number Two was a bad-ass he was actually really more smart then Dr. No. He was a great villain I miss movies like this. He had a two poles one with sharks and one without it. He had a yacht and the hatchet how could they all steal nuclear warheads.<br><br>Claudine Auger as Domino Derval Bond's girl was a sexy hot beautiful babe I miss girl's like this. Bond had such a luck to find such a babe. She wanted revenge when she find out Largo killed her brother François (Paul Stassino). She was more French but areal classic babe.<br><br>Fiona Volpe's introduction while wearing a sheer negligée in Derbal's (Paul Stassino) bedroom was definitely an early highlight of \"Thunderball.\" Luciana Paluzzi is a very sexy ruthless villain Definitely one of the better female characters in the series. We also see a motorcycle launching a rocket-propelled grenade to kill Lippe and it was Fiona Volpe as masked rider driving a motorcycle.<br><br>I love the sequence in which Fiona and her henchman kidnap Paula and Bond goes to SPECTRE Number Two's house to save the girl but he find's her dead. Then he flee's from his house and he battle's Largo's henchman they both fall's in to the pool in which Largo shout's the door and he let's shark's from the second pole to eat Bond and his men of course Bond kill's him and he escapes sharks.<br><br>You have a great explosion in which marines destroy the yacht. Reall practicable effects. The underwater scene really never bothered me like some other people did.<br><br>I love this flick to death it is my second favorite Sean Connery's Bond films. Sean Connery him self was a classic Bond he was really the best of this film. When he was in clinic and Nassau he was a bad-ass.<br><br>Thunderball is a 1965 British spy film and the fourth in the James Bond series to be produced by Eon Productions.<br><br>10/10 I love this film to death even as a kid it was guilty pleasure of mine.","user":"ivo-cobra8","rank":[95,122]},{"title":"\"I hope we didn't scare the fishes.\"","rating":8,"date":"6 September 2004","review":"Out of the 20 official entries of the James Bond series (to date) \"Thunderball\" is often mentioned as 'the underwater one' and for a very good reason. It had big shoes to fill since the previous year's \"Goldfinger\" became a box-office phenomenon across the world. Although Thunderball was even more successful, there are debates on weather or not it was a better film. In this fan's opinion, it was. <br><br>Picking up after the most unusual pre-titles scene featuring MI6 secret agent James Bond meeting his match with a man in drag and escaping in a jet-pack, \"Thunderball\" features the most generic (and parodied) Bond plot: The international terrorist organization SPECTRE, led by a mysterious unseen cat stroking leader, hijacks two nuclear bombs for a huge extortion plan. James Bond (Sean Connery) is sent to Nassau where Domino Derval (Claudine Auger), the sister of the pilot who appears to be responsible for the theft, resides with her wealthy and older husband Emilio Largo (Adolfo Celi). Bond eventually finds out Largo himself is the eye patch wearing SPECTRE #2 and he is in charge of the nuclear warheads. Will he survive Largo's squad, including lethal assassin Fiona Volpe (Luciana Paluzzi), and a tank of sharks? <br><br>\"Thunderball\" is directed by Terence Young picking up after Guy Hamilton from the previous film. Young, who directed the first two films of the series, is certainly one of the most important filmmakers of the Bond saga. In the hands of some hack, \"Thunderball\" could have easily been an overlong boring disastrous attempt, but Young fills the screen with the same thrilling charm and glamour that made the first two Bonds so unique. The most cinematic of all Fleming novels, the movie is quite faithful to its source material while adding some welcomed changes (the character of Fiona Volpe for example) an therefore making it a more entertaining movie-going experience. <br><br>The action is mostly underwater and that is what usually divides fans of the series since some find them sleep-inducing. The special effects crew was awarded with a Best Special Effects Oscar in 1966 and for a very good reason. The film's extensive use of underwater photography was quite breath-taking for it's time. And the visual effects themselves are quite impressive, especially the explosion featured in the climax which shattered many windows in Nassau. Thunderball is based mostly on thrills than stunts, which is something recent Bond films should start to concentrate on. It is all well orchestrated to one of John Berry's most memorable contributions to the Bond saga. The '007 theme' is used at its best during the action sequences, especially during the climatic fight at Largo's yacht. The theme song, sung by Tom Jones, is one of the most memorable tunes of the series, although I prefer the original unused song \"Mr. Kiss Kiss Bang Bang\".<br><br>Two usual standards of the series, villains and girls, are both filled quite successfully. Adolfo Celi is one of the most parodied villains (eye patch anyone?) but his portrayal of #2 is incredibly fun to watch. He is indeed a one-dimensional character, but a very memorable one. Claudine Auger is one stunning-looking woman and her acting skills are above average for the time. She is one of the most likable Bond girls around and her lack of clothing makes her quite heir apparent to Dr. No's Honey Rider in terms of sexiness. But Luciana Paluzzi steals the show with Fiona Volpe. She is the first Bond girl to stand up to the agent's charms (Pussy eventually gave up) and the psychotic look of rage in her eyes responding to Bond's macho insult is particularly memorable: 'But of course, I forgot your ego, Mr. Bond. James Bond, the one where he has to make love to a woman, and she starts to hear heavenly choirs singing. She repents, and turns to the side of right and virtue... (she steps on Bond's foot)... but not this one!' Volpe stands second only to Xenia Onatopp among the sexy girl villains.<br><br>This is the last time we see Connery at his best portraying 007 before he was eventually bored with the in later entries, particularly in \"Diamonds are Forever\". He indeed shows why he is considered by most fans to be the best among the Bonds. He has amazing screen presence and a suave charm of a sophisticated playboy that just makes every guy want to be him and every girl want to be with him. <br><br>One of my personal favourites and certainly on my top five, \"Thunderball\" is one of the most well rounded Bond adventures to date. Exotic locations, beautiful women, battle sequences, gadgets, suspense, terrific music, and a memorable villain add up to the best of the \"popcorn\" Bond movies. Terrific entertainment!","user":"fdpedro","rank":[53,69]},{"title":"We've got ourselves a Broken-Arrow, James Bond style","rating":7,"date":"13 December 2004","review":"Thunderball is the fourth entry in the ever ongoing James Bond franchise and in my opinion one of the better installments. This film features the secret services arch-enemy SPECTRE and I must say that in this episode of James Bond adventures it works better than in From Russia with Love. What I liked about this film, was that there were a lot of good one-liners from Connery, that there weren't too many goofy stunts / henchmen / gadgets and that the film was able to maintain exciting throughout. I've read quite a few comments stating that the underwater scenes dragged on too long, but I must say that I felt even that bit to be quite entertaining and thrilling. I actually have only one criticism and that regards the ending. I felt that the whole out-of-control boat thing was really stupid. I mean I understand that they tried to make it look spectacular, but in using the same technique they used to buff up the fistfights, they made it look cheesy and cheap. Luckily this is just one short moment in the film and the film is not ruined by something as a dreadful character or a bad actor. All in all this is one of the better Bond films and well worth watching if one sets out for 2 hours of pure adventurous entertainment with a standard-formula story.<br><br>7 out of 10","user":"stamper","rank":[37,47]}]