[{"title":"Take the \"Day Off\"...","rating":10,"date":"6 September 2000","review":"Before all the slapstick, before re-writing \"Home Alone\" umpteen times and before selling his soul to \"Disney Pictures Inc.\", John Hughes was believed to be THE scribe for teen angst. <br><br>He wrote eloquently of it in \"Sixteen Candles\", \"The Breakfast Club\" and \"Pretty in Pink\". And with \"Ferris Bueller's Day Off\", he creates a person and a time in life that just about anyone who's ever been a teenager can relate to.<br><br>Who hasn't known someone like Ferris Bueller (Broderick)? Someone who always has a plan, someone who made loafing off an art form, someone who could fall in a barrel of you-know-what and come out smelling like a rose?<br><br>All he wants to do is take a day off from school and enjoy the day in Chicago - simple enough, but he must also try and convince his best friend Cameron (Ruck) and his best girl (Sara) to join him and, in the process, learn to enjoy what life has to offer.<br><br>Naturally, there is a tyrannical school dean (Jones) who is determined to catch Ferris in the act of hookey and Ferris' own sister (Grey, pre-nose job) who has it in for her brother, the \"trouser-snake\". <br><br>There are funny situations throughout the movie, and the characters are ones that grow on you, especially Ruck's worry-wart portrayal of Cameron Frye, constantly fretting about his dystalic, cursing his father and nearly drowning in a pool, all in the name of friendship.<br><br>Sara has less to do, but she plays the object of desire well, and Ferris' passion for her is understandable. At least he thinks about the right things, like what their lives would be like after high school.<br><br>All the way from beginning to end, this movie is a great trip in search of fun, relaxation, not taking life too seriously and how to sing Wayne Newton songs in the middle of a parade. <br><br>You want to catch vintage John Hughes and classic '80s teendom at its best? Seize this \"Day\"!<br><br>Ten stars for \"Ferris Bueller's Day Off\".","user":"Mister-6","rank":[192,234]},{"title":"Not just a classic of the 80s, but of any decade","rating":8,"date":"9 April 2003","review":"Matthew Broderick looked so brilliant in those days. While this film single handedly made him Ferris Bueller forever, at least this is a film that can be seen all throughout the years without dating too badly. Sure, the music and props will signify a time of discontent and bad hairdos, but the idealistic look of a man simply wanting to ditch school has never been made more daringly and charmingly. <br><br>Everything about this film was gold, from the postmodern \"conversations\" with the audience to the little back stories which seem to shape the overall canvas of the film. While Alan Ruck was way too old to play in this movie, at least he proved to be a great opposite to the cool and nonchalant Ferris. Gross-out comedies may now be the norm, at least we can look back to this film and enjoy a good, genuine laugh.","user":"Agent10","rank":[152,197]},{"title":"Not just one of the best comedies of all time, but one of the best movies PERIOD","rating":10,"date":"5 November 2003","review":"My friends knowing that I'm a huge film buff asked me to come up with a list of my favorite movies of all time, when it came down to number one, there was one film that stood out in my head that I knew I could watch over and over again and never get sick of: Ferris Bueller's Day Off. One of the best comedies of all time, Ferris Bueller is a movie that just stands the test of time. How anyone could not love this film is beyond any of my understanding, Ferris Bueller is my hero among many others. John Hughes is usually remembered more for The Breakfast Club, which is an incredible movie as well, but I think this was his masterpiece. He said in an interview that this was his childhood, getting his wife and best friend and skipping out on school to go down town and just have a good time. If you are a Chicago citizen, you've pulled a Ferris Beuller's day off too, it's like a law here, lol, if you haven't, I pity you. The reason that this movie works is because of it's outrageous story that everyone wants to live, Matthew Broderick, there was no other choice, he is who everyone wants to be: Ferris Bueller.<br><br>Ferris Bueller is a teenager who fakes out his parents on being sick, even though it is his worst performance of being ill, somehow it works and his parents let him stay home. He takes the gorgeous day outside, takes his really sick best friend and his girlfriend and goes into beautiful Chicago for a blast of good times. I'm not kidding fellow Chicagoians, this is the best Chicago movie! Ferris has two problems though, his principal who is sick of being made a fool of and decides to bust Ferris on his fake illness. And his sister Jeanie, who cares more about Ferris's life than her own and just wants to prove that he's faking it.<br><br>Even though, you have to admit that it's a bit unrealistic that it is broadcast throughout Chicago that Ferris is \"dying\" and no one notices that he's singing in the Chicago parade, on a field trip to the Art Institute with an elementary class, getting \"snootie\" with a waiter at Chicago's finest restaurant, and catching the Cub's home run ball at Wrigley Field, you just have fun and cannot stop laughing. Plus you have got to love Edward Rooney, the obsessed principal who is actually sicker than Ferris in one way of putting it. He goes through the whole city to find him just so Ferris doesn't make a fool of him, but he fails on all levels because Ferris is just that awesome. The scene between him and Grace when Cameron prank calls to get Ferris' girlfriend out of school is just too hilarious and will have you in stitches. I don't know what else to honestly say other than this movie is the best comedy to watch if you are looking for a great laugh. So sit, back and enjoy because \"life moves pretty fast. If you don't stop and take a look around once in a while, you might miss it\"; my philosophy. I will love Ferris Bueller till the day I die.<br><br>10/10","user":"Smells_Like_Cheese","rank":[168,219]}]