[{"title":"A true delight","rating":6,"date":"6 December 2003","review":"You know, this is one of those grossly underrated, wonderful treasures of a movie. It's rather simple, with the fanciest effects being the movement of the toy soldiers, which was ahead of its time, but it's a true case of simple is beautiful. It's a fantastic movie for those who just wish to sit back, and laugh with the family, and have an adventure in fantasy land. The play is still being put on around the world, and this, to me, is just the best captured version. There's really something for everyone - Ray Bolger ( who looked really spectacular, very handsome in his role as Barnaby), Annette (who is always charming for being the sweetheart we all know), Tommy Sands as the daring hero, and the team of Henrey Calvin and Gene Sheldon, along with the forever amusing Ed Wynn. This movie turns out more of a comedy, and the adventures that encompass Mary and Tom Piper, when crossed by Barnaby, double crossed by Gonzorgo and Rodrigo are hilarious. This is primarily a Christmas movie, but it's set so you can watch it anytime of the year - and so you should! I still cannot get over Ray bolger as a villian....he does a lovely job, and looks terrific, but if you only know him as the scarecrow, you'll especially need to see this! He makes the statement relavent that he is very, very, very versatile, and one of our greatest entertainment treasures.","user":"silasbarnabyandpattiecat","rank":[18,18]},{"title":"I still love it. . .","rating":11,"date":"11 June 2000","review":"I can remember watching this movie over and over when I was little-- of course, as the years went by I eventually taped over it. Well, when I finally grew out of my \"I'm too cool for this movie\" phase, I regretted my hasty decision. Luckily, last night it was on in the middle of the night on the Disney Channel and I practically programmed the VCR with lightening speed. I still love it, and I always associate certain scenes with certain memories, and now that I'm older I understand what is going on a little bit better (not to mention some of the jokes that flew right over my head when I was four!)! If you don't watch it for yourself, you're kids'll love it. Believe me, I know!","user":"Jade-16","rank":[7,7]},{"title":"A good effort and great special effects and music","rating":22,"date":"22 February 1999","review":"This is a film that cries out to be seen on the big screen.  As a child, I saw this in the theater, and the color just dripped off the screen.  With the magnificent soundtrack and wonderful special effects, it was a special event.  However, on the small screen it does lose something of its effect, but it's still a good movie.  The scene where TomTom has been shrunk, and takes his revenge on Barnaby by losing the wooden soldiers on him still gives me goosebumps.<br><br>Probably better for younger children, I still wouldn't miss this film.","user":"Marta","rank":[11,13]}]