[{"title":"Nobody makes films like Henry Jaglom","rating":6,"date":"14 September 2005","review":"My feeling for Henry Jaglom's movies made in the eighties is most definitely ambivalent. While they are somewhat intriguing, they are also annoying. \"Someone to Love\" is a prime example. As with other works of his, Jaglom tends to use lovers, friends and acquaintances who are then afforded the opportunity to reveal their psychological makeup in thinly disguised characters. His preferred method is the talking head closeup.<br><br>Jaglom was fortunate enough to count Orson Welles as a personal friend, (he named his son after him). In \"Someone to Love\" Welles is allotted a couple of minutes of riveting screen time. It's only then that the movie really comes to life. The problem is, as always, Jaglom's characters are far less interesting to audiences than they are to him. One finds oneself not really caring too much about their problems in making lasting relationships, the central theme of the movie.<br><br>The most praiseworthy aspect of Jaglom's career is that he actually managed to emerge from this lengthy self indulgent phase and began making movies with a far wider scope. (\"Last Summer in the Hampton\" and \"Déjà vu\", his finest work to date.) Welles mentions that nobody makes movies like Jaglom. He is right, but that can be construed negatively. While Jaglom is notoriously self indulgent, there is a redeeming honesty and lack of pretentiousness in his artistic motives.<br><br>Music enthusiasts (of albeit lesser known performers) will enjoy short interludes performed by Stephen Bishop, Dave Frishberg and Andrea Marcovicci.","user":"grahamclarke","rank":[11,13]},{"title":"A final bow for a grand theater and for Orson Welles","rating":10,"date":"3 May 2001","review":"In the waning days before the demolition of the Mayfair Music Hall in Santa Monica, California, the brilliant and unconventional director, Henry Jaglom, created this unique film featuring the final screen performance of Orson Welles, and utilizing Jaglom's customary methods of actor improvisation coupled with perceptive editing, with the result being a moving tour de force of romantic sensibility.  A gathering of single entertainment types meets by Jaglom's invitation at the theater on Valentine's Day, sharing perceptions of relationship success and failure as the director's powerful sense of angst rises to the surface with the camera being his investigative companion.  Acting honors shall go to Sally Kellerman, whose performance explores most deeply of all her self-awareness of vulnerability and emotional need, and to Andrea Marcovicci, who plays a part as Jaglom's current love, and who sings beautifully as well, and as always.  Jaglom's output has been remarkable because of his steadfast determination to create genuinely independent cinema and SOMEONE TO LOVE is a prime example of his talent for showcasing a personal point of view in such a manner that it touches upon the universal.","user":"rsoonsa","rank":[14,19]},{"title":"Great Welles, Mediocre Jaglom","rating":6,"date":"2 July 2008","review":"Orson Welles is the standout in this film and is the only reason to see it. He sits in the \"cheap seats\" in an almost empty theater and spouts off some great wisdom about life and sex and movies, and just about everything. If you are an Orson Welles fan this is something to check out, to watch a few times for his final bow. Jaglom on the other hand is a bit pretentious (he tries to be very deep-cute like the sensitive guys of the seventies and eighties, Alan Alda, etc); in other words, everything else that isn't Orson Welles is sort of a navel-diving-exercise that falls flat after a while. None of the other participants (Jaglom invited a bunch of lonely people to describe why they would be alone on Valentine's day, which was a week away) have anything deep or worthy to say about why they are alone or about life, etc. Jaglom's real life brother Michael Emil plays the \"villain\", that is, he is an non-artistic businessman who thinks the theater full of people are just whiners, and I agreed with him most of the time. But Orson alone makes this movie worthy. Or at least, somewhat interesting.","user":"HoBopkins","rank":[6,7]}]