[{"title":"Stands the test of time...","rating":9,"date":"22 June 2003","review":"I feel one of the true tests of a good movie is how it holds up over time. Can't believe it has been 18 years since I first viewed this little gem, and it was as good today as in 1985!  Among other reasons, the Holmes and Watson characters were obviously cast for their youthful likeness to the characters in the old Basil Rathbone series of movies.  Take a good look!  This a wonderful penning of the proposed early days of the two and a very original concept.  Probably only true Holmes officiandos will see some obvious references to the adult Rathbone character, and these add to the cleverness of this version. Make certain to stay 'til the end of the credits; Sherlock Holmes fans will receive an ingenious clue to the his \"future\".","user":"equipage","rank":[35,38]},{"title":"Elementary Good Fun!","rating":2,"date":"2 June 2001","review":"What if Sir Arthur Conan Doyle created a story where Sherlock Holmes and Dr. John Watson met as adolescents?  What if he made it a very suspenseful mystery that explanied may of the great sleuth's character traits and stylistic characterisics?  What if...well, he did not, but screenwriter Chris Columbus, director Barry Levinson, and producer Steven Spielberg do bring us a fine film that does these things called Young Sherlock Holmes. Young Sherlock Holmes is the meeting of fantasy film and classic literature, and it is a meeting that coexists very nicely.  The great detective meets his future colleague and friend Dr. Watson in a London prep school amidst the mystery of what six men did many years ago in Egypt.  Several of the men begin to die in horrible, inexplicable ways, and the young Holmes suspects mischief.  The film is a veritable treasure trove of Sherlock Holmes allusions.  The film is fast-paced, fun, fantastical, and creates insights into why Holmes developed emotionally the way he did.  Nicholas Rowe does a superb job playing Holmes, bringing to the role intelligence as well as compassion.  Alan Cox does an equally good job playing his young sidekick and doctor to be.  The special effects are first-rate, yet in no way detract from the Victorian world of Doyle and Holmes and Watson.  Start watching and it will not be long before you'll be saying, \"The game is afoot!\"","user":"BaronBl00d","rank":[33,37]},{"title":"Very Good Movie","rating":10,"date":"29 November 2002","review":"Young Sherlock Holmes was one of the best movies I saw when I was a kid and it amazes me up to this day.London was pictured perfectly by Barry Levinson with the help of course of Stephen Goldblatt (the cinematographer). The spcial effect by ILM was brilliant and they were the milestone of the special effects of today.The music of Bruce Broughton is one of the best of the 80's. The acting is good for this kind of film, not bad but not brilliant either. The script written by Chris Colombus (director of Harry Potter Films) is very good and it keeps you guessing up until the end. Watch this movie and you won't be dissapointed. (Wait after the end credits roll to see one last scene...)","user":"strahd98","rank":[26,32]}]