[{"title":"Excellent medical thriller","rating":9,"date":"5 March 2003","review":"Patients check into the (fictitous) Boston Memorial Hospital for routine operations and, inexplicably, go into irreversible comas. Dr. Susan Wheeler (Genevieve Bujold) wants to know why much to the disappointment of her doctor boyfriend (Michael Douglas). When she tries to find answers, she finds herself marked for death.<br><br>Michael Crichton directed from Robin Cook's great novel. There are huge gaps in logic, but the film is so exciting and entertaining those can be forgiven. It's fairly well-directed and well-done overall. There are many great sequences--Bujold being stalked by a killer in the hospital late at night; a visit to the creepy Jefferson Institute; some lovely views of Cape Cod MA; Bujold, and then Douglas, tracking a suspicious oxygen line and the \"accidental\" death of a janitor. Also there's Jerry Goldsmith's loud, pounding score moving the picture along and, best of all, this was shot on location in Boston.<br><br>The acting is so-so. Douglas and Bujold are OK as the leads. Richard Widmark is having the time of his life playing a hospital administrator. Rip Torn and Elizabeth Ashley also turn in good performances. Also look for Tom Selleck, Ed Harris (with hair!) and Joanna Kerns in bit parts.<br><br>A very good movie. However you do have to deal with some very dated dialogue of Bujold trying to make it in a \"man's\" world. Also be aware that this is pretty extreme for a PG rated movie--there are fairly clear shots of Bujold's body during a shower scene and plenty of nude, dead bodies in a freezer sequence and some really gruesome scenes throughout the hospital.<br><br>This film has disappeared for some reason. It caused a lot of excitement around here when it was filmed in 1977 and was a big hit in 1978. Then it just disappeared. That's surprising considering how the careers of Cook, Crichton and Douglas have taken off. It deserves rediscovery.","user":"preppy-3","rank":[66,71]},{"title":"Good, fun thriller that still holds up","rating":14,"date":"14 May 2004","review":"I just revisited this movie after 25 years and was surprised how well it held up, even given the rather absurd plot and advances in medical technology in the interim. Genevieve Bujold has forever been underused and underrated, and she is simply superb here. And while I wouldn't tarnish Hitchock's reputation by comparing Coma too closely to any of his work, Crichton does a good job of maintaining suspense. I love the scene where Richard Widmark explains the crazy rationale behind it all, and we see it through Bujold's drug-addled eyes, which somehow makes it more palatable than if we were watching it straight.<br><br>And I love all the cameos -- Lois Chiles! Tom Selleck! Ed Harris! Many other recognizable faces. Elizabeth Ashley is so over-the-top she's camp. All in all, a fun movie.","user":"nikatnyte","rank":[44,47]},{"title":"The standard setter for medical thrillers!","rating":10,"date":"16 April 2005","review":"COMA: An extremely impressionistic medical thriller, which has since, set standards for many other thrillers of the type. The concept was novel, and surreal. Dr. Susan Wheeler, (Genevieve Bujold) is a successful, beautiful, and intelligent woman, at Boston Memorial Hospital. She has a love/hate relationship with fellow doctor Mark Bellows (Michael Douglas). She has no reason to suspect any sort of foul play at work, until she looses her best friend to an accident during surgery. A deep investigation leads on to the awful truth, that her friends death was no accident, and other deaths weren't either. Much more suspense and intrigue await at the Jefferson Institute, were the shocking truth is revealed. Michael Crichton is just as good a director as he is a writer. The two leads play great off each other, and Jerry Goldsmiths score will send eerie vibes through you goosebumped skin! The first, and best medical thriller, COMA has everything a proper, intellectual movie needs. Terrific introductions, affective development, twisted characters, and mystery for the bold, and brave. A classic to be known, and enjoyed over and over again.","user":"Banshee57","rank":[55,60]}]