[{"title":"Let's look at this movie for what it really is","rating":8,"date":"24 October 2005","review":"Face it, Evil Toons was never conceived as Oscar material. It's a deftly crafted spoof on every B &amp; C horror movie made in the last 50 years. You have your typical Blonde, Brunette &amp; Redhead with their brainy friend (she's the one with the glasses, natch) bimbos who get a job cleaning out an old house. They find an evil object, release a nasty spirit and get killed off in ways that reflect who they are. Then your cameo (David Carridine) comes in and tells the surviving (smart) one how to repair the damage, and everything comes up roses. Looked at it this way, you have a quickie shoot transformed into a masterful spoof. I loved it, you will to, if you don't take it too seriously!","user":"Bogframe","rank":[18,21]},{"title":"pornstarlet makes good...drunk monk does so-so...","rating":29,"date":"29 July 2001","review":"I've read the various reviews of this flick and some of y'all just don't get it.  Obviously, it's  cheap and poorly made...so go with that and relax. It's a perfect throwback to 80's horror/comedy filmmaking.  Sexist? Whatever.  If you rented this one you wanted to see a few bimbos get naked and then get dead.  You also wanted to see a \"...Roger Rabbit\" type horror film.  So, you get the first and not really the last.  Live with it. Madison Stone gives an award winning performance for a porn star and David \"Kung-Fu\" Carradine seems a little less drunk than he did in his mail order tai-chi how-to video.  You also get cult star Dick Miller and Laugh-In nazi Arte Johnson...oh, how could I forget Monique Gabrielle, in her best topless scene since Bachelor Party?!  Plot?  Kinda'.  Nudity?  You betcha'.  Cartoon monster?  Long enough for this kid.  Enjoy at your own risk....who cares what your friends think anyway.","user":"prof_murder","rank":[18,21]},{"title":"So bad that it is good...","rating":5,"date":"5 December 2000","review":"I am not a huge fan of Fred Olan Ray's movies, but I find this one actually quite entertaining--in a warped way.  The acting is horrifyingly bad. The special effects are not much to be desired. The plot is non-existent...Yet I am strangely fascinated every time I watch this little video.  It isn't even because there are so many naked girls randomly running around. There's something weirdly exotic about seeing cartoon characters killing real life people. This movie is like \"Who Framed Roger Rabbit\" meets \"Slumber Party Massacre.\"  This is a cult classic. B+","user":"jimmyplm","rank":[13,16]}]