[{"title":"Powerful, Disturbing Stuff","rating":8,"date":"31 May 2000","review":"I saw this film with my girlfriend about a year after I graduated from college, where I had lived in the alpha-male, females-as-accessories environment of a fraternity house.  While I know of nothing that went on in my fraternity that compares to the horrible events of this film, I was struck that some of the beer-fueled conversations I had with my fraternity brothers could have led to the same results with more likelihood than I realized at the time (or care to admit even to this day).  Suffice it to say, I cried all the way home from this movie, as much from shame as anything else.<br><br>Twelve years later, I still cannot recall being as horrifyingly struck by a scene as I was during the rape scene at the end of \"The Accused\" -- and I definitely do not have the stomach to see it again.  The movie, in my view, is exceedingly well-acted (Foster's Oscar was well-deserved) and well-told. It has the rare gift of touching the viewer viscerally for the entire duration -- discomfort being the feeling.<br><br>This isn't virtuoso film-making like \"The Godfather\", but at the same time I can think of no greater compliment for a movie than it truly opened my eyes to a new perspective that I was not mature enough to grasp on my own.  I left the theater a different person -- how often can that be said?","user":"Bondfan-4","rank":[166,203]},{"title":"No Male Bashing Took Place in this movie","rating":3,"date":"3 November 2004","review":"I was appalled by one reviewers comments on this movie, stating that a rape victim \"got what she deserved\". NO one, Woman or man, deserves to be raped, violated or harmed just because they were at the wrong place.<br><br>This movie is based on a true story, and the actors were very moving. People make mistakes, someone could be that upset and choose to behave in a manner not appropriate, yet when that Person chooses to stop and say NO, then No is it. No, Stop, Don't, these words do not mean, well, I ask for it. Anyone who thinks otherwise, I feel sorry for because they are sad, lonely and deprived of self worth.<br><br>Jodi Foster Is a great actress and puts all her strength in her roles. She is very talented and she and Kelly M. made this movie. Hopefully the person that had to endure this horrid act, is going on, with strength and success.","user":"gamesoonly","rank":[55,66]},{"title":"This movie is about more than rape","rating":8,"date":"29 July 2004","review":"This movie is about more than rape. It's about societal views of rape and the objectification of the female in a patriarchal society. The actual courtroom drama portion is not prosecuting the rapists, but the men who cheered on and encouraged the gang rape of a woman in a public place. As you watch the movie, look at the image of the woman on the pinball machine; look at the friend who turned away; the boyfriend who expects the victim to \"get over it;\" the lawyer who thinks it's OK to cut a deal that removes a rape charge in order to get the rapists behind bars, without thought for the life of the victim afterward. Society is on trial here.","user":"alexfiles","rank":[121,156]}]