[{"title":"Celebrity Noir","rating":17,"date":"17 September 2011","review":"No need to recap the plot. There's one key scene unlike anything in the rest of 40's noir. Frankie (Lancaster) invades Dink's (Douglas) office to muscle in on what he's owed of Dink's big operation. But Frankie's a gangster of the uncomplicated 1930's, while Dink's a white-collar criminal of the coming 1950's. So. By the time Dink's accountant Dave (Corey) is through answering each of Frankie's threats with another layer of corporate ownership that can't possibly be divided, Frankie's reduced to a bundle of quivering frustration. In short, Dave has beaten all Frankie's assembled thugs with what amounts to a maze of legalese. As a result, piles of paper prove ultimately more powerful than gangs of gunmen in what amounts to a great unexpected scene.<br><br>All in all. The movie's decent 40's noir, long on atmosphere but too long on talk, at least to my liking. I suspect the screenplay was tailored to showcase producer Wallis's top 3 new stars, especially Scott who gets a lot of romantic dialog along with sultry screen time. The overall result is a movie composed of too many under-blended showcase scenes- - some quite good-- that nevertheless don't really gel into a compelling whole. It's the kind of movie where the stars are more memorable than the story.<br><br>Scott and Douglas, for example, really shine. Scott does some of the best acting of her career as the conflicted glamour girl. But I especially like Douglas's slimy version of a smooth-talking mastermind who's so self-assured, you can't wait to see him get what he's got coming. Douglas's early career specialized in such compromised types, a revelation to those only familiar with his later, more heroic, career. For his part, Lancaster does well enough with his distinctive looks, but Frankie is a less showy role than the other two.<br><br>Anyway, one thing for sure—producer Wallis certainly had an eagle eye for new talent, as this movie more than demonstrates.","user":"dougdoepke","rank":[11,12]},{"title":"Enjoyable battle of wits between gangsters","rating":14,"date":"14 November 1999","review":"Burt Lancaster has been in prison since the days of Al Capone, and when released he sets out to claim his share of ill-gotten gains from his former partner, Kirk Douglas.  Kirk is pleasant at first, lulling Burt with wine, gourmet food, and the company of his mistress Lizbeth Scott, but he has no intention of sharing anything.  What starts out as a buddy relationship becomes a battle of wits and wills as the two fight for control of Kirk's nightclub, lots of money, and Lizbeth.<br><br>This is no \"Double Indemnity\", but the two main characters are written and acted well enough to hold our interest.  Douglas steals the film as the cleverer thug, the one who was smart enough to get away and go legit.  His performance is lively and has touches of humor, particularly in the scene where he proves that the pen is mightier than the sword, or at least that legalese is mightier than the gun.  Lancaster has a more violent, less sympathetic character, but has fun playing a brute who's forced to actually think for the first time in his life.<br><br>Not a great film, but an enjoyable one.  Interesting for the way it shows the changes in the criminal world over the course of a decade, from the brutality of the thirties to the emerging sophistication of the fifties.","user":"otter","rank":[18,22]},{"title":"Overall, a good film but it has a few bone-headed moments","rating":7,"date":"15 November 2011","review":"\"I Walk Alone\" is an irritating film because it's really, really good. However, at times, there are a few bone-headed moments that just made the script look a bit rough. It's a shame, as with a few minor changes, this one easily could have earned an 8 or possibly a 9.<br><br>After 15 years in prison, Frankie (Burt Lancaster) is released and he beats a path to the nightclub run by Noll (Kirk Douglas). It seems that when Lancaster was caught by the police, he could have implicated Noll as well but kept his mouth shut. And, the two had a deal that when the other got out of prison, they'd split everything 50-50. However, despite having a very successful club and lots of dough, Noll isn't about to give half of his fortune to Frankie--no matter what they agreed to. There's quite a bit more to the film than this--including a third guy, Dave (Wendell Corey) whose loyalties seem all over the place as well as a dame (there's always a dame...played by Lizbeth Scott).<br><br>There's a lot to like in the film--particularly the acting. In addition, the camera-work is great as is the beating scene (it's amazingly brutal and realistic--though it could have used a bit more blood). The street scenes late in the film had a great use of shadows--a film noir trademark. However, despite a decent script idea, a few times it really let down the audience. One major mistake was having Dave announce to Noll that he's going to do the right thing and he is going to cross Dave. Now we have already seen that Noll is bad...very, very bad. So, why would Dave be dumb enough to announce his intentions to Noll?! Of COURSE Noll is going to have Dave killed...that's what bad people do when you threaten them!!!! Duh... Also, at the end, Noll asks the cops to let him have a farewell as they're taking him in--and they let him go behind the bar and grab his gun!!! Isn't he a suspect in murder?! So, why let him have a chance to do anything like this?! Cops can't be that dumb!","user":"MartinHafer","rank":[9,10]}]