[{"title":"Aaargh, matey! Them that dies will be the lucky ones!","rating":9,"date":"19 January 2005","review":"I'm not sure if this is the cinematic version which best captures the ethos of Robert Louis Stevenson's book, but it is the version which provides the best movie experience for the viewer, and probably the film that most people think of whenever some one mentions Treasure Island. <br><br>Wallace Beery is always worth watching, and his black and white version has many strong points, but he never quite convinces me that he is the black hearted devil who is second only to Captain Flint himself in his cruelty. The Charlton Heston version has the advantage of a wonderful Chieftains soundtrack, and some richer production values than were possible in 1954, but somehow Heston never comes across as the kind of man who could weld a band of misfits, convicts, perverts, murderers and general misanthropes into a functioning pirate crew. <br><br>Robert Newton, however, is the definitive Long John Silver. I saw this flick fifty years ago, when it was first run in the theaters, and it left an indelible impression in my memory. (apparently it also impressed Richard Dreyfuss, who does an homage to Newton's Long John in 'Jaws'). The last time I viewed it was probably about ten years ago when my youngest child was still a pre-teen, and Newton's performance as the quintessential rogue who can slit your throat without a qualm while you are laughing at one of his jokes was just as impressive to me when I was 50 as when I was 10. <br><br>The story is a little long in the tooth, but the key points, such as the delivery of the black spot by Blind Pew, and the recapture of the Hispaniola, are still tense and exciting, even to a generation weaned on Stargate and Spiderman. The apple barrel scene with young Jim trying to avoid being skewered by Silver's knife made my kids scream, and what more can you ask from a kid's movie than a good, safe scare? <br><br>This is a must have movie for any serious video collection.","user":"Walling_M_I","rank":[57,59]},{"title":"Excellent Adaptation","rating":9,"date":"29 December 2004","review":"Even though it does not stick 100% to the novel, it stays true to the spirit and idea of the book. A light-hearted and well done adaptation of a well-loved book. Casting is brilliantly done, particularly for the parts of Long John Silver and Squire Trelawney. Locations are amazingly picturesque and make the watcher feel like they are in the right world for a swashbuckling pirate adventure, thereby making it all the better for them. For Disney's first foray into the arena of live-action films, it is extremely well done and hopefully they will be able to recapture their former glory and go back to the days of Treasure Island, Mary Poppins, and other live-action masterpieces of their illustrious past.","user":"Greill","rank":[30,33]},{"title":"If you liked \"Pirates of the Caribbean\", you owe it to yourself to see \"Treasure Island\"","rating":9,"date":"1 May 2004","review":"I saw this film as a child and enjoyed it, but when I watched it again tonight with my children, I absolutely loved it.  My two oldest daughters are big fans of \"Pirates of the Caribbean.\" They immediately recognized Robert Newton's brilliant performance as Long John Silver as the inspiration for Geoffrey Rush's equally delightful turn as Captain Barbossa fifty years later.  Newton steals the show with his characterization of the famous pirate, yet does so without distracting one from the story.<br><br>A half century has not robbed this film of any of its charm; it remains one of the great pirate films of all time.  Grab a bowl of popcorn and fire up your DVD player.  Treasure Island is the real thing!","user":"RBGatHome","rank":[37,43]}]