[{"title":"Wealth at the price of humanity, or humanity at the price of wealth?","rating":10,"date":"3 September 2001","review":"Wall Street is about those for whom material wealth takes precedence over morality, and those for whom it does not. Moreover, it is the story of one who is struggling to decide which of the two he is: greedy or ethical.<br><br>\nBud Fox is a young stock broker who only wishes to excel in life. His father, Carl, provides a strong moral foundation, prioritizing human life and well being over profit. Bud's mentor, Gordon Gekko, is a ruthless and legendary Wall Street player whose values couldn't conflict with those of Bud's father more perfectly. So caught in the middle is Bud, who pitches his father's airline to Gekko with the intentions of saving the company while everyone gets rich in the process. This business deal sets the stage for the conflict of interests Bud faces, and whether in the end it is his moral father or his greedy mentor he would most like to become.<br><br>Wall Street is impeccably directed and perfectly cast. Oliver Stone really captures all the elements necessary to the telling of this story, with all its moral, economic, and legal implications. Michael Douglas is almost frightening as the ghastly Gordon Gekko, a role for which he took home the Oscar for best actor. And the casting of Martin and Charlie Sheen as father and son lends authenticity to their numerous emotional exchanges. We see what seem to be genuine hurt, pride, and shame from the two of them together. John C. McGinley makes his customary appearance in yet another of Stone's movies as Bud's coworker, and as always he shines, contributing his unique personality to the film. The combined efforts of talented individuals in a powerful story of human strength and weakness makes Wall Street a must see movie.<br><br>I rate it 10/10.","user":"Kill-Gore","rank":[91,109]},{"title":"Oh That Wild and Crazy 1980s Yuppie Culture.","rating":1,"date":"1 May 2004","review":"Deceptively deep and complex picture from co-writer/director Oliver Stone paints a vivid portrait of 1980s over-excesses as the age of \"Me, Me, Me\" (otherwise known as the 1980s) is explored through the eyes of a young, eager and impatient stockbroker (Charlie Sheen) who moonlights as a liaison to a heartless, ruthless and crazily greedy mega-millionaire (Michael Douglas in a smashing Oscar-winning turn) who seemingly has his hands on most every aspect of big business. Naturally dilemmas occur in every direction for Sheen as the lifestyle he wants comes at a very heavy price (both literally and figuratively). A strained relationship with his father (real-life dad Martin Sheen) and a whirlwind fling with the superficial Daryl Hannah just leads to more and more cinematic fireworks. \"Wall Street\" is really the only film I can think of to deal seriously with its subject matter. Everyone of the age remembers the yuppie phase this nation had in the mid-1980s. Young urban professionals did their best to make as much as they could as fast as possible (sometimes through crooked and illegal means). The idea of retiring at 40 seemed like a good notion, but those same people with those thoughts are still working today (they never made their millions or they made their money and ended up going into a lifetime of debt because they spent their earnings quicker than they could make it). Ultimately the 1980s was good while it lasted, but good like that never lasts forever and that becomes painfully clear as Sheen's character becomes a warning to all those who think they can out-think and manipulate a strained economic system. Douglas is a complete revelation. I mean there is no doubt that he is an excellent performer, but his portrayal of a money- and power-mad player in New York is truly one of those instances of classic career work being achieved. Super-slick, wickedly intelligent and definitely a thinking person's movie, \"Wall Street\" continues to strike a chord when looking back at a very unique time of American economic history. 4.5 out of 5 stars.","user":"tfrizzell","rank":[97,118]},{"title":"Casualties Of Capitalism","rating":8,"date":"18 September 2005","review":"With his diabolical charm, slicked-back hair, city-college chip on his shoulder, and era-defining \"greed-is-good\" mantra, Gordon Gekko may by one of the all-time great film roles. Michael Douglas's performance as Gekko won a deserved Oscar in 1988 and makes \"Wall Street\" required viewing.<br><br>There are two schools of thought when it comes to money. Some economists argue money is an expanding resource, and prosperity a rising tide that lifts all boats. For Gekko, the truth is simpler and more brutal: The rich get richer off the backs of everyone else. \"Money itself isn't lost or made, it's simply transferred,\" he tells his young protégé Bud Fox (Charlie Sheen).<br><br>No question writer-director Oliver Stone feels the same way, as he presents this tale of wealth acquisition at its very apex, lower Manhattan circa 1985. In practically every frame showcasing the opulent world Gekko travels can be glimpsed beggars, fishermen, window washers, people who never will have access to the white-collar lifestyles their lowly status perversely enables for others.<br><br>For some, this zero-sum take of America clouds their enjoyment of \"Wall Street\" the movie. It shouldn't. You don't have to buy Shakespeare's version of history in \"Richard III\" to enjoy the morally bankrupt character at its center, and you don't need to adopt Stone's philosophy to enjoy Gekko.<br><br>In fact Stone's attitude about the Street, presented here as a kind of Hogarth caricature, helps make the film so entertaining. He captures the scenes of floor trading and calls and puts in journalistic detail, but leaves room for the human equation. And he has fun, a lot of fun, especially with Gekko, a character who makes you laugh with his pithy comments even as he sets about using poor Fox as a human ashtray.<br><br>On an upcoming charity event for the Bronx Zoo: \"That's the thing about WASPs. They hate people, but they love animals.\" On a rival: \"If he was in the funeral business, no one would ever die!\" To Fox: \"You had what it took to get into my office, sport, the question is do you have what it takes to stay.\"<br><br>Fox wants to stay, and allows no SEC regulation to block his wayward path. Stone's father was a stockbroker, and so the director takes special care to show us that all Wall Streeters aren't bad. There's Hal Holbrook, almost too saintly and somewhat detached from day-to-day business of his brokerage house to the point he seems a slumming B-school don. John C. McGinley delivers a standout performance as a vulgar, greedy friend of Fox's who we nevertheless find ourselves sympathetic to, especially as Fox ditches him for Gekko.<br><br>But of course it's really Gekko's world, as we watch him at his desk, punching telephone-line buttons and encouraging subordinates to \"rip their throats out,\" checking his blood pressure with one hand while smoking a cigarette in the other. His centerpiece moment, his speech to the stockholders at Teldar Paper, is a compelling soliloquy not because it showcases his brutality but because it allows him a chance to explain his philosophy in a way that sounds logical, even honorable, until you think through the implications. That's Stone's screen writing at its best.<br><br>Sheen is also masterful in his role, playing the naive waif who wants to swim with the sharks and thus giving Douglas daylight to run. Too bad there's a tacked-on romance that never really works, in part because the character of Darien Taylor is not well developed, in part because Darryl Hannah hadn't yet met Quentin Tarantino. The ending is a bit too neat, and loses the subtlety that makes the rest of the film so good.<br><br>But the heck with subtlety when you have Gordon Gekko. Douglas is the reason for watching \"Wall Street,\" and a terrific one. Just watch the way he looks at Bud, eyebrows raised to hold a pregnant silence, or enjoys the discomfort of his arbitrager-rival Sir Larry (a solid Terence Stamp). Stone knew what he had here, and makes the most of it. As a twisted morality tale, \"Wall Street\" is a thrilling, scenic ride down a dark and dangerous road.","user":"slokes","rank":[49,58]}]