[{"title":"Chen is a filmmaker of great imagination, intelligence, courage, and influence","rating":8,"date":"13 November 2005","review":"In \"King of the Children,\" the tale of a young man, exiled during the Cultural Revolution to Yunnan and chosen (despite his own minimal education) to teach a class of semi-literate peasant children who are accustomed to learning by memory only, (without intelligent understanding and assimilation) becomes a quiet but heartfelt portrait of the development of individual consciousness in a land suppressed by economic, cultural and social poverty <br><br>The teacher, of course, is finally dismissed for neglecting the official curriculum But Chen's recognition of his country's need to revitalize itself through changes which still allow for the spiritual traditions of pre-Communist China, is gloriously manifested in the final liberating, dreamlike shots of a forest in flames, dead wood being destroyed to free an ancient and beautiful landscape<br><br>Along with other young filmmakers, Chen is instrumental in the creation of a new, politically and artistically invigorating Chinese cinema, far removed from simplistic melodrama and martial arts escapism While he continually runs the risk of being marginalized, or even prevented from working, by pressures of censorship and bureaucracy, he has already proved himself a filmmaker of great imagination, intelligence, courage, and influence","user":"Nazi_Fighter_David","rank":[28,37]},{"title":"King of the Children is a masterpiece","rating":9,"date":"13 March 2004","review":"For viewers who are already familiar with the Cultural Revolution, &lt;&lt;King of the Children&gt;&gt; is a subtle commentary on that era. Chen Kaige uses humour and philosophy to address the issues of the Cultural Revolution, and he creates a space for the adults who suffered during that period and the children who followed them.<br><br>Part of what makes this movie a masterpiece is the cinematography.  Chen Kaige focuses on the vast landscapes of western China.  The imagery reflects on personal and political aspects of Taoism through which the director has processed China's modern history.<br><br>For viewers who are not familiar with history, the movie will still have a profound effect.  The themes are universal:  how do we transmit our knowledge and/or our wisdom to the generation which follows us?  How do we balance political problems with personal growth?<br><br>Another part of this movie's success is its humour.  Chen Kaige portrays irony in the politicking of the state and the lives of the characters. Fans of &lt;&lt;The Dead Poets' Society&gt;&gt; will appreciate the hero's tactics teaching a class of children without books or paper, while the school administrators store stacks of books and papers in their offices.<br><br>I would recommend this movie to anyone who wants to better understand the Fifth Generation directors and the challenges of Chinese cinema shortly following the Cultural Revolution.","user":"mulvi","rank":[11,14]},{"title":"The best of the director","rating":9,"date":"23 October 2003","review":"Sometimes it happens, but it happened to Cheng Kaige very sadly. I say about the cases when very talented young director, who could have become one of 10 greatest directors in history of cinema, loses his potential greatness by the underestimation of his best film. It happened to Sokurov's \"The days of eclipse\", but not so sadly. It didn't happen to Robert Bresson, because he had very strong will and faith.<br><br>Why,this vivid and human film with ambitious vision,did won nothing in Canne, without the most shameful prize for the most boring film!! Juries were fools?  Or they refused to give Chinese director any honor to his artistic results(I say it not because I'm an Asian,but because I love film art)? I can't understand it at all.<br><br>\"Hai zi wang\" is cheerful as Jan Vigo' films, human as Kurosawa's best films, revolutional as Antonioni's best films, beautiful as Tarkovsky's best films. Yes, it has some weakness compared with them, but we can understand the reason. 1987 is the time, when all great directors of older generation had already done their best works or already died. And in China all progressive cinema hadn't shown. Studio system was dead almost everywhere in the world.<br><br>The result of this underestimation pushed the director toward  Hollywood. The next film was still good, but not as \"Hai zi wang\". The film about two actors of traditional Chinese theater won in Canne, but is was completely different film, with Hollywood style.<br><br>The great director Cheng Kaige has lost his way...<br><br>We, spectator can still compensate for this. Just watch this human story, with philosophical depth and cinematographic novelty, and remember it as film art. And let's welcome and estimate properly when such films will appear next time.","user":"shusei","rank":[14,24]}]