[{"title":"Alarming","rating":7,"date":"20 June 2002","review":"An ostensibly tongue in cheek documentary about the nuclear age of the late 40's and 50's, juxtaposing the horrific realities of the arms race with cheery misinformation(and simplistic redbaiting) doled out to the public by the US government and private sector. The overall effect is chilling-for every scene of hilariously misguided propaganda and dismissal of nuclear danger(an army film cheerfully assures a fictional fallout victim that his hair will grow back in no time) there's scenes of Pacific islanders affected by fallout from remote nuclear tests and US soldiers getting debriefed on the minimal dangers of witnessing a nuclear detonation a few miles away(with goggles on, to be fair). Not an objective documentary by any means - not that it should be - the filmmakers excoriate the duplicity of the government and the mock the complacency of the public with equal zeal, but there's a certain absurdist charm to the whole affair.","user":"Dr. Nick*#3","rank":[30,30]},{"title":"Duck and cover","rating":9,"date":"30 January 1999","review":"I could watch this movie again and again. If you remember the days when we were all terrified of impending nuclear war with the Soviet Union, this puts your half-remembered anxieties and prejudices in perspective. There's rare archive footage of the first nuclear bombs being primed and detonated. There's stomach churning archive footage about the execution of the Rosenbergs for espionage. And the now hilarious footage about how civilians should protect themselves against the bomb.  Makes fun of politicians and broadcasters, and leaves you feeling that you've learned something and that you won't be fooled again.","user":"jongru","rank":[19,19]},{"title":"Documentary, w/o latter day interpretation","rating":9,"date":"28 April 2003","review":"I saw The Atomic Cafe in a theater when it was first released.  Someone exclaimed derogatorily as they walked out on it.  But I thought it was brilliant.  Sort of a sub-genre of documentary, this one had no commentary, narrative or explanations for the material presented.  No retroactive interviews with those who were there.  It relied 100% on archival materials.<br><br>A few years back, I visited the Trinity Site (here in New Mexico) on the 50th anniversary of the first test of the bomb.  Quite a few of those who were somehow involved back then and still living turned up for the event. So I did get to hear some hindsight comments.  Definitely different than what was being said back then, and such commentary could have really changed the picture.<br><br>This is a rare approach, and therefore thought provoking. One can argue that the choice of material, editing and music track impose some interpretation, and there may be something to that.  Although it's unlikely that one could turn the story into something really different unless latter-day, hindsight interviews were added to provide a different spin.<br><br>Being a \"Baby Boomer\", I was born during the times depicted in the movie, and have some early memories of them.  For those who were alive in that time, it's fascinating to see how it tweaks your memory.  I, for one, didn't think deep thoughts about the \"duck and cover\" drills at school - it was just another thing that got us out of our seats, like fire drills and recess.  But it does tweak memory, to bring back things not thought of for many years.  Interesting to consider how one's own memory is incomplete, wanders, can be influenced, etc.  (Now, re-read Orwell's 1984.)<br><br>Brilliant, and disturbing.  Interesting to consider in light of current events (spring 2003).","user":"elwinter","rank":[35,38]}]