[{"title":"guilty pleasure","rating":26,"date":"26 July 2002","review":"I saw this movie when it first came out.  The theater was in a small town and there was nothing else to do that night so we went to the movie thinking it would be crap.  Instead, I laughed so hard I almost fell out of my seat. I've loved the movie ever since.<br><br>Everyone knows the premise---Michael Caine and Joseph Bologna take their teenage daughters, Michelle Johnson and Demi Moore to Rio for a vacation. Caine's marriage is in trouble and his wife is vacationing somewhere else. They're barely settled into the home they're renting when Johnson aggressively pursues Caine and he quickly succumbs (like any man would!). Caine is guilt-ridden but cannot resist Michelle's considerable charms. Her father finds out about the affair and goes nuts trying to find out who her lover is.  He enlists Caine in his search and many hilarious scenes ensue.<br><br>\nThe setting for this movie is just gorgeous and the women are even more beautiful.  This was Michelle Johnson's first movie and it shows but she does project a sweet sincerity and her va-va-voom body more than makes up for any performance shortcomings.  Zowie!  Catch the scene where the fathers find their daughters topless at the beach---this was well before Demi Moore had some \"enhancements\" later in her life and it is painfully obvious that she's extremely embarrassed by doing the topless scene.  Michelle is a trouper though, lucky for us!<br><br>The ultimate reason to see this movie though is Michael Caine.  He is extremely funny in this movie and I can only imagine how much fun he had making it----a guy in his 40s getting to spend a few weeks in one of the most beautiful and exciting cities in the world and having all these love scenes with a girl half his age and getting paid to do it!!! Caine has made a lot of schlocky movies, for sure, but in an interview once he said that no matter how dumb the movie was or how cheaply it was done, he would try to give the best performance he could so even if the rest of the movie was crap, the viewer could at least appreciate that Caine did a good job. That dedication to his craft is what lifts what should've been a \"C-\" movie like \"Rio\" into a \"B\" \"B-\" movie instead and when he's in really good material, makes it unforgettable.","user":"Ajtlawyer","rank":[54,60]},{"title":"critics can be wrong","rating":1,"date":"1 October 2000","review":"This is a fun light-hearted comedy, with magnificent views of Brazil and subtle comic performances. It captures that early eighties feel well. And broaches the subject of a teenage temptress more honestly than the recent version of Lolita.<br><br>I can only think that this movie was out of time. probably from a gentler age, but it still hits the mark with me, even watching it now.","user":"keenanchris","rank":[50,57]},{"title":"Blame It on Flanders","rating":8,"date":"26 October 2002","review":"At the risk of ruining my credibility, I proudly declare this as one of my favorite movies. Nobody in their right mind would ever even contemplate a movie like this now, I know. In truth, I'm always shocked it was made at all. It's subject matter beyond the pale of even the low-life studio execs who make the big decisions. The most important and amazing consideration is it was intended as mainstream release. Its not a Troma shclock job. Its a very well made, extremely well written film about a very naughty topic. Consider it a blooper, an accident, if you will, but its great. Quick synopsis, a middle aged dude messes around and falls in love with his best friends 18 year old daughter. And its not exactly tastefully told. There's a ton of gratuitous nudity which is what really dooms it, and makes it just the sort of oddity and pariah people so love to hate. I'm old now, but when i fell in love with it I was like 19 so wipe the perverted sanctimonious smirk off of your face! I like good comedy and well made on location vacation pics, that inspire me to travel. So it's the Peters-Gelbart script and the wonderful scenery that have won it a place in my cold heart. Ok, ok, topless 18 year old girls are a decided bonus.","user":"glgioia","rank":[47,59]}]