[{"title":"\"There Is No Cure\"","rating":7,"date":"6 September 2006","review":"A controversial and shocking movie? Definitely, and the way some people today profess to be jaded about \"The Night Porter\" says more about our current culture than about the movie itself. Other persons who experienced the Holocaust first-hand have reacted negatively towards it for its portrayal of a destructive but loving relationship born amidst the Holocaust. Their objections are certainly understandable. There has also been, though, an awful lot of politically-correct garbage and pretentious nonsense written about \"The Night Porter,\" much of which has missed or misinterpreted some of the strongest elements of the movie.<br><br>When I first saw \"The Night Porter\" in the early 1980's, it certainly had the power to shock me and many others, yet at the same time it offered a depth of aesthetic experience well beyond just shock for its own sake. These aesthetic qualities produce a sense of doom and sadness, yet also show beauty and love amidst the hopelessness.<br><br>Dirk Bogarde gives a really masterful performance as Max, a former Nazi SS man who bears a huge burden of guilt. After World War II, Max works at the main desk of a gorgeous old hotel in Vienna. Here he re-encounters Lucia, who survived the Nazi concentration camps, where she was a victim of Max's sadism. Bogarde's Max, and Charlotte Rampling as Lucia, do not say a word at first during their unexpected postwar encounter in the hotel, yet their understated expressiveness speaks paragraphs. The most controversial parts of the movie show the sort of sado-masochistic relationship which the two resume soon afterwards. While this relationship is very disturbing, with Max's sometimes cruel nature and the destructiveness of the mutual attraction, there is also a kind of love expressed by the two towards each other. Lucia is certainly a victim, yet she also consciously holds a power over Max. The sado-masochism is not glamourized, and I don't see any suggestion that these two lovers are any sort of role models. Yet they also evoke sympathy.<br><br>Throughout the movie, Bogarde is able to show a wide range of thoughts and emotions by just a slight movement of the corner of his mouth, or by the raising of an eyebrow. Rampling shows vulnerability and also the power that she has over Max. She sometimes appears like a sleek, sly cat, and at other times clearly like the victim of the camp horrors. Other actors such as Philippe Leroy, Isa Miranda and Amedeo Amodio also do a nice and sometimes subtle job of expressing the psychic state of their characters. Another character, an Italian who survived awful times, appears like a dog who has been beaten and fears another whipping.<br><br>\"The Night Porter\" can be slow-moving, yet this is punctuated by some very vivid scenes. For me, the most striking one is a flashback to a time during the war when Bert, a Nazi associate of Max, puts on a performance for a group of SS men and women, to the accompaniment of some gorgeous classical music. Not only does the scene seem to have a very sinister quality, but Amodio as Bert expresses an emotional longing which has important repercussions. There is also another very eerie flashback showing a musical, cabaret-style performance by Lucia for her SS captors. Something of the corruption, moral bankruptcy and hopelessness of Nazism is conjured up by this scene.<br><br>On the downside, some of the minor characters are portrayed in a caricaturish way, the voice dubbing can be off-putting, and some plot elements towards the end of the movie are at times very silly. Through those failures, though, I think the movie still succeeds aesthetically. Partly this is due to the appealing yet melancholy and ominous musical score by Daniele Paris and others, the disturbing magnetism of Max and Lucia, and the cinematography. Throughout the movie the beautiful, fascinating city of Vienna almost seems a character in itself.<br><br>\"The Night Porter\" is certainly not for everyone. In addition to its portrayal of a very disturbing, unconventional love relationship, it has a few brief scenes of graphic sex, and small bits of the ugliness of the camps. For those who don't mind getting through those parts, its aesthetic qualities can be very rewarding. Be warned though that the movie contains much ugliness along with its beauty. As Lucia says to someone who is trying to use pschoanalytical games to avoid his guilt and shame, \"There is no cure.\"","user":"wmarkley","rank":[63,74]},{"title":"The Stockholm Syndrome","rating":9,"date":"16 February 2006","review":"Many people have thought this was a loathsome one, and I can't blame them. When I saw this movie for the first time, it left a depressive and nauseating feeling. But I cannot agree that this is barely \"nazi sexploitation\" sleaze. In fact, \"the Night Porter\" is a perfect psychological study of masochism. And masochism is not cheap sleaze, it is a terrible addiction that even basically \"normal\" people can get trapped into, even though they know it will destroy them. Very much like drug addiction.<br><br>Besides, if you're into movies, it's pretty obvious right from the start that this is the work of real professionals. Director Liliana Cavani was not famous before she did this, but she certainly knew how to make a movie, and had learnt the best lessons from her more famous counterparts. As for the acting by the two main performers, Dirk Bogarde and Charlotte Rampling, it is just top class, no more to say.<br><br>The movie starts on a bleak day in Vienna in the 1950's. It focuses right away on the character of Max (Dirk Bogarde), who works as a night porter at a fancy hotel. We soon find out that this ungrateful job is a hideout, as he is a former nazi. And the hotel is actually a secret meeting place for gatherings of former Nazis, who are well determined to let nobody track them down. One day,a group arrives at the hotel. Among them, a beautiful woman (Charlotte Rampling). Her deep blue gaze freezes as her eyes meet the night porter's. They have recognized each other. She was kept years before,as a young girl, at a concentration camp where the night porter was operating as an SS guard. It gets soon hinted at by flashbacks that they had a close relationship, which helped her survive physically, even if she was left mentally destroyed.<br><br>The woman, Lucia, is married to an orchestra director who tours in Vienna. He is just vaguely aware of her wife's past, and as she demands him to depart immediately, he convinces her to stay \"for just a few days\". Lucia is in fact desperately asking for help, but her bland husband doesn't understand. As for Max, he is both afraid to be reported, and at the same time irresistibly attracted. He attends the opera performance where Lucia's husband is playing, while she is in the public. They sit there in the dark, obsessed by each other's presence while \"the Magic Flute\" is playing, but none of them makes a single move. That's a chilling scene.<br><br>Lucia's husband is surprised as, when they are about to leave, she demands to stay \"for just a few days\". It is already too late. Lucia has lived through hell, then built a new life abroad and more or less forgotten. But it seems life doesn't taste anything for her anymore, just no more suffering that's all. With Max, she experienced a horrible but passionate love affair, and in the deep of her heart, she remained addicted to that atrocious intensity. She is like a former alcoholic who has quit for years but suddenly falls back.The rest of the story is predictable. Max and Lucia find each other again, and cannot part anymore,whatever it may lead them to. Actually, it can only lead them to death. Max's nazi colleagues spy on each other constantly, and soon find out about the affair. Both Max and Lucia become dangerous people who must be eliminated.<br><br>We learn more through flashbacks about the past relationship between Max and Lucia. The key scene of the movie takes place in a smoky and sinister officer's mess, where masked men are playing a gloomy tune on an accordion. Half naked Lucia wearing an SScap performs a song by Marlene Dietrich which says \"If I were to wish for something, I would like to be just a little happy, because if I were too happy, I would long for suffering\". Couldn't be more explicit. As she has finished her show, she joins Max at a table, and he has a present for her in a box. A horrible present. The severed head of a prisoner who kept bothering her. Lucia recoils incredulous as she opens the box, then looks in Max's eyes and sips in her glass of wine. What more extreme love present can a man make than killing for the woman he loves? This scene is almost unbearable, and it's precisely the film's essential five minutes.<br><br>So if you don't like this film, it sounds like a normal reaction. It's actually difficult to \"like\" it , but one can find it interesting and important. Especially those who have experienced sexual abuse by relatives, drug addiction or alcoholism, or people who are related or engaged to such people. That makes quite a few. When one is plunged into destruction, a solution is to take a liking for it. But it's an extreme solution, which gets you intoxicated for life, and may lead you to seek total destruction as an only way out.<br><br>The phenomenon described in the movie has been observed many times, even though it is difficult to understand or accept for an outsider. When people are abused and isolated for a long time, whether in prison or in their own family, it usual that they develop a bond with their abuser, as he or she becomes their main affective reference. This is commonly referred to as \"the Stockholm syndrome\".<br><br>Better you don't watch this if you're feeling down.","user":"francheval","rank":[114,140]},{"title":"Shocking without being vulgar. A gem.","rating":1,"date":"1 March 2004","review":"In some ways this film is still very shocking. Although it is neither violent nor vulgar, the situation is disturbing and violent -actually it's something we DON'T see with our eyes: a psychological violence.<br><br>Some years after the end of Second World War, a woman meets in a hotel her jailer during her concentration camp period. He was an SS officer, now he's a night porter. With him she re-starts a relationship made of attraction and sadomasochism.<br><br>The film is shocking because it describes an insane situation, led by two insane people. These are the disturbing elements of the film, because spectators don't feel well in seeing that. The atmosphere has something very icy and miserable. I think it's precisely Liliana Cavani's goal: a study of insanity, without self-indulgence.<br><br>After 30 years \"Night porter\" remains a gem. An intelligent movie, full of provocation. Charlotte Rampling and Dirk Bogarde are extraordinary.","user":"michelerealini","rank":[75,95]}]