[{"title":"Clint at his best","rating":8,"date":"29 April 2005","review":"Sure, he's in the shadow here of his more famous Leone westerns, but this vehicle, amiably directed by Don Siegel and aided by a quirky Ennio Morricone score, is an entertaining little spaghetti western knockoff shot on location in Mexico. Story-wise, it's an old west Heaven Knows Mr. Allison with a comic twist, and with an offbeat nemesis in the French Army. The humorous chemistry between Eastwood's Hogan and MacLaine's Sara at times clicks so well it's hard to believe they reportedly didn't get along very well during production. Though when it comes to Shirley MacLaine nothing really surprises me.<br><br>As far as Eastwood's post Spaghetti movies, he's rarely been in better form than this. Essentially continuing his man with no name persona, he gets far more dialogue this time around which fleshes out his character and makes him a little more three dimensional. It's a nice change of pace from the Leone westerns to hear Clint spout a few humorous lines and have the odd hilarious facial expression in between his trademark squinting and snarling and cigar chomping.<br><br>Disciples of Leone's trilogy may never warm up to an admittedly hammier Clint in this, but as Clint's Hollywood westerns go, this is a fun and well made duster. Shouldn't be missed.","user":"cutter-12","rank":[40,45]},{"title":"Strange, but solid western","rating":7,"date":"26 May 2002","review":"Curious, unexpectedly talky western set in the Mexican desert. Drifter on horseback saves a nun from rape at the hands of bandits, she saves him by removing an arrow from his shoulder. The rapport between these two couldn't have looked very colorful on the printed page, but by God if stars Clint Eastwood and feisty Shirley MacLaine don't give it color and charisma. The writing isn't very expressive, and there's an odd drop-off in action after the opening sequence, but once you get attuned to the film's rhythm, it surprises you with its resonance. For action buffs, only the final shoot-out will please; for everyone else, a leisurely, though absorbing and entertaining, character-driven change-of-pace. *** from ****","user":"moonspinner55","rank":[47,54]},{"title":"The gunfighter helps the nun and vice versa.","rating":8,"date":"29 April 2004","review":"The famous critic Pauline Kael in an interview mentioned that the opinion about a film sometimes changes according to the time that the film is viewed. A film that might be great when seen for the first time ten years later might seem completely outdated and vice versa. 'Two Mules' is a western that was released at a time that the public wanted something else. What they wanted was Clint Eastwood 'The Good, The Bad, and The Ugly' style, and that was what he kept doing for the next years. 'Two Mules' was considered a failure, specially because of Shirley MacLaine that did not fit into the standard Eastwood pattern. Nowadays the story is different, the film is worth seeing, specially because of MacLaine. Most of the time they are together and it works very well, Eastwood is less serious than usual and it is very funny how he tries to understand how a nun thinks. The music by Morriconne has a comic touch and together with the wild creatures that are shown on the screen like a scorpion, a rattlesnake, a mountain lion gives a great beginning. The final part does not keep the same level, but those two great actors and their funny relationship are quite enough to make this a very good film. The script of the film was originally written by Budd Boetticher while he was filming \"Aruzza\" in Mexico. He needed money very badly to complete \"Aruzza\" so he sold the script, and got very upset later on when they did not make the film the way he wanted.","user":"tmwest","rank":[55,64]}]