[{"title":"The boys go to a convention while wives think they're in Hawaii","rating":10,"date":"2 April 2005","review":"I love this movie. I was reduced to tears the first time I saw it and am reduced to tears every time I've seen it in the 50 years since. Talk about a movie holding up over 70 years. To my mind, it's the Citizen Kane of comedy. Everything about it is pitch perfect. To watch the boys as they sink deeper and deeper into absurdity in explaining their arrival back ahead of the rescue ship is a marvel to watch. There are so many subtle, nonsensical and memorable moments that stay in the mind years later one almost doesn't know where to start. The solemn dark lighting of the opening scene spoofing fraternal organizations, eating the wax fruit, the range of facial expressions of the wives throughout, the shot of the boys from the back sitting facing the fireplace as Stan disses his wife, Stan's wife in hunting regalia returning shotgun in arm carrying ducks, Ollie flirting on the phone not realizing it's his wife he's talking to, the stream of consciousness dialog in the attic, and on and on and on. A subtlety perhaps missed by many is the wonderful song and dance number at the night club....a simply wonderful lampoon to perfection of crooner Dick Powell and spoof of Busby Berkeley with those clunky but charming Hula dancers, struggling in a valiant but ultimately hopeless attempt to dance, fanning out to the camera and culminating in that marvelous overhead shot near the close. Just great. I could write a book on this movie, but I'll just suggest to viewers to get William K. Everson's book on the films of Laurel &amp; Hardy and read what one of the great critics has to say about this gem.","user":"cove3","rank":[41,45]},{"title":"Off To A Convention With Mr. Laurel & Mr. Hardy","rating":10,"date":"10 June 2000","review":"Ollie wants to attend the annual convention of THE SONS OF THE DESERT in Chicago &amp; have lodge brother Stan go with him. Their wives, however, have other plans. From such tiny acorns of humor do mighty oaks of hilarity grow...<br><br>This is a wonderfully funny film, with the Boys at their very best. Watch Stan's face as he eats the wax apple, or Ollie as he attempts to stand-up to his formidable spouse. The Sons themselves are a spoof of every fraternal organization that's ever taken itself too seriously.<br><br>Hilarious Charley Chase is the epitome of every obnoxious conventioneer you've ever tried to avoid. Mae Busch &amp; Dorothy Christy are good fun as the Boys' wives, while Lucien Littlefield scores as a veterinarian called in to doctor Ollie.<br><br>Extra-sharp movie mavens will spot Charlie Hall as one of the waiters at the beginning of the 'Honolulu Baby' sequence; they will also recognize the voice of Billy Gilbert as the steamship official giving the announcement about the shipwreck survivors.","user":"Ron Oliver","rank":[25,27]},{"title":"The most pleasant comedy","rating":10,"date":"10 October 2001","review":"It's really the only good full-length Laurel &amp; Hardy movie that isn't distracted by a sub-plot, therefore an interesting story develops, and we get to see more of Laurel &amp; Hardy.  This movie more than any other just lets us laugh at the two characters we love best:  Stan and Ollie.  We see them as kids, sneaking around to a juvenile convention to escape the clutches of their motherly, domineering wives.  There are some great sequences, and some truly hilarious moments.  Stan is especially at his best, and the sequence where Ollie is sick is classic.  \"Why did you get a veterinarian?\"  \"I didn't think his religion would make any difference.\"<br><br>A must for any Laurel &amp; Hardy fan, and indeed a must for everyone who enjoys an utterly pleasant experience and a truly divine comedy.","user":"AaronHR1981","rank":[24,27]}]