[{"title":"One Of The Last Of The Great Action Westerns.","rating":8,"date":"10 July 2010","review":"The cavalcade of generally stunning 20th Century Fox Cinemascope/Color westerns that were produced in the fifties really came to an end with \"Warlock\" in 1959. The sixties saw a diminishing public appeal for them but during the new decade there were a few excellent examples of the genre still to come in the shape of RIO CONCHOS (1964), a reasonably good remake of \"Stagecoach\" (1966), the outstanding \"Hombre\" (1967) and the hearty \"Butch Cassiday &amp; The Sundance Kid\" (1969). The latter two regretfully dropping the Cinemascope extension from the Fox logo and renaming the same process Panavision.<br><br>After \"Hombre\" the best of them is by far RIO CONCHOS! A rugged rip roaring adventure in the best action packed tradition of the Hollywood western. Produced for the studio by David Weisbert the picture's basic premise gave an assertive nod to the studio's earlier \"The Comancheros\" (1960). Deriving from the novel by Clair Huffaker it was written for the screen by Joseph Landon and Clair Huffaker (who also wrote \"The Comancheros\"). The amazing Cinemascope cinematography came from genius cameraman Joe MacDonald and it was all solidly directed by the somewhat underrated Gordan Douglas.<br><br>Richard Boone is Apache hating Major Jim Lassiter, late of the confederacy, who - with a furtive Mexican companion Rodriquiz (Tony Franciso) - is seconded into a Yankee undercover operation to find out where 2000 repeating rifles have disappeared to. Under the leadership of Captain Haven (Stuart Whitman) and his black Sgt.Franklyn (Jim Brown in his first movie appearance) Lassiter learns that his old Confederate commanding officer - the demented Colonel Theron Pardee (Edmond O'Brien) who is holed up on the Rio Conchos - is in possession of the guns and plans to arm the Apaches so as to reignite the Civil War. The mission is to thwart the Colonel's intentions and destroy the guns. In a marvellous set piece the picture ends literally in an explosive finale as the cache of arms goes up in a mushroom of smoke.<br><br>Performances are generally good throughout. Whitman is fine in the lead in what is probably his best movie. But Richard Boone is a tad excessive in his playing. His Lassiter character is over-stylized even to the point where some of his scenes are rendered weak and unconvincing. However the acting honours has to go to Tony Francioso in one of the best roles he ever had. He is superb as Rodriquiz the wily, unscrupulous and womanizing Mexican. It is an Oscar winning performance! And there is an interesting bit of casting for an Indian girl played by the little known Wende Wagner. Here the actress perfectly creates an impressively authentic portrayal of a young Apache female.<br><br>Conveying the action along is the terrific score by Jerry Goldsmith. Although he had previously written the music for a few westerns such as the forgotten \"Black Patch\" (1957) and his fine wistful effort for \"Lonely Are The Brave\" (1962) nothing before or after can compare to his work on RIO CONCHOS. It is a driving propulsive score! The main theme - first heard under the titles - is quite brilliant with the accordion gently introducing the tune accompanied by clunking banjo, guitar, scratcher comb and whip before the strings take up the tune to full flight. This cue is used later in an up tempo treatment for an escape and river crossing sequence with the strings screaming out the theme against repeated figures in the brass. The use of music here makes the scene simply breathtaking. There is also a plaintive reflective cue to characterize the Indian girl in a melancholy movement and there's some attractive indigenous folk tunes played on guitar for a Cantina sequence. RIO CONCHOS is Jerry Goldsmith's best score for a western!<br><br>Jerry Goldsmith's music is just one exceptional element that makes RIO CONCHOS a remarkable, memorable and exciting action picture and gets my vote as one of the best westerns Hollywood ever conjured up.","user":"jpdoherty","rank":[24,26]},{"title":"*Minor Spoilers* Truly entertaining western","rating":11,"date":"11 May 2004","review":"This seems quite violent for an American early 60s western, but then I suppose one has to remember that this was the same year as 'A Fistful of Dollars'.  The key to the film really is Richard Boone's superb portrayal of Jim Lassiter, the ex-Confederate army scout who has turned into a drunkard and an Indian-killer after the death of his wife and child at the hands of the Apaches.  <br><br>The first scene shows an unarmed Indian burial party in a howling desert wind, who are cold-bloodedly murdered by Lassiter.  US army captain Stuart Whitman and his sergeant Jim Brown follow the trail from the bodies to Lassiter, but they seem more interested in where he got his rifle from than in his crimes.<br><br>He is kept in incarceration in the guardhouse back at the fort until he agrees to tell the officers where he got his rifle.  He lets them know that he obtained it from one Pardee, a Confederate guerilla, in Mexico.  It transpires that is one of a shipment of US army rifles stolen from under Whitman's command.  He agrees to lead them to Pardee, on the condition that they take Rodriguez, a Mexican condemned to the gallows for knifing a man, along with them, as he can speak the local language and knows the country like the back of his hand.<br><br>The trail leads the four men through Apache attacks, gunrunners, and banditos, until finally they reach Pardee's layer.  Everything seems set for a splendid finale, but, unfortunately, the film seems to end in mid-air, so to speak; we do not find out what happens to our heroes, or to the villains.<br><br>One of the refreshing things about this film is that there is no romantic interest to speak of.  The action scenes are very exciting and well handled, the plot speeds along wonderfully, the actors are all very good, and there are some good rugged locations.  The scene of the final confrontation is especially spectacular, with Pardee's half-completed grand mansion towering above the valley.  The only real quibble is the awful ending.  This is a must-see for western fans, a truly entertaining film!","user":"Colonel-24","rank":[11,12]},{"title":"Macho Muchachos hunt for stolen guns.","rating":27,"date":"27 September 2004","review":"An eclectic cast rounds out this rather rugged western film. Craggy Boone stars as a man who hates the Apaches because they slaughtered his wife and child (hardly an original background for a character.) When he is found using a certain rifle to kill his prey, he is arrested and thrown in jail with knife-wielding Franciosa, who is set to hang for murder. It turns out that the rifle is one of a huge shipment that has gone missing and it's up to cavalry captain Whitman and his sergeant Brown to retrieve them. Boone and Franciosa join them in order to aid the mission (and set up dramatic conflict within the contingent.) The foursome travels the dusty terrain of Utah and the American Southwest, encountering Indians and Mexican bandits along the way, all the while mistrusting each other. They believe the guns are in the possession of a dethroned Confederate Colonel (O'Brien), who wants to rebuild the South in all it's glory out West! (He even builds a mansion-like plantation home out of timber with fine furnishings and curtains in the windows, but no ceilings and, in most cases, no walls!) On the way to O'Brien, the quartet also picks up a spitfire Apache girl (Wagner) who tried to do them in with a gang of pals, but failed. If it all sounds pretty standard and pat, it is to a point, but thanks to the entertaining cast, the captivating Jerry Goldsmith score, the location scenery and the rough edges of the story, it manages to be an entertaining film. Boone puts a lot of compelling flavor into his role. Whitman is less impressive, but does a nice enough job. Franciosa is very hammy and indulgent, but keeps it interesting anyway. Brown (a man with an unbelievable physique) has almost nothing to say or do, but still comes across as warm and thoughtful, not to mention strong! He retains his dignity at a time when racial tensions were beginning to start their boil-over. O'Brien has a lot of fun with his outre character. Wagner is nearly unrecognizable in a sketchy character. Her loyalties are divided and her reasoning isn't always clear. (Her character speaks no English in the film.) She would soon enter pop culture history as the loyal assistant to \"The Green Hornet\" on TV. Several memorable moments occur in the film including a standoff between the men and some Apaches at a deserted house, a torture sequence in which the men are dragged by horses and flogged with straps and the sight of O'Brien's surreal timber estate. This isn't a particularly well known western, but it certainly has merit as it demonstrates the changing level of content in the genre and contains some solid acting.","user":"Poseidon-3","rank":[20,24]}]