[{"title":"Poor Repairing Of Hudson And Lollobrigida","rating":27,"date":"27 May 2003","review":"In 1961 Universal had a popular success, Golden Globe winner I believe, with pairing Rock Hudson and Gina Lollobrigida in the comedy \"Come September\". In 1965 they attempted to recreate the magic with \"Strange Bedfellows\". Unfortunately this failure just goes to prove that scripts and characters are just as important as actors. Rock Hudson plays a conservative oil executive who impetuously weds bohemian artist Gina Lollabrigida. Given their incompatible natures they separate after a short marriage. Seven years later Lollobrigida wants a divorce to wed newspaper editor Edward Judd while public relations man Gig Young encourages Hudson to portray himself as a happily married man in order to get a big promotion. Hudson proceeds to re-kindle the flame with Lollobrigida, while Judd tries to disrupt the relationship by encouraging Lollobrigida's bohemian causes and thus embarrassing Hudson. The outcome of all this is Lollobrigida riding through London as Lady Godiva as a protest for one of her causes. The movie fails for a variety of reasons. Hudson's scene in bed with Judd might have some \"camp\" value but, although ungallant of me to say so, I've seen Lollobrigida look better. The character development is limited, with fundamentally incompatible pair coming together apparently without any change in character. None of the supporting players has any personality in the script. Gig Young does many scenes solo, supposedly on the telephone to Hudson's character, and could probably been written out of the entire movie. Judd's acting is unfortunately limited to putting a pipe in and out of his mouth. The producers obviously recognized these problems and brought in British character comedians (i.e. undertaker Terry Thomas and several taxi drivers) for cameos. Much of the Lady Godiva scene requires physical comedy which is not Hudson's and Lollobrigida's forte. As commented on by others the Hollywood backlog substituted for London is cheesy. By way of comparison I would note that Come September had strong support from old pro Walter Slezak, energy from a young Bobby Darin and Sandra Dee, beautiful Italian scenery and a coherent plot. Suffice it to say that \"Strange Bedfellows\" at 98 minutes seemed dreadfully long while \"Come September\" at 112 minutes whizzed by.","user":"sep1051","rank":[11,11]},{"title":"The Oilman and the Bohemian","rating":6,"date":"30 June 2007","review":"The Strange Bedfellows are Rock Hudson and Gina Lollabrigida, a married but separated couple, separated now for seven years. Gina would like a divorce because she wants to marry her new boss Edward Judd. But Rock has reasons to want to patch things up. He's in line for a big promotion on his job and the old money in the person of Howard St. John that runs the company likes the stability of a family man in his top executives.<br><br>Rock and Gina had a lot of passion in their relationship. Great for sex, but they brought into other things and didn't agree on anything. Gina is a bohemian free spirit and Rock is a conservative oil executive and is that ever a redundancy.<br><br>Gig Young is in a typical Gig Young part and I did love seeing the way Edward Judd got over him pretending to be a British secret agent. Paul Lynde did a fabulous job in Rock's Send Me No Flowers as a funeral director and since the film is set in London, Terry-Thomas steps in and does a fine job as a British funeral director. <br><br>Strange Bedfellows is not as good as Rock's films with Doris Day, not quite as good as his previous film with Lollabrigida, Come September. Still I think it will please audiences today.","user":"bkoganbing","rank":[15,17]},{"title":"cracking the code","rating":7,"date":"7 September 2011","review":"Rock Hudson had a few laughs at our expense, and noticing them is the best part of \"Strange Bedfellows,\" a 1965 film directed by Melvin Frank and also starring Gina Lollabrigida and Gig Young. Hudson plays Carter Hansen, an executive about to move up in his company. He's been separated from his wife Toni (Lollabrigida) for seven years, and he's warned by Young that he has to be a family man if he wants the promotion. However, Toni has just asked for a divorce so she can marry Harry Jones (Edward Judd). Carter refuses to do anything about it; he can't tolerate Toni's activism for every cause. But when they see each other at the divorce lawyer's office, neither can resist the other.<br><br>This film is just okay - it kind of drags, though the end is quite funny. Someone on this board didn't think Gina Lollabrigida looked good - I thought she was gorgeous here. What's interesting is all the gay innuendo; at one point, Carter and Harry wake up in bed together. This isn't the only film Hudson appeared in with this kind of thing -- I think he and his various directors got a kick out of it. All of it would have been much funnier with a better script.<br><br>Unfortunately Hudson and Lollabrigida don't have any chemistry here, and this movie just doesn't have the wonderful spark of the Hudson-Day films or the personality and beauty of \"Come September\" since this movie was filmed at Universal and looks it. It comes off as kind of blah.","user":"blanche-2","rank":[5,6]}]