[{"title":"Imagery that Bores Inside","rating":10,"date":"6 June 2003","review":"This movie may be labeled frustratingly plotless by some, and that's fair, but the imagery in this strange combination of stop-motion animation and live footage is so hauntingly rich and evocative that you get the feeling that someone has secretly filmed your own childhood dreams and translated them into Czech - perhaps for the viewing pleasure of the former commissars. The basic idea is that all of ALICE IN WONDERLAND is occurring in Alice's house, and a staggering variety of household items are animated into jerky sort of life, while all the character voices - Mad Hatter, Queen of Hearts, White Rabbit - are spoken by Alice. Alice's house, however, is a Czech house, and the items are old even by Soviet bloc standards. It's as if an antique rummage sale suddenly sprang to life to act out a monstrous little comedy for one girl. And the architecture is simultaneously comforting and frightening. Windows, for example, merely open onto other rooms, all lit by bare light bulbs. What keeps the thing tied to Lewis Carroll is the performance of the little girl playing Alice. She appears to be about six or seven, and despite the disturbing events going on around her, she never appears frightened, and always investigates events as they grow curiouser and curiouser with a determined pluck. This little girl is always in control. What this adaptation lacks in forward momentum or narrative drive it makes up for with a surreal poetry of the domestic space as dreamed by a child.","user":"Pangborne","rank":[49,53]},{"title":"Through the Looking Glass, Darkly","rating":9,"date":"8 May 2000","review":"Animation legend Jan Svankmajer applies his distinctive style to Lewis Carroll's most famous creation, crafting one of the most original and unforgettable takes on Alice's adventures ever put to film. Having previously adapted Carroll in his 1971 short film, \"Jabberwocky,\" Svankmajer returns to the author's work with this amazing feature-length film. Employing a magnificent blend of live action and stop-motion animation, he uses many of Carroll's ideas as jumping-off points. Many of the characters are reconstructed as nightmarish abstracts of the way they have usually been depicted in previous adaptions. The white rabbit is a stuffed real rabbit who keeps his watch tucked in a sawdust-leaking gap in his chest. The Dormouse has been reduced to a creepy crawling foxlike hide, and the Caterpillar is a sock with eyeballs and teeth that sews its eyes shut when it sleeps. Although familiar characters such as the Mock Turtle and the Cheshire Cat are left out, Svankmajer's film is incredibly faithful to the book's sense of fantasy and absurdity. The minimal dialogue and pronounced sound effects also add to the overall unsettling mood. The key to truly appreciating this version is to forget the common associated imagery from other adaptions, and treat this as its own entity. Just as a dream makes a totally different impression on you than a person you describe it to (regardless of how well you describe it), this film is one man's surreal interpretation of another man's surreal description. The skull-headed birds, walking dolls, and broken-down furniture of Svankmajer's world make this a pretty disturbing telling of Alice's journey, but a masterful, enthralling, and undeniably unique one as well.","user":"mike_sean","rank":[23,25]},{"title":"Visually stunning - and intense. Not for little kiddies!","rating":22,"date":"22 August 1999","review":"A mix of live action and stop-action, this arthouse flick is intriguing but bizarre.  But if I was a little kid I'd be scared out of my wits by The White Rabbit with bulging glass eyeballs &amp; long, hamster-like fangs.  Socks become wood-eating worms, Alice starts eating marmalade full of tacks, a tiny mouse lands on her head, punctures it &amp; starts a fire, the rabbit hole she falls down starts as a desk drawer that grabs her &amp; draws her in.  The Alice doll she becomes when she's shrunk is sweet but sad.  I have to admit it's fascinating and 180 degrees from the saccharine sweetness of the Disney film.  See it on video to experience something completely different, and probably more towards the way Lewis Carroll intended the story to be...","user":"Lori S","rank":[41,47]}]