[{"title":"Someone was \"Puffin' Stuff\" all right!","rating":16,"date":"16 November 2002","review":"This is a movie from a wonderful children's TV series and everyone in the TV show is here and a few surprises are thrown in as well. One generation's hit is another's camp classic, but this is fun. They sure don't make them like this anymore!<br><br>\nThere is something here for everyone, visually it would appeal to the very young due to it's eye-catching colours and gentle plots, older children might get more into the storyline and even adults might catch themselves enjoying the borderline Freudian plot which is at the center of this movie as well as each episode of the TV series, a witch and her obssession with a little boy's \"magic flute\".... ahem.<br><br>\nThe non-human characters will remind many of the old ad campaigns of McDonald's with Mayor McCheese, The Hamburgler, etc. Did the Crofts have anything to do with the McDonald's advertising or was it just a rip-off?<br><br>\nIt was a nice surprise to see \"Mama\" Cass Elliot in this one, she seems to be having a ball in her role as a crony of Witchpoo. Seeing this makes me wonder at what potential died with her.<br><br>\nRecommended highly...and yes, I'd have to strongly agree with other reviewers here who have said that if children's fantasy movies from the period interest you, definately give this one a try, switch off your inner critic, and just enjoy!","user":"Schlockmeister","rank":[14,14]},{"title":"And a GREAT Musical Score","rating":24,"date":"24 October 2005","review":"I'm always amazed at the following certain films I thought of as totally obscure actually have.<br><br>This is one of the funniest films I've ever seen. Admittedly the humor is of its time and really stoned out, but it works straight too, the best of both worlds.<br><br>I would also like to point out the great songs and musical score by Charles Fox.<br><br>One of the songs, \"If I Could,\" sung by Jack Wild, is really touching and poignant, and Mama Cass's \"Different\" is a great 60s up-tune with a timeless message.<br><br>Charles Fox had scored another great trip movie, BARBARELLA, about this time, and this score is like Barbarella meets Witchie-Poo.<br><br>The score, originally on Capitol Records, belongs on CD, and the film itself should have a deluxe release on DVD.","user":"rossco-3","rank":[7,7]},{"title":"The Power of Krofft","rating":6,"date":"6 June 2003","review":"Recently, during the 29th Annual Saturn Awards, presented by Cinescape Magazine, television legends Sid and Marty Krofft were presented with the Living Legend Award, for outstanding career achievement. It's not hard to imagine why. Where Walt Disney had Mickey Mouse as his flagship character, where DIC's Jean Chalopin and Andy Heyward had Inspector Gadget as theirs, so too the Kroffts had beloved H.R. Pufnstuf.<br><br>Is it any wonder, then, that long before it became fashionable to make major motion pictures from hit TV series, the Kroffts were light years ahead of their time when they turned their flagship property, H.R. Pufnstuf, into a movie, entitling it simply Pufnstuf. And more, this is the only time we discover the backstory that is briefly described in the regular series' opening sequence. H.R. Pufnstuf ran for only 17 episodes on NBC Saturday mornings, yet Universal Pictures saw enormous potential in Puf, Jimmy, Freddie the Flute, and (naturally!) Witchiepoo to put them on the big screen.<br><br>For some weird reason, Pufnstuf the movie is presented largely from Witchiepoo's perspective. Indeed, she it is who opens and closes the film, kicking things off by appearing before us while the screen remains in darkness. She describes all that we're about to witness as a tale of goody-two-shoes \"and what they did to poor, sweet, adorable me,\" according to her. No wonder Billie Hayes remains deeply touched when she recalls how many children flocked as much to her as Witchiepoo as they did to Pufnstuf himself.<br><br>I don't have much to say regarding the plot of the film; what I can tell you is, just see this film for yourselves. Bringing Mama Cass Elliott, Martha Raye and the Krofft world together in the same movie was a feat unheard of, even for its time --- 1970. Then again, Krofft was always somehow psychedelic. It still is today. Rock on, Pufnstuf! Rock on, Witchiepoo!","user":"pirate1_power","rank":[4,4]}]