[{"title":"\"Get down out of there you upholstered nitwit !\"","rating":6,"date":"13 January 2007","review":"For Western film fans and trivia enthusiasts, this one is a blast! Not only do you have John Wayne teaming up with Ray Corrigan and Max Terhune as the Three Mesquiteers, but also one of the most clever twists you'll ever find in a 'B' Western. Nancy Evans (Carole Landis) is the owner of the West-East Traveling Circus, as well as a ranch she inherited from her grandfather. When unscrupulous businessman Mike Abbott (Johm Merton) learns of an offer from the railroad to purchase her ranch for seventy five thousand dollars, he tries to swindle her out of it with the help of Evans' business manager George Ward (Ralph Graves). However instead of selling the ranch to pay off legal attachments as a result of the villains destroying the circus, Nancy instead decides to live there. But in a case of mistaken identity, Nancy and her circus friends arrive at the '3-M' ranch, home of the Mesquiteers; the sign on the property was turned upside down to look like it read 'W-E'!!! <br><br>The movie also answers the question of how the Three Mesquiteers came by that name. In an early scene, the three buddies are shown heading for their home in Mesquite County, Texas. I've seen a number of the Mesquiteers films, but this is the only one that offered an insight into the origin of the name for the trio.<br><br>It's not that rare to have a leading lady in a 'B' Western, what's more unusual is to have a second pretty female get into the act. In this one, Evans has a friend and circus employee named Lillian (Collette Lyons), who winds up with the best lines in the film. In addition to the comment in my summary line above (directed to Willie the circus ape!), she also fires off a comical response to Wayne's character Stoney Brooke, when he tells her he's a cowhand - \"Ooh, if I could only learn to moo!\" She also wonders 'how long it takes to milk a chicken' when first arriving at the ranch.<br><br>Say, if there's something oddly familiar about the midget strongman Hercules, that's none other than Billy Curtis, who had quite a film career. He was the Munchkin City Father in \"The Wizard of Oz\", and had a notable role as Clint Eastwood's ally Mordecai in \"High Plains Drifter\". If you check out his filmography on this site you'll be quite surprised at his many and varied roles.<br><br>There's an unusual cast credit listed for this movie that caught my eye, that of Naba as Willie the Gorilla, but I'm not so sure of that. Fans of Ray \"Crash\" Corrigan know that he appeared in many movies of the 1930's and 40's dressed in a gorilla suit, with names like The White Gorilla, Nbongo, Zamba, and my personal favorite, White Pongo. Or maybe Corrigan inherited the gorilla costume from Naba and decided it would be a hoot of a second career.<br><br>Oh, and I don't want to forget to mention Roscoe Ates, appearing in the movie as Sheriff Brown of Mesquite. He's not as colorful here as in some of his other Westerns, but it's still fun to see him. Ates was a regular sidekick in a bunch of Eddie Dean Westerns, going by the name of Soapy Jones.<br><br>Regular followers of John Wayne will note an improvement in his fighting style over the years since his Lone Star movie days in the mid 1930's. Back then, Wayne would employ huge roundhouse swings when matching fists with a villain, but here he looks much more natural in the fisticuffs department.<br><br>Max Terhune, as Lullaby Joslin, generally handles the comic relief chores when he appears as a Mesquiteer, and here once again he uses a dummy as part of a ventriloquist routine; he did the same in \"Range Defenders\". There's one funny scene where he gets dunked in a water trough by Willie the Gorilla, but you'll wind up asking yourself who manned the dummy while Lullaby was all wet!<br><br>If you'd like to know more about The Three Mesquiteers series of Westerns, there's a great website called 'The Old Corral', the best I've seen dedicated entirely to 'B' Westerns. You'll find separate commentary on each of the starring Mesquiteers in this movie, along with a history of The Mesquiteers and all of the actors who portrayed them in a total of fifty one films. Check it out at: http://www.bwesterns.com/trio3m.htm","user":"classicsoncall","rank":[10,10]},{"title":"Saving A Circus","rating":6,"date":"13 January 2007","review":"Besides of course John Wayne, two other movie legends got parts in the B western series The Three Mesquiteers. One was Jennifer Jones and the second in this film was Carole Landis. After a whole bunch of bit roles, Carole got the female lead here in Three Texas Steers. Right after that she got signed for her breakthrough role in One Million, BC with a 20th Century Fox contract to boot.<br><br>Here Carole is the owner of a circus who all of a sudden runs into a streak of horrible bad luck. Due to a lot of accidents her circus has to fold and she retreats to her ranch. It's a pretty broken down place, but fortunately the one piece of good luck she has is the fact that The Three Mesquiteers own the neighboring ranch.<br><br>The boys are a bit oafish in this one and Max Terhune manages to get himself swindled which nearly puts them all down the toilet, both the Mesquiteers and the Landis spread. Of course things work out all right in the end as Carole finds out who's behind her bad luck and why her ranch is so valuable.<br><br>Carole Landis had a lot of beauty and a lot of talent in one package. It's interesting to see her at this point in her career, before she went totally platinum blond. Too bad she and the Duke never got to work together again when both were A list stars.","user":"bkoganbing","rank":[11,12]},{"title":"Carole Landis Was Outstanding","rating":10,"date":"1 July 2007","review":"This is a great Western Film for 1939 starring John Wayne, (Stony Brooke), who plays the role of a good guy who gets himself involved with solving other peoples problems. This time Stony helps out a gal named Nancy Evans,(Carole Landis) who is a Circus owner and very successful, who also owns a ranch she has never seen. There are guys very interested in Nancy Evans ranch property and seek to do anything within their powers to force Nancy to sell her property. These guys destroy her circus business and try to force her into bankruptcy in order for her to sell her ranch which is worth $75,000 because a dam is suppose to be built on her property. Nancy has a nice Circus horse who dances to music but is a very fast horse, so Stony, Lullaby Joslin and Ray Corrigan enter him in a house race and he wins $2,500.00 which helps Nancy. However, Lullaby Joslin,(Max Terhune) is robbed of this money and Nancy is faced with many more problems. There is a gorilla that runs all around chasing everybody by the name of Willie The Gorilla,(Naba) which adds to some comedy to this film. It was great to see Carole Landis, so young and pretty in this role, I remember her in two great film she starred in \"I Wake Up Screaming\" and \"One Million B.C.\" One of the film locations in this film were filmed at Ray Corrigan's ranch in California.","user":"whpratt1","rank":[7,7]}]