[{"title":"A good psychological thriller with great locations","rating":9,"date":"27 May 2005","review":"This film, one of the earliest starring Sean Connery, has strong and alluring power of its own. The visual settings are magnificent, and Gina Lollobrigida was never more seductive or beautiful than in this motion picture. Connery shows more depth than in many of his later films--one wonders what direction his career might have taken if he had not fallen into the clutches of \"Cubby\" Broccoli and the whole 007 thing. Sir Ralph is, well, Sir Ralph--imperious, petulant, old school upper class damn-the-servants Brit...This film plays strongly to anyone interested in the psychological stress a crime induces in the various participants, and this is one of the many factors that separate it from the run of the mill police procedural. Finally, it has an evocative and excellent musical score--and no wonder, since Rimsky-Korsakov's Cappricio Espanol features prominently as a mood-setter. Altogether, a good rainy afternoon movie!","user":"DrHypersonic","rank":[26,30]},{"title":"Gripping.","rating":3,"date":"3 May 2003","review":"***SPOILERS***<br><br>The British have always had a knack for making the most convincing, nail-biting mysteries of all time.  Woman of Straw is one of them.  The story centers around a wheelchair-bound, crotchety old tycoon who eats his help for breakfast, he's so cold and unfeeling.  He hires a live-in nurse (Lollobrigida, in one of her very best roles) who manages to keep her cool as he barks out insults to her like she's an animal yet she remains faithful to his needs for living and then some... Then we have the handsome, sexy, horny, conniving, two-faced only-surviving-relative nephew (Connery) who gets Lollobrigida to fall for him while plotting...you know the rest. Typical mystery story line.  There's everything here - highbrow put-downs, sex, racial bigotry (towards Johnny Sekka's butler character), betrayal and, of course, murder!  The soundtrack featuring much of Beethoven's classic pieces helps to create the mood for much suspense and keeps you there to a hold-your-attention-to-the-end climax that totally blew me away.  It would indeed be nice if this were on video.  It would be well worth your money. Catch it on AMC or try Turner Classic Movies or a late night movie program and enjoy. {Sean, if you're reading this, would you please do your fans a favor and do one more Bond film where in the end he retires to a country estate with Miss Moneypenny and the character can retire forever?  Pierce Brosnan and the rest just don't have \"it\" to be the James Bond that we all knew and that I still love!  You de man, Sean!!!} :)","user":"Teenie-1","rank":[13,14]},{"title":"Not-Great-But-Compelling Thriller","rating":31,"date":"31 March 2002","review":"This is not a brilliant movie by any means, but it's worth seeing if you can track it down on late-night television or the limited VHS release (poor transfer quality, so be warned if you happen to find one).  Ralph Richardson in particular gives a great performance, playing the meanest tycoon this side of Montgomery Burns, with a bit of \"The Magic Christian\"'s Sir Guy Grande thrown in for good measure.  It's not surprising his nephew (Sean Connery) would want to do him in.  Connery spends much of the film looking and acting like he's still in James Bond character.  He wears similar well-tailored clothing and has the same cool, slightly bored manner he affected in those movies.  Towards the end, though, his character turns sociopathically chilling, and he hits some good acting notes in that part of the film.  Gina Lollabrigida gives a good performance sporadically, as well. Her halting English does her in at times, as it does in most of her films, but she delivers great emotion when her character has terrible things happen to her.  The film has a rather slow start, but builds nicely and offers some twists along the way.","user":"mg1119","rank":[19,25]}]