[{"title":"Night of the Big Heat....No Need For the Cold Shoulder!","rating":9,"date":"4 April 2005","review":"Night of the Big Heat may not rank among the best sci-fi efforts by critics, but for this fan, it really does deliver the goods. Locals on the Island of Fera find themselves in the midst of a searing heat wave while the rest of the mainland of the UK is in the middle of a normal cold snap in November. As bodies begin to pile up, found burnt to a crisp, a scientist struggles to convince the locals that they may be the victims of an invasion from space.<br><br>A great cast that includes, Patrick Allen, Jane Merrow, Sarah Lawson and in guest roles, Christopher Lee and Peter Cushing. Directed by the great, Terence Fisher, this is another triumph in Fisher's library of films and to this viewer, ranks right up there with his Hammer horror films as well as the underrated, Island of Terror.<br><br>Certainly not as bad as some would have you believe and probably not as good as I think it is, it is definitely worth a look for fans of 60s British sci-fi films.","user":"ClassixFan","rank":[35,42]},{"title":"Enjoy this classic cheapie!","rating":20,"date":"20 June 2002","review":"Hey guys! Whats the deal here? This film is one of my all time faves!  The first time I saw it I loved it straight away.   I love the Englishness of it all....the country pub....the warm beer!!!....feel that cheesy dialogue: \"You were no untouched virgin when we met\" etc.<br><br>Enjoy gawping at the stunning beauty of Jane Merrow in a wet bikini and more!  This film is very similar to Fishers Island Of Terror,very much a companion piece.    I never get tired of seeing this flick,I view my ancient tape every year.   Dont expect a masterpiece and you will not be disappointed .   Its corny,cheap but not tatty,with great photography,solid performances and lovely colour....ENJOY!!!","user":"iaincturner44","rank":[27,33]},{"title":"Intelligent Sci-fi from a past age","rating":8,"date":"2 October 2004","review":"I'm fed up with reading about how bad the spfx are supposed to be in this film. Personally, I blame Christopher Lee for saying bad things about them in his biography. Actually, this film is not bad. It is a story about ordinary people in an extra-ordinary situation (an alien invasion). The people are stuck in a claustrophobic setting (a pub on an island) and it's about how they confront what's facing them. This is a fairly faithful adaptation of the book it is based on. It's more character than spfx lead, and I suppose this is the problem for modern audiences who have short attention spans and lack the ability to follow a scene that lasts for more than 3 seconds. Still, if you like sci-fi from an age when people had brain cells (ie, HG Wells, Jules Verne, John Wyndham, etc...) and don't mind spfx that could have come from the early Dr Who serials and the original Star Trek series, then you may well enjoy this film. If you happen to think Star Wars was the greatest film ever made, then don't bother -- it'll be way above your head.","user":"AdamJezard","rank":[45,59]}]