[{"title":"A little humid, but fun","rating":7,"date":"28 October 2003","review":"By most accounts, Clint Eastwood hijacked his long-awaited teaming with fellow superstar Burt Reynolds and the credits bear this out. After showing writer-director Blake Edwards the door, Eastwood recruited the more malleable Richard Benjamin to direct (in his autobiography, Reynolds said Benjamin was \"terrified\" of Eastwood), ordered Edwards' script be given a rewrite by Joseph Stinson whose only other credit was the previous year's Dirty Harry film, \"Sudden Impact,\" brought in key players from his Malpaso crew (notably Fritz Manes as producer and Lennie Niehaus as composer), and even dumped Edwards' title, \"Kansas City Jazz,\" in favor of the equally imaginative (I'm kidding) \"City Heat.\"<br><br>Despite Dirty Harry's takeover, \"City Heat\" emerges as a showcase for Reynolds. He has the most screen time and the zippiest dialogue, but playing against a typically wooden Eastwood also heightens the opportunity for Reynolds to reap laughs with his more extroverted approach. The contrast between the two is very entertaining.<br><br>Critics were quick to dismiss this Christmas 1984 release as a bomb which it certainly appeared to be beside the Eddie Murphy blockbuster, \"Beverly Hills Cop,\" in release at the same time. It is disappointing (Edwards would likely have given it more class), but by no means a dud. It breezes along at a comfortable pace, mixes its laughs evenly with action, and should make for a satisfying indulgence for fans of the two stars.","user":"bwaynef","rank":[51,56]},{"title":"Inconvenient Allies","rating":6,"date":"18 January 2009","review":"City Heat casts two of Hollywood's biggest box office draws of the past forty years in the same film as different types. The film is set in Kansas City of 1933 which richly earned the reputation it had back in the day of a wide open town. This was in fact the Kansas City of Tom Pendergast. Clint Eastwood is a by the book and honest city detective, not an easy thing to be in Kansas City of that era. Burt Reynolds is a former cop who's now a roguish private eye. The two of them have a history, they like each other well enough, but they also grate on each other's nerves.<br><br>As all good private eyes have, Burt has a cool and efficient Effie like secretary in Jane Alexander and a partner in Richard Roundtree. Burt's one of the few back in the day who would even consider going into business with a black person. But Roundtree's playing a lone hand involving a runaway bookkeeper and a war between two rival mobs headed by Rip Torn and Tony LoBianco. For his troubles Roundtree winds up dead and in the same tradition of Sam Spade, when your partner's killed you do something about it.<br><br>But it's also Eastwood's homicide case and like it or not the two are forced into an alliance of inconvenience, kicking and screaming right up to the end of the picture. The plot also calls for rescuing Alexander who Eastwood fancies, Madeline Kahn who's Burt's girlfriend and chanteuse Irene Cara.<br><br>City Heat is not at the top of the list of films by Eastwood and Reynolds. But they've got nothing to be ashamed of here. The film glides effortlessly from comedy to drama and both guys get their innings to show why they're the superstars they are. You could do a lot worse than City Heat for your viewing pleasure.","user":"bkoganbing","rank":[17,18]},{"title":"Two Superstars Surprisingly Fail","rating":24,"date":"24 August 2004","review":"In 1978, Eastwood and Reynolds appeared together on the cover of Time as the reigning male superstars.  If \"City Heat\" had been made that year, it would have been a superblockbuster.<br><br>But by 1984,  Reynolds' career was already declining (too many insipid \"Cannonball Run\" movies.)  Eastwood -- who after \"Dirty Harry\" never worked with major co-stars -- may have finally said \"yes\" to co-starring with Reynolds because he was clearly the bigger star in 1984.  But even Eastwood was starting to age.<br><br>All the problems others have related here are true, plus one more: Reynolds was hit in the face by a stunt man with a real chair while filming the opening diner fight scene.  Reynolds' jaw was broken and he had a severe medical condition causing pain, headaches, and dizzyness. Reynolds was a trouper and finished the movie (he is quite funny in it), but one of the reasons the movie is so short and incoherent is that the injured Reynolds couldn't work very long in the film (notice: in the final fight, \"Reynolds\" is wearing a wolf mask -- because that's not Reynolds.)<br><br>\"City Heat\" opened at Xmas against \"Beverly Hills Cop\" and new star Eddie Murphy cleaned the clocks of old stars Eastwood and Reynolds . Reynolds would never be a top star again. Adding insult to injury, the ad tag line \"The Heat is On!\" first used by \"City Heat\" was shifted to \"Beverly Hills Cop\" when \"City Heat\" disappeared from theaters.<br><br>It's too bad, really.   Once upon a time, Eastwood and Reynolds were both co-equal major superstars, and it would have been exciting to see them paired together.   The opening diner scene and a few later exchanges give us a tantalizing glimpse of how good \"City Heat\" could have been had it not be jinxed from the start.","user":"ecarle","rank":[49,60]}]