[{"title":"Late nights on the blood, well just look at those eyes.","rating":6,"date":"10 June 2007","review":"A bat drools blood on the smouldering corpse of its master to revive him from the dead, where Dracula causes terror to the locals and passing travellers. A young man Paul fleeing from the authorities, disappears when he drops by Dracula's castle. Soon his brother Simon and his finance Sarah have gone looking for him, where they encounter unwelcoming locals and learn that Paul has passed through to Dracula's castle.<br><br>Out of the Hammer Dracula films I've watched (which would be Horror of Dracula, Dracula - Prince of Darkness, Dracula Has Risen from the Grave, Taste the blood of Dracula and The Legend of the 7 Golden Vampires), this particular entry (the sixth) would have to be the weakest, but not entirely bad. What stands out is how sadistic it is in its nauseating actions and grisly make-up, where the red, red blood runs freely and the shocks are explicit. Also flesh and sexual activity is more fruitful. There's no denying this is one dark and mean-spirited Gothic film, held together by its scorchingly sombre atmosphere and some sensationally brooding set-pieces of striking suspense and images. These effective moments mainly derived from the original novel. Director Roy Ward Baker does a sound job, even though it can get patchy. However the main problem is that basic story and wilted script doesn't really build upon anything and it gets rather repetitive, senseless and creates drawn out feel. The ending is somewhat anti-climatic too. It's hard to escape the cheap look, as the sets are a mixture of cardboard structures, nice oil paintings as background features from the castle and plenty of rubber bats dangling from strings. While the woodlands surrounding the castle where forebodingly captured. The intrusive flair seems to be lurking there, but not with the same energy. Clocking in is a routine, frenzy music score. Christopher Lee seems to be going through the motions with a called in performance, but his presence features strongly to forgive that. The supporting cast are capable in their deliveries. Christopher Mathews, Dennis Waterman, and a stunning Jenny Hanley are likable in their parts. Patrick Troughton, Wendy Hamilton, Michael Ripper and Michael Gwynn also are terrific.<br><br>Bloody, nasty and dread-filled, but due to its languid pace it nothing more than a modest attempt.","user":"lost-in-limbo","rank":[16,16]},{"title":"Dracula's back and there's gonna be trouble!","rating":6,"date":"20 February 2004","review":"The fifth installment into the Dracula series from the Hammer studios, Scars of Dracula. Now we are talking, this film was Rated R and we are talking some real hard core violence in this film. You thought the prior films could be scary, you haven't seen anything yet with this Dracula. Christopher Lee returns and has a lot more screen time and lines and looks more chilling than ever. I think he had to enjoy this role a little more than the sequels, at least he seemed to have a more horrifying presence than the previous sequels. There's more blood, more sex and more bats on strings. Yeah, that's the big flaw with the film, the story isn't as strong and for a series that was pretty popular, you'd think that they could afford better special effects than bats on a string! I digress; despite the flaws, I think this was the scarier sequel from the previous films. Flaws aside, Dracula is biting, stabbing, impaling and burning his victims this time and he is out for blood.<br><br>Local villagers, enraged that yet another young woman has been murdered by the Count, rise up and set fire to Castle Dracula. However, the Count is safely asleep in a solid stone crypt. Falsely accused of rape by the spurned burgomasters' daughter, libertine Paul Carlson flees the Kleinenberg authorities by jumping into a nearby coach. He is deposited near Count Dracula's mountaintop castle. Initially he is welcomed by the Count and a beautiful woman. Paul later has a liaison with the woman who concludes their lovemaking by trying to bite his neck. Dracula enters and, casually throwing off Paul's efforts to stop him, savagely stabs the woman to death. Trapped in a room high in the castle, Paul uses a line to climb down to a lower window but the line is withdrawn and he is trapped in a dark doorless room. Paul's brother Simon and Paul's fiancée Sarah Framsen come searching for him. Dracula has immediate designs on the lovely Sarah, but Klove, who has fallen in love with the young woman, helps the young couple escape. But Dracula never gives up so easily and is determined to get Sarah.<br><br>The flaws with the film besides the bats was the characters. They're just a bit more bland this time except for Paul who sadly leaves the film early. Speaking of Paul, isn't it weird how many times there has been a character named Paul in this series? Did Hammer have a thing for the name Paul? Moving on, also there's a moment where a bat attacks a priest killing him, the priest doesn't fight back at all which was unbelievable. Then Dracula commands one of the bats to take the cross of Sarah's neckwell, not so much her neck as her massive heaving cleavage that the camera manages to zoom into every five seconds, but again she doesn't fight back as more she stands there and just screams. I think she wanted Dracula to bite her, she just had to show a little resistance since she plays so defenseless. And just Dracula's luck, he grabs a metal pole during a thunder storm and gets hit by lightening! You know there's something I've learned from this series, Dracula is a very bad shot. Every movie, he throws something at someone during a fight and always misses, he's about to throw the metal pole at Simon and lightening strikes him, I think it's God's way of telling him \"Oh, give it up, man! You're a bad shot!\" Anyways, back onto the film, is it worth the watch? I think so, despite it's flaws, this was a lot more gory and had some really good scares. The scene where Dracula burns his servant Klove is genuinely terrifying. Dracula knows what he wants and will do anything to get it and if you mess with him prepare to take on some severe punishment, because if you come at him with fists, he'll come at you with a bat, you come at him with a bat, he'll come at you with the fangs and if you bring a stake, I suggest you make sure he's dead because he'll never stop until he's drained you of every last drop of blood in your body. I know, because I've watched all the sequels.<br><br>6/10","user":"Smells_Like_Cheese","rank":[26,30]},{"title":"A Sadistic & Violent Dracula Film","rating":8,"date":"10 June 2005","review":"Title: Scars of Dracula (1970) <br><br>Directed by: Ray Ward Baker Cast: Christopher Lee, Dennis Waterman, Jenny Hanly, Patrick Throughton, Christopher Mathews <br><br>Review: How many here enjoyed Horror of Dracula? Did you like its creepiness? Did you dig its heavy atmosphere? Did you shiver at Draculas evil blood shot stare? Well have I got news for you.<br><br>Those of you who have not seen this flick, or are just discovering Hammer films, go and search this one out. It's a very enjoyable and creepy Dracula tale, that will please fans of Dracula films and gore alike! I've seen some of the best hammer Dracula films and I have seen some of the worst, and all I can say is that this one ranks way up there as a highly enjoyable Count Dracula story, which I'm sad to say is sometimes bombarded by critics and even by Christopher Lee himself as being a weak entry into the series. Me? I thought it was a kick ass vampire movie, old school style of course, but mega fun non the less. The only reason for it being called a \"weak\"entry is because it has more violence then other Hammer films. This in my opinion does not make it weak, if anything it made it a cooler film to watch. It made it more of a horror film.<br><br>The story is about a young womanizer who goes by the name Paul (Christopher Mathews) . Hes escaping the local authorities for having his way with some important dudes daughter. Anyhows on his way to escaping he ends up in Draculas castle. After that his brother Simon (Dennis Waterman), decides to go and look for him with his girlfriend Sarah (Jenny Hanley). What they encounter is Count Dracula himself who of course first offers them his hospitality, then proceeds to try and suck their blood! Even though this film is sans Peter Cushing and that's a sad thing any day of the week, we do get some really cool and likable characters. First there's the Simon character played by Dennis Waterman. He is very headstrong and valiant. Facing off Klove in some scenes and Dracula himself towards the end. There's Sarah played by Jenny Hanly who is so beautiful and delicate yet she herself is valiant and daring when she has to be. Also there's this one character that I guess was supposed to replace Peter Cushing and it's the Priest played by Michael Gwyn. He even looks a bit like Peter Cushing but in my opinion cant even be compared, simply because Cushing has such presencenot so with The Priest. In Scars of Dracula we also see a character that was also presented in Dracula : Prince of Darkness which is Draculas day time protector. He is this Igor-like character called Klove. He presents a nice twist in the movie. Not gonna go into details, but he is part of what made the movie a little different.<br><br>Dracula is a bit more evil, sadistic and violent in this film than in others, for example he is seen using weapons such as daggers and swords to express his fury, instead of the more traditional ways were used to seeing him use. There's this really cool scene which I very much enjoyed in which Dracula uses a burning hot sword! Cool scene! The movie has a lot of classic horror images and it is filled with all the horror ambiance and imagery we've come to expect from a Hammer film but pushed a little further. For example the fog is heavy and thick in this one, Draculas castle is huge and haunting, and the sound of the wind blowing almost never stops in the scenes that take place up in Draculas castle. A nice little touch if you ask me. Also there's full moons, ans howling wolfs in the distance, and lets not forget the giant vampire bats! They are all over the place in this film aiding Dracula in his evil schemes. These bats are responsible for some of the most gruesome scenes in the film. And there's also a wink at Vlad the Impailer for in one scene Drac impales one of his adversaries.<br><br>Also another scene that made this film special was one scene in which Dracula crawls out of his lair through the window...and then proceeds to scale the wall, spider-man style. This comes directly out of the Bramstokers novel so I found it amusing. Equally amusing was the fact that this was the only time that this had been shown on film. The other film that did it was in the Jhon Badham version of Dracula were Frank Langella does the scaling up the walls.<br><br>Be on the look out also for a mega cool demise for Dracula, I think the final sequence in this film is spectacular, and in it I saw the inspiration and the muse for Jerry Dandridges fiery death sequence in Fright Night, speaking of which, there's a scene in this flick which actually appears in Fright Night. Its towards the end of the film. It involves a giant vampire bat trying to take away a crucifix from Sarahs neck. We see this scene playing on Charlies TV set at some point in Fright Night. It seems to me that there's a little bit of all these Hammer films in Fright Night.<br><br>Finally I think that anyone fond of Dracula films, and specially Hammer films will find this film highly enjoyable, because of Christopher Lees evil performance, high atmosphere, Gothic sets and the high blood quotient (for a Hammer film anyways) Don't go expecting a huge bloodbath, by todays standards its tame, but by Hammer films standards up to that time, its got lots of the red stuff. Expect a fun ride into Gothic atmospheric horrorhammer style! Rating: 41/2 out of 5","user":"spacemonkey_fg","rank":[34,43]}]