[{"title":"Breakout: The true story","rating":19,"date":"19 December 2003","review":"The movie \"Breakout\" was based on a true story by Joel Kaplan, the man who actually broke out of a Mexican prison, after being framed for murder. He wrote the book, and I dated his sister.  It was actually his sister who arranged his escape, not his fictional Hollywood wife.  Hollywood greatly exaggerated the true story.  Even the Mexican Attorney General admitted this was the greatest escape in Mexican prison history! The New York Times backs my story in about 1972. Jack Sandy","user":"Maya37","rank":[26,30]},{"title":"Not exactly a must-see flick, BUT...","rating":6,"date":"29 October 2000","review":"\"Breakout\" is a lightweight action film but worth a peek, especially if you're a Charles Bronson fan. It's not one of his best movies but manages to be entertaining, albeit corny, most of the time.  If you want to see a great movie with Bronson in it, check out \"The Magnificent Seven;\" if you want to see a great Charles Bronson movie, watch \"The Mechanic.\"","user":"wryroy","rank":[15,17]},{"title":"Charles Bronson breaks all the rules and still comes out a winner","rating":7,"date":"8 May 2005","review":"In a rare show of his comedic talents as well as having more lines of dialog to read then in his last two or three films put together Charles Bronson as crackerjack pilot Nick Colton is really enjoying himself in the movie \"Breakout\". Together with his wife, in real life, Jill Ireland as Ann Wagner the wife in the film who's husband Jay, Robert Duvell,Nick Bronson is out to rescue Jay from a brutal Mexican prison. <br><br>Jay was framed by non-other then his grandfather Harris Wagner, John Huston, who together with his silent partners in the fruit and transportation business The CIA. Wagner feels that Jays free spirited and revolutionary ideas are a treat to the future of his company and has Jay arrested in Satiago Chile for a murder in Mexico some 2,000 or so miles away. Thrown before a Mexican kangaroo court, with a paid-off judge presiding, Jay's guilt despite the illogic fact that he can't be at two places at the same time, Mexico &amp; Chile,is a forgone conclusion and he's sent up the river for 28 years in a castle-like Mexican prison.<br><br>Nick hired by Ann to rescue her husband is stifled by Jays sleazy grandpa Harris Wagner who Ann, unknowing that he had her husband set up, is totally trustful of. Nick realizing that the best way to get Jay freed is to do it by air and to keep the plan only to himself and his fellow rescuers Hawk Hawkins &amp; Myrna, Randy Quaid &amp; Sheree North, which leads to the exciting final. Nick not only rescues Jay but also finds out who that lousy creep Cable, Paul Mantee, really is by him making sure, for Harris and the CIA, that his rescue of Jay falls flat on it's face. Cable is to murder Ann's husband if he ever makes it back to the USA, where the Mexican police can't touch him. <br><br>Charles Bronson as Nick Colton and wife Jill Ireland as Ann Wagner really touch off sparks in all their scenes together even though Jill isn't married to him in the movie and they have no romantic scenes in the film at all. Nick's trying to learn how to fly a helicopter didn't go that well at all at the start of his lessons from helicopter pilot Harve, Alan Vint. Later when he took off by himself, Harve felt that the rescue attempt was to dangerous, with only three flying lessons under his belt had even Herve surprised and shocked at just how good he was at the controls.<br><br>Tense action when Nick tries to land and then rescue the very sick Jay Wagner who escapes from the prison hospital with the help of fellow prisoner Sosa, Jorge Moreno. Sosa who ironically was part of the frame-up that put Jay there in the first place may have gotten guilt feelings about what he did to Jay. <br><br>Some really great stunts in the movie with a man falling some 100 feet from a helicopter straight through the roof of a house, with what looked like nothing to break his fall. Later at the airport across the border in Texas at the end of the movie one of the baddies is sliced to pieces, by an oncoming jumbo passenger plane, as if he were a roll of salami.","user":"sol-kay","rank":[21,26]}]