[{"title":"Sharp script and honest satire","rating":10,"date":"12 January 2002","review":"I'm somewhat surprised at the low rating of this film.<br><br>Cannibal Women is a low-budget satire, and I thought a very funny and intelligent one. The script is absolutely fantastic. And the only reason I can imagine for the low reviews is that people either expected a (1) sexploitation flick with gratuitous nudity or (2) a polished adventure thriller in the Indiana Jones tradition. This is neither. It is a low-budget mix of \"Heart of Darkness\" and \"Raiders of the Lost Ark\" as transplanted to (of all things) feminist studies in southern California.<br><br>\nBut it has genuine and unexpected laughs.","user":"lancashi","rank":[36,40]},{"title":"A great satire on feminism and male/female relations","rating":9,"date":"3 December 1999","review":"\"Cannibal Women\" is not only a movie that's so bad, it's good, it delivers right-on satirical jabs at feminism, machoism, and male/female relations. Not only do we have a conniving military and warring factions of cannibal women, but a local male tribe, \"the Donahues\".<br><br>The chemistry between Shannon Tweed and Bill Maher is perfect--this is definitely Tweed's best performance anywhere, and Maher is perfect as a chauvinistic, directionally-challenged jungle guide. Karen Mistal, who has the thankless job of playing college student/mindless bimbo/aspiring feminist/aspiring cannibal woman, plays her role without flaw, as well. Only Adrienne Barbeau, in a cameo role, seems stiff. But somehow, even her performance works.<br><br>For a low-budget comedy, this film surprisingly packs a lot of laughs and even a message or two. Great fun.","user":"monicker","rank":[27,31]},{"title":"I didnt laugh once, but I still thought it was great!","rating":12,"date":"12 February 2001","review":"Yeah, this should be a cult classic! I know of some cheap terrible spaghetti westerns that are more well know than this, which is a shame. I didnt laugh out loud once, not at all, its still amusing and has some good action in it. There were some funny scenes, like when she wanted to hire the mercenaries, and when Bill Maher tired to teach the Jungle men how to be \"real\" men! I suggest it to people who love great cheesy B flicks, like myself! This one is a keeper.  I give it a 7/10.","user":"MarKus-371","rank":[20,24]}]