[{"title":"The original and still the best of the genre","rating":13,"date":"13 January 2004","review":"This film is a classic. A brilliant adaptation of the future and that is way better than the updated version that John McTiernan released which to this day cannot hold a candle to this science fiction masterpiece that was released in 1975. The year 1975 brought out some of the best movies of that year and some to this day still holds its own. From \"One Flew Over The Cuckoo's Nest\",to \"Jaws\",\"Shampoo\",the rock musicals \"Tommy\",and \"The Rocky Horror Picture Show\" to the performances of \"Alice Doesn't Live Here Anymore\" to \"Dog Day Afternoon\",and not to mention \"Nashville\" and the sequel \"French Connection II\",and \"The Eiger Sanction\",these films represented what a year it was in motion pictures especially in the year 1975.<br><br>The film \"Rollerball\"(United Artists,1975),was screenplay by William Harrison and directed by Norman Jewison,who was Oscar nominated for his brilliant direction in such films,\"In The Heat Of The Night\",and the musical \"Fiddler On The Roof\",is no stranger to science fiction material. The film is set in the year 2018 where there are no wars and no crime,but there is only....the Game. In a world where corporations rule and no one asks questions-the vicious and barbaric sport of Rollerball satisfies the violent impulses of the masses. Tuned to their televisions,the people watch the sport of the future which is a brutal mutation of football,the Romanesque gladiator fighting,motorcross and hockey. Jonathan E.(played brilliantly by James Caan) is the champion Rollerball player-a man too good for his own good. The corporation has taken away the woman he loves(Maud Adams),but they won't take away his soul even if the diabolical corporate head(John Houseman)tells him he'd better retire..or suffer the old-fashioned way.<br><br>With some surrealistic imagery,Orwellian theme,and tense action with some of the best action sequences ever filmed,this picture will grip you from the moment the ball rolling out and zooms into the stadium to its chilling cilmax,this movie has haunted audiences as it takes a look into the future and what the future would become,and has a stunning effect. James Caan's performance is something to marvel at and John Houseman's performance as the diabolical corporate executive is a chilling and stalking cold and with some of the strong support from its cast including John Beck,Moses Gunn,and Ralph Richardson.<br><br>The 1975 version is worth seeing..it is the original and still the best of its genre...Don't even bother with the 2002 version with was directed by John McTiernan.","user":"raysond","rank":[76,83]},{"title":"Action-packed and insightful.","rating":24,"date":"24 July 2004","review":"Rollerball is another of those great 70's cult sci-fi films.  It features a great cast of actors and a smart script.  It was notorious at the time for its violence, although that was greatly exaggerated in comparison to some professional sports and entertainment.  It features a futuristic reimagining of the Roman Empire, with gladiatorial games to distract the populace from their bleak existence.  It also predates cyberpunk literature, with ts depiction of a world controlled by powerful conglomerates, a world not too different from the present one.<br><br>James Caan is fantastic as Johnathan E, the Michael Jordan of Rollerball. He continues to succeed in a sport designed to show the futility of individual effort.  The sport is constantly changed to stop him, yet he continues to overcome every obstacle.<br><br>John Housman is electrifying as the head of the Energy Corporation, owners of the Houston Team.  He has conspired with his peers to keep the masses down and use this sport to both distract them and show them that the individual can't succeed.  He grows more desperate as Johnathan E defeats his schemes.  He tries every trick without success.<br><br>The supporting cast is filled with great actors, like Moses Gunn, John Beck, Sir Ralph Richardson (not John Gielgud, as one reviewer stated), Maude Adams, and Shane Rimmer.<br><br>The film demonstrates that the individual can triumph over insurmountable odds and cautions against corporate control of society.  It uses both allegory and speculation beautifully, and packages it with thrilling action. The remake was destined for failure because it couldn't see beyond the action.  The action was only window dressing for the greater themes.  If only more recent sci-fi films were this thought-provoking, or other films for that matter.","user":"grendelkhan","rank":[81,89]},{"title":"As remote from the average film-goer's awareness as 2001: A Space Odyssey","rating":9,"date":"14 March 2002","review":"In deference to Stanley Kubrick himself and the wondrous achievement that 2001: A SPACE ODYSSEY is, was and forever will be, I do not speak of ROLLERBALL in the same breath. Having said that however, here is a film that although lacking the scope, budget and monumental depth of its compatriot, is a totally brilliant piece of film-making, equally awesome in its implications and social comment. Norman Jewison created a masterpiece with Rollerball - understated, misunderstood and undervalued both at the time of its release and later. Perhaps ultimately to its its greatest benefit - the release of the plebeian 2002 re-make which will stand for all time as the most nauseatingly insulting and tastelessly gratuitous reminder to recall the original with perhaps more relish than might otherwise have been the case. No purpose in re-hashing the plot - anyone reading this will already know it. Suffice to say, James Caan's Jonathan E stood for that most basic of human principles - the rights of the individual! As John Houseman, the corrupt and ubiquitous head of the all-powerful Corporation that owns and operates ROLLERBALL inc worldwide, tells Jonathan at one point, \"Rollerball was meant to demonstrate the futility of resistance, no man was ever intended to become bigger than the game.\" This was a society (set in 2018) with media censorship in place to such a degree a centralised computer stores the worlds' entire literary knowledge (physical books being a thing of the past as in FAHRENHEIT 451. Marvellous interspliced sequence with Sir Michael Redgrave as keeper of the world's centralized computer to which Jonathan is drawn, seeking answers to questions he was never supposed to ask. You have to really watch and LISTEN to ROLLERBALL to EXTRICATE from it, what the makers are offering you in terms of reflective contemplation. So many saw the film's middle section as \"boring!\" So is looking at the sky if you have no knowledge of cloud formation, atmospheric beauty or even indeed WHY there IS a sky and what it means in the grand scale of things! Caan's gradual self discovery as to his own identity and purpose is hand-crafted for you during these middle scenes - THIS is what the film is about..not merely the superb action sequences which are so richly photographed and presented in that gladiatorial arena, a colosseum for the new millennium, no more no less! The highlight of the film, if you are able to see it, is the party for Jonathan E, supposedly to mark his resignation but which in fact might be seen as the Energy Corporation's Last Supper! The scenes of the amphetamine-fed yuppies, destroying the trees with the flame-gun has always made me cry, not because I'm a wimp, a greenie or even an anti lobbyist for hand guns, but because of what those terrible scenes stand for and bring to my own emotional recognition...a directionless society that we are right now so unerringly headed for. Look at the expression on the face of Jonathan's ex-wife as she comes to realise where its all gone wrong - not just for herself but for them all. Now tell me this is boring!!!! As has been recognised by some fellow critics, the absolute last scenes of the movie are perhaps the greatest. The point being less subtly made as we see Houseman staring through the glass at Jonathan E, the last man standing, his corporate outline encircled by the reflected flames on the track - hello? does anyone understand this? One of the greats! Watch this film...don't just see it!","user":"uds3","rank":[113,133]}]