[{"title":"Powerful and melancholy","rating":10,"date":"20 December 2001","review":"A neglected classic of 70s film-making, this is perhaps the most \"Japanese\" movie ever made by a non-Japanese. The story is rich and multi-layered, featuring not one but two sets of star-crossed lovers in a brilliant and melancholy examination of contrasting themes of memory, secrets and betrayal, friendship, honor and obligation. The script is both literate and intricate; the characters' motives are almost always obscure until another layer of deception is stripped away. <br><br>Only Robert Mitchum could have done justice to the role of Harry Kilmer, a retired detective returning to Japan for the first time in many years to rescue his old Army friend Tanner's daughter, who has been kidnapped by the Yakuza in a dispute over a debt Tanner owes them. When Kilmer arrives in Japan, he seeks out Ken, the brother of his ex-lover Eiko (played by the astoundingly lovely and talented Kishi Keiko). Ken is a lone wolf, an ex-Yakuza who now runs a martial arts school, and though there is obviously no love lost between the two, Kilmer knows Ken carries an obligation to him for rescuing Eiko and her infant daughter in the early days of the Occupation. <br><br>Kilmer is still bitter about the past, deeply wounded by his love for Eiko, who would not marry him even though she loves him deeply. This was the reason why he left Japan and never meant to return. <br><br>Now, with Ken's reluctant help, he rescues Tanner's daughter, but this only leads to an intensifying spiral of tragic consequences, because nothing is quite what it seems. Only when Kilmer begins to understand the truth of the situation is he able to act constructively.<br><br>Everyone in this film, from Brian Keith to Herb Edelman to Richard Jordan (in one of his first starring roles) turns in a first-rate performance. James Shigeta and Christina Kobuko also deserve honorable mention. But it is Mitchum and Takakura Ken who make this movie.<br><br>This is not an action film in the sense of later -- and far inferior -- efforts like \"The Challenge\" and \"Black Rain\", though there are scenes of intense and graphic violence. Nor does it have a happy ending, although some of the characters do ultimately find redemption and a hope of reconciliation. <br><br>\"The Yakuza\" is a work that deserves a much larger audience, one which will totally engage a thoughtful viewer with its universal themes worked out against the background of a very different culture, with its own mindset and traditions. I give it my highest recommendation.","user":"henri sauvage","rank":[83,87]},{"title":"widely unrecognized gem","rating":8,"date":"9 January 2002","review":"I have to agree with the preponderance of viewers here who rate this as a neglected classic of the 70's. All aspects of the film - performances, script, and direction - raise this to the level of greatness. This is certainly among Mitchum's greatest performances - his subdued, world-weary toughness undergirds the movie. The story as has been noted, is a rich and multilayered one with a sadness that aspires to and quite nearly reaches the level of tragedy. It also must be  noted that this is one of the most effective portrayals of Japanese culture on celluloid. The movie does not shrink from violence; the various scenes of assassination and slaughter could have been done by Peckinpah. The movie deserves a restoration and should be brought to tv in letterbox mode. (Are you listening, American Movie Classics?)","user":"rupie","rank":[44,49]},{"title":"\"I have destroyed his past, and his future\"","rating":25,"date":"25 May 2004","review":"One of the best West-meets-East films made. Great dialogues, very realistic fighting scenes, even though this film has been made so long ago, without any CGI tricks at all, yet the sword fights still look really great. But in my opinion the story, which may be shortly described with one of the sentences spoken by Harry Kilmer (Robert Mitchum) at the end of this film: \"I have destroyed his past, and his future\" - perhaps the story is what it makes this film so unique and timeless. Outstanding performance by Ken Takakura (\"Ken Tanaka\")! If you haven't seen it yet - get it now! And why do I say \"get it\" instead of \"rent it\"? Because unfortunately VHS version available in US is more than 10 minutes shorter, and European VHS versions have even more *vital to the plot* cuts! (More info here: http://www.us.imdb.com/title/tt0073918/alternateversions<br><br>or if it doesn't work try the link under \"Alternate versions\"). Please: don't waste your time on those! I swear these edited versions must have been edited either by some blind and deaf personae, or a child who didn't understood plot at all! Currently the only good, somewhat true to the original theatrical print (just slightly more than 3 minutes shorter), are the 2hr long versions available on the not-so-legal (and not too good quality-wise) VCDs released in Hong Kong and Asia.<br><br>I rated this film very high - and I am not any big sword-actioneers fan, but nor is this movie any kind of sword fighting flicks. Its just a great story that is told (or actually shown) very well, and it deserves full 10/10.","user":"Master_of_My_Domain","rank":[31,34]}]