[{"title":"Karen Black - B-Movie Goddess!!","rating":9,"date":"17 April 2006","review":"Karen Black is too frightening for mainstream cinema. You couldn't watch her in a romantic comedy without wondering whether she's going to kill and devour the male lead. But those freaky crossed eyes and that off-kilter sexuality make her a magnetic screen presence and we're all lucky that she found a handful of directors who were able to use her well without rendering her ridiculous (\"Five Easy Pieces\" by Rafelson) or shrewish (\"Nashville\" by Altman). Of all Karen Black's worthy star vehicles (an extremely short list), \"Trilogy of Terror\" is far and away the standout.<br><br>The first two pieces are mildly diverting -- the first, \"Julie,\" has an entirely untelegraphed twist that feels like a cheap trick, so it's the weakest link. Still, it coasts along nicely on its creepy camera angles and Karen's dark-star power, and the last couple of scenes are just unsettling enough to whet your appetite for the delights to come. The second segment, \"Millicent/Therese,\" is some standard mid-70s horror fare, laced with madness and hints of sexual perversity, that would be a \"Flowers in the Attic\"-style yawn if it weren't for the lovely Karen, who plays warring sisters: prim, evangelical Millicent and slutty, predatory Therese. As Therese, she wears a ridiculous blonde wig and sashays around the set like a drag queen, a fully intended foray into pure camp made even more bizarre by Karen's much more nuanced performance as repressed, mousy little Millie. Slowly you wonder if all of Therese's evil is a figment of . . . well, I don't want to spoil it for you.<br><br>Ol' Karen saves the best for last: \"Amelia.\" As played by Karen Black, Amelia is a complex, very modern, very normal woman confronted with an utterly conventional dilemma: does she spend Friday night with her boyfriend or her mother? But this isn't a sitcom starring Valerie Harper, it's a horror movie starring Karen Black and something intensely weird happens -- the Zulu doll she has bought as a present for her boyfriend comes to life and starts chasing her around the apartment! (Sound familiar, \"Chuckie\" fans?) It sounds ridiculous, and it would be if it weren't for the magnificent Ms. Black. She believes. There is no ironic distance between actress and character, no winking acknowledgment of the absurdity of the situation, no excess of histrionics. Dammit, Karen is being menaced by a vicious, spear-wielding figurine and you are terrified for her! Maybe you could make the argument that the vignette is an attempt to juxtapose the civilized and the savage and to expose our true uncivilized nature. But no. It's an ugly doll attacking a cross-eyed actress. It's silly. It's stupid. It's pure entertainment. If you haven't seen it yet, go get it now.","user":"Putzberger","rank":[45,54]},{"title":"Karen Black Falls Prey","rating":31,"date":"31 July 2001","review":"Dan Curtis directs this made for television anthology of three stories written by horror-meister Richard Mathseon.  Matheson wrote the teleplay for the third story \"Prey,\" while Richard F. Nolan(writer of Logan's Run and much more) did so for the first two stories.  All of the stories star Karen Black in the lead and the stories are titled with the female names \"Julie,\" \"Millicent and Therese,\" and \"Amelia.\"  All three stories are to varying degrees effective.  I really enjoyed the first story about a college student who seduces his seemingly coy college professor only to see things differently later.  Curtis plays with his audience and shows scenes from The Night Stalker at a drive-in theater.  Look for a very young Gregory Harrison at this episode's close.  The second story has two sisters who hate each other finally settle their differences..in a very unique way.  George Gaynes helps out in this episode as a doctor.  The story works because of its acting even though I knew what was going to happen long before it did. Karen Black really gets to show her acting range in this one, and as Therese she is one real knockout.  Easily the best of the trio is the third story of a woman bringing a Zuni fetish doll home only to somehow become the prey of this one-to-two foot doll.  The special effects here might seem campy by today's standards but when this came out they were truly frightening...and still powerful I think today.  The doll looks very scary and attacks with quite an intense ferocity.  This story should put you on the edge of your seat, and is very different in tone and style to the first two.  Trilogy of Terror is a good, fun-filled romp through the works of one of our best authors...Richard Matheson.","user":"BaronBl00d","rank":[32,40]},{"title":"Voted 9 on the Doll alone!","rating":9,"date":"31 July 2005","review":"EVERYONE I know that's ever seen it says the same thing. That doll freaked them out! The doll in the last story is worth it all! You watch this and you won't be able to go to sleep till you make sure any dolls in your house are locked away! I think the dolls face is so well done, so damned creepy that even with the somewhat limited \"special effects\" that were used to do the doll, it just freaks you out and afterward any little sound in your house will make you jump or send a shiver down your spine! For a made-for-TV movie from 1975 it is fantastic! I forget how much they paid to get the doll to work, but I think it was something like $100,000. Lots of money back then just for a single item for a movie, but well worth it! The stories are pretty good too! Worthy of the Twilight Zone, or Outer Limits! Karen Black is great in this. Of course, this was her time to shine in the mid '70's. If you like the Chucky movies, then you'll love this one.","user":"Buskieboy","rank":[32,41]}]