[{"title":"One of the greatest movies of the late 20th century","rating":10,"date":"14 July 2004","review":"There are so many comments written about this movie, I almost don't want to write anything - but here I am anyway :)<br><br>Though everyone is entitled to their own opinion, it disturbs me to read negative comments that WOD is 'too slow' or that Wenders should have been a still life photographer. I think that some people are missing the point of this movie. Wenders filmed this after having been part of the Hollywood machine for several years, and had grown sick of the cookie cutter films that were (and still are) being made in that tradition to produce ticket sales. Yes, this movie doesn't have loads of action and car chase scenes and guns and sex. It does offer some interesting perspectives. The consistent third person view and 'objectification' of the viewer is one aspect. Watching WOD, you don't feel the typical draw into the movie as so often is the case, but rather are a bystander, looking through a window, with your own thoughts and ideas a part of the movie, not the other way around. WOD doesn't allow you to become a subjective part of the film; it 'pushes' you away from empathizing. Even the camera angles and shots motivate this sentiment. The goal and direction of the film are presented without struggle or thought; you know that Damiel wants to be with Marion. He tells Cassiel this, and the only question is - how will he achieve this goal? <br><br>WOD belies a sense of traditional film-making. Peter Falk is presented as perhaps the 'idea' of history as fans call out 'Colombo!' The angels are bound to Berlin, existing in a purgatory neither heaven or hell, unable to communicate. The trapeze artist from a traveling circus representing freedom - not only freedom from an everyday lifestyle, but also the key to Damiel's freedom. This movie contains so many interesting ideas and perspectives, that when watched with an open, curious mind, it is fascinating, mesmerizing, calming and inspirational. Filmed entirely in Berlin, the city is not a traditional definition of beautiful. But the industrial, modernist, post WW II reconstructed Berlin is stunning and diverse, providing the perfect background for this modern classic. I cannot recommend this movie enough. But please watch it with open eyes. In the same sense you cannot listen to the music of Schoenberg or Stravinsky as you would Mozart, you cannot watch Wings of Desire as you would a Spielberg movie.","user":"HermesPan","rank":[240,278]},{"title":"Our Town for the Cold War Generation","rating":9,"date":"22 February 2005","review":"If my grandchildren ever ask me what it was like back in the Cold War, I'll tell them to watch this movie. It is both frighteningly bleak and lyrically beautiful. It captures the spirit of the times (Western civilization immediately before the fall of the Berlin Wall) better than any movie I've ever seen. And it manages to be a love letter to those times while also showing the place and time in all its inescapable ugliness. <br><br>The overall plot moves forward pretty nicely for a movie where plot doesn't seem to matter all that much, and there are some beautiful vignettes, beautifully photographed, acted, and directed. I'm not sure how anyone can make it through the movie without falling in love with Bruno Ganz's angel. I think the movie's lyricism holds up well on multiple viewing -- as long as you liked it the first time. If the self-consciously art-house form bugs you, however, or you find the screenplay's \"poetry\" to be too facile, you'll probably find this movie grating. I, however, have never seen people reading silently in a public library without thinking of this movie . . . .","user":"bejasus","rank":[83,96]},{"title":"human life has value","rating":10,"date":"19 May 2004","review":"﻿In the first scenes after the opening credits, we see an aerial view of Berlin, but this is a Berlin that doesn't exist anymore.  It's a city divided, between East and West, that still bears the scars of the second World War, and can't rebuild where the Wall stands in the way.  There is a vast vacant lot where the cultural center of pre-war Berlin stood, with the facade of an old station, and nearby stands a bomb-shelter and the tower of a bombed-out church.<br><br>It is from this church where an angel stands looking out over the city, and then we see the people going about their daily lives.  All this is shot in black and white, and we realize that we are seeing the world through the angel's eyes, seeing the same colorless world and hearing the same thoughts of the people around.  As the story goes on, we realize that this is not just one angel in Berlin, for he goes to a car showroom, and compares observations with another angel.  Then we go to the library, which is filled with angels.<br><br>The first library scene is my favorite scene of the whole movie.  It is here where we see many different people studying, and their thoughts reverberate around the space until they are just a murmur, which becomes music.  Because there are so few distinct voices, it doesn't matter that they are in German, which I don't understand.  However, there was one young man studying the creation story of Genesis in Hebrew, which ties in with a later point where the two lead angels are discussing how they witnessed creation.  First they saw the glacier recede, then fish and animals appear.  They laughed when they saw the first biped, someone who shared their image, but they stopped laughing when the people learned how to make war.<br><br>As idyllic as the angels' lives are, it is through the pain we humans endure that know we are fully alive.  And this is what the angels miss, to see colors, to touch, to taste, to smell, the ability to love and affect others' lives.  The children can see them, but the adults may at times only feel some vague presence.  They lay hands on people's shoulders, to try to understand their feelings beyond mere words.  This is illustrated by a scene on a rooftop, where a man is about to commit suicide; as he sits on the ledge, an angel lays a hand on him as if holding him back, and when he jumps, the angel shouts `no!'  For these angels are observers, spending their time being a presence among the living, not just to primarily serve as ushers to the afterlife (where I was sorely disappointed after watching \"City of Angels,\" the American re-make).  They are not harbingers of doom, but benign symbols of a creator's concern for humans.<br><br>Don't be turned off by the fact that it's in black and white, because one thing that really makes an impact is that it's only through viewing as an angel is it in monochrome, because when humans see the world, it's in color. A poem continues throughout the movie and ties everything together, repeating \"When the child was a child...\" and we realize that humans are the children, the ones younger than angels, just learning and enjoying life. The music adds a lot to the movie, since this film is more visual than verbal, which means that subtitles don't get in the way.  I can't say enough about this filmit's wonderful!","user":"cindy_bcr","rank":[147,175]}]