[{"title":"Borowczyk - The Best, Not The Beast","rating":25,"date":"25 March 2003","review":"Anyone who thinks of Walerian Borowzyk as a purveyor of upmarket smut for the wet raincoat brigade (Immoral Tales, The Beast, La Marge) is in for a shock if they see Story of Sin. A tragic 19th century romance, based on a Polish literary classic, it's in the grand 'woman destroys herself for love' tradition of Tess of the D'Urbervilles, Anna Karenina or Madame Bovary...although our heroine Ewa (Grazyna Dlugolecka) has a more eventful life than all three of those ladies combined! The sheltered daughter of an impoverished and decaying noble family, she moves from illicit passion with a married man to infanticide, prostitution and murder.<br><br>Yet if the details of Ewa's story are sensational, Borowczyk's handling of them never is. The sex and nudity are brief and oblique - all the more powerful for being conveyed in sharp flashes of visual poetry. At their first meeting, Lukasz (Jerzy Zelnik) glimpses Ewa's corset as it hangs, discarded, on a bedpost. In one night-time encounter, the couple make love in a horsedrawn cab, lit by bursts of lightning from an oncoming storm. In the most famous image, Ewa lies alone on her bed - her naked body strewn with rose petals from a bouquet Lukasz has sent in secret. Reminders, if any are needed, that Borowczyk has the most ravishing erotic eye this side of von Sternberg.<br><br>For both these directors, the censorship imposed by a Puritanical regime - the Production Code in 30s Hollywood, Communism and the Catholic Church in 70s Poland - forced overt sexuality off the screen and into the (well-trained) imagination of the audience. Rather than focus on boobs, bums and 'money shots,' Borowczyk suffuses his whole screen with stifled eroticism and tragic passion. Most likely his masterwork, Story of Sin not only evokes memories of Sternberg and Ophuls, but can sit comfortably on the classics shelf beside them.<br><br>And nary a masturbating nun or ejaculating monster in sight...<br><br>David Melville","user":"dwingrove","rank":[37,43]},{"title":"Story of a Sin: more than a moral tale, a portrait of turn of the century Polish society","rating":7,"date":"24 February 2016","review":"Story of a Sin should be appreciated as more than a moral tale featuring abundant nudity and open depictions of sexuality. In addition to conveying a taste of Polish society at the turn of the last century, it's also an impressive production of 1970s Polish cinema, and reminiscent of Wajda's The Maidens of Wilko and The Promised Land.<br><br>I want to add my impressions about the movie as a female viewer. It reminded me of many other European films made in the 1970s that were publicized by ads that showed a naked woman in an embrace with a fully clothed man. There is a lot of nudity of Story of A Sin: nearly all of it is the lead actress showing her bare breasts and behind. In the scene with the nobleman both are shown fully nude, and there are some shots showing his flaccid genitals, but they're less than a minute long.<br><br>That said, the film's story is an old fashioned one warning that after the first sin, it's a long slide down to the gutter. By getting involved with Lukasz, a man seeking a divorce, young Ewa ends up estranged from her family, working in a sweatshop in a small town. After Lukasz departs for Rome in order to try to secure his divorce Ewa finds herself pregnant and abandoned. She learns that Lukasz has been jailed in Italy for forgery and theft. She gives birth alone, kills her baby, then steals money from her kind Jewish landlord. With the help of a nobleman, one of Lukasz's friends, she travels to Italy to find Lukasz, but the prison guards tell her he has been released and has left the country. While looking for him in France she hears that Lukasz has married a wealthy woman. She sinks into prostitution. Then a man who has been stalking Ewa attacks her and she drifts into a life posing as the man's wife, helping him and his henchmen con and rob others. She is forced to participate in a con that traps her nobleman friend; she kills him while he is making love to her. She escapes from the criminals thanks to the help of a reforming Count who takes her to his estate which he has converted into a refuge for fallen women. He gives an interview to reporters saying how he wants to promote reforms for Poland- I could see in this scene. why the then Communist Polish Government approved of the film. But Ewa is seduced back to her life with the criminals by one of the henchmen (who looks like Erich von Stroheim) telling her he has been sent by Lukasz to find her.<br><br>The film may feature sex, violence and nudity but it is very moral, and seems to lavishly portray Ewa's degradation as a warning to everyone - especially young girls- that one sin can lead to a sorry story of destruction. As well as being a cautionary tale, its a portrait of Polish life in the early 1900s, when Poland was not an independent country. Warsaw and the areas of today's Eastern Poland were under Russian rule ( other sections of today's Poland were then part of Germany and the Austrian Hungarian empire). The costumes, sets, and scenery are lush, and give an rich impression of life for the wealthy, the gentry, the working middle classes like Ewa's parents, and the poor, like Ewa's co workers in the offices and clothing sweatshop. The government probably encouraged the frank depiction of the seamier aspects of Polish life under the Czar (His portrait is displayed prominently in the offices where Ewa works as a copier). The film doesn't hold back in showing violence, the restrictions of the copiers' lives by their manager (he refuses to give Ewa the day off so she can visit Lukasz, who she's just learned has been wounded in a duel with the nobleman, so she abandons her job on the spot), the vulgarity of the girls in the sweatshop, and the poverty in Warsaw and in the small towns. In one scene in a tavern a waitress covers a table with doilies made of folded and cut newspaper pages. The film doesn't follow Party lines completely. It arouses empathy for noblemen like Eva's admirer, people with titles and estates but little money. It was heartening seeing a sympathetic portrayal of the Jewish landlord.<br><br>The scenes of the countryside are glorious. I recognised Warsaw locations in several shots, particularly Łazienki Park. There is much to delight the eye and much to enjoy in the Story of a Sin: it gives the viewer more to ponder than the consequences of sins of the flesh.","user":"clivy","rank":[5,7]},{"title":"Moderate","rating":4,"date":"18 September 2015","review":"People either praise this film or rate it very low. Unfortunately, I was bored with this production. In a way, there are plenty of events here, but you get the impression that several stories were cut out from something and directly glued together without any explanation what happened between them. Those pieces are joined together by leading female character but sometimes it feels like the other characters popped out randomly. I do not understand this but plenty of things happen and there are hardly interesting to follow. The novel by Żeromski was not that long and the film is quite lengthy. Nonetheless, it could possibly be better when converted to miniseries, obviously with some extensions to understand the motives and suffering of the main character (compare Lalka film and series). Disappointing, but I would not discourage from seeing and making one's own opinion about it.","user":"majdo007","rank":[7,17]}]