[{"title":"Disturbing","rating":8,"date":"3 February 2005","review":"I first found this film for rent back in the 80's. It was the old Paragon rental and I really liked it right from the get go. I had actually already seen Horror of the Zombies (aka El Buque Maldito) which is film numero three in De Ossorio's quadrilogy of the Blind Dead. I initially found that one to be a waste but seeing Tombs got me back into the swing of things.<br><br>Yes this film is slow moving but most Eurohorror films are a little on the slow side. That is because the spend more time on mood and atmosphere instead of clonking the audience over the head with the point of the story. Like Squonkamatic said his review of this film, you turn your brain on not OFF when you watch these types of films.<br><br>Tons of atmosphere in this film. The Templars rising from their tombs and then mounting ghostly horseback! Well you just cant much better than that! I absolutely love the soundtrack as well with the moaning/chanting Templar voices. The ending of this film also still packs a punch. THAT is a key sequence that must be seen it's complete form and THEN will you know why I titled this review as \"disturbing\".<br><br>Pick this up if you can. I have the double DVD from Anchor Bay which is outta print. Stick with the Anchor Bay VHS or wait because it might be coming out again, supposedly in late 2005. All FOUR films in fact if the cards are played right and the planets align. I will have my fingers crossed and my prayers prayed for Blue Underground who has taken on this task.<br><br>Rock on!","user":"Zombiewalkin","rank":[36,41]},{"title":"The skeletons on horses in slow motion was epic man. Decent atmospheric horror film n the best in the series.","rating":7,"date":"29 April 2017","review":"I had seen only one film from the blind dead series (Return of the blind/evil dead) in the mid 80s on a rented vhs.\nI saw this just few days back on a dvd.\nThe story is about 2 girls n one guy who goes on a weekend trip. Sounds erotic huh. Don't get your hopes high. On the train ride there, one of the girl is overcome with jealousy and jumps off the train, deciding to spend the night in some nearby ruins. Wtf? It is a horror film n so the ruins are home of the blind dead knights who were into some satanic rituals until angry villagers killed them n left them for the crows to peck their eyes out. Some decent cinematography. It is an effective atmospheric film. The locations were really good. The abandoned n ruined village in the middle of nowhere, the endless fields, the only single train running n always passing by the ruins n the best part- the slow motion shots of the knights riding their horses in pursuit of their victims. When the knights r on the foot, they r slower than the snails but suddenly out of nowhere they get their horses n once they r on their horses, they ride faster in slow motions. Very creepy though. The skeletons, with their dark, odd beard hair features, actually look as if they've risen from their graves. Good effects. Looking forward for the remaining two.","user":"Fella_shibby","rank":[29,33]},{"title":"This zombie films mostly relies on atmosphere and suspense instead of gore and action","rating":9,"date":"10 May 2007","review":"\"La noche del teror ciego\", tells the story of a legion of evil warriors who lived through the 13th century, known as the Templar Knights. These warriors wanted to live forever and the way to achieve that, was by drinking human blood and offering sacrifices to Satan. So The Templar Knights would gladly torture and use innocent maidens for their rituals and please their master. However, their atrocious deeds come to an end, when the Holy Inquisition decides to punish them, by hanging them in public. Several centuries later, in the 1970s, two girls named Virginia and Betty go on a trip together with a guy named Roger. After a pathetic soap opera incident, Virginia gets jealous of her friends and jumps off the train. Landing on a strange place, she finds shelter in some kind of forsaken fortress in ruins. Unfortunately, that place is also a shelter for some hideously frightening creatures that become alive during the nightfall until dawn. Those creatures are, in fact, the Templar Knights, who come back to life as zombies every night. <br><br>Director Armando de Ossorio didn't try to please a blood-thirsty audience that wanted brutal killings for an hour and a half. For the contrary, the body count may be humble, but \"La noche del terror ciego\" takes the zombie subgenre to a different level, in which the creatures are more dark, mysterious and frightening than gory and brutal. If you are a zombie lover, you're probably going to love this film and if you are not, you might be pleasantly surprised by this.<br><br>I have read on the message boards that there were a lot of gore lovers dissatisfied by the lack of blood and guts, but I think this film contains a pretty well-brought-up amount. My favorite scene in the entire movie is one in which one of the girls is trying to hide from the zombies. Since the zombies are blind, the girl stays in the same room with them and the only thing she can do to remain undetected, is staying absolutely quiet. But since she's so afraid and tense, her heart starts beating more and more quickly and all of a sudden, we see a close-up of her chest, pointing out that she's on the verge of either fainting or running for her life. The living dead knights hear those heartbeats and turn to the poor girl, who has no choice but finally running away in fear, trying to avoid the nightmarish creatures. This was perhaps one of the most atmospheric situations I have ever seen in a zombie flick. To be honest, most of the chasing sequences were practically faultless, but that one in particular had to be remarked. Reading the message boards, I also came across some people who also complained about a few unresolved questions like: \"How could the zombies hear?\", \"Where did they get the horses?\" \"How come they were so strong if they were only skeletons?\". The answer to all those questions could be: \"this is a horror movie about living dead creatures and it's really not supposed to be realistic\". To be honest, I think the zombies were more believable than the pointless lesbian story between the two girls, which didn't serve a purpose to the story. Then again, most couples in horror movies make no sense, anyway.","user":"Milo-Jeeder","rank":[18,20]}]