[{"title":"It's called Destroyer for a reason","rating":10,"date":"18 March 2011","review":"Many people who review this have called it a slasher movie. This is entirely inaccurate, because the killer does not stab or slash his victims to death, he DESTROYS them. It's sort of like wrestle-maniac, in that the killer is maniacal, and Destroys his victims only using his bare hands along with novelty weapons akin to steel chairs used in wrestling. The movie itself licks ass, but within the retarded plot are enough bizarre, hilarious and awesome scenes to make it worth walking. Rent it with a bottle of malt liquor and some pork rinds, scrape the sticky lint coating off of your VCR, and get ready for some low quality junk with brief flashes of greatness (and breasts) between long awkward stretches of crappy videotape. <br><br>Best appreciated with one hand on the fast forward button to shorten the rough sections with no boobs or Alzado.","user":"dick_james","rank":[11,13]},{"title":"One-dimensional fun","rating":5,"date":"5 December 1999","review":"At first glance, Destroyer looks like a very promising film for horror fans on paper. In an era where the slasher flick was in its prime, it looks as if this film sets itself apart from the rest. It features a human enemy who seems to be more of a genetic freak than an indestructible demon who does not target teenagers, as the bad guy usually does in recent entries of the genre. However, all the positive points end there and what we're left with is another excessively gratuitous gorefest that most horror fans won't take seriously.<br><br>Beyond Anthony Perkins, there are no seriously notable names in the movie. It's too bad that such the horror icon did not have a notable body of work after his defining performance in \"Psycho\", making several mediocre \"Psycho\" sequels and b-movies like this. Nevertheless, he plays his role as skin flick director to a T. Other than the two heroes, everyone else in the movie is either there to get killed or say a few lines. And the heroes aren't even of note either. The only difference they have with everyone else in the movie and in the number of lines they have. There is never any development of their characters, so you don't know what special qualities they possess that make them the good guys in the end other than mere coincidence and serendipity.<br><br>If there's one thing the movie has going for it, it's the way some of the characters get dispensed. There's a nice scene with a blowtorch and the movie's best part, involving a huge drilling device (as seen on the video box). However, as the movie goes on, the scenes become a little less graphic though we are treated to some body parts strewn around and some wax-museum quality bodies. Credit must be given to Lyle Alzado, who looks VERY menacing as the main bad guy. He shows a bit of acting ability in this movie. Throughout his brief career acting after football, which was cut short after he sadly succumbed to brain cancer, he was thoroughly underused as a main villain in movies.<br><br>In short, the Destroyer is a decent weekend b-movie. Its partly refreshing perspective on the slasher genre and its almost humorously over-gory scenes make it a fun movie to watch and laugh at with a few friends. Look for some nice (if inadvertent) homages to horror classics the Shining (with the blood on the wall sequence) and Friday the 13th (with the gotcha! end of the movie). Finally, be sure to sit through the credits for a very weird name for one of the movie's songs. The laughs are definitely worth a cheap rental.","user":"Jtalledo","rank":[9,13]},{"title":"Pretty routine and mostly forgettable 80's slasher","rating":5,"date":"27 October 2016","review":"I have not seen Destroyer in many years. I remember thinking this was pretty awesome as a teenager and was a favorite title to rent back in the day. Unlike many other childhood favorites, Destroyer does not hold up as well. This stars former NFL football player Lyle Alzado who plays a vicious serial killer that short circuits his electric chair, causing the prison to lose power and starts a prison riot. There is no trace of Ivan Moser(Alzado) and the prison closes with Ivan Moser's disappearance giving him legendary status. Two years later a film director(Anthony Perkins) uses the film as a set for his low budget skin flick(a women in prison style exploitation movie). Unfortunate for the viewer this stuff is not very interesting. Alzado does pop up and starts killing people off one by one. There is almost no character development on Ivan Moser to explain his back story on how or why he became a homicidal lunatic. Alzado's roid rage rampage is the highlight of the film. While the juice may have helped his performance on the football field, it did not do much for his acting. However, it is Alzado's hulking anabolic presence that separates the film slightly from other slasher films. Alzado was brutal here and there are some good kills here, but the film as a whole is not very good and does little to elevate it from standard slasher fare. Performances range from decent to complete crap and while some of this material is so bad its good, as a whole this is pretty bad. I would not say this film is unwatchable, but now I know why I forgot about this movie for twenty years.","user":"dworldeater","rank":[2,2]}]