[{"title":"Another Part of the Charles M. Schultz Legacy","rating":8,"date":"25 February 2000","review":"I was a 21 year old working as a projectionist in a neighborhood theater when this film was released and I had the opportunity to help get it up on the screen. This seemed like such a nice and  enjoyable gem back  then, with some scenes as breezy as a summer's day and others with a somewhat darker but thoughtful tone (themes of rejection and the sadness of separation). It was an early \" buddy movie\" shown pointedly in the cross-country  journey that Snoopy takes with Woodstock. Some scenes are reminiscent of a Hope and Crosby \"road\" picture. There is a delightful song sung by Shelby Flint in the film....she would later sing another in the first rate animated film, The Rescuers. I actually tracked down a couple of her albums as a result. I don't have children, but I still think this is a delightful film and I have my own personal video copy. Good for all ages.","user":"geode","rank":[21,21]},{"title":"Breaks yer heart...","rating":26,"date":"26 October 2000","review":"I first read the book adaptation of this in 4th grade, when I was 9, about '76. I was crushed, especially by the scene at the farewell party for Snoopy, when Charlie Brown goes to the podium and tries to find the words to say goodbye to his dog, his friend. He cannot. I was choking up really bad, having had a collie for some years at that time, I could not fathom not having him around, so it hit home.<br><br>Now when I think of it, I also enjoy the music, the trip the twosome-Snoopy and Woodstock, take, the 'No Dogs Allowed' running themes, the over all melancholy feeling that pervades the film.<br><br>I think its the best of the Peanuts flix, and recommend it highly today too.<br><br>*** outta ****","user":"gazzo-2","rank":[18,20]},{"title":"As it was with BLACK SABBATH, Charlie Brown is going through CHANGES","rating":27,"date":"27 June 2004","review":"This film rocks. Its funny, its sad, its more touching than any cartoon has a right to be. In it Low-man-on-the-totem pole Chalie Brown cuts himself on a metal dog food can and laments to his ungreatful beast that after \"All I do for you I get no thanks\". Later in the film Snoopy receives a letter from a mystery girl in a hospital and he rushes to her side. We find out this little girl Lila was Snoopys original owner who had to give him up when her family moved. They had brought Snoop to the Daisy Hill Puppy Farm and the Brown family gotr him for Charlie Brown after he got a mean trick played on him by a kid in a sandbox at the neighborhood playground. Now the question is who will Snoopy end up with: Charlie or Lila? Even though snoopy has never been a character with much depth you can actually TELL he's torn to where his loyalties lie. (Your under the impression that he wants to go home to the PEANUTS but because of Lilas illness he cant bear to leave her either). I remember watching this as a child and thinking the \"NO DOGS ALLOWED\" parts were very funny. I didn't remember how sad this story is, especially Charle Browns song he sings late at night losing sleep wondering where Snoopy is and if he's really gone for good. The song is about how just as life seems good \"IT CHANGES\" and something messed up happens and sometimes you just wish that life had more \"Hellos\" than \"Goodbyes\"...the song is a true heart breaker and if I could write the lyrics (I don't know them all) I would. It almost reminded me of Ozzy singing \"Im Going through CHANGES\"...maybe thats just me. Anyway, SNOOPY COME HOME is a true classic that should be in every child's collection. My best friend is pushing 40 has no children and has confessed to me that this was the most touching childhood special he can recall. My mother who is in her 60s watched it once while babysitting my daughter and thanked me for packing that video in the sleepover bag...she held onto it and watched it again stating \"That was the best Charlie Brown special i've ever seen!\"","user":"mamamiasweetpeaches","rank":[8,8]}]