[{"title":"Made me laugh so much I had a side stitch","rating":22,"date":"22 April 2004","review":"Picking up a couple of years after the original, tomatoes are now banned - which has ruined the pizza industry - and the unseen mad scientist who chalked up those giant killer tomatoes in the first film, Dr. Gangreen (John Astin) is up to his old tricks again, only this time he's using music to make tomatoes into people, and depending on the type of music being played, that determines who/what the tomato becomes. Playing sexy jazz music produces sexy blond tomato women, playing Salsa music produces Carmen Miranda, playing Church music produces the Pope, playing pop produces either a pre-white Michael Jackson look-a-like or a Don Johnson look-a-like, or if you play rock music, you get big, burly military tomato men.<br><br>\nAs Charlton Heston's character from \"Soylent Green\" would say: \"The killer tomatoes are PEOPLE!\"<br><br>Our hero, Chad Finletter(Anthony B. Starke) falls for the attractive one time tomato Tara (Karen Mistal). Unfortunately, Tara can be changed back into a tomato whenever she hears a certain musical chord.<br><br>\nFull of gags (like the aforementioned multiple musical interpretations of a tomato) that include a prison dividing its cells between \"Really bad guys\" and \"former political aids\", the mime stalking Chad &amp; Tara during their musical montage dating sequence, pot shots at how films have to feature tons of marketing in order to have a budget to get made, pot shots at bad movie marathon hosts and game shows, and let's not forget MY personal favorite, the talking teddy bear that calls out for help when Rock Peace tries to smother it. Film also features a more coherent \"plot\" (as it were) and served as the blue print for the animated series that later aired on Fox Kids.<br><br>Keep an eye out for it. George Clooney makes his film debut as Chad's friend and pizza co-worker Matt.","user":"DarthBill","rank":[25,26]},{"title":"Funny, but where's the tomatoes?","rating":20,"date":"20 July 2000","review":"Being a huge b-movie fan, I had to see this movie. It is VERY funny and entertaining and still a b-movie even with a larger budget, but the only footage of tomatoes moving and attacking people (the best part of the original) is taken from the original \"attack\" film. Here instead we got tomatoes that look exactly like people. But when you buy an \"attack of the killer tomatoes\" movie that shows a giant killer tomato attacking on the cover, you expect to see a giant killer tomato attacking in the movie! John Astin as Gangreen was funny, but I like the original movie's reason for tomato attacks. In the original, man altered tomatoes to make them better but accidently gave them the ability to grow and attack people.<br><br>In this movie that is all ignored and now the killer tomatoes were made by a evil professor in his basement.<br><br>I think the original plot AND movie are much better, but this films is still very funny in it's own way. And I am surprised it got away with many of the raunchy jokes while staying PG.<br><br>Recommended if you want to laugh.","user":"ashspicefilms","rank":[22,23]},{"title":"Funnier than it has any right to be..","rating":10,"date":"10 October 2003","review":"I had fond memories of the cartoon, but realised that I'd never actually seen the movie.<br><br>This is a perfecly silly, intentionally cheesy, 80's classic. The premis is so silly and everyone involved (especially Clooney) is so obviously just having FUN making it that the humour is just utterly infections.<br><br>The knowing looks at the camera. The exaggerated dramatics. The tomoato transformation effects. FT!!!!<br><br>I LOVE this movie and heartily recommend it as a classic \"B\" movie.<br><br>You cannot beat this film for a silly giggle. All those po faced people who claim its not amusing need a humour transplant.<br><br>all together now.. (sings) \"When Big breastd giiiiiiirllllllllS, go down to tthe beach....!\"","user":"snesgirl","rank":[14,15]}]