[{"title":"One Of a Kind","rating":9,"date":"5 September 2002","review":"This late fifties whodunit has some interesting credits. It was directed by the able and eclectic Howard Koch, and features three quite different actresses in major roles,--Mamie Van Doren, Anne Bancroft and Marie Windsor. Suave character man John Dehner is cast as the local lawman; ex-Tarzan Lex Barker is the male lead; Stuart Whitman and Dan Blocker have small roles; and Barker wrote the music score. This is the only movie I have ever seen that features a murder suspect who is a bitter, woman-hating man, psychosomatically paralyzed from the neck down, who can't even pour his own drinks or light his own cigarettes. Ron Randell plays him marvelously, and had the film been directed by Ingmar Bergman would surely have won a Best Supporting Actor Oscar. I wouldn't quite call this movie trashy, but it has a trashy feel to it, as it comes across in some ways as a sort of Southwest version of Peyton Place crossed maybe with Anatomy Of a Murder, the small-town black and white mood of which it strangely anticipates. Everyone in this movie has a secret. The question is, whose secret is murder? The pacing isn't strong here, and the dialog is variable. William Margulies' photography is excellent, however; and the settings,--the motel resort and small desert town--are perfectly realized. There is a nice feeling for people whose lives have fallen just short of the big time, and who are angry about it. As a result, more than in most movies, everyone seems more than capable of being a killer. I especially like the sense of isolation in the film, and with it the edge of danger. As with so many crime pictures of its era, it seems to be trying to say something about American life, and how materialism and ambition are destroying it. With its acerbic invalid in one corner, and its muslceman in the other, and all the beautiful women gallivanting about and making life miserable for everyone, this one, with sharper writing and a sense of the absurd, might really have risen and become an Antonioni-like commentary on the American Dream. As it stands, it doesn't come close, though some of its characters and images linger in the mind long after its over.","user":"telegonus","rank":[41,51]},{"title":"\"Missing Link\" found -BLACK STOCKINGS required","rating":8,"date":"29 September 2006","review":"THE GIRL IN BLACK STOCKINGS and SCREAMING MIMI, both made at the tail-end of the American Film Noir cycle (1941-1958), predicted something wicked this way comes -a savage darkness that would reach fever pitch in Alfred Hitchcock's PSYCHO just two years later. This kind of \"noir\" would eventually be mirrored in the Italian gialli of the '60s and '70s before finally coming home to roost with Brian DePalma's DRESSED TO KILL in 1980 and beyond. THE GIRL IN BLACK STOCKINGS is a lynch-pin and unique for a number of reasons. Female serial killers are a rarity in real life -and rarer still in films up to that time- and she's a brutal sex-slayer of women no less, possibly a film first. The film's \"Americana\" Utah resort locations (with wardrobe by \"The Pink Poodle of Kenab\") are used to excellent sun-shiny effect; the outdoor scenes reflect a \"normalcy\" that belies the darker indoor melodrama and the film's stark B&amp;W low-budget TV look and feel shows up in THE SCREAMING MIMI as well, accounting for a lot of their dark charms. The \"gender confusion\" of these films manipulate the audience shamelessly in much the same way PSYCHO would and shows that horrible things can happen in broad daylight, a shower -or a lighted room. Midway through THE GIRL IN BLACK STOCKINGS, the killer opens the door to a couple's room and watches while they make out. After getting a voyeur's thrill that sets the twisted psyche raging, the killer barges in, knocks the man out and butchers the girl!<br><br>Lawyer Lex Barker (more a giallo hero than a noir anti-hero), in Utah to get away from the rat-race of L.A., gets sucked into a whirlpool of sex and savagery in a shocking opening sequence that sees him use his cigarette lighter in the dark to bring to light the mutilated body of a woman. His date, runaway bride Anne Bancroft, is in Utah escaping a marriage where her husband made her do such \"shameful\" things that she had to escape him. There's no dearth of suspects and potential victims, everyone has sexual hang-ups and the cast plays those hang-ups to the hilt. The resort's owner, Ron Randall, hates women -he actually became paralyzed because one left him. His sister, Marie Windsor, caresses and kisses his brow the way a wife would -and it was she who drove her brother's woman away. A Native American ranch-hand hates all women because he cared for, and tended to, Randall until Windsor hired Bancroft to do it. Hmmm... There's a young buck recently released from prison (who hasn't had a woman in two years!), an aging Addison De Witt-type actor and his Miss Caswell (Mamie Van Doren), the sheriff and other various and sundry guests. Life is cheap in this compact thriller. Some of the cast get taken out between sex-slayings just to keep the film in high gear. A private investigator drowns in the hotel's pool and the ex-convict gets backed into a buzz-saw at the lumber-mill where he works. A fantastic ending rises from the murk when Annie's husband (Stuart Whitman) comes to fetch her, explaining that she just escaped from the nut-house. He had to put her there after their wedding night. It was S-E-X that flipped Annie. Just like Norman Bates in PSYCHO ...and Yolanda Lang in SCREAMING MIMI ...and Dr. Elliot in DRESSED TO KILL.<br><br>The tale is not a great mystery -isn't it always the one you'd least expect? The wheelchair-bound killer had already been done to death ever since Warner Bros. DOCTOR X way back in 1932 so that lets Randall out. Who or what was left besides Bancroft? The blistering Utah sun? What's interesting here is that Anne Bancroft plays the same \"mouse\" she did in 1952's DON'T BOTHER TO KNOCK -only this time, it's the mouse and not the platinum blonde bimbo (Van Doren here) that has a few mental screws loose. This trashy, lurid barrel of fun can't reely be appreciated in just one sitting. Once you know that Anne Bancroft's the culprit, watch her throughout the film and catch the clues she's trying to give us that she's the killer. See who she looks daggers at and why. Look closely when Lex attempts to embrace or kiss her. Best scene: Mamie Van Doren drunk at the dinner table, throwing herself on paralyzed Ron Randall. His horrified look, and the mixed deep-dish looks of the other guests (freaking out for sexual reasons of their own) in freeze-frame is priceless! Scenes like this have been spoofed many times- a near-analogy would be a room full of gangsters all reaching under their coats for their rod at the same time in a crowded nightclub. Look for Dan Blocker (Bonanza's Hoss) as the bartender. The film reeks of S-E-X ...wholesome and otherwise. There's some lingering shots of Lex Barker in his bathing trunks and the Va-Va-Voom attributes of Mamie Van Doren are often on display. The violence quotient is high and although nothing's shown (for too long, anyway) it's not hard to get the drift and creep out. \"Slaughtered like a side of beef. Throat slashed ...even her arms and legs.\" Anne Bancroft, as well as the rest of the cast, are in top form giving it all they've got in their respective ways. THE GIRL IN BLACK STOCKINGS is seminal -and \"killer\" for so many reasons and in so many ways...","user":"melvelvit-1","rank":[21,26]},{"title":"Wanton Murder!","rating":7,"date":"4 October 2015","review":"The Girl in Black Stockings is directed by Howard W. Koch and written by Richard Landau and Peter Godfrey. It stars Lex Barker, Anne Bancroft, Mamie Van Doren, Ron Randell, John Dehner and Marie Windsor. Music is by Les Baxter and cinematography by William Margulies.<br><br>When a party girl is found murdered at a Utah hotel, everyone is under suspicion.<br><br>Miserable predatory creatures!<br><br>One of the definitions of the low budget drive-in movie, The Girl in Black Stockings is an odd and fascinating picture. In core essence it's a standard murder mystery piece, a sort of minor Ten Little Indians only with kooky overtones.<br><br>She'd get on that dance floor and fry eggs!<br><br>The characterisations, performed by a wide scope cast list, are firmly in the realm of the off kilter or suspiciously suspect! While some of the scripted dialogue is priceless and pungent with noirish tones. Plus there is lots of smoking going on to emphasise the noirish fever.<br><br>I'm gonna have to raise taxes to build a morgue!<br><br>The acting is all over the place, mind, with Tarzan leading the way doing some smell the fart acting, while others are overwrought in delivery of script. Yet the up and down acting fits into the grand scheme of Utah weirdo style, further accentuated by the swirly Gothic musical score.<br><br>Nutty and fruity, corny yet crisp, it's a fun experience. Plus there's Van Doren, who had to have had the widest mouth of all circa the 1950s. 7/10","user":"hitchcockthelegend","rank":[6,6]}]