[{"title":"Are we talking frightening now?","rating":13,"date":"13 August 2003","review":"THE HAUNTING(1963) is an important horror film because it is one of a tiny handful of films within the tradition that genuinely unsettle the viewer. Are the events at Hill House for real, or are they happening on the inside of Eleanor Lance's head? The author of the novel upon which this movie was based, Shirley Jackson, left us to wonder at the end of her story. A constant theme in Jackson's work was the displacement and the destruction of the hopes of women (Most of her work was written in the 1940s and 1950s). <br><br>\tJackson, in her own intriguingly artful manner, asks us in The Haunting of Hill House to contemplate the domestic prison that many women like Eleanor Lance found themselves in. Eleanor is a spinster, the slightly dotty older sister compelled by restrictive family relationships to care for an ailing mother.  She's been nowhere, she has had no experiences, and she barely has social skills. Like anyone else, she wants love, intimacy, friendship, and she doesn't know how to seek them. Naturally, she operates from a place of low-key fury. Julie Harris conveys this so successfully in the film that she actually bounces the viewer between feelings of empathy and feelings of exhaustion.  \"Why doesn't she make up her mind to go or stay?\", we ask ourselves.  Eleanor isn't an attractive person, and Julie Harris plays this to the \"t\". \t \tTHE HAUNTING explores Jackson's extended metaphor of feminine anger  damn near as skillfully as the author presented it on the page.  Certainly whatever \"walks alone at Hill House\" is not such a distant cousin from the Corn Goddess, or other archetypal representations of the understandable rage of women whose lives have been restricted by domestic roles. But how much of it genuinely resonates from that house with its \"doors that stay sensibly shut\", and how much of it is between the ears of Eleanor Lance, who, even in a crowd, is walking alone, just as is whatever is in Hill House? \tIn creating this book, Shirley Jackson was able to breach the same territory the 19th century feminist Charlotte Perkins Gilman explored in her remarkable story The Yellow Wallpaper.  And it is no small thing that the cast of The Haunting- Julie Harris and Claire Bloom foremost- were able to recreate on the screen and do this complex novel such justice.  Director Robert Wise, who fifteen years before gave us the Val Lewton masterpiece THE BODYSNATCHER, labored diligently to establish the same stifling atmosphere found in that earlier film. Patterns in wallpaper that vibrate with voice, doors that breathe, and that steady, horrific hammering on the walls that chills as certainly as did Jackson's description in the book itself. <br><br>\tCertainly Rus Tamblyn and Richard Johnson do more than pull their weight in this piece, and it couldn't have been easy to play second line to talents like Harris and Bloom.  The cast, the direction, the set, everything works in this movie, a remarkable work of harmonic convergence on celluloid. \tTHE HAUNTING is an important film to see because it does what horror films rarely do, it freely explores the internal and takes us all along, and babies, we ain't laughing.  But it works.  And that's more than can be said for three quarters of the over-hyped movie offerings in the horror tradition. Among U.S. horror films of the 1960s, only PSYCHO and ROSEMARY'S BABY touch so boldly on the unspoken terror in the horror film:a common fear among our spieces that we may be unworthy of love.  Are we talking frightening now?","user":"oyason","rank":[217,245]},{"title":"Forty one years after its release, this movie is still frightening.","rating":4,"date":"4 April 2004","review":"ABC broadcast this film as a Sunday Night Movie in, I believe, 1965.  I watched it with my best friend at his house, which happened to be next door. After the movie was over I was afraid to walk home.  Thirty eight years later, this movie is still the scariest movie I've ever seen.<br><br>It's hard to put into words why this movie triggers such an emotional response.  There is no blood and gore, no creatures or monsters in plain sight.  In fact, there is very little physical presence in this movie that should evoke such a fear reaction.  True, there are multiple angle exterior shots of the mansion that make one feel as if the house is watching them all the time.  And there are loud unexplained noises, bulging wall panels, and door knobs that turn by themselves.  All-in-all, the physical evidence is pretty tame, especially by today's standards.<br><br>The fear reaction lies not in the physical form, but in the psychological sense.  For example, as Theo and Nell cling to one another as wall pounding draws closer to their room, only to stop and dead silence replaces the noise.  Later in the movie, Nell and Theo are again in their room when Nell grabs hold of Theo's hand as noise begins to build outside their bedroom door.  Finally, unable to stand the noise  any longer, Nell begins to scream which awakens Theo, who happens to be halfway across the room, and thus not close enough to be holding Nell's hand.  So the question is \"who or what was Nell holding?\".  There are many scenes that are similar to the above.<br><br>\nThis film was directed by Robert Wise who made me believe there was something lurking around every corner, or there was something that was going to happen, but you just didn't know quite when.  This is the type of directing that has given this movie the classic status it so richly deserves.<br><br>So, if you are more into the physical style of a movie, go see \"Texas Chain Saw Massacre\", but if you are ready for a genuinely scary movie, go rent or buy the 1963 version of \"The Haunting\".","user":"jeklv","rank":[150,174]},{"title":"The only movie that truly frightened me.","rating":10,"date":"28 October 2005","review":"After watching \"The Haunting\" 1963, I slept with my hands under the covers for 3 weeks. <br><br>I was alone in the house, very late at night. Every sound amplified.. I was a full grown woman. For Pete's sake, I have watched almost every monster movie made. Even the original \"Wolfman.\" Hummm, I could handle this. <br><br>Wrong! I have never been so frightened in my life. Who or What was holding her hand??... <br><br>The door at the top of the spiral stair almost gave me a stroke. <br><br>This movie made a believer out of me. The sound effects, the lighting, the \"breathing door\", plus the fact it was Black and White.. The house, well don't ask me to attend a dinner party there. You will be eating alone. <br><br>Perfect movie for Halloween.<br><br>I give this movie a \"10\", The \"remake\" ?? Was that from the same book?<br><br>Nuff Said.","user":"Vanillaheart","rank":[163,195]}]