[{"title":"Landmark in Nihilism","rating":8,"date":"6 August 2008","review":"No, they don't do movies like this anymore. A tough one about self-hatred, mayhem and self- destruction: Franco Nero as a down-&amp;-out reporter, Corinne Clery as his sexy, completely hollow spouse, plus David Hess doing his usual good- humored-and-mean-as-hell thing. \"Autostop Rosso Sangue\" is sleazy, sexist, ultra-violent, but not without some unforgettable moments: The naked Clery in front of a trailer holding a huge rifle in the middle of the night is like a hastily written, edgy but brilliant poem found in a tattered paperback left in a cheap motel. For a few short hours in his life, Pasquale Festa Campanile, creator of some of the worst Euro comedies ever, turned into a poète maudit of the most cynical kind. This is the kind of grindhouse cinema nobody can embrace with seventies nostalgia: mature, brutal, knowing, never \"cool\", always cold, gripping and utterly nihilistic. Anything else you would ask for?","user":"radiobirdma","rank":[18,19]},{"title":"Little known, but terrific road thriller","rating":9,"date":"30 September 2005","review":"Intense, off-beat Italian thriller is an underexposed classic.<br><br>Fueding married couple, traveling across the country, make the mistake of picking up a hitch hiker who turns out to be a violent bank robber. But that's only the beginning of the story.<br><br>Skillfully well done thriller is gripping in it's wildly turning plot. The cinematography is stylishly good, with some beautiful country side filming locations. The music, though seemingly out of place at times, is great too. In addition there is a decent amount of violence and some nudity.<br><br>The real highlights of this film though are it's three stars, who seem to be in a show-stealing competition all through out the film. Franco Nero does a convincingly good performance as the alcoholic reporter, who has grown tired of his wife. Corinne Clery is fetching and talented as Nero's equally weary wife. The terrific David Hess makes for another great villain, also having played a crazed criminal in both Craven's Last House on the Left (1972) and another Italian exploitation film House on the Edge of the Park (1979).<br><br>For those who are seeking an unconventional thriller or just a fan of Hess, this film will be a well rewarding watch.<br><br>*** 1/2 out of ****","user":"Nightman85","rank":[20,24]},{"title":"with David Hess in the backseat, this is bound to be fun...","rating":7,"date":"7 July 2003","review":"I agree with the other reviewers who lament David Hess's minor film career--his three key roles (Last House, House on the Edge, and Hitch Hike) showed amazing sleaze potential (he could've been the wisecracking villain in summer action movies if his time had come 20 years later).  \"Hitch Hike\" can be called a precursor to the action films that litter multiplexes now, but it is also much more.  It's an uncommon little B movie with the gloss and name actors (Franco Nero, Corrine Clery) of an A picture, along with a surprising moral slant, gay stickup men, and twists galore.  Like most Italian exploitation films, \"Hitch Hike\" sometimes bogs down in a bit too much excess talk, but it helps flesh out the characters--they're not mere victims or heroes, but people, too.  And for fans of Hess, this is a no-brainer.  (A word of advice--seek out the Anchor Bay DVD, which is remastered and preserves the film's 1.85:1 aspect ratio.)<br><br>7/10","user":"Jonny_Numb","rank":[14,16]}]