[{"title":"There it is..... Love and Hate","rating":10,"date":"28 February 2008","review":"90% of Spike Lee's masterpiece Do the Right Thing is a perfectly developed character study of a wide range of model personalities who all happen to be in Bedford-Stuyvesant on the hottest day of the summer. What the other ten percent consists of you will have to discover for yourself.<br><br>This ingenious film explores extremes, but never gives itself over to stereotypes as its plot cleverly navigates through the politics of inner city life and the struggles of American racism. As an artful and intelligent examination of the ethics of violence and prejudice, Do the Right Thing is unparalleled. It implies a simple profound question - what is the 'right thing'? But steadfastly refuses to supply even a hint of an answer - appropriately leaving its central point entirely up to its audience. Instead, the film points to a different, perhaps more important question \"Whose version of right is right for you?\" There are a lot of good people, a lot of bad people, and a very realistic majority of people who are usually somewhere in the middle but also somewhat confused throughout this film. African American, Latino, East Asian and Italian American cultures form the dynamics of the relationships that drive the story, and conflict is their medium. Drawing from two incisive but different comments on violence from Martin Luther King and Malcolm X, Lee extrapolates his story and the ideas he wants to explore by showing us characters that are as real as they are exaggerated and somewhat unpredictable events that they create, are swept into or actively or passively participate in. Although the point of the film is not really critique, nobody is left unscathed.<br><br>I am not going to tell you what the film says - I can't, because it is, more than most films dealing in such a direct manner with the subject of race, open to interpretation. And what you bring to it will influence, but not determine what you take away from it. It is just that powerful.<br><br>Instead, I will simply give Do the Right Thing my highest recommendation.<br><br>Superbly written, edited, directed and filmed. Well acted (Danny Aiello, Ossie Davis, Giancarlo Esposito, Rosie Perez, Spike Lee and Richard Edson really stood out for me) and very nicely soundscaped, Do the Right Thing is the perfect film for a solitary night of reflection or for sharing with an intelligent group of friends. However, be forewarned, the film hits hard, and will disturb some people a great deal - especially those who feel a need for closure and resolution.","user":"mstomaso","rank":[100,122]},{"title":"That's the double-truth, Ruth","rating":10,"date":"24 May 2005","review":"In all likelihood Spike Lee's most important achievement - as director, writer and actor (though to my taste Mo' Better Blues is just as good a picture) and one of the strongest films you'll see about race relations, 'Do The Right Thing' looks dated at times, but it lost none of its impact and relevance. The movie takes place in a particularly hot day in a primarily African-American neighborhood in Brooklyn, and follows the various personalities who live there throughout the day; the center of the story is Sal's Famous Pizzeria - its owners, some of the few white people living in the neighborhood: Sal (Oscar nominated performance for Danny Aiello) and his two sons (John Torturro and Richard Edson), and Mookie (Spike Lee himself), the black delivery boy. What starts out as a light, entertaining movie with some amusing characters and light humor, gradually builds up tension to the point of being unbearable, up to the dramatic and tragic climax. Spike doesn't put as much emphasis on the characters themselves as he does on the relationships and the tension between them; and in this image of a very specific and small frame in time and place, makes a strong and important message about racism and race relations in general. The film is populated with many different characters, all of them very memorable and each one a representative of a certain belief, mode of behavior or state of mind - on both sides of the conflict. From the uninhibited anger of Buggin Out (Giancarlo Esposito) and Radio Raheem (Bill Nunn) on one side and Pino (John Torturro) on the other side, to Jade (Joie Lee, Spike's sister in the film and in real life) and Vito (Richard Edson), who are trying to connect and live at peace with the other side, to Da Mayor (Ossie Davis), in his isolated but peaceful state of mind, living in complete peace with the world around him, and Smiley (Roger Smith), living in his own isolated existence. Then there's Mookie, who is stuck in the middle, torn between his commitment and responsibilities to both sides. Finally we have Mister Senor Love Daddy - played gorgeously by the one and only Samuel L. Jackson, in one of his finest performances - half active character and half all-knowing narrator - who represents the voice of reason in the conflict, the reason which is bound, ultimately, to collapse. Each and every character plays an important part in the climatic and dramatic conflict to which the movie builds up, and though it's the radical ones - Buggin Out and Radio Raheem - who trigger the events that cause the tragedy, they are not necessarily the ones who finish it. It is Mookie and Sal, in fact, who ultimately play the main part.<br><br>Do The Right Thing is not an easy watch; it's a mesmerizing, tense, difficult film that breaks many taboos and slaughters many holy cows. But in the end of it - hopefully - you'll be wiser than you were in the beginning, and that's what Lee have always tried to achieve in all his films. Watch it to get a real view on racism that doesn't duck the difficult issues and isn't afraid to tackle the real problem, and to see a master director at work. It's one of the best films of its time.","user":"itamarscomix","rank":[122,163]},{"title":"Creative, but definitely not flawless","rating":7,"date":"22 June 2006","review":"It's sometimes difficult to separate artists' public statements from the work they're commenting on, or to ignore the politically charged aura a film generates. There's always that nagging feeling that a movie's point must be sussed out, that the real intentions of the filmmaker must be understood. But in retrospect--and despite director Spike Lee's rhetoric--Do the Right Thing may not be as profound as previously thought. While it should be applauded for taking on the subject of race without Hollywood's usual heavy-handedness, simply presenting a topic doesn't automatically mean anything is actually being said about that topic.<br><br>Whatever problems there are with the content, Do the Right Thing is still great film-making. It's a vibrant, passionate, funny movie, and like a true work of art, it both surprises and provokes. It's technically audacious and features one of the most successful displays of stifling, suffocating heat ever put on film.and it does it without being languid itself. The dialogue is fast paced, the characters energetic, and the camera-work unpredictable, full of clever pans and Twilight Zone angles. And, except for the always excruciating Martin Lawrence, the performances are uniformly good throughout. Lee also manages to out-Altman Altman by presenting a large cast of characters without it ever becoming confusing or disjointed.<br><br>Taking place over the course of one scorching day in Bedford-Stuyvesant, most of the action occurs in and around a pizzeria run by Sal (Danny Aiello) and his sons Pino and Vito (John Turturro, Richard Edson). But the entire neighborhood is featured as the film intercuts between various exchanges, many of them tinged with racial overtones: while Buggin Out (Giancarlo Esposito) challenges a white tenement owner when he feels slighted, down the street three men debate the right of a Korean to own a variety store in \"their\" neighborhood.<br><br>There are personal moments as well: Da Mayor (Ossie Davis) continually attempts to soften Mother Sister's (Ruby Dee) opinion of him, while Mookie (Lee) juggles time between his job at Sal's and his increasingly aggravated girlfriend (Rosie Perez). Although Lee doesn't have the time to make all his characters three-dimensional, he avoids sentimentalizing or demonizing any one group; there are both blacks and whites who are sympathetic (Sal, Da Mayor) and troublesome (Pino, Radio Raheem). Only the Korean storeowner played by Steven Parks is a blatant caricature. (Asians seem to get short shrift no matter who is behind the camera.) Presiding over the action is disc jockey Senor Love Daddy (Samuel L. Jackson). Like Wolfman Jack in American Graffiti, he provides ongoing background music, as well as periodic commentary.<br><br>Eventually, the heat and personal tensions culminate in an explosion of violence centered on Sal's pizzeria. The violence escalates after one of the characters is killed. It's at this point that the film becomes problematic. The murder is supposed to be a tragedy, meant to provoke outrage in the audience. But the killing of a fictional character isn't enough in itself to warrant a reaction. It's not that audiences are jaded, but drama usually elicits judgement based on the narrative alone. If a character is a jerk, his death won't elicit much of a response. Like Mel Gibson's The Passion of the Christ, Do the Right Thing relies too heavily on the personal baggage audiences are supposedly bringing to the film. Drawing on contemporary events and feelings may be provocative, but it dates the film and makes for poor drama. The reactions of Mookie and Mother Sister to the murder may have been understandable to a disenfranchised group, but in the context of the plot they appear unmotivated, almost random.<br><br>The somewhat ambiguous nature of the movie could easily be trumpeted as a selling point. Lee doesn't want to hold your hand; he wants you to make up your own mind. But there is a fine line between \"bravely ambiguous\" and \"maddeningly directionless.\" While Oliver Stone continually has been pilloried for his blatantly didactic films, there is something to be said for being recklessly personal and taking a stand. Lee made a movie about racism; but we're so starved for challenging works, for thematically mature movies, we've embraced a film that ultimately says nothing more than \"racism is bad\" and \"no one person or group is to blame.\"<br><br>The simplistic ideals of Do the Right Thing are most evident in four scenes: 1) Love Daddy lists practically every major black musician from the last fifty years; 2) in an overly contrived sequence, Mookie gets Pino to admit that his cultural heroes are all black (Magic Johnson, Eddie Murphy, and Prince); 3) Martin Luther King, Malcolm X, Al Sharpton, Jesse Jackson and Louis Farrakhan are all mentioned; 4) the words \"Tawana Told the Truth\" appear spray painted on a wall (a reference to the Tawana Brawley controversy of 1987). No differentiation is made between the listed artists, and no context is given for the black leaders mentioned. These aren't explorations of racially-charged issues, it's just name dropping.<br><br>Despite its flaws, Do the Right Thing provokes discussion. It's an impossible film to dismiss. Spike Lee's subsequent career has turned out to be a disappointment, but Do the Right Thing, along with Malcolm X, represent Lee at his creative peak.","user":"Konquest","rank":[42,57]}]