[{"title":"Well you gotta do SOMETHIN'.","rating":18,"date":"18 May 2000","review":"I'm getting really sick of people on here saying \"this film is not relevant today, because kids don't face the same problems, blah blah...\" when these are ADULTS saying this, who wouldn't know the first thing about the problems kids face today because they aren't one. Well I'm 16 and I can say that this film is every bit as involving and affecting as it was the day it came out. I mean, name one thing in Rebel that isn't a part of teen life now. Drag racing: that's the only thing.<br><br>But anyway, the movie. I'm a hard-core film buff and have seem many many many many movies in my 16 years. Only two of them have accurately depicted teen life: Rebel Without a Cause and a beautiful Japanese anime film called Whisper of the Heart. Rebel on a whole is a bit exaggerated, but it's only fitting - a teen exaggerates everything that happens to them. In fact, some of the images and themes - kids and adults seem to be speaking different languages, a group of outcasts living in a secluded house - would be right at home in a Bunuel film. That house of outcasts in particular is very touching...I think all teens would want to live away from the real world once in a awhile.<br><br>The three principal characters are all like people I know. Sal Mineo as the troubled kid who wants nothing more than a friend. Natalie Wood as the girl who just goes along with what other people do because she wants to fit in. And of course, the ultra-cool James Dean as the kid who may have a rough-and-tumble exterior, but who is really a big softie at heart. Dean was a bit of a revelation to me. I'd never seen one of his movies before, so I assumed that, like Marilyn Monroe, it was the image that people grieved over and not the talent. Boy was I wrong. The guy could act. When he howls \"You're tearing me apart!\" at the beginning, you know what you're in store for.<br><br>The depiction of the parents also must have been a revelation for 1955 audiences. Juvenile delinquents had been (and are continuing to be) depicted as either overall bad seeds or having abusive parents. This film was the first to acknowledge that something as simple as a lack of communication and an unwillingness to pay attention to your child can do just as much damage.<br><br>Nicholas Ray's direction was also excellent. Besides coming up with the idea for Jim's red jacket to \"make him stick out more\" you have Plato's mismatched socks, and I was also surprised by the frequently-titled camera. I didn't know they did that back then! It certainly added more to the disjointed feeling and wasn't just there for style purposes like todays movies.<br><br>The only point at which the film falters is the pat resolution between Jim and his parents at the end. But the ending is great otherwise, with a wonderfully framed shot of the observatory, proving Jim's theory that the world will end at dawn.","user":"Evan-29","rank":[189,241]},{"title":"Powerful","rating":17,"date":"17 April 1999","review":"I agree with most of the reviewers.  This movie is just as powerful as it was 44 years ago.  Inside the cheesy braggadocio of an angry gangster is a confused kid.  I can't think of a single person that did not feel alienated as a teenager.  James Dean represents what every teenager would want to be. Individualistic:  has a set of values and sticks to them Brave:  engages in activities most of us would never consider (esp. chicky run) Kind:  caring to Plato and Judy<br><br>James Dean is perfect in his role as Jim Stark.  More is said in this movie through gestures than words.  One lift of his eyebrow, one syllable can say so much.  When he does speak, you know that he believes what he is saying. The shot of Jim rolling out of the speeding car is amazing.  I can think of few modern action films that have had me riveted to the seat as I was during the switchblade fight.<br><br>Natalie Wood is superb in her role as well.  Judy is looking for attention that isn't there.  This is perfectly summed up when she says \"I love somebody, all this time I was looking for someone to love me, but now I love somebody.\"  She desperately looks for acceptance and acknowledgment in the wrong places because her father does not want to see her as a young woman.<br><br>Even though Dennis Hopper's role is rather small, you can see that he knows what he is doing.  He portrays in my mind, someone easily pushed around when he tries to fit in.  He seems different than the rest of Buzz' gang and even looks more boyish.  He timidly tries to interject a comment in front of Buzz and is just brushed off.<br><br>I don't think that this movie is strictly an us versus them type of scenario.  Trying to take care of Plato and to protect him, Jim realizes that being a parent is not as straightforward as he thought.  His parents are more than just caricatures of the nagging wife and emasculated husband. Everyone in the film is confused about how they fit in to the big picture. The movie is simply told in the self centered manner any teenager would view it as.  This can account for the sequences which many would see as over the top.  I think the central theme of the cosmos presented in the planetarium show demonstrates how teenagers view themselves as the center of the universe.  Thus all the scenes concerning each of the three teens conflicts are equally dramatic.","user":"Trumpy","rank":[66,85]},{"title":"First American Teenager","rating":9,"date":"28 June 2003","review":"\"East of Eden\" and \"Giant\" are both great, don't get me wrong.  But this is the James Dean that set the archetype for not only the cool Fifties American teenager but perhaps every teenager since.  Dean has his white t-shirt, sleeve rolled up for his smokes.  He has his red jacket and blue jeans, he's ready to drag and he's ready to fight.  From the first moment we see Dean, drunk on a school night, busted by the cops, he's amazingly both personally secretive and universally accessible at once.  He's hurt, lonely and looking for kicks - and no one understands him except, maybe, just maybe, that one person in the audience...<br><br>Sure, this movie has it's faults.  The parents are cartoonish, some of the kids are hip in only a stilted sense and a lot of the movie is unrealistic.  There's something disturbingly hokey and amateurish in this portrayal of a typical American town with it's typical American high school. Yet, Dean, Mineo and Wood put on performances that let the viewer suspend reality all the way through..each of these three put on the performance of their lives!<br><br>Sal Mineo plays a mousey misfit named Plato (whose homosexuality is thinly veiled).  Natalie Wood plays a young women named Judy, part of the in-crowd, who deep down is at wit's end.  Both of these characters are amazingly believable, even fifty years later.  Mineo's never been as enigmatic or as compelling as he is here as Plato.  Then there's Wood - as cynical and alone in her world as Judy feels, we realize quickly she likes James Dean, she needs James Dean - and Dean can dig her.<br><br>In retrospect, it's not surprising that the jacketed juvenile delinquent that Dean plays here would become a role model for both young gay men and young straight men alike. He's comfortable being intimate with Plato, his words, his expressions are all too much, too overly emotional (for a straight man).  But, the kids, the town itself, quickly learn Dean's no pushover.  He yells, he fights and he's afraid of nothing that other people are afraid of - staring down death is just a way for him to kill time. But, he's afraid, something just isn't right with his life. And most importantly, even if he never really does connect with this \"typical town\" filled with \"typical people\", Dean does indeed connect - to anyone whose ever been young - and alone.....","user":"humdinger","rank":[57,73]}]