[{"title":"Everything but the kitchen sink!","rating":9,"date":"26 September 2004","review":"This movie is truly awful, but at the same time it's got to be one of the BEST SCI-FI MOVIES I'VE EVER SEEN!<br><br>There are so many concepts to digest: Civilization's end, immortality, genetic manipulation, artificial intelligence, time control, psychic power, space travel, and on and on and on. If you're the least bit interested in science-fiction, there's more for you in this one movie than you'll find in a year's worth of Star Trek conventions!<br><br>Then why do I say it's awful? Well, within this movie's running time are some of the most cheesy moments ever captured on celluloid!<br><br> From the opening shots of the hairy-backed, leather-thonged, gun-toting Sean Connery (who at least manages to wear more than most of the rest of the cast), to the catch-cry of the Giant Hovering Stone Head (\"The gun is good! The penis is bad!\"), as it spews out a torrent of weapons and ammo from its mouth. What about the Eternal's predilection for studying erectile tissue function, by flashing up images of naked mud-wrestling? Or that crazy \"wobbling-hands\" thing that they do when in some sort of telepathic communion? Completely laughable!<br><br>Despite these moments of \"cheesy-ness\", Zardoz tells an utterly engaging and compelling story. The moment of revelation of the meaning of \"Zardoz\" took me completely by surprise, even though all the clues had been under my nose right from the beginning! (The Magritte painting \"La chateau des Pyrenees\", hanging in Frank's house, reminiscent of the hovering stone head, for example.)<br><br>If you like hard-core science fiction, and can put up with a few minor flaws, then I think you'll really enjoy Zardoz! It's weird, it's brilliant, it's unique! (Just make sure you watch it while you're wide awake, though, or you may drift off from time to time!)<br><br>9 out of 10!<br><br>jon :-)","user":"Jonathan-May","rank":[184,211]},{"title":"Oh yeah...","rating":10,"date":"10 July 2005","review":"Without question, the most brilliant bad movie EVER made: Red man-panties, gun-vomiting hot air balloon stone heads, flying books on fishing line, neat-o dance numbers (or at least ballroom catharsis), magic marker facial hair, elitist-hippie government, inexplicable backward-masking (check out Friend in the kitchen), the ugliest bride in the history of cinema, cool jewelry, the Internet before the Internet was the Internet (or even computerized), Big Brother, HAL, and David Niven merged into one, lots of flowy sheer curtains, EXCELLENT decorating ideas, nifty forms of mass transit, a profound sense of anatomy, and, perhaps most chillingly, an apocalyptic warning that, if we do not change our ways, we face a future COMPLETELY DEVOID OF UNDERGARMENTS.<br><br>Genius. Simply genius.","user":"DaJ","rank":[184,215]},{"title":"Brilliant","rating":2,"date":"2 September 2003","review":"There seem to be a lot of people who didn't like this film. I loved it. It is a film for people who aren't perturbed by a lack of surface glitz in science fiction, and can take on the underlying meanings about immortality or the fear of death that other films rarely raise. Some of it doesn't make sense, but only if you are not paying attention. In my view, it gets straight to the point without any polish, which some people are uncomfortable about in any artform. It is not made for Star Trek fans. It is a bleak and powerful story about a cabal of ineffectual immortals who play God to an inferior but more vigourous race, and who long for death yet cannot die. They stealthily invite one of these inferiors (Connery) into their midst to solve their problems. The final scenes are extremely striking, and are set to the 2nd movement of Beethoven's 7th symphony. **You just don't hear this symphony enough in the movies***. I recommend this film to anyone who likes science fiction with a small sf.","user":"craigdubya","rank":[99,114]}]