[{"title":"A comment that can't be left unchallenged","rating":5,"date":"19 September 2010","review":"This film is a curiosity only, though quite entertaining and enjoyable in parts...it really doesn't compare with the original Alfie on any level. Still, great to see the wonderful Paul Copley with so much hair! Mainly I've written to challenge the ludicrous assertion by \"reviewer\" DC1977 that Alan Price is \"a second rate musician\". He wasn't much of an actor, sure, but as a founder member of The Animals, he's one of the greatest rock organists to come out of the sixties, right up there with Matthew Fisher from Procol Harum, Jon Lord from Deep Purple and Goldy McJohn from Steppenwolf. DC1977s comment is, quite simply, idiotic. Thankyou, and goodnight!","user":"scarecrow-14","rank":[12,17]},{"title":"ALFIE DARLING A pleasant old fashioned romp","rating":6,"date":"22 February 2013","review":"Alfie Darling, the sequel to the classic ALFIE, is a pleasant old fashioned romp, that keeps you interested, but is not in the class of the original. The very handsome lead looks like a young Joe Dallesandro (cult underground actor for Andy Warhol) and is quite adequate in making you believe he's a big 'ladies man'. He also shows a bit of sweetness to go with those boyish good looks.<br><br>I'm not condemning this film for being sexist, its more titillating, and typical of the type of films they were showing as the second feature at Drive-Ins at the time. Its also great to see Joan Collins, a few years before she did Dynasty, showing a lot more than expected, actually totally topless. She plays a sort of well to do lady who likes to be wined and dined with all the charms and graces, but is also very kinky in the sack. Her scenes are quite camp actually, and worth seeing this film for, if you liked her in The Stud and The Bitch. Joan Collins is a sweetheart in real life, whom I met once at a book signing, and is a living treasure to this day. Robert. Australia.","user":"junglered-691-682980","rank":[4,5]},{"title":"Ken Hughes Makes \"Alfie\" for Animal Alan Price","rating":5,"date":"24 April 2010","review":"Nearly a decade after Michael Caine's womanizing \"Alfie\" (1966) took the English-speaking world by storm, the cocky Cockney returned in the form of animalistic Alan Price. This time he's a trucker, communing from woman to woman, with partner Paul Copley (as Bakey). As expected, \"Alfie Darling\" gets bitten by the commitment bug, this time in the form of Jill Townsend (as Abby Summers). This film has some similarities to the later \"Alfie\" (2004), starring Jude Law (eg Mr. Copley and his girlfriend).<br><br>Mr. Price, the rock musician who worked so memorably with Eric Burdon and \"The Animals\" (as well as on his own), hasn't the \"fourth wall\" cheekiness of Caine, but he and director Ken Hughes makes this \"Alfie Darling\" sexier than the other two, with a greater emphasis on female flesh. A version for television cut out all the naughty bits, so look around. Also missing is an ending which, while a real downer, makes the trimmed version inconsequential; originally, it felt like a castration. Take your pick.<br><br>***** Alfie Darling (1975) Ken Hughes ~ Alan Price, Jill Townsend, Paul Copley, Joan Collins","user":"wes-connors","rank":[3,5]}]