[{"title":"Cassandra's worth the price of admission","rating":9,"date":"18 December 2005","review":"Weak plot but great showcase for Cassandra Delaney. Also interesting Outback scenery and action. I enjoyed the rural Australian scenery; that was interesting to me; the remoteness helped give some credibility to the lawless villains. The setting was different and remote, giving some credibility to the lawlessness of the villains. A lot of the action was unique and haunting. The plot grew more and more predictable but I didn't mind. The plot seemed designed to showcase Cassandra's charms and, I confess, she won me over! Unfortunately, Casasandra later married John Denver in real life and turned to music...meaning she was only in about 5 movies. Too bad. I would go to a movie just to see her.","user":"gall34","rank":[7,8]},{"title":"I Spit on your Last Kangaroo on the Left!","rating":7,"date":"10 May 2008","review":"I had two movies called \"Fair Game\" standing on my must-see list, so I watched them after each other in order not to lose track of one of them. The first one was an obscure Italian lethal-snake-on-the-loose thriller also known as \"Mamba\" and this one is Australia's belated (unless I missed something) response to the 'Revengeploitation\" sub genre. Revenge thrillers were especially popular throughout the entire decade of the 70's, with highlights like \"Last House on the Left\", \"I Spit on your Grave, \"Fight for your Life\", \"House by the Lake\" and \"House on the Edge of the Park\". These movies routinely handle about innocent women (preferably defenseless and fragile) getting harassed and viciously raped by a group of men (preferably perverted hicks and/or fugitive criminals) and then avenging themselves by taking justice into their own hands. The gritty atmosphere and gratuitous use of violence and sleaze in \"Fair Game\" is pretty much prototypic revenge thriller stuff, but it nevertheless also remains an authentic Aussie movie, meaning the assaulters are bored kangaroo poachers looking for new thrills and the 'victim' (Cassandra Delaney; the former Mrs. John Denver) is actually a very potent lady who fights back from the beginning and never really allows her opponents to get the upper hand. Jessica runs a wildlife reservation in the middle of the outback, so naturally there's a vicious conflict when she bumps into a trio of insensitive and macho poachers doing some illegal kangaroo hunting on her territories. This film feels refreshing and innovative because the script doesn't unfold like the majority of 70's revenge thrillers. The interactions between Jessica and the poachers start off like a testosterone-laden showdown, but then gradually escalate into a merciless battle with humiliation, rape and murder. There are several highly memorable and deliciously exploitative scenes in \"Fair Game\", most notably the one with Delaney  in her white undies - tied to the hood of a jeep whilst it races through the desert. Her acts of vengeance during the climax are quite impressive as well and I guarantee there's some impressive bloodshed to enjoy in \"Fair Game\". As often the case with Australian cult-productions (\"Outback\", \"Wolf Creek\", \"Mad Max\"), the exterior filming location and wildlife images alone make the movie worth purchasing and this particular one also benefices from good music and stylish camera-work. The acting performances are more than satisfying and I'm pleased to notice the cast exclusively exists of native Australians. This isn't always the case, you know. Definitely recommended if you're a fan of the revenge movies.","user":"Coventry","rank":[16,24]},{"title":"Outback Vengeance!","rating":8,"date":"11 March 2007","review":"Australia's answer to \"I Spit on Your Grave\"? Maybe, except this is actually a much better (and more watchable) film. A woman who owns an isolated vast wildlife reservation realizes that her Roos and other animals are being illegally hunted by some local hooligans. When she tries to set the perps (one of whom thinks he's Crocodile Dundee) straight, they start messing around with her. After a few days, things get out of hand and she finds herself their new prey on her own property. Dubbed an action/thriller by most, I was expecting this to be a cheesy laugh-fest. The only thing about it that resembles an 80s action/thriller is the often light-hearted score (which morphs into more appropriate horror music at times.) Otherwise, this is filled with tension and a humane heroine that you want to root for. This follows the typical rape/revenge formula of the 70s, but it isn't as difficult to watch. A totally fun flick that's one of Australia's better horror offerings.","user":"ThrownMuse","rank":[8,12]}]