[{"title":"THE MARQUISE OF O (Eric Rohmer, 1976) ***","rating":7,"date":"24 January 2010","review":"Despite – or perhaps because of – its being atypically filmed in German, this remains one of Rohmer's more recognized titles. The period setting (the director's first, though not last, feature to adopt this) lends an aesthetic quality in this case which complements – or, one might say, excuses – his customary austerity. The simple plot proves quietly fascinating throughout: an aristocratic lady is saved from near-rape by an enemy Count (Bruno Ganz); though the woman is no great beauty, the man apparently loses his head over her, almost compromising his own rank into the bargain. The Marquise and her family cannot understand this impulsive behavior but, then, she finds herself mysteriously pregnant; her parents and brother obviously shun her, but the returning Count is even more intent on marrying her (she is a widow who has already borne two children). Eventually, the Marquise puts an ad in a newspaper requesting the father to present himself – and, at the appointed hour, it is none other than the mortified Count himself who turns up (having apparently taken advantage of her while she was unconscious on the night of the attack)! As with all of the director's work, this is certainly not for all tastes but, as I said at the beginning, it is exquisitely filmed (by Nestor Almendros) on wonderful and expansive locations – though the approach is thoroughly low-key (mostly confined to medium shots of people conversing against a backdrop of candle-lit interiors), in keeping with the intimate nature of the tale. While, for all his straining for realism, even Rohmer's modern-day efforts could be deemed contrived on occasion, here he seems to have embraced a deliberate artificiality (the expulsion of the bewildered heroine in particular is redolent of barnstorming melodramas!) perhaps to better convey the intolerant morality of its (distant) time. Though I am not sure parallels to the Immaculate Conception were intended, THE MARQUISE OF O does recall Manoel De Oliveira's contemporaneous and, regrettably, little-known BENILDE OR THE VIRGIN MOTHER (1975) which, while comparably 'self-conscious', is perhaps an even more compelling, thought-provoking – and altogether spiritual – experience.","user":"Bunuel1976","rank":[9,9]},{"title":"Stupendously poetic and flawless","rating":10,"date":"16 December 2000","review":"What can I say about Rohmer? the guy's a cinematic genius. Who else can capture so much reality out of situations that in most directors' hands would be nothing but facile theatricality that exhausts itself in one viewing? Rohmer's best films stand up to endless viewings, in fact, they're so detailed and well thought out, you don't get anything significant out of them until you've watched them many times. The Marquise of O is definitely one of his best. It's his only film that doesn't deal with the love problems of his contemporary French bourgeoisie--his only 'period' film made in the original German language of the book by Heinrich von Kleist it was based on. It is a deceptively simple looking work of pure art. Nuance upon nuance comes pouring forth from every actor as they give the subtlest and greatest performances of their lives under Rohmer's direction. Nothing fancy here on the surface, just a totally  authentic look that seems to have stepped right off Goethe's time, as if Rohmer actually went back in time to the 18th century  and shot himself a documentary. The film is, among many other things, a very strong criticism of the Christian mores of the period and how easily they can turn from being life-affirming and productively disciplinarian to prejudice and farcical cruelty.","user":"Aw-komon","rank":[35,44]},{"title":"A marvel of Romantic literature, utterly charming.","rating":10,"date":"8 September 2001","review":"If the romantic poet and playwright Heinrich von Kleist (who wrote almost at the same time as Goethe) could have imagined the cinema, he would have approved of Rohmer's filming of his novella. What we see here are not 20th century characters in costume, but early 19th century Romantic sensibilities reacting according to their way of looking at the world. It is as strange as time travel, and utterly charming. Rohmer frames them in sets like Caspar Friedrich or Fuseli paintings. This movie is a marvel.","user":"shezan","rank":[23,28]}]