[{"title":"Classic B-Movie Teens In Trouble Flick!","rating":29,"date":"29 October 2004","review":"(POSSIBLE SPOILER)<br><br>This is a classic b-movie from 1965.The B&amp;W cinematography is beautiful and effective - mucho fog and fake scares but the basic premise - that of kids making prank calls and it coming back to terrify them is truly effective. I saw this when I was quite little and it scared the heck out of me. In fact, this and Snow White are two of my earliest film memories (and Joan Crawford is STILL creepier than the Evil Queen in Snow White). Joan actually has fun as a nasty, scene-stealer neighbor who wants the married man for herself. William Castle (I'm a big fan of his) made many effective, cheapo thrillers: Dr. Sardonicus, Homicidal &amp; Thirteen Ghosts (to name a few). In fact, John Goodamn does a nice job playing a version of Castle in the underrated Joe Dante film, Matinée. But check out this little teenage scarefest and whatever you do - don't prank call someone right after they've killed a mate - they're not in the mood!!","user":"shark-43","rank":[14,15]},{"title":"Remember seeing this as a kid.","rating":6,"date":"6 September 2003","review":"I saw this movie when I was about 11 or 12 and I remember it to this day. (I am almost 40.)It scared the wits out of me and I certainly never wanted to make prank phone calls after that! I would love to see it again and share it with my kids. This a great B classic that not many people have seen.","user":"3kidmama","rank":[8,8]},{"title":"Joan Saw What You Hung Your Clothes On...","rating":30,"date":"30 May 2004","review":"and she knows who you are!<br><br>This is another strange William Castle concoction that features Joan Crawford in one of the B-horror movies she made near the end of her career, and yet the only way they could fit her into this story was to make her a kooky neighbor lady who wears tacky jewelry that looks like some sort of bizarre Aztec armor.  <br><br>Everyone knows the plot, which involves two teenage girls who spend an evening making prank phone calls and, through the miracle of plot contrivance, stumble into the path of a psychotic man who has just committed murder.  <br><br>I don't know if any of the other viewers felt the same way, but I really think the movie's violence is a bit shocking for its day.  The first murder is an ironic ripoff of \"Psycho\", with the person in the shower committing the murder instead of being slashed, and I was surprised at how graphic it really is.  <br><br>Also, I don't know whether this was really the filmmakers' intention or not, but they have captured the excitement of a teenage adventure and carried it effortlessly into a suspenseful conclusion.  Ironically, the only thing in the movie that feels wrong is the subplot involving Crawford.  It was obviously inserted to give the movie a star and to pad out the running time.","user":"GroovyDoom","rank":[21,25]}]