[{"title":"The American Pop Music for Cinema and Music Lovers","rating":10,"date":"26 January 2018","review":"\"American Pop\" is a fantastic animation directed by Ralph Bakshi disclosing the American pop music in the Twentieth Century until 1980. The storyline follows four generations of a Russian Jewish family of refugees from the Russian Revolution that immigrate to America. Along the years, the boy Zalmie discovers life and love in night-clubs as performer and musician and becomes the patriarch of generations of musicians. The big picture of the American history is the background to present wonderful music, in blues, jazz, rock and roll, in one of the most beautiful soundtracks of the cinema history. My vote is ten.<br><br>Title (Brazil): \"American Pop\"","user":"claudio_carvalho","rank":[11,11]},{"title":"Good. Especially if you're a music geek, like me.","rating":8,"date":"23 November 2003","review":"I love the animation style used in this movie.  The interlacing of real footage and photos from earlier times brings a level of realism not seen in many animated films.  The characters move realistically as well; minute body language is portrayed well.  Voice overs are great.  Of course it's not \"Disney quality\", but it's got a grittiness to it that truly makes it original.<br><br>Now I can see how one could criticize this movie.  Basically, it all depends on how you watch it.  If you watch it as a drama, you'll be disappointed. The plot is very centered around the one tragic late hippieish character, and is pretty simple and predictable.  But there's a certain amount of charm within the overall story, kind of a sad, but beautiful shine.<br><br>If you watch it more as a musical, the movie works fine.  The songs chosen are fantastic, and they totally underline the feel of the scenes in which they are used.  In one of the first scenes, taking place in Czar-era Russia, there is no dialogue, only subtitles (giving it a great historical feel). The soundtrack is a sad and stirring Russian song sung acappella.  You really get a sense of what the characters were going through.<br><br>This style continues throughout the movie.  One of the most emotional scenes, for me, takes place in a cornfield, with the character torn apart with what he's done with his life.  Janis Joplin's version of \"Summertime\" (an interesting choice, perhaps a hint of a throwback to earlier eras, as it is a Gershwin tune) as haunting as ever plays as the character cries. Messed up.  But well done.<br><br>Jimi Hendrix has a cameo.  A pseudo-Joplin/Slick character has a major role. A Sex Pistols parody jams it out.  Late 70s corporate goons are running the studio.  Great fun.<br><br>And that's how you have to enjoy the movie; and that's probably why music geeks will love it more than anyone else.","user":"dividebyzero","rank":[26,30]},{"title":"I'm amazed that this isn't in the top 50 for animation","rating":10,"date":"2 October 2002","review":"I thought this film was one of the finest animation films I have ever seen. The film continually keeps building and building until it peaks at the end when the last guy becomes a star. It almost has the feel of a documentry on life in a America by the way it continually keeps pounding the nail on the head in terms of the storyline and the action scenes cut to music were absolutely brilliant. Considering this film was ahead of anything even close to this (even ahead of MTV for gods sake) it's far and away one of the finest animation films ever made. I think anyone grading this film before a eight just isn't looking at this film as a film and instead putting it against a Disney film or something that's pretty but has no point. For my money I'd easily stack this film against any other animation ever made. Also I saw some people nay saying this film because of the soundtrack, but it's all a natural progression man and in this film it shows the progression of life and music and in 1981 that's what was popular and I thought it was a great choice since it's still listen-to-able today.<br><br>Extremely great film, if you haven't yet... Go see it now!","user":"Mellow_Biafra","rank":[23,27]}]