[{"title":"Cracking Good Brando","rating":8,"date":"24 February 2005","review":"\"The Appaloosa\" is a superior low-key western with a great performance by Marlon Brando and very good ones by John Saxon and Anjanette Comer. Brando plays a white man raised by Mexicans who returns from the Civil War tired of killing and ready to build a ranch around one Appaloosa stallion. Brando has the misfortune of becoming a tool for Comer to escape the clutches of Saxon. Saxon retaliates by stealing Brando's stallion, and Brando follows Saxon into Mexico to reclaim it. Director Sidney J. Furie (\"The Ipcress File,\" \"Iron Eagle\") extensively uses extreme close-ups of faces, in the same manner as Sergio Leone, but not for the same purpose. Furie uses these close-ups to establish intimacy between the characters and the audience. This works beautifully in \"The Appaloosa,\" particularly so since the story is so unremarkable and low-key and Brando's character is by no means a superman. Most of the violence is of the \"G\" rated variety, with the notable exception of a hand-wrestling contest played with the addition of scorpions.<br><br>While the ending of \"The Appaloosa\" is as abrupt and unremarkable as everything that precedes, intimate moments in the movie linger long after. As examples:<br><br>o Brando's confessional o The little girl telling Brando he smells like a goat o The goat herder telling Brando about Saxon's gunmen killing his pet goat o Comer telling Brando her fate if he doesn't help her escape Saxon o The hand-wrestling contest<br><br>There are many more unremarkable but somehow memorable moments in the sublime \"Appaloosa.\" It is too insignificant to be great, but it most certainly very good. I give \"The Appaloosa\" an \"8\".","user":"Bob-45","rank":[25,30]},{"title":"Great movie! Totally unexpected. Brando's spaghetti western.","rating":9,"date":"5 June 2005","review":"I caught this on television and loved it. It's Brando's spaghetti western. Lots of fantastic landscapes. close-ups and acting. Not very violent, but extremely effective. Great soundtrack, would be awesome in surround, but mono track was terrific. John Saxon was a great bad guy ( a Mexican, no less) and character actors are authentic. Well worth seeing. Sidney J. Furie shows real skill as a director even though he was only thirty three at the time. There's elements of John Ford, Howard Hawkes and Sergio Leone. Sometimes it was hard to buy Brando in this role, it's more an Eastwood type of role, but he's such a great actor that he becomes convincing. John Saxon playing a Mexican bandit is a terrific performance, even though it's a white guy playing a Mexican. Hollywood at it's best.<br><br>E.Forster Toronto, Canada","user":"errolforster","rank":[20,24]},{"title":"The Wild One on horses.","rating":8,"date":"6 February 2003","review":"During the peak of spaghetti westerns came this little gem with Brando at his subtle best. He plays Matt Fletcher, a Rambo like character from FIRST BLOOD who returns home for some peace and quiet. But Trini, (Anjanette), draws him into a web of jealousy and power control with the town's chief, Chuy, (John Saxon). At first it starts with a little scuffle over Matt's horse, an Appaloosa. But it digs deeper than that when morals are tested. Brando throws in the occasional modern slang that fits into this western period. It's a joy to watch him and the story slowly unravel. This will have to be director Furie's best effort with the help of Russell Metty's photography.","user":"DukeEman","rank":[12,14]}]