[{"title":"The best movie of the rural-America-gangster genre","rating":9,"date":"2 May 2000","review":"If a movie deserves the definition of hard-boiled, this is \"Grissom Gang\". The characters seem to know just a way to face any problem, either major or minor: kill, kill, kill. The setting in the rural, poor Midwest in the years of Depression is both evocative and grinding: it gives the audience a feeling of bleakness and unavoidable violence. The story is carefully constructed, exciting, full of suspense. The characters are very well shaped, much care is given to details. The direction by Aldrich is superb: the action scenes are beautifully filmed, the timing is admirable. In the development of the plot we don't find those failures of strain, digressions and intervals of bore which were so common in the movies of those years, under pretension of style. All the actors' performances are outstanding. Scott Wilson draws, with masterly acting, the extraordinary character of Slim Grissom. At first, he seems just a half-witted hooligan, but we quickly realize that he is the toughest of them all, looking at other characters' behavior: they are all scared of him, even his gang mates. Actually, the smart gangster Tony Musante seems to take fun in teasing the stupid Slim: but it is clear that this is by no means a good idea. Wilson's acting gives likelihood to Grissom's possessive, infantile, somewhat touching love for Miss Blandish (Kim Darby). He states that, to save her, he is ready to kill his own mother: we have already learned to never underestimate his words. Kim Darby deserves a special mention, in the role of the spoiled girl who learns to survive at all costs, sexual abuse included. She is great here, she was extraordinary in \"True Grit\": I wonder why she didn't become a major Hollywood star. Despite some minor faults, \"Grissom Gang\" is excellent, by far better, in my opinion, of other celebrated movies of the same rural-America-gangster genre, such as Penn's \"Bonnie and Clyde\", Altman's \"Thieves like us\", Corman's \"Bloody Mama\".","user":"pzanardo","rank":[27,29]},{"title":"An extremely brutal, potent and unnerving 70's seriocomic crime sleeper winner","rating":8,"date":"12 March 2009","review":"The 1930's. Spoiled and snotty wealthy heiress Barbara Blandish (superbly played to prissy perfection by Kim Darby) gets abducted by a vicious family of depraved and dangerous outlaws. Complications ensue when the infantile, yet lethal and volatile Slim Grissom (a remarkable performance by Scott Wilson) falls for Barbara. Barbara soon realizes that she will have to do whatever it takes to stay alive. Director Robert Aldrich, working from a tough and biting script by Leon Griffiths, expertly maintains a tense and sordid atmosphere throughout, offers a vivid, grimy and credible evocation of the bleak and desperate Depression era, stages the sporadic shoot-outs and startling outbursts of raw, bloody violence with his customary flair, and further spices things up with a wickedly funny sense of pitch-black humor. Moreover, Aldrich and Griffiths score bonus points for their admirable refusal to either sanitize or romanticize the clan of ferocious and frightening criminals in any way; these folks are truly mean, scary and even downright grotesque. The thespians who portray this ghastly bunch all do sterling work: Tony Musante as smooth heel Eddie Hagan, Irene Dailey as fearsome, venomous matriarch Gladys \"Ma\" Grissom, Joey Faye as the jolly Woppy, Ralph Waite as the excitable Mace, and Don Keefer as the timid, laid-back Doc. Contributing equally fine supporting turns are Robert Lansing as shrewd, weary private eye Dave Fenner, Connie Stevens as brassy, cynical, dim-witted tramp singer Anna Borg, and Wesley Addy as Barbara's cold, disapproving millionaire father John P. Blandish. Better still, we've also got a strangely touching, albeit off-kilter central love story amid all the stark cruelty and unsparing unpleasantness. Gerald Fried's sprightly, rousing score, a jaunty soundtrack of vintage catchy 30's swing tunes, Joseph F. Biroc's sharp, polished cinematography, and the devastating downbeat ending all further enhance the overall sound quality of this supremely harsh, but still gripping and satisfying crime saga.","user":"Woodyanders","rank":[11,11]},{"title":"THE GRISSOM GANG (Robert Aldrich, 1971) ***","rating":7,"date":"28 June 2006","review":"Given its considerable reputation, it seems incredible to me that I've had this film on VHS for over a decade but only now have I gotten round to watching it! Actually, I opted to have a go at it finally after having just watched another James Hadley Chase adaptation - CRIME ON A SUMMER MORNING (1965) - the previous day...but also because, distressingly, many VHS tapes I've had for a very long time are starting to rot on me!! <br><br>Made in the wake of the gangster-film revival spawned by the runaway success of BONNIE AND CLYDE (1967), it can also be seen as a companion piece to Roger Corman's BLOODY MAMA (1970). The film was much criticized at the time for its violence - coming in what is perhaps the cinema's most notorious year, with the likes of A CLOCKWORK ORANGE, THE DEVILS, DIRTY HARRY, GET CARTER and STRAW DOGS! - but its gallery of grotesques is at least just as disagreeable!! It doesn't really have any sympathetic characters, but \"The Grissom Gang\" itself is such a lurid menagerie of harridans, dimwits and sleazeballs that one would doubtless need a shower after having spent two hours in this company! For what it's worth, the film is extremely well made (compelling, richly-detailed, exceptionally acted) and even very funny if one is attuned to the director's uniquely absurdist and delirious mind-set.<br><br>Still, its general unwholesomeness may well have curtailed Kim Darby's cinematic career - though here she demonstrates remarkable maturity when compared to her fresh-faced sparring with John Wayne in TRUE GRIT (1969). Scott Wilson's role is perhaps the best he ever had (even keeping in mind his impeccable work in both IN COLD BLOOD [1967] and THE NINTH CONFIGURATION [1980]) - though his dumb backwoods hoodlum, alternating between mother-fixation and drooling over Darby, eventually overstays its welcome. Irene Dailey's relentlessly overwrought performance as Ma Grissom (needless to say, the actress' most significant role), then, borders on camp and matches Shelley Winters in BLOODY MAMA. Tony Musante embodies the stylish side of crime with his chic attire and playboy ways, who's bound to clash with Wilson over attractive kidnapped heiress Darby. Also notable in the cast are Connie Stevens as Musante's ill-fated moll, Robert Lansing as the journalist investigating the kidnapping case and Wesley Addy as Darby's contemptuous father (who considers her 'tainted' by the experience and actually doesn't want her back!).<br><br>The finale, then, with the majority of the gang decimated at their hide-out - followed by Wilson's come-uppance outside a barn (after having spent the night with Darby for the last time) is appropriately vivid. By the way, the novel on which this is based had been filmed in Britain in 1948 under its original title, \"No Orchids For Miss Blandish\", but that version is only remembered - if at all - for how bad it actually was!","user":"Bunuel1976","rank":[15,17]}]