[{"title":"Kumiko and Daniel","rating":10,"date":"22 August 2007","review":"As a huge fan of the Karate Kid trilogy, you'll have to excuse me while I give my first sentimental statement ever on IMDb. I believe in my heart that in that parallel universe where our favorite characters from film still live, that Kumiko and Daniel would be together today. Either Daniel would have gone to Okinawa to be with Kumiko or Kumiko would have come to the States to be with Daniel. Of course, we learn in Karate Kid Part III that Kumiko decided not to go with Daniel back to California. But in my mind, this is insignificant and has no negative implication for their future. Sure, they both would have had relationships with other people. But having been through what they experienced together, they would not soon forget the bond between them. You wouldn't forget someone that saved your life? Compared to Ali from Part I and Jessica from Part III, it is more than apparent that Kumiko was the love of Daniel's life. Whether it be two years or ten years after the end of Part III, Kumiko and Daniel would have eventually reconnected and continued to live their lives together. Now if you'll excuse me, I'm going to go crush a beer can on my forehead to reconnect with my masculine side.","user":"cwbellor","rank":[51,60]},{"title":"Wonderful childhood memories","rating":16,"date":"16 June 2003","review":"I can't tell you how good it made me feel to recapture the joy I first experienced in the theater.  I was 12 years old when this came out.  The story and plot are simple, and the lessons are very clear.  They definitely don't make films like this nowadays.  Memories of me sitting in the theater alongside my grandmother, eating loads of buttery popcorn, and telling her about all the good scenes (she couldn't see well)<br><br>I have seen this movie over 200 times, and never get tired of it.  I recommend viewing both The Karate Kid, and the sequel to at least get the full effect.<br><br>Awesome 80's flick, and one I'm proud to own.  Five stars.","user":"mjessic2","rank":[42,51]},{"title":"Lessons in life not a brainless kick-ass movie","rating":10,"date":"13 September 2008","review":"I am sorry to disagree with the comments of \"drlawyer\" since it only reflects the urge to see fight scenes. Karate kid 2 is a perfect sequel and shows the spiritual side of martial arts. Why measure a sequel with the 1st movie at all? Both, (Karate kid1 and Karate kid2) are unique and have complete story lines. Even for those who only saw the second movie, there is no gap due to the main flashbacks presented in the beginning of it. The acting is excellent and has no need for quick chopped up editing like now-a-days movies do. The grief and emotions connect with the viewer. I saw both movies about 20 times and could see them 20 times again.","user":"redpenphantom","rank":[26,31]}]