[{"title":"\"Yah, Here Come The Rangers, The Best in Texas.\"","rating":9,"date":"20 May 2004","review":"John Wayne made better films with John Ford and Howard Hawks and he even made more historically accurate films. But for pure entertainment value this is the quintessential Duke.<br><br>Cecil B. DeMille was of the opinion that motion pictures have to move. He wouldn't have anything to complain about The Comancheros on that score. There's not a dull moment in the film. This was the last directorial effort of Michael Curtiz and he kept the action flowing.<br><br>Three things stand out in The Comancheros. First Elmer Bernstein's music keeps the action going. You will be humming that theme days after viewing this film. Secondly the Cinemascope photography is breathtaking even viewing a formatted VHS copy. I remember seeing The Comancheros in the Sheepshead Bay Movie Theatre in Brooklyn as a lad and a theater is where this film should really be viewed.<br><br>But mostly since the two of them are on the screen together for about half the film, the chemistry with John Wayne as Texas Ranger Jake Cutter and Stuart Whitman as fugitive Paul Regret is what sets the whole tone of the film. Wayne and Whitman only worked one other time together and that was in The Longest Day. They were such a perfect fit it's a pity they didn't do more together.<br><br>This was also the first time the Duke worked with Lee Marvin. Marvin's character is only on screen for about 10 minutes, but you remember him throughout. This is also the final screen appearance of Guinn \"Big Boy\" Williams who must have done at least fifteen films with Michael Curtiz back in the heyday of Warner Brothers.<br><br>The Comancheros deserves an honored place in the performances of John Wayne and can't be beat for entertainment. A MUST for Duke fans.","user":"bkoganbing","rank":[59,64]},{"title":"Pretty Good John Wayne Vehicle for John Wayne Fans","rating":7,"date":"30 September 2005","review":"This is an entertaining John Wayne movie, with a good cast. It may not rank right up there with the great John Ford westerns and other films The Duke was in, it nevertheless presents the essence of John Wayne during this phase of his career (call it \"mid-career\"), and actually foreshadows the John Wayne we would see for the rest and remainder of his career. This is a high quality, well-made film --probably a testament Michael Curtiz's directing-- and the quality of the film, and its obvious production values, are evident throughout. One way this shows itself is, although the movie was made in 1961, it really seems and feels like a much newer movie, made 5 or even 10 years later than it was. I don't know what to attribute that quality to other than simply it being a well-made film.<br><br>In a way the movie is three movies, consisting of three separate but connected story arcs, any or each of which could have been beefed up and expanded into movies unto themselves. The story is thusly layered with complexity, which keeps it all interestingly moving along apace, never bogging down. It is also however the source of the movie's only real flaw. And that flaw is, as other reviewers have noted, the movie's presentation of a dubious and flawed historical chronology. And it isn't just little anachronisms like repeating rifles out of time. There is a complete confusion of historical eras and historical settings. Even though the story is set in 1843, its time seems to vacillate throughout, in one arc staying true to the story it is or purports to be, a story set in the antebellum south, but then jumping in another arc to a story appearing to be more similar to the further-western and decades later Indian wars, circa the 1870s. It seems as if there was lot of trouble deciding which of those two kinds of stories the movie was telling, a story about events in the antebellum south or a shoot-em-up story of the western Indian wars. It is likely a problem of scriptwriting, having had numerous \"treatments\" or rewrites by more than one writer, and those seams show. My guess is ultimately director Michael Curtiz and producer George Sherman must have decided that the typical ticket-buyers for this movie would be fans of John Wayne westerns, and that target audience would not be comprised of history majors or even history buffs, or be ones to get hung up on historical details, so they just let the historical flaws slip through.<br><br>There is one unintentionally funny moment in the movie. About mid-way through, watch for the blood-curdling scream by the bed-ridden lady (Joan O'Brien?) at the outpost when she looks out the window and sees the supposed Indian raiders crossing the river. It is truly a classic and world-class movie scream. I wonder how many takes that took.<br><br>One of the movie's three story arcs features Lee Marvin. This is a pre-Cat Ballou, pre-Dirty Dozen Lee Marvin who at this point in his career wasn't really yet a bigtime Hollywood household name, at least not like he would later become. Marvin turns in a marvelous over-the-top performance as a gun-dealing rapscallion, in my opinion flat-out stealing every scene he's in. That's no small feat, considering in all of his scenes he was playing directly off against John Wayne, who almost fades into the woodwork in the comparison. Actually Wayne sublimates himself quite well. He knew how to be a team player, and the chemisrty between Wayne and Marvin is good. Unfortunately this story arc is really nothing much more than a side-story than anything else, so Marvin's role is quite limited. Too bad. I would've liked to have seen a lot more of Marvin in this film. It would have been a better movie for it. <br><br>Lee Marvin, John Wayne and Marvin appeared together again two years later in John Ford's Donovan's Reef, with Marvin again playing a lesser role. <br><br>This movie pops up regularly on the Encore Westerns channel. I've seen it there about 5 times over the last 6 months. Watch for it.","user":"tightspotkilo","rank":[31,33]},{"title":"Overlooked great performance in a bit part","rating":14,"date":"14 September 2003","review":"I Recently got The Comancheros on DVD and watched it last night. I believe that is the first time that I have seen this film completely. I must admit to having a preference for John Wayne's earlier films from Stagecoach into the late 40's. This was the period when the studios were stills casting John Wayne in assorted roles with greater for lesser degree of success(who could forget him as the Mongolian emperor?) So only recently, I have been rediscovering his great performances in his middle period. But this is about another actor in this film. I just read all the other user comments listed about this film. Several correctly praised the small part played by Lee Marvin. He is always reliable for standout performances. But not any of the comments mentioned the truly standout performance by unknown \"Guinn 'Big Boy' Williams\" in the part of Ed McBain, the gunrunner. It was a small role but to my thinking probably the best acting in this or many other movies. Well, that's my two cents. \"Nuff sed\"","user":"olds2347","rank":[26,30]}]