[{"title":"Mostel, Silvers, Gilford, and Michael Crawford!","rating":10,"date":"23 August 2005","review":"Very funny film version of the smash Broadway musical, but minus most of the music. Sort of a bawdy tribute to slapstick comedy and vaudeville, the film is uniformly wonderful, the pace fast, and the jokes funny. This show was a major success on Broadway for Zero Mostel and decades later for Nathan Lane.<br><br>The plot is zany and convoluted and the style of comedy is similar to 60s slapstick used in everything from Tom Jones to Lock Up Your Daughters. Director Richard Lester uses film technique to keep the few musical numbers from stopping the pace of the film, and it works surprisingly well. And the fond look at slapstick (speeded up film, drag, pratfalls, etc.) is especially apt here considering the great Buster Keaton is in the cast.<br><br>Mostel reprises here as the wily slave who drives the manic action. He wants to be free. Mostel is just wonderful and gets to use his full bag of tricks as a comedian as well as sing \"Comedy Tonight.\" Equally good is Phil Silvers, who sells slave girls next door to the snooty matron (Patricia Jessel) her husband (Michael Hordern), and their innocent son Hero (Michael Crawford---yes THAT Michael Crawford). <br><br>The great Buster Keaton (in his final film) plays Erronius, an old man seeking his long-lost children. Jack Gilford plays a fellow slave, Leon Greene plays the pompous Roman general looking for his bride. Then there are all those slave girls — Annette Andre as the virgin; Inga Neilsen as the mute. Michael Hordern is a surprise as the old lecher and gets to sing, \"Everybody Ought to Have a Maid.\" Jessel is a scream as the hag wife. Lots of scantily clad girls and horny old men.<br><br>Hilarious jokes (Mostel as the soothsayer) and sight gags abound. Mostel, Silvers, and Gilford are masters of this sort of broad comedy, and Silvers and Gilford make truly ugly women. Crawford (decades later The Phantom of the Opera) is really funny as the dopey Hero and does most of his own stunts. Greene is also very funny as the overblown general. <br><br>Lots of other good performances in small parts: Beatrix Lehman as the 104- year-old with no working organs, Peter Butterworth as the Roman soldier, Frank Thornton (Are You Being Served?) as a Roman citizen, the grunting Janet Webb as Fertilla, Roy Kinnear as the trainer, Alfie Bass as the sentry, Ronnie Brody as the short soldier. <br><br>There's so much action here you have to watch this several times to catch all the background jokes. The final madcap chariot race is hilarious. Great fun. And flies everywhere!","user":"drednm","rank":[32,35]},{"title":"It's fast, it's funny, it's Lester","rating":9,"date":"6 July 2001","review":"Recently re-released on DVD, this film is a revelation for anyone who has only seen the pan-and-scan version.  So many of the film's visual jokes are lost when you can't see the whole picture, and if there's one thing Richard Lester knows how to do, it's pack in visual jokes.  Some people complain that Lester altered the original show too much, cutting songs and dialogue alike, but this is the only way people can see Zero Mostel's fantastic -- and frenetic -- performance, so count your blessings.  Michael Hordern is also a hoot as the whipped Senex.  Other members of Lester's stock company put in appearances, from Frank Thornton and John Bluthal to the always-welcome Roy Kinnear (as a matter-of-fact gladiator trainer).  And Michael Crawford never had it better than when he was in front of Lester's camera.","user":"craigjclark","rank":[32,36]},{"title":"Funny, abbreviated version of the stage play","rating":7,"date":"26 November 2005","review":"I hadn't seen this in twenty years, and then on TV (with many cuts and commercials), so I jumped at the chance to view a video recently. \"Funny Thing\" is just as funny as I remembered it to be -- a marvelous opportunity to see the brilliant and hilarious Zero Mostel, plus a dream cast that includes Jack Guilford, Phil Silvers, Michael Crawford (very young), Roy Kinnear, etc.<br><br>Zero Mostel was an incredible Broadway comedic genius, but his most famous work was probably in \"Fiddler on the Roof\", where it only exits as the wonderful Broadway cast album. When they made the film, they inexplicably passed over Mostel to cast the much lower keyed Topol as Tevye. \"Funny Thing\" is more brilliant vintage Mostel from roughly the same period, but we get the real thing as he reprises his performance. No one can really approach Mostel for his comic timing, ability to not only sing but sing FUNNY and the expressiveness of his face.<br><br>Directed by Richard Lester (Hard Days' Night, Three Musketeers), the film is particularly beautiful in its period setting -- Lester had a spectacular eye for detail - and I honestly believe that this is the most realistic film ever done VISUALLY about Ancient Rome. From the credits, I see it was filmed in Madrid, Spain, which must have an incredible treasure trove of Ancient Roman buildings. The sets, costumes, extras etc. are pitch perfect....with one glaring exception. Like a lot of movies, the filmmakers could not bear to show us an attractive young woman in authentic period costume or makeup, so all the courtesans are circa 1967, right down to their blue eye shadow, false eyelashes, push up bras and back-combed hair!! <br><br>I understand from reading other comments that nearly 3/4 of the Stephen Sondheim score was cut for the film, which seems like a shame. However, what's left is very funny and well-integrated into the comedy. Many popular sixties film editing techniques are here -- quick cross cuts, Keystone Kops-like action sequences -- and while a bit dated, they fit the broad comedic tone of the story surprisingly well. The ending title sequence is spectacularly done, with wonderful Roman type and fresco's integrated into it.<br><br>Comedy styles go in and out of fashion, so this may not be everyone's taste these days. But having a visual record of a brilliant performer is a highlight and a cultural treasure, and that's what this performance by Zero Mostel truly is. I think most people won't be able to help laughing out loud, even at some of the dumbest and corniest of jokes here, and as usual, the Sondheim score (what remains of it) is delightful and witty.","user":"LilyDaleLady","rank":[16,17]}]