[{"title":"There are several altered versions of this film.","rating":10,"date":"3 July 2003","review":"The film \"Necromancy\" (1972) was considerably altered for a re-released version which I'm not sure was ever shown in theaters (it may have been a straight-to-video release). This altered version, re-titled \"The Witching\"(1981, if I'm not mistaken) is apparently only one of several such versions. Since they are under other titles (\"A Life For A Life\", \"Rosemary's Disciples\", etc.), I'm assuming (though I'm not certain) that these have been altered further. However, I have seen both \"Necromancy\" &amp; \"The Witching\". While the original film (which is next to impossible to find anywhere-though I was able to track down a copy) is a suspenseful, gothic horror film, various key elements were removed for \"The Witching\", including: the final scene, which clears up some plot points while adding a final twist to the story; both the opening &amp; closing titles, which were replaced with painfully ordinary sequences; &amp; the original music score, which included a memorable song entitled \"The Morning After\" (not to be confused with the Oscar-winning song of the same title used in \"The Poseidon Adventure\", released the same year).The new (completely different) music score is horribly, embarassingly cheesy. The sequence of scenes, in some places, was also changed slightly &amp; there was additional (&amp; badly misplaced) footage added. I can only imagine what liberties have been taken with the more recent altered versions, since seeing for myself what else has been done to the original film would be much scarier than \"Necromancy\" itself.","user":"wouldnti","rank":[29,32]},{"title":"My brief review of the film","rating":29,"date":"29 October 2005","review":"A curious low budget horror film, it has two very talented performers at the head of the cast: Pamela Franklin, of 'The Prime of Miss Jean Brodie' and Orson Welles, of many great films. The script does not give either of them the opportunity to maximise their acting potential though, and in fact, the whole story is fairly predictable, quite ordinary or worse. Still, there are a number of atmospheric segments in the film, with fitting music and camera-work setting the mood. It is excessively dark, the odd sound effects are jarring and the cheap special effects do it no good. However, there are some effective moments in the mix. It is not a very good film overall, but it does have some interesting elements. And, for what it is worth, Franklin's acting at times is quite natural.","user":"sol-","rank":[8,8]},{"title":"psycho surrealism mixed with satanic rights and witches= a killer flick","rating":9,"date":"6 June 2006","review":"When I want a cheesy horror flick, I want something that is going to not just entertain, but keep me involved in the plot. This movie delivers on both parts. Not only is it visually interesting with vivid color and special (d)efects, the acting is very convincing. <br><br>If you like scary movies that involve witchery, etc., then you are going to dig the kinks in this film. The special defects are great. As to be expected with any horror flick involving witchery/covens, this flick is loaded with imagery and symbolism: tarot cards,a voodoo doll, goat-headed dudes, black robes, fornication, high priest, traitor/trickster,death, fire,and naked people dancing. This film is very much old-school psychedelia. If you like weird noises and bizarre camera angles, you have got to at least see this film once. Believe me, you will remain interested. <br><br>A psycho-horror film whose surreal ending will keep you up all night with nightmares is a real treat for lovers of cult film and z-grade, Necromancy is a must-see!","user":"ladyksatria","rank":[12,14]}]