[{"title":"Exciting & Very Interesting Period Drama","rating":30,"date":"30 January 2006","review":"This exciting and very interesting period drama makes very good use of its setting in the French Revolution, blending history and fiction together in a believable fashion. The atmosphere is particularly effective, with the dark photography and claustrophobic settings helping to establish the rampant fear, uncertainty, and paranoia that characterized the era.<br><br>At one time, the French Revolution (and the subsequent Napoleonic era) captivated numerous novelists and film-makers alike, and they could comfortably assume that their readers and audiences were familiar with historical figures like Robespierre, Danton, Barras, and the others of the period. In more recent decades, all this seems to have been replaced in the public's imagination by Hitler, the Nazis, and the other figures and events of the Second World War, but in many respects the history of France in the late 18th century and early 19th century is even more fascinating and compelling. And beyond a doubt, its impact still affects the world.<br><br>The scenario here has Robert Cummings impersonating a notorious public prosecutor, in order to get close to the bloodthirsty Robespierre, as part of an underground's desperate plans to replace Robespierre's tyranny with the more moderate influence of Barras and his party. The story is well-written, combining action, intrigue, and some Hitchcock-like touches with Robespierre's \"Black Book\", on which the fate of so many lives depends. Only the lack of a first-rate cast keeps it from being one of the best movies of its time and genre.<br><br>The best performances come from Arnold Moss, who is excellent as the slippery, conscience- free Fouché, and Arlene Dahl, who is appealing as the ex-lover of Cummings's character, with whom he has to work closely. The rest of the performances are all at least solid, but often miss the extra depth that could have raised the movie another notch.<br><br>Nevertheless, it all works quite well, and it's well worth seeing for its story, atmosphere, and for the intriguing period setting. It represents fine craftsmanship from director Anthony Mann and his cast and crew.","user":"Snow Leopard","rank":[40,40]},{"title":"Unusual and Stunning Anthony Mann Film","rating":23,"date":"23 August 2004","review":"I watched REIGN OF TERROR, aka, THE BLACK BOOK last night and I just loved it! It's one of the most unusual films I have come across and an equally strange hybrid of genres or sub-genres. The great Anthony Mann takes a film that would probably play mostly as a colorful, sweeping, epic piece dealing with the French revolution and turns it, with the help of cinematographer John Alton, into a dark, shadowy and claustrophobic film noir/adventure/spy/suspense tale period piece featuring excellent performances from a cast that includes Robert Cummings, Richard Basehart and Arlene Dahl. The plot is pretty simple actually, Cummings plays an operative of the newly formed republic who infiltrates the inner circle of dictator wannabe Basehart. You see, Basehart thinks Cummings is a regional tyrant as bad as he is called the \"butcher of Strasbourg\" and he wants Cummings to find his black book which contains the names of friend and foe alike who will eventually be lead to execution once Basehart becomes dictator. However, if the book falls into the hands of his enemies, Basehart is dead meat. Cummings is assisted in his quest by the lovely Dahl. Even though the plot may be thin, the suspense and action are on high as danger and one confrontation after another awaits around every dark, gloomy and shadowy Parisian corner. The look of the film is outstanding. Atmospheric, gritty and dark with shadows everywhere in the great noir tradition. Mann's camera is everywhere as we receive his trademark high angle shots, low angle moments and jarring and disjointed facial close-ups. A truly unique and highly entertaining film with a look and feel that just has to be experienced. I loved it and would recommend it highly to anyone with even the slightest interest in the work of the wonderful Anthony Mann.","user":"NoirFan62","rank":[59,61]},{"title":"\"The Scarlet Pimpernel\"goes film noir!","rating":1,"date":"1 October 2003","review":"There isn't anything happening in the plot to this little gem that hasn't been seen in at least 6 or 7 other films dealing with this time period.The difference,however,lies in the treatment.The other movies usually paint the protagonists in bold colors,emphasizing their dash,flair,attractiveness,and nobility,while the leaders of the reign of terror are seen as savage,cruel,inhuman,bloodthirsty,and psychotic savages.Well,they still are in this film,but the hero and heroine also show some pretty dark,sinister aspects as well.So,the good guys aren't the kind we're used to seeing. The pleasent surprise is seeing more versatility from both Cummings,and Dahl.We're so used to seeing them,especially HIM,as rather shallow,lightweight,and frivolous characters on so many sitcoms and comedies.It would have been a nice treat to have had more opportunities to see them do films of this nature.","user":"schweinhundt1967","rank":[30,31]}]