[{"title":"I Assure You, It Was Intended As Camp","rating":10,"date":"25 April 2003","review":"In regard to some of the other reviews of this film posted here on IMDB, I would like to say:  lighten up!  Does this film capture the quaint Cravenesque sci-fi ambiance of the first movie?  Of course not.  Nor does it capture the dreary, macabre vision of the Alan Moore comic books.  What we have here is a perfect lovely late 80's fantasy/comedy about a seven foot plant man.  If you look at it objectively, perhaps your vision would not be so skewed.<br><br>Now, you may think that I (Daniel Emery Taylor, featured in the film as \"Darryl\") might be slightly biased.  I assure you, it's a possibility. However, you must know that the movie was filmed in fun and meant in fun. From every one-line groaner to every silly sexual innuendo, it was all planned and perpetrated.  To see how serious we were, take a look at the video/DVD cover art.<br><br>To give a summary of the movie:  Swamp Thing returns to thwart Dr. Arcane's plot for immortality.  It's a basic semi-superhero movie plot.  From there, Swampy falls in love with Arcane's daughter, has some great fighting sequences, comes through a faucet, drives a jeep, takes pictures with these two ADORABLE kids (and they're really terrific actors, too ... honesty!), and blows stuff up.<br><br>If you're a fan of B-movies, as I am, you're likely to enjoy this.  There are plenty of laughs, both intentional and unintentional.  The acting is what you would expect, and the effects are really quite good for its day. This is not a movie you have to ponder or concentrate on.  Its subtle social messages and troubled postmodern imagery will not haunt you for days. It's simple fun.","user":"MyKingIsYeshua","rank":[44,45]},{"title":"this movie is dope...you just don't know it.","rating":4,"date":"4 June 2004","review":"I've been reading swampthing comics for a while now and although this movie looks like a pile of puke in comparison to the legendary alan moore run, it a really fun way to kill 90 minutes. honestly, what this movie lacks in respectability, it more than makes up for in charm... you can tell they had a blast making this movie. the action scenes are simple but well executed (the fight with the leech man amongst all those exploding cars... awesome!) the cutesy comic relief parts with the to kids are hilarious (especially when they're scrambling around the living room trying to hide a mountain of porn) and the special effects are more than satisfactory...i don't know what all these other reviewers who think otherwise are talking about. its not a movie that you can just expect to dazzle you without any effort on your part. you have to want to like it. c'mon participate in life a little bit..you're invited.","user":"centipedeattack","rank":[16,18]},{"title":"Highly Enojyable, Intentionally Cheesy B-Movie","rating":8,"date":"11 March 2006","review":"Every once in awhile, a sequel is a million times better than the original. This is just such a sequel! If you look up my review for Swamp Thing, you'll see that I didn't care to much for it. This, on the other hand, was great! They decided to go with the over-the-top comic-book style that the original skirted, which made the movie a lot more enjoyable. The effects improved greatly, the creatures in this actually looked like some effort was put into them! I especially liked the updated Swamp Thing costume, made him look a lot better and more intimidating. Louis Joudan was thankfully back, and his character, Dr. Anton Arcane, was even better than ever! His step-daughter Abby, played by Heather Locklear, was one of many great comic relief characters, along with the bumbling head of security named Gunn, and many others. The side plot with two kids trying to get Swampy's picture was a tad annoying, but it had it's amusing moments. Overall, this was a great intentionally cheesy B-movie, that you really should check out! <br><br>8/10","user":"Vampenguin","rank":[22,26]}]