[{"title":"One of the first films totally starred by Tom Hanks in a bemusing spy-comedy","rating":5,"date":"1 October 2008","review":"This is an American remake from French film written by Ives Roberts and Francis Veber.An innocent concert violinist(Tom Hanks, in the role of the French, Pierre Richard) is wrongly targeted, then he's pursued by a corrupts CIA agents(Art La Flour, Tom Noonan, among others) led by a nasty chief(Dabney Coleman, in the role of Bernard Blier). It's all because an assistant(Edward Herrmann)to head(Charles Durning) of CIA picked the violinist when he was in the airport as a decoy to dupe his contender. Meanwhile he falls in love with a sexy girl(Lori Singer, role of Mireille Darc)who's spying him. But the villain boss orders his complete elimination .<br><br>This is an easy-going comedy with hearty humor, suspense, and a little of action . The tale involves murders, botchers spies,loving lies and quite amusing. Considerable comic talents act with hilarious perfection, they include Hanks, James Belushi and Dabney Coleman, among them. The film is plenty of gags, especial mention for the laughters with a director orchestra interpreted by David Odgen Steirs, arguing against his bumbling players Hanks acting at whole show, Belushi and Carrie Fisher who are playing 'Scherezade' by Rimski Korsakov. Catching musical score by Thomas Newman, though is composed by synthesizer and appropriate cinematography by Richard H Kline. The motion picture is regularly directed by Stan Dragoti. He's usual comedies director, such as, Love at first bite, Zorro gay and Mr Mom.","user":"ma-cortes","rank":[13,16]},{"title":"Spies are US","rating":5,"date":"9 November 2005","review":"If there is a lesson to be learned by Hollywood is not to try to remake whatever was already made, and better. Which seems to be a lesson American movie people seem to forget. The criteria might be that the original film didn't reach a wide American audience, thus the reason for the remake, but frankly, neither Stan Dragoti, the director, or Robert Klane, its adapter, put a dent in what Francis Vever and Yves Robert achieved with the original.<br><br>Then again, if one hasn't seen the French film of the same name, this comedy will appear to be the real thing. In fact, there are hardly any laughs in the film. The best sequence involves the Richard and Maddy in the seduction scene where some of her hair is caught in a zipper.<br><br>In a way, this was Tom Hanks' third film as a lead man. One can't blame him because he is bogged down by a screen play that could have been better. Tom Hanks pales in comparison with the original Pierre Richard, who was a better comedian.<br><br>The cast shows several familiar faces, Dabney Coleman, Charles Durning, Edward Herrmann, John Belushi, but ultimately the ones that fare better in the film are Lori Singer and Carrie Fisher in smaller roles, but ones that afford these two actress good opportunities in which to shine.<br><br>Stick with the original version if you can find it in DVD format.","user":"jotix100","rank":[23,32]},{"title":"Great Sunday-afternoon viewing","rating":6,"date":"28 March 2002","review":"OK, it's not the most brilliant piece of art in the world, but neither is it the turkey that the video guides make it out to be. It's a cute spy-cliché spoof with good performances from Hanks, Durning, Coleman, Belushi, Herrman and particularly Tom Noonan as the deadpan Agent Reese. Super music by Thomas Newman (one of his first scores), an elegant string of sight gags featuring Belushi and a couple of corpses, and a sweet ending scene more than make up for the underlying silliness of the plot and a handful of flatly delivered lines. Good to watch on a Sunday afternoon when you need to occupy your mind, but not TOO much.","user":"anjiaoshi","rank":[14,20]}]