[{"title":"Comedy Cult Classic -- for anyone living in Sweden, Norway or Denmark","rating":8,"date":"16 August 2006","review":"\"Jak kan flyga. Jag är inte rädd.\"<br><br>Stig Helmer (Lasse Åberg) cements his status as lovable nerd in Sällskapsresan (1980), a goofy lanky man who never quite stopped being a shy boy. His nickname is \"The Giraff\" and he always ends up saying the wrongs things. Although this film is one of many in a series of cult comedies starring Åberg and his band of eccentric friends, it is the funniest and most memorable one. If you live in Scandinavia, you will have seen it a dozen of times and if you have grown up in the typical Swedish way, you will have laughed at it even more so.<br><br>Sällskapsresan sees Stig Helmer and his Norwegian friend Ole Bramserud on a charter-trip to the Canary Islands. Stig Helmer is asked by his doctor to deliver a package to a friend of his at the destination and oblivious to the fact that it contains 50,000 SEK, Stig accidentally loses it at the airport and a hilarious mess ensues. But this little criminal detour is not what is funny about the film. The many laughs come from seeing Stig Helmer's clumsy and naive ways juxtaposed to the sleek jet-set style of the pretentious travel guides.<br><br>What elevates Sällskapsresan (1980) and its sequels above generic comedy formula is its brilliant, clear-eyed use of Swedish clichés. Everyone who is a child of the 1950s-1980s has probably been to the Canary Islands at one time or another and encountered the silly tourist things that are present in this film. Here they are overblown and hilarious, but still subtle enough to get us to identify with them. The whole film is really extremely realistic, as are all its stereotypical characters. A real classic.<br><br>8.5/10","user":"Flagrant-Baronessa","rank":[14,16]},{"title":"Truly a masterpiece","rating":10,"date":"17 January 2002","review":"Sällskapsresan is a work from a true genious: Lasse Åberg.<br><br>In this movie he makes fun of all typical charter-tourists who became a large group in the late 70's during the charter-boom in Sweden. The characters he has created are very special in their kind of way. We have for example two semi-alcoholics, one typical \"swedish-couple\", one norwegian, one swedish and two teenage sprited middle-aged women who are looking for fun and pleasure in their holiday. All these characters blend real good as Lasse adds a sort of calmness with his Winnie the Pooh-ish character Stig-Helmer.<br><br>This movie has been watched and amused by the whole population of Sweden. Still, 21 years after its release, it's still a very, VERY funny movie to watch as the people in the movie still exists on charter-trips.<br><br>A gifted mans masterpiece and gift to the people of Sweden.","user":"erik83","rank":[9,10]},{"title":"The best comedy I have ever seen","rating":10,"date":"11 May 2006","review":"\"Selskabrejsen\" as it's called in Denmark is absolutely the best comedy I have ever seen. Stig-Helmer and his Norwegian friend Ole are fantastic together. The different Swedish characters in the sunny south are individually extremely funny in a this-could-really-be-true way. Just let me mention the drunk and his friend. Their \"Ra-da-da-da-da!!\" and swinging their fingers every time they see a chick is classic and almost impossible for myself not to copy. The friend turning the drunk every half hour in the sun as the drunk himself is unconscious all the time is another example. The guide, the \"bad guys\" ,the nerd .... Nobody is \"filling up\" but has his or her own funny story to tell. I have seen the film at least 5 times and every time, it's as funny as the last time. Even now 26 years after it's release. A true classic.<br><br>Sällskabsresan 2, in which Stig-Helmer and Ole travel on a skiing vacation in the Alps is almost as good and very recommendable.","user":"ulrik-27","rank":[6,7]}]