[{"title":"'Born To Kill' - The best Vietnam war movie of all time","rating":10,"date":"14 October 2015","review":"SPOILER: Full Metal Jacket is a 1987 realistic Vietnam war film and is one of the best films of the 80's ever made, directed and produced by Stanley Kubrick. The screenplay by Kubrick, Michael Herr, and Gustav Hasford was based on Hasford's novel The Short-Timers (1979). Full Metal jacket (1987) was Nominated for 1 Oscar. Another 7 wins &amp; 9 nominations. It is one of my personal favorite war movies. I love this movie to death. <br><br>A superb ensemble falls in for for Stanley Kubrick's brilliant saga about the Vietnam War and the dehumanizing process that turns people into trained killers. Joker (Matthew Modine), Animal Mother (Adam Baldwin), Gomer (Vincent D'Onofrio), Eightball (Dorian Harewood), Cowboy (Arliss Howard) and more experience boot-camp hell pit bulled by a leather lung D.I. (Lee Ermey) viewing would-be devil dogs as grunts,maggots or something less. The action is savage, the story unsparing the dialog spiked with catching humor. From Basic training rigors to Hue City combat nightmare, Full Metal Jacket scores a cinematic direct hit.<br><br>The film focus on a two-segment look at the effect of the military mindset and war itself on Vietnam era Marines. The first half follows a group of recruits in boot camp under the command of the punishing Gunnery Sergeant Hartman. In the hell camp the dehumanizing process turns people into trained killers. From boys in to a trained mean machine killers. It's the late 1960s at Parris Island, South Carolina, the U.S. Marine Corps Training Camp, where a group of young Marine recruits, after having their heads shaved, are being prepped for basic training by the brutal Gunnery Sergeant Hartman (R. Lee Ermey), whose orders are to \"weed out all non-hackers\". Hartman gives each of the Marines nicknames; one pragmatic recruit who talks behind his back becomes \"Joker\" (Matthew Modine); a Texas recruit becomes \"Cowboy\" (Arliss Howard). And finally Leonard Lawrence, a 6-foot 3-inch, 280 pound, slow-witted recruit with low intelligence and ambition becomes \"Gomer Pyle\" (Vincent D'Onofrio), and the focus of Hartman's brutality, because the overweight boy cannot keep up with the other more physically fit recruits in the grueling obstacle courses. The first half more focus on training basics preparing recruits before they ship them to Vietnam and point view story telling from Private James T. \"Joker\" Davis (Matthew Modine) and about torture physics of a young men who is a marine recruit in the platoon lead by Gunnery Sergeant Hartman his Parris Island drill instructor who tortures him by punish his whole squad for his mistakes. And how that young man turns in to a killing mean machine that blows Hartman's head off! And than Pyle sits down on a toilet, places the muzzle of the weapon in his mouth and pulls the trigger, killing himself. <br><br>The second half shows one of those recruits, Joker, covering the war as a correspondent for Stars and Stripes, focusing on the Tet offensive. The film now more focus on one of those recruits Private Joker (Matthew Moddine) from the boot camp Parris Island, who is in Da Nang Vietnam, reporting on the Vietnam War for the military newspaper Stars and Stripes. He and his partner, combat photographer Rafterman (Kevyn Major Howard), meet a prostitute (Leanne Hong) in the streets and encounter a thief (Nguyen Hue Phong) who steals Rafterman's camera. When they return to their base, they are given new assignments, but Joker wants to go to the front lines to get a good story. Joker and Rafterman are assigned to Phu Bai, a Marine forward operating-base near the ancient Vietnamese city of Hue, Joker is reunited with his team recruit from his training boot camp Paris Island, Cowboy and his unit, the Lusthog Squad, before they met Cowboy's Unit they are go trough They go to the mass grave and find over 20 bodies in a mass grave that have been covered with lime.<br><br>The film is Staney Kubrick's best realistic Vietnam War film of all time. One of my all time favorite Vietnam War flicks from the 80's, the other film is Platoon (1986) Once more there's excellent cinematography - check out the haunting, almost claustrophobic landscapes of Vietnam. The combination of the demented treatment the recruits receive in boot camp with the combined \"hours of boredom, seconds of terror\" feel of the Vietnam scenes is intense and not for everyone, but feels REAL. I love how the film focus more in a city of Hue and the battlefield starts their. The battle scene sequences are outstanding and Terrific!They look real, There are dozen's of body's out their. We first see Tank driving trough the city of Hue the city's are filed with fire, burning buildings and destroyed houses and street is full of blood. Sergeant Animal Mother (Adam Baldwin),the nihilistic M60 machine gunner of the Lusthog Squad is one of the most beloved characters in the movie and he is at best a supporting cast member. But you wouldn't even think about Animal Mother being just another guy. He is so memorable that you look at him as one of the stars of the show. <br><br>'Born to Kill' - written on Joke's helmet. Is sequent that it has to do with the \"duality of Man\" according to Jung. 10/10","user":"ivo-cobra8","rank":[115,132]},{"title":"The movies finally got Parris Island right","rating":8,"date":"22 December 2006","review":"Though I've read only a couple of dozen of the nearly 500 comments on this film, I didn't see any from ex-Marines who'd had the Parris Island experience. I went through PI in 1957. The time period in the picture would have been about 1967, since the in-country sequence includes the '68 Tet Offensive. Little had changed in those 10 years except the switch from M1s to M16s. <br><br>For the most part Kubrick got Parris Island right on the money. And why shouldn't he have, since his screen DI, Lee Ermey was in fact a real DI before he started acting (he played another DI in \"The Boys of Company C,\" an earlier and lesser Vietnam flick)? He had a built- in technical adviser. The screams and insults and profanity and physical punishment were all part of the DIs armamentarium. When you're facing up to 75 young strangers you need to immediately establish absolute authority and hang on to it for 13 weeks. Furthermore, you want to break the breakable as soon as you can. My platoon had its Private Pyles and though none ended up as he does in \"Full Metal Jacket,\" I remember that they simply disappeared from our ranks, never to be heard from again. Nothing Ermey as Sgt. Hartman does is exaggerated.<br><br>Kubrick, however, does exaggerate. Speaking of Pyle's ending, it's almost impossible for me to imagine that a recruit could manage to sneak a clip of live rounds away from the rifle range. Every shooter at the range has his own rifle coach, and every single round is very carefully accounted for. Kubrick started the killing one scene too early.<br><br>I've read that DIs nowadays are forbidden to use the time-honored f-word, and are not allowed to lay hands on recruits. I don't know if that's good or bad for training (I had my face slapped hard my first day of boot camp and that was just for openers), but then all of us old-timers like to brag about how tough it useta be!<br><br>A final note: It's interesting to compare \"Full Metal Jacket\" to another attempt at a portrayal of Parris Island, Jack Webb's \"The DI,\" made around '55 or '56. Webb tries for authenticity, but as I was to learn a year or so later, his PI was a boy scout camp.","user":"brujay-1","rank":[169,208]},{"title":"Full Metal Jacket 30 years later","rating":9,"date":"28 June 2017","review":"Strange, as I sat to watch Full Metal Jacket for the first time in years, what I remembered most was Lee Emery's Sgt Hartman's rantings and Vincent D'Onofrio. In fact, it was Vincent D'Onofrio's Pvt Lawrence, known as \"Gomer Pyle\" that made this Stanley Kubrick film, truly memorable. I'm noticing this more and more as I get older and revisit old films. The performances, certain performances, even in supporting roles allow a film to keep growing with the passing of time. Full Metal Jacket a shattering film or I should say, two shattering films. The first part, the training, the intro is a masterpiece practically impossible to match up, so, the second part doesn't match it. But, still. A film-experience. Vincent D'Onofrio's performance even more powerful now, 30 years later. Enormous! The British skies over Vietnam is another reminder than an artist's eye knows no boundaries.","user":"alanbenfieldjr","rank":[44,52]}]