[{"title":"An intelligent study of anarchist beliefs","rating":7,"date":"23 April 2005","review":"There were such hopes invested in this film, Lindsay Anderson wrote a book about its production, but it has never really recovered from its commercial and seemingly artistic failure. In truth, for a film that aspires to be an intelligent study of anarchists beliefs, it suffers from a timidity that some may find all too typical of the British films of its period, and from punches pulled in a manner that rather typifies the work of that almost brilliant director, Thorold Dickinson. But it is an intelligent study for all that, gripping and persuasive until one too many plot convolutions spoils it. I have never failed to be moved when seeing it, nor to be frustrated that it wasn't just a little bit better. The story revolves around European refugees in London who get caught up in the activities of anarchists. Valentina Cortese gives a haunting performance as the conscience-stricken refugee caught up in an assassination plot, and a young Audrey Hepburn is her ballet-dancing innocent sister whose life she must save.","user":"kinekrom","rank":[19,21]},{"title":"Worth A look If You Can Find It","rating":8,"date":"1 February 2008","review":"It was said that the director Thorold Dickenson and his colleagues viewed Hitchcock's \"Sabotage\" before starting this film, and I'm not really sure if they learned anything. I do agree with both of the first reviewers for this in that it did have some promise, but it fell short. Perhaps because of the long delay before actual production of the project got under way when Ealing Studios saw it as an unusual product worth tackling.<br><br>Valentina Cortesa did a marvelous job as a foreign refugee living in London who gets caught up in the intrigue unwillingly.This film was one of the only ones that I hadn't seen of Audrey Hepburn's earlier works. Although she only appears in it off and on she is given a broader speaking role than her previous earlier film 'walk-on' parts. She was quite able to act with the best of what this British Film Company had to offer, in a role a bit too understated for me. In fact, the whole film was a little too 'understated', dealing with a bomb plot planned by nationals of a foreign tyranny in 1930's London.<br><br>I would watch this again, as it is now part of my library of hard to find films. I gave it an eight out of ten stars for Cortesa's performance and the early glimpse of Hepburn beyond a one minute spot.One does walk away from this film wishing it was better given it's premise, which is still very much a topic of today as it was then.If you can find a copy I would recommend it.","user":"kenmyersproject","rank":[18,20]},{"title":"A brilliant study of ideology leading subtly into terrorism","rating":10,"date":"17 December 2005","review":"This is a seriously under-rated work of classical British film art on a compelling subject and is as relevant to London life today as it ever was. Considering this film was released in 1952 it explores so perceptively the path from praiseworthy ideology, through working for a noble cause, into terrifying involvement in an act of pure terrorism. Right through you are steadily but inexorably drawn with a lure of truth and justice, into a slowly evolving web of intrigue, conspiracy and ultimately murder, and it leaves you wondering at which point do you actually stray from idealism and decency into cold depravity? Given the '50s context, centred on an urban minority family, the actual plot is still frighteningly relevant and this film is surely just waiting for a re-make to bring it chillingly up to date. Until then, if you can find a copy of this film, watch it - its a vital and absorbing education, in the grand old style, on the strong subject of ideology.","user":"shbruce","rank":[23,27]}]