[{"title":"Allen's best, and one of the best films ever.","rating":10,"date":"17 March 2003","review":"The film that bested Star Wars for the 1977 Best Picture Oscar, Annie Hall is a remarkable achievement in filmmaking that transcends its simple, romantic premise to create a stunning portrait of not only 70's pop culture, but of human nature cumulative.  Directed and co-written by Woody Allen, who has since directed other gems such as Hannah and Her Sisters and The Purple Rose of Cairo, Annie Hall also stars Allen as Alvy Singer, a neurotic, death-obsessed comedian who seems unlucky in love and life.  That is until he meets Annie, brilliantly played by Diane Keaton, who is beautiful, fashion-savvy, carefree (she likes using expressions like `la di da'), and a terrible driver.<br><br>Annie and Alvy's relationship is an unlikely one.  She's a Midwestern girl, straight out of white-bread Wisconsin; he's a life-long New York Jew who grew up (literally) under the Coney Island roller coaster.  He's been seeing a therapist for the past 16 years; she only `needs' one once she meets him. She's an extroverted aspiring singer; he's an introverted, world-despising imp.  Yet Allen and Keaton are so perfect in their roles, they improbably make this couple one of the most memorable ever.<br><br>The plot revolves around Alvy's chronicles of loves lost and a retrospective on his relationship with Annie, with whom he has since parted ways.  At the end of the film, we see Alvy try his hand at stage-writing-he writes a play about his relationship with Annie, but gives it a happy ending.  Yes, Annie and Alvy don't have a fairy tale ending to their relationship, but Alvy certainly wishes they had, even though he learns to live with the acknowledgment it has failed.<br><br>The best part of Annie Hall is its incredible screenplay-the best ever to be written.  Not a word is wasted nor a line unquotable.  Except here, while Allen's early films had thrived on streams of one-liners, Allen doesn't go for cheap laughs-each line is simultaneously hilarious and poignant. Everything is part of a greater whole.  We laugh because it's funny, but there's a greater dynamic at work in Annie Hall.  This is a story not exclusively about a relationship between two people, but also a musing on 70's politics, drugs, East Coast/West Coast rivalry, narcissism, religion, celebrity, and several other topics with which Allen deals with extraordinary ease.<br><br>Yet Annie Hall would not be among my favorite films of all-time if it were just Woody Allen ranting and raving about what he likes and dislikes. There are other Allen films that serve that purpose, i.e. Deconstructing Harry, and they're not nearly as good.  What separates Annie Hall is its grace, the believable chemistry between Keaton and Allen, the unique direction (ranging from split-screens to cartoon imagery to on-screen subtitles of what the actors are thinking), but mostly because it's the rare film to find a perfect balance between sheer entertainment, humor, and poignancy.<br><br>\nWhen the dust had settled, Diane Keaton deservedly won an Academy Award for her performance, Allen took home Oscars for direction and writing, and the film beat out Star Wars for Best Picture, which most people consider a complete sham.  Evidently, those people didn't see Annie Hall, for if they had, they'd recognize that the acting, writing, and even the direction in Star Wars can't hold a candle to Annie Hall, one of the best films ever made.<br><br>10/10","user":"polystyreneman64","rank":[261,331]},{"title":"A perfect romantic comedy","rating":9,"date":"16 May 2004","review":"`Annie Hall', long thought to be Woody Allen's opus, is perhaps a perfect romantic comedy because it not only shows the happy, touching moments of relationships, but also displays the reality of coupling  the occasional waning of interest in one another, the hypercritical moments, etc.  It is absolutely brilliantly written; Woody Allen exhibits his usual dry humor and self-deprecation, but also his sensitive, passionate and romantic side.  It was because of this film that I fell in love with Woody Allen at the age of twelve (take your cheap shot here) and almost twenty years later he still is that intellectual, bookish and humorous ideal.  Diane Keaton was his muse and co-star for this film, and they are perfect counterparts  so much so that their interaction onscreen doesn't seem like viewing two actors in a film, but is a much more voyeuristic experience.  Watching `Annie Hall' is like sitting at a bistro table and observing another couple a few tables away, and that is just one of the elements that make this film so endearing. Most people can relate to at least some aspects of Alvy and Annie's relationship, which helps make this film a timeless one. <br><br>\nHowever, `Annie Hall' is not just a good romantic comedy; it is a film that engages some unusual storytelling techniques.  Actors speak directly to the audience, characters interact with strangers on the street who just happen to know the answers to the personal questions posed, there is a brief animation scene, etc.  While none of these approaches were new in 1977, their execution was inspired.  `Annie Hall' is like a fond memory, or a favorite old song  anytime I have discussed this film with others their smiling expressions are usually tinged with a hint of nostalgia, because one can look back on either their past or current relationship and do what precious few films allow us to do  relate on a personal level.<br><br>--Shelly","user":"FilmOtaku","rank":[155,205]},{"title":"I Forgot My Mantra....","rating":9,"date":"12 February 2006","review":"Woody Allen's seminal 1977 romantic comedy \"Annie Hall\" is not only laugh-out-loud funny (with some of the most quotable dialogue ever written for the screen...this is the \"Casablanca\" of comedies, folks) but also sweet and charming (due in large part because of Diane Keaton's smashing performance as the title character, the flighty singer from Wisconsin with a quirky fashion sense and \"neat\" outlook on life) without ever turning trite or sappy like so many romantic comedies tend to do. Allen wisely deconstructed the genre with his non-linear story-line (something that was later done to even greater effect with a more recent and profound look at relationships, \"Eternal Sunshine of the Spotless Mind\") and charming little theatrical tricks like talking to the audience or pulling extras into the scene for their opinions on what's been going on. It keeps the viewer off guard and allows for a free flow of comedic and philosophical ideas that might otherwise not have found their way into a more traditional film.<br><br>In his latter years, Allen's best work has been when he is not part of the cast (my personal favorites being \"Bulletts over Broadway,\" \"Sweet and Lowdown,\" and the recent \"Match Point\"). \"Annie Hall\" was made in his heyday when he could still pull off playing a neurotic New York Jewish comedienne with charm and panache. There's something innocent and benign about his obsessions here, as this was long before the Woody/Soon-Yi fiasco and the days of grossly miscasting himself against younger female co-stars. Yes, Mr. Allen has been artsier (witness \"Manhattan\") and more satirical (witness \"Zelig\") but here, with Diane Keaton as his muse, he was never more charming or funnier.","user":"WriterDave","rank":[67,89]}]