[{"title":"A masterpiece - one of the best epic-action films of all time my personal favorite","rating":10,"date":"13 February 2018","review":"Aliens (1986) is the best Epic Sci-Fi Classic Action Movie of all time and one of my personal favorite best action sci-fi flicks that I love to death. Just like I love The Terminator and T2, I love this movie to death. James Cameron's classic masterpiece. The now classic science fiction film was only the third feature directed by James Cameron (following Piranha Part Two, The Terminator). It is the sequel to the 1979 film Alien and Alien is a masterpiece I love that film, but I love this movie more sorry this is my personal opinion this is my movie. I am not saying it is better than the original movie but it is right up there with Alien a real classic. <br><br> Ellen Ripley (Sigourney Weaver), the sole survivor from the original \"Alien\", returns to Earth after drifting trough space in hyper sleep for 57 years. Although her story about the Alien encounter is met with skepticism, she agrees to accompany a team of high-tech marines back to LV-426 and this time it's war! It has great cast I love the marines fighting aliens in this movie. The movie stars: Sigourney Weaver, Michael Biehn, Carrie Henn, Paul Reiser, Lance Henriksen, Bill Paxton, William Hope, Jenette Goldstein, Al Matthews, Mark Rolston , Ricco Ross, Colette Hiller, Daniel Kash ,Cynthia Dale Scott and Tip Tipping and they are all believable enough.<br><br>I love the characters beside Ellen Ripley, Newt, Corporal Hicks, Bishop, Private Hudson, Private Vasquez, Sergeant Apone, Private Drake, Private Frost, Corporal Ferro, Private Spunkmeyer, Corporal Dietrich, Private Crowe I love those platoon of US Colonial Marines I know I haven't mentioned Burke because he was the bad guy and I don't like him. But most of the characters in this movie I love. <br><br> I know it is a sci-fi action film but it also does a have a horror mixed together people just don't see that. There's plenty of horror in it. The nightmare sequence in the beginning, the creepy atmosphere of the LV-426 colony, and the heart pounding face hugger on the loose scene in the medical bay. You see mother of those aliens who cocooned all the humans and killed them you see Ripley finding the nest and fight the Alien queen on the end. Ripley faces her fear and gets over her PTSD by going in by herself to rescue the Girl/Fight the Aliens/and Destroy the Entire Nest...Battles One on One with an Alien Queen and Whips its' Ass...and, by the end, now both her and Newt can dream without the worry of any more Nightmares (which plagued Ripley at the beginning of the film).<br><br>This is the finest action movie of all time. And, yet, believe it or not, it's not the action in the film itself that makes this be the case. This is especially odd in a movie with a $100 million budget (in 1986!), with multiple huge explosions, with thousands of bullets fired, and scores from James Horner of stuntmen used.<br><br>10/10 I have the Blu-ray disc which it also have a special edition version on it I used to had this film on DVD but I throw it away because I bought the Blu-ray which I am very happy about it. I love this film to death it is my personal favorite sci-fi action film even Lance Henriksen from Hard Target and The Terminator is in here and he is the good guy.","user":"ivo-cobra8","rank":[162,182]},{"title":"One of the most thrilling films ever- special edition highly recommended","rating":10,"date":"31 August 2005","review":"James Cameron is an extremely talented action director because not only does he know great action, but he always backs the action up with a great story and interesting characters. Aliens is his finest achievement, as far as I'm concerned. Of course, I should specify: Aliens Special Edition is his finest achievement.<br><br>In 1986 several scenes were cut to keep the movie's run-time reasonable but there was one scene that was incredibly foolish to leave out. The scene I refer to is near the beginning where Ripley learns that her daughter has died while she was away in 'hypersleep' for 57 years. \"I promised her I'd be home for her 11th birthday,\" cries Ripley. This is a very moving scene that adds a great deal the character's depth and makes more sense to why she cares for a little girl named Newt later in the film. She's seeking penance through Newt with her love and determination to keep her alive at all costs. The theatrical edition obviously doesn't elude to any of this, and even cheapens the relationship between Ripley and Newt- just a little bit. James Cameron has said that all of his movies are love stories, and Aliens is a story of parental love. He has also said that the special edition is his intended (if not definitive) version of the film. For about five years or so the Special Edition was the only version of Aliens you could get on DVD. It should have stayed that way.<br><br>Aliens is a unique film experience: it's genuinely thrilling and exciting, unlike a lot of movies where people shoot the evil monsters and there's disgusting blood and rapid gunfire, and it's really meaningless. In Aliens' case, the aliens are very threatening and more than just target practice. We don't see any aliens for over an hour, but once we do, it's a huge payoff. By that time, we get to know some interesting characters: Hicks (Michael Beihn), a take-charge marine who also turns out to be sweet and sincere, Hudson (Bill Paxton), a braggart who turns out to be a coward and complains most of the time, Vasquez (Jeanette Goldstein), the iron-willed woman soldier who proves to be one of the bravest characters in the film, Bishop (Lance Henrikson), a robot that is very helpful for everyone's survival, Burke (Paul Rieser), the slimy company man who the audience loves to hate, and of course, the adorable little Newt (Carrie Henn), a girl who has survived unspeakable horror. Holding the whole film together is Ripley, played by Sigourney Weaver in her surprise-Oscar-nominated performance. I think the only reason why the audience cared for her in the first film is because she was the only person left and we wanted her to live. But for this film, James Cameron added so much to her. With all this investment in characters, we're really concerned for their well-being. We don't want those aliens to get them. Some die, and I'm always truly bummed out when it happens.<br><br>Filled with amazing performances and an abundance of thrills, Aliens is one of the greatest of any genre it attempts: whether it's action, sci-fi, horror, or even drama. I personally liked it better than the first film, but it's really like comparing apples and oranges. I prefer the special edition and don't see why anyone should view the other version instead.<br><br>My rating: 10/10","user":"Derek237","rank":[220,255]},{"title":"Outstanding blend of sci-fi, action, and humour.","rating":23,"date":"23 February 2000","review":"I rate Aliens a perfect 10.  This second installment in the Alien series evolves the original movie's horror/sci-fi genre into action-adventure/sci-fi, setting a standard which has not yet been matched. I like this movie because it paints a picture of the future which is realistic enough to suck you in during the beginning of the film and then quickly introduces you to interesting characters who you become concerned with; some you love and others you hate.....but none of them bore you.  By the time the action starts it's possible to forget you're watching a movie (at least the first couple of times).  The plot is filled with tension that is occasionally broken by some of the most memorable one-liners in history (especially by Private Hudson).  The special effects are remarkable, considering the fact that they were accomplished the \"old fashioned way\" prior to digital manipulation.  I can report that I now own the Director's Cut and rate this version a 10 also.  The extra footage will be extremely interesting to fans of the 1986 release.  Either version gives you great characters, suspense, action, firepower, sarcasm, and wit.  Aliens is an outstanding show!","user":"ruth.boaz","rank":[352,418]}]