[{"title":"The Genius And His Stars","rating":10,"date":"2 October 2006","review":"Hitchcock introduces his stars with a cinematic blow that makes the opening of this dark, scrumptious thriller a monumental treat. He uses their star personalities and turns them round to dislocate us, teasing us with his unmistakable touch. The absurdity of the plot becomes totally plausible and the suspense is not merely unbearable but thrillingly entertaining. All of Hitchcock's favorite emotional and visual toys are present here. The icy blond, the sexual tension, the weakling villain with a castrating mother. A legendary kiss and a happy ending. Whenever I meet someone who hasn't seen any Hitchcock movies - and there are people in this world, believe it or not, who hasn't - I show them Notorious and always without fail, they are hooked forever. Just the way I was, I am and, I suspect, will always be. Cary Grant is allowed a dark unsmiling romantic hero and Ingrid Bergman lowers her strength to become a woman in love and in jeopardy but unwilling to appear as a victim. This gem of a film can be seen again and again without ever becoming tired or obvious. I'm sure you guessed it by now, this is one of my favorite films of all time.","user":"littlemartinarocena","rank":[145,165]},{"title":"My favorite Hitchcock!","rating":9,"date":"2 September 1999","review":"Alicia Huberman (Ingrid Bergman) is the daughter of a German-American who has been imprisoned for turning traitor to the U.S. during World War II. Despondent, she becomes an alcoholic and flits from man to man, until one day a mysterious government agent named Devlin (Cary Grant) comes to her and asks for her help.  Some old Nazi acquaintances of her father's has taken up residence in Rio de Janeiro; he needs her help to spy on them.  Somewhat reluctantly, Alicia agrees.<br><br>Once in Rio, it takes some time for the couple to be assigned their mission. The trip takes on the character of a honeymoon, and Alicia and Devlin start falling in love.  Then their orders do arrive, and Alicia is assigned to infiltrate the house and the bedroom of the Nazi leader, Alexander Sebastian (Claude Rains).<br><br>This movie delivers a very different kind of suspense from Hitchcock's more famous NORTH BY NORTHWEST.  There are no strafing runs by malevolent crop-dusters, no cliff-hanging mountain-climbing scenes, no mad footraces. The suspense here relies all on subtleties that get under your skin and chill you much more than the in-your-face antics of Hitchcock's later piece. The popping of champagne corks signals time running out for two spies in the wine cellar; an impassioned lover seeks to kiss the hand of his lady who has a deadly secret concealed in her palm; a victim of poison sees the shadows of the poisoners merge together on the wall.  The final scene is the best of all.  Who but Hitchcock could imbue the innocent sentence, \"I wish to talk to you,\" with such chilling power?<br><br>This is one of Ingrid Bergman's best performances; Alicia is hardly perfect, but brave and lovely.  Hitchcock was far ahead of his time in discarding male chauvinist attitudes that elevated a woman's chastity and \"ladylike\" attributes over her courage and intelligence.  When a superior disparages Alicia for the lack of \"character\" she has shown by following the orders he himself has given her, Devlin sarcastically lashes out: \"She may be risking her life, but when it comes to being a *lady,* she doesn't hold a candle to your wife, sir, sitting in Washington playing bridge with three other ladies of great honor and virtue.\"  Yet Devlin himself is often unsympathetic and harsh in his treatment of Alicia, and the unfairness of that treatment is sharply highlighted in a manner very sympathetic to her.<br><br>Not to be overlooked is Rains' magnificent rendition of Alexander Sebastian, a villainous but human and rather weak man who genuinely loves Alicia.  I have never seen Rains better except for his immortal portrayal of Cap. Renault in CASABLANCA.  Also superb is Leopoldine Konstantin as Sebastian's domineering, scheming mother.<br><br>NOTORIOUS is intense and meticulously crafted, and benefits from the best acting in any Hitchcock movie.  While NORTH BY NORTHWEST or THE 39 STEPS might be a better introduction to Hitchcock for people used to the slam-bang action of modern cinema, NOTORIOUS is the best I can recommend for those who have already learned to love Hitchcock's work.","user":"Danimal-7","rank":[100,114]},{"title":"In My Top Ten!","rating":10,"date":"30 December 2006","review":"As a young woman, back in the \"olden days\" days before video, DVD and TCM, I was always fascinated by this film, though it came and went on more obscure T.V. channels, with no clue of when it would return. Notorious has everything...inimitable Hitchcock moments, mystery, suspense, personal drama, high romance, passion, great character development, international espionage, nuanced acting, a visually stunning foreign locale, post-war period mystique, patriotism, fine supporting cast, a charmingly evil Claude Rains, a most sinister Mme. Konstantin, Grant at his most enigmatic and romantic, and Bergman her most alluring and luminous. As in all great films, it is a spot-on rendering of its own unique story in the ambiance of its own time, but timeless in its portrayal of human character and emotion. Like a handful of others, it is as satisfying a movie experience now as it was 40 years ago...probably more so...whether on first viewing or 40th.","user":"windsong353","rank":[107,123]}]