[{"title":"Better Than the First Ghoulies","rating":5,"date":"2 December 2013","review":"This is the rare case where a sequel is actually better than the original. Considering that original is the cheap and nasty Ghoulies, it's really not much of an accomplishment. Anyway the plot here is that the Ghoulies make their way to a carnival where business is poor. Their presence manages to help business pick up but of course they do what Ghoulies are meant to do and start killing people.<br><br>What makes this a better movie than the first? Well for starters the carnival setting is more interesting. The special effects for the Ghoulies is improved over the first. The cast is better, helped in large part by veteran Royal Dano and \"little person\" Phil Fondacaro. But ultimately it's the camp humor that this movie has that elevates it above the previous movie.<br><br>All this being said about how it's an improvement over the first Ghoulies, it's still not a very good movie. It's watchable enough for a movie of its kind. But let's not get carried away and say it's anything better than that. So, better than the first Ghoulies but still not very good.","user":"utgard14","rank":[7,7]},{"title":"A vast improvement on the original","rating":7,"date":"24 July 2016","review":"You normally think of cinematic greats such as the Godfather 2, Terminator 2, Empire Strikes Back and Aliens as 'superior' sequels. Not many people ever mention the eighties horror 'Ghoulies 2' in the same breath as any of the affore-mentioned films. However, it is head and shoulders about its predecessor. Although, that's not saying much.<br><br>The original was about a wannabe sorcerer who conjured up a load of evil little critters, aka, 'ghoulies' only to have them turn on him. Sadly, the first film centred on the – pretty bland – humans, whereas the real stars of the show were the nasty little puppets who terrorised people. I'm guessing this was more to do with budget constraints, but, this time round, they seem to have learned from their mistakes. The ghoulies are the stars.<br><br>They're in it pretty much all the way through. Yes, the human characters are still pretty bland, but at least you don't really notice when the monsters get going. You could naturally pick faults in the film by saying how the ghoulies are about two feet tall and would probably find it difficult to actually hurt someone (let alone savage them to death), but we'll just skip that one and assume they are capable of killing tonnes of people.<br><br>It's hardly scary. There's not an awful lot of tension of scares in it (unless you're that afraid of rubbery-looking monsters) and you have to majorly suspend your disbelief to imagine that creatures can walk around a packed fairground and not be seen until it suits the script's needs. But, if you like cheesy eighties horror/monster movies, then give this one a go (and ignore the sequels – the series truly peaks here – and that's saying something!).","user":"bowmanblue","rank":[5,5]},{"title":"B-Movie Classic","rating":16,"date":"16 June 2002","review":"Before you watch this flick, don't expect much from it. It's a sequel to \"Ghoulies\", which should, respectively to the series, lower your standards of what to expect. It's unrealistic. It's cheesy. But it's damn ENTERTAINING! What you get is some rubber puppets, who take over a ghost house in a carnival, attracting visitors who think they're part of the attraction. It starts off with some lovable characters, namely Nigel the dwarf. Anyway, the ghoulies start killing some people who go in there. Then, near the end, they come out and there's a carnival massacre. Some mean killings here, such as death by being run-over by a bumper car. That's about it. This flick, the only \"Ghoulies\" movie I currently own, rests easy in my collection. Overall: 9/10<br><br>GORE BONUS: You wouldn't expect this, but there was actually some gore in this movie, which was edited for both the US PG-13 rating and the UK '15s' rating. The two scenes were, when the girl who is leaving the carnival goes in to the ghost house, she is tied to the floor and the ghoulies stab her before pulling the ropes. And, when the left over teenager gets lost in the ghost house, and the axe is lowered, it shows his stomach being opened and (fake looking) blood spurting out for a while. In the cut version, you just see the axe being lowered. \"0m55s\" was cut from the original UK video release, but the TV version is completely uncut.<br><br>Rated 15s for horror violence and mild gore, and some language","user":"michaeldaly99","rank":[12,15]}]