[{"title":"An anecdote about this movie","rating":3,"date":"3 June 2000","review":"As a pre-production assistant and sound recordist on this film, I remember producer Reuben Trane and Director Ken Wiedernorn returning to the production office after taking co-star John Carradine from Miami's airport to his hotel.<br><br>Everyone on the crew was interested in how Carradine, in his late '70's and a movie icon if ever there was one, looked, acted, felt, etc.  We were all keen to know if he seemed fit and ready for a role that required quite a bit of physical action, including moving as rapidly as possible from a small dinghy to a larger boat, while both were bobbing at sea.<br><br>Reuben and Ken came into the office looking morose as someone asked, \"So, how IS he?\"  I don't remember which of them responded, but one of them said, \"Let's put it this way, he has trouble walking on flat land with a cane!\"<br><br>But, trooper that he was, Carradine did everything asked of him without complaint.  He was also often \"the life of the set\", and in between takes or after a days' shooting, he would regale us all with wild tales of Hollywood and the stars and moguls he had known so well.<br><br>It's been about 25 years since I worked on \"Shock Waves\", but the memory of old man Carradine lives on vividly.  He was a helluva guy.","user":"smaynard-2","rank":[28,28]},{"title":"Nazi Zombies: Underwater Pests of the SS.","rating":8,"date":"5 July 2001","review":"This is a great little film that combines two of the 70s most popular horror movie themes: monsters in the water and undead zombies. It also features the always-wonderful Brooke Adams (from \"Invasion of the Body Snatchers\") in a major role, not to mention both John Carradine and Peter Cushing.<br><br>A group of vacationers being taken on a cruise around some unspecified tropical islands experiences some trouble when a decades-old ship appears out of nowhere and rams their boat. The \"ghost ship\" is populated by undead SS soldiers who were created to survive both underwater and on land, and it goes without saying that they have no friendly intentions.<br><br>The new castaways take refuge on an island inhabited solely by Peter Cushing, a former Nazi commander who was in charge of the \"Death Corps\", and their host gives them a hasty explanation about what they're all up against.<br><br>The rest of the film is the tourists and sailors being stalked and offed by the zombies, who have really wrinkled skin and wear groovy goggles. Unlike the standard flesh-eating zombies of 70s horror, these undead guys don't wanna bite you, they just wanna hold you under the water until the bubbles stop. Genre fans hoping for some cannibalism or guts will be disappointed.<br><br>The visuals in the movie are sometimes striking. The underwater shots of the zombies are bizarre, as are the scenes of them rising up out of the ocean (or whatever body of water happens to be handy). Most of the action takes place on the island, which features a deserted resort that is pretty creepy in itself. A couple of the shots reminded me of \"Carnival of Souls\", with one or two scenes of undead faces looming just under the surface of the water. <br><br>The editing is a bit choppy and slightly incoherent. It seems like a few scenes establishing the characters were excised, as well as some other exposition such as the fate of the tourists's boat (what DID happen to it, after all?). The pacing is also not for all tastes, since this movie never builds into a all-out assault or anything, but it's an enjoyably creepy chiller in the classic 70s style. This is a prime candidate for DVD rediscovery. Watch it if you can find it.","user":"GroovyDoom","rank":[56,62]},{"title":"One of 70's forgotten horror gems","rating":9,"date":"2 February 2005","review":"A group of survivors off a boat disaster became stranded on an island- but that's not their main problem. As now a hermit informs them that the island isn't safe as there are invincible Nazis zombies that lay dormant off the island- but it's to late as they have risen after 35 years from the sea and now they're back to their old ways.<br><br>For an incredibly low-budget film this was definitely enjoyable and a bit inventive in the execution. If you think it's going to be like your usual zombie film forget it. There is no flesh eating and it lacks gore actually there isn't any at all. There is no action packed scenes of zombies and people getting blown away or cut up, as the deaths happen to be pretty quick and sharp. Some we don't even get to see. The deaths might be paced really slowly, unimaginatitive and even bloodless. But I didn't mind, as the point wasn't to shock the audience with violence, but the use of atmosphere and images to keep them captivated and at unease.<br><br>The plot idea of the living dead was a very intriguing one Nazis have produced invincible soldiers for WW2 that can adapt to any habitat because they could live without food and oxygen, with the sole purpose to kill. But when war was over, their U-boat was sunk so they weren't found out. The story itself does get a bit repetitive and some plot holes show up that are pretty transparent and might get on people's nerves. Like why did the Nazi zombies decide to surface now after laying dormant for 35 years. What happen to the pleasure boat and in the first 5 minutes we learn who survives, so now where just trying to figure out what order they will die in, which for some could be quite tedious and less suspenseful, but for me the film's flaws made up for it with memorable images of the Nazi soldiers called 'Death Corps', a sombre atmosphere, alluring setting and Cushing &amp; Carradine to ground it.<br><br>The special effects well there were hardly any, with the exception of the usual rotting corpse - but the make-up of the Death Corps are definitely striking and kind of creepy. Especially when they're lurking in or around the water. I don't know why, but there is something pretty hypnotic about them when they pop out of nowhere in their black goggles. Though their skin is quite pasty and pale, but their uniforms look like they haven't aged at all.<br><br>The lush scenery on the island ranges from the waterlogged swamps; rich beaches, dense forests and the large deserted hotel are quite haunting with the eerie feel of isolation and dread. The electronic score with its vibrant sounds, adds another element into the mix of the very absorbing mood of the atmosphere.<br><br>The direction by Ken Wiederhorn is a bit uneven and slow, but for me the slow pace really built up the anxiety and tension of the situation. With a slow opening, until the Death Corps arrive on the screen, though the pace doesn't entirely pick up as there are slow parts in between the deaths. But the images we see keep you glued to the screen. Wiederhorn might have over-used the 'Death Corps', but somehow you forgive him for the repetitiveness.<br><br>The acting from Cushing and Carradine is superb and the rest of the mainly no-name cast was reasonably fair. As the characters they play are pretty stereotypical and one-dimensional. Peter Cushing as the enigmatic Nazi SS Commander that was formerly in-charge of the Death Corps, but is now a marooned hermit and John Carradine as the Boat's grumpy Sea Captain Ben had only small roles and it was too bad that they didn't share any screen time. But otherwise they still left their marks (especially Cushing's speech on the Death Corps). While the lesser known cast Brooke Adams as the female lead in her first film is delightfully sweet and Luke Haplin as the Captains first mate takes the lead and the courageous heroine role.<br><br>The film itself is filled with ambiguity from beginning to end, but because of that it gives it a dreamlike and mysterious feel that you question did this really happen? It's hardly flawless entertainment, but still a very charming low-budget horror film.<br><br>4/5","user":"lost-in-limbo","rank":[34,39]}]