[{"title":"Richard Pryor: With a Laugh and a Tear","rating":9,"date":"4 July 2005","review":"\"Richard Pryor Live On the Sunset Strip\" showcases comedy legend Richard Pryor in his element, doing stand-up comedy. In his routine, he touches on all subjects, ranging from women to his trip to Africa, and even his scandalous past: the brothel run by his grandmother, his cocaine addiction, and the infamous incident in which he lit himself on fire. There are many laughs to be had in Pryor's delivery, and a few bittersweet moments as well, like Pryor's reminiscences about recovery and kicking his addiction. Even he can look back and have fun with his past. His comedic performance on the Sunset strip will be a wonderful document to remember him by in the future.","user":"EmperorNortonII","rank":[8,9]},{"title":"As good as it gets in stand up comedy!","rating":10,"date":"14 March 2003","review":"I have no idea what is wrong with the authors of the negative comments about this film, but clearly they have no sense of humor because this is one of the funniest stand up routines ever - period.<br><br>Richard Pryor has terrific material, perfect delivery and great comic timing - he is a comic genius. His self deprecating style is simply perfect and extraordinarily funny.<br><br>I have seen this show several times on cable and I laugh often and out loud throughout every time. The opening 20 minutes have some of the funniest stuff I have ever heard particularly the bits about his relationships. And his description of Jim Brown trying to save him from crack addiction and the stories of his subsequent hospitilization for burn treatment are hilarious.<br><br>Highly recommended.","user":"dfc-4","rank":[10,13]},{"title":"Funny. Good Effort, Pryor","rating":8,"date":"16 June 2000","review":"Richard Pryor proves his comedic genius here with another comedy film, this time live from the sunset strip.  Here, he talks about women, african roots, and Pryor on fire (which is his hilarious account of when he lit himself on fire mixing crack-cocaine).  Funny stuff, but not as fully dandy as his 1979 special.  Tries as hard as he can, and succeeds in winning the audience over.  It also worked for me.  Sort of.  First of two Pryor comedy films from Columbia-Tristar.  A-","user":"Quinoa1984","rank":[5,6]}]