[{"title":"Better than average erotic film","rating":6,"date":"18 August 2003","review":"Not enough nudity to be classed as 'soft porn', not enough tension to be an 'erotic thriller' and not enough laughs to be a comedy. But Eleven Days, Eleven Nights stands out as one of the better erotic movies in that it has a viable plot, fair acting and the direction &amp; photography are at times exquisite.<br><br>The softcore sex scenes contain something for everyone - flashing, sex in a public place, transvestitism, even briefly a threesome. The story centres around a young lady called Sarah writing a book about her 100 sexual conquests, played by the unbelievably mature 19 year-old Jessica Moore. Number 100 is an ordinary American guy named Michael who is working as an engineer on a construction site...the trouble is he's getting married in 11 days time.<br><br>As Michael falls for Sarah he doesn't realise that he is merely being used for this book and puts his fiancee (who first suspects, then later knows) through hell even as she prepares for their upcoming wedding. Trouble is, Sarah is falling for Michael too...who will Michael end up with?<br><br>\nThis was the film that was an international video hit in 1987, and put Joe D'Amato back on the map as a director. Now available (in the UK at least) on DVD. The low budget is used wisely and rarely shows. Most of the principle actors seem to have had short careers which is a shame...and the opening 10 minutes will make every woman wish she owned a black plastic mac!!","user":"a_gulliver","rank":[15,17]},{"title":"A sweet and typical erotic movie","rating":19,"date":"19 January 2002","review":"This movie that was strangely released at the cinemas here a long time ago was a trial to imitate the famous movie \"Nine weeks and a half\" starred by Kim Basinger and Mickey Rourke although obviously with a lower budget. Nevertheless the female main character(Jessica Moore) is really beautiful and the story has sometimes very sweet touches seeming almost like a romantic movie, so if you like romanticism or erotism or both you can watch this. It´s neither very modern nor very good but at least actors are not bad and you can watch it better than most erotic movies. About Jessica Moore it is a paradox that she is playing here the role of a dangerous bitch-later in love, with only the age of 19 when she played some years later the role of the daughter of a terrified family in a movie called \"The broken mirror\" seeming younger there, because in this movie you could never imagine that this magnific blonde is so young, she is so well-grown....,I love her.","user":"Hellraiser-1","rank":[7,10]},{"title":"D'Amato's Comeback","rating":27,"date":"27 February 2008","review":"Eleven Days, Eleven Nights (1986) <br><br>* 1/2 (out of 4) <br><br>After the Italian Horror market dried up several of the genres directors were left without work or had to switch gears and try something else. Joe D'Amato had already done hardcore features but his career got a boost with this softcore flick, which became a big hit in Italy and other countries. A man (Joshua McDonald) is about to be married in eleven days but he starts up a steamy love affair with a young woman (Jessica Moore), which leads the man to thinking twice about getting married. The only problem is that he doesn't know the woman is just sleeping with him so she can write a book on sex partners. This film starts off okay but slowly goes downhill due to some stupid characters, which are amongst the worst written I've ever seen. The stereotypes of the characters are at times laughable. For instance, the man's girlfriend is a plain, ordinary, boring, bookworm who wants to wait to have sex. There's a dinner scene with her parents, which just has to be seen to be believed. The one good thing about the movie is Moore who is able to display a great sexual presence. D'Amato does great with the softcore sex scenes but the rest is pretty bad.","user":"Michael_Elliott","rank":[10,16]}]