[{"title":"The series should have ended with this film","rating":9,"date":"9 September 2001","review":"This is, by far, the best sequel of all the \"Halloween\" films.  As far as I'm concerned, the producers should have ended the series here, because, after all, it is very, very clear MICHAEL MYERS IS DEAD IN THE END.<br><br>Never mind that this is just another slasher film.  Dino DeLaurentiis works his magic here, as he would do three years later with \"Dune\".  This is one sequel that will have you on the edge of your seats to the very end.  To me, what John Carpenter started, DeLaurentiis finished.<br><br>For maximum effect, see the first two \"Halloween\" films on Halloween, October 31, and time it so that the end of \"Halloween II\" falls at midnight, the morning of November 1.<br><br>\"Halloween II\" is a sequel masterpiece.","user":"hips","rank":[20,22]},{"title":"Ok sequel. Lacks suspense and tension of original.","rating":6,"date":"7 October 2018","review":"The gore is upped in this one. There are a couple of good stalks in the hospital but character development and the payoff isn't here as in original. Dr. Loomis and Laurie are great. Some very unecessary kills too. I don't mind how they establish that Laurie is Michael's sister but a direct followup on the same night as original doesn't seem to work. I wish a little time had lapsed and they followed similar plot-builds as H1. The ending chase scene should have gone on longer, those are the best parts. Trying to hide from Michael when he's lurking is effective. Random kill scenes of characters we dont care about was let-down and sign of the slasher times it seems. Overall 6/10.","user":"tylerkirks08","rank":[18,21]},{"title":"A solid sequel","rating":9,"date":"23 March 2006","review":"Halloween 2 seems to get mixed reactions but no one can deny that it stands alone as a great slasher film. Of course it's hard to take Halloween 2 as its \"own\" film compared to the greatness that is the original Halloween, but most should be able to overlook that and enjoy it for what it is. Halloween 2 uses the suspense of Halloween but adds more gore and a faster pace to the mix. I found it thoroughly entertaining, with some great death scenes and genuinely suspenseful moments (Jamie-Lee escaping through the ventilation grill). The only minor points spoiling Halloween 2 are that sometimes it gets a bit far-fetched. For example, Jamie-Lee is escaping through the ventilation grill and Michael Myers takes an eternity to simply walk over and pull her back down. There were also a few moments of very bad acting. <br><br>Overall though it's thoroughly entertaining and I would recommend it to all horror fans. It doesn't ruin the integrity of the original film like most sequels do.","user":"Tikkin","rank":[51,68]}]