[{"title":"Thanks to all who enjoyed my film","rating":17,"date":"17 November 2004","review":"It is not often a producer has the chance to thank his critics in this form. I do so now. The blood-sweat and tears that went into the making of THE WILD GEESE is all forgotten. Appreciation of one's endeavors of some 25 years ago, thanks to DVD, is gratefully received. The Zone 1 version is yet to appear, the lateness due to sloppy distribution. To answer questions about the film's very limited theatrical release in the United States and Canada in 1978, this was due solely to the financial collapse of its distributor, Allied Artists. Chapter II was applied and, to my disgust, it failed to reach many theaters. However, the NBC Network and HBO aired the movie with great success. Euan Lloyd.","user":"euan-6","rank":[233,262]},{"title":"Last Hurrah","rating":10,"date":"3 July 2007","review":"A splendid old-fashioned action film, with all concerned giving it their best shot.<br><br>A few people have objected to the average age of the actors in this film, from Burton to Kenneth Griffiths - but they don't seem to realise that the age of these mercernaries is the point. The Wild Geese is about a generation of men who demobbed from the Army after the Second World War, were unable to make peace work, and who sold their services as soldiers in the world's troublespots to the highest bidder. The late 1970's would have been the time of life that their age at last compromised their work, and the film is a recognition of the last of them.<br><br>For me this film is like a beloved childhood toy, kept and never forgotten - when it aired recently on television I just didn't want it to end.<br><br>Brilliant, gloriously sentimental and the anti-thesis of PC. 10/10","user":"blacknorth","rank":[71,77]},{"title":"These two English wannabe-snobs are way off base.","rating":9,"date":"28 September 1999","review":"The Wild Geese surprised me in the theater back in the late 1970's.  As a former U.S. Army Airborne Ranger and Vietnam vet, I had mixed feelings about it.  But I keep watching it every couple of years and it has become one of my favorite films.<br><br>Yes, it's a fanciful story, romanticizing the boring, grubby, dangerous lives of the very few mercenary soldiers in the world.  But its daring small-unit tactics are actually pretty good, and they do illustrate the chaos and devastation a well trained special ops force can cause in an enemy's rear area.  It also illustrates the ease with which such a small unit can be wiped out if the enemy can locate it and bring real forces to bear against it.<br><br>And, interestingly, it shows very clearly the effectiveness of even a single small, armed airplane against an infantry unit unequipped with anti-aircraft capability.  So whoever wrote and advised on this film had some genuine experience.  There are many examples of true combat reality in various parts of the film.<br><br>However, there are also some of the usual war-movie-making gaffes and there were some really silly, amateurish attempts at special effects in the theatrical release, most of which have been edited out in the cable movie versions.  So it's still a mixed bag but overall very effective.<br><br>The other aspects of this film are universally wonderful.  It has a plausible enough story line once you've decided to accept the premise, and from there it progresses nicely indeed.  Several of the subplots are intense and very moving, some are a little comical and some are downright funny. Burton's last line to Emile, \"Let's talk about your father.\" is as fine a line as can be written.<br><br>The depth of the cast is remarkable: dozens of very good actors, some speaking only one or two lines, but so well delivered!  (There are also some awkward lines that just don't work at all.  As I said, this film is a mixed bag.)  Even in the small rolls, Jock, Tosh, Esposito, the village priest, Jesse and others, the quality just shines.<br><br>The movie doesn't shy away from the unglamorous, gut-wrenching realities of the consequences of mercenary operations, either.  There are some very troubling scenes about the responsibilities of leadership in such a unit.<br><br>There is not another movie like The Wild Geese.<br><br>I couldn't end without saying this one last thing.  The theme song \"The Wild Geese,\" sung by Joan Armatrading is simply marvelous.  It is worth the price of admission, and is played in its entirety during the closing credits.  I recommend that you close your eyes and just listen.","user":"SquirePM","rank":[121,149]}]