[{"title":"Muni, Robinson and Cagney","rating":10,"date":"4 April 2006","review":"Inevitably, Scarface will be compared with the near-contemporary gangster films, Little Caesar and Public Enemy, and Paul Muni with their stars Edward G. Robinson and James Cagney. What does it tell us about that era: that all three careers took off with portrayals of gang leaders? The three performances significantly differ. Robinson rises to the top by the use of a crafty intelligence as well as violence; Cagney by a type of shrewdness and personal charisma. Paul Muni's Tony Comonte is neither intelligent nor personable; his manners are crude; and at times he is almost childlike in his behavior: for instance, when he is enjoying a play and is interrupted after the second act, summoned to do another killing,and leaves a henchman behind, who can tell him later how it came out, then is delighted to hear that the \"guy with the collar\" didn't get the girl; rather, the rougher suitor. He can be described as cunning and animistic: a young wolf who eliminates any rival who stands in his way; finally the leader of the pack One can be moved by Robinson's last words, \"Is this the end of Little Caesar?\" or by Cagney's body falling through the open door of his family home, he having been killed off-screen. Comonte's death is that of a trapped or cornered animal, wordless in a beautifully staged sequence,as brutal as his life, depicted for the audience in every detail. Of the three portrayals, Muni's comes across to me as the most chilling, in its enactment of instinctive evil. How ironic that He would later win his greatest fame for his performances as Emile Zola and Louis Pasteur.","user":"sryder-1","rank":[27,28]},{"title":"\"Do It First, Do It Yourself, And Keep On Doing It\"","rating":10,"date":"20 January 2007","review":"Unlike James Cagney and Edward G. Robinson in their career making roles as gangsters, Paul Muni after Scarface was able to avoid being typecast for his career. Only rarely did Muni return to a gangster part in his career.<br><br>It must not have been easy for him because Muni is absolutely mesmerizing as the totally amoral Tony Camonte. After Scarface was released Muni was inundated with offers to play gangsters which he rejected. Interesting because without knowing it another of the cast in Scarface, Boris Karloff, would be ultimately trapped in the horror film genre. Muni assuredly avoided Karloff's fate.<br><br>Another cast member, George Raft, got his big film break playing Muni's right hand man. For Raft this was art imitating life, these were the people who were his pallies in real life, there was never any acting involved. Raft never really had too many acclaimed performances away from the gangster/big city genre.<br><br>Camonte is the ultimate killing machine. He knows only one law the law of the jungle. He'll rise by any means possible, use anyone it takes, kill anyone who gets in his way. He has only two weaknesses, an obsession that borders on incestuous desires for his sister Ann Dvorak and a kind of affection for his factotum Vince Barnett. That's the kind of affection you have for a pet.<br><br>Barnett who usually played drunks and hangers-on got his career role out of Scarface. What comic relief there is in the film he provides. He's got some good moments as a 'secretary' trying to take a phone message with bullets flying all around him. Had he been not dispatched to take the message the machine gun bullets would have found their mark easily in the taller Muni.<br><br>Scarface is also art that imitates life. Anyone with a cursory knowledge of the history of gangland war in the Chicago of the Twenties will recognize Muni as Capone, Boris Karloff as Bugs Moran, and Osgood Perkins as Johnny Torio. Capone could have sued, but right about then he was having much bigger problems with Internal Revenue.<br><br>We can't forget Karen Morley who played Poppy the girl who likes to go with a winner. She shifts from Perkins to Muni and away from Muni when it becomes necessary. In her own way, she's as amoral as Muni.<br><br>Scarface along with Public Enemy and Little Caesar set the standard for gangster films. The updated 1983 remake with Al Pacino in Muni's part is a good film itself and got a lot of its audience with some really gory scenes.<br><br>Muni did it with talent alone.","user":"bkoganbing","rank":[51,56]},{"title":"Preferred far more than the remake; Hawks, Hecht, and Muni are first-rate here","rating":10,"date":"22 January 2005","review":"In an attempt to try and snap some sense into the public and the government about the crime wave (mostly in due to Al Capone, who was a major inspiration for Tony Camonte), Howard Hughes and Howard Hawks brought to the screen one of the landmark early gangster pictures. <br><br>It's a film that does take its subject seriously (while on one hand one argues that the film is an indictment of crime and peoples responses, one could also argue that it's a subtle indictment of the prohibition), however it's also an exciting, and sometimes wickedly funny, take on a genre that would flourish in the thirties and forties. What comes most surprising (and I mean that as a big compliment) is how it hasn't lost much of its vitality in seventy years. The implied violence in the film is, in fact, shocking in places, and while it lacks the blood content and major shocks of the De Palma remake, it doesn't compromise to showing the (slightly Hollywood-ized) truth of the matter- crime doesn't pay, but sometimes it's all people know.<br><br>Tony Camonte is played by Paul Muni, in a performance that wonderfully ranges from angry to sarcastic, funny to romantic, and just down-right crazy; it's no wonder that Pacino was inspired by his performance to take on Tony Montana in the remake (though one could argue that Muni's bravura presence and delivery in this film out-ranks Pacino's in the later). He is surrounded by supporting players that also give very good work as well, with the story being told in various threads that work perfectly. There's one semi-comic story around one of Camonte's assistants who is rather illiterate and slow (though it's also a subtle commentary on the lack of prospects for immigrants at the time). Another (which was given much prominence in the remake) involves the power-struggle between Tony and his younger sister. And then there's the good-old mixture of solid, fascinating bits with the cops and other criminals, not to mention a boss that has to control Tony's manic ideals of taking over the city (and, perhaps, the world).<br><br>I once heard Quentin Tarantino in an interview say that Howard Hawks is the 'single greatest storyteller in the history of cinema'. Although that could be a heavily debatable statement, with this film Hawks proves that he definitely can do so very well, and of the few I've seen of his so far, this is my favorite. On the technical side of things, some of the technique is very straight-forward, but then there is also proof that Hawks was a step-ahead of the crowd that would bloom out in the film-noir period a decade later. Shadows used with a fine flair; great over-head and dead-on shots of cars riding and shooting; a couple of really keen close-ups. <br><br>Add to that a script from Hecht that doesn't go too deep into character for too long, and you got your basic powerhouse gangster picture. And, believe me, it's a must-see if you're into the genre, or if you'd like to have a comparison test with the highly revered remake.","user":"Quinoa1984","rank":[81,99]}]