[{"title":"What's A Little Sex ? 1982 Drama/Comedy/Romance","rating":10,"date":"9 September 2006","review":"A Little Sex (1982): Starring Tim Matheson, Kate Capshaw, John Glover, Edward Herrmann, Joan Copeland, Susanna Dalton, Wendie Malick, Wallace Shawn, Sharon Bamber, Betsy Aidem, Tanya Berezin, Michael Bias, Kim Von Brandenstein, Christy Brown, Barbara Bratt, Leigh Curran, Robert Burr, Frankie Faison, Sarah Felcher, Sharon Foote, Lisa Dunsheath, Dona Fowler, Sam Gray, James Greene, Delphi Harrington, Frances Helm, Carolyn Houlihan, Elva Josephson, Wayne Kell, Ann Lange, Sagan Lewis, Merry Loomis, Renee Lippin, Ronald Maccone, Geretta Geretta, J. Frank Lucas, Carolyn Perry, Nick Petron, Don Phillips, Isabel Price, John Tillinger, Bill Smitrovich...Director Bruce Paltrow, Screenplay Robert De Laurentiis.<br><br>From 1982, Director Bruce Paltrow's \"A Little Sex\" is not a very well-known or even memorable film but it is without a doubt a very well-made romantic comedy/drama about the \"myth of monogamy\" and the natural inclination to cheat - and its effects on a marriage. The film stars Tim Matheson and Kate Capshaw as Michael and Katherine, who have enjoyed a long relationship together even before they tie the knot. But Michael does not hide the fact he's a womanizer and sex addict, cheating on Katherine during their pre-married relationship. Because Katherine is genuinely in love with him, she is willing to overlook this and believes that perhaps marriage will change things. Michael, too, believes that marriage will change him. Sexual infidelity and promiscuity is compared to Michael's smoking habit (and everyone else's' smoking habits). He quits for a while when he gets married but he cannot fight it for too long. His best friend, Tommy (Edward Herrmann) advises him in a rather liberal-minded way and their conversations- usually on a walk through New York City's Central Park- are possibly the most thought-provoking part of the film. The film's theme of a man's transformation from womanizer to monogamous husband is well captured and despite the nearly Woody Allen Hollywood-ness, is actually very realistic. We genuinely feel for Katherine and understand how hurt she feels when she discovers Michael's betrayal. The film not only boasts a fine script (courtesy of writer Robert De Laurentis), but meaningful visuals/cinematography by Ralf D. Bode, whose depiction of New York City at the beginning of the 1980's is not only truthful and atmospheric, but it's part of the story itself, like a character itself. The \"irony\" scenes in which Michael walks down the streets of New York are masterful. The first of these scenes, which are not realistic but seem to prove a point, is when he is married but finds temptation everywhere in the ridiculous excess of women coming out of taxi cabs, walking down the street, flirting with him, looking at him with lust, showing him what he can no longer have and what he really wants at this point. After he cheats on her, with Philomena (played by Wendie Malick (Nina Von Horne from \"Just Shoot Me\" and a lesser-known actress) an oboist for the New York Philharmonic, he comes to regret it, especially because his wife has now filed for divorce. Feeling sorry that he has lost the real love of his life in a stupid act of meaningless sex, he walks down the same streets and this time he sees happy couples who are deeply in love, something he now wants but cannot have. Before this film gets too depressive- and it can seem this way, especially with the sad look toward the end and melancholy classical-style music by Georges Delerue- the couple are once again drawn to each other after finally being able to put this mistake behind. For any fan of Tim Matheson, who was actually a versatile actor, considering he was in \"Animal House\" and \"Up The Creek\"- which are not at the level of this film- this is real treat. Kate Capshaw is magnificent and sympathetic. This is a moving film about innocence lost, about finding happiness and meaning after a near lifetime of meaningless pursuits of pleasure. This is a great film and one I highly recommend for married couples and for dating couples.","user":"FloatingOpera7","rank":[21,28]},{"title":"A Little Goes a Long Way","rating":7,"date":"20 May 2009","review":"Tim Matheson loves women, I mean, he loves women. Enter Kate Capshaw, his latest girlfriend. She wants to get married, but he can't commit. This might sound like just another excuse to make another stupid and forgettable sex-pic with plenty of nudity. But, actually it's better than it sounds, with very little nudity save for a neighbor who vacuums in the nude. Tim exudes his usual charm. In fact, despite his flaws, he is more interesting than Kate Capshaw's character. Maybe, because of his flaws. But the highlights of the picture are his talks with his brother, played by Edward Herrmann (Gilmore Girls, Big Business) on walks through New York. His brother, being a psychiatrist, loves to analyze him and tell him what he's doing wrong. Their rapport on screen is very natural, and their conversations are well written. You really see them as brothers. If you want an enjoyable film with an 80s outlook on sex, look no further. You could do a lot worse.","user":"JLRMovieReviews","rank":[5,6]},{"title":"Hopelessly dated tale of love and marriage in the 1980's.","rating":4,"date":"14 October 1999","review":"Slow moving, cliched story of a man played by Tim Matheson who beds almost every woman he meets until the woman of his dreams (Kate Capshaw) enters his life.  Eventually they marry but can he remain faithful to her?  Of course he can't.  She responds by sleeping with an old friend, he makes a tearful plea on his kiddie show and, well, there you go.<br><br>The problem is you just don't care.  He's childish, self centered and annoying.  She is immature and, face it, pretty damned stupid to have gotten involved with and then marrying the guy.<br><br>\"A Little Sex\" is now hopelessly dated, produced at a time when casual sex was still considered fun, liberating and relatively safe.  How times have changed.","user":"DashingD","rank":[17,32]}]