[{"title":"Minor oater with incidental reminders of Ford's work","rating":1,"date":"1 July 2001","review":"This undemanding B-western contains genial performances from Noah Beery Junior, Leon Erroll and Leo Carrillo (the latter best remembered from his work alongside Wallace Beery, in some of his underrated Westerns of the early 40's). What makes the film of more than average interest is the incidental relationship some of the elements bare to the work of John Ford: for instance, the ham Shakespeare actor recalls John Carradine's similar, albeit much more rounded and expanded, role alongside Fonda and Mature in My Darling Clementine'. Not unexpectedly, Ford elevates such a character to pathos. Here the effect is one of parody. More intriguing is the plot device whereby the seven members of King's gang are killed by the school teacher (Beery), the credit for which is passed on to the infirm sheriff. Almost twenty years later, Ford was to use this device to far more significant ends in The Man Who Shot Liberty Valence'. In the later film of the deception and it's reception serves to make judgement on the passing of the old West, the value of a printed legend over a secret history. In Yarbrough's film the tension created by the wrong assignation of merit is never resolved to any such poetic effect, but left as bald fact. Co--writer Bruckman (light years away here from his part in creating some of Buster Keaton's finest films) leaves everything unresolved, just as the implications of the plot might really take off. Beery rides off cheerfully to get married to the singer, and the ex-sherriff remains basking in his undeserved glory  a result that is somewhat unnerving, to say the least, given the lie upon which his respectabililty in built on.","user":"FilmFlaneur","rank":[2,4]},{"title":"Interesting B Western","rating":5,"date":"9 August 2019","review":"Leo Carillo before TV... and playing laughably the most dangerous hand in the West. But to old film buffs the most incredible scene is the run away stage scene, early on in the movie..\nwhere they film right through a terrible Horse stumble and fall and use the un edited footage","user":"tpguess","rank":[0,0]}]