[{"title":"Lock, Stock and Two Massive Hooters!","rating":6,"date":"29 August 2012","review":"Only five films into my 'Girls, Guns and G-Strings' Andy Sidaris box set and I'm already struggling to find new ways of describing what is essentially the same damn movie every time: the same actors; the same characters; the same location; the same silly ingredients.<br><br>Guns replaces Sidaris regular Hope Marie Carlton with the equally gorgeous Roberta Vasquez and introduces a couple of reasonably cool B-movie stars as villains (Erik 'Ponch from CHiPs' Estrada and Danny 'Machete' Trejo)—everything else is exactly as one would expect: dumb plot; big breasted women in very skimpy outfits; hunks with bad hair; ridiculously large hand weapons; deadly remote control toys; and assorted men in drag (in this case, a pair of trannie assassins).<br><br>With a fraction more action than usual (there are some nice 'n' bloody squib shots), Roberta Vasquez getting topless on a motorbike, and suitably nasty deaths for both Estrada and Trejo, this one is possibly my favourite of the series so far. Then again, it might not be. It's hard to tell.<br><br>5.5 out of 10, generously rounded up to 6 for IMDb.","user":"BA_Harrison","rank":[7,7]},{"title":"Who needs a plot when you have big guns and scantily clad ladies?","rating":23,"date":"23 August 2002","review":"When I was a wee tot I never cared about superfluous things like plot, characterization or people yakkin' exposition for more than 30 seconds. What I wanted to see was the car chases, explosions, high kicks and bikini girls with machine guns. Happy happy happy, joy joy joy! Of course, one day we have to grow old and abide to the rules of Society, that forces us to become, uh, \"sophisticated\". We ditch Hollywood blockbusters in public and pretend to like Finnish art movies and David Lynch. But deep down inside, in the heart of that happy child we once were, we really want to get home in time for the Baywatch rerun. And that, friends and foes, is the spirit of Sidaris' work. I've seen the polls at IMDb and voters aren't fond of Andy's flims. They're completely missing the point AND the fun.","user":"Smartt","rank":[22,28]},{"title":"I should probably hate this, but I didn't","rating":6,"date":"11 August 2005","review":"\"Guns\" is a strange movie: its sensibilities seem to be both sexist AND feminist. On the one hand, almost all the women have to undress at one point or another, usually gratuitously; on the other hand, the girls-with-guns sequences are played without condescension, the female agents are treated as equal partners by the men and, more often than not, THEY take charge. The action is not particularly well-done; in fact the whole film plays as if it was directed by a teenage boy trying to make a \"real\" movie. But how can you hate a film that contains female oil wrestling, an interrogation done with the help of a magic hat, a grenade on a remote-controlled model boat AND the incomparable Danny Trejo as the villain's No.1 henchman? (**1/2)","user":"gridoon","rank":[14,17]}]