[{"title":"Action!","rating":23,"date":"23 March 2012","review":"OK now I'm not going to try and say that this film is by any means a true classic, BUT it is a type of classic.<br><br>in so much as that it has the man Dolph, mostly half nude, and it has guns, and some really nasty ones at that. so the plot is really weak, nobody is going to buy into the fact that one guy can save a nation but thats not the point, its really just a vehicle for Dolph to do his thing, which is to look tough and sound funny in a monotone kinda way.<br><br>i really like the torture scene where the guy is sticking large needles through Dolphs anatomy, actually looks pretty realistic considering its not a big budget film, and also i like the scarification that Dolphs little tribesman friend does for him while he is drugged.<br><br>the highlight of the film for me is probably the goofy relationship that is forged between Dolphs character and the little bushman, its really fun. the language barrier is well played out but the writers and actors have enabled this element to flow very well and their means of communication is really very effective at translating the messages of the relationship for the film.<br><br>so do yourself a favor and go rent the DVD as it has at long last been released, and sit back and enjoy some cornball action for all its worth.<br><br>just don't expect any special features cause their isn't any.","user":"homman-hofield","rank":[8,8]},{"title":"Have you ever seen a bushman?","rating":10,"date":"19 January 2005","review":"If there is something I connect to the 80's more than anything it's movies like this one. It came at the shivering end of the decade, when the cold war was nearly over. But it shows a technique honed through literally dozens of cold war action movies. A genre of it's own.<br><br>The Russian KGB-agent Nikolai (Dolph Lundgren) is sent to Africa to kill a native revolutionary. However he is betrayed by his own people and instead befriends the man he was to kill. Soon he exacts his vengeance on his deceitful commanders.<br><br>Dolph Lundgren is known from cold war epics like Rocky IV and Pentathlon. It seems his blonde Swedish looks are very Russian in the eyes of the American audience. Also his garbled accent might be appropriate as a substitute for real Russian. Here he shoots, explodes and slices half the Russian and Cuban armies in his quest for vengeance on the men who betrayed him. The machine of the communist party just needed one small deceit to see the error of his ways and instantly team up with natives and guerrillas to fight for their freedom.<br><br>A touching story if you don't think about it. So, you've seen Rambo II and III? You've seen Missing in action with Chuck Norris? You've seen dozens of other cold war action movies where Russians are killed in the hundreds and the hero hardly flinches when he is shot? Then you KNOW what this is about. And this might just be the best of the lot. This is simply 80's propaganda-action in it's most purified form. Entertaining to say the least. Rating is 1/10 for quality, 7/10 for entertainment and 10/10 for accents.","user":"Antagonisten","rank":[41,59]},{"title":"A Russian Special Forces soldier is sent into the African desert to assassinate a revolutionary!","rating":8,"date":"8 October 2011","review":"One of the best '80's action films you have never seen or heard of! I stand by my statement having watched 'Red Scorpion' aged 9 and finding it even better than I remember when watching it again as an adult. If you want the quick explanation, it's up there with 'First Blood part 2.' It's also a thoughtful war film that leaves America out of the Cold War picture and instead ponders on just how much death and destruction a man must witness before he realizes he's fighting a war that is inherently not only wrong but simply evil.<br><br>Dolph Lundgren is Nikolai Rachenko, one of the Spetsnaz's finest soldiers. He is exactly how the Motherland has cut him out to be, an intelligent, resilient, unstoppable and obedient killer. Unable to march through Africa because of anti-communist revolutionary Sundata, the Russians send Nikolai in to gain the trust of whoever will lead him to his target where he will then assassinate his target.<br><br>The plan fails and Nikolai is first captured by the Africans and then sent back across the desert with one intended message; to tell the Russians that even their greatest soldier cannot kill Sundata. Barely surviving, Nikolai finds himself disgraced and left to the Cubans to be tortured and killed but escapes and then only survives the desert a third time thanks to the Bush Man, a lone member of a secretive African tribe, who takes Nikolai under his wing and teaches him the ways of the free African.<br><br>Nikolai learns how to survive the desert and then learns of the atrocities executed against the innocent people of Africa first hand. Accepting that he is no longer with the Russians after the way they treated him and left him for dead, when he is ready to move on, Nikolai takes it upon himself to go back to see Sundata and show that he now bears tribal honours only to find that the revolutionary has been mortally wounded by the encroaching Russian forces.<br><br>Feeling that he owes it to Sundata and his people after a heart to heart with the dying man, Nikolai goes on to lead an offensive against the invaders, his former leaders and fellow soldiers, to smash the Soviet and Cuban forces and send them out of Africa.<br><br>The film was directed by Joseph Zito who reached varying degrees of success in the '80's with three other titles; two Chuck Norris vehicles, 'Missing in Action' and 'Invasion USA' and intended franchise finale 'Friday 13th part 4: The Final Chapter.' Turning Chuck Norris into a legitimate action movie star, the same could almost be said for Lundgren, only it was Lundgren's later features that failed him.<br><br>Zito makes a great film by taking the old-school action and war molds and applying a sensible amount of politics and intelligence into the African characters and their purpose. Lundgren plays not only an atypical brute of a soldier with little to say for himself, he plays a man reprogrammed by the military to obey who learns to listen to the voice of reason instead and as much as people might argue that Lundgren cannot act, watching his face turn from a constant menacing scowl to one of resolve and respect is effective enough. His change from villain to hero simply does what no other action film of its time dared to and this makes for a feelgood moral tale.<br><br>The film is literally exploding with stunt doubles doing their various acrobatic death rolls and grenade explosion somersaults etc. Special effects come courtesy of 'Wizard of Gore' Tom Savini (who worked with Zito previously on Friday 13th) and M. Emmet Walsh has a co-starring role as a terminally offensive American photographer, which helps you settle into the very ethnic feel of the movie. Add the Little Richard soundtrack and you have a classic action film with something a little different to offer.<br><br>'Red Scorpion' is like many other action films of the '80's that could have gone on to have successful and valid sequels, however it's a perfect little gem all by itself and one of the reasons Dolph Lundgren was such a promising star back in the day.<br><br>I recommend 'Red Scorpion' for an action movie night if you're planning on watching 'Missing in Action' or 'Rambo' or Schwarzenegger's 'Commando.'","user":"DanLives1980","rank":[5,5]}]