[{"title":"Underrated Gem - Bad-ass, kick-ass Rambo explosvive blast action movie my personal second favorite action film of all time","rating":10,"date":"15 October 2019","review":"Underrated Gem third blast explosive action movie of all time. Kick-ass bad-ass action film my absolutely favorite film of all time. Yes Rambo III is my favorite action film of all time. Crimminally underrated. I love this film to death this is 'Over the top Gun Blasting, C4 Tipped Explosive Arrow Blowing Up Helicopters' Rambo. It was the first Rambo movie I saw as a kid. This is my second favorite film Rambo III is my favorite action film. It grew on me.<br><br>\"Who are you? Your worst nightmare!\"<br><br>Rambo: First Blood Part II and Rambo III are my favorite action films I am a Rambo fan I chose those two movies over First Blood. I can't decide they are both equally my number 1 favorite action films. I love love this film to death. I enjoy action pieces and I understand what the films is about. It is so bad that it is so good. NO it is so bad that is so good that it is a kick ass. It is a fun entertaining action film from the 80's. Staring Sylvester Stallone as John Rambo EX green barret on a mission in Afghanistan to rescue his commanding officer and friend Col. Samuel Trautman (Richard Crenna).<br><br>Rambo III is still a bad ass film ! Pure action , pure Adrenaline pure Testosterone. It was my first Rambo movie I saw that introduced me in to the character. Rambo is a comic book hero that is my comic book hero. With bow and C4 tip arrows with his knife. I grew up with these guys. People are saying it is the weakest one I disagree. It is a god among action films in my opinion. Rambo: First Blood Part II and Rambo III a god among action films than now days. Rambo III is better than First Blood or Rambo: Last Blood they will never be at the top of these two sequels I love dearly.<br><br>The year of 1988 was the release year for RAMBO III.<br><br>Here is what I love about this movie: Rambo hunts Specnaz commandos in the cave with bow and arrow blue cyalume light. Fires with his bow an arrow an attached blue cyalume light at the Soviets commando in the cave. He hunts Specnaz commandos with C4 tip arrows. Rambo uses M203 grenade launcher with AKM destroying an army truck. Rambo destroys the chopper with soviet heavy machine. Rambo has a new survival knife a modified bowie designed and I love how he uses to cut barbed wire on the base perimeter. I love the fight between Rambo and Kourov (Randy Raney) and which Rambo uses a fly kick I love that in the film. Rambo climbs the wall without climbing equipment that is memorable and favorite scene of mine.<br><br>RAMBO is finally UNLEASHED in RAMBO III!!! He has an open battlefield, a modern array of weapons, flies a massive Russian made Mil Mi-24 attack helicopter, drives a Tank and frees the Afghan Mujahedeen freedom fighters from genocide by the former Soviet Union, also known as the Russians (at that time)!! The opening scene with the stick fighting is very nice. The flow from start to finish is fluid. The boundless action and storyline coalesce beautifully in a synergistic manner! The historical base of the story, action and acting provide some transparent grit to the Real-World Soviet - Afghan war. And what do you know, The Good Guys Win!!<br><br>Sylvester Stallone really was in his best shape of his life, draging under tank is really hard for a normal person. The action sequences are all practical mostly things were practical. There is no CGI in here. Rated Hard-R for action sequences .Beautiful music score by Jerry Goldmith. I love the chemistry between Sylvester Stallone and Richard Crenna. Kurtwood Smith from RoboCop (1987) Clarence Boddicker is in this movie without his glasses. I love that, I review all RoboCop movies I love the original 1987 to death.<br><br>Rambo III is mine action film and no Rambo does not help the taliban if you hate the movie than go away and leave it alone. Everyone in this movie did a great job and they hired a technical advisor for Afghanistan. Rambo III belogns with Die Hard (1988) an action film I love to death so yea third Rambo is with Die Hard it earn that spot. Rambo: First Blood Part II, Rambo III, RoboCop (1987), Aliens (1986), Hard Target, Predator 1, 2, Hard Boiled Demolition Man, Die Hard, Die Hard: With a Vengeance, Live Free or Die Hard, John Wick (2014), Cliffhanger and Terminator 2: Judgment Day are my action movies that I love dearly and I watch constantly they are kings among action movies in my opinion.","user":"NightmareOnElmStreetFan","rank":[26,31]},{"title":"John Rambo's back ... and it's killin' time ... again! AGAIN!","rating":10,"date":"27 October 2005","review":"After 'First Blood', I assumed Stallone would have won an Oscar for his portrayal of troubled Vietnam veteran John 'Break Out The Knives' Rambo, and I supposed the fact he didn't was probably down to an oversight on behalf of the Academy or something.<br><br>When he again failed to pick up the 'Best Actor' statuette after 'Rambo -First Blood, Part II', my suspicions began to rise ... but still I dismissed it as an unfortunate mistake.<br><br>So imagine my fury when, after Rambo had not only saved imprisoned Vietnam veterans from years of incarceration at the bloodthirsty hands of the Vietcong, but also liberated the proud Afghans from the yoke of Communist oppression, he STILL did not receive the award that was rightfully his? Is this how America treats its war heroes? Because if it is, it's a bloody outrage. Not only did John Stallone liberate an entire country from the iron grip of the Great Bear, but he also found time to win the title of Heavyweight Champion of the World - not once, but THREE bloody times.<br><br>If I was Sylvester Balboa, I would blow up planet Earth as punishment for being so damned ungrateful.","user":"thechidz","rank":[72,103]},{"title":"Not terrible, but...","rating":8,"date":"8 January 2002","review":"With the highest budget of the three movies, the movie certainly looks expensive, with an epic scope at times. But you never quite get the feeling that the movie settles into a comfortable groove. Though the action sequences have plenty of gunshots and explosions, the way they are filmed - and edited - doesn't have the right impact or flow, like the action sequences in the second installment. <br><br>In another comparison to the second installment, the story - while as sparse as this one - certainly kept moving. Here there are a number of segments that move very slowly and/or don't seem to have much purpose. The movie should have gotten down to business. The uneven flow of the movie also suffers near the end, as if the movie all of a sudden decides it needs to wrap things up in a few minutes, making the final battle almost come out of nowhere. <br><br>(In fairness to the director, it should be pointed out that he was a sudden replacement after original director Russell Mulcahy was fired, and had only ONE DAY to prepare to helm the rest of the movie.)<br><br>Like the previous installment, there is some dumb dialogue, but this time around it's not delivered in a slight tongue-in-cheek manner. If they had been willing to show this time around that they weren't taking things so seriously, it would have helped. You might say that the actor playing the Russian commander is not playing things seriously, but he goes SO over the top that he's embarrassing.<br><br>It's watchable, but disappointing - they had the chance to make a kick-ass action movie here.<br><br>By the way, the Afghans that Rambo helps in this movie are *NOT* the Taliban. People seem to forget that Afghanistan is made up of a number of different tribes. You can tell these particular Afghans are not the Taliban, because (among other things), the women are not completely covered, and the men play the traditional Afghan game with horses and a goat's skin (forbidden by the Taliban.)","user":"Wizard-8","rank":[58,87]}]