[{"title":"Red Sorghum is a cinematic wonder...","rating":10,"date":"8 December 1999","review":"Red Sorghum will delight those that enjoy the art of cinematography.  This visually stunning film truly deserves its international acclaim simply because of the way it presents the tale through its remarkable use of imagery, lighting, and filters.<br><br>Until I saw this film, I would have never thought that one could say so much about character, setting, mood and plot simply through the use of layout and image composition.  This controversial film set in the 1920's - 1930's, by the rebellious Zhang Yimou, follows the life of sorghum wine farmers from Northern China.<br><br>If you follow the history of Chinese film, you will see how nicely this film combines motif's of many of its precursor films.  Chinese history and culture has been vastly explored through many Chinese films, however I believe that this is a good film for the average American film goer to get a taste of the Chinese film industry and culture through their perspective.  I say this for a variety of reasons, the pacing of this drama is quicker and faster moving compared to other related Chinese films before its time. Generally Chinese film have a tendency to be slow, when set aside the general American preferred standards.<br><br>It presents to us some of the Northern Chinese cultural traditions. Its display of the Japanese brutality could not have been better presented.  The Japanese have been quite swinish during this period in Chinese history. All I can say is it says it all as it really was, very well indeed.<br><br>This is the last but most important reason to watch this film... look at its cinematography.  It has to be among the best I have ever seen.  It amazed me to see how resourceful a cinematographer can be when working for a film of little budget.  Yimou showed me how simple things can be filmed to be works of art.  Unfortunately I have not been able to see the film in its original cinematic scope however, even in full screen it is still quite visually stunning.  The aperture, f-stop and lens settings were set just perfectly giving the film a very rich vibrant look making Yimou my favorite Chinese film cinematographer/director of all time to date.  Oh, it is a film that you just have to see for yourself! Hope you enjoy it! Happy Viewing!","user":"P-Style","rank":[42,46]},{"title":"Joyful, painful, funny, and horrifying and why isn't it on DVD?","rating":10,"date":"21 August 2005","review":"Credit goes to Yimou for stripping this epic 2 novel series down to this spare and gorgeous little hour and a half. For all the recent fantastic forays into Chinese fantasy, this story (which is allegedly true) shown as it is, is as close to a fairy tale as it gets, at least until the very end. Every shot is a painting. For some reason this film is still near-impossible to find on DVD. I truly hope it is not being suppressed for anti-Japanese sentiment expressed in it. That would be a terrible shame. This film was released shortly before Tienanmenn (sp) and it has a boldness and frank humor rarely seen in Chinese film since.","user":"robzilla2001","rank":[15,15]},{"title":"Barbaric and beautiful","rating":8,"date":"3 June 2003","review":"Although I don't think this is quite as good as some of the other films that master Chinese film maker Zhang Yimou has made--e.g., Raise the Red Lantern (1991); The Story of Qiu Ju (1991); Ju Duo (1990)--Red Sorghum is nonetheless an outstanding film strikingly presented visually and thematically.<br><br>Gong Li stars as the betrothed of an old leprous wine maker. The film opens with her being carried in a covered sedan chair to the consummation of her wedding by a rowdy crew from the sorghum winery. It is the 1930s or a little before. They joust her about according to tradition and sing a most scary song about how horrible her life is going to be married to the leprous old man. Through a break in the sedan's enclosure as she sits alone in fear and dread she catches sight of Jiang Wen, a burly, naturalistic man with a piercing countenance. A little later after a bit of unsuccessful highway robbery during which she is released from her confinement, they exchange meaningful glances. The young man doing the voice-over identifies them as his Grandmother and Grandfather. (Obviously the leprous old man is going to miss out!)<br><br>Zhang Yimou's technique here, as in all of his films that I have seen, is to tell a story as simply as possible from a strong moral viewpoint with as little dialogue as possible and to rely on sumptuous sets, intense, highly focused camera work, veracious acting by a carefully directed cast, and of course to feature the great beauty of his star, the incomparable and mesmerizing Gong Li. If you haven't seen her, Red Sorghum is a good place to start. Jiang Wen is also very good and brings both a comedic quality to the screen as well as an invigorating vitality. His courageous and sometimes boorish behavior seems exactly right.<br><br>I should warn the viewer that this film contains striking violence and would be rated R in the United States for that and for showing a little boy always naked and for the \"watering\" of the wine by Jiang Wen and the boy. Indeed the film is a little crude at times and represents a view of pre-communist China and its culture that the present rulers find agreeable. The depiction of the barbarity and cruelty of the Japanese soldiers is accurate from what I know, but I must say that this film would never have seen the light of day had communist soldiers been depicted in such a manner.<br><br>Nonetheless the treatment is appropriate since Red Sorghum is a masculine, lusty film suggesting the influence of Akira Kurosawa with perhaps a bit of Clint Eastwood blended in. There are bandits and tests of manhood. The men get drunk and behave badly. Masculine sexual energy is glorified, especially in the scene where Jiang Wen carries Gong Li off to bed, holding her like a barrel under his arm, feet forward, after having \"watered\" her wine as though to mark his territory. The camera trailing them shows her reach up and put her arms around his neck and shoulder as much in sexual embrace as in balance.<br><br>Obviously this is Zhang Yimou before he became completely enamored of the feminist viewpoint; yet somehow, although Gong Li is allowed to fall in love with her rapist (something not possible in contemporary American cinema), Zhang Yimou manages to depict her in a light that celebrates her strength as a woman. One can see here the germination of the full blown feminism that Zhang Yimou would later develop in the aforementioned Raise the Red Lantern, Ju Dou and Qiu Ju. <br><br>As usual in Zhang Yimou's films not only are the sets gorgeous but the accompanying accouterments--the pottery, the costumes, the lush verdure of the sorghum fields, even the walls and interiors of the meat house restaurant/bar and Gong Li's bedroom--are feasts for the eyes, somehow looming before cinematographer Gu Changwei's camera more vividly than reality. <br><br>There are some indications here however that Zhang Yimou had not yet completely mastered his art, and indeed was working under the constraint of a limited budget. For example there was no opening in the sedan through which Gong Li could see Jiang Wen, and there shouldn't have been one (a peephole maybe). The pouring of the wine (into presumably empty bowls that obviously already contained wine) by Jiang Wen needed more practice. In his later films Zhang Yimou would reshoot such scenes to make them consistent with the audience's perception. Additionally, Gong Li's character was not sufficiently developed early on for us to appreciate her confident governance of the winery she had inherited. \"Uncle\" Luohan's apparently jealous departure from the winery and his implied relationship with and loyalty to Gong Li were also underdeveloped.<br><br>However these are minor points: in what really matters in film making--telling a story and engaging the audience in the significance and the experience of the tale--in these things Zhang Yimou not only excelled, but gave promise of his extraordinary talent that would be realized in the films to come. See this by all means, but don't miss his Raise the Red Lantern, in my opinion one of the greatest films ever made.<br><br>(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)","user":"DeeNine-2","rank":[45,52]}]