[{"title":"Stunning Ending","rating":9,"date":"9 February 2003","review":"MOROCCO is first and foremost an atmospheric film. Anyone who looks for more didn't understand what Josef von Sternberg created here. It's pure atmosphere. A reverie. The film is at times creaky but it's understandable because it was made over 70 years ago! There are several stand-out scenes in MOROCCO, including the famous kiss scene and the one when Marlene breaks a pearl necklace but what makes this Sternberg film so memorable is the stunning ending. Suddenly, the creaky film looks positively contemporary. Are we really in 1930s and not the wild 1970s?!?! The brilliant ending MAKES the movie. Without it, it would probably have been an enjoyably moody but average 1930s flick. With it, MOROCCO becomes a timeless classic. It's probably the most stunning ending ever made, with so many layers of meaning with that one prolonged static shot. It's visually brilliant and sexy on so many levels.","user":"Maciste_Brother","rank":[62,68]},{"title":"Wonderful!","rating":9,"date":"9 December 2009","review":"Morocco was the first 'American' movie ever made in Hollywood by Marlene Dietrich under her 'master' Von Sternberg's direction and, as a follow-up to their extraordinary work in 'The Blue Angel', it consistently helped create a new myth on the cinema's horizon, the image, sensuality and androgyny of Marlene Dietrich.Cinematographically speaking the movie is a wonderful piece of art, with Sternberg's talent for shades in the black and white variation taken to a wonderful depiction of a love story in the Moroccan landscape.But it is above all else Marlene's true introduction to American audiences in the English language, and it is quite visibly a great effort by both director and actress in the creation of a new feminine myth which Marlene would represent throughout her career: the new sensual goddess, accessible and inaccessible at the same time, wonderfully and apparently aloof and distant, but also carnally at hand, sometimes paying the price of love in her own flesh.That image is ever-present in this beautiful film, from the first moment Dietrich appears on the big screen, arriving in 'Morocco' and refusing the help of a tentative lover.The androgyny which pervades the whole movie, especially her cabaret scenes are fundamental in the creation of the androgynous image of Marlene, especially as she sang the french waltz at the cabaret. Her love scenes with Cooper were ardent and unforgettable, and her final surrender, as she leaves everything behind in order to pursue her love for him, clearly represents the creation of the undying femme fatale who kills for love but can die for love.'Morocco' comes off as a great movie between director and actress, notwithstanding great performances by the others actors, especially the sensual presence of Gary Cooper, still a young man and a very charming one.Quite wonderful!","user":"nandoferrer","rank":[11,11]},{"title":"That Hot Kiss!","rating":18,"date":"18 September 2003","review":"Of course Morocco has dated - mostly in its scripting, yet if one is willing to fantasize a little, to place oneself in a 1930 sensibility, the film works brilliantly. Even without taking that delicious mindstep Morocco is a delectable cinema classic, even if it isn't the finest of the Sternberg-Dietrich collaborations.<br><br>That hot kiss the white-tie-and-tails-clad Dietrich plants on the lips of a woman seated, helplessly, at a cabaret table is still breathtaking. Seeing that kiss still sizzle nowadays makes one wonder why so much hubbub ensued after 2003's gratuitous, lackluster liplock shared by Madonna and Britney Spears (which, as it made me yawn also made me think of Madeline Kahn's Dietrich-parodying Lilli von Shtupp dismissing Hedley Lamar's bouquet offering: \"Oh. How odinawy.\"). Moreover, Dietrich's Amy Jolly deliberately ignores the luststruck man who handed a flower to her following her cabaret act, and instead humiliates him by kissing his startled, but not at all displeased - and rather persuaded to complaisance, date. No penis envy nonsense here: its all Marlene being woman almighty flexing woman's timeless power.<br><br>One ought not, as one amateur reviewer has, to judge myopically this film by today's anal PC standards by dint of sanctimonious judgments about colonialism - and by taking a badly mistaken swipe at Gary Cooper's character speaking American English instead of affecting a French accent when, in fact, Cooper was playing an American in the Foreign Legion (did the character's name, Tom Brown, not clue that reviewer to Brown's nationality?); further, the uniform of enlisted legionnaires wasn't tailored to fit handsomely - it was made mostly of coarse wool and issued \"as-is,\" quite often ill-fitting, to men who volunteered for arduous service. Instead one ought to see Morocco's characters for what they are: broadly-painted archetypes of white colonialists behaving as white colonialists behaved, indeed as people in archetypal roles since Sophocles still behave - albeit in the cinematic mannerist modality of the film's period.<br><br>Missed too often, but not to be missed here is how Morocco, in its own stylized Sternbergian way, deals with enduring human nature: lust and love; jealousy and covetousness; pettiness and spite, anger and beneficence; harshness and tenderness; not to mention the ineffable human wont to go head over heels, round the bend, over a lover: what we have in Morocco is not a didactic narrative but an epoch-bridging fable. And despite the dated dialect of its dialogue language, it's remarkable how much and exactly what this 1930 film dared to show and got away with showing. (Anyone with a matured world-view ought to be aware that, seventy years hence, rap star films of the two thousand-aughts - as well as films employing the standard English of the early twenty-first century - are likely to be ridiculed or dismissed for their peculiarities of dialect.)<br><br>Give yourself a huge wink and watch Morocco, and savor its seductive lenswork, its atmopsheric sets and and costumes and lighting, and its timeless, classical themes which, over all these years since its shooting, remind us that \"Plus ca change, plus c'est la meme chose.\"","user":"Piafredux","rank":[49,58]}]