[{"title":"Just getting this one filmed was a huge accomplishment.","rating":8,"date":"28 October 2007","review":"Friedkin claims this was the toughest film to make of his career, and it isn't hard to see why. The balance of this film takes place in some woe begotten Latin American country. You can just feel the poverty and desperation in the air as the only work is for an oil drilling firm who doesn't exactly seem bent on worker safety. The elements are intentionally brutal and they only add to the tension. And thats even before this story really gets going.<br><br>Early on, we are introduced to four characters who are all guilty of doing something terrible in one corner of the world or another. Roughly a half hour into the film, all four find themselves in a tiny impoverished Latin American village trying to eek out a living and forget the troubles they left behind. Not only is the local economy weak, but the place is socially on the verge of revolution. It's amazing the kind of jobs men will volunteer for to get out of these circumstances. Anyway, these four men are given the chance of transporting some highly explosive dynamite through rugged terrain in crappy old trucks so it can be used to put out a massive oil fire some 200 miles away. It is noted by one of the men that more than enough explosives are being transported. Obviously, at least one of the trucks is not expected to make it! Not only do you have an explosive cargo with unreliable trucks, but also there are armed rebels along the way who probably won't just let you pass right on through. Still, the reward for completing this job is just too much to pass on.<br><br>The film is very, very good. In fact the skill that it took to make the film is responsible for most of the stars I'm giving it. The story itself is often just not believable. The journey these four men take is ludicrously perilous. They drive their vehicles over rickety bridges that nobody in real life would have tried to get over in those trucks. Like in other Friedken films, no character is completely likable, but that only makes it tougher to figure out who will live and who will die. There are a few nice twists here and there, right up to the very end to keep you guessing. The acting is exceptional. Scheider was Friedkin's fourth or fifth choice for the main character. Steve McQueen originally wanted it badly, but he demanded a part included for then wife Ali McGraw. Friedkin balked at this and then later regretted the decision. He later stated that he never thought Scheider was a good enough leading man. This is an error, however. Scheider is a terrific actor and his performance here is outstanding.<br><br>The film bombed badly at the box office. Heck, if you weren't in line to see Star Wars that year, you were in line to see Smokey and the Bandit! This is definitely one of Friedkin's best, and it has somehow almost been completely forgotten. The film apparently got a PG rating but it is filled with violence and all manner of evil goings on. You'll have to suspend your disbelief for some of the scenes, but you'll be glad you did. I'll give it 8 of 10 stars.<br><br>The Hound.<br><br>Added Feb 14, 2008: RIP Roy Scheider!","user":"TOMASBBloodhound","rank":[82,87]},{"title":"Lost Classic","rating":1,"date":"1 December 2002","review":"Sorcerer is a unique, brutal, brilliant film burdened underneath a terrible, wholly unappropriate title. Watching this film, it is not only easy to see why the film was both a huge financial and commercial disaster, it is downright obvious. This is the most un-american/ hollywood/ commercial film backed by a major studio I have ever seen. It is a tough, gruelling 126 minutes that goes nowhere fast, yet holds you firm in its tight grip and beats you senseless throughout. I was exhausted when the film finally arrived at it's rather downbeat ending. The multi-national cast is faultless. Scheider is magnificent. This is an exceptionally demanding, difficult role and he hits it head on, creating an anti-hero who is very, very real: desperate, frightened and desructable. Taking this role, at the height of his fame, was either very brave or very stupid. I'm going with brave. His performance here is a million miles away from his work on Jaws and Jaws 2, yet equally compelling. The photography is in a league of it's own (I only wish the DVD came with an original 2:35:1 print, assuming there is one, as the current disc is presented in a 4:3 full frame), and the music from Tangerine Dream complements the vision perfectly. This is a brilliant piece of film making from the most daring decade of cinema, made by one of cinema's true unpredictable's. Tense, dazzling, dark and fresh, this is an underated film that deserves to be re-evaluated.","user":"DB-08-DB","rank":[106,119]},{"title":"Friedkin's Swan Song before Sinking into Mediocrity","rating":10,"date":"14 August 2004","review":"A remake of Henri-George Cluzot's 1953 film The Wages of Fear (also on DVD in a lovely Criterion Disc), this William Friedkin film stars Roy Scheider (at his weary, doomed finest) as one of four men exiled to an unnamed South American country by their mistakes and crimes. Trapped in squalor (and it's damn convincing looking squalor, too, far beyond the sunbaked black-and-white compositions of Wages of Fear; this film looks like it's leaving mud on your shoes), unable to return to the lives they abandoned, they're driven by circumstance to accept a normally unthinkable job. They have to drive old, unstable dynamite from its storage site hundreds of miles over mountain terrain and washed-out roads to the location of an oil well fire so the blaze can be snuffed out. The pay is exorbitant -- but it's commiserate to the danger. The risks are colossal ... and they ultimately have no choice. <br><br>Sorcerer is tense, suspenseful film-making at its finest; you become physically uncomfortably during this film thanks to the incredible sense that at any minute our heroes would literally be blown to hell. (I mean, we all walk around with the philosophical knowledge we could die at any moment, but talk about your concrete metaphors ... ) Friedkin creates a palpable sense of place, and Scheider is immensely powerful as a man whose every move suggests that he knows he's doomed. Taut with suspense, completely convincing and breathtakingly human, Sorcerer is an unfairly maligned film that delivers in every way. <br><br>And the Score is unique and nightmarish. A new DVD would be welcome to many happy fans.","user":"mylundon","rank":[116,136]}]