[{"title":"Charming and original entertainment","rating":6,"date":"6 January 2000","review":"DARYL is an enjoyable and thought-provoking kids' film.  The central premise is fantastic and high-concept - a rare thing for children's films.  Daryl, a military experiment that combines the body and senses of a child with a microchip for a brain, is set free from his creators and settles in mid-America suburbia with a loving adoptive family.  The high-jinks that result from an apparently normal ten-year-old who has super-intelligence living in normal surrounds is light, predictable and great fun in patches.<br><br>The coup for this movie, however, is the thought-provocation  that arises from the evolution of Artificial Intelligence lifeforms to the point when you can no longer tell them apart from humans.  This complex issue is dealt with sensitively and thoughtfully in the context of a film not aimed at philosophers or AI scientists (clearly, however, the topic continued to prey on the mind of one of the screenwriters - Ambrose went on to write the excellent novel, Mother of God, which is the \"grown-up\" heir apparent to DARYL).<br><br>The familiar faces of Mary Beth Hurt, Michael McKean and Josef Sommer are ideally cast in the roles of parents and scientist respectively.  Equally, the young actors playing Daryl and best-friend Turtle are excellent.  The set-pieces fly through with surface levity and implied poignancy in equal measure (how easy it is to dismantle a computer, how difficult when the computer is encased in the flesh and blood of a child).  Stagey action scenes and the odd moment of wooden acting from minor support actors are the major blights on the film.  Overall, though, it is fun and entertaining.","user":"LukeS","rank":[27,27]},{"title":"Underrated classic","rating":10,"date":"10 November 2010","review":"I love this film and feel it is an underrated classic. Although I am a 90s kid, I am very fond of the movies of the 80s, Amadeus, Clue, Back to the Future, Indianna Jones, Beetle Juice, ET, Annie, Secret of NIMH, NeverEnding Story, Stand By Me, Legend, Princess Bride and Who Framed Roger Rabbit to name a few. D.A.R.Y.L has very nice cinematography, colourful sets and costumes without being too fancy and good special effects, while the soundtrack is cool. I liked the script too, it was funny and heart-warming and the story was engaging and poignant as well as briskly paced. The direction I had no problem with either, while the acting is fine especially with Barrett Oliver who is simply wonderful in the lead. Overall, I think D.A.R.Y.L is a classic, and one of the most underrated films of the 80s if not ever. 10/10 Bethany Cox","user":"TheLittleSongbird","rank":[22,23]},{"title":"A Real Person - What It Means To Be Human","rating":10,"date":"3 April 2007","review":"For me, there is simply nothing not to like about this film. It is well scripted, the parts fit together seamlessly and logically, and everything is justly proportioned--that is, everything's in good balance.<br><br>And the best part of it is that the acting is never overdone. The main characters are really human and believable, and Barret Oliver's acting is totally natural and spontaneous.<br><br>So even though one has to suspend disbelief in the science fiction impossibility of the story (a mere machine could never actually become a human brain), it's really worth doing so, just for the fun of it. <br><br>Just accept the basic premise of the plot for the sake of the story, and then relax and enjoy a heart-warming display of what are real human values in a world where these are sometimes sadly lacking, and a thought-provoking consideration of what it means to be 'a real person.'","user":"nordic2004","rank":[24,26]}]