[{"title":"An overlooked masterpiece","rating":10,"date":"19 August 1999","review":"One up front negative: Victor McLaglen as a dashing, adventurous Russian officer is very badly miscast.<br><br>This is a World War I Mata Hari genre film with Marlene Dietrich recruited by the Austrian Secret Service to spy for them against the Russians.  Like the other Von Sternberg/Dietrich collaborations this is all about visual texture and Marlene's incredible persona (which is very much due to her equally incredible talent).  Both come together perfectly in the amazing masked ball scene full, full, full of confetti, long twisted streamers, costumed revelers, and uncurling paper party-horns that you blow through to make a high pitched little squeal.<br><br>In one remarkable scene Marlene is hypnotic just saying, \"No.\"  \"Yes.\" \"Noooo.\" and \"Maybe.\"  In another her dialog is a hilarious and inimatable series of \"Meowwws.\"  I don't remember her singing in this one but she plays the piano with abandon.  Nevermind the plot, this is a film you watch because it is a great vehicle for one of film's greatest, if not the greatest, stars and because it is great cinema.","user":"theorbys","rank":[26,26]},{"title":"A giddy joy","rating":10,"date":"21 December 2009","review":"It is best to write first about von Sternberg's aesthetic as some have not grasped it so well in my opinion. When I first watched his \"The Scarlet Empress\" my initial feeling was that it was very silly; as a historical portrait of Catherine the Great of Russia it's ludicrous, in every palace scene these grotesque and implausible Russian Orthodox inspired gargoyles and paraphernalia loom out of the darkness. The palace sets reek of congenital insanity and cobwebbed decay that is decadently overblown. This is not the point though, for what we are seeing is not Tsarist Russia, but childhood dreams of Tsarist Russia. Who as a child if they read of Rasputin or Mata Hari, or Jack the Ripper didn't fully over-egg the pudding in their mind? My favourite dream is of an insomniac Russian court listening to those inestimable gifts of Bach, the Goldberg variations. You will never see my fever dream as I am not Josef von Sternberg, one of the greatest artistic geniuses (I really mean that word) of the Twentieth century.<br><br>Dishonored I am told is the least of the Dietrich/Sternberg collaborations, if that is so, then it is the least of the great peaks of the Himalayas in filmic terms. It is almost pure dreamscape. The film is in some respects an elaborate parry and thrust duello between Dietrich's X-27 and Victor McLaglen's Colonel Kranau, an Austrian and a Russian spy during The Great War.<br><br>It has been said that McLaglen was miscast in this movie. That for me is palpably false. McLaglen is mainly known for his stock character roles in John Ford movies, usually playing slightly oafish but well-meaning fellows. It may be the case that folks have been unable to disentangle that persona from what they saw in this film. My own personal blind spot is that I can only see Norman Bates when I see an Anthony Perkins movie, which ruins them every time. For me Victor's smile, which is all you see in the masked ball, is perfect for the role, his lifestyle and way with the women positively makes James Bond look like a rank amateur. There is an almost balletic moment in Dietrich's (why not say Dietrich when we are dealing with such an artificial delight?) bedroom where Victor effortlessly catches her hand as she whirls away from him; how can a movie be so controlled yet seemingly effortless? What this film leaves you with, which is the way of life of both Kranau and X-27, is the feeling of being neither afraid of life nor of death. These are two super-people leading exorbitantly fulfilled existences. Frankly I was overcome by this film. The masked ball, with Kranau grinning and hobbling away on his crutches will stay with me until I am dribbling and senile.<br><br>It is right and honest and proper to dedicate something you enjoyed doing. So I dedicate this review to Claire B, who is wonderful.","user":"oOgiandujaOo_and_Eddy_Merckx","rank":[16,17]},{"title":"Fascinating film.......so bizarre...","rating":9,"date":"4 January 2002","review":"Most will dislike Josef von Sternberg's Dishonored. The plot is often ridiculous, and that's what most people like to comment on. I found it hypnotic. The inconsistencies didn't annoy me so much as entertain me. In a way, this could be called a camp classic. Whatever type of classic it is, though, it is an amazing film. Confer the scene nearer the beginning when Marlene Dietrich walks right up to the camera, within inches of its lense. How about the scene where she plays a Russian peasant girl to infiltrate the Russian army (she's an Austrian spy)? She climbs up on a high ledge and starts meowing at the man whom she is seducing. The final sequence is stunning and audacious. <br><br>I'm skipping a few lines in order to give sufficient room to write this<br><br>SPOILER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!<br><br><br><br>\nWho else but Marlene Dietrich would insist that her lipstick were on straight before she was executed by firing squad?","user":"zetes","rank":[16,17]}]