[{"title":"I should have known. Poitier = Acting 101","rating":8,"date":"19 February 2007","review":"I saw this title coming up on TCM, read the synopsis, and KNEW instantly that this one I had to see. And like I said, I should have known. Poitier is probably one of the top ten dramatic actors of ALL TIME! I'm not sure I've ever seen a bad film that he was in. This little gem, was tremendous. I don't comment on many film's but when I see one I haven't seen before, and it's as good as this one, I can't restrain myself. Watch it when/if you can, and you won't be disappointed! There are many subplots and twists to this film, and it has many fine performances, including Telly Savalas, and Ann Bancroft. There are small parts, for a young Dabney Coleman, and one of Ed Asner's early ones as well. I am a classic movie buff, with over 800 titles in my library, and I simply love it when I come across a new one that I hadn't seen/heard of before. Like I said, Watch this one when/if you can.","user":"autocrat9","rank":[27,28]},{"title":"Anne Bancroft, RIP","rating":7,"date":"2 December 2005","review":"I believe that this was Sydney Pollack's directorial debut. If so, then he certainly gave an interesting insight into his future work. Seattle college student Alan Newell (Sidney Poitier) is working at a crisis hotline center when he gets a call from housewife Inge Dyson (Anne Bancroft), who is reaching the breaking point. Because they can't see each other, it gives the movie a real sense of tension, as implied by the title - even if it drags a little bit at times.<br><br>A previous reviewer said that Poitier plays his usual role: a morally superior black man in a white-dominated society. That's partly true, but here, he has a job that anyone could have, and his race doesn't really matter (although as the reviewer noted, they could have been subtly talking about race). As for Anne Bancroft, her death six months ago brings her filmography to mind. This may have not been her most famous role, but I would recommend it.","user":"lee_eisenberg","rank":[16,16]},{"title":"Bancroft is excellent...","rating":9,"date":"26 July 2007","review":"This film tackles subject matter which we still do not see addressed as often as it could be, with Sidney Poitier as a young suicide hot-line worker/college student who works helping out a Seattle psychiatrist Dr. Coburn (well-portrayed by Telly Savalas).<br><br>At the time this was even more of a taboo subject. A housewife feeling despair, Bancroft portrays her alienation and desperation sympathetically and in an understated manner. She has a child from her first boyfriend, concealed this from her husband (well-portrayed by Steven Hill) Her husband becomes angry and she begins to feel as if her life is a sham. Her office job no longer satisfying, she takes to wandering the city of Seattle, there are several intriguing scenes of the coastline.<br><br>There is one moving scene where she is on the beach and comes across a small group of children who are trying to rescue an injured bird. She rushes to a liquor store to buy some brandy (not sure how this can quite help the bird, but anyway...) she returns to the beach to find the children have abandoned the bird. It is an effective and disturbing scene.<br><br>Poitier is outstanding as usual, in that he is trying to locate Bancroft when she calls threatening suicide. She has checked into the Hyatt Hotel somewhere in the city. He becomes alternately frustrated, caring, sympathetic, angry and joyous in various aspects of the film.<br><br>Overall this is an excellent film with some very good performances. Highly recommended. 9/10.","user":"MarieGabrielle","rank":[13,13]}]