[{"title":"Peter Sellers' forgotten film","rating":10,"date":"5 December 2000","review":"A few know that Peter Sellers once-apart from starring-directed a film! This was \"Mr.Topaze\" or \"I Like money\"(as it was screened by that name in the US). Actually, it is not a masterpiece, but not a poor film too, as the reviews of its time claimed. Peter plays a naive teacher, a man of spirit who is corrupted by money and power. What is very interesting is that the film has quite many \"serious\" moments and Peter depicts the teacher with accuracy. What's more, the film's finale isn't comic at all. Pity this film was never released on VHS on DVD(but it is never too late, is it?)!","user":"num-num","rank":[15,17]},{"title":"Clearly the BFI had a copy stashed away","rating":7,"date":"29 February 2020","review":"This obscure Peter Sellers film directed by himself begins poorly. We are introduced to the self righteous small town schoolteacher, played by Sellers, and it seems to go on and on without being amusing, or if occasionally vaguely amusing, certainly not funny. An amazingly young Billie Whitelaw doesn't help, seeming unable to rid herself of her theatrical bent. And here perhaps lies the basic problem in that this was a stage play and much of the activity would have probably been acceptable on the stage whereas it probably needed someone with greater experience than Sellers to shake this up and give it more life. As it happens things are never as bad as at the start and gradually things get less bad. By the very end we have a gloriously presented Sellers in complete cynic mode ready to go and it ends. Masses of extras n the Blu-ray and the prospect of seeing it again without fear of it sinking into the mire make me look back just a little more favourably and feel a bit sorry for Sellers who apparently felt so bad at the films reception that he thought he had bought up all copies and destroyed them. Clearly the BFI had a copy stashed away.","user":"christopher-underwood","rank":[0,0]}]