[{"title":"An instant classic, underrated.","rating":8,"date":"20 October 2007","review":"While most reviews describe this movie as 'just an average comedy', even at this, Armed and Dangerous is a laugh and a half. It's charming, fast-paced, and furthermore, I adored Candy and Levy's interactions on-screen. One minute, they're ragging on each other, the next, they're the best of friends.<br><br>The movie also has, though almost impossible to find a copy of, an excellent soundtrack, including \"Armed and Dangerous\" by Atlantic Starr, and, of course, half a dozen or so other popular 80s hits. With that, the movie is also on DVD, and while it doesn't have much in the way of extras, it does include anamorphic widescreen with Dolby Stereo 2.0 Surround Sound.<br><br>Possibly the only complaint one could make we might all agree on was that it was just too short. At just under an hour and a half, as endearing as each minute is, the film does leave much to be desired.<br><br>All in all, Armed and Dangerous is a mid-80s classic well-worth watching. It's the perfect blend of action and comedy, and SCTV fans will find that it's no flop for either Candy or Levy; even as the script is considered by some to be lacking, both hide it well.","user":"yagata_tenpu","rank":[14,14]},{"title":"Great John Candy movie!","rating":10,"date":"11 September 2003","review":"Armed and Dangerous is one of John Candy's best films! Eugene Levy, Meg Ryan, Brion James, Robert Loggia, James Tolkan, Kenneth McMillan, and Tom Lister Jr. were all good. I loved the performance Lister and Candy did together! I don 't like to make fun of anybody but it was so funny every time Candy would make fun of him and I loved Lister doing his Zeus Trademark in the film! If are a fan of John Candy and the above cast mention and love hilarious action packed comedies with good music then I strongly recommend that you watch this classic movie soon!","user":"Movie Nuttball","rank":[27,29]},{"title":"Classic Candy","rating":10,"date":"8 August 2000","review":"Although I'll probably take some heat from saying this, but I love this film.  I grew up watching it and it gets funnier every time I see it.  If you're a die hard Candy fan, you have got to see this movie.  Although this isn't Candy's best film, it definitely shouldn't be overlooked.","user":"Dooley","rank":[21,23]}]