[{"title":"Young men thrown into a terrible conflict","rating":8,"date":"6 September 2006","review":"An interesting vision of young men in war. The idealist, the shy and the playboy get to war. All will be changed by the horror of the conflict, not only with enemy troops, but within their ranks.<br><br>Lt. Christian Diestl's (Marlon Brando) sense of honor and gentle behavior clashes with the cruel, senseless attitude of his superior, Capt. Hardenberg, realistically played by Maximilian Schell.<br><br>Private Ackerman (Montgomery Clift) a shy unassuming Jewish boy becomes a courageous soldier, opposing both enemy soldiers and the bigotry of their comrades.<br><br>Private Withacre, a playboy who tries to avoid duty (Dean Martin), finally ends up resigning a safe post to join the fighting in Normandy, and becoming a soldier.<br><br>The usual Black and White shooting enhances the cruelty of WWII. If you find it, don't miss this performance by great actors.","user":"juanmlleras","rank":[27,31]},{"title":"A Tale of Four Soldiers","rating":10,"date":"9 May 2005","review":"I've always liked The Young Lions because it has the best explanation for the phenomenon that was Nazism in Germany. Always the question is asked how did they come to power? At the beginning with Marlon Brando romancing vacationing Barbara Rush in Bavaria on New Year's Eve, he provides one of the most lucid explanations of why people would choose to follow Adolph Hitler. It is one of Brando's finest moments on screen. <br><br>At the time of course he didn't know he was romancing the main squeeze of Dean Martin who with Montgomery Clift play the two American soldiers who's stories and growth as human beings is told. Martin is a Broadway musical comedy entertainer and Clift is just a department store clerk at Macy's who meet by chance at the draft board. Martin is trying to dodge the draft, Clift is fatalistically accepting what comes. Martin proves to be a man of far more character than we first think. Clift is a Jew and a man who with enough reason to be going to war against Hitler, has to deal with anti-Semitism here in America. <br><br>Clift and Martin's stories are told alternately with that of Brando and also Maximilian Schell. This was Schell's first appearance in an American production and he scores well as a proud Nazi officer. Let us just say that he gets quite a comeuppance all around during the course of this war he was so proud to be part of.<br><br>The two male actors who are always cited as the rebel heroes of post World War II America are Marlon Brando and Montgomery Clift. Too bad in their one film together they didn't exchange any dialog. Still I can't praise a film like The Young Lions too highly.","user":"bkoganbing","rank":[59,73]},{"title":"A Fine Cinema Experience","rating":9,"date":"1 April 2000","review":"A long time ago, some time before the powers that be decided that movies should be made only to extricate money from children by catering to their base instincts and in so doing destroy our civility, the American Cinema was devoted to the art and craft of story telling.  In these stories, life was often celebrated through the study of the character of the human heart.<br><br>In THE YOUNG LIONS, we experience masterful story writing in the screenplay by a man named Edward Anhalt who adapted it from a novel by Irwin Shaw.  In this fine example of the final years of the Golden Age of Hollywood we see a study of character, ideas and humanity seen amidst the greatest conflict this Earth has ever known, WWII.<br><br>Here, we experience both the Americans and Europeans, including Germans. They are played as they really were, not as depicted by latter day directors such as Steven Spielberg and others who have drawn WWII Germans as silhouette, cartoon characters, all vile and evil.  Here, they are shown as singular human beings with personalities, hopes and dreams really exactly like our own.  The opposing forces are caught up in a madness that somehow swept across the face of this planet at a specific time, when really probed, for reasons quite unfathomable.  This was also one of the peak film renderings of Marlon Brando, whom some feel is one of the finest actors ever to have graced the silver screen.<br><br>If you yearn for a fulfilling example of American Cinema at a time when it was a serious, respected industry, this is one for you to see.","user":"merrywood","rank":[82,104]}]