[{"title":"\"Not even nature can duplicate character, not even in twins\"","rating":7,"date":"9 January 2009","review":"Psychology is a dubious science as it is, but, when a Hollywood screenwriter gets his hands on it, anything even closely resembling fact is thrown out the window. In the mid-1940s, Freudian psychology reached the peak of its popularity, and films such as Hitchcock's 'Spellbound (1945)' and Lang's 'Secret Beyond the Door (1947)' utilised their own versions of psychoanalysis to provide easy answers for their characters' delusions. Robert Siodmak's 'The Dark Mirror (1946)' is no different, in that we are offered a half-baked pseudo-scientific dissertation on why even identical twins can be anything but identical when it comes to personality traits. In fact, screenwriter Nunnally Johnson (who also wrote and directed 'The Three Faces of Eve (1957)') actively pumps the familiar but questionable notion that twins respectively represent the good and evil sides of man. This duality is similar to that explored in the earlier versions of 'Dr. Jekyll and Mr. Hyde (1920/1931/1941),' though the two sides of the human coin are here separated from their mutual shell and allowed to behave as independent entities.<br><br>Olivia de Havilland excels in dual roles as Terry and Ruth Collins, twin sisters who might just have pulled off the perfect crime, even if only one knows it. When the sisters' shared boyfriend is murdered in cold blood, two witnesses place one of the twins at the scene of the crime, while three more provide a solid alibi for the other. The only problem is that nobody can tell the pair apart. A police detective (Thomas Mitchell) is torn apart by the case: how can he charge either woman with murder if he can't decide which of the sisters is, in fact, a murderess? Only through Hollywood's good friend Dr. Freud can the true nature of the crime be exposed. The distinction between the \"good\" and \"insane\" twin is clearly drawn early in the film, with de Havilland playing one sister, Terry, as a cocky dominator, and the other, Ruth, as more softly-spoken, with eyes always downcast and hands delicately clasped together. Clarifying the dual relationship is some convenient symbolism used in the film's climax: Terry is dressed in black, and Ruth in white.<br><br>Convincing optical effects and the use of body doubles are employed successfully to create the illusion of two Olivia de Havillands. The actress does well as both characters, perhaps channelling her dislike of sister Joan Fontaine to portray the snarling, psychotic and homicidally jealous \"evil sister.\" Though they start out perfectly alike, it doesn't take long for the two Collins sisters to develop distinct personalities in the eyes of the audience, and Siodmak should quickly have dispensed with the obvious name-tags (either a necklace or a single letter pin) added to ensure that the audience could follow who was who. Perhaps misguidedly, the presence of twins is at first played largely for laughs, with composer Dimitri Tiomkin keeping the atmosphere surprisingly light and fluffy. Fortunately, however, the mood darkens substantially in the film's second half, as the hatred simmering slowly within the darker twin threatens to spill over into reality. Though the unlikely psychology behind 'The Dark Mirror' tests one's credulity at regular intervals, the strong acting and unique storyline make this one worth seeking out.","user":"ackstasis","rank":[21,21]},{"title":"Olivia de Havilland's role of her life","rating":9,"date":"13 November 2006","review":"A man is murdered, and a woman called Ruth Collins is seen at the scene of the crime.The case gets tricky, when is found out that Ruth has a twin sister, Terry.They both have to then go see a psychiatrist, Dr.Scott Elliott.The doc falls for the normal sister, but which is which? The other one of them is capable of committing a cold blooded murder, but which one? Robert Siodmak's Film-Noir The Dark Mirror (1946) takes some Freudian turns as it goes on.Olivia de Havilland shines in a dual role.She's terrific as the psychotic sister as well as the normal one.Lew Ayres is great as the Shrink.Character actor Thomas Mitchell does very fine job as Lt.Stevenson.This movie was very fascinating to watch.It gave some challenge finding out which one did it.60 years has done no harm to this film.","user":"Petey-10","rank":[39,42]},{"title":"dead ringers","rating":8,"date":"9 March 2006","review":"The film is a little bit light, with a bumbling detective played by Thomas Mitchell and vintage Freudian psychoanalysis presented by Lew Ayres, but the twin sister role, one a good girl the other very bad, played by Olivia De Havilland has its moments. Her soft voice can go either direction, sweet and innocent or cold and devious, and the scenes where she is playing both parts, essentially talking to herself, convey a split personality, which might not have been such a bad idea, instead of making two distinct persons. It reaches a zenith in one scene in their dark bedroom with the innocent twin tormented by the mean one, who's telling her to take her sleep medication, and who in fact would like to see her overdose. Freudianism and bungling detective work win out in the end, making this all seem too convenient, and dodging a lot of the possibilities, but the central part, or parts, is DeHavilland at her best.","user":"RanchoTuVu","rank":[26,30]}]