[{"title":"\"Money may not buy happiness, but it will buy the things that will Make you happy\"","rating":21,"date":"21 December 2006","review":"There are too many reviews of Risky Business for mine to have any relevance as a movie review. However, this movie is for me a time capsule of the era I saw it in, and a photograph of the future to come in American culture. <br><br>I saw this movie when I was 22 in a tiny college theater with a date. I remember several disconnected things about it: The movie was much more interesting than my date was, the music by Tangerine Dream was hypnotic and fit the tone of the film, which struck me as being more depressing in places than funny (although there are some funny moments in it), and it gave me a glimpse into a world that I thought was fictional. It turned out I hadn't experienced the world it was presenting yet. When Cruise asks his friends what they plan to do with their lives, one's answer is very simple and focused: \"Make money\". Another friend adds: \"Make a LOT of money\". <br><br>It turns out the movie was precognizant of the next ten to twenty years of American culture; the absolute obsession with making money through any means necessary, legally or illegally, regardless of consequences to yourself or others. Then taking that money and buying the things that will make you happy: a porsche, a big house, and most importantly, a hot babe in your bed, that will only be there as long as the money is. Internally discovered happiness? A quaint notion created by the poor who can't afford the toys that validate your existence.<br><br>I am sure that the filmmaker would be the first to say that the movie parodies the hollowness of the \"American Dream\" of acquiring wealth to buy creature comforts, but too much of the time it feels like it celebrates them. At the end, the hooker stays Cruise's girlfriend only as long as he continues to make her money; she even says \"I'll be your girlfriend...for a while\". Real loyalty there. But then, she is a hooker, and is being honest. She in fact is presented as the only person in the film that is not a hypocrite. She has no illusions that money &amp; sex make the American world go 'round, and doesn't pretend herself to be otherwise; unlike Cruise and the rest of his friends. In the end however, she is still hollow, the values the kids pursue are hollow (they are only after sex, not love), and the movie feels as deep and solid as a glossy magazine ad for a Lexus. <br><br>Even over the obsession of greed, however, the film illustrates the complete alienation of the modern American teenage male: alone, isolated, judged by his peers with the kind of car his dad lets him drive, his clothes, and whether he can get laid or not. The emphasis is on sex, not relationship. There is no rite of passage into adulthood, no guidance from parents who more often than not are as distant from their children as the cardboard cutout parents in this film. <br><br>In short, as depressing as this film is when you step back from it, it paints a frighteningly accurate portrait of how superficial and narrow a world, yet directionless (except for accumulating superficial wealth) a young boy's world can be. There are no values taught in this film, because there are none available as examples. And that is the environment too many kids are subject to. That is what was so disturbing to me about the film at the time I saw it, yet it took 20 years to understand why (as I was, like most kids my age, in the same vacuous and bankrupt culture this kid was in at the time). <br><br>There are 300% more suicides committed by 14 year old boys in America than any other age group or category. This movie explains why. <br><br>Seven stars, not for humor, but for photographing the beginning of an era that lasts until this day. The message from Enron, WorldCom, Martha Stewart and others for American kids will be: Don't get caught. A message which is slowly becoming the only \"moral direction\" left in American culture.","user":"mercuryix-1","rank":[205,230]},{"title":"A Stylish and Intelligent Comedy that redefined the teen angst comedy and created a new movie star","rating":8,"date":"4 May 2007","review":"RISKY BUSINESS is the smart and sexy 1983 teen comedy that brought intelligence to the genre and made a bonafide movie star out of Tom Cruise. Cruise is utterly winning as Joel Goodson, a high school senior excited about the prospect of having the house to himself when his parents go out of town for a few days; but things go from bad to worse when Joel crosses paths with a nubile prostitute (Rebecca DeMornay). This surprise hit brought an element of sophistication that was absent from a lot of the teen comedies that were populating the screen in the 1980's. This movie boasts a smart screenplay, imaginative direction, a memorable musical score, and on-target performances from Cruise, DeMornay, Curtis Armstrong, Joe Pantoliano (memorable as a slimy pimp), Bronson Pinchot, and Janet Carroll. Tom's sexy underwear dance to \"Old Time Rock and Roll\" has become Hollywood folklore. An instant classic upon release that still holds up over 20 years later.","user":"Isaac5855","rank":[64,72]},{"title":"\"I deal in human fulfillment.\"","rating":9,"date":"12 July 2006","review":"Risky Business is a film people unfortunately seem to forget about when they're listing off great teen movies. Tom Cruise, in his first major role, is wonderful as Joel Goodson. He's a boy-next-door type whose life spirals wildly out of control when his parents leave him alone for a few days. Joel is a decent student looking to spend his time wisely during his senior year of high school and hopefully get into a good college. He finds out the hard way that a few bad decisions can lead to all kinds of problems and possibly ruin your future at that age. The film has the intelligence of a John Hughes film combined with the sexual content of a Porky's film. Risky Business is the best of both worlds, if you look at it that way.<br><br>Tom Cruise's Joel Goodson seems to have a lot going for him. He is the only child living in a nice house in suburban Chicago with his loving parents. You get the sense that he's never been left alone for any extended period of time the way they fawn over him before they leave. After leaving him a decent wad of money and a few instructions about what to do and what not to do around the house, his parents split, and Joel is left all alone. Things go downhill fairly quickly. His best friend (that scene stealing Curtis Armstrong)orders him a prostitute that will show up right at his front door. Needless to say, the person who shows up is not what Joel is looking for. In a fit of sexual frustration, Joels orders the services of the gorgeous, but high-priced Rebecca De Mornay. After a wild night of sex, she informs him he owes her $300. That is substantially more money than his parents left him. Before his dilemma is solved, Joel crashes his father's Porshe in Lake Michigan, gets suspended from school, has a crazed pimp on his tail, and winds up turning his home into a brothel for one night to pay for all the damages he's caused.<br><br>This plot could have been crafted into an awful movie. Director Paul Brickman knows what he's doing, though. He gives each of his main characters enough dimension that we as the audience actually care what happens to them. We feel Joel's agony as his future seems in doubt during the film's final half hour. Rebecca De Morany is given considerably more depth that you'd think, but we are never allowed to get close enough to truly trust her. Joe Pantoliano is terrific as her pimp, also.<br><br>Is this film believable? Heavens no. It's plays more like a young man's sexual fantasy run amok. The first scene of the movie mirrors this theme. We see Joel dreaming about having sex with a hot young woman in the shower, then finding himself three hours late for his college entrance exam. We walk such a fine line between pleasure and big trouble at that age.....<br><br>9 of 10 stars The Hound.","user":"TOMASBBloodhound","rank":[38,46]}]