[{"title":"A Favorite 50s Jidaigeki in the Style of the Old Masters","rating":10,"date":"3 August 2007","review":"A Bloody Spear on Mt Fuji's plot is basic; a group of travellers (Samurai and two servants, shamisen player and daughter, highway policeman, thief, miner) interact and become closer through stressful and comedic situations (also, some tragedy). Ostensibly a road movie, a lot of the interaction and activity takes place in inns and city streets, very little on roads (though what does is memorable, such as Gonpachi becoming acquainted with an young orphan boy admirer.) Most of the plot revolves around the samurai, whose character reminds one of Yamanaka taking a stand against society and paying the price. I wonder if this inference was an accident (Yamanaka made popular films that questioned the status quo in the 30s, was sent to Manchuria and died at the front shortly after; only three of his films survive today.) There are many great moments in the film, which is as comedic in dialogue as it is in editing and tone. Daisuke Kato plays one of the servants, and his sake drinking and philosophizing scenes are everyman humor at its best. The playful looks, dialogue, and subtle attraction between the shamisen player and Gonpachi (Chiezo Katoaka), lords sitting on a busy highway to Edo shutting down traffic for a tea ceremony, and the lancer's final battle all stick close to my memory. I can't think of any other postwar Samurai film that does this kind of action, comedy, and drama as entertainingly (my favorite postwar jidai-geki films are the Anti-Samurai ones, such as Okamoto's Sword of Doom).<br><br>If you, like me, were taken wholly by surprise while watching Yamanaka Sadao's Tange Sazen and the Million Ryo Pot then you'll greatly appreciate this film (only available as a bootleg with English subtitles, though there are rumors this and more Yamanaka could get an North American release soon). It shares with the 1935 genre picture a sense of humor and lightheartedness that few films have done as well. In fact, since Uchida Tomu directed this jidai-geki with the help of Shimizu Hiroshi and Ozu Yasujiro, I can only imagine it's a heavy homage to their lost friends Yamanaka and Itami Mansaku. Itami's film Capricious Young Man can be felt all over, especially in it's depiction of the samurai servants mingling with each other and arguing about their duties. Ozu and Shimizu's touch can also be felt with the depiction of the child, as it's characteristically their own. He's rebellious and witty, but also retains childish attention getting ways, and lack of self restraint in all matters. Ozu and Shimizu used this type of childish antics in their films regularly to great effect (particularly in Ozu's I Was Born But... and Shimizu's Children in the Wind.) Uchida's history is an interesting one. He went to war, and after 1940 spent ten years in a prison camp in China (more on this part of his life, and some notes by Craig Watts about Bloody Spear at Bright Lights Film Journal). He began directing silents and moved on to become on the late thirties preeminent social realist directors, making a powerful play with Earth (1936), made almost entirely with extra film stock from other productions. His other late thirties work, Theater of Life, Police, and Unending Advance were preferred by Donald Richie and have garnered critical appreciation from critics like David Bordwell, Keiko McDonald, and midnighteye.com. His samurai films from the 50s and 60s have aged relatively well, especially this and his Musashi Miyamoto pentalogy. Toei made mostly low grade cheesefests, but were known to throw in a \"prestige\" film every now and then, of which Bloody Spear at Mt Fuji definitely categorizes itself. With the big name writer/directors, and headlining actor Chiezo Kataoka, this was surely a success.<br><br>You can buy this film with french subtitles at Amazon France, though I found a copy with an English translation by fishing around. Also, there's a great overview of Uchida's career at Senses of Cinema by Alexander Jacoby. Also, be sure and pick up Masters of Cinema's absolutely necessary R2 UK DVD of Yamanaka's Humanity and Paper Balloons.","user":"Steven_Harrison","rank":[15,15]},{"title":"Ideal blend of narrative and meaning","rating":10,"date":"25 September 2008","review":"I find that many films either focus on story so much that they lack meaning or they go to the opposite extreme and focus so narrowly on a message that they fail as stories. Thus it is with great pleasure that I viewed a film that refreshingly melds narrative with meaning in a fashion that works so well it seems almost effortless.<br><br>Tomu Uchida's A Bloody Spear at Mt. Fuji is the story of an unassuming samurai who is more interested in a person's actions than his social standing. In spite of the rigid class divide that exists between himself and his servants he tends to treat them as his equals even when they themselves feel that they are inferior to him. The film features remarkable subplots that add scope and depth to the social criticism offered by the main plot. Among these is the story of a male orphan who idolizes the samurai's spear bearer and a young woman who is sold into prostitution because her family is too poor to support her.<br><br>The style of the film is quite unique. I don't know if I've ever seen a movie switch from one a light comedic tone to a tragic one so effectively. While this handles some of the same themes covered by directors like Mizoguchi and Naruse it does so without ever seeming overbearing or ponderous.<br><br>This film also boasts one of the best endings I've ever seen. Brilliant end to a brilliant film.","user":"timmy_501","rank":[13,14]},{"title":"A Bloody Spear On Mount Fuji (Tomu Uchida, 1955) ***","rating":7,"date":"10 January 2009","review":"I had never heard of Japanese director Tomu Uchida prior to reading about a retrospective held at London's National Film Theatre in December 2007 but, my interest ignited, I quickly landed this film in my collection. What we have here, essentially, is a tragicomic road movie: the narrative  about a pilgrimage to the titular landmark by a disgraced samurai (prone to violent drunken binges) and his two dim-witted warrior-servants  rambles amiably along in a leisurely and mostly droll vein until the unexpected and electrifyingly bloodthirsty finale. Through the striking use of sweeping camera movement and fast cutting, we are introduced to the trio of protagonists and the major supporting characters right from the very first sequence; the comic highlight comes around the midpoint when an abandoned boy (who joined their party after befriending the lancer) disrupts a solemn tea-drinking ceremony enacted by three noblemen in an open field while naturally relieving himself in the nearby bushes. The second half grows more somber with the episodes of the capture of a notorious tattooed thief disguised as a pilgrim and an old man forced to sell off his daughter as collateral for a measly loan. Nothing however really prepares us for the remarkably 'clumsy' climax (this is no choreographed ballet of violence) in which the lancer single-handedly dispatches the men who had killed his master merely for daring to drink publicly with his subordinate. It is also worth mentioning that several distinguished Japanese film-makers (including Yasujiro Ozu) helped in the making of this film which was Uchida's comeback after a decade spent in China.","user":"Bunuel1976","rank":[10,11]}]