[{"title":"Veteran actors prove they can still hack it on Golden Pond.","rating":10,"date":"22 July 2000","review":"Mark Rydell's On Golden Pond was a surprise hit in 1981, finishing third in box office grosses after Rocky III and E.T. Such an occurrence was unheard of in Hollywood, considering the key players in the film, Henry Fonda and Katharine Hepburn,  each had not had a hit film in almost twenty years and were both hardly spring chickens in the business. Both these veteran actors proved they could still make it in Hollywood among young starlets, and triumph. Still, when you see \"On Golden Pond,\" you sense that their teaming together for the first time in their careers is purely a special occasion, an opportunity of a lifetime that few actors in their seventies receive. They in turn have left us with a wonderful showcase of movie talent, a film of warmth, good humor, and love.<br><br> It always amazes me when I read that Henry Fonda had only received two Oscar nominations during his career, one of which he earned for this film. Like his good friend Jimmy Stewart, Fonda was rarely a boisterous actor. He had a natural ease to his acting, a gift for making audiences believe that every word he uttered was truth. Now, in his final screen performance as Norman Thayer Jr., Fonda had to reach deep into his own personal experience and his advancing years to create a character who struggles with his own mortality. Norman is a grouchy curmudgeon who has memory lapses and heart palpitations. He has a loving and cheerful wife, Ethel (Hepburn), but a difficult relationship with his only daughter, Chelsea (Jane Fonda). He and Ethel journey back to their cottage on the lake for what may be their last summer. Immediately, Norman comes face to face with his old age and his inability to remember what should be familiar sights. I especially like the scene where he gets lost in the woods looking for strawberries and scares himself when he is unable to find his way back. Ethel has such faith in him, sure he will \"get back on that horse\" and be as valiant as he once was. What more could you want from a wife?<br><br> Chelsea arrives after many years away from her parents, bringing with her a new boyfriend (Dabney Coleman) and his son, Billy (Doug McKeon). You can sense the tension between Chelsea and Norman the minute she walks in the door. This reunion is fascinating not only because we can never tell where the difficulty lies in their relationship, but also the fact that these problems also exist on and off the screen. The father-daughter relationship between Henry and Jane was also very turbulent ever since Jane began her protests in Vietnam, much to the chagrin of her father. This collaboration of the two was meant to mend fences between them. Not often do the personal lives of actors collide so eloquently in Hollywood, but here it seems just about right.<br><br> The sequence where Norman and Bill (Coleman) attempt to build a conversation is originally conceived and acted so naturally. He carefully asks Norman if it would be alright if Chelsea and he sleep together in the same room at the cottage. Of course, Norman makes this confrontation as difficult as possible, making Bill nervous and jerking him around. Ironically, Bill comes back at him, not allowing Norman to use him in petty mindgames and hoping they would become friends, which is obviously \"not an easy task.\" This is an unsettling turn for Norman and the audience, but it is necessary for the story to progress and for Norman to respond accordingly to the other characters in the story.<br><br> Ethel and Norman volunteer to let Billy stay with them for the summer while Chelsea and Bill head off to Europe. Billy is not pleased with the arrangement at the outset, but gradually bonds with Norman through learning to fish on the pond. While Billy is not necessarily an original character, it is fascinating to see him try to understand Norman, and in turn how Norman learns to associate with the son he never had. It is a learning experience for both of them, even though they are many generations apart.<br><br> Many reviewers have remarked that ON GOLDEN POND uses a conventional story and revives it with great performances from the cast. It is interesting to note that the screenwriter, Ernest Thompson, altered his own play in order to escape a bit of the conventionality that the film medium required. The framework may seem as original as an old shoe, but the added touches in the script and its delivery give this film a certain magic that only classical Hollywood films possessed. Fonda has a great way to end a career with this role, placing himself completely within Norman's world and searching within and through the role for his own solutions to life's problems. His Oscar was given to him for more reasons than mere charity. Hepburn is delightful as Ethel, working so well with Fonda that it does not seem as if they are acting. For a couple of old Hollywood actors who never even met before this, they each prove they are true masters of their craft. Jane Fonda takes a supporting role this time, incorporating some of the same motives as her father into her part, and as a result delivers a special performance. Mark Rydell is one of those directors that often gets left off the list of the all-time greats, but proves once again here he is a masterful storyteller. In this project, he allows both the visual elements of the pond and his actors to make magic, a truly memorable combination. <br><br> On Golden Pond is not an epic, but what it accomplishes runs close to epic proportions. It is very rare that a stageplay converts so well to the screen like this one. On Golden Pond is vibrant, emotional, and so heartfelt, it is impossible not to like, unless you are a curmudgeon like Norman Thayer. It is also unique that great actors such as these will agree to try again for Hollywood glory so late in their careers. It is up to us viewers to experience this wonder before the chance is lost and these thespians finally close up the cottage and head off to their retirement.","user":"movieman9","rank":[84,94]},{"title":"Warm, reflective, touchingly basic human drama, with Henry Fonda and Katharine Hepburn offering treasured performances in their twilight years.","rating":9,"date":"19 March 2002","review":"\"On Golden Pond\" is simply an old-fashioned testimonial to long-lost youth and facing one's mortality, and, in its simplicity, becomes a life-affirming valentine to those who feel that time has become the enemy - a seemingly ageless, universal perception.  If not for the magnificent acting duet between Henry Fonda and Katharine Hepburn, this lovely, sentient piece would have been ignored by most moviegoers.  But buoyed by these two acting legends, it manages to circumnavigate the heavy, mawkish waters -- rising far above and beyond anybody's expectation.  Earning a whopping ten Oscar nominations, Ernest Thompson's reflective screenplay won one of those Oscars, but, for me, it's Dave Grusin's soothing, glistening score that is the stronger selling point here, adding immeasurably to the film's ruminative tone and gently rustic surroundings.<br><br>Henry Fonda plays brusque, cantankerous Norman Thayer, a one-time college professor approaching his 80th birthday with a mixture of anger, cynicism and fear as he shows signs of losing his faculties.  Norman is not a particularly kind or considerate gent.  Abrupt, callous, remote, and ill-equipped to offer nurturing support of any kind, living with Norman must have been quite an ordeal for those growing up under his roof.  As a means of self-preservation, their only child, Chelsea, has long estranged herself from the family, unable to emotionally come to terms with her unhappy, unhealthy relationship with her father.<br><br>Fonda offers the most affecting, endearing performance of his durable career.  He manages to use Norman's undesirable traits to his advantage, investing in his character a gruff charm and cynical sense of humor that is totally winning.  He melts away the harmful, negative elements, as Carroll O'Connor managed to do for Archie Bunker, and makes Norman not only funny and entertaining, but loveable.  As a result, Fonda becomes the glowing centerpiece of `On Golden Pond,' and it is this portrayal, along with his `Grapes of Wrath' Tom Joad, that will remain indelibly etched in our hearts and minds for decades to come.<br><br>Kate Hepburn is his Ethel, a loving, pragmatic anchor who obviously has played an important role in the lifetime success of this complicated man. Devoted to a tee, Ethel understands and compensates for the weaknesses of her husband.  She valiantly assuages his deepening fears with good-natured kidding, feigned hopelessness, and careful but subtle guidance.  She is Dulcinea to his Don Quixote.  As a lioness would shield an endangered cub, she has automatically assumed the roles of caregiver, protectorate and confidence booster without pause or grief.  Only for Ethel does Norman step out of his shield of emotional armor and display a genuine affection that is lost to others, including himself.  Hepburn absolutely radiates with warmth and vitality, providing the film with a necessary center.  Though less flashy and substantive, both she and Fonda were Oscared for their work here, with Hepburn winning a record-breaking fourth 'Best Actress' award. Incidentally, this was their ONLY screen pairing, yet they work together as if they've known each other all their lives.<br><br>Fifteen-year-old Doug McKeon manages to hold his own among the star power here as a young resentful upstart whose dentist father (Dabney Coleman) is romantically involved with Chelsea.  Forced to play out the rest of his summer with the old folks while his father and girlfriend spend quality time together, he learns a delicate lesson or two as he develops an unlikely bond with Norman.  Coleman himself has one edgy, amusing scene as he tries to gracefully deal with an overly wry Norman.<br><br>Surprisingly, the weakest story link involves Norman's strained relationship with daughter Chelsea, played by Hank's own daughter, Jane Fonda (Oscar-nominated).  The familial situation obviously parallels their own real-life lack of connection, but the scenes seem strangely shallow and self-serving as they forge through some mucky emotional moments as if striving for real-life closure.  What should have been insightful and compelling comes off forced and distracting, particularly on Jane's part.<br><br>Henry Fonda's own physical frailty at the time of shooting adds a special poignancy to the film.  Ironically, Hepburn won her second Oscar in 1967 for playing another wifely Rock of Gibraltar in `Guess Who's Coming to Dinner?' The ailing Spencer Tracy died shortly after the completion of that film. Fonda would pass away a few months after winning his only Oscar.<br><br>A most welcome and satisfying diversion that touches with its unpretentiousness, `On Golden Pond' is a lovely, lovely little film that should resonate for ages to come.","user":"gbrumburgh-1","rank":[55,63]},{"title":"Reflective twilight year musings on aging & relationships","rating":7,"date":"24 March 2006","review":"This is an extremely well crafted film, although I believe a little overrated from a sense of nostalgia for its beloved talented and now aging stars, Henry Fonda and Katharine Hepburn. Of course the cinematography is magnificent, with lovely country scenery and beautiful lakeside vistas, all well incorporated into the emotional aspects of the picture.<br><br>The movie brings the viewer into what is probably the last of many summers spent at their Golden Pond cottage by retired professor, Norman Thayer, an ornery old codger, and his cheerful, loving wife, Ethel. Their semi estranged 40 something daughter, Chelsea (Jane Fonda), comes to visit, in honor of her father's 80th birthday, bringing her new fiancé, Bill. The younger couple leave Bill's young teenage son, Billy, with Chelsea's parents while they jaunt off to Europe for a couple of weeks on holiday.<br><br>It's a film that is character driven, and all about relationships. For me, the most moving is that between husband and wife. Henry Fonda and Katharine Hepburn give brilliant Oscar winning performances as the aging Thayer couple, Norman and Ethel. Their relationship, the love, support, and comfortable banter, is so amazing on screen it is impossible to believe they aren't actually married in real life. Norman has become quite frail and has troubling health concerns, both physical (heart palpitations) and mental (some memory loss). Mind you, this film is all a bit depressing with Norman's anxieties about his mortality (no comforting faith mentioned here, unfortunately) and of course his aging. Ethel is jovially comforting, especially when he gets a little lost in the woods while they are out picking strawberries together. This scene is beautifully done by both spouses. He's a sympathetic but crotchety character to say the least, yet she always manages to deal with him affectionately.<br><br>Also, the relationship between Norman and the fiancé's young son... Although Billy has earlier been rather miffed at being stuck with these old folks for the summer, Norman develops quite a touching grandfatherly relationship with him, as the two go fishing together and so forth. <br><br>The only relationship that doesn't come off well here is the strained father / daughter one between Norman and Chelsea that presumably is meant to reflect the real life tensions between Henry and Jane Fonda. Frankly, Chelsea seems more like a self absorbed teenager or 20 something, trying to find herself. By age 40, she should have done so and become a genuine support to these elderly parents of hers. I really like Jane Fonda in some of her roles, but this particular character hasn't much depth and is little asset to the movie. Hopefully, at least making On Golden Pond together helped to mend any real life fences between the two Fondas.<br><br>In any case, the film examines skillfully the aging process from the very personal perspective of a loving couple going through it, and as such is a movie not to be missed.","user":"roghache","rank":[10,10]}]