[{"title":"A bit of a goof intended to be unpopular","rating":7,"date":"18 March 2013","review":"I agree that \"All These Women\" is misunderstood, especially if you look at it in the context of Bergman's filmography. He had just completed the \"Silence of God\" trilogy, one of the deepest, most serious works in the history of cinema. So, cut the man some slack and allow him his lark, his goof, his chance to riff on fans and critics and the illusion of the exalted artist (himself), before returning to his true work with his next film, the universally praised \"Persona.\" <br><br>I also think he was a little influenced by \"8 1/2\" which had come out the year before, appreciating Fellini's playfulness as well as his insight into the creative process and, of course, \"all these women.\" Bergman will always be thought of as a somewhat austere and oft despairing artist, but thankfully we have several films that belie that, like \"Smiles of a Summer Night,\" \"The Magician,\" and this little oddball gem.","user":"jimi99","rank":[16,19]},{"title":"Not as bad as I'd heard","rating":7,"date":"27 April 2014","review":"This comedy, most notable for being Bergman's first film in color, is often considered one of his worst. I went into it with very low expectations, glad that it was just 80 minutes long. Thankfully, it's not nearly as bad as its reputation. It's minor Bergman, for sure. It's main crime is that it thinks it's much funnier than it ever is. That can be annoying, but, really, the film isn't exactly unfunny. Personally, I think Bergman only did comedy right once, with Smiles of a Summer Night, and even that one I don't think is amongst his best work. Simply put, Bergman excels at tragedy, and his comedy can feel forced. This film revolves around an art critic (Jarl Kulle, Bergman's most mugging actor) who comes to write a biography of a famous cellist at his palatial estate. The cellist (whose face never appears on screen) is a philanderer, surrounding himself with women of various ages (including Bibi Andersson, Harriet Andersson and Eva Dahlbeck). Kulle starts a fling with Bibi Andersson, and soon discovers that one of the wives or mistresses is attempting to murder the cellist. The Bergman film this reminds me most of is The Devil's Eye, which also stars Kulle (if I recall correctly, that one is slightly less comic). The color cinematography is actually quite excellent. Bergman didn't film again in color until Cries and Whispers. This is available on Hulu Plus.","user":"zetes","rank":[12,14]},{"title":"All These Women Did Not Save It","rating":4,"date":"21 March 2006","review":"I never thought that I would have to say that but I did not like the Ingmar Bergman's film \"All These Women\". In spite the very pretty and delicate pink and blue cinematography and the presence of the charming and talented actresses, the movie was a mess of an attempt to create a comedy. Everything that was subtle, sensual, and charming in B/W \"Smiles of a Summer Night\" (1955) was missing here. First of all - the Jarl Kulle's performance as a music critic - biographer, Cornelius. Kulle was very effective and funny in \"Smiles...\", in \"Women...\" - he plays an irritating, annoying, and the worst - absolutely not funny (which is a crime for a comedy) character. If in \"Smiles... the writing was a first class and sparkled, I got the impression that in \"Women..\" Bergman did not care or did not want to work on the script and was more interested in experimenting with colors and music. The movie looks and sounds fine - it is Bergman, after all, but that's the only redeeming qualities that I found.<br><br>4/10","user":"Galina_movie_fan","rank":[24,38]}]