[{"title":"moving, excellent","rating":10,"date":"31 August 2005","review":"I'm probably in the minority here but i find this to be one of Allen's top ten masterpieces. Every scene works and the more you watch it, the more searing it becomes. No doubt you need to be in the right frame of mind to see it, but it's like a great night watching a play unfold. So many deep secrets, betrayals and unspoken feelings, finally, all coming to a head by the time the power comes back on after that thunderstorm. It feels way too real and may be why it makes most audience members uncomfortable. I liked this the first time I saw it and continue to hold it in high esteem years and almost 2 decades later. To preserve the great Elaine Stritch on film forever is enough to recommend it but the acting is painfully truthful to the point of awe. Woody's 3 dramas: this and Interiors and Another Woman form a great triangle. They should be looked at and admired now for the fine ensemble casting and the pinpoint writing. Whether they rip off Bergman or not, is rather pointless to argue. Each of them stand up as potent films on their own. Waterston and Wiest re-united on TV's Law And Order, and Stritch as well went on to win an Emmy on Law, so it shows how intuitive Allen was when it came to choosing great actors for his scripts. I found Farrow's character to be highly moving. Then again, I liked everything she and Allen did together. You became almost spoiled by the high quality. As a lifelong Allen viewer, I still think this is fine stuff and will stick by my high opinion every time I re-see it.","user":"Movie_Man 500","rank":[41,49]},{"title":"Hypnotic","rating":20,"date":"20 August 2003","review":"Wasn't in the mood to watch a film last night, but couldnt remember seeing Denholm Elliot in a Woody Allen movie before, so realised this was one I hadnt seen before.<br><br>Can't say as I was 'entertained' - but I was gripped and rooted to the sofa for the duration, which could say something about my sofa of course, but was really down to this film.  The dialogue and acting were both utterly convincing - and there were many moments of intense honesty.  Just for once, relationships don't resolve, nor are we rescued from darkness by gratuitous humour.  It's a stark, depressing beautifully acted piece of claustrophobic drama.  More your Webern 'five pieces', rather than your Strauss, 'Der RosenKavalier'.<br><br>If nothing else - it's nice to be reminded that not all scripts are written by a gang of 12 year olds....","user":"Edu-16","rank":[26,32]},{"title":"Unforgettable","rating":23,"date":"23 February 2005","review":"Between his serio-comic reminiscence Radio Days and the searing adult drama Another Woman, Woody Allen made September, a reflective, introspective chamber-piece on his favourite themes of childhood, adultery, love and loss. One imagines that the chilly critical and public response will shift to one of admiration and wonder as the years shift, such is the haunting power of this masterpiece.<br><br>Mia Farrow plays Lane, an unsuccessful photographer recovering from a breakdown in her autumnal apartment, the golds and rusts of the season chiming with the forlorn tone of the story. She falls in love with a visiting writer (Waterston), who appears to be drifting away from her, since he is besotted with Lane's sister Stephanie (Wiest). Barely taking an interest is the sisters' self-absorbed mother (Stritch) and her insecure third husband (Warden). Denholm Elliot rounds out the principal cast as a kind family friend, his love for Lane unspoken.<br><br>There are many great moments in this complex, brilliant film, but two in particular remain long in the mind. First is the \"love scene\" between Waterston and Wiest. Wiest says - torn - that to begin an affair would be \"impossible\" and exits. Then, slowly, she turns and walks back into the room, shutting the door. Wiest has never been better than in this film, than in this moment. A startling, beautifully realised epiphany, boiled down to a look, a bow and a smile. The second great sequence comes with the shattering denouement, which I shan't spoil for you here.<br><br>Allen's straight dramas certainly aren't for all tastes, but for those who can take them the rewards are vast. There has never been a screenwriter with a better ear for dialogue and in his \"serious\" films, Allen creates fascinating, utterly believable characters. The performances are pitch-perfect throughout, with Wiest, Farrow and Stritch all on career-best form. As always Allen's use of lighting and music is spot-on; here he showcases Art Tatum and Bernie Leighton, providing an evocative soundtrack to an unforgettable film.<br><br>Simply brilliant.","user":"rick_7","rank":[27,35]}]