[{"title":"If only more people had the guts to make films like this....","rating":8,"date":"8 October 2003","review":"I really wish that there were more movies like \"Henry\" out there. Most people still don't realize just HOW controversial this film was when it was made. The MPAA wouldn't touch it with a ten foot pole. McNaughton fought for 4 years to get an R rating, but no dice. And since he didn't want the X, and there was no NC-17 rating at the time, it was finally released, with no rating, in 1990. And why? I've seen films with MORE violence in them...Romero's \"Day of the Dead\" leaps to mind. But it's not the violence in this film that makes it so disturbing. It's the way the material is handled. And this is what the film's detractors obviously can't appreciate.<br><br>\"Henry\" doesn't bother with any type of morality...it neither glorifies nor denounces Henry's actions. It simply observes. It places those actions before us and says \"there it is...you deal with it...you sort it out.\" People who don't like this film often say that there's \"no character development...no discernible plot line...etc., etc.\" Those people should stop throwing around film school terms. This is one movie that doesn't present events in a \"movie reality\"...it shows us things as they are in the real world. Character development means showing you enough of the characters in 90-120 minutes to make you feel as if you've known them forever. How often do you spend 90 minutes with a real person and know that much about them...or feel that you can seriously identify with them? It's just a conceit of film-making. Same with plot lines. Does life have a plot line? Not at all. Life is an endless succession of things happening. Some seem important and/or entertaining...some don't. \"Henry,\" in its attempt to realistically portray the life of a serial killer, does not need a plot line...in fact, it benefits from having only a very loose plot line. Much like a homicidal version of \"The Catcher in the Rye,\" this film seems much like a lot of things that happened, as opposed to a carefully constructed fictitious story...which make it seems all the more real...and all the more disturbing.<br><br>\"Henry\" is disturbing on many levels. Firstly, it feels very real. Too real, perhaps. Nothing is slicked up...nothing seems counterfeit or contrived. The entire thing is so utterly plausible that it chills you to the bone. Secondly, the complete lack of police involvement is equally disturbing. The only time you see a police car in this film, it's driving past in the background as Henry is cruising the streets. It drives past...and that's it. And Henry isn't scared...nor is he even aware, apparently. He has nothing to hide. He knows the police won't connect his crimes to one another...and they certainly won't connect them to him. So what has he to fear?<br><br>And finally, the setting of Chicago makes the film more disturbing for me, as I'm somewhat familiar with that city and can spot some locales in the film that I recognize. In fact, a friend of mine who lives in Chicago told me that the first time he watched \"Henry,\" he and a friend rented it and sat down in his friend's apartment to watch it. It was about halfway through that they realized that the apartment they were sitting in was the same one used as Henry's apartment in the film. All I can say is...I'd never use that bath tub again.<br><br>All in all, I truly wish that more directors had the guts to make films like \"Henry.\" Honestly, I can't think of one film that's comparable. There simply aren't any films out there that are anything like this. This is truly one of the most disturbing films I've ever seen. After seeing \"Happiness,\" I guess that \"Henry\" probably got knocked down to Number Two on that list. But \"Second Most Disturbing Film Of All-Time\" is still a damn fine achievement, in my opinion.<br><br>If you want to see an accurate and appallingly realistic portrayal of what the life of a serial killer must be like, definitely give \"Henry\" a viewing. Make up your own mind from there.<br><br>Oh, and a final note...one reviewer stated concretely that his biggest problem with the film was that \"serial killers work alone.\" This is, of course, not always the case. The real life counterparts to Henry and Otis (Henry Lee Lucas and Ottis Toole) DID kill together, as did Bianchi and Buono, the infamous Hillside Stranglers. Those are not the only such instances...but they're certainly the best-known. Therefore, the overly broad generalization that serial killers \"work alone\" is no real attack on the realism of this film.","user":"james_oblivion","rank":[169,197]},{"title":"Harrowing and real.","rating":7,"date":"1 January 2004","review":"The real Henry Lee Lucas had one of the worst childhoods that I have ever had the misfortune of reading about. Growing up in Texas, he lived with a family that was totally dysfunctional. He grew up in a shack, that had nothing more than a dirt floor. The father being a legless alcoholic, literally as well as figuratively. The mother worked as a prostitute. Henry was also forced into sexual activity with her clients. They forced him to dress as a girl and then would proceed to have sex with him. He was a child that grew up being raped. <br><br> He then grew up with such an intense rage that he became a serial killer. Are we surprised? Now, I am not trying to justify his behaviour. Rather, I am pointing out the fact that these people do not just fall out of the sky. There is no such thing as an inexplicable evil. That is, the person is just evil because they are. Yes, there seems to be some genetic evidence  for psychopaths. However the majority do not become killers. The ones who become killers are made. If you are truly interested in what makes a psychopath, I suggest you read, 'Not Guilty by reason of Insanity ' by Dorothy Otnow Lewis. Serial killers are often portrayed as being like Hannibal Lecter. Smart and talented creatures that have suddenly lost their moral code. The truth is most are a psychological mess. Losers that are full of conflicting emotions. There is also strong evidence to suggest that these people are made by a specific form of brain damage. Basically when you combine trauma in childhood and frontal lobe brain damage, you end up with Henry. <br><br>\n This movie is what happens when people are treated in an utterly horrific way. Michael Rooker is excellent as a psychopath who seems normal but deep down harbours a psychotic rage against society. He and Otis travel around killing. Why? Why not? The pointlessness of their lives is perfectly captured. People complain about the lack of plot. I think it perfectly captures the plot. It shows the emptiness of these characters. In fact Henry and Otis feel nothing unless they are killing. The emotional side of the characters has been like killed off by previous abuses against them. They are not unlike the living dead. Even when Otis's sister shows some affection towards Henry he cannot reciprocate. He can't relate to people, he can only get off on torture and death. Yeah, this is shocking. But it is also incredibly sad. <br><br> Here in New Zealand there are many shocking drunk driving ads that they play to try and get people to stop this behaviour. I feel that this movie is like that. The movie is an ad for psychopaths, who they are and the dysfunctional psychological world that they inhabit. It is a film that honestly looks at these kinds of people. This certainly does not glorify these people, which is a criticism that has been levelled at the 'Silence of the Lambs' series. This is why I think it shocks people. The serial killer kills for visceral, physical pleasure. As Ted Bundy stated, 'I killed because I wanted to.' Maybe, this is where the film falls down. That the characters motivations are not explained well enough. But either way the viewer is given a shockingly realistic interpretation of a serial killers world.<br><br> Obviously this is a film that was made on a budget! But this just adds to the bleakness. In fact Chicago looks dirty, grimy and not like somewhere that you would visit. The performances of the rest of the cast are pretty average if not bad. So the film has some definite flaws. The exploitation factor is there. But then I think of films like Baise Moi and this film has nothing on that! <br><br> Overall I think this is an objective look at a world that those of us who come from normal backgrounds will find horrific. A world that we prefer would never exist, but however does exist. Maybe one day, as our society matures these people will cease to exist. Stories like these will become completely fictional. I really hope for that day. 7 out of 10.","user":"Skeptic459","rank":[85,100]},{"title":"A Movie To Keep You Up At Night...","rating":10,"date":"4 December 2008","review":"When I had the chance to see HENRY 2, I wasn't really sure if I had seen the first one, because so much time has passed since its release and the commotion it caused back in '86. Now having had the chance to see the 20th Anniversary Edition from Dark Sky Films, I'm not so sure that I didn't remember it, as much as I didn't WANT to remember...<br><br>John McNaughton presented the indie world with his calling card via this film, and simultaneously raised the bar for what \"realism\" is in these kinds of horror movies. And where the true horror lies is the way in which it deconstructs and de-glamorizes the image that Hollywood has created for serial killers. This is not a chronicle of a super-intelligent monster like Hannibal Lecter, or even the \"channeled\" virtuosity of a \"noble\" murderer like Dexter Morgan. <br><br>This could be anybody you walked past down the street yesterday, or saw at the stop light on the way home from work. And make no mistake about it...he works at a job, pays rent and buys groceries like anybody else. And if you happen to catch yourself alone with him at the wrong time, the next time anyone will ever see you again is at the morgue. Count on it.<br><br>Based loosely on the exploits of multiple murderer Henry Lee Lucas, HENRY was the breakout role for Michael Rooker (SLITHER), and together with co-stars Tom Towles as his dim-witted sidekick, Otis and Tracy Arnold as Otis' emotionally blasted sister, Becky, they paint a documentary-style picture under McNaughton's guidance, of how some people living on the fringes of society behave. This doesn't necessarily mean that they're wild-eyed, foaming-at-the-mouth-crazy, and therein lies the scariest part of all. These are the kind of blue-collar, salt-of-the-earth types that you might dismiss without giving a second thought...but the time might come when you do so at your own peril.<br><br>From the opening frames of the movie, you know you're in territory that's far removed from the usual slasher film. Henry is seen doing mundane, everyday things - buying cigarettes, finishing lunch at a local diner - and juxtaposed with those scenes are absolutely horrific shots of dead, mutilated bodies, as the sounds of how they died careen and crash underneath the discordant music along the soundtrack. Sorry, kids, but this isn't THE Texas CHAINSAW MASSACRE. In that picture, as within this one, a time and place is firmly established. But if you don't live in Texas, part of you can sort of remove yourself from the horror that wants to seep into your subconscious and stay there.<br><br>With HENRY, it becomes obvious that the locale is somewhere in metropolitan Chicago, but the urban landscape is familiar enough that it could be Atlanta, Detroit, Boston, New York, anywhere. It could be the city where YOU live now.<br><br>And by writing the characters and the events they're involved in with a totally detached, non-judgmental eye, McNaughton and writing partner Richard Fire reveal a horror more numbing and penetrating than a thousand Freddy Kruegers or Michael Myers. There are people in the world who actually do these kinds of things, and they're out there NOW...and it's only by the grace of providence or some cosmic lottery that we've won, that we don't ever run into these people...or that some of us unfortunately do.<br><br>Enough has already been written about the remarkable performances of all the actors involved, so the only thing I can add is that if you've never seen HENRY, you need to watch it all the way through at least once. I can safely say that you will see why horror is the way it is today, and how so many filmmakers have misinterpreted what director McNaughton was saying with HENRY.<br><br>With the searing images still fresh in my mind, I can only say this...I feel like I need to take about a hundred hot showers, and none of it will ever wash away how nasty and horrible it made me feel. Which I believe is exactly what the makers of this film were trying to accomplish.<br><br>I sincerely hope that once you've seen this, you would feel the same. And I would be really worried about anybody who doesn't, or worse, who said they \"enjoyed\" it.","user":"cchase","rank":[28,31]}]