[{"title":"Quite a decent murder mystery, if dated...","rating":6,"date":"8 July 2012","review":"The main reason to watch this movie now, for me - and I guess most - is for John Mills, as the firm but fair Scotland Yard Inspector Detective, who has to solve a couple of murders of young women in a sleepy Home Counties town in England.<br><br>It's all about the rather sermonising 1950's \"respectable\" folk who wag their fingers at a local beauty - a Marilyn Monroe (sort of) lookalike who carries on with married men and flaunts her curvy figure at the local snobbish Sports Club, the elitism of which extends beyond their usual, especially as the membership secretary is a fan of hers....<br><br>One night, she is strangled and of course, a whole array of the obvious candidates spring up, some red herrings and some real. Charles Coburn as a disgraced GP and Derek Farr who has more business fingers in more pies than are reasonable are two of the more recognisable stars that come under the Inspector's radar.<br><br>The film is well enough made, the story complex enough to satisfy the average amateur sleuth and John Mills is sturdy, even if his 'romance' with one of the deceased young friends is both awkward and frankly, ridiculous. There's also a pretty meaty and suspenseful ending, that Hitchcock himself might have come up with.","user":"tim-764-291856","rank":[15,15]},{"title":"Neat thriller","rating":28,"date":"28 August 2003","review":"The calm of prosperous Oakley Park is shattered when a local woman is found murdered. A Scotland Yard detective is called in to solve the case. He unmasks the murderer but not before another woman is killed.<br><br>\nThis picture contains some of the stock characters we see in many thrillers; the woman killed just because she is sexually attractive, the detective who gets results by breaking the rules and a community of outwardly respectable people who all have their dirty little secrets. These elements could have resulted in a predictable formulaic thriller but \"Town on Trial\" is lifted onto a higher class by the writing, direction and acting.<br><br>The acting is consistently good from the bit part players up to the stars. The two outstanding performances are given by Alec McCowen as a suspect and John Mills as the detective.<br><br>I would recommend this film to any viewer.","user":"DFS500","rank":[15,17]},{"title":"A competent, reasonably entertaining but ultimately unmemorable thriller","rating":6,"date":"28 April 2012","review":"\"Town on Trial\" is the kind of film that is simply not made these days. I imagine it is the sort of thing that formed part of the staple repertoire of B-movies that were shown in cinemas in the days when filmgoers were treated to an appetiser before the main feature was aired. Such films were usually unpretentious, workmanlike dramas that provided solid but unmemorable entertainment to get patrons in the mood for the (hopefully) more sophisticated fare that was to follow. \"Town on Trial\" is a good example of that kind of film. <br><br>The plot concerns the investigation into the murder of a femme fatale in the commuter-belt town of Oakley Park in what I assume is meant to be southern England of the 1950s. The investigation is undertaken by Superintendent Halloran (John Mills), who becomes romantically involved with the niece of the town's GP. A further murder takes place before Superintendent Halloran solves the case. <br><br>Any critical analysis of a film such as this is largely superfluous. \"Town on Trial\" knows exactly what it is doing - and delivers a solidly entertaining mystery that has the air of an early forerunner of an episode of the current British TV series \"Midsomer Murders\". The cast includes an impressive array of well-known British character actors of the time, such as Raymond Huntley, Derek Farr, Fay Compton, Harry Fowler, Geoffrey Keen, Margaretta Scott and the wonderfully-named Totti Truman Taylor. It is competently directed and scripted and, while it will not live long in the memory, provides 90 minutes or so of undemanding entertainment. 6/10.","user":"roger-pettit1","rank":[14,16]}]