[{"title":"Intelligent, Groundbreaking Film","rating":8,"date":"20 March 2005","review":"After watching this film on television a couple weeks ago (TMC is the best), I was surprised how obscure 'No Way Out' really is. However, I wasn't exactly surprised.<br><br>The film follows Dr. Brooks (Sidney Poitier), an ER doctor whose first real-world experience is as intern in the prison ward of a New York hospital. While on duty, the brothers Biddle (the older of which is played by Richard Widmark), come in following a confrontation with the police. Both suffer from superficial injuries, but the younger brother's health is declining rapidly due to what Brooks diagnoses as a brain tumor. The kid dies while Brooks is operating, feet away from his brother. The racist Ray Biddle soon accuses Brooks of murder, but won't allow an autopsy to be conducted on his brother to determine the cause of death.<br><br>Poitier turns in a great performance as the hard-working young doctor, who is debased by the hollow accusations of a bigot. They dig at his core and bring up insecurities that would be common to anyone in the medical field, but are aggravated by the pure hatred of Widmark's equally well-played character.<br><br>While the script borders on stereotypes at times, you have to remember that these stereotypes were very real during the time it was written. The writer does a fantastic job of adding depth, personality, beyond the paper figures. Brooks is a practical man, who supports his family and tries to not let the circumstances bring him down. Behind the veneer of hatred, Biddle is a deeply insecure and misguided man who has let circumstance blacken his core. Mankiewicz and Samuels do an amazing job at bringing life to a situation that was taboo for the time.<br><br>Aside from the competent acting and well-executed script, the film featured a moving and well-choreographed race riot that fully captures the raw hatred that can surface between groups of people who face the same everyday problems and circumstances, but are torn by one difference (color, or creed, or religion).<br><br>This is definitely a film well worth seeing. For its time, the movie was groundbreaking for its portrayal of both racists and their victims. While today the movie may seem tame, it undoubtedly struck some sensitive nerves during its release. The film deserves to be more widely known, if only for its content.","user":"dragoneyez01","rank":[59,62]},{"title":"Solid entertainment. Can't wait for the DVD!","rating":7,"date":"28 October 2005","review":"I heard a rumor that this was coming out on DVD in 2006. I hope it's true because this is a fascinating film. Actually, \"shocking\" might be a better word.<br><br>Bigotry is the main theme and there is no beating around the bush here. The \"n- word\" is used at least 20 times in this film in one form or another which is shocking to hear in a classic film. Richard Widmark plays the main bigot and he is fascinating to watch. Few people in his day could play the wild-eyed fanatical villain as well as he could (see \"Kiss Of Death\" for the best example).<br><br>This was Sidney Poiteir's screen debut and he looks about 16 years old! He looks too young to be a doctor even if he is portrayed as someone in their first year of practice. Anyway, with Widmark and Poitier, and a fine supporting cast with some famous names, you have a very, very interesting movie that is long overdue to be made available to the public.<br><br>To the film's credit, this shows bigotry on both sides: black and white, although it concentrates more on white against black. Linda Darnell plays perhaps the most interesting role because she is the one person who switches back and forth, unable most of the time to figure out what side to take! For those who remember the Naked City TV series, it's also fun to see Harry Bellaver in here, playing Widmark's deaf-mute brother.<br><br>This movie could easily be very dated.....but it isn't.","user":"ccthemovieman-1","rank":[46,51]},{"title":"Wow, what a knockout","rating":4,"date":"4 March 2005","review":"This film really surprised me, as I wasn't expecting something so raw and tense from 1950. The leads are excellent - nobody chews the scenery, as would be expected. Darnell is particularly effective. Honestly, being the cynical person I am, I never would have expected such an excellent film.<br><br>How this made it past the Code, I'll never know. The language and drama are intense. 1950?????? Amazing. What a pleasure to see Ossie in an early role...he's already missed.<br><br>Frankly, I rarely recommend a film. What a great experience....check this flick out.","user":"Ripshin","rank":[38,44]}]