[{"title":"An okay film , but nothing special.","rating":4,"date":"8 March 2006","review":"MAY CONTAIN SPOILERS<br><br>This movie is by no means an excellent film. It's about a young girl and her father (Drew Barrymore, Matt Frewer) traveling through the American desert. Like a lot of horror/thrillers have done before, their car runs out of gas in the middle of a trailer park. There, Barrymore and Frewer rent a ramshackle camper to stay in until they find some gas. Unforatnatly for them, a killer is on the loose, who seems to be obsessed with Barrymore.In the midst of these murders, Barrymore meets and falls a handsome and mysterious young man named Jimmy (Andreas Jones) and befriends a young geeky kid named Pinky (Anthony Rapp). Soon after she discovers than one of the boys may be the demented killer.<br><br>I watched this movie awhile back on cable, mainly because there was nothing better to watch. Although it was interesting and fun, it just lacks something that would make it a classic. Drew Barrymore, as always, shines in this movie as the film's heroine and Andreas Jones is perfect as the charming yet creepy young man who catches the eye of young Barrymore. I recommend it for someone who is a Drew fan or a fan of cheap horror films. Other than that, don't expect much.","user":"SnipChop87","rank":[9,9]},{"title":"Not just porn for the boys!","rating":2,"date":"2 January 2002","review":"Admittedly, this film did not deserve a place in the Oscars, but for an average thriller it is watchable.<br><br>Pic centres on a young girl just entering adolescence and interested in what every teenage girl is interested in - boys!  It is her naivety and inexperience which lands her in trouble.  Barrymore is generally good as the confused and lonely angst-ridden teenager, and is sometimes quite realistic in her scenes with Matt Frewer.  As a teenager when I saw this a few years ago, I certainly could relate to her and her ineptitude with boys, but now it's just another coming-of-age film with a weak murder plot.  Jones was convincing as the ice-cold lust figure for Barrymore, but we never saw enough of him and his character was too rigid.  Girls will like him - especially in a wet T-Shirt (Barrymore isn't the only one!)<br><br>Nevertheless, some good acting and not a bad film overall, particularly from the women like Susan Tyrrell and Karen Austin, who seem to hold it together better than the men!","user":"AnneSLReid","rank":[16,18]},{"title":"decent low budget thriller","rating":28,"date":"28 November 1999","review":"Im only one year younger than Drew Barrymore and if teenage boys are anything like I was a few years ago then she will certainly catch eyes with this flick.  Though only 14 here, she sports the body of a 20 year old, which is clearly visible in her bathing suit and wet t-shirt scenes, but there is a plot here, too.  Shes traveling with her dad through an extremely baron portion of Arizona with no gas left.  They stop in some crapola trailer park and take a rental from the trashy Tyrell, in a perfectly grungy performance.  Some mini mart dudes been killed, and during the next day and night we get POV (point of view) shots of the killer as he offs residents of the small area.  We get some decent mystery of who it might be, though some may solve it quicker than others.  The cast is also suprisingly good for a low grade pic, with Drew, Frewer, Tilly, and Masur. Rapp is thrown in as a nerdy crush, with Jones the bad boy who lusts for Drew.  And some great middle of nowhere atmosphere, as the desolation is nicely photographed. Dust swirls and tons of empty surrounding land are a good touch.  But mostly on display here is Drew,  and those of the male persuasion shouldnt be disappointed.","user":"mcfly-31","rank":[13,16]}]