[{"title":"An Interesting Offering","rating":7,"date":"7 November 2002","review":"The cast alone makes this film worth viewing at least once. It is always pleasing to see distinguished veteran prayers get together for an effort such as this one. In this sense it reminds me of 1982's House of the Long Shadows. Douglas Fairbanks, Jr., Melvyn Douglas, John Houseman and Fred Astaire are the aforementioned players and Craig Wasson, Alice Krige and Patricia Neal are among others in a first rate cast. \tTaken from a novel by Peter Straub, Ghost Story suffers the fate that many ghost stories put to film do in that it has lost much of the mood and nuance of the written word. Still, Ghost Story is a fine film and very enjoyable if you remember that it is not a masterpiece and do not expect more than it can deliver. \tFour elderly gentleman, the entire membership of the Chowder Society, get together periodically to share ghost stories. It is indicated early on that these gents have been doing this for a long time and quickly we learn there is a sinister reason why. We do not learn until well into the film what that reason is, and the leading up to it is the meat of the story. Set against a wonderfully atmospheric New England backdrop, it is revealed too late for the distinguished membership of the Chowder Society the four had accidentally murdered a young girl they were all smitten with 50 years earlier. The girl, brilliantly played by the enigmatic Alice Krige, has come back in the form of a ghost to exact terrible revenge. Ghost Story ends with several of the Chowder Society members dead and the secret of her death revealed.<br><br>\tIt is a pity that this film cannot be viewed as Straub wrote the story, but that is the chance one takes when producing a ghost film, the main reason why there are precious few truly good ones. Ms. Krige, more than any woman I have ever seen on screen or indeed, known personally, combines an earthiness and elegance in her being that is fascinating. It is she that establishes the mood of this film and that is saying a lot, considering who she was cast against. \tGhost Story is almost biblical in it's vengeance to the second generation, Craig Wasson as the son of one of the society members. It is interesting to note the presence of Melvyn Douglas, who starred in horror films such as The Old Dark House and The Vampire Bat in the early 1930's and in 1979's The Changeling in addition to Ghost Story. What a way to bookend a rich career! We didn't get to see enough of Doug Fairbanks, as his character died early, and John Houseman added his usual solid performance. Fred Astaire had the most screen time and his character added much needed touches of light comic relief. Patricia Neal as his wife had little screen time. It was Ms. Krige who carried the film and if you are not familiar with her or her body of work, you should be. She is unique and vastly underrated.<br><br>\tCatch this one on video late on a cold, snowy night, best with a tumbler of brandy in hand. Expect an interesting if not great film and savor the screen presence of the performers. When a group such as this comes together for any kind of film, it is worth viewing at least once. Ms. Krige makes many of the scenes truly frightening, but mainly Ghost Story is to be appreciated for what is, a tribute and last hurrah for several screen legends.","user":"Tommy-5","rank":[34,36]},{"title":"Classic, genuine and spooky with a top-notch cast","rating":23,"date":"23 October 2011","review":"I will take you places you've never been. I will show you things that you have never seen and I will see the life run out of you. ~ Eva, in the film Ghost Story<br><br>The movie centers on a group of elderly men who have formed an exclusive story-telling group called The Chowder Society. The men meet regularly, sit around a fire in a dark room and share their best ghost stories. Under the surface, however, lies a ghastly secret they all share - a real life, true ghost story of their own that they dare not speak of.<br><br>When one of The Chowder Society member's twin sons dies in a very strange and inexplicable accident, the other twin returns home to mourn with his father. That is when a series of horrifying events begin to unfold, forcing the men of the Chowder Society to come to terms with the shocking and dreadful event that has haunted them for the past 50 years.<br><br>I personally love these types of stories. They do not feature masked- maniacs hunting down unsuspecting teenagers and hacking them to death. (Although there are a few good ones in that category!) What this story does provide is a genuine chill-running-down-your-spine sensation that brings you to a terrifying place without ever forcing you to close your eyes. <br><br>A star-studded cast includes Fred Astaire, Melvyn Douglas, Douglas Fairbanks, Jr., John Houseman and Patricia Neal, Jacqueline Brookes, Craig Wasson and Alice Krige. Having a cast with such experienced and talented actors creates a believable and authentic film making it a worthwhile, scary little gem of a movie.<br><br>If you like genuine ghost stories, watch this movie. Based on the novel by the gifted Peter Straub and skillfully directed by John Irvin, this film is a top pick for me.","user":"lizberrywagner","rank":[19,20]},{"title":"I Wanted to Know What They Did","rating":8,"date":"19 April 2006","review":"I read Peter Straub's book and was quite pleased with the result of the movie. First of all, like many, I loved the cast. They are all great men of the world cinema and the pull off the story with great aplomb. The movie is about something someone does in his or her youth and then must live with forever. In a good ghost story, the characters get no points for being once youthful and reckless. The fact that they meet and share their stories means that they never seem to intend closure. They never allow themselves to face the music and, hence, the revenge of the spirit is acceptable in the world where they find themselves. I just thought that a society devoted to the telling of ghost stories was a great idea. Anyway, while the plot does wander around a bit and it takes time to get to the point, it still works great. It was nice to see that Fred Astaire could still act (because he was such a great dancer we forget that he had a great comic talent and, in this case, a dramatic talent). The others are equally formidable. There are also some pretty slimy, putrid visions that appear and make for a pretty good rank on the jump scale. The actually scene that explains everything (I won't spoil it) is both sad and revealing. While not the greatest movie, it works very well and I would recommend it.","user":"Hitchcoc","rank":[45,52]}]