[{"title":"Ken Russell's Brilliant and Irreverent Valentino Bio.","rating":9,"date":"26 July 2007","review":"As in all of his biography films Ken Russell takes no prisoners. A series of warped biographies on composers (Mahler, Tchaikovsky, List)incensed more than entertained audiences and critics. Laced with dark humor, vibrant costuming and Russell's sardonic use of the composers works in conjunction with his colorful and outlandish compositions the films were visual feasts that bordered on character assassination. <br><br>In Valentino, Russell comes to America to offer his take on silent Hollywood and its biggest star of the era, Rudolph Valentino. Russell is relentless in his depiction of the exploitative and greedy nature of producers who in the opening scene stand over Valentino's body lamenting financial loss. Russell also works over newspaper reporters, actresses, Valentino's ex-wives and a comedian known as Fatty (Arbuckle?). Dancer, Rudolph Nureyev is no actor but as Valentino his poorly pronounced flatly emoted English fits and contributes to his sympathetic character. <br><br>As in all Russell films there are scenes that are lush and grandly staged (ably assisted by ex-wife, Shirley Russell's original and over the top costuming) such as Leslie Caron's entrance at the funeral home, the fight sequence where ball room dancing takes place in between rounds, the producer with the pet gorilla in his living room, and a cult fan gathering outside Valentino's mansion. <br><br>This film quickly sank from sight when it was released and thirty years later consensus remains the same. I personally believe however that Valentino is a sharply drawn dark humored satire that spits cynicism at two institutions (Hollywood and the media) that it depended heavily on for its success. Valentino succeeds on every level and that was probably its problem.","user":"st-shot","rank":[22,26]},{"title":"I am mesmerized by this film","rating":19,"date":"19 November 2003","review":"First saw it on HBO (many times) about 1980. Just love the Ken Russell 'exaggerated' feel and look. Made me look into the life of Valentino, where I was disappointed to find that Ken Russell had really 'exaggerated' Rudy's life. I didn't see it again until 1998 on a trip to Canada, in a somewhat edited version. I just watched it on the True Stories channel, I fell in love with it again. Ken Russell's version of the cause of Rudy's death is much more interesting than the actual cause of Valentino's death. I taped it and expect to watch it a few more times.","user":"goomba8","rank":[21,25]},{"title":"Grotesque yet fun...","rating":5,"date":"22 October 2005","review":"Who knows if any of this is true, but director Ken Russell's take on the life of Rudolph Valentino is a lot of fun. Opening at Valentino's infamously raucous funeral, the film is told in flashbacks by various people who knew him. That's where any similarity to CITIZEN KANE ends. Russell is a master of opulence and it's clear that no money was spared. The sets and costumes are spectacular, but they're nearly overshadowed by Russell's casting choices. Michelle Phillips plays Valentino's wife Natasha, Leslie Caron is the great Nazimova and one time Dead End kid Huntz Hall is Paramount chief Jesse Lasky. Bizarre casting to be sure, but all three are surprisingly good. Caron in particular seems to be having a really good time. In hindsight, the casting of Rudolf Nureyev as the world's \"greatest lover\" seems ironic, but he isn't bad. It is too bad he has to speak. There are times he's incomprehensible. The direction is fairly straightforward, although Caron's funeral scene entrance and Valentino's jail house encounter are vintage Russell --- they're nearly operatic. Carol Kane and Seymour Cassel are in it too.","user":"JasparLamarCrabb","rank":[19,24]}]