[{"title":"Fun, Different Horror Film","rating":6,"date":"14 May 2006","review":"Definitely not the typical slasher fare you might expect from the 1980s, April Fool's Day takes the ordinary slasher formula and spices it up - and in the process makes a much more palatable film than most of the films it initially imitates. A group of nubile teens(OK, not so different to begin with)go to their friend's remote island home somewhere in the Northwest. Here, they laugh, have sex, joke around because it is April Fool's Day, and, oh by the way did I mention, have sex. Although this part of the movie is pretty typical, it is well-shot compared to other films of its ilk and we do get some character development(not a lot) but some. Soon, people begin to die and things get serious. For a slasher film, this movie is very well-paced and, more importantly, is not over-the-top in blood and guts. The acting is uniformly average(something a Friday the 13th films craves!). What really takes this film beyond the mundane; however, is the stylish twist at the film's end. This, almost all by itself, allows this film to rise in the ranks. The ending is deftly done and does not look foolish or silly or forced; all of these things could have easily happened. So if you are up for some slasher fun, want to see some nice looking girls(Deborah Foreman and Deborah Goodrich), and are intrigued by a creative ending - April Fool's Day is for you!","user":"BaronBl00d","rank":[21,24]},{"title":"Well constructed mystery, fun and memorable","rating":9,"date":"14 November 2001","review":"April Fool's Day has just the right smarts about it that it holds up extremely well, even all these years later.  While the cast may be youthful, the characters and story set this film way above \"teen\" slasher or horror flicks.  Mainly, because this is really a mystery in the vein of Ten Little Indians.<br><br> It's a good thing I saw this film in a theatre when it was first released in 1986 -- because the VHS cover has something on it that would have kept me AWAY if I had not seen the film already: \"It's just what you'd expect from the producer who brought you Friday the 13th -- Parts Two, Three, Four, and Five.\"  You just can't put April Fool's Day in the same category as those films! This is far superior in story and intelligence.  It's clever, well-written, and has great characters that you like even if they are not so nice!  These days it seems it's more important to find the most popular actors, and that is usually distracting and doesn't guarantee a good  film. April Fool's Day had lesser known stars for that time (Deborah Foreman, Amy Steel, Clayton Rohner, Griffin O'Neal) and that worked as an advantage.<br><br> The basic premise of a group of college students stuck on an island in a big house and one by one they disappear, yes, it's been done in many variations before.  But the clever execution of the story, red herrings, and the underrated Deborah Foreman's delightful portrayal of Muffy/Buffy all make for a really fun viewing experience. Foreman has just the right amount of sweetness and can go right into being just plain quirky with such ease. The touch of having dolls on the dinner table, sort of like name tags, will bring a giggle and a smile for sure!<br><br> One plus for this film is the fact that it didn't sink into the tiring T &amp; A route.  Sure, a few of the characters have sex on the brain but their actions and dialogue never really wander off into the gratuitous area. Guys, if you really want lots of breasts than just go ahead and get some porn or a Playboy video, okay?  Let the rest of us enjoy a good story once in a while!<br><br> After the body count rises and things escalate into a tense and frenzied chase through the house, you'll be surprised at what happens next.  April Fool's Day is one of the few films of this kind that actually had a very surprising reveal and I was even caught off guard, left with my jaw agape at what the whole deal was about. The BIG surprise just happens so...abruptly, that you feel just like the character that runs into the room -- just stuck for a second! After about 90 minutes of mystery, the payoff BETTER be good, and sure enough,  this one doesn't disappoint! I'm especially thrilled to have picked up the eerie soundtrack by Charles Bernstein on vinyl when it first came out, and to this day love to give it a spin on the turntable.<br><br> Paramount has a vast library of films that just NEED to be given great treatment on DVD, and I'm crossing my fingers that films like April Fool's Day, Let's Scare Jessica To Death, and Polanski's film The Tenant will be given their glory.  &gt;","user":"hippiedj","rank":[39,49]},{"title":"The underdog of 80s slasher films","rating":9,"date":"24 August 2000","review":"APRIL FOOL'S DAY has just recently gotten a sort of cult status among horror film fans. Casual horror viewers or those who are diehard gore hounds haven't been kind to this film, but it is quite possibly the most intelligent, best-acted, and coolest of all the 80s slasher films.<br><br>A group of college friends venture to the island home of one of their classmates for the weekend and wind up being killed by an unknown assailant, believed to be the victim of a cruel practical joke played by one of the students. Amy Steel (my fave from FRIDAY THE 13TH PART 2) is Kit, the \"last girl\", and Ken Olandt is her boyfriend Rob. They are both very good and are believable, likable characters that the audience can root for. Other notable performances include Griffin O'Neal (son of Ryan), Thomas F. Wilson (Biff from BACK TO THE FUTURE), Deborah Foreman, who is very good in dual roles, Leah Pinsent (the classic good girl), Deborah Goodrich (too cool as the slut), and Clayton Rohner (the typical horny guy). I can't think of a bad thing to say about this movie except that some viewers will feel cheated by the two surprise endings, like I did at first. But appreciate the fact that they are totally unexpected and work better than any other ending thought up for the film.<br><br>APRIL FOOL'S DAY is strongly recommended to serious horror film fans and even casual viewers. Not very gory, but that's a plus in this case. Notice the similarities to Agatha Christie's \"Ten Little Indians\", of which this is sort of a modern updating. A whole lots of fun and the best damn slasher film of the 80s.","user":"Casey-52","rank":[41,52]}]