[{"title":"A Science Fiction Masterpiece","rating":10,"date":"5 November 2010","review":"In the year 1968, two movies came out that changed modern day science-fiction films forever, 2001 A Space Odyssey was the most famous out of the two, but Planet of the Apes stands on its own ground and became a classic that it is universally acclaimed to be. Planet of the Apes is still way better than all of the sequels and remakes that has even been made.<br><br>I remember the first time, I watched Planet of the Apes. I was a major Sci-Fi geek who loved Star Wars and Blade Runner. I was sitting down on the couch with my nerdy glasses, watching T.V. When all of a sudden the movie started, my friends told me the movie was very cheesy and lame. So I had extremely low expectations, but I told, whatever, I'll give it a try. After the film finished, I was completely flabbergasted and amazed to have seen this work of art. The visuals were great and the movie was extremely entertaining. But that's not the main reason I loved the film so much. It raises a lot of questions about our modern day society without letting social commentaries get in the way of the drama and action.<br><br>The movie is easily one of the top ten best Sci-Fi films ever created, it stands high up with Star Wars, 2001 A Space Odyssey and The Day the Earth Stood Still. If you're a Sci-Fi, this movie is highly recommended because it deals with philosophical and sociological questions and its a must have.<br><br>10/10 for this Masterpiece.","user":"Loving_Silence","rank":[253,266]},{"title":"A Landmark SF film","rating":10,"date":"31 October 2002","review":"1968s PLANET OF THE APES has been my favorite film since I first saw it in April of that year when I was eight years old.  The movie had a huge impact back then and I cannot emphasize more the power to grip the imagination it had -- and has -- and the shock the final image of the movie was back then. I literally left the theatre stunned and speechless.  No other movie of my youth had such impact, or created such suspension of disbelief.  Over the past thirty-four years PLANET OF THE APES has attained classic status and it's a tribute to the film's excellence that there are so many comments left here on the Internet Movie Database that this film is better than the viewer thought it would be, or that it wasn't campy or cheesy as they'd always thought, or that it was more intelligent and thought-provoking than most films they've ever seen, and that despite the studio stupidly putting the final shot -- one of the most famous last shots in the history of American cinema -- on the cover of the video, they were still stunned and haunted by it.<br><br>PLANET OF THE APES is based on a 1963 French novel, \"La planete des singes,\" by Pierre Boulle, most famous as the author of \"La pont de la riviere Kwai\" (1952), which became the 1957 film THE BRIDGE ON THE RIVER KWAI.  The story tells of a French journalist, Ulysse Merou, who, in the year 2500 travels with two companions in a near-light speed spacecraft to the red-giant star Betelgeuse in the constellation of Orion.  There they find a sister planet to earth, Soror, and after landing on a remote plateau discover a race of human beings that are no more than animals, naked and unable to speak. The three earthmen are stripped of there clothes by the humans, who hate anything that isn't natural.  Their spacecraft is destroyed by the savage people and they are run off into the jungle.  The next morning the tribe of wild humans are attacked by hunters, who are gorillas dressed like men, hunting like men, and acting and speaking like men.  One of the earthmen is killed, another disappears, and Merou is captured, taken to a research lab, and subjected to scientific experiments.<br><br>A sympathetic female animal psychologist, Dr. Zira, a chimpanzee, is intrigued by Merou keenness and soon learns that this man is highly intelligent and able to learn speech.  With her help Merou learns all about the simian civilization on Soror, in which the apes live in modern cities, drive cars, fly planes, and watch TV, and where conservative orangutans, especially one named Zaius, so fear this intelligent human being that they seek to have him destroyed.   With the help of Zira's fiance, an archeologist named Cornelius, Merou unwittingly discovers a secret about the origins of intelligent life on Soror that's so dangerous he's forced to flee the planet of the apes and return to earth.<br><br>Boulle's novel is a satire in the tradition of Voltaire that mocks humankind's anthropocentric theory of the universe from which human beings derive their sense of importance, and is laced with the kind of harrowing ironies that Boulle was famous for.<br><br>The movie based on this book is an 'Americanized' adaptation of it.  Rod Serling did the first drafts of the screenplay, simplifying the plot by fitting it into the mold of his \"Twilight Zone\" TV series and introducing an anti-nuclear war theme not present in the Boulle novel.  Because of budget constraints the modern ape civilization had to be reduced to a less technological one, something more reminiscent of ancient Greece.  In fact, after Michael Wilson, who had also adapted Boulle's \"Bridge Over the River Kwai\" to the screen, was brought in to do the final script drafts what emerged was a political allegory more akin to an Aesop fable than a Voltairian satire.<br><br>An improvement on the book was to turn the Merou character, now named Taylor, into a misanthrope and to reduce the scope of the story into a kind of 'misanthrope's comeuppance.'  Charlton Heston was a perfect choice to play the unlikable American astronaut, having essayed such similar 'bastard' roles in 1954s THE NAKED JUNGLE, 1963s DIAMOND HEAD and 1963s 55 DAYS AT PEKING, and the movie would be a lot less funny and pointed without him.<br><br>Roddy McDowall and Kim Hunter, as Cornelius and Zira, and Maurice Evans, as Dr. Zaius, enjoy some of the best performances on the screen, bringing the then-innovative makeup design of John Chambers to life under the intelligent and stylish direction of Franklin J. Schaffner.   Also excellent in this Arthur P. Jacobs production for 20th Century-Fox is the veteran cinematographer Leon Shamroy's Panavision lensing, which makes great use of remote areas of southern Utah around Lake Powell to suggest an alien world, and Jerry Goldsmith's avant-garde musical score, which has become a landmark, cannot be emphasized more for contributing to the weird atmosphere and eerie mood of the movie.  Rarely has a movie score so fit like hand-in-glove than this one.<br><br>PLANET OF THE APES was a box office smash in 1968, but if ever there was a movie that was more a victim of its own success it's this one.  Four sequels, two TV series, numerous novelizations and comic book adventures, and a lamentable remake in 2001 have been spawned by its popularity, most of which has been so inferior in quality to have tarnished the reputation of this classy and intelligent SF film landmark.  Luckily the qualities of the film remind viewers again and again of what noted New Yorker movie critic Pauline Kael titled her review of this movie, \"Apes must be remembered, Charlie!\"","user":"haristas","rank":[168,181]},{"title":"best ending ever!","rating":10,"date":"31 May 2005","review":"i think that this movie had the best shock moment at the end of the film than any other film in history. i saw this movie when i was about 9 years old and was fascinated with the thought of apes evolving on another planet and had heard nothing about the ending. when the camera pulls out at the end and shows the statue of liberty i about sh_t my pants. i was totally shocked and awed and i will always remember that moment. i think this movie holds up even today and was way better than tim burtons awful remake. i mean come on mark wahlberg versus charlton heston. heston wins this one easily. moses vs dirk diggler ha! for the times the makeup job on the apes was excellent and its too bad they had to make 4 more of these movies and ruin the franchise.","user":"acestanley2002","rank":[22,22]}]