[{"title":"A feast for stop-motion animation fans!","rating":2,"date":"2 March 2002","review":"Originally filmed in Czechoslovakia in 1954, the American Museum of Natural History filmed new scenes in 1967 for this remarkable study of prehistoric life which uses high-quality stop motion animation.<br><br>The story goes like this:  a group of young boys rent a boat at an inner-city park and enter a small cave at the edge of the lake.  When they come out the other side of the cave they find themselves on a river in an uninhabited area.  As they float down the river each day, they travel progressively further back into the past, encountering wooly mammoths, prehistoric rhinoceros, and numerous dinosaurs -- all of which are extremely well animated, photographed, and matted.  Written and directed by Karl Zeman, who gave us the unique film `The Fabulous World of Jules Verne' (release in 1958).<br><br>During the 1960s, `Journey to the Beginning of Time' was shown in serialized form on television in some areas (Atlanta, for one), amazing animation fans like me with this unexpected treat.  For about two weeks I would stumble out of bed, fix breakfast, and then choke on it while I watched each morning's episode of this remarkable little gem.","user":"Bruce_Cook","rank":[26,26]},{"title":"A movie to excite your imagination","rating":9,"date":"21 May 2005","review":"The irony of movie-making is that the supposedly \"amazing\" modern special effects often seem to rob movies of their potential charm. By trying to dazzle us with all their computer magic, too many contemporary films fail to stir our imaginations. It is like comparing prose with poetry. When special effects were more primitive, they had to be a bit more \"poetic\" and less literal in their presentations. The result was that these older movies stirred our imaginations better than many current ones.<br><br>This little gem of a movie is proof that limitations inspire creativity, and that the inability to graphically show anything you conceive forces the filmmaker to be more resourceful and clever with his choice of material. Nowadays, many people seem to be bored, rather than dazzled, with the flawless special effects that dominate some movies.<br><br>\"Journey to the Beginning of Time\" makes great use of the somewhat modest visual tools they had to work with at the time. Just as a novel like Ray Bradbury's \"The Martian Chronicles\" is a pleasure to read, \"Journey to the Beginning of Time\" is great fun, and something you'll always fondly remember.<br><br>I originally watched this movie in short segments on the \"Garfield Goose\" TV show (mid 1960s). Each week, I could hardly wait to see another of these brief episodes. Since TV back then had poorer screen resolution, and reception was often a bit grainy, I never noticed that the actors' mouths were out of synch with the dialogue. Only after looking up this movie on the IMDb.com website did I discover that this movie was not American. It was produced in Czechoslovakia in 1955.<br><br>This movie has so much warmth and charm that it overcomes the technical limitations of the day. I just purchased a copy of this movie, and will surely watch it over and over.","user":"pachl","rank":[31,33]},{"title":"Great! My classic!","rating":10,"date":"23 August 2005","review":"I saw this movie on television when I was just a boy. It was back then, when we had no video recorders or even DVD players in east Germany, and the only chance to see the beloved films again, was to wait... and wait... and wait... until they would be broadcasted once again. Maybe. And now, 25 years later, I had the luck to see all the Karel Zeman movies of my youth again. Aside the \"antique\" technical aspects, these films are still as good as in my memories. But old-fashioned technical details do not bother me, because the stories still work. And by the way: The Zeman - style was forerunning in that time. His combinations of live-action and animated scenes were unique! I watched \"Journey to the Beginning of Time\" recently with my son (6 years old) - and he was excited (as much as I). If you have the possibility to watch these Zeman films again - do it, they are worth it!","user":"meiko-richert","rank":[23,24]}]