[{"title":"What more could you ask for in a ghost story???","rating":30,"date":"30 March 2001","review":"If you're in the mood for a chilling, well-plotted, atmospheric mystery, you owe it to yourself to see this house-on-the-edge-of-a-cliff type of mystery. The intricate plot will delight mystery fans and the acting by Ray Milland, Ruth Hussey, Gail Russell, Donald Crisp and Cornelia Otis Skinner is excellent. Especially fascinating and chilling is the performance of Miss Skinner as Miss Holloway, the sinister owner of a clinic for disturbed women. Victor Young's background score adds immeasurably to the tense proceedings. His \"Stella by Starlight\" has become a classic composition for piano and orchestra. The old house itself with its huge windows overlooking the sea and its spacious interiors inhabited by an unseen presence, is the sort of dream house anyone would love to live in--except for 'The Uninvited'. Truly a high quality ghost story that also happens to be an absorbing mystery.","user":"Doylenf","rank":[90,93]},{"title":"A Lovely, Old Fashioned Ghost Story","rating":10,"date":"25 March 2006","review":"Roderick and his sister Pamela are vacationing along the English seaside when they discover a beautiful old house with which they fall immediately in love. They purchase the home from Commander Beech, an elderly man whose daughter and son-in-law once lived in the house. Almost as soon as Roderick and Pamela move in, the disturbances begin. A woman can be heard sobbing in the early morning hours and the smell of mimosa perfume is everywhere. Soon, Roderick takes a liking to the Commander's granddaughter, a very pretty but solemn and haunted looking girl named Stella. When Stella enters the house, the disturbances increase alarmingly, threatening her life and driving her perilously close to the sea cliffs. The Commander forbids her to set foot in the house, for he knows of the terrible tragedy that occurred there 20 years earlier. But the guilty secret he's been keeping all these years, a secret that involves Stella and her heritage, will not stay secret anymore and Roderick must face a vengeful ghost if he wishes to save the woman he loves.<br><br>This is a really great ghost story, a true classic of the genre. Everyone involved turns in a brilliant performance, especially Ray Milland as Roderick the sweet and likable composer and Ruth Massey as his spunky sister. Gail Russell as Stella is perfectly cast, always appearing shaken and fragile. The effects are terrific too! The crying ghost in particular will give you shivers as it echoes down the halls of the dark house and disappears with the dawn breeze. Light and shadow are used to maximum effect and despite the fact that this film was made in 1944, it never feels dated and it's lost none of its power to unsettle, disturb and even downright terrify.<br><br>Perfect viewing for a dark and stormy night. This is a flawless ghost story. Highly recommended.","user":"Gafke","rank":[56,58]},{"title":"A Superb Ghost Story","rating":8,"date":"3 February 2003","review":"This 1944 Paramount film is one of my very favourites.  Long hailed as Hollywood's first attempt at a \"serious\" ghost story, it will no doubt please most all fans of the genre.  Ray Milland and Ruth Hussey play Roderick and Pamela Fitzgerald who are siblings.  They are nearing the end of their seaside holiday in Cornwall, England when they happen to come across a lovely old deserted Georgian house while chasing their terrier, Bobby.   The Fitzgeralds meet the dour owner (played by Donald Crisp) and they purchase the small mansion for a surprisingly affordable amount of money.  Naturally, the house is haunted.  The acting - particularly that of Gail Russell as the luminous, moonstruck Stella Meredith - is effective and charming.  The black-and-white cinematography by Charles Lang is exquisite as is Victor Young's hauntingly lovely theme, \"Stella by Starlight\".  The film has a moody, frisson quality which few films of the \"ghost genre\" can match. In one of her very few film appearances, Cornelia Otis Skinner is memorably sinister as Miss Holloway who was a friend of Stella's mother, the deceased Mary Meredith.  A thoroughly enjoyable film with some real jolts and a great atmosphere, ghost fans should be enthralled by this one.","user":"willowgreen","rank":[89,97]}]