[{"title":"The Cries and Whispers of Silence","rating":10,"date":"8 January 2006","review":"The title of a dark and erotic final chapter of \"faith\" trilogy may sum up Bergman's own philosophy regarding religion and God  \"God has never spoken because He does not exist\". Bergman mentioned that he wanted to make a film with as little dialog as possible because \"he had made many films with a lot of talking\". He wanted \"The Silence\" to be a pure cinematographic experience where the images do all the talking. The films centers on two sisters, Ester (Ingrid Thulin) and Anna, (Gunnel Lindblom) to whom Ester is physically attracted. Esther, Anna and her 10-year-old son travel together and had to stop in a hotel located in an unnamed European country due to Esther's serious illness.<br><br>The film may be viewed on several levels -as the story of two sisters who apparently used to be close but are not able to communicate and understand one another anymore. Or it can be interpreted as a parable of Sensuality, Intellect, and Innocence, that cannot coexist in the world where God does not exist. As with every great and intelligent work of art, \"The Silence\" has so much to offer to its viewer, it's got so many questions to ask and it does not provide the easy answers.<br><br>Complex, suffocating, screaming through the silence, poignant, passionate, harrowing yet strangely hopeful and even funny sometimes - this is an unforgettable film, a masterpiece, a hidden treasure that has to be rediscovered and to receive as much praise and admiration as \"Persona\" and \"Cries and Whispers\" - for both of which \"The Silence\" was an inspiration. The acting by two Bergman's actresses is a miracle (as usual) as well as Sven Nykvist's camera work in creating the claustrophobic world where silence cries, whispers, and kills...","user":"Galina_movie_fan","rank":[48,54]},{"title":"This is Bergman at his most disturbing.","rating":8,"date":"2 April 2003","review":"\"Tystnaden\", \"The Silence\", is perhaps Bergman's most disturbing film without the shocking images of, say \"Cries and Whispers\" and \"Fanny and Alexander\". It is more the atmosphere and what is not said that makes this film so uncomfortable to watch, but that is one of the things I love about the cinema- to be shocked, moved and disturbed by the images. I can understand why some people, my mother for example, do not like Bergman, but I believe he is a great artist and one of the true canonic directors we have, along with the likes of Dreyer, Mizoguchi, Fellini, Tarkovsky and Kubrick (just to mention a few!).<br><br>Bergman's women shine in this film, too, although they must have been exhausted afterwards. Ingrid Thulin and Gunnel Lindblom star as the two sisters, whose apparent incestuous relationship has destroyed them both, Esther (Thulin) physically (she is dying) and Anna (Lindblom) mentally. They arrive, with Anna's son Johan, in a foreign city at war, which creates an uncozy atmosphere around Sven Nykvist's exterior shots. The tanks roll down the city streets, becoming a metaphor of the war of emotions between Anna and Esther. Thulin makes a very physically demanding performance, like Harriet Andersson in \"Cries and Whispers\" she is dying (of cancer?), and her pain is showing. Anna clearly wants to hurt her sister, who is the oldest and smartest of them, by saying cruel things and playing with Esther's apparent sexual love for her.<br><br>Sigmund Freud would have loved this film, and Anna seems to want to break free from her sister by having casual sex with a man she meets at a bar. She then tells her sister about it, and Esther's reactions to this is extremely ambiguous, like most of the film is. Anna's wish to become free of her sister is deeply rooted in childhood experiences, and it leads Anna to say things like \"I wish she was dead\" to the man who does not understand a word she is saying. All these things make \"Tystnaden\" the disturbing film it is. The only release is when Johan explores the corridors of the hotel alone, meeting a bunch of short men who perform at a circus-like variete Anna visits to escape from the sight of Esther. But Johan meets a kind (or is he a paedophiliac?) old man who works at the hotel, and it is he who has to care for Esther as she draws her last breaths, Anna tearing Johan away from her sister's arm in a very cruel manner. The long periods of silence in the film perhaps makes the title, or perhaps it means that the silence about the sisters' past is never broken to us, the spectators. A lot is left up to us to interpret, typically of Bergman's cinema.<br><br>All in all, a very ambivalent, Freudian and disturbing film from one of the masters of the cinema.","user":"braugen","rank":[71,85]},{"title":"Amazing, but not entertaining","rating":10,"date":"21 September 2004","review":"I am neither an expert on Bergman, nor on film, so I refer you to the many thoughtful reviews others have written; but reconsider the comments that \"nothing happens in this film.\" Yes, it does seem much longer than 95 minutes, but only because it is so dense, because so much happens. Each look, each word carries emotions and meanings that require interpretation and re-interpretation. This is not a fun movie. We watch a woman die--slowly--and her relationship with her sister fester. Whatever the women try to say, they seem not to be able to say what they mean, or not to be able to mean anything. The son/nephew meanwhile wanders the halls of their hotel alone, somehow beyond or below any communication. There is indeed little action, aside from the sexual forays that serve to exacerbate rather than relieve the tension.<br><br>This is a desolate film, and no redemption from the loneliness of death and individuality may be possible other than the consciousness of the beauty of that desolation. But it is beautiful.","user":"thomasandrussell","rank":[37,45]}]