[{"title":"Good Movie, perfect WG vehicle.","rating":7,"date":"24 December 2005","review":"I really enjoyed this movie, actually I've enjoyed it a number of viewings. I purchased the DVD. Why did Whoopie stop making movies that were so much fun. I enjoyed the books for which the movie is based, and prefer a woman to a man as a cat burglar. The cast is wonderful, especially Leslie Ann Warren, she is a total hoot. I won't spoil the ending but it was really cool. The atmosphere while they are bar-hopping is so realistic, having been a bar-hopper in my youth in San Francisco. Why isn't Hollywood making these little sleeper hits anymore. Now its all big budget busts, or small artsy fartsy movies. How about a well played mystery without the \"Big\" named pretty boys and girls as stars. More movies like this and perhaps the box office slump will not stop slumping...","user":"glsilva","rank":[9,12]},{"title":"Whoopi's Finest","rating":10,"date":"5 February 2010","review":"Whoopi Goldberg? AND Bobcat Goldthwait? In the same movie?! Well, it's official - my wife owes me $50 - she swore that they were the same person! <br><br>All kidding aside, folks, this movie is a gem and I'm not sure how I'd overlooked it in the past. I recently got laid off so I have been spending a lot of time around the house doing my wife's Cosmo quizzes and drinking Colt 45. Needless to say, I have a lot of free time to watch movies.<br><br>So the other day, I walked down to the local video store, and fished around the used VHS bin to see if I could get a steal. I pulled out this movie, thought the cover looked hilarious, and thought I'd give it a try. For only 99 cents (without tax), what could I have to lose?<br><br>Folks, I would have gladly paid TWICE that amount! This film is truly Goldberg's finest work (and trust me, I love The View! Did I mention that I was laid off?!), and her on-screen chemistry with Goldthwait (Police Academy 4: Citizens on Patrol, Hot to Trot) is brilliant. John Goodman (The Babe) adds some extra laughs, making this film a well-rounded comedic masterpiece to be appreciated by all. Why this film is so often ignored, I have no idea. Do yourselves a favor and grab a copy. You won't be \"robbed\" of a fun experience!","user":"johnny-w","rank":[7,9]},{"title":"You'd, like, steal a building, but not a jar of olive oil?","rating":8,"date":"10 April 2006","review":"Another in a series of comic vehicles for Whoopi Goldberg in the late 80's, this one features a pretty well crafted mystery buried in amongst the comedy.<br><br>Bernie Rhodenbarr (Whoopi Goldberg) is a cat burglar by trade. She would like to retire into respectability, but unfortunately, Ray Kirschman (G. W. Bailey), a retired police detective who once busted Rhodenbarr, is now blackmailing her into stealing for him. During one of her \"jobs\" for Kirschman, Bernie is surprised when Christopher Marshall (Stephen Shellen), the man she's stealing from, comes home unexpectedly. Bernie hides in the bedroom closet, but Marshall isn't alone, and when he and his companion decide to hit the sheets, Bernie is trapped there for the night. In the morning, Bernie overhears and argument between Marshall and someone who comes to see him. Then she hears the sounds of a struggle, and then silence. Eventually, she emerges from the closet to find Marshall dead on the floor with a rather strange looking object sticking out of his chest. She leaves, but is ultimately fingered as both a murder and robbery suspect. She spends the rest of the movie trying to clear herself with a little help from sidekick Carl Hefler (Bobcat Goldthwait), all the while eluding two bumbling detectives (John Goodman and Anne DeSalvo), and dealing with Marshall's widow (Leslie Ann Warren) and her attorney (James Handy). Will she find the truth, will Kirschman turn her in, or will the killer do her in? <br><br>In spite of some occasional far fetched elements, this is actually a pretty well crafted mystery. Rhodenbarr is resourceful, and that resourcefulness not only helps to keep her out of jail as well as allowing her to figure out who really killed Marshall. The story is told in a comic way, but it is quite credible, nonetheless.<br><br>The acting was quite enjoyable. Goldberg, of course, turns in a masterful performance. Warren's over the top hysterics work well with her character, and show just how much range she has. Goodman and DeSalvo are amusing as the bumbling detectives. Goldthwait and Bailey are rather annoying, as is par for the course with both of them, but they do manage to make their characters work. And Handy's performance is nicely layered between the public face as an upright lawyer, and the private face as a disturbed man capable of shocking violence.<br><br>Yes, it's a silly movie, but if you look beneath the silliness, you may be surprised to find a well crafted whodunit. And either way, it's just an enjoyable movie.","user":"dwr246","rank":[7,9]}]