[{"title":"A diverting tale, if you overlook many plot inconsistencies","rating":7,"date":"5 July 2017","review":"Copyright 24 October 1963 by Roxbury Productions. Released through Metro-Goldwyn-Mayer. New York opening at the Radio City Music Hall: 23 January 1964. U.S. release: 25 December 1963. U.K. release: 1 March 1964. 12,120 feet. 135 minutes.<br><br>SYNOPSIS: Newly arrived in Stockholm to receive their Nobel Prizes are Andrew Craig (literature), Max Stratman (physics), John Garrett and Carlo Farelli (medicine), and Claude and Denise Marceau (chemistry). The first night Stratman, who is accompanied by his niece Emily, is kidnapped by Communist agents and his twin brother (Emily's father) takes his place. The plan is to remove the real Stratman to behind the Iron Curtain while his brother makes derogatory remarks about the U.S. during his acceptance speech. Craig, who had met the real Stratman, becomes suspicious of the impersonator and starts his own private investigation. As a result he finds himself in the center of an intrigue and several attempts are made upon his life. <br><br>NOTES: Location scenes filmed in Stockholm.<br><br>COMMENT: Mediocre entertainment at best. Its many faults include a dated, pot-boiler script about Russian spies on a kidnapping spree with E. Phillips Oppenheim impersonations. Whether to take the goings-on seriously or not is a big question. At times, the plot is obviously played for thrills, on other occasions for laughs.<br><br>A number of technical imperfections also cause viewer unease. These include blatant doubles in 2nd unit sequences, glaringly obvious process screen effects, and action spots that are amateurishly under-cranked. The direction is undistinguished, though reasonably fast-paced. Daniels' color cinematography is disappointingly ordinary throughout.<br><br>That the film is better than the sum of its parts is due almost entirely to the cast. Newman plays sullenly, if with an occasional mordant wit. In fact, he starts off well, but is let down by the script when his character as the scared pulp-writer who is being unwillingly drawn into the parallel world of his own creation — this time for real — is abandoned halfway through. Instead the character reverts to a standard heroic mold with acrobatics that include jumping on to the side of a high-speed truck to avoid knife-wielding assassins and a spectacular dive off a Stockholm bridge. <br><br>Unfortunately, there are still inconsistencies. Robinson fares better with an ingenious role which for some reason (tiredness) he plays at only half strength, relying for effect more on his heavy make-up than his native histrionic abilities. McCarthy as usual performs most capably in a minor sub-plot, whilst Miss Presle is unattractively photographed in another. Diane Baker has a thankless, if oddly appealing part, which she plays with little zest.<br><br>On the solidly credit side are the silkily attractive Elke Sommer, Rudolph Anders as Bergh, John Wengraf as the villain and Sacha Pitoeff as Daranyi, his shivery henchman.","user":"JohnHowardReid","rank":[9,9]},{"title":"\"The Prize\" is rather entertaining, though silly","rating":7,"date":"1 July 2005","review":"Director Mark Robson and scriptwriter Ernest Lehman (both of From the Terrace) transformed the relatively serious Irving Wallace novel into a glossy blend of comedy, suspense, melodrama, romance, sex and international intrigue <br><br>The complicated story concerns a group of Nobel Prize winners gathered in Stockholm for the ceremonies Newman is the winner in Literature, although he's written only cheap detective thrillers (under pseudonyms) for the past five years Another hard-drinking womanizer, he has plenty of booze, and a beautiful Swedish official (Elke Sommer) assigned to him But he's distracted from these long enough to suspect that the Physics prizewinner (Edward G. Robinson) has been kidnapped by the Communists and replaced by a double Naturally, nobody believes him","user":"Nazi_Fighter_David","rank":[27,32]},{"title":"Obviously inspired by Hitchcock, but as Hitchcock-imitations go this one is absolutely terrific.","rating":9,"date":"9 November 2005","review":"Director Mark Robson tilts his hat to Hitchcock with this adaptation of an Irving Wallace novel. A slick, light-hearted thriller of international intrigue, with a dash of sex and humour thrown in, \"The Prize\" is actually BETTER than some of the stuff Hitchcock was making around that time (eg Torn Curtain and Topaz). No doubt, part of the reason for the Hitchcockian similarities is due to the fact that this film was scripted by Ernest Lehmann, who just a few years previously had written North By Northwest. Anyone who remembers North By Northwest will probably recollect the famous auction house scene, and here, in \"The Prize\", Lehmann has written-in an almost identical scene in which the hero narrowly evades capture by creating a stir at a nudists' conference!<br><br>American writer Andrew Craig (Paul Newman) is in Stockholm for the Nobel Prize Ceremony, for which he has won the Literature award. Known for his boozy antics, as well as his distinct lack of respect for those in authority, Craig is assigned a personal assistant, Inger Lisa Andersson (Elke Sommer), to keep him in check during his stay. Less well-known is the fact that Craig has been suffering from writer's block for several years, and has been writing cheap crime novels under a pseudonym in order to make ends meet. With his nose for a mystery he soon sniffs out some very curious goings-on at the ceremony. He becomes increasingly convinced that the Physics Prize Winner, Dr Max Stratman (Edward G. Robinson) has been kidnapped and replaced by a double. Since no-one will believe him, it is left to Craig and his pretty Swedish assistant to uncover the truth.<br><br>\"The Prize\" actually starts quite slowly, with an amount of time set aside for character introductions and plot exposition that impatient viewers might find excessive. However, the build-up pays off brilliantly once the action gets underway and all the jigsaw pieces of the plot drop into place. Modern film-makers seem to be of the opinion that the best approach is to hurl the audience straight into the action, but \"The Prize\" proves conclusively that audiences get far more excitement and enjoyment when the plot and characters have been constructed with care and detail. In particular, the relationship between the various Nobel prizewinners is an utter joy (especially the husband-and-wife chemistry winners who actually hate each other; and the co-winners of the medical award who accuse each other of stealing their best ideas). There are a great variety of suspenseful and humorous moments in \"The Prize\". Add to that the game performances, excellent location work, Jerry Goldsmith's good music score, and the general sense of solid, old-fashioned entertainment.... and you're looking at a Hitchcock pastiche par excellence.","user":"barnabyrudge","rank":[53,71]}]