[{"title":"Scaramanga's trademark weapon was a single-shot, gold plated, 4.2-caliber handgun","rating":7,"date":"9 July 2005","review":"In Guy Hamilton's 'The Man With the Golden Gun', James Bond still enjoys a good cigar, and prefers Dom Perignon '62 above the '64 offered...<br><br>He sure does love Swedish babes, and dares to kiss a talented dancer's 'magnificent' abdomen... He slaps a tall, graceful slim girl, and he slaps her hard... He attempts to overtake Scaramanga's car by crossing a canal with no bridge in sight, and pilots a small seaplane to let us see those incredible prehistoric islands off the coast of Thailand...<br><br>Francisco Scaramanga (Christopher Lee) is a world's class assassin who has stolen a prize solar energy device, but who only needs one bullet to finish a job... He likes Tabasco sauce, gold jewelry, and a girl in a bikini... He caresses his lover with a golden gun, and loves to kill for a million dollars a shot... He has a 'sign' of great sexual prowess... He perverse love/hate relationship with a mischievous French-speaking assistant, and admires Bond so much that he even keeps a mannequin of him at his island retreat... He claims to be an artist, and challenges 007 to 'a duel between titans' on the sunlit beach... A man of taste, his AMC Matador car suddenly sprouted wings and jetted off into the blue sky<br><br>Britt Ekland spends most of the film either locked in the trunk of Scaramanga's flying car or stuck in the closet of Bond's hotel room while 007 makes love to Andrea (Maud Adams). <br><br>Maud Adams remains the only exotic woman to have starred in two different Bond features, and would also have a brief cameo in \"A View To A Kill.\" This Swedish beauty is sick of Scaramanga's sadistic games It was she who sent the gold bullet to M16 that set Bond on Scaramanga's tail<br><br>Nick Nack (Hervé Villechaize) perfectly proves that the smallest of Bond's adversaries can easily give 007 big trouble... He annoyed 007 right up until the very end of the mission His tiny mannerisms perfectly fitted the fantasy tradition of the Bond movies... He's seen so quick on his feet as he plays with the controls that operate the 'fun house' on Scaramanga island<br><br>'The Man With the Golden Gun' remains thin and obvious 007 extravaganza with conventional expensive excitements... The boat and car chases merely reprise sequences in both 'Live and Let Die' and 'Diamonds Are Forever.' <br><br>Last note: After being absent in 'Live and Let Die,' Desmond Llewelyn returns as the beloved Q, but provides 007 no fantastic gadgets and weapons this time...","user":"Nazi_Fighter_David","rank":[43,53]},{"title":"Bond #9: Scaramanga turns on the light","rating":9,"date":"9 July 2008","review":"The killer Scaramanga (Christopher Lee) uses a special golden gun for his assignments and has a rare birthmark on his chest. That's about the only things the movie has in common with the novel which played in the Caribbean region whereas the movie takes us to Thailand where Scaramanga secretly works with solar energy. Casting Herve Villechaize was an attempt to create a sidekick for Scaramanga like Oddjob had been to Goldfinger - a bit too silly in the end. Being a child of its time, \"The Man With the Golden Gun\" couldn't resist some kung fu - you see better martial arts in Hong Kong productions, though. Somehow parts of the movie seem too artificial, especially the mirror labyrinth where Scaramanga likes to practice the art of killing. But the beautiful islands will stick to your memory, and there is the most fabulous car stunt so far! There's an interesting promo photo for the movie, by the way: Lee and Moore back to back, gun in hand. This is not just a duel, this is also illustrating the idea of Scaramanga being a \"dark Bond\", his mirror image as a bad guy with the same skills, but different ideology. \"We have so much in common, Mr Bond\", Scaramanga says. \"Ours is the loneliest profession.\"","user":"unbrokenmetal","rank":[15,17]},{"title":"My Favorite James Bond Movie","rating":7,"date":"31 July 2014","review":"This is the second film for Roger Moore in the role of \"Agent 007\" and even though this particular movie isn't the best it happens to be my favorite James Bond movie of them all. Essentially, the world's #1 assassin named \"Scaramanga\" (Christopher Lee) has sent a golden bullet to James Bond indicating that he is his next target. So rather than waiting around for Scaramanga to choose the time and place James Bond decides to find him first. This leads him to Beirut, Macao, Hong Kong and Bangkok in an attempt to find information that might be helpful in that regard. Now, rather than reveal the rest of the story I will just say that this movie does a good job of combining both action and comedy. As a matter of fact, I think this is probably the most humorous James Bond film ever made as it features nifty one-liners from James Bond along with \"Sheriff J. W. Pepper\" (Clifton James) and a midget named \"Nick Nack\" (Herve Villechaize). It also features two quite attractive women in Maud Adams (as Scaramanga's mistress, \"Andrea\") and Britt Ekland (as \"Agent Goodnight\"). Again, it might not be the best James Bond movie but I found it to be quite entertaining and recommend it to all fans of the series. Above average.","user":"Uriah43","rank":[7,7]}]