[{"title":"The sexiest film by Tinto Brass","rating":10,"date":"26 September 2000","review":"The movie does have a plot that traces the adventures of a young prostitute. But do people really watch and rewatch this movie for its plot?  I doubt it very much!  The main reason to watch this movie is young Deborah Caprioglio, photographed from every angle at the peak of her voluptuous beauty.  She is breathtakingly beautiful, and Tinto Brass's light-hearted eroticism found its most memorable protagonist. The actress continues to make movies, but nothing measures up to the visual impact of this film.","user":"EFW","rank":[45,52]},{"title":"Sexy good movie","rating":6,"date":"29 December 2004","review":"The plot is very simple. In late '50s a young lady starts working as a prostitute in a brothel in order to help his boyfriend. She thinks that is the easiest way to make money. I do agree. Mr. Tinto Brass centered the view in Debora Caprioglio, who plays the roll of Paprika. Hell, she is very hot, sensual... but as nothing is perfect in her life she will go from one place to another and this is a kind of repetitive. She is filmed from every angle you can imagine. You can imagine that with the view centered on Caprioglio the other ladies are not seen in plenitude. Doesn't matter Caprioglio is the hottest woman in the movie and is a well chosen actress for the leading actress. Her performance is very good. Finally I would like to say that this movie is far from pornography. Brass actual is close to porno. But this one has a simple plot, is funny, long but could be seen. 6/10 Andrés.","user":"Andres24","rank":[25,30]},{"title":"Deborah Caprioglio worths the watch.","rating":6,"date":"21 August 2005","review":"I'm not ashamed to admit that I bought \"Paprika\" to see Deborah Caprioglio naked and in sex scenes. The woman has a unique beauty that makes her very attractive. What can I do about it? I liked the movie for it's content (not only sexual) after I watched it. The plot is crude but is perfectly handled and in my opinion, fits in the \"art movie\" department. The sad display of a woman's suffering in this situation is provoking and emotional; and a little erotism didn't hurt.<br><br>The acting is good, specially by Caprioglio. The sex scenes are steamy and justify the tone of the movie. Check out the train doggy style sex scene. Fabulous specially for Deborah's fans.<br><br>Watch this movie with low expectations and you might like it, and if you acquire the movie for the nudity and sex scenes you won't regret! But if you are looking for Tinto Brass at his best, you will also feel satisfied.","user":"insomniac_rod","rank":[17,22]}]