[{"title":"Beauty among slaughter","rating":10,"date":"17 November 2002","review":"The first entry in a series of master pieces. Based very strongly upon the manga series `Lone Wolf and Cub' is most likely the best film series derived from comics. And truly great films as well. One cannot base one story on a single comic. There are so many elements in each. There is a basic story, but often times there are mixed with others. Little things are thrown in as well. Normally it would make any less a film seem crammed or just forced in. But it is pulled off brilliantly.<br><br>This film, the first entry is largely a set up for the sequels but still brilliant, from its beautiful camera shots to the extremely gory ascetic fights. It tells the story of how the main character Ogami Itto was exiled from his royal position as the Shoguns decapitator. It flashes from past to present until the entire past story is told. The ending fight is a great climax.<br><br>The sword work although at times seems fake is brilliantly choreographed. The gore in the film is not overly done, but rather thrown in to give it an artistic feel, as if you're watching a moving painting. Often times one may think every scene could very well be a panting.<br><br>Some aspects of the plot may seem odd to most western audiences. The scene where Ogami gives his son a choice between a ball and a sword. Or rather life or death, may strike many people as cold. However one must understand bushido and know that the way of the samurai is life in death. Ask yourself what would be worse taking your son on a trip as you kill men beyond number, or giving somewhat of a choice.<br><br>This film is truly beautiful, and hold up today as not just one of the greatest samurai films ever made, but films period.","user":"jolgo13","rank":[27,29]},{"title":"The beginning of one of the most entertaining Japanese movie-series.","rating":8,"date":"17 April 2010","review":"The foremost reason why this is a standout movie-series is because of it's unusual and highly original main concept. There are plenty of Japanese movies about a shogun, ronin or a samurai fulfilling their destinies and travel through the country, getting into all kind of adventures and troubles. The Kozure Ôkami-series has an original take on this type of movies by letting the main character carry and drive around his infant son in an armed and dangerous baby cart. His infant son even helps him in battle sometime. No big surprise that this all is being based on a manga-series, by Kazuo Koike, who also contributed to this movie its script.<br><br>It also becomes obvious that this movie is being based on a manga when you look at its violence. It's really deliberately being over-the-top and the entire series is well known for featuring fountains of blood, whenever someone gets struck down or gets a limb or head cut off. It's a pretty bloody movie but because it all gets down in such an over-the-top way, it's nothing too shocking to watch, even when you don't have the stomach for it.<br><br>It are really its action sequences that stand out and there is plenty of action in this one. All of the fights got nicely choreographed and brought to the screen and above all things they also often have something original to offer. Often Itto uses some tricks to fool his opponents and can strike down the best trained and most powerful shogun with one strike because of some clever and unexpected moves and tricks, sometimes helped by his infant son Daigorô.<br><br>The movie is good looking, thanks to its fine directing, that provides the movie with some nicely done sequences but also due to its great looking environments. The movie often uses nature elements and environments as a key part of the movie its climatic battles, such as water or the sun.<br><br>All in all, a great start of the series!<br><br>8/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[9,9]},{"title":"Beautiful, bloody and brilliant.","rating":8,"date":"15 September 2007","review":"Like many fans, my first exposure to the world of badass warrior Ogami Itto (and son) was through Shogun Assassin, an infamous 'video nasty' that was compiled from the 'best bits' of the first two movies in the Baby Cart series, 'Sword Of Vengeance' &amp; 'Baby Cart At The River Styx. A stylish blood-drenched epic, Shogun Assassin piqued my interest enough to make me seek out the entire Baby Cart series (comprising of six films, made between 1972 and 1974).<br><br>Sword of Vengeance introduces us to protagonist Itto (Tomisaburo Wakayama), whose job, as Second for the Shogunate, is to execute the enemies of the Shogun, should they fail to commit seppuku (ritual suicide). After his wife is murdered, Itto is framed for treason by the nasty Yagyu clan (who wish to take his coveted position as Second). Now a Ronina samurai without a master he takes to the road working as an assassin for hire, accompanied by his young son Daigoro, who rides in a booby-trapped wooden cart. Together, they are known as Lone Wolf and Cub.<br><br>With superbly choreographed fight scenes, wonderful cinematography, a terrific soundtrack, and a great central performance from Wakayama, this is an unmissable piece of samurai cinema. Itto is the Japanese equivalent of Clint Eastwood's 'man with no name': a cool-headed, tough-as-nails, and honourable character who is sparing with his words, and who only acts with violence when necessary (but always with devastating results).<br><br>A lethal force with his sword (and also with the variety of weapons secreted about Daigoro's cart), Itto cuts a swathe through all who are stupid enough to challenge him. A quick flash of his blade, and his enemies are either minus a limb or two, or spouting a geyser of blood from a fatal wound.<br><br>Sword of Vengeance is a prime example of cool, gritty and stylish 70s cult cinema. Watch it, and be cool by association.","user":"BA_Harrison","rank":[19,22]}]