[{"title":"FBI agent stumbles upon Soviet spies while interviewing Air Force Academy hopeful.","rating":29,"date":"29 January 2002","review":"The fact that the basic plot of this movie is ridiculous fails to ruin it. FBI agent Roy Parmenter (Sidney Poitier) is interviewing Jeff Grant (River Phoenix) for his possible entrance into the Air Force Academy.  While reviewing Grant's file he discovers that his parents Richard (Richard Jenkins) and Elizabeth (Caroline Kava) are not who they seem to be.  They turn out to be dormant Soviet spies, `sleepers', who have come to the United States and started a life with their son, who has no idea they are spies.<br><br>I won't even go into how silly it is the way Parmenter discovers this, as if computers REALLY work that way.  Suffice it to say, when he finally tells an incredulous Jeff about his parents, several other sleepers have already been murdered by renegade double agent Scuba (Richard Lynch).  Scuba wants money from the KGB and if he doesn't get it, he will kill every sleeper on his list, the Grants included.  The former boss to all these agents is Constantine (Richard Bradford), who is sent to San Diego to collect Scuba and take him back to Russia for punishment.<br><br>Scuba is finally captured, by Parmenter, whose partner was murdered by Scuba some 20 years prior, so he has a personal reason for wanting Scuba too. The aforementioned characters wind up on the trolley going towards the Mexican border and an exchange between Parmenter and Constantine, who has abducted Jeff, occurs.  However, once at the border, Scuba makes a run for it and all hell breaks loose.<br><br>As I said earlier, as implausible as the plot is, the movie is actually quite enjoyable and somehow suspenseful.  While you may find yourself rolling your eyes at certain points, you'll also find yourself chuckling at some of the dialog and situations the characters find themselves in. Loretta Devine, as Jeff's teacher Verna McLaughlin, is hilarious in the scene where she is caught in bed with Parmenter by Jeff.  `No problem,' she says when Parmenter apologizes, `I'll just go topless for the whole student body!'<br><br>Despite the fact that Scuba is the ultimate enemy I found myself cheering him on because Lynch is such a powerful actor.  You want to see him on the screen more, no matter what he's doing.  The fact that he's not in the film enough is my only other complaint about it.","user":"rm91945","rank":[20,23]},{"title":"Involving, But Only So-So Overall","rating":5,"date":"13 October 2006","review":"This was a fairly involving story, although it's better in the first half. After that, the kid gets annoying but then the film picks back up in the last 15 minutes. The story is about this teen boy \"Jeff Grant\" (River Phoenix) who discovers his parents are \"sleepr\" KGB agents, spies are out of the business. They have come to the United States to start over with their kid.<br><br>Meanwhile, an assassin is killing those former, or \"sleeper,\" if you will, agents. \"Roy Parmenter\" (Sidney Poitier), an FBI man, is after anyone it seems. That last part is a bit confusing. <br><br>The story taxes ones believability here and there but is interesting most of the way. However, I thought Phoenix overacts in a number of scenes. This was far from his best performance in his abbreviated film career.","user":"ccthemovieman-1","rank":[25,33]},{"title":"With the Benefit of Hindsight","rating":6,"date":"3 January 2009","review":"It's easy to look back now at this film as a very average Cold War thriller, but that is with the benefit of hindsight. It's difficult for today's generation, those of the age that the Phoenix character plays, to appreciate that the world really was living with a possible Nuclear destruction if there had been an accident or serious misunderstanding.<br><br>The action and drama is really primarily psychological, with the heart of the film hinging on the Poitier and Phoenix performances. It's easy now to pass off the whole thing as a trivial character piece, but, then, the stakes were sky high and the Cold War themes were progressive and unusual. In our post Cold War world where Gorbachev and Reagan slowly recede into the mists of history it would be a shame to write of this movie without understanding the atmosphere it was made in.","user":"barney_holmes","rank":[9,11]}]