[{"title":"future tech fun","rating":24,"date":"24 May 2001","review":"We loved this movie when we saw it at the theatre during its original release; I still have fond memories of the pet dolphins cavorting in the living room pool, and of the space-age push-button underwater conveniences (such as that neat pop-up refrigerator). I can even remember the lyrics to \"Hey Little Goldfish\" and \"Glub, Glub\"!! As kids we sang those songs for years. I can't wait to rent this one and rock out again with Dreyfuss and the gang! I hope he doesn't mind too much, 'cause I think this movie is a great sixties artifact, with a fun cast and very creative sets.","user":"omerie","rank":[12,14]},{"title":"This movie is sublimely ridiculous. Watch and enjoy.","rating":9,"date":"17 April 2008","review":"The cast of this 1969 movie alone is enough to recommend it. A pre Odd Couple Tony Randall. A post Psycho Janet Leigh as his wife . Jim Backus being Jim Backus. Roddy McDowell somewhere between Flicka and Planet of the Apes. Richard Dreyfus facing his FIRST shark encounter (sharks were old hat to him by the time Jaws came around) Ken Barry actually playing a bad guy! And Charlotte Rae who apparently had other charges in her care prior to Willis, Arnold, Blair, Jo, Natalie and Tootie.<br><br>If that doesn't give you an idea of the delightful absurdity of this movie add in a couple of dolphins that have seen 1 too many Lassie movies. Sprinkle it with sonar jamming rock music and Harvey Lemboeck. I defy anyone with an ounce of humor in their soul not to laugh at the silliness of this movie.<br><br>So what's the movie about? Okay if you MUST know, Tony Randall has invented an underwater home and to prove to his boss (Jim Backus) that living under water isn't a crazy idea Tony talks his family into moving into his invention for a month. Tony and Janet have 2 teenagers that are part of a rock band that's about to go big time thanks to record company owner and boy-genius Roddy McDowell, so naturally the entire band goes along for the ride including a lead guitarist played by Richard Dreyfus. You'll find Janet's \"futuristic\" kitchen quite amusing...as well as the idea that when the kids practice their rock music it jams Navy sonar! Oh, did I mention that Ken Barry is a conniving coworker of Tony's and who's trying to sabotage Tony's work and take his job??","user":"vonnablady","rank":[5,5]},{"title":"Wonderful Family Movie","rating":8,"date":"21 May 2006","review":"I was at the local Borders Books and saw this DVD. I was so excited! It was one of my favorite movies when I was a kid. Why? I loved the cute songs and the whole idea of living under the water. Plus, I was really into Flipper and loved the sea creatures in the film. I remember dreaming about living underwater and playing pretend ( I was probably 7-8 when I saw it the first time). My husband and I have 3 kids at home 16, 14 and 11. My husband had never seen but he knew all the actors and wanted to see them. Everyone in the family watched it and liked it very much. Lots of smiles and laughs! The kids are watching it for the second time today. We love all kinds of movies but love family type movies the best. Like all the great family movies and TV shows of that time, you will have a warm, happy feeling when it is over! I am so glad this is on DVD to be cherished and shared for generations. We don't have TV (would have it if the shows were like the late 60's early 70's)so my kids would never have been able to see it with out it being on Video or DVD. Thank you Technology for giving us choices!","user":"ldshome5","rank":[8,9]}]