[{"title":"From the Wrong Side of Town to Wealth","rating":7,"date":"21 October 2008","review":"Jennifer Jones had different types of roles in the films her husband David O. Selznick made. She's a dutiful daughter in SINCE YOU WENT AWAY. She is a simple, holy young woman - destined for religious greatness, in SONG OF BERNADETTE. She is one of a pair of twisted, oversexed, mutually doomed lovers in DUEL IN THE SUN. She is a doomed nurse who dies in World War I in A FAREWELL TO ARMS. Even in a film she was loaned for - BEAT THE DEVIL - she is a chronic liar and fantasist. Her title role as \"Ruby Gentry\" resembles her \"Pearl Chavez\" in that she is from a despised background (Ruby is from the \"hillbilly\" woods country, and Pearl is half Indian), but Ruby eventually does make it materially...but at a cost.<br><br>Let's face it - RUBY GENTRY is an example of a soap opera turned into a motion picture. In fact, after watching it one wonders why Selznick chose to make this film. DUEL IN THE SUN was a western, SONG OF BERNADETTE a historical film, PORTRAIT OF JENNIE a popular novel of the day. GENTRY was a novel too, but it's plot was not as mystical and weird as PORTRAIT OF JENNIE (wherein Joseph Cotton fell in love with the portrait of a young woman, whom he gradually learned died years earlier - and whom he experiences the love and loss of by meeting her ghost). GENTRY is set in the south, and is told by an outsider (a northern doctor who just moved to the Carolina coastal town - he's also having problems getting accepted*).<br><br>(*The doctor's first name is rather Jewish sounding, which may be another reason he is having problems of acceptance in the town.)<br><br>The story follows how Jones fascinates most of the men she meets: she has an affair with Charleton Heston, she has been under the protection of Karl Malden and his wife, and the doctor realizes what a remarkably talented woman she is too. But she is not socially fit to marry Heston (whose business ideas require a wealthy wife at least). When Malden's wife dies she accepts his subsequent marriage proposal. But while the social swells don't knock Malden (accepted as one of them and a decent guy) they won't accept her. The marriage suffers and subsequently Malden dies in an accident. Now wealthy Jones still finds that her wealth does not buy acceptance. And her point of view begins to sour towards the \"upper crust\" who prove more frail facing her than they imagine.<br><br>The film works. Not only do the three leads do well (watch Malden's jealousy scene at the country club, or the scene of Heston and Jones driving a convertible at night alongside the ocean on the beach - one wonders if the scene influenced the scene of Jack Nicholson and Shirley MacLaine in TERMS OF ENDEARMENT). Also noticeable are the actors playing the doctor (Barney Phillips) and Jones' brother (James Anderson), a religious maniac who may have certain incestuous ideas about her himself. If it is a soap opera it is a superior one, with firm acting, good directing by King Vidor (who had done the directing in DUEL IN THE SUNS), and even a memorable musical theme (\"Ruby\"). Jones is excellent, even if the role would have been more typical for Susan Hayward in that period.","user":"theowinthrop","rank":[9,9]},{"title":"RUBY - A FLAWED GEM","rating":7,"date":"2 July 2002","review":"Jennifer Jones certainly did not get type cast in her screen roles.As a complete contrast to her normal saintly image (Duel in the Sun excepted) she plays Ruby Gentry,a Sth.Carolina girl from the wrong side of the tracks who gets emotionally involved with Boake Tackman (Chalton Heston) her sometime aristocratic boyfriend who is promised (more as a property contract) to Tracy who comes from another good Sth.Carolina family.Ruby has a religous zealot brother who constantly harps on about \"doom and gloom\" if his sister carry's on her liaison with Boake.When Ruby realises she will not become Mrs Tackman she agrees to marry Jim Gentry -a working class local boy made good, played by Karl Malden, (funny how he always looks the same age in all his films no matter when they were filmed!).After a boating accident Jim dies and Ruby \"cops the lot\" arousing suspicion in the local town folk who knew Jim Gentry.There is nothing more scary than a woman scorned and when Boke rejects Ruby's last offer of money for marriage, she goes ballistic and purposely ruins his carefully cultivated fields he has reclaimed at great expense from nature but I will not divulge the ending.The poor old doctor does not press his suite enough but Ruby does not fancy him anyway. An interesting new role for JJ who certainly looks \"the biz\" in her tight fitting jeans!","user":"m0rphy","rank":[12,13]},{"title":"Snobbery, hypocrisy, and small-minded people","rating":10,"date":"26 January 2007","review":"It's no big surprise that RUBY GENTRY receives such mixed reviews, because the theme of the film will not appeal to small-town America. Ruby is a girl from the wrong side of the tracks, as the narrator at the beginning of the film states. What this is code for in classic Hollywood is not necessarily straight translation. In other words, we are in the realm of a lost art form: the romantic film, or the melodrama. King Vidor was a master of this craft.<br><br>Ruby, then, was different. She was a free spirit, an unconventional thinker, and a seductive beauty. This is a lethal combination in the small, conservative town Ruby grows up in. She falls in love, of course, with the 'popular' boy, the rich kid, who the most well-bred society girls are after. Of course none of them have anything except their money against Ruby, and Boake (Charlton Heston) knows it! So there is an essential conflict between what Boake wants (Ruby) and what he is expected to have. He, unlike Ruby, is rather weak, and afraid. Deep down he loves her, but he lacks her spirit and wisdom. He won't go after someone looked down on by the town. He has to be 'respectable.' He cares what others think. Ruby does not, so she is willing to fight for him, but at the same time she does not want to be taken for granted. She wants her love to be fulfilled through marriage; he only wants her as a sex object.<br><br>I think it is important to note that Ruby Gentry is not necessarily a femme fatale, nor does she necessarily sin. She simply follows her heart. However, a series of accidents, including the death of her wealthy husband, occur, and Ruby is involved in scandal after scandal. The people always choose to believe the worst of her because she represents what they despise: an independent woman with beauty and natural intelligence, and class mobility.<br><br>RUBY GENTRY is a masterpiece. King vidor, my favorite director, is at the top of his form. Jennifer Jones, a talented and underrated actress, makes Ruby both sympathetic and believable. Charlton Heston is extremely effective as a complex character--one who on the surface seems shallow, but beneath the surface you can still feel his love for Ruby (which he struggles to hide, or deny).<br><br>Boake and his family feel they are above Ruby. Even Ruby's brother is judgmental and calls her a 'sinner,' based on assumptions. The final event in the film is a tragedy, but noteworthy because it was not the fault of Ruby or Boake, but a judgmental, hypocritical, and merciless society, imposing religious and social institutions which hinder us all.<br><br>The film is not dated. If anything, it proves melodrama is more effective than realism sometimes, where larger-than-life human emotions are concerned. People who call a movie like RUBY GENTRY 'trash' are actually in denial that the theme, and the emotions, are as vividly real and relevant now as ever. Anyone who thinks social class, sex appeal, and money do not count for everything in today's world, just as then, hasn't a clue. These are timeless themes, and the relationships in the film, and how they were negatively affected by the prejudice and snobbery around them, can be compared to any number of contemporary homosexual or interracial relationships, among others. How's that for relevance? <br><br>Sometimes the bigger emotions, the tragedies, are more appropriately told in melodramatic terms--because they are serious and heartbreaking and should not be reduced to cinematic language that conveys anything less!","user":"beyondtheforest","rank":[23,29]}]