[{"title":"An overlooked gem","rating":7,"date":"5 May 2005","review":"Peter Maas's book is a non-fiction look at the Gypsy culture, particularly how it has translated into 20th century America. This movie is mostly fiction, although it draws on some of the material in the book.<br><br>It's basically a family drama, with a rebellious youth (Eric Roberts) squaring off against his abusive father (Judd Hirsch). I'm not sure if a case can be made for Eric Roberts as a terrific actor, but he doesn't embarrass himself here, and the rest of the cast, Hirsch, Shelley Winters, Susan Sarandon, and Sterling Hayden, is superb. A fascinating look at a culture that may be dissolving into modern life, and a well-paced and acted film that is consistently entertaining.<br><br>There's a special treat for jazz fans, as violin giant Stephane Grappelli appears in the movie, along with mandolin player David Grisman, performing a medley composed by Grisman and performed with Grappelli on a live album that has always been one of my favorites. This is the only footage I've seen of Grappelli performing, and while it's limited to a few shots, it's still worth the price of admission.<br><br>A DVD release has finally been announced for June 3, 2008.","user":"pninson","rank":[20,21]},{"title":"I don't want a nurse I want a cigarette!","rating":7,"date":"17 May 2009","review":"***SPOILERS*** 22 year old Eric Roberts tears up the screen in his film debut a Dave the heir apparent to take over his dying grandpa's King Zhavico Stepanowicz's, Sterling Hyden, title as the \"King of the Gypsies\". This doesn't go too well with Dave's dad Groffo, Judd Hirsh, who's gambling wife beating and all around incompetence as a Gypsie chieftain had him get disqualified, by his dad King Zhavico, for that long sought and coveted honor.<br><br>As for Dave he had since became disillusioned with his nomadic Gypsie life-style in him having an all-American girlfriend the milky white and strawberry blond Sharon, Annette O'Toole, as well as getting a job, against his family's advice, as a singing waiter at the famed Moma Leone's Restaurant in New York City. Dave now plans to go to California together with Sharon and start up his singing career by becoming, as a guest in a series of local and network armature night TV shows, the next American Idol. That's just how confident Dave is in his amazing, that had Sharon fall in love with him, crooning &amp; singing abilities.<br><br>It's when Dave tries to save his 12 year-old sister Tita, Brooks Shields, form her being forced to marry this overstuffed an corn chip munching couch potato who's parents she was sold, by her dad Groffo, to be marry to that he took things into his own hands. Tita is deeply in loved with the cute and lovable Eli Marks, who from the sound of his name isn't a Gypsie, and is determined to marry him even if it ends up having her estranged from her family and people the Gypsies.<br><br>With King Zhavko handing over the leadership to Dave over his dad Groffo the battle-line was drawn for he epic and final conflict for Gypsie supremacy in all of New York Sate and parts Eastern Pennsylvania: The area that King Zhavko reigns over. All that's left for the fighting to begin is for the ailing King Zhavko to breath his last breath which, as he's lying in his hospital bed on life support, will come at any moment! Powerful and electrifying performance by Eric Roberts as Dave Stepanowicz lifts the movie \"King of the Gypies\" up to Academy Award levels. Even though newcomer Roberts has to compete with seasoned stage and movie veteran and Academy Award quality actors and actress like the aforementioned Sterling Hyden and Judd Hirsh. Roberts also more then hold his own against such top-flight actresses like Shelly winters, as Queen Racael his grandma, and Susan Sarandon, as Dave's mother Rose, as well as young 12 year-old sensation child model Brook Shields who plays his tragic and love sick-for non Gyspie Eli Marks-sister Tita.<br><br>***SPOILERS***Explosive final with Dave having it out with his vindictive dad Groffo, whom he replaced as the \"King of the Gypsies\", at the exclusive Gypise social club in midtown Manhattan. In the end Dave finally realizes that he can't escape his fate, in him being the \"King of the Gypsies\", he then reluctantly follow in his grandfathers footsteps knowing full well that that's the only life he was born into and will remain, like his Grandpa Zhavko, until his dying day.","user":"sol1218","rank":[6,6]},{"title":"Eric Roberts was great","rating":8,"date":"23 December 2004","review":"I first saw this film at a theatre in 1978 and have only seen it on television once. I can't remember what attracted me to seeing it, but it was a surprisingly good movie. Eric Roberts showed the industry that he can act and be very convincing. The central actors must have studied gypsy life because they pulled it off very well. The film is mostly about the tension of the next successor to the throne (Judd Hirsch) and his son (Eric Roberts) whom the present King (Sterling Hayden) favors as his actual successor. Hirsch plays a cold, scheming character who finally does one of the most despicable acts a person can do, and shows no remorse for it. This, in turn, sparks retaliation from his son. If I ever find it on DVD, it will become part of my collection. I give this film an 8 out of 10.","user":"mcdoodad49","rank":[11,13]}]