[{"title":"The First and Maybe the Best","rating":7,"date":"2 March 2006","review":"\"Wild Angels\" was the first of the American International biker pictures, which were a drive-in staple of the late 60's and early 70's. Coming almost a generation after \"The Wild Ones\" these films were enjoyed by anyone who enjoyed a beer-assisted drive-in fantasy about being an outlaw biker for a few hours (they usually played as double features). It was a big game of lets pretend.<br><br>And like \"Wild In the Streets\" much of the appeal was the fear and disgust these things elicited from parents; as they were the only ones who actually took any of the stuff seriously. Many a Peter Fonda poster from \"Wild Angels\" went up on bedroom walls as parents pondered where they had gone wrong.<br><br>The gang in \"Wild Angels\" did not wear Hells Angels colors, they were \"Angels-San Pedro\" although some Hells Angels from the Long Beach chapter actually appeared in the film. AI's biker films had very colorful titles and often mentioned Hell or Angels in the title: \"Devils Angels\", \"The Born Losers\", \"The Savage Seven\", \"The Mini-Skirt Mob\", \"Angels from Hell\", \"Hells Angels 69\", \"Hells Belles\", and \"The Hard Ride\".<br><br>\"Wild Angels\" was ground-breaking stuff when it was released and featured more Nazi stuff than the later films because once the surfers adopted the Iron Cross it was no longer cool. It broke the outrage meter with its finale as the funeral for The Loser (Bruce Dern) turned into a gang-bang of his widow (Diane Ladd), the destruction of the chapel, the assault of the minister, the abuse of the corpse, and a rumble with the outraged townspeople. And throw in some drug use.<br><br>Roger Corman's direction is his most active ever, and the editing by Monte Hellman keeps the pace moving along. You don't notice until it is over that very little actually happened. Fonda is super cool and Nancy Sinatra is unintentionally hilarious. Michael J. Pollard and Gayle Hunnicutt are instantly recognizable in supporting roles. Mike Curb's score is high-lighted by Davie Allan and the Arrows' hit \"Blues' Theme.\"<br><br>Then again, what do I know? I'm only a child.","user":"aimless-46","rank":[24,30]},{"title":"\"A rape of decency! A parody of pleasure!\"","rating":5,"date":"10 December 2005","review":"Roger Corman's modestly-budgeted biker flick for American International opens brilliantly, with evocative shots by cinematographer Richard Moore that promise a lot more than what Corman, screenwriter Charles Griffith, or the cast members can eventually deliver. Plot has Southern California biker gang enjoying rumbles, cycle jousts, hassling the Mexicans, and outrunning the local heat; but when Bruce Dern steals a police-bike and gets shot, gang \"president\" Peter Fonda hatches a plan to break him out of the hospital and thus keep him out of prison. Fairly raw and uncompromising, the picture looks terrific from start to finish, but the line-readings are sometimes so awkward that one wishes Corman could cut back on dialogue and just allow the visuals to tell the story. Sort of the older brother to \"Easy Rider\", \"Angels\" was eclipsed in popularity and relevance only a few years later, but it's fairly gripping and visceral overall, occasionally amusing, and features some fine actors in support (Diane Ladd, Gayle Hunnicutt, Michael J. Pollard, and Nancy Sinatra, whose hospital crying scene is a hoot). ** from ****","user":"moonspinner55","rank":[15,19]},{"title":"An interesting, pioneering picture with some fun moments, but lots of boring filler.","rating":8,"date":"3 April 2000","review":"Roger Corman, the genius of low budget (no budget) exploitation filmmaking, decided to pioneer the 60's biker genre by making this picture about the Hell's angels. He spent time with writer Chuck Griffith hanging out with the Hell's angels, and hearing their stories. Then Corman hired the Angels, along with Peter Fonda (his first succesful movie), Bruce Dern, Nancy Sinatra (Daddy must have not liked this), and Diane Ladd, along with a few others who knew how to deliver their lines when asked for.<br><br>\nThe result is a decently entertaining picture (which most Corman films tend to be), but overall full of filler material that gets boring after a while (such as party sequences that go on for a very long time) as a substitute for character and story development (another Corman trademark as well). As the saying goes, \"Good, quick, and cheap - pick two\". This film, however, wasn't inexpensive according to Corman standards - it cost almost 1 million to make (and it raked in over 3 million in its first week alone, with many bikers rolling in to drive-in cinemas to see it).<br><br>For 1966, the content (people clad in swastikas, partying and drinking their lights out in a protestant church, women scantily clad in their underwear, passing the occasional joint, and 2 inexplicit rape sequences) was obviously a shocker. Today a film like this would have been ten times more disguisting and explicit, and the church scene would be milked for it's offensive potential (and it wouldn't be able to earn the profit this one did, given today's consolidated theater market).<br><br>The film's visual style is exciting, with some interesting camera movement and handheld camerawork, lending a documentary feel (complete with soft focus shots). The soundtrack does not feature any exciting 60's music, only the usual film score by a jazzy rock band. The performances are not as bad as the dialogue itself - if the judges at the Venice Film Festival spoke English, it is unlikely this film would have made it in. Peter Fonda does not come off as a great Hell's Angel, and his performance is on the stiff side (probably afraid of how his dad might react). However, this film - and Corman's next film, \"The Trip\" - inspired Peter Fonda and Dennis Hopper to make Easy Rider (which Corman tried to help finance), a considerably better developed, more meaningful picture than this one - in all departments.","user":"Tgrain","rank":[19,25]}]