[{"title":"No film is closer to perfect","rating":10,"date":"17 May 1999","review":"Take the story from a master like Kipling, give it to a director of classics like THE AFRICAN QUEEN, add a superb script that crackles with wit and cast two of the greatest modern day screen actors in roles that fit them like gloves. The result comes as near to the perfect action-adventure film as you will ever find. Kipling's rousing tale of two British soldiers in the days of high Empire keeps a tight hold of the viewer throughout. The twists of the tale are fascinating, the characters mesmerizing, the whole concept is so ingenious and full of potential that with such a team it simply cannot miss! Caine &amp; Connery are superb together, oozing charisma and obviously enjoying themselves greatly as the two British NCOs.It's possible that neither has ever produced work to match what you will see here, it's wonderful to watch. Huston's direction is top drawer and the feeling of claustrophobic Indian market places and dusty railways stations is so strong it's a relief when the two heroes of the story make their ways into the wilderness to conquer a territory and \"be kings\". \"Billie Fish\", the stranded Ghurka soldier that the pair encounter high in the mountains produces a fine characterisation by Jaffery . His eye-rolling expressions and comic timing are inch perfect in his performance throughout. Perfect too is Christopher Plummer as Kipling himself. Indeed so convincing is he as this most archetypal Englishman that one is reminded how Huston considered casting to be the most important element of his job - to paraphrase, if you find the right actor for the role, he needs no direction! I can't think of a film that more consistantly proves how right he was!<br><br>Through battles, politics, greed and jealousy the two would-be kings gallop untill the final memorable explosive showdown. The last scene is perhaps the most effective and memorable of all. True pathos which tugs strongly at the heartstrings. A fitting end to a marvelous film.","user":"Slime-3","rank":[127,154]},{"title":"Unforgettable.","rating":10,"date":"27 December 1998","review":"The greatest \"buddy film\" of all time. What makes this so? First off, casting two real life friends, Sean Connery and Michael Caine. Second, all other \"buddy films\" are simply comedies. And while the Man Who Would Be King has some laughs in it, and Connery and Caine bounce off of each other almost as good as Abbott and Costello, the story itself is a drama. And what a drama it is. Two English soldiers set out to be the rulers of a country, but can anyone who was a grunt one day, and a king the next, become a King without getting an inflated ego? The answer is no and that becomes the ultimate test for these two friends. Terrific performances by Caine, Connery and even Christopher Plummer, who gives a brief, but good performance as Rudyard Kipling, the man who wrote the short story this film was based on. This film features perhaps the greatest ending to a movie ever made. You will never forget it, and you will wish that you had a friendship as strong as these two individuals.","user":"PJK","rank":[107,132]},{"title":"Exactly the kind of movie that they don't make anymore","rating":10,"date":"27 December 2002","review":"Truly, truly brilliant.  It is so rare that I see a film that I wouldn't change, and I honestly can't think of a thing.  Huston's films so often include that quintessential scene -- the one where his characters realize that they've lost everything, and respond with unbridled true character. Those who cry or bemoan the loss are beyond redemption.  But those who can laugh in the face of disaster, who can ask forgiveness for the patently unforgivable -- they are the greatest of Huston's figures, and perhaps the greatest characters of cinema.  Just as Bogart and Hepburn laugh while they lie in the bottom of a boat awaiting death, Michael Caine and Sean Connery face certain death in this film and respond with complete honesty and complete honor.  For all of their lies and arrogant ambitions, they are still a pair of b*****ds you would love to know.<br><br>Which brings me to the two incredible performances.  It is nearly impossible for such recognizable actors to fade into the guise of their characters. But Caine and Connery manage it, and with perfect aplomb.  As best friends, they are perfectly inseparable, and their innate connection makes for one of the most affecting male friendships in history.  Surrounded, with no reasonable hope in the world, Danny asks Peachy to forgive him for being \"so bleeding high and so bloody mighty.\" And, of course, Peachy forgives him. These are men who sing boldly in the last moments of life.  God bless John Huston.","user":"kcrawford","rank":[86,106]}]