[{"title":"You know, you're the first person to understand I got hurt that day.","rating":7,"date":"23 May 2012","review":"Three Violent People is directed by Rudolph Maté and adapted to screenplay by James Edward Grant from a story co-written by Leonard Praskins and Barney Slater. It stars Charlton Heston, Anne Baxter, Gilbert Roland and Forrest Tucker. Out of Paramount Pictures, it's a VistaVision production with Technicolor photography by Loyal Griggs and music scored by Walter Scharf.<br><br>It's post Civil War Texas and Confederate Captain Colt Saunders (Heston) finds himself with a bride (Baxter) who has a secret past, and taxable assets at his ranch that scheming Carpetbaggers want for themselves. Into the mix comes Colt's brother Cinch (Tryon), who is minus an arm from an accident in childhood - where Colt was his heroic saviour. Things will come to a head as resentments, skeleton's in closets and post war greed will fracture the dynamic of the Bar \"S\" ranch.<br><br>Try to remember that people aren't perfect. They just aren't. They make mistakes. And when they do, they suffer. They pay. Inside themselves they pay.<br><br>It made little impact back on release in 56, where the release of Heston's other film that year, The Ten Commandments, dwarfed it considerably and simultaneously propelled Heston into the big league. It didn't help that Three Violent People is a very character driven picture, literate and heavy on the melodrama. This is no gun slinging action based bonanza, this features interesting characters talking a lot, where the screenplay has the big players nicely drawn, creating a pot boiler that only rewards those open to an intelligently paced structure. The title, sadly, is misleading and doesn't do the film any favours.<br><br>You were one of the rear echelon heroes who hid on General Butler's staff while better men were getting killed in battle.<br><br>Film has definite links to another \"literate\" Heston picture from 1954, The Naked Jungle. Sanctimonious macho male takes a wife and recoils when learning of her past. Cue the fleshing out of relationships for an hour until the pot starts boiling over and the pace ups and unfolds with a pleasingly suspenseful third act. Action until that third act is sparse, though there's good drama to keep one interested, very much so. This is also a gorgeous picture to look at, not just the rugged but beautiful landscape around the Bar \"S\" (Arizona), but also the colours that beam out from the screen, Loyal Griggs' (Shane) photography reason enough to seek out this undervalued Western.<br><br>I got the one with the red hair ready for the buzzards.<br><br>Lead cast performances are up and down, Baxter and Heston's chemistry is fine and sexy, but they do appear to be in competition with each other to see who can steal a scene. Baxter, looking positively ravishing throughout, really over does it early in the pic, while Heston forgoes his most agreeable subtlety from those early passages to ham it up later in the day. The best performance comes from Roland (Cheyenne Autumn), who as Bar \"S\" gran vaquero, Innocencio Ortega, not only looks immeasurable cool, he also casts a humanistic shadow over proceedings. Tryon, whose edgy one armed brother adds major spice to the narrative, turns in a rare effective performance.<br><br>The problems are evident throughout, some over soaping by actors who should have known better and the villains are badly in need of flesh on their bones. Yet this is still a Western that plays better now to Western fans than it would have done back in the 50s. For now the character driven bent can be appreciated without expectation of a \"yee-haw\" fuelled Oater. This be one for the ears, eyes and the brain rather than the pulse. 7/10","user":"hitchcockthelegend","rank":[10,10]},{"title":"More a drama set in the west than a western","rating":9,"date":"10 May 2013","review":"Florid and melodramatic but in a good way. Anne Baxter and Charlton Heston interact with each other much better here than in The Ten Commandments probably because Anne is much more suited to playing a well educated woman of ill repute in the old west than a princess of the Nile. She and Tom Tryon also have an excellent vibe to their scenes. The beginning is on the humorous side with Elaine Stritch showing up and looking very young but still in possession of that basso voice. Then when we get to the ranch there is a fest for old TV viewers with Baretta, Klinger &amp; Sgt O'Rourke from F Troop all showing up. The film is nothing original but is well shot and enjoyably action packed, a good example of the genre and Anne is very good.","user":"jjnxn-1","rank":[10,11]},{"title":"great shootout, like they don't do them anymore.","rating":8,"date":"18 November 2004","review":"I saw this film when it was released in 1957 and remember very well that I did not like it. I saw it again yesterday and loved it. How can one explain that? No doubt that when you get older, your taste might change, but in my case that seldom happens with films. Rather I would conclude that the moods of the times change, so in 1957 there was no mood for this type of film, it was categorized as an average western, probably because people were tired of them. Nowadays when they are so rare you learn how to appreciate the good ones. The story is about the unscrupulous treatment some ex confederates were given by some bandits trying to take advantage of the period that followed the war. Heston is one of them and so is his brother Tom Tryon. Heston marries an ex saloon girl Anne Baxter but he does not know about her old profession. There is not much chemistry between Baxter and Heston, this is the only negative point of the film. He combined better with someone like Eleanor Parker with whom he starred in 'The Naked Jungle'. There is a great shootout, the kind of which you don't see in westerns anymore, they just lost the touch. I also did not understand, like mentioned in a previous comment, who are the three violent people, I only noticed two, Heston and Tryon. Baxter? No way.","user":"tmwest","rank":[21,26]}]