[{"title":"They don't make em like this anymore...","rating":1,"date":"1 September 2000","review":"This film has the same wonderfully subtle direction as \"The Heart Is A Lonely Hunter,\"  \"Diary Of A Mad Housewife\" and \"Goodbye Columbus.\" The lost 60s/70s style for dialogue films with immediately profound social messages is probably best exampled in \"EGROMMM\" -- Newman's daughter (Nell Potts) plays the stoic, life-dampened child who refuses to let her drunken slob of a mother destroy her brilliance.. at least for now. We're just slightly distant observers in this style of filmmaking. You won't get under anyone's skin or into anyone's head. But you may have grown up in similar circumstances, god forbid. An excellent film about the subtleties of abuse without coming across preachy in the slightest. Deeply moving.","user":"Neff-3","rank":[26,26]},{"title":"A Truly Wonderful Film","rating":10,"date":"6 January 2005","review":"\"This is an adaptation of Paul Zindel's wonderful but tormented play. This play itself is compelling and has a kind of Tennessee Williams flavor; especially \"The Glass Menagerie\" and \"A Streetcar Named Desire\". The adaptation is very successful as the production designer (Gene Callahan) manages to transfer the book's psychologically oppressive ambiance to film; \"shame hangs in the air of this house\" like a cloud of poison gas.<br><br>Director Paul Newman gets performances from his cast that pull together parallel stories of how a \"strong, strange, and beautiful\" flower can unexpectedly spring from an environmental wasteland. His most difficult task is restraining or masking Joanne Woodward's earthy likability so that we waste little sympathy on her character. But using Woodward as the mother allowed him to get a once-in-a-lifetime performance from their daughter (Nell Potts as Matilda-Tillie in the play). Potts abandoned acting after this movie but her ethereal take on Matilda is right on the money and a big reason why the film works so well.<br><br>This is really just a story about Matilda's science fair project in which marigold seeds are subjected to varying amounts of gamma ray radiation (the independent variable in her experiment). Those flowers receiving a moderate amount of radiation bloom in amazing and wonderful ways. However, those flowers subjected to additional radiation either have their growth stunted or whither and die.<br><br>Meanwhile Tillie and her older sister Ruth are living an analogous story with their mother Beatrice in an extremely emotionally abusive household. In the play it is stated that Beatrice is insane but not how or why she became this way. In the movie the viewer soon reaches this same conclusion. Older daughter Ruth (an amazing performance by Eli Wallach's daughter Roberta) maintains a fairly normal lifestyle at school, she is a majorette and popular but is very selfish and demanding of attention. Notably she is also an epileptic, which is subtly significant because it is analogous to receiving an excessive amount of radiation. Tillie is very different (analogous to receiving a moderate amount of radiation), seemingly shy and withdrawn, she is actually very independent and has found an outlet from the family in her science projects. This outlet serves as a protective niche in which she can bloom.<br><br>A truly great scene is Matilda's acceptance speech at the science fair. She explains the results of her project and really lays out the main theme of the story for the viewer. Watch as she mentions how excessive radiation causes dwarf plants, at that point they cut to a closeup of Ruth in the audience. Both the experiment and the family illustrate that while a reasonable degree of adversity can actually be beneficial, too much of the same adversity will poison life. <br><br>While this would be a good film if focused solely on Matilda, it is elevated to extraordinary because Newman chooses to also make Ruth a central part of the story. The conventional \"movie-way\" to tell this story would be to make it an inspirational tale of triumphing over adversity; of free-will overcoming destiny. But fortunately Newman elects to show both sides of the story, in Ruth he shows someone who never has a chance, who cannot recognize her destiny or ever hope to overcome it.<br><br>Then again, what do I know? I'm only a child.","user":"aimless-46","rank":[36,39]},{"title":"Well-directed, affecting character study...","rating":9,"date":"27 December 2006","review":"Paul Newman again surprises (along with \"Rachel, Rachel\") as Joanne Woodward is presented in the unglamorous role of Beatrice Hunsdorfer, a bitter widow living on the fringe in an anonymous Connecticut suburb.<br><br>Nell Potts and Roberta Wallach in diametrically opposed roles, Ruth, the epileptic popular daughter, and Mathilda, the science-project sensitive daughter who relates to her pet rabbit.<br><br>While some is a bit overdone it is no stretch to imagine a bored housewife trying to make ends meet; Woodward is sympathetic and annoying at the same time. A brilliant performance.<br><br>This film was made in 1972 and it would truly amazing to see real character portrayals in film again. Today we have to visit the theater for such affecting performances. Well worth more than one viewing. 9/10.","user":"MarieGabrielle","rank":[15,15]}]