[{"title":"Positively surreal Blaxploitation Bond","rating":8,"date":"15 December 2006","review":"And none the worse for it, since every Bond film needs a fresh spin on the same old formula. Roger Moore's first outing as JB is, in equal measures, comical and action-packed. You'll never get bored. But it's definitely the weirdest Bond ever with loads of utterly bizarre moments.<br><br>It begins with M turning up at JB's house in the early hours while he's pumping some Italian agent for information (don't you just love his initialled dressing gown). Before sending him to America to investigate a Harlem pimp known as Mister Big he delivers some gadgets from Q-Branch, including a very useful watch. Q himself, or Major Boothroyd if you want to call him by his proper name, doesn't make any appearance in this one.<br><br>Standing out like a Muslim in an airport, almost every single black person JB encounters in Harlem is on Mister Big's payroll. And they've got a seemingly endless bag of tricks to play on him. The funny thing about Moore is that he's very proper and British and doesn't think anything of walking into a tough Harlem bar while dressed up like the Duke of Edinburgh. His stunned reactions when they mess with his head are seriously funny.<br><br>The action then moves to Lousiana and a savage Caribbean island as JB uncovers a massive heroin plot. There's a particularly long speedboat chase across a bayou where JB encounters Sheriff J.W. Pepper, the most stereotypical southern redneck ever. Think of Texas Businessman from The Simpsons and you get the idea. JB also gets to dodge a hundred hungry Gators and do, many times over, Solitaire, Mister Big's Tarot card reader.<br><br>I'm not sure what kind of formidable villain uses a Tarot card reader to help him do business but when you also surround yourself with a hook-handed maniac called Tee-Hee, a quiet fat guy called Whisper and a seemingly unkillable voodoo high priest called Baron Samedi then you really do become a serious baddie. Right? He even goes on a big speech about how his master plan works before attempting to kill JB slowly. Obviously this makes much more sense than just shooting him right away. When will they learn?<br><br>Despite being the oldest actor to debut as Bond (at 46), Moore does look younger than Connery. And while Sean was gruff and Scottish, Moore is perpetually calm and refined, even in the face of danger (fingers being chopped-off, snake in the bath, being eaten by gators/sharks). Everything that the British once thought they were. He has a certain sarcastic edge that the other Bond actors lacked. While some of his films may have been the sillier of the franchise, Moore has always been my favorite. And the massive revolver and holster he uses at the end is so much more masculine than the usual, wimpy as hell, Walther PPK.<br><br>And, as much as I am no fan of Paul McCartney, you gotta love that theme song! Exciting and iconic at the same time. And also yet another juxtaposition in the weirdest Bond movie ever. <br><br>MI6, Harlem, Pimps, Paul McCartney, Gators, Heroin, Voodoo, Snakes, Sharks, Clairvoyance, Rednecks, Afros, Fake Afros, Fillet of Soul, Human Scarifice, Scarecrows and a small-headed man in a Top-Hat who lost a fight with chickens. Is this a Bond film or did the whole world just go insane?","user":"CuriosityKilledShawn","rank":[100,132]},{"title":"A new era for James Bond, and a fairly effective and enjoyable opening film.","rating":7,"date":"11 January 2005","review":"Live and Let Die ushers in Roger Moore as the new James Bond. Prior to this movie, Bond had been played most often by Sean Connery, with the one exception being George Lazenby's short-lived stint in 1969 (On Her Majesty's Secret Service). Moore is very different to Connery and Lazenby. He plays Bond as a more relaxed, charming, humorous character. Over the years, many people have said that the Moore incarnation of Bond lacks the brutality of Connery's and the hard masculinity, but actually Moore is not the kind of actor to do Bond in that manner. He's merely playing to his own strengths, and creating a Bond that is akin to his acting style. I feel that Roger makes a perfectly likable 007, admittedly different to the character of the novels, but still a rousing screen hero.<br><br>The story has James Bond sent to solve the killing of three British agents. One was killed in New York, one in New Orleans, and the third on a voodoo-practising Caribbean island. Bond's starts his mission in New York, where he runs across a nasty black gangster named Mr Big and his gorgeous, tarot-reading accomplice Solitaire (Jane Seymour). Bond heads down to the Caribbean, where he \"connects\" Mr Big with a drug-smuggling big-shot named Dr Kananga. Then it's off to New Orleans, where Bond discovers that Kananga's master plan is to provide huge amounts of free heroin to the junkies of the world, creating a massive drug-reliant population and setting himself up as a supplier with a worldwide monopoly on the drug trade.<br><br>The title song, sung by Paul McCartney and Wings is one of the best of the series, a lively and powerful tune which fits the style and period of the film perfectly. Yaphet Kotto is a decent bad guy (his death scene at the end is both funny and memorable); Seymour is superb as the Bond girl (probably the best of the bunch apart from Barbara Bach in The Spy Who Loved Me). There are good set pieces as we have grown to expect from the Bond series, most notably a spectacular boat chase around the Louisiana bayous, a scene involving a bunch of hungry crocodiles, and a slick sequence featuring Bond's escape from corrupt island police aboard a slow and lumbering double decker bus. The film has some negatives, but not too many. The character of Baron Samedi doesn't fit in the film (check out that ludicrous closing shot, which seems to be hinting that Samedi is somehow immortal), and Clifton James's brash southern cop is an immature and irritating character who might just as well have been left out of the final cut. On the whole this is a good start to the Moore era, though. One point of interest:- Live and Let Die also features a scene in Bond's house at the very start..... only once before have we seen where Bond lives, and that was at the start of Dr No.","user":"barnabyrudge","rank":[35,43]},{"title":"Bond Over Easy, Cool But Dumb","rating":7,"date":"24 July 2004","review":"Was Roger Moore channeling Austin Powers in 1973? There's a scene in this, his first go-round as 007, where Bond is tied up and his arm is cut to draw blood and attract some hungry sharks swimming below. Moore twitches his eyebrow and asks: \"Perhaps we can try something in a simpler vein.\"<br><br>Those sharks don't need any frickin' laser beams on their heads to get you to smell the Austin. Moore gets a lot of blame for turning the Bond movies into weakly-plotted farces, ignoring that the series had been moving in that direction since \"Goldfinger\" and that the previous installment, Sean Connery's final EON bow \"Diamonds Are Forever,\" was every bit as goofy. Also, Moore could deliver a more serious Bond when the script allowed, and two of the finest Bonds ever, \"The Spy Who Loved Me\" and \"For Your Eyes Only,\" were his.<br><br>But there's no getting around this, \"Live And Let Die\" is a dumb movie. The gadgets are silly, the villain's scheme is ill-defined, the storyline is frenetic and unengaging, the action is plodding and overlong. Moore starts out not quite know how to play Bond here, while the movie requires him to play the fool sauntering through Harlem in a double-breasted suit like the Prince of Wales waiting for some natives to show him around.<br><br>But this film makes me smile, in part because I'm young enough to remember what it was all about when it came out. If this was Bond for the cheap seats, it at least delivered the goods, with some vivid supporting characters, a knockout visual style, amazing title music from Paul McCartney, and most importantly for Moore's future in the series, drop-dead quips. My favorite is when the nasty Tee Hee twists his pistol muzzle out of shape with a metal pincer arm, then giggles when he hands it back: \"Funny how the least little thing amuses him.\"<br><br>Julius Harris is menacing but charming as Tee Hee, mostly mute except when he sticks Bond in a gator pond and suggests the best way to disarm the beasts is to try and pull out their teeth. Chief villain Yaphet Kotto has his moments, too, but with odd shifts of character. In the beginning, he's stone-cold Ron O'Neal in \"Superfly,\" and at the end, he's plummy Charles Gray in \"Diamonds Are Forever.\" Jane Seymour is Bond's love interest, and why she goes off with him is another of those things best not thought about long.<br><br>There are two great characters in this movie, though, bigger than just about anything seen in a Bond movie before who kind of work in tandem in overhauling any objections about this film being too \"cartoony.\" Clifton James is redneck sheriff J.W. Pepper, who throws off one madman line after another while Bond is off on one of his long silly chase scenes. James mugs through every scene he's in, rolling his tongue around, playing off everyone and everything, and delivering every hackneyed Southern stereotype to such righteous perfection it's enough to make cotton sprout out of his ears. Bond purists who whine should just take their vodka martinis shaken not stirred and let the rest of us enjoy the craziness. The series is supposed to be fun; if you want serious espionage go watch \"Smiley's People.\" (I grant you Pepper shouldn't have returned in the next Bond film; that was a mistake.)<br><br>The other great outsized character is Geoffrey Holder as perhaps the most mysterious figure in the whole series, Baron Samedi. Is he supernatural? Is he just crazy from the heat? He's certainly different, a guy who sides with the bad guys without quite being one of them. The always-eerie quality of his appearances, either dancing in a big hotel production number or quietly sitting in a cemetery playing a flute, make you question whether there ain't something to that voodoo after all.<br><br>It's silly bashing Pepper but praising Samedi, they are both equally so unreal, in a way that's in tune with the rest of the movie. The best thing to do is enjoy the different kinds of fun on offer. Frankly, not having these guys around might push this film on the bad side of Spinal Tap's \"fine line between stupid and clever,\" the side where \"A View To A Kill\" and \"Moonraker\" are on.<br><br>But \"Live And Let Die\" is a winner. It's a fun movie that brings me back to younger days, when my heart was an open book. It's a nice transitional film for the series in that Moore managed a mostly smooth entrance to the role of Bond. And it has one of the best final shots in movie history. That's all I'll say there; you know it if you saw it.","user":"slokes","rank":[80,110]}]