[{"title":"View it on it's own, not as a spoof or adaptation, and you might enjoy!","rating":20,"date":"20 September 2002","review":"I've never read the Modesty Blaise comics.  What inspired me to rent this DVD was a love of 60's kitsch fashions, and an immense respect for Monica Vitti.  And while I was baffled by the events in the film -- it didn't seem to make a DAMN bit of sense the first time around -- I still found myself loving it.  And on repeated viewings I love it even more.<br><br>What's to love?  Primarily, the quirkiness of EVERYTHING in the film: the direction is off-kilter (so many things happen in parts of the screen that you're not looking at, and the pacing is bizarre to say the least: a constant string of anticlimaxes that I found refreshing), the acting is deadpan and weird (Bogarde's shifty, psychopathic, and slightly flaky villain...Stamp's disgruntled but cheerful anti-hero...Rosella Falk's twitchy, wide-eyed, barely-restrained violence -- she is a stand-out highlight in the movie...and Monica Vitti, expressing herself mostly through strangely-timed gestures and facial expressions...just check out her \"How do you get this off?\" routine), the sets are gorgeously dressed (Gabriel's atmospheric island, and the fantastic cell with the spiral staircase), and the plotting is all over the place.  Who's double-crossing who?  Why are they doing that?  WHAT THE HECK IS GOING ON?  On first impression, I felt the film was just \"winging it,\" making it up as it went along.  But far from it...it's elaborately plotted, just strangely presented.<br><br>Really, I love this film, and I'm so glad it's seen re-release.  It's sloppy, crazy, irreverent, and fun.  If you view it as a weird little film -- not as a spoof, or an adaptation of the comic, or a reflection of the times, or as an attempt to be hip or strange -- I think you'll enjoy it as much as I did.<br><br>And yes, the clothes ARE fantastic.","user":"Muffy-5","rank":[50,54]},{"title":"Mod mod mod mod mod mod mod Modesty!","rating":4,"date":"4 June 1999","review":"A delicious phantasmagoria of feathers, frolics, fashion, false eyelashes, frivolity, fol-de-rol, foppish frothiness and all that was mod and mad in that giddy year, nineteen-sixty-six.  Monica Vitti is nothing like the comic book character created by Peter O'Donnell and Jim Holdaway--the original stories have been reprinted and are worth checking out.  In his memoirs Terence Stamp recalled that Vitti was so clumsy it was hard for her to get through even simple stunts.  The film is in reality a paean to style and to the triumph of presentation over substance which was a lot of what Sixties fashions were about.  Vitti's wigs pretty much steal the show--Dirk Bogarde, in blond toupee as evil mastermind Gabriel, and Rosella Falk as Mrs Fothergill (a sort of sadistic Emma Peel) clean up on what's left.  The music is a lot of fun--indeed fun is the operative word here.  Serious squares can keep their dull movie critic vibes out!","user":"Gothick","rank":[39,45]},{"title":"MODESTY BLAISE (Joseph Losey, 1966) **1/2","rating":6,"date":"24 August 2006","review":"Truth be told, I hated this movie on first viewing many years ago and, in fact, I only just now purchased the utterly bare-bones Fox DVD for three reasons: the disc is now out-of-print; I found it very cheaply (surprisingly) at a local retailer; and, most importantly perhaps, I was prepared to give it another chance thanks to my ongoing (and very rewarding) Losey-thon.<br><br>To say that Joseph Losey was a strange choice to helm this picture would be a massive understatement. In his previous films, very rarely (if at all) had he shown that he had any sense of humor, much less the kind of campy, knowing and irreverent one essential for successful comic strip adaptations. As it happens, the film was not well-received and both leads - Monica Vitti (who apparently phoned Michelangelo Antonioni everyday during the shoot) and Terence Stamp - were unhappy making it; there are those who even go so far as to consider it not just Losey's nadir but quite simply one of the worst films ever made! Well, based on that first TV viewing of it, I probably would have endorsed such sentiments myself... <br><br>However, my re-acquaintance with it proved something of a minor revelation: while still as uneven as I recalled, I couldn't now deny that there were some delightful elements which, on the whole, made the film palatable and, at times, even endearing: Evan Jones' script was occasionally quite witty, Losey's own trademark odd compositions (usually so overpowering in his melodramas) suited the \"anything goes\" mood of the material, Jack Hildyard's glossy cinematography of attractive Mediterranean locations, outrageous outfits and groovy production design was top-notch and Losey's frequent composer Johnny Dankworth provided an infectious score.<br><br>And what about that cast? Monica Vitti (who would have guessed that she could ever be as attractive and sexy as this judging by her work for Antonioni?), Terence Stamp (gleefully throwing knives, bedding women and engaging in a charming, impromptu singing duet with Vitti while driving up a mountaintop and reprising it for the action-packed finale), Dirk Bogarde (ironically named Gabriel, he was never campier - or gayer - than as the silver-wigged, self-proclaimed \"villain of the piece\"), Michael Craig (as Vitti's ex-lover and pursuing British agent), Harry Andrews (as a top British Secret Service official firing away bullets from his umbrella), Alexander Knox (as a bumbling British MP forever mispronouncing names and giving out the wrong information), Clive Revill (for no apparent reason in a dual role: as Bogarde's right-hand man who keeps the accounts even on the field of battle and as Vitti's \"father\", an Arabian Sheik!), Rossella Falk (as the lethal Miss. Fothergill, Bogarde's manly assistant, who keeps a regiment of mostly aging men in shape through arduous physical exercise), Saro Urzi (as a lowly, opera-singing henchman of Bogarde's), Tina Aumont (as an ill-fated conquest/informer of Stamp's) and real-life magician Silvan (as a duplicitous circus performer).<br><br>Ultimately, while the plot is too convoluted to follow at times and the film itself may not be in the same league as Mario Bava's DANGER: DIABOLIK (1968) or even Roger Vadim's BARBARELLA (1968), it's certainly an engaging spy spoof and far better than its reputation suggests.","user":"Bunuel1976","rank":[22,27]}]