[{"title":"Mild police drama.","rating":5,"date":"20 December 2015","review":"Originally intended to be the sequel to \"Jagged Edge\", the Burt Reynolds vehicle \"Physical Evidence\" is just barely adequate. The veteran star, and noted author / occasional filmmaker Michael Crichton, seem to be just going through the motions. A very routine and forgettable picture, it's clumsily written, boringly handled, and saved to a degree by a solid supporting cast.<br><br>Burt plays Joe Paris, a detective with a nasty temper who's currently on suspension. He makes a plausible suspect when a notorious sleazy criminal turns up dead, and it's up to the crusading public defender Jenny Hudson (Theresa Russell) to clear his name.<br><br>Russell tries hard, and does look absolutely great, but she is indeed simply miscast in her role. Burt looks like he can't wait to leave the set and cash his paycheck. Burts' frequent co- star Ned Beatty has a welcome presence as the district attorney who is sure that the case is a slam dunk for him. Kay Lenz is also lovely as always, and appealing, as a mobsters' wife. Ted McGinley is appropriately odious as Jenny's smarmy yuppie boyfriend. Tom O'Brien is a convincing jerk as the obnoxious lowlife son of the murder victim. Kenneth Welsh is excellent as always as a snooty crime kingpin. And Ray Baker does what he can with an underwritten role as a cop.<br><br>Somewhat slick, but too predictable, and too silly, to really work all that well.<br><br>Filmed in Toronto and Boston.<br><br>Five out of 10.","user":"Hey_Sweden","rank":[8,8]},{"title":"Agreeably dumb...","rating":5,"date":"16 May 2008","review":"Michael Crichton directed this flighty, flimsy cop-show starring Burt Reynolds as an officer framed for murder. Crichton, who did not pen the script, seems a curious choice to helm such second-rate material, but he makes something enjoyable out of it--even though one is inclined to scoff at the plotting and outrageous incidents in place of laughing (I did both). Laid-back Burt is positively enervated, yet he actually does the picture a favor by playing it so low-keyed (Crichton's general handling is outré enough). Completely outlandish, though it contains some surprising bits of humor and an odd little nasty streak which is intriguing. It's a guilty pleasure, with Crichton chortling in the background. ** from ****","user":"moonspinner55","rank":[7,9]},{"title":"\" Burt Reynolds is a hard, violent and corrupt policeman in this thrilling, cruel and realist film...\"","rating":18,"date":"18 March 1999","review":"A lot before \" Payback \", with Mel Gibson, the cinema already showed violent and shocking stories in which the \" hero \" was, without a doubt, more evil than the bad guys! in those films it was impossible that the people who were watching it become indifferent to the intrigue, and therefore, these films won in the originality inquiry , exactly for showing the \" heroes \" without artifices, closer to the reality. In 1989, Michael Crichton directed an explosive and tense thriller, and he chose the star Burt Reynolds to interpret the main character... Perhaps Crichton didn't know, but the heavy, powerful and lowering presence of Reynolds helped to transform \" Physical Evidence \" in one of the best (and more violent) films of the gender, better than \" Payback \" or any other...with a hate and frustration glance , a cynic and bitter smile and his black and big mustache, Reynolds built one of the most complex and lowering characters of Hollywood's history. Joe Paris (Reynolds) is a hard cop, alcoholic and violent. A man who hates the world and the people in it.He doesn't get to control his temper and he is a true clock-bomb, an unexpected man who is capable to kill somebody at any second. When the body of a well-known boss of the crime is found with his throat cut, Paris becomes, in the eyes of the police, the main suspect, after all the criminal was an old enemy of Joe. Jenny, a public defender, decides to help him, she trusts this mysterious man and she tries to, at every cost, prove his innocence, and she finishes falling in love for him. Managing Michael Crichton builds an excellent film, with a good rhythm, always maintaining the exact dose of suspense and tension.As he had already shown in his other films, Crichton demonstrates that he knows how to ally a good plot with a cast at the same height and value. The scene in which Paris literally destroys some men who insult him is really frightening. He even  threads a man's head through the window of the car. Paris is not, without a doubt, the good and nice cop that Bruce Willis interpret, on the contrary, Paris is a killing machine, a man who finds himself strange and full of rage! unlike the characters that Bruce Willis interprets, Joe Paris is revengeful, unfriendly, explosive and intolerant, that is to say, he is not afraid of anything: the death, in the vision of Paris, is a marked encounter for which he waits a long time. Paris is not afraid of death, he knows he has no limits, and he'll kill anyone who trespasses it. \" Physical Evidence \" is a dark and dramatic thriller. It seems the crime-drama films of the seventies. The movie explores the corrupt policemen's cruel and degrading routine: the prostitutes, the homosexuals, the criminals. In this film, the cops smell cocaine and they kill without pity. The streets are filmed as stages of betrayal and tragedies. In the middle of this treacherous sets \"Physical Evidence \" intrigue is developed. This is not a film for sensitive people. Reynolds, after his fascinating return in the masterpiece \" Boogie Nights \", signed a contract with the television net TNT, owner of the best and largest studio for films made for television, and he offered to his fans of the whole world the same character type again. In \" Hard Time \", Reynolds interprets a violent, dangerous and explosive policeman, but perhaps Joe Paris has been his most frightening and mysterious character, a man consumed by the drugs and the hate... Fascinating and violent, this film is a true masterpiece of the gender! watch it! Burt Reynolds once again gives an interpretation show and he demonstrates the reason why he is one of the most consecrated actors of Hollywood! and in this film he has the chance of exploring all his charisma, all his charm and talent. Unlike similar films, like \" Die Hard \", a shot in \" Physical Evidence \" is more violent and shocking than each one of those films together, exactly because Reynolds' film explores the reality! in the films, when a thief is wounded, he falls down on the ground and he dies at once. In \" Physical Evidence \", you are wounded, you fall and you die well slowly as it is in fact! intrigue, romance and action, all this is shown in this sad and dark film!it is sad the fact that the Academy didn't recognize the effort and the beauty of this work, and it is also sadder for this film not to have been seen a lot. But you have to discover this work! rent \" Physical Evidence \" and get ready to root for the bad guy! (and this time the bad guy isn't Mel Gibson - He is Burt Reynolds, the man who makes all the difference!)...","user":"ary","rank":[13,22]}]