[{"title":"Troma DVD release made me mad!!!","rating":4,"date":"17 May 2005","review":"The recent release of \"Mad Dog Morgan\" on Troma DVD is disappointing.This appears to be a censored print for television viewing. Some of the more violent scenes have been edited and portions of the colorful language have been removed. Anyone who viewed the film uncut will be mad as hell at this toxic DVD version. \"Mad Dog Morgan\" deserves to be released on DVD in the original theatrical cut. However, even as released on DVD, the film is still one of the better depictions of bushranger life in nineteenth century Australia. After having toured the Old Melbourne Gaol, with death masks of convicts on display, it is \"Mad Dog Morgan\" that comes to mind.","user":"BluebirdCN7","rank":[24,27]},{"title":"Hopper turns Irish outlaw.","rating":8,"date":"22 January 2007","review":"Australia, in the 1850s. An Irish man Daniel Morgan starts off as gold-seeking immigrant who turns to robbery and gets sentenced to 12 years prison time. This is where the going gets truly tough and scars his mind. After a couple years he gets released. After befriending an aboriginal named Billy, he becomes a bushranger with an ever-growing bounty looming over his head. The two go out of their way to seek those prominent figures for turning him into what he is and for pushing him to the brink of self-destruction. On his trail is the determined Detective Mainwaring, which puts even more pressure on the cracking mind of Daniel \"Mad Dog\" Morgan.<br><br>I heard of the film before, but never had the chance to see it until just recently when I managed to pick myself up a copy of the film. Those who believe this to be a sorely forgotten Australian gem, do make a valid point and I'll be jumping onto the bandwagon too. Cult Aussie director Philippe Mora makes his directorial debut with an interestingly odd, exploratory and rampant curio piece of an Australian bushranger folk legend. It doesn't feel like your basic outlaw movie, as hounding the picture is a socially minded lashing of corrupt power taking away the respectability of a lone and misunderstood figure (Daniel Morgan). We watch the spiralling depiction of a fazed man fighting a society who thinks they are better accustomed and more civilized than him because of his actions against them (but that's far from the case). I didn't think it was going to be as harrowing and potently involving as it was, but this is very much largely thanks to spellbinding method actor Dennis Hopper's (who fell out favour with Hollywood at the time) multi-layered performance as Mad Dog Morgan. His erratic changes in mood (from being placidly polite to passionately quick tempered) are very successfully timed and indeed convincing. One of his best.<br><br>Leading the way is a strong Australian support cast with their characters getting enough time to shine. David Gulpilil is a good choice as Billy and has a budding rapport that works along with Hopper's character. Frank Thring stands out as the aggressively bull-headed Superintendent Cobham and a poignantly stern Jack Thompson makes the most of his small role as Detective Mainwaring. Also lurking on screen with tip-top (and some quirky) performances are John Hargreaves, Wallace Eaton, Bill Hunter (who chews up the scenery) and Bruce Spence ticks in with a blink and you'll miss it spot. These are very human characters and cast do a fine job in bringing that to the screen. Mora has crafted a roughly violent tale that skews between cheekiness and a spiritual foray in a well up drawn period. The story jauntily breezes by to begin with then falls into some patchy holes when it can drag, but never gets dull or loses its bitingly ironic edge. It seems to be more complex in its character's reactions than the basic narrative lets on. Mora smoothly plays along with his stylish filming techniques and has a gifted eye for short spurts of flair and (at time surreal) images. No more than some of the well mounted photography by Mike Molloy focuses on the vastly stunning backdrop of the untamed Australian wilderness and accompanying the action is an diversely roaring music score that fits right in with the style Mora's going for.<br><br>\"Mad Dog Morgan\" is an overlooked Australian rarity of the 70s, which is hard not to be highly fascinated by its boldly rough and evocatively baseless treatment of the stirring material.","user":"lost-in-limbo","rank":[9,9]},{"title":"A harsh complaint against social injustice.","rating":7,"date":"27 May 2001","review":"Philippe Mora's film has more often than not been categorized as a western but might as well be called a political drama. The central character, the famous bushranger Daniel 'Mad Dog' Morgan becomes a bandit as a result of the harsh treatment the racist and unfair government doles out to the poor and ethnic minorities in Victorian Australia. The extremities of this injustice is made clear when a Chinese settlement is burned down -without there being any notable sanctions- while Daniel Morgan is locked up for six years for stealing some clothes. The victim of condoned rape and torture in prison, Morgan swears to revenge himself on society and becomes a sort of down under Robin Hood, much loved by the common people.<br><br>Those who love smooth Hollywood storytelling will not be entertained by the rambling structure of this film. However, there are moments of rough and ready poetry to be had for those who care to take a chance and watch something out of the ordinary. Morgan's friendship with Billy, a young aboriginal who saves his life and becomes his partner in crime, lends a strong, anti racist statement to the film which is quite unique. The script is very fragmentary, only dealing with the highlights of Morgan's career. Still, the sober treatment of the story and balanced portrayal of the bandit's growing frustration with the law and life itself, makes for compelling watching. <br><br>Dennis Hopper was never better than in this part. The transformation from excitable but honest and friendly Irish immigrant to desperate and saddened outlaw, hunted down by the police and tired of running, is minimally but very persuasively handled. Those of you who are familiar with the sentimental nature of the Irish, will recognize Hopper's truthful treatment of the character.","user":"libertyvalance","rank":[15,17]}]