[{"title":"\"There must be a meaning. If there isn't you make one up. Otherwise you can't live.\"","rating":7,"date":"20 January 2007","review":"Stig and Marta are two young musicians playing together in a Swedish orchestra. They meet, they fall in love and they get married. If this synopsis leaves you expecting a romantic film, you'll be disappointed to find out a rough, realistic, yet very sentimental piece of art. <br><br>In this film, Bergman uses a quite interesting storytelling method that works really effectively. Although the way their marriage ends is revealed to us in the opening sequence making the rest of the film a flashback (a technique with which Bergman is already familiar with), when the movie reaches its final scene, one can't help but be extremely moved by the way things end up. <br><br>Once again, the performances are great and it is clear that these actors open up their own private world for all of us to see, and they can do that simply because they feel comfortable with a director like Bergman. They know they are in safe hands. Victor Sjostrom definitely steals the show (and Bergman will work with him again in Wild Strawberries), but it is the face of Maj-Britt Nilsson (Marta) that will remain in your mind for a long time. <br><br>Already in these early films of his, the Swedish master shows his love for close-ups. He likes to diminish the distance between the audience and the actors, especially their faces, sharing the belief that not only their eyes, but also the texture of their skin can reveal to us a whole lot of things about the characters. After all, close ups are one of the great advantages of cinema that have ultimately become one of the most characteristic building blocks of this art form, and Bergman working simultaneously in the theatre, is very much aware of that. Although the extreme close ups are easier to notice and admire, Bergman has also a great arsenal of shots and camera movements that so easily uses in this film. The shots of the orchestra performing either from high above or through the musicians, shows a camera that can move constantly but also in a discreet and, one could say, abstract way. He also proves to be very capable with mise-en-scene, as deep-focus long takes are used in several scenes. <br><br>The use of music is also notable, as you will definitely see for yourselves in the remarkable montage sequence in the ending. Classical music is of course common in the director's filmography, but it follows certain stages that are worth mentioning. In his first period, in which \"To Joy\" is definitely included, Bergman uses pieces performed by large orchestras, grandiose in a way. And it's certainly no coincidence that in these films, a great number of characters are used for narrative purposes (surely Stig are Marta are in the foreground, but there's also the conductor, Sonderby, the mistress and her old husband, Marcel and a few others). But from early 60's on, begins a period in which Bergman uses music of a smaller scale (especially string quartets) and in these films very few characters are introduced to us and, very often, in an isolated place (e.g. Through a Glass Darkly, Silence, Persona). <br><br>If you watch carefully this film, you will see many signs of what Ingmar Bergman is going to evolve to. His dramatic approach in human relationships and his effort to capture those moments between two heartbeats, between two lovers. But also his realistic point of view, especially when it comes to marriage (as Scenes From a Marriage a good 20 years after will confirm). A very good film.","user":"theachilles","rank":[17,18]},{"title":"to the joy of Bergman and combining drama and music","rating":9,"date":"30 July 2007","review":"Ingmar Bergman's seventh film, To Joy, is actually a fairly bitter film, more often than not, in looking at the destructiveness of a marriage between two people who somehow got stuck with each other to fall in love. And yet there are some moments that are quite joyful, or at least in the terms that Bergman will allow from time to time, and they help ring this as less a total work of despair than an examination of 'average' people who can't stand not having more. Stig (Stig Olin) and Marta (Maj-Britt Nilsson) meet as they're both musicians in an orchestra conducted by Sönderby (Victor Sjostrom). <br><br>She's the only woman in the orchestra, but it's not exactly that they have love at first sight in the slightest. Their connection grows following a party where Stig gets drunk and makes a depressing grandstanding fool of himself in front of friends, and somehow his downbeat manner is charming to Marta. Soon they grow closer, even fall in love perhaps, though their future marriage is complicated by Marta becoming pregnant. This scene, when she reveals it three months on to Stig, is the first real crack in the relationship. It only cracks more, with the occasional patch-up, and the question stands more or less- as Stig is looking back on the relationship following his wife and one of his child's deaths- is what could have come from all of this? <br><br>Bergman deals with his characters, at this stage in his career, in trying to just find the simple and really not very simple truths of what Stig and Marta are together and separate. For the first half it almost looks like Stig is a bit too two-dimensional, particularly for a Bergman film (and Olin doesn't play him extremely well, even if he does deliver the beats fairly well, perhaps in line with his own character's inadequacies). He can't seem to enjoy anything that he does because he always wants more, to be a supreme soloist, than to have what he already has gotten. Marta, on the other hand, after having several potential men before going with Stig, tries her best to cope with having two kids that she probably wasn't totally thrilled to have in the first place. <br><br>There's a great little scene where Sanderby recounts walking in on Stig and Marta after having some kind of odd tender moment (as well as later on after having a quarrel), without them noticing Sanderby walk in, and the expression still underneath their faces when he formally walks in. In typical Bergman fashion we see the disintegration of a relationship (quite a brutal argument in bed really, more of emotional violence than physical), even if the sort of 'patching-up' period towards the end is a little weaker than what's come before.<br><br>So on the one hand there is this aspect, the drama of two people having a constant push-and-pull tie that binds them through Stig's delusions of grandeur and self-pity and fear manifesting in other forms (notably into the arms of another woman) and Marta's own semi-helplessness, which is very good, if imperfect, as classic Bergman storytelling. On the other hand it's also one of the best examples of classical music being used as incidental music: there's not exact musical score like if we hear music accompanying the characters giving the emotional cues during an argument scene or when Sanderby offers advice or gets irritated at Stig, but rather the music of Sanderby's orchestra (and Sjostrom, I might add, is pitch-perfect in the role of the weathered and brilliant second-banana conductor) fills in the spaces at times of the emotional context. <br><br>Probably the most successful, and joyful, scene is when Stig finds out Marta has the baby, by running out quick during a rehearsal, the music going along as he's on the phone, then continuing as he sits back down, and as Sanderby asks quietly of one musician who asks another to another to Stig what happened, as the music plays on. This, plus the second greatest cinematic interpretation of Beethoven's 9th symphony 4th movement in a climax (the first being Clockwork Orange), make To Joy worth seeing all by itself, if only for Beethoven fans.<br><br>As one of the several films included on the recently released Eclipse DVD series, To Joy will appeal to fans of Bergman's knack at telling of characters in shattered, honest romance, and to those looking for some classical music bliss and have seen The Magic Flute or Autumn Sonata too many times.","user":"Quinoa1984","rank":[15,16]},{"title":"Love in relationship - spoilers for To Joy and The Cranes are Flying","rating":9,"date":"29 May 2013","review":"In this review I want to discuss the main theme of To Joy, as I see it, and compare it with The Cranes are Flying (1957) of which I was vividly reminded whilst watching To Joy. To make the comparison spoilers for both films are necessary so do not read if you have not seen either film.<br><br>\"Imagine trying to decipher this complicated, secret language that two lovers develop and talk uninhibited.\" <br><br>I think this was Sondersby's (the orchestral conductor) line and it seems to be the major theme of the film; the secret language of lovers in a relationship. A language that can be captured in music but not by sight. Many of the reviews mention their dislike of Stig (the husband) and indeed he is not an especially sympathetic character, who we, the audience, know little about to help 'explain' or 'understand' him. But it seems unfair to demonise him within his relationship and marriage to Marta. We as an audience see and hear what occurs between them, yet we are outside the language of love (which includes pain and hatred) that envelops the two. From the outside in, Stig is not intelligible to us as he is to Marta. Or vice versa.<br><br>Unlike her he seems to have been ambitious and with a desire to be an artist of repute. She seems more content to be part of an orchestra and later part of a marriage. He struggles to have and retain a separate identity throughout the film. This becomes increasingly difficult with the arrival of two children in his marriage with Marta. The reality hits home that he might never be the man he dreamt of becoming and he expresses this by having an affair with a woman, herself married, who admires him from afar whilst Marta loves him very near. There is a grubbiness in Stig's affair, as implied by the behaviour of cuckolded husband and lecherous, voyeuristic tenant, that is absent from his marriage to Marta. In the marriage there is a clarity and crispness of something pure in feeling, even when the feeling is antagonistic.<br><br>The film felt full of tension and pathos and I felt for both of them in their difficulties. The dialogue between them was great; at once melancholic but with a subtle invective that served to wound each other more. The cruelest moment occurred when Marta criticised Stig after he slapped her around the face. She takes responsibility for her actions but says she will never forgive Stig, whose momentary violence gives way to remorse and the painful realisation that he will not be forgiven and his wife is filled with contempt for him. Is this not a classic moment in relationships: When one feels the everlasting pain they have either caused or nursed in their relationship and the residue with which it coats everything that follows? Moments like this during the film made me sit up and pay attention to the truth of a reality unfolding on the screen.<br><br>Yet in spite of all this there was enough beauty and majesty in the relationship of Stig and Marta, as in the music, to remind me of the love story of Boris and Veronika in The Cranes are Flying. It helped that the actresses who played Marta and Veronika were dark-haired and dark-eyed as seen in the many close-ups of their faces. The character of Stig was no Boris by any means but the love and joy, when it was just there without sorrow or recriminations, was similar in both cinematic relationships. And of course both films end with a character mourning the death of the other. Each bereaved partner has an emblematic toy of the now-dead loved one: For Stig it was the bear he gave Marta as his first present; for Veronika it is the squirrel Boris left her when he departed for war. Ultimately Stig and Veronika reach through their mourning to a joy which is present beyond laughter or happiness, as per Sonderby's closing description of joy. <br><br>For Stig that joy is present in playing music for his son. For Veronika it is celebrating the end of war and the return of many who survived to be reunited with family and loved ones. In each case their love of another has given them something, a type of joy, that cannot be eradicated by death. Both Stig and Marta surrender to joy. In The Cranes are Flying Veronika's surrender is shown in beautiful black and white photograph with shots that pan up and down as she gives away her flowers. In To Joy Stig's surrender is played out to the music of Beethoven performed by the orchestra, of which he is and Marta was, a part.<br><br>My second favourite Bergman film after Wild Strawberries.","user":"PoppyTransfusion","rank":[3,3]}]