[{"title":"Panna a Netvor","rating":10,"date":"10 July 2010","review":"So, \"Panna a Netvor\"--\"Beauty and the Beast\" for English-speakers, though a more accurate translation is \"The Maiden and the Monster.\" It's a more horror-tinged version of the tale, and is really not for little kids.<br><br>Fairy tales seem to specialize in magical transformations: beasts into humans , paupers into princes and princesses, etc. But look again and you'll see that the transformations aren't really transformations--Cinderella, for example, was always a princess on the inside; she just had to be recognized as one. So what many fairy tales do is show things as they really are--or, at least, as they should be. This version of \"Beauty and the Beast\" shows things as they are *and* how they should be, and works toward bridging the gap, making it more modern than your average fairy tale.<br><br>When the story starts, things as they are are pretty horrifying: our \"Beast\" (Netvor) is not a prince--he is never called one, he lives in a mansion and not a castle, and though he has servants they are monsters similar to himself. He is partially a bird and partially a beast (which is represented by both his body and a sinister voice that tells him to kill things, including our \"Beauty,\" Julie). His little voice tells us that he's been fully transmogrified for at least twenty years.<br><br>It's usually pretty hard to make any \"Beauty\" interesting, since she merely exists to be lovely and good so that the \"Beast\" figure can be saved, but this movie gives it a go. As in the original fairy tale, she is the daughter of a merchant, not an inventor (as in the Disney version); her two selfish, money-obsessed sisters are slated to be married to other merchants, and their father has sunk everything into buying things for their respective weddings. Unfortunately, the goods need to travel through the Black Forest, and the people driving the carts stumble across one of the Beast's trip wires. So all the merchant's property is destroyed, and he and his three daughters are destitute. The merchant goes off with their mother's portrait to sell. The two selfish daughters want gold and gems, but Julie will accept a wild rose (his suggestion, not hers). He *also* needs to go through the Black Forest (WHY? WHY?!), but our Beast has gotten his fill of violence from the destruction of the merchant's goods, so his human side is slightly dominant over his beast one. When the merchant stumbles into the house, the Beast has his servants feed him and give him wine, and he even lays out jewels on the table for the merchant to take in exchange for the portrait. (These gems are not at all valuable to the Beast--magic works according to strange rules in this movie.) Then the merchant takes one of the Beast's roses, and you *know* what happens then. :) When he returns with shiny things, the two older sisters are thrilled, even after the merchant tells them he needs to die because he took a rose for Julie. Unless, of course, one of the three daughters will go back to the Beast in his place (that's always part of the deal)...and there's Julie, riding off into the forest. Notice, though, that the merchant said nothing about a beast.<br><br>Anyway, Julie shows up at the manor, drinks some suspicious-looking wine (poured by the gremlin who lives in the chandelier) and passes out. She then has a dream of being shut up in a coffin (alive) and rescued by (we presume) the Beast in human form. While she sleeps, the Beast stands over her and struggles with the little voice that wants him to kill her and drink her blood. Finally, he runs off into the woods and kills a deer.<br><br>When Julie wakes up, she's alone. While she's sitting in front of the fire, the Beast shows up behind her, ordering her not to turn around, and he interrogates her. She tells him why she's there. He asks if he can visit her the next night, and the cat-and-mouse chase begins. Believe it or not, the little voice is still pretty adamant about killing her. So her days go on--every morning and evening, the table seems to set itself, and she has pretty jewels and dresses to wear, and life is good. The Beast visits her at night, but only briefly.<br><br>Now I need to back up a bit. Magic, in this movie, is dependent on two things: the worth of the object to be transformed and how much the magic-maker/receiver deserves that object. The Beast's gremlins serve him less because he deserves it and more because his force compels it, but it's the same general principle. The gems that the Beast gave Julie's father were created only because he gave up the portrait of his wife--the sentimental value transformed everyday, broken-down objects into precious gemstones, because the merchant deserved them for his sacrifice. Julie's things are beautiful because she deserves them. When she goes home, her sisters insist on \"borrowing\" (read: stealing) her things, but as soon as the one sister tries on her dress, it turns to rags, and as soon as the other sister tries on her necklace, it turns to mud. Why? Because they don't deserve them. There is a strong element of justice in a lot of fairy-tales, but the theme does not usually play out quite so strongly in \"Beauty in the Beast\" (which is usually skewed toward *not* judging, based on appearances or anything else).<br><br>The Beast is made human due to the same general principles of this magic. He works toward deserving happiness. Julie is an active agent, but he is (as Michelangelo said) the marble and the sculptor--the substance, and the worker of that substance.<br><br>The end is a reprise of Julie's earlier dream, and is very '70's and a little tacky. Ah well.<br><br>This is probably my favorite version of the fairy tale. Recommended.","user":"vainoni","rank":[23,23]},{"title":"Panna a Netvor -- dark, genius and underrated","rating":10,"date":"17 April 2011","review":"When most people think of the story of Beauty and the Beast (BatB) they usually think of one of two things: either the light-hearted feel-good Disney musical romp or the instructive tale on how to find a good husband by Mme Beaumont. All other versions seem to stay somewhere within these boundaries...except for Panna a Netvor (PaN).<br><br>PaN follows the original story written in 1740 by Mme Villeneuve which was made into its better known version by Mme Beaumont: The merchant loses his fortune, steals a rose and must send his daughter to the beast to repay him. There, she dreams of a prince, falls in love with the beast, and frees him. It sounds like any other BatB version ever made. However, PaN takes place in a gritty bleak world where the people in it behave like beasts and wealth leads to misery. Even the scene which introduces the merchant opens on town life with animals being slaughtered.<br><br>Netvor is not a gentle soul hoping to be saved. The first time he is introduced, we see his claw tear at a woman's dress and then later learn that he's killed her. He feasts on the female blood and, when Julie (Beauty) arrives, she is drugged in preparation for him to kill her which he only barely refrains from doing. Instead, he is forced to hunt and we see an unsympathetic scene of him setting upon a doe. Also unlike any other BatB, he has the shape of a bird which presents a grotesque and unpleasant appearance.<br><br>The casting of Vlastimil Harapes for the part of Netvor was genius. Harapes was one of the leading ballet danseurs of his generation and since went on to be the art director of the National Theatre of the Czech Republic. Watching him in PaN, I could not imagine that anyone else could so perfectly nail the physicality of the character, who could so convince me of the truth of his story. His costume isn't fancy or hi-tech makeup and yet I can do nothing but believe that this character exists and that he is a tormented half-human creature. Despite being brutal and vicious, the audience aches for him: his pains are ours, his sorrows ours, his few joys ours as well.<br><br>Netvor's costume is simple: a fitted mask, tattered clothes, claw gloves and a feathered cloak, the mask preventing his facial expressions from being seen. Despite the limitations it causes, Harapes delivers a performance so moving and powerful that even when he has no lines his emotions are palpable. When Julie is contemplating running away, he watches her from above, and when she closes the gate and returns, for an instant you see netvor ease back against the rock in relief. It's easy to miss; there are no words, and yet it's a subtle and beautifully executed moment of the film. Even the cloak which has a propensity to be an obstacle and hide the actor's body language is instead used as if it is part of his body as expressive as his own hands.<br><br>Julie (Zdena Studenkova) provides an unusual alternative to the typical beauty. Although she seems innocent, symbolically wearing white clothing throughout the film and having been given a white rose, she's frightened that her beastly host does not exist, that she's imagining him, and doubts her own beauty, wondering if she's beautiful enough for him. But most unusual, she can be cruel, which gives her a dimension of humanity most versions do not afford.<br><br>Juraj Herz, the director, manages to bring out the very best in his cast. Many scenes, even those without Vlastimil Harapes, look more like highly choreographed dances than mere blocking, with the best instance being when Julie returns home and her sisters pull her back and forth between them. It looks simple until you realise that this isn't something that just occurred naturally, that it had to be practiced and rehearsed and perfected before they could shoot the scene. <br><br>The symbolism is ever-present, the palette colours carefully chosen, every detail precisely placed so that they could tell their own story. And while every aspect of the film serves a function, not only is it open for many layers of interpretation, but it was achieved on what Hollywood would consider a shoestring.<br><br>Additionally, this film was made in 1978 in Czechoslovakia under Communist supervision. As such, the film is completely for the anti-glorification of material wealth which seems hard to achieve with a story about a merchant who tries to regain his money and a cursed prince. The merchant's caravan in the beginning shows that wealth makes beasts of all men. The merchant, after regaining his wealth, returns home only to be miserable and unhappy that Julie is no longer there. His two remaining daughters subsequently strip him bare of every possession he has when they marry two greedy men, indicative of how material things can bring out the worst in people. Even netvor lives in a decaying castle completely devoid of fine things and yet, Julie finds happiness and love in such a setting.<br><br>It is a rare occasion to come across a dark version of such a typically uplifting and pleasant fairy tale. Even the few that do exist lack capable actors, capable directors, and a sense of artistic vision. Between the chemistry of the performers and the unusual, sometimes disturbing, romance on a backdrop of devastation and decay, there is a harmonious discord which somehow makes perfect sense. This film not only delivers a strange, dark, gritty tale with perfectly cast leads, but provides an intellectual journey both in terms of subtext and symbolism and provides a view of socio-politic effects upon a story which is shared by all cultures.","user":"ErikAngelofMusic","rank":[11,11]},{"title":"Superb dark rendering of classic fairy tale","rating":9,"date":"14 January 2002","review":"SBS-TV used to screen this film on an annual basis, but it has been missing in action for some years, which is cause for regret. The title may seem obscure, but a look at the alternative English translations (\"Maiden and the Beast\" and \"Virgin and the Monster\") should make this clearer. This is quite simply a wonderful interpretation of the classic fairy tale of Beauty and the Beast, produced and filmed in the then Czechoslovakia. Cinematic gems can be found in what may be thought to be unlikely places, and this film is an example.<br><br>Students of cinema may be aware that Cocteau did a version of this story in B&amp;W, and there is of course the more recent and rather tame Disney version. This film is a very different proposition. For a start, it is unsuitable for young children because of some fairly graphic violence, including scenes of animal cruelty. The film-makers seem to strive for realism, particularly the scenes in the village where Beauty (here called Julie) lives, all mud and images of earthy rural life before the Industrial Revolution. But even the magical bits are portrayed realistically. The Beast's castle is maintained by an array of goblin-like servants, who skulk in the shadows of the fireplaces and chandeliers. If I have one complaint about this film, it is that the scenes are sometimes so dark that it is difficult to see what's happening. This does heighten tension, but it can be overdone.<br><br>The actors are great, especially the two charismatic leads. The Beast (Vlastimil Harapes) is fashioned more as a great bird of prey than Cocteau's leonine creation, and there is great suspense as he struggles with his inner violent nature (a sinister whispering voice) that is urging him to remain in his beastly form and kill the innocent Julie. Julie (Zdena Studenková) in turn is wonderfully portrayed. We can see why she is so obviously her father's favourite.<br><br>Fairy tales are expositions of the human condition, and the Beauty and the Beast story is no different. \"Every woman has the power the make the one she loves beautiful\". It's a simple theme, but this film explores it beautifully. See it if you can.","user":"mar9","rank":[25,28]}]