[{"title":"They don't make 'em like this anymore","rating":10,"date":"30 December 2013","review":"For starters, this is one of those rare movies that would not have been as good if it had been shot in colour. B&amp;W somehow fits the mood, the story and the setting. Yet it's not really a sad or dark story. As in many older B&amp;W films, the lighting is magnificent with highlights and shadows and textures that simply aren't workable in colour. The performances are universally superb. The script is free of the usual clichés. And the music is great. (How could you possibly make a bad movie with the likes of Louis Armstrong, Paul Newman, Joanne Woodward, Sidney Poitier and Diane Carrol?) Nor, in that era (1961), did Hollywood zoom in and linger obsessively on sexual acrobatics. This is a mature, sexy film without any graphic sex. Those were the rules back then and this film is the better for them. A thoroughly enjoyable movie with a great cast that has stood the test of a half century very well indeed.","user":"rps-2","rank":[10,10]},{"title":"The Indian Summer of America's honeymoon with Europe.","rating":8,"date":"4 November 2005","review":"Within 2 years of \"Paris Blues\" being released the US involvement in Vietnam began to sour the relationship between America and la rive gauche. French intellectuals affected to disdain the United States and all its works;one of the few aspects of Americana that were permitted to be still admired was jazz music. Even so the myth of the American jazz musician as a god-like figure had faded by the mid sixties.Giants like Louis Armstrong and Duke Ellington were still revered but the journeymen jazzers like Ram Bowen(Newman)no longer filled the clubs just because they were American. The Indian Summer of America's honeymoon with Europe peaked with \"Paris Blues\".<br><br>Beautifully shot in black and white in the quintessentially Parisian parts of the city where the 2 pairs of lovers could stroll hand in hand photogenically it was a love letter to the arondissements beloved of Scott Fitzgerald,Hemingway and Gertrude Stein 30 years after the affair had ended.<br><br>Paul Newman was never more charming,Sidney Poitier never more cool and self-effacing;their pairing considered quite daring at the time coming just a few years after the ground-breaking \"The Defiant Ones\". Duke Ellington wrote the score and his \"Mood Indigo\" is beautifully played by Murray McCeachern.Louis Armstrong plays himself - why his character is named Wild Man Moore one can only speculate.<br><br>I saw \"Paris Blues\" when I was 20 years old and my love affair with jazz was a its height. Looking at it now it doesn't seem all that special,the characters and situations have all become clichés;but perhaps that's a bit like saying \"Hamlet\"'s a good play but it's full of quotations.","user":"ianlouisiana","rank":[43,52]},{"title":"The film's great asset was the fascinating background music","rating":7,"date":"18 January 2009","review":"The story is about two young jazzmen Newman and Poitier who live in ParisNewman is after a serious musical career Poitier enjoys the tolerant atmosphere and the freedom from U.S. racial tensions They work at a Left Bank cub owned by Barbara Laage who is having a casual affair with Newman Serge Raggiani a gypsy guitarist who is a narcotics addict, and Louis Armstrong a trumpeter, are among their friends Newman and Poitier meet a couple of American tourists, Joanne Woodward and Diahann Carroll who are visiting Paris on a two-weeks vacations <br><br>A romance develops between Poitier and Carroll Woodward and Newman also find that a feeling is growing between them Woodward wants him to return with her to the U. S., but Newman believes that marriage would interfere with his career, and decides to remain <br><br>As in \"The Hustler,\" Newman plays a man whose devotion to making his talent better than second-rate prevents love But he was natural as the pool player, and convinced usthrough his movements, dialog and expressionsof his feelings for the music<br><br>Woodward is more aggressive than Newman Moved by his music, she displays genuine emotion, but Newman is so defensive, egocentric and selfish that he becomes hostile, stubborn, unpleasant and offensive Woodward is determined to make something more of it, but he remains uninfluencedwilling to show slight affection but incapable of being sincerely tender In their final bedroom scene, the two superb1y perform a progression from spontaneous domestic affection, to growing alienation, to his indifferent rejection of her love <br><br>Legend Louis Armstrong shines in one flamboyant jazz interlude","user":"Nazi_Fighter_David","rank":[18,20]}]