[{"title":"But Oh That Mitzi....","rating":8,"date":"8 September 2005","review":"In the second of the four Chevalier - MacDonald films the leads are a married couple (Chevalier is a upper class doctor, of all things) who are happy together. In fact they are first seen preparing for their anniversary party. Both have friends who can spoil this. Chevalier's closest friend is Charlie Ruggles, who secretly loves MacDonald (but who is usually too nervous or intense to get anywhere with her - if she were interested). MacDonald is close to an old school friend, Genevieve Tobin, who is a continuous flirt (one can even consider her a nymphomaniac). She is married to Roland Young, but their marriage is on the rocks because of her affairs (his too - he wants to marry their maid). So MacDonald invites her friend into her home, and Tobin soon is being coquettish towards Chevalier. When she returns home, she asks him to see her on a professional (i.e. medical) problem, and proceeds to try to seduce him. This upsets Chevalier, who tries to remain faithful to MacDonald, but she (blind as she is to what Tobin is doing) insists he help her friend. Young is delighted. He is closing in on a divorce with Tobin. Finally, being weak, Chevalier gives in. MacDonald learns of this, and turns to Ruggles (!). And the film is set for some kind of resolution of these problems in sexual politics.<br><br>The music is best recalled for the title tune, \"One Hour With You\". It would pop up for years in Paramount film musicals (in DUCK SOUP, it is played in the sequence when Harpo Marx is doing a \"Paul Revere\" ride to rally the countryside, only to stop at his girlfriend's for \"one hour with her.\"). It also appeared as the national love song of Klopstokia in MILLION DOLLAR LEGS, with Jack Oakie singing the words, \"Woof bootle gik...\" instead of the original words to it. However, the number that gets me is the one mentioned in the \"Summary\" line, which Chevalier sings to explain to the audience his dilemma regarding his loyalties to his wife versus the fascination of the beguiling Tobin. In all of his films in the 1930s he would sing some tune that dealt with the heroine or another woman: \"Mimi\" in LOVE ME TONIGHT is an example, as is \"Louise\". \"MITZI\" is another example of this.<br><br>The Lubitsch touch is shown throughout. One of the best moments is when Ruggles is talking to MacDonald about attending a party at their home, and learns it is a dinner party, not the costume party he is dressed for. He turns to his butler, and demands to know why he told Ruggles it was a costume party. \"Oh sir,\" says the giggling butler, \"I so wanted to see you in tights!\" With bits like that sprinkled about, this film is a small treasure.","user":"theowinthrop","rank":[20,20]},{"title":"Or to be more precise: 1 hour & 20 minutes of pleasure","rating":8,"date":"28 June 2003","review":"The only thing wrong with this delightful movie is that it's been so hard to find on video or DVD over the years. Despite the ongoing fame of the stars and the director, even museum screenings are rare. I was lucky enough to see One Hour with You recently along with an earlier gem called The Smiling Lieutenant (1931), another saucy Pre-Code musical comedy starring Chevalier and directed by Lubitsch, and they complemented each other nicely. The earlier film is set primarily in a mythical kingdom, populated with the sort of uniformed dignitaries and nobles Lubitsch loved to send up, while One Hour with You takes place in contemporary Paris-- although \"Paramount Paris\" may be the more apt phrase. Production values are comparable, and the films even share a couple of supporting players in similar roles. Still, while both are highly enjoyable, I feel One Hour with You is the more satisfying film, and for me the main reason is that Chevalier's character is so much more sympathetic here.<br><br>The cheerful Chevalier of the early '30s is always interested in one thing only, and Lubitsch's slyly suggestive material leaves absolutely no doubt as to what it might be, but that doesn't mean his Gallic lover roles were all the same. Chevalier's Smiling Lieutenant is an arrogant skirt-chaser, as obsessively horny as Pepe Le Pew and equally convinced of his own irresistibility, while in One Hour with You our leading man is more the pursued than the pursuer, perhaps a little flustered by the chase, and frankly he's more likable when he's less sure of himself. Chevalier plays a prosperous doctor, happily married to Jeanette MacDonald. They share a stylish modern home and seem quite pleased with each other, but when Jeanette's aggressively sexy friend Mitzi shows up her husband is tempted to stray; he's flattered and gratified but also perplexed by Mitzi's relentless pursuit. The good doctor's mixed feelings are obvious, and amusing. At key moments when he's alone he'll turn and address the audience, even confessing that he's confused about what to do next, and this uncertainty is an appealing character trait. Cinematically, it also marks a rare occasion (Groucho notwithstanding) when a movie character's direct address to the camera is a welcome and successful device. And it underscores the point that Chevalier Bewildered is more attractive than Chevalier the Grinning Tom Cat.<br><br>Speaking of attractive, Jeanette MacDonald is a revelation here. Those who know her only from San Francisco, or who're familiar with her prim, tightly controlled performances in the operettas she made with Nelson Eddy, will be startled to see how loose, appealing, and sexy she could be with this director and this co-star. She's adept with comedy, and surprisingly moving in the last scenes when the situation turns more serious. Jeanette's supporting cast isn't half bad, either: Charlie Ruggles is hilarious (especially when he sings) as Jeanette's long-suffering, rejected suitor, while Roland Young is a stand-out, as usual, as the cuckold professor who seems both furious and oddly amused by his situation, and whose every uttered syllable conveys icy, carefully nuanced irony. Young was one of those rare players like Claude Rains who could take a secondary role and deftly steal the show. Here, he makes his first appearance early on and returns only intermittently thereafter, but he makes every moment count.<br><br>In his day director Ernst Lubitsch was almost as famous as the stars of his films; his distinctive, sophisticated, merry style was enjoyed by audiences and celebrated by critics. Like Hitchcock or Sturges, Lubitsch himself is a presence in his work. We know from the opening moments of One Hour with You's first scene exactly who is at the helm of this picture, when a rotund Prefect of Police (George Barbier) delivers a speech to his men, warning them that people come to Paris for One Reason Only-- and coincidentally, it's the same thing that so concerns our leading man. This is fine with the Chief, of course, as long as these tourists are willing to pay hard cash. The Chief's speech is delivered in rhyme, a device which recurs throughout at key moments, usually as a lead-in to songs. The title tune is the most memorable one and became a standard, but the others serve their function: each song tells us something about the lead characters' state of mind while offering Lubitsch-style wit about the film's central themes: the joys and drawbacks of marriage and the lure of extra-marital dalliance.<br><br>Anyone seeking a good definition of the \"Lubitsch Touch\" could profitably begin with this movie. Still, Maurice Chevalier is very much the star of this show, and in my opinion he was never better, never more charming, than in One Hour with You.<br><br>P.S. Winter 2007: I'm pleased to add that this film will soon be available in a DVD box set, along with three other Lubitsch rarities from the Pre-Code era. Paradise for the director's fans awaits!","user":"wmorrow59","rank":[34,36]},{"title":"\"Lead Us Not Into Flirtation\"","rating":9,"date":"6 November 2000","review":"ONE HOUR WITH YOU (Paramount, 1932), directed by Ernst Lubitsch (co-directed by George Cukor), premiered on American Movie Classics March 11, 1993, as part of its annual film preservation. Prior to that, it was shown on the Movie Channel in 1991. A musical comedy, it reunites Maurice Chevalier and Jeanette MacDonald, stars of THE LOVE PARADE (Paramount, 1929), offering them a rare opportunity playing husband and wife from start to finish, and an amusing couple at that. <br><br>As for the plot: Chevalier plays Doctor Andre Bertier, happily married man, who comes upon the flirtatious but much married Mitzi Olivier (Genevieve Tobin), who turns out to be his wife, Colette's (MacDonald) best friend in town for a visit. Mitzi's no-nonsense husband (Roland Young) suspects his wife for infidelity and has hired Detective Henry Dornier (Richard Carle) to follow her. While Mitzi makes a play for Andre, Andre's best friend, Adolph (Charles Ruggles), best man at his wedding, does the same for Colette. Situations become involved when Andre finds himself accused of having an affair not with Mitzi but with Mademoiselle Martel (Josephine Dunn) and later on, Professor Olivier visiting Andre and naming him as correspondent in his divorce trial.<br><br>Songs by Oscar Struss and Leo Robin, with interpolated music by Richard Whiting, include: \"But Spring is Here\" (introduced by George Barbier); \"What a Little Thing Like a Wedding Ring Will Do\" (sung by Chevalier and MacDonald); \"We Will Always Be Sweethearts\" (sung by MacDonald); \"Three Times a Day\" (sung by Chevalier and Genevieve Tobin); \"One Hour With You\" (sung by Donald Novis, Tobin, Charlie Ruggles, MacDonald and Chevalier); \"It Was Only a Dream Kiss,\" \"We Will Always Be Sweethearts\" (Chevalier and MacDonald) and \"What Would You Do?\" (Chevalier).<br><br>This pre-production code comedy with singing was previously done in the silent era as THE MARRIAGE CIRCLE (Warner Brothers, 1924) starring Adolphe Menjou, Florence Vidor, Monte Blue and Marie Prevost, also directed by Lubitsch, which was distributed on video cassette in the 1990s. This remake was nominated for an Academy Award for Best Picture of 1932, but in spite of its popularity, this is nearly a forgotten movie. While Jeanette MacDonald is remembered mainly for her costume operettas at Metro-Goldwyn-Mayer and singing duets with Nelson Eddy in their eight films together spanning from 1935 to 1942, ONE HOUR WITH YOU offers a different Jeanette MacDonald, singing contemporary songs in modern day Paris. At times she's very funny which is a shame that she never was given the opportunity to appear in a \"screwball\" comedy, but this, being a \"drawing room\" or \"sophisticated\" comedy will do. Risqué dialog all around adds to the amusements, with Chevalier occasionally narrating the story to the audience, looking directly into the camera in the way comedian George Burns did on his \"George Burns and Gracie Allen Show\" on television back in the 1950s.<br><br>While a delightful 78 minutes, the next Chevalier and MacDonald musical, LOVE ME TONIGHT (Paramount, 1932) ranks the very best of their four collaborations as a team. Available on DVD as of 2008, and on Turner Classic Movies where it premiered February 23, 2010. (****)","user":"lugonian","rank":[16,16]}]