[{"title":"Come on in, the waters lovely!","rating":10,"date":"28 May 2005","review":"In the opening scene of the movie a man is seen scampering towards a swimming pool on a beautiful summers day, he dives into the pool, swims a couple of lengths only then to be greeted with a drink at the side of the pool. It is clear from the outset that although he knows the people, he has not seen them for a while. Don and Helen are surprised but genuinely pleased to see their guest and before long they are joined by another couple the Forsbergs who he also knows from his past, they too are overjoyed at this unscheduled reunion.<br><br>We are introduced to Ned Merrill a fit looking middle-aged man who comes across as friendly, likable, perhaps boastful but certainly easygoing. However, he becomes distracted when told of a neighbor the Grahams who have just installed a brand new swimming pool. To the perplexed group Ned announces that he plans to swim home via his neighbours pools. \"This is the day Ned Merril swims across the county\", he promptly swims a length leaps out of the pool and then jogs away.<br><br>At the Grahams he is also welcomed with enthusiasm particularly from Mrs. Graham, and at this stage we also learn that Ned Merrill is a popular ladies man as he easily flirts with all the womenfolk he meets. However, at the third house the mother of an old friend confronts him as he leaves the pool, she is hostile to him and instructs him never to come around again. This is in sharp contrast to the previous people he encountered and the viewer is left as confused as Ned seems to be.<br><br>At the fourth pool things return to normal, Ned meets a young woman who used to baby-sit his children when they were younger. To the astonishment of her sister and brother she thinks his idea of swimming to his home via neighbours pools is fascinating and offers to join him. They both make their way through the tranquil countryside joking and talking about the old days with out a care in the world. The girl Julie a happy go lucky 20 year old who seems at ease with Ned and informs him that when she was younger she had a crush on him.<br><br>After another friendly encounter at another home full of party-goers who are also pleased to see him, it now becomes clear that Ned was fired from a high flying executive position. Despite trying to put forward a positive persona and ducking awkward questions from the guests he swiftly leaves with Julie. <br><br>By this time Ned has become fixated by Julie and decides to sit down for a while after spraining his ankle while jumping a fence. He is overcome by her beauty and tells her of his true feelings. Julie is shocked and grossed out at this man trying to take advantage of her and decides to bolt and runs back the way she came leaving a stunned and pitiful looking Ned alone by himself. Gone is the beaming complexion and the confident posture for it to be replaced by an edgy and confused look as well as a hunched demeanor. The fit middle-aged man, charming and energetic at the beginning starts to look weak and pathetic as he limps a lonely walk to his next pool.<br><br>From this point on things get worse for Ned Merrill and it seems the nearer he gets to his home the greater the hostility from folks. They all know him but do not want to associate with him. The viewer also begins to feel uncomfortable about Ned,however, this is tempered only by the dislike for the people he meets on his way. At best they are pompous, loud, arrogant, shallow and at worse self-centered, smug and cruel.<br><br>The ending of the swimmer is quite shocking, Ned's American dream is in reality a nightmare, and you are left with an empty feeling. Now you know where he has been all along and why his neighbours have not seen him for a while. It is obvious from the first two houses that he is hiding something and this is confounded by some of the confused expressions on the faces of Ned's old friends; they know something that the viewer doesn't. You are not sure if Ned Merrill is just simply embarrassed and is trying to put on brave face by acting as if things are normal, or else has suffered some form of mental breakdown due to his life imploding on him. At first you believe the former but as the film progresses you begin to see signs of his delusion, confusion and irritability, that quickly points to the latter.<br><br>For example, having trouble with his memory and his unwillingness or inability to comprehend the reality of his misfortunes. It would also explain his misreading of Julie's desire to be with him; it was not come on but rather the need to be with a mature fatherly figure. Was he was imagining that he was younger and in the early stages of courtship with his wife? Was his obsession with the past and his wish to swim the county a desire to rekindle happiness from his adolescence? The swimmer is an engrossing film however it is also disturbing because it exposes the shallowness of suburban life with its trappings of materialism and social status in a provocative way.<br><br>In addition it also raises the spectacle of how callous and contemptuous people can be when you have lost your social gravitates as a consequence of family or employment upheaval. In the swimmer many were all too eager to use the opportunity to mock Ned Merrill now that he had fallen from grace, the men because their wives had desired him and the women because he had rejected them. Others just simply on the basis of past envy, jealousy and resentment toward his family and status.","user":"dgrahamwatson","rank":[142,152]},{"title":"Way ahead of its time film about the falseness of the American Dream.","rating":9,"date":"4 November 2008","review":"\"The Swimmer\" is a one of a kind movie, adapted from a John Cheever short story.<br><br>The Film opens with the sound of footsteps moving through the woods accompanied by a low eerie music. Occasionally animals and scenes of nature both in daylight and at night come into the cameras focus. The camera moves along looking at trees, a lake and the wildlife clearly representing what someone is seeing as they walk along. Eventually, a man clad only in a pair of black swimming trunks emerges from the woods, skips up to the edge of a suburban swimming pool and dives in. Having swum a couple of lengths he is greeted at one end by the owner of the house holding out a drink and welcoming him to come and join his guests. The Swimmer is Ned Merrill (Burt Lancaster) and it soon becomes apparent that everyone at the house knows him and is happy to see him. He is charming and charismatic with the male guests and flirtatious with the females who obviously find him attractive. The other guests have not seen him for quite some time and when Ned is asked where he has been he evasively states \"here and there.\" When further questioned if he has had a good summer he replies \"sure, just great.\" The guests then begin to look puzzled when he gives answers to further questions that just don't seem to make any sense. They exchange confused looks and clearly know something that we don't. Ned, whilst looking out over the Connecticut valley begins to get an idea that he could swim in stages back to his house by using briefly the pools of several of his neighbours. he boldly announces that today he plans to \"swim across the county !\"<br><br>As Ned visits each house and swims in each pool something more is revealed about his life and how he has behaved towards others in the past. Some people are pleased to see him, others are contemptuous of him and a few downright hate the sight of him.<br><br>What becomes clear (SPOILER AHEAD) is that Ned has been away for a long time and re emerges into the life he once knew believing that it is about two years earlier than the present. He appears to have been a high flying Manhattan advertising executive who had the house, the car, the wife and the money but lost it all by living a life of pure selfishness. We are told that he married into the upper middle class and seems to have been given most of the success he enjoyed. At the various different pools he is revealed as a cheating husband, a bad father, a crook and a \"fair weather friend\". The result of his behaviour was that his wife either kicked him out or he was fired from his job or both.<br><br>It is possible that Ned's fall from grace brought about a nervous breakdown which has led to his memory loss and distorted view of reality. He may have even been hospitalised for the period that he is absent from the neighbourhood, but the absence is never explained. It is also unclear what became of his wife and daughters. They might simply have left him, but there are hints that they may actually be dead.<br><br>The final scene where Ned eventually arrives \"home\" and his disillusionment is brought crashing back to reality is a great piece of symbolic storytelling.<br><br>Most of \"The Swimmer\" was shot in 1966 and finally released in 1968. Maybe back then audiences weren't ready to question the themes that are raised. Central to the story is the falseness of the American dream and how if you're not \"somebody\" you're not only a nobody, but you're also not even welcome. The film \"American Beauty\" made in 1998 takes the same swipe at society and is a great film in its own right, but \"The Swimmer\" made thirty years earlier, is so much more effective at exposing the corrupt underbelly of the professional suburban existence.<br><br>Burt Lancaster played many memorable roles and was certainly in much more enjoyable movies, but I think he does his finest acting in \"The Swimmer.\" He is perfect as the arrogant yet vulnerable and bemused Ned who cant work out whats going on. The movie does appear dated today and the musical score is very sixties, but any serious film fan should definitely see this at least once. It really is unforgettable.","user":"RedRoadster","rank":[74,79]},{"title":"Wonderfully Sad Portrait of Suburban Loneliness","rating":8,"date":"2 June 2006","review":"Frank Perry's screen adaptation of the achingly sad John Cheever short story gets the tone of Cheever's story just right, even if the movie itself doesn't have quite the same impact.<br><br>There have been countless strong and powerful films made around the theme of suburban loneliness, and this movie belongs to that genre. There's something so poignant about the idea that someone can exist in a world that's manufactured for the sole purpose of providing its inhabitants with luxury, pleasure and convenience, and still be miserable. You'd think people would have gotten the point by now, and figured out that privilege, wealth and materialism have virtually nothing to do with ultimate happiness, but if our own consumerist culture is any indication, they haven't.<br><br>What helps \"The Swimmer\" to stand out from other similarly-themed films is the way the story is told. It's only through the reactions of others that we begin to sense what's wrong with Burt Lancaster's character. To us, he looks the picture of middle-aged robustness and health. Lancaster became a much better actor as he aged, and he gives a wonderful performance here, as his bravado and macho virility (the strutting and preening of a man on top of the world) slowly dissolves into a lost insecurity, until the film's final devastating moments leave him as forlorn as a baby.<br><br>What a sad, sad movie.<br><br>Grade: A-","user":"evanston_dad","rank":[92,101]}]