[{"title":"Character Development","rating":27,"date":"27 October 2002","review":"The reason this film works (arguably the greatest bio-pic ever produced) is that it is ABOUT Loretta Lynn's life, not about country music.  From the opening shots of a young Loretta riding a mule to the mines with her brother, you know this will be a film about extraordinary characters.  It is over an hour before we hear one song from Loretta Lynn; director Michael Apted and writer Thom Rickman spend time to develop Loretta, Doolittle and her family.  When her father dies, the audience cries with Loretta because we know her family, her father, we understand where this girl came from and why it is such a unique transition from backwoods girl to international star.<br><br>It's been said that Ms. Lynn was named after movie star Loretta Young. When approached by executives to make a movie about her life (based on her best-selling autobiography), she was savvy enough to realize that a film would end up on television anyway, and opted to have film made.  I can imagine (most likely to the chagrin of studio execs) that Apted fought to develop a script that showcased the characters over the music.  The result is a film that EVERYONE enjoys.  When the film was released in 1980, I remember people going who were definitely not country music fans, and I remember their raves after the movie.<br><br>America is about the Horatio Alger storyline: everyone can achieve greatness.  This film highlights that dream.  While it does fall into some cliche trappings once Loretta Lynn is a huge success (the on-the-road montage, the drugs, the nervous breakdown), there are such cliches because the pressure performers feel is one in the same.  Overall, it ages beautifully because it captures a time when the American hills spawned such unique talent (Lynn's contemporaries are either showcased or mentioned to great effect).<br><br>Of special note:  If Oscars could be given for past work, Beverly D'Angelo should be voted the \"Best Supporting Actress\" of 1980 for this film. Unfortunately, she was not even nominated.  You will be hard-pressed to find such a complete performance in film.  Similar in screen time and impact as Dame Judi Dench's performance in \"Shakespeare In Love\", D'Angelo gives a Master Class in screen acting for her portrayal of the late Patsy Cline. Most likely, this flash of brilliance is what inspired the film \"Sweet Dreams\", the bio-pic of Cline, a film that pales in comparison to \"Coal Miner's Daughter.\"<br><br>This is Spacek's only Oscar win thus far out of six nominations.  She's a national treasure and this performance is outstanding.  However, you should see this film for all its elements, working to create an outstanding picture.  Highly recommended.","user":"olivergruver","rank":[69,71]},{"title":"From 13 year old bride, to becoming a Country Music Legend. A perfect biographical film.","rating":10,"date":"8 April 2004","review":"Biographical films that are done right can be a thing of beauty.  They can enlighten us by giving us perspective and insight into people that we may recognize by name but yet know little of the circumstances that have made up the fabric of their lives.  And if the life they led is as fascinating as that of Loretta Lynn, they can also entertain us in the process.<br><br>Based on Lynn's autobiographical novel of the same name, Coal Miner's Daughter is easily one of the best films of this genre.  It is the story of how Loretta Lynn became one of the most successful Country &amp; Western vocalists in recording history despite having been raised in the poverty stricken hills of Butcher Holler, Kentucky, marrying at the age of 13, and having several children to boot.<br><br>The first half of Coal Miner's Daughter is a fascinating look at a life foreign to most of us.  As the daughter of Ted Webb (Levon Helm) and Clara Webb (Phyllis Boyens), Loretta (Sissy Spacek)seems destined to live her life just as all who those who live in Butcher Holler eke out an existence.  It seems predetermined that she will probably marry one day, that her husband will be a coal miner just as her own father is, and she will have a caboodle of young 'uns running around the hills barefoot.  One day, on a trip into town with her father, Loretta meets the irrepressible Mooney Lynn (Tommy Lee Jones) who has just come home form the service.  It isn't long before Mooney convinces the 13 year. old Loretta that they are in love and need to be married.  After convincing Ted and Clara to give their blessing, the wedding takes place, and although it isn't apparent for many years, it's a decision that will forever alter the course of her existence.<br><br>One of the reasons this film succeeds on the level that it does, is because Director Michael Apted never falls into the trap of making the film judgmental about many  of the events that occur in Loretta's life.  He let's the events of the film unfold naturally, and we either accept them for what they are or we don't.  For instance, many Directors would have felt the need to implant some nefarious motive behind Mooney's relationship with Loretta. The events that happen in Loretta's childhood were what they were, and though letting a child of thirteen marry may be foreign to us, it was obviously something that may not have been extraordinary unusual back in Butcher Holler.<br><br>There is another reason why Coal Miner's Daughter succeeds on all levels. Sissy Spacek plays Loretta Lynn as if she were cloned from her.  Not only is their resemblance strikingly uncanny, her speaking voice, her singing voice, her mannerisms will have you believing that it is Loretta herself starring in this film.  As if this isn't enough, Spacek was required to play a character that starts out as a naive thirteen year old girl, and ends as an adult woman who suffers through many painful and tumultuous events in her life.  Not an easy task at all, but it is the stuff for which actresses win Academy Awards, and Spacek certainly earned hers.<br><br>If Spacek's performance was exceptional, the rest of the cast would merely need to be adequate to make the film succeed, but they are every bit as impressive.  Given the difficult role of playing Mooney, Tommy Lee Jones brings the character to life.  While never making Mooney appear sympathetic, he does show us that Mooney is after all a human being, subject to the same foibles and temptations as the rest of us.  Most of all, despite his failings, Jones lets us know that Mooney did indeed care a great deal for Loretta, even if such outward expressions of love were foreign to him.<br><br>There's more.  Levon Helm as Ted Webb gives one of the best supporting performance ever in a film.  As Ted, he gives us a father who cares deeply about his family, doing for them what he can with what little money he can scrape by on from his earning.  He is a man who has obviously been beaten down by the drudgery and day to day existence of spending most of his life with a pick and a shovel mining coal.  It is this existence that eventually forces Mooney into his decision to not become a victim of the coal mines.<br><br>Last but certainly not least, is Beverly D'Angelo as Patsy Cline, who not only befriends Loretta, but helps to teach her the ways of the world.  Her performance is so good in fact, that although her scenes aren't many, D'Angelo leaves an indelible mark that made it difficult to accept Jessica Lange in the same role.  I do not know why Jones, Helm, and D'Angelo were not recognized when Awards time rolled around as they were all at least deserving of a nomination if not a win.  Perhaps Spacek's performance was so powerful that it overshadowed the fine work done by the rest of the cast. Then again, I quit trying to figure the reasoning behind awards a long time ago.<br><br>There is no doubt however, that Coal Miner's Daughter is one of the best biographical films ever.  It is one of those rare times when cast, director, writer, all came together to make a very special film.  And when they all do that I have no choice but to give them my grade which for Coal Miner's Daughter is an A+.","user":"clydestuff","rank":[68,74]},{"title":"Loretta Lynn's eventful life expertly brought to the big screen.","rating":8,"date":"27 May 2002","review":"Loretta Lynn's life has been to say the least,interesting.A wife at 13, mother at 14,and walking a long path to her throne as the \"Queen of Country Music\".Triumphs and tragedies have virtually filled her life, and it was expertly brought to life in this film.Sissy Spacek gives a dead on performance as Lynn,right down to her voice,and even does her own singing for the film.This is without a doubt one of the best acting performances of a non fictional character I have ever seen,and let us not forget the Oscar worthy performance of Tommy Lee Jones as Doolittle Lynn,Loretta's husband.He is always excellent,but he was never better than he was here.This is an excellent true story of Loretta's long journey from the Kentucky backwoods to the Grand Ole Opry stage.A must see and must own movie.","user":"SmileysWorld","rank":[33,35]}]