[{"title":"History, theology and science fiction backed by screaming polemic and ferocious intent","rating":8,"date":"8 April 2008","review":"Derek Jarman's Jubilee (1977) is a bleak work of ferocious vision and bold satirical intent, far removed from the director's more intellectual or painterly works, such as Caravaggio (1986), War Requiem (1989), Edward II (1991) and Wittgenstein (1993). It could also be seen as something of a precursor to the visceral aggression and cultural desolation presented in his later project, The Last of England (1987), which presented a similar sense of outrage and impressionist image-weaving, albeit, without the broader strokes of character. With this film, Jarman mixes his own social and political ideologies with the ideas at the forefront of punk; taking both the sense of liberation and the dangerous sense of apathy and aggression presented in both the style and the attitude of that particular era, and applying it to a story that involves elements of history, theology and science fiction.<br><br>With the juxtaposition of ideas, Jarman presents us with the alarming vision of England in decline; seeing the present by way of the past, and further depicting a dystopian future very much reminiscent of our own. The story is given a further ironic twist by presenting the image of Queen Elisabeth I as she journeys to the future of late 70's Britain on the eve of the Silver Jubilee, and finds a world in which punk terrorists have taken over the streets, rampaging through shopping centres, looting houses and generally giving a grubby two-fingered salute to anyone courageous enough to represents the mindless masses or the ultra chic bourgeoisie. Certainly, with these factors in mind, Jubilee is not an easy film to appreciate on any level, with the brutality of the imagery and the shocking vulgarity of the world as it is presented being incredibly bleak and incredibly prescient; whilst the visualisation of the film is brash, jarring, clearly exploitative and generally rough around the edges.<br><br>The film wallows in sordidness for the first half-hour, as we watch characters wandering through a sadistic wasteland engaging in sex, violence and murder. However, this limited description might lead certain audiences to expect a gritty action film that presents violence as entertainment and coolly ironic characters akin to Kubrick's A Clockwork Orange (1971) and Walter Hill's The Warriors (1979), in which street violence and dystopia are presented as chin-scratching entertainment. Jubilee makes no attempt to entertain the audience on a conventional level, instead offering a serious statement of intent. If you want to enjoy Jubilee, or any of Jarman's work, you must do so on his terms, not on your own. To call it a punk film is misleading too. Here, the appropriation of the punk ethos seems satirical, rather than genuine. Obviously Jarman wasn't a punk and wasn't even of the generation, but he clearly saw something within the scene, again, be it in the liberating freedom that punk could offer, or in the apathy and aggression that came as a direct result of the political climate of the time.<br><br>In fact, the film seems purposely stylised to conform to the fashion of the punk rock-status quo in an almost ironic manner that stresses the director's cynical, satirical intent. The cast for example reads like the veritable who's who of seventies cult, with characters Lindsay Kemp, Jenny Runacre, Little Nell, Wayne Country, Richard O'Brien, Jordan, Toyah and Adam Ant all popping up to deliver disarming performances; part pantomime/part existential theatre. The second half of the film wanders slightly; there are examinations on sexuality, a prolonged attack on the music industry and brutal violence between the punks and police which causes both sides to question the immoral decadence being flaunted in the name of rebellion. There are also musical numbers, political manifestos, agitprop, and screaming polemic as well as an extraordinarily vivid sequences shot on fuzzy 8mm film, featuring Jordan dressed as a ballerina dancing in a junkyard.<br><br>It's one of the most grimly beautiful and evocative images that Jarman ever created; that sense of true tranquil beauty against a vicious, decaying urban wasteland. A moment of quiet reflection within a film of ferocious energy and aggression and yet tinged with a great sense of sadness and theatrical melancholia. It somehow puts the entire film into context, uniting all facets of the film beyond the past present and future and yet still retaining a great sense of nostalgia and reflection. This one seemingly abstract sequences manages to go beyond the merely aesthetic to offer the ultimate visual metaphor of the punk spirit, England in the 70's and Jubilee itself.","user":"ThreeSadTigers","rank":[19,22]},{"title":"mixed responses","rating":9,"date":"9 May 2003","review":"Jubilee, being a Derek Jarman film, obviously sets out to shock.  An assorted set of punks and deviants live together in a garish open plan hell festooned with pictures of Hitler.  Mad, an orange haired punkette (Toyah Wilcox, these days much more toned down and almost normal) and Amyl Nitrate (played by the unusual Jordan), a very weird lady who dreams of being a ballerina and talks about Myra Hindley, fight with each other.  The regal Bod (Jenny Runacre, very good in this in both roles) doubles as Queen Elizabeth, wandering with her soothsayer John Dee (Richard O'Brien) and emotionless angel Arial, through a Britain tottering on the brink of revolution as the Silver Jubilee hits.  Other dotty characters include Viv, an artist, and Angel and Sphinx (Linda Spurrier, Ian Charleson and Karl Johnson, who all went more mainstream than this later in their careers), who seem to do very little.  Little Nell plays little whore Crabs, and Adam Ant plays slow-witted Kid, who is adopted by the freaks into their little gang. Cue a lot of raucous music, satirical comment on the media and the establishment, and a fair amount of unpleasant murder.  And some plastic petunias.  It does have its moments, but as a whole it is a bit of a mess. For visual style and flair it scores highly, but on everything else maybe the jury is still out.","user":"didi-5","rank":[16,19]},{"title":"Weird and wonderful","rating":30,"date":"30 October 2000","review":"Jarman uses real people and places. He had an eye for the beauty of gardens planted with plastic flowers, wastelands with grass and daisies waving in the wind, Westminster Cathedral, people like Toyah, Jordan, Helen the dwarf. It's subversive on many levels, being a celebration of bisexuality and fetishism (\"This is Chaos, our au pair!\").  Jarman himself can be spotted once.  I love Jordan's history lessons, read in an immature voice, and the fact that people sound off at length. In some ways the film or even punk itself was a protest against the obliteration or rewriting of history (note Jordan's old-fashioned twinset and pearls). Non-standard people are allowed to be beautiful and sexy - both Jordan and Toyah are pretty overweight. Jordan's obscene rendition of Rule Britannia is a show stopper. Over 20 years later, capitalism is still with us but Derek Jarman sadly is not. xxx","user":"lucy-66","rank":[15,18]}]