[{"title":"No wonder everything doesn't fall togeather perfectly. it's fantasy for goodness sake!","rating":10,"date":"13 February 2005","review":"I'm a 59 yr old man who watched this movie with his grandkids. We all enjoyed it immensely.<br><br>It had everything it should have for a movie that was based on fantastic events. A little girl who had super natural powers, a sea captain ( her father) who was the king of a cannibal tribe, a horse who to some extent could talk, at least well enough that Pipi could umderstand him.<br><br>There was also a flying motorcycle, and a flying machine that Pipi powered by twirling around with a broom.<br><br>I wouldn't have enjoyed it near as much, had my grand kids not been there to ooh, ahh, and giggle, at what was taking place. It was a very enjoyable movie, and well worth spending my time watching. If you have kids to watch it with, it will be that much more enjoyable.","user":"joeestlinbm","rank":[18,24]},{"title":"Enjoyable movie. . .","rating":10,"date":"19 August 2000","review":"It's funny I see adults come in and rip a movie like this.  They rip kids cartoons, and kids movies as being \"unrealistic and insane and cheesy\", well HELLO it's for freaking kids!  They didn't make it for some 25 or older person who wants to complain about every kids movie!  I watched this movie when I was 12 and I REALLY enjoyed it!  The different \"magical\" stunts they did, the music (I loved the music) and the likes.  Still a good movie for kids of today.  As long as you're 12 or under you'll enjoy this movie.","user":"manny239","rank":[15,20]},{"title":"Fun fare for children and those young at heart","rating":27,"date":"27 June 2003","review":"I'll be the first to admit that this film is light-hearted and often silly. After all, the Pippi books are silly and light-hearted, so why shouldn't a movie version be? The character of Pippi is a great character study for kids: She is imaginative, creative, confident and above all, a good-willed and courteous child. Anyone who expects her and the stories she stars in to be methodical depictions of the serious side of life should re-examine his/her life and priorities. Maybe then the detractors will realize that life can be fun, at all ages.","user":"bluefox75","rank":[11,15]}]