[{"title":"Suicide Solution","rating":5,"date":"16 July 2009","review":"Yay!! a sleep-inducing version of Moonshine Mountain, just what I always wanted.<br><br>Alright, fine, maybe that was a bit harsh, but Herechell Gordon Lewis's original Hixploitation epic was totally entertaining, but this one... it just gives me no reason to stay awake. Why I care enough to actually take the time to write a review of this movie doesn't really make much sense, now that I think about it, but I have come this far...<br><br>While this film may seem similar to Moonshine Mountain, This Stuff'll Kill Ya, besides being a good sleep aid, is lacking that special something that made the first one special. Maybe it's the fact that Moonshine Mountain was filmed in South Carolina, and this one is from Oklahoma. Nothing against Oklahoma (atleast nothing off the top of my head) but if you want to create some worthwhile Hixploitation, shooting it in the South would be a good start, I mean the real South, South Carolina would have done just fine, or why not Tennessee? Oh well, I highly doubt a better location would have somehow magically made this movie not boring, but it wouldn't have hurt. Even the legendary Jeffery Allen couldn't save this one.<br><br>Meet Reverend Boone (Jeffery Allen). Loud-mouth hypocrite, who may or may not have been the inspiration for Foghorn Leghorn. When this guy isn't ranting at the congregation, he's running his illegal moonshine business. This guy even has the nerve to visit liquor stores, only to preach the good word while smashing product. Really, the nerve of this man!!. But when the FBI start cracking down, and one of the ladies in the Church gets stoned to death, things really get...well, nothing really. This Hixploitation under-achievement stumbles along with a car chase/crash, complete with airplane sound effects, a peculiar funeral scene, and another murder or two... like I said, a whole lotta nothing.<br><br>Truth be told, I don't feel great about speaking so ill of any Lewis movie because Herschell is a bigger icon that Romero and Raimi put together and he's one of my all-time favorites. They can't all be the masterpiece (Two Thousand Maniacs) and yeah, some may be slightly unwatchable (How To Make A Doll) but Herschell should be proud of all his movies, because these drive-in obscurities are a whole lot more than most of us have done. Great news gang, good ol' H.G. will be coming out with some new gore, hopefully, this year called The Uh-Oh Show, starring the legendary Joel D. Wynkoop. How awesome is that? <br><br>If you're one of those who have seen Blood Feast or Two Thousand Maniacs just because it's one of those you've always heard about, and if you consider them kind of slow compared to your beloved Sixth Sense (or whatever normal people are in to), then you're wasting you time here, because This Stuff'll Kill Ya will not convert you, and that goes triple for the other half of this double-feature, Year Of The Yahoo. Although, if you're a Lewis completist, then this double feature is a must.<br><br>Since Lewis is doin' his thing again , it ain't too late to go to somewheres decent like Tennessee and make one more Hixploitation masterpiece. For 70's Hixploitation worth your time, check out Scum Of The Earth, or if you're not into the old stuff then maybe Inbred Rednecks might do it for ya. So, ultimately, my advice to anyone who's curious about Lewis's non-gore, would be to seek out Moonshine Mountain instead, unless you're like me and must own all that is Lewis, in that case, have at it, hoss. 5/10","user":"Tromafreak","rank":[7,9]},{"title":"A fun hillbilly semiogore film.... FROM HG LEWS!","rating":7,"date":"15 September 2006","review":"This is fun little movie right here but it would have been an 8 or an 8.5 if it was about 80 minutes instead of 100. A couple scenes just drag on a little to long, and there are a few scenes which could have been taken out to make the film better. But even with the bad editing this is still a fun movie to watch. First we have hillbilly shenenigans. Crazy preachers selling whiskey to everyone, isiah weddings, car chases, moonshining. By now, after making 2000 maniacs and moonshine mountain, HG Lewis knew how film the hillbilly way. NExt we get some great hillbilly music. This might be blasphemy to some HG Lewis fans but I think the main song in this movie (one more swig of moonshine) is even better than the 2000 maniacs theme. The bassist for the band who plays the song looks like a retarded Mal Arnold (fuad ramses from blood feast). And finally, while not being a typical HG Lewis gore film, we get some cool scenes of violence. One of the better special effects in the entire HG lewis catalogue is in this film where a girl gets stoned (not that kind of stoned) and its brutally convincing. Probably the funniest scene in the film occurs near the end where ray Sager's head gets blown off. The explosion is so quick (maybe 3/10 of a second) but if you freeze frame or put it in slow motion you can actually see the mask they use to depict Sager's head, then you can see the styra foam head filled with blood and brains. a lesson in special effects.","user":"gweegweeisgood","rank":[6,8]},{"title":"A Moonshine Film Wrapped in Religion","rating":4,"date":"7 November 2016","review":"A redneck con artist (Jeffrey Allen) sets himself up as a preacher in a small Deep South town to run his moonshine distillery and clashes with a number of locals and a federal agent bent on shutting his operation down.<br><br>Although H. G. Lewis is known for his gore films, he also made some \"southern\" films and some \"moonshine\" films. This one is not gore, but it is certainly the other two. And it combined alcohol and religion in a very strange way... this cult seems more interested in drinking the \"blood of Christ\" than worshiping God.<br><br>This is definitely not the worst film Lewis ever made, but it is far from the best. Apparently he had access to a spare room in a radio station in Oklahoma and filmed most of this picture in there. The writing is good, the acting is actually decent, but it still falls flat. Outside of Lewis fans or those who want to see Larry Drake in his debut role, I am not sure exactly what the appeal might be.","user":"gavin6942","rank":[2,2]}]