[{"title":"A highly important movie.","rating":9,"date":"6 December 2003","review":"*High Sierra*  is almost excruciatingly important in the development of cinema, laying to bed the  \"gangster picture\"  of the 1930's while simultaneously giving birth to American film noir.  Oh, and it made Humphrey Bogart a major star while it was at it.  Therefore, I'm not entirely sure that your film collection, if you have one, can survive without it.<br><br>Based on a pulpy novel, it chronicles the story of Roy Earle, sprung from a life sentence in prison so that he can knock over a casino along the California-Nevada border.  It's easy to miss, but notice the first minute of this picture closely:  it's of course the Governor -- bought off by a mobster -- who gets Roy released from his life sentence, indicating that the corruption has finely infested the top of the social order.  This is the usual tough-minded, whistle-blowing gangster-picture stuff that Warner Bros. specialized in.  But there's also something else at work here, perhaps something new:  one gets the sense that what happens to Roy in this movie has been engineered from On High, in advance . . . in other words, he's in the Jaws of Fate.  And thus we're in the unforgiving world of Film Noir.<br><br>More than the opening scene, it's Bogart who almost single-handedly invents film noir with his groundbreaking work in  *High Sierra*.  Not cocky like Cagney and Muni, not psychopathic like the early Edward G. Robinson, not as smooth as Raft, Bogart is a ruthless professional with a wide stripe of sentimentality.  His Roy never shirks from killing, but he doesn't get off on it.  He's more a rebel than a gangster, a poetic soul denied respectability, a man longing for the innocence of his youth. Unfortunately, he thinks he finds in the personage of a transplanted Okie farm-girl  (Joan Leslie)  a reasonable facsimile of that innocence. Competing for his affections is Ida Lupino, a sour  \"dime-a-dance girl\" who's been up, down, and around the block a time or three.  She's the baggage that comes with the two new-generation hoods whom Bogart is assigned to babysit for the casino heist.  Not until later in the picture does Bogart recognize Lupino's better suitability to his own temperament and experience. (They share in common, among other things, suicidal impulses, a desire to escape a corrupted world.)<br><br>Roy Earle was a new type of character -- the truly romantic criminal. Bogart would play variations on Earle throughout his career, though he rarely exceeded his triumph here.  And while I've given the actor much of the credit, some more credit must be extended to the screenwriter, John Huston.  *High Sierra*  was the beginning of a beautiful friendship.<br><br>Oh, and did I mention that the movie -- aside from its importance in American film history, yadda yadda -- is quite simply a good time?  Witty dialogue, great on-location direction by Raoul Walsh, a cute dog, and a climactic car chase that wouldn't be equaled until 1968's  *Bullitt*, are just some of this movie's other virtues.","user":"FilmSnobby","rank":[103,127]},{"title":"\"High Sierra\" was the film that changed the course of Bogart's career and lifted him up to stardom","rating":8,"date":"17 April 2005","review":"\"High Sierra\" was the film that changed the course of Bogart's career and lifted him up to stardom<br><br>As Earle, Bogart was expanding on the criminal characterization he had already mastered in a dozen earlier films, giving it greater depth by adding contrasting elements of warmth and compassion to compensate the dominant violence <br><br>Bogart helps a clubfooted girl, Velma (Joan Leslie), who repays him only with disregard and indifference<br><br>Bogart's interpretation already showed signs of the special qualities that were to become an important part of his mystique in a few more films<br><br>Here, for the first time, was the human being outside society's laws who had his own private sense of loyalty, integrity, and honor Bogart's performance turns \"High Sierra\" into an elegiac film <br><br>As a film, \"High Sierra\" has other notable qualities, particularly Ida Lupino's strong and moving performance as Marie, the girl who brings out Roy Earle's more human emotions <br><br>The movie was remade as a Western, \"Colorado Territory,\" with Joel McCrea and Virginia Mayo, and as a crime film in \"I Died a Thousand Times,\" with Jack Palance and Shelley Winters in the Bogart and Lupino roles Neither came up to the stylish treatment given \"High Sierra\" by director Raoul Walsh from an exceptionally good script by John Huston and W. R. Burnett","user":"Nazi_Fighter_David","rank":[49,58]},{"title":"BOGART ROCKS AND A LUSCIOUS LUPINO!!","rating":4,"date":"4 February 2004","review":"Bogey is picked to lead a jewel heist at a resort. When he meets the rag tag team he has to work with, he senses trouble brewing. This is the film that brought attention to Bogart's leading man skills and Huston's peerless writing. Many remember the classic ending with Bogart hiding out in the mountains for one final stand against the law (and fate). Ida Lupino is one of my favorite actresses from the 40's and does fine work here (and looks stunning). Many fine moments with Bogey...including a memorable speech within his cabin hideout. This is one of the best portraits of a desperate outlaw in film history. A blueprint for all the antihero films that would follow over the years...great fun! Seek it out and enjoy!","user":"Mandrakegray","rank":[19,23]}]