[{"title":"Glorious Technicolor Restored","rating":10,"date":"10 September 2001","review":"BECKY SHARP, historically important as the first feature film in full, three-color TECHNICOLOR, has always fascinated me. It's history, however, is frustrating and disappointing. Made by Pioneer Pictures and released through RKO, BECKY SHARP was sold to a poverty row exhibitor (whose name escapes me at the moment)in the 1940's for re-release. The company chose not to pay the high prices that TECHNICOLOR charged for release prints and had new prints of the film struck in inferior two strip CINECOLOR. More damaging to the future of BECKY was that the company never properly stored the original nitrate negatives. BECKY SHARP was sold to TV only in a shortened B&amp;W print or in CINECOLOR reissue prints.<br><br>Still, the idea of this elusive \"lost\" treasure haunted me. It was amongst the very first videocassettes that I ever purchased back in the early days of the VCR when I was but a lad (and YES, I got strange looks.) BECKY SHARP was one of those poor, orphaned films whose copyrights have expired and now live in the public domain. The quality of the video cassette and the color was astonishingly bad, and gave no hint of the pleasures the original TECHNICOLOR photography must have contained.<br><br>A sad story to be sure, but fortunately UCLA performed a massive restoration effort on the film in the late 1980's, literally scouring the world for available film elements. Unfortunately, the restored BECKY SHARP has never been commercially released in any format. It was shown during AMC's first Film Preservation Festival back in 1993, however, and luckily I recorded it to cherish for all time (or at least until the tape wears out.) It has never aired since.<br><br>The restored BECKY SHARP is a revelation!! The film starts with barely any color at all, then pleasant pastels are introduced, followed eventually by the striking red coats of the British military. Full of color and deliciously over-ripe tints, this was primarily an experiment to see how color plays out in a feature film. The cast and drama takes a back-seat to the real star of the show, glorious TECHNICOLOR. The film itself is somewhat plodding and overplayed, but a lot of fun, to be sure!!<br><br>I'm not sure what legal red tape is responsible for there being no commercial release of this beautiful restoration, but none has appeared and this is a shame.","user":"wrk6539","rank":[35,37]},{"title":"\"Words are but little thanks\"","rating":8,"date":"26 October 2009","review":"You see, it's not so much the stories that count, it's the way they're told. Becky Sharp, the motion picture, came to be by a convoluted route. William Makepeace Thackeray's mid-19th century novel Vanity Fair was used as the basis for Langdon Mitchell's late 19th century stage play, which was in turn adapted for this 1935 movie. What have we lost and what have we gained? <br><br>Of course, books, plays and pictures are very different things, and certain changes have had to be made so that each adaptation works for its particular medium. Becky Sharp bears all the hallmarks of a lengthy novel reworked for the stage. A play can't be over a certain length because it has to be seen in a whole evening, and yet individual scenes tend to be fairly long because of the disruption of having to change sets. Becky Sharp, perhaps surprisingly, changes very little of the basic plot, but it condenses the entire (900+ page) tome into a series of dramatic vignettes. Because the novel tends to tell of many important events in a by-the-by fashion, Mitchell was also forced to come up with a lot of his own dialogue. Finally, the play differs from the novel in that every episode is told from Becky's point-of-view, whereas Thackeray's narrative travels with a range of characters.<br><br>So far, so disappointing (perhaps). But what was most important here was not that the story survived intact, but that the tone of Thackeray's masterpiece carried through. What is so special about Vanity Fair is the author's cynical, sarcastic tone, which makes a comedy out of these unpleasant goings-on. This is not an easy task in a motion picture, unless you were to resort to voice-over narration with passages from the novel (not especially en vogue in the 30s). But as it happens this motion picture does not do a bad job.<br><br>Firstly, we have the right cast. Miriam Hopkins's Oscar nomination has raised a few eyebrows here and there, and it's true her performance is hysterically hammy. But that is Becky Sharp, a cheat and a liar whose entire life was an act. When she breaks down in false tears over her late mother's possessions, the moment seems silly, but it is supposed to be funny. The bulk of the cast are overblown caricatures, but again this is faithful to the novel. Thackeray wasn't subtle. Look at those names – Pitt Crawley, Lord Steyne even a minor character who didn't make it to this version called Sir Huddleston-Fuddleston. And most of the players are spot-on. Nigel Bruce simply is Jos Sedley, and George Hassell is perfect in his unfortunately brief appearance as Sir Pitt.<br><br>Then there is Rouben Mamoulian's direction. His flamboyant visual style could be disastrous in the wrong picture, but here all his extroverted camera moves and trick shots pay off. With the condensed storyline, the overt technique helps to keep the flow. We are brought closer to the spirit of the original text by the fact that we are constantly aware of the director's touch, just as Thackeray constantly addresses his reader with a sly wink. This again highlights the fact that Becky Sharp is more enjoyable if it is taken as a comedy, not as a drama. It's just as well – Mamoulian let loose on a pure drama could be awful.<br><br>This was famously the first picture in three-strip Technicolor, and as the use of colour here is especially good I'll devote a few lines to that too. Whereas some early colour pictures used blaring shades, Becky Sharp is filled with subtler tones – for example those rusty browns and greyish blues in the opening scene, much more effective than bold blue and red. And rather than simply colour-coding a character's costume or a set, we here see the tones flowing on and off the screen. To again take that opening scene, we begin with the warmer hues of Amelia and her friends, and then slowly move, via various different shades of dress and the growing amount of the stark wall that can be seen, to the cold blue-grey of Becky. Later in the first scene at the Crawley residence, all the colours are very plain, which gives more impact when Rawdon walks in in his bright red uniform. It's hard to say who is responsible for this smart handling of colour. Production designer Robert Edmond Jones is the celebrated inventor of \"simplified realism\", whereby sets complement action, but Mamoulian appears to have done a very similar job with the colour on the 1941's Blood and Sand. We'll assume it was a joint effort.<br><br>Really, the only major flaw in Becky Sharp (and it is, I'm sorry to say, a very major one), is that the paring down of the narrative to 84 minutes without actually cutting much of the plot makes for somewhat confusing viewing. It's difficult to keep up with time and place, and the novel's legion of characters pop up then disappear before they have made an impression. Personally, I found Becky Sharp fun to watch because I am familiar with the novel and it was nice to see these figures brought to life so accurately. However, I first saw it before I read the book, and recall finding it bizarre and boring, as I suppose would the majority of viewers. For this reason, it fails in itself as a motion picture.","user":"Steffi_P","rank":[13,13]},{"title":"Great Victorian Novel becomes Interesting Looking But Weak Film","rating":7,"date":"25 October 2005","review":"Because of the overwhelming success of his novels, people still read Charles Dickens. If you poled people who like to read classic novels, you would find most people read Dickens, Emily and Charlotte Bronte, and Anthony Trollope most among the \"high Victorian\" novelists (those from 1830 - 1882). This cuts out a large number of fine novelists, like George Eliot, George Meredith, Elizabeth Gaskell, and Benjamin Disraeli (yes, the Prime Minister), or even William Wilkie Collins, the first great mystery/detective novelist. But the one that is particularly odd is William Makepeace Thackeray. <br><br>In his day (he was a prominent novelist from 1839 to 1863 when he died) Thackeray was actually the leading rival of Dickens as the leading novelist. Dickens was capable of a wider variety of social class types in his fiction, and could show wilder humor and greater tragedy in his novels. But Thackeray was more gifted at subtle characterization and clever social satire of the upper class. He was a member of that class, and knew what he was talking about when he wrote about them. George Orwell noted that when Dickens did an aristocrat in like Sir Mulberry Hawk in \"Nicholas Nickleby\", the resulting character was a type from Victorian melodrama, whereas Thackeray or Trollope made more realistic figures.<br><br>He also was willing to experiment in odd ways. Occasionally Dickens did too - he did first person narrative novels like \"David Copperfield\" and once did one with a female narrator \"Bleak House\". But in 1846 Thackeray wrote \"Vanity Fair, A Novel Without A Hero\". The title was a pun. The two leading characters, Rebecca (Becky) Sharp and Amelia Sedley, are women (so it suggests the novel has a \"heroine\"). But both women are quite faulty. Becky is a fortune hunter who won't let anyone or anything keep her from becoming rich. Amelia is a nice person. In fact, she is too nice. She has to go through an 800 page story before she stops being friendly to her school friend Becky, and only after Becky reveals what a bad person she has been to Amelia. <br><br>None of the characters in \"Vanity Fair\" is flawless. The closest to a hero in the story, William Dobbin, adores Amelia - but won't push himself as a suitor (he wants her to notice his adoration by herself). Becky vamps members of the Crawley family (where she is the family governess), and marries the second son, Rawdon, in expectation of a generous aunt's largesse to support them. But that fails to work out. So she tags along with Rawdon, accompanying him on the Waterloo campaign, and makes a play for George Osbourne (Amelia's selfish husband). Eventually she and Rawdon become social figures, \"living well on nothing a year\" (by cheating merchants of payments for their food, clothes, etc). She also becomes the mistress of the powerful Marquis of Steyne (pronounced \"stain\").<br><br>How the events of this novel without a hero end I leave to the reader to read the novel (the best way) or to see either this version by Rouben Mamoulian, the recent one with Reese Witherspoon, or a modern dress version from 1932 with Myrna Loy as Becky. Mamoulian's version reduces the story to 90 minutes of film, and so much is thrown out. In particular the antics of Amelia's cowardly, pompous brother Joseph Sedley (Nigel Bruce in Mamoulian's film). Hopkins does very well as Becky - garnering her best film performance. She is supported by Alan Mowbray as Rawdon, who may be raffish in some ways but gains our respect as he sees the woman he loves for what she is. Francis Dee is adequate (if not memorable) as Amelia. Cedric Hardwicke is sinister and powerful as Steyne. Allison Skipworth gives one a taste of the self-centered, pampered aunt of Rawdon, \"Miss Crawley\".<br><br>So what went right and wrong. It is a great novel (my opinion) but I admit this film leaves me cold. So much was cut out the film is just a synopsis of the main plot. But then, Thackeray's greatest strength as a satirist was as a subtle writer. Somehow subtlety on his printed page is not well translated onto the silver screen. On the other hand, Mamoulian did make great strides (in terms of elegant cinematography) with the then new three tone color film system. The best moment is at the scene of the great last ball given to Wellington's staff and men at Brussels in June 1815, which ends as a cannon blast in the distance is heard: the opening shot of Waterloo. The moment that the blast is heard a blast of air causes a red curtain to blow, looking like a wave of blood. Mamoulian was able to squeeze out of the process some idea of what to do with it. For that reason the film is worth seeing. But I urge the interested viewer to take the time to read Thackeray's novel.","user":"theowinthrop","rank":[19,20]}]