[{"title":"Duke in Coonskin Cap, saves Ralston, with Ollie!","rating":8,"date":"6 September 2006","review":"John Wayne's second effort as star/producer (after \"Angel and the Badman\", in 1947), \"The Fighting Kentuckian\" is a VERY enjoyable tale, set in 1818 Alabama, of coonskin-capped Wayne, part of the Kentucky militia, falling for French immigrant Vera Ralston (in her second film with Duke), and discovering a plot to swindle the French community (composed of ex-officers of Napoleon, and their families) out of their land, by aristocrat John Howard and ruthless river boss Grant Withers.<br><br>What truly makes this film 'special' for me is Wayne's sidekick, portrayed by the legendary Oliver Hardy, of 'Laurel and Hardy' fame. Hardy, while a friend of Wayne, had only worked 'solo' once in a feature film in over twenty years (1939's \"Zenobia\"), and it took a LOT of coaxing (and Stan Laurel's 'blessing'), to get him to accept the role...and what a pleasure he is, to watch! Wayne and Hardy have a rich, warm chemistry, and the rotund comedian, with his infectious smile and Georgia drawl, makes even minor scenes (like swapping recipes with Ralston's mother) a joy.<br><br>With a first-rate supporting cast including Philip Dorn, Hugo Haas, Wayne 'regulars' Paul Fix, Jack Pennick, and Hank Worden, and Marie Windsor (who looks eerily like John Howard, in my opinion!), \"The Fighting Kentuckian\" is, despite the 'pans' you'll see in some of the reviews posted, one of my favorite John Wayne films...He was never more charming than you'll find him, here!","user":"cariart","rank":[26,26]},{"title":"Oliver Hardy in a rare dramatic (sort-of) role and John Wayne in leather, what more could you want?","rating":7,"date":"5 September 2001","review":"Not on the same level as The Searchers or Red River or even Hondo, But The Fighting Kentuckian IS an enjoyable film to watch.<br><br>I don't know how accurate the history really is, but I do know that the remnants of Napoleon's band of loyal followers DID establish a community in the Southern part of the US at about the same time that Andrew Jackson was fighting The Battle of New Orleans with the help of, (although not mentioned in this film), Jean Laffite who may have been a pirate, but preferred to be called a free-booter.<br><br>Vera Hruba Ralston is the lovely daughter of one of Napoleon's most important Generals.  She is quite charming here.  Her Czech accent could pass for French.<br><br>John Wayne looks marvelous in leather and delivers his lines like a true straight-man when partnered with Oliver Hardy.  That is a side-kick combo like no other and worth the price of admission.<br><br>The film contains many site gags, but my favorite is the one where Wayne and Hardy pretend to be surveyors and Hardy ends up in a pond.<br><br>My favorite one liner in The Fighting Kentuckian is the one where John Breen (John Wayne), after being shot while surveying, comes to a cabin of French settlers, and is discovered by the men who shoot him.  They offer him a drink, \"Have a shot?\" they ask.  Breen replies as he mounts his horse, \"No thanks, just had one...\" and holds up his wounded arm.<br><br>There is no point in summarizing the plot line, it is only there to allow John Wayne to kiss Vera Ralston, in the moonlight illuminating the patio of her mansion, watched by her father, the general!  That kiss is one of those patented \"take her to the moon\" kisses that Wayne gave select lucky ladies. (Those lucky ladies reeled for hours after.)<br><br>Oliver Hardy is the third part of this delightful three-some.  There is action when the French are attacked by the evil river-men who want their land, and are in turn repelled by the Fighting Kentuckians,(the whole kit and kaboodle),lead by a trumpet-blowing Hardy.<br><br>When the film first came out it was a smash-hit, and it is easy to see why. There is an easy humor, gallantry and romance here that I miss in modern films.  Films now are so message-conscience and so full of unappealing, gratuitous nudity and sex, that it's fun to relax with a film that suggests much more than it shows and does it with style and a wink of the eye.","user":"countryway_48864","rank":[42,44]},{"title":"The Alabama French","rating":7,"date":"15 April 2006","review":"In The Fighting Kentuckian John Wayne steps back a couple of generations on the American Frontier from where he usually has his movie roles to play a frontier soldier. He's one of the Kentucky riflemen who saw action in the Indian wars and the Battle of New Orleans with Andrew Jackson. His company is going home to Kentucky to be de-mobilized. But in a town in Alabama called Demopolis, Wayne gets a bit sidetracked by the lovely Vera Hruba Ralston.<br><br>Ralston is the daughter of Hugo Haas who plays one of Napoleon's former generals who is now leading a party of French exile settlers who have settled on land granted to them in Demopolis. The problem is that the French settlers are being set up for a big con game by a quartet of villains, Marie Windsor, Paul Fix, John Howard, and Grant Withers. Because of Wayne's growing involvement with Ralston he and sidekick Oliver Hardy get drawn into the problems of the settlers.<br><br>That's right I did say Oliver Hardy. While partner Stan Laurel was having health problems Hardy did this film with John Wayne and another, Riding High, with Bing Crosby. It's a different Ollie we see in The Fighting Kentuckian, not the know it all forever getting hoisted on his own petard by his bumbling partner Laurel. For most of the film he's a traditional sidekick to Wayne in the Gabby Hayes tradition. However there is one scene where Ollie gets to use the Duke as a substitute Stan Laurel. Wayne and Hardy sneak into a party given by Haas as musicians, fiddlers to be precise. Hardy actually plays, but Wayne is going to fake it. That is until the piece they're playing calls for a solo. As each musician does his bit, the expressions on Wayne's face are pure Stan Laurel. Ollie who was never the creative one in their partnership had to have coached Wayne on this. He does all the traditional Stan Laurel shtick, but cry. It's very funny, totally not what you would expect from John Wayne. It's the highlight of the film for me.<br><br>On the negative side the film is a bit overplotted. The quartet of villains mentioned above are all not quite working in tandem. Each one has his own agenda and it makes the film a bit hard to follow.<br><br>Still I believe the Duke's fans will enjoy a somewhat different John Wayne and Laurel and Hardy fans would appreciate Wayne's attempts at a salute to Stan. I think Ollie worked better with the Duke than he did with Harry Langdon in Zenobia.","user":"bkoganbing","rank":[24,27]}]