[{"title":"A Beautiful Epic","rating":10,"date":"13 August 2010","review":"The Last Emperor is a truly larger than life film telling us about a life of a human, but not just any human, the Emperor himself. He's also not your normal emperor, he's the Last Emperor of China, his name is Pu Yi. He lives his life however he wants to and he sort has a larger than life persona. In just his late 20s, he stood at the throne ruling over one of the largest nations on Earth, with the most people on Earth. He controls and commands the lives of nearly Five-Hundred Million people. Throughout his abdication, his decline and dissolute lifestyle; his exploitation by the invading Japanese, and finally to his obscure existence as just another peasant worker in the People's Republic.<br><br>While the film isn't perfect, it is certainly beautiful and a visual treat for anyone. Bernardo Bertolucci's cinematic biography of Emperor Pu Yi is an emotional, beautiful and astonishing film... And it's a massive production which won 9 Oscars, It deserved every single one of them. The film will always be remembered for its size and its beauty. This Asian Masterpiece tells us a story of not only an Emperor, but of a country, which was and still is the largest nation in the world. The Last Emperor is certainly one the Largest, most beautiful films ever created in Cinema.<br><br>A Monumental Achievement. ~10/10~","user":"Loving_Silence","rank":[153,167]},{"title":"A great artistic achievement","rating":10,"date":"16 April 2006","review":"Bernardo Bertolucci's \"The Last Emperor\" is a monumental, perfect film, and stands as one of the great artistic achievements in any artistic medium. <br><br>Told in a complicated flashback/ flash-forward style, it's the story of Pu Yi (born 1906) who was the last absolute monarch of China. During his lifetime he falls from the Lord of Ten Thousand Years, the emperor/God of billions of Chinese, to an anonymous peasant worker in communist China. <br><br>Pu Yi was the child emperor from 1908 until the Chinese revolution in 1911 when he had to abdicate. He was allowed to remain in the Forbidden City but was stripped of his power by the communists. He was expelled from the city in 1924 by a warlord. In 1932, Puyi was installed by the Japanese as the ruler of Manchukuo, a puppet state of Imperial Japan. At the end of World War II, Pu yi was captured by the Soviet Red Army and turned over to the Chinese communists. Considered a traitor, he spent ten years in a reeducation camp until he was declared reformed. He voiced his support for the Communists and worked at the Beijing Botanical Gardens.<br><br>This film vividly portrays the change from the imperial and religious traditions of ancient China to the godless totalitarianism of modern communist China, so the film is, on one level, the story of China's revolutionary transition from imperialism to communism. <br><br>Visually the film is stunning especially the scenes in the Forbidden City. It was the first film to receive permission to film in the Forbidden City.<br><br>The film can be enjoyed on the first viewing but really demands more than one viewing and some knowledge of history. In this respect it resembles Akira Kurasawa's masterpiece \"The Seven Samurai. <br><br>The cast includes John Lone as emperor Pu Yi, Joan Chen, and Peter O'Toole. <br><br>The film won 9 Oscars including best director and best film. A must see on DVD widescreen or in the theater.","user":"StanleyStrangelove","rank":[59,64]},{"title":"The Last Epic","rating":10,"date":"28 May 2001","review":"The Last Emperor, like Once Upon a Time in America, is an epic saga that delves, among various aspects, into the realm of Time and the ensuing effects it has on a human being and his culture as it passes through his lifetime.  The Last Emperor of the Qing dynasty, Pu-Yi, was coronated in 1909 at the age of three and due to his youth ended up being a puppet to his adminstration. Bertolucci successfully shows us a young man who while understandably spoilt by many luxuries of monarchy, is in actuality a tender hearted, independent thinker (not doer) who is passionate about his homeland (Manchuria) and has a ravenous desire for experiencing life in the outside world.  His caged lifestyle in the Forbidden City (Beijing) is definitely a major contributor to this mindset.  From his infancy the director takes us through a chain of historical events that ultimately lead to Pu-Yi being an ordinary man (we know this from the beginning, however flashbacks explain his situation at the start).  However, it is not the desired lifestyle that he sought as an Emperor in his youth.<br><br>The Last Emperor is breathtaking in its cinematography and Bertolucci's direction is impeccable.  A lot of criticism was directed at his film '1900' (1976) due to its sheer length.  The Last Emperor clocks in at 215 minutes (director's cut) and barring 10 minutes of a marriage related scene, it never lets up.  Bertolucci seamlessly interweaves the flashbacks with Pu-Yi's situation in post-WWII China by providing us with a real life tragedy that epitomizes human weaknesses, vices, love and loyalty.  Here is a film that is a true story but goes beyond mere narration or simple depiction - it is a three and a half hour, non-stop attention grasping journey through the spectrum of humanity that defines our lifetime through the eyes of an unfortunate soul who was a victim of circumstances like many are.  Any questions that the viewer will have concerning an event in the plot will be immediately answered through the rich tapestry that Bertolucci shows when depicting Pu-Yi's imperial life.<br><br>On a technical note, the acting in this film is brilliant.  John Lone deserved atleast an Oscar nomination for best actor due to his seamless portrayal of Pu-Yi.  He makes his portrayal of a 21 - 60 year old Pu-Yi seem like an effortless act. Through his performance the audience feels an even greater compassion for the last emperor as we come across a man who despite all the hardships he endured was very compassionate and soft centered. The sheer down to earth nature of his character as a 55-60 year old who walks with a tired smile, forever accompanied by his loving brother, is a testament to Lone's ability to portray any age and move the audience.<br><br>Once again, it takes a Hailey's comet like event for the Academy to nominate someone from the eastern world (or non-British, non-American when it comes to best actor).  The rest of the cast is also brilliant barring Ryuichi Sakamoto (who portrays the one-armed Masahiko Amakasu) who, for the most part, presents us with a classic display of Japanese overacting.  Although I wouldn't call it overacting in a Kurasawa-esque/Japanese film environment, it becomes quite hilarious in a production such as this.<br><br>This apart, the film is brilliant.  It is the last great epic (yes, Gladiator is very good, but is far from an epic in my mind) and somehow I hope it is rediscovered and re-appreciated as it once was back in the late eighties.<br><br>While the Oscars have always contrived to ignore the true best picture for most of the last two decades, here is an example of a best picture winner which beat the competition by miles.","user":"shardik","rank":[45,51]}]