[{"title":"An Exception To a Rule About American History Films","rating":28,"date":"28 April 2004","review":"It is a strange truism about films concerning American History. While some of those films dealing with the Civil War are great (\"The General\", \"Gone With The Wind\") or highly respectable (\"The Raid\", \"Gettysburg\", \"Glory\"), this is less true about films about the American Revolution. It's a sad or mediocre commentary. D.W.Griffith's first great feature length film was the controversial - pro K.K.K film: \"The Birth OF A Nation\". No matter how you hate the film's racism, it's innovation make it a film landmark. But his attempt at a Revolution film, America, was a flop. Just see the titles: \"America\", \"The Howards Of Virginia\", \"The Devil's Desciple\" (slightly better due to its star cast, especially Olivier as \"Gentleman Johnny\" Burgoyne), \"John Paul Jones\", \"Lafayette\", \"Revolution\". There are two exceptions. The musical \"1776\" was a good film, and (despite some historical errors) told the story of the creation of the Declaration of Independence pretty well. This film is the other. It is the only film by John Ford set in the American Revolution (he was more at home in the Indian Wars of the 1870s). It is in glorious color for a 1939 film. It has a dandy cast from Henry Fonda and Claudette Colbert as the young married couple, to Edna Mae Oliver, Ward Bond, Arthur Shields, and John Carridine (except that his motivation as a Tory is never developed - possibly his scenes were cut in the editing).<br><br>Perhaps it was the source. Walter D. Edmonds is a forgotten writer today, but when I was growing up in the 1960s his novels, \"Drums Along The Mohawk\" and \"Chad Hanna\", were still published and read. Interestingly Henry Fonda was also in the film version of that latter novel. Edwards was a regional historical writer (which may explain his contemporary oblivion). All his novels are set in upstate New York, \"Chad Hanna\" being set in the 1830s. \"Drums Along The Mohawk deals with the warfare between settlers in Western New York and the Six Nations of the Iroquois Indians, the latter allied with Tories. It is a grueling warfare - culminating in the battle of Oriskany, where American troops literally slugged it out in forest fighting with the Indians. Commanded by General Nicholas Herkimer (Ralph Imhof in the film)the Americans barely won the battle. Herkimer died of his wounds a few days later (movingly captured in the movie). He is honored today by a county upstate named for him. These events occurred in 1777, and the film seems to end in 1779. It ends with the settlers of the Mohawk River Valley triumphing over the Tories and Indians. What is not shown is what really crushed the Indians - Washington sent General John Sullivan into the area, and in a foreshadowing of the scorched earth policies of General William Tecumseh Sherman, Sullivan burned the Iroquois villages to the ground. It is not a pretty story now, but in that period Sullivan was considered a national hero. Ford does not even touch on that aspect. Probably just as well. But what he does show is first rate Ford, and we are all grateful for that.","user":"theowinthrop","rank":[57,69]},{"title":"A Ford Winner!","rating":3,"date":"3 December 2001","review":"There is a small *SPOILER* in the text below. This is one of my favorite John Ford films, although it usually is not ranked as one of his classics.  There is enough action, pathos and downright patriotism to satisfy Ford devotees. The standout in this film is Edna May Oliver as the feisty widow who won't give up her home to the invading Indians even though they are burning it down around her.  What a gal!!!!....her relationship with Ward Bond in this film is sweet and her final scenes will tear your heart.  The Indians are reminiscent of the characters in \"Northwest Passage\", in that they are savage beyond belief and some of the scenes are tough to take....such as the man tied to the burning wagon and Arthur Shields reaction to it.  Claudette Colbert is good as the wife and Henry Fonda was born to play this part, but it is the support cast that really fleshes out this film.  Poor John Carradine never gets to play a good guy and he is at his saturnine best here.  Look for John Ford's brother, Francis, in a small supporting role. It is a slice of American history and well worth seeing.","user":"Bucs1960","rank":[15,16]},{"title":"Neglected gem! One of John Ford's finest films...","rating":13,"date":"13 May 2001","review":"1939 was a banner year for great films--and certainly one of them was \"Drums Along the Mohawk\" in gorgeous early technicolor about a period in history not often used as the subject of a major film. Henry Fonda and Claudette Colbert are fine as a young couple in the years before the Revolutionary War settling in the backwoods of New York state. The hardships of pioneer life are made even tougher by the presence of Indians on the warpath, the only refuge being a nearby fort where men, women and children find some protection.<br><br>Brilliantly photographed with lots of action scenes that bring the film vividly to life under John Ford's direction. John Carradine makes an excellent villain and Edna May Oliver gives another one of her priceless performances as an elderly widow who forms a strong attachment to the young couple. An unforgettable scene has Indians raiding her home while she refuses to budge from her bed even though they set fire to it. Scenes of Indian cruelty and torture are also present--but altogether a moving film well worth viewing to see what frontier life must have been like way back then. <br><br>Sentimental at times--but also harsh and realistic. Most memorable scene: Fonda pursued by Indians for a long chase over woodlands, finally wearing out his pursuers who collapse from sheer exhaustion. Thrilling chase!","user":"Doylenf","rank":[29,34]}]