[{"title":"A Cute Little Prostitute","rating":3,"date":"3 June 2017","review":"The Hang Up (1969) <br><br>** (out of 4) <br><br>Sgt. Walsh (Tony Vorno) is a tough-as-nails detective who will do whatever it takes to keep scum off the streets. His attitude changes when he meets a young prostitute named Angel (Sharon Matt) and soon he finds himself falling for her as well as getting pulled into the underworld.<br><br>THE HANG UP isn't an awful movie but at the same time it needed a bit more sleaze to be more memorable. As it stands, this John Hayes film has a couple decent performances, some at times bizarre nudity and a decent story but there's just not enough bite here to make it more memorable and more entertaining.<br><br>As I said, the biggest problem with this movie is that the Hayes screenplay simply doesn't go far enough in the sleaze factor to make it more entertaining. If you've seen the director's THE CUT-THROATS from the same year then you'll know that he was certainly capable of doing more in the sexploitation genre but sadly none of that is to be found here. While you're at least mildly entertaining in what's going on, at the same time you can't help but feel you're watching something a bit too tame.<br><br>I will say that I enjoyed the performances of both Vorno and Matt. I thought of two of them at least had some nice chemistry and I thought both of them fit their roles quite nicely. As I said, there is some nudity throughout and a couple action scenes but just not enough to keep you more glued to what's going on.","user":"Michael_Elliott","rank":[4,5]},{"title":"Decent entertainment.","rating":7,"date":"24 April 2016","review":"Tony Vorno gruffly plays Sgt. Robert Walsh, a bigoted, surly vice detective who professes to despise \"freaks\" of all kinds, especially as he's obliged to dress in drag in the opening sequence to snare some white collar deviates. His attitude seems to change when he is touched by a young prostitute, \"Angel\" (Sharon Matt) working for a smiling, crazed pimp named Pyrano (Peter Balakoff). Walsh and Angel enter into an affair that leads to the grumpy middle aged fart being stuck in a compromising position.<br><br>\"The Hang Up\" is good enough entertainment for lovers of adult-oriented fare. Written and directed by John Hayes (\"Dream No Evil\", \"Grave of the Vampire\"), it does offer a stinging commentary on hypocrisy in the law enforcement community. It's reasonably sleazy - if maybe not sleazy enough for some tastes - and there's a steady supply of very lovely young ladies on hand who show quite a bit of flesh without going full frontal. The decadence on display is still pretty amusing. The lounge style music score by Mario Toscano is enjoyable, as is the crisp cinematography by veteran B movie D.P. Paul Hipp and camera-work by Henning Schellerup. And while the movie is certainly sexy, it's never very violent. It runs a fairly trim 76 minutes, with a very sobering wrap-up.<br><br>The performances are all generally good. Vorno is convincing in the lead, and the gorgeous Matt is appealing as his love interest. Appearing uncredited are Bambi Allen as a performer named Suzette, and Erik Stern (\"The Love Butcher\") as Walsh's by-the-book, quick tempered partner.<br><br>Overall, an agreeable mix of exploitation, crime, and melodrama.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[5,7]},{"title":"ATTN Pornographers: Stop preaching, start arousing","rating":24,"date":"24 August 2015","review":"Pornographers often emulate Cecil B. DeMille's classic silent films, which took a high moral ground against immorality and promiscuity while proceeding to wallow in salacious content for commercial purposes. John Hayes in THE HANG UP doesn't merely try to have it both ways - he tries to have it three or four different ways in a mixed-up drama of corruption and redemption.<br><br>Miscasting is the other culprit in making this a poor film. Tony Vorno, whose stage name Sebastian Gregory is the one that sticks with me, is a lousy choice for chief protagonist, meant to be a character lead (not unlike Robert Duvall in a similarly failed movie of this time period, BADGE 373) or Gene Hackman (the great FRENCH CONNECTION) but overdoes his acting as is miserably unsuited to the character's romantic side.<br><br>Vorno plays Vice Squad Sgt. Bob Walsh, a mean-spirited cop whose partner Richards (Erik Stern) emulates his tactics, a fact that very cornily will lead to conflict after Walsh turns over a new leaf mid-film. Incident that changes his life is when he &amp; Richards in drag (very unconvincing as women, but they fool the other characters in B-movie fashion) who pull a sting operation that entraps among other johns a high-level politician Tilden.<br><br>In the first example of Hayes' convoluted-morals screenplay, the sting is not to get Tilden or the johns but rather to put behind bars a brutal con-man team who impersonate officers in order to blackmail guys who frequent male prostitutes. Walsh of course refers to the johns as \"faggots\", even while dressed up in wig and dress. Walsh is kind of like Archie Bunker - you like the guy even though he is an equal-opportunity bigot.<br><br>Tilden tries to get Walsh to let him off -no charge, no publicity, as a victim of the con men/blackmailers (as well as a victim of the sting -a more subtle moral issue not addressed here) but our hero is 100% unsympathetic and makes Tilden take the fall along with everyone else. This will haunt him, as the rest of the film details an elaborate (and thoroughly unconvincing) plot to get back at Walsh, orchestrated by the lavishly successful pimp/entrepreneur Pyrano, well-played by future porn director Ted Roter in a style befitting a \"Batman\" villain, weird makeup and all.<br><br>That plot has a central figure, 17-year-old prostitute Laurie aka Angel, who is a beautiful young actress Sharon Matt. All of Matt's credits stem from 1969, and she worked for a variety of directors including Herschel Gordon Lewis and Carlos Tobalina, but in each case, especially HANG UP, one's first reaction is: how did such a beautiful talent as she is get mixed up in such trashy projects?<br><br>Though Walsh at first questions her age (she lies and says she's older), the obvious jail-bait look is overlooked and gets him in trouble when Pyrano frames him for rape in order to blackmail Walsh. How he frames him is ludicrous; after befriending the girl, taking her home to live in his disheveled pad, and falling in love with her, Walsh goes with Laurie to visit her friends living by the beach, where they have a hippie-styled outdoor group sex session in which he's humping Laurie -everybody's in the mood. Photos are snapped and all the hippies are now potential witnesses of the statutory rape.<br><br>Meanwhile, Walsh's new behavior of Mr. Nice Guy coddling what he used to dismiss as criminals, especially in the case of Laurie, raises the hackles of partner Richards, whose idol is now perceived as a wimp, or corrupt, whichever one considers worse. Climax has a poorly staged car crash following a car chase of Richards pursuing Walsh who's driving Laurie &amp; Pyrano in his car after a busted drug deal. Pretentious finale which looks cribbed from some Abby Mann/Stanley Kramer serious \"problem\" drama or TV show has Laurie dying in Walsh's arms from the crash, exonerating him of rape with her last breath; Pyrano yards away screaming how Walsh is a rapist (\"I've got witnesses!\") and a corrupt cop working for him (true thanks to blackmail) and Walsh forlorn, ready for a freeze frame, his world turned upside down.<br><br>Before this we had to endure a poor scene of poorly-dubbed Tilden getting his own back: confronting Walsh with evidence of the rape and ordering him to testify in court exonerating Tilden of any involvement with the prostitutes, namely to lie and say that Tilden was an integral part of the sting in the first place, not a john.<br><br>On the Vinegar Syndrome DVD release it is paired with Hayes' SWEET TRASH in which Vorno has a bit part lasting perhaps five seconds as a thug shot by the hero near the climax of that film. Giving him an entire movie to carry was a big mistake, and Vorno did an even worse job pulling an Anthony Newley (SEE: his CAN MERCY HUMPPE... disaster) writing, directing and starring in the awful porn comedy COME ONE, COME ALL. The HANG UP poster says Rated X, but the film is soft-R featuring only topless footage of the many girls in the cast, unlike SWEET TRASH where full frontal nudity was prevalent. An actual rape scene of Tony humping an unwilling Laurie is not very explicit, but made powerful not for the sex but rather the danger because she is hanging out of an upper story window as he shtups her.<br><br>For current audiences, the assumptions of Hayes &amp; crew (circa 1969) regarding homosexuals and other non-mainstream individuals as \"deviants\" may be taken as quaint by some, but already there was a consciousness (later promulgated by Norman Lear in his \"All in the Family\" TV series) that such bigoted thinking was out-of-step. HANG UP's stance of only pretending that it is enlightened when in fact it is all about rubber-stamping the male porn audience's assumed attitudes (hate women, love rape), makes it simply nauseating to watch. flaw.","user":"lor_","rank":[3,8]}]