[{"title":"Why should I remember","rating":10,"date":"17 February 2003","review":"I saw this film for the first time when I was just 17 years old and it made an impression which has lasted another 25 yrs.  I just cant forget it.  To this day, I cannot think of another film which captures so much about the isolation of English civility from the raw power of tribal beliefs, and to bring them together in the gentility and peace of a rural Devon setting.. even the \"Wicker Man\" fails to gain such potency as it is set in what is from the beginning contrived to be island cultures.. remote from civil society, whereas \"The Shout\" is both in your face, while (as a 1970's film) hauntingly suggestive of unspoken fears and longings.  As such it speaks of the era within which it was made, a time of fragile contentment and almost subversive experimentation with.. other ways of viewing the world. Bates and York's performances are also totally believable which contrasted with the other-worldly nature of the setting and story make it compelling viewing. As another review stated.. I believe this to be a thoroughly underrated film, while for me at least definitely.. a classic.","user":"stevedyeruk","rank":[39,43]},{"title":"Underrated mystery","rating":7,"date":"5 August 2003","review":"I haven't watched this film in probably 20 years and I had forgotten a lot of the plot but I watched it again recently and it reminded me that this was one of the most unique and interesting mysteries I have ever seen. Story starts out with a young doctor named Robert Graves (Tim Curry) who comes to an insane asylum to help keep score of a cricket match between the inmates and the staff and sitting beside Robert is a man named Crossley (Alan Bates) who starts to tell him the story of how he ended up there. Crossley was in Devon, England and meets Anthony Fielding (John Hurt) who plays the organ in church but is always experimenting with music and sounds and Crossley invites himself over for lunch. He meets Anthony's wife Rachel (Susannah York) and during lunch he tells them he spent 18 years with the aborigines in the outback and that he had killed his own children and learned some of the aborigine black magic. He spends the night but early the next morning Crossley and Anthony walk out to a secluded area because Crossley mentioned that he learned \"The Shout\" that can kill anything in the general area. Anthony puts wax in his ears and Crossley does his \"Shout\". It kills a local sheep herder and the sheep and Anthony is saved by the wax. Crossley possesses Rachels buckle from her sandal which he uses to put a spell on her to possess her as well. These scenes are shown in flashbacks and we're not sure if this is just a made-up story from a crazy man or the real deal. We know some of it is made up because we see York's character as a nurse. The film is directed by Jerzy Skolimowski and along with the Jeremy Irons film \"Moonlighting\" he shows good patience in the way he tells the stories in his films. This is a very effective mystery and their are lots of images that flash during the film that are cause for discussion and one that pops in my mind is that in Anthony's work room there is a photo tacked to the wall of someone or something on all fours. Later, Rachel is nude in the bedroom waiting for Crossley and she gets on all fours that mirrors the image in the photo! The performances are excellent and Bates brooding nature is put to good use here. His quiet but demanding persona is totally believable. I really enjoyed York in this film and the nudity that she is asked to do here reminded me that English actress's have an entirely different attitude toward nudity in films. York was always an excellent actress and she was very popular in the sixties and seventies and her performance here shows why. This is a film that is intended for mature audiences who are not afraid to view something that leaves some questions. This reminded me of two other films, \"Don't Look Now\" and \"The Wicker Man\" which didn't cater to a less sophisticated mindset. Well made and extremely effective.","user":"rosscinema","rank":[41,46]},{"title":"scandalously under-rated","rating":9,"date":"8 March 2006","review":"And I really do mean 9/10. This film is a superbly made, wonderfully acted, deliberately under-stated fantasy masterpiece. The sense of conviction, of the truth being portrayed even when the paranormal erupts into the world, is unnerving. Yes, the film as a whole is unapologetically high-brow, full of cultural allusions that many will miss (The dry psychoanalytic cracks, the Francis Bacon-inspired compositions, the inversion of Orpheus), but all that can happily be missed without in any way detracting from the film. For those who love metaphysics, the incredible thrill of the possibility of magic, this should not be missed. (The current DVD release, MOST Regrettably, has been sub-optimally re-mixed. However, for those new to the film, it shouldn't matter too much. For those who have, turn that shout up loud!!!)","user":"shmekel","rank":[24,27]}]