[{"title":"Enjoyable tour of the Disney studio...","rating":6,"date":"11 January 2006","review":"Disney film incorporating several animated shorts with live-action tour of Walt Disney's studio in Burbank, California. Robert Benchley gives a colorful \"performance\" as a guest of Walt's (who makes a cameo), meeting animators and storyboard-editors while pitching the movie idea of a shy dragon. This picture, more a playful stunt than a memorable entry in the Disney canon, features some gorgeous animation and a lovely switch from black-and-white to color early on. It's more likely to appeal to nostalgia-crazy grown-ups however, instead of restless kids. Look for appearances by Goofy, Donald Duck, Bambi, and...Alan Ladd?! **1/2 from ****","user":"moonspinner55","rank":[11,12]},{"title":"What ho! Quite so!","rating":15,"date":"15 January 2004","review":"God, I love this film. It's just such fun.<br><br>At the time this film was made, Disney was primarily known for his animation but was positively itching to branch out into live-action. This is his first venture into \"traditional\" filmmaking. The story concerns comedic actor Robert Benchley (whose \"How To\" film series inspired many classic Goofy shorts) who, at the urging of his wife, searches the Disney studio top to bottom trying to sell Walt on the idea of making a movie about Kenneth Grahame's \"The Reluctant Dragon\" (Grahame's masterpiece \"The Wind in the Willows\" wouldn't become a Disney film for many years yet.) On the way he meets voice actors, musicians, animators (one played by Alan Ladd) and even Donald Duck and Goofy. When he finally finds Walt, he is shocked to see that his story has already been produced as one of Disney's most charming animated shorts.<br><br>Needless to say, this film is pretty dated in the age of \"Toy Story\" and \"Finding Nemo\" (I refuse to put the Dreamworks' \"S\" word in the same category as these two features) but the interesting thing is how many of these tried-and-true practices remain in effect to this day.<br><br>\nSurprisingly, this live-action film is ideal for animation fans. Not so much for the \"How does it work?\" element, but just the thrill in being immersed in that world. From sound effects recording to paint application. And Benchley's funny, let's not forget that.","user":"Bondorf39","rank":[11,12]},{"title":"\"You can't draw an elephant too dumb for me.\"","rating":7,"date":"30 December 2014","review":"The film stars Robert Benchley as a man whose wife encourages him to pitch an idea to Walt Disney about adapting a children's book into a movie. So Benchley goes to the Disney Studios, where he wanders around and gets a behind-the-scenes look at the animation process. He's treated to a brief bit of Donald Duck, Bambi, and the storyboarding of a cartoon in production called Baby Weems. He also gets to watch a new Goofy cartoon, How to Ride a Horse. Then he meets Walt Disney and gets to see a 20-minute cartoon based on the book Benchley wanted to be adapted, The Reluctant Dragon.<br><br>The first 20 minutes or so of the live-action part of the movie is in black &amp; white then it changes to beautiful Technicolor. It's a nice time capsule that shows us the goings-on at the Disney Studios back in the day and how they made cartoons. I found a lot of this fascinating. I absolutely loved the \"paint mill\" part! Robert Benchley is always funny. Walt Disney himself appears (wearing a groovy suit). Alan Ladd, Frances Gifford, and Frank Faylen all play Disney employees. The two major cartoons are the Goofy short and The Reluctant Dragon itself. The Goofy short is amusing. <br><br>The Dragon cartoon, which is I imagine why most people went to see this, is about a boy who befriends a shy, poetry-spouting dragon that doesn't like to fight. Well, for some reason, the boy is intent on getting the dragon to fight elderly knight, Sir Giles. Even after Sir Giles and the dragon meet and realize they both have a love of poetry in common, the boy still pushes for the fight. Finally the fight takes place, sort of, with Sir Giles and the dragon putting on a show for the villagers. I have to admit I didn't get the point of most of this. Why was the boy so intent on getting the dragon, whom he seemed to genuinely like, to fight? Once Sir Giles proposes the idea of faking the fight, he seems okay with it. So what was the point of pushing for the fight in the first place? Just let the dragon be! I know I'm probably looking too closely at it but it just seemed weird to me. Anyway, it's easy to see why this story wasn't enough for its own feature. It's animated nicely and has a sweet charm and humor about it, but the story needed reworking for sure. The dragon is impossible to dislike. Love his \"Ode to Upside-Down Cake.\" <br><br>This movie was a flop at the time of its release, which is understandable. It was a very different kind of movie for Disney. Still, it's a joy to watch if you like little glimpses back in time as well as great old Technicolor and some nice cartoons. There are no hidden Pinocchios here or anything but they are pleasant with lovely animation. Robert Benchley is great fun. This probably isn't for everybody, and will especially turn off people expecting it to be a feature-length cartoon, but I liked it.","user":"utgard14","rank":[5,5]}]