[{"title":"One of the most underrated animated films ever","rating":29,"date":"29 May 1999","review":"Finally Walt Disney Home Video has got their act together and released \"The Adventures of Ichabod and Mr. Toad\" in its entirety (the two stories have been available in separate forms for quite some time).  I'll admit that the clunky title doesn't inspire much more enthusiasm than it did back in 1949 (the film tanked, from what I've heard), but I hope some people will give this a chance just based on the Disney name. \"The Wind in the Willows\", narrated by Basil Rathbone, is a delightfully comic adaptation of Kenneth Grahame's classic novel, keeping the proper British tone (children may not get some of the UK slang used) while still remaining a lot of fun.  The highlight is the courtroom scene, featuring a bullying prosecutor (voiced by Disney animator/voice artist John McLeish, who also narrated the Goofy \"How to\" shorts) going toe-to-toe with a wonderfully insolent Toad (a great performance by Eric Blore). \"The Legend of Sleepy Hollow\", based on a story (not a novel, as the film suggests) by Washington Irving, is even better, making the most of its American colonial setting with some especially interesting layouts and backgrounds.  The humor found in the rivalry between schoolteacher Ichabod Crane and local roughneck Brom Bones for the hand of the manipulative tease (\"coquette\", in the film) Katrina von Tassel is some of Disney's best. The Halloween sequence leading up to the Headless Horseman's appearance is the most skillfully directed piece of animation I have ever seen outside of \"Fantasia\", conveying a magnificent sense of dread through both sound (the chilling echo of whistling and laughter, crickets chanting Ichabod's name, frogs croaking \"headless horseman\" over and over) and image (fireflies inside a tree trunk forming the eyes of a shrouded ghost, Ichabod's sweaty, nervous terror, the subtle cloud effect of hands closing over the moon). This is far more frightening than any horror film I have seen. All in all, a smart (listen to the narration and learn some new vocabulary words) film in every way.  One final note: I have not seen this film in years (I saw it plenty of times on The Disney Channel during the 1980s), and I noticed the many scenes involving both alcohol and weapons, particularly in \"The Wind and the Willows\" segment.  I accepted the scenes back then as a child and had no problem with them now, thanks to the general tone of the picture.  Although the concept of Toad being restrained from blasting a bayonet-wielding weasel with a shotgun and seeing Toad and his friends running from various flying knives, swords, and axes sounds like something to stay away from, it is all harmless fun.  Give it a chance.","user":"Billy-87","rank":[18,21]},{"title":"Excellent binding of two classic stories","rating":9,"date":"30 March 2010","review":"I am a huge Disney fan at 17, and while The Adventures of Ichabod and Mr Toad is not the best of the Disney canon, it is hugely enjoyable and definitely worth seeing. While I would rank both The Wind in the Willows and The Legend of Sleepy Hollow a 9/10, personally if I were to say which was better, the latter but only marginally. Merely because it holds more of a nostalgic value.<br><br>The Wind in the Willows is a condensed but very faithful 30 minute or so cartoon, based on the Kenneth Graheme literary classic. While it does drag in places, it does very well with what it crams into such a short running time. It is very lovingly animated, with some rich backgrounds and lovely colours. I also liked the music, it was lyrical, rousing and fun, the sort of music you will find in a Silly Symphony. Also the voice acting is very expressive, Basil Rathbone who I know best as Sherlock Holmes(well one of the actors playing the fictional detective) is brilliant as the narrator and Eric Blore is a lot of fun as Toad. Other characters I liked were Badger, who is very firm and gruff and Cyril, the Horse, a character who featured in one of the more memorable scenes from the cartoon, second only to the hilarious Courtroom scene.<br><br>On the other hand, The Legend of Sleepy Hollow is a terrifying yet worthwhile classic. One of my favourite moments in anything to do with Disney along with Willie the Operatic Whale. Bing Crosby is sublime as the narrator, never overdoing it, it was just right. The animation has an appropriately dark visual style, and the music is also memorable and fitting. The famous story features a schoolmaster named Ichabod Crane, and his love for Katrina and rivalry between him and Brom Bones, who like Gaston is a handsome tower of strength. Perhaps the most memorable moment of The Legend of Sleepy Hollow is the part when Ichabod meets the Headless Horseman, a character that was so scary he gave me nightmares when I was little. The Headless Horseman is the sort of character who is imitated in stuff like Scooby Doo yet never as well, the very look of him here makes the hairs stand up on the back of my neck.<br><br>Overall, this is an excellent binding of two classic stories. 9/10 Bethany Cox","user":"TheLittleSongbird","rank":[12,14]},{"title":"Satisfying Disney Animation","rating":8,"date":"10 October 2002","review":"Made at the end of the first age of Disney animation, \"The Adventures of Ichabod and Mr. Toad\" consists of two separate animated adaptations of classic stories. The Ichabod of the title is Ichabod Crane from \"The Legend of Sleepy Hollow\", and the Mr. Toad is J. Thaddeus Toad from the \"Wind in the Willows\". Each is short, running only about 35 minutes apiece, and is narrated by top of the line actors, Basil Rathbone doing the honors for \"The Wind in the Willows\", and Bing Crosby for \"The Legend of Sleepy Hollow\". I've not read either story so can't judge the adaptations accuracy, but it doesn't matter. Both stories are highly entertaining, and if you like the old school Disney animation, you won't be disappointed.","user":"gbheron","rank":[11,13]}]