[{"title":"One of Kurosawa's most polished movies","rating":9,"date":"23 May 2006","review":"Tsubaki Sanjuro is, unfortunately, not so widely seen abroad (= outside Japan) as Yojinbo, probably because it was not copied as a western. In Japan, however, Tsubaki Sanjuro is not less popular than Yojinbo. Not a few Japanese actually prefer the former to the latter, and it's easy to see why: It is stylistically more polished and smarter than Yojimbo and Mifune is 'cooler' as well - he shows a brilliant leadership and every Mifune fan would be really delighted to see how his young, naive disciples run after him like chicks following the mother duck.<br><br>And while Yojinbo's female main character, Orin, is an evil and crafty woman, Lady Mutsuta in Tsubaki Sanjuro is 'irritatingly light-hearted'. But she has a deep insight into Sanjuro's personality and understands him far better than his male disciples. An excellent character, and, in fact, she is the only person in Tsubaki Sanjuro AND Yojinbo to whom Sanjuro/Mifune speaks in a polite form (in Japanese).<br><br>Tsubaki Sanjuro is, so to speak, a 'concentrate' of Kurosawa's cinematography and one sees in it every aspect of his greatness in a very compact form. Therefore no one could remake this movie.","user":"aliaselias","rank":[44,52]},{"title":"Kurosawa Plays Himself.","rating":7,"date":"21 June 2002","review":"With a near clean lineup of masterpieces under his belt, nobody could fault Kurosawa for wanting to make a simple piece of entertainment. This simple aspiration did not stop him from making another hugely influential success.<br><br>Sanjuro is a loose sequel to the classic Yojimbo. The character is back, as is, confusingly, Tatsuya Nakadai as a completely different character. The landscape and tone are entirely new, lighter, jollier. It is almost a spoof of its predecessor,as Mifune's nonchalant and perpetually unwashed antihero helps a group of goody- two-shoes samurai save their framed master. This is also the first on-screen collaboration between Toshiro Mifune and the young Yuzo Kayama, before they costared to such memorable effect on Redbeard.<br><br>Nobody spoofs Kurosawa better than the man himself: this is without a doubt his funniest film, yet he never treats it as a second-class product. No slouch, the director peppers this light romp with unforgettable visual flourishes, enraptured homages to the American Westerns that so inspired him, and an end-note of surprising violence, the likes of which Tarantino could only dream of.<br><br>At a fast-paced 96 minutes, this is probably a great entry point into the cinema of Akira Kurosawa, and a film that would be much more highly regarded had it not come from such an established filmmaker.","user":"OttoVonB","rank":[52,64]},{"title":"Among the Most Entertaining of Kurosawa's or Mifune's Movies","rating":4,"date":"4 April 2005","review":"Akira Kurosawa and Toshiro Mifune combined their abilities in numerous fine movies, and while \"Sanjuro\", for its part, is lighter than most of the others, it is certainly one of the most entertaining of the movies that either of the two has made. Mifune gets a role that allows him to get many good moments, and it's also a role that he must have enjoyed playing.<br><br>The story is quite interesting, with many good turns and a way of keeping you guessing as to what will happen next. Mifune plays a samurai who takes it upon himself to try to save a rather hapless but nevertheless worthy clan from government conspiracy and from its own foolishness. It's a role that gives him both plenty of good lines and plenty of good action sequences. Kurosawa, of course, knows just how to get the most out of all of the material, and the story also provides some interesting psychological insights on the characters.<br><br>The settings are very good, and they are often used in creative ways in telling the story. Except for Mifune's character, most of the other characters are fairly one-dimensional, but they are believable, and they also allow plenty of room for Mifune to get the most out of each of his scenes. The result is a very enjoyable and well-crafted movie.","user":"Snow Leopard","rank":[26,32]}]