[{"title":"\"That's the best cover in the world...be a good cop.\"","rating":7,"date":"28 April 2019","review":"Billy Dee Williams stars as a hot shot police detective named Sneed, who's just moved from San Francisco to Paloma, New Mexico, on job-related purposes. From there, he continues his practice of being on the payroll of local criminals. Here, the criminal in question is a kingpin, Manso (Vic Morrow) hiding behind a legitimate company. Sneed is always figuring how to do his job while also accepting this syndicate money, and he even has a business advisor (Sorrell Booke) to help him in his pursuits.<br><br>As directed by Robert Hartford-Davis, \"The Take\" is now somewhat forgotten over time, but it's an interesting little cop / crime film. Part of that stems from the fact that Sneed is so matter of fact about being corrupt. It's all part of the job for him.<br><br>There are capably handled action scenes, as well as a fair dose of violence, but \"The Take\" is fairly standard stuff for the most part. One standout sequence involves the humiliation of an overweight suspect (Robert Miller Driscoll). One thing the viewer will notice is that the screenplay (based on a novel by G.F. Newman) doesn't try to shoehorn in too many romantic scenes with Sneed and the woman he loves (Tracy Reed, gorgeous but infrequently seen). It mostly centres around this milieu of male characters who are sometimes morally compromised in some way. Beautiful photography of the various NM locations is a big plus.<br><br>Billy Dee does a solid job in the lead, although the scenario often has his supporting players stealing the movie away from him: Morrow as the sickly kingpin, Eddie Albert as the unknowing police captain, Albert Salmi as a colleague who's ALSO on the take, James Luisi as a trigger-happy thug, the ever-creepy John Chandler as a mystery attendant for the opening trial scene, and A Martinez as the determined young detective Tallbear. But the biggest surprise may be Frankie Avalon's deft performance as a low-level hood who becomes an informant. He has one impressive scene in an interrogation room where he breaks down.<br><br>All in all, pretty enjoyable, if not all that memorable.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[7,7]},{"title":"Very Mild!","rating":27,"date":"27 June 2002","review":"At first glance, this seems like a good underworld melodrama/action flick but it's so poorly put together that it's unlikely to satisfy many. The film has the look and feel of a TV-movie and even by 1974, seems to have cheap production values. Most of the actors, especially Williams, seem to walk through their roles and the minimal action/violence scenes are so mild, they produce little effect. It is interesting though to see Sorrell Booke (Boss Hogg from the Dukes of Hazzard)in a straight role. You may not recognize him right away as he seems so different. It's also odd to see Frankie Avalon play a whining, pathetic hood. Given the cast and the premise though, you'd expect a lot more. Williams was an up and comer at the time this was made. It may be one of the reasons why he never quite made it as a mainstream movie star or even as a TV star.","user":"cfc_can","rank":[13,16]},{"title":"This is actually a VERY unique movie!","rating":8,"date":"28 June 2015","review":"I'm giving this movie a high/er mark because it is VERY unique! In fact I'd give it higher than an 8, but everything MUST have a flaw...the '8' is actually like a '10'...or '11' on an amplifier...or \"ludicrous speed\", heh heh! Billy Dee's character is a VERY confident, effective yet crooked cop. Imagine that...a character like that...in 1974! He REALLY is the star of the movie and takes no shorts! But, surprisingly, he also prevails in the end! Amazing! It would seem that, in those times especially, white audiences would have wanted to see this black character fall in the end. He's a bad guy...who prevails in the end! Not even white characters did this often back then! Billy is VERY smooth in this movie...a testament to how big a star he was/IS...and I'm CERTAIN this role helped him Land the 'Lando' character a relative few years later...because, again, it is such a RARE character...to even have existed in movie history...and, I can't emphasize enough, at THAT time in our, American history! You get the feeling this movie slipped though the cracks to even be MADE...much like 'The Spook Who Sat by the Door'...which came out the same year...both probably receiving the same, shelved fate at the box office...BECAUSE they were such anomalies...with themes that understandably made white America...unsettled, to say the least. And a nod to Vic Morrow's character...HORRIBLE how this GREAT actor died in real life. He, too, was VERY good in this movie...and pretty much anything, Like Williams, you will ever see him in. Well...it's about to come on (Bounce TV, 1:00 AM, 6/28/15...I WAS here!)...I'm going to watch it for a second time now...maybe with an amendment or two later (another post if compelled/allowed?). Be well movie enthusiasts! THIS one...is a rare gem! Update! 3:00 AM...just watched again. Surprised I remembered this movie so well and stand by my above review! Correction, however...'The Spook Who Sat By the Door' came out in '73...the same year as 'Soylent Green'...maybe I'll do reviews on those...2 of my favorites of ALL time...so simple reviews WON'T be as easy!","user":"jeffdiggy","rank":[8,9]}]