[{"title":"The Trouble with Movies","rating":4,"date":"18 April 2011","review":"Warning: Spoilers.<br><br>Burt Kennedy (1922-2001) directed two of the funniest American movies, \"Support Your Local Sheriff\" (1969) and \"Support Your Local Gunfighter\" (1971), spot-on western spoofs which also profited by star James Garner's laid-back charm.<br><br>Nearly twenty years later, in 1987, after a mostly western career, Kennedy helmed the spy spoof \"The Trouble with Spies.\" I would like to say Kennedy's spy spoof had \"mixed results\" but I can't. It's bad nearly all the way through. And since Kennedy is listed as writer, he can't blame the movie's failure on the material. The whole movie plays like an excuse for several people to have a holiday in Ibiza on someone else's nickle.<br><br>Donald Sutherland, an unlikely movie star who has never shied from unusual roles, has a confusing character. He's set up as a sort of British Clouseau who is sent on a spy mission in order to get captured and give disinformation to the enemy (this is still Cold War time).<br><br>The enemy tries to kill or capture him several times, but he always manages to escape. In fact, he seems to know just what to do in every situation. He does not even, like Clouseau, seem to survive out of sheer stupid dumb luck.<br><br>Take for instance the time he and his girl (Lucy Gutteridge) find themselves in a car balancing precariously on the edge of a quarry. Sutherland's character saves the day. One would expect, given the way he was set up, the girl would save the day. Or perhaps they should have fallen into the quarry. If they survived the fall, it might have been funny. If they had not survived the fall, it would have been a mercy for both of them.<br><br>Sutherland himself seems not to know how to play the character. Rather than inhabiting the character, as he usually does, he seems to be walking through the movie with it.<br><br>After Sutherland, \"The Trouble with Spies\" has no shortage of good actors. Young Lucy Gutteridge, not long after playing her part in the Royal Shakespeare Company's landmark television broadcast of \"Nicholas Nickleby\" is Sutherland's love interest. Legendary ditherer Michael Hordern and legendary cranky old bat Ruth Gordon have fairly meaty roles. Ned Beatty, who seemed to be an ubiquitous supporting player in the 1970's and 80's, also appears. Cameo parts are held by Robert Morley, playing the \"M\" part to Sutherlands secret agent, and Gregory Sierra (\"Sandford and Son\") as a local policeman.<br><br>Beatty's part makes little or no sense. He seems to be there simply to provide another red herring for our spy. But even red herrings should have a reason to exist.<br><br>Hordern and Gordon are always fun to watch, and one wonders if the movie might have been better written around their characters than Sutherland's.<br><br>Perhaps it was the print I saw, but the movie looks like it was done on the cheap. The whole thing has an under-rehearsed look to it. Good actors like Sutherland and Gutteridge are hard to dampen altogether and both give game performances that try to give us something to look at. But it's almost like they haven't been told whether they're in a comedy or a straight spy drama. The production has a tax-write-off feel to it. Parts of it contain actors who never interact with anyone else in the movie, and one cannot help wondering if they were shot later in a desperate attempt to give the movie sense.","user":"vox-sane","rank":[10,10]},{"title":"The trouble with piecing together spy capers like The Trouble with Spys (1987). I love Lucy Gutteridge from Top Secret! (1984)!","rating":5,"date":"27 January 2019","review":"Uuh, I'm no dummy (similar to Appleton Porter, Donald's lead) but this hither old '80s espionage (very little-known-about) movie marvel with Donald and Lucy (1987) taking place on the exotic isle of Ibiza (pronounced EE-BEE-THA, the LSD capitol of the world, a Balearic island off the coast of Spain right smack dab in The Mediterranean) is based on the even older (1983) book 'Apple Spy in the Sky' written by Marc Lovell, The Trouble with Spys!<br><br>The Trouble with Spys (Spys is not a typo) starring Donald Sutherland (the one, the only father of Kiefer Sutherland) and Lucy Gutteridge (my starlight, hold me, Lucy!) is stricken with the same troubling matters that most spy capers seem to encounter, staying alive until the end! The intensity's a little waning in and out, I mean actually, it's a lot waning in and out switching on and off instantaneously barely escaping certain (movie) death by just a hair (Donald's hair) with loads of close calls on Appleton's life, that is plenty of capturing near fatal experiences to enjoy sitting through and lots and lots of random occurring gun blasts to spruce up your adrenaline some as well as your fair share of sweet talk all appreciated to Lucy, oh sweet Lucy, all set in the interesting on location shooting spots too to spice things up a bit which I love, though it mostly sustains its very low-key, very generic and all too moderate, temperate conveying of the work at hand, a merely modest spy spoof that is with a total of three whopping IMDb user reviews to date currently if you do include mine. I love it however and I really love Lucy.<br><br>The trouble with making spy capers like The Trouble with Spys is thinking up a crafty, stirring script to take on (placed in Londontown is a must, the British spy capitol of the world home to the British intelligence agency), plus, also choosing to accept the mission of developing a plan for coming up with a dangerous set of spy games to play out onscreen (a scorpion on a string being lowered on to Appleton in his hotel bed from a hole cut in the ceiling from the hotel room above style assassination attempts will suffice), taking on the daunting task of funding the project and getting all these big stars in the same place at the same time (sign me up please I'll do it yes), being given the assignment of having the key players produce an undetectable and everlasting impression upon the mark (the actors vs. the audience, well done Lucy and Don I love you two guys!), and embarking upon a fully globalized and utter worldly life quest encapsulating grand, majestic sights to behold and take in (famous London square, massive cruise liners docked on the Mediterranean Sea in plain view in the background on the isle of Ibiza, Lucy, long, beautiful drawn out shots of Lucy walking about with Don, also a bunch of incredibly hot topless women on the beach in bikini bottoms playing volleyball, like 20 of them I count, maybe more, in a PG movie no less which is fine with me it just entails how little we men as a community and as a species knew about boobies back in the '80s, thanks girls, I love it oh how we've evolved since this fun-loving movie today would definitely earn a PG-13 rating in 2019 but it's not like it's a big deal or anything it isn't too risque it's just too sexually stimulating like give me a little heads up thank you so very much I love it but that's how it used to be before the computers and the social media and the Hollywood and the mainstream music wave hit like Kid Rock and Britney Spears and now Cardi B and Nicki Minaj too!) is imperative, involving sexual escapades with secret, romantic rendezvouses (Lucy kissing in the car omg...) plus the double cross is a must while infusing wit, humor, charm (Porter roller skating in a long black wig, poncho, roller skates and hat, a boater hat apparently, oh and a nice fake mustache of course!) and interest and action and mystery and suspense and drama (and comedy in this case) but as ghastly as The Trouble with Spys is in a lot of its more campier, cheesiest moments (writers, don't you want the watcher to not get so fatigued!) this is a very subtle (yet not so subtle) comedy/adventure/very romantic fun little borefest that I absolutely love! I love TTwS! I love Lucy. I love the animals. I love Donald Sutherland and his luxurious hair it looks wild and free back in the day, not the wig his actual true red hair! It looks great! Donald's so tenacious and so tall and handsome and cool looking that maybe him not being the best physical athlete for the gig isn't a big deal!<br><br>Top Secret! made by Jim Abrams and the Zucker Bros (1 of my most beloved comedies automatically making it one of my most fond movies too) is one of my very most favorite comedies and I always wondered why the beautiful lady star (Lucy) from it (Top Secret!) wasn't in a bunch more other good movies herself because she was so mesmerizingly, fascinatingly gorgeous and hot, so super hot and sweet like really sweet too and hilarious (in Top Secret!) and so ultra sexy that I thought 'Lucy's so hot why isn't she in more movies?!' and I wrote about all of this in my Top Secret! review in which in that said review (about Top Secret!) I mentioned all of this and how I had to talk about Lucy then since it might be the only shot that I get because I don't know if I'll ever get around to reviewing The Trouble with Spies, oops I mean Spys but here I am, more than 6 months later, with Lucy now watching it now reviewing it now and loving every minute of it now and I have to say Lucy Gutteridge is SOOOOOOO gorgeous and I again have no choice but to raise that notion as to why isn't Lucy Gutteridge in more good movies to speak of look at her she's so seriously seriously deeply SUPER sweet and phenomenal and hot and awesome and cherished oh my Lord SHE'S A gOrGeouS GODDESS I love her and I want her and I need her and she's real......I'm sorry....I don't recall what all this was about but I just know that Lucy Gutteridge IS LIKE A GRADE A+ ACTRESS AMONGST THE LIKES OF JENNIFER CONNELLY AND (a lesser) MADELEINE STOWE or Rita Hayworth or someone but nobody even knows about it or her all-time beauty really or this movie much too much or anything like that or the love I feel people are just basically clueless to exactly how all-time incredible Lucy is and I'm sick of it. I love Lucy Gutteridge. And it's not just her face either, it's her lean body, her awesome slim physique, and her overall body just in general she looks really athletic and so quick-footed scampering around in this O M g I swear to Lucy that YOU ARE AS BEAUTIFUL AS WOMEN GET AND I do not know why you are not in more movies yourself. You should be. It must of been your decision, huh, Lucy's life choice. I love you Lucy G.! Lucy's an angel I'm going to try to buy this on Blu-ray if they have it out now or if ever I don't even know if this is on Blu-ray yet. I'm gonna go check right now because I love little Lucy Gutteridge!!!!!!!! so much. Thank you, Lucy! You're a movie icon, a vision of ecstasy and delight plus a real gem (in mind condition!!!!)!!! I love you Lucy!!!!!!!!!!!! Do more movies. I love Lucy's hair!! TTwS is good! I love you Lucy! You're so beautiful!!!!!!!!!","user":"tbills2","rank":[2,2]},{"title":"a MYSTERY, not a comedy","rating":2,"date":"12 November 2013","review":"this is just terrible. It has an impressive cast but wow, this thing stinks on ice. I was prompted to hit the net looking for what could have been going on in Sutherland's life to set off such a stink bomb in what is otherwise a stellar career. He looks thin. He isn't really in character, he's just phoning it in. Some of the supporting cast look and act like they're from Hammer studios. He doesn't connect with them at all. Ruth Gordon has a few moments that help remind us what acting is supposed to be like, even with the shoddy material she's given to work with. Overall, this thing looks done on the super-cheap: sets are flimsy feel like a sound stage, lighting design looks almost fluorescent, actors are poorly made up with blotchy uneven makeup, and the comic bits of business are straight out of a Three Stooges matinée flick (check out the street scene where he nearly gets run over, in the beginning). It was so painful to watch that I just had to bail. What I cannot fathom is how this thing was put together to start with, I mean was he doing this as a favor to the director? He couldn't possibly have been doing it for some quick money (assuming he was broke or a drug addict or something else leading to dire straits)--there was obviously NO money involved in this flick. His career has been on an even keel, he never went into the dumps like Micky Ruorke or Dennis Hopper. If he didn't do it as a favor to a has-been one-trick pony director, then it's a complete MYSTERY to me. You'd have to be pretty drunk to watch this thing. And even that is iffy.","user":"dmissydog","rank":[10,22]}]