[{"title":"chilling!","rating":16,"date":"16 March 1999","review":"After seeing this gritty drama, then you wonder why there are nuts in the world. The movie is more  ( in a weird kinda way), like a docudrama. It shows how 2 people can become alienated and rejected from society, to become heartless animals. Not to justify what they do, but if these two boys were somewhat loved, maybe they wouldn't be cold blooded killers. There's a scene where one of the teens father  ignores him totally. That is shocking. But watching it will disturb you.","user":"saint-21","rank":[13,14]},{"title":"Just as good as I remember....","rating":5,"date":"5 April 2002","review":"I saw this movie for the first time 8-9 years ago when I accidently zapped into it on cable tv. I remember it made strong impression on me and that I liked it a lot. Now almost 10 years later I bought the DVD and I must say it makes just as strong impression now. The movie is great &amp; shocking and really makes you think what some people are capable of. I recommend this to everyone that want something more then just the ordinary action movies, but be aware,the movie is very violent and probably not suitable for everyone...","user":"delerius","rank":[15,18]},{"title":"disturbing and funny","rating":9,"date":"11 January 2006","review":"First off, don't listen to the comments by the moron from Pleasant Valley, New Mexico. Maxwell Caulfield couldn't possibly be doing his version of \"Henry: Portrait Of A Serial Killer\" since \"The Boys Next Door\" came out BEFORE it. In fact, since \"The Boys Next Door\" came out in 1985, it's pretty safe to say that \"Henry: Portrait Of A Serial Killer\" (which came out in 1986) borrowed from it, not the other way around. Regardless, this movie has a great soundtrack and really funny dialogue (\"Two Blacks and a Mexican.\") Scenes so outrageous that they're actually funny (gas station beating). Now, while it's not the greatest film in existence, the fact that the (life- like) violence in the movie could really happen (and sad to say, similarly HAS really happened before), make this movie better than a lot of movies out today. The acting is pretty good, especially Maxwell Caulfield (probably his best performance). I'd recommend this movie to anyone, especially if you grew up in the '80s. People who don't like it are usually over-analyzing it a bit too much. Too many people are looking for \"social commentary\" when watching movies. They usually end up not liking many films. They forget the simplest thing: movies are made to entertain, bottom line.","user":"rogerebertisfat","rank":[16,20]}]