[{"title":"'Return of the Living Dead Part II'","rating":5,"date":"23 April 2004","review":"In this sequel to 'The Return of the Living Dead', three neighborhood kids stumble upon one of those army drums and accidently release the gas that revives the dead. What follows is basically the same horror mayhem as its predecessor.  Zombies rise from the graveyard and remarkably manage to eat the brains of everyone except for the few people within which the movie revolves around. The two movies are pretty much similar in terms of content, but what is lacking this time around is freshness.<br><br>The first movie took a satirical approach to George Romero's 'Night of the Living Dead', and it worked in terms of humor and creepy fun. In this film, which is basically a carbon copy of the first, it is not quite as much fun. Rather, it seems to be more silly than funny.  The script strains for humor throughout the movie, particularly in a scene in which the movie mocks Michael Jackson's 'Thriller' video. But its flaws don't really matter because this is not the kind of movie to be taken seriously.  I guess that it can be a decent movie to watch on a Halloween night.<br><br>Rating: (5/10)","user":"rah604","rank":[22,31]},{"title":"More of a comedy this time around.","rating":6,"date":"25 March 2003","review":"This was an ok sequel to the original.  Though I liked the first one much better.  This time around one of those drums from the first one falls off a truck and these kids open it, once again awakening the living dead.  This time around though, it is definitely more of a comedy than a horror.  The first one had quite a bit of comedy in it, but in the end I would say it was more horror...this one has very little horror in it.  A kid, his sister, and I think a TV or cable repairman must try to escape the living dead.  There is also an old guy who was a doctor.  There are also two grave robbers who are the exact two guys who released the chemicals in the first one and a girlfriend of the younger guy.  Once again the zombies are seemingly indestructible, but this time a weakness is found in the form of electricity.  So the conclusion to this one occurs at an electrical plant. The kid must face down the bully who released the chemical too.  Would have been a better movie if it was more horror oriented, but it is still worth a look.  The slimey zombie from the first one also makes a brief appearance.","user":"Aaron1375","rank":[7,8]},{"title":"Not much here, pretty stupid actually...","rating":9,"date":"9 April 2002","review":"...I hate to say it, but this movie is nothing compared to the original, seriously. Thom Mathews and James Karen are back, playing different roles of course, as grave robbers, and there are also a bunch of young middle school kids, a teenage girl and another guy fleeing in terror from more brain-munching zombies, resurrected from their peaceful slumber yet again by the weird chemical from the original. This is missing the great punk/rock/metal soundtrack, humor, punk rock characters, and gore from the original, so basically it falls flat and never goes anywhere. I was getting really bored. If you want a rehash, this is your dish I guess, but otherwise this movie flat out blows. Watch the first one again.","user":"ehosh2494","rank":[28,43]}]