[{"title":"Great revenge flick","rating":6,"date":"21 November 2001","review":"A brother and sister (Shannon Presby and Lori Loughlin) lose their parents in a tragic accident, and are sent to live with relatives in Florida. They are repeatedly bullied and traumatized by the local yahoo played wickedly by James Spader. What follows is a late night showdown at an empty carnival between good and evil, all in the name of survival. Lori Loughlin delivers a decent performance, as well does Shannon Presby as her very protective brother. However, James Spader's convincing performance is pure evil, at its best. As far as bully films go, this is one of the best.","user":"arturopanduro","rank":[13,15]},{"title":"James Spader plays a nut...again.","rating":7,"date":"8 May 2004","review":"The New Kids is probably best for fans of the cast or anyone satisfied by mediocre teen 80s movies. This is one of those movies about a bunch of psychotic weirdos trying to do as much damage as possible to two innocent victims, leaving you to wonder what the heck these kids did to push the antagonists so far over the edge.<br><br>Here, our innocent victims are Abby (Lori Laughlin) and Loren (Shannon Presby). After their parents died, the brother and sister go to live in an amusement park (how awesome is that?) where their relatives (surrogate parent-types) live and work.<br><br>The psychos are led by Eddie Dutra (James Spader) a sadistic albino, and his gang of merry men (one of which is the excellent John Philbin who 80s fans will remember as 'Turtle' from the surf adventure, North Shore). Anyways, Eddie wants Abby, and what Eddie wants, he gets. But when Abby pushes him away after several forceful advances, sadistic control-freak Eddie doesn't want it to look like he let a girl weaken him. He and the gang go after Lorren, Abby, and their family, in a do or die situation.<br><br>\nDespite having a decent finale of chases and destruction, the movie has a very simple story. Unfortunately, it can also be quite sappy during those brother-sister inspiration talks. Abby and Lorren are willing to fight back against Eddie and his gang once and for all after so many of his vicious acts against them and their family, but for such tough kids (especially Abby), they do seem to come off as bitterly sappy sometimes.<br><br>\nUnfortunately, too, the movie has a very simple story. I watched it on the Spanish Channel (I don't understand Spanish) and I figured everything out alright. It's a generic story, but one you'll like if that's what you're into or if you're fans of the actors in this film.","user":"vertigo_14","rank":[15,20]},{"title":"Surprisingly entertaining","rating":10,"date":"19 January 2003","review":"You really can't expect too much from just looking at the movie's title, but this movie is seriously above par than others in the genre.  James Spader's performance is a standout and he portrays a similar character in the picture he did right after this (PRETTY IN PINK).  Eric Stoltz does a good job with his role as well. A fine effort from Cunningham, especially after that SPRING BREAK fiasco.  Do not pass up.","user":"MikeK-7","rank":[15,20]}]