[{"title":"Jurassic Park Version 1.0","rating":24,"date":"24 July 2004","review":"Westworld was the blueprint for what was later Jurassic Park.  Here, Michael Crichton first envisoned Disneyland, if the Hall of presidents ran amuck. It provided many of the inspirations for later sci-fi films, like Terminator.  It was a great blend of action, horror, and comedy.<br><br>Richard Benjamin and James Brolin are the heroes of the film, but Yul Brynner is the star.  He portrays a robot, based on his character from \"The Magnificent Seven.\"  Brynner is the relentless killing machine who fights until the end.  With almost no dialogue, he conveys fear with little more than expression and body language.<br><br>The film explores old themes, the dark side of technology, but it was ahead of its time in depicting the dangers of computers and automated systems. The effects are dated, but the story holds up well.  The sequel, Futureworld, tried to add political intrigue, with less success.  Definitely one for the sci-fi fan or collector, or cult movie lover.","user":"grendelkhan","rank":[82,87]},{"title":"Succeeds in its aims, despite the plot holes","rating":9,"date":"22 March 2005","review":"Set during an unspecified future era on Earth, Westworld features Peter Martin (Richard Benjamin) and John Blane (James Brolin) on their way to a new kind of amusement park, Delos, located way out in the middle of a desert. Delos is divided into three \"virtual reality\" areas, Roman World, Medieval World, and West World (or Westworld). These are not mere computer simulations, however. Guests are immersed in a complete recreation of the relevant eras--they wear the clothing, sleep in the accommodations, eat the food, and so on, relevant to the era. They also interact with robots that are nearly indistinguishable from humans, and can talk to, have sex with, and even kill some robots. It's an escapist's dream, at least until something goes wrong.<br><br>Westworld isn't the easiest film to rate. It has its share of faults, and the more one analyzes the plot, the more problems one can find. However, the premise is so fantastic, the atmosphere is so good (even though it's very spartan for a sci-fi film) and the performances from the principle actors are so entertaining that it is very easy to excuse any flaws and just \"go with the film\". The bottom line is how enjoyable or aesthetically rewarding a film is, not how logically taut the plot is. On those grounds, Westworld certainly deserves a 9 out of 10.<br><br>A lot of the attraction is the voyeuristic escapism experienced by the viewer. Who wouldn't want to be able to go to an amusement park like Delos? It's a fabulous idea, and a not-too-thinly-veiled satire/extrapolation of Disney World, which had just opened two years before this film was released (remember that Disney World is the Florida location; Disneyland is the California location). Walt Disney had already been talking about his original conception of EPCOT (which was quite different than the Epcot that was eventually opened in 1982) by 1967. Writer/director Michael Crichton's Delos is a rough combination of Disney World's theme parks with an EPCOT-like residency, if only a temporary one. <br><br>At the same time, computer and robot technology was finally starting to be strongly integrated into industry on an \"everyday\" level (it was just a bit more than 5 years until the beginning of the home computer revolution). Disney World's operational infrastructure is an extensive behind-the-scenes computer network, which Crichton parallels with his white lab coat-wearing scientists working amidst monitors and banks of flashing lights (and this is even better satirized in the sequel to Westworld, 1976's Futureworld).<br><br>The premise provides an easy launching pad for a number of ethical, philosophical and scientific dilemmas: What are the implications for killing someone when they seem almost identical to humans? What if they're artificially intelligent? Is it infidelity for married persons to have sex with robots almost identical to humans or artificially intelligent? If machines become sufficiently complex, won't they be prone to the same flaws as humans, such as viruses (or something analogous), and if artificially intelligent, disobedience? All of these questions and more are explored in Westworld, albeit most are not explicitly broached--probably in an attempt to avoid sounding preachy or over-intellectual.<br><br>Because at the heart of Westworld, at least on a surface level, is a fantastic thriller/suspense story. Once things begin to go wrong, the \"play\" turns deadly, and the end of the film is a very long, deliberately paced chase sequence. Yul Brynner is a menacing \"Robot Gunslinger\", in a character that Brynner thought of as an ominous satire on his Chris Adams from The Magnificent Seven (1960), and which eventually seems somewhat prescient of The Terminator (1984). The suspense/horror is based on a classic gambit of machines forcefully taking control of their creators. It may be more modern, but basically the threat is that of the wronged Frankenstein Monster, with all the attendant subtexts, including humans \"playing God\" as they create other beings in their own image, and dehumanization of the Other.<br><br>It's best while watching to not dwell on the quagmire of plot problems that aren't dealt with. If the guns in Westworld can't harm humans because of \"heat sensors\", what's to stop you from being shot if someone aimed at something inanimate that you happened to be standing behind? How do the swords in Medieval World not harm that land's guests? If guests can't be hurt, why are they thrown into tables, the bar, etc. during a brawl? (We could argue that the robots were already going haywire at that point, but the technicians aren't shown being alarmed by this behavior.) How do they fix all of the architectural damage done every day? Where are all the other guests? Wouldn't it cost a lot more than $1000 per day per guest to make all of those repairs and perform routine maintenance on the robots?<br><br>That's just a small sampling of the questions you could worry about while watching the film, but that would be missing the point. Westworld isn't intended as a blueprint for actually constructing a Delos-like amusement park. The idea is to get the viewer to fantasize about the scenario, enjoy the more visceral, literal suspense story, and at the same time ponder some of the more philosophical questions and subtexts. On those accounts, Westworld greatly succeeds.","user":"BrandtSponseller","rank":[149,176]},{"title":"Great Film - Very Original. Inspired many films in the future","rating":10,"date":"29 June 2008","review":"I think a lot of later evil robot films including 'The terminator' borrowed a lot of ideas from this film. Even 'The Predator' got a lot of ideas from this. (The robot vision mode, the heat sensing)<br><br>This film is totally original. i don't see any title that came before this that had the same ideas. Michael Crichton is one of the most creative people in this business. Although i think he did re-use the Westworld amusement park concept with Jurassic Park (Carnosaur). Just replacing androids with dinosaurs. It pretty much the same concept: Man made environment that falls to chaos.<br><br>And the most bizarre part of the film is the pervasiveness it transmits. Its so pervasive. It really titillates you with its concept. The female droids and how they are used. Its crazy.<br><br>And the fact that three different cultures (The wild west, Rome, and medieval england) all spill over each other. That is really wild.<br><br>Great movie.","user":"arjunkaul","rank":[25,27]}]