[{"title":"Sad, strange little film is a must for Hancock buffs.","rating":27,"date":"27 November 1999","review":"A more serious effort from the star of the classic sitcom \"Hancock's Half Hour\".  The boastful exuberance of his radio and TV days has been toned down.<br><br>Roundly panned at the time of release, the film looks better (though not perfect) today.  \"The Punch And Judy Man\" sometimes stumbles in its attempts to play off scenes of gentle whimsy with those designed to show the lead character's life of quiet desperation, but the attempt to place Hancock's familiar persona in a more realistic (even somewhat grim) setting will be of interest to devotees of the lad from East Cheam.","user":"rudyardk","rank":[14,14]},{"title":"A brave try at something different","rating":7,"date":"9 February 2005","review":"When 'The Punch and Judy Man' was released Tony Hancock had been one of Britain's favourite radio and television comedians for about seven years. His work was brilliantly written by Ray Galton and Alan Simpson who worked many of Hancock's own quirks into his screen character.<br><br>Unfortunately Hancock's intellectual pretension came to the fore as he began to feel limited by Galton and Simpson's writing and decided he would try more serious comedy on the lines of Chaplin and Jacques Tati. We can see this ambition in the film's titles: starring Tony Hancock, screenplay by Tony Hancock (and Philip Oakes), based on an idea by Tony Hancock. Apparently Hancock also wanted to direct and photograph the film but Associated British vetoed this.<br><br>Ultimately Hancock lacked the intellectual depth and discipline of his heroes and his public didn't want to see him in an unfamiliar role. The result was a box office dud.<br><br>Forty years later we can see the film more objectively. The frustration is that the viewer can sense what Hancock was aiming for: a satirical look at celebrity and snobbery within the confines of a fading marriage. For example, the name of the fictional location - Piltdown - suggests the intellectual fraudulence of the town's middle-classes, being based on a faked primitive man which fooled the scientific establishment for half a century.<br><br>Unfortunately other elements creep in, such as the pathos of a little boy slipping his hand into Hancock's as they walk along a rain drenched sea-front. Until this point their relationship has been one of mutual irritation (the boy attends all Hancock's Punch and Judy shows and corrects him when he gets the plot wrong) which is much more satisfying.<br><br>The best moments occur with Hancock's gleeful anarchy as he annoys the 'Yaks', self-serving members of a secret society who dominate local business and politics. The ice-cream eating scene is excellent. The final scene with the wife is quite touching a we see them reach new understanding and mutual respect.<br><br>Despite good things the film never quite comes to the boil, but the good things are worth watching the film for, such as Lady Jane Caterham's speech to the good people of Piltdown - as wicked an impersonation of the Queen's delivery as I've ever heard.<br><br>A last word. For some reason the video release I have cuts two short but crucial early scenes: Hancock shoving a bunch of artificial flowers up the rear of an ornamental china pig to show his frustration with his marriage, and of him raising his hat to the Mayor while actually giving the 'V'-sign with his fingers. Perhaps this was to ensure a 'U' certificate but it seems a poor reason to chop a film.","user":"vaughan-birbeck","rank":[15,16]},{"title":"HANCOCK'S WIDER ROLES","rating":6,"date":"17 September 2003","review":"My cd came with \"The Rebel\" which I have commented on elsewhere on the Imdb.Many of Tony's old friends from his \"Half-Hour\" tv series were in this film, Hattie Jacques, Mario Fabrizi, Hugh Lloyd and of course John le Mesurier.The broader canvas of cinema allowed Tony to develop his humour around a story set in a typical early sixties English seaside resort run by a myopic town council led by Ron Fraser.It is refreshing to see Sylivia Sims playing comedy as his wife who has social pretensions of meeting the pompous lady who will open the town's illuminations.I don't believe Hancock is \"married\" in any of his other films or tv comedy and this gives him a chance to interact with her in the domestic scenes together, certainly a novelty.His friend John le Mesurier does beach sand sculptures with commentaries and with Mario Fabrizi, the beach photographer and his assistant in the Punch and Judy stall, Hugh Lloyd, they adjourn to the pub to annoy the local worthies.<br><br>This film has a gentle humour and Hancock gets away from the pseudo intellectual persona he so often played in his  tv comedy shows and in \"The Rebel\".Highly acclaimed is the mime sequence in the ice cream parlour run by Eddie Byrne with the little boy fan.Do we assume this is the son he never had in the film?I believe viewers today are giving more generous ratings to this film than when it was first released in 1963.I rated it 6.","user":"m0rphy","rank":[8,9]}]