[{"title":"As satisfying as the best classic novels; shame about that touch of political revisionism","rating":9,"date":"29 January 2006","review":"All in all, I loved Bertolucci's 1900. By the end of it (I watched the uncut, 318 minute version and it was an effortless, engrossing, never over-long experience), I found myself feeling as satisfied as someone who's just finished reading one of those wonderful, very long classic novels. There are, however, some major flaws, not just in narrative structure but also in content, and this is why I've given it \"just\" a 9/10. It's rather disjointed and all over the place, like a huge, gangly foal rather than a harmoniously-formed horse. <br><br>However, I don't agree with one accusation I heard that was leveled at it, regarding its change of tone. In my view it was unavoidable and appropriate when dealing with a historic period going from the beginning of the 20th century to the rise to power of Mussolini (1922), and finally to the culmination of full-blown Fascist oppression. The \"change of tone\" in the film perfectly captured the profound and shocking changes that swept over Italy, as if bitten by something that had made it go mad. <br><br>My main problem with the film, however, was of content rather than structure: the over-simplification of its politics, not to mention the inaccuracy in the way it portrays the reasons for the rise of Fascism. These smack of just a little too much historical revisionism even for a tendentially left-wing person like me. But then, 1900 was made in the 70s, smack bang in the middle of a decade in which the Italian left wing had a strong hold on the country's artistic and cultural institutions. After decades of poverty, ignorance and forced silence, these institutions voiced their views with a more earnest tone than they would have had if they'd never been repressed. Pasolini, Bertolucci, Moravia and several others producing art during the 50s-70s in Italy are a prime example of this kind of voice. Inevitably, it was tinged with a political agenda  it couldn't have been otherwise, as political freedom was a new toy and everyone was so keen to play with it. <br><br>Bertolucci's film would have us believe that the rich landowners (represented here by the Berlinghieri  Robert De Niro's character's family) were responsible alone for sponsoring the Fascists. Keen to maintain the country in an archaic state of feudalism with the poor, ignorant multitudes working their estates as semi-slaves, they encouraged or turned a blind eye to the violent cruelty of the blackshirts. They employed them as \"guard dogs\" (as De Niro's character Alfredo refers to Attila, Donald Sutherland's Fascist bully character at one point), giving them official charges as managers of their estates and oppressors of any sign of rebellion, etc. Though this has effectively happened, a more objective historic version will take into account that for Fascism to spread so rapidly and so well, it must have had some hold on the \"common people\", too. Just consider that the rich landowners were a tiny, tiny minority of the population and not all were sympathetic to Mussolini  originally a Socialist himself. The rich often supported the monarchy and/or church instead (and Mussolini aspired to a lay state, not a religious one). It was indeed so many of the common men and women of Italy who responded well to the young Mussolini, who was neither particularly cultured nor a member of the elite, yet was a charismatic go-getter who could speak to the crowds in a way that made sense to them for the first time ever. The landowners and aristocrats, decadent and totally out of touch from reality (as Bertolucci's film shows so well), had no idea how to relate to the masses. In contrast, Mussolini wanted to harness the energy of the multitudes, giving them a sense of worth for the first time ever. What a cruel irony this turned out to be for all those people! <br><br>What Bertolucci's film is successful at putting across is the fact that neutrality, turning a blind eye to and staying passive to Fascism was in itself responsible for allowing it to thrive. ****SPOILERS****: Alfredo does nothing to stop Attila and his stooges beat Olmo, Gèrard Depardieu's character, to a bloody mess, despite the fact he knew that Olmo was innocent of having killed the child at the wedding party. This scene is so effective in creating a sense of frustration in the viewer. Watching that scene, it comes naturally to ask oneself: \"Why didn't anyone do anything to stop it?\" EXACTLY! ****END OF SPOILERS.**** <br><br>Regarding the accusation leveled at the uncut version of the film containing pornographic sequences: I thought pornography's sole purpose was to titillate and arouse. Do any scenes in this movie try to achieve this? Most certainly not! Naked human bodies can be representative of so much more than just sex. They are not just about the degree of their ability to arouse or otherwise, but also about a whole other spectrum of human states and feelings. Strength, vulnerability, tenderness, compassion, closeness, distance, receptiveness and whatever else is sometimes just not possible to express in so many lines of dialogue. Why shouldn't a sexual encounter  even one featuring genitals in view  speak volumes about so many other aspects of men and women's humanity? <br><br>I could write so much more about this movie! Though not as mesmerisingly beautiful to look at as Bertolucci's 1970 film Il Conformista, it is none the less a testament to Vittorio Storaro's genius photography once again. I will probably be watching this movie many more times and discovering more layers, more beauty and even more imperfections which is all worthwhile when confronted with such amazing material. Whoever's been comparing 1900's portrayal of Fascism with the way it was dealt with in Il Conformista isn't being entirely fair: the latter takes a far more intellectual approach (after all, Fascism was a multi-faceted phenomenon) and is a less ambitious film anyway, therefore less likely to fail.","user":"Asa_Nisi_Masa2","rank":[111,139]},{"title":"Under-rated epic","rating":10,"date":"3 July 2003","review":"\"1900\" follows the lives of two friends (although sometimes they seem more like enemies!) born on the same day in a beautiful part of Italy. Olmo is born a bastard to peasant farmers and Alfredo is the son of a wealthy businessman. We watch their lives unfold with vivid cinematography and lush visuals of the exceptionally beautiful countryside. The movie jumps forward, to the end of World War 1, and Olmo returns home after fighting. And essentially the film follows the exploits of the two protagonists as they deal with love, friendship, money, death and the evils of war.<br><br>The film unfolds like a finely crafted book, taking its time to tell its story.<br><br>Unfortunately, the version that I watched was horrendously dubbed. It was so bad my brother couldn't continue watching. I tried to look past this major fault, as I started to love the film's story and visuals, and it does get better, but I'd be extremely disappointed to find out a subtitled version doesn't exist. And to make matters worse, it was also a Pan &amp; Scan version. This doesn't bother me too much if I'm watching, say 'Mrs. Doubtfire', but \"1900\" is definitely a wide-screen movie. Some scenes were practically ruined as characters are framed to the extreme right or left. For example, at the beginning where Olmo lays on the train line, I couldn't see him in the wide shot! I couldn't see what was going on. Terrible! And the version I watched came in at about 4 hours and 35 minutes. So it was a cut version, and this is blindingly obvious. The cuts are dreadful. This has to be some of the worst editing I have ever seen in my whole movie viewing life.<br><br>But for all these problems (easily solvable problems that have nothing to do with the movie itself (unless the dub is the original)) I fell in love with this movie. I didn't really notice the hours passing by; the story and the characters suck you into their world, and don't let go until the final credits roll. And even then they are stuck in your head, along with the more memorable scenes. I couldn't help but be reminded of my own childhood, even when the scenes had no context to my memories. For instance, the simple setting of workers ploughing a field bought back memories of playing in a big dirt mound in our backyard as a child, or beautifully lit scenes at sunset; I could almost feel the warmth. These memories made me feel really good, and whether it was intended or not to remind the audience of their childhoods, the film certainly had this wondrous effect on me.<br><br>I was quite shocked with some of the scenes in this film, especially the rape scene. While there is no sex shown at all (at least in this version), the crying eyes say more than any words or images could. You should be warned this film has some pretty graphic violence and contains a few explicit sex scenes. But the sex scenes are refreshingly realistic, as opposed to Hollywood's fraudulent version of sex.<br><br>The acting is, for the most part, admirably handled. Robert De Niro is convincing as the rich son with a poor peasant as his best friend. This role could have descended into cliché, but De Niro steers it clear of any such event. Towards the end of the film De Niro's performance is terrific. It's remarkable that in the same year that this was made, De Niro played a certain Travis Bickle in the seminal 'Taxi Driver.' 1976 was certainly De Niro's year! Gerard Depardieu is wonderful as Olmo. I have never seen a movie of Depardieu's where he was young, and I must say he was very handsome in his day! His performance elicits emotion without settling for sentimentality. The supporting cast do a good job. Burt Lancaster is both charming and divine, yet in one scene I was quite uncomfortable as to where it was going to lead. But he portrays this without the cliché of a `dirty-old-man' but rather a lonely man who may not remember where the line of decency may now lie. Donald Sutherland is disgusting beyond description. No, not his acting, but the character he plays. I haven't seen too many of Sutherland's films (unfortunately, off the top of my head I can only recall 'Fallen') but I'm keen to see more of his work, as his acting here is top notch. And the hunchback (sorry, can't remember his name) is delightfully endearing. Only some small characters have questionable acting talents, but in a film with so many bit parts this may well be expected.<br><br>The word 'epic' seems to imply greatly to this film. While the scope and size of the film is epic, the film relies heavily on the lives of the main protagonists. In a way this is an intimate epic, if such a thing could exist.<br><br>This is an excellent film that is highly recommended for people interested in Italian history, the landscape of Italy and beautifully crafted films. This particular version is recommended to people interested in gaining evidence that Pan &amp; Scan is the work of Satan and that dubbing should be a sin.<br><br>If you enjoyed the films `Schindler's List' and `La Vita é Bella', then I'm sure you'll get something out of this film.<br><br>You shouldn't be turned off by the long running time of this film, you get so engrossed with the story the time just flies by. This is certainly an under-rated classic, treated poorly by some versions.<br><br>10/10 If in wide-screen, un-cut and subtitled. 9/10 If Pan &amp; Scan, cut and dubbed.<br><br>But as I have to give one overall score, I'd have to say 10/10.","user":"David_Niemann","rank":[108,147]},{"title":"A long and good picture","rating":10,"date":"5 December 2003","review":"One of the most perfect historic contemporary pictures ever made. Wonderful performances of the actors Robert de Niro, Gerard Depardieu, Burt Lancaster and Donald Sutherland. This film tells us a story of two mans (Alfredo and Olmo) born in the same day back in the beginning of the twentieth century - Alfredo is a landowner, Olmo is a peasant- and their relation with friendship, love, politics. ( I think this is a film about how friendship can be true in a cruel half century that was the fist half os the \"novecento\").<br><br>There is a Marxist view about life and about cinema itself in this Bertolucci film: the two main characters, Alfredo and Olmo, symbolize the strike between the two classes of the capitalism - the high bourgeosie that owns the land where live the proletarian. The picture tries to prove that their lives are different in the way that their different social condition can interfere. In the beginning Alfredo and Olmo are very close, because they are only child. Alfredo tries to be like Olmo. He sees in his friend the freedoom that he hasn't. He wants to be a socialist.<br><br>I recommend this picture to all who like good cinema.","user":"miguelvitorino","rank":[74,104]}]