[{"title":"It fired the imagination of a 10 year old boy for a lifetime","rating":10,"date":"3 July 2006","review":"OK, so some people are intent on pointing out factual or historical inaccuracies. Some people ridicule the costumes and accents, but what's important is the spirit of the film. I sincerely doubt anyone made the same kind of comments back in 1960. It was a seminal film and must have inspired a generation of film makers. You don't need CGI to make a good film. It's all about the story and the ingenuity of having to make do with the things you've got to hand. This film exemplifies that attitude.<br><br>I first saw The Time Machine as a 10 year old in 1970 and was utterly captivated. The stop-motion photography was spell-binding to me; particularly when George kills one of the attacking Morlocks. The gory footage of the body decomposing will abide with me forever. More importantly, and for the first time in my life, I was completely swept away with the concept of time travel. This film was unlike anything I had ever seen before and sowed seeds of profound thought for many years after.<br><br>This film may not be for everyone, but it was for a certain 10 year-old boy all those years ago. How I wish I could go back and recapture those moments...","user":"andy-cippico","rank":[102,107]},{"title":"Fourth Time Was A Charm: A Thought-Provoking Film That Looks Better Than Ever On DVD","rating":9,"date":"6 January 2007","review":"Boy, did a nice DVD transfer of this not only mak me appreciate the visuals in here more but made the story seem better, too, for some reason. I only acquired the DVD as a memento, so to speak. I had to have at least one movie which had the woman I had a crush on back in the early '60s: Yvettte Mimieux. She still looks great, too. The main thing, however, is how I now viewed this story and how much more I wound up liking it than in the past. This was my fourth look at this movie over a 45-year span and I enjoyed it the most this last time. <br><br>Since time travel stories always fascinate me, my favorite part of the film is when \"George\" (Rod Taylor) is actually in his time machine and experiments with it, slowing it down here and then and then stopping it a couple of times to observe World War I and then WWII. Then, he stops in 1966 when supposedly there was a nuclear attack. (Apparently, scare-mongers back in '60 thought that was a short-term likelihood.)<br><br>Anyway, when \"George\" (H.G. Wells, the author of this story) finally stops, in the year 200,000-something, the story loses some of its momentum. However, it's a fairly interesting study of a group of ultra-passive people being dominated by others who live underground and then literally eat the good people. Taylor is astounded that mankind has not progressed as he had figured but seemed to have regressed.<br><br>The message I got on this last look is that man is still man, meaning sinful and capable of anything bad as well as good, and to put one's faith totally in man is a mistake. It's only going to lead to disappointments as \"George\" found out on each of his stops. (Notice he never stopped during a peaceful, progressive period.) Yet, \"George\" is still an optimist and wants to be one to help initiate change for the better. There's always hope for a better world and people like George, with his idealism put to action, can make a difference.<br><br>Overall, an entertaining and thought-provoking film.","user":"ccthemovieman-1","rank":[61,64]},{"title":"An early and all-time favorite","rating":10,"date":"9 August 2002","review":"In the early 1960s my mother used to take my younger sister and me to a nearby one-screen theater to see Saturday kiddie matinees. It was a great way to keep us entertained and out of her hair for a few hours, particularly after our baby sister was born.<br><br>One movie I saw during those matinees was the 1960 version of The Time Machine. It made such an impression on me that, for quite a while afterward, I would play Time Machine with my sister and cousin with me as the Time Traveler.<br><br>It wasn't until sometime in the 1990s that I was able to see it again when I got a VHS copy. It was very much the way I remembered it to be. I have since read the book and have found that the movie is quite faithful to the text, though some scenes involving two stops in the 1900s were added and a few bright spots appeared that weren't in the book, which is pretty dark.<br><br>The special effects look primitive by today's standards, but they did win the Academy Award for Special Effects in 1961, and rightfully so, though I have no idea what other films had been nominated.<br><br>This is still one of my top 10 movies and likely always will be. I haven't seen the 2002 version, which is probably just as well, since I'm happy with the 1960 version and don't want to ruin it.","user":"PRSLRider","rank":[107,117]}]