[{"title":"Nitro and Glycerin","rating":10,"date":"15 August 2000","review":"A musical comedy action fantasy should not work, especially when one considers that it is the first SNL skit-to-screen adventure (which, history has shown us, is a decidedly mixed bag).  But this one does.  Two of the best car chases in cinematic history bookend the film, and in between there are show-stopping musical numbers, raw humor, Illinois Nazis, and a seriously disgruntled ex-fiancee.  And it all makes perfect sense in the context of the universe created by Aykroyd (who co-wrote), Landis (who directed), and Belushi (his barely contained zeal provides the battery pack for this film).<br><br>Jake (Belushi) and Elwood (Aykroyd) are the former front men of a broken down blues band (actually a stunning collection of blues talent) which disbanded after Jake was arrested several years before.  Upon his release, he discovers that his boyhood orphanage home is about to be foreclosed upon for non-payment of property taxes.  Beaten up by a nun, sung to by James Brown, and touched by God, Jake sees the light and seeks to put the band together for one last show -- a charity benefit to save the orphanage.<br><br>Their journey takes them from James Brown to Aretha Franklin to Ray Charles, John Lee Hooker to Cab Calloway.  The movie showcases the overwhelming talent of singers, musicians, and genres long out of vogue with popular musical tastes.  Indeed, this movie is a vehicle for giving these performers a chance to shine -- to bring their music back to the masses and ultimately into pop-culture immortality (to go along with their more prestigious musical immortality).<br><br>This film is guaranteed to make you tap your feet, laugh out loud, gasp as both a mall and and entire fleet of Chicago police cars are destroyed, and believe in the magical powers of an old cop car.  Like I said, it's a musical comedy action fantasy.<br><br>And it works.","user":"mcstack","rank":[253,274]},{"title":"They're On A Mission...","rating":9,"date":"14 December 2001","review":"It started out as a bit on Saturday Night Live, and grew into probably THE most successful movie ever to have had it's genesis in that particular medium.  And who would've thought that a couple of character actor/comedians would emerge from an innovative four-or-five minute act as `legendary' bluesmen of their era?  Which is exactly what John Belushi and Dan Aykroyd did after first taking their show on the road as an opening act for the likes of Steve Martin, and then parlaying it into a feature length motion picture, `The Blues Brothers,' directed by John Landis.  When Joliet Jake Blues (Belushi) is released from prison, his brother Elwood (Aykroyd) is there to pick him up, in-- of all things-- a used police car.  And it doesn't bode well for this particular pair of out-of-work musicians, who on a visit to the orphanage in which they grew up discover that it is about to be shut down unless some taxes are paid on it, and soon.  But what can Jake and Elwood do to help?  They're broke.  Well, after a bit of pondering and a couple of good production numbers later, Jake sees the light (literally), and it all becomes perfectly clear:  They have to put their band back together and stage a concert, the proceeds of which should more than pay for the taxes on the orphanage.  It's a tough job, but somebody's got to do it, and don't tell Jake and Elwood it's not possible, because they're on a mission from God...<br><br>\tIt's a fairly simple plot, told in a straightforward manner by Landis, who creates a visually stimulating and aurally satisfying movie that follows the adventures of the Brothers Blues as they travel around the good state of Illinois, seeking out the members of their former band and formulating their plan to save the orphanage.  Along the way they run afoul of a country/western band, incite the ire of some Illinois Nazis, ingratiate themselves to the diners in a classy restaurant, wreck an entire mall and generally wreak havoc wherever they go.  It's a total rush of excitement, backed with a blur of real blues, served up by some of the truly legendary performers of our time, like Aretha Franklin, James Brown, Ray Charles, Cab Calloway (doing his trademark `Minnie the Moocher') and John Lee Hooker. Not to mention the `band' itself, comprised of Steve `The Colonel' Cropper, Donald `Duck' Dunn, Murphy Dunne, Willie Hall, Tom `Bones' Malone, Lou `Blue Lou' Marini, Matt `Guitar' Murphy and `Mr. Fabulous' himself, Alan Rubin, all there to back the incomparable vocal stylings of Joliet Jake and Elwood Blues, who are determined to save their old home, now under the auspices of `The Penguin,' Sister Mary Stigmata (Kathleen Freeman).  But one question remains to be answered:  Who is Camille Ztdetelik (Carrie Fisher), and just what is she trying to do to Jake?<br><br>\tWithout question, this was a great gig for Belushi and Aykroyd, who to millions of people ARE, and will forever be, the `Blues Brothers.'  And forevermore shall they be linked in the memories of anyone who has seen this movie, heard their records or caught their act on SNL.  Dan Aykroyd has gone on to have a successful and varied career in movies, including an Academy Award nomination for Best Supporting Actor (for `Driving Miss Daisy' in 1989), while John Belushi, of course, left us quite suddenly and way too soon, just as his career was on the rise.  Were they great singers?  Of course not; but they were accomplished performers who sagely surrounded themselves with the best of the best, a `band's' band that really made this gig work, because the music worked.  Add to that the energy, excitement and passion they themselves brought to it, and you have their formula for success, which can be measured by the strong following they still enjoy to this day.  And what a pity that Belushi isn't around to realize it.<br><br>\tMemorable in supporting roles are John Candy as Burton Mercer (who uttered the unforgettable line, `Orange whip?  Orange whip?--); Henry Gibson as the steel-eyed head Nazi; Steve Lawrence, as agent Maury Sline; Charles Napier as Tucker McElroy, `Lead singer and driver of the Winnebago'; and Jeff Morris, who will always be remembered as Bob, owner of `Bob's Country Bunker,' the place with `both' kinds of music, Country `and' Western. <br><br>\n\tThe additional supporting cast includes Steven Williams (Trooper Mount), Armand Cerami (Trooper Daniel), Layne Britton (The `Cheese Whiz'), Ralph Foody (Police Dispatcher) and John Landis (Trooper La Fong).  Also, watch for cameos by Paul Reubens (Waiter), Frank Oz (Corrections Officer), Twiggy Lawson (Chic Lady) and Steven Spielberg as the County Clerk.  A thoroughly entertaining and enjoyable movie, filled with memorable scenes and lines you'll be quoting for years to come (Aykroyd, in that `clipped' Elwood Blues delivery, to Tucker McElroy:  `We'll, ah-- we'll talk to Bob--'), `The Blues Brothers' is a great film-- not in the sense of a film that should have walked away with a bagful of Oscars, but great for what it is and for the special place it holds in the history of the cinema.  And, yes, it does have a place all it's own.  Because a movie doesn't have to be `Citizen Kane,' or `Gone With the Wind' to be `great.'  It's the ones that make you feel something for whatever reason, or make you laugh; the ones you remember because they're unique or have left their imprint on our culture in some way.  So, check `All of the above,' or add your own reasons.  For all that it's worth, this is the magic of the movies.  I rate this one 9/10.","user":"jhclues","rank":[155,171]},{"title":"One of my Favourite Movies","rating":10,"date":"16 January 2005","review":"1/ The music in this film is outstanding, with roles for Aretha Franklin, Cab Calloway, John Lee Hooker, Ray Charles and more.... that's not really surprising.<br><br>2/ One of the finest car chases in cinematic history (The Italian Job and Smokey and the Bandit 2 are the only others that come close) <br><br>3/ John Belushi's own brand of comic genius throughout the movie <br><br>4/ Mulitiple memorable scenes and one liners<br><br>5/ Cameos from Steven Spielberg, Twiggy, Frank Oz, etc.<br><br>6/ Carrie Fisher as the psycho love interest intent on revenge.<br><br>Nuff said, watch it and love it 10/10","user":"mjw2305","rank":[196,222]}]