[{"title":"Bizarre. But disarmingly so.","rating":7,"date":"18 December 2000","review":"John Cusack's girlfriend has just dumped him for the biggest jerk in school, and John deals with the depression, anger, and frustration in humorous ways. Slowly, he finds himself bonding with French exchange student Diane Franklin, a beautiful and clever young woman, that helps to build up Cusack's self-image so he can win his girlfriend back.<br><br>Better Off Dead follows a familiar basic storyline. Main likeable character is dealt a bad hand in life, pulls themselves up by their bootstraps, and ends up triumphing over the people who pushed them down. This formula led to such films as \"Animal House\", \"Revenge of the Nerds\", and \"Porky's\". Not that these films are bad, they are just similar in basic plot.<br><br>\nBetter Off Dead however, adds a bizarre surreal quality unaccomplished by these other films. Perhaps this is due to the claymation hamburger sequence, or the unlikely skiing competition at the end of the film.<br><br>Or perhaps it's due to the parade of familiar faces from other 80's films. John Cusack's best friend is none other than Curtis Armstrong, best known as \"Booger\" in the Revenge of the Nerds movies. Next door neighbor and consummate slob Dan Schneider is recognizable as \"Dennis\" from the TV show \"Head of the Class\". Cusack's boss at the fast food joint is played by Chuck Wallace, the title character from \"Porky's\". And with a bit part, yet one the funniest in the whole film, Yano Anaya reprises his \"Grover Dill\" persona from \"A Christmas Story\" in the form of a vengeful paperboy. I WANT MY TWO DOLLARS!!!!<br><br>Also has some of the funniest lines in 80's teen comedy, such as Franklin's accidental misuse of the word \"testicles\", and the comment made by an onlooker when Cusack tumbles into a trash truck. <br><br>Definitely better than the majority of 1980's teen comedies.","user":"pleiades10","rank":[29,36]},{"title":"Classic 80's Movie Must See","rating":10,"date":"4 June 2004","review":"This is a must have in your DVD collection. Some love it, some say OK, some don't laugh at all. I say, you must have the uncanny ability to laugh at things ordinary people wouldn't understand the humor in. I've owned this movie on VHS and now DVD and have a steady belt of laughter each countless time I watch it. This is one of those movies where you are with your friends twenty years later and go, \"I WANT MY TWO DOLLARS\" and the room jocularly erupts and instigates discussion. If you find yourself easily amused, can see the humor in the way life hands you a sour glass of milk to wash down lifes trials in love, then you MUST see this Classic Movie that made me a Cusack fan!","user":"gurks73","rank":[54,72]},{"title":"The ultimate teen angst flick!","rating":10,"date":"23 August 2005","review":"If there was ever a role that John Cusack milked until it mooed, this one would have to have been it. His portrayal of Lane Meyer will forever be remembered in high school lore as the Ultimate Champion of the Underdog. I laughed so hard my sides ached and tears were running down my cheeks. What has long been a cult classic, this film did an excellent job of portraying the awkwardness of those teenage years that all adults thank God every day that we now have behind us. \"Savage\" Steve Holland's directorial debut was simply sensational; he could not have picked a better vehicle in which to make his mark! <br><br>Rounding out the cast includes Amanda Wyss as the fickle girlfriend who is more interested in her popularity than anything else; David Ogden Stiers (Major Winchester from M*A*S*H fame) as the dad who tries too hard to be \"in\", Kim Darby is priceless here as the mother who is completely, absolutely and utterly clueless, Scooter Stevens as Lane's little brother Badger is one ongoing surprise after another, and what is probably going to go down as BY FAR the most coveted film role in the 20th century, Demian Slade plays the paperboy from Hell. His portrayal alone makes the film not only worth watching, but worth buying! To close matters off in the casting department, the chemistry between Cusack and Diane Franklin  who plays the French foreign exchange student Monique Junot, is something that simply cannot be denied. Keep in mind however, that whatever you do  that like The Cable Guy  DO NOT, I REPEAT, DO NOT take your eyes off that paperboy! <br><br>Cusack and Holland do a perfect job of capturing that period of time in the 1980's better than any other film of the period. This film is well worth an evening's entertainment. Rent it once, and then buy it, as you will want to watch it many times over. It took me SEVEN YEARS to find a copy in VHS. The DVD was just bought for $10.00 and change from from Wal-Mart.com. I highly recommend this film to one and all as a MUST-OWN!<br><br>On a scale of 1 to 10, I give this film a 12/10. ***","user":"MrBallroom","rank":[65,92]}]