[{"title":"Halcyon Days","rating":9,"date":"31 January 2005","review":"George Roy Hill is a perhaps neglected name in any 'top ten' list of great directors we are likely to see, but his filmography speaks for itself, with a number of quiet classics among a few heavyweight top 100 films--all within a somewhat small oeuvre. Each of these classics shows to good effect Hill's marvelous aesthetic moods and attention to detail, combined with absolutely expert casting, obtaining winning performances from all of the principles, with superior character acting from the secondaries.<br><br>Peter Sellers is actually something of a secondary in this one as the title role, but his portrayal of Henry Orient is so ludicrous and wonderful that he steals the show every time he's on screen. He was really something. Sellers plays it very large here, as a pretentious, NYC-based, avant-garde pianist of meagre talent--a charlatan, egoist, and ersatz Lothario who cultivates a faux-Euro accent but slides back into his 'native' Brooklyn (Sellers is probably the greatest accent-mimic ever) jargon every time he gets rattled, who has Paderewski hair that he continuously primps, and who entices women who've actually fallen for his schtick by hurling continuous salvos of romance-novel drivel at them until they (hopefully) relent. <br><br>Oddly, although it is made plain and obvious in the dialogue that Henry Orient is more or less a hack, and although Sellers plays his usual skillful physical shenanigans, I found that the pianist on the soundtrack played the piano quite well, despite the ridiculous material. There's a hilarious, gushing theme that is edited into almost every scene that Henry is in. His mannerisms during the piano concerto and the ostentatious buffoonery from scene to scene show Sellers in his element, and he never misses the chance to exploit the full range of available comedic ingredients in any moment to the utmost. Every time I watch him cross his arms to play two notes four octaves apart at the end of the concerto, and he does the little wiggle of the finger as if he's depressing the string on a violin to get vibrato out of it, I let out a belly laugh. I never get tired of that. <br><br>The two protagonists (or rather, Sellers's perceived antagonists) are played with mesmerising enthusiasm by the two adolescent leads. Tippy Walker is particularly radiant in this movie as the talented, attention-starved, sensitive, hyperkinetic Val, who develops a crush on Henry. Her pixie features, infectious retainer-filled smile, and wide-eyed, bubblegummy girlishness shine on, and share honors with Sellers for scene-steal appeal. She plays off the hurt, pouty ingenue angle beautifully too. Her counterpart, Merrie Spaeth, is no slouch either, although she had the disadvantage here of having the 'straight man' role. No matter! They don't compete for space at all (the scene-stealing qualities of Ms Walker notwithstanding),and they get equal attention and equally precocious dialogue, with the simpatico theme being so stressed as to tell us purposely that they are equal partners through and through.<br><br>Ultimately the film leaves me feeling bittersweet, partially through nostalgia--Hill's 1963 NYC is beautiful--but also because the movie has that theme of fleeting innocence in the face of oncoming adolescent desire. George Roy Hill's great movies have a sparkle to them, and this qualifies as one of the quieter greats. In any case, as time buries this one, those halcyon days of youth go with it, but the legacies of Sellers and Hill should mark it for at least cult-status immortality, which by proxy should give the girls their deserved legacy too.","user":"charlie_bucket","rank":[41,43]},{"title":"This was also the Sixties","rating":9,"date":"31 December 1998","review":"The sixties became The Sixties around the time of this film, 1964. There was a time, believe it or not, when kids played grown-up, instead of the other way around, as is the case today. Two cute girls are venturing from childhood to youth, in a benign Manhattan. They have a crush on a pianist-Lothario who happens to be Peter Sellers. You can imagine the complications - and the hilarity.<br><br>What makes this film so appealing is the way it portrays adolescent awakening as a completely unsordid and sweet experience. Yes, there is pathos, when the two discover how adults have turned their world into Henry Orient's world.<br><br>Although the cast is sterling all around, Tom Bosley is a standout as father to one of the girls, who helps put things to rights.<br><br>If the Kennedy assassination and Vietnam are cultural watersheds, then this film is a refreshing antidote; it gives the lie to the glib put-downs of the era by the current generation.","user":"jacksflicks","rank":[81,92]},{"title":"Possibly the best teenage-girlfriend movie ever made","rating":10,"date":"4 February 2005","review":"I saw this movie at age 8, and it immediately became my favorite movie -- not just because of the natural acting, engaging cinematography, enchanting view of NYC, wonderful characterizations, all of which I didn't know I appreciated until later. Mainly -- AND THIS IS IMPORTANT IF YOU HAVE A DAUGHTER -- I loved it because it got across the magical, honest bond of best-friendship between girls.<br><br>How often does a girl find a movie that so genuinely AND unsentimentally presents girls as self-reliant and strong (with giddiness that makes them likable, not weak), or that presents the girlfriend bond as something so perfect and fun and full of adventure? In the 1960s, this was the only movie I saw that made me feel privileged to be female. Disney movies in the '60s tried to give girlhood equal time, but they still came from a boy's viewpoint -- as if to say, \"Girls can have fun just like boys do.\" This movie doesn't do that -- it's far more sophisticated culturally and more hip to the truth about parents than any Disney movie ever was, and it's very grounded in how girls really are. George Roy Hill clearly understood what a real buddy movie is made of, regardless of age or gender (remember \"The Sting\"?).<br><br>I showed this film to my daughter when she was 12, and she loved it too. She's 18 now, and yesterday she went out and got the DVD -- because she says she saw it at a friend's house last week and realized that she still loves it. She's watching it as I write this.<br><br>A few notes about Merrie Spaeth: First, she became a well-known media consultant and political speechwriter, which is why the film \"Wag the Dog\" used her name for one of the actresses considered to play the peasant girl in the fake Albanian bombing newsreel. Also, the Spaeth family is a long-standing name among Philadelphia-area Quakers (although I have no idea if Merrie is from this area or is a Quaker)...but I once met a doctor in the area with the same name so I asked if he was related. He was, and he told me that -- in addition to the amazing notes you can read in her IMDb bio -- Merrie used to write for Superman comics. I think that is WAY cooler than writing speeches for Ronald Reagan; she should put Superman and Henry Orient at the top of her resume.","user":"lisalapp","rank":[48,53]}]