[{"title":"Incredibly fierce action film by John Woo","rating":8,"date":"12 July 2002","review":"Heroes Shed no Tears was filmed in 1984/1985 but was released only when the huge success of his next film, A Better Tomorrow, was born. Heroes Shed no Tears is not as philosophical and personal as Bullet in the Head (Woo's most personal film to date, set in Vietnam war), but it is no less fierce. A group of mercenaries is sent to get one drug smuggler, kidnap him and deliver to court. They kidnap him, but get an angry league of the drug boss' men after them in the jungle and so the savage chase and fight for life has begun.<br><br>The usual elements of Woo are not as primary as in his more recent films, like A Better Tomorrow 1-2, The Killer and Bullet in the Head, but there are similar scenes and segments in this early film, too. Men get killed \"with honor\" and there are couple of \"heroic bloodshed\" scenes, too, like the human bomb, for instance. One important element not found too often in Woo's films is that there are many female characters in this film and they are depicted very warmly and lovingly, so Woo definitely can direct females, too, if he wants. The brief love making scene between male and female at one point is very emotional and erotic as the female is so full of love and emotion, and that really tells something about Woo's ability to direct his characters and give them charisma.<br><br>This film is pretty close to Japanese Babycart samurai films Lone Wolf &amp; Cub from the 1970's. The main character in Heroes Shed no Tears has a son and their relationship is very similar to Ogami Itto's and his son Daigoro's, in Lone Wolf &amp; Cub. I don't think this is any rip off of these Japanese films, but it is obvious that Woo had seen these Japanese films and found inspiration from them. After all, Lone Wolf &amp; Cub films are pretty close to Woo's films in their content and philosophy.<br><br>The adrenaline amount in Heroes Shed no Tears is incredible as it is hard to think a film more fierce and angry than this. The action scenes are totally unbelievable and Ultra violent, and I was totally stunned at the fight scene near the water/lake/river at the first part of the film. The mayhem is so over-the-top and something never found in Western film. Fast paced action never lets up during the 80 minutes running time of the film. The camera use in these action scenes and other scenes as well is very professional and it is easy to see what kind of talent was hiding in Woo. This is very violent film and definitely wouldn't get the R rating in US. There are hyper bloody gun battles, head shots, stabbings, impalings, choppings and other acts of violence that truly are savage, but still pretty stylish and symbolic, as always in Woo's films. It tells something about his films' characters' values and moral, even though violence this brutal is not without its consequences in his subsequent films. Woo depicts violence, but that doesn't mean he glorifies it. Violence is always bad in Woo's films and that is left for viewer to interpret and there are no easy solutions in his films. So this kind of cinema would never come from some big studio in Hollywood, I think. This kind of cinema is too challenging for mainstream audience. Still, as I mentioned earlier, this is not as symbolic, deep and polished as Woo's subsequent films and also violence is not as symbolic as in his other films, but this was only the beginning and the director was still inventing his cinematic philosophy.<br><br>Heroes Shed no Tears is very great piece of Hong Kong mayhem cinema, and early work of John Woo. I was very surprised when I watched this since I didn't have any expectations even though I of course knew this was Woo's film. The film is little stupid at times (there are some scenes of usual \"humor\" often found in Hong Kong films), so I give this 8/10 rating, which I feel is the right for this film, but this is definitely not for the casual and mainstream viewer due to its extreme imagery and attitudes! It would get more stars from me if the film had more content and something more to think about, but still I love this early effort of this great director.","user":"Bogey Man","rank":[8,9]},{"title":"Before Eastern Condors There Was Heroes Shed No Tears","rating":28,"date":"28 November 2000","review":"Ying Xiong Wei Lei/Heroes Shed No Tears(1986) was a pivotal feature in the early 80s for the director, John Woo.  This was the first John Woo movie that included heavy use of gunplay.  Although filmed in 1984/85, Heroes Shed No Tears(1986) did not get released until after the box office success of A Better Tomorrow(1986).  Before this, Woo was mainly known for his comedies and Kung Fu flicks.  Heroes Shed No Tears(1986) combines explosive action with some good martial arts.<br><br>\nEven if the film isn't as great or polish as John Woo's best, its still better then most of the ones that he has done in Hollywood.  There are a few terrific set pieces within the movie.  One, the opening gun battle with some drug runners.  Two, the fight between the mercenaries and the Thai natives. Three, the martial arts fight between Eddy Ko and Ching Ying Lam.<br><br>\nIt was one of the few war films besides Eastern Condors(1987) and Bullet in the Head(1990) to come out of Hong Kong.  Ying Xiong Wei Lei(1986) is a precursor to John Woo's Bullet in the Head(1990).  The plot of the film is very similar to Eastern Condors(1987) in that both films deal with mercenaries who are sent to Southeast Asia on a secret mission.  Heroes Shed No Tears is the most grim and nihilistic of all John Woo movies(that includes Bullet in the Head).  Its in the tradition of films like Aguirre:The Wrath of God(1974), The Deer Hunter(1978), and Apocalypse Now(1979).<br><br>\nHeroes Shed No Tears(1986) is a modern day retelling of the Lone Wolf &amp; Cub comics.  The relationship between Eddy Ko's soldier and his son has the same fatalistic bond that was present with Ogami Itto and his son, Daigoro.  Its the closest thing that John Woo has ever come to doing a Lone Wolf &amp; Cub feature.  There is a scene that's right out of Lone Wolf &amp; Cub(involves a child who covers himself in a mudhole in order to avoid being burned alive in a fire).  The big influence for the one sequence is a similar sequence from Lone Wolf &amp; Cub:Baby Cart in Peril(1973).<br><br>\nChing Ying Lam is very convincing as the cruel and sadistic Vietnamese officer.  The torture scene involving Eddy Ko is the most brutal one ever done by Woo.  Heroes Shed No Tears(1986) has many traits that would become part of the Heroic Bloodshed genre in Hong Kong.  Has its share of fogish atmosphere and stylish cinematography.  The fight near the end of the movie would be done again in the terrible Mission:Impossible 2(2000)(there was also a exact scene in Strike of Death{1975}).","user":"eibon09","rank":[4,4]},{"title":"A Rhyming Review","rating":31,"date":"31 May 2004","review":"There was a film that I saw <br><br>Just the other day <br><br>And I sat there in awe <br><br>As it blew me away. <br><br>It was made by John Woo <br><br>Who is now a sell out <br><br>His fans he does screw <br><br>As the cash they shell out. <br><br>So get a six-pack <br><br>Full of cold, frosty beers <br><br>And then sit back <br><br>For Heroes Shed No Tears <br><br>Watch with devotion <br><br>This huge action feast <br><br>With enough blood to fill an ocean <br><br>To say the frickin' least <br><br>Our heroes in this tale <br><br>Are a group of Mercs <br><br>Who blast folks all to hell <br><br>'Specially drug lord jerks <br><br>There's fighting, there's stabbing <br><br>There's nuking, there's looting <br><br>There's biting, there's grabbing <br><br>There's puking, there's shooting <br><br>Punches are thrown <br><br>Black soldiers are eaten <br><br>Eyeballs are sewn <br><br>Children are beaten <br><br>A fight goes on <br><br>With nails and a tire <br><br>Our hero loses his son <br><br>Almost in a fire <br><br>There's tons of dying <br><br>But where the film falters <br><br>Is all the damn crying <br><br>Like it was Barbara Walters <br><br>When our hero does cry <br><br>It gets really lame <br><br>For the movie does lie <br><br>With its very own name <br><br>But please do not fret <br><br>It does little harm <br><br>And I'll make you a bet <br><br>About the scene with the arm <br><br>If you do not jump <br><br>When the dude gets the spears <br><br>Shoved straight up his rump <br><br>You've drunk too much beers <br><br>And if you don't find it nice <br><br>When the hut does explode <br><br>After the role of a dice <br><br>Then you're a humorless toad <br><br>So get off your fat ass <br><br>And get the hell out of here <br><br>Cuz you'll have a damn blast <br><br>With Heroes Shed No Tears","user":"Samoan Bob","rank":[28,44]}]