[{"title":"The First Real \"Disaster\" Film...","rating":8,"date":"2 December 2005","review":"Another of my guilty pleasures is AIRPORT, the 1970 all-star cast drama based on the best selling novel by Arthur Hailey. This soapy potboiler follows multiple stories throughout a busy metropolitan airport. Subplots that appeared in the book naturally had to be watered down or removed entirely, but that was to be expected in telling a story of such size back in the late 60's. However, after 35 years, I still find this film a lot of fun to watch (even though it really should be experienced in a theater). Burt Lancaster is all stone-faced authority as Mel Bakersfield, the airport manager who neglects his wife (Dana Wynter) while lusting after his passenger relations agent (Jean Seberg). Dean Martin almost gives an actual performance as Vernon Demarest, the smooth-talking pilot who also neglects his wife (Barbara Hale) while having an affair with a stewardess (lovely Jacqueline Bisset)whom he has impregnated. George Kennedy began his long association with the character of Joe Patroni here(he would play the role in three subsequent sequels). Van Heflin is extremely effective as D.O. Guerrero, the sad and twisted man who plans to blow up an airliner. Helen Hayes won an Oscar playing Ada Quonsett, a little old lady who stows away on the plane, but that Oscar should have gone to Maureen Stapleton, who is just devastating as Guerrero's wife, who is totally dismayed about her husband's plan and is tragically heartbreaking during one brief scene near the end of the film. For those who like their adventure films spiced with some somewhat corny, soap suds, put your brain in check and have your fill with AIRPORT.","user":"Isaac5855","rank":[61,70]},{"title":"Hollywood's first big-budget disaster film...and still the best","rating":27,"date":"27 February 1999","review":"Universal assembled an all-star cast for this film version of Arthur Hailey's best-selling novel \"Airport\", and the result was a critical and box-office smash that earned 10 Oscar nominations.  The film is at its basics pure soap-opera built around the impending bomb on a 707 bound for Rome.  The workings of a major international airport are well depicted and the cast provides some great performances.  Burt Lancaster, Jacqueline Bisset, Jean Seberg, Maureen Stapleton, Dean Martin, and Van Heflin all turn in some of the best performances of their careers, and Helen Hayes (who won an Oscar for supporting actress) is endearing as the stowaway, who has worked out quite a system for flying for free.  \"Airport\"'s success signaled the beginning of the disaster movie era that was followed over the next several years by such films as \"The Poseidon Adventure\", \"The Towering Inferno\", \"Earthquake\", \"Two Minute Warning\", and \"Rollercoaster\". \"Airport\" also inspired three sequels, although none of them even approached the original.","user":"SJBear","rank":[13,13]},{"title":"Disaster in More Ways Than One","rating":16,"date":"16 December 2004","review":"I thoroughly enjoyed Airport, hands down the best of the four flicks in the serial(does Concorde count? It was MFTV). There was so much tension going on both with the airline, the airport and the lives of some of the passengers and crew members. This was a good old fashioned 60's flick, but not too cheesy. Helen Hayes is excellent as the little old lady who with all the grace and charm, has made a career out of stowing away. I love how she fights with Jacqueline Bisset's character in order to distract the mad bomber on board(Van Heflin). The tension when Joe Patroni(George Kennedy) guns the plane's engines and gets that plane out of the snow was gut wrenching. Burt Lancaster as the married and harried airport manager who has some what of an affinity for his assistant. Dean Martin gave such a surprising dramatic performance as the captain who was carrying on a love affair with Bisset's stewardess who later tells him she's pregnant. Even Gary Collins wasn't THAT bad. The film's climactic ending leaves you nothing short of disturbed and breathless. Maureen Stapleton, upon learning the plane has landed after being blown up by her husband, walks up to the injured passengers bawling her eyes out and apologizing for her husband's actions. Of course my favorite is the scene where Bisset's character Gwen(who was wounded in the blast) is being escorted by the doctor who tells the EMT's on the ground that Gwen is pregnant. Martin is also escorting her, completely bypassing his wife, who is ready to give him a hug and then soon puts two and two together. What a way to find out! That dejected look on Hale's face, who is once again playing her, oh so kind and understanding character, you can't help but hate Martin for this last scene. Hale almost never played the \"bad girl.\" She's a favorite of mine. Airport will keep you on edge. Haley managed to intertwine the suspension and soap opera dramatics that made the prime time soap opera \"Hotel\" so popular. He definitely walks a fine line and doesn't go over either one.","user":"tvnutt","rank":[30,33]}]