[{"title":"I was in it!","rating":8,"date":"4 September 2014","review":"This was filmed in Bakersfield. I was a cowboy extra in the bar scenes. We drank Lone Star beer until they ran out and would only let us pretend to drink when film was in the camera LOL. A good friend was the stand in for Kim Basinger. Made $70/day and had a ball. Because of this I have a Kevin Bacon number of 2! How many can say that? When not in the scene we all played poker in a tent and got pretty wasted on that Lone Star. They fed us if we worked over 6 hours I think. Good sack lunches. One take was at night and was a blast. They used the Basque Club on South Union to film in. They had it all decorated like a Texas honky tonk bar which was the setting of the movie. One scene was shot in a small restaurant in town. I went to see it but discovered I was on the cutting room floor.","user":"andy1939","rank":[12,15]},{"title":"A worthwhile drama! Enjoy Jan's macho pathos in this...","rating":10,"date":"14 June 2008","review":"In the current days of CGI, it is rare to see movies like this nowadays!! This is a gritty, blue collar love-story with a lot of heart. I really enjoyed the atmosphere of this story - the country bars, the little apartment, the mobile-home lot, the fence factory. It's gritty and real- the dust, the wind, the empty Texas roads. Kim Basinger is truly delightful as Jodie. She's all charm, with her Georgia drawl in full swing. I am a huge Jan Michael Vincent fan, and this is one of his best roles! It's nice to see him in a more adult role. The heavy drinker side of his character comes naturally - obviously! But Jan always had a great underlying angst in all his characters. He always has a detached, macho pathos which he conveys with those eyes - just makes him fascinating to watch. He has great chemistry with Kim Basinger in this. He struggles with his job, his sleazy brother, his drinking, and Jodie's willfulness. It's a great role for him! This is a MUST SEE for any Jan or Kim fans out there!","user":"robespierre9","rank":[8,10]},{"title":"Texas life","rating":6,"date":"5 July 2015","review":"Kim Basinger made her feature film debut as a woman in a small town in a small town in Texas questioning her relationship with her redneck boyfriend. \"Hard Country\" strikes me as an attempt to look at the feminist movement. The movie DOES feature a lot of Texas stereotypes, although they're probably accurate. In the end, I thought that it did a good job showing the main character's desperation with her irresponsible boyfriend and lack of opportunities in this small town. And the soundtrack proves what should be well known by now: a lot of good music comes from the Lone Star State (it almost makes you forget that Texas is full of, well, Texans). And it should go without saying that Basinger looks mighty fine throughout the movie (as she always does).<br><br>Also starring are Jan-Michael Vincent, Michael Parks, Tanya Tucker, Daryl Hannah and Ted Neeley (Jesus in \"Jesus Christ Superstar\" and more recently a tracker in \"Django Unchained\").","user":"lee_eisenberg","rank":[4,5]}]