[{"title":"once is not nearly enough","rating":23,"date":"23 February 2001","review":"I caught this extraordinary think-piece in a rep house (remember them?) in the late '80s -- and was struck by how such a tremendous film could be so little-known. In following the complex activities of a bunch of seemingly-unrelated Parisians, Soviet-Georgian-born director Otar Iosseliani does indeed suggest a world wider than any one city could contain. It's like watching a beehive, with a cast of crazies and/or criminals buzzing around manically, mostly missing one another but occasionally intersecting. In this, Favorites of the Moon somewhat recalls Nashville, Short Cuts, and Magnolia -- yet Iosseliani is less interested in \"explaining\" and tying-up loose ends than either Altman or Anderson. He just presents these people and their peculiar doings (some of which are very, very funny), then lets viewers figure it all out for themselves. Fascinating!<br><br>In fact, the only complaint I have about Favorites of the Moon is how difficult it is to find!","user":"magicshoe","rank":[19,21]},{"title":"Moonlighter's Luck","rating":10,"date":"16 October 2009","review":"Otar Iosseliani's films are like huge patchworks sewed out of minute urban scenes. The title of this movie is based on Falstaff's remark from the play King Henry IV by William Shakespeare: \"Let not us that are squires of the night's body be called thieves of the day's beauty: let us be Diana's foresters, gentlemen of the shade, minions of the Moon.\" Favourites of the Moon is a quilt of underworld activities and associations of the criminal world with the world ordinary. This splendid comedy is permeated with delicate irony and it shows so many curious aspects of city life. Otar Iosseliani is one in the top dozen of my most favourite directors.","user":"JustApt","rank":[7,8]},{"title":"Lucid.French.Sexy.","rating":10,"date":"4 May 2001","review":"Very French very lucid and sexy.<br><br>One of my favorite films. Could be watched over and over again. I find something new every time I watch it. Brilliant, simply brilliant!!!!!!!!!!!","user":"dkzzzz","rank":[10,18]}]