[{"title":"I haven't thought of this movie in years","rating":8,"date":"17 October 2007","review":"I saw \"The Giant Claw\" several times on the Saturday afternoon creature feature in the late 60s and 70s. I LOVED IT!<br><br>This was before I started actually reading science fiction, and my friends and me really liked the science fiction movies that were being shown on the TV when you had about five channels. This movie ranks up there with \"The Deadly Mantis\" (giant praying mantis), \"Them\" (the giant ants), and \"Tarantula\" (the giant tarantula, of course). Being a kid growing up during the height of the space race, science fiction was always an \"almost anything goes\" genre to occupy a lazy afternoon. This movie is easily competitive with the Japanese monster movies, and I think that the creation of movies like this peaked out at \"The Green Slime\" (1968).<br><br>All you have to do is turn off your brain and throw out your \"willing suspension of disbelief.\" It's just a plain old fun movie, good for everyone to watch on a rainy day. And if it would ever be shown again, I can watch it with popcorn AND a beer.","user":"dmorgan-31","rank":[38,40]},{"title":"You need to enjoy bad movies to like this movie","rating":10,"date":"3 October 2006","review":"This movie is very poor in the standard sense. The plot is warped, the monster is goofy, the science is wrong and the actors are terribly, terribly melodramatic. However, these same things are also what make make the movie good to a bad movie connoisseur like myself. The monster is priceless - it is what makes this particular bad movie stand out over most others. BadMovies.org calls it \"A Giant Antimatter Space Buzzard (hehe)\" and Andrew is right on target. The serious treatment of the actors towards the ridiculous creature (which they didn't see until the movie was released) combined with the utmost in 1950's pseudo-scientific jargon make this move a classic! This movie is my personal favorite of all b movies. Truly a must-see for the discriminating bad movie goer.","user":"shadeclan","rank":[28,30]},{"title":"From the studio that made Lawrence of Arabia.","rating":9,"date":"17 January 2002","review":"Columbia, which made huge hits like Lawrence of Arabia and Jason and the Argonauts, were responsible for this. <br><br>A giant vulture like bird from outer space is responsible for aeroplanes disappearing and to make things worse, it has an anti-matter shield around it which makes it invisible on radar. After destroying some well known landmarks in Washington and New York and also picking a (model) train up in its beak, a way is devised to kill it and is successfully killed at the end when it is shot from an aeroplane.<br><br>The Giant Claw is one of the best so-bad-it's-good movies of the 1950's. When I first saw the giant wooden puppet bird, I couldn't stop laughing, even though it isn't supposed to be a comedy. <br><br>The cast includes 50s sci-fi regulars Jeff Morrow (This Island Earth, Kronos), Morris Ankrum (Invaders From Mars, Earth vs. the Flying Saucers)and Mara Corday (Tarantula, The Black Scorpian). <br><br>I enjoyed this movie very much and I don't see how anybody cannot enjoy it. Great fun.<br><br>Rating: 5 out of 5 stars.","user":"chris_gaskin123","rank":[50,56]}]