[{"title":"Above-average 'true-life' exploitation","rating":6,"date":"2 November 2012","review":"Well, this one's certainly disappeared almost without trace (my local rental outlet appears to be preparing to box or dump its huge collection of VHS, this one presumably among them, and I'd say it's not bloody likely to ever see the light of day again on a DVD release), and although it's nothing like a masterpiece, 'Hostage' is an intriguing and gripping example of the 'woman-in-peril' genre, this time based on an allegedly true story of the young Australian Christine Maresch and her immigrant husband Walter. When we first meet her, she's hitching down the highway, apparently having fled a violent home life. Ending up a carnival worker, she meets a German man who would probably make a great husband - if only Christine actually wanted to have a family...but Walter knows just what to do to trap his object of desire! Even if it's all true as told, it's still exploitation (the abundance of bare-breasted moments from lovely lead Kerry Mack, a real Michelle Williams look-alike, give the game away), and Leonard Maltin's complaint of it being 'disjointed' and 'repetitive'? Guilty as charged - but it's also stylish enough to be eye-catching, yet straightforward enough to be powerful. Frank Shields, the director and co-writer, knows what will hit an audience on a gut level and seize their attention: domestic abuse and terror, children caught in the middle, Nazis (!) and more - but he lets the film go almost totally off-the-rails during an inexplicable scene in the middle section, one which not only trades in offensive depictions of vicious and depraved Turks, but sends a geyser of blood from a villain's slashed throat raining down on our put-upon heroine and her daughter (as if everything else she had to deal with wasn't enough!) It's so excessive and unnecessary I didn't really know whether I wanted to laugh, cry or throw up...but the biggest problem is a vague feeling of emptiness that creeps in as the film's action just stops, and we are filled in as to the fate of this tragic family (accompanied by photos of the real Christine and daughter). It's an appropriately chilling curtain call (especially with that 80s score; I'm a sucker for a sequencer, sue me!) but has the film, messy and slightly sleazy yet ambitious and brave/foolish, really earned the respect of its audience that the true-life association seems to demand? I'm not entirely sure, and I'm probably not going to watch it again in an attempt to find out - but I give it the mark of an effective and above-average film of its type. See it before all copies are locked away and left to rot!","user":"atmvawser","rank":[8,10]},{"title":"Lackluster Direction Hampers Film","rating":22,"date":"22 April 2018","review":"Hostage (1983) <br><br>** (out of 4)<br><br>This movie is based on the true events of Christine Maresch (Kerry Mack) who ended up marrying a man named Walter (Ralph Schicha) and turn her life into a living hell. Before you know it they have a child but Walter turns out to be a Nazi sympathizer and before long he is abusing Christine and taking her on a crime spree that she didn't want.<br><br>Before watching this film I had no idea about the true story behind it. Apparently it was very big new in Australia and it managed to produce a best-selling book as well as this movie, which goes under several titles including SAVAGE ATTRACTION. I must admit that the movie really let me down for a number of reasons but the biggest is the fact that you really never learned too much about either of the characters.<br><br>I'm going to guess that the filmmakers felt most people would be familiar with the tale so they'd just show off the highlights of the couple's life together as well as the various violent ones. The entire film pretty much as Christine playing a victim to Walter who will either beat her, force her into robberies or threaten harm to their child. There's no question that this here is rather ugly story but I didn't think either character was fully developed and as the movie went on I had more questions than anything else.<br><br>I thought both Mack and Schicha were good in their roles. Again, I thought the characters were as simple as a victim and a bully but both actors did a fine job. The screenplay felt like something you'd see on American television but I think the lackluster direction is what really killed the film. I say this because there's never any tension to anything you're watching and the deadly slow pace just really drags the film out and makes it feel much longer than it actually is.","user":"Michael_Elliott","rank":[3,3]},{"title":"Real life Hell trip","rating":8,"date":"8 June 2017","review":"Sadly, or tragically this was a real life tale, that paints a horrifying picture of what a young girl, endured when meeting a seemingly polite and handsome carnival worker, Walter Maresch (Ralph Schicha). He turns out to be an all Hitler brainwashed psychopath, and at the end while being a disturbed witness, and feeling so much sympathy for the poor suffering real life victim, played very well by hottie Kerry Mack, the actress much better looking than the real Christine (they always are) in it's 92 minute duration. Like her, we really feel like we've been put through the ringer. Hostage is a very tightly written real life tale. From it's opening, where Christine is being belted supposedly by her stepfather, she takes to the road, and that's where, the opening of her soon to endure begins. I found Schicha, a little stiff in his performance, but he is quite threatening and has his moments. We see where the forced marriage led to, then her pregnancy, then the entrapment over in Germany. The movie doesn't hold back on shock, including some pretty bloody moments, and you can call it's exploitation, but this is marvelously entertaining and important film, where the story really honed in on what this poor lass endured, a lot of physical beating, while also, near the end, getting speared in the back. It's a tightly told tale, and that's what I loved about this. The movie uses all the important parts of this real life horror, and we get through a lot in those 92 minutes. It's a very cut to the chase movie, but of course the real horror, is it's a factual told hell. Obviously an underrated movie too. Judy Nunn aka: Home and Away's Isla, is fantastic, a real hoot Christine's Mum, where you savor her scenes. Unmissable, the real hostage, will be you, the viewer when you watch this.","user":"videorama-759-859391","rank":[6,9]}]