[{"title":"The most romantic of John Wayne's many films, and one of my favorites.","rating":9,"date":"31 August 2001","review":"A man on horseback races across the arid landscape. His horse faulters and throws the man.  This is how The Angel and The Badman begins.<br><br>Wayne is Quirt Evans, a man with a past.  He is rescued by beautiful Gail Russell, a Quaker girl with a strong, silent father and a marvelous, generous mother who makes donuts and cakes that melt in your mouth, but according to her are, \"not very good, the flour you know...\".<br><br>Poor Quirt never has a chance.  He is healed body and soul by this devoted family.  But not before he must taste his old way of life one more time, which leads to a dramatic conclusion.<br><br>John Wayne never looked better on film then in The Angel and The Badman. In one scene, he wakes from a coma, hears a noise, gropes for his gun, which is under the pillow and rises, gun in hand to face a startled and stunning Russell.  The sight of John Wayne, shirtless, his hair un-combed and his gorgeous, almost purple eyes taking in the lovely lady in front of him, is something no woman from 6 to 106 should miss.  If you are a fan already and have seen this delightful film, you know what I mean.  If you are new to John Wayne, check to one out and fall in love.<br><br>Harry Carey plays the Marshal of the territory who keeps track of Quirt, not completely convinced of his conversion, until the surprising climax. Carey's quiet authority is wonderful to watch, and his sly humor a tonic.<br><br>The Dr. here over-plays his role, but he can be forgiven.  The neighbor who has denied water to the Quaker settlement but is convinced by Quirt(without the force of his famous gun), to \"be a good neighbor\" and remove the top two boards holding back the water that used to flow into flums and irrigation ditches, is a real old west character.  Films today just don't use actors with faces like his any longer.  Too bad.<br><br>Yes indeed, The Angel and The Badman is a wonderful, old fashioned  film. The kind they don't make any longer, but should.","user":"countryway_48864","rank":[63,66]},{"title":"Quaker Family Values","rating":10,"date":"16 May 2006","review":"The Angel and the Badman is a milestone film in the career of John Wayne. It was the first film in which he had a substantial role behind the camera. My guess is that he must have lobbied Herbert J. Yates at Republic films for some creative control and Yates gave in to his studio's biggest moneymaker. <br><br>Though Wayne at times didn't have the best judgment in regard to his own personal projects, The Angel and the Badman is a winner in every way and doesn't get near enough credit for the work it is except from Wayne partisans. <br><br>Wayne plays young gun hand Quirt Evans, a most feared man in the territory, who wounded falls in the hands of a Quaker family who nurses him back to health. Wayne starts eying pretty daughter Gail Russell.<br><br>Pretty soon under her influence Wayne starts questioning the direction his life's been going in. Of course the Quakers do cheat a little on this question themselves. Though they don't believe in violence, the Duke's reputation as a gun hand comes in mighty handy in settling at least one neighborly dispute with Paul Hurst.<br><br>My favorite scene in the film and one of Wayne's best in all his films also involves his reputation. When Bruce Cabot and two henchmen find him at the Quaker home, Wayne runs one terrific bluff holding them off with an empty gun. This was the first time Wayne and Cabot worked together. In the sixties Cabot became a regular in Wayne films.<br><br>Angel and the Badman also has two other Wayne attempted reclamation projects. Gail Russell was one of the most beautiful women ever on the silver screen. She had a lot of tragedy in her life and died young. Wayne at one point gave her the lead in a film Seven Men from Now that he was producing, but not starring in, with Randolph Scott. She gave a good performance, but a lot of substance abuse had taken its toll.<br><br>Paul Hurst later on got a pay day from Wayne in Big Jim McLain in a scene he portrayed from a wheelchair. He was terminally ill with cancer and in fact took his own life shortly afterwards. The money was no doubt needed for Hurst's medical expenses. <br><br>Later on in McLintock Wayne said in one scene he doesn't give jobs, he hires men (and women). This was his idea of charity and something that never gets talked about enough by people, even some of Wayne's most devoted fans.<br><br>As this was his first film as producer, I have no doubt that the Duke wanted Harry Carey, the man he patterned his cowboy image after in this film. One of Carey's best screen performances as the \"patient\" federal marshal who's waiting for Cabot and Wayne to shoot it out so he can hang the winner. <br><br>Wayne's good friend James Edward Grant wrote and directed the film. Later on Frank Capra disparaged Grant as a bad influence on Wayne when they quarreled during the filming of Circus World. Grant did write some of the more conservative on Wayne's films. But I certainly can't fault anything he did in The Angel and the Badman.<br><br>In fact it's a winner in just about every respect. Even some Wayne haters might like this one.","user":"bkoganbing","rank":[44,46]},{"title":"Remarkably Underrated!!!","rating":8,"date":"8 November 1999","review":"ANGEL AND THE BADMAN is a film that many John wayne fans may not have seen; nonetheless it's one of his best that shows a very different side.<br><br>Wayne as Quirt Evans is wounded and taken in by a gentle Quaker family. After he recuperates he notices their daughter--the absolutely drop dead gorgeous Gail Russell.<br><br>The plot of AATBM is remarkably similar to Harrison Ford's WITNESS (probably a remake).<br><br>But what ultimately makes this movie  work is Wayne's performance, and Russell's natural \"Angelic\" qualities. The camera really loves her. There's one scene where she confesses' her love for Wayne, and is surprised he doesn't feel quite the same: \"I never thought it could happen to one and not another.\" Her outright innocence in this scene is incredibly touching, and endearing, and you see how this affects Wayne in the same way.","user":"mariposa-9","rank":[48,52]}]