[{"title":"Crafty, serpentine thriller","rating":10,"date":"13 May 1999","review":"Crafty little thriller about a wealthy, bored young couple (James Caan and Katharine Ross) who resort to playing kinky games for kicks.  The games turn deadly though when mysterious stranger Simone Signoret insinuates herself into their lives.  After a rather slow start,  Games soon segues into an exciting, serpentine mystery that seems way ahead of its time for 1967. Although modern audiences have become too adept at sniffing out clues and predicting twist-endings,  this film is still very effective at keeping its audience guessing.  Rarely shown on tv,  but if you do have the opportunity to see it...do!","user":"devalier","rank":[26,31]},{"title":"Playing games on each other in the manner of \"Sleuth\"","rating":11,"date":"11 March 2003","review":"This film reminds me of \"Sleuth\", the movie based on a play by Anthony Shaffer released in 1972. Like in \"Sleuth\", people play games on each other and do not reveal their alliances, their true intentions or their true self. The story is acted like in a theatre play. The sets, representing a New York town house in a prosperous neighbourhood, are nicely done and give a vivid impression of the middle sixties' trends in fashion design and interior decorating - again you can compare it with the lavish set and the different costumes used by the protagonists in \"Sleuth\". For once, James Caan plays a slick urbanite, and he does it quite well. Don Stroud has a small part, a good actor whose screen presence and performance are always memorable. And then there is Simone Signoret ...  as always she is absolutely riveting, and she puts a lot of charm in her rather pityful character. She uses her French accent very much to her advantage! \"Games\" is an elegant, suspenseful thriller for people who like to see a play now and then. Only right at the end you will know who has won!","user":"manuel-pestalozzi","rank":[19,22]},{"title":"See It - You'll Like It!","rating":18,"date":"18 September 1998","review":"A clever, well-acted thriller with enough plot twists to leave you reeling, and an ending you will not believe.  From a dull beginning to an exhaustingly clever ending, it will hold you spellbound, confused, engrossed and tense.  Should be re-released, but not re-made.","user":"Joe-128","rank":[18,22]}]