[{"title":"\"Distinct Tendencies Towards Terpsichorean Excellence\"","rating":14,"date":"14 March 1999","review":"Guy Holden, the celebrated stage dance star, is touring Europe on vacation.  Mimi Glossop is a rich American living in London and is currently in the throes of a divorce.  They meet, they dance, they fall in love.<br><br>Ginger Rogers was by far the bigger cinema star when RKO Radio teamed her with Fred.  She had appeared in 34 films to his 3, and two in the previous year had been smash hits - \"Golddiggers\" and \"42nd Street\".  This loose borrowing from Cole Porter's Broadway show contains only one of the master's songs, the immortal \"Night And Day\", and only four other songs in the entire movie - Conrad &amp; Magidson's \"Needle In A Haystack\" and \"The Continental\", and Gordon &amp; Revel's \"Don't Let It Bother You\" and \"Let's K-nock K-nees\" (featuring an 18-year-old Betty Grable, who had herself featured in no less than eight films in the previous year).<br><br>At the depth of the Depression, this sort of film was all the rage - a fantasy of carefree opulence and ease, set in a world of Parisian floorshows, ocean liners and tuxedos.  The wit is sharp and the mood flirtatious.  What if the film-makers hadn't the first clue about how an English barrister conducts his cases?  This is about romance, not professional ethics.  What if the terrain of Brighton isn't an igneous intrusion, but in fact a sedimentary accretion?  This is about two people's sublime dancing, not geology.<br><br>Fred is as always the quintessence of style, a naturally elegant creature, and Ginger is gorgeous.  The plot is very well constructed, containing all the misunderstandings associated with musical farce, but developing them with panache.  The denouement is both neat and unexpected. There are plenty of girls dancing in the usual geometric patterns, but there is also abundant creativity in the choreography - the playful steps in \"The Continental\", for example, or Fred's reluctant dance for his supper.  Mimi is trying to resist Guy, and has to be drawn into \"Night And Day\" against her will - an instance of character  being expressed through dance.  Max Steiner's arrangement of this number is glorious, with its 'tacit', and the swelling fortissimos, and a dainty countermelody in the strings. Ginger sings \"The Continental\" like an angel, nicely ragging the time.<br><br>Inconsequential?  No doubt.  Frothy?  Certainly.  A joy to watch? Definitely!","user":"stryker-5","rank":[59,61]},{"title":"Fred and Ginger","rating":8,"date":"1 February 2005","review":"After hearing Fred Astaire put his stamp in a song, it's hard to imagine anyone else attempting to improve in what seems to be the definite rendition of it. That is the case when Mr. Astaire sings Cole Porter's elegant \"Night and Day\". In pairing Ginger Rogers with Mr. Astaire, Hollywood hit the jackpot as it produced a winning combination that went from film to film with such ease and panache, it will never be imitated.<br><br>Mark Sandrich worked with Ms. Rogers and Mr. Astaire in several movies. Somehow, \"The Gay Divorcée\" is one of their best collaboration. This film is a lot of fun to watch, even after more than 70 years after it was made. It speaks volumes for all the people involved in the production of this movie.<br><br>The Great Depression was the right background when movies like this were made. In a way, it was an escape from the harsh realities of the times America was going through. The public went to the movies to see their favorite stars that were shown in such a glamorous roles. How could anyone not admire the great Fred Astaire, always impeccably dressed? Or how could not any woman in the theater envy Ms. Rogers's beauty and easy grace? That era made it right for Hollywood to show the world a sensitivity and sophistication that only few rich types were able to enjoy in real life, while the rest was trying to eke out a life of whatever work they could find.<br><br>The musical numbers are amazing. \"The Continental\" alone, must have blown the budget of the picture. Imagine how much it would cost today to have all those dancers in a sound stage! Not only that, but in that lengthy number, there are at least four changes of costumes for the women. Also, he is delightful singing \"Looking for a Needle in a Haystack\". A young and radiant Betty Grable makes an appearance singing \"Let's K-knock K-knees\" in which she shows a bit of her enormous charm and talent.<br><br>Ginger Rogers makes a gorgeous Mimmi Glassop. Alice Brady, is perfect as the dizzy Aunt Hortense. Edward Everett Horton plays an excellent Egbert Fitzgerald, the divorce lawyer. Erik Rhodes is one of the best things in the film; his Signor Tonetti injects a funny shot into the movie. Eric Blore, as the waiter, has great moments in the movie.<br><br>In setting the film in London and Brighton, a rich texture is added to this winning picture that will remain a favorite that will live forever because of the chemistry that Ginger Rogers and Fred Astaire produced in anything they did together.","user":"jotix100","rank":[40,42]},{"title":"Sensational","rating":29,"date":"29 January 2004","review":"Following an apparently accidental teaming in 1933's Flying Down to Rio (a fun Dolores Del Rio vehicle), Fred and Ginger got their first starring feature a year later. It was based on J. Hartley Manners' play 'The Gay Divorce'. The Hays Office insisted on shoving an 'e' on the end, for how could a divorce be so trifling as to be gay? Some UK prints still run with the original title. RKO assembled a sparkling ensemble cast of top-flight farceurs, bringing together (in ascending order of sublimity) Eric Blore, Edward Everett Horton and Erik Rhodes (\"Are you a union man?\"). Mark Sandrich directs the thing with a maximum of fuss and style. Hermes Pan helped Fred choreograph the numbers.<br><br>The plot is suitably - and delightfully - trivial. Musical star Guy Holden (Fred) happens upon a girl (Ginger), falls desperately in love with her, then spends the rest of the picture trying to free himself from marvellously silly plot threads and Everett Horton's exquisite quadruple-takes.<br><br>Keeping just one song from Cole Porter's original score, the timeless 'Night and Day', and adding only four others, The Gay Divorcée is more a comedy with songs than it is a musical comedy. But what comedy - and what songs! 'Looking For a Needle in a Haystack' is a masterpiece of economy: Fred a whirlwind of frustrated, lovestruck energy as he spins around his hotel room lamenting his missing love in peerless style. \"Men don't pine,\" he memorably concludes, \"Women pine. Men ... suffer.\" Everett Horton's rare excursion into song-and-dance territory is a breath of hysterical, liberating ludicrousness, as he knocks knees with a young Betty Grable. 'Don't Let It Bother You', performed by a chorus of dancing girls (and dolls), then spectacularly reprised by a tapping Astaire, is another treat. 'The Continental', the film's vast production number is peculiarly edited but sporadically fine and offers a fitting climax.<br><br>It's exceptional fluff, the sort of heady, heightened escapism that you don't come close to very often. An extravagantly mounted, joyous comedy played to perfection by two stars at their irresistible peak. Unmissable.","user":"rick_7","rank":[30,31]}]