[{"title":"My favourite version of a classic tale","rating":10,"date":"25 December 2001","review":"I know many people have a special fondness for the Alistair Sim version of Dickens' story, but for me, this 1984 version is the one to beat. My wife and I own a copy of this film on VHS, and we watch it together every Christmas Eve. I often remark that we could watch it on Halloween too, because it's a very creepy ghost story.<br><br>Scott--typecast as Scrooge--is shudderingly mean and nasty, making his transformation all the more miraculous and moving. I think it's up there with his performance in Patton. The spirits are all effective, each one creepier than the last. Watching the dark, floating, skeletal form of the Spirit of Christmas Yet to Come sends shivers down my spine every year. And what a supporting cast! David Warner, in particular, is in top form as Bob Cratchit, as is Susannah York as his wife. <br><br>I seem to recall that this version sticks closer to the original story than most others--but I may be mistaken, as it's been several years since I read it. Regardless, this is a terrific Christmas classic.","user":"Sisiutil","rank":[93,99]},{"title":"Hard to imagine a better version.","rating":10,"date":"17 December 2006","review":"So this made for TV film scores only a 7.6 on this site? Bah! Humbug! Without question this 1984 version of Dickens' classic tale is the best ever made. And yes, the Hound has seen the 1951 version which was also good, but not good enough. The lack of color is perhaps the biggest shortcoming of that version, although the acting was wonderful.<br><br>George C. Scott is simply incredible as Ebenezer Scrooge. We all know the story of this stingy businessman who is haunted by the ghost of his dead partner, then by three other spirits later on that evening. Scott is properly gruff as Scrooge. Too gruff in fact for some critics who claim he is unable to project the new-found glee that he awakens to on Christmas morning after the spirits teach him a valuable lesson. But hey, this is George C. Scott. He's never going to go dancing down the street in a fit of joy. He has too much dignity, and his Scrooge projects his emotion in a realistic manner.<br><br>The supporting performances are uniformly excellent, as are the costumes, music, and scenery. 19th Century London comes to life in Clive Donner's visionary style. The film even borders on frightening in several scenes involving the spirits. The important tale of morality shines through in every frame, though.<br><br>You won't often find this version aired on television anymore, and that is a disappointment. The 1984 version of A Christmas Carol should be a required part of every household's celebration of the holiday. When the decorations come out of the basement, this film should find its way into the DVD player at least once during the season.<br><br>10 of 10 stars.<br><br>The Hound.","user":"TOMASBBloodhound","rank":[104,117]},{"title":"The Definitive \"Christmas Carol\"","rating":10,"date":"19 December 2000","review":"This 1984 version of the Dickens' classic `A Christmas Carol,' directed by Clive Donner, stars George C. Scott as Ebenezer Scrooge.  By this time around, the challenge for the filmmaker was to take such familiar material and make it seem fresh and new again; and, happily to say, with this film Donner not only met the challenge but surpassed any expectations anyone might have had for it.  He tells the story with precision and an eye to detail, and extracts performances from his actors that are nothing less than superlative, especially Scott.  One could argue that the definitive portrayal of Scrooge-- one of the best known characters in literary fiction, ever-- was created by Alastair Sim in the 1951 film; but I think with his performance here, Scott has now achieved that distinction.   There is such a purity and honesty in his Scrooge that it becomes difficult to even consider anyone else in the role once you've seen Scott do it; simply put, he IS Scrooge.  And what a tribute it is to such a gifted actor; to be able to take such a well known figure and make it so uniquely his own is quite miraculous.  It is truly a joy to see an actor ply his trade so well, to be able to make a character so real, from every word he utters down to the finest expression of his face, and to make it all ring so true.  It's a study in perfection.<br><br>The other members of the cast are splendid as well, but then again they have to be in order to maintain the integrity of Scott's performance; and they do.  Frank Finlay is the Ghost of Jacob Marley; a notable turn, though not as memorable, perhaps, as the one by Alec Guinness (as Marley) in the film, `Scrooge.'  Angela Pleasence is a welcome visage as the Spirit of Christmas Past; Edward Woodward, grand and boisterous, and altogether convincing as the Spirit of Christmas Present; and Michael Carter, grim and menacing as the Spirit of Christmas Yet To Come.<br><br>David Warner hits just the right mark with his Bob Cratchit, bringing a sincerity to the role that measures up well to the standard of quality set by Scott's Scrooge, and Susannah York fares just as well as Mrs. Cratchit. The real gem to be found here, though, is the performance of young Anthony Walters as Tiny Tim; it's heartfelt without ever becoming maudlin, and simply one of the best interpretations-- and the most real-- ever presented on film.<br><br>The excellent supporting cast includes Roger Rees (Fred Holywell, and also the narrator of the film), Caroline Langrishe (Janet Holywell), Lucy Gutteridge (Belle), Michael Gough (Mr. Poole) and Joanne Whalley (Fan).  A flawless presentation, this version of `A Christmas Carol' sets the standard against which all others must be gauged; no matter how many versions you may have seen, watching this one is like seeing it for the first time ever.  And forever after, whenever you think of Scrooge, the image your mind will conjure up will be that of George C. Scott.  A thoroughly entertaining and satisfying experience, this film demands a place in the annual schedule of the holiday festivities of every home.  I rate this one 10/10.","user":"jhclues","rank":[86,97]}]