[{"title":"It's Cheap Alright..","rating":20,"date":"20 November 1998","review":"Just on the off-chance that anyone might be actually looking for a review for this hideous, wretched little movie, here it is. This movie was made on a budget that couldn't have realistically exceeded $300.00. Seriously. Hershey's syrup gore, rubber nails, cheap, synthy music at the most inappropriate of times, and so much more. The very beginning of this film treats  us to what has to be the world's least realistic rape scene ever. (and I am by no means an advocate for rape, but this was just silly) From there, the Nail Gun killer (portrayed masterfully on the box's hand-drawn cover as a guy with his crotch hiked up to comical proportions), a nasty little guy decked out in what appears to be a biker helmet held together with duck tape, some camoflage, and a nail gun with a big, yellow curly-cord which kinda defeats the purpose of camo if you've got a big yellow cord hanging off your back..  proceeds to \"slaughter\" some backwoods morons, nails a man in the crotch, (who just moans and groans, sort of like Al Johnson from the band U.S. Maple. I'm pretty sure I'd do more than just a little bit of whining if somebody nailed my equipment point-blank) and goes around saying witty things like, \"Nailed ya,\" or something stupid like that. Oh yeah, he drives around an inconspicuous GOLD Herze, too. You see this same Herze parked at a shop where the soon (but not soon enough, as the film proceeds for another 90 minutes)-to-be-revealed killer works, so I guess the filmmakers wanted the viewer to use their deductive reasoning skills. I kinda wish I'd have used my deductive reasoning skills and not wasted $1.08 on this trash.<br><br>Also worth mentioning: the killer's voice (they ran it through a synthesizer to make it sound deep and scary. that, and he laughs a lot. mwa ha ha! kinda like that) the killer's running ability (not suprisingly, the killer's stunt doubles were all women. while watching it I'd figured the person actually running in the killer's costume was a 12 year old boy.) the gratuitous, skanky t&amp;a (lots of that good old fashioned 80's skank, too. huge hair, make-up applied 3 &amp; 4 layers at a time, tan lines.. bliss) and finally, the old man (I don't know who this old coot was or where director Terry \"T.L.\" Lofton found him, but god love him he was the best thing in the movie.) There is so much more to this horrible movie that I can't spoil (or can't remember because I've blocked it out of my mind) for you so it's definitely recommended if you're looking for a bad time.","user":"-6","rank":[11,12]},{"title":"has to be seen to be believed...","rating":12,"date":"12 November 2000","review":"A nice little independent film from Texas?  Not even close.  Some guy named Terry Lofton wrote the story, screenplay, also directed and even had a bit part in his little movie, about an embittered construction worker who goes around with the title weapon, blasting people who raped a woman in opening moments of the film.  The killings should provide you with the best laughs of your life.  The gun makes some sort of machine gun noise, and we always see the nails AFTER they have entered the victim's body, never flying thru the air and then hitting them.  One dude takes one in the privates, a couple girls get them in the boobs and at one point, two girls, who appear to be walking on a country road in an abondoned area somewhere in another city, show up for the purpose of being pierced.  If this was a major motion picture, it might be called a revenge melodrama, but it is in fact a super low budget slasher pic.  It contains everything a bottom of the barrell film should: shoddy effects, bad (oops, horrible) acting, awful lighting and an ultra annoying music score that sounds like a keyboard chuckling.  But the one saving grace, the killer is hilarious!  He's a Freddy Krueger type, cackling wisecracks before doing in his victims.  He also doesn't wear the usual psycho garb, as he's decked out in camoflauge and dark helmet, with an oxygen tank in back.  Check it out for that sole reason.  Be warned though, that the film moves incredibly, agonizingly slow when he's not on screen. When there aren't people getting nailed, we get talky, yawn-a-minute exchanges between cast members.  So long, that you'll be glad when they get gunned down.  Another problem would be obtaining the film itself, it's a pretty rare find.  I bumped into it at a Blockbuster in a little San Diego suburb called Rancho Penasquitos and have yet to come across it again.  With all the films' flaws the worst one is that awful acting.  It's as if this Lofton guy went around asking his friends \"hey, wanna be in my movie??\" Even the nude babes are annoying, the first girl with the whitest breasts ever seen, the last girl being VERY impressive.  I'd expect a number of sequels if this were a big budget pic, but 15 years later, there has been no follow up to the self proclaimed \"penetrating love story\".","user":"mcfly-31","rank":[13,19]},{"title":"A classic","rating":1,"date":"15 October 2001","review":"This movie was great.  Even just looking at the box, you know you have a winner, with two (thats right TWO) awful jokes on the front.<br><br> This movie has it all - thats right, the director even put in some porn scenes, so everybody is happy!!  The soundtrack consists of,  1 song and the killer doing the evil laugh.  This one song is reused over and over - everytime somebody turns the radio on, there it is!!  The song itself is just Jimi Hendrix's Voodoo Child, but cleverly disguised (it sounds the same but with keyboards instead of guitars).  The story is ridiculous (a killer on the loose with a nail gun, and thats it), but the director does try to add a mystery into the movie.  If you don't solve it, you are stupid (sorry, but its true), but there was a clever way they covered it up - use different stunt doubles!!  This way, the director has achieved nothing except to confuse the audience - well done!<br><br> The acting is horrible, and the movie is jam packed with flaws.  My favourites were the dead man balancing himself out, and particularly the final death scene.  I suppose this would count as a ******SPOILER****** (or am I just paranoid about getting banned?) but it wouldn't really spoil the movie.  When the bad guy falls to his doom, it is obvious he landed on a mattress, because his foot flies back into the picture.  Next cut of the camera, he is stuck feet first into the ground.  A classic moment.<br><br> To sum up - great for a laugh, unless you get offended by pointless porn scenes or horrible movies.","user":"plantostickthat","rank":[6,8]}]