[{"title":"A superb evocation of a soldier's life in the weeks preceding D-Day","rating":10,"date":"12 August 2005","review":"\"Overlord\" follows the experience of a young soldier from his induction into the army up to his participation in Operation Overlord, the D-Day landings.<br><br>Beautifully photographed in black and white, the film weaves archive footage seamlessly into the fabric of the story and captures, not only the look, but the very essence of the period.<br><br>Until the closing moments, the protagonist is not involved in any fighting. What we see are the minutiae of life for a young soldier being trained and waiting to go into battle  the marching and military exercises; a trip to the cinema and the local village dance, where he meets his first girlfriend; the eve of battle, when he writes his last letter home, fills in the standard army issue will form, and burns all the private papers which he is not permitted to take into battle lest they fall into enemy hands and give away some information of use to the enemy. These small personal details give the film an emotional depth and a feeling for the times, which most war films made in the post war period fail to do.","user":"Sylvester","rank":[48,55]},{"title":"Excellent. Just excellent.","rating":8,"date":"16 May 2005","review":"When I heard that this film consisted of about 1/3 newsreel footage, I was expecting the worst. Stock footage blended with studio footage is something you'd find in an MST3k movie; three people in a car driving quickly away from a giant lizard and then cut to a different film grain shot of an iguana in a lab and then back to the car. Oh no, the Iguana is chasing us.<br><br>The effect can be jarring, to say the least.<br><br>But Cooper, so far as I have heard, actually wrote the screenplay for Overlord with the stock footage he was going to use already in mind, tailoring his script so that the footage actually made sense. The movie is shot so that the switch from studio to stock lighting and film quality is barely noticeable. I wouldn't go so far as to say it's seamless--it does take a little while to get used to, but after the first fifteen minutes or so you don't even notice it.<br><br>And that's a good sign, that you have to \"get used to\" the picture for a little while before you feel comfortable watching it. That's the sign of originality. This is a brooding and slow-paced war film, but unlike other such films it maintains a certain lightness in spite of its weighty subject and so avoids coming off as ponderous. No viewpoints are shoved in your face. Hard questions are asked, yes, but you're given plenty of time to try and sort them out for yourself.<br><br>This is a movie you have to be wide awake while watching--it demands your full attention, and if you're not willing to give that up then you're probably not going to enjoy it. Overlord is most certainly not mindless entertainment. It provokes thought, and if thought makes you uncomfortable it's simply not the movie for you.","user":"eddie-177","rank":[48,58]},{"title":"An unfairly overlooked masterpiece","rating":10,"date":"19 April 2007","review":"I saw Stuart Cooper's 'Overlord' at Seattle's Grand Illusion Theater last summer (before it opened anywhere else in the US) having heard nothing about the movie, and was absolutely floored by it. Its simple story follows Thomas, a young recruit, through his army training until just before he hits the beaches on early morning D-Day, all the while haunted by the spectre of impending death which awaits on Normandy's beaches.<br><br>The archival footage which makes up much of the film's most stunning imagery is meticulously chosen and edited; it frequently becomes Tom's dreams and visions of the War as it unfolds, and for the viewer, it is a vision of what WWII was, seen from both German and British sides. Cooper so masterfully situates Tom, an everyman, in visions of the surrounding war, that by the end of this surprisingly short, yet incredibly rich film, the magnitude of the toll the war took on the individuals fighting it becomes overwhelmingly moving.<br><br>Many will notice the major influence this movie had on parts of 'Full Metal Jacket' (Kubrick's long time collaborator John Alcott shot 'Overlord,' and Kubrick once commented that the only thing wrong with this movie was that it should have been twice as long). However, 'Overlord' is unique; I've never seen another war movie quite like this. It's a masterpiece of cinematic war poetry, and that it's taken over 30 years to get a release of any kind in the US is really surprising. It certainly holds its own against any of the best movies made about WWII.","user":"JAM-616","rank":[39,48]}]