[{"title":"Horror or Art?","rating":5,"date":"21 May 2011","review":"If you are here for the rape, you have wasted your time. The scenes are a joke. Even worse, the supposed killing of the two girls (Lieva Lone, Patricia Hermenier). The acting was atrocious.<br><br>Now, if you want to see Joëlle Coeur (Fly Me the French Way, Seven Women for Satan) fully naked, and engaging in sex with John Rico, that's a whole other story.<br><br>The Captain (Rico) hardly has time to enjoy the aftereffects when he is visited by apparitions of the two girls. Maybe it was just the booze.<br><br>The girls do eventually reappear only to escape and find an old castle guarded by, believe it or not, a clown. Not a court jester, but a clown. Strange.<br><br>They go through the transformation to become demoniacs, and, I am glad to say, sex is part of the transformation. Yes, there is the usual mumble jumble ritual, but there is also orgasm.<br><br>Don't expect a lot of gore in this film. It really doesn't make sense in a lot of scenes. You'll see what I mean. I think Rollin may have been trying to make an art film instead of a horror film.<br><br>It is a shame that Lieva Lone and Patricia Hermenier did not stick around to do more films, but another chance to watch Joëlle Coeur is always worth the time.","user":"lastliberal-853-253708","rank":[7,10]},{"title":"Pirates, clowns, nude mute girls and sex, French-style.","rating":4,"date":"13 October 2000","review":"I have a problem with Jean Rollin films.  Despite all the stylish surrealism, great French locations and nudity I still find his films incredibly boring.  I do appreciate Rollin's persistence of vision throughout his string of poetic sex/horror exploitation films through the 70s (clowns, castles, twins, beaches) but my mind begins to wander during his films and this is no exception.  The plot follows a dream logic known only to the director with too much time spent watching these sailors fight, rape or just sit in a bar.  The one female in the sailor gang really does inject some gusto into the her part though.","user":"Eegah Guy","rank":[8,14]},{"title":"The worst Rollin film I've seen yet","rating":1,"date":"4 August 2003","review":"Hell, it's even worse than Rollin's later film TWO ORPHAN VAMPIRES (1997), and that's pretty bad. <br><br>The only redeeming thing about this film is looking at luscious Joelle Coeur's naked body.  She did a few other unremarkable films in the 1970s and then promptly disappeared.  Coeur couldn't act worth a damm, but she sure was great to look at.<br><br>Anyway, two blond-haired girls are shipwrecked on shore and are raped and murdered by the scavengers who lured their ship up on the rocks with lights. There's just a lot of rolling around on the ground and it didn't look very violent to me.<br><br>Their spirits make a pact with the devil(?) who doesn't even look like a devil in some old church ruin near the shore.  There's also a mime or woman in a clown suit who serves no purpose at all.<br><br>The story is flaccid and hackneyed, the acting is awful (the worst I've ever seen for a French film), and the sets are too bright.  There's nothing scary or interesting going on at all except for Tina (Joelle Coeur) taking off her clothes and prancing around nude all the time.  Oh yes, she has a soft-core sex scene with the lead scavenger captain (John Rico) who looks old enough to be her father.<br><br>It has all the feel of a bad Jess Franco film.  Terrible.<br><br>1 out of 10","user":"macabro357","rank":[12,24]}]