[{"title":"Great finale","rating":8,"date":"18 May 2001","review":"This is probably the best horror comedy ever made.While it doesn't make fun of the monsters it does have some fun with them.Just love the Frankenstein monster's initial reaction to Lou Costello.<br><br>Lugosi truly shows how wrong Universal was to treat him so badly over the years.He gives a wonderful perfomance with nice comedic touches.Chaney is excellent in \"his baby\" the Wolf Man.Strange is given a bit more to do as the monster rather than just lie around until the last five minutes.<br><br>Great fun for everybody!","user":"evilskip","rank":[52,55]},{"title":"Scarily Funny!","rating":16,"date":"16 November 2004","review":"There are two schools of thought regarding 'Abbott &amp; Costello Meet Frankenstein'. The first holds that the movie represents the nadir of the Universal Monsters cycle, with three once-great monsters reduced to playing second-fiddle to a couple of Laurel and Hardy wannabes. The alternative view, which I hold, is that this movie is a classic comedy-horror, perhaps the best example of that hybrid sub-genre until John Landis' 'An American Werewolf In London' emerged in 1981.<br><br>'A&amp;CMF' warrants classic status because it is probably the best Universal horror film since 'The Wolf Man' (1941); certainly it has a much stronger narrative thread, not to mention a better reason for the three monsters coming together, than either 'House Of Frankenstein'(1944) or 'House Of Dracula'(1945). The problem with those two movies is that Dracula, Frankenstein's Monster and The Wolf Man's coming together seemed purely coincidental, with Dracula not even encountering the other two in 'House Of Frankenstein' (which feels like two short films cobbled together, with only Boris Karloff's Dr. Neimann &amp; J. Carroll Naish's hunchback providing a link between them) and 'House Of Dracula' only featuring a few scenes with more than one monster. 'Abbott &amp; Costello Meet Frankenstein', by having The Wolf Man pursuing Dracula and the Monster, and also having Dracula plan to put Lou Costello's brain into the Frankenstein Monster (with the help of the duplicitous Dr. Mornay) provides an extremely satisfactory reason for the various characters coming together.<br><br>As for the acting, it has often been pointed out that this film works because the monster actors (Bela Lugosi, Lon Chaney Jr &amp; Glenn Strange) play it straight, and this is very true, with Chaney's tortured soul act contrasting well with Lou Costello's one-liners (especially the famous 'you and twenty million other guys' joke). Lugosi, playing Dracula for only the second time, is wonderfully grandiose and even Glenn Strange, who is basically only required to lumber about, does what he does well, and he has a lot more to do than in the 'House of' movies. Abbott and Costello are very funny, using fewer verbal routines than normal, but doing some highly entertaining slapstick gags, and the supporting cast do very well, notably Frank Ferguson as the blustering McDougal, barely controlling his exasperation at Lou Costello's incompetence. Lenore Aubert as Dr. Sandra Mornay does well, and it's interesting to see a female mad scientist, particularly taking into account when this film was made. Charles Bradstreet and Jane Randolph have less to do in their parts, but neither of them drags the film down<br><br>All in all, 'A&amp;CMF' is a movie that deserves a much greater reputation than it has acquired in some circles, and is probably the high point of the Abbott and Costello filmography","user":"violencegang","rank":[63,70]},{"title":"Bud & Lou's Best!","rating":10,"date":"17 February 2005","review":"A full moon is on the rise in foggy London when Lawrence Talbot places a panicked phone call to the States. He is the only one who knows that a great evil is on its way to America. Count Dracula and the Frankenstein Monster have been shipped to a wax museum, and when the sun sets, Dracula will rise and summon his superhuman servant. Talbot knows he must warn someone...anyone...but unfortunately, it's Lou Costello who answers the phone. The movie is then off and running. Dracula needs a new brain for his monster, a brain so simple and dumb that the monster will obey Dracula's every command. Dracula's lethal henchwoman, Doctor Sandra Mornay, soon finds the perfect subject. Guess who? Now it's up to Bud Abbott and Lon Chaney Jr. to save Lou and stop Dracula before Lou literally loses his mind!<br><br>This is my absolute favorite Abbott &amp; Costello film, sweet and witty but also dark and spooky, with plenty of nice, Gothic sets filled with full moons, flapping bats, cobwebs and lab equipment. Lon Chaney Jr. as the lycanthropic Lawrence Talbot, Bela Lugosi in his final appearance as Dracula and Glenn Strange as the Monster all play their roles perfectly straight as Bud and Lou stumble around them. The dark and seductive Lenore Aubert makes her second appearance as a Bud and Lou Bad Girl, slinking her way through the entire movie like a black panther, trying to lead poor Lou astray. Best moments include a wax museum in a lightening storm, a costume ball on a moonlit night and an uncredited Vincent Price who shows up - sort of - at films end. Bud and Lou turn in flawless performances yet again; Bud the Straight Guy always ready with a stinging one- liner and Lou the Bumbling Fool, falling all over himself, yet both of them always uniting at the films climax to stop the Bad Guys. <br><br>Fans of Bud and Lou and fans of the Universal Creature Features should not miss this film. It is both a spoof and an homage to the legendary Monsters of film. 10 stars.","user":"Gafke","rank":[51,58]}]