[{"title":"\"Bruce Campbell has more guts than the lot of you!\" cries Jean Lucas. She's right. Not bad for a dying man.","rating":7,"date":"16 August 2009","review":"There was a time in adventure novels and some movies when the hero was motivated and decent; when the bad guy was clearly unscrupulous; where romance was discrete and sex was nonexistent; where the writing was clear, descriptive and straightforward. <br><br>With Ralph Hammond-Innes (writing as Hammond Innes) we learned, thoroughly researched, about the North Sea, the Arabian Desert, whaling, Australia, Labrador, elephants, Morocco, the Arctic, the South Seas and a lot more. All this was found in his satisfyingly thick adventure novels. His best, in my view, were written between the late Forties and the late Sixties. Campbell's Kingdom is one of them...and the movie's not bad, either. There's gorgeous Canadian Rocky Mountain scenery, a ramshackle mining town named Come Lucky, a deep, forested valley called Campbell's Kingdom, naked greed, ruthless motivation, virile action...and Bruce Campbell, played by Dirk Bogarde. <br><br>Campbell travels to Come Lucky from England to see the high, cold valley his grandfather left him. The old man, who for years believed there was oil to be discovered in his valley, left it to Bruce hoping the young man could prove the dream was true. Bruce came to Campbell's Kingdom and Come Lucky thinking he has just six months to live. All he really wanted was to find a place to feel sorry for himself. Instead, Bruce finds himself up against Owen Morgan (Stanley Baker), the ruthless, driven construction boss who is building a big hydroelectric dam that, when shortly completed, will flood Campbell's Kingdom. If oil is found, it will stop the dam. If the dam is completed, it makes oil moot. Morgan rules in Come Lucky, and the men whose jobs depend on the dam are ready to play just as rough as Morgan wants them to. Campbell discovers there just may be some truth to old Campbell's claims, doesn't like being pushed by Morgan, and decides he won't sell. He'll find out the truth. He's aided by Jean Lucas (Barbara Murray) a young woman who helps run the small hotel in Come Lucky and has a story of her own, and by Boy Bladen (Michael Craig), who wrote an engineering report Morgan fiddled with, who really likes Jean, and who is just as decent as Bruce. By the time James Robertson Justice shows up as James MacDonald, who runs a small oil-drilling rig, it looks like rough action is going to break loose right in the middle of some beautiful scenery. It does. The climax is a terrific sequence that demonstrates dramatically what happens to a dam built with poor grade cement. One other moral: Fresh air and hard work can do wonders with an illness that promised death. <br><br>Campbell's kingdom gets off to a bit of a slow start as we learn about Bruce Campbell's health, about Campbell's Kingdom, the people of Come Lucky and the degree of Owen Morgan's ruthlessness. A quarter of the way in, though, the excitement kicks in. For the rest of the movie Bruce has to meet head on one crisis after another. Bruce Campbell finds unexpected reserves of resourcefulness requiring split-second timing, perilous tram rides, mountain road avalanches and blown bridges. No one beats another into the ground but there's a lot of action. <br><br>I've never thought Dirk Bogarde was convincing as a rough and tumble type, but he's much better here in most of the movie leading his few troops and outguessing Morgan than as the soulful, seemingly-dying-with-quiet-nobility Bruce Campbell we first encountered. In his younger years Bogarde knew how to give that sad look with a weary, resigned little smile that made the hearts of middle-aged matrons flutter. Stanley Baker, on the other hand, had the kind of face that just looks mean. Campbell uses his brain more often than Morgan, and that helps. They were both good enough actors to make the friction between their two characters work. <br><br>It would be an injustice to Barbara Murray not to mention that, perfectly acceptable as she was in movies like Campbell's Kingdom, she reached her absolute prime, and I mean prime, 17 years later as Madame Max Goesler in The Pallisers. She gave luster to maturity, experience, wit, desirability and charm. <br><br>Four movies have been made from Hammon-Innes' books. The Wreck of the Mary Deare (1959) manages to turn a suspenseful story into a dull courtroom slog. Hell Below Zero (1954), based on The White South, was turned into an Alan Ladd vehicle. It's not bad. I've not seen Snowbound (1948), based on The Lonely Skier. So it's best to start out with his novels. Pick one at random from the Fifties and dive in. You might like them a lot.","user":"Terrell-4","rank":[16,17]},{"title":"Bruce Campbell's got more guts than the lot of you put together!","rating":7,"date":"21 November 2006","review":"Well looking at some comments I thought it prudent to add mine in the defence of a remarkable film.<br><br>Unlike some location flicks and despite the efforts of dramatic scenery this film is failed by it's casting. A film about a Scot in Canada and not a Scot or Canadian accent in site!There is however a strong British cast assembled for filming abroad, a rare treat for Bogarde and co in post war austere Britain and a rare treat of course for the audience - colour! So please accept it for what it is. A rare colour British melodrama to cheer and entertain and perhaps re-awaken the declining film audience of the time.<br><br>If you are one that enjoyed the old days of an old black and white TV flickering away on a Sunday afternoon playing a comfort film then this is one to watch one day.<br><br>I really don't understand what James Robertson Justice is doing in this, despite his Scottish roots he performs out of character (typecasting above all is the problem here),perhaps he should have played to his strengths and played the part as a booming eccentric, a Major perhaps?!. All the rest give their best and stoic Dirk Bogarde of course is excellent!<br><br>I like the warm feeling this film brings to the watcher good may or may not triumph over evil here. I leave you to watch and enjoy the really well worked climatic end. Over sentimental at the conclusion? Perhaps! Glad it was made? Definitely! Enjoy a sweet film.<br><br>The end.","user":"ouzman-1","rank":[16,18]},{"title":"In defence of Brit movies","rating":8,"date":"9 August 2006","review":"I agree there are many good , bad or indifferent movies but the point is surely , for movie collectors / fans is the enjoyment of the film by the individual. Brit movies never cost anything like the cost of other countries movies to make so the results of this movie are pretty fair for it's production costs. It's also a very clean movie ( language wise) and the story was by a very good writer. I read the book years before I saw the film and the film lived up to the original story concepts. For me it is a great pity that such Brit movies do not receive more attention from restorers and DVD producers. ( It's one I would certainly buy for my movie collection if it were available )","user":"chedward","rank":[15,17]}]