[{"title":"A film for the humiliated ones.","rating":10,"date":"23 June 2004","review":"Claude Miller's most important work is today stronger than it was in 1976.It's a must ,the French cinema at its most ambitious ,at its deepest,at its best.And nothing intellectual,nothing to do with the nouvelle vague pretentiousness,\"la meilleure façon de marcher\" is accessible to all those who have eyes and ears.<br><br>It features one of the strongest actors confrontations which can be seen on a screen:the sadly missed Dewaere and the subtle Bouchitey literally live their part,they are so real we have the very rare feeling of knowing them intimately.So intense Bouchitey's performance was that afterward he did not get the roles he did deserve:the directors stayed with the picture of a \"drag queen\" .<br><br>\"La meilleure façon de marcher\" pits the virile macho boy against the intellectual sensitive guy.It brings out the mechanics of the humiliation.It deals with the demanding subject of our \"skeletons in the closet\" ,our hidden odd habits ,all that we want to hide from the outside world.It would be too simple to consider Philippe's one (dressing up as a woman)as a very rare occurrence .\"I'm sure I could find something in your room\" he screams to Marc,who has discovered his secret and then makes him his punching bag.In a world in seclusion such as a boys holiday camp in 1960,where women are absent (with the exception of Philippe's fiancée,who only appears in the second part),there are secrets beyond any door:from the children who hide a pornographic paper under a Mickey Mouse comic strip to the epileptic counselor who 's got dirty pictures under his pillow.And the ones who<br><br>look \"normal\",like the hairy Marc,are they as \"straight\" as they seem?<br><br>Marc is probably in love with Philippe and as he cannot bring himself to take the plunge ,he humiliates him to death .Hatred rises ,reaching unbelievable heights,culminating in this unbearable scene when Marc forces Philippe to eat his own vomit.<br><br>The dialog is close to perfection:full of allusions,of threatening sentences,of veiled accusations;and what is left unsaid is all the more disturbing.Most of the time,we really feel ill-at -ease.That's why Claude Pieplu's part is so necessary:a comic relief ,his suggestion box is irresistibly funny.Deprived of these hilarious sequences,the movie would be desperate.<br><br>But Claude Miller wanted his demeaned characters to rebel;the first one in the pool where the one of the counselors says f..... you to the director.But the best comes when Philippe,in his woman's dress (A Spanish dancer) invites Marc ,dressed up as a toreador ,to dance.You should notice that in Marc's room,there was a poster of a toreador fighting a bull.\"What's making me itch,is making you itch too!\" he cries out as his persecutor pretends to find it funny but in fact has to force himself to laugh.<br><br>Miller's intelligence shines in the last sequence too when he puts his characters back in \"normal \" life.The two \"enemies\" act as if nothing happened .Their behaviour stems from the establishment which does not know deviancy .Now that Philippe exists socially speaking,he's respectable ,even if he does not plan to get marry -as Marc is -,he's no longer a victim.Generally you find punching bags in schools ,holiday camps or barracks,in places where frustration leads to search for someone to spit at (generally people who do not like sports,like in Minnelli 's 'tea and sympathy \",which certainly influenced Miller)).<br><br>A film that cannot be praised too highly.","user":"dbdumonteil","rank":[72,82]},{"title":"Difference leads to humiliation, until...","rating":9,"date":"12 July 2005","review":"This film shows marvelously well how adult people can act like children and be cruel exactly in the same way. As everybody knows, if you are different (best example: you don't like sports...), you always can find a bastard to make fun of you. Here, the \"bastard\" is played by Patrick Dewaere. What makes him really dangerous is that he is intelligent enough to never offer his victim, Patrick Bouchitey, a way to get out of his mental claws. He has found the \"weakness\" of his prey, and he doesn't let her go. Until... He has this kind of \"stupid\" intelligence, which makes him very able to get control over the others, but totally unable to perceive what's going on inside of himself. And at the end, he will be the one who will be depicted as the \"loser\", with his small suit and briefcase, being married without any real choice. Claude Miller never let his characters talk to much. He is a master in organizing what's left unsaid, showing here a glance and letting there a question unanswered...He makes us get into the emotions of Patrick Bouchitey's character, he makes us feel uneasy. Even the presence of the fiancée doesn't really ease the pain, because we feel that it could lead to more humiliation.Until...","user":"paws-7","rank":[34,41]},{"title":"Dewaere's shadow","rating":10,"date":"30 December 2006","review":"In a holiday camp the dispute between two instruction. The first- the classical virile image: brutal, sure-footed, sarcastic and charming. The second- unobtrusive, delicate,responsive, gentle and in womanhood kind. An imprudence of powerful hero is the beginning of a subtle and ambiguous fight. The victim is easy prey and the instruments are not little. But, in a strange scene of party, the domination is for both same overwhelming, it is a form of captivity in the other's image. And not about homosexuality, a cruel game in fall or about a good moral can talks. It is a basic rule of any relation. Of any admiration/competition gesture, of any summer who is not only a vacation's time.<br><br>The merit of Claude Miller is to suggest the deep desire who lives in same relation. To define the behavior of an accidentally master and his obvious fear for the victim's acts. In same time, the film is a beautiful pledge for tolerance, for self understanding thanks to respect for the other. A movie about difference and the limit of common racism. A anti-macho film. But, before the moral, a nostalgic word about lost world.<br><br>Patrick Dewaere is gorgeous in his character. Every shade of acting is subtle expressed, with precision and interesting art.<br><br>So, in his memory, like remember of his lost, I saw \" La meilleure facon de marcher\" at a homage for a great actor, too.","user":"Vincentiu","rank":[19,24]}]