[{"title":"Brain-free fun","rating":9,"date":"27 August 2001","review":"Oh boy do I ever enjoy this movie. For some reason I've managed to see it at least once a year since it was released and I never get sick of it and I really have no idea why. Mental disorder, perhaps. This movie redefines camp for post-apocalyptic scifi quest adventure 3-D crap. Peter Strauss and Molly Ringwald are both great in their stock roles--Strauss is refreshingly down-to-earth, so unlike the usual all-knowing megalomaniac space ranger with a girl in every port (his girl is a purchased robot companion, which says things about a guy); Ringwald's whine would give God a<br><br>headache, but she's got the right proportion of bravado and vulnerability to create a believable, occasionally endearing space orphan. I like the random nature of their search, designed to place them in situations where the production can use up a set or two that might have been intended for some other movie. Plenty of rubbery creatures abound. And the Thunderdome-esque stuff is actually pretty cool--I'm reminded of Leela's test in that Doctor Who episode (something people who like Spacehunter are a plausible demographic to remember). All in all this is a happily-brainless-yet-somehow-lovable piece of space junk and I'm crazy about it. Or just crazy.","user":"sam66","rank":[62,65]},{"title":"Might be dated, but should be celebrated!","rating":7,"date":"27 December 2006","review":"Been waiting for this for a long time - as cult classics go it's one of my more memorable adolescent reminiscences.<br><br>I remember seeing this on the big screen when it was first released. Loved it then, for several reasons: Strauss was capable but cool as the hero Wolf, Molly Ringwald was feisty, mouthy and cheeky as the elfin Nikki, and Michael Ironsides was virtually unrecognisable under his make-up, but still gave Overdog a sinister air of menace and cruelty.<br><br>Now, 20 years later, I get to see it again, and there are flaws that time has exposed. The effects and the music are very dated. The dialogue is weak in places, and the acting from the minor characters leaves something to be desired. However, it still has a sense of excitement and adventure that many other sci-fi flicks of the 80s now lack. The action is fast-paced, the interaction between the leads is good, and the scenery is suitably dark and barren.<br><br>7/10 - it's well worth overlooking the more dated elements in order to uncover the gem underneath.","user":"Paul Shrimpton","rank":[26,26]},{"title":"Forgotten Gem","rating":8,"date":"3 December 2004","review":"Spacehunter is a film I saw as a child, which has remained at the back of my mind for years. Around the same time, I was watching things like Ghostbusters and Star Trek (The Wrath of Khan), and knew nothing about special effects, budgets or story lines. All I knew was that I liked these films. Having recently obtained a copy of Spacehunter, I was pleasantly surprised at how well it holds up, compared to other classics. Yes, a lot of it is hokey nonsense, but in a GOOD way. <br><br>Strauss makes a likable rogue, obviously straight from the Han Solo mold, and Molly Ringwald is her usual early eighties cutie. The special effects are fair for the time (though the title sequence leaves something to be desired), and the futuristic 'Mad Max' style vehicles could easily be from a more recent movie.<br><br>Michael Ironside is almost unrecogniseable underneath prosthetics, but offers a great performance, hampered only by his lack of mobility in costume. I was especially surprised to recognise Ernie Hudson as a supporting character, playing Strauss' ex-buddy.<br><br>In all, a great film with a few minor flaws. I'm amazed this got no further than it did at the time. One of the few post-Star Wars movies that deserves a sequel (which i'm tempted to have a bash at myself).","user":"Sam_Ricketts","rank":[48,53]}]