[{"title":"A Movie Worth Seeing!","rating":8,"date":"19 January 2006","review":"Few stories have stirred the imagination as much as the infamous mutiny aboard the HMS Bounty, in 1789, and this movie captures the spirit of that historic event very well.<br><br>Clark Gable stars without his trademark mustache (and British accent) as Fletcher Christian, the officer in charge of the mutiny. Fortunately, his performance as Christian was strong enough so that the average viewer would overlook that particular flaw (unlike Kevin Costner's turn as Robin Hood in 1991's \"Robin Hood: Prince of Thieves\").<br><br>Franchot Tone's portrayal of Midshipman Roger Byam was sympathetic, as he appeared to be more of a witness to the events than a participant. Byam's plea for reforms in the British Navy at the end of his court martial put a cap on a memorable performance. It should be noted that one of the factors in creating the Best Supporting Actor/Actress categories at the Oscars undoubtedly came about as a direct result of this movie, with three men nominated for Best Actor. If Best Supporting Actor had existed, Tone would have been up for (and likely received) Best Supporting Actor.<br><br>And then there's Charles Laughton. As Captain Bligh, Laughton made the most of his scenery-chewing role. Fortunately for him, the open-boat sequence added depth to his character, avoiding the cliché of Bligh being a cruel and inhuman sea captain. Unfortunately for him, his likeness graced cartoons and magazines for decades as a depiction of controlling and maniacal leaders.<br><br>While watching this movie, I began to notice a few plot points that Herman Wouk must have used for his novel \"The Caine Mutiny\". For example, Byam sees a tall ship and asks if it's the Bounty, but the Bounty is a smaller ship behind it; likewise, Ensign Keith spots a proud new vessel and asks if it's the Caine, but the Caine sits beyond, a small minesweeper full of rust. Captain Bligh obsesses over two wheels of missing cheese; Captain Queeg turns his ship upside-down over a few pounds of strawberries. And both Bligh and Queeg believe the whole crew of their respective ships are against them, even going so far as to conjecture a conspiracy theory based upon half-heard (and innocent) conversations. By the way, I am not trying to discredit \"The Caine Mutiny\" in any way; both the novel and the 1954 movie (starring Humphrey Bogart) are classics in their own right, and I recommend both reading the book and seeing the movie.<br><br>\"Mutiny On the Bounty\" is a well-made movie, with one of the best musical scores I have heard. When I heard the violins sweeping into the theme music at the opening titles, I knew right away I was in for a good time. Strong performances, great camera work, a well-written script, and an astounding musical score. All in all, this is a movie worth seeing!","user":"robmeister","rank":[31,32]},{"title":"The sentimental favorite version.","rating":28,"date":"28 September 1999","review":"When watching this great motion picture keep in mind that it is now over sixty (60)years old! Even through the passage of time it provides for entertaining viewing. Charles Laughtons performance as William Bligh captain of the Bounty basically set the standard as how Bligh is pictured and thought of when his name is mentioned. Other actors have portrayed Bligh but it is Laughtons portrayal that is remembered most. The 1984 version with Anthony Hopkins and Mel Gibson is probably a more historical version of actual events but this 1935 classic will most likely always be the sentimental favorite.","user":"yenlo","rank":[28,30]},{"title":"Our Favorite \"Mutiny\": April 28, 1789","rating":10,"date":"26 September 2005","review":"Although the versions with Marlon Brando and Trevor Howard, and with Mel Gibson and Anthony Hopkins, are fairer in presenting William Bligh than the 1935 version did, it is the 1935 version that remains the best American version of the story of Bligh, Christian, and the \"Bounty\". It is the most literary version (based on the novels of Nordhoff and Hall - there are actually three novels), and it did give Charles Laughton his most famous ogre (which he repeated later as Captain William Kidd twice), but somehow the story was properly told in this version. Somehow making a case for Bligh weakens the story of men rebelling when they can't stand anymore.<br><br>If one wants to see the story from Bligh's side, read his very readable account THE MUTINY ABOARD H.M.S. BOUNTY, but keep in mind that it is his account of his side of the story. Christian never did get a chance to produce his side of it. Peter Heyward, the real life version of Byams (Franchot Tone) had the family connections and money to publish his anti-Bligh account, but Bligh's book became a best seller.<br><br>Historically most people feel that Bligh was more bark than bite. Unfortunately for his reputation he would be involved (in later years) in two other mutinies: that of the entire British fleet (the \"Great Mutiny of 1797), where his ship \"H.M.S. Director\" was the last ship to take down it's flag of mutiny); and the New South Wales mutiny of 1805, where he was the Governor of the colony and his measures led to a mutiny of the local New South Wales Corp. But the Great Mutiny was actually caused by government corruption and neglect of it's seamen. As for the 1805 mutiny, Bligh was trying to control the New South Wales Corps which was not only corrupt but bullying the civilians. In the end his reports led to the recall of the corp. to fight against Napoleon on the Iberian Peninsula. But Nordhoff and Hall presented Bligh as the villain there too.<br><br>The film also has more to it than the ranting of Bligh at \"MR. Christian!\" There are moments of comedy. Laughton's temper and anger are punctured a few times when the new cook (Herbert Mundin) keeps bungling things. When Laughton is angrily confronting a dissatisfied sailor, he happens to be staring directly at the sailor and Mundin. He orders the sailor to step forward, but Mundin does, causing Laughton to sputter. Also Mundin manages to toss garbage over the side so that it ends up hitting Laughton in the face. One wishes there had been more than this, or (better than that) an attempt to bring the two actors together in a comedy. Add to this Mr. Bacchus (Dudley Digges) whose leg (depending on when he is talking about it) was lost in a sea battle with the French, by a shark (who six months later turned up dead, with the leg still inside him), and shot off by a pirate off Madagascar (or something like that). His death in the film is a signal for the collapse of the one spot of humanity linking Christian's faction with Bligh's.<br><br>It is now generally accepted that Bligh was one of the greatest navigators in history, and the open boat voyage after being thrown off the Bounty remains an incredible achievement (he lost only two men). The film's best moments for Laughton is in this section, as he suddenly becomes far more wiser and humane trying to keep his crew healthy and able to continue to sail to safety. But when in charge of a full ship Bligh could not, or would not control his temper and his tongue. It was sufficient to get him into trouble. However, it was also his ticket to fame. Seaman remember the great navigator and the cartographer - the man who sailed with Captain Cook and who fought (at Copenhagen in 1801) next to Horatio Nelson. But the public will always remember the ill-tempered martinet, fairly or not, whose tongue made nautical history.","user":"theowinthrop","rank":[43,49]}]