[{"title":"Quite enjoyable, though nothing brilliant","rating":10,"date":"10 September 2001","review":"One can't help but think that at some times the story is a little stretched. A high percentage of Taylor's dialogue is un-needed, which isn't to say he doesn't perform well.<br><br>Taylor plays an outback police-sergeant sent by the Premier of New South Wales to place an indictment on the Australian Ambassador in London and bring him safely to custody. However, his arrival in London coincides the same time as the ambassador (chris plummer) seems to be making a breakthrough in middle-eastern diplomacy. Taylor is persuaded by Plummber to wait until the summit is completely before talking him back. However, predictably there are certain foreign powers at play who would not want to see the summit reach any peaceful negotiations. And so the ambassadors life is at risk. Of course, Taylor is there to make sure that he is brough safely back to Australia - to stand trial and face the allegations which even he begins to find a bit suspect.<br><br>Yeah, rent it watch it on tv. It's enjoyable. Nothing brilliant. The end is particularly reminiscent of Sabotage, when you think of it.","user":"bamptonj","rank":[16,19]},{"title":"A unique film of the 1960's with an Australian touch","rating":28,"date":"28 November 2003","review":"This 1968 production has a great blend of cast and the outline of the film is well described in the comments of bampton. where Scobie Malone, an Australian outback detective Sargent is summoned by the Premier of New South Wales to go to London and safely escort an Australian diplomat(Christopher Plummer) back to Australia. Scobie(played by Rod Taylor) is annoyed to go to Sydney (the capital city of the state of New South Wales) after having just returned from there. This scene of when he is summoned also shows a unique and beautiful background of outback Australia at that time.<br><br>Rod Taylor plays the part of a rugged bushman exceptionally well, as he is outspoken, grumpy and speaks his mind without too much concern as to who may be present. I even like his Australian accent as it stands out at the London banquet amongst the upper class English gentlemen in their tuxedo, who pay more attention to their etiquette as they are tensely worried by his unpredictable outbursts of free speech. In contrast to his role in Time Machine\" where he is much more docile and well spoken. This is what I believe makes a good actor, especially with the extreme diverse roles that they can perform and I believe that Rod Taylor performs brilliantly.<br><br>\nThere is also a scenery of a tennis match at Wimbledon between an Australian and an Englishman where Scobie boasts to them that Australia is in front. Yet, Scobie also shows his Australian charm as he is a real softy at heart and his bark is louder than his bite, but is also an outstanding policeman where he surprises all those that underestimate his police skills purely by judging a book by it's cover.<br><br>Without giving too much away, I do recommend this movie and should be judged fairly as it is a late 1960's production and should not be compared to modern cinema. I do enjoy repeats of it as it seems to be more inspiring . A brilliant blend of cast which also include Leo McKern, Lilli Palmer and Charles Bud Tingwell. Worth watching!!!!","user":"joeagnes","rank":[17,23]},{"title":"Familiar but OK spy drama","rating":6,"date":"29 April 2007","review":"This is certainly not a bad film: the script maintains an air of uncertainty as to who is and who is not in the conspiracy to kill Plummer, there are some frantic fight scenes, a nice elegiac score, the performances are fine, putting in more emotion than usual for the genre, and the Goddess-like Daliah Lavi &amp; the beautiful Camilla Sparv more than fill out the required \"babe quotient\" (as I've said before, these 60's spy thrillers are almost always a sure bet if you want to see some incredibly beautiful women). However, there is not much here that you have not seen before. Perhaps it says something about the greatness of Hitchcock that even one of his widely considered \"lesser\" pictures (\"Topaz\") is still better than this movie. (**1/2)","user":"gridoon","rank":[7,8]}]