[{"title":"Arguably one of the funniest films ever made","rating":10,"date":"6 June 2004","review":"\"Airplane!\" is, was and always shall be the master of spoof movies. It is single-handedly responsible for literally inventing a sub-genre of comedy. It is the ultimate Silly Movie. A satire of the disaster movies of the 1970s, particularly the \"Airport\" series, nothing makes sense and it doesn't need to. There's no real plot. Just laughs - and plenty of 'em.<br><br>It was helmed by the ZAZ trio (Zucker, Abrahams and Zucker), whose dedication to making the audience laugh is surprisingly adamant. Recent spoofs may have left a bad aftertaste in your mouth, but it seems to be a universal agreement: \"Airplane\" is the funniest film of its genre ever made. (Closely followed by \"The Naked Gun\" - also penned by the ZAZ trio - perhaps.)<br><br>The plot: Ted Striker (Robert Hays) is a war veteran-turned-cab-driver who decides to chase after his girlfriend, an airline stewardess named Elaine (Julie Hagerty), who has dumped him in order to pursue a new life. Right before her plane takes off, Ted climbs aboard, hitching a ride in order to woo her back into a relationship again.<br><br>When the aircraft is in midflight, both pilots become very ill after eating their meals. Eventually many passengers begin to show symptoms of a rare disease, apparently transmitted by the food. Onboard, Dr. Rumack (Leslie Nielsen) takes care of the sick passengers as Ted - an ex-fighter pilot from the war - decides to try and land the plane. If he messes up they will all die, and in a particularly funny scene, the pressure becomes so unbearable that he begins to literally sweat gallons in the cockpit.<br><br>That is essentially all the film is about, but most of its duration is spent cracking jokes. Spoof films are entirely different from other movies because normally we would criticize a film if it considered its plot to be the least important element. Not so here. This is a truly brainless piece of celluloid - a movie that doesn't try to be anything that it isn't. From the opening credits - that cleverly spoof \"JAWS\" - to the closing we realize that this is an altogether unique film going experience.<br><br>The movie's biggest laughs come through unexpected flashbacks, such as when Ted remembers where he first met Elaine in a crummy bar (\"...it was worse than Detroit...\"), and begins to disco-dance a la John Travolta from \"Saturday Night Fever\" (complete with Bee Gees soundtrack blaring in the background and the famous Travolta pose). Then, later, we are taken back to when Ted was hospitalized after the war, and finds out that he was responsible for the death of six men. \"Seven, actually,\" he is informed, which adds to the pain of the moment for him. <br><br>Though this movie is very funny, many jokes misfire. If you're not pop culture savvy and you don't remember Mrs. Cleaver from TV's \"Leave it to Beaver\", the humor is going to go over your head. But unlike many comedies, \"Airplane!\" offers something unique for each person. I know that as a film lover, I picked up on many movie in-jokes that some people might not recognize. And then there were the gags that I first missed but picked up after a second viewing, or when someone explained them to me, or both. And I'm sure there are many yet that I'm not aware of. It seems that every time I watch it, there's something else to laugh at that I missed previously.<br><br>\"Airplane!\" not only was a huge success in 1980 (the year of its release), spinning off a horde of imitators and one sequel - it was also responsible for crowning Leslie Nielsen \"The King of Spoof.\" Prior to \"Airplane!\" Nielsen had been a veteran of more serious productions, stemming back to playing cowboys on \"The Mickey Mouse Club\" and other embarrassing attempts at acting. However, Nielsen later claimed that he had always wanted to do a comedy, even when he first started acting seriously with projects such as the classic \"Forbidden Planet\" (one of the best science-fiction films ever made). He later reunited with the ZAZ trio for \"The Naked Gun\" trilogy, appeared in similar spoof films over the years such as \"Wrongfully Accused\" and \"Scary Movie 3,\" and had his iconic comedy shtick ripped off by many screen veterans - most noticeably by George Gaynes in the unbearable \"Police Academy\" (1984).<br><br>When it comes down to a single evaluation, \"Airplane\" is simply the best spoof film ever made. It's like a MAD Magazine parody come to life. There are the occasional misfires, but unlike many other spoof film imitators, this one contains far more hits. The deadpan acting is genius and everything else fits into place, resulting in what may arguably be one of the absolute funniest films ever conceived and put on the big screen. And if you decide to watch the movie, don't blink - you might miss a gag or two. The \"Police Academies\" will come and go but \"Airplane!\" will never be forgotten.","user":"MovieAddict2016","rank":[245,285]},{"title":"Still hilarious and fresh decades later","rating":28,"date":"28 November 2001","review":"War pilot Ted Striker boards a flight for the first time since the war in order to stop his relationship with stewardess Elaine breaking up. Unfortunately the fish meal on the flight is bad and causes the crew to go sick leaving the plane on automatic pilot.  With Striker the only man on board who can land the plane can he overcome his fears of failure stemming from the war? This without a doubt one of the best comedies of cinema, it is far and away the best spoof ever made - and it was made when this type of humour was still fresh.  From the opening moments right down to the closing credits this is hilarious.  The plot is a straight spoof of 1970's Airport disaster movies, and is only an excuse for a range of jokes.  However the plot is bang on - it's detailed enough that it could be a serious disaster movie and allows the film to poke fun directly at the disasters movies themselves. The cast are perfect.  For Robert Hays and Julie Hagerty this represents the best things they've ever done.  Both play the straight men for the majority and are relied upon to take it all seriously and drive the plot while jokes occur all round them, that said they deliver many themselves but always straight faced.  Nielsen and Bridges are also spot on as stereotypical doctor and traffic control guy who \"chose the wrong day to give up drinking\"!  They are both so straight faced that they make the whole thing seem even more silly. Robert Stack is excellent as the man brought in to talk the plane down, playing the butch masculine figure ignoring all the madness around him.  Also on the ground, Stephen Stucker is great as the camp controller who delivers many brilliant one liners as he walks through scenes.  Peter Graves and Kareen Abdul Jabbar are great as two of the pilots that almost are in a different movie the things they say! The film is a spot on spoof of disaster movies, making fun of the many clichés of the genre - the nuns on board, the sick child, the \"only man who can land the plane\", the poisoned food etc.  But it does more than just poke fun at these - it is hilarious in it's own right.  All the cast deliver their lines brilliantly and the script! The script is excellent - I'm not going to start listing lines but they come so thick and fast that you usually miss something because you're laughing at the last joke.<br><br>This is the mould for all spoofs - this is the one to beat.  While many spoofs are hit and miss this is almost a total hit.  Decades on and many viewings later this is still as fresh and as funny as it ever was.  A brilliant, brilliant comedy!","user":"bob the moo","rank":[124,143]},{"title":"We have clearance, Clarence....","rating":10,"date":"15 August 1999","review":"It is my understanding that there are still a few people in the world that haven't seen \"Airplane!\" yet.<br><br>Those people probably are still waiting for electricity, indoor plumbing and all the other great advances in humanity, too.<br><br>To see \"Airplane!\" is to take part in the great move to subvert all self-importance in movies, which this film does with great relish (and plenty of corn).  <br><br>You get a chance to see such \"serious\" actors as Peter Graves, Lloyd Bridges, Robert Stack and Leslie Nielsen subvert themselves and their own personnae into near oblivion thanks to the writing/directing team of Zucker, Abrahams and Zucker.  Not to mention visual and verbal send-ups of darn near every movie that ever took place in the air, and a few that didn't, but should have.  <br><br>Kudos to Leslie Nielsen, who with this movie gave himself the greatest reinvention of any actor this century.  At one time, he was the very model of stoic sensibility.<br><br>I swear.  Seriously.<br><br>A looooong time ago.<br><br>Ten stars.  A laugh riot.<br><br>And I STILL think this would make a great in-flight movie.","user":"Mister-6","rank":[189,223]}]