[{"title":"\"You know I'm hung up on you.\"","rating":23,"date":"23 October 2003","review":"Yes, HAIR came out in the late 70's. But please don't call it a \"disco-era\" musical; there isn't a single thing in it that would suggest any detraction from its 1968 period. Judge it on its own merit; too often, a movie is compared to its stage roots and is inevitably crucified. As it is, the film plays out like one long, fantasy trip (whether that trip is substance-enhanced or not is your call)- starting with the \"Aquarius\" sequence and continuing on to the marvelous set pieces for \"Manchester England,\" \"Ain't Got No,\" \"I Got Life,\" and best of all, the \"Electric Blues\"/\"Hare Krishna\" fantasy which shows lovers John Savage and Beverly D'Angelo literally flying through their own wedding ceremony. (BTW, the woman singing \"Aquarius\" in the film's opening is not Melba Moore, but Ren Woods- a wonderful singer-actress seen a lot on TV in the 70's, and star of the Los Angeles production of \"The Wiz.\") The opening Twyla Tharp corps-de-ballet shot right on the Central Park grounds- with Woods' solo in a dizzying 360 camera pan- is an awesome start to a rock-infested musical. Ms. Moore (who performed in the original Broadway HAIR) appears later in the film singing \"3-5-0-0\" with Ronnie Dyson in the war protest scene shot in Washington, DC. And there are moments- like the \"Walking In Space\" basic training sequence or the simple close-up on Cheryl Barnes's torch solo \"Easy To Be Hard-\" which are just plain astonishing.","user":"movibuf1962","rank":[52,60]},{"title":"A sketchy Broadway musical becomes an amazing screen musical","rating":9,"date":"13 January 2006","review":"The 1979 film musical of HAIR was loosely based on the infamous 1960's Broadway musical that became famous because of its infamous nude scene. The stage musical isn't really much more than a group of skits strung together with some amusing musical numbers; however for the film director Milos Foreman (who won an Oscar for directing ONE FLEW OVER THE CUCKOO'S NEST) and the writers have taken the basic premise of the play and the score and constructed a real story to make the show more \"user friendly\" for the big screen. In the film, naive farm boy Claude Hooper Buchowski (John Savage) is about to go into the army and decides to spend a couple of days in New York where he meets a group of aging hippies (Treat Williams, Dorsey Wright, Annie Golden, Don Dacus)who get him involved in a group of nutty misadventures, including the pursuit of a snooty society girl (Beverly D'Angelo). The story divides into a series of vignettes that range from the ridiculous to the sublime, but it is all gorgeously photographed with a clever use of NYC locations and imaginatively staged musical numbers (outstandingly choreographed by the legendary Twyla Tharp). Treat Williams lights up the screen as Berger, the unconventional and free-spirited hippie who does his best to get Claude to loosen up and is matched scene for scene by Savage as Claude, who brings a lovely sweetness to the role of Claude. Annie Golden is a charmer as Jeannie, the pregnant hippie who is pregnant by Wright or Dacus, doesn't know which one is the father and doesn't seem to care. There is one outstanding musical number after another here...\"Aquarius\" is a tour through Central Park which includes dancing horses...Treat Williams disrupts a fancy dinner party in \"I Got Life\"...\"Black Boys/White Boys\" features the late Nell Carter and Ellen Foley extolling the ethnic virtues of men and \"Easy to be Hard\" is a powerful rendering of one of the best songs in the show by original cast member Cheryl Barnes, who plays Wright's ex-girlfriend and mother of his child. This is a beautifully photographed, well-acted sung, and danced psychedelic acid trip of a movie that must be seen and once seen, will initiate multiple viewings as this dazzler has to much to offer to catch it all in one showing.","user":"ijonesiii","rank":[47,54]},{"title":"A classic musical!","rating":10,"date":"10 November 2004","review":"Now more than ever we need Peace &amp; Love in this world!<br><br>This film really showcases the wonderful music of the Broadway show, and the fabulous Choreography of the legendary Twila Tharp! I saw it again after many years, and it still holds up well.<br><br>Thank you, MGM/UA for putting this on DVD! I love the option of seeing in Widescreen. MGM rocks for doing this on many of their DVD releases.<br><br>Ya gotta love Treat Williams as Berger and John Savage as Claude. They couldn't have picked better actors &amp; actresses for this film! Beverly D'Angelo is such a 'hot mama' in this film--I had forgotten just how hot! WOW!<br><br>The supporting cast is absolutely great,<br><br>with the late great Nell Carter making a singing cameo in a couple of scenes, as well as the kooky Charlotte Ray (Mrs. Garrett on 'Facts Of Life')<br><br>The story gets a little weak toward the end, but the anti-war sentiment of the late 60's still holds up, and is relevant today. <br><br>It's beautifully filmed (quite a bit on location) and is so colorful and lovely and really brings the spirit of 1968 back on the big screen.<br><br>I saw this movie when it was released in 1979 when I was 15, and was moved by it then, and it still moves me now at 40. Some other reviews on here say they think it should have been made sooner--I don't think Hollywood was ready to make such a movie back in the late 60's-early 70's.<br><br>The Vietnam War ended in 1975, and the whole thing hit a little too close to home, I think for this story to be filmed before it was (like in 1969, 70, 71)<br><br>Bravo to Director Milos Foreman! I love this film!!!!!!!<br><br>It's nice to see it again, this time on DVD. It never looked better!","user":"stalzz64","rank":[65,78]}]