[{"title":"Goofy fun.","rating":7,"date":"7 February 2002","review":"I saw this film in the early eighties, so my memory of the plot details is pretty hazy. I do recall, however that the clones mentioned in the title not only didn't look very much like Bruce Lee, they didn't look like each other! Also, there was an army of overweight men in diapers who were covered with metallic paint and were supposed to be made out of bronze. Whenever these guys would get kicked or punched a metallic \"bong\" was heard on the soundtrack to enhance the illusion. The only problem that the effect was ruined by the way their flesh jiggled on impact. I went to a lot of lousy films in those days, but this one got by far the worst audience reaction of all of them(although the place was nearly full!). If they were dumb enough to think a film with a title like this would be good, they deserved to be disappointed. Personally, at the time I thought it was a lot of goofy fun.","user":"Sum Flounder","rank":[5,6]},{"title":"Bruceploitation at its finest","rating":7,"date":"17 January 2004","review":"HA HA HA!!!  Man, I wish they could move that gas mask or take those 70s shades off.  Is that Bruce Lee times three?<br><br> This movie definitely was shoddily done, but the dubbing is kooky and the story is hilarious.  At times, I think there were four Bruces.  There is so much to say during the beach scene seeing two Bruce wannabes sporting speedos and one of them warning him to stay away from the naked babes on the beach and that they'll \"eat you alive\".  WHY are they avoiding the women? Of course, throw in gratuitous nudity to attract attention.  The kung fu isn't up to Shaw Bros. level, but it's decent.  Dragon Lee is the best one as Bruce number one and swipes at his nose so often, you'd think he did lines in between takes.  The scientist guy is played by guy who was head boss (\"What I like, I get.  And I want that restaurant!!!) in Way of the Dragon.  Head Ham award gose to the evil drug lord who you have to credit him for being a big thinker.  Not only does he want to be top drug lord, but be impressed by his \"We will rule the world\" speech.<br><br> This is far from being good in quality, but a lot of fights, very kooky premise, and high in kampiness value makes Clones a fun one to watch.","user":"InzyWimzy","rank":[6,8]},{"title":"Creepy & Surreal Exploitation","rating":7,"date":"28 February 2020","review":"Most of the \"Bruceploitation\" titles are pretty awful, (\"Challenge of the Tiger\") while some are genuinely fun, eye popping entertainment, (\"Bruce's Deadly Fingers\"). Then there is something like THIS,a movie which is just so bizarre that it's hard to believe your eyes. 40 years ago the subject of cloning was pure fantasy, something only seen in movies. Today, with cloning being a reality, this film takes on a whole new meaning, and although it's silly in it's execution, the basic ideas behind it are weird and fascinating. A power-hungry scientist extracts some blood from a recently deceased Bruce Lee, and uses it to produce 3 clones of Lee, that he further dehumanizes by naming them simply 1, 2, and 3. The clones don't have much personality and that makes them creepy. They are trained to be killing machines, as their martial arts skills are honed and shaped to be as good as the Master Lee. Of course this doctor does not have good intentions with his plan, and in the end he sadistically orders the three clones to basically beat each other to death. The only thing that can stop this is the two beautiful nurses who have been there from the beginning, and have developed real emotions towards the guys. And that's easy to understand when the guys are Bruce Le, Dragon Lee and Bruce Lai, three of the most popular of the Bruce lookalikes. Featuring the expected over the top fight sequences, a fantastic retro soundtrack and handsome widescreen photography, and most important, a script that is interesting and very unique. I think these movies have more value now than they did 40 years ago, as historical documents of an era that is sadly gone. Those who are tired of bloated, CGI, Politically Correct Hollywood nonsense, will most likely love this movie.","user":"Falconeer","rank":[2,2]}]