[{"title":"Surprising and moving","rating":18,"date":"18 October 2005","review":"I saw this for the first time last night on Channel 4. I've never sought out the film before because I assumed that it would be an uninvolved telling of an uninteresting piece of British history. I was wrong.<br><br>The piece works on several levels, as they say. First, the period evocation is excellent. I became interested in this era after reading an interesting book on slum landlord Peter Rachmann a few years back (he is a minor character here). Christine Keeler was a figure who inhabited both the pot and ska parties of London's impoverished immigrant community and the bedrooms of the most powerful men in the land, and this breadth and contrast gives the film sufficient scope to successfully capture the energy and feel of the time.<br><br>Second, the handling of character development is exemplary. The film surprises you by gradually shading in the relationship between Keeler and Stephen Ward, until their completely believable 'love affair' becomes the focus in the moving finale. Joanne Whalley and John Hurt are both exceptional as Keeler and Ward, turning in subtle and detailed performances. These characters are contradictory and ambiguous, the kind of complex human beings who could quite easily be reduced to type by lesser actors.<br><br>Third, the film is made with real heart and intelligence. It is sympathetic to its characters and it strives to understand them, and thus help us to understand them. The director, Michael Caton-Jones frames and cuts with brilliant understatement, making potent and witty use of contemporary music throughout. I really didn't expect the seamless technique and low-key accretion of detail employed here, and it kept me fascinated.<br><br>The tone of the picture is just right. A kind of compassionate sadness. We come to feel the real injustice of the moral and social hypocrisy bought to bear without being assaulted by it, and as noted before, the ending is powerful and affecting. It would appear that tabloid scumbags were as pernicious an influence then as they are now, and the observations thereon are as relevant as ever.<br><br>If I had to find fault with the film, it would be this: Ian McKellen models perhaps the least convincing bald pate in the history of cinema as John Profumo. So much so, that, for me, it impacts negatively on his otherwise notable performance. Its a minor flaw all told.<br><br>I was surprised. I was impressed. I was moved. If you happen upon the film, sit down and watch it. You will be rewarded.","user":"LewisJForce","rank":[44,49]},{"title":"Much ado about nothing, well done","rating":9,"date":"22 October 2005","review":"Viewed from the 21st century, the Profumo affair seems much ado about nothing, a sex scandal of an altogether more innocent age. Put to one side the marginal security issues, and all that is left is a bit of bad behaviour among the aristocracy, and to be frank, if you choose not to shoot these people, you can't really expect for anything more. It did leave one serious casualty, however: Stephen Ward, procurer of girls to the upper classes, who committed suicide after being abandoned by his friends when the going got tough. 'Scandal' tells his story, and manages to be reasonably sympathetic to Ward, Christine Keeler (the girl who slept with Profumo) and even (to some extent) the minister, although the facts don't quite seem to support the continuing strength of the bond between Ward and Keeler as depicted. The portrait of the early 1960s is well judged (without the film ever feeling overly historical), and there are interesting insights into the semi-professional sexual relationships between the smart set and the girls on the make they adopted. But the best thing about 'Scandal' is really the acting. A distinguished array of British character actors perform their turns impeccably; and Joanne Whalley, while never quite looking eighteen, is a dead ringer for Keeler and always nice to look at. But in his own way, John Hurt (who plays Ward) is also great to look at, in his case because of his straightforward excellence as an actor. In his hands, Ward is an essentially mediocre man; and yet charming, far from wicked and ultimately tragic. In some senses, the whole affair provided a template for the subsequent portrayal of the private lives of politicians by the press, to the extent that today it would hardly make the waves that it did at the time. But this film goes far beyond historical reconstruction, and is well worth watching in spite of the relative triviality of the events is portrays.","user":"paul2001sw-1","rank":[26,29]},{"title":"Turgid but clever","rating":6,"date":"25 October 2001","review":"This is one of the better contemporary fictionalizations of historical events, though it suffers from lack of exposition.  Here's the history that you need to follow events: John Profumo, England's Minister of Defence (equivalent to the US Defense Secretary) was introduced to party girls (like Christine Keeler) by popular osteopath Stephen Ward.  But unlike some upper-crust friends of Ward, Profumo had more to lose.  When it got out that Keeler had dated a Soviet Navy attache at about the same time as she dated the married Profumo, British tabloids had a field day noting that there were national security concerns atop the infidelity problem.  One reason folks in the US have difficulty with this issue is that the story was overshadowed in the States by the almost simultaneous Cuban Missle Crisis. <br><br>   The great soundtrack's now been out on CD for a few years; the theme was produced by the Pet Shop Boys and sung by authentic 60's icon Dusty Springfield.  All other songs chosen charted during the early 60's, giving the film the ring of authenticity.  And due possibly to legal problems, the original performance of Chubby Checker's THE TWIST couldn't be used, so Checker re-recorded it for this film.  This newer, punchy 1989 version is the one used today behind Pantene shampoo commercials.","user":"occupant-1","rank":[16,20]}]