[{"title":"A strange and amazing film","rating":9,"date":"19 December 2002","review":"Like most Fassbinder films, it's seemingly simple, but there's a lot too it when you walk a bit closer. This one sets up a great tragicomic situation: a disabled teenager manipulates her parents each to bring their lover to their summer mansion for the weekend. When the father arrives with his lover (Anna Karina, in a very quiet role), he finds his wife pinned to the floor by her boy toy. A bit later the daughter arrives with her caretaker (and possibly her lover?) who is deaf and mute. Mrs. Kast and her blonde son, Gabriel, take care of the mansion, cook, and so forth. Kast is played by Brigitte Mira, who was so wonderful two years earlier in Fassbinder's Fear Eats the Soul. She's a lot more cruel in this one.<br><br>With the situation as it is, their true characters quickly rise to the surface. The parents get the most time; father is loving in his way, but his love is probably only a result of the guilty feelings he has towards his daughter. Mother, on the other hand, is quite the psycho. At one point, as she sees her daughter lumbering along on her crutches from a second story window, she picks up a pistol and aims it at her daughter's back. She uses no euphemisms: her daughter, she believes, has ruined her life.<br><br>\nFassbinder's direction is exquisite. His framing is so complex, but it's invented to look simple. The simple set might be called stagey by those who are not paying enough attention. When the four lovers meet, Fassbinder circles the camera around them as they pace around each other, creating a dizzying dance. Peer Raben's gorgeous and unique music also should be pointed out.<br><br>Not everything works out perfectly. The titular game is an interesting idea to do on film. The eight characters split into two groups, the first picks a person in the house and the second has to guess after they've asked a certain number of questions. I think Fassbinder has a difficult time making the questions and answers meaningful for the film as a whole. These exchanges get a little ponderous as a result, and the only thing that keeps the sequence alive is Raben's score. Like I said, it was quite a daring thing to do, so the fact that it doesn't work out perfectly doesn't harm the film too much. 9/10.","user":"zetes","rank":[46,49]},{"title":"A Man That Looks On Glass","rating":10,"date":"10 October 2004","review":"A family of rich industrialists has one child - a teenage daughter crippled by some disease she caught 11 years before (probably Muscular Dystrophy). She has every luxury imaginable, and her parents are superficially polite to her - but underneath, they despise her. Her mother, especially, hates her enough to kill her; yet she maintains the appearances of a caring parent.<br><br>Both parents have adulterous affairs going - ever since the daughter Angela became crippled by her illness, as the girl sweetly informs us. They both go off to their country chateau at different times on various pretexts, and turn a blind eye to what the other spouse is probably doing. Angela is left in a glittering emotional desert, a gilded cage; her only source of companionship is her mute governess/nanny, a pleasant young lady with a mischievous smile.<br><br>Angela has grown to be as elegant and cruel as the people around her, although we can sympathies because we see that there was no way she could learn better behaviour - I like to compare her to Catherine Sloper at the end of The Heiress (1949). She arranges matters so that both her parents book the chateau for the same weekend; so one adulterous couple surprises the other \"in flagrante delicto\". Being civilised people, they laugh it off and sit down to dinner, determined to enjoy the weekend as a party - but then Angela and the governess turn up. Angela is the most perfect portrayal of a \"yuppie b*tch\", but we can still feel for her. (At one point she asks the caretaker's son, \"Would you be able to love a cripple\", and his silence tells us all we need to know.<br><br>After she has installed herself at the chateau, she drags herself around the hallways opening various bedroom doors and peering maliciously at the adulterous couples inside; they stare back in unhappy resentment. Later the couples propose to relieve their boredom by some game, so the mother comes up with a bright idea: target shooting! She forthwith aims a pistol out at the courtyard where her daughter is hobbling along; it takes the \"other woman\" to gently restrain her by holding her hand.<br><br>Later, at supper, Angela proposes that they should play her favourite game, \"Chinese Roulette\", in which one group tries to guess the identity of some individual selected by the other group, by means of indirect questions. The questions become increasingly ruthless and cutting; it becomes apparent that this game is as fiendish as Chinese torture and as deadly as Russian roulette, though it uses words instead of bullets. I don't believe in spoilers, so I won't tell you how it ends.<br><br>The photography in this movie is absolutely stunning; many of the scenes are shot through (or reflected in) glass, suggesting the glittering falsehood and superficiality of these people's lives. The colour composition is exquisite, words cannot really describe it. The slow movements of the characters are choreographed almost like ballet. The spooky music is just used at intervals making this feel like a horror movie (which it really is). Fans of \"evil child\" movies should check out this one, which raises everything to the max.<br><br>The director, R. W. Fassbinder, said that he wanted to portray what happens when parents fail to love their children. RWF has a reputation for making art movies with obscure meanings, but this isn't one of them - it's a very rewarding experience, I urge everyone to see it. Everyone is entitled to make the odd clunker, and the guy hit the mark more often than not.","user":"Prof_Lostiswitz","rank":[19,28]},{"title":"Intense","rating":4,"date":"4 June 2003","review":"This film is intense. I found it quite entertaining as a psychological thriller. You wonder how far will these people go into the game. Will anyone break? Will the violence become physical? It kept my interest to the very ending, which was a good one.","user":"m67165","rank":[17,27]}]