[{"title":"Raw, brilliant crime thriller","rating":21,"date":"21 January 2004","review":"When Friedkin went \"back on the streets\" in 1985 to make TO LIVE AND DIE IN L.A., he made a classic that will endure and that perfectly captures its 80's milieu.<br><br>I don't understand these idiots who complain how a film is \"dated\" by its music. Of course a film is \"dated\" by its specific elements, but so what. This superb film, which has an amazingly kinetic Wang Cheung score, is about a time (the mid-eighties) and place (L.A.) that is now history, and it is a punishing document.<br><br>The film works on many levels. Yes, it is about counterfeiting and superficial (re: counterfeit) relationships. It is about greed, survival, justice and morality. It is also about human beings using and laying to waste other human beings. <br><br>These powerful ingredients weave their way through a police procedural/action thriller plot that never stops to catch its breath and is pure cinema.<br><br>Willem Dafoe is totally engrossing as the film's villain, while William Peterson delivers a highly focused, tough turn. Dean Stockwell is also a stand-out as a crook lawyer and real cop Jack Hoar is quietly spectacular as Dafoe's mule.<br><br>And the film boasts one unbelievable car chase that has not been equaled since.<br><br>But LIVE AND DIE is also a film that expertly marries the visual to the aural and depicts a part of Southern California that has not been so credibly depicted before.<br><br>Dynamite!","user":"fertilecelluloid","rank":[144,156]},{"title":"a litmus test - possible spoilers","rating":9,"date":"23 August 2004","review":"David Mamet once explained the difference between art and entertainment. Entertainment, he said, reinforces what you already know, and tells you that you're right. Art, on the other hand, suggests that what you know is wrong, and that your beliefs might not be correct.<br><br>In \"To Live and Die in L.A.\", director William Friedkin inverts, twists, and eventually demolishes the standard \"Cop seeks vengeance for his partner's murder (with 3 days til retirement!)\" formula. The viewer learns that 1) not every law enforcement agent always has the public good in mind, 2) real people generally aren't either 'good' or 'evil' all the time, 3) if a cop (or in this case, Secret Service agent) takes the law into his own hands, he WILL pay for it one way or another, and 4) whether you're a cop or a criminal, things usually don't go according to plan.<br><br>This information is directly opposed to what we've learned from countless action movies of the 1980s. Watching the \"Lethal Weapon\" movies, or anything with Schwarznegger, Stallone or Seagal, suggests that it's fun and entertaining when cops take the law into their own hands. Notice that no matter how much damage Riggs &amp; Murtaugh cause, they can laugh about it with the captain later, and the world is always a better place for it. And no matter how many people's civil rights are trampled, and no matter how illegal the cops' activities are, everything always works out in the end, and the only people who get hurt are the \"bad\" people.<br><br>\"To Live and Die in L.A.\" shows what would happen if Riggs &amp; Murtaugh tried their antics in the real world. While Martin Riggs' arrogant recklessness is heroic and hilarious, Richard Chance's arrogant recklessness ruins a lot of lives, not least his own. When it's over, justice has hardly been served, and even though the bad guys are dead, there's no hint that L.A. is a better place for it.<br><br>With all these \"Lethal Weapon\" comparisons, I should make it clear that \"To Live and Die in L.A.\" came out in 1985, two years before the first LW movie.<br><br>All that stuff aside, this is one rock-solid movie. Willem Dafoe uses his character's eccentricities to create (for my money) one of the best villains in cinematic history, even if the movie doesn't see Rick Masters quite that way. William Peterson is incredible and brings a lot of depth to his performance; I'm not one to critique someone else's opinion, but I don't understand the users who complained that he's \"wooden.\" Chance is an egomaniacal, scheming nutjob with a death wish; he really believes that he's above life and death, and it never crosses his mind that he might be wrong. Peterson brings this all out.<br><br>Dean Stockwell is in his element, playing a scumbag who knows everything about everyone. John Pankow was a wonderful surprise, bringing all sorts of conflicting and confused ideas to Vukovich, which is perfectly appropriate. When things really go wrong, he goes to pieces. Again, some users complained that he was overacting, but ask yourself how YOU'D behave. Nobody ever gives Darlanne Fleugel much credit, but she's terrific here. There's a whole lot going on in Ruth's head, and in many ways, she's the central character to this whole play. Pay attention. And I'd be remiss in my duties if I didn't point out Steve James and Jack Hoar as two of Masters' criminal associates. They're both tough, intimidating, and surprisingly multi-dimensional.<br><br>And I haven't even mentioned 1) the car chase to end all car chases, 2) the copious amount of nudity, 3) the perfect fit of Wang Chung's soundtrack with the day-glo L.A. look, even as all hell breaks loose and men confront the dark depths of their souls (huh?), and 4) a climactic shock that WILL knock you for a loop.","user":"ThingyBlahBlah3","rank":[75,81]},{"title":"Shamefully misunderstood by the critics","rating":10,"date":"29 April 1999","review":"One of the very best films of the 1980s this was shamefully neglected and misunderstood by the critics.  The problem is: on the surface it's just like an ordinary action crime thriller (and thus won't appeal to the arthouse crowd), except that it makes it difficult to identify yourself with any of the characters.  In other words: it violates its genre rules.  But this very fact makes it so unpredictable and thrilling, and a proper movie as opposed to a mere genre clone.<br><br>The good guys are flawed.  This isn't really new, since the mid 1960s there were plenty of flawed heroes in Westerns or police thrillers.  The difference is that not only their characters are flawed, they are vulnerable, destructible, they make mistakes.  And they pay for their mistakes.  Similarly the villains: yes, they are formidable and glamorous, but they are not in the league of the Blofelds or Sentenzas of moviedom. They make mistakes too.  And they pay too.<br><br>A surprising asset is the film music by Wang Chung, a one-hit-wonder pop obscurity of the era.  Their sound perfectly melts with the cinematography, especially in the stylish opening sequence.","user":"SMK-4","rank":[172,202]}]