[{"title":"I really enjoyed it","rating":8,"date":"26 January 2020","review":"The plot is pretty interesting, it kept me in suspense for the entire film. It's essentially sweet tale that could turn tragic at any moment. All I really knew about this going in was that it was an inspiration for Moonrise Kingdom by Wes Anderson, though it's similar it's not all you think about while watching this.<br><br>It's a very good period peice as well, it never feels like people are from our current times pretending to be from the 1700's. Everything has a very authentic dirtiness to it, even the mansion of the rich family has a door with heavy wear marks on the handle. Its extremely real feeling.<br><br>The child acting as well in this film is so good you forget they're child actors. It's really mind blowing the acting level of everyone is equal theres no dumb and corny kid acting, it's very mature for such a young age.<br><br>If you're wondering whether or not you should watch it I'd say go for it. I really have to admit I'm suprised this film doesnt get more praise, it's very good.","user":"rambobarbieisba","rank":[3,3]},{"title":"Something of an oddity in Loach's oeuvre","rating":31,"date":"31 August 2019","review":"Black Jack has the trappings of a classic kids' adventure yarn - a boy falls in with an escaped convict and embarks on an eventful odyssey including a spell with a traveling fair, a girl who escapes an intended fate in the madhouse, multiple blackmails and a mysterious death. It's certainly something of an oddity in Ken Loach's oeuvre, and the director apparently views it as a disappointment, hampered by budgetary and other production constraints. But the film's sparseness, the sense of not being quite fully formed and articulated, actually constitutes its main appeal - there's something perversely enjoyable about how the basic exposition has to fight against thick accents and mushy articulation (it feels just about perfectly cast, exactly because of the imperfections of its people). The film avoids scenic overkill while sustaining a grubbily painterly quality, and the attention to detail is impressive: I don't recall ever seeing a period film where the clothes are so authentically frayed and worn. By Loach's standards, the film isn't particularly explicit perhaps in diagnosing the surrounding society, but that makes a point in itself: for example, about the looseness of governing structures that allow a girl's liberty to be signed away on the whim of her parents (on the other hand, it does establish that a strong-willed teenage boy can accomplish a lot, for good or for bad). This leads to an unusual climax in which the truth about that mysterious death is discovered, but without any apparent thought that the perpetrator might be brought to justice. The film delivers a traditional flourish at the end, with boy and girl escaping off to sea (by that point, the eponymous Black Jack has long ceased to be at the heart of the narrative), but overall its stubborn integrity places it with Jacques Demy's The Pied Piper among the stranger supposedly child-friendly creations.","user":"philosopherjack","rank":[1,1]},{"title":"Can anyone believe it?","rating":3,"date":"30 November 2016","review":"We all know that in the years that the film is represented, people grew very fast and soon they had to be older. But in this movie is too. Apart from the headline this confused and leads you to expect things that do not happen. The whole movie I've been thinking that if they really thought we'd believe the script.<br><br>Spoiler: <br><br>It must be the dubbing, which is very bad, to the fullest of evils. But I'm sorry, I do not believe any characters except Louise Cooper, yes. But of course he could not be less and puts a few dialogues at times like when he tells Stephen Hirst that he wants nobody to believe them.<br><br>Does anyone believe the bribe sequences? Knowing above that at that time, a child would have been given two cakes and would have been thrown out of the house. When he comes back and asks for money and they bargain and give it to him. Only I have told myself, and you give it to him? And when he catches the house after killing the father. Does it help you? I must be very weird but I find the whole script incredible.<br><br>Why is the title so named? If it is a secondary role that does not paint anything. And it presents him as if it were to be very important. Of course, anyone would have jumped to see the dead rise. The boy does not clear, why? And it turns out that the boy paints us very responsible, but leaves his job and goes with the resurrected, well.<br><br>It turns out that the child who is proving to be very successful, but that yes, when he goes to look for the girl to the asylum, does not try and enter in any way, is going and will return, I do not understand.<br><br>I do not like photography, as is normal in Ken Loach, who always does it as if it were a video camera, as if it were a fake documentary. That's if there are false documentaries that go photograph have. And let's not say the address. He is a specialist director putting the camera a hundred meters from the action and leaving everything to the free choice of actors. I guess he thought that's the way to go. At least if there is something good, make-up, hairdresser and wardrobe.<br><br>Anyway during the whole movie I wondered if this movie was seriously shot or if they were laughing at all","user":"Andres-Camara","rank":[1,9]}]