[{"title":"Some thoughts and reflections on the film, from an incredibly poor quality print","rating":6,"date":"6 August 2008","review":"INTRODUCTION: The version of this film that I saw was seemingly sourced from incredibly poor-quality video cassette with burnt-in subtitles. I'm not sure if this was the intention of Godard and Gorin, but regardless, I feel that certain elements of the film may have been lost as a result of the poor image quality. The entire film seems to be submerged in a dull, red tint (almost rust-like in appearance) with many of the scenes under-exposed to the point of almost total darkness. Likewise, the film is framed in such a way as to limit the amount of on-screen information conveyed, making the compositions vague and hard to decipher. PRESENTATION (1): Being somewhat familiar with Godard's work, both pre-1968 and post-1980, I recognise certain stylistic traits and his use of largely deconstructive elements that conspire against the audience - making the process of viewing as difficult as possible without losing sight of the original intent - but even then, I wonder whether or not the particular devises used here are an invention of the filmmakers, or simply a result of the poor quality print.<br><br>BACKGROUND: Vladimir and Rosa (1970) was one of many works produced by The Dziga Vertov Group between 1969 and 1971, continuing the collaboration between filmmakers Jean Luc Godard and Jean-Pierre Gorin from the earlier works, A Film Like Any Other (1968) and British Sounds (1979), and leading into the similarly progressive likes of Pravda (1970), Wind from the East (1970) and Struggles in Italy (1971). Afterwards, the duo would use their own names on the more widely seen satire Tout va bien (1972), before bringing the experiments to a close with the final Dziga Vertov film, Ici et ailleurs (1976). PRESENTATION (2): The first step in this was Godard's Le Gai Savoir (1969), which took the influence of Brecht in a direction later copied by Derek Jarman and Lars von Trier; with Godard faming the self-reflexive political discussions of Jean-Pierre Léaud and Juliet Berto against the plain black background of an empty television studio. Although the presentation was more radical than even Week End (1967), or preceding works like 2 or 3 Things I Know about Her (1967) and La Chinoise (1967), it was still very much a Godard film at heart; with the deliberate compositions and occasionally jarring appearance of those rich primary colours once again showing the director to be much more potent as an artist than as a political free-thinker.<br><br>DZIGA VERTOV: Like much of Godard's work from the mid 1960's on, Vladimir and Rosa is defiantly political. However, where the Dziga Vertov films differ from his own work, pre-Week End, is in the presentation of the content; with Godard ceasing to make political films and turning instead to film-making that was political! The difference here was in Godard's rejection of artistry; choosing to share all responsibilities with Gorin and forsaking on screen credits in favour of recognisable voice-over narration, whilst simultaneously striving to make the experience as jarring and (visually) ugly as humanly possible. Taking into consideration the quality of the tape that I saw, I will have to assume that Godard and Gorin didn't really intend for the images to be quite so dark and tinted. However, even if that were not the case, the majority of the images, particularly in the first half of the film, are fragmented completely beyond recognition; with that cut-up combination of images that seem part cinema and part documentary eventually leading to later projects, in which still photographs and archival footage were also used to argue a point.<br><br>THEME: The film could be thought of as both a political satire and a court-room thriller; with the Godard and Gorin using the background of the Chicago Eight trial and the sidelines into the plight of Bobby Seale and his connection to the Black Panther Party (eventually leading to the Chicago Seven) to create a work of highly provocative agitprop. The film dramatises certain elements leading up the arrest, including the background of the 1968 Democratic National Convention and the implication of police violence and intimidation leading to riots and angry protests. From here, the trial is documented in a way that is somewhat reminiscent of the visual approach of Le Gai Savoir, right down to the use of minimal production design with the barren black background of theatrical artificiality and the way that the characters speak directly to the camera in a completely deconstructive approach. PRESENTATION (3): There are also Godard's continual experiments with the juxtaposition of sound and images and the jarring use of editing and sound design; as well as some inventive visual compositions that draw our attention to the artificiality of the production and how the inherent falseness of it all relates to the issues expressed within the film.<br><br>POLITICS: The political subtext of the film is incredibly weighty here, with neither Godard nor Gorin pulling their punches in regards to the bombardment of information, both spoken and textual, that appears on screen. Naturally, its context is incredibly dated now, with the political climate and the background of the film having been confined to a brief moment of twentieth-century history that is no doubt of incredibly limited interest to the majority of contemporary viewers experiencing this work. As a result, Vladimir and Rosa will be a difficult, if not entirely hopeless film, for the vast majority of viewers at odds with Godard's style or the progressive attitudes of the Dziga Vertov Group. For me, as someone with a genuine admiration for Godard's style and approach, I would rate this as one of his most visually arresting works, definitely in need of a DVD restoration so that we can better appreciate the film on a purely cinematic level. It might not be an entertaining film in the traditional sense, but without question, this is a completely interesting work, that benefits from Godard's intelligent direction.","user":"ThreeSadTigers","rank":[22,23]}]