[{"title":"\"Every Samurai Longs To Be Master Of A Castle\"","rating":5,"date":"5 August 2000","review":"Washizu is a brave samurai who helps his lord to fight off a violent rebellion.  Washizu and his friend Miki are riding through Cobweb Forest when a spirit appears to them and makes predictions which fire their ambitions.  When Washizu explains this vision to his wife Asaji, she urges him to murder his lord and rule in his stead.  Thus the tragedy begins.<br><br>Kurosawa's interpretation of Macbeth is visually fascinating. Swirling mist, colossal trees dripping with rain, rich black volcanic soil and bulky fortress architecture provide the imposing, dread-laden backdrop against which the humans move in superbly stylized patterns.  The director chose to shoot the action on Mount Fuji precisely because of the volcanic soil - and even had truckloads brought to the studio for pickup shots.<br><br>Westerners unfamiliar with Noh are missing a huge part of the film's meaning.  This thousand-year-old theatrical tradition corresponds broadly to our Elizabethan Tragedy, and Kurosawa shows how the two cultural strains, eastern and western, interlock and interact.  The one illumines the other.<br><br>The Noh stage must have on it three pine branches and a symbolic Shinto temple-arch.  In the film, shots are carefully composed to include tangles of branches in the foreground, and the vast entrance gate of Washizu's fortress serves for the temple arch.  And yet Kurosawa is not including these details redundantly, for mere form's sake - the ubiquitous branches, framing the human action, remind us all the time of the forest nemesis awaiting Washizu.  The arch is Washizu's interface with the world - open in the early stages, but gradually less so as the protagonist retreats into his own diseased inner self.<br><br>A Noh play features a \"doer\" (Shite) and a \"companion\" (Waku) who plays a subordinate role.  Washizu and Asaji are the Shite and Waku respectively. Elements in the Noh include a battle-drama (we get one here) and a so-called \"wig drama\", in which a female character dominates the action.  This is the central portion of the film, in the quiet of the fortress quarters, when Asaji ruthlessly manipulates her husband's ambition.  Every Noh play has a ghost which appears to the Shite, and the spirit in the forest fulfils that function.  Noh plays are never original works, in that (by a venerable convention) they are re-workings of ancient legends.  Kurosawa follows tradition by quarrying his tale from Shakespeare's play.<br><br>There is no western term to describe the stylized striking of poses so important in Noh.  Our word \"dance\" is a crude word which approximates to, but does not convey, the grace of the Japanese art-form.  Asaji, alone with the blood-stain, gives us a glimpse of this delightful ritual.<br><br>Finally, Noh contains an aural richness almost totally absent from western tragedy - the complex rhythms of stamping and percussion which accompany the spoken word.  In the film, the rhythmic patterns of horses' hooves on soil, and Washizu's bare feet on the boards of the banquet hall, are meant to reinforce the mood as they creep into our emotions by subliminal insistence.<br><br>Isuzu Yamada is terrific as Asaji.  Her stillness absolutely oozes determination, contrasting strongly with her husband's hollow bluster.<br><br>\nIt seems that Kurosawa cherished the concept of a Noh Macbeth for some years before committing it to celluloid.  Apparently the project had to be scrapped in 1952 because Welles' Macbeth was nearing completion, and Kurosawa did not want the two films to suffer by being endlessly compared. This version, then, had to wait until 1957 to be realised.<br><br>The director is not afraid to add his own flourishes to the well-known story.  We hear of the notorious traitor Fujimaki who disembowelled himself in a room of the fortress.  The exact spot is now known as the Forbidden Room, a place of evil omen with its indelible bloodstain on the floor.  It is a symbol which encapsulates the spirit of the film, interweaving the related themes of treachery, blood and guilt.  In a brilliant transition, we are taken to a change of scene by the ripping down of a banner by galloping horsemen.  Washizu at the pinnacle of his arrogance is filmed from below with severe foreshortening, conveying his vainglory more effectively than words ever could.  The death scene, with its railing, hysterical protagonist and relentless volleys of arrows (their grouped shafts recalling the fateful forest) has enormous power and lives long in the viewer's memory.","user":"stryker-5","rank":[118,127]},{"title":"Best Shakespeare on Film","rating":10,"date":"22 January 2004","review":"As most people know, this is Shakespeare's Macbeth rendered by Kurosawa into Noh format for cinema. Not for nothing is Akira Kurosawa regarded as Japan's greatest director, for this is the best cinematic version of any Shakespeare play (and also one of Kurosawa's best films). Kurosawa had the advantage of working in a different language (Japanese), so he didn't have to agonize over the usual dilemma - whether to use Shakespeare's rotund oratory and blank verse (which is glorious, but goes badly on screen). Kurosawa essentially translates Shakespeare's poetry into visual images, while keeping dialogue to a minimum. He also had the good fortune of accessing two great cultures - European literature and Japanese visual art (he was originally a painter before entering cinema as a set-designer). There are many painterly images reminiscent of Ukiyo-e (e.g. Washizu full of arrows).<br><br>The Noh style of acting (like Kabuki, but more refined) seems stilted and exaggerated for the first few minutes; then you realize that is ideally suited to a story like this - more natural acting would seem out of place, as other Macbeth-movies go to prove. <br><br>The Japanese title of this film translates as \"Cobweb Castle\" (or Spider City) and this really should have been the title in English. The film is full of the notion of spiders spinning webs (and plots) in secret. It is worth noting that the witch (or \"monster\") is first seen with a ghostly spinning-wheel. This symbolizes the thread of fate, but also reflects the cobweb theme.<br><br>The story is sometimes slow-moving, but you have to realize that this is a story of insidious slow rot (hence the references to spiders and cobwebs). The decay is punctured by occasional bursts of violent action, as befits the story. The black-and-white picture adds to the creepiness, and the atmosphere is so thick that the movie works more effectively than \"Ran\" (Kurosawa's more polished Shakespeare-adaptation).<br><br>Macbeth is the great-granddaddy of the entire horror genre, and Kurosawa is a worthy descendant.","user":"Prof_Lostiswitz","rank":[98,113]},{"title":"Another haunting movie masterpiece from Kurosawa.","rating":8,"date":"8 July 2003","review":"In my opinion 'Throne Of Blood' is almost as brilliant as Kurosawa's more celebrated 'Rashomon'. It's almost impossible to fault this brilliant adaptation of Shakespeare's 'Macbeth'. It's the most compelling version of the story I have seen, even better than Polanski's outstanding film of the early 1970s, which until seeing 'Throne Of Blood' was my favourite. Kurosawa is without doubt one of the greatest film makers of all time, and watching this movie is experiencing a master at work. Toshiro Mifune gives another brilliant performance and Isuzu Yamada, who plays his wife (the equivalent of the Lady Macbeth character) is absolutely chilling. The stylized acting combined with the superb cinematography gives this movie a frightening nightmarish feel, yet the characters are always human. This makes it a very powerful and haunting movie. I don't seem to see 'Throne Of Blood' mentioned a lot as one of Kurosawa's best, but I was incredibly impressed by it, and it comes with my highest recommendation. This is a brilliant movie and to call it a masterpiece is no exaggeration.","user":"Infofreak","rank":[54,62]}]