[{"title":"Not Peter Cushing's worst movie","rating":27,"date":"27 September 2004","review":"I have read in one or two reviews stating that Peter Cushing says The Blood Beast Terror is the worst movie he ever appeared in. I disagree and I found this rather enjoyable.<br><br>A series of vampire like killings are the result of a woman who periodically turns into a giant dead head moth, mostly at night. A mad scientist has been doing experiments on her to make her do this. Detective Peter Cushing is assigned to the case and the woman is burnt to death at the end, in her moth form but gradually changes back as she burns.<br><br>The movie also stars Robert Flemyng and comedy star Roy Hudd.<br><br>Despite reading bad reviews, I rather enjoyed watching this movie. A treat for horror and sci fi fans.<br><br>Rating: 3 stars out of 5.","user":"chris_gaskin123","rank":[16,16]},{"title":"Mothman!","rating":18,"date":"18 July 2007","review":"OK, not one of the better offerings of British horror, that's true. But it does have Peter Cushing who is always fun to watch and I have to give credit for the writers to try to bring a somewhat more original monster to the screen than just another rehash in the Vampire or Frankenstein vein. Well, come to think of it aside from making the monster a moth ,this really is just another rehashed Vampire story with a few elements from the Frankenstein storyline thrown in for good measure. <br><br>I cannot help but wonder if the monster was inspired by the legend of the Mothman, the legendary beastie from West Virginia. The resemblance is pretty close. A man sized moth creature with red glowing eyes.<br><br>Shame more people have not seen this though, it's not as bad as its reputation. I find it pretty enjoyable.","user":"hellpepper","rank":[18,20]},{"title":"Worthwhile Gothic in the Hammer Mould","rating":7,"date":"12 June 2014","review":"THE BLOOD BEAST TERROR is an entertaining Gothic chiller in the Hammer fashion, albeit lacking the production values Hammer films are often fondly remembered for. Peter Cushing carries off the role of the film's hero--a detective on the case of a series of unorthodox and bloody murders that start off in London and move out in the countryside--with his usual charisma and professionalism, and he's ably supported by a number of solid co-stars, including Robert Flemyng (well-cast as a scientist with a dangerous secret)as well as the lovely and talented Wanda Ventham and Vanessa Howard. The script drifts into the doldrums now and then,and the comic relief isn't always well-conceived, but a rich atmosphere and a measure of unpredictability carry the film through. The eponymous \"Blood Beast\" is scary enough if you can make the necessary suspension of disbelief often called for in science fiction and horror films. The climax is fitting, if perhaps a bit perfunctory. A better overall production than its given credit for, and certainly superior to many horror films to have been released since.","user":"ksj870","rank":[11,13]}]