[{"title":"A treat for fans of Naval History","rating":29,"date":"29 March 2004","review":"Being a fan of British naval history, and also a fan of Anthony Hopkins, I love this film. I think it is severely under-rated. The acting (particularly by Hopkins) is superb, and the cinematography and realism are stunning.<br><br>Unlike some of the previous comments for this film I think it is pretty loyal to the true historical facts of the real mutiny. Alright, there are a few minor changes to fact, but nothing that radically alters the story. Basically Bligh was a very able and fair captain, who was let down by incompetent officers. Bligh was no more a monster than any other Royal Navy captains, the difference was other Royal Navy Captains had able commissioned officers and a squad of marines to back up their authority. Bligh was on his own, because the admiralty insisted on saving money on the bread-fruit expedition by giving Bligh a small ship and no officers. (All the officers on board were non-commissioned warrant officers, who were not employed by the Royal Navy but were in it for their own advancement, Blight was the only Royal Navy officer). This is what ultimately led to the mutiny. Bligh had no one he could rely on to back up his orders from the Admiralty. Bligh was actually an exponent of modern thinking, and treated his men with much more humanity than other Royal Navy Captains. He had learnt his trade from sailing under Captain Cook.<br><br>I think Hopkins manages to capture this in his performance. Bligh was a professional man, who grew increasingly frustrated by the incompetence and laziness of his officers. Hopkins manages to convey this sense of increasing irritation brilliantly. He felt particularly let down by Fletcher Christian, who was his friend and whom he had personally advanced up the ranks. He expected Fletcher to back up his orders, but Fletcher was more interested in his own pleasure with the Tahitian women.<br><br>On the journey out the crew were actually very happy and contented, but the trouble began when the crew began to experience the liberties and freedoms of Tahitian life, and they did not want to leave it. Bligh had to force the men to go back to their duty, and instead of having officers to back him up, the officers took the side of the men.<br><br>I think the script of this film captures the true story quite well. I saw the Clark Gable version of the story many years ago, and the only thing I remember is the portrayal of Bligh as an irrational monster, with none of the reasons behind his anger explained. In this version I feel Hopkins is more like the real Bligh. An able commander trying to carry out his orders, but let down by those around him.<br><br>The confrontation between Bligh and Christian in the captain's cabin the day before the mutiny is one of my favourite movie scenes of all time. Hopkins performance of the captain at the end of his patience is just outstanding. `Oh there are rumblings are there?'. Superb! <br><br>The only down side to this film is Mel Gibson. I can't stand the sight of him! Mind you, even he manages to pull of a good performance.<br><br>\nThe film ends quite abruptly, with a lot of loose ends. The most fascinating parts of the true story come after the end of the film. I guess the time constraints of the film mean they had to concentrate on just the story of the mutiny.<br><br>The mutineers set up a colony on Pitcairn, and ended up all murdering each other until only one survived (Jack Adams). Those that stayed on Tahiti were captured two years later by HMS Pandora which had been dispatched after Bligh got back to England. This ship rounded up about 16 mutineers, and on the way home the Pandora hit a reef off Australia and sunk. The crew had to make an open boat journey to Coupang, the same port that Bligh's life boat had arrived at two years earlier!! <br><br>Meanwhile Bligh was promoted and sent off on another Breadfruit exhibition to Tahiti, this time the Admiralty gave him commissioned officers and a squad of marines. This mission succeeded.<br><br>When the Breadfruit plants finally reached the slave colonies in the West Indies, the slaves refused to eat the fruit as they disliked the taste. That's irony for you!","user":"stevenwithers","rank":[122,134]},{"title":"Complex retelling of classic sea fable; Hopkins receates memorable role with superiority.","rating":23,"date":"23 February 1999","review":"I will admit, I thought I'd seen it all when I first saw Charles Laughton bring the snivelling and maniacal Captain Bligh to life. I was dead wrong. Anthony Hopkins, whom I place on the highest rank of accomplished actors, recreates the memorable role with incredible flair and complexity. He shows us not just an insane seaman bent on ultimate subordination, but a man with real concern for maintaining order, knowing the consequences of anything less. \"The Bounty\", yet another retelling of the classic tale, is actually an amazing recreation of the sea fable, pumped with real emotion and drama. The writers really understand the characters in this story, especially in Bligh's case, but also in Fletcher Christian's as well. Mel Gibson reigns over the role this time, still fresh from his Australian beginnings, and undoubtedly one of the best at perfecting the challenged and affected hero. I proudly rave this version of the famous mutiny, and probably will place this among 1984's best films. Rating: Three stars and a half.","user":"movieman9","rank":[58,65]},{"title":"Excellent performances from a great cast","rating":25,"date":"25 October 2004","review":"I have seen this film many time over the years and i never get bored of watching Sir Anthony Hopkins give a riveting performance in this classic story of life aboard The Bounty and the events that lead to mutiny. <br><br>Mel Gibson plays Fletcher Christian who must watch helplessly as his captain(Hopkins) demoralizes his men and drives them ever closer to the brink of mutiny. The tension builds throughout the film and in no small part to the excellent score. The disgruntled crew has many recognisable faces including Liam Neeson and Bernard Hill which makes the film all the more enjoyable. Daniel Day Lewis is particularly watchable as mr. frier, showing us a rather smug and sometimes fiery officer. The film is shot beautifully and the story is compelling. Even the script holds up in a film where the best performances come from the actors with the least to say.","user":"mostlygreek","rank":[50,57]}]