[{"title":"One Room Thriller","rating":7,"date":"19 July 2018","review":"I had forgotten that most if not all of it happens in one single room. The planning of it is a display of extraordinary craftsmanship. Not a lagging moment. I was riveted to the, let's face it, preposterous plot from beginning to end. Ray Milland is a credible monster in elegant and civilized clothing. Grace Kelly, a peach as the unfaithful wife who stays home to cut newspaper clippings of her husband's past glories. Yeah, right. Robert Cummings has always been a mystery to me. A popular leading man with a long career. He only exudes a campy, if lightweight vibe that almost works in comedies and when he's in a supporting role - My Geisha and What A Way To Go with Shirley MacLaine are good examples. Here as Grace Kelly's secret lover, I don't know what to say. John Williams. very funny again as the Scotland Yard inspector, the same character to a T he played in Midnight Lace with Doris Day or was it his twin brother? In any case, no Hitchcock fan can afford to miss this filmed play, filmed by one of the undisputed greats.","user":"dvkatzprod-74759","rank":[48,52]},{"title":"Tense and exciting.","rating":9,"date":"15 October 2006","review":"Tony Wendice (Ray Milland), an ex-tennis player, unhappily married to Margot (Grace Kelly), correctly guesses that she has been cheating, with Mark Halliday (Robert Cummings). Mark writes crime stories. Unbeknown to Margot and Mark, Tony knows about the affair, and wants to teach Margot a little lesson, by taking away the thing that is her life. But, being too guileful to do it himself, Wendice blackmails one of his old school friends into murdering her, and the essential thing to doing it is his latchkey.<br><br>Dial M for Murder succeeds on many levels, and it is largely thanks to some superb dialogue, written from a tricksy-yet-capable script that never gets too deep. The cast are a treat. Ray Milland is an absolute gem, extremely sly and dispassionate, yet a character so full of self-assurance that one almost sides with him. Grace Kelly completes her great year (she gave an Oscar-winning performance in The Country Girl and also starred in Rear Window) by emanating the poised, beautiful being, that is vulnerable, yet oddly unassailable. And it's weird in that even though she's cheating on her husband, you care for her a lot more than him (although that could do with the fact that he's trying to kill her...) And John Williams, as the police detective, is quite wonderful.<br><br>Alfred Hitchcock manipulates and enthrals his audience here like the master that he is. Each scene has a sense of direction, great pacing, and is staged realistically. Stunning full colour photography and a haunting, atmospheric score from Dimitri Tiomkin complete this great package. The ending, when it comes, feels a little too nice to be truly realistic, but that is my only major quibble with an otherwise highly entertaining, thrilling movie.","user":"PizzicatoFishCrouch","rank":[118,150]},{"title":"The perfect film for the perfect murder...","rating":9,"date":"21 February 2007","review":"After earning an Academy award nomination for her performance in John Ford's 1953 tale of romance and adventure, \"Mogambo\", the beautiful actress Grace Kelly proved that she was way more than just a pretty face and that there was real talent behind her image. However, what truly took her career to new levels were three now classic films she made directed by the legendary Master of Suspense, Alfred Hitchcock. Under his direction, Kelly made an integral part of the Master's films, becoming the perfect embodiment of Hitchcock's idea of a female protagonist. While Kelly debuted two years earlier in the classic Western \"High Noon\", one could say that it was Hitchcock who really introduced the beauty and talent of Grace Kelly to the world. \"Dial M for Murder\" was the first of Hitchcock's films with Kelly, and a movie where once again the Master returns to a familiar theme: the perfect murder.<br><br>The movie is the story of Tony Wendice (Ray Milland), a former tennis player married to the beautiful and wealthy Margot (Grace Kelly) and living in an nice apartment in London. Life is good for Tony, until he discovers that his wife is cheating on him with an old flame of her, famous crime novel writer Mark Halliday (Robert Cummings). After that discovery, Tony spends a whole years plotting the perfect way to murder his wife in order to inherit her money, carefully planning every detail of the crime. When Mark visits London again, Tony finds the perfect chance to set his plan in motion, and as planned, he recruits Charles Swann (Anthony Dawson) to kill his wife. However, bad luck and a sudden change of events will test Tony's plan's infallibility as, just as Mark points out, human action can originate flaws even in the most perfectly devised plan.<br><br>Like most Hitchcock's films, \"Dial M for Murder\" was an adaptation of another art-form, this time a popular play by Frederick Knott. As Knott was also the writer of the screenplay, the movie remains extremely faithful to the play, although of course, not without its differences. Knott's script is wonderfully constructed, as like in the play, the dialog is witty and simply captivating, with many twists and turns that spiced up the complex plot and keep it from being boring or tiresome. An interesting feature of the movie is that oddly, there are no black and white morality in the characters, and it's easy not only to sympathize with Margot (despite she being cheating on her husband) but also to sympathize with Tony (despite he wanting to kill his wife), as the characters are wonderfully developed with very detailed personalities.<br><br>It seems that Hitchcock's knows that the dialog is the highlight of the play, as he deliberately focuses on his actors and uses an elegant camera-work to frame the whole movie inside the apartment. The movie literally is shot entirely in one single room (only two other sets are used, and only briefly), but Hitchcock's classy way of using the camera allow a highly dynamic flow that never lets the movie be tiresome. This is also very helpful as Hitchcock just lets his characters keep speaking, carefully describing actions and events (when other directors would use flashbacks) in a similar way to a what the real play would be. While this approach could easily get boring, Hitchcock's use of colors and overall visual imagery simply creates the perfect medium to allow Knott's dialog to shine.<br><br>Without disrespecting John Ford or Fred Zinnemann, I think that it was Hitchcock who finally could allow Kelly's talent to shine beyond her physical beauty. Grace Kelly makes her character shine with her subtle and restrained performance, specially showing her skill in the second half of the film. While often Kelly receives top honors in this movie, it is actually Ray Milland who makes the whole movie work with his suave and charming \"villian\". Milland's performance is simply terrific, making his character nice enough to win the sympathies of the audience, yet still frighteningly intelligent as the mastermind of the plot. John Williams appears as the Inspector in charge to solve the complex puzzle, and delivers a classic performance as the Enlgish gentleman decided to find the final answer. Only Robert Cummings seems miscast as Mark Halliday, although a lot of his weak performance could be blamed to Milland, Kelly and Williams overshadowing him with their excellent work.<br><br>In many ways, \"Dial M for Murder\" shares many things with \"Rope\", as not only the two films are based on successful plays, they are also about committing the perfect murder and oddly, they are both \"experiments\": while \"Rope\" was conceived as a \"movie in one take\", \"Dial M for Murder\" was done as 3-D movie. Sadly, the interest in 3-D was dying when the film was released, so few theaters carried the movie complete with the gimmick; a real shame, as Hitchcock's use of the technology, unlike most 3-D films of its time, was conceived as a way to enhance the claustrophobia of the Wendices' apartment instead of using it to merely shock the audience with \"stuff coming out of the screen\" (as seen in for example, \"House of Wax\"). While not too fond of the gimmick, Hitchcock truly gave it a good and intelligent (albeit subtle) use to it.<br><br>\"Dial M for Murder\" is probably less celebrated than the Master's most famous movies, the fact that it came out the same years as \"Rear Window\" (again with Grace Kelly) may have had something to do with it too. While a subtler and more restrained tale of suspense, this is still the Master at his best, as the movie proves that when he was at the top of his game, no other director was comparable to him. 9/10","user":"jluis1984","rank":[81,110]}]