[{"title":"A delightful film, no matter which version you choose","rating":6,"date":"6 July 2003","review":"The Point, a delightful animated film, is a joy for both children and their parents. The story line is a typical fable - how little Oblio was born in the Land of Point with a perfectly round head. After beating the evil Count's son in a game of triangle toss, he and his faithful dog Arrow are banished to the Pointless Forest. Here they encounter numerous strange creatures and have many adventures, where they learn that physical or not, everybody has a point. The music was written and performed by Harry Nilsson...after his hits with \"Everybody's Talkin'\" and the \"Theme from the Courtship of Eddie's Father\", but before his monumental Nilsson Schmillson album. A song from this feature, \"Me and My Arrow\" became a minor hit. George Tipton does wonderful but largely unrecognized arrangements of all the songs. The original movie was featured on ABC television in 1971 with Dustin Hoffman providing the narration. Harry Nilsson himself peforms the narration on the corresponding soundtrack album, which is a delight in itself. (It has recently been re-released with additional material.) When the film was shown in Great Britain, the original narration was wiped and replaced with one by Alan Barzman. Later the film was shown on the Disney Channel, with narration by Alan Thicke. The VHS home version is narrated by Ringo Starr, a drinking buddy and close friend of Harry Nilsson. Although the VHS version is no longer in print, I have seen versions with all 4 narrators lurking about on the internet. I have not heard personally heard the Alan Thicke or Alan Barzman versions. Ringo does a nice job on his narration, which I prefer over Hoffman's. However, if you're a Dustin Hoffman fan, his version is fine as well.","user":"vjthom39","rank":[19,19]},{"title":"The Best Animated Movie Of Our Time","rating":10,"date":"9 January 2005","review":"Any animated movie that comes out can not hold a straw to 1971's \"The Point\".<br><br>Harry Nillson wrote an incredible story, that comes along with excellent, singable songs that will live through the ages. The story is touching and the characters are wild.<br><br>The first time I saw it was the first time it came out, with Dustin Hoffman as the narrator. Now that it is on DVD, I wish that he was still the narrator, but Ringo does an incredible job as well and it does not detract from the story.<br><br>The point of this movie (no pun intended) is that everything has a point, and if everything has a point than thats rather pointless. You'll have to watch to understand. Every kid should watch it for a wonderful cartoon and every teenager/adult should watch it to learn a valuable, touching lesson.","user":"minorchord03","rank":[22,24]},{"title":"It was a great lesson in tolerance and acceptance.","rating":24,"date":"24 November 2003","review":"Besides having a wonderful score written by Harry Nilson, including the song \"Me and My Arrow\" which was used in a car commercial, it had a great story and unique cartoons - very different for its day.  I had seen it when it first came out with Dustin Hoffman as the father's voice, but the next time I saw it, Alan Thicke did the voice and I wondered if I had been mistaken. It is gratifying to know that I wasn't.  I've never heard it with Ringo Starr in that part, but I think it would be interesting.","user":"aunt_su","rank":[11,11]}]