[{"title":"Those wacky police officers yet again","rating":4,"date":"26 March 2004","review":"'Bad jokes is where I draw the line!' As Hightower says in the 6th adventure of our favorite misfits. This time the story is about a gang (well, there's 3 of them anyway), who keep on robbing juwelry stores and banks along a busroute... but why, and how?! And who is their secret boss?<br><br>Oh well, never mind the plot. It's just a filler between the sketches of the heroes and their peculiarities. The strong Hightower, gun crazed Tackleberry, big-breasted Callahan and the rest of them. We all know them from before, and once you've seen one episode, you kinda saw them all.<br><br>Weak point of the movie is the absence of Mahoney (the star of the series) and Zed (the funniest). Best scene is when Jones takes on one of the gangmembers in Bruce Lee style. Oh well, I had some laughs, and City Under Siege won't be in my bottom 100. I'd give it 4/10.","user":"TheOtherFool","rank":[6,6]},{"title":"P.U.!!!","rating":19,"date":"19 February 1999","review":"In \"Police Academy 6: City Under Siege\", the gang's all here to save a crime-ridden city from the wrath of 3 white guys named the Wilson Heights Gang...I imagine this complicated premise was pitched to Warner Bros execs something to the effect of \"Um, they like to rob stuff...and they're bad guys. Oh, and the city's under siege because of them.\" I know this is slapstick and it was never intentioned to be taken seriously, but even when writing a film like this you have to TRY, at least TRY to write something good!!<br><br>Anyway, the cast is all here, again, and they're not unlike the line of lower-income, shady low-lifes I see waiting outside the Department of Labor office every morning to pick up their unemployment checks. I don't think these guys even bother auditioning for other parts anymore, they're all blacklisted for life. There's Lt. Harris, once funny and a believable antagonist, now a cartoonish straight man to his bumbling apprentice Proctor, the two of them like some ill-fated and painfully unfunny Abbot &amp; Costello bit that goes on too long. Way, way, waaaaay too long. There's Hightower, for the sixth time, he's big and black. Really big and black. Ha-ha-ha. Hooks and Tackleberry are here, oh Lord, don't forget about Hooks and Tackleberry...she's mousy and timid but sometimes she yells loudly, and T-man, he's a walking arsenal who loves guns! Most interesting though is Nick McCoy (I can't remember the character name) who's simply a modern replacement for Steve Guttenberg and his Carey Mahoney. Both are bright-eyed and boyish, both the unofficial leader of the gang. Put all these guys together and you have...well, you have...you have a cast, I guess.<br><br>Police Academy 6 should have been the end. The sad, painful end to a once respectable series (meaning the first P.A. only) that had gone on seemingly forever, like that old uncle who lives in Jersey who's 103 and can't walk or talk, just lays in bed and mumbles in pain with everyone waiting for him to pass on and finally be at peace. Instead, a seventh police academy was made. It never made it to the theaters and I have yet to see it, but I remember seeing its preview in the movies some years back...as soon as the title and Robert Folk's Academy March started, a universal groan filled the theater. I think the marketing execs were in that theater and got the idea. But don't worry, Academy fans, I'm sure there'll be an eighth and a ninth, and a tenth...it will outlive us all, this series. And true genius is never recognized in its own time.","user":"Quinn-5","rank":[13,18]},{"title":"Nowhere near as bad as critics insist..","rating":22,"date":"22 February 2004","review":"but on the other hand it's not the funniest movie ever made and it's just a rehash of the last 5 movies, but it's STILL good and worth watching if you've nothing better to do &amp; obiously if you've seen the first 5. There isn't much of a story but what there is of it consists of a gang of 3 goons who work for a MR BIG bringing down property prices by going on a City wide crime-wave with the Academy the only people who can stop them.. and that's about it Of course there's loads of slaptick mainly down to the inept Capt. Harris and partner LT.Proctor. Most of the other usual cast remains What with Bubba Smith (hightower) doing his strong man thing, Leslie Easterbrook (Callahan) doing her strong ass-kicking woman thing &amp; The late David Graf (Tackleberry) doing his gung-ho ass-kicking stuff that we've seen in all the other 5 movies so It might get tiresome for hard to please critics, but for a bit of lightweight entertainment that won't tax your Brain too much it's nigh on Unbeatable My vote for what it's worth 7/10.<br><br>Followed by Police Academy 7: Mission to Moscow the last movie which flopped at the Box-office (maybe it was an academy too many for film fans who though they'd suffered enough)","user":"liammurphy1","rank":[14,20]}]