[{"title":"Heather O'Rourke is the greatest (her best acting, IMO)","rating":10,"date":"31 July 2005","review":"Going in a different direction from the previous two movies in the series, this one took a few chances. The high-rise, mirrors, a new Kane(sad what happened to Julian Beck), etc. I loved this movie for those reasons. Not saying I didn't enjoy the other two because those were excellent, but it seemed like there wasn't anything in there to make them considered a horror movie except for the presence of ghosts with a little bit of suspense. \"Poltergeist III\" contained murder, suspense, tricky camera angles and most of all, the best acting I have ever seen from Heather O'Rourke. She was so adorable in her red pajamas and I truly believe she carried the movie with up to par performances by Skeritt, Allen, Rubenstein, Fire, Flynn Boyle and Wentz. Her presence on screen while watching this movie is so magnificent and very believable. When I was little, she was my first crush and I loved her, I only found out on 6-4-2005 that she passed away and it crushed me. I say this is the best of the series and I know I am the minority, but hey, to each his own. I realize the first movie is pretty much legendary for her famous line \"They're Here\", but I feel the acting here is better. The way they made the concept of the mirrors work is amazing and I thought it was a great attempt a something new. I gave this movie a 9/10 because of how much I enjoyed Heather O'Rourke's performance. Check it out.","user":"J_Malice","rank":[51,75]},{"title":"Lacks qualities of first two, but some scenes okay","rating":17,"date":"17 November 2000","review":"\"Poltergeist III\" has to be one of the strangest movies I have ever seen. It is very confusing, but it is one of those films that you need to know the ending.  Okay, I'll just go over the things good and bad and ugly with the movie.  First, the good aspects of the film: None.  No, actually I can think of a couple.  Some of the F/X were well-thought out and some of the mirror scenes were creative.  Also, the acting of 12-year old Heather O'Rourke failed to disappoint as she seemed to become better as she got older.  It is a shame to both Hollywood and her family &amp; friends that she died.  Now, the bad: Let's just do a list, shall we?  The acting of the adults was bad, the plot was confusing, the ending seemed like it was just cut short, and it's hard to think of more other than the acting of Lara Flynn Boyle was absolutely pitiful I might add.  I wonder why she isn't a big star...and the ugly- one word (or two): Marcie (ewwww.).<br><br>My rating: 4.8 out of 10. (But don't let that spoil the other two films- \"Poltergeist\" is amazing, and the sequel is at least respectable and well-acted.)","user":"jeffplus3","rank":[4,4]},{"title":"No classic but it absolutely terrifies me","rating":10,"date":"27 July 2005","review":"I was shocked when I came to this site to see how low the rating is for this movie. I loved horror movies as a kid and still do, but of everything I remember watching when I was younger, Poltergeist III scared me the most. I would go literally weeks before I could look at myself in the mirror again... I'd always have to run by them. I used to watch this movie with my friends and it made them equally afraid of mirrors. I'm not going all out to say that the acting was high quality or that it goes down in my books as a classic horror movie but I think it's highly underrated. It's an incredibly dark, terrifying movie in my opinion. I think it's by far the scariest of the three Poltergeist movies, although the original Poltergeist is my favorite.","user":"tlcglitznglam","rank":[29,45]}]