[{"title":"A bit too much language, but still enjoyable, and a personal favourite","rating":14,"date":"14 February 2010","review":"MAY CONTAIN SPOILERS I remember seeing this on video in the mid-late 80s - and still can't get a Region 2 DVD of this one, so make do with a VHS copy made many years ago.<br><br>Based on James Kirkwood's novel, Pryor does his typical (sometimes foul mouthed) routines as a POW returning to find his life has fallen apart. The early dramatic scenes have quite an impact, actually more so than the comedic scenes.<br><br>Pryor tries hard with the material and there are some genuinely funny moments (the signing of the confession is one).<br><br>Ronny Cox offers sturdy support and Margot Kidder plays the 'tart with a heart' who eventually drives off into the sunset with Pryor and $100,000 to boot!<br><br>I've always had a soft spot for this movie, and was unjustly ignored at the box office. Pryor's screen presence carries this one, but this is still no way a turkey.","user":"ptl0168","rank":[4,4]},{"title":"Great film up until about the middle","rating":8,"date":"29 May 2000","review":"This film starts off like an extremely poignant drama. The bond between Richard Pryor and Ray Sharkey in the POW camp is seamlessly acted. The musical score by Patrick Williams is outstanding and very sad. The films middle is just as good, with very moving parts with Pryor returning from war to deal with problems with his mother, his wife, and his life. However, after this the film goes awry. The films keeps its respectability however, because Pryor is such a good actor.","user":"pwmoses","rank":[6,7]},{"title":"Pryor makes it bearable.","rating":6,"date":"12 June 2013","review":"Richard Pryor gets to really show off some talent here as an actor in this adaptation of the James Kirkwood novel. It has good moments, but never really satisfies; it works fairly well when it gets serious but its comedy is never that funny. Pryor really is better than the material, which doesn't achieve an effective balance between its drama and comedy. It's not bad as yet another look at the problems of Vietnam vets readjusting to civilian life, in any event.<br><br>Pryor plays Eddie Keller, who's taken as a prisoner of war during his tour in Vietnam. When he's brought back to the States, he finds having to put up with Army red tape to be intolerable. In addition to being in desperate need of money, he learns from his wife Lisa (Lynne Moody) that she's in a relationship with another man and that his mother Jesse (Olivia Cole) is in a nursing home - an expensive one, to boot, which is about to kick her out if they don't get paid.<br><br>Eddie makes friends with a well meaning prostitute named Toni (Margot Kidder) and eventually sees a way to deal with the money problem - larceny.<br><br>This wouldn't be nearly as watchable if it weren't for Pryor, who's touching as well as funny. You feel so bad for him, in fact, that scenes in which Eddie bungles hold-up jobs to be much more pathetic than humorous - which may have been the point. Pryors' scenes with fellow P.o.W. Vinnie (Ray Sharkey) are deeply affecting; the late Sharkey makes the most of his brief screen time. Ronny Cox lends strong support as the colonel who tries to help Eddie upon his return to America. Kidder is appealing and a couple of familiar character players - such as Paul Benjamin, Matt Clark, Anne Haney, Peter Jason, Caren Kaye, Sandy Ward, and the much too briefly utilized Tim Thomerson - can be seen in small roles.<br><br>Ultimately, while one does want happiness and success for the Eddie character, the feel-good ending is not all that believable. The movie is decent, but it's not memorable in any way.<br><br>Six out of 10.","user":"Hey_Sweden","rank":[3,3]}]