[{"title":"Pursued union leader meets old college sweetheart and secrets are progressively revealed as pursuit continues.","rating":10,"date":"24 September 1999","review":"I had the privilege of viewing this film in 35mm projection with an audience likewise privileged, and the first, spontaneous comment coming from an audience member in a discussion of the film that I was leading was, \"It was like Casablanca only better.\"  That comment has stayed with me, because I did not know the person, but I came to agree with it the more I  got to see this film.  What stands out the most is the excellent night-time photography, and the second feature is the seething romance that makes it so much like Casablanca.  Even the soundtrack gives the film a boxed in feeling that makes the viewing experience very dreamlike, and the pace, the editing, and the sound/image timing is just wonderful. Julio Bracho is one of the three directors who emerged with auteur status in Mexico in the 1940s, next to Emilio \"El Indio\" Fernandez and Roberto Gavaldon, all three starting out with outstanding feature films in the early 1940s.  At that time Mexican cinema was taking itself more seriously than ever, and filmmakers disagreed about the direction to embark upon. Distinto Amanecer was, stylistically, one answer to that open question, with a distinctly European feel, very much inspired by its ambience in 1930s French poetic realism (the studio Films Mundiales was owned by French expatriates, if I'm not mistaken).  I gave this film a rating of \"excellent\" because I never tire of watching it for its elegant dialogue, smooth cadence and heart-melting romance, with the best performance that I have seen by the female lead Andrea Palma.","user":"guerrier","rank":[11,13]},{"title":"One of the first urban movies from Mexico","rating":8,"date":"20 August 2005","review":"Up till 1943, the most productive movies from Mexico were stories from the rural life of the Country. Pictures like \"Alla en el rancho grande(1936)\" had been a great success. But Mexico was now turning to a more \"urban\" society. In part due to the war, Mexico was now trying to take advantage over other competitors. Spain and Argentina which held close ties to the Axis Nations, were denied support from the USA in their productions. Mexico took advantage of this, and produced films like this one, where there was a shift to the urban problems. This is a movie about a Union leader that tries to fight the corrupt leaders of the local Government. Julio Bracho, the Director of this film, whose background was in the theater, applies his techniques in such a manner that this picture combines the best styles of both schools in order to make it a good one. This could very well be, one of the first movies of what was later known as the \"Golden age of the Mexican cinematography\"","user":"andrescardenasg","rank":[10,13]},{"title":"Mexican Film Noir.","rating":9,"date":"5 January 2014","review":"I loved this film. Have been watching Mexican films for several months on a regular basis. Most have been fodder from the 50's and 60's that center on machismo and helpless females. This one is different. My first impression is how the female star Andrea Palma, looked line Marlene Dietrich! She carried the film with her pivotal role as a former love interest to one of my favorite Mexican actors Pedro Armendariz and her current husband played by Alberto Galan. This lady is one tough cookie. The constant in this film is the absolute flawless photography of Mexican legend Gabriel Figueroa and the direction of the film's director Julio Bracho. Everything is 1st class about this film, especially compared with the parochialism of Mexican cinema of the late 30's. The Noir! Plenty of it, night shadows, men wearing sunglasses at night, gangs of thugs, a jilted husband. This film is awash with shadows, drawn guns and cigarettes. No, there is no dumb and wicked blond, although the heroine uncharacteristically for Mexican films, fired a bullet into the gut of an axe wielding bad guy! This Bracho film pointed Mexican cinema into the stylistic center of world cinema of the war years. Tough and gritty like the Third Man (1949), Casablanca (1942), in an urban setting filled with night-life characters. But alas, the Mexican public won out over dirty and gritty movies with their support of films filled with music, tequila, bumbling comics and macho good guys punching out bad guys in night clubs and cantinas galore! Not until Luis Bunuel's \"Los Olvidados\", did Mexican cinema regain the level of storytelling accomplished in this film by director Bracho. I gave this film a 9 mostly because Pedro's performance was script acting, reciting lines using that marvelous Pedro Armendariz allure without the experience and seasoning he would quickly attain.","user":"razatimes","rank":[2,3]}]