[{"title":"Intriguing and expressive.","rating":8,"date":"20 February 2012","review":"So far in my exploration of Jean-Luc Godard I have remained in his masterful decade of the '60s, and as a result I've been treated mostly to films that are fun and exciting, toying with structure and cinematic conventions. Vivre Sa Vie fits firmly in his career, but it's also a surprising contrast to his other work which I have seen so far. Even in his more narratively focused Breathless, there's still a very cinematic quality to it, portraying a sense of freedom of expression and romanticism. Vivre Sa Vie strips away all of that and elects instead to present an almost documentarian look into the descent of the young Nana (Anna Karina, naturally) into prostitution.<br><br>The structure of the film is split into twelve episodes that bring us through Nana's progression. She's a young Parisian girl working at a record shop who wants to be in the movies, but needs money to pay her rent. It's a simple story, but the way Godard tells it is what makes it so intriguing. He presents Nana as an object of desire to many but an object of interest to very few. The men around her aren't interested in what she has to say, they put up with her words in order to get to what they are really looking for, her body and ways to profit off of it.<br><br>Karina's dance scene is classic Godard, but his unique approach to this film makes it much less freeing than in his other works. The dance in Band of Outsiders is a jaunty display of youthful rhythm and A Woman Is A Woman is loaded with fun numbers, but here the art of dance takes on an entirely different, and much more tragic, meaning. For Nana, it's a desperate plea to get attention using the only thing that she knows how, her body. In regards to the film, Godard stated, \"The few episodes in her life that I am going to film are very likely of little interest to others, but most important to Nana,\" and I feel that he accomplished his goal very well here.<br><br>These episodes to most would seem relatively mundane, just normal days in the life of a prostitute, conversations and interactions of the daily routine, but for Nana they mean so much more. Her trip to the cinema to see The Passion of Joan of Arc has become almost iconic in Godard's legacy, and for good reason. In this moment Godard removes us from our state as voyeurs and instead plays us into Nana's position. He displays Nana as the film viewer, presenting the kind of emotional impact and life revelation that cinema can have on someone and getting the audience to completely empathize with her. Nana becomes the audience and, as a result, the audience becomes her.<br><br>The descent into prostitution is intriguing here, thanks in large part to the captivating and expressive work by Godard's muse, but Godard's metaphor for the life of an actress is also a fascinating theme that one can't help but notice. Displays Nana as the prostitute in her world of pimps and photographers, people passing her back and forth like a piece of meat, it certainly seems that he's making a statement on the film industry and the nature of exploitation in how actors are treated. They are passed back and forth by directors, producers, even the audience, and used for their image, much like a prostitute, and it's up to the actress to keep themselves in tact. As the opening quote of the film states, \"Lend yourself to others. But give yourself to yourself\".<br><br>I've seen people refer to the film as the \"morning after\" state of the Godard/Karina dynamic and I think that's an interesting way of looking at it. They had collaborated several times before, and would collaborate for many years after still, but Vivre Sa Vie seems to be the most intimate and exposing look into the relationship between the two of them as lovers and the relationship between actor and director at large. It's a very introspective journey that Godard takes us on, and certainly one of the most impressive I've seen from him yet.","user":"Rockwell_Cronenberg","rank":[33,34]},{"title":"Godard classic","rating":9,"date":"16 April 2009","review":"As the film opens Paul and Nana are going through a break-up. Each is filmed with their back to the camera. As Nana says she wants to die, it makes me think that, when we turn our back on the most significant person in our life, it can be like turning our backs on life itself. Such a big part of our identity is bound up with them that there seems nothing left. It is as if we have failed to heed the advice of Montaigne, quoted at the end of the opening credits: \"Lend yourself to others and give yourself to yourself.\" Of course, Godard may not be intending for me to have such thoughts. For much of the film I get the distinct impression that he does not want me to interpret anything as anything, but just to accept it as it is. But the film, within a few minutes, has sparked off some interesting and worthwhile thought in me and I like this. It seems to be what art should do. And that it should do it simply by existing, not by trying to convey some message of its own.<br><br>For much of the film that follows, part of my mind is taken up with enjoying the crisp black and white photography. The streets of Paris, and other simple but finely observed detail. The lustre of Anna Karina's hair – she plays Nana – is as enchanting as if I were talking to her. And maybe talking about nothing very much in particular so that my mind could wander to such things. The quality of the print is sufficient to make out individual hairs – or hairline cracks in walls and furniture.<br><br>The overall effect – taken with some other devices that I only slowly become aware of – is to give a documentary-like feel to what the camera is seeing. Nana splits from Paul and drifts into prostitution. It happens without any big dramatics. She has been working in a record store, is having trouble paying her back rent, and, after a few other minor incidents, we see her with her first client. The look of repressed emotion on her face is one of the most stark and memorable images in the film. A bit like Edvard Munch's painting, The Scream. But sublimated into what is portrayed as a very everyday setting.<br><br>Later, in a rapid monotone, Nana's pimp even gives us a run-down of prices, laws, regulations and practices. It is almost the Brechtian splitting of the film into twelve chapters (each with long titles telling us what is about to happen), and Godard's increasingly frequent experiments that separate the sound from the image, that remind us this is fiction, not docu-drama.<br><br>For instance, towards the end and when Nana is with a young man she rather likes (and the attraction seems mutual, maybe love), their conversation is not heard by us but only seen on the screen as subtitles. They are communicating soundlessly perhaps, as lovers do.<br><br>There is a long scene where she discusses the meaning of language with an old man, a philosopher (played by Godard's former philosophy teacher). Although this is outwardly quite deep, I did not find the arguments nearly as profound or rigorous as in Godard's later film, 2 or 3 Things I Know About Her. Prostitution is not used here, as it is in 2 or 3 things, as a political metaphor. Susan Sontag, in her aptly titled essays, Against Interpretation, suggests that it is, \"the most radical metaphor for the separating out of the elements of a life – as a testing ground, a crucible for the study of what is essential and what is superfluous in a life.\" She sees Nana as having divested herself of her old identity and taken on her new identity – that of a prostitute.<br><br>In the version I watched, quite a few lines were omitted from the English subtitling, so my smattering of French came in useful. But I needed some of the subtler French puns on the 'life' and 'chickens' pointed out to me.<br><br>As the film came to its not untypically Godard-like abrupt ending, I wondered for a minute if it was as great as some people often claim. The celebrated critic Roger Ebert, for instance, singles it out as one of the great movies of all time. My mind wandered to such movies as Last Year at Marienbad, and Jules and Jim, both made about the same time and which have left quite a deep impression on me. But only for a minute.<br><br>Vivre Sa Vie is different, yet again, to any other work by Godard. But it is deceptively unassuming, and a remarkably solid piece of work for all its sense of transience (Godard compared cinema to a train rather than the station). It can also be seen as a love letter from Godard to his wife, the beautifully photographed Anna Karina.","user":"Chris_Docker","rank":[32,34]},{"title":"The director and the pimp","rating":10,"date":"11 April 2004","review":"There is more to this film, in terms of its story, than a woman's descent into prostitution.  To a large extent, it is the story of Godard's failing relationship with Karina.  Or perhaps it presents Godard's overall view of the director's relationship to the actress, the artist's relationship to his subject.<br><br>Possible spoilers.<br><br>Aside from Nana, there are three characters crucial to the story: the photographer, the pimp, and the guy who reads excerpts from Poe.  There are two particularly telling scenes: Nana's viewing of Joan of Arc and the subtle appearance of the Elizabeth Taylor photograph behind Nana as the Poe story is read to her.<br><br>First, the photographer.  He offers Nana her last chance at an entrance into films.  Soon after their meeting she falls into prostitution.  He resembles the pimp in manner.  Are films and prostitution the same?  Rather, are the director and the pimp the same?<br><br>The real representation of the director is the guy who reads the Poe story. In fact, he represents Godard himself.  This is the guy who buys Nana cigarettes, and when we see Nana consorting with him after all of her degrading experiences, it is like a breath of fresh air.  He is going to glorify her and raise her to the status that she deserves.  He is an artist and he portrays her (\"This is our story,\" he says of the Poe story.  \"An artist portraying his love.\").  The Poe excerpt ends with the death of the artist's love, his subject.  He drained the life from her and into the canvas.  If this is their story, is the guy draining the life from Nana? Isn't that what the pimp has been doing?  The pimp and the director are the same.<br><br>Nana sees Joan of Arc judged by men, and she ostensibly relates.  As the Poe story is read, we see the photo of Elizabeth Taylor behind Nana. Godard is encouraging us to judge Nana (or Karina) in comparison to Elizabeth Taylor. She is being killed, just as Joan of Arc was, by this judgement. The director and the pimp are the same.  Godard prostituted Karina, at least he thought so when he wrote this story.  He drained the life from her and into his canvas, the screen, and presented her for our judgement.  Our Nana doesn't realize that whether she had made into films or had fallen into prostitution, the end result would have been the same.  La morte.","user":"apeart","rank":[81,92]}]