[{"title":"Underrated And Creepy","rating":8,"date":"20 February 2006","review":"Sure, this movie is definitely a Halloween clone, but why should that mean it's bad? If Halloween is so good and this movie resembles it, then why not like this one as well? I don't understand why so many people have a problem with that. I mean, Halloween itself is a clone of another movie anyway (Black Christmas). So if you can accept that, then accept this one too.<br><br>Out of all the 80's slashers, He Knows You're Alone definitely ranks up there with the best and most underrated. Right from the clever opening sequence (which was later copied for the opening of Scream 2), I was instantly hooked. From there, it develops a quick and simple backstory where we learn that the killer was dumped by his fiancé so she could marry another man. And as a result, a few screws are pulled loose in his head and he begins hacking up a bunch of brides-to-be, which brings us to the main character of the film and her friends who he begins to stalk.<br><br>The pacing throughout the film was very well done. It built up a very effect creepy atmosphere that oozed with this sort of quiet dread that can really manage to make you feel uneasy. The characters were actually quite likable here, which is something of a rarity in the slasher genre, and they were very well acted (including Tom Hanks in his very first movie appearance). The great musical score, while it will definitely remind you of the Main Title theme of Halloween, also had it's own unique sound that made it very memorable and haunting. It really helped make the atmosphere even creepier, especially afterwards when you've finished watching the movie and the theme is still stuck in your head. Another major plus involves the killer. We barely get to see him and when we do, we're reduced to only a tight shot on his creepy bulging eyes. And it's pretty refreshing to see a killer's bare face since most slasher maniacs always wear a mask.<br><br>So if you're a fan of Halloween or other similar themed horror movies, then I would definitely recommend this one. It's a real shame that this one got overlooked during the whole slasher boom that Halloween started back in the 70's and 80's. It's pretty creepy and well worth watching overall.","user":"EvilOges","rank":[42,49]},{"title":"Good \"Halloween\" clone","rating":8,"date":"19 December 2001","review":"Amy (Caitlin O'Heaney) is preparing to get married.  Unfortunately, her cheating boyfriend is out of town and a psycho (Tom Rolfing) with a thing for killing brides to be is in town.  Feeling she's being stalked Amy welcomes the company of her ex-boyfriend Marvin (Don Scardino) and her girlfriends.  This doesn't scare away the killer who proceeds to slash his way through her friends to get to her.  Meanwhile a detective (Lewis Arlt) is hot on the killers trail.  But will he get him in time to save Amy?<br><br>This was dismissed in 1980 as just another \"Halloween\" clone.  It is, but it's one of the best.  It's well-acted (especially by O'Heaney, Scardino, Rolfing and Arlt), suspenseful direction, quite a few enjoyable jolts and likable, realistic characters.  The big surprise is how non-bloody all the murders are.  You hear them, but you never see them.  My guess is that MGM (who released this) wanted a tame horror film so all the gore was kept out. It's R rated just for language and brief female nudity.  Also surprising is that the killer is portrayed by tall, handsome Tom Rolfing--he looks so good I had a hard time believing he was the killer.  Also he's very imposing--one of the scariest scenes has him quietly approaching O'Heaney from behind after she finds a dead body.  Also the then unknown Tom Hanks (in his film debut) has a small role.<br><br>Perfect movie for a Halloween night.  Scary and well-done...worth seeing.","user":"preppy-3","rank":[20,25]},{"title":"Flawed slasher movie, of curiosity interest for the presence of debuting Tom Hanks.","rating":4,"date":"6 March 2005","review":"While Psycho was one of the great films of all-time, we've all had to pay a high price ever since. The slasher genre was ignited by the phenomenal success of John Carpenter's Psycho homage \"Halloween\", and an interminable series of slasher movies followed in the late '70s and early '80s. Halloween II, Happy Birthday To Me, Friday the 13th, The Final Terror, Visiting Hours, Prom Night and He Knows You're Alone are just a handful of titles that spring to mind. He Knows You're Alone is a fairly forgettable example from 1980, but it has sporadic moments of suspense and is of curiosity interest as the movie debut of Tom Hanks.<br><br>A knife-wielding killer (Tom Rolfing) preys upon young brides-to-be. Years earlier, he murdered his ex-girlfriend on her wedding day and has been pursued ever since by the cop, Len Gamble (Lewis Arlt), to whom she was due to be wed. The disturbed psycho starts a new campaign of bride-brutalising, first stabbing an engaged woman in a movie theater, and then stalking resourceful young Amy Jensen (Caitlin O'Heaney, in a very winning performance), whose future husband is away on a bachelor weekend. One by one, Amy's friends fall foul of the killer, until she seeks the aid of her ex-boyfriend, oddball morgue attendant Marvin (Don Scardino), in escaping from her stalker.<br><br>Director Armand Matroianni (son of actor Marcello) borrows heavily from earlier genre entries. His build-up in the murder sequences is almost identical to Carpenter's use of lighting, music and point-of-view camera shots in Halloween. The gore is kept to a minimum (apart from a quite bloody severed-head-in-a-fishtank scene) and a greater emphasis is placed on suspense. Alas, many of the \"suspenseful\" moments are rather fluffed because the director makes it too obvious when the jump-out-of-your-seat moments are about to occur. Hanks has a very small role as a psychology student who gives the film's self-referential speech about why people love to be scared by horror movies. He's competent in the role, but one wouldn't have predicted from this evidence that he would go on to become a super-star. A major flaw with the film is that Tom Rolfing's killer character is supposed to be a bride killer, but he breaks his own rules on numerous occasions by hacking down victims who are not brides-to-be. In fact, some of his murders are so senseless and unmotivated that he comes across more as a rampaging killing machine than anything else. It just seems to me that films of this ilk should at least make a small amount of sense, at least on their own terms.He Knows You're Alone is a competent and forgettable slasher film... if you're a fan of the genre you'll like it, if you're not you won't.","user":"barnabyrudge","rank":[22,28]}]