[{"title":"101","rating":10,"date":"21 February 2020","review":"When two Dalmatians named Pongo (Rod Taylor) and Perdita (Cate Bauer) are blessed with fifteen puppies, they couldn't have been happier. But when their new family gets stolen, along with eighty-four other puppies by the evil fashion designer Cruella De Vil (Betty Lou Gerson) for the intention of making fur coats out of them, Pongo and Perdita must call on numerous other animals to help them rescue the puppies from their fate. Important in animation history as the first Disney animated film to heavily use newer xerography methods for the purpose of cheaper animation methods, One Hundred and One Dalmatians may lack the visual beauty of Disney's earlier fantasy films, but the modern UPA style of the film helps it stand out as one of the most visually unique films of the 1960's. The infamous Cruella, thanks to Marc Davis's incredible character animation and Betty Lou Gerson's piercing voice makes her one of the most memorable villians of all time and despite a lot of it would end up being reused for numourous films produced during this cost-cutting era, George Bruns's score is fabulous with the best example of his work being the jazz-inspired opening credits that would set the mood for the more laid-back films of this time period. Overall, One Hundred and One Dalmatians deserves it's reputation as not only one of the most important films in the companies history, but also as a fun thrill ride for all ages.","user":"MR_Heraclius","rank":[37,38]},{"title":"A new look","rating":8,"date":"15 February 2000","review":"A large part of Disney's triumph cannot be detected by the naked eye.  His last animated film had been `Sleeping Beauty', which was the most extravagant and spectacular animated film of all time (excluding `Fantasia').  It wasn't a financial success.  `101 Dalmatians', much less extravagant, was.  In the two years between `Sleeping Beauty' and its successor there had been a revolution.  The entire army of inkers who had carefully translated animators' pencil drawings into smooth, flowing lines were replaced by a machine that simply photocopied.  This changed the character of animation so much that `Dalmatians' is almost the precise opposite of `Beauty'.  Outlines are rough and black; the entire film looks decidedly drawn rather than painted, even the bits that are in fact painted; and the rich variety of colour of Disney's earlier films has been replaced with the stark white-with-black-spots coat of a dalmatian, with the occasional splash of startling red.  The art directors were as determined to get the most out of the new technology as they had been to get the most out of the old technology. <br><br>And it has its own quiet extravagance.  A title promising over one hundred spotted dogs was (probably still is) the kind of thing liable to make animators feel faint.  It couldn't have been done without the photocopier; and even so, getting spots to stay in the right place on a featureless white background is a huge headache.  None of this leaps out an audience.  We simply see a hundred adorable dogs.<br><br>The story is simple, clean, civilised, and warm.  It moves slowly but this doesn't matter.  Preventing the film from becoming lethargic is Cruella de Vil.  She can drive like a maniac through the snow, smoke a cigarette through a holder the length of a sword, wave her arms like a windmill ... yet she handles quiet determination and gritted teeth equally well. Character animation doesn't get any better than this.","user":"Spleen","rank":[54,58]},{"title":"Vintage Disney","rating":9,"date":"28 September 2000","review":"If there's any classic Disney movie that's less likely to be forgotten because of the modern Disney movies, this would be one of them. Part of the reason may be the live action version and its upcoming sequel. Skip those remakes and watch the real deal. The other part of the reason is because this movie is just so charming. Cruella De Vil is one of the more memorable Disney villains ever made. Romance abounds in this movie, and don't forget those adorable puppies. This may not have the animation or the big fancy songs of the moderns, but all that fanciness usually distracts from the story. Classic Disney always rocks, and this is no exception.","user":"pmcollectorboy","rank":[44,47]}]