[{"title":"A true representative of French cinema made in eighties.","rating":6,"date":"2 September 2009","review":"French cinema of nineteen eighties was known for its numerous popular films which gave a new dimension to box office collections.\"Pour La Peau D'Un Flic\" is one such film which is not so much known by ordinary film viewers both in France and elsewhere.This might have something to do with the manner in which this film was distributed. It is sure that loyal Alain Delon fans would be aware that this film marked the beginning of his directorial career in 1981.Alain Delon gives one of his career's finest performances as a detective who would go to any length in order to bring cold blooded criminals to justice.As a film director he has not fought shy of portraying what ails police forces in France.In \"Pour La Peau D'Un Flic\",policemen are shown as real human beings with their fair share of weaknesses.Alain Delon's acting performance has too many shades of similarities with American actor Al Pacino although it would be politically incorrect to suggest such a comparison.This is a good film for all those people who would like to see Alain Delon both as an actor as well as a director in a same film.","user":"FilmCriticLalitRao","rank":[11,14]},{"title":"Fast paced and unexpectedly funny crime drama","rating":8,"date":"30 July 2003","review":"Despite some extreme violence (shootings at close range, rape of one of the main characters), there is a surprising amount of humor in this picture. I wonder if this was Delon's way of moving away from the sometimes humorless approach taken in his films with J-P Melville.  It also features a nice performance by a very young Anne Parillaud.","user":"neil57","rank":[16,22]},{"title":"Violent, Funny and Complex Police Story","rating":7,"date":"14 February 2015","review":"In Paris, the ex-cop Choucas (Alain Delon) is a private detective that works with a mysterious partner, Tarpon, and the secretary Charlotte (Anne Parillaud). He is presently working in an embezzlement case of an employee of the pharmacist Jude (Pierre Belot). When the middle-aged Isabelle Pigot (Annick Alane) hires him to investigate the disappearance of her blind twenty year-old daughter Marthe Pigot (Ariele Semenoff) that worked at the Drillard Foundation for blinds, the Police Inspector Coccioli (Daniel Ceccaldi) seeks Choucas out and asks him to drop the case. But Choucas proceeds with the investigation and schedules an encounter with Isabelle in a square, but she is murdered with a shot on the forehead. Chouca continues to investigate and soon the dirty Chief Inspector Madrier (Jacques Pisias) tries to kill Chouca, but he is only wounded and kills the inspector in self-defense. Then two criminals abduct Chouca but he succeeds to escape. He meets his secret partner, the retired Chief of Police Haymann (Michel Auclair), and Charlotte and they disclose a case of narcotics. Further, Choucas learns that he has been manipulated by Coccioli and other Chiefs of Police.<br><br>\"Pour la peau d'un flic\" is a violent, funny and complex story of murder and manipulation in the debut of Alain Delon as director. He follows the genre of Jean-Pierre Melville, and the movie has violence, murder, rape, torture but with humor. Anne Parillaud shines in the role of the cynical and funny cinephile Charlotte. My vote is seven.<br><br>Title (Brazil): \"Na Pele de um Tira\" (\"In the Skin of a Cop\")","user":"claudio_carvalho","rank":[9,12]}]