[{"title":"Edwardian love","rating":15,"date":"15 August 2004","review":"A Room with a View possesses a fabulous cast, beautiful cinematography, an awesome adapted script, and a tale of oppressed desire during the paradigm shift from the repressive Victorian age to the more liberal Edwardian time. The film moves at a deliberate pace of country strolls and carriage rides filling the viewer with literary awakenings and music compositions. Poppies, barley, and Florence architecture decorate the screen. <br><br>\nThe film is witty if anything with carefree individuals roaming about with leisure on their minds.  Pure love and desire aches throughout and Italy is the place to bring the lovers together.  <br><br>It is a handsome picture. Detailed period pieces and costumes.  The cast is phenomenal! Helena Bohnam Carter portrays the peevish Lucy Honeychurch on her way to becoming her prudish Cousin and chaperone, Charlotte Bartlett (The Great Maggie Smith.)  However The spirit of Italy will prevent such an occurrence and fill Miss Honeychurch with pure desire for George, the man who was brought up from the evils and hate of the world.<br><br>The adaptation is superb. Fun. It is a film to live in and swim in the sacred lake. One of the best films of the 80's.  Terrific!","user":"victor7754","rank":[58,64]},{"title":"It's aging well","rating":20,"date":"20 December 2004","review":"I have enjoyed 'A Room with a View' since it arrived on the scene in 1985. I have watched it many times and the video is wearing out and I fully intend to get the DVD of it soon. I saw it again the other night and am still charmed by it, in fact, I enjoyed it more than ever. Yes, it's a costume drama under glass, but it's a very well-done example of that popular genre. Films like this are greatly appealing to people like me who yearn for a gentler society and manners, though without the uptight staidness as exemplified by Aunt Charlotte (Maggie Smith) and Cecil Vyse (Daniel Day-Lewis). So this movie falls under the category of \"comfort\" film for me, and it is one of the very best.<br><br>Often Merchant/Ivory productions ring false ('Remains of the Day', for example), when they attempt to make a political statement; in that case regarding the under-current in Britain that led to the surprisingly popular British Union of Fascists created by Sir Oswald Mosley prior to WW2. But when James Ivory and his team stick to romance and the pretty manners of Edwardians, they are hard to beat.<br><br>Of the performers, Julian Sands seems the most \"improved\" in my opinion from earlier viewings. He is wonderful as the Byronic lover and has a ton of chemistry with Helena Bonham-Carter's lovely, spicey Lucy Honeychurch. Daniel Day-Lewis's Cecil Vyse seems a bit more contrived as time passes but is in the end a touching portrayal of a type of man that I despise.<br><br>There isn't weak link in the entire cast. The Puccini arias and Beethoven piano sonatas are beautiful and enhance the story. The photography is gorgeous and the other technical aspects are flawless. <br><br>This is the pinnacle of Merchant/Ivory films, I cannot imagine them producing anything better in the future, but who knows. They do seem to be in a cultural rut now, however.<br><br>The fringe film crowd will probably descry this sort of populist cinema, but I think that is narrow-minded snobbery, as boorish as Cecil Vyse and his insufferable intolerance to \"the plebians.\"","user":"pekinman","rank":[83,94]},{"title":"Vivid comedy of manners","rating":9,"date":"2 June 2007","review":"\"A Room with a View\" is one of the best-known Merchant-Ivory films, the one that made their reputation for tastefully adapting Edwardian novels. Working from E. M. Forster's charming story, Merchant and Ivory add gorgeous Tuscan cinematography, lush opera music, and a cast of talented British actors. Even a skinny-dipping scene is done with enough class that the movie got away with a PG rating (though that probably wouldn't happen nowadays!). In short, Merchant-Ivory makes it look easyand this ease has led to charges of their films being dull and middlebrow, as well as to many imitators.<br><br>But this stereotype of \"a Merchant-Ivory film\" fails to mention just how vivid and hilarious \"A Room with a View\" actually is. With scene-stealing actors like Maggie Smith as a prim, passive-aggressive chaperone and Daniel Day-Lewis as a self-centered young man whose every gesture tells of his fastidious rigidity, a rich vein of humor runs through the film. The movie also delights in putting its heroine Lucy (a baby-faced Helena Bonham Carter) in situations that prove awkward, funny, and ultimately invigorating for a well-bred young lady of 1905. Lucy finds herself in a love triangle, with society telling her to choose Cecil (Day- Lewis) but a deeper force pulling her toward the unconventional, moody George Emerson (Julian Sands).<br><br>A comedy of manners, \"A Room with a View\" is sometimes guilty of seeing its characters as types, rather than people. Even Lucy is not much more than \"the young girl transfigured by Italy\" that Miss Lavish (Judi Dench), a writer of cheap novels, labels her as. Still, it's easy to get caught up in the romance of this delightful movie. After seeing it, you'll want to go out and defend Truth and Love from all those who would deny them. Or at least to start saving up for a trip to Italy.","user":"marissas75","rank":[37,42]}]