[{"title":"Brilliant Shocker!","rating":23,"date":"23 September 2000","review":"It is a very difficult job for me to pick between this and Suspiria as Argento's best work.  Both are masterpieces in their own right.  Deep Red is about a man that sees a murder committed and then tries to unravel the mystery of finding the killer.  David Hemmings does a fine job in the lead as he walks the streets of an Italian city in search of this homicidal killer.  As with most of Argento's work, the viewer should not try to make too much sense out of the plot, but rather enjoy the rich subtext and visual tapestry with which Argento paints the screen.  The killings, most notably done with a hatchet, are inventive and decidedly gruesome.  More than one time I found myself jump and wince(I suppose those are good things!)  The acting, even though most dubbed, is very good.  The set locations are very atmospheric as well.  Argento's camera, however, is the principal character as it shows us all kinds of images related to plot and otherwise and reached into our subconscience for real meaning.  This is first and foremost a visual film, and it certainly shows Argento's homage to his mentor's work, the films of Mario Bava.","user":"BaronBl00d","rank":[50,64]},{"title":"A masterpiece, depending on which version you see","rating":9,"date":"7 March 2005","review":"DEEP RED (Profondo Rosso) <br><br>Aspect ratio: 2.39:1 (Techniscope)<br><br>Sound format: Mono<br><br>After witnessing the brutal murder of his psychic neighbor (Macha Meril) by person or persons unknown, a British musician in Rome (David Hemmings) obsesses over details of the crime and uncovers a series of clues which lead to further bloodshed and horror.<br><br>Released in Italy at 126 minutes, Dario Argento's seminal psycho-thriller was edited down to 105 minutes for European exhibition and further curtailed to 100 minutes for the American market, where it was dismissed by critics as an incoherent mess. In fact, this was Argento's return to the giallo format following a brief - and unlikely - detour into comedy (FIVE DAYS OF MILAN), and the first time he was allowed to 'cut loose' and indulge his unique sensibilities. All the elements of a classic Argento thriller are here: Eccentric characterizations, outlandish plot twists, and a series of Grand Guignol set-pieces that would revolutionize the genre. Using the wide, w-i-d-e screen to create a bold visual tapestry, Argento's film thrives on offbeat sounds and images: The child's song which pre-empts the shocking murders; the heart-stopping moment when Hemmings glimpses Meril at her apartment window as the killer lunges at her from behind (a shot which is both horrific and profoundly humane, all at the same time); the crazy-surreal mannikin which appears from nowhere and 'confronts' a potential victim; and the climactic revelation of the killer's identity as Hemmings finds damning evidence literally staring him in the face. Hemmings is the heart and soul of the entire picture, an innocent abroad whose inquisitive nature fails to mask his essential cowardice, and there are fine supporting performances by Daria Nicolodi, Gabriele Lavia and Clara Calamai in pivotal roles.<br><br>The European print which played outside Italy is a tightly-controlled whirlwind of horror and suspense, incorporating character development and violence cut from the American variant. However, the complete Italian version is another matter altogether: Except for the extra material added to Hemmings' search of 'The House of the Screaming Child' (where an important clue is literally concealed in the brickwork), the additional footage simply pads proceedings to breaking point. Whereas the characters were once defined by their experiences, the longer print includes lengthy dialogue exchanges which ramble well beyond their relevance to the plot. Still a masterpiece, the movie works best at 105 minutes, though the flawed Italian edition is no less sumptuous and invigorating.<br><br>Sadly, DEEP RED contains one of the most dubious images in Argento's entire filmography: A shot of a lizard impaled on a needle, done for real. This monstrous act of cruelty is inexcusable, given that Argento had hired ace effects technician Carlo Rambaldi, previously responsible for *simulated* animal carnage in Lucio Fulci's A LIZARD IN A WOMAN'S SKIN (1971) which was so realistic, it landed the director in court! <br><br>(English version)","user":"Libretio","rank":[93,126]},{"title":"Symphony in red.","rating":27,"date":"27 July 2005","review":"Young generations might find it hard to believe ,but most of Argento's works were greeted by poor receptions when they were first released.Critics dismissed them as gaudy ,flashy,showy,you name it.<br><br>And now we are in 2005 ,and thirty years after,with hindsight ,that most fruitful part of Agento's works which begins with \"Ucello della piume di cristalli\"(1967) and ends -roughly- with \"opera\" (1987)shows how the frequently demeaned director was ahead of his time.Argento's work is art-house film!If Mario Bava or John Carpenter are,he is too.<br><br>Influenced by the former (color,lighting effects,depth of field,baroque settings),he had a strong influence on the latter,particularly for his use of music,which may seem trite at first listening but literally grows on you and leaves you completely panting for breath.<br><br>There's really an Argentesque geometry,a non -Euclidean one,and few other directors ( Alfred Hitchcock , Roman Polanski ) know how to depict a place and make it threatening for his characters.Argento,who certainly read Gaston Leroux (\"le fantôme de l'opera\" ) when he was young,loves the opera houses(or theater).\"profondo rosso\" begins on a stage where some kind of medium (Macha Meril) sees horrible things.People who have read Hergé's adventures of Tintin will notice the similarities between this scene and those pages in \"the seven crystal balls\" where Tintin and Haddock are watching Mrs Yamilah in a music hall.\"Opera\" 's first scene also would take place in a theater as if the director told us \"it's only a movie,do not worry\" before treating us to the delight of the best scene with birds since Hitchcock's eponymous movie.<br><br>The sense of space which Argento displays is mind-boggling: depth of field,high and low angle shots,impressive lighting effects.His characters become Tom Thumb lost in the huge forest:think of the ballerina ,running away through the corridors (\"Suspiria\" ),James Franciscus in the graveyard (\"il gatto...) ,Tony Musante in the lighthouse (Ucello ...),or Irene Miracle in the basement (Inferno).Here it's a true anthology:almost every place is memorable,from the corridor where the drama is resolved to the house where bad things happened long ago ,from the isolated house in the country -where Argento uses condensation as only a Conan Doyle,a Gaston Leroux or an Ellery Queen could have done it- to the school where weird drawings might be the final clue.To top it all,there's a sensational scene in a corridor ,which recalls Orson Welles' \"lady from Shanghai.A \"they do it with mirrors\" trick which is still very impressive today.<br><br>Not only Argento creates fear with his disturbing settings ,but he makes us also ill-at-ease with his supporting cast:the gay with the androgynous face,the little girl who seems to be out of Fellini's \"Toby Dammit\" (1968),and of course Clara Calamai who was famous in the fascist years (Visconti's \"ossessione\" from \"the postman always rings twice\").<br><br>What about the screenplay?Well,like all Argento's movies I mention ,it's far-fetched and derivative (\"psycho\" ,\"Marnie\" for the final flashback).But it's delightfully far-fetched and smartly derivative .When today's horror flicks screenplays consist of one page (maybe two)of clichés ,Argento's ones have always been painstaking and labyrinthine .<br><br>It is one of the best works in Argento's much debated but absorbing filmography.No horror movie buff can ignore him.","user":"dbdumonteil","rank":[48,66]}]