[{"title":"Better Than It Had To Be","rating":7,"date":"31 January 2005","review":"Jon Peters' first production as he transformed himself (with girlfriend Barbra Streisand's help) from hairdresser to movie producer, the movie is a gem of Seventies style at it's finest. The clothes, the hair, makeup, music, attitude, interiors and locations ride the crest of the high-style wave that flooded the world through the Eighties. Combining the improbable worlds of violence and fashion, with a story that centers on a famous photographer (Dunaway) and her ability to *see* her friends and colleagues being stalked and murdered, *Eyes* has moments of serious suspense, but that's hardly the reason to see this movie. Utilizing the actual photography of fashion god Helmut Newton, the film maker has exquisitely captured the 1978 New York fashion and disco scene in a way that none of the recent looks at the Seventies has been able to, but then, again, this movie was *made* in 1978, not 27 years later. The scenes of photo shoots are particularly fun to watch, with one scene portraying a burning car crash in Columbus Circle in which the models, clad in garter belts and fur coats cat-fight before the camera. The ingenuous use of *real* models add the precise amount of vacuity necessary to make the surreal shot work. Another photo shoot involves a model dead from a gunshot to his heart lying in a pool surrounded by exotically dressed disco-dancing models and a throbbing disco beat. The plot is secondary to style in this movie, and style is the only reason this movie should be remembered. Favorite moment: Darlanne Fluegel as the model Lulu haplessly trying to explain to the press *why* violence is important in fashion photos.","user":"style-2","rank":[42,43]},{"title":"Very well-made supernatural thriller","rating":14,"date":"14 January 2003","review":"This 1978 chiller directed by Irvin Kerschner (RoboCop 2) and based on a story by John Carpenter, has Faye Dunaway as a fashion photographer who suddenly discovers that she has the ability to \"see\" through the eyes of a serial killer. All her premonitions of the murders are very accurate, and the victims are all people she knows. Soon it becomes apparent the killer is coming after her. Tommy Lee Jones is great as the police lieutenant/love interest (back when his face wasn't pockmarked with age), and the supporting cast (Raul Julia, Brad Dourif) is excellent. The movie's depictions of the murders were quite shocking for it's day, and it manages to keep us scared and in suspense throughout, though some of the scenes border on grotesque. Direction by Kirschner is tight, music is suitably eery, and the performances are overall impressive. A winner","user":"bd119-2","rank":[33,37]},{"title":"A stylish thriller.","rating":8,"date":"1 July 1999","review":"This movie was around for twenty years before I saw it. I recall it as not having the best of reputations. But I found it to be suspenseful and it could be considered a forerunner of today's erotic thrillers.<br><br>Faye Dunaway is Laura Mars, a fashion/glamour photographer whose work is controversial in that some say it glorifies both sex and violence towards women. (Sounds like a pretty contemporary theme, doesn't it?) She becomes troubled by frightening visions she has of killers-eye views of murders. When a killing she has just \"seen\" turns out to have actually happened nearby she tells the police. She then finds out that a detective (Tommy Lee Jones) has already been investigating some cases where murder scenes closely resembled her photos.<br><br>Dunaway is always consistent in delivering good performances and this one is no exception. It was refreshing not to see Jones in his \"Mr. Intensity\" character he's played so often since 'The Fugitive.' Although some will doubtless find flaws to point up here and there, I found the film to be very enjoyable. Brad Dourif, Rene Aberjonois and Raul Julia also star. Irvin Kershner's direction is stylish and John Carpenter is responsible for the story and co-wrote the script.","user":"Hermit C-2","rank":[39,45]}]