[{"title":"Good Medicine","rating":4,"date":"4 November 2001","review":"This typical 80's comedy \"Bad Medicine\"stars Steve Guttenberg as Jeff Marx,a young guy who does'nt want to follow his family tradition,but when cold-hearted cynic Dr.Madera(played brilliantly by Alan Arkin)uses a\"saving the peasants\"field trip as a publicity stunt,he soon changes his mind.Set in a spanish medical school,he meets new friend such as Jeff Gladstone(played by Curtis Armstrong,infamous as\"Booger\"in\"Revenge Of The Nerds\"),a hickish drug addict,Carlos(played by Robert Romanus,whose decent,but was better in\"Fast Times At Ridgemont High\"),Cookie(played by Julie Kavner,before her Marge Simpson voice fame),and Liz(played by Julie Hagerty,whose cute as a button as the dead-pan love interest of Guttenberg's).The movie is full of incoherent humor with mexican stereotypes and medical stuff.It does get gross after a while(notably,Guttenberg's flesh wound from being shot by an unsatisfied patient),but this comedy is very good.Guttenberg delivers the same lines and witt he's done in other films like the\"Police Academy\"series,\"Short Circuit\",\"Three Men And A Baby\"and\"Cocoon\".Alan Arkin's performance is also great,this film should of been a major box-office hit.I give Bad Medicine a 8 of 10.","user":"the93man","rank":[8,9]},{"title":"Bad Medicine, no kidding. The movie could use a shot, too.","rating":6,"date":"5 April 2007","review":"OK, these folks had a cast of good actors - in fact there are some pleasant surprises in that department, enough to make this a slightly better than average film. More on that later.<br><br>The screenplay and direction... well, it seems sometimes that any laughs in this thing were accidental - what may have been intended to be the big jokes fall flat, leaving incidental chances for levity. Very occasional chances until well into the film - so hang in there, people, it does get better.<br><br>What excuse does the director offer for this film? If you're going to do accent and ethnic humor, DO it. Don't hire Alan Arkin, then let him sleepwalk through an acting job - make him ACT, more than he did in the first half of this film. Beat him if you must, but do it. Don't let him be a walking ad for Ambien. <br><br>Good points? Steve Guttenberg actually surprised me on this one - he did an excellent job of acting, up there with his opening scenes in \"The Boys From Brazil\" as the young amateur Nazi hunter. So did Gilbert Gottfried, for that matter - he's much better than I have seen him perform in his other films. Bill Macy puts in an honest job, much more than I can say of Arkin, who seems to phone his lines in.<br><br>Production values? <br><br>The camera-work's pretty good - they shot the film in Spain and decent professionals did the technical work, but the person responsible for the soundtrack should be shot for having a very heavy hand with the brass in the orchestra and stealing the guitarist from some backyard porn studio in Marin County.<br><br>Yeah, you should watch it. It's worthwhile if you stick with the film until almost halfway through.","user":"vfrickey","rank":[7,8]},{"title":"I thought it was hilarious","rating":8,"date":"21 May 2003","review":"Some reviewers panned this movie rather severely, but my wife and I thought it was hilarious. Arkin is great, no matter what accent he is using. I especially like Lalo Schifrin's wonderful score. We still occasionally roll the tape and enjoy it again. From some of the comments I have read, I can only gather that the writers confused this picture with the much less entertaining \"Stitches\", released the same year.","user":"tvce","rank":[8,10]}]