[{"title":"Fun Southern-lensed Italian thriller","rating":8,"date":"13 March 2017","review":"Madhouse is thematically (and sometimes visually) similar to the Canadian slasher Happy Birthday To Me, but it goes about telling its story of sibling slashing in a very different way.<br><br>Shot in Georgia, but using an Italian creative team, Madhouse has a strange sense of time and place. Where is this exactly? It it in the past? Is it now? It's one of those things you'll only get when you mix and match crews and locations like this.<br><br>The acting from lead Trish Everly is quite good and she makes for a sympathetic heroine who just wants to be left alone by her sociopathic, deformed sister who just escaped from a loony bin and has brought her vicious dog with her.<br><br>At this point, pretty much everyone in our heroine's life is fodder for her sister's knife blade and dog's sharp teeth, which leads to some very creepy moments of victims wandering around a spooky Georgia mansion and getting picked off one by one. It all culminates in the nastiest corpse birthday party since...well, Happy Birthday To Me. The ending even got a real jolt out of me.<br><br>If I had any complaints, it would be that the reveal of a 2nd killer mid way through the film is accompanied by a lifeless, suspense-free chase scene that goes on far too long. It's also at that point that the film becomes a bit too campy due to both the killer and victim's performances.<br><br>The visuals are stunning, the music score is super weird, and there's enough gore to satisfy gore hounds, but not turn off more sophisticated viewers. Definitely worth your time!","user":"carolinephillips-47427","rank":[5,5]},{"title":"Not deserving of its 'nasty' label.","rating":7,"date":"20 December 2008","review":"Madhouse stars Trish Everly as Julia Sullivan, a teacher at a school for the deaf, whose hideously disfigured and sadistic twin sister, Mary, resides in a nearby mental hospital. Four days before Trish's birthday, Mary escapes in order to arrange a special party for her unsuspecting sister...<br><br>In the United Kingdom in the 1980s, movies released on home video became the target of a hate campaign led by Britain's über-vigilant defenders of moral decency: the press, bored housewives, and Conservative politicians. As a result, a list was compiled of the films they deemed to be most offensive; these titles became known as 'Video Nasties' and were seized from shops before they had a chance to work their evil influence on an unsuspecting public.<br><br>Ovidio G. Assonitis's Madhouse was one such 'nasty'.<br><br>Featuring a bloodthirsty rottweiler, a frenzied axe attack that reduces the victim's back to a bloody pulp, and a messy canine lobotomy by electric drill, it quickly found itself added to the list of titles most likely to corrupt and deprave. It didn't matter much to the moral crusaders that the film was also a well-crafted psychological chiller that delivered plenty of atmosphere, memorable performances, and some lovely cinematography; no... this film featured a dog receiving a drill-bit between the eyes, and we can't have people watching that kind of stuff, can we?<br><br>Two decades on, and Madhouse is now available uncut on DVD; it seems that the people of the UK have since developed to a stage where they are able to handle such horror without it turning them into murderous lunatics (either that, or the authorities have actually realised they were wrong and the film was never that disturbing in the first place). Oh well, better late than never, I suppose...<br><br>Ironically, Assonitis's film is perhaps a little too slow and lacking in gore for today's casual horror viewer, but for seasoned fans of the genre, it offers plenty to enjoy: there's the mystery of the identity of a second killer (not too hard to guess, but fun nevertheless); a great OTT performance from Dennis Robertson as Father James, Trish's nursery-rhyme singing uncle; a likable heroine; a brief performance from Morgan Hart as very tasty, blonde rottweiler fodder, Helen; and a ghoulish final scene that is remarkably similar to that of a Canadian slasher, Happy Birthday To Me (who stole from whom is debatable, since both films were released in the same year).","user":"BA_Harrison","rank":[11,14]},{"title":"No Accounting For Taste","rating":8,"date":"30 August 2006","review":"Tasteand what it reveals about a person--is a funny thing. For example, there are flicks I simply like, regardless of what others say, regardless of critical reviews. In fact, all of us have favorites that might not hold much sway with the general public. In these films, there may be stupendously bad acting, scenery, costumes, sets, and narrativebut nevertheless there's something \"ineffable\" about them that jibes with our personal tastes and personal aesthetic in some inexplicable way. We just LIKE them, even though those around us say we have no taste at all. (I hear this a lot.) <br><br>So, a strange taste-related revelation occurred to me recently as I watched the UK R2 DVD release of \"Madhouse\" (aka \"There Was A Little Girl\"a MUCH better title, by the way). As I watched, I thought to myself, \"Sure the 'Crazy Deformed Twin Sister is Going to Kill Me' plot is derivative, but it is nicely composed. As I watched, I also thought the photography was carefully done, with good use of colors, and nice use of the scope format. The mood was unbearably somber and tense. The denouement was appropriate, and I jumped accordingly at a few spots. Finally, I wondered to myself, 'Who made this film?' As I turned the DVD box over to find out, I saw<br><br>Ovidio Assonitis! And that's when I realized my tastes were somehow inextricably linked to this director/producer and his aesthetic. Just about every knockoff horror film he has made in his career, I simply love, love, LOVE! Beyond the Door (Exorcist Clone), The Visitor (an Omen Clone], Tentacoli (Jaws Clone), Who Saw Her Die?though my friends shake their heads in disbelief, I have that same taste-related, inexplicable, unwilling gut-reaction to all these films: I like this! I like the way it is photographed. I like the pace. I like the way the plot rolls outor the way the plot disappears entirely in some cases. I like the characterizations, the effects. I like the outrageousness of some of the scenes. The music works just right. I just like his films. Ovidio Assonitis is all-right by me! Not surprisingly, known as the \"Rip-Off King,\" Assonitis is railed against hither and thither. Even those who are appreciative of his films feel obliged to say things like, \"You know, it wasn't so bad,\" or \"It wasn't as horrible as I thought it might be\" (just look at some of the reviews right here).<br><br>But I think I just discovered that I am an unabashed Ovidio-junkie. He makes the perfectly derivative, low-budget (but nevertheless big-minded, carefully-made, professionally shot) crap I absolutely adore. On the surface, the films are nothing but a cash-in on whatever is trendy at the time. No one disputes that. But these films all saw major theatrical release because, simply put, they are extremely well-made, seriously photographed, professionally acted and scored flicks. They take what they do seriously, even though it's all been done before (and with bigger budgets). These films are great products, including \"Madhouse.\" The UK DVD is also impressive and it shows Ovidio at his film-cloning best. As I mentioned, a great use of the scope format; nice authenticity of settings and background actors (the female protagonist who is being stalked by her deformed twin sis works in a school for the deaf, and real deaf-kid-actors are used to incredible effect in the film); nice use of colors; a nutsy ending. Hey maybe, I'll start an Ovidio Fan Club. In the meantime, though, check this out.<br><br>And, by the way, when the heck is Ovidio's apocalyptic \"The Visitor\" (Lance Hendricksen, John Huston, Shelly Winters) ever going to see the light of day on DVD?","user":"wkduffy","rank":[16,23]}]