[{"title":"Certainly one of the best in the series.","rating":8,"date":"4 March 2008","review":"Our intrepid bumbling duo deliver the goods in one of the better offerings on their considerable CV. Here they are freshly qualified Private Investigators thrust into a murder investigation with an invisible man. That alone should tell you that the fun flows at a very decent clip, so with that I just need to say that some of the sequences here are comedy gold. Like a scene at a restaurant that is excellent, or Costello pretending to work the ball in the gym, and a final reel of a boxing match that really gets the laughter flowing. Watching these guys act as if with a real invisible man is wonderful, and of course the effects team also deserve praise for doing such a damn fine job with the invisible man of the piece.<br><br>Not quite as good as...Meet Frankenstein, but it's darn near close. 8/10","user":"hitchcockthelegend","rank":[13,13]},{"title":"A Surprising Amount Of Laughs And Maybe A&C's Best","rating":8,"date":"30 March 2007","review":"I only watched this once, but that's my loss. I should see this again. Although not a big fan of these guys, I thought this was their funniest film, along with Abbot &amp; Costello Meet Frankenstein. Although the latter is considered their best and most popular movie, my vote just might go to this one.<br><br>This film was simply a lot of laughs from start to finish and the special-effects with the invisible man are good, too - even over 50 years later! The boxing scenes at the end of the movie are incredibly hokey but they are humorous as the \"invisible man\" helps Costello in the ring.<br><br>Sometimes silly, sometimes stupid but generally fast-moving, this film is highly- recommended for those looking for an innocent, old-time comedy with a surprising amount of laughs.","user":"ccthemovieman-1","rank":[15,17]},{"title":"Lou \"The Looper\"","rating":7,"date":"25 October 2005","review":"Bud Abbot and Lou Costello were an amazing comic team who endeared themselves to their fans with the kind of humor they projected; theirs was the kind of good fun with a lot of sight gags that made them one of the favorite duo in the movies for quite a while.<br><br>Universal, their studio, decided to showcased them in a series of movies that involved the \"monsters\" in its roster. This film is not one of those, but because of the usage of the amazing visual effects employed in using the visual effects in the \"Invisible Man\", it became a winner from the start.<br><br>This was one of the best Abbot and Costello's best movies. Both do excellent work under the direction of Charles Lamont. Arthur Franz, who is not \"seen\" enough is good as Tommy, the man accused of a crime he didn't commit. Sheldon Leonard is one of the gangsters that are manipulating the boxing matches. Nancy Guild and Adele Jergens are welcome additions to the movie.<br><br>Best of all are the boxing scenes involving Lou Costello as the amazing new boxer, Lou, \"The Looper\", who goes to beat Rocky, his better equipped opponent with a little help of his invisible friend.","user":"jotix100","rank":[7,7]}]