[{"title":"The Crime of Being too Human","rating":9,"date":"13 May 2009","review":"The Asphalt Jungle (1950)<br><br>One after another, the criminals in this metaphoric Asphalt Jungle meet their necessary demise. It isn't the jewel heist, functional and classic, that matters. It's the personalities that wind themselves up and then wind back down through the raspy knot where they intersect, and where they fall to unexpected side effects.<br><br>What do we make of the clichés here? The mastermind of the heist is not such a bad guy, the getaway driver is a sweetie who loves cats, the safecracker has a wife and young baby, the \"hooligan\" is a misplaced sentimentalist who only wants the old farm his family lost to bigger forces. In fact, these \"bad guys\" are really just you and me, and bigger forces are always out there ready to squash us. So conniving a little jewel theft is not going to hurt a soul, and the presumed victory over inconsequence is huge.<br><br>Or would have been. Maybe it's not coincidence that the biggest impediment of all comes mostly from a duplicitous lawyer, and here we have a character actor, Louis Calhern, sharpened and amplified by director John Huston, a master at making the ordinary just acceptably larger than life. So the man has a cash flow problem, and his suffering and his hapless conniving is alone enough to recommend the film. The small, sad part of his wife, played by the ruefully cheerful Dorothy Tree, only twists the knife, reminding him, and us, of what this man could have had, ordinary happiness. But no one in the movie wants to be ordinary, Calhern has a young Marilyn Monroe, no less, for his diversion. <br><br>Then there are the core contract players in the gang, including a sweaty Marc Lawrence as the fumbling lynchpin connecting them all. As the requisite hooligan, Sterling Hayden is convincing enough, but maybe it is the pathetic desperation of his sometimes girlfriend, played by Jean Hagen, that rips your heart out. At least until Hayden falls in the grass and the horses come to graze by his head, as if we have entered a dream, a thousand miles from from any asphalt or jungle, far far from tension and sorrow of any kind.<br><br>Considered a major film noir, it can also be seen as a major ensemble heist film. Though the gloom is noir enough, it lacks what I think of as the core quality of noir--alienation-- though there is, at least, Hayden's sad listlessness. But it's a great movie with a plot that is useful for bringing out the vivid characters. Everyone talks about how the cast is perfect, and the cast really is perfect. And the cast is perfectly directed, which is a whole other wonder.","user":"secondtake","rank":[21,21]},{"title":"Another Sublime Noir","rating":9,"date":"1 January 2011","review":"Coming at the end of the decade in 1950 - which effectively ended Hollywood's much cherished Golden Age - was MGM's THE ASPHALT JUNGLE. A superbly structured gritty crime drama it was one of the last of the great Noir thrillers. Produced for the studio by Arthur Hornblow Jr. from a novel by W.R. Burnett it was beautifully written for the screen by Ben Maddow and John Huston and outstandingly directed by Huston. The assembled cast couldn't be better even down to the smallest parts such as Ray Teal turning up as a patrolling policeman. The picture is notable also for an early appearance of Marilyn Monroe as the kittenish ingenue of shady lawyer Louis Calhern. Stylishly photographed in stunning black &amp; white by Harold Rosson THE ASPHALT JUNGLE has joined the ranks, alongside \"The Killers\" (1946) and \"Out Of The Past\" (1947), as the finest Noir ever made.<br><br>An old time criminal Doc Redinschneider (Sam Jaffe) has just been released from prison and has devised a plan for the \"perfect\" caper (\"I could sell it on the open market for $100,000\"). He approaches a small time racing \"fixer\" Cobby (a brilliant Marc Lawrence) who in turn arranges with dishonest lawyer Alonzo Emmerich (Calhern) to finance the heist of a million dollar diamond haul from a major jewellery firm. Emmerich is also to act as a \"fence\" to offload the gems. Hired is expert safe-cracker Louis Ciavelli (Anthony Caruso), the humpback Gus (James Whitmore) as the driver and a small time hoodlum Dix Handley (Sterling Hayden) as the group's strong arm. The robbery itself is a success (a riveting intense sequence) but things start to go terribly wrong. First Ciavelli is accidentally shot and then Emmerich, along with an accomplice (an impressive Brad Dexter) attempt a double cross which is thwarted by Dix after a shootout. With the loot now just so much junk Reidinschneider and Dix must go on the run. The movie culminates with Emmerich committing suicide, Redinschneider, Cobby and Gus being arrested and ends with the fatally wounded Dix making a dash out of the city to reach his family farm in the country.<br><br>Performances are terrific! Hayden was never better and only came close to matching this portrayal six years later in Kubrick's brilliant \"The Killing\" (1956). Outstanding also is Sam Jaffe as the master criminal, Louis Calhern as the crooked lawyer, Marc Lawrence as the \"fixer\" (\"I always sweat when I count money - it's the way I am\") and John McIntire as the determined Police Commissioner. All things considered THE ASPHALT JUNGLE is probably the most perfectly cast film ever. The only minor disappointment is the sparse music score by the great Miklos Rozsa. There is a splendid dramatic main title and continues after the credits for a short while but then no more music is heard until the final six or seven minutes of the picture when there is a hectic rhythmic orchestral statement to accompany the mortally wounded Dix and his frantic drive to his family's farm. Then as he reaches home, collapses and lays dying in a pasture the music segues into a reflective melodic theme for the end title. The lack of a full score however is but a minor quibble and does little to alter the fact that THE ASPHALT JUNGLE remains an exercise in meticulous motion picture making.","user":"jpdoherty","rank":[59,65]},{"title":"One Of The All-Time Best Noirs","rating":10,"date":"23 December 2005","review":"I am a fan of film noir, owning many of them, and this one is right about at the top of the list and climbing each time I view it. It might even have passed Double Indemnity for the number one spot. It's that good.<br><br>For anyone who has not seen it: the poster art and the video/DVD cover are both misleading. They usually feature Marilyn Monroe in publicizing this movie, but she only has a small role. Many times they feature Monroe, Jean Hagen and Sterling Hayden all together....and those three are never on screen at the same time. My point being: what you see on the outside is not what's on the inside.<br><br>Hayden is the star of the film but Sam Jaffe and Louis Calhern are not far behind. In fact, the more I watch this film, the more I see the latter two as the real stars here, and I especially have begun to appreciate the great acting by Calhern in here.<br><br>Actually, everyone performs at a very high level. The diverse and interesting characters are really fun to watch, one of the big reasons I rate this film so high. Hayden, with his big body and tough demeanor, was perfect for film noir. He is a legitimate tough guy, nobody to fool with. Jaffe was fascinating as the little German \"doctor\" but until I got the DVD and put on the English subtitles, I never understood all his dialog, which is terrific, and \"Doc\" is my favorite character in this film. Kudos also go to James Whitmore and Marc Lawrence for great supporting role performances.<br><br>The two women, Hagen and Monroe, also do their bits nicely. I never understood people who criticized Monroe's acting. I thought she was pretty good right from the start, with this film as an example. I also liked seeing her thin and in shape. <br><br>This movie is a gritty, tough, no-nonsense crime story concerning a jewel robbery where things go wrong and eventually does everybody in. Actually, it isn't just a botched robbery that ruins some of them - it's character weakness, from greed to sexual lust.<br><br>\"You reap what you sow\" could be a moral of this story.","user":"ccthemovieman-1","rank":[115,136]}]