[{"title":"Utterly underrated","rating":9,"date":"8 January 2008","review":"It is my firm conviction that DeepStar Six will one day be regarded as a good movie. The current 3.9 rating at IMDb is, to my mind, ludicrous and flat-out wrong. It may not be an incredible, immortal masterpiece - I do have to admit it is second to The Abyss - but this is definitely a good movie in virtually every way. For the last fifteen years I've owned a VHS tape of it recorded from a laser-disc version, and seen it loads of times. Today I got the Region 2 Widescreen DVD, and I was once again confirmed in my opinion that this is a fine movie. It is underwater sci-fi horror, and one of several such movies from the era, but except that it doesn't have the clout, effects wizardry and budget of a James Cameron attached to it, it manages to be an extremely well-crafted production none the less.<br><br>The actors are great. Every one of them have absolutely unique and realistic character traits and the dynamism between the crew is superbly entertaining. Nancy Everhard as a soft-spoken female navy seal is played with humble sincerity and feminine sensitivity, making for a very realistic package. Nia Peeples is the sexiest thing you ever saw, and the one whose intuition foresees the whole thing. Miguel Ferrer is even more obnoxious here than in Twin Peaks, yet also profoundly pitiable. Everybody gives an amazingly human and believable performance, and the action and production values are overall perfectly adequate and effective, succeeding entirely in suspending the viewer's disbelief.<br><br>To the day I die, I will maintain that this is a good movie. And posterity will prove me right. One day...<br><br>9 out of 10.","user":"sarastro7","rank":[77,94]},{"title":"A good time-waster","rating":7,"date":"22 July 1999","review":"I don't see why people keep on trashing this movie which has no more shortcomings or implausability than most blockbusters.<br><br>Maybe because, as everybody seems to think, everything that has no big stars and isn't the latest multi-billion brainless disaster can't be good ? This one is more disaster movie than monster movie, since the giant crab is only one amongst many problems the survivors has to face. Nothing great, nothing to lose sleep over, just cheesy B fun. So why all this hate when \"Leviathan\" was a bigger-budgeted but even more stupid and derivative heap of ....","user":"Phroggy","rank":[51,67]},{"title":"USO's: Unidentified Swimming Objects","rating":5,"date":"5 July 2004","review":"The name Sean S. Cunningham will automatically always be attached to 'Friday the 13th'his notorious teen-slasher that messed up the genre for good. Yet, Mr. Cunningham did do a few slightly more ambitious projects. This DeepStar Six is a semi-successful undersea-monster mash with surprisingly good acting, decent special effects and a couple of good old-fashioned scary moments. The film deserves a reasonable rating, slightly higher than all other lame and laughable Ridley Scott and James Cameron wannabes. The plot involves an 11-headed crew that is about to finish up a 6-month research at the bottom of the ocean. When exploring the ocean floor, they accidentally stumble upon a hideous and relentless monster. Like it usually is the case in this type of films, it takes a little while before you actually get to see the monster. By that time, human stupidity already exterminated half of the cast. Granted, the monster itself is one ugly critter and not at all badly put together by the special effects department. <br><br>Butlet's not praise this film too much, because it simply remains a rather anonymous 80's monster movie like we've seen them so many times before already. Not one action presented here isn't inspired by or similar to the ones featuring in other films and every character is a flawless stereotype. The performances given by the entire cast actually outshine the roles they're playing. Highlight of them all is Miguel Ferrer who portrays the typical, cowardly crewmember. Constantly complaining and arguing at first and when the monster shows uphe flees to and leaves his colleagues to their own device. Every monster flick stars a bastard like that, you know. As well as the super-intelligent and over-ambitious female scientist and the heroic captain who sacrifices himself in order to save his crew. If you ignore these inevitable weaknesses, you'll certainly have fun. You get what you expect, and that doesn't necessarily have to sound like a bad comment.","user":"Coventry","rank":[41,55]}]