[{"title":"A great anti-classic","rating":28,"date":"28 September 2003","review":"SHOGUN'S NINJA has so many strange and cool aspects in it, it's hard to even remember it all.  Whereas its more fantastical counterpart LEGEND OF THE EIGHT SAMURAI (which even has lots of the same casting) is somehow too disjointed, SHOGUN'S NINJA remains cohesive and fun to watch through all two hours; I couldn't take my eyes off it.<br><br>The basic plot revolves around the dying Momoichi clan after Takamaru returns (played by Henry Sanada, in this role looking so much like NINJA SCROLL's Jubei that they must've seen this film).  The clan members have steadily been eradicated by the evil Shogun (Sonny Chiba!) and so have to learn all they can to strike back.  Along the way, there are so many outrageous stunts, traps, and elements that you will be unsure whether to laugh or stare in awe; more on those later.  Takamaru is aided by a pair of kung-fu women (one of whom, Airin, is most likely the inspiration for \"Tekken\"'s Xiaoyou), the reluctant warrior Hanzo (who is quite reminiscent of Patrick Stewart with hair), and more ninjas than you can shake a stick at.  Shogun wants Takamura's swords, because their blades hold the map to the Momoichi gold cache.  This of course leads to confrontation after confrontation, with every weapon imaginable and more gory deaths than you can count.<br><br>But enough about the plot, which is somewhat tenuous.  SHOGUN'S NINJA should be viewed for its crazy features.  These include (in some semblance of order) harakiri, a circus monkey, slo-mo kicks, spider AND mole ninjas (not ninja spiders, but almost as cool...), an escape by candle, kung-fu handmaidens, execution by hot oil, human shields, a white-haired master, a booby-trapped forest (complete with ninja tack!), and a showdown in a rock quarry.  Yes, that's right, all that crazy crap is in the movie; look for it all!<br><br>One of the movie's funniest elements is its music; everything from battle sequences to casual conversations are underscored by psychedelic '70s jazz. At first seeming inappropriate, the score grew on me as the movie continued, being edited in quite well and seeming to actually be written FOR the movie (a frightening prospect in itself!).  While some might berate the soundtrack, it must also be taken into account that the immensely popular \"Cowboy Bebop\" employs a similar style of music that is anachronistic and yet creates a jarring shift in mood; in battles that would otherwise be fraught with tension, the lounge-style sounds kept me from being too involved and were, overall, entertaining!<br><br>In addition to the previous list of thingamabobs, SHOGUN'S NINJA still has some surprisingly reflective and artistic moments, from a staredown through steam to flashbacks of a pool of blood.  The director obviously knew what he was doing, assembling a competent cast and putting them together in an epic movie that is still over-the-top.  Be sure to watch this movie with a load of friends, and you will certainly enjoy yourselves.  My rating: 8.5/10","user":"groovycow","rank":[13,15]},{"title":"Best Ninja movie of all times?","rating":8,"date":"1 November 2000","review":"This is truly one of the coolest Ninja movies of all times. The stunts are top-notch and the action is non-stop. As usual in these films it gets pretty campy indeed, but on a whole it´s out standing. Watch out for hilarious stunts when our hero blocks arrows, Ninjas climb trees as vigorously as Spiderman and digging through the ground as moles. This is the film that made me want to become a Ninja as a kid and it leaves Sho Kosugi way behind. A must-see for any lover of martial arts and action!","user":"jamesbond","rank":[8,11]},{"title":"Epic movie loosely based on Japanese history","rating":10,"date":"5 November 2004","review":"In the beginning there was a very handsome, half naked man alone on a boat,<br><br>eating raw fish..., Then, there was an white bearded old teacher who'd showed the boys how to fight and said really wise things. Than, there were some nicely choreographed fights ,some gorgeous scenery and costumes, a bit of romance<br><br>ending in tears... Then the good guys took revenge on the bad guys meanwhile changing the course of history for the better. what is there not to like...?:o))) The first Martial Arts movie I ever saw at the cinema. I remember going back to see it maybe 4 or 5 times. I was about 13 years old and the only girl in the<br><br>cinema. good old days! If I could get hold of a copy I would watch this film 4 or five times more!","user":"fifthdigitdesign","rank":[5,10]}]