[{"title":"Sugary Melodrama","rating":7,"date":"2 December 2005","review":"James Stewart and Carole Lombard meet and marry on impulse while Stewart is in Boston on a case.<br><br>When they get back to New York the two of them go through a lot of the trials that newlyweds do, a seemingly unfeeling and uncomprehending boss, a bitter mother-in-law for Lombard, a new baby and then a sick toddler. I guess the fact that they get through it all is proof that they were indeed Made for Each Other.<br><br>Other reviewers have noted some similarities between It's A Wonderful Life and Penny Serenade. They are certainly there. What's not there is the screwball comedy that we remember Carole Lombard for. No laughs in this one, she plays this quite seriously and shows her versatility.<br><br>Stewart however is pure Stewart. It's as if Jefferson Smith had gone to law school instead of becoming a Boy Ranger. He's so idealistic and full of hope as he starts married life with Lombard. As he appeals to Charles Coburn for financial help to save his kid, the whole audience in the theaters must have felt along with him.<br><br>The two have some problems keeping household staff and when they find one they really like, their budget crunch forces them to let Louise Beavers go. Though it sure has some racial clichés in it, my favorite moment comes from Louise Beavers in that scene with Carole Lombard as Lombard tells her they will have to discharge her. Beavers is a woman with real heart and soul and her words of comfort to Lombard never fail to move me.<br><br>For fans of melodramatic soap opera and the two stars. Some may find Made for Each Other too saccharine, but I like it.","user":"bkoganbing","rank":[37,41]},{"title":"Touching (if flawed) story of likeable young married couple.","rating":14,"date":"14 March 1999","review":"Jimmy Stewart and Carole Lombard make an incredibly appealing couple, one whose everyday middle-class joys and sorrows you like sharing.  That's all there is to the movie, pretty much, Jimmy and Carole get married, have a baby, deal with in-laws, money troubles, changes in their relationship, all the things everyone does.  It's the opposite of an Action Flick, here domestic sorrows like pay cuts and not having a baby sitter on New Year's Eve are treated as seriously as real people treat them, and the movie is well made enough that you care.  Who couldn't care about such nice, funny, sensitive people?  For much of its length, it's a better \"Penny Serenade\".<br><br>The place where it falls apart is the ending, which is a ludicrously inappropriate melodrama about flying medicine in from thousands of miles away in a storm, it just doesn't belong in the same movie.  But, I like the story behind it: Like a character in the movie, producer David Selznick's brother Myron (a power agent) was taken seriously ill, and was basically given up for dead. A doctor said that the only thing that could save him was a rare/experimental drug that wasn't available in LA, it had to be flown in from the east coast in terrible weather.  The Selznick family sweated for hours, trying to keep in touch with a heroic pilot who was risking his life to save a stranger.  When the pilot landed safely and Myron was saved, David Selznick the workaholic producer said \"This it too good to waste on Myron. Let's put it in a picture!\"  I just wish he'd waited for a better place to use it.","user":"otter","rank":[26,29]},{"title":"A disjointed tearjerker - uneven, maudlin and overall not up to snuff for Stewart and Lombard","rating":6,"date":"15 June 2005","review":"\"Made for Each Other\" stars resident scatterbrain, Carole Lombard and congenial James Stewart as Jane and John Mason, a couple on a whirlwind romance to nowhere. John works for a curmudgeon judge, Joseph Doolittle (Charles Coburn), a professional alliance that is at odds with the effervescence of his newlywed life. A greater hurdle to overcome is Jane's live in mother, Harriet (Lucile Watson) who intrudes upon the couple's idyllic domestic paradise with all the tact and humility of the proverbial bull in a china shop. By the time New Year's Eve rolls around the edges of martial Shangra-la have become so frayed that both John and Jane contemplate the longevity of a future together. Their sudden realization that their marriage may be over, which takes place amidst the gaiety of romantic couples celebrating the New Year, reaches a level of heartbreaking poignancy that, alas, the rest of the story lacks. Financial stresses brought on by a change at work eventually culminated with a devastating illness that may claim the life of John and Jane's infant.<br><br>Director John Cromwell spins a cinematic tapestry of lives that are the embodiment of those proverbial ups and downs we all encounter in life  at least during the first two acts of his story. Cromwell's sprite and accessible direction allows even the sensitive charm and poignancy of secondary characters their chance to shine. Unfortunately for all concerned, the last act of this story is maudlin melodrama and an insane layering of cliché that drives the story into a downward lack of restraint. Though the effervescent triumph of the human spirit is never far from Cromwell's vision for the film, it's ultimately that old fashioned sentiment that salvages the whole affair from becoming overly sweet or dire.<br><br>MGM's DVD is impressive. The B&amp;W picture exhibits a very nicely balanced gray scale with smooth, solid blacks and very clean whites. Age related artifacts are present throughout but do not distract. Some minor edge enhancement crops up and there is more than a hint of pixelization in infrequent spots but overall the picture will surely not disappoint. The audio is mono but more than adequate for a film of this vintage. There are no extras.","user":"movieman-200","rank":[16,17]}]