[{"title":"Loony, Light and Love?","rating":6,"date":"15 July 2017","review":"Tower of Terror is directed by Lawrence Huntington and written by John Argyle and John Reinhardt. It stars Wilfrid Lawson, Michael Rennie and Movita. Music is by Eddie Benson and cinematography by Walter Harvey and Ronald Anscombe.<br><br>A lighthouse keeper gets bent out of shape when a woman who looks like his dead wife seeks refuge.<br><br>3 miles off the German coast - Westerrode Lighthouse - lonely outpost of the North Sea.<br><br>Keep Your Chin Up!<br><br>Hee. OK, we are in a movie that has British actors playing pesky Germans, so get past that and there's a most intriguing picture to be enjoyed here. Core of the story is two-fold, one part is a macabre thread where Wolfe Kristan (Lawson) is clearly unhinged and unhealthily thinks Concentration Camp escapee Marie Durand (Movita) is his dead wife. The other thread involves spies, fronted by a straight backed Rennie, and the search by the Germans to locate something important in his grasp. Naturally the play unfolds at the titular lighthouse of the title.<br><br>And so we have shoot-outs, awesome mano-mano fight (Kristan has a hook for his right hand), some nifty model work destruction, period flavours (large square kettle - hooray) and lots of shadowy photography. There's even an absolute peach of a left hook thrown that looks real! While the finale excites and has a touch of horror about it. This be no earth mover in thriller terms, but it's gloriously old fashioned and entertaining while it's on. 6/10","user":"hitchcockthelegend","rank":[5,6]},{"title":"Barnstorming thriller in a claustrophobic lighthouse setting","rating":8,"date":"8 September 2016","review":"This excellent wartime thriller is a film that benefits from a low budget for once. The setting for the film is a lighthouse in Germany, and most of the running time takes place within the claustrophobic confines of the building. It's an essential three-hander about a maladjusted old lighthouse keeper who has been spending too many years by himself, and two other characters who join him and both have their own hidden motivations: single-named actress Movita, recently escaped from a concentration camp and desperate to evade the authorities, and undercover spy Michael Rennie.<br><br>It's a great setup and thankfully TOWER OF TERROR is a film that doesn't disappoint. The short running time flies past with plenty of different sub-plots, each of which turns out to bear relevance to the main storyline. I love spy and resistance films set in occupied Europe during WW2 because they're inherently tense and suspenseful and this film is no exception. However, it's also a towering portrait of psychological angst and disturbance, similar in ways to the classic Bluebeard story.<br><br>The quality acting really enhances the story. Movita makes the most of her role and is far more than your usual damsel in distress. Rennie is young, agile, and likable as the spy you don't want to see get caught. Best of all is Wilfrid Lawson as the lighthouse keeper; initially he's presented as an underdog hero character before his true personality comes to the fore, and it's an excellent reveal. Even George Woodbridge appears, playing an Nazi and looking much more youthful than in his later Hammer roles. TOWER OF TERROR is an excellent little film that thriller fans are sure to love.","user":"Leofwine_draca","rank":[5,6]},{"title":"Life in a lighthouse","rating":7,"date":"9 May 2011","review":"An escapee from a concentration camp, Movita (Marie Durand), is rescued by Wilfrid Lawson (Kristan) at the lighthouse where he works just off the German mainland. He is German but isn't as patriotic as he is fixated on this woman who has turned up at his lighthouse and who resembles his wife who apparently drowned several years ago. At the same time a British spy, Michael Rennie (Anthony), fools Wilfrid into thinking that he is his co-worker who he is expecting to come and work with him. Rennie is really biding his time before he can make his getaway to England on an expected passing ship. Can Rennie make his getaway before he is revealed as an impostor and can Movita escape her German captors and more importantly, the desires of the complete madman that is Wilfrid Lawson......? <br><br>There is an interesting premise to this film as it is set on an island with a lighthouse. It gives 100% credence to the notion that lighthouse keepers are complete freaks. Wilfrid Lawson is excellent as an oddball lighthouse keeper with a hook for a hand who is afraid of no-one, rude to everyone and definitely very scary to live with. Check out what he keeps in his basement! At the end of the film, he just goes to another planet called planet INSANE and you really don't want to be there with him, especially if you are female. Whilst the story is entertaining, I thought that there could have been a better way of signifying who the Germans were. Still, it is a different story and I'll be keeping it to watch again.","user":"AAdaSC","rank":[6,8]}]