[{"title":"One of the more interesting titles produced by Cannon.","rating":7,"date":"21 March 2015","review":"Things are going very wrong at the high school attended by crusading newspaper editor Donny Lennox (J. Eddie Peck). There's a student group there named The Sentinels, ostensibly formed to act as something of a security force. But now the group is out of control, and is bent on eliminating any individual whom they deem \"undesirable\". Now people are actually dying.<br><br>Give these filmmakers credit for at least *attempting* to deal with serious subject matter in a reasonably sincere way. Director Albert Pyun works from a script co-written by leading actor John Stockwell. Stockwell (\"Christine\", \"My Science Project\") plays unofficial Sentinels leader Randy McDevitt. The movie features some of the trappings of the period, namely, fashions and the hip soundtrack of artists ranging from Robert Palmer to Fine Young Cannibals to The Smithereens. But it's fairly stylish and slick, and not gratuitously gory. The story is entertaining and provocative enough to draw the viewer in, and there is a potent theme about the danger of blindly following somebody's lead.<br><br>An array of recognizable faces play roles big and small: Carey Lowell (\"Licence to Kill\"), Don Michael Paul (\"Heart of Dixie\"), Bradford Bancroft (\"Bachelor Party\"), Madison Mason (\"Dreamscape\"), Thom Mathews and Miguel A. Nunez Jr. from \"The Return of the Living Dead\", Gerard Christopher (\"Tomboy\"), Carmen Argenziano (\"The Accused\"), Dedee Pfeiffer (\"Vamp\"), Karen Witter (\"The Vineyard\"), Angel Tompkins (\"The Teacher\"), and Rosalind Allen (\"Ticks\"). The performances, much like the movie itself, do earn points for sincerity.<br><br>Only a last minute reveal involving the Krooger character genuinely annoyed this viewer. Overall, this is a decent 1980s effort waiting to be discovered or rediscovered.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[6,8]},{"title":"Similar to Brotherhood of Justice. Coincidence or not?","rating":29,"date":"29 February 2004","review":"Reading the synopsis to this film, I was reminded of movies like Skulls and Disturbing Behavior, where a small, tightly protected group of richies form an underground society to target unwanted classmates.<br><br>This movie, written in part by actor John Stockwell who portrays the unofficial leader of the Sentinels, Verde High's fascist secret society formed to \"serve and protect\", is nearly identical to a made-for-tv movie released the same year called Brotherhood of Justice. Brotherhood was based on a true story of a secret society formed at a Texas high school that eventually went from theft and vandalism prevention to goals of extreme violence. So, I wonder if the writers of Dangerously Close were inspired by the same events. <br><br>The major differences between the two, however, are that Brotherhood of Justice is primarily told from the viewpoint of one of the leaders of the gang, while Dangerously Close is seen from the viewpoint of one of their prospective victims. And, secondly, in Dangerously Close, the high school principal, sponsor of the gang, was the pivotal force behind the murders. The Sentinels were only supposed to rough up a few of their targets. The Texas High School events which Brotherhood is based on, left out the involvement that the gym coach had in the secret society. That is why I think both films were inspired by the same events. <br><br>It was alright. I've always enjoyed John Stockwell, or at least his earlier appearances and behind-the-camera work. It was also nice seeing Robert Russler, though only briefly. I thought it was a pretty good B-rated thriller.","user":"vertigo_14","rank":[7,10]},{"title":"Yes! Cannon Films produced very good movies. This is one.","rating":9,"date":"27 October 1999","review":"Probably the best movie Albert Pyun directed. First rate cinematography and photography (shades of blue and red during the night scenes especially). So-so actors but with a special mention to Mr Stockwell and J. Eddie Peck (whatever happened to him anyway after that movie?).The screenplay is the best on this subject.Most of the time in college/high school movies, the fact of being different is an issue and you end \"normal\" at the end (She's all that and others very bad stuff). Here, being different is enough to get you killed. This is the most interesting part of the plot : it got an unusual political and sociological issue that is scarier than any Scream movie.  Be sure to see the movie til the very last image and you'll know why. Great suspense that makes you think!","user":"Superwonderscope","rank":[11,18]}]