[{"title":"Symbol, history, and myth.","rating":10,"date":"22 April 2000","review":"In his otherwise excellent book, Lincoln in American Memory, the historian Merrill Peterson calls Young Mr.Lincoln a \"boring, dreadful, film\". This amazingly wrongheaded analysis simply proves that great historians are rarely fine film critics. I am working on a doctoral dissertation on Abraham Lincoln and Frederick Douglass. As part of my preparation for writing the dissertation, I made  a careful analysis of this film, and of Tag Gallaghers brilliant interpretation of it in his seminal book on Ford. Young Mr. Lincoln comes out that culminating year of the first phase of Ford's cinematic authorship, 1939.In that greatest of Hollywood years, Ford directed three superb, still not fully appreciated films: Drums Along the Mohawk, Stagecoach,and Young Mr.Lincoln. It might seem odd to say that Stagecoach is not fully appreciated, all but the most purblind of critics must perceive that it is one of of the greatest Westerns, and perhaps even one of the hundred greatest films of all time. However, what is NOT fully appreciated is that these three films work together as a kind of trilogy-a triptych, in fact. Ford is creating a sort of mythic history of America on screen. Drums Along the Mohawk is the Revolutionary War. Young Mr.Lincoln is pre-Civil War America.Finally, Stagecoach is Post Civil War America. What the three films have in common is that they are an extended meditation on the American Adam and his \"errand into the Wilderness\". What are the Psychic and social costs of American manifest destiny, as America strives to build a new human city in the wilderness?Lincoln symbolizes Americas journey, as he seeks to reconcile the civilizational inmpulse (law), with the freedom of the wilderness.Young Mr.Lincoln is not history, ( It is  full of historical \"howlers'-as both Ford and Trotti were well aware), but myth. This is Lincoln, the symbol of justice and mercy, Lincoln, the man of the wilderness, striving to found a civilization within himself, and to become the \"remarkable  lawgiver' of young America. Young Mr. Lincoln is not history-like James Agee's long forgotten teleplay about Lincoln, and like Sandburgs biography, it is an epic poem...a very beautiful epic poem.","user":"coop-16","rank":[55,60]},{"title":"Young Lincoln Gets the 'Ford' Treatment!","rating":9,"date":"2 July 2006","review":"1939 is universally accepted as the greatest year in Hollywood history, with more classic films released than in any other, and John Ford directed three of the best, \"Stagecoach\", \"Drums Along the Mohawk\", and this beautiful homage to frontier days and a young backwoods lawyer destined to eventually save the Union, \"Young Mr. Lincoln\".<br><br>With the world plunging into a war that America dreaded, but knew it would be drawn into, Abraham Lincoln was much on people's minds, in 1939, as someone who had faced the same dilemma in his own life, and had triumphed. On Broadway, Robert E. Sherwood's award-winning \"Abe Lincoln in Illinois\", with Raymond Massey's physically dead-on portrayal, was playing to packed houses (it would be filmed in 1940). Carl Sandburg's continuation of his epic biography, \"Abraham Lincoln: The War Years\", was published, and quickly became a best seller. President Roosevelt frequently referred to Lincoln in speeches, and the Lincoln Memorial, in Washington, D.C., became the most popular landmark in town (a fact that Frank Capra made good use of, in \"Mr. Smith Goes to Washington\").<br><br>All this was not lost on Darryl F. Zanuck, at 20th Century Fox; as soon as he read Lamar Trotti's screenplay of Lincoln's early days as a lawyer, he designated it a 'prestige' production, and assigned John Ford to direct, and Henry Fonda, to star.<br><br>Fonda did NOT want to play Lincoln; he felt he couldn't do justice to the 'Great Emancipator', and feared a bad performance would damage his career. Even a filmed make-up test, in which he was stunned by how much he would resemble Lincoln, wouldn't change his mind. According to Fonda, John Ford, whom he'd never worked with, cussed him out royally, at their first meeting, and explained he wasn't portraying the Lincoln of Legend, but a young \"jackanape\" country lawyer facing his first murder trial. Humbled, Fonda took the role. (John Ford offered a different scenario of the events, but the outcome was the same!) Obviously, they found a chemistry together that worked, as nearly all of their pairings would produce 'classics'.<br><br>Unlike the introverted, melancholia-racked Lincoln of \"Abe Lincoln in Illinois\", Ford's vision was that of a shy but likable young attorney, who made friends easily, and misses the mother he lost, too young (resulting in a bond with a pioneer mother that becomes a vital part of the story). Injustice riles him, and he speaks 'common sense' to quell violence, interlaced with doses of humor. Both productions play on Lincoln's (undocumented) relationship with Ann Rutledge; in Ford's version, the pair are truly in love, and committed to each other. After her death, Lincoln would frequently visit her grave, to share his life with her 'spirit' (a theme Ford would continue in \"She Wore a Yellow Ribbon\").<br><br>A murder trial is the centerpiece of the film, and shows the prodigious talents of the star and director. Fonda deftly portrays Lincoln's inexperience, yet earnest belief in justice tempered with mercy, and Ford emphasizes the gulf between the big-city 'intellectuals' (represented by pompous D.A. Donald Meek, and his slick 'advisor', Stephen Douglas, played by a young Milburn Stone), and the informal, rule-bending country sense of Lincoln. With Ford 'regular' Ward Bond as a key witness, the trial is both unconventional, and riveting.<br><br>With the film closing as Lincoln strides away into the stormy distance, and his destiny (dissolving into a view of the statue at the Lincoln Memorial), audiences could take comfort in the film's message that if a cause is just, good would ultimately triumph.<br><br>\"Young Mr. Lincoln\" is a truly remarkable film, from an amazing year!","user":"cariart","rank":[34,37]},{"title":"A Jackleg Prarie Lawyer","rating":9,"date":"9 September 2005","review":"Young Mr. Lincoln marks the first film of the director/star collaboration of John Ford and Henry Fonda. I recall years ago Fonda telling that as a young actor he was understandably nervous about playing Abraham Lincoln and scared he wouldn't live up to the challenge.<br><br>John Ford before the shooting starts put him at ease by saying he wasn't going to be playing the Great Emancipator, but just a jack-leg prairie lawyer. That being settled Fonda headed a cast that John Ford directed into a classic film.<br><br>This is not a biographical film of Lincoln. That had come before in the sound era with Walter Huston and a year after Young Mr. Lincoln, Raymond Massey did the Pulitzer Prize winning play by Robert Sherwood Abe Lincoln in Illinois. Massey still remains the definitive Lincoln.<br><br>But as Ford said, Fonda wasn't playing the Great Emancipator just a small town lawyer in Illinois. The film encompasses about 10 years of Lincoln's early life. We see him clerking in a general store, getting some law books from an immigrant pioneer family whose path he would cross again later in the story. And his romance with Ann Rutledge with her early death leaving Lincoln a most melancholy being.<br><br>Fast forward about 10 years and Lincoln is now a practicing attorney beginning to get some notice. He's served a couple of terms in the legislature, but he's back in private practice not really sure if politics is for him.<br><br>This is where the bulk of the action takes place. The two sons of that family he'd gotten the law books from way back when are accused of murder. He offers to defend them. And not an ordinary murder but one of a deputy sheriff. <br><br>The trial itself is fiction, but the gambit used in the defense of Richard Cromwell and Eddie Quillan who played the two sons is based on a real case Lincoln defended. I'll say no more.<br><br>Other than the performances, the great strength of Young Mr. Lincoln is the way John Ford captures the mood and atmosphere and setting of a small Illinois prairie town in a Fourth of July celebration. It's almost like you're watching a newsreel. And it was the mood of the country itself, young, vibrant and growing.<br><br>Fans of John Ford films will recognize two musical themes here that were repeated in later films. During the romantic interlude at the beginning with Fonda and Pauline Moore who played Ann Rutledge the music in the background is the same theme used in The Man Who Shot Liberty Valance for Vera Miles. And at a dance, the tune Lovely Susan Brown that Fonda and Marjorie Weaver who plays Mary Todd is the same one Fonda danced with Cathy Downs to, in My Darling Clementine at the dance for the raising of a church in Tombstone. <br><br>Lincoln will forever be a favorite subject of biographers and dramatists because of two reasons, I believe. The first is he's the living embodiment of our own American mythology about people rising from the very bottom to the pinnacle of power through their own efforts. In fact Young Mr. Lincoln very graphically shows the background Lincoln came from. And secondly the fact that he was our president during the greatest crisis in American history and that he made a singularly good and moral decision to free slaves during the Civil War, albeit for some necessary political reasons. His assassination assured his place in history.<br><br>Besides Fonda and others I've mentioned special praise should also go to Fred Kohler, Jr. and Ward Bond, the two town louts, Kohler being the murder victim and Bond the chief accuser. Also Donald Meek as the prosecuting attorney and Alice Brady in what turned out to be her last film as the pioneer mother of Cromwell and Quillan. And a very nice performance by Spencer Charters who specialized in rustic characters as the judge.<br><br>For a film that captures the drama and romance of the time it's set in, you can't do better than Young Mr. Lincoln.","user":"bkoganbing","rank":[31,35]}]