[{"title":"Maniac stalks young girl... one of the earlier examples of the slasher movie.","rating":23,"date":"23 January 2003","review":"Fright (1971) is directed by Peter Collinson, a largely under-rated film-maker who received his only positive notices for the film The Italian Job, though in reality he made a fair few good films such as Innocent Bystanders and The Earthling.<br><br>The story is simple, but fairly engrossing: a young babysitter in a lonely mansion is terrorised by an escaped homicidal lunatic. The babysitter is nicely played by Susan George and the maniac is very convincingly portrayed by Ian Bannen.<br><br>The film starts out just fine, with some careful and genuinely suspenseful build up scenes. Every now and then, we are fed another clue that someone unpleasant is hanging around outside the mansion... Dennis Waterman is assaulted whilst walking through the grounds; we see a cloudy figure sneaking past the kitchen door as George boils the kettle, etc. The film is pretty scary early on, and I'm not embarrassed to admit that the hairs on my neck were prickling a bit.<br><br>However, it all goes wrong later on. The maniac turns up about a third of the way in and the effective suspense suddenly gives way to sadism and over-the-top hysterics. Bannen, as mentioned earlier, plays the part very well, but the lines he has to speak and his actions are ludicrously and needlessly savage. I know he's meant to be a bad man, but his nastiness just seems too excessive. Collinson forgets to keep the suspense ticking over and lunges for the audiences jugular, dragging down what could have a great little thriller and turning into a mere exploitation shocker.","user":"barnabyrudge","rank":[14,16]},{"title":"Surprisingly creepy British horror flick.","rating":8,"date":"11 January 2003","review":"Amanda(Susan George),a young babysitter is called to watch the child at an isolated British manor.The child's mother,Helen(Honor Blackman),has had her husband committed after he tried to murder her and the child.Helen's psycho husband(excellent Ian Bannen)returns home and terrorizes young Amanda while Helen and her new boyfriend are out on the town.The film is pretty creepy-there are numerous false scares which work pretty well.The most surprising is the fact that \"Fright\" is pretty similar to \"Halloween\"-for example both movies take place mostly at night with a babysitter in peril.There is no gore and nudity at all,but like I said before,there are some effective scares throughout the film.I agree that \"Fright\" is pretty boring at times,but if you are a fan of British horror cinema give this one a look!","user":"HumanoidOfFlesh","rank":[14,17]},{"title":"Influential, but uneven, babysitter stalked by mad killer terror tale.","rating":4,"date":"8 April 2008","review":"FRIGHT starts out on the right note, with an attractive blonde college student named Amanda (Susan George) heading through the dark woods toward a large, remote country home, all set to an eerie ballad called \"Ladybird.\" When she arrives she meets Jim (George Cole) and Helen (Honor Blackman), a presumably married couple who live there with their 3-year-old child Tara (Tara Collinson). The parents show Amanda around, introduce her to their child (who's already tucked in bed and about ready to go to sleep), show her how to work the TV (where she'll later watch THE PLAGUE OF THE ZOMBIES), give her their contact information and head out for the night. The mother also acts strangely apprehensive about leaving Amanda there alone, but Jim convinces her everything will be OK. It's a fair enough introductory 20-minute sequence that has echoes of such films as BLACK Christmas (1974), HALLOWEEN (1978), WHEN A STRANGER CALLS (1979) and several other films, except this was actually made first. So you have to give credit where credit is due, even though one might not be too thrilled with the eventual outcome.<br><br>Unfortunately after the solid set-up with the babysitter-left-alone-in-a-big-old-creepy-house, the film basically falls apart and becomes overwrought and shrill. Someone seems to be creeping around outside the estate, peeping in the windows and such. It turns out to be a maniac who has recently escaped from an insane asylum and is somehow linked to the mother and child. Instead of eliciting chills, the killer character (as played by Ian Bannen) comes off ludicrously. His nonstop, incomprehensible babbling and wide-eyed stares are unintentionally hilarious, not at all creepy. And what was up with Susan George's character? She seems every bit as unstable as the killer; freaking out, screaming and crying over the most insignificant things imaginable early on. Many movies like this try to hint that the lead female is a virgin; I guess to make her seem more vulnerable. This one has to beat you over the head with the fact by throwing in an equally annoying pushy suitor (Dennis Waterman) who basically shows up to try to date rape her and then die. Then they predictably give the killer his own would-be rape scene which tries to fuel the silly surprise 'revenge' ending. Unfortunately, George's character is so grating throughout you can't sympathize much with her. You basically just want someone to stuff a sock in her mouth and do whatever they want with her. No one in this film is even remotely likable and you could basically care less what happen to any of them. For a slasher style film like this, you really need a decent central character to revolve all the horror scenes around or else many people will find it hard to get involved. I feel this film lacks that.<br><br>And I don't blame actress Susan George for this. She did a decent job in her role. She's appealing, looks good and her crying and screaming and emoting were all pretty convincing. It's the horrible screenplay, character arcs and dialogue that make this a chore to sit through. The terror isn't gradually built. There's a hysterical tone to the entire film that shows up early on and never goes away, making the whole experience pretty monotonous. Scenes at the house are cut between scenes of Blackman and Cole's night out on the town, which reveal very little aside for a predictable twist that's already telegraphed early on. Things wrap up with a police stand-off at the home, which has some nasty scenes of the killer threatening to slit George and the child's throats with a shard of glass. This sequence is fairly solid for the most part, except it's ultimately ruined by the inclusion of an unnecessary and lame shock \"twist,\" which left a bad taste in my mouth.","user":"capkronos","rank":[11,13]}]