[{"title":"Three For One Odds","rating":18,"date":"18 September 2007","review":"Most films have one, and only one, protagonist around whom the story is told. But \"The Grifters\" has three, all of them petty swindlers, desperate for quick cash or good odds at a \"long con\". And it's the personal relationships among these three criminals, complex, sometimes dark, and almost always motivated by survival, that make this film a pretty good bet.<br><br>Roy Dillon (John Cusack), is a trickster, a loner, \"on the grift\" for the \"short con\", strictly a nickels and dimes man. His mom is Lilly (Anjelica Huston); she's a middle-aged lady with white hair; she's seductive, cold-blooded, and tough as nails; she's been around the block a few times. Roy's love interest is Myra (Annette Bening), a shapely, fun loving babe who uses her charms to con rich businessmen. These three people are highly manipulative and scheming, on-guard, and mistrustful of each other and the rest of the world.<br><br>The film's tone is bleak and gloomy. There's very little \"heart\" in this film. And that's a problem, because I found these characters not very sympathetic. They lead lives of quiet desperation, grimy and tawdry. Still, \"The Grifters\" is a crime story in the best tradition of Dashiell Hammett and Raymond Chandler, a pulpy melodrama about the underbelly of urban America.<br><br>The film's structure is conventional, and contains a number of flashbacks. The set-up is tediously long. The second half of the film is better than the first half, in my opinion, because the second half contains more suspense.<br><br>Dialogue is direct and tough, like when Lilly makes her point to the ambulance driver who takes Roy to the hospital and is skeptical about Roy's chances for survival: Says Lilly: \"My son is gonna be alright, if not, I'll have you killed\". Later, she explains the facts of life to her son: \"Grifts like anything else Roy, you don't stand still, you either go up or down, usually down, sooner or later\". Yes indeed, it's a tough life being a \"grifter\"; but Lilly is one tough broad.<br><br>The film's color cinematography is fine. And the film has a terrific title sequence and a great Elmer Bernstein score at the beginning. Editing, costumes, and production design are all credible.<br><br>If you're in the mood for a gritty, bleak story of petty criminals in a well made modern film, \"The Grifters\" is a good choice. As a bonus, the DVD has an exceptionally good Commentary, with insightful comments from Director Stephen Frears, and actors John Cusack and Anjelica Huston.","user":"Lechuguilla","rank":[36,39]},{"title":"Great Writing, Acting Make This A Superior 'Noir'","rating":10,"date":"12 January 2007","review":"Here is a modern-day \"film noir,\" if I ever saw one. You get sleazy characters with no morals, brutal attitudes, some interesting photography and a story that is not exactly a happy one - all the ingredients of a good noir. Since the film is a 1990 one and not the '40s and '50s (in which purists think that's the only period for noirs), you also get nudity and profanity.<br><br>The best part of the film, to me, is the fact that the three leading characters are so interesting. You never know what these intriguing characters are going to do next. There is an odd mother-son relationship, too - very odd, between John Cusack and Angelica Huston who play \"Lilly and Roy Dillon.\" The third person among this trio of \"grifters\" (scam artists) is played by Annette Bening, who never looked prettier or demonstrated her lack of morals better than she did here as the wicked \"Myra Langtry.\" You can see all of Bening in this movie, and I mean all. Huston, on the other hand, tries to look sexy but is too hard-looking and certainly no competition for Bening, in age or looks. But Angelica is a terrific actress and I thought her character, was easily the most interesting of the three leads. Cusack, meanwhile, gives an underrated performance: one of the best in his career.<br><br>Three supporting guys in here are fantastic: Pat Hingle as \"Bobo Justus,\" J.T. Walsh as \"Cole,\" and Charles Napier as \"Gloucester Hebbing.\" Overall, this is a wonderful cast that does full justice to this unusual crime story.<br><br>The story has a mean edge to it most of the way, but that's the style of writer Jim Thompson, who is a very good crime author who wrote the novel on which this movie is based. He has written several fascinating books. Donald Westlake, who wrote the screenplay, is a prolific crime story writer.<br><br>There is not a lot of action in this film but when it occurs, it is shocking and brutal. This movie always entertains me every time I view it.","user":"ccthemovieman-1","rank":[54,64]},{"title":"A seedy underbelly of life exposed for all to see","rating":16,"date":"16 August 1999","review":"Years ago, this was one of the films I was quite pleased with myself for seeing. I didn't know much about it, but decided to take a chance on it, with no regrets. From the opening sequence to the end credits I was mesmerized and in awe of events that communicated an entirely alien philosophy. Based on the novel by Jim Thompson, \"The Grifters\" tells a tale of a world that lies just under the surface of the one we know of. That is of course, if you count yourself among the squares and suckers who often fall prey to the craftsmen of the grift.<br><br>With startling precision, intrigue and depth, the story unfolds chronicling the lives of three distinctly different yet intertwined individuals. Their setting and perspective is entirely foreign to the majority of us. The filmmakers portray the grifters' different methods and environments as skilled scam artists. For unless you've had a personal experience having fallen prey or gotten wise to a grifter's ploy, you'll simply have to accept the reality of it. They are out there, waiting for the suckers to be born.<br><br>This particularly dark tale is very stylishly directed and moves along at a good pace. Each turn offers another sneak peek into the games played and the tricks pulled. The prey are often unaware of their own victimization as they go on about their business.<br><br>Another aspect the film deals with is trust or the lack thereof. Our protagonists spend most of their time scamming, conning and tricking people so much that their sense of trust and decency breaks down. They alienate themselves from everyone, and ultimately can't even trust each other.<br><br>And of course, what drama would be complete without a twisted love triangle in the mix with betrayal and murder to keep it interesting. If this doesn't sound like another day at the office, you might just find the workplace of \"The Grifters\" intriguing. Seeing it today, I enjoyed it as much as I did years ago, before I opened my eyes for a fresh look at the world.","user":"ToldYaSo","rank":[30,35]}]