[{"title":"A good movie about how grand battles are won and lost","rating":7,"date":"19 October 2007","review":"I remember reading that this movie was made primarily because they had excessive footage from when they shot \"Tora! Tora! Tora! and some of the shot looks like they did came from that film. But this film also includes old actual shots taken by service men and news people.<br><br>The movie is based on the American victory off Midway Island. The movie was made 30 years after WWII and a couple of years after Vietnam, so it doesn't have a jingoistic feel to it. It has more of a matter of fact feel to it, more a docudrama than propaganda.<br><br>The movie is different from most war movies because it shows how Grand battles are won and lost. There isn't much individual heroism from ordinary soldiers shown. Instead we see how commanders, in this case admirals make decisions and take risks usually based on sketchy information. They put their reputations on line, along with the safety of their men, and the security of their nations. We see how the outcome of a battle can hinged on risky decisions or sometimes on indecision. We see how commanders have to sweat out their decisions as History hangs on the balance. Yes! History! This battle after all is considered the turning point of the War in the Pacific.<br><br>In this movie decisions are made on what certain letters mean, whether enemy carriers are where they are supposed to be. If viewers give it the appropriate attention, they will see that this movie plays like a giant chess match. The outcome determined by gutsy moves and bad decisions, sometimes indecision.<br><br>The movie boasts an impressive cast which include, Henry Fonda, Glenn Ford, Robert Mitchum, Cliff Robertson, Charlton Heston and they all do fine jobs. They play the typical Grand characters in epic movies, they move the story along but has no personal stories themselves. The one personal story belongs to Edward Albert, who plays Heston's son. He's not very convincing and playing opposite a pro like Mr. Heston, he comes across as being weak almost amateurish.<br><br>The movie is good but far from great. I love how the filmmakers remained true to the events. But the special effects looked cheap and the use of actual combat footage feels inappropriate and even exploitive. Nevertheless I think it's a good film not to be missed by Military History buffs.","user":"LeroyBrown-2","rank":[36,39]},{"title":"inspiring, in a way","rating":20,"date":"20 October 2003","review":"I can't help but agree with most of the other comments:  the sloppy production values, the scenes \"borrowed\" from better movies, the countless anachronisms, the distracting subplot about Lt. Garth and his Japanese girlfriend, and so on.  But for me, this movie has two strong points in its favor.  One, when they get around to the actual battle, they follow the history with surprising accuracy.  (The \"Pearl Harbor\" makers could have learned something from this one.)  So the movie's hard to follow?  So was the actual battle!  Personally, I think they did a pretty good job of keeping the flow coherent while still remaining faithful to its source material.<br><br>The second thing in its favor is that, from the moment I first saw it in the theater as a 10 year old, it ignited in me a passion for the Battle of Midway that remains to this day.  I can't think of any other movie that even comes close to getting me as hooked on its subject as this one.  Maybe it's a good thing I first saw it when I was young, when I was much less discerning about production values, etc.  That way, I could concentrate on the story itself.<br><br>If you have even the slightest interest in military history or even in important historical events in general, do yourself a favor.  Watch \"Midway\" to get an overview of the event (fast-forward over the love-story scenes if you like), then go read \"Incredible Victory\" by Walter Lord (which is a better book than the one for which he is most famous, \"A Night to Remember\").  You won't be sorry.","user":"ghoge","rank":[77,93]},{"title":"Flawed But Still Satisfying","rating":20,"date":"20 September 2003","review":"Of course \"Midway\" is a flawed movie.   The subplot about Japanese-Americans is ridiculous and seems like a forced attempt to be PC during the post-Vietnam 1970s when it wasn't in fashion to be completely celebratory of America.   Of course it's unsatisfying that the Japanese actors don't speak Japanese and we have to hear Paul Frees dubbing Toshiro Mifune.  Of course the stock footage isn't going to please aviation and naval buffs who know these details like the back of their hands, but to me this is a trivial complaint that fails to take into account the limits of 1970s technology or budgeting.   \"Pearl Harbor\" ultimately got those details right through CGI and the end result was a far worse film in the final analysis.   Because ultimately, for all the flaws that are in \"Midway\" it succeeds because it does stick to the essential truths when telling the story of the battle, and I know this because when I first saw this movie on the CBS Late Movie around 1979, I got so hooked that I went out and read every book on the battle I could find including Walter Lord's \"Incredible Victory.\"   The movie had given me a starting reference point and while I was sorry that some key aspects of the latter stages of the battle were not depicted (such as the torpedoing and eventual sinking of the Yorktown), I couldn't have asked for anything better in terms of getting me to learn more about this great turning point of World War II.   As far as I'm concerned, it's good that Hollywood did tackle this subject in an era when the influence of \"Tora! Tora! Tora!\", \"The Longest Day\" etc. still hung over the proceedings because if it hadn't been made back then, we would today be forced to see it given the \"Pearl Harbor\" and \"Titanic\" treatment that is pure garbage.<br><br>John Williams contributes one of his finer pre-Star Wars scores with two great themes, the \"Midway March\" (which is only heard in the end credits of the theatrical version and became more popular in an expanded concert arrangement by the Boston Pops) and the \"Men Of The Yorktown March\" which dominates much of the score and offers great foreshadowings of the Throne Room sequence in \"Star Wars\" and the Smallville music in \"Superman.\"","user":"Eric-62-2","rank":[62,75]}]