[{"title":"Genuinely Scary","rating":8,"date":"14 December 1998","review":"\"Repulsion\" is a great example of how to make a truly scary movie:  The trick is not to fill the screen with monsters or indestructible serial killers, it is to portray fear in a way that will be familiar to the audience.  It is clear from early on in the film that the lead character, Carol, played brilliantly by an extremely young-looking Catherine Deneuve, is not exactly normal.  When her sister leaves her alone in their shared London apartment for a few days, however, the things that scare Carol are the sorts of things that have scared a lot of people spending the night alone, such as hearing (imagined) footsteps in the hallway and the like.  Of course, while normal people get a brief fright from such a thing, Carol descends into a madness of hallucinations.  The movie is seen almost entirely from her point of view, using techniques borrowed by later directors such as Darren Aronofsky for his movie, \"Pi\", which gives the entire movie a claustrophobic feeling that enhances the impact of Carol's hallucinations.<br><br>There are no doubt people who would like to explicate this film as an exploration of sexual repression or the like, and perhaps they are indeed hitting the mark in doing so, but this film works brilliantly as pure cinema, with no metaphoric subtext needed.<br><br>Overall Rating: 4 stars (out of 4), or 9 (out of 10)","user":"NJCondon","rank":[106,136]},{"title":"One of the \"best of\" of psychological thrillers","rating":10,"date":"18 September 2006","review":"Extremely shocking if you consider the time it was filmed!<br><br>Carole, a beautiful, young, unusually shy, fragile, foreigner, works in a beauty salon and lives with her older sister Helene in London. Her behavior at first seems \"faintly strange\" and distant, but it appears like this is normal for everyone around her. Soon we realize she is antisocial and has a psycho-pathological fear of males and sex. When Helene leaves for a trip with her lover, Carole isolates herself in her sister's apartment and surrenders to her morbid fantasies that lead her down a path of hallucinations all the way to murder.<br><br>Polanski uses \"the world outside\" in a clever way, to give us the whole parameter that helps bring about Carole's downfall. The social alienation a foreigner feels, the domination games and the self-interest of the people close to her. The men that approach her together with her own sexual fears, are all catalysts. They create the image of a threatening world and her helpless existence in it, as seen from inside her already troubled mind. Then begins a very true, detailed description of her problematic mind that slowly worsens into madness. Done in a natural and simple way and perhaps that is what makes it so haunting.<br><br>The first part is purposely slow. A moment-to-moment reality that builds up tension and soon gives way to a nightmarish world. We watch as everyday reality transforms into a closed-door hell and as Carole transforms from \"strange\" into a clinical psychopath. The house becomes a character, its dimensions distorted and Carole is left there, to wander in it alone, with the house and the objects acting as symbols to portray exactly what is going on inside her head. (Everything symbolizes Carole's mental decline in parallel). Space becomes distorted. Time becomes distorted. She becomes distorted.<br><br>The black and white makes you focus exactly where the director wanted and the visual effects are very limited compared to todays psychological thrillers. Here, the girl and the apartment are enough. The violence is not graphic it is psychological. Polanski's expert use of sound, sets, camera angles and framing all play a great role in creating the horror atmosphere.<br><br>Deneuve is Fantastic! In a very difficult part (if you consider she plays alone and without dialogue most of the time) delivering an extremely complex role (her best performance to date) perfectly!! People have rushed to say she was \"flat\" but in this specific film, I believe that was the intention. The MIND is the protagonist here; she is only the vehicle where the mind lives. Her \"underplaying\" helps the viewer focus on what is happening inside her head, makes you follow her and go through the experience with her. If one decides to watch this film and not experience it, then yes, she looks hypnotized.<br><br>By the time Helene and her boyfriend return, the viewer is just as shocked to have seen what the couple finds there. It is heartbreaking. The very last scene then finishes you off, perhaps giving the biggest clue. Revealing a secret as to why this has happened. And the way this scene is filmed leaves you with a chill in the spine. I became even more disturbed well after the movie was over and my thoughts had settled down. This is why I call this film an \"experience\".<br><br>I think that some factors always needed when putting a \"value\" on films are often overlooked. Things like: Time of release, Level of difficulty in achievement of the story itself and Level of difficulty because of the budget or the country of production. Based on these, I think that Polanski has created masterwork. It could be considered very slow, especially for today's viewers. And for others it could even be considered a claustrophobic hell. In respecting everyone's personal opinions I would only recommend this to a specific audience and specific friends. Mostly ones who want to concentrate and allow themselves to be taken in by this type of film. For them, I am sure the experience will be rewarding.","user":"tonyt86","rank":[85,109]},{"title":"A disturbing masterpiece that still packs a punch!","rating":3,"date":"3 December 2002","review":"Roman Polanski's movies divide movie fans. Even admirers of his output will single out a particular movie that just doesn't work for them (in my case it's 'The Fearless Vampire Killers', which for me is an utter waste of time). But I would bet that virtually every Polanski buff would list 'Repulsion' as one of his very best movies. It's a brilliant exercise in unease and paranoia that has lost none of its power of the years. It is still one of the most disturbing movies ever made, and manages to evoke an atmosphere filled with dread and fear without resorting to obvious shock tactics. Catherine Deneuve is perfect as a beautiful and disturbed girl slowly lost to delusion and phobia. This is arguably her most memorable role along with Bunuel's equally brilliant 'Belle De Jeur'. The rest of the cast is interesting, and includes Yvonne Furneaux ('La Dolce Vita'), underrated Brit character actor Ian Hendry ('The Hill', 'Theatre Of Blood', 'Get Carter'), John Fraser ('The Trials Of Oscar Wilde'), and Patrick Wymark ('The Conqueror Worm', and Hendry's co-star in the fascinating but almost forgotten 'Journey To The Far Side Of The Sun'). All the cast are excellent, but Deneuve's unforgettable performance is what really sticks in your mind long after the movie is over. That and Polanski's accomplished and tense direction make this movie essential viewing for all movie buffs. One of the most important and impressive movies of the 1960s, and one of the most chilling horror movies ever made.","user":"Infofreak","rank":[115,151]}]