[{"title":"Simply very good entertainment.","rating":7,"date":"5 February 2005","review":"This movie offers perfect entertainment.<br><br>The main characters and the performances by the actors are very good and comical. The movie is filled with some crazy 'not-so-everyday' characters and the villains are deliciously stereotyped and highly entertaining and there are some simply hilarious moments throughout the movie.<br><br>The movie can be described as an adventure science-fiction comedy. Surely the movie will not be remembered as one of the best of all time but I will always remember this movie as a very entertaining one and of which I have some very fond childhood memories.<br><br>The nice 'unknown' musical score by Jerry Goldsmith is very good, I actually watched this movie in honor of his death the day he had died, on 21 July 2004.<br><br>As long as you don't expect a masterpiece and merely want to be entertained, this movie is perfectly recommendable. Also very watchable for the entire family.<br><br>7/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[33,35]},{"title":"Watch it before it gets remade","rating":8,"date":"30 April 2018","review":"Everyone remembers that eighties sci-fi classic 'Back to the Future,' because - let's face it - it's awesome. It deserves it's spot in pop culture. Yet many people don't seem to hold that other eighties sci-fi popcorn flick 'Innerspace' in such quite high regards. And that's a shame... in my humble opinion, because it really is quite good fun.<br><br>In these days of 'shared universes' (thanks, Marvel!) I find myself seeing films that look like they could belong in the same 'universe' as others (like 'Universal Soldier' and 'Terminator 2' - again, just my opinion). And, after my most recent re-watch of 'Innerspace' I couldn't help but thinking how much it would fit alongside that time-travelling DeLorean and uber-cool hoverboard. <br><br>It's about a test piolt (Dennis Quaid) who gets miniaturised inside a pod during a lab experiment and then (inadvertantly) injected into some random guy's backside (Martin Short). The two of them form an unlikely bond as they try to reverse the effects before Quaid runs out of oxygen (or the baddies get hold of them!).<br><br>Now, it's fair to say that 'Innerspace' didn't set the Box Office as on fire as its producers would have liked. I don't think it bombed, but the film-makers were hoping for something akin to 'Back to the Future' in terms of success-levels. However, there's just something so fun about it that it deserves to be remembered, especially during this period of eighties nostalgia.<br><br>It's first strength is that it never slows down. It's perfectly edited so that you get almost straight into the action and learn to love the characters without any need for lengthy exposition or backstory. And the action flows thick and fast. There's one chase scene that reminded me of 'Indiana Jones and the Kingdom of the Crystal Skull.' In 'Indy 4' they had to rely on awful computer graphics whereas 'Innerspace' managed it with stunts.<br><br>Another thing that's worth mentioning is how when there's no action, there's humour. And this is down to the rapport between the actors. Everyone plays their part well. And, possibly the most important thing about 'Innerspace' is that it's a film that the whole family can enjoy. There's no need for violence or bad language. It acomplishes everything it needs to without any over-the-topness.<br><br>If you saw this back in the day, give it another go. Or if you're just looking for something to entertain the kids on a wet weekend, this should be enjoyed by all (even if you're not part of this current eighties revival!).","user":"bowmanblue","rank":[16,16]},{"title":"Funny Sci/Fi Adventure","rating":7,"date":"14 January 2007","review":"Tuck Pendleton (Dennis Quaid) is a hotshot Navy pilot on an unusual and top secret mission; he is to be shrunk down and injected into the body of a rabbit, but when things go wrong he ends up inside Jack Putter (Martin Short) instead. Jack must now work with Tuck in order to stay alive; and it's a great ride.<br><br>All the cast are good in this film, but Martin Short is brilliant; it's wall to wall action, adventure and laughs, and with a little romance thrown in, it's a winner. The special effects are outstanding for the time and Joe Dante's direction is excellent.<br><br>Innerspace is fun for the whole family 7/10","user":"mjw2305","rank":[22,23]}]