[{"title":"Revered and reviled, but no longer ignored","rating":11,"date":"11 August 2004","review":"In these supposed enlightened times, director Michael Powell is considered a genius of British cinema. Emerging during the War as one of Britain's finest craftsmen, Powell and his partner Emeric Pressburger created the undisputed classics The Life And Death Of Colonel Blimp (1943), Black Narcissus (1947) and The Red Shoes (1948).<br><br>But despite critical and commercial success, his career was in tatters by the early 1960's. The abrupt death of Powell's career can virtually be pinned down to one film, his most uncompromising portrait of madness, 1960's Peeping Tom.<br><br>\nPowell's infamous shocker opens with a movie camera-wielding Mark Lewis (Carl Boehm) following a prostitute to her boarding house room. Once inside, he slides a spike from his tripod leg and films her action of terror before stabbing her to death. As the credits roll, we find Mark alone in his apartment, replaying the footage with wide-eyed fascination.<br><br>As the film progresses, Mark is revealed as a stuttering loner whose sex drive has been somehow twisted into a murderous voyeuristic mania - working at a movie studio by day, he moonlights as a glamour' photographer above a seedy newsagents. His blonde buxom model (Pamela Green), constantly taunting his virility, is the embodiment of the female he despises. The inquisitive girl downstairs, on the other hand, becomes his ideal and his possible salvation. Ultimately she is doomed by her altruistic attraction when she insists Mark must show her one of his 'films'. Horrified, she watches Mark as a child, tortured by his father's camera experiment of recording a child's reaction to fear. Mark's own experiment of filming his murder victims leads him on a downward spiral of insanity to the film's tragic conclusion.<br><br>Despite Peeping Tom's sensational subject matter, Powell's intention was deadly serious: to make a sober study of sexual violence, as well as a meditation on the audience's role of voyeur. Powell's camera positions us directly behind Mark and his spectators so that we become his unwilling accomplices - the audience watches Mark watching his films. Carl Boehm as Mark gives a chilling performance, at once icy reserve and murderous rage. Powell creates a garish red and pale blue twilight landscape of backstreet London in perfect detail. <br><br>At the film's completion, Powell believed he had made a masterpiece. Peeping Tom is certainly a personal film; Powell and his co-scriptwriter toiled for months until they had mastered a sympathetic three-dimensional serial killer. In later years, Powell would remain tight-lipped about his real reasons for making the film. But Britain's premiere 'glamour' pinup queen Pamela Green - Peeping Tom's photo-model and penultimate victim - would offer clues to Powell's hidden agenda.<br><br>Green became his leading choice for the role, although she had not appeared outside 8mm stag films, after seeing a life-sized nude portrait in her business partner Harrison Mark's studio. Her initial reception on the set was one of polite British reserve - until Powell unleashed his Jekyll and Hyde personality and she became one among many targets for his boorish, intimidating manner. On the day of Green's death scene, Powell changed his former plans of prudence and demanded she sprawl topless across her bed before she is skewered with Mark's tripod leg. She reluctantly gave in. Mid-shot she looked across the studio in horror. Beneath Powell's camera were his two pre-teen sons, watching unwaveringly according to their father's instructions. This incident brought a chill over Powell's casting of his son as Mark junior and of himself as Mark's father.<br><br>Whatever reasons drove Powell to make Peeping Tom, he had effectively signed his career's death warrant. The film opened to scathing reviews in April 1960, just months after the similarly-themed Psycho. Ironically, Hitchcock floated out of the controversy surrounding Psycho as the consummate old trickster, and saved his slowly sinking career. The time seemed ripe for Peeping Tom among audiences and critics alike. Unfortunately for Powell, the critics could find none of Psycho's black humour in his sober tome. 'Sick' and vile' were a small sample of their vitriol. The papers were outraged that a filmmaker of Powell's calibre could sink his talents into material so vulgar and perverse. Powell hoped the distributor would weather the storm and allow the audience to find the film on its own merits. Instead, the plug was pulled on Peeping Tom after five days and at least in Britain the film was buried.<br><br>The print was sold to the American Roadshow circuit, with a lurid ad campaign designed to sell the film to a jaded American public. Shorn of twenty minutes footage, the film was considered too 'British' and was shelved after a limited run. There it sat, gathering dust for almost 20 years. Then in 1978 a cabal of admiring filmmakers led by Martin Scorsese (himself no stranger to controversy) rescued a complete print from Britain. Peeping Tom was thus relaunched in 1979 at the prestigious New York Film Festival to a predictably mixed reception. Correct-minded commentators grudgingly accepted its 'masterpiece' tag but were nonplussed with the Film's treatment of its sexual violence.<br><br>As for Powell, the British film industry no longer considered him bankable after Peeping Tom. He made one more film in Britain before exiling himself to Australia. The antipodean They're A Weird Mob (1966) was on of his final films before his death in 1984. Luckily for Powell, the film he considers his masterpiece is still revered and reviled, but no longer ignored.","user":"El-Stumpo","rank":[176,194]},{"title":"Notorious murder thriller which was years ahead of its time, and resulted in the downfall of its great director.","rating":9,"date":"6 May 2005","review":"To understand the stir that Peeping Tom caused when it was released in 1960, you need to think about what audiences at that time were accustomed to when they went to the cinema. Innocent love stories, historical epics, action-packed westerns and colourful musicals were the staple cinematic diet of the time, certainly not dark, disturbing and intensely violent murder thrillers like this. What probably unsettled contemporary film-goers even more was the fact that a film of this kind could come from a much-loved and revered director like Michael Powell. In modern times, the equivalent would be if Steven Spielberg were to make a graphic and reviled film about paedophilia or bestiality, consequently never being allowed to stand behind a movie camera again. When Peeping Tom hit the big screen, it was rejected by the public and crucified by the critics, and left Powell's hitherto glorious career in ruin.<br><br>A film cameraman, Mark Lewis (Karl Boehm), displays psychotic tendencies as he murders women with a spiked tripod attached to the bottom of his camera, capturing on celluloid their final screams of agony. It is revealed that when he was a child, Mark was used as a guinea pig by his father (Michael Powell) in a series of psychoanalytical experiments about the symptoms of fear. Among other things, Mark's delightful dad would wake him throughout the night and shine lights in his eyes, drop lizards into his bed, and on one occasion even forced him to pose for photographs next to the dead body of his mother. As a result, Mark has an unhealthy obsession with fear and, in particular, the expression that people have on their face during moments of fear.<br><br>Peeping Tom is one of the few films that still has the power to shock all these years on. Psycho, released roughly at the same time, is still a great film but its shock value has been diminished by years of repeat viewings and increasing permissiveness in the cinema. But Peeping Tom is an altogether more disturbing piece of work. Boehm is excellent as the killer whose entire outlook has been skewed by his father's experiments. Also impressive is Anna Massey as the killer's fragile and unsuspecting fiancée. Powell directs the film brilliantly, using bold and dazzling colours to disguise the horrific atrocities that punctuate his film. It is understandable that the film was met with revulsion and rejection at that time, but in retrospect it is a film of real importance and power. In a 21st century world bombarded and desensitised by harrowing images on the news and in the movies, the theme of losing one's grasp on what is and isn't morally acceptable is more pertinent than ever. This is not easy viewing, but it IS essential viewing.","user":"barnabyrudge","rank":[153,168]},{"title":"Watch And Learn","rating":9,"date":"8 September 2001","review":"Despite a long and distinguished career the production team of Powell and Pressberger were effectively ruined by the furore of criticism and demands for censorship generated by this film.<br><br>'Peeping Tom' is a great film and one that modern film makers could learn from.  Even good films like 'Seven' and 'Silence of the Lambs' have a regretable tendency toward melodrama and gross overacting in the portrayal of serial killers.  'John Doe' (Kevin Spacey) and 'Buffalo Bill' (Ted Levine) are laughable travesties of their real life counterparts, who seem harmless when approaching or luring a potential victim.<br><br>One of the things that critics of his time could not forgive Powell is that he makes his killer 'Mark Lewis' (Karl Boehm) human and likeable.  a sensitive and intelligent young man, he is the product of bestial cruelty inflicted upon him in childhood (the scenes showing film of him being tortured as a boy by his scientist father are horrifying in the true sense of the word)<br><br>This is a sophisticated film demanding of the viewer that he or she not only takes part in watching a compelling thriller but are also provoked into contemplating the forces that work on a man who commits such crimes.<br><br>After watching 'Peeping Tom' one does not have the customary closure common in such thrillers of seeing a 'monster' the viewer could not emphasise with destroyed and the world made safe again, (much the theory behind the justification of capital punishment).  Rather we have the experience of seeing the tragic self destruction of a man arguably as much a victim as those he killed.<br><br>To critics this was reprehensible - 'siding with the murderer'.  The man who wrote the script, however, knew at first hand what makes a killer - since he was responsible for selecting secret agents to fight behind enemy lines in World War 2.  He had to choose men - and women - who would not hesitate to kill.  How many writers can claim this level of insight?<br><br>'Peeping Tom' is a classic and I rate it an eye catching 9 out of 10","user":"rmc129","rank":[66,75]}]