[{"title":"Nearly Famous","rating":31,"date":"31 January 2004","review":"As far as I'm aware, Sam Neill's first film - and what a start!<br><br>Starring a  Kiwi, directed by a Kiwi and packed to the gunwales with Kiwi talent, this is definitely no Hollywood hyperbole extravaganza.Its sole concession to the 'star power' syndrome is the presence of Warren Oates (\"Dillinger\") as an armed subversive type (I didn't dare to use the dreaded 'T' word!).<br><br>The film is under the very capable guidance of the now-also-well-known Roger Donaldson, who was also responsible for another powerful home-grown effort, \"Smash Palace\". Impressionable youngsters like Peter Jackson may have seen this and decided their futures.<br><br>Like  Jackson's  LOTR trilogy, \"Sleeping Dogs\" is filmed on location in New Zealand. As such, the sets and scenery give a fair idea of life in provincial and metropolitan NZ in the mid-70's (but there's no stunning vistas of the majestic Southern Alps here, I'm afraid).<br><br>\"Sleeping Dogs\" is an adaptation of a story by New Zealand author C.K.Stead and pits an increasingly autocratic government of the near-future against a group of resistance fighters. Smith (Neill), very recently separated from a cheating wife, pretty much accidentally and quite reluctantly, gets involved with this group.<br><br>One scene in the movie was (and still is) something of a talking point here in NZ because it seemed, in hindsight, so chillingly prescient - life imitating art.<br><br>In the scene, a large group of protesters have clashed violently with unyielding, merciless, baton-wielding riot police; blood is flowing, injures are rife.<br><br>Some five years after the film  had been released, in 1981, the then-internationally-banned Springbok rugby team from South Africa were allowed to tour here, despite clamorous local and global opposition.<br><br>\nNew Zealand experienced the horrors and scarring of civil division. Wherever the Springboks played and also in the capital, Wellington, violence erupted. And it seemed to many of us at the time that the scenes that Donaldson had shot many years ago were now being replayed almost nightly on the news. Spooky.","user":"Tamaal","rank":[22,25]},{"title":"Solid if not spectacular","rating":6,"date":"18 June 2002","review":"Based on the novel Smith's Dream by academic C. K. Stead, Sleeping Dogs is set in a totalitarian New Zealand. Smith moves to the country to escape trouble but is framed by the state as a terrorist.The rest of the film involves his attempts to avoid arrest and his eventual fate.<br><br>Released in 1977, the film possessed a poignancy for New Zealanders, who at the time viewed the then Muldoon National Government with some suspicion. A scene involving riot police in an Auckland street was a chilling portent of events during the 1981 Springbok rugby tour to New Zealand, and indeed on its release in the USA, some Americans confused the film's images with media reports of the tour protests.<br><br>Notable for Sam Neill's role as Smith, the movie started a late 1970s revival in the New Zealand film industry, including movies such as The Scarecrow, Skin Deep, and Smash Palace.","user":"stekelmoll","rank":[7,7]},{"title":"Impressive in its context","rating":12,"date":"12 January 2005","review":"I remember trying to see this film when I was 12 or 13 but the friend who bought the tickets ending up buying tickets for The Magic Roundabout and the Blue Cat. What a disappointment at the time.<br><br>Seeing it for the first time subsequently, the optimum word is prescient. Donaldson showed scenes that were fresh and on a scale never scene in NZ cinema before. Skyhawks dropping bombs on the terrorists (Mune and Neill). \"Spooky\" is the word most used by those who have commented in this forum.<br><br>Having met Carl Stead last year in London, I was impressed by his philosophy regarding the films success in NZ at the time. Comprimises were made to the author's chagrin but in the end the story fulfilled its cinematic requirements. Donaldson along with Geoff Murphy were pioneers of a new revolution in film-making for New Zealand. <br><br>The first NZ film I had seen that opened up the dark under belly of an immature and isolated nation in troubled times. <br><br>The movie is dated now but the impact in context of the time it was made is undeniable.","user":"scroff","rank":[13,15]}]