[{"title":"Hui Brothers comedy fest!","rating":9,"date":"3 March 2005","review":"Games Gamblers Play (1974) was the first film to feature all three Hui Brothers in action (former television stars who made a successful transition from the small screen to the silver one). This film saved Golden Harvest with it's huge financial windfall at the box office. Bruce Lee may have put Golden Harvest on the map but the Hui Brothers saved the company and made it a force to be reckoned with.<br><br>Michael Hui stars as Wen, a convict who's always out to make a quick dollar through gambling. Being behind bars doesn't stop him from making something off of his gambling skills. Samuel Hui co-stars as Chieh,a novice gambler who gets into trouble one day when he tries to steal casino chips from a crooked card dealer Dean Shek). Whilst in jail, Chieh meets Wen and the latter agrees to become his mentor. Can Wen and Chieh make a fortune from their combined skills or will the duo wind up back in prison? To find out you'll have to check out the hilarious film Games Gamblers Play! <br><br>Michael directs and Samuel sings and writes the music. Ricky Hui has a small role as a beach side gambler. Sammo Hung has a bit role and is the action director and Roy Chiao has a guest appearance as well. funny film that shoes off the talents of the Hui brothers. Samuel and Michael were the feature players until their third film together The Private Eyes, then Ricky finally got some more screen time. Highly recommended for fans of slapstick humor and Cantonese comedies.","user":"Captain_Couth","rank":[5,5]},{"title":"One of the first comedies from the Hui Brothers!","rating":7,"date":"20 April 2015","review":"This is one of the first comedies from Michael, Ricky and Sam Hui - a story about a con man and a small time gambler who team up to hustle their way to a great fortune.<br><br>There are lots of messages and lessons to be learned from this movie, from false relationships to crime doesn't pay. It's classic humor and spot-on acting from our actors. However, I do think that the later movies from the Hui Brothers were much better and more funny than this film. While good, this film lacks the intrigue and excitement that made many of these films great.<br><br>Overall, though, it's still a film that is 10 times better than much of the so-called comedies Hong Kong dishes out nowadays.<br><br>Grade B-","user":"OllieSuave-007","rank":[1,1]}]