[{"title":"Buford Pusser kicks butt","rating":3,"date":"3 October 2003","review":"Joe Don Baker gives his best performance in this film as legendary Tennessee lawman Buford Pusser. This film is defintely biased in its portrayal of Pusser as an almost perfect \"good guy\". I have read a couple books about Pusser's life and I think he was a good man who really wanted to bring justice to his county and to help his fellow man. The most tragic part of this film is the scene that depicts the brutal murder of Pusser's wife Pauline and his near murder (Pusser had his jaw almost blown off and the people who did it were never caught). When was the last time you cheered at a movie? was the tagline for Walking Tall. It was a sleeper hit that spawned two sequels and a short-lived tv series. I only wish that Joe Don Baker had played Pusser in the other two films, he does a wonderful job playing a simple man in a complicated world who wants only what is just and right. I remember the scene where a corrupt judge tells Pusser that he doesn't know anything about the law. Pusser merely tells him \"I know the difference between a poor honest judge and a rich dishonest one\". Pusser was supposed to play himself in the second Walking Tall film but was tragically killed in a car accident. What I didn't like about the third Walking Tall was they tried to make it out like he was murdered, like the mob cut his brake lines. They didn't come out and say it, but they strongly hinted at it. According to all accounts, Pusser's death was due to speeding and it was just a tragic accident and there was no \"conspiracy\" involved at all. Tragic, but not mysterious. Elizabeth Hartman does a fine job in this film as Pusser's loving wife Pauline. She was a fine actress who had an amazing debut in the classic film A Patch Of Blue. Unfortunately, she was also very troubled by mental illness and killed herself in 1987. It always makes me sad when I see her in this film and remember her tragic end.","user":"dtucker86","rank":[24,26]},{"title":"you \"boom mike\" people don't understand","rating":13,"date":"13 August 2006","review":"All you folks complaining that this is amateur film-making because the boom is visible in several shots don't understand how movies are made. In order to get good sound on dialog, the mike is hung very close to the subject. It is almost always captured on film, but in the area which is not meant to be seen by an audience, as the square film frame is supposed to be matted at top and bottom by the projectionist when shown in a theater, or by the technician when transferring film to video.<br><br>In the case of Walking Tall, whoever supervised the transfer to video did so \"open matte\", meaning they transfered the ENTIRE film frame without proper matting, hence the visible boom. This was not carelessness on the part of the filmmakers, but on the part of whoever put it out on video. You'd see microphone booms in Star Wars if it were transfered to video this way.<br><br>When I saw Walking Tall in the theater, it did not have visible booms. Blame the video release, not the filmmakers.","user":"wilbrifar","rank":[60,72]},{"title":"\"Do you have a warrant?\" \"Yeah. It's in my shoe!\"","rating":8,"date":"5 September 2007","review":"If you are a southern male who grew up in the 1970's, \"Walking Tall\" is your \"Gone With The Wind\". This 1973 movie is based on actual events in the life of Sheriff Buford Pusser of McNairy County, Tennessee during the 1960's. Though the screenplay takes some liberties with Pusser's story, it is an exciting account of one man taking on organized crime and corruption .<br><br>The story begins with Buford and his family moving back to his home town in McNairy County. Shortly after arriving, Buford realizes that his home town has changed. Gambling, prostitution, and bootlegging have taken over. Buford exposes the gambling operation to be corrupt and is brutally beaten and left for dead. He recovers and seeks vengeance using a big piece of lumber. He is arrested for his troubles. Buford is cleared of the charges and is soon elected Sheriff. He promises to rid the county of crime and corruption. The rest of the movie shows how difficult it was for Buford to follow through with his promise.<br><br>Buford Pusser is played by Joe Don Baker, who gives the performance of his career. Baker's Pusser faces the tragic events of the movie with a sense of sad but heroic nobility. The audience is able to feel what Pusser must have felt when these events actually happened through Baker's brave performance.<br><br>The story is ultimately a tragic tale of one man who walked tall and stood up against the forces of corruption. It is the rare action movie that makes you cheer and cry at the same time. This is essential viewing for anyone who loves true heroes.","user":"hammerfan1","rank":[7,7]}]