[{"title":"Phenomena rocks the boat.","rating":8,"date":"24 July 2003","review":"This movie seems to be either loved or hated. Those that love it seems to be Argento fans that have succumbed to the style and imagination. Those that hate it seems to get annoyed at script flaws, soundtrack, actors etc.<br><br>Most of the criticizers seems to have missed the point. Dario Argentos movies is supposed to be watched and experienced, not dissected looking for flaws etc. which is true for most movies. I have the ability to turn the criticizer off when I watch movies, especially when it comes to horror/fantasy/scifi. They're movies, not documentaries, and they're not supposed to reflect your reality. Think of them as dreams, and we all know that dreams are most often illogical, strange and wonderful. That's the frame of mind I have when I watch Argento movies. And Phenomena is great in that aspect since it builds upon imagination.<br><br>Phenomena was the first Argento movie I watched, and it turned me into a big fan of his work. Donald Pleasance is great as useful, and Jennifer Connelly made many of us aware of how much we all want to meet her (at least the male audience). I watch this movie in much the same way as I did Suspiria (masterpiece), as a fantasy horror, a sweet nightmare. The first scene, where the Danish girl misses the bus and looks for help is unforgettable. The fact that the rest of the cast is a bunch of young and inexperienced teenagers is something most of the viewers familiar with Italian horror are used to.<br><br>Would I recommend this? Absolutely, it's one of the better Argento movies. Who would like it? Anybody with an open mind and interested in prime italian fantasy/horror.","user":"scyphe","rank":[100,131]},{"title":"A bizarre horror masterpiece","rating":9,"date":"22 January 2007","review":"Phenomena has long been one of my favourite Dario Argento films. It definitely seems to be a love-it-or-hate-it kind of film, even more so than most Argentos, and I think it's his most unjustly underrated piece of work to date.<br><br>A 14-year-old Jennifer Connelly shines in the lead role, playing a sleepwalker who has a bizarre telepathic bond with insects and uses them to help her solve a string of gory murders at a girls boarding school in the Swiss Alps. She is one of my favourite Argento heroines, a tough, brainy and eccentric little girl somewhere between Nancy Drew and Snow White. She deserves special credit for taking on some truly gruesome scenes, like when she falls into a pit of maggots, slime and rotting corpses. As for the rest of the cast, Donald Pleasance is good as the wheelchair-bound Scottish entomologist and Daria Nicolodi has fun with a small but juicy role.<br><br>Argento really let his imagination run wild making this one. Phenomena is a surreal, magical and surprisingly beautiful film, as much a dark fairytale fantasy as it is a horror film. It's visually stunning and I loved the incongruity of having all this gory mayhem happen against the picturesque backdrop of the Swiss Alps. Claudio Simonetti's electronic score is perfect, particularly the haunting main theme with its 80s synths and choral soprano vocals.<br><br>With its girls boarding school setting and unseen killer on the loose, Phenomena can be taken as a companion piece to Argento's earlier classic Suspiria (1977). But the introduction of slimy maggots, a razor-wielding pet chimp and six million buzzing insects set it apart. It all descends into glorious chaos for the Grand Guignol climax, which is perhaps the most thrilling house-of-horrors funhouse ride Argento has yet given us.<br><br>A remarkable film.","user":"Mother_of_Tears","rank":[55,71]},{"title":"Outstanding Italian horror from Dario Argento. ***Spoilers***","rating":10,"date":"3 October 2001","review":"My review is based on uncut Italian print,which runs 110 minutes.A young Jennifer Connelly can communicate telepathically with insects.The area she arrives in is being terrorized by a psychotic killer,who has been murdering coeds and making off with their decapitated bodies.Desperate for clues,a police inspector visits an entomologist Donald Pleasance(\"Halloween\",\"Death Line\")and eventually Pleasance and Connelly team up to find the killer.It all has something to do with Daria Nicolodi and the deformed creature she keeps chained in the basement.Wonderful atmosphere,gorgeous cinematography and plenty of gruesome gore make this one a must-see.Argento goes totally over the top in \"Phenomena\" with a swimming pool full of maggots and rotting corpses,a mad dwarf,a razor wielding monkey and grisly decapitations.Great heavy metal songs by Iron Maiden and Motorhead plus a nice musical score by Goblin.10 out of 10.","user":"HumanoidOfFlesh","rank":[60,80]}]