[{"title":"Mainstream US Cinema at its 70s Best","rating":1,"date":"1 September 2006","review":"A US Senator is assassinated and the official inquiry concludes it was the work of a lone gunman. Three years later, with 6 witnesses dead, a TV reporter present at the killing is frightened for her life. She takes her fears to a journalist ex-boyfriend. At first he is sceptical...<br><br>Brilliant paranoid thriller from Pakula, utilising choppy realism and naturalistic dialogue to create a bleak and uncompromising picture of cynical, corporate conspiracy within US politics. Beatty has never been better as the ambitious journo-hack Joe Frady, and he is superbly supported by Cronyn, Daniels and a deeply compelling cameo from Prentiss. You can bet this wasn't diluted by audience testing prior to release... unmissable.","user":"robertconnor","rank":[37,41]},{"title":"Existentialism with a political twist","rating":8,"date":"27 March 2003","review":"I saw this film first some twenty years ago and loved it. I saw it again this week and found the film superior to most other films of director Pakula and found it to be another gem from cinematographer Gordon Willis.<br><br>\"Parallax View\" never won Oscars or other major awards for Pakula but this film along with \"Klute\" and \"Sophie's Choice\" are his finest works. Articles on Pakula often focus on his award-winning work and neglect this fine movie.<br><br>What was great in this film that was missing in \"All the president's men\" or \"The pelican brief\"? Here the element of existentialism sucked in the viewer to participate in the whirlpool of deceit, exemplified most by the test given to the lead character in the offices of Parallax Corporation, the staccato editing (John Wheeler) that exemplifies the individual's helplessness, and the imaginative photography (Willis) that stunts the individual (not crowds) against the himalayan landscapes of glass and steel.<br><br>\nThe film was made at a time when Hollywood was brimming with great films with a similar line of thought (Spielberg's \"Duel\", Coppola's \"The Conversation\", Penn's \"Night Moves\", Polanski's \"Chinatown\", Antonionni's \"Zabriskie Point\", Altman's \"Nashville\", Boorman's \"Point Blank\", etc.) internalizing the external, as Camus would have best described it. \"Parallax View\" among all these films touched the subject of politics using the least obscure metaphors and similies.   <br><br>Can one forget the dead calm in the sea before the explosion/assasination? Or the assassination viewed from the roof top of the victim's cart colliding with empty tables and chairs towards the end of the film? None of Pakula's other films have such hardhitting scenes as these, even if one were to discount the unconvincing cool response of the lead character in the airplane when he realizes that there is a live bomb on it.<br><br>This is a film that grips you nearly 30 years after it was made, when US politics seems to be at a point very close to what the film depicted three decades ago.","user":"JuguAbraham","rank":[69,81]},{"title":"nope","rating":7,"date":"11 August 2016","review":"It has become commonplace to identify '70s Hollywood films as their own genre. I'll go one farther and identify this era as a collective, structural autuer. <br><br>If that hypothesis holds any water, this is one of its impressive works. Made shortly after Watergate, and less than a decade after the JFK assassination, this envisions conspiracies and assassinations not as a disruption of, but a cornerstone of the American establishment. <br><br>This is, in a sense, not a POLITICAL conspiracy thriller. The US government, or that of any other country, is presented as merely a dope of a greater power- that of the big corporations of whatever stripe. This is a dystopian capitalist democracy- one in which representatives are elected to \"officially\" be as clueless as the general populace about the real social reality around them. <br><br>Perhaps the most subversive thing about this very subversive film is that the assassinations don't seem catastrophic, or even troubling. When one takes place, the victim politician is basically a walking sound bite. His sacrifice seems only the continuation of a ritual of banal brutality. <br><br>In one scene, a film is shown that is supposed to condition the viewer to murderous obedience. It is a montage of images of Americana, including those of violence and oppression. In most '70s conspiracy thrillers, the evil that lurked beneath the surface had a predatory relation to the commonly understood reality. People were putting their trust in a machine that was not what it seemed. Here, the evil is the surface. America IS the conspiracy. <br><br>DP Gordon Willis has never impressed me more. In his work with Woody Allen and Francis Coppola his show-offy use of shadow and in-the-frame lighting sources seemed at times to distract from the tone or theme of the film, as if Willis was only interested in defining his \"look\" regardless of its relation to the film's content. Here, it fits the tone of the film perfectly. The final scenes, largely devoid of dialog, in a hall filled with terrifyingly \"patriotic\" imagery, is gorgeous. Many of the shots reminded me of de Cherico paintings.","user":"treywillwest","rank":[9,9]}]