[{"title":"Trashy, enjoyable, surprisingly focussed kids-in-prison movie","rating":7,"date":"11 September 2000","review":"This is a really, really obscure movie - doesn't make the Leonard Maltin guide under either title - which, for trash movie lovers, offers more than a lot of better known flicks.<br><br>For those familiar with the women-in-prison genre of campy movies, this is kind of a kids-in-prison equivalent. You don't want to do \"Growing Pains\"/\"Bad Manners\" the disservice of taking it too seriously, since it doesn't demand anything of the sort, but unusually for this kind of film, it has the odd serious undertone, and good acting from the kids.<br><br>\nWhere it wins, is its unsentimental, hilariously upfront portrayal of the kids and their language - it kind of pre-dates the \"South Park\" approach in a small way. The adults are routinely presented as gross caricatures. These two factors, in 1984, probably account for the film's howling commercial success, ahem.<br><br>Martin Mull and particularly Karen Black give some good value mugging in the grotesque adult category, but it's the kids' film. In a way it also kind of parallels kid rebellion movies like \"Over the Edge\", which preceded it. Not great, but very watchable, and unusual enough to be a real curio.","user":"leapso","rank":[8,10]},{"title":"A Crude Yet Charming 80's Gem","rating":8,"date":"11 June 2012","review":"Bad Manners (1984)<br><br>From the back shelf of the local video store comes Bad Manners, a wacky, outrageous, over- the-top comedy film from 1984. The film centers on four troubled adolescent friends who escape their crazy orphanage and set off on an adventure to save another friend whose been adopted by weirdo yuppies. The film more than lives up to its title with the kind of crass and borderline-tasteless humor one could only find in an 80's movie. Featuring plenty of kick- ass music, funny one-liners, naked breasts, fighting, cursing, beer-guzzling and general madness, Bad Manners is a truly entertaining and endearing 80's cult comedy.<br><br>I recently rediscovered the film after several years of searching for it with no luck. My parents had rented it on VHS when I was a kid and the movie stuck with me not only because it was so funny and outrageous, but because I felt a real connection to the characters. I got a real sense that their friendship was genuine, and I felt the same way after finally re-watching it ten years later. Quentin Tarantino defined these types of films as 'hang-out' movies, as in movies that make you feel as though you are friends with the characters, like The Big Lebowski for example. A 'hang-out' movie is a perfect way to describe Bad Manners. <br><br>The beginning of the film is mostly episodic, focusing on how the main characters spend their everyday lives causing havoc and mayhem in the \"Home of the Bleeding Heart\" Catholic orphanage. They have declared war on the gung-ho head mistress Sister Serena and ex-Nazi Mr. Kurtz, who zaps misbehaving children with a cattle prod. The place is turned upside down when the eternally cool and antisocial bad ass Piper arrives to stir things up. Intent on escaping, Piper reignites the rebellious spirit of his peers and befriends the tall and lanky Whitey, the token black kid Blackey, the rude problem child 'Mouse', and a tomboy named Joey played by a young Pamela Adlon who would later go on to voice Bobby Hill. <br><br>Mouse is soon adopted by a psychotic couple of yuppies played by Karen Black and Martin Mull with absurd campiness. As Mouse wreaks havoc on their home and life, Piper and the gang manage to escape the orphanage and set out on an adventure to rescue him. Their journey leads to several hilarious scenes including mayhem at a bus station and being threatened by a taxi driver with a pick-Axe. <br><br>The acting of the kids is actually the high point of the film, which is surprising considering the great majority of child actors suck. Like I said before, their friendship seems genuine and fun, which makes for a very entertaining viewing experience. Maybe the only reason I felt a connection to the kids is because I saw it when I was a kid and could relate to them. I could understand how an up stuck adult could see this film and consider it complete garbage. Let's just say this movie is for the young and the young at heart.<br><br>I hesitate on calling this a cult film, because as far as I can tell it doesn't have any following at all. For some reason this film has slipped through the cracks into near-obscurity, but it deserves so much more. It is a truly funny unique film full of personality and a spirit of rebellion. I love this movie.","user":"HellBellsLiveWired","rank":[6,8]},{"title":"Greatest Eighties Movie ever","rating":10,"date":"27 October 2005","review":"If you can find this movie, it is your destiny to see it. My dad rented it when I was eight. I made him copy it so I could watch it every day. Bad Manners(aka growing Pains, Goonies and Ferris Beuler were the only three movies that I would watch when I was a kid. That may give you some idea of the prestige of this movie. The guy who wrote this movie is a God. The scene in the bus stop is one of the most memorable scenes in any movie ever. Why does everyone start kissing when the fire alarm goes off? I have no idea, but I love it. My best friend Chris saw this movie too. We always talk about it. No one else I've ever met has ever heard of it. I used to think the orphan girl with the black hair in it was hot. I am about to see what other movies she was in. maybe she ended up doing a porn after this. I will have to check.","user":"meshhomelife","rank":[5,11]}]