[{"title":"\"Young Billy Young, has a lot to learn.\"","rating":7,"date":"11 June 2006","review":"The title role of this western is played by Robert Walker, Jr. He's a young gun who with partner David Carradine gets separated after doing a contract hit on a Mexican general. In eluding their pursuers Carradine and Walker become separated. Walker comes upon the camp of lawman Robert Mitchum who takes a liking to Walker and makes him a protégé and reclamation project of sorts.<br><br>This is the first of two films Robert Mitchum did with writer/director Burt Kennedy. The second was the more humorous The Good Guys and the Bad Guys. <br><br>Not that Young Billy Young does not have its moments of hilarity. But it is a tripartite story involving the Walker reclamation, Mitchum's hunt for the bad who killed his son and a romantic triangle involving Mitchum, Angie Dickinson, and town boss Jack Kelly.<br><br>The film abounds with nepotism. David Carradine is John's son. Dean Martin's daughter Deana is in this, Walker is the son of Robert Walker and Jennifer Jones and Mitchum's son Chris plays Mitchum's son in some silent flashbacks.<br><br>Robert Mitchum got his start in westerns and always looks right at home in them. Angie Dickinson essentially repeats the role she had in Rio Bravo. Walker had a brief career playing rebellious youths and doing a good job at it. I've often wondered what happened to him. He looks hauntingly like his father. Maybe he didn't want to come to such a tragic early end like his father.<br><br>And it that wasn't enough, Mitchum fans get to hear old rumple eyes sing the title song at the beginning of the film.","user":"bkoganbing","rank":[21,24]},{"title":"Not entirely satisfying","rating":6,"date":"5 July 2000","review":"\"Young\" Billy Young(Walker) is on the run after having killed a ruthless Mexican general. He runs into sheriff Mitchum, who \"makes him an offer he can't refuse\", i.e. to become his deputy. The young man is reluctant at first, but with bad guy Fred Boone on his way to town, he realizes that his help will be more than welcome.<br><br>However, if you think that the story centres on any of these events, you are wrong. It's a bit of everything and always too little of it, if you know what I mean. For example,you hear the characters talk every now and then about the bad guy Fred Boone. However, you won't get to see him until the final gunfight, which is over before you know it. Perhaps, the film is most interesting for fans of Robert Mitchum. He has a great part as the aging sheriff and obviously has a lot of fun playing it too. In fact, he must be one of the most enjoyable characters I have ever seen in an old western.(better than most John Wayne parts)<br><br>The acting is actually overall quite good. Angie Dickinson too has a nice part as a local \"dancer\". The story isn't too bad either, except then for the fact that it seems awfully shortened. The film as a whole lasts only a mere 89 minutes and that's just too short for the potential it has in it. So: not bad, but not better than 6/10.","user":"PeterJackson","rank":[17,19]},{"title":"Who Rides With Wyatt . . . I mean Kane","rating":24,"date":"24 February 2006","review":"Fans of the movie TOMBSTONE and other Wyatt Earp movies may be interested to know that this movie was very loosely based on Will Henry's WHO RIDES WITH Wyatt, a heavily fictionalized novel about Wyatt Earp's war with the Cowboy gang and his feud with Cowboy-sympathizing sheriff John Behan. In the novel, the \"Billy Young\" character is actually Johnny Ringo, who--in a completely fictional subplot--is at first protected, befriended and mentored by Wyatt (as Billy is by Kane in this movie), until Ringo gets more and more deeply involved with Curly Bill and the Clantons and Wyatt has to come after him. The novel is grim and dark, with an admirable but not very likable Wyatt. The movie is entertaining fluff, with a storyline that has less and less to do with the novel and the real Wyatt Earp as it goes along. Surprisingly, a good bit of the dialogue of the novel is retained, at least in the early scenes with Kane, and the script even retains the Earp-Behan-Lily triangle. The Behan character is even called \"John Behan,\" and gets a surprising comeuppance from a surprising source. David Carradine is his usual watchable self as a more likable version of Ike Clanton.","user":"Bilwick1","rank":[15,17]}]