[{"title":"A wonderful film full of hope for the human race.","rating":9,"date":"23 December 1998","review":"Through the eyes of an alien, we view our world.  Such is the beauty of John Carpenter's 'Starman'.  His gentle alien comes in the form of a human clone (Jeff Bridges), and as we watch him interact with the rest of our race, we see both the good and the bad in all of us.  It is this particular role that I find to be Jeff Bridge's most superb acting (or close to it, given his amazing work in 'The Fisher King').  To me he always did seem an alien in an unfamiliar human body, rather than the actor \"Jeff Bridges\".  While there is certainly some over-simplification in the movie, and it can get a little sappy, I find the 'sap' in this case to be both touching and beautiful.  How wonderful, how sad, how miraculous, to watch ourselves through the innocent and wise eyes of this alien being.  A brilliant look at human beings, a sweet love story, and an excellent exploration of our spirit.","user":"mattt8","rank":[99,116]},{"title":"You may be shocked to read that this is one of the best science fiction movies ever made","rating":10,"date":"16 November 2008","review":"John Carpenter directed \"Starman\" in 1984, hot off the mega-success of the landmark horror movie \"Halloween\" in 1978 and the cult science fiction/adventure flick \"Escape from New York\" in 1981. \"Starman\" was a significant departure and change-of-pace from all of Carpenter's earlier works.<br><br>While essentially a science fiction story involving all the essentials - aliens, the United States Army, government cover-ups, a countrywide chase adventure and what's this, an intergalactic love story? - Carpenter is able to make sense of the material in such a way that it is both respectful to the sci-fi genre, the sci-fi fans, and to the audience members who may not give a crap about this sort of stuff and only want their corn popped.<br><br>The biggest surprise about \"Starman\" is the script by Bruce A. Evans and Raynold Gideon. They're able to strip a laughable story of all that makes it laughable and create something new, something that is intelligent, heart-warming, action-packed, and romantic. Carpenter takes his cues from the material and makes everything in this wondrous sci-fi/action piece his own. And who can forget that awesome synthesizer score by Jack Nitzsche (strange since Carpenter usually composes his own film scores)?<br><br>Evans and Gideon's script, taking its cues from \"The Day the Earth Stood Still\" (1951) and \"E.T. the Extraterrestrial\" (1982), concerns an alien who has come to Earth after answering an invitation he found on the Voyager II space probe. However, his ship is attacked by fighter jets and he manages to make it to the Wisconsin cabin of young widow Jenny Hayden (Karen Allen), still grieving the death of her husband. After sampling DNA taken from a lock of hair of her late husband, the alien grows into a human clone of him, where he is now played by the actor Jeff Bridges.<br><br>After overcoming the obvious speech barrier when he learns to speak in English, Starman then requests that Jenny Hayden drive him from Wisconsin to Arizona, where he will meet the mother ship that will take him back to his home planet. Unfortunately, they only have a few days before he'll die from what we can only guess is exposure to our atmosphere. Matters are further complicated when the military becomes involved, desperate to catch Starman at all costs, much to the horror of laboratory rat Mark Shermin (Charles Martin Smith). Along the way, Jenny grows from being fearful of this visitor from another planet, to respecting him and finally loving him, while he gets to learn about human beings and BEING human.<br><br>It's not enough to say that both Jeff Bridges and Karen Allen are this film's magical centerpiece. They certainly make for one of the most dynamic, unusual and interesting screen couples in cinematic history, certainly one of the best screen couples in the history of science fiction cinema. The real stand-out of course is Bridges. This is a role that he rightfully received an Academy Award nomination for Best Actor for. We see no trace of the actor \"Jeff Bridges\" in there, all we see is \"Starman,\" defined largely by his awkward mannerisms and patterns of speech, and it is a skillful, humorous, and touching performance that is the pure anti-thesis to Carpenter's earlier \"The Thing\" (1982).<br><br>John Carpenter, unfortunately, has not received a whole lot of recognition for this picture. Although it remains his only film to go to the Oscars, I only hope that this touching, once-in-a-lifetime science fiction/adventure-romance gets the recognition it so rightfully deserves.<br><br>10/10","user":"dee.reid","rank":[68,80]},{"title":"\"Define Love\"","rating":10,"date":"30 October 1999","review":"This beautiful and funny science fiction film comes very close to being my all-time favorite movie.  This film is about love.  An alien lands on Earth to investigate the life-forms, and encounters Karen Allen.  A cross-country chase ensues as our alien has to meet up with his starship in Arizona. <br><br>\nBut for me, the main point of this film is not the chase, the cloning by the alien, the humor throughout the film, or the eventual outcome which led into the subsequent TV series.  The focal point comes in the diner where our alien asks Karen Allen to \"Define Love.\"  If everyone would take this definition to heart, this world would be a much better place!<br><br>This is what movie making should strive to achieve.  This film has virtually everything...  romance, humor, action, suspense, a gorgeous soundtrack, beautiful cinematography, an intelligent screenplay with a most important message, and talented actors and actresses.  I gave it a SOLID 10!","user":"Chazzzzz","rank":[75,92]}]