[{"title":"\"The actual life of real people went on as usual\"","rating":8,"date":"10 July 2008","review":"Well, consider me astonished! Part Two of Sergei Bondarchuk's epic adaptation of \"War and Peace\" contains not a single gruesome war-time death, and yet I think I enjoyed it more than the previous instalment. 'Voyna i mir II: Natasha Rostova (1966)' almost entirely follows the exploits of the title character Natasha Rostova (Lyudmila Savelyeva), the adolescent daughter of a countess. Napoleon has signed a treaty with Russia, and thoughts of war have momentarily drifted from the minds of its inhabitants, who now turn their attention towards the equally-tragic themes of love, friendship, hatred and passion. If we'd expected peace to have provided temporary relief from the carnage and chaos of conflict, we're certainly offered some reassurance, but the story's major position seems to be that heartbreak is hardly restricted to the horrors of war. Human relationships are delicate and potentially-implosive entities, and the conflicting emotions offered by the heart can often result in tragic consequences, condemning fresh young personalities to a lifetime of unfulfillment and dissatisfaction.<br><br>Part One of 'War and Peace' gave us our first glimpse of Natasha Rostova, as a bright-eyed and giggling youngster yearning for her first romance. By the conclusion of Part Two, she will have forever bid farewell to her childhood, and have entered the sobering years of adulthood, heartbroken and disillusioned. The film's first major set-piece  perhaps rivalling Bondarchuk's own battle recreations in scope and attention-to-detail  is a breathtaking New Year's Eve ball, adorned by hundreds of elaborately-costumed dancers who sweep across the floor with impeccable grace. Displaying a versatility that calls to mind a similar sequence in Orson Welles' 'The Magnificent Ambersons (1942),' Bondarchuk's camera glides majestically amid the flurry of waltzing couples, while retaining its intimacy through focusing the spectacle largely from Natasha's perspective. It is here that the blossoming beauty again makes acquaintance with Prince Andrei Bolkonsky, whose wife had previously passed away during childbirth. Andrei immediately confirms his love for Natasha, whose enthusiasm for life had offered the war-weary soldier a fresh opportunity at happiness.<br><br>Lyudmila Savelyeva really is very impressive in the main role, undergoing a dramatic transformation from shy débutante to disgraced lover. By the film's end, following her liaison and attempted elopement with a married man, Andrei finds that everything he'd loved about Natasha  her youthful naiveté, her fervor towards the wider world  has evaporated in a cruel rite-of-passage, and he regretfully rejects any future with her. Natasha's emotional maturement is also reflected in a noticeable physical transformation, and that Bondarchuk filmed the 'War and Peace' over a number of years would certainly have been beneficial in communicating her character's growth. Savelyeva at times boasts a striking resemblance to Audrey Hepburn, who played the same role in King Vidor's 'War and Peace (1956),' and her character bears similarities to Vivien Leigh as Scarlett O'Hara, though she distinctly lacks the resolve to handle the troubles brought forth by her own dishonourable actions. Whereas Part One attempted to cover too many narrative threads, thereby sacrificing our emotional attachment to any of the characters, Part Two effectively addresses this issue, and, as for Natasha, our hearts are with her.","user":"ackstasis","rank":[6,7]},{"title":"Love at the ball","rating":9,"date":"1 June 2019","review":"Adapting 'War and Peace' is no easy picnic, and it is not just the mammoth length we are talking about. The story is sprawling and with a lot going on with a lot of richly drawn events and characters, and when adapting there is the question of how to make it accessible and what to include while maintaining the complexity and spirit. It takes a little time to get into, but it is very powerful storytelling and the characters fascinate.<br><br>This adaptation from Sergei Bondarchuk is one of the best, evidenced already in this first part, alongside the 1972 mini-series. When it comes to flawed but towering achievements, this adaptation immediately fits that distinction, something that shouldn't be missed regardless of whether you speak or have knowledge of Russian or not. Part 1 was an excellent start with mind-blowing war scenes. Part 2 for the same and a couple of different reasons is every bit as excellent.<br><br>While the first part was more emotionally powerful, the second doesn't try to do as much and is more settled dramatically. Again, more bite would have been more welcome but not in a way that distracts too much, likewise with more tension.<br><br>It was great though to have more development to Natasha, easy to root for, here and the family drama elements are tighter and more settled, as well as handled with delicate heart.<br><br>On a visual level, 'War and Peace Part 2: Natasha Rostova' continues to stun. The scenery and period detail is spectacular and gives a sense of time and place far better than any other version of 'War and Peace' and the cinematography is inventive and enough to take the breath away. The real treat here in this part is the costumes, which are an elaborate wonder in the big ball set piece. The scope and spectacle is also enormous yet it is not done without soul, there is heart here. The music score is also a beauty and adds so much to the atmosphere.<br><br>Like Part 1 had the war sequences, Part 2 has one of the adaptation's finest moments. The ball is one of the visual standouts of the entire adaptation, breath-taking in its scope, beautifully choreographed and gorgeously romantic. The script is rich in detail, thoughtful and mostly true to Tolstoy's style, while there is so much recognisable material done with the right spirit. The characters are not caricatures and the drama is poignant and not soapy.<br><br>Vyacheslav Tikhonov and particularly luminous Lyudmila Saveleva both impress, and one does feel Andrei and Natasha's love.<br><br>Summing up, excellent. 9/10","user":"TheLittleSongbird","rank":[3,3]}]