[{"title":"Entertaining Filipino vampire schlock.","rating":10,"date":"10 August 2007","review":"An evil genius vampire whose minions include a hunchback, a midget, a hot chick with sunglasses, and a rubber bat tries to save the life of his vampire lover by transplanting her with the heart of her long, lost sister. The sister, inconveniently, is still alive. Plays at times like an Ed Wood movie, at others like a classic, albeit low-budget, horror film. Made in the Philippines, which lends jungle atmosphere, interesting architecture, and enough catholic iconography to satisfy the Pope. Badly dubbed in English, including the fact that three completely different characters are, evidently, supposed to be mute and make the exact same, \"Uhn, uhn, uhn,\" noises in the exact same voice, which is blissfully confusing. Features one singing cowboy scene, Captain Kirk-style martial arts, and a musical score that sounds like it could be library tracks but nonetheless is very effective. The film is sometimes black and white, sometimes color, and sometimes tinted a garish magenta, which actually works to heighten the atmosphere at least part of the time. Anyone who has read this far and is still interested will not be disappointed.","user":"Blaise_B","rank":[10,11]},{"title":"Good little thriller","rating":7,"date":"17 October 2006","review":"Atmospheric vampire of story about a vampire who comes to a small town in order to secure a heart for the girl he loves. Its an eerie little film, a bit silly at times, but entirely watchable. It won't scare you but it will keep you watching (its more vampire drama than horror film).<br><br>Its a stand out little film that has the feel of a specific time and place that is uniquely its own. Set now, we see cars and trucks and guns the film has a decidedly Gothic feel and at times seems to be set in the 1860's rather than the 1960s. There is a religious nature in the film adds more weight to the proceedings. The film builds up a nice sense of good versus evil and of God vs the devil, even though we sympathize with our villain. Few films have a villain as well drawn as this one does, you hate him but you like and understand him.<br><br>The most memorable thing about the film, aside from the bald vampire, is that much of the film was shot in black and white and then tinted red or blue depending upon what was happening in the scene. Even though its odd to see at first, it does begin to add something to the film when you realize that the tints actually correspond to certain events in the film, and that people in the film react as if aware of the tinting. I didn't get it when I originally saw the film on TV (which apparently had the wrong scenes tinted) nor did I pick it up on the first go through of the recent Image DVD. It was only after listening to the commentary track that I really was made aware of how the right tints actually help the film seem creepier.<br><br>Not a classic, but a its a good little thriller.","user":"dbborroughs","rank":[7,8]},{"title":"A word on the color-sepia-color switching...","rating":28,"date":"28 March 2005","review":"Sorry to demystify the cinematography but it was a question of COST. Color film stock was prohibitively expensive then and the producers couldn't afford to shoot all the scenes in color. This practice was prevalent in the Philippine film industry in the late 60's/early 70's. I remember a billboard advertising a comedy as \"filmed in partly color\"(sic). If the visual inconsistencies tended to enhance the narrative and add to the creepy character of the movie, well and good. So, there it is--another mystery gone.<br><br>Incidentally, it is not widely known that Gerry De Leon was an MD but never practiced this profession. His family was in the movie business and he promptly went into it after graduating from med school.","user":"gaby01575","rank":[12,16]}]