[{"title":"One of Bergman's best films (major spoilers below)","rating":10,"date":"20 June 2003","review":"Film lovers with a slightly more than rudimentary knowledge of the subject recognize that Ingmar Bergman was active long before he directed The Seventh Seal and Wild Strawberries. Still, few of those earlier films are known that well, besides perhaps Smiles of a Summer's Night (which I don't care for much myself, though I owe it a reassessment). In 1953 Bergman made two of his greatest works, Sawdust and Tinsel and Summer with Monika (distributed in the US as simply \"Monika,\" but I prefer to use the entire title, as it just sounds better). Sawdust and Tinsel, as I say, is another masterwork; do see it. But it is not the issue at hand here. <br><br>Summer with Monika has a classic art film story behind it: Bergman came up with the idea quickly, having gotten some money, and he just took his few actors and crew on a summer vacation with very little planning involved. What results is a simple story, but one that is very mature and emotionally complex. Two teenage lovers escape the tyranny of their parents. Stealing a boat, they travel around the southern islands of Sweden together, revelling in their adolescent lust. A few things happen along the way, but they aren't really worth mentioning. Not that these events are unimportant, only that to describe them would not be useful here; they ought to be experienced as they happen.<br><br>What makes this film a masterpiece is the third act. Teenage love is often so idealized by artists, born from an air of irresistable nostalgia. Maybe Ingmar Bergman was too much of a pessimist for his characters to find neverending happiness by the time the film fades out. Harriet Andersson, a Bergman regular, of course, plays Monika. There is a love in her, and she may even really love Harry (played by Lars Ekborg) when they set out together. On the other hand, part of it is she just wants the experience of an adventure, of independence from her cluttered and sad homelife and parents, of love, and, not least of all, of sex. Monika is, first and foremost, a sexual being. Andersson is not exploited, though, as she so easily could have been (French actress Brigitte Bardot provides the best example of just how an actress' career can be harmed by these kinds of highly sexual roles). Andersson arouses the audience, but Bergman is careful (as he is with all of his women) not to make her into some cheap male fantasy. We want Harriet Andersson, yet we realize that she is not to be had. She is her own person.<br><br>This manifests itself in a pretty nasty way in the third act. Eventually, as the summer begins to fade, Harry decides that the two of them cannot spend the rest of their lives drifting around on a boat. They also have realized that Monika has become pregnant. Bergman thus eschews the type of ending where the two return home, maybe in love maybe not, and that's that. Instead, he gives these two characters a reality check. Harry jumps into it with gusto, marrying his sweetheart and getting a decent job. When his child is born, he is overjoyed. Unfortunately, Monika (who is two years younger than Harry, at 17) cannot make the same leap. This monotonous, routine life which she was hoping to escape falls back down on her. The fact that she has a child annoys her: no longer is she free to do what she chooses. And her lust is now left unsatisfied: Harry sees her as the beautiful mother of his child, not so much as his lover anymore. Ultimately, because Harry is away so much with his work, Monika's lust breaks loose. In the film's most memorable scene, she picks up a new boyfriend at a bar. Bergman allows her to look straight into the camera, one of the earliest examples of a filmmaker breaking the fourth wall. Monika looks into our eyes, and we see the pain, fear, and loneliness she has acquired. The shot is held for what seems like forever, even though it comprises only a few seconds.<br><br>\nMonika leaves Harry and their baby. The film ends with Harry alone, staring at himself and his child in the mirror. He is hurt, that is certain, but I do not believe that he judges her too harshly. After all, he does understand Monika and her temperament. As he remembers the beauty of the summer he and Monika shared, he cradles in his arm the only physical evidence left of that time. It's a sad ending, but, with the warmness we see in Harry's expression, we know that the child will be much loved by its father. Life continues.","user":"zetes","rank":[68,80]},{"title":"Great movie. Sensitive and solid story, very good performances.","rating":23,"date":"23 October 1998","review":"It is a very sensitive and solid story about love and loss.  It fascinates you from the beginning, first of all because of the beauty of the images and then by the credibility of the characters.  There's also plenty of small human details which together make a whole masterpiece (The moment that Monika turns and stares to the camera is one of them).  Strangely enough, this movie is never mentioned among the best made by Bergman. But it is a great movie.","user":"fer-4","rank":[26,29]},{"title":"a sleeper-classic, naturalistic, with trademark-Bergman imagery","rating":10,"date":"10 January 2005","review":"Summer with Monika is a very fine, sometimes masterful showcase of what would be to come with Ingmar Bergman's more notable and personal dramas. That is, in the technical side of things; here he uses a lot of shots that are simply there for the location, the imagery of the rocks and beach and waters where the characters are at. It's much more in a sense of a documentary of these two people than a usual tale of young love. But it's a good story at the core, and in it Bergman also establishes one of the actresses that would become crucial to his career. <br><br>Harriet Andersson is remarkable as the happy, though high strung and (as one in my generation might call) 'needy' Monika, who works at a vegetable stand. She meets Harry (Ekberg) in a bar one day, and the two hit it off after later seeing a movie. Monika's home life is the pits, as is Harry's work environment. So, they act on an impulse to get away for the summer to an island. Out of that comes what is very natural in a relationship- happiness, love, despair, hunger, and the oncoming (unplanned) child. The third act goes as how one might expect, but the way it's filmed and acted is still extraordinary.<br><br>Once Bergman gets his film on the water, he just shoots and shoots. Some of this may not seem to go anywhere, some of it may just seem like shots of animals and rocks. But I have a feeling Bergman was likely inspired by either painters or the neo-realists with their documentary feel. If nothing else, everything feels very much alive and real with how the characters talk and act to each other, and that doesn't lose its ground after fifty years. <br><br>Some shots here and there (one when Monika is out one night, when Harry is not at home, is intriguing on how it just stays on her, and how it's lit) are some of the more memorable ones of the 1950's for the director. I also liked how the characters were believably stuck in the middle of a very plausible dilemma- do they keep on going on with a great, bit love affair alone and off from civilization, or do they face up to what they have to do with living? It's a tragic, somewhat obvious conclusion, but the way it's told is how it scores some points.<br><br>Basically, Summer with Monika is a fresh, dark love story that may appeal to those looking for a good alternative to a film of today loaded with cynicism or delight in the shrill conventions with the characters. One may have seen characters like Monika and Harry in other films, yet they are fitting for the style of Bergman's precise bittersweet whimsy and depth.","user":"Quinoa1984","rank":[40,49]}]