[{"title":"End of an Era","rating":31,"date":"31 October 2004","review":"The 1972 Summer Olympic Games, in many ways, were the end of an era. Since 1936, the IOC had required each Local Organizing Committee to submit a documentary film as an historical record of their Games. After Munich, less emphasis was placed upon this and more upon Bud Greenspan's independent efforts. Only one-eighth of this film was directed by a West German; today, an American helms them all.<br><br>Munich '72 was the last occasion on which Olympic security could be said to be at all relaxed. The face of terrorism, at least before 9/11, bears the stocking mask of the Black September lookout at 31 Connollystrasse in the Olympic Village. John Schlesinger of \"Midnight Cowboy\" fame, assigned to film a British marathon runner, incorporates the tragedy into his mini-film as a distraction to the absurdly detached athlete.<br><br>After 1936 they all were imitating Leni Riefenstahl. Here, Japanese director Kon Ichikawa, filming his second Olympics, rings a change on the German's pioneering use of slow motion, using three dozen Arriflexes and four miles of film to turn the 100-meter dash into a quarter-hour examination of tortured lungs and leg muscles.<br><br>Producer David Wolper's take on this film was that it could have been better and was greatly improved in the editing room. The same could be said of any slice-of-life documentary, sporting or otherwise. The voice-over narrator sounds a lot like David Perry, who would soon become ubiquitous as Bud Greenspan's offscreen announcer. For almost the final time, feature directors got to play documentarian all those years ago.","user":"directoroffantasies","rank":[10,11]},{"title":"The Art of Sports","rating":10,"date":"25 February 2003","review":"The summary at the introduction says it all: 'it's not a summary of sports'. This is the kind of production that is willing to rewrite, rather reinvent, the shape of sports docummentaries. Far from the focus on results of the almanac-format production, this new vision of the tension of obsession, of the muscle stress, of the jump of joy, of the tears of defeat and, in short, the beauty of the design sports can provide, brings us the Expressionist angle the Olympics hides in the shadows of the action that TV images will never be able to catch. More than a masterpiece, each of the eight episodes should be treated as a directing class.","user":"interconti","rank":[10,13]},{"title":"Fantastic movie","rating":22,"date":"22 December 1999","review":"This movie has Eight of that era's top cinematographers in and from around the world.  They come together along with David L. Wolper (renowned historian) to look at the 1972 Olympics thru the camera's eyes.  They take you on a journey through 8 different parts of the Olympics and between segments show various clips of the unity and heartbreaks of the 1972 Olympics.  A powerfully moving film that will inspire spirit into those who adore the Olympics for what they truly stand for and the thrill of victory, and defeat in some cases.  At times, it seems a bit of a documentary but when the cameras roll and the director wants to show his talents... do not blink because you will miss the artistry that ensues. A must see if you can find.","user":"shadsu","rank":[7,10]}]