[{"title":"You scream. I scream. We all scream for 'The Stuff'?!","rating":8,"date":"19 April 2007","review":"A workman discovers some mushy white foam at an petroleum refinery in Alaska, and he gets the urge to try it and surprisingly it's tastes really good. Soon enough, it's a top-selling American dessert product known as \"The Stuff\" and everyone just can't seem to get enough of it. Industrial saboteur Moe Rutherford is hired by some rival companies to dig up information on \"The Stuff\" and he learns that it strangely got by FDA tests with those who passed it disappearing. Moe with the help of Nicole the advertising designer for 'The Stuff ' and a young boy Jason, whose family became obsessed with the deadly substance. Discover that the addictive dessert is actually alive and taking over the body of whoever eats it.<br><br>Yummy! For those looking for some tasty schlock that's low in calories and is a complete throwback to 1950's Sci-Fi horror. Larry Cohen's \"The Stuff\" definitely leaves a sweet taste in your mouth. Despite it's familiarity with the likes of \"The Blob\" and \"The Invasion of the Body Snatchers\", the neat premise still manages to feel fresh, sharp and ambitious, because of the unpretentious fun that's generated. All of this shows up in Cohen's enthusiastically accomplished direction and ace timing, where his off-the-rocker style shines immensely. Like most of his films, the playfully witty script digs deep into a social commentary and the flavour of the month happened to be consumerism and it's grip on society. The irony suggested ending, paints it perfectly. Not all of it is light and goofball in tone, as there are some dark, moody and gooey inclusions to the fold. There's a heavy cartoon-like atmosphere cooked up within a few striking images of creepiness and the deliciously campy special effects are well staged for such a low-budget production. Pacing is judge accordingly to pull you in. Cinematographer Paul Gickleman fluidly shot the film and the lively music score by Dwight Dixon ticks along fittingly. Cohen also pens the colourful story, which is terribly fractured with vagueness and continuity problems, but it's quirky maniac humour, zany developments with a surprise or two and satire frame of mind goes a long way to covering that problem up. The fruity performances are acceptably apt to what's happening on screen. The always interesting performer Michael Moriarty is wickedly good as the smarting, downbeat industrial spy Moe Rutherford. Paul Sorvino provides some amusing comic relief as an high strung, off-the-boil right-wing Colonel. Andrea Marcovicci, Garrett Morris, Danny O'Neal, Patrick O'Neal, Scott Bloom and Cohen regular James Dixon give splendid support too.<br><br>Even with some lapses within the story (due to probably the editing) and it being one of his lesser features, it's hard not to be infatuated by Cohen's outrageously delightful and creative treat for the taste buds.","user":"lost-in-limbo","rank":[26,32]},{"title":"Great, entertaining movie","rating":10,"date":"30 November 2004","review":"In contrary to the previous comment, I have to say this was a great movie. Who would ever come up with an idea that ice cream would be the instrument for our doom? What person would ever come up with tricking his parents that he was eating it, but he was actually eating shaving cream? When I was a child, after watching this movie, I had the mad rush of curiosity and tried it myself..Yuck!<br><br>Anyway finally, where else can we find great horror, suspense with humor without the hell of CGI?;) This is why I love 80's movies so much and I highly recommend it for a Friday night with pizza.","user":"farcoat","rank":[42,57]},{"title":"There's more to this movie than satire","rating":9,"date":"5 March 2005","review":"I LOVE this movie. I rented it in high school because the cover looked like it was going to be total horror schlock. This of course was not the case.<br><br>On the surface, it definitely satirizes American consumerism.... but after several discussions with my friends, we noticed something else. This movie also seems to be Cold War era anti-communist propaganda. The Stuff, seemingly innocent at first, possesses and adapts you as part of the machine to further its spread around the globe (just as we were told in the ages of the Red Scare, communists are everywhere, and you can't tell them apart from you or I, and they will try to CONVERT YOU). Before long, all the people are willing slaves of the Stuff machine (the Stuffies), and they seek out the few that aren't under the Stuff's grip to force them into becoming part of the hive mind. It takes the actions of a few patriotic Americans (in the form of the Georgia Militia) to conquer and defeat the Stuffies (the Communists hidden among us).<br><br>I highly suggest checking this movie out, as it really is a great film, regardless of whether you agree with my opinion of what the movie is about.","user":"HeadMonkey","rank":[28,38]}]