[{"title":"A great surprise!","rating":8,"date":"22 April 2002","review":"For my 12 year old sleepover party I rented this movie ( I am now 19) and me and my friends loved every moment of it. We still even talk about it today and some of the great parts it had. One of my friends even rented the first one of these movies. It has some very cool murder scenes and the ending is excellent. I definetly recommend this for those who enjoy the friday the 13 movies.","user":"movie king","rank":[16,19]},{"title":"Just keeps getting worse although I did enjoy Angelas rap tape","rating":3,"date":"20 March 2009","review":"Angela returns again to another stupid and pointless sequel, she returns yet again to the camp where she murdered everyone only this time under a new name Maria and a new look, but then her murderous instinct's kick in and she starts killing again.<br><br>Pamela Springsteen returns once again in this silly and stupid sequel as Angela Baker (originally played by Felissa Rose). Well, Sleepaway Camp 3 is basically Sleepaway Camp 2 all over again but with less campers and a more good-looking Pamela Springsteen and once again the comedy seems to be more in focus than the horror. Don't you just hate when that happens to originally good horror flicks? Angela's one-liners are stupid and never deliver so much as a giggle.<br><br>The acting is just as bad as the acting in the second movie and it almost feels as if they shot this directly after wrapping up production on the second movie since it's even the same director.<br><br>Sleepaway Camp III is a dull and stupid slasher that I don't get why slasher fans like it, the killings this time round are quite dull, but the one Angela placing a rap tape in the tape player of her next victim was enjoyable and quite funny.<br><br>All in all awful slasher that only gets a 3 because of the inventive rap sceme murder","user":"acidburn-10","rank":[11,13]},{"title":"Chores for a crazy person.","rating":10,"date":"10 July 2007","review":"Fairly early in the film, our lovable murderess asks, \"Why did I think this year would be any different?\" And this unlocks why part 3 still works: gone is the chipper camp counselor and her hopes of making good clean friends. Now, returning incognito as a camper, she realizes the world is a terrible terrible place filled with terrible terrible people. Round 3 of the chaos, and she picks up her axe with the same sigh and groan you might hear from a daughter assigned to \"wash the dishes, make your bed, clean the toilets, and take out the trash.\" Why can't she find people who deserve to live for once? <br><br>That's not to say Sleepaway Camp 3 has lost its sense of humor. Far from it. It delights in exploiting a silly trust building exercise: Angela gets to tie up and lead her blindfolded partner through the woods. \"You do drugs?\" Angela quizzes her buddy. To which the girl replies, \"Doesn't everyone?\" Like the good girl-scout she is, Angie leads this poor misguided soul to miraculous deliverance, and I say miraculous because of how far fetched the murder is (but it's still a treat to watch.) Angela, herself, still has her sly wisecracks and all-too-honest answers to questions (questions like \"where'd you learn to chop wood like that?\"), only the delivery has changed from cheerful optimism to \"why me?\" (although she does sing the Happy Camper song over one of the murders.) <br><br>And this time she gets to play with more colorful, over the top, (read: annoying) fodder! We have a perverted old man, lazy hypocrite, a rapper, a rich snob, a dufus, awhy I am even bothering? Never mind, them. Angie'll get to them sooner or later (hurry up on the rapper  please, God, hurry up.) The group of campers split up into 3 smaller groups, and our heroine dispatches each sub-group one at a time and then shows up to the next group like a lost puppy, \"I was told to switch with someone from this group\" and the fun starts again.<br><br>Unlike most slashers, the kills largely take place in broad daylight giving the whole scenario a matter-of-fact quality that I liked. This *is* Angela's day job, after all. She's not Jason or Freddy  the girl has to sleep sometime. Besides, I like the idea of her moonlighting as a jazz musician or a dance instructor or a cop with Stendhal Syndrome or something.<br><br>Once again the series misses a number of opportunities to really rip into the genre's shortcomings (like poking fun at the gore obsession.) But the film's unwillingness to do anything significant with Barney (father of Sean in the previous film) bothered me the most. Here was a chance to actually build up a sympathetic character  someone we'd actually root for to stop Angela. Or perhaps even build him up as a character we really despise who could actually threaten Angela (early in the film he's asked what he would do if he came across Angela Baker. Without hesitation he answers, \"I'd kill her.\") War of the killers? Who do we root for  the wickedly fun Angela, or a revenge-driven father? This would take Sleepaway Camp into entirely new territory, allowing it to stand apart from the existing entries. But, nope, Barney exists as another victim for Angela, and after a brief unsatisfactory confrontation it's a moot point.<br><br>Like it's predecessor, SC3: Teenage Wasteland never hits the grand slam it should. But, what the hell, I love it anyway.","user":"jaywolfenstien","rank":[11,13]}]