[{"title":"I'll be honest. I actually liked this!","rating":7,"date":"16 July 2010","review":"At 18, I am a huge Looney Tunes fan. As a little girl, I loved watching them and laughing at the manic wit, marvelling at the colourful animation and admiring the playful and energetic music, not to mention loving the witty characters(especially Bugs and Daffy) and the fresh dialogue. Even if some cartoons were a little predictable in the story, I know some of the Speedy Gonzales cartoons were on the predictable side, I still loved them. And I still do, I've finished school now, and one of my guilty pleasures is watching Looney Tunes, Tom and Jerry and Scooby Doo on Boomerang, I can't help it and I still love them.<br><br>So as a huge fan of Looney Tunes, I heard there were a few movies and compilation films and thought I would like to check them out. I had an inkling I had seen parts of 1001 Rabbit Tales before, as the parts in the palace struck a big bell with me, but I insisted on seeing the whole film. Overall, I enjoyed 1001 Rabbit Tales. I agree it is uneven, not a huge surprise for me as I have found in the past that compilation films have parts that work and parts that don't quite, but I liked it.<br><br>First of all, it was a delight seeing all those cartoons. I love a vast majority of the cartoons featured, especially One Froggy Evening, Bewitched Bunny, Ali Baba Bunny and Tweety and the Beanstalk, which have great animation, music, dialogue and sight gags. The ones that didn't strike me as quite as memorable was Mexican Boarders and Apes of Wrath(though Bugs and the drunken stork elevated it), Mexican Boarders because although it was an improvement over most Speedy cartoons it was my least favourite cartoon featured. I did like Goldimouse and the Three Cats too, it starts off slow but gets better as Sylvester falls victim to his own traps.<br><br>As for the film itself, it was pretty good, though it is the case where the shorts and characters are better than the story itself in my opinion. The animation on the whole is pretty good, admittedly better in the shorts than in the edited bits, which had a good \"scratchy\" style but the animation in the cartoons was much more fluid and colourful. The music was highly enjoyable throughout, very playful and energetic, and I loved the humour. The humour in the edited bits stuck to the style of the early cartoons, with the interplay between Bugs, Yosemite and the Prince standing out. Though when it comes to the cartoons themselves, I loved the dark humour of Bewitched Bunny, how Sylvester Jnr in Goldimouse and the Three Cats was named \"spoiled brat\", the running joke that Bugs ends up somewhere other than he wants due to a wrong turn and the hilarious ending of Red Riding Hoodwinked(not to mention the Big Bad Wolf's short-term memory).<br><br>It was a huge delight to see all the Looney Tunes characters, Bugs and Daffy of course are the stars of the show, Bugs having more to do, while Yosemite is a delight as the Sultan, they pretty nail what he was like in the earlier cartoons with the hot temper and the fact he is always up to no good. Porky and Elmer aren't given as much to do, but they are good enough, while Speedy is a lot less annoying in two of his better cartoons(The Pied Piper of Guadalupe being the other). The drunken stork and Witch Hazel also give delightful contributions. And all of these characters are brilliantly voiced, Mel Blanc deserving the most credit.<br><br>However what I didn't like so much was that the film is too short, for me anyway, and I think it should have been better finished than it was. The story is a good idea, contrary to what has been said already, however it takes a bit of a while to get going but when it does get going it is fine. The pacing is uneven here I think, not in the cartoons but parts at the beginning could have been better paced. Finally while I loved the characters, there was one character I didn't like and that was the Prince. I just found him irritating, not his dialogue(which was great actually) but how he was voiced and animated, too loud and abrasive and blocky when it comes to the animation. I understand he was meant to be irritating, but not that irritating.<br><br>Overall, despite its faults, I liked it. When it comes to the compilation films, I felt Daffy Duck's Quackbusters had the better story and it felt better paced, but the humour and a vast majority of the cartoons here work splendidly. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[3,3]},{"title":"WONDERFUL ENTERTAINMENT","rating":5,"date":"5 July 2001","review":"While I do agree with the fact that this is not the best way to see these wonderful cartoons, there's no denying that for some this is the only way. Regular TV programming has fazed out Bugs Bunny cartoons. Great video compliations are out-of-print. And if you don't have cable TV, you're screwed.<br><br>It edits the original shorts with new linking material, which is not a new practice. Robert Youngson made a career out of this genre; his titles include \"4 Clowns\" and \"Laurel and Hardy's Laughing 20s\". Also, the MGM That's Entertainment! series, which is up to three. Most critics tend to praise those titles, but condemn the Warner Bros. Looney Tunes films.<br><br>That is not fair. \"1001 Rabbit Tales\" is a very good movie on its' own terms. Supervised by the late, great Friz Freleng, the linking material is the best so far in this series. The \"plot\" involves Bugs Bunny and Daffy Duck as salesmen for Rambling House Publishing (a great in-joke that's just one of many). They go their separate ways and Bugs ends up being a storyteller for Yosemite Sam's son (this is where the old cartoons enter in)<br><br>Freleng selects some of the very best Looney Tunes shorts for this film. His selections include \"One Froggy Evening\", one of the greatest of all time and \"Goldilocks and the Three Cats\" (featuring Sylvester Jr.) and his editing is seamless this time round, unlike previous entries where it looked more obvious. <br><br>Those critics who feel obliged to hate a film like this can go back on the horse they rode in on. Even Maltin thought it was decent at 2 1/2 stars. This is wonderful entertainment and considering today's entertainment, timeless.<br><br>**** out of 4 stars","user":"Katmiss","rank":[6,9]},{"title":"boiling oil","rating":5,"date":"8 July 2005","review":"After the creative team that made the classic Looney Tunes cartoons stopped making original cartoons, they made compilations of varying quality (after they all died, the cartoons turned into total garbage). \"Bugs Bunny's 3rd Movie: 1001 Rabbit Tales\" has Bugs and Daffy as book salesmen who go their separate ways to try and sell books. Eventually, Bugs arrives in the Arabian desert, where Yosemite Sam is the sultan and has a spoiled brat son. So, Bugs agrees to read to the boy, under the threat of bathing in boiling oil if he fails.<br><br>I guess that overall, this compilation is pretty harmless. If nothing else, they still had Mel Blanc doing the voices. But are compilations really that necessary?","user":"lee_eisenberg","rank":[2,3]}]