[{"title":"The Conventional Wisdom is Partially Right","rating":26,"date":"26 January 2005","review":"The conventional wisdom about \"The Birth of a Nation\" is that it represents an impressive and innovative display of cinematic skill that was unfortunately wasted on a story that promotes a bizarre and disturbing point of view. While that is certainly true in a general way, it might also be something of an oversimplification.<br><br>It really is almost like two different movies. The first part, which takes place in the era before and during the Civil War, contains little objectionable material, and it deserves praise both technically and for the acting. The second part, set in the reconstruction era, contains almost all of the disturbing material, and it also is really not all that great in terms of cinematic quality.<br><br>Then also, the degree to which \"The Birth of a Nation\" may have influenced the development of cinema has very likely been overstated . The controversy that it generated may very well have helped it to remain better known than other films of the era that were equally innovative and/or lavish, or nearly so.<br><br>If the movie had ended shortly after the memorable and well-crafted Ford's Theater scene, the anti-war sentiment and similar themes would remain the main focus, since the effects of war on families and individuals is depicted convincingly and thoughtfully. In that case, its occasional lapses would possibly at the worst be called \"dated\", given the quality of the rest of this part of the movie.<br><br>The second half, though, is completely unfortunate in almost every respect. Not only does it promote a distorted viewpoint, but the story becomes labored, and the characters lose their depth and become more one-dimensional. The purely technical side, such as the photography and the use of cross-cutting, might still be good, but much of the rest of it loses its effectiveness.<br><br>Perhaps more importantly, it really seems rather difficult to justify the credit that this one film gets in the development of cinema. There had already been numerous feature-length movies, and most of the techniques that Griffith used were also in use by others. He may well have been ahead of the pack in terms of appreciating their possibilities, but that does not mean that cinema would not have developed as it did without this particular movie.<br><br>Just as one example, the Italian epic \"Cabiria\", from the previous year, has the same kind of lavish scale, is quite resourceful in its techniques, and is quite entertaining, without causing so much controversy.<br><br>Other early feature-length films also include some creative efforts to adapt film-making techniques to longer running times and more complex stories. Finally, many short features from the pre-Griffith era experimented with the same kinds of techniques that he later would use systematically. There's no denying Griffith's considerable technical skill, but others of the era also deserve some credit, even if they and their works were less controversial, and are now largely forgotten as a result.","user":"Snow Leopard","rank":[203,267]},{"title":"The Birth of an Art","rating":10,"date":"31 July 2005","review":"Before \"The Birth of a Nation,\" motion pictures were a medium with the potential to be an art. This movie, more than any afore, realized that promise. It's the most important film ever made; it's the birth of an art. Alas, it's also racist.<br><br>The film's controversy appears to have left director D.W. Griffith dumbfounded, judging by Griffith's responses to critics and from descriptions by Griffith biographers. The son of a Confederate soldier, his prepossession for an antebellum South wasn't, if not still, unusual. Histories of the day, including those by would-be US President Woodrow Wilson, supported his perverted depiction of the Ku Klux Klan saving a South pillaged by carpetbaggers, scalawags and encouraged Negroes. The film quotes Wilson's \"History of the American People.\" Thomas Dixon Jr. himself solicited the White House screening where the President is said to have quipped, \"It is like writing history with lightening, and my only regret is that it is all so terribly true.\" Dixon's racist book trilogy and the subsequent play were Griffith's inspiration for \"The Birth of a Nation.\"<br><br>In it, the American Civil War and Reconstruction disrupt the once-friendly relations between the Unionist Stonemans and the Confederate Camerons. The first part is largely free of controversy, although its racially-segregated imagery underlies a nostalgia for the institution of slavery; it's idyllic romanticism and melodrama typical of Griffith, absent Dixon. And, the battle scenes are excellent. Explosions, smoke and hundreds of extras fill the action. Future prominent directors like Raoul Walsh and Erich von Stroheim assisted the direction. The action shifts between bird's-eye views and medium shots, demonstrating vast scope with attention to isolated skirmishes. Including Griffith with \"Judith of Bethulia,\" filmmakers had until now failed to realize massive battles with such grandeur. To top it off, cinematographer G.W. \"Billy\" Bitzer's moving camera shot of the Little Colonel's charge.<br><br>The second half of the film, when Congressman Austin Stoneman (based on Radical Republican leader Thaddeus Stevens) and his mulatto protégé Silas Lynch lead the freed slaves into postwar power, is when the racism becomes especially blatant. Blacks are portrayed as childish morons or as easily-excitable brutes--harmless enough if put in their place, such as with the condescending \"faithful souls.\" According to Griffith, it's the mulattos that are especially dangerous, because they posses the cunning of a white with the animalism of a black. What they want is to \"marry,\" which means rape, white virginal women. The film is sexist, too. This is most evident in the infamous scene of the Black buck Gus chasing the childlike Mae Marsh through the woods, to a cliff she leaps from to preserve her purity. It's especially offensive because it's so well done, except for the trope of the \"Little Sister\" ludicrously surviving the fall briefly for a last gasp. The photography sets it apart, and the crosscutting intensifies the classic last-minute rescue attempt, as the Little Colonel enters the action.<br><br>Yet, the Klan rescue is by far the most offensive and concurrently most exciting sequence in the picture. Griffith and his editors, headed by James and Rose Smith, crosscut between multiple actions, climaxing with the rescue of Elsie Stoneman from the threat of being raped, the Aryans and faithful souls under siege and the whole of Piedmont under the heel of a black mob. To that date, it's the most advanced, amazing montage and remains impressive to this day. Before, Griffith had found how exciting well-edited suspense could be, with \"The Battle at Elderbush Gulch\" and his last-minute rescue flicks, such as \"The Girl and Her Trust.\" And a variation of Wagner's \"The Ride of the Valkyries\" greatly adds to the intensity.<br><br>The silhouette of Klansmen riding upon a hill, with the sunrise behind; the moving-camera shot of the approach; the angled camera positions: Bitzer and Griffith photograph it brilliantly, too. That is, besides the interiors. Theatricality is the film's major cinematic weakness. This is most evident in the missing walls. The narrative structure is also traditional. Griffith would never do otherwise, and it's certainly not unique for 1915. Filmmakers were beginning to exploit the advantages of controlled filming within studio sets by now, but the open-air sets with natural lighting, as used here, were still prevalent. At least, the sets here are decorated in detail. Bitzer and Griffith, however, were consistently innovative in their beautiful outdoor photography--with camera movement and positioning, tinting, nighttime photography and good use of split-screens and of masking the camera lens.<br><br>The acting is also theatrical, but Griffith did direct his actors to be subtler in comparison to contemporary acting. Lillian Gish rose to the forefront of this style, largely because of this film, which made her a star. She plays Elsie Stoneman, who has the more prominent of the two romantic relationships in the film with a soldier from the other side; she's Griffith's ideal white virgin. There are some especially well-acted moments here for its time. The sequence with Marsh using ermine in attempt to garment her ragged house dress for the homecoming of her brother and Henry Walthall's slow, moving walk towards the front door of home are especially poignant--showing the destitution of the postbellum South.<br><br>\"The Birth of a Nation\" is a troublingly racist picture, which is said to have revived the KKK (as well as being the cause célèbre of the newfound NAACP in its efforts to censor it). Nevertheless, its importance in film history, and its cinematic merits are immense. There are other impressive works from this time: films by Bauer, Chaplin, Christensen, DeMille, Sjöström, Starewicz, Tourneur and Weber. Yet, to say the least about \"The Birth of a Nation,\" as far as I've seen, nothing before matches its scale with such filmic innovation.<br><br>It runs for 12 reels--having cost some $110,000 to make. Its vast popularity also had incalculable effects on movies as an industry, including the establishment of Hollywood at its center. Although other estimates are lower, Griffith-biographer Richard Schickel claims it grossed more than $60 million by 1917. Its influence, not only on cinema, is enormous. No other film has been as important to the direction of motion pictures as an industry and an art.","user":"Cineanalyst","rank":[151,204]},{"title":"VISUALLY ENLIGHTENING AND SOCIALLY DISHEARTENING \"BIRTH\" STILL A 10.","rating":10,"date":"9 February 2004","review":"D.W. Griffith's Civil War shorts were only a prelude to what has become one of the world's crowning cinematic achievements and one of its most painfully embarrassing moments concurrently.<br><br>To this day it still causes not only controversy but even verbal warfare amongst friends and critics.  But if films were judged solely on their subject matter many of our classics would have been tossed into the garbage hamper.  As being such, I will not let that taint my opinion of it.<br><br>\"Birth of a Nation\" succeeds on so many levels its difficult to find a place to start.  Perhaps its best to say that Griffith may have considered what he may be starting hence the freedom of speech title screen at the beginning. For not shying away from controversy alone Griffith deserves his merits. His use of tinting is outstanding.  Some may say (and they may be right) that Griffith is the father of the modern screenplay.  His use of setup, turning point, confrontation, turning point, resolution, and conclusion is still the formula used today and is usually the formula that has graced every best picture winner at the Oscars ever since their 1927 beginnings. The catch:  there was no written screenplay.  Griffith made this film in his mind as he went along.  THAT is genius.<br><br>The battle spectacle scenes were unequaled in their day.  This wasn't another day's work.  This was a big budget, Hollywood, parade of the extras, grand scale masterpiece.  One gets the sense that the real war was just getting the war scenes filmed.  Father of the close-up, father of the chase scene (on two fronts: individual after individual and group after group), father of showing synchronous events on two different stages, the buildup of dramatic climax, and the list goes on.  Outstanding use of camera angles (the perch overlooking the valley during Sherman's march comes to mind here), and historically accurate enactments (Lincoln's assassination) score big as well.  This was \"Citizen Kane\" a quarter of a century before there was a \"Citizen Kane.\"<br><br>The acting is surprisingly very well done.  Henry Walthall does a fine job as the star of the film but George Siegmann, Walter Long, and Ralph Lewis are three of the most villainous characters to ever grace a silent era film. And I would be amiss to not mention Lilian Gish who absolutely sizzles here.  After all these years she is still one of the most charming and beautiful women I've ever seen in my life.  Griffith obviously thought so as he used her in his other three masterpieces as well.<br><br>But for all of its cinematic showcasing, the film's image will forever be scarred by its outlandish racial prejudices.  And make no mistake about it, its a difficult watch.  As a white, its still difficult for me.  As a black, I cannot imagine.  It is so easy for me to sit here and say to separate its art from its viewpoint but that simply isn't realistic.  Should it be required viewing?  Yes.  Would I blame any black for not wanting to watch it or hating it after seeing it?  Absolutely not.  I understand where you are coming from.  The unfortunate thing is that the film could have succeeded without this viewpoint by simply making the south's new oppressors white union soldiers.  It IS historically accurate  to say that president Andrew Johnson did indeed want to crush the southern elite into oblivion after the war which is one of the things that led to his impeachment.  But Johnson, who is strangely not even mentioned in the film following Lincoln's assassination, certainly would not have employed northern blacks to do the crushing.  I understand the film was following Thomas Dixon's novel and play but to not even address how Ralph Lewis' senatorial powers overshadowed Johnson's presidential ones and those of Congress' 1866 Civil Rights Bill is proof enough that the film goes out of its way to make northern blacks the villains.  Griffith's only defense, and it is a SMALL defense, is that southern blacks are still apparently our friends.  Griffith was the son of a Confederate fighter which may explain some of his views.  But certainly he did not want to be a hate-monger.  He tried to apologize with the making of his next film, the masterpiece \"Intolerance.\"  He certainly had black friends on the set during the making of \"Birth of a Nation\" but this harks of the classic case of the good man who doesn't realize that some of the things he is saying are hurtful.  I don't think it really dawned on him. This however is a trivial compensation at best.<br><br>But at the end of the day, D.W. Griffith's \"Birth of a Nation\" is still a landmark achievement not just in film but in popular culture.  After its release film became a way of life for America instead of a treat you helped yourself to once in a while.  Not until Hitchcock would a director ever again be the star of his own films, wielding a control and vision so unique that their name is forever welded to our memory, for the better or the worse.  So many firsts.  So much controversy.  And controversy,ironically enough, has been Hollywood's middle name now for the last 50 years.<br><br>The nutshell:  absolute required viewing for all things considered.  Watch with caution and prepare to be disturbed.  Not being able to watch it is easily understood.  One of the 100 greatest films of all time...10/10.","user":"Auburn668","rank":[160,227]}]