[{"title":"Remember yourself","rating":31,"date":"31 March 2003","review":"We all remember being a teenager.  A crazy, intense time when your high were higher and your lows were lower, and every experience was that much more significant.<br><br>John Hughes movie brilliantly captures that environment, that era in our lives, and all the social rifts that we all helped to create for ourselves. I have heard it said that \"The Breakfast Club\" is melodramatic, overacted, and simplistic.  If you subscribe to that flippant perspective you might as well join Vernon in his office because you are doing the same thing that he did.  Seeing the movie as you want to see it, in the simplest terms and the most convenient definitions.<br><br>If you really want to understand this film, think back to your own high school days.  Think about your last year there.  Dig out your old diary or book of angstful poems and reaquaint yourself with who you were then, when you felt things more deeply.  \"The Breakfast Club\" does not exist not for highschool kids, as some suggest.  Why would they need it?  They live there. It exists for all of us who have already been through there, who feel that they are above it now.  It exists so that we can remember what it was like and better understand ourselves, and the next generation.  Because you can't dismiss something you understand.","user":"hazel_inverse","rank":[416,456]},{"title":"The cream of the crop in 80's fare.","rating":10,"date":"30 May 2000","review":"This movie is one of the best, if not THE best, 80's film there is.  The fact is, every teen character in this movie can be related to someone we knew in high-school.  As a child of the 80's, I can honestly say that this is a representative cross-section of every high school in North America. The geek, the jock, the outcast, the rich pretty-girl snob, and the future criminal.  They all exist, to some degree or another, in the classrooms of every high school on the continent.<br><br>What makes this film rise above the rest is the character development. Every character in this film is three-dimensional.  They all change, in one way or another, by the end of the film.  Whether or not things remain the way they are long after this film ends is unknown, and that adds to the rama.  The most important scene in this film is when the characters, as a group, all open up to one-another and describe the hell that their daily school routines are in a personal fashion.  Nobody likes the role they must inevitably portray in the high-school scene, but the fact is, it is often inescapable.  This film gives the viewer some insight into how the other people around them might have felt during that particular time in their lives.<br><br>Each of the main characters in this film shines, but Judd Nelson (John Bender) and Emilio Estevez (Andrew Clark) rise above the rest.  Simply put, these two actors each put their heart and soul into their respective characters, and it shows.<br><br>At the end of the film, the viewer is left to make their own conclusions as to how things will carry forth.  And I'm sure that most people will do that. This is one movie that left me feeling both happy and sad for each of the characters, and it isn't easy to make me care about a film in that way. Even if you aren't a fan of the 80's genre, this isn't one you would want to miss.<br><br>My Rating:  10/10","user":"RueMorgue","rank":[344,391]},{"title":"One of the best movies ever","rating":10,"date":"6 May 2003","review":"After reading some of the negative comments made about this movie, i decided to make some of my own.  Yes, to younger viewers,this movie will appear to be outdated. The only thing \"outdated\" is the clothing styles and the music. It doesnt matter what year you went to high school or what school you even went to, there will always be a \"criminal\", a \"jock\", a \"princess\", a \"nerd\", and a \"basket case\". This movie is the best teenage movie, no matter when you are a teenager!","user":"brs5261","rank":[243,283]}]