[{"title":"Stalinist Shakespeare","rating":24,"date":"24 July 2005","review":"If Alexander Nevsky was a filmed opera, this one, the first part of Eisenstein's incomplete trilogy about the title character, looks more like a Stalinist version of a Shakespere play, with a lot of conspiracy and characters so desirous for power that are willing to do whatever it takes, but manichaeist and with almost undisguised propaganda of the infamous Russian dictator. Exactly for being theatrical, it is too formal, but it is so intense that it is impossible to be indifferent, the visual composition is extraordinary, using very well the light-and-shade game typical of the German Expressionism, the alternation between very open shots and close ups, and very rich costumes and set decoration. In the end, although it is not perfect, is a remarkable film that deserves all the praise it received.","user":"flasuss","rank":[13,14]},{"title":"My God, I wasn't expecting it to be THAT good","rating":10,"date":"27 April 2001","review":"Before I new much about him, when I used to see the box for Alexander Nevsky on the Foreign shelf at my local video store, I always misread Eisenstein's name, transforming it into Einstein. Well, Einstein suits him just as well, for what Albert Einstein was to science Sergei Eisenstein is to the cinema. Witness Battleship Potemkin, possibly the most rousing film ever made. Today, nearly 80 years after it was made, it still has the power to inspire revolution. Its amazing montage editing style may have died with silent cinema (although there are at least two directors today who are somewhat similar: Shinya Tsukamoto and Darren Aranofsky), but it will never be forgotten.<br><br>When Eisenstein moved to sound, he realized that rapid montage would not work in the new medium. He adapted his style, perfecting a new one. Alexander Nevsky and the two Ivan the Terrible films come off to many people as stale historical epics. To me, they come off as the very peak of that genre. Usually I do find historical epics stuffy, but the direction, acting, writing, cinematography, and music of these three films are exquisite, so far beyond anything that I've ever seen that these films stir me nearly as much as Potemkin does.<br><br>Ivan the Terrible I is a bit confusing in its plot to begin with, but you have to stick with it. First off, there are many, many characters. A great many are not mentioned by name, and most of the rest are only named on rare occasions. But Eisenstein familiarizes us with the characters' faces. These faces are perfectly chosen and lighted spectacularly. The light is so harsh that every crag in a person's face is clear, and noses cast foreboding shadows. The way time progresses in this film is without much warning, and one problem I encountered was identifying Ivan himself. I did not catch on at first when the first sequence ended and the second sequence began, and Ivan, in the second sequence, has a beard. Once you realize that, though, you're home free. That beard serves as a great identifier throughout the film (and is used in many ways by Eisenstein).<br><br>I was expecting to like this film, but I found myself obsessed with this utter masterpiece. 10/10","user":"zetes","rank":[35,46]},{"title":"The film itself was a work of indisputable genius, its every frame a combination of the architectonic and the purely theatrical...","rating":9,"date":"10 August 2005","review":"Reportedly filmed it Stalin's personal suggestion, Part I glorified the 16th century prince who overcame the power of Russia's feudal lords and the treachery of his own friends and family to forge the Russian nation Although Ivan resorted to cruel and often repugnant means to achieve his goals, the end results, at least in Eisenstein's eyes, made the means acceptable <br><br>Condemned by some critics as unbearably slow and ponderous, Part I of \"Ivan the Terrible\" is regarded by others as a towering work of genius... It is easy to understand why Stalin, one of the most ruthless of leaders, approved the first half of the epic; it is equally easy to see why Part II, completed in 1946, was banned by an irate government<br><br>Far less effective than Part I, it shows Peter becoming increasingly insane, overwhelmed by hate, bitterness, and doubt as to the legitimacy of his mission Eisenstein suffered a heart attack on the day he completed editing the film, and he died in 1948 For a decade thereafter his completed masterwork remained under official proscription; it received its first screening in 1958, five years after Stalin's death","user":"Nazi_Fighter_David","rank":[23,29]}]