[{"title":"Grant and Sheridan Shine in Hawks Comedy","rating":8,"date":"15 February 2009","review":"Although the film shows hundreds of American female military personnel stationed in Germany after World War II, apparently few were interested in the local men. According to Howard Hawks's \"I Was a Male War Bride,\" only the male soldiers wed Europeans, and the military bureaucracy and red tape were stacked against American women marrying European men. With that premise, an American Lieutenant, Ann Sheridan, falls for Frenchman Cary Grant, and the couple resort to extraordinary ploys to both comply with and circumvent the rules to marry and bring Grant to the U.S. as Sheridan's \"bride.\" Although Grant is about as French as Big Ben and looks as feminine in drag as Sylvester Stallone, Cary is Cary and brings charm and charisma to his improbable role of Captain Henri Rochard. Tough and sexy Sheridan is better cast, but the sum of the two stars exceeds either apart. Cary and Ann have chemistry and work well together in a plot that could have easily fallen apart with a less skilled team of actors and director.<br><br>Grant plays the patient and suffering spouse, who must endlessly explain that he is married to an American soldier and entitled to shelter and transportation in a system that does not recognize his gender as compatible with his situation. Throughout, Grant's face and body language speak volumes about the frustration of dealing with bureaucracy and filling in forms in triplicate. Although at times Sheridan seems oblivious to the depth of Grant's problems, her performance is fine, and she convincingly captures the transition from an initial loathing of to an eventual attraction to Rochard. Shot on location in post-war Germany, the black-and-white photography captures the beauty of the countryside and the devastation of the cities with documentary like precision. Hawks keeps the proceedings well paced, and, while rarely laugh-out-loud funny, \"I Was a Male War Bride\" and its megawatt stars provide excellent entertainment.","user":"dglink","rank":[24,26]},{"title":"Pleasant comedy of Cary Grant as an army wife","rating":7,"date":"25 January 2006","review":"I saw this movie years and years ago and always remembered the line, \"Be quiet or people will think we smuggled in a cow.\" I was excited to see it on TCM. Alas, while it's good, it's not as hysterically funny as I thought it was going to be. Cary Grant plays a Frenchman with an English accent who winds up married to an American officer, played by Ann Sheridan. I loved their banter, especially in the beginning. Their wedding night is interrupted when she gets orders to ship out, and the problem becomes how to get her new husband home with her to America when all the spousal regulations seem to be for brides.<br><br>For me, the funniest scene took place while Grant is waiting for the bus with all the brides. Over a loudspeaker, a female officer informs the women about the new styles in the states and the way hair is worn. Grant's face is priceless while she's talking.<br><br>The movie is cute and notable for Grant dressing like a woman and looking very homely. Ann Sheridan is very good. The film is a little slow, but if you love Cary Grant, you should enjoy it.","user":"blanche-2","rank":[30,35]},{"title":"Sometimes It's Hard To Be A Woman","rating":9,"date":"1 October 2008","review":"Howard Hawks proves once again why he is considered to be the director's director. The story is fairly simplistic, but with the help of brilliant actors and ingenious dialogue he turned it into a masterpiece and a classic. And it's a damn funny movie, too.<br><br>I expected an explanation how the limey Grant got to join the French army, until the credits rolled and forced me to realise that he was meant to be genuine, native French. The good thing here is that Grant never in the least tries to act French, which is probably a good idea as it would have proved to be annoying in the long run. He merely wears a képi.<br><br>The chemistry between Ann Sheridan and Cary Grant is amazing, and Ann is so damn sexy. I particularly enjoyed her role as a strong yet sensuous woman, who, in contrast with many other female roles of the time, comes across as plenty fresh and modern.<br><br>The movie is a light-hearted comedy for the first half, and then suddenly turns into an almost Kafkaian nightmare for the rest. Grant really shows us his thespic stuff when he's battling being turned into a woman for bureaucratic reasons.<br><br>I'm giving this only nine points because I want to leave me some room for improvement. But it's a brilliant and very enjoyable movie, which is sadly underrated.","user":"Karl Self","rank":[19,23]}]