[{"title":"Great Cast . . . That's All I Got","rating":4,"date":"19 May 2016","review":"When I saw Harry and Walter Go to New York in 1976, I liked it because it was fun seeing serious actors playing comedy. It had Diane Keaton, who, back in the day, made my gums sweat. I had no idea what was in store for me when I saw it again as a middle-aged adult.<br><br>It was so very awful. Same fine cast to appreciate, but the movie just sat there like a blob of cat puke on the rug that not even the chihuahua will scarf up.<br><br>Yup, that bad. <br><br>And, considering how it went so over-budget it almost sank Columbia Pictures, you would think, you would hope that there would be some evidence the money had been used effectively. You would want your entertainment dollars (three and a half of them, back then) to be for something.<br><br>You would be wrong.<br><br>Aren't we lucky that, for some reason or another, you never see Harry and Walter Go to New York offered on even the Later than Late Show?","user":"inspectors71","rank":[5,5]},{"title":"Guilty Pleasure","rating":7,"date":"25 December 2005","review":"An earlier poster commented that it came and went in the theaters. That's because (at least in America), it was savaged by the critics. But when I saw this on cable a little while after, I actually found it to be very funny, and even taped it for my personal collection. The sequence at the end when Harry and Walter are doing what they can to extend the play so they can steal the money is very funny. When James Caan stops the play and starts singing his lines that, \"he's not the real Prince Herbert, I am!\" I thought was really great. I remember the \"owls who\" line as well, but Caan's singing his lines was what I most enjoyed in that movie. I also liked the scene where Caan and Gould go into the fancy restaurant, order fancy wine, and have no idea what to do when the sommelier tries to serve it to them.","user":"asc85","rank":[10,12]},{"title":"A masterpiece of physical humor","rating":10,"date":"3 July 2002","review":"This ranks near the epitome of the comedic experience; perhaps not an intellectually provocative outing, but this is a masterpiece of physical humor. It is unusual to find a film of this nature sporting the stellar cast which appear here - Caan, Gould, Caine and Keaton enjoy a rare chemistry and display a keen sense of timing. If you haven't seen this yet, make it your next film! (Ok, after you finish Lawrence of Arabia, 2001, and West Side Story - but then, make sure you see it!)","user":"marlatt","rank":[19,27]}]