[{"title":"eerie and memorable","rating":8,"date":"15 April 2003","review":"First, I saw this as a child and recall being absolutely mesmerized and terrified by the creepy music associated with the house. Upon seeing it again some months back, I was immediately brought back to childhood and felt the same strangled dread. Sometimes memories of things from youth don't hold up but in this case, RED HOUSE remains a bizarre and scary movie into adulthood.<br><br>Robinson's performance is very atypical but effective. He was a far more versatile actor than most people realize. As definitive as his fatcat gangster kingpin roles were in LITTLE CAESAR, KEY LARGO and the like, he was equally believable as victims and suckers, as in movies like SCARLET STREET.<br><br>It is surprising that the studio was able to slip some very sexual material by the censors into this movie; Robinson is a deeply troubled and surprisingly sympathetic \"deviant\" here and things are handled with relative frankness. <br><br>This isn't a perfect movie (some motivational problems in particular) and i didn't plan to comment on it, but i strongly disagree with the comments of another reviewer who dismissed Robinson so I wanted to briefly opine with my dissenting opinion. One final note: besides the highly chilling music, this movie features a very haunting ending that will stay with you. This is pretty twisted stuff given the era, and despite some datedness, it's certainly worth a look for those who like their noir Gothic and haunted.","user":"secragt","rank":[80,82]},{"title":"60 Years Later It Still Stands Tall.","rating":9,"date":"21 November 2007","review":"Until last night I hadn't seen this movie since being 9 years old in 1947. At that time it scared the hell out of me --- particular the ice house scene, etched forever in memory -- although THE RED HOUSE is not a horror movie. Looking at it again after 60 years it's still a winner.<br><br>However scary there's almost no violence, but instead it relies on the natural fright of living near a forbidden woods and the haunted RED HOUSE. The evil lies entirely in the mind of the old man (Edward G. Robinson) and the guilt from some long-ago crime. Lon McAlister plays the young man who enters the scene and other youngsters are played by Rory Calhoun and Julie London who later became stars.<br><br>It's easy to understand how the dark, forbidden woods affected me as a young child; but I doubt it would be so well received by today's kids. For one thing, they don't play outside much, let alone exploring in a dark woods or haunted house. Secondly, the woods was most likely torn down. My own woods --- circa 1947 -- had a stream, a swamp, a genuine haunted house, a pig's skeleton, and a road leading to nowhere. Today it's all gone; replaced by Holy Cross Hospital, part of the Washington Beltway, 40 new houses --- paradise swallowed up by progress. Nothing remains for today's kids.<br><br>The Red House is now in DVD. It's good; see it!","user":"vitaleralphlouis","rank":[50,51]},{"title":"Not knowing a secret will haunt you.","rating":7,"date":"7 September 2002","review":"Thrilling Film-Noir written and directed by Delmer Daves. A crippled farmer(Edward G. Robinson)living with his sister(Judith Anderson) and adopted daughter(Allene Roberts)is hard pressed to deal with a young man(Lon McCallister)that comes to help out with chores. The young man is a friend of the daughter, but has romantic feelings for the school \"hottie\" Julie London. Robinson becomes deeper obsessed with keeping everyone away from a mysterious red house hidden in the woods that surround his property. Not only is London very young at this time in her career, but so is Rory Calhoun who hunts the woods and discourages trespassers. This is a passionate and atmospheric mystery that is supported by the haunting music of Miklos Rozsa. I especially enjoyed the scene of McCallister trying to go through the woods in the hard driving rain storm with the creepy music background. If you get the chance to see this on TCM, AMC or PBS...don't pass it up.","user":"michaelRokeefe","rank":[48,49]}]