[{"title":"manages to be both sensational and down-to-earth","rating":7,"date":"19 October 2007","review":"obviously \"biker gang\" and \"hippie commune\" are terms of pure fantasy ... the fantasy of enjoyment that the workaday world had about '60s subculture. so this film is mildly interesting in that it manages to represent both with (what I imagine to be) some degree of accuracy. bikers, with the promise of extra enjoyment, act as enforcers for peace-loving back-to-the-landers against hostile hick \"townies\" who harass them at every opportunity. it is a bucketful of cliché and ends in a big dune-buggy hack-em-wack-em fireball, but there's some meaningful representation of (what I imagine to be) the cultural conflicts of the era.","user":"sweetmarias","rank":[6,6]},{"title":"Not too bad biker flick","rating":5,"date":"4 November 2001","review":"Angel Unchained tells the story of Angel, the loner who leaves his club for the hippy commune. Local townies (actually cowboys in dune buggies) are out to drive the long hairs away, so Angel asks his biker buddies for protection. It's The Seven Samurai on choppers, but these warriors aren't in it for honour, money, or prestige...they only want the potent 'wammo' that the hippie's medicine man puts into chocolate chip cookies(presumably it's Peyote, but the script takes care not to be too descriptive). Acting honours go to Don Stroud as Angel, there's a young Tyne Daly on hand to 'do her thing', Luke Askew is good as commune leader Tremaine, and Aldo Ray has about five minutes of screen time--most of it reclining in a chair--as the local sheriff. Plenty of action, and a lot less profanity and nudity than you would expect from one of these AIP quickies.","user":"JohnSeal","rank":[3,3]},{"title":"Dune buggied rednecks","rating":5,"date":"4 March 2012","review":"Jack said the rednecks are on \"Go-Carts\". I own the movie and watch it every few years or so. They are driving dune buggies. A far cry from go carts. I think the movie is great! Very unrealistic which helps make it great. I collect cheap biker movies and this well qualifies. Unrealistic is letting a fellow club member leave so he can get his head together. You gotta have a better reason for leaving any outlaw club. Usually it's prison or death. Just taking off don't cut it. Having a tripping Indian with trippy cookies is a first. Usually outlaws will do some things for cash. These \"Bros\" go for \"cookies\"! God bless 'em! Next they will be killing for apple pie. Yes, you could find better things to do with your time than watching this. Usually crushing your fingers in a vise or sticking your face in a fan is more entertaining. If you love cheap biker movies (and vintage dune buggies) you will LOVE this pile.","user":"internationaldave","rank":[5,6]}]