[{"title":"Caravan to Nowhere.","rating":2,"date":"29 April 2002","review":"Of all the adaptations of books by Alistair MacLean, I feel that this qualifies as the worst, but don´t blame MacLean!. It would appear that all that this film shares with the novel is the same title. We have no suspense, no sense of foreboding of mystery, no chance to really empathize with the main characters. We spend the entire duration (or at least I did) waiting for Charlotte Rampling to shed her clothing (for Charlotte, this appears to take a remarkably long time!). Still, a glimpse of Charlotte Rampling´s tits really can´t save this disastrous film. MacLean has once again been kicked into the gutter to endure the sniping of those bitter hacks and nit-pickers who would appear to blame him for all the ills that befall attempted filming of his books. Poor old Alistair must have crawled into a corner and whimpered when this one came out. At least \"Bear Island\" - which also uses the Maclean name but apparently none of his novel - was a LITTLE exciting. The excitement here is in waiting for the final credits.","user":"doire","rank":[14,19]},{"title":"Utterly terrible adaptation of an Alistair MacLean novel.","rating":2,"date":"19 July 2006","review":"A lot of Alistair MacLean's books have made it onto the big screen. Some of them (The Guns Of Navarone, Fear Is The Key, Where Eagles Dare) have been translated rather well; some (Breakheart Pass, Ice Station Zebra, The Secret Ways) have been passable enough; a few (River Of Death, Bear Island, The Way To Dusty Death) have been pretty rotten. Caravan To Vaccares is another movie based on one of MacLean's perennially popular bestsellers, but alas this is yet another that deserves adding to the \"rotten\" list. Peopled by uninteresting characters who get into uninteresting situations and escapades, Caravan To Vaccares is an absolute failure, both as a thriller and an entertainment. Its only semi-redeeming qualities are: a) that it is filmed on very attractive Provence locations, and: b) Charlotte Rampling looks utterly ravishing (with fully nude scenes to boot) as the main female character.<br><br>Disillusioned American drifter Neil Bowman (David Birney) is travelling aimlessly through France when he meets British photographer Lila (Charlotte Rampling). They decide to accompany each other, and during their wanderings make the acquaintance of mysterious nobleman Duc De Croyter (Michel Lonsdale). The Duc persuades the pair to aid him in protecting and escorting Hungarian scientist Zuger (Michael Bryant), who is sought by various shady parties because of some information that he is carrying in his head. Kept secret from Bowman and Lila is the fact that Zuger has discovered a secret formula for using solar power as cheap, economical energy. The Hungarian needs desperately to get his formula to New York, but hired guns have been put on his trail to capture him  presumably so that he can be taken back to some ruthless criminal lord and tortured into revealing his priceless secret, which they can then sell on to the highest bidder. Bowman and Lila find themselves and their terrified fugitive on the run in the French countryside from their deadly adversaries.<br><br>The film seems terribly cheap and amateurish, almost like an ultra low-budget independent film made by a non-professional cast and crew. Yet a fair sum of money was actually thrown at the film, and all those involved have, at various points in their careers, done much better work. Therefore, one has to assume that the film is bad simply because it has been written, acted and directed with a distinct lack of care and interest. The pacing is deadly slow, and the plot points become so laborious that the viewer has to put in too much unrewarded effort to keep up with the story. Birney's performance is uninvolving, and Rampling only creates a stir due to her nude scenes  the character itself is an absolute bore, and the actress looks rightly bored by it. For those who manage to stick with the film right to the very end, there is an unusual scene featuring some deadly rodeo clowns and a fierce bull (!) which, while not particularly exciting or well executed, is at least different to the norm. Caravan To Vaccares is a very disappointing film in most respects, and once more a strong novel by the prolific author has suffered during its transition onto the screen.","user":"barnabyrudge","rank":[7,9]},{"title":"A few recommendable moments but overall, pass the Nyquil","rating":13,"date":"13 February 2002","review":"Charlotte Rampling must have been so bored with her character in this production that she went full tilt the next year after this picture was released into one of cinema's most confusing epics, 1975's \"Zardoz,\" just for the challenge.  Well, at least she got a good tan on location in this movie, and photographs here better than in any other film she has starred in.  Alas, poor Charlotte appears to be so much smarter than the material she is given in this hamhanded cat-and-mouse yarn, shot entirely in the quaint environs of Provence, France.  She smiles alot, and behind that grin she seems to be saying \"Please call it a wrap so I can drive over to Marseilles for a wild night on the town.\"<br><br>Dullness doesn't translate to ineptitude however.  The production values for this co-British/French effort are as high as those found on the other Alistair MacLean knock-offs of the '70s, like \"Puppet on a Chain,\" \"When Eight Bells Toll,\" and \"Fear Is The Key.\"  Like Barry Newman in \"Fear Is The Key,\" actor David Birney gets to show his limited emotional range as the stalwart MacLean hero thrown into the middle of a deadly game of international policies and kidnapping.  As a wandering American playboy, disenchanted with the Vietnam War and America, he stumbles into the schemes of the Duc, played with continental charm by the wonderfully droll Michael Lonsdale.  Birney is coerced into protecting a Hungarian scientist who holds the secret formula to converting solar energy into economical power in his head.  Shadowy hitmen, presumably hired by someone who wants that formula, follow their every move.  Birney is occasionally forced to wipe his lackluster smirk from his face and perform some chop-socky moves on the villains.<br><br>Unlike the wartime MacLean novels like \"Ice Station Zebra,\" \"The Guns of Navarone,\" and \"Where Eagles Dare,\" \"Caravan To Vaccares\" falls into the same trap as the majority of Alastair's later books displayed, that of simple chases, one curveball \"twist,\" and a strong-chin, 2-dimensional hero always able to easily thwart the antagonists.  The interesting tidbits to this picture come with the villains.  Uncharacteristically (at least these days), this film's villains speak French, and yet their dialogue is not subtitled into English.  Of course, you have no idea what they're saying if you don't parlez-vous, but in an interesting directorial choice, that's okay.  Their actions and intensity translate their motives, and it's that decision to allow their every words to go unsubtitled that I applaud this element of the production.  The producers knew their audience was intelligent enough to figure out what would be occurring on screen without spooning out translated dialogue.  Thank you!<br><br>As for the principals, well, as mentioned, David Birney isn't the most convincing of badasses around.  He exuded more testosterone when he got into a tiff with Meredith Baxter on \"Bridget Loves Bernie.\"  Charlotte Rampling is given very little to do but play the sexy, compliant companion who lets Birney make all the decisions.  Her looks, however, betray this simplitude. She has the presence to suggest she could easily outmaneuver Birney on a speed-chess match.  Which leaves us with Michael Lonsdale.  Here, he exudes more confidence than his put-upon inspector in \"The Day of the Jackal.\"  He has a comfortable, wise delivery, a sly way of sizing up his minions and adversaries, that is a pleasure to watch.  It is a shame Bond producers did not use him to the fullest extent when they cast him as super villain Hugo Drax in \"Moonraker.\"<br><br>The plot neatly ties up most of its loose ends by the last reel, and you're rendered the satisfaction that David Birney didn't go on to reprise his role in any sequels.  However, any movie that climaxes with him being attacked by rodeo clowns isn't all that bad.  My rating: ** out of ****.","user":"Guy Grand","rank":[9,13]}]