[{"title":"Grim And Wonderful","rating":9,"date":"20 November 2007","review":"Cold, desolate in the surface and an uncomfortable warmth in the inside. Meryl Streep leads in a way that is difficult to explain. She provides a truly magic movie moment when she sings \"He's My Pal\" for her supper. For a moment we live her fantasy. Her moment is our moment, that's why as the song and the fantasy ends something inside me cracked. I felt tears running down my face and, I swear, I wasn't ready for that. The humanity of Meryl Streep, the actress, filters through the devastating circumstances of her character. Circumstances that, by the time we meet her, are already a way of life. At the beginning of the film, when somebody asks her how is she, her reply is \"Delightful\". Trying to adjust to this character I listen to her stained, tired voice, trying to be heard and I did, heard her. I love Meryl Streep.","user":"uhmartinez-phd","rank":[65,74]},{"title":"They're my pals.","rating":9,"date":"21 June 2002","review":"Never the timing for a movie had been so disastrous.Released in those \"glorious \" eighties when the success stories and the triumphalist heroes were the golden rule,\"Ironweed\" stood no chance at all.Two tramps did not fit well in the movie landscape of those \"feel good\" times.And two tramps played by two megastars ,it was unforgivable!<br><br>The cast is stellar,but it's Meryl Streep whom I will remember FOREVER.When she sings her little tune \"he's me pal\" she's so heart-wrenching that she will move you to tears.\"At least ,I didn't betray anybody\" she said.Although it was a colossal flop,Streep would only approach such an emotion afterwards.(notably in \"the bridges of Madison County\")Nicholson was equally courageous to play such a demeaning part,and he gets strong support from Carroll Baker who proves here she can age gracefully and from Tom Waits ,ideally cast as a barfly.<br><br>\"Ironweed\" is very hard to see nowadays.One of these days ,it will be given the place it deserves.","user":"dbdumonteil","rank":[54,65]},{"title":"Being Down and Out in America Illustrates What America is Really All About","rating":9,"date":"8 October 2006","review":"\"Ironweed\" is a good movie and a scathing indictment of life in modern America. Jack Nicholson and Meryl Streep effectively portray a pair of homeless bums on the cold late October streets of Albany, New York during the Great Depression. Their day to day existence revolves around simple survival in the most difficult of circumstances -- how to keep from going hungry, where to score a few hours work or a few drinks, and where to \"flop\" come nightfall in order to avoid being beaten and robbed or freezing to death. You don't have to be a bum to understand this list of priorities, although certainly, spending any time without a conventional home will clue you in like nothing else can. There are, you see, several levels of homelessness, street people of various kinds occupying the lowest tier. A level above that are the people who live in their cars, camping at the curb or crashing with friends, some of them duly employed while others are \"between jobs.\" Then there are those who spend months or even years living in recreational vehicles of one sort or another and migrating with the seasons. These are the elite of the homeless crowd, ranging from truly adventurous souls who occasionally go without enough food to those with substantial bank accounts and second homes. Nonetheless, most if not all of them understand something about being kicked around and shown the door, just like the bums in this flick. Certainly, they all understand what its like on occasion not to know where you will end up spending the night, why authority figures are to be avoided, and why conventional people are nearly always the enemy, whether they know it or not.<br><br>\"Ironweed\" puts a human face on the kinds of people society scorns the most -- street people, who live in filth and seldom wash, who often abuse alcohol or drugs yet haven't enough to eat and may dig through garbage searching for an abandoned morsel. They often live this way for a reason and not only because they have no choice. Frank has a choice but he is convinced that to go home \"won't work out.\" He's a luckier bum than his fellows, who seem to have no choice at all. Oddly, it's pride just as much as eccentricity, incipient insanity, or alcoholism that keeps them where they are. Helen was a successful singer before her life went on the skids. Too much wine, a slump in her career, and being robbed of her inheritance seemed to signal her inevitable slide into oblivion. Now she barks at passersby and sleeps with whomever will tolerate her presence -- at a price, of course. Sandra is a drunk, an ex-whore, and in terrible shape when the others discover her passed out against a lamppost in freezing weather. They get her a blanket and some hot soup and prop her against a wall, but obviously, she is not long for this world. Rudy's a good sport, a bum's true friend, and he just scored a new gray suit, but he's been given six months to live and soon enough his new threads are grimy and tattered, just like the old ones. And so goes it. Only the strongest survive. All the while the comfortable bourgeoisie look upon the suffering of these brave souls with contempt, disgust, and often, unbridled hostility, hoping to avoid them and occasionally making them pay dearly for the inconvenience. Although the bums seem to scurry at the margins of society like rats on the prowl for scraps, they are, in a way, truly living. For however unenviable their precarious lot may be, they are on the edge, so unlike the predictable, dull, and hypocritical existence of the conventional folk around them. At times, one either knows or suspects that the bums are being romanticized or their foibles somewhat exaggerated, but nonetheless, the story comes off as reasonably authentic. And the acting in it is superb. One criticism, however -- the soft focus effect throughout. I take it the director was attempting to blur further the distinction between fantasy and reality, posing as it did a continuing problem for the main characters, who often dreamed of some simple connection to dignity, comfort, and security while in the throes of their unrelenting misery. Nonetheless, I would have preferred a sharp focus. Otherwise, I found this flick to be very inspired.","user":"writerasfilmcritic","rank":[22,25]}]