[{"title":"It's a Jelly...","rating":10,"date":"15 June 2002","review":"\"How's it goin', eh\". Those of us blessed to live within the TV reception area of the Canadian Broadcasting Company (CBC) had been privy to Bob &amp; Doug on SCTV long before this movie was released. The running gag on SCTV was that Bob &amp; Doug wandered into the studio one day, the star of a live talkshow was absent and the station manager threw the brothers on stage to fill the dead air. They were a hit and soon were given their own show-within-a-show called \"The Great White North\". In short order they demanded star treatment as they understood it and soon the stage was surrounded by cases of beer, boxes of donuts and the guys had a campstove to cook Canadian bacon on. Classic. Each show they would have their 'topic of the day' and discuss important issues like 'snow routes', bottled beer verus canned and other things Canadian. You just can't help but love these innocent buffoons. This was the basis of Strangebrew. As silly comedies go, this one is a benchmark. No swearing, hilariously cheesy effects and bathroom humor that is actually funny and not disgusting (see American Pie if you want disgusting). What amazes me is that EVERY single scene with Bob &amp; Doug is funny. Some scenes are truly classic. The dialogue and nuance of this film is so easy to imitate you'll find yourself doing it with friends who have also shared this gem of a film and laughing yourself silly. (\"Did you see the way she was looking at me...\") See this film, you'll thank me, eh.","user":"Thor777","rank":[41,47]},{"title":"For all you hosers, this movie is awesome, eh?","rating":29,"date":"29 January 2004","review":"If you love stupid comedy this movie is DEFINITELY for you!  Animal House, Super Troopers, &amp; The Blues Brothers.  If you liked these movies you'll love Strange Brew.  It's classic!  A MUST SEE!!!  Rick Moranis and Dave Thomas make an awesome team of crazy Canadian brothers, or should I say \"hosers\", eh?  The plotline is kinda sketchy, but then again, the movie isn't exactly made for a great plotline.  It's made for the comedy.  Made in 1983 and it still kicks some royal butt!  So sit back and enjoy as the two \"hosers\" bumble their way to some crazy times!","user":"tvgm21","rank":[18,21]},{"title":"One of the best comedies out there!","rating":30,"date":"30 September 2004","review":"I love this movie so much, I even have a poster of it hanging on my door, eh! I first viewed it in my eighth grade geometry class (where we never did anything but watch movies--this class also introduced me to classics such as \"Back to the Future\" and \"Little Shop of Horrors\"). <br><br>This is from the peak of the so-stupid-it's-funny era of comedy (which is starting to become popular again, only this time around it's just not funny), and it may very well be the best of them all, even better than \"Airplane!\". It's one of those beautiful comedies where all the jokes are incredibly stupid and incredibly smart at the same time. The courtroom scene and the \"death\" scene rate as two of the funniest moments in comedy history, in my opinion.<br><br>Rick Moranis and Dave Thomas have perfect chemistry together, too. The stupid bickering between Bob and Doug is hilarious (I love it when they have to go in separate directions for the first time in their life). If you haven't seen this, I cannot recommend it enough. <br><br>9/10 stars. Now take off, eh!","user":"Chromium_5","rank":[29,36]}]