[{"title":"L 'Argent synthesised social realism and elaborate mise-en-scene","rating":10,"date":"13 October 2008","review":"Near the end of the silent cinema period, at opposite ends of Europe, two films were being planned on the subject of money or capital: Sergei M. Eisenstein's project for a film based on Karl Marx's Capital, and Marcel L'Herbier's film adaptation of Emile Zola's L'Argent. Eisenstein's project, unfortunately, never got beyond the preliminary stage of diary notes, recorded discussions with G.V. Alexandrov, and the rough outline of a scenario. L'Herbier's project, of course, was completed and released as L'Argent, in the midst of controversy, critical condemnation as well as acclaim, and uncertain commercial success, at least in France.<br><br>Undoubtedly influenced by Abel Gance's experiments with camera mobility, L'Herbier turned this very free, modern-day version of Zola's celebrated novel into a series of pretexts for outbursts of striking cinematic excess, creating a strikingly modern work marked by its opulent, over-sized sets and a complex, multi-camera shooting style. The result is a film resolutely split between narrative and spectacle, between straightforward storytelling scenes typically dominated by shot-reverse shot cutting and chaotic, exciting impressionist sequences, as when, at the Paris stock market (shot on location) a camera hanging from a pulley apparatus high above the trading floor sweeps down on the traders. The effect, presumable, means to evoke the irrational frenzy of capitalist from a decidedly right-wing perspective.<br><br>If Gance's Napoleon and Carl Th. Dreyer's La Passion de Jeanne d'Arc constitute the apex of big-budget historical reconstruction films in the French silent cinema, then L'Argent certainly can be taken as the culmination of the modern studio spectacular. With a five-million franc budget, L'Herbier was given privileged access to the Paris Bourse for three days of shooting (with 1,500 actors and over a dozen cameramen) and was permitted to electrify the Place de l'Opera in order to shoot a night scene of the huge crowd awaiting news of Hamelin's solo transatlantic flight. At the newly opened Studios Francoeur, Lazare Meerson and Andre Barsacq constructed immense set decors, including an enormous bank interior, several large offices and vast apartments, a dance stage for Saccard's celebration party, and an unusual circular room next to Gundermann's office whose entire wall length was covered with a giant world map.<br><br>Many of these studio spaces have smooth, polished surfaces and are stylized to the point of exhibiting little more than walls, ceilings, and floors. This stark simplicity, especially in such monumental designs, undermines any appeal to verisimilitude and tends to dissolve the boundaries differentiating one space from another. The indeterminacy of these decors, although exemplary of the modern studio spectacular, thus specifically functions to further abstract the film's capitalist intrigue. Together withe crowds of extras that often traverse the frame and chief cameraman Jules Kruger's selection of slightly wide-angle lenses and high- and low camera positions, especially for the frequent long shots or extreme long shots they produce a consistently deep-space mise-en-scene and larger than life capitalists. Furthermore, the highly stylized or generalized milieu of the film actually serves to foreground the nationalistic and class-based terms of the intrigue, articulated through the casting, and allows them to read all that more clearly.<br><br>The Modernizing strategy that shapes L'Argent's set decors and deep-space mise-en-scene was also governed, finally, by a loosely systematic discursive which many French filmmakers shared in the late 1920s. Generally, the French tended to privilege the specifically 'cinematic' elements of framing and editing - close ups (especially of objects), unusually high and low camera position, extensive camera movement, superimposition's and dissolves, various forms of rhythmic montage, associative editing. But L'Herbier's L'Argent offers another, perhaps even more interesting model for the way its reflexive style ultimately helps to articulate the film's critique of capital.<br><br>At least two particular features of this film practice loom large in L'Argent. The first feature as an absolutely unprecedented mobile camera strategy, whose high visibility and extreme dynamism render its effect peculiarly ambiguous. The range and extent of the film's camera movement is unmatched except perhaps by that in Gance's Napoleon (for which Kruger was also chief cameraman). Largely because of such unusual camera movements, in L'Argents space oscillates uncannily between the fixed and the fluid. A second feature of the film's discursive practice is its rather unconventional editing patterns, which sometimes work in tandem with camera movement. There is the uniquely persistent pattern of cutting a stable shot as a sudden camera movement becomes perceptible, which creates a slightly jarring effect in the film's rhythm that ruptures its sense of spatio-temporal continuity and foregrounds the very construction of filmic space-time.<br><br>The reflexivity of this discursive practice marks L'Argent as a Modernist text, of course, at least to the extent that the materials of the film medium and their deployment as a disruptice system become an ancillary subject of the film. L'Argents framing and editing techniques, in conjunction with set design and acting style or casting, more closely resemble those of Jean Renoir's Nana or Dreyer's La Passion de Jeanne d'Arc, both of which serve to subvert the conventions of another genre, the historical reconstruction. Yet reflexivity here bears a subversive significance that exceeds the genre of the modern studio spectacular precisely because of L'Argent is a story of capital.<br><br>L'Argent's achievement, in the end, rests on the correlation it makes between discourse, narrative, and the subject of capital. Capital is both everywhere and nowhere, echoing Marx; it motivates nearly every character in the film and is talked about incessantly, but it is never seen or - as the dung on which life thrives - even scented. <br><br>Nevertheless, L'Argent is a beacon of modernity, an over-sized hymn to music of light, where everything is rhythm, movement, and a fantastic spiral of financial manipulations. Even today, the subject is astonishingly relevant.","user":"Ziggy5446","rank":[25,29]},{"title":"The camera as the calligrapher's brush","rating":23,"date":"23 September 2011","review":"It does not matter that this is adapted from Zola, and generally received then and now as a prestigious release that should be accorded a place in history. It matters because it's one of the most striking films in the transition towards a cinema that does not merely chronicle life, whose primary means of expression is no longer drama and does not aspire to emotion, but instead sculpts from space and uses the camera as a calligrapher would a brush.<br><br>There is a match-cut from the engine of a plane to a madly spinning camera looking down from a ceiling that is perhaps the most impressive in the entire 30 years of cinema until then. And there is a lot of the camera choreographed to dance, or painting with our gaze incomplete motions across rooms.<br><br>Resnais would take all this thirty years later to revitalize French cinema.<br><br>Story-wise, it is about two puppet-masters vying for the control of the same world. The film begins on the level of the stage, the stockmarket, this new temple of the modern world devoted to capital, and pulls back to reveal who holds the strings, who re-invents the broadcasted reality.<br><br>Like Zen calligraphy, this is not about the painted signs on the scroll and what they mean, but the disciplined soul revealed by the flow of ink. Watch it like you would unfold a scroll, the ink is in the image.","user":"chaos-rampant","rank":[7,7]},{"title":"The weight of money.","rating":9,"date":"20 April 2006","review":"My comments are on a mere 166 minute version: I think the cuts were probably towards the end as the final section was hurried in the version I saw. More than anything the film is dominated by crowds and the massive buildings- the Bourse and the Banque Universel's offices- where Saccard operates and Saccard's own enormous and fantastic house, a scene to show spectacles, not a home. Often one of the main characters is present in a crowd scene and it takes some time before we notice them emerging from the throng. Other shots look down at crowds in the Bourse scurrying as randomly and purposefully as ants. Saccard himself is described as a \"peasant\" and his enormous, solid belly, often shot from a low angle (had Welles seen this film when he made Citizen Kane or Touch of Evil?) dominates the film.<br><br>There are several people with different attitudes to money- Saccard, with a peasant's desire for increase and actual physical pleasure in its possession, the aviator/explorer Hamelin, who sees it as a tool for his projects, Saccard's ex-mistress, Baroness Sandorf, for whom it is something to gamble with and buy excitement and Saccard's nemesis, Gunderman, who is a curious character- does he represent and see money as a tool for stability or is he as atavistically greedy as Saccard himself under an upper-class cover? When he destroys Saccard is it because of the danger of Saccard's methods and his disruptive effect- as he tells Saccard- or for his own profit or both? At the end, Gunderman is triumphant- if he thinks in terms of triumph- Hamelin, blinded, is in the domestic care of his wife, no longer able to fly, Saccard companies are controlled by Gunderman, Saccard himself is gaoled, yet we know nothing of Gunderson's motives or driving forces, beyond a desire to play with his dogs and a desire for financial stability. Perhaps it is because Gunderman is played by Alfred Abel, Metropolis's master of the city, that our view of the character is distorted now. Meanwhile, though he may be gaoled, Saccard asks a warder \"Do you want to be rich?\" and the man enters his cell. <br><br>A surprisingly modern aspect is Hamelin's flight to Guiana- a publicity stunt which is made to directly affect the shares in Saccard's companies- Saccard has arranged that reports of Hamelin's disappearance will be released, enabling him to buy back more shares. The image of the company- the intangibles in modern terms- reflected in Hamelin's feat, is what is bought along with its shares, not any real value they may have. The other astonishing thing- like other silent films at the end of the silent era- is the camera work: I mentioned some of the other shots above, but there are countless others- cameras rushing through and around the scurrying crowds, an extraordinary party at Saccard's house to celebrate Hamelin's success that Saccard will use to try to seduce Hamelin's wife, where the cameras swoop over entertainers and guests in giddying virtuosity; the sheer enjoyment of what could be done with a camera and its part in narrative and commentary on what it shows comes over seventy years later.","user":"allenrogerj","rank":[13,16]}]