[{"title":"Second time's a charm","rating":9,"date":"30 July 1999","review":"The first time I saw this film, I was suitably impressed but found I couldn't enjoy it completely.  In order to keep up with the relentless pace of the plot, I didn't pay as much attention to the writing and the performances as I should have.  When it was over, I felt the breakneck pace of the story overshadowed the screenplay and acting, rendering the film an accomplished reprisal of fact but not much else.<br><br>What a difference a second viewing made.  My familiarity with the plot allowed me to appreciate all the finer details of the film.   Watching Redford and Hoffman's disciplined performances as Woodward and Bernstein, for instance, is like watching two expert tennis players work in tandem with one another.  When they act together, there is a delightful give-and-take, two masters working their way into a wonderful groove.  While they appear steady and reserved on the surface, the two actors radiate a noticeable undercurrent of excitement and dread, as if underneath their stern countenances they're screaming, \"Holy sh*t!  I can't believe we're doing this!!\"  Redford, not the strongest dramatic actor, finds his normal-guy niche here and gives one of his best performances.  Hoffman is equally strong, making even the simplest scene seem like a masterpiece (the \"count to 10\" phone scene comes to mind).<br><br>Throughout the film, Pakula communicates the idea of these two reporters being completely outnumbered by the people responsible for the Watergate break-in.  I loved the numerous overhead shots of Woodward and Bernstein that pull up, up, up, until they're nothing more than specks in the dirty streets of DC.  (This technique is also used in the classic scene where the two guys are searching through old records and the camera pulls up to the ceiling and shows them seated along the edge of a circular series of desks.)<br><br>The film rockets right along, leaving the viewers as excited over the reporters' discoveries as they are.  William Goldman's script helps in this regard, I think, sticking straight to the meat and cutting out any unnecessary roughage.  The dialogue gets right down to business while working in realistic vocal habits and the like.  Redford really captures this well (listen to his stammering and self-corrections when he talks on the phone to sources - great stuff!).<br><br>I can't recommend \"All the President's Men\" enough.  It's tightly-structured, fiercely-paced, and captivating as all get-out.  If necessary, watch it twice: once to find out who's who, the second time to savour the handiwork.  If you want to talk more about it, leave a red flag on the potted plant on your balcony.","user":"David N.","rank":[93,100]},{"title":"A Powerful Reminder","rating":10,"date":"22 June 2017","review":"We're in June 2017 and \"All The Presiden's Men\" from 1976 reminds us that film, sometimes, is the strongest historical document we've got. The Washington Post raising alarm signs then and now. Alan J Pakula is one of the greatest directors of his generation. Jane Fonda during her AFI Lifetime Achievement Award told us that working with Alan J Pakula was like dancing with Fred Astaire. Here the chemistry between Robert Redford and Dustin Hoffman is such that, at times, it feels like a romantic comedy, warts and all. Astonishing. Hal Holbrook as Deep Throat gives the feeling of \"thriller\" to this incredible story. We know how the story ends but that doesn't diminish our nervousness that it's perhaps a bit of impatience, just like now in 2017, to see justice be done.","user":"duffjerroldorg","rank":[76,84]},{"title":"Required viewing.","rating":10,"date":"25 March 2004","review":"If you were to imagine yourself as a newspaper journalist, one of the best conspiracies you could ever find yourself stumbling upon would undoubtedly be the infamous Watergate Scandal. And reporters Bob Woodward (Robert Redford) and Carl Bernstein (Dustin Hoffman) were the two men who found themselves head-above-water in an elaborate cover-up that went all the way up the chain of command to the United States President himself.<br><br>On June 17th, 1972, Watergate hotel security guard Frank Wills spotted a possible break-in at the Democratic Party's National Committee. Some apparent CIA agents were arrested for breaking and entering, and later held at a trial, where Bob Woodward first found out that they were more than mere intruders. They worked for the government.<br><br>After researching into the matter, Woodward soon realized that one of the intruders had the name of a political figure scrawled in a notebook located within his shirt pocket. <br><br>And with the help of Carl Bernstein, a fellow Washington Post reporter (and a veteran of the field), Woodward followed the slight tracks, and the two men soon found themselves unearthing a shattering conspiracy that did indeed lead all the way up to President Richard Nixon, the 37th President of the United States of America, himself.<br><br>Based on Woodward and Bernstein's own memoirs, William Goldman's Oscar-winning script makes for a brilliant subtle mystery; a true-life story as amazingly honest and forthright as it is entertaining and engaging. It would always remain the late Alan J. Pakula's greatest film, and its standing as one of the top films of all time on many various \"great movies lists\" is certainly merited. <br><br>It's a shame that both Hoffman and Redford were snubbed by the Academy Awards for their performances here. As Woodward and Bernstein, the two are amazingly convincing and bounce dialogue off of each other with striking clarity and realistic quality. Hoffman, who is top billed, appears in the film less than Redford, but gives just a performance just as amazing. He would gain an Oscar twelve years later for his portrayal of Raymond Babbitt in \"Rain Man,\" his finest performance to date, but his role in \"All the President's Men\" is of a different caliber. Woodward and Bernstein are two complete opposites, and at first they rub each other the wrong way -- Bernstein, a veteran reporter, takes one of Woodward's articles and starts making revisions. \"I don't mind what you did,\" Woodward says, \"I just mind how you did it.\" Even though it's not anything special, this if my favorite scene in the movie, and perhaps the best example of just how well these two actors are able to bring their characters to life.<br><br>The movie is a mystery but not in the traditional sense. Almost all of us watching the film already know how the story is going to turn out, but the way it makes its dynamic revelations seem surprising and its story tense and exciting is one of the greatest examples of compelling filmmaking.<br><br>\nFor the film's opening sequence, in which Woodward and Bernstein's condemning news is written on a typewriter, Pakula used sounds of gunshots to clarify each separate key of the device striking downwards. The 37th President of the United States of America was sentenced to a sort of death with the publishing of that article, and the bold gunshots add an extra depth and meaning to this fact.<br><br>\"All the President's Men\" has no hidden morals, messages, meanings. It's just a true story about something that happened, brought to life on the big screen by a great director, an influential screenwriter and two of the best actors of all time. No, it's not going to have you thinking after it's over, but if anything, it's the type of movie that will generate a lot of talk instead. And more often than not, that's a good thing.<br><br>5/5 stars.<br><br><ul><li>John Ulmer</li></ul>","user":"MovieAddict2016","rank":[103,124]}]