[{"title":"A rather remarkable film","rating":8,"date":"28 April 2012","review":"This is really a rather remarkable film.<br><br>In one sense, it is the typical boulevard comedy of the late nineteenth and early twentieth centuries: the story of a man who seduces another man's wife away from him and then finds a way of getting him out of the picture. That goes back at least to Molière, and probably before. Granted, the three actors involved, Guitry as the seducer, Raimu as the husband, and Pauline Delubac as the ravishingly beautiful and beautifully clever wife, play these stereotypical roles as well as they have ever been played. And Guitry's dialogue has some magnificent lines. But the situation is not new or remarkable.<br><br>What is remarkable, however, is the delivery of the dialogue, especially by Guitry. Raimu takes his lines with the pace of a southerner, exaggerated and funny. Delubac delivers hers with astounding wit and charm. But Guitry delivers his, which after all he wrote for himself and performed nightly in the theater before making the movie, at an astounding speed. Astounding, because he also delivers them with the utmost clarity. They go flying by at a speed that would put Katherine Hepburn in \"Bringing up baby\" to shame, and yet you don't miss one of them. It is, among other things, a remarkable lesson in theatrical diction.<br><br>There are plenty of great lines to keep you laughing. But don't overlook the fact that you catch them all even when they are delivered at a sometimes astounding speed.","user":"richard-1787","rank":[13,13]},{"title":"Perchance To Dream","rating":8,"date":"8 April 2007","review":"In terms of films as opposed to plays the 1930s were Guitry's most fruitful decade yielding an even dozen titles; the 1950s threatened to eclipse that but he died in 1957 having completed eleven films whilst in between there were another nine in the 1940s and one Silent in 1915.<br><br>For a playwright and a verbose one at that Guitry knew how to make the camera move fluidly as in this case when it pans rather than cuts around a salon swooping on groups of two or three before moving on. Nor has he lost his knack of arresting openings witness the Gypsy sextet who open proceedings with a short medley before the Opening Credits, one of them playing what appears to be a form of zither. As he often did Guitry casts his wife of the time, Jacqueline Delubac, as his leading lady, marries her off to Raimu,casts himself as the lover and lest we forget he is a man of words as well as images he proceeds to divide the film into duologues perming any two from three and even throws in a tour de force monologue for himself, For talent spotters in the salles he supplies cameos for Arletty, Michel Simon and Claude Dauphin and the finished product is everything you expect from this Renaissance man.","user":"writers_reign","rank":[8,9]},{"title":"An Oscar Wilde Bedroom Farce","rating":8,"date":"17 May 2018","review":"I'm still shocked at how few reviews there are of Sacha Guitry's films here on IMDB, so feel duty bound to add another, even if I don't have much in the way of fresh information to contribute. <br><br>This one is really little more than a bedroom farce - very stagey and confined almost entirely to a single set, but the dialogue is so quick and witty and energetic, and the chemistry between Guitry and his ravishing real life lover Jacqueline Delubac so good, that never feels a limitation. Needless cutaways to fjords and train stations and alien landing sites would be a distraction, in fact, from what is best about it, and only slow the movie down.<br><br>As another reviewer here noted, Michel Simon appears (uncredited) very briefly in the opening scene - I was surprised at this as I was convinced Guitry had never worked with him before 1951's La Poison - he even says so (at some length) in the film itself(!)<br><br>Once again the English subtitles on every version I could find were poor, sometimes obscuring a joke or making no sense at all, so I ended up creating my own subtitle file for it by comparing the original French and using some common sense. The title, too, \"Let's Make A Dream\" is better as a simple straight translation than some of the other attempts.<br><br>Anyhow and regardless, this was a delight: cheeky and incisive and dazzlingly fast - one of Guitry's best. His enthusiastic touch elevates what could have been just a creaky old potboiler into something that can probably best be described as an Oscar Wilde bedroom farce.","user":"Fiahm","rank":[3,3]}]