[{"title":"Classic fantasy.","rating":9,"date":"13 June 1999","review":"I don't know what people have against this movie.  Okay, so some of the special effects aren't great, but to be honest I prefer films like this which have interesting plots, solid characters and imaginative scenery to the kind of effects-dependent trash Hollywood is currently churning out without care or interest.<br><br>The story involves scientists intending to explore under the ocean with the use of a diving-bell.  However, after they find a gold statue they, together with most of the crew of their ship, are abducted by a giant octopus and taken to the lost undersea world of Atlantis.<br><br>This is a classic and highly entertaining film with good performances from the cast and atmospheric settings with appropriately haunting music.","user":"G.Spider","rank":[38,43]},{"title":"Switch off your brain and enjoy...","rating":22,"date":"22 February 2002","review":"This is the first time I've commented on a movie, and it's fairly appropriate to be writing about this one as this was the first movie my dad ever bought for our shiny new video recorder.  Well, I must take after my dad in my movie taste, as I though this was (and still is) a very entertaining and enjoyable film.  I don't really care if the acting is wooden (what else would you expect from good ol' Doug??), the premise was sound and the special effects were alright for the time.  In all, this was generally quite a good film - don't let the snobs put you off it.","user":"Elle Jay","rank":[22,25]},{"title":"A Doug McClure Gem!","rating":10,"date":"16 March 2005","review":"What a great film! When ever I watch this movie, I sit with a big grin on my face. This was one of the first movies I saw at the cinema as a kid. This film didn't win any Oscars, but if there had been a category for FUN it would have won hands down. I don't thing this film was ever meant to be taken too seriously. Like many of Doug McClures movies, \"At The Earths Core\" and \"The land that time forgot\", made with a hint of tongue in cheek. Made before the onset of cgi effects, this film has an innocent, non-cynical feel. It has Monsters, the lost city of atlantis, guns, fight scenes and more monsters, what more can you ask for in a low budget sci-fi. Films like this are often belittled by people who cannot see beyond their De Niro's and Oscar nominations. The quality of a film, at the end of the day, is about it's entertainment value, hence 10 out of 10.","user":"phil-626","rank":[28,34]}]