[{"title":"A legendary film noir","rating":4,"date":"4 July 2004","review":"Paul Madvig (Brian Donlevy), a crooked politician has decided to give up his corrupted past to team up with the respectable candidate Ralph Henry for the ongoing election. As an example of his new ethics, he refuses to protect the clandestine place of Nick Varna by giving a call to the Police in the presence of Nick Varna and Paul's personal hired man Ed Beaumont telling the cops to prepare a visit to this gambling place. Things get complicated when Ralph Henry's son is discovered dead by Ed Beaumont probably murdered in front of Paul Madvig's place. Taylor had a gambling problem and was in love with Paul Madvig's young sister Opal Snip' Madvig. Paul is a first choice suspect, at least to the local journal but did Paul really do it? Who is he protecting? And who is writing these nasty anonymous letters?<br><br>This is truly a classic Hollywood film noir. The plot is harder to follow than in the Blue Dahlia, but this is nonetheless a high standard movie. The acting, the dialogues and the directing are all good and playful. This is one of the movies where Alan Ladd and Veronica Lake chemistry first exploded. Just have a look at the first scene when they meet: she gives Ladd sultry looks when Paul Madvig is doing all the talking. I had a hard time concentrating on the discussion at this point. You know that these two will go a long way, even when at some point in the movie, she becomes engaged to Paul and that their relationship becomes more difficult. Veronica Lake is absolutely beautiful in this movie. Her looks are very suggestive and her husky voice is the sweetest. During this movie, you will see Lake kissing Ladd, but it's only a one way kiss. I just saw this movie last night in Oak Street Cinema (Minneapolis) and the audience enjoyed it very much until the very end, and so shall everybody. A classic film noir. Highly recommended 8/10.","user":"cyril1974","rank":[52,55]},{"title":"Reaching For Some Class","rating":9,"date":"23 November 2006","review":"In watching this and the first film version of The Glass Key you have to wonder why Brian Donlevy is making an alliance with the 'reform' forces led by Senator Moroni Olsen. The way I see it, Donlevy is a mug and he knows it, but he figures he'll step up in society if allies himself with the right people. It's the only explanation that makes sense for Donlevy to cut loose from gambling czar Joseph Calleia.<br><br>Everybody in Donlevy's family is getting involved with Olsen. Donlevy's taken a shine to daughter Veronica Lake who can't stand him, but will put up with it for her father's sake. Donlevy's sister Bonita Granville is involved with Olsen's playboy son Richard Denning, not something that Donlevy approves of. When Denning turns up dead all kinds of questions are raised.<br><br>Donlevy has someone on his payroll who takes care of these problems, Alan Ladd and Ladd's not particularly squeamish about the legalities of things. He starts investigating and at the same time tries to protect his boss's reputation. Not so easy as he finds out.<br><br>This was the second teaming Veronica Lake and Alan Ladd and they clicked as well as they did in This Gun For Hire. It was also the first time that Alan Ladd and William Bendix worked together on a film. Bendix became one of Ladd's best friends on the Paramount lot and his widow Tess Bendix was a prime source for Beverly Linet's revealing biography of Alan Ladd. Bendix portrays a truly malevolent thug who works for Calleia and he's pretty frightening. One of the best examples of a sadist ever done on the screen.<br><br>My personal favorite in this film besides Bendix is Joseph Calleia the racketeer kingpin of the city. He's one slick article as he usually is in most of his films and his fate is determined by something he really could not have foreseen.<br><br>The story by Dashiell Hammett on which this is based really does show how close politics and the criminal element mix, even the so-called 'reform' element. Even law enforcement is afraid to move here as typified by the very political district attorney Donald MacBride. He's not one to move against the local power structure unless he has to.<br><br>This version of The Glass Key is not too different from the 1935 version that starred George Raft and Edward Arnold. This one is seen more often and shows that corruption can be quite systemic in some of our local governments. Pity the poor voters.","user":"bkoganbing","rank":[38,42]},{"title":"Sock-Me-Again Ladd and Big-Slob Bendix","rating":18,"date":"18 February 2004","review":"\"Reform\" party politicians making unholy alliances in the final days of an election, media manipulators itching to smear a candidate in the morning news, ingrate gambling richboys who screw up everything for everybody. A \"dated\" film?<br><br>If anyone's ahead of the game it's Ladd. Smart, tough--he'll take the blows but not the fall. A shark-eyed quiet little guy with a deep voice. A small mouth with barely an upper lip. A smile not quite a smile--head to head with doll-like Veronica Lake who smiles even more when she doesn't mean it. They are a stare-down match for each other. And that bemused look on their faces tells you they're not just game players.<br><br>Then there's scene-stealer William Bendix. When a redneck isn't gettin' any action, he might settle for a good knock-down. Getting good &amp; drunk is foreplay. Bendix romances Ladd. How many times does he call Ladd sweetheart? Bendix can hardly wait to get on with the hard stuff. (Don't forget to check out the contemporary hair.) Watch and wince while Ladd plays co-dependent.<br><br>For toppers: Ladd's dinner-crashing moment (via skylight)--inspired. Maybe worth the whole film just to see.<br><br>Then there are lines like, \"My first wife was a second cook in a third-rate joint on Fourth Street,\" Lake's jab at the Christian Science Monitor, or \"If you're going to be a nitwit, don't go around with a megaphone.\" Also not to miss: Lillian Randolph at the piano of a hide-out bar singing to Bendix. Looking like he's about to cry---till Ladd walks in.<br><br>Densely detailed, paced one step ahead--not for the sleepy.","user":"ted-129","rank":[60,69]}]