[{"title":"Hilarious horrors","rating":7,"date":"7 August 1999","review":"Ghastly high-camp Mexican horrors with Stuart Whitman as a Priest attempting to help Samantha Eggar in her battle against a murderous demon which possesses people's left hands. Whitman's acting is suitably over-the-top (his accent changes from Irish to American and back) while Eggar gives the shoddy production more class than it deserves. Russ Meyer starlet Haji has a small role as a gangster's moll while Mexican superstar Erika Carlsson receives prominent billing for her challenging role of \"Nurse Morgan\": a sexy blonde cleavage-revealing nurse who has about 45 seconds of screen time and who's only dialogue is screaming out \"NOOOOOO!!!\" (See Alicia Encinas' role in \"The Bees\".)<br><br>Infinitely compelling and enjoyable in its badness, the film is enlivened by several grisly/hilarious horror sequences and quite a few genuinely suspenseful situations. The funniest sequences involve assorted possessed people finding various imaginative methods of removing their left hands. Of course as soon as the hand has been removed we see it scurry off in search of a new victim and the process begins again. Unlike Alfredo Zacharias' other opus \"The Bees\" (1978) it appears the makers really were attempting to make a good film this time around. They almost made it but fortunately there is enough terrible acting, laughable dialogue (possessed cop to a plastic surgeon: \"cut my hand off or I'll kill you!\") and high-camp hilarity to keep any bad-movie buff enthralled.<br><br>The film apparently sat on the shelf for three years; release of \"The Hand\" starring Michael Caine undoubtedly encouraged distributors to finally release this to cash-in on the living-hand craze.","user":"Rrrobert","rank":[9,10]},{"title":"Give 'em a hand...or not","rating":6,"date":"7 August 2012","review":"*Note: Like many of my reviews, this is taken from my blog, which is called \"Talk of Horrors.\" This one comes from the last entry of \"Not on DVD Week.\" <br><br>The workers at a Mexican mine don't exactly want to go there because of a curse. Well, Jennifer (Samantha Eggar) and Mark Baines (Roy Jones) go in anyways, and accidentally unleash a demonic force that has a fondness for possessing people's left hands. I guess Ned Flanders was wrong when he said \"Lord Love a Leftie.\" Anyways, the only way a person can free themselves from committing acts of evil is severing said hand-which will then go after someone else and kill or possess them. Can Jennifer and Father Cunningham (Stuart Whitman) stop this handy horror?<br><br>As you can tell from the premise, \"Demoniod\" is about as goofy as they get. The plot really doesn't hold up to scrutiny, most of the performances are lackluster, and the film is loaded with moments that are unintentionally hilarious. The highlight of those goofy moments is a police officer demanding \"cut my hand off or you die!\" <br><br>In spite of it's problems, I found myself kind of enjoying this movie. It's not really good, but the whole concept is so daffy that you can't help but go along with it. It's like \"Death Bed: The Bed That Eats\" or \"I Bought a Vampire Motorcycle\", only played straight and without evil inanimate objects. Apart from that, Eggar and Whitman aren't great, but do their best carrying the material, and there's something perversely amusing about seeing people finding different ways of getting their hands severed, providing some fun bloody moments. Add a great score by Richard Gillis, plenty of (unintentional) laughs and a downbeat (though predictable) conclusion, and you've got yourself an amusing little piece of trash cinema. It's amazing that a movie this offbeat hasn't gotten a DVD release yet, as it's the kind of cult oddity fans of trash live for.","user":"lovecraft231","rank":[5,5]},{"title":"Good idea, badly executed","rating":4,"date":"5 December 2006","review":"By the early 60s, the Mexican film industry was beginning its slow but constant decline after the Golden Age ended. Facing economic problems and a stronger competition from foreign filmmakers, the Mexican industry found itself at its darkest hours through the decades of the 70s and the 80s. Sadly, this is the period where director Alfredo Zacarías begins his work, starting as a writer under the guidance of his father, director Miguel Zacarías, and the legendary Golden Age director Gilberto Martínez Solares. Soon Alfredo Zacarías started making films on his own and found success directing the comedies of GAspar Henaine \"Capulina\", however, Zacarías had big plans in mind and by the end of the 70s, he directed two ambitious horror films co-produced with the U.S.A. and starring somewhat famous American actors: 1978's \"The Bees\" and this film, \"Demonoid, Messenger of Death\".<br><br>Also known as \"Macabra, la Mano del Diablo\", the film stars Samantha Eggar as Jennifer Baines, who is visiting the mining city of Guanajuato in Mexico as his husband, Mark (Roy Jenson) owns an important mine there that seems to be very rich. At the time when Jennifer arrives, Mark is facing the refusal of his workers to go deeper as they believe the mine is haunted. Thinking it's all mere superstition, Mark and Jennifer enter the mine and discover an ancient altar to the Devil, which holds the Devil's hand as a relic. Mark takes the Hand as a trophy of man conquering superstition, but soon he'll discover that the Devil's hand is not made for fooling around. The Hand begins to possess people transforming them in psycho killers, and only Jennifer knows the truth.<br><br>While the movie is written by Amos Powell (of Croman's \"Tower of London\" fame) and David Lee Fein (who later would write \"Cheerleader Camp\"), the film is obviously the brainchild of Zacarías himself, as he wrote the source story the script was based on. Unlike in \"The Bees\", Zacarías really attempts this time to create an interesting horror piece, and while he unashamedly lifts some ideas from Oliver Stone's \"The Hand\" (released previously that same year), it could be said that he succeeds in making a somewhat original tale of horror. Sadly, the plot lacks the coherency and the sense to put all the elements together and the bizarre story never really takes off.<br><br>Zacarías' direction is technically effective, but his style is outdated and unoriginal, and in the end this makes the film look 10 years older than its true age. To Zacarías' credit, he makes really original set-pieces aided by some good special effects and a somewhat effective musical score; however, the bad cinematography, together with the low-budget and the contrived plot, would diminish the power of those scenes. While he has proved to be good with comedy, he seems to struggle with the drama and the suspense of his film, as if he had troubles directing his cast. The various action sequences of the film are really good for the budget, although again, with a notoriously anachronistic look in the execution.<br><br>Samantha Eggar does her best with what she has to work and manages to carry the film despite the movie's obvious problems. Her character is really simple, almost typical, but she makes it likable and less two dimensional. The experienced Stuart Whitman is less successful, although overall he pulls off an acceptable performance as the Priest that helps Jennifer against the Hand. The rest of the cast ranges from mediocre to downright awful, although one can't tell if it's completely the actors' fault due to the bad way the script is written. However, to tell the truth, Roy Jenson did give an effective performance in his short screen time.<br><br>It's true that at first sight, one could blame the movie's flaws to it's low budget, it's bad special effects or to its director, however, I think that the real problem lays on the poor way the script was built. Contrived and fast packed, the story never really fulfills its main purposes (to scar and entertain), and never really goes somewhere. While the intentions of the writers were good, the plot was probably not meant to work in the first place. Zacarías has done better films when he has a good script to work with, but in \"Demonoid\", the lack of coherency of the plot simply make the film boring and tedious.<br><br>It's kind of sad that Zacarías had the chance to make this film when the Mexican film industry was at its lowest point, as the very ambitious idea (that without a doubt looked good on paper) simply couldn't work well on film. Fortunately, he finally would make a movie the way he wanted in 1989, with \"Crime of Crimes\", in the meantime, \"Demonoid, Messenger of Death\", ends up as another good idea that was just badly executed. 4/10","user":"jluis1984","rank":[5,6]}]