[{"title":"Computers and killer pigs","rating":5,"date":"1 July 2013","review":"An army cadet is bullied by four other students and some authority figures. One day he is sent to clean the old church basement as a punishment and, while there, he finds a secret room which contains an ancient Satanic Mass book. He discovers that passages from it can reincarnate a 16th century Satanist called Esteban. Using a computer, he revives Esteban and has bloody revenge on all those from the academy who have wronged him.<br><br>Evilspeak was another early 80's horror movie that found itself onto the UK video nasty list. These were the films considered so offensive that they threatened the moral fabric of Britain back in the day. As a result it was banned and, naturally, has benefited ever since from the notoriety. Like most on that list it's difficult to understand what all the fuss was about with this one. If anything it proves that the censors back then were a spectacularly over-sensitive and humourless group of people. Because it's well-nigh impossible to see how they could have thought anyone could have taken this film seriously enough to then go out and commit acts of violence. This is a film about a possessed computer after all. It features a horde of man-eating pigs and has a climax where the hero floats through the air wielding a big sword. To my knowledge, none of these things has ever cropped up in the news in the years since Evilspeak was released.<br><br>How is it as a film? It's fun, if nothing too impressive. It takes it's time to get to the horror stuff to be fair, although this does allow for more character development. The main guy Cling Howard (Ron's brother) is pretty decent and is a guy that's easy to root for. The film is essentially a nerd revenge flick and the bullies are an appalling bunch of cretins. So you are willing them to be dispensed with in as nasty a way as possible. And to be fair, the climax is pretty good with all manner of gory mayhem ensuing. Evilspeak is kind of a hybrid of Carrie with early 80's computer technologywith demon pigs thrown in for good measure. It's one of those horror films from the time that is kind of crazed but pretty imaginative, so it's easy to get onside with this one.","user":"Red-Barracuda","rank":[12,13]},{"title":"Satan Makes A Good Horror Film.","rating":7,"date":"8 May 2017","review":"What surprises me most about this title is that I haven't seen it up until recently, as it's right up my alley... dark, nasty, and messed up.<br><br>This is the story of Stanley Coopersmith, a strange gawky kid who finds it hard to make friends and so ends up as a joke and punching bag for the other cadets at military school. However, while he's being punished by having to tidy up the chapel's basement he finds a secret room and a book of Satanic spells and worship. These were hidden away by a rogue priest Father Esteban, who had been banished to the Americas.<br><br>Unable to read the scriptures in the book, Coopersmith uses the schools' computer to translate them. and when he finally carries out the Black Mass all hell breaks loose at the school and the chapel.<br><br>One of the better aspects of this film is the cast as it stars Clint Howard as Coopersmith and it's really nice to see him in a lead role and not just playing a strange and creepy secondary role. Though he's young here, he does a good job.<br><br>Then there's R J Armstrong who plays Sarge, the drunk janitor looking after the school and chapel, who hates kids and has it out for Coopersmith. Armstrong is great in this portrayal, he gives the air of a man you just wouldn't trust.<br><br>Charles Tyner does a brilliant representation of a prig of a Colonel who finds it demeaning and below him to run the military school.<br><br>Finally, Richard Moll is excellent in the role of the Evil Father Esteban. He adds the right amount of power, menace and violence to the character to make him believable as being the hand of Satan.<br><br>For the time, the special effects would have been superb, especially the computer graphics (which today are cringeworthy and laughable) and most are still passable today. The climax of the film in the destruction of the God's house is very well done and created.<br><br>All in all, this is a pretty decent horror movie with a lot of the right elements and well directed by Eric Weston. A definite watch for a horror nut and if you're not, it's still worth a look-see on a dark night...","user":"stephenabell","rank":[4,4]},{"title":"Demonic gender-bending twist on Carrie","rating":6,"date":"9 July 2016","review":"A choice example of the horror film during the early '80s, EVILSPEAK is a wacky and delightful mumbo-jumbo shocker which boasts a sterling performance from weirdo Clint Howard (TICKS) in one of his few leading roles. The clichéd plot instantly rips off CARRIE with a gender-bending variation on the central theme: a boy at military school is tormented and abused by fellow pupils and teachers alike, so takes revenge by summoning down the wrath of Satan upon them. The best method to do this? By using his badly dated '80s computer, of course! One of the few films to contain an evil computer as one of the leading characters, EVILSPEAK makes great and cheesy use of this premise to spread some maximum mayhem come the finale.<br><br>Before the gory conclusion we are treated to a fairly slow-paced film which attempts to be serious – making it all the more amusing to watch. Enjoyment is heightened by the over-the-top efforts of a cast all striving to outdo themselves – from the Nazi history teacher to the cruel P.E. coach and the dumb jocks who make Clint's life a misery. Two genuinely good performances are given by the underused old-timer R.G. Armstrong as the drunken \"Sarge\" and Howard himself as Coopersmith, the put-upon orphan who finds himself possessed by Satan. Howard's acting is damned good and he holds interest during many of the slow spots. Keep your eyes out for creepy Richard Moll in another effectively evil performance. The music score, kind of an over-the-top variation of the music from THE OMEN, adds to the entertainment value immensely.<br><br>EVILSPEAK's off-kilter approach to the material makes it more entertaining than many similarly low-budget slasher films doing the rounds at the time. This is a film where evil is pixelated on a computer screen in many colourful and cool interludes. Where an attractive actress is gored to death by killer hogs in her bathtub after a gratuitous nude scene. Where a man is thrown vertically upwards to be impaled on a chandelier. Where a guy's head twists around back to front in a cheap EXORCIST imitation. On top of this we get some cheesy gore scenes involving people being decapitated by swords, a heart ripped out of a chest and much much more, scenes which have been jarringly cut out of the film in even the US version – the only flaw the film contains. I would pay good money to watch the uncut Canadian release of this cheese classic. EVILSPEAK is an always-involving \"possession\" style horror film, worth watching alone for the fiery climax in church which has to be seen to be believed.","user":"Leofwine_draca","rank":[4,4]}]