[{"title":"An eccentric visionary brings opera to the jungle","rating":10,"date":"24 April 2005","review":"Based on a historic figure, this is the story of Brian Sweeney Fitzgerald (Klaus Kinski), known as \"Fitzcarraldo\", an eccentric visionary living in Amazonia. He first tried building a Trans-Andean Railroad, but went bankrupt. When we meet him, he's trying to make a living by selling ice to Amazonia natives, although we first see him on a small boat with his sometimes significant other, Molly (Claudia Cardinale). They've traveled 1200 miles down the Amazon to an opera house to hear Enrico Caruso sing, because Fitzcarraldo is an opera fanatic who especially loves Caruso. He loves opera so much that he dreams of building an opera house in the relatively remote outpost of Iquitos, Peru, where he's been living. Understandably unable to find backers for such a venture among Iquitos' wealthy rubber industry leaders, Fitzcarraldo hits upon a scheme for making a bundle of money, and which would eventually enable him to fund the opera house himself. Unfortunately, not all goes as planned.<br><br>Fitzcarraldo was a notoriously difficult film to make. Documentarian Les Blank even made his own film detailing some of the difficulties and apparent ironies, The Burden of Dreams (1982). Director Werner Herzog hauled his cast and crew to Amazonia for the shoot, where they ended up trapped in the rain forest for months. At one point the filmmakers' camp was set fire by Indians who objected to the production, there was an air crash in which some of the crew died, and a couple outrageous \"stunts\" in the film--including the main plot device of the climax--actually were outrageous, dangerous tasks rather than safe effects/model shots, as we'd expect them to be. Just the idea of pulling off the main stunt caused the Brazilian engineer initially associated with the project to abandon involvement. A number of cast members also backed out, including Mick Jagger and Jason Robards, who were both signed on at different points to play Kinski's role. Knowledge of these kinds of issues makes Fitzcarraldo even more fun to watch, and makes the fact that it was completed at all, not to mention that it is such an elegant masterpiece, more remarkable.<br><br>The tone of Fitzcarraldo overall closely matches Kinski's depiction of titular character. It is quirky and surreal, but very subtly yet satisfyingly so, with both an almost garish bizarreness (Kinski is quite odd looking in a way) balanced with a sublime beauty. Herzog imbues the film with a lot of gorgeous cinematography, enhanced by his unique sense of pacing. For example, he'll set the mood of a dawn/dusk scene with a lingering shot of a colorful sky, which then functions as symbolic of a night's events without directly showing them. Herzog matches this same technique in his action--he has an ability to say as much with what he doesn't show his actors doing (or saying) as with more conspicuous content.<br><br>Herzog also shows himself to be a master of selecting music to enhance mood and tell a story, as he balances an atmospheric Brian Eno-ish score from Popol Vuh, native jungle music, and vintage turn or the century recordings of Caruso singing Bellini, Verdi, Puccini and such. Of course opera is an important plot device that enters the film at various critical points. Even if you don't like opera, however, Herzog and Kinski make it (and the motivation for it) attractive in context, and you may just find this film beginning to turn around your feelings for that music.<br><br>It's interesting to note that even with Herzog's unusual pacing, the flow of the film always seems \"natural\". Fitzcarraldo also has an unusual plot structure, as it almost stream-of-consciously moves from opera in a formal European-seeming setting to a historical dramatic depiction of eccentrics in a native-filled Peruvian town, and then to an exciting adventure tale that is the heart of the film before it finally reaches an irony-filled, beautifully surreal dénouement. The constant throughout all of this is Fitzcarraldo, of course, who can't help being eccentric but charming, both to the film's audience and to other characters.<br><br>Fitzcarraldo is often interpreted as being somewhat critical of western encroachment on other cultures, such as Amazonia. Under this view, Herzog is usually seen as ironically \"guilty\" of the same actions that he's indicting. However, the film does not read as criticism to me. It's much more in line with what is usually considered to be a romantic tendency in Herzog. Fitzcarraldo is not at all a villain in the film, and neither are the European rubber barons. Instead, Fitzcarraldo is lovable and admirable if a bit crazy. The introduction of western culture doesn't end up being a negative. The natives in the film still retain their unique identities, and efforts are made to interact with them in their manner, not to adapt them to Eurocentrism. Cultural change may be inevitable with interaction, but the message of Fitzcarraldo is more that the interaction can produce unique, worthwhile cultures that are amalgamations of their precursors.<br><br>Another interesting subtext is that of Fitzcarraldo as Orpheus. Just as Orpheus enchanted wild beasts, trees and rocks on Mount Olympus with his lyre, causing them to \"move from their places\", Fitzcarraldo uses opera to enchant the natural world in which he is ensconced, eventually \"moving mountains\".","user":"BrandtSponseller","rank":[138,159]},{"title":"Herzog's films are deeply personal, visually exciting and uncompromising","rating":8,"date":"9 December 2008","review":"His films are perfect examples of the European tradition of the 'auteur' film, in which the director is seen as the originating and creative force behind the work But there is also a sense that Herzog's visionary monomaniacs function as the director's alter ego, embodying the heroic status of the auteur, always struggling against recalcitrant reality to fulfill his dream <br><br>This seems especially true of \"Fitzcarraldo,\" which, sets a hundred years ago, begins with an Irish colonist who had a passion for opera rowing 1,200 miles down a South American river, accompanied by the madam of a brothel, in order to hear the great Caruso perform <br><br>Inspired by this experience, Fitzcarraldo embarks on a grandiose plan to open up the Amazonian jungle to river transport, providing access to new rubber plantations and thereby making enough money to build an opera house <br><br>Herzog's favorite actor, Klaus Kinski, is as appropriately manic as Fitzcarraldo, eyes glittering madly as he pursues his vision In the central sequence he organizes a tribe of Indians to help him pull a steamboat across a mountain in order to by-pass dangerous rapids <br><br>\"Fitcarraldo\" seems by turns admiring of its hero's megalomania and mocking of his hubris, with no illusions about the cynical exploitation of the region's riches by the rubber barons whom Fitzcarraldo tries to defeat by cleverness Ultimately though, it is the sheer spectacle which we remember","user":"Nazi_Fighter_David","rank":[28,31]},{"title":"Whom the gods would destroy they first make mad...","rating":9,"date":"27 January 2007","review":"This is a work of fiction, although the idea for the story and the name came from a real person who actually lived at Iquitos, Peru, and who was a rubber (not robber) baron in the eighteen-nineties.<br><br>Arguably, Klaus Kinski (as Fitzcarraldo) was born to play the main role  although Werner Herzog considered taking up the role himself. But, no one can play an eccentric the way Kinski did in this film. It's not Nosferatu (1979), but the wide, staring eyes are looking at you, all the time, in the same spooky way.<br><br>And, only an eccentric of the most magnificent kind would dare to take a 340-ton ship up the Amazon and carry it over a mountain down to another river! Isn't that just one of the craziest things you've ever heard of? Well, the truth is Herzog actually did do that and simply used Kinski as his surrogate to prance around the mud and clay, with the local Indians, and generally taking the praise for a job well done. There were no special effects  the production team actually pushed and pulled that hulk up a slope of hundreds of meters and then down to another river.<br><br>So, who was really crazy: Herzog or Fitzcarraldo? <br><br>Never mind that: just see this movie for the lush, primeval jungles of South America; for the rich tones of various opera singers, including Caruso (on a phonograph); for the stunning photography aboard the ill-fated Molly; for the antics of Kinski, as he thrashes around, pushing himself and others to the limits; for the army of local Indians, pulling the ship over the mountain; for the haunting sound-track provided by Popul Vuh, Herzog's perennial musical team of choice; and, of course, for the lovely Claudia Cardinale  past her prime but still remarkable...<br><br>I love this movie and I hope you do also. And, when you have seen it, then see Burden of Dreams (1982), the film that tells the story of the making of Fitzcarraldo. It's maybe better than the fiction...","user":"RJBurke1942","rank":[34,39]}]