[{"title":"Wilkommen. Bienvenue, Welcome!","rating":10,"date":"18 January 2006","review":"\"A Foreign Affair\" is not one of the films, directed by Billy Wilder, that are constantly seen on cable. We saw the movie a few years ago, as part as a tribute to the master. \"A Foreign Affair\" shows a Billy Wilder at one of his best moments of his Hollywood career. In going back to a destroyed Berlin, a city in which he lived, Mr. Wilder, and his collaborators, presents us with a film that must have been close to his heart.<br><br>We are shown a Berlin in ruins right after the war as the US Congressional delegation comes to investigate the morale of the American men deployed in the divided city. It was still a time where some Nazis are still hiding from justice as the Allied forces are looking for them. One of the members of the commission that arrives in Berlin, Congresswoman Phoebe Frost, is carrying a birthday cake for one of her Iowa constituents, sent by his girlfriend.<br><br>Berlin in those days was a place where things were hard to obtain. A lot of everyday goods, as well as all types of items, were bought, sold, or bartered, in the streets. We get a glimpse of it, as Capt. John Pringle exchanges his own birthday cake for a mattress that he intends to present to his current love, the exotic Erika, who entertains in the Lorelei, the cabaret that attracts a mixed crowd. Things get complicated as Phoebe Frost, who is a sticker for detail, catches Pringle at the night club. Phoebe, Pringle and Erika will be involved in a web of deception, intrigue and love. The no-nonsense Congresswoman falls in love, against her better judgment with the handsome Pringle.<br><br>There are delicious moments in the film that only someone with Mr. Wilder's eye for detail could get from his players. Phoebe Frost is taken for a ride with two GIs who think she is a local. The Congresswoman also plays a number in the Lorelei, a song with the appropriate title of \"Iowa Corn Song\", one of the highlights of the movie. Also, Erika, sings a couple of numbers, \"Illusions\", and \"Ruins of Berlin\" that will stay with the viewer because of the way Ms. Dietrich could only interpret them. Another sequence involves Pringle and Phoebe inside a file room in which drawers are opened and shut with an amazing pace.<br><br>Jean Arthur is the best thing in the film. She was an actress who showed every emotion so well in her expressive face. Phoebe Frost has to be one of the best roles she ever played on the screen. Marlene Dietrich is another asset in the movie. Her Erika was a survivor, as she clearly shows. John Lund, makes a wonderful Pringle, the man who ends falling in love with Phoebe. Millard Mitchell is seen as Col. Plummer.<br><br>The only thing with the copy shown on TCM, it was so dark, that at times is hard to see what's going on. The photography by Charles Lang shows the devastation and the condition that Berlin looked like right after being repeatedly bombed by the Allies during WWII. At one point in the film, Erika tells Phoebe to accompany her home, \"It's the next ruin\", she explains.<br><br>\"A Foreign Affair\" is one of Mr. Wilder's best achievements as he gives us an account of the city he knew well.","user":"jotix100","rank":[49,53]},{"title":"An outstanding, interesting, entertaining movie","rating":8,"date":"19 April 2000","review":"The main impression left by \"A Foreign Affair\" is Billy Wilder's nobility toward German people. With authentic magnanimity, he chooses to represent Germans as a pitiful people struggling to survive, not a cruel enemy to hate. The movie has an intrinsic historical interest, since it was filmed in 1948 Berlin, completely destroyed by bombs. As usual in Wilder's works, the plot is beautifully constructed, the dialogue is witty and funny, irony, sarcasm and anti-rhetoric are spread along the movie. In the opening scenes we see army captain John Lund at the black-market, selling a cake, hand-made by his American sweetheart and coming from the States, to buy a gift for his Berliner lover Marlene Dietrich. By the way, Dietrich and most Berliner women seem to be on the verge of prostitution, just to get primary goods to survive in post-war disaster. Lund meets Jean Arthur, a US congresswoman committed in hunting nazi war criminals. As a matter of fact, we follow Lund's attempts to destroy evidence of Dietrich's nazi past: a behavior by the captain not exactly patriotic, nor ethic.  The finale is deeper than it appears at a first sight: brutal tyranny, based on terror and slaughter, is doomed to be annihilated, buried under the rubble; pretty girls remain, helping us to spend our life on this unhappy earth.","user":"pzanardo","rank":[50,56]},{"title":"Just one of Wilder's all-time best films","rating":10,"date":"30 April 2005","review":"This is one of Billy Wilder's least known films...and one of his best. A brilliant, cynical comedy about post-war Berlin goings on...black market, Army officers having affairs with notorious ex-Nazis, etc.<br><br>It stars Marlene Dietrich (one of her all-time best performances), and amazing Jean Arthur (in one of her final films), and newcomer John Lund, who was rather wooden in later performances...here, he's terrific.<br><br>Songs and musical score by Frederick Hollander...who's actually present playing piano. The three songs Dietrich sings, \"Black Market\", \"Illusions\" and \"Ruins of Berlin\" are lyrically integral to the plot and represent three of best songs written for a non-musical film of the late 1940's.<br><br>There's some serious plot points underneath the cynical comedy.<br><br>Wish to heck Universal would open their vaults and release it on DVD in the US; thankfully it's available in the UK (get an all-region DVD player...I did!).<br><br>It's an absolutely essential late 1940's comedy and in my opinion, one of Billy Wilder's best comedies.<br><br>Remember....Wilder's next film was \"Sunset Boulevard\".","user":"barrymn1","rank":[44,49]}]