[{"title":"It's a kid's adventure movie with imaginative animation","rating":24,"date":"24 November 2004","review":"Ignore pointless comparisons about how it pales in comparison to Lord of the Rings. This isn't Lord of the Rings, nor is it Citizen Kane. Why some fools insist that every movie must be measured by the yardstick of their own personal favorite I will never understand. <br><br>If you're so spoiled by state-of-the-art computer graphics where each creature has an entire team of people working on it, and can't appreciate the human creativity and craftsmanship of great stop-motion animation, don't waste your time on this movie, go watch the latest Pixar release.<br><br>Harryhausen's work is remarkable not because it's the most realistic animation ever, but because he was able to achieve remarkable things with sculpture and movement on a budget comparable to today's 30 second ad spots.<br><br>Tom Baker steals the movie. He's terrific as the evil sorcerer, villainous but with enough humanity to his character to make him at least somewhat sympathetic.","user":"Barbecue","rank":[55,57]},{"title":"A good romp","rating":7,"date":"6 October 2003","review":"'Golden Voyage' is much better than the later 'Sinbad and the Eye of the Tiger' and equal to the earlier 'Seventh Voyage of Sinbad'.<br><br>The Harryhausen creatures are impressive. Stop motion animation does give solidity to the image, more so than the usual CGI effect. There are some fine ones here including a one eyed centaur, a homunculus, a griffin, a six armed statue, a ship's wooden figurehead. The story is standard but the effects, the locations and the plot weave together well. There is also a dry humour in the dialogue which is entertaining. Scenes like the sword fight with the six armed statute (with six swords!) or the final confrontation at the fountain of wisdom (or something like that) are exciting. The great Miklos Rosza's music adds considerably to the atmosphere.<br><br>\nJohn Philip Law is OK as Sinbad and does attempt an Arabian accent unlike the usual English one, but the role isn't Shakespearean and he does well enough. Caroline Munro looks splendid in her costume, low cut almost everywhere. The rest of the cast support well.<br><br>Tom Baker is excellent as the villain Koura. He makes him sympathetic; what drives him is common to all people. He just uses different means to gain his ends. He dominates the scenes he is in and it is a pity that more big screen roles never came his way. He was the best 'Doctor Who' in the BBC series, in my opinion of course.<br><br>A good fantasy romp to appeal to the adventurer in all of us. Did I mention Caroline Munro's costume? Oh, I did.","user":"henry-girling","rank":[29,30]},{"title":"Not a patch on '7th Voyage',but great fun all the same","rating":27,"date":"27 September 2004","review":"Made 14 years after The 7th Voyage Of Sinbad, this follow up is ,unsurprisingly, not as good, but that WAS a ground breaking classic. Perhaps sensing that they could not top the first film, the filmmakers give this movie a slightly different feel. If 7th Voyage was full of colour and size, Golden Voyage is somewhat darker and less spectacular. Most of the action occurs at night or in caves, while none of the creatures are especially large. This makes Golden Voyage slightly less of a delightful romp, but it's certainly not just a rehash. There is a strong sense of the uncanny to some scenes,such as the villain's resurrection of the tiny humunculus, or the coming to life of the ship's figurehead.<br><br>The pace is possibly a little two leisurely, but the action is still terrific, the showstopper being Sinbad and his men battling the 6 armed statue of the Indian goddess Kali, a masterpiece of effects and editing. Tom Baker is the most sinister of all Harryhausen's villains, and Miklos Rozsa's wonderfully rich and grand score never fails to provide excellent backing. It's very different from Bernard Herrmann's classic Harryhausen scores, but as effective.<br><br>Despite their flaws, there is a wonderful innocence to these Harryhausen films. A modern version would be filled to the brim with CGI, hyperactive editing, 'clever' laughs that show that no one is bothering to take any of this seriously ,etc....... Is that really an improvement?","user":"DrLenera","rank":[28,29]}]