[{"title":"Great movie. If you don't mind all the pot!","rating":10,"date":"24 December 1998","review":"Of all the Cheech &amp; Chong movies made, I think this one, their first, was their best.  There's no real story line you have to follow.  The point of this movie was to make you laugh.  No messages or extra drama.  It's the kind of movie to just sit back and laugh at. I do realize that this movie is definitely not for everyone.  Some parents might not want to let their children see it and some people may not want to watch it themselves.  The movie features a lot of drugs and some drug use (In case you're not familiar with Cheech &amp; Chong movies). However, if you're not offended by that, and you've never seen this movie before, you should check it out for a good laugh!","user":"BizOne","rank":[52,63]},{"title":"surprisingly fresh","rating":7,"date":"2 June 2006","review":"While Up in Smoke isn't one I can watch every time that it is on (why would I want to watch this one on T.V., anyway?), I own it, and watch it, at least, once a year.<br><br>It's amazing that a major studio would make such a risqué comedy. Surprisingly, most of the dope use in the movie is entirely \"accidental\"; in fact, our character's entire motivation for just about all that happens is that they are in constant search of dope that is always out of reach (so they think). While it looks dated, Cheech and Chong knew what makes a \"slacker buddy comedy\" work.<br><br>This may be the best \"one note\" comedy yet. Bevis and Butthead Do America was good, but the original series was better, and I have yet to see Harold and Kumar Go to Whitecastle. A good supporting cast makes a above average comedy, and this one has Strother Martin and Edie Adams who are probably in it for a priceless minute and a half. But, Officer Stedenko (Stacey Keach) and his bunch steal the show. And, I think, they use a reoccurring character from their albums--\"Right On Washington\" as a incompetent scam artist that \"almost\" gets away with his cons. Besides lacking gratuitous nudity (c'mon, admit it. what's a R-rated comedy without it?), this movie isn't loaded with memorable quotes like the movies that one can always watch no matter how many times they've seen it, but you can find them. \"SHOOT THE MOON!\" comes to mind \"Ohhm, ohhm, ohhm, mellow, mellow. . .AHHHHGH!!!\" is another one. \"This looks like Peuruvian Flake.\" \"fiberweed\" \"Harry, get over here!\" \"This is codename: HARDHEAD\" \"Bye, Lardass!\" And the \"battle of the band\" song will get stuck in your head \"da da da da da da DUNT DUNT DAAA!\"","user":"gregopego12","rank":[9,9]},{"title":"THE definitive stoner flick","rating":9,"date":"5 June 2001","review":"First of the Cheech and Chong movies is probably the best overall, with the duo involved in a plot to drive a van constructed entirely of pot across the Mexican border into the US and featuring Cheech singing \"Earache my Eye\". Lots of laughs (especially for the \"inspired\" viewers), but definitely not for everyone.  The whole movie revolves around drug use, so not a movie for young children, obviously.  However, if you don't mind this, you'll probably laugh your you-know-what off.","user":"sick_boy420xxx","rank":[44,54]}]