[{"title":"Twenty Years Too Soon","rating":9,"date":"3 April 2004","review":"Reporter Sean Connery is hot on the trail of a terrorist seeking nuclear weapons. He's tracked by the CIA and other governmental agencies as well as various media outlets. Everyone manipulates everyone and in the end you're left wondering if there is anyone we can trust either in government or in the media.<br><br>When first released the film was a seemingly over the top spoof of the media and the governments uneasy relationship. No one could believe that this film was even remotely connected to reality and so they ignored it. I saw this film in a completely empty theater back in 1982. I was all alone and my laughter filled the theater. I thought it was a wicked spoof that took things, like the British Whoops Apocalypse, to a possible but uncomfortable conclusion.<br><br>After a run on cable this film dropped off the face of the earth and I didn't see it again until 1991 when I rented it during the first Iraq War. The film suddenly was very relevant and despite the fact that the jokes were funny, I couldn't laugh very much because what happened in the film was mirrored by reality.<br><br>Now, 22 years later, film comes out on DVD as the world is even closer to the type of things that happen in the film. Its still funny, and even more uncomfortable.<br><br>If you can take a film thats a black comedy that has slightly dated in some ways, but remains right on target with whats going on in the world see this film. Its simply a funny movie thats going to make you see things a little bit differently.","user":"dbborroughs","rank":[30,30]},{"title":"A great movie about television Second to NETWORK","rating":9,"date":"7 February 2007","review":"WRONG IS RIGHT was not marketed right when it came out in 1982 and was due to fail. The movie ad tag lines called it \"Dr. Strangelove for the 80's,\" which was a lame attempt to encapsulate a dark comedy by referring to another classic dark comedy, which also dealt with nuclear bombs. I think people were put off by that and because it was two years after the Iranian Hostage Crisis, people didn't want a dark comedy about the Middle East. I loved it in 1982, I love it even more today, because in large part, it was right, wrong is right was right.<br><br>HOWEVER, it predicted so much of what has happened in the world since, that it is so prophetic as to be scary. I won't say anything from the movie, but if you watch it and realize when it was made, it's incredible and shows the true genius of those who made it.<br><br>Sean Connery leads a cast which is superb.<br><br>You have to remember, this was before CNN became the go to news channel.<br><br>Enjoy.","user":"JeffBJames","rank":[11,11]},{"title":"Prophetic,biting,black comedy","rating":9,"date":"4 April 2003","review":"I wish this movie was more readily available..it IS prophetic.I saw it nearly twenty years ago and have never forgotten it.Connery puts in one of his best performances as the cynical, jaded, journalist.I would urge all students of US foreign policy to rent-and analyze-this film","user":"coop-16","rank":[10,10]}]