[{"title":"The best of the Universal series","rating":8,"date":"16 February 2006","review":"This sixth entry in the Universal Sherlock Holmes series was the third which defied the initial conception of the franchise. Universal had envisioned Sherlock Holmes as a sort of archetypal hero who, transported into the modern era of WWII, could be put on the government payroll, as it were, to work as a contract agent to hunt down Nazi spies on behalf of the Allies. Perhaps somewhat unexpectedly, this idea met with a great deal of consternation, not only from serious Sherlockians, but also from film critics whose knowledge of Doyle's work was marginal at best. <br><br>Granted, most of the Holmes films made up to that point had been updated to their respective eras (in fact, only Fox's two Holmes features with Rathbone and Bruce had taken place in their appropriate time period), but in those cases, the modernization was all on the surface. Automobiles, telephones, and the fashions of the day were all on display...but that was, for all intents and purposes, scenery. The stories, though changed (sometimes drastically) from their original forms, had a timeless quality about them. The first three Universal films, however, were very timely, with plots focused explicitly on the events of the Second World War. This took Holmes out of his element...not only in the literal sense of removing him from Victorian/Edwardian London (as previous films had done), but in transforming the character of Holmes from a consulting detective into a spy-hunter. Indeed, at times, there is more James Bond than Sherlock Holmes in this character. This trend peaked (or bottomed out) with Sherlock Holmes in Washington...the final straw for critics and audiences alike. The film was a critical and box office flop and Universal saw fit to alter the series' direction from that point on.<br><br>Though still taking place in the 1940s, the subsequent films did their best to place Holmes back in his proper role, solving intricate mysteries with deductive reasoning...rather than the pure chance and intuition that often guided him in his forays into international espionage. This may (or may not) be accredited to the director Roy William Neill (who directed all but the first entry in the series), who, with the fourth film, Sherlock Holmes Faces Death, became the associate producer...a title he would retain throughout the series' run. From that point on, the films became more Gothic in tone, in many ways more closely resembling the Universal horror films of the era than the first three Universal Holmes pictures. This decision yielded immediate positive results. Sherlock Holmes Faces Death was easily the best of the first four entries, and subsequent films topped one another until peaking with The Scarlet Claw.<br><br>Oddly enough, the film is set in a French province of Canada...for no discernible reason. The setting is completely superfluous to the plot, which could easily have played out anywhere (ideally Great Britain). This is made all the more puzzling by the fact that the predominant accent present in the film is British, rather than French Canadian...even American actors threw on Brit accents, despite the fact that American accents would have been more sensible in Canada. But no matter. This slight idiosyncrasy aside, The Scarlet Claw is the ultimate Rathbone/Bruce Universal outing. Not adapted from any of the original Doyle tales, (though borrowing heavily from The Hound of the Baskervilles), The Scarlet Claw is dripping with atmosphere. Fog-wreathed marshes are the setting as Holmes tracks a ghostly apparition that has graduated from sheep mutilation to murdering humans. The local villagers believe the culprit to be supernatural, but level-headed Holmes rejects the idea out of hand, and sets himself to the task of finding the murderer.<br><br>Rathbone, as Holmes, is at the top of his form here...cold and detached, clinical in his reasoning. And Bruce's Watson, even in this dumbed down incarnation, is a pleasure to watch. Crisp direction, beautiful cinematography (particularly for a B-film), plenty of twists and turns along the way, and no small amount of deductive reasoning from Holmes, make this the strongest entry in the Universal series. The later films were often good, but none ever matched the achievement of The Scarlet Claw...which is simultaneously Gothic, suspenseful, and very, very Holmesian. It is not without its logical flaws, but the flaws are justified by the picture's enormous entertainment value. And of all the films in the series, this one is, by far, the most entertaining.","user":"james_oblivion","rank":[49,49]},{"title":"Fantastic!","rating":27,"date":"27 June 2002","review":"\"The Scarlet Claw\" is probably the best of these Rathbone/Bruce films. The plot is very cool.  I found the movie to be more frightening than \"The Hound of the Baskervilles\".  And of course, Rathbone is always wonderful as Holmes.  I would recommend this movie to any Sherlock Holmes fan or to anyone who just likes mystery movies.","user":"ladybug99","rank":[23,23]},{"title":"Into The Marshes With Holmes & Watson","rating":10,"date":"19 January 2005","review":"A plea from a dead noblewoman propels Sherlock Holmes towards a confrontation with a phantom murderer known as THE SCARLET CLAW.<br><br>Holmes &amp; Watson are faced with a real thriller in this moody, atmospheric little film set in Québec. The villain is particularly nasty--a glow-in-the-dark fiend who savagely rips out the throats of its victims. This just might be the case which changes Holmes'mind about the reality of the supernatural...<br><br>As ever, Basil Rathbone &amp; Nigel Bruce are perfect in their roles, like two favorite old uncles, eccentric and a bit crotchety, that one still welcomes to one's fireside. Rathbone is ever the cerebral gymnast, making deductions which sometimes lead him straight into danger. Bruce is a bit more lively this time, getting to indulge himself a bit with an extremely humorous inebriated scene.<br><br>A sturdy cast of character actors make up the very frightened inhabitants of the bog-girded village of La Morte Rouge: Paul Cavanagh as the occult-studying peer; Ian Wolfe as his alcoholic butler; Arthur Hohl as the brutal innkeeper; Kay Harding as his unfortunate young daughter; Gerald Hamer as a nervous postman; Miles Mander as a terrified old judge and Victoria Horne as his disquieted housekeeper.<br><br>With the war against the Axis still continuing at the time of production, the film concludes with Holmes pithy patriotic paean to Canada.<br><br>This film follows SHERLOCK HOLMES AND THE SPIDER WOMAN (1944) and precedes THE PEARL OF DEATH (1944).","user":"Ron Oliver","rank":[34,35]}]