[{"title":"The best Evil Dead movie of all time my personal favorite","rating":10,"date":"24 October 2015","review":"Evil Dead 2: Dead by Dawn (1987) is more than a sequel to a cult classic film from The Evil Dead (1981) this film is more of a prequel to the Army of Darkness (1992) that was made 5. years later. Evil Dead 2: Dead by Dawn is my number 1 favorite film best Evil Dead movie in the franchise. It is one of my personal favorite horror movies. I love this film to death and I love it so damn much. I enjoy this film a lot, it is one of my favorite movie's in the trilogy. <br><br>This is a great movie fun gory entertaining kick-ass sequel. It has action, comedy and horror mixed together that is why I love this film to death! Bruce Campbell is pure fun bad-ass Ash I absolutely love him in this sequel. I miss the 80's and that really best action gory movies un like they are today.<br><br>This sequel to the original movie is the perfect balance between the horror of the original and the silliness of the third installment. It succeeds because it has fun with the \"B\" movie genre, never claiming to be better than it is while employing witty direction and dialogue. The scene I remember most is when blood splashes on the lightbulb, making the room glow red. <br><br>The first time I watch it, this film really confused me a lot because I thought it was sequel to The Evil Dead but it had a lot of changes, which I love that. I have enjoyed a lot of this film, it is one of my second favorite movie's of the trilogy. Bruce Campbell is pure fun and it's witty. Don't get me wrong I love both of Evil Dead films, but I just prefer Army of Darkness more, because it has funny scenes and it has a happy ending, those two films doesn't have happy endings, that is why I love Army of Darkness much better. The film it is just more of the same thing. Literally. But don't take that as such a negative thing. With the success of the low-budget original under his belt, director Sam Raimi re-imagined his first draft and added many elements he just did not have either the time or the money to accomplish on the first pass. On some level, the film certainly works as a nightmare that has to be replayed by our poor reluctant hero Ash. second Evil pairing of writer-director Sam Raimi and star Bruce Campbell doesn't pick up from where the first Evil Dead left off, it instead reinvents some of the same characters from the first film, notably Campbell's daffy hero Ash and putative girlfriend Linda (played by Denise Bixler in this film), and plops them back in the same basic plot setup as the first film, in a kind of horror-comedy Groundhog Day scenario.<br><br>Once again Ash visits an isolated cabin in the woods, turns on a tape recorder that has a professor spouting verbiage from the Necronomicon, and the next thing you know, all hell has broken loose, quite literally. Raimi is a director who may not win points for finesse, but he works in a manic, breathless style that is perfectly suited for the outré black comedy of the Evil Dead franchise, and that devil may care, throw caution to the wind spirit is what has made the Evil Dead trilogy (Army of Darkness was the third film, though there's evidently a Raimi-Campbell remake of the original Evil Dead in the offing) such a cult sensation and what continues to draw audiences to the films to this day. Evil Dead 2: Dead by Dawn is an extremely gruesome affair, but it's also laugh out loud hilarious a lot of the time, with Campbell's intentionally arch delivery and wide-eyed crazed, cartoonish performance style making the most of Raimi and co-scenarist Scott Speigel's reinvention of the Evil Dead premise. <br><br>Evil Dead 2: Dead by Dawn is really a sly, if sometimes sinister, comedy, one blacker than, well, death, but which delivers some consistent guffaws mixed in with the more typical \"avert your eyes\" blood and guts.<br><br>Ash (Bruce Campbell), the sole survivor of THE EVIL DEAD, returns to the same cabin in the woods and again unleashes the forces of the dead. With his girlfriend possessed by the demons and his body parts running amok, Ash is forced to single- handedly battle the legions of the damned as the most lethal - and groovy - hero in horror movie history! Welcome to EVIL DEAD II, director Sam Raimi's infamous sequel to THE EVIL DEAD and outrageous prequel to ARMY OF DARKNESS!<br><br>Evil Dead II (referred to in publicity materials as Evil Dead 2: Dead by Dawn is a 1987 American horror comedy film directed by Sam Raimi and a parody sequel to the 1981 film The Evil Dead. The film was written by Raimi and Scott Spiegel (they wrote the screenplay during the production of another collaboration Crimewave), produced by Robert Tapert, and stars Bruce Campbell as Ash Williams.<br><br>I love this film and Army of Darkness!!!!","user":"ivo-cobra8","rank":[92,105]},{"title":"DIABOLICAL entertainment for the wicked!","rating":10,"date":"30 August 2005","review":"\"The Exorcist\" made you feel respect and fear to the Devil. Sam Raimi's \"Evil Dead II\" makes fun of the Devil and demon possession. Although there are some really scary scenes, there are some really twisted funny situations that would leave you wondering \"what the f*** just happened?!\". The movie is funny for the wrong reasons. I eventually don't laugh about when a man is breaking himself dishes on the head. I don't think it's funny when a man is repeatedly beaten up by grotesque characters. I would never imagine a man getting eaten by a demon locked under a cellar and throwing gallons of blood! \"Evil Dead II\" makes it look hilarious in a wicked kind of way. For example, when Linda's head tells Ash that \"she is being tormented, and suffering in hell; you can feel a little scared but the next scene has a corpse without a head holding a chainsaw. There's no time for logic here, just sit and enjoy!<br><br>It also has the ability to make you feel tense and I must say, scared. The combination of demon possessed people, EVIL sounds (I love the weird noise in the movie), wicked laughs and chanting (\"dead by dawn!\"), and intrepid camera angles are the perfect ingredients to make a sui generis Horror-Comedy movie. Watch out for the \"A Farewell to Arms\" joke, the whole situation with the evil hand, and the eye that gets in a woman's mouth!.<br><br>Sam Raimi went too far for the good reasons. He created an unbelievable and unforgettable work that has served as inspiration for many movies in recent years. The movie is easily one of the most visually stunning Horror movies of all time, for sure. Die hard fans of gore get an eye candy for an hour and a half. Raimi created a cult movie in all the sense of the world. \"Groovy!\". \"Dead by Dawn\" will never bore you because in every scene there's a feeling of uncertainty and that makes it even more interesting. There are no rules here. <br><br>The plot is as scary as you can imagine but it's held in such a way that it isn't taken very seriously. I mean, demon possession caused by the Necronomicon is something that happens in the real world. Not exactly with that book but it can happen via satanic books and rituals. Raimi takes it to a different level of humor mixed with gore. <br><br>Bruce Campbell deserves a special mention. He delivers a wicked, solid, and totally believable performance. Something you haven't seen before mainly because of the strange situations he goes through. His performance could be described as a \"solo\". Easily, one of the best performances of any actor in a Horror movie. Also, one of the characters that suffers the most in any movie! Ash is beaten up by demons, humans, objects, etc. Even possessed creatures make fun of him. <br><br>The gore here is great, glorious. You get decaps, mutilated bodies, a hand cut off, bleeding demons, etc. Blood spread all over the cabin is the common denominator. One of the goriest movies of all time. <br><br>Watch \"Evil Dead II\" to witness one of the most creative, brave, and goriest movies of all time. It delivers something for everyone. It has action, gore, spectacular camera angles, and some action! Check out Ash V.S. possessed Henrietta. * After it, phrases like \"join us!\", \"swallow this!\", and specially \"groovy!\" will be part of your daily vocabulary. <br><br>Recommended for every Horror fan in the world. This movie is an obligation to watch.","user":"insomniac_rod","rank":[96,115]},{"title":"An electrifying roller coaster ride of a movie!","rating":10,"date":"9 January 2001","review":"This film, is without a shadow of a doubt, one of finest, most imaginative comedy horror films ever made.  Raimi, has put all the aspects of the film together in masterful fashion.  The camera work and sound effects are pulsating, and the timing is perfection.  And in Bruce Campbell, the film as a lead actor who gives an exceptional performance.  Campbell plays \"Ash\", an everyday, supermarket attendant who suddenly finds himself thrown into the unusual situation of having to defend himself against, zombies, evil spirits and even his own possessed hand, just in order to survive the night. I laughed, I gasped, and I gripped the arm of my chair throughout! If you like your comedies, black and hilarious, and your horror, gory and sensational, then look no further.  Raimi has created the definitive comedy horror!  Fantastic!","user":"gmhutchins7","rank":[103,128]}]