[{"title":"AN EXCELLENT START FOR ROGER CORMAN'S POE CYCLE","rating":10,"date":"30 May 2001","review":"\"House of Usher\" is an excellent start for Roger Corman's cycle of films based on the work of Edgar Allan Poe. There have been many remakes, but the Corman films remain the definitive statement. Corman was able to capture the feel of Poe's work and that's something that the remakes couldn't even touch. It also provides a tour de force for Vincent Price and establishes him as a great actor.<br><br>The film was shot on a budget of $270,000 and it looks GREAT. \"House of Usher\" is a fabulous calling card for American International Pictures, the distributor. Mostly known for making grade Z schlock, Corman's films gave AIP real class. This is also Corman's first film in CinemaScope and he makes the most of the widescreen here. It earns him a distinction of mine as a \"Master of the Widescreen\", or filmmakers who create complex and worthwhile compositions in the widescreen frame. The only problem is that the Poe films die on TV, due to the horrific \"pan-and-scan\" process. Luckily for us, American Movie Classics show these Poe films often in letterbox and MGM is releasing the cycle on letterboxed DVDs.<br><br>For a film that runs 85 minutes, \"House of Usher\" packs a lot into its' narrative. It is the most faithful of the Poe adaptations, although screenwriter Richard Matheson does take some liberties with the source material, as any great adaptation should. Floyd Crosby's CinemaScope photography is excellent as usual and Daniel Haller's elaborate sets make this look more expensive than it really is. Vincent Price's performance as Usher sets the tone for his future appearances in other Poe films. It neatly combines calm and frenzy together and I can't think of anyone else who would have done a better job. He should have received an Oscar nomination and maybe even the Oscar itself.<br><br>Note: \"House of Usher\" introduces the infamous \"Burning Rafters\" sequence. If you watch these Poe films back-to-back, you'll see this same sequence repeat itself over and over in several of the films (Tomb of Ligeia and The Raven come to mind). It is a mild criticism, but it is such a great sequence and it is so effectively shot that I didn't mind seeing it again and again.<br><br>**** out of 4 stars","user":"Katmiss","rank":[43,52]},{"title":"Corman makes Poe proud","rating":9,"date":"17 December 2004","review":"The first of Roger Corman's adaptations of Edgar Allen Poe stories stars Vincent Price as the head of the Usher house; Roderick Usher. Roderick Usher believes that there is an evil curse on his family, a curse that is also the reason for his and his sister's affliction. Because of this curse of evil, he doesn't want the Usher family line to continue and so he has decided to do all in his power to stop it. However, his sister, Madeline's fiancé has come to the Usher house to take her back with him, but Roderick knows that this will mean that the Usher family line will continue and he cannot allow the evil to spread across the world....<br><br>Roger Corman is often seen as a 'cheap' director because of the vast amount of films that he has made. Although this is certainly somewhat true as a few of them aren't particularly good; if you take a look at his Poe films, this couldn't be further from then truth. Here, Corman creates a constantly morbid and foreboding atmosphere; not with shocks or other cheap methods, but by simple things such as smoke, an old house and it's creepy inhabitants that utter the most malevolent of lines, some of which are truly bone chilling. Of course, this movie benefits implicitly from the presence of a man that is maybe horror's purest actor; Vincent Price. Price was born to play roles like Roderick Usher, and anyone that sees this film wont find it hard to see why. Vincent Price delivers his lines with just the right tone in order to make him obviously evil, but yet pathetic at the same time; just how the character should be played. When it comes to the 'greatest actor of all time' awards, Vincent Price never gets mentioned, but this is a great injustice; as anyone who has seen a number of films will know.<br><br>Corman also succeeds in creating a constant sense of intrigue, and the audience is left hanging on every moment, as we can't wait to see what happens next. Of course, Edgar Allen Poe can take much of the credit for this as the great man did write the story that it was based on, but Corman comes off looking good as well as it is his direction that makes the story so consistently thrilling. The movie also benefits from some very lavish sets, which gives the movie it's upper class dinosaur feel. The house itself is a great piece of horror imagery; it is responsible for most of the atmosphere that is present in the movie.","user":"The_Void","rank":[36,43]},{"title":"A Gothic classic and one of Roger Corman's best films.","rating":9,"date":"12 May 2003","review":"Corman's first Poe film (out of eight) is one of the best adaptations of the familiar story (rivaled only by French director Jean Epstein's superb, yet completely different, 1928 version) and was a critical and commercial success in its day on a meager $125,000 budget. Vincent Price is superb as Roderick Usher, an eternally tortured soul who lives in a crumbling castle with his sister Madeline (Myrna Fahey) and faithful butler Bristol (nicely etched by Harry Ellerbe). When Philip Winthrop (bland Mark Damon) shows up to take Madeline away, Roderick's incestuous feelings come to surface and the terror begins. Highlights include Damon's colorful nightmare sequence and Price's explanation of the Usher family history.<br><br>HOUSE OF USHER is intelligent, subtle and effective, with good sets and costumes and excellent work from scripter Richard Matheson, composer Les Baxter, cameraman Floyd Crosby and art director Daniel Haller--all united by Corman's smart, stylish, fluent direction. Truly deserving of it's reputation as horror classic.","user":"capkronos","rank":[29,34]}]