[{"title":"Two Drunks Afloat in a Sea of Booze Make One Heartbreaking, Powerful film.","rating":9,"date":"3 August 2006","review":"When one describes a romance film, it is normal to use the classic line, 'Boy Meets Girl, Boy Loves Girl, Boy Loses Girl...\" It would be easy to use that formula for any love story. But this is no ordinary love story. It's tragic, it's surprising, and above all, it feels so real. It's not a story this cynical teenage film buff will forget anytime soon, if ever.<br><br>Joe Clay (the Great Jack Lemmon) is a public relations man who doesn't really like his job; we see his boredom and frustration in the very first frame of the film, when he's trying at the last minute to round up some call girls for a party. We also see how he deals with this by shouting to the bartender, \"Hit me again!\" multiple times. He soon meets Kirsten Arneson (the incredible and incredibly underrated Lee Remick) and they detest each other, but after a dinner and a walk around Fisherman's Warf where they bare their souls, they soon fall in love, get married and have a beautiful baby girl. Everything seems perfect. But when Joe's job puts added pressure on him, he feels the only way to relieve himself is to get drunk. In one sad and memorable scene, he comes home late and, because she cannot drink due to breast feeding, degrades Kirsten for not being fun anymore. The pain of the things Joe says stings both of them, and us as well, and before long Kirsten is taking up the bottle herself. Years later Joe really looks at himself and has a moment of clarity; They *have* to sober up, for both of them and we the viewers know it can only get worse unless someone does something. But when they both fall off the wagon multiple times, and it becomes clear that love will not conquer all, Joe is faced with the nightmarish decision to choose between sobriety and his love for Kirsten. <br><br>While I was watching this film, I kept on comparing it to other addiction films like Trainspotting, Requiem for a Dream and The Lost Weekend. While they are all great in their own right, they can't really compare because the core of Days of Wine and Roses is the love story that quickly turns into a love triangle between Joe, Kirsten and booze. It's the love story and the full realization of the characters that makes Days so heartbreaking. Another thing is that we know that Joe and Kirsten are both good people; After Joe accidentally mistakes Kirsten for a call girl, he is the one who brings a peace offering and tries to make ammends, and it is evident to the viewer that during their sobriety, they have a powerful love for their young daughter, which makes their drunken turns all the more powerful. Blake Edward's direction is spot-on; This was his first big drama after being recognized for his comedic work, but he works wonders and gets brilliant--albeit unsurprisingly brilliant--performances out of Lee and Jack. Edwards also has the magical touch of reeling the viewer in, thinking this will be a breezy romantic comedy, then slowly revealing the destruction of two lost souls through the bottle. The luscious black and white cinematography was a great choice to make in a time when color was dazzling the audiences, for it works as a symbol for the darkness and bleak world of alcoholism. Henry Mancini's music is minimalistic and affecting; in the old days of cinema, it was easy to overuse the strings for a dramatic scene, but the score was perfect and not once overdone. The chemistry between Jack and Lee was genius; I couldn't believe they weren't a married couple in real life. Great performances can get you far, but a love story loses half its power unless its two stars makes the love believable, and these two really did. And the audience can clearly see that the two are in love, drunk or sober, good times or bad. This makes the last scene all the more heartbreaking. <br><br>And I can't praise the two lead actors enough. Jack Lemmon, like Edwards, was known more for his comedic work. Some have complained that he was too over-the-top in his performance, most notably the infamous greenhouse scene, but an actor deserves to be known and praised for his overall work, and in the long run, Jack deserved an Oscar for this role. Every move he makes he makes believable and gets deep into the head of an alcoholic. He makes Joe a sympathetic character, and he really makes you care for him. Jack once said when he was doing Glengarry Glen Ross that \"You don't have to like a character, but it's an actor's job to make you care about him.\" I don't think there's a person on this site who didn't care about Joe Clay. This is Jack's role of a lifetime. And I'm ashamed to say I had never heard of Lee Remick before this film, but now she's one of my favorite actresses. She was a very sharp actress and the camera loved her. Whether she was a smiling young secretary or a lonely drunk, you bought the transformation and every moment in between. She had a killing smile but she could break your heart with just a look of her eyes. When the alcohol reveals a vulnerability and a need to be loved she only thinks she can hide, Lee is there, making the performance believable and utterly heartbreaking. When the last scene comes around and Joe and Kirsten are faced with a life-changing decision, the two actors are so good and so into their roles you can easily forget that they're both acting. The love is still there, but it's changed so much. The last shot, like the whole film, will leave you breathless. One of the greatest films I've ever seen.","user":"Goodbye_Ruby_Tuesday","rank":[64,67]},{"title":"A Poignant Love Story from a Simpler Time","rating":12,"date":"12 December 2001","review":"I always saw this movie more as a love story than one of a couple trapped in alcoholism. Joe and Kirsten had that chemistry that drew them to each other through good times and bad, and I have never seen another film that depicted enduring love like this one. I can still recall the  characters' honest, plaintive statements to each other and how they reminded me of how it feels when you're with someone who truly fulfills you. Joe to Kirsten on their first date: \"Short story? Boy meets girl...beautiful girl, nice, the only kind of girl a guy should bother about....\"<br><br>Kirsten to Joe, desperately trying to hold on to what they have after her infidelities: \"I never gave anything out of myself to them....love is the only thing that stops you from being lonely, and I didn't have that...\"<br><br>Joe to the AA counselor, who warns him about what alcohol can do to a marital relationship:  \"You don't understand, there's no trouble between us....we're in love...\"<br><br>Joe, in the depths of alcoholism, tremors, shaking...\"I have to find my wife....I love her...I love her...\"<br><br>This movie is sad and somewhat draining to watch, but also does provide useful insight into the insidious disease of alcohol addiction, along with being a very moving, romantic drama of two people haunted by troubled childhoods, struggling to keep the sincere commitment they have to each other alive.","user":"maryebronson","rank":[37,38]},{"title":"Sobering Drama","rating":7,"date":"5 March 2001","review":"Have you ever been at a party or gathering where you are the only sober person?  It's an experience that is hard to describe.  Everyone that is moderately to heavily drunk thinks that they are so clever, funny, entertaining, and so on.  It has a certain surreal aspect.<br><br>There are several scenes in this film which bring back that feeling to me. When Jack Lemmon and Lee Remick are at their most slap-happy rip-roaring state of drunkenness and having a great time, it gave me this odd sensation -- these people are not funny, not clever, and not entertaining.  This is at least one of the points made in this very well made film.<br><br>The story is well told, and answers the question that many people have about alcoholism, and perhaps addiction in general (How do things ever get so terribly out of control?).  It happens slowly, and it happens for a multitude of reasons.  The reasons that this film deals mostly with include loneliness, wanting to please others, wanting to do one's job without compromising one's integrity, childhood abandonment, low self-esteem, and just the fact that in the social world \"everyone\" drinks.<br><br>Lemmon and Remick do a fabulous job as your ordinary young couple who get started slowly but surely going down the wrong track.  Charles Bickford as Remick's father has little screen time, but makes every moment of it count. Jack Klugman is also very good as Lemmon's Alcoholics Anonymous friend.<br><br>Some things are wonderfully telegraphed.  Lee Remick has this \"thing\" about chocolate (addiction potential). There's just a moment when you see a smoldering cigarette in an ashtray, and you get the feeling that something bad is going to happen (it does).  When Jack Lemmon, in a drunken state comes home one evening, he impetuously picks some flowers for Lee Remick. The elevator door closes on them, cutting off the tops of the flowers. (When he arrives home, the couple have their first really big fight.)  Also, I think it is interesting that every time that Lee Remick is watching the television, she is watching cartoons -- an interesting statement.<br><br>The cinematography is realistic, sometimes downright gritty.  Filming it in black and white helped to enhance this mood, especially in the greenhouse and the psychiatric ward scenes.<br><br>Perhaps the most important point of the story is that addiction, be it alcohol or other things can happen to anyone.  Sometimes you just don't realize it until it's too late.<br><br>The Days of Wine and Roses is a fine \"message\" movie that gets its point across without getting preachy or self-righteous, with believable performances by all.","user":"Jon Kolenchak","rank":[53,57]}]