[{"title":"The Mad Scourge of the Paris Opera","rating":9,"date":"13 August 2006","review":"When Universal decided to remake Lon Chaney's classic silent version of the opera, sound opened up a rather obvious vista for the film. We can make it as much about opera as the phantom haunting the Paris Opera. <br><br>A task rendered considerably easier by the presence of Nelson Eddy and Susanne Foster. Unlike his screen partner at MGM, Jeanette MacDonald, Nelson Eddy came from the opera to the cinema. He always viewed himself as a singer first, films were something he did to get publicity for his concert tours. But Eddy always loved the grand opera, it could easily been his career path. Consequently The Phantom of the Opera and the arias he sings here always had a special place in his affections. We see a lot of the real Nelson here.<br><br>Another one of his interests was sculpture. The bust of Susanna Foster that Claude Rains stole from Eddy's dressing room is something that Nelson Eddy actually did. Sculpting was a hobby of his and as you can see he was quite good at it. Might have made a living doing that as well.<br><br>Susanna Foster who had a lovely soprano voice gave up her career soon after this most acclaimed of her films. A pity too, it was a real loss to the screen.<br><br>This Phantom of the Opera has a bit of comedy in it as well. Baritone Nelson Eddy and Inspector of the Surete Edgar Barrier have an uneasy rivalry going for the affections of Foster. The scenes involving this are nicely staged by director Arthur Lubin, more known for doing Abbott and Costello comedies.<br><br>This may have been Edgar Barrier's best film role. He was a more than competent player, his career probably suffering because he was a bit too much like Warren William who was himself a poor man's John Barrymore. Barrier played equally well as villains or as a good guy as he is here. Another fine role for him even though he only has one scene is in Cyrano de Bergerac where he plays the very sly and all knowing and discerning Cardinal Richelieu.<br><br>Of course Phantom of the Opera is really made by the performance of Claude Rains as the mild mannered, inoffensive Eric Claudin, a violinist in the Paris Opera who is crushing out big time on Susanna Foster. We see him first being told after 20 years he's being given the sack by the company. What they describe sounds an awful lot like Carpel Tunnel Syndrome that he's developed which is affecting his playing the violin. Bad news for Susanna Foster also because he's been her secret benefactor in paying for voice lessons.<br><br>There isn't any middle aged man who doesn't identify with Rains. Tossed out of his job, the rent due, crushing out big time on a young girl, a lot of us have been there. Then when he thinks an unscrupulous music publisher is stealing a concerto he's written, he loses it completely and kills him. And when acid is thrown in his face disfiguring him, it's a short journey to madness. <br><br>Rains really makes us feel for Claudin. In that sense the film is not a horror picture in that we're dealing with monsters or unworldly creatures that Universal so specialized in. The man who becomes the Phantom is all too real, too human, and if we're pushed right, could be any one of us.<br><br>Can you do better than opera arias by Nelson Eddy and a classic performance by Claude Rains? I think not.","user":"bkoganbing","rank":[21,22]},{"title":"A CLASSIC IN ITS OWN RIGHT (AND GORGEOUS, TOO!)","rating":9,"date":"2 August 2004","review":"It's perfectly true that this version isn't Lon Chaney and is watered-down Leroux, but it still has excellent performances and - this was during WW II remember - extraordinarily beautiful production values which resulted in Oscars for Color Cinematography and Art/Set Decoration. I've loved this film since I was a kid, even though back then I had to endure black-and-white telecasts because the local CBS affiliate was unable to obtain a color print that was up to their standards - years later I was lucky enough to see it - twice! in a theatre - as gorgeous as the color is on the DVD, it was even more breathtaking on the big screen. The extra features (the documentary \"Phantom Unmasked\", which includes a rare interview with the elusive Susannah Foster, and the audio commentary) have only increased my pleasure in watching this film over and over again.","user":"Harold_Robbins","rank":[19,21]},{"title":"Horror may be muted...but the music is glorious...","rating":14,"date":"14 April 2001","review":"Before writing a film article on Claude Rains for CLASSIC IMAGES (December 2000), I took another look at 'Phantom' to appraise his performance. He's one of those rare actors who can make you feel sympathy when he plays the ill-treated violinist so that you understand why he turns into 'The Phantom'. His performance is just one asset of this handsome technicolor adaptation of the famous story. Why carp about the changes made for this version? It stands on its own as an entertaining melodrama studded with operatic sequences that give it added dimension. Nelson Eddy has never been in better voice and Susanna Foster is certainly up to the demands of her singing role. The comic aspects of the story are a bit overdone and the only weakness of the film is giving Eddy and Edgar Barrier silly routines as they compete for the hand of Foster. Aside from that, this can still be enjoyed as a horror story set against the Paris Opera background. The sets are rich and detailed. Understandably, the film won Academy Awards for color cinematography and color art direction. Edward Ward's haunting score was also nominated and contributes greatly to the overall enjoyment of the film. The horror is muted in this version--but the rich musical highlights are a compensation. Absorbing entertainment.","user":"Doylenf","rank":[32,39]}]