[{"title":"Great 1950's Western","rating":6,"date":"19 October 2006","review":"This 1951 Color Western features a splendid cast, familiar story and a memorable conclusion. The great Edmond O'Brien leads the great cast in a story of greed, graft and silver mine shenanigans. Arlen and O'Brien are former partners who do battle over the treasures ( A lady and a mine !)<br><br>Along for the bumpy ride in this fun oater are Edgar Buchanan, Richard Arlen and Yvonne DeCarlo. I also enjoyed seeing the great Barry Fitzgerald as a villainous mine older. Fans of post WWII westerns will enjoy this well-paced film. I believe that Edmond Obrien rarely gave a bad performance........ this one was one of his best !<br><br>They don't make 'em like this anymore.........but they should !","user":"revdrcac","rank":[22,25]},{"title":"Greed And Jealousy","rating":6,"date":"30 January 2012","review":"Silver City is a slightly more complex tale of the west than is usual with the sins of greed and jealousy working overtime here.<br><br>Hard to believe but little elfin Barry Fitzgerald is one of the villains in this film. Barry plays a miserly silver mine owner who has leased one of his played out mines to Edgar Buchanan and his daughter Yvonne DeCarlo. That is Barry thought it was played out, but Edmond O'Brien has found a rich new vein and Fitzgerald is frozen out. Not if he can help it though.<br><br>Jealousy is what Kasey Rogers arouses in men. She's got her husband Richard Arlen who represents a big eastern mining concern all hot and bothered over here flirtations. One of those flirtations has been with O'Brien who used to work for Arlen. He's blackballed O'Brien from getting work with most outfits and O'Brien is picking up chump change from wherever he can.<br><br>Now how these two plot elements combine is for you to watch Silver City and learn. But I assure you the recipe delivers a good performance cake. I was most impressed with Fitzgerald in this one. The only other time I recall he essayed villainy on the screen was in And Then There Were None and we don't know he's the bad guy until the very very end. Also note Michael Moore in this cast, not the documentary maker, but an actor who sports a mean and sadistic disposition as another of Fitzgerald's cronies. <br><br>That most noted of color cinematographers Ray Rennahan does some nice work here, but Silver City could use a restoration. Check it out and see what I mean.","user":"bkoganbing","rank":[7,9]},{"title":"Looking for the silver lining.","rating":26,"date":"26 August 2010","review":"The writer reportedly found the story so complicated he had trouble making the screenplay coherent.It shows,particularly in the first scene ,which does not look at all like a first scene-there's the same problem in Haskin's and O'Brien 's \"war path\" ,the -in my opinion- better follow-up the same year.These movies were supposed to make this actor a western star but left him a tough guy in thrillers in which he excelled .<br><br>Anyway the star of this western is the incredibly attractive Yvonne De Carlo ;every time she appears,you only have eyes for her.And there is a scene where her face is filmed in close shot! A labored western ,with two good chases at the beginning and at the end .If it were not for De Carlo,I would rather recommend \"war path\".","user":"dbdumonteil","rank":[3,6]}]