[{"title":"The quest for truth","rating":7,"date":"31 July 2019","review":"The movie begins with a short lecture by Wladyslaw Tatarkiewicz (1886 - 1980), a Polish philosopher and ethicist, where illumination is described as a mystical experience, a revelation of truth beyond the senses, the definition attributed to St. Augustine. The explanation is refreshing since many journalists and hack writers today believe that mysticism is \"seeing things that are not there\" and bears no relation to truth.<br><br>Franciszek, the protagonist, is engaged in an unending quest for illumination, although not entirely in Tatarkiewicz's sense. The first stage is his study of physics, where he believes he will \"learn things which can be known unequivocally\" (this was before string theory, 10-dimensional space and multiverses). However, he feels he is learning the physics of the past; the labs where he works seem to confirm this. Other stages of his quest follow. Some involve science and/or religion and are sought by Franciszek, others are forced upon him by real life. In the end, a sort of illumination is reached, although it bears little relation to the object of Franciszek's quest.<br><br>This movie was made in 1973 when Jean-Luc Godard cast a long shadow on world cinema. His influence is felt (fast cutting, sometimes almost subliminal; photographs, titles, diagrams, apparently unscripted conversations) although it is filtered through the world view of the director. The result, as in the best Godard's movies, is a sort of alienation effect that suits the tale.<br><br>Stanislaw Latallo plays Franciszek's to perfection, his physique matching exactly the character. The rest of the cast is also excellent<br><br>Film Studio Tor is a film production company established in 1967 in Warsaw, since 1980 under the direction of Zanussi. The studio has posted some of its productions (like this movie) on You Tube.","user":"hof-4","rank":[5,5]},{"title":"A genius in search of a soul and the meaning of life","rating":10,"date":"20 January 2005","review":"Get genial. Go to army. Blow your chance with the love of your life. Get sex, get married, get kids and social \"respectability\". Work in a well reputed scientific research institute. <br><br>After such an impressive \"carreer\", start seeking your soul. To get it, leave everything behind and get to the monastery to become a monk. For some,(the weaker minded I would like to believe) this is a gift from god: the \"illumination\" ! as simple as that. <br><br>For others, I believe the meaning is the failure of a genius to be a \"social beast\" and find happiness this way among his fellow people. As once Kant (?) said, the superior being (man) is self-sufficient to himself. He can find peace only in the defiance of secluding himself in a monastery in a country ruled by a communist regime.<br><br>Excellent movie, more actual and dangerous than anything in these materialistic days of our modern society. No wonder you can't find a copy to buy anywhere in the US.","user":"tobos","rank":[30,51]},{"title":"Disappointed","rating":6,"date":"5 February 2020","review":"Boring movie really. It starts out promising with the description of a life, but then slowly turning itself into a more experimental movie, nonsense and religion crusade replacing the factual interests of science seen earlier in the first half of the movie. Sad. Had expected more about a movie with the world Illuminati in its main title.","user":"mrdonleone","rank":[0,1]}]