[{"title":"Dissipated urban humor","rating":9,"date":"1 January 2001","review":"A sharp, deadpan-hilarious dark comedy which never found its audience, probably because there are so many different targets set up by the material: modern marriage, adultery, doctors, hospitals, the literary world, sexual fantasies, sexual positions, Jewishness, lesbian experimentation, revenge (maybe feminist revenge) and, of course, the hard work of dying--which brings everything full circle by the finale. Director Otto Preminger chases after the pungent satire in Elaine May's script (under a pseudonym) in every direction, and yet the film doesn't feel scattershot; it is a rude, wicked rose in constant bloom. The wife of a celebrated writer and magazine editor in New York City finds out her husband's been cheating on her within their circle of friends--and this discovery comes while he's in the hospital dying after having had a mole removed! Dyan Cannon delivers one of her best performances; she's glib, bitter, sexy and naughty, which helps viewers overlook the fact the tone of the movie sometimes has an icy pallor. One of Pauline Kael's complaints was that Cannon's character goes after men without seeing the irony of her actions--that she has no self-respect--and this in fact may be true. We never learn where the wife's priorities lie; she's a good mother to her boys, she's a good listener when her friends come around to bitch, but she's too encompassed in thoughts of the past or in trying to stay strong to figure out how being cheated on really makes her feel. Preminger gets fine performances out of a colorful cast, and there are big laughs in the film, but cutting-edge comedies can also cut too deeply without nimble handling. Preminger isn't very careful, but that may be intentional. ***1/2 from ****","user":"moonspinner55","rank":[17,19]},{"title":"Great satire of the New York way of life","rating":30,"date":"30 June 2000","review":"29 years before American Beauty, Otto Preminger destroys the icons of american life, from the husband to the mother to the medical doctor, in a vitriolic satire where only the wronged ones gain the viewer's sympathy.<br><br>Ever asked yourself why you should be faithful to your husband/wife? See this movie. I loved it.","user":"alberto-27","rank":[10,12]},{"title":"SUCH GOOD FRIENDS more deserving of Best Film of 1971","rating":10,"date":"8 April 2003","review":"WARNING: Just a potential spoiler.<br><br>Granted, seeing Gene Hackman, as hard-boiled New York cop Popeye Doyle, speeding doggedly through the West Side of New York City in a comandeered vehicle, chasing a subway holding the man who just attempted to assassinate him, is still electrifying.  There has been no other chase scene quite like it.  Yes, there is a definite style in William Friedkin's now classic cat-and-mouse police-badge drama, but this does not necessarily mean that The French Connection is completely removed from the characteristic cool-cops-on-the-take actioneers so prevalent in the seventies.  Also granted, it is no extraordinary wonder why the Academy named the film as the Best Picture of 1971, but there were indeed far more deserving films, some of which went unjustly neglected by the naked golden-boy Oscar.  That same year, there were films which, unlike any other cinematic year, went unrecognized: Ivan Passer's narcotics drama BORN TO WIN, John Schlesinger's crisp, complex and very British love triangle SUNDAY BLOODY SUNDAY, Jerry Schatzberg's shattering portrait of heroin addiction THE PANIC IN NEEDLE PARK, Paul Newman's adaptation of Ken Kesey's SOMETIMES A GREAT NOTION and Otto Preminger's exceptional, hilarious satire SUCH GOOD FRIENDS, based on the bestselling novel by Lois Gould and adapted with panache and acidic wit by Elaine May (under the pen name Esther Dale). Shortly before the release of Such Good Friends, the New York Times critics, following a special advance screening, declared that this picture had one-of-a-kind virtuoso style and strong direction, but would offend quite a few people.  No doubt, this statement was accurate.  Integrating absurdist images and surrealistic scenes, it is most likely the only film in which you will catch a very pompous Burgess Meredith dancing half-naked, with only loin-cloth and rose, at a high-brow urban terrace party.  It is the only film where you will likely see Dyan Cannon shamelessly throwing herself at an obese and greatly embarassed family physician, played with great skill by James Coco.  It is the only film you will likely see in which a congregation preparing to donate blood to their friend nearly turn the event into a full-scale cocktail party.  All this thrown into one motion picture makes for a sharp, lively microcosm of the mediocrities of wedlock and, ultimately, an unforgettable portrayal of the self-gratifying, solipsistic American fast-track life-all thanks to the always masterful direction of the notoriously tempestuous Otto Preminger. Beginning with the now-famous title treatment by the legendary Saul Bass, we meet Julie Messinger as she is deciding on what to wear to a party in honor of her artist husband Richard.  The opening scene is quaintly voyeuristic, as the audience spies on her in her own little world, accented with her clad in brassiere and stockings.  She bickers with her maid, makes peace between her two young children in the midst of an argument and tries her best to ignore her painfully conceited mother.  Taking a sexy fish-net top out of its box and putting it on without a brassiere, she stares proudly at herself in the mirror and says `Take a good look at me.  This is what I am.  Do you still want me for your wife?'  This is our heroine, the complete antithesis of Ms. Cannon's portrayal of Alice in Bob &amp; Carol &amp; Ted &amp; Alice. Julie is a woman who is untamed and sexually ferocious in isolated moments, but one who immediately closes up in the presence of her husband and `friends,' simply reacting to others solely because of her insecurity. She shakes her head politely and says things like `That's wonderful,' a complementary trait to her complicated emotional façade and a checkered past.  This is a woman with a crippling disability, if not debilitating-a character stunningly portrayed by the always gorgeous Dyan Cannon. We meet the Cannon character's husband Richard, is a fervently arrogant and chauvanistic heel, apathetic to his wife's and his children's needs. He makes snide comments about things like the `Third World Film Festival' and refuses the potential comfort from his wife to satisfy his fixed neuroses prior to a simple mole-removal operation.  He buys pet hampsters for his sons, stating cynically `I didn't grow soft.  I just want to make sure that if I die, I will generate enough guilt in my children to drive them into analysis.'  It is not at all true that he is a character totally devoid of feeling or Chekhovian balance, but it is essential to the film's structure that he be the vessel by which Julie's emotional façade is gradually deconstructed to reveal a startlingly free woman, ready to shed superficial friendships and a contradictory membership to a seemingly rich image of a rich society of people. The film's only rival in achieving the particular intention of demystifying a rich society's stance on outward appearance, or moral if you will, was to come the following year with Luis Buñuel's biting French-made satire THE DISCREET CHARM OF THE BOURGEOISIE.  When the film ended, as with most of Preminger's works, it left me breathless by the time of the final fade-out.  Indeed, the film could have definitely evolved into trite melodrama reminiscent of Harold Robbins, but Dyan Cannon's impeccable performance as a feeling woman wanting to break free of an emotional strait-jacket and Preminger's handling of an overwhelmingly challenging script are stunning-so stunning that I am shocked and dismayed that Oscar totally ignored the performance and the film itself.  Cannon's performance exhibits great pathos, ranging from tender to amusing to bitter to self-pitying to insecure.  I will give you an example of this versatility: the scene where the grand Ms. Cannon puts down `good friend' Jennifer O'Neill, not with malice but, as a fellow IMDB critic said, like a true lady.or the scene where, for once in her life, she responds to the egotism of her mother (Nina Foch), and lets her have it with a nice, easy intensity.<br><br>To end this analysis/rationale of this film's merit, I acknowledge the likes of critics like The Village Voice's Andrew Sarris and the New York Times' Vincent Canby.  They called the film `a breath of fresh air' and `superior, one of the year's ten best.'  Too bad the film, like so many other Preminger works (BUNNY LAKE IS MISSING, SKIDOO, TELL ME THAT YOU LOVE ME, JUNIE MOON just to name a few), has continued to go unreleased onto video and unshown anywhere.and finally to the people who could establish it as a cult classic. Besides a few scattered showings on eighties television, it has disappeared from everyone's memory.  Sad, sad, sad, sad, sad.","user":"kremer5","rank":[13,19]}]