[{"title":"Seek this out","rating":8,"date":"5 December 2005","review":"Sometimes the planets align and everything just comes together. Some likable but underused actors join up with a veteran (and really really old) director to film a script written by the author of some minor league films. This is the sort of recipe that more often than not ends up with a mediocre movie that is instantly forgettable but for whatever reasons They ended up producing one of the funniest teen comedies ever made.<br><br>A group of loser college students played by an all star collection of teen sex comedy stars including Tim Matheson and Stephen Furst from Animal House, Dan Monahan from Porky's and Sandy Helberg from History of the World Part 1 who,having their arms twisted by a corrupt Dean played by John Hillerman, agree to enter a dangerous raft race with the promise that victory will bring them un-earned degrees.<br><br>Excessive drinking, fart jokes and gratuitous nudity are just some of the pleasures that this movie provides for the viewer. It also features the smartest dog in the world (he does charades), a kick ass song by Cheap Trick and the gorgeous Jennifer Runyon (ghostbusters &amp; Charles in charge, I don't know which credit is more impressive) along with some great race footage and hilarious dialog. This movie is simply much better than it has the right to be.<br><br>All the people who complain that it is stupid miss the point. Of course it is stupid. Its moronic. Its dumb as dirt. It is also hysterically funny from start to finish. This movie reminds me in many ways of Weekend at Bernies another incredibly goofy movie that if approached in the wrong mood is virtually unwatchable. To avoid injury try not to think. Just sit back and let this movie wash over you.","user":"deheor","rank":[20,21]},{"title":"Up the Creek","rating":31,"date":"31 May 1999","review":"Sophomoric humor taken to the limit by Animal House alums Matheson and Furst as college misfits on a white water rafting race in the hope of bringing glory to their mediocre university. Slapstick gags, goofy all around...but good fun.","user":"Coxer99","rank":[11,12]},{"title":"Great Movie! At least a 9","rating":9,"date":"30 January 2006","review":"Up the Creek is right up there with my most liked movies. I'm crying for a DVD. What kind of sense of humor doesn't think \"Take no prisoners\" wasn't funny when the gals are \"going after It.\" The bazooka shooting at the noisy crow was funny. There is funny rolling over funny in this movie but maybe some of it is too sophisticated. Tim gets invited to Jenifer's room and after hellos she, lying on the bed in a loose robe says, \"Why don't you slip into something more comfortable?\" Tim retorts, \"I didn't brig anything more comfortable.\" She says pouting, \"Well, how about me?\" That is not only funny it might also be the hottest line I have ever seen in a movie. Sparks are popping all over the place like the gal cheerleader producing interest in the bored stands. I don't take this movie seriously except in the sense it is seriously entertaining.","user":"gordonporch","rank":[9,10]}]