[{"title":"One of the best....","rating":10,"date":"10 June 2006","review":"The Omen is one of the best horror films to have come out in the 70's. It isn't gory, it doesn't have sex, it is just plain terrifying. Everything about the movie contributes to feel of the movie. Jerry Goldsmith's Oscar winning score, the great acting, the cinematography and the scary as hell ending.<br><br>It's the 6th hour on the 6th day of the 6th month. Robert Thorn (Gregory Peck) has just found out his newborn son is dead. He can't let his wife Katherine (Lee Remick) know though, since it would devastate her. But when a priest offers him another newborn whose mother died, all problems are solved, they name him Damien.....<br><br>The Omen is one of my favourite horror films. When I first saw it, it scared the living hell out of me. The score, done by Jerry Goldsmith is now one of the most famous horror movie scores. It sets the mood and sends a chill up your spine. The acting is outstanding (especially Billie Whitelaw as Mrs. Baylock). Gregory Peck and Lee Remick are, as usual, fantastic. Billie Whitelaw is pretty much flawless as the evil nanny and Harvey Stephens, although he doesn't say much, is very good as little Damien.<br><br>The last thing that makes the movie scary are some of the most bizarre deaths. The most known of them is a decapitation which is one of the scariest deaths in horror history.<br><br>5/5.","user":"LoneWolfAndCub","rank":[37,40]},{"title":"One of the Best","rating":10,"date":"10 November 2001","review":"This movie plays with the intellect.  It is frightening for what is not seen.  From the grey overcast that blurs the skies of London and the dead stillness of the great Pereford mansion that houses the ill-fated Thorn family to the deepest recesses of civilization in the hollow underground of an ancient excavation site, the film effectively captures the viewer's interest and draws them into a world that is on the verge of the ultimate disaster - the birth of the anti-Christ.<br><br>\nBorn into the world of politics and wealth, little Damien Thorn is the darling of the beautiful and privileged Robert and Katherine Thorn. Mysterious accidents and the overall feeling of death begin to shadow their lives until the horrifying truth of Damien's birth is uncovered millions of miles away in a grave in a decaying pagan cemetery in Italy. Gregory Peck gives a fine performance as ambitious politico Robert Thorn, a man who slowly discovers that his fate is interlinked in ancient biblical prophecy. With escalating horror, he uncovers a grand design that's unfolding under the unsuspecting eyes of the entire world - and he and his perfect family are at the centre of it. His search for the truth is one of the best in films, taking him to the farthest reaches of the globe and climaxing in an exciting and bizarre confrontation between himself and the face of evil.<br><br>\nLee Remick is ethereal as his beautiful and tragic wife.  The rest of the cast - Billie Whitelaw as the creepy Mrs. Baylock, David Warner as the doomed Jennings and Leo McKern as the mysterious archaeologist Bugenhagen - give the movie its singular dark and moody quality.  THE OMEN has a few disturbing moments that shock rather than disgust, but the film is loaded with memorable scenes that are ingenious.  It's the 'feeling' that the film incites that makes this movie unique.  The haunted performances of the actors, the creepy-crawly musical score, the insinuation that doom is slowly creeping into the world with the birth of one lone child, all succeed in making THE OMEN one of the truest  horror films.<br><br>\nSometimes it's the knowing that something is going to happen that is more frightening than actually seeing it happen ...","user":"Christiancrouse","rank":[137,160]},{"title":"He's evil. Pure evil!","rating":8,"date":"24 March 2006","review":"Robert Thorn the American ambassador to Great Britain watches his wife's pregnancy when a priest tells him that his newborn has died, but he convinces him to substitute the baby (the wife not knowing) with another child that lost its mother in labour at the same time. Watching their young child growing up, he starts show unnerving signs, which the parents slowly start picking up on and also bizarre tragedies start occurring. This leads Robert on a whirlwind investigation that all points to his son being the Anti-Christ.<br><br>Right off the heals of 'The Exorcist' successful stint with moviegoers comes another one of those endless 70s religious themed horror flicks involving Satanism. 'The Omen', I'd definitely say is one of the better horror films in the shadow of \"The Exorcist', but I'll even go to say its an vast improvement over it's influencer. That might be a surprise for some, but I found this film superior as it was more entertaining, fascinating and truly creepy in its context and shocks. Everything about it has a knack for falling into place. From the impending doom that's achieved by its coldly layered atmosphere to a premise that teases the viewer on how it's all going to play out. I won't deny that it seems silly enough when you pay close attention to it all, but with such conviction in the performances and that off confident direction, these factors makes sure that it doesn't slip overboard into cheesy daftness. Another stroke of brilliance would be Jerry Goldsmith's memorably, nerve-wrecking score with those explosive chants scattered throughout.<br><br>On a grand scale the film was efficiently catered with well established cinematography and polished set-pieces that had penetrating might, which director Richard Donner handled with precise skill. Even when there wasn't much happening he knew how to keep things compellingly tight with good pacing and impressible imagery. Though, when it came to the essential thrills, he caps off some remotely tense (dogs' attack) and macabre moments (infamous decapitation) that display bite and flair. The climax is great and the ending is a fitting imprint too. The plot is filled with shocking revelations, interesting characters and it emits a glorious amount of excitement and dread from it mysterious outset.<br><br>The performances are that of top quality by a stellar cast. Gregory Peck and Lee Remick are convincingly excellent as Mr and Mrs Thorn. David Warner turns in a marvellous performance as the photographer Keith Jennings. Then Billie Whitelaw is genuinely creepy as Damien's nanny Mrs. Baylock. Patrick Troughton is superb as the withering Father Brennan. But my applause goes to Harvey Stephens' who's the epitome of evil well; he definitely looked the part and had a memorizing awe as Damien. Although, Peck deserves more credit really, as he brought such devotion to his character that we honestly feel the pain and confusion that hits home.<br><br>One of the true benchmarks of horror, along the same lines of 'The Exorcist', but for me it beats that film all ends up. Expect a devilishly good time!","user":"lost-in-limbo","rank":[72,82]}]