[{"title":"Once again, you can't trust the critics.","rating":8,"date":"3 February 2002","review":"John Huston's Victory has probably seen so much critical scorn it's mind boggling.  Is this movie Oscar material?  Certainly not, but it's a great film in many ways.<br><br>First of all, Bill Conti offers up a first rate uplifting musical score. It's outstanding work and you hear a bit of resemblence to the score he wrote for a 1982 film that received a little bit of notoriety -- The Right Stuff.<br><br>Next, the cinematography is simply gorgeous.  Soccer is not an easy sport to film and I think this film was done wonderfully.  I thought the choice of film stock, a certain amount of grain to make it almost like you're watching a documentary was a nice touch.  Some of the action shots and slow-mos are absolutely wonderful to behold.<br><br>Finally, we have a nice plot with a couple of surprises, a great cast, and an auteur director.  Certainly, Huston was in failing health and not at the top of his game by this time but his work on this film was still memorable. For me I will always remember the wonderful line with \"The Forger\" asking Hatch \"You don't want to get shot as a spy do you?\"  And the quick reply, \"No, I don't want to get shot as anything.\"  Simple one liner, uncomplicated, yet funny.<br><br>Victory is a great inspirational film, a sure hit for soccer fans (of course he wasn't offside - he was behind the ball when it was struck!) and a nice film for war buffs.  Just ignore Maltin et al and spend the time watching it, widescreen DVD recommended, you won't be sorry.","user":"wgfinley","rank":[64,71]},{"title":"\"Take me out from the ball game\"","rating":8,"date":"1 September 2006","review":"The script of this unusual war/escape movie was nothing special, and neither was the acting. Not surprising about the latter since half the performers weren't actually experienced actors. However I loved every minute of it, and thought it was great fun and terrific entertainment. Of course there are those who won't quite see it that way and will dismiss it out of hand. And they'd be perfectly sane to do so. Everything about \"Victory\" (aka \"Escape to Victory\" in the UK) says it's one to leave well alone.<br><br>Even if you disregard the lack of aesthetic qualities, and tut-tut over the reality of it all, it's worth watching if only to see again a few of the great past-masters of what the Brits like to call \"the beautiful game\" (i.e. soccer). And Sylvester Stallone as a goalkeeper is something to behold. <br><br>As far as escape stories go this is about as original as they get, but even here it's possible to see plundering from other story lines, i.e \"The Great Escape\", \"The Password is Courage\", \"Albert RN\", to name but three, and as at least one reviewer has pointed out, the music is extremely reminiscent of the first one.<br><br>One of my favourites snippets is that of the Nazi sports commentator, portrayed by Anton Diffring, that stalwart of war movies, broadcasting his gramophone record of enthusiastic crowd applause, when in \"reality\" the whole stadium was as quiet as the grave.<br><br>I think this is one of those rare occasions, if taken in the right vein, when a bad movie can be a crowd pleaser. Forget the war pundits, the realists and the purists. Just enjoy the movie for what it is. Tremendous fun!","user":"benbrae76","rank":[43,48]},{"title":"Great movie","rating":10,"date":"27 April 2005","review":"This a great movie for any football fan. A great set of stars from the 70's, Pele and Stallone as a funny goalkeeper. This is one of my favorite soccer movies. The storyline is not the best, but it is catchy. Now the way the stadium was set up, the noise, it feel really real. I would love to see a similar movie remade. Maybe a victory 2 with todays's stars. Some people do not like the idea of sly as a football player, I disagree, I think he playing the \"football-ignorant\"american is good. Now I also think that the way the soccer players acted was very realistic. In special Pele was good. I know many friends in many countries outside the USA who just love this film.","user":"dantt777","rank":[53,61]}]