[{"title":"Historical perspective","rating":15,"date":"15 July 1999","review":"I first saw \"The Alamo\" in 1960 and loved it.  I loved it for several reasons, one was because like countless other kids {I was 11} I had been raised on Fess Parker's treatment of Davy Crockett and was fascinated by the story and two I've been a John Wayne fan since I can remember.  I have copies of both the theatrical and the uncut versions.  I prefer the theatrical because I feel that the scenes that were cut were unnecessary and in some cases tedious and painful to watch.  Historically speaking the movie was a hit and miss affair but that's okay with me because as a package it was a direct hit on the action sequences and since that basically was what the Alamo was about I can forgive the inaccuracies. Some of the most glaring; the battle was over just before dawn on a rather cold day {the temperature ranged between the 30's and mid 50's and was probably on the low end of that spectrum at that time of day} and yet the movie shows up bright blue cloudless skies and the participants in less than cold weather attire,; the film portrayed Bowie as being in bed because of a leg injury suffered in a fall from his horse later aggravated by shrapnel during a bombardment when the truth was that he was sick.  He had practically drunk himself to death for 3 years because of the loss of his wife and children to cholera and probably had TB.  On that note the movie shows Bowie receiving the news during the siege.  Another case of license. On the other hand the film was accurate in a lot of cases too, for example, the locations of Travis and Bowie at the times of their deaths and depending on whether you believe that Crockett fell where Suzanna Dickinson and several others said they saw him or that he survived the battle with five others only to be executed we may be able to make a case for his actual location too.  But the most wonderful example of historical fact is in the location of the filming. This was a painstakingly assembled replica of the area and is breathtaking in its realistic appearance.  There was one fact that was mistreated, though, that took me some time to accept as dramatic license.  James Butler Bonham {Patrick Wayne} reports to the garrison that Col James Fannin and his men will not be reinforcing them because the were \"ambushed, murdered\".  This is sort of true but not until after the Alamo had fallen.  The fact was that Fannin had started out to reach the Alamo but while still within view of his own garrison at Goliad he had a wagon break down and some oxen run off and by the time he repaired those problems he changed his mind about going and returned to his command.  He and his men were captured and about 600 of them, including Fannin, marched into a river and shot down. All things considered though I can still watch this movie again and again 39 years later.  Besides, who can deny that the opening credits complete with some of the most beautiful music in cinematic history {Dimitri Tiomkin} constitute one of the most unforgettable movie beginnings of all time? I think I'll go watch it right now.","user":"sticks-8","rank":[20,23]},{"title":"John Wayne's Massive Tribute to Texas Terrific!","rating":8,"date":"18 November 2000","review":"Viewed as history, John Wayne's epic production of 'The Alamo' is as full of holes as Swiss Cheese (the final battle actually lasted less than an hour, in the pre-dawn darkness of March 6, 1836; current scholarly consensus is that the historical Crockett attempted to surrender, at the end of the furious onslaught, but was executed), but just as Wayne mentor John Ford never let 'the facts' interfere with a good story, first-time director Wayne wanted to tell a tale of larger-than-life heroes, taking a stand for what was right, and being willing to die for that cause. It was a firm belief in these truths that pushed Wayne into investing over ten years of his life, and much of his personal fortune, in telling this story, and 'The Alamo' was, and is, a triumph.<br><br>The film can really be broken into two distinct parts; the first part introduces the characters, providing insights into their personalities, and tells a melodramatic tale of a beautiful woman (the radiant Linda Cristal), being forced into an unwilling relationship with an evil, profiteering Texan, who is rescued by the plain-spoken and heroic Davy Crockett, as portrayed by Wayne. The story bears similarities to 'The Fighting Kentuckian', a Wayne vehicle of twelve years earlier. In this version, however, Wayne doesn't 'win' the girl, but gives her a rather preachy speech about patriotism, and doing what's right, and sends her on her way.<br><br>Despite a terrific fight scene between a bunch of the Texan's henchmen, and Crockett and Jim Bowie (portrayed with easy charm by Richard Widmark), this first part drags, a bit, and seems contrived to allow Wayne to air his political beliefs. Bear with it, though, because when the action moves to the mission/fortress of the Alamo, for the second half of the film, Wayne's talents as a director truly shine.<br><br>The story of the 13-day siege between the Alamo's 187 defenders, and General Santa Anna's 6,000-man army, has NEVER been told on a grander scale than in the John Wayne version, and the uncut edition of the film is presented in a wide-screen format, which allows the viewer to really share Wayne's vision. With a nod to the fact that the Mexico of today is a staunch ally (several characters make a point of saying how 'proud' they are of the Mexicans, even as the two forces are killing each other!), the story flows between exciting 'victories' (stealing the cattle, spiking the Mexican cannons), and an understanding of the inevitable conclusion (defined by Lawrence Harvey, as Travis, in the memorable 'sword in the sand' scene). Harvey's Travis is the best-realized of the film's many characters; he brings a humanity to the complex, driven commander, growing from someone insensitive to others, into a leader who earns everyone's respect.<br><br>Wayne used thousands of Mexicans as extras in the film, which gives the viewer a far greater sense of the magnitude of the siege than Republic's 'The Last Command' or Disney's 'Davy Crockett' ever could. The battles, particularly the final one, as row after row of Mexican foot-soldiers overrun the pockets of defenders, are unforgettable! Each character is allowed to die heroically, and is given a lingering moment to make a final gesture (Travis breaks his sword over his knee as Mexicans surge past, Bowie fires his unique gun, a brace of pistols, and swings his famous knife, Crockett, bayoneted to a door, still manages to pull free, and torch the magazine). The film's climax, alone, would make the film a 'must' for any action fan.<br><br>The cast includes many well-known character actors and long-time Wayne friends, including Ken Curtis as Lt. Dickinson, Travis's adjutant; Chill Wills as the most outspoken of Crockett's men; Guinn 'Big Boy' Williams, Denver Pyle, Chuck Roberson, and many others, as defenders. Wayne's son, Patrick, has a small but visible role as James Butler Bonham, the famous Alamo dispatch rider, and his daughter Aissa plays the Dickinson's child, Angelina.<br><br>'The Alamo', for all it's faults, is a magnificent spectacle, monumental in scope. It is a fitting tribute to it's star/director, and an ESSENTIAL part of any John Wayne collection!","user":"cariart","rank":[54,69]},{"title":"The 'Battle Cry' that broke Santa Anna's back!","rating":8,"date":"2 July 2000","review":"John Wayne's directorial tribute to the struggle for \"The Alamo\" symbolized the spirit of resistance of a small group of determined fighters for Texan independence from Mexico...<br><br>Texans established a provisional government in 1835 and appointed Sam Houston (Richard Boone) commander in chief of their army... There followed a seesaw battle for control of San Antonio, including the ill-advised defense of the Alamo by a force of fewer than 200 Texas volunteers... General Antonio Lopez De Santa Anna was determined to take this key location in order to impress upon the Texans the futility of further resistance to Mexican ruler...<br><br>After a 13-day siege, every fighting man perished under the onslaught of 7,000 Mexican troops... Among the fallen defenders were Cols. William B. Travis, James Bowie and the legendary Davy Crockett... Only Mrs. Dickinson (Joan O'Brien), her little daughter and a black boy survive to provide the eyewitness story of the Siege and the Battle of the Alamo...<br><br>John Wayne portrays Davy Crockett, a frontiersman and politician, who saw the future of an independent Texas as his future and he loved a good fight... Crockett and his brave combatants - the Tennesseans, expert marksmen, held their position until death... <br><br>Richard Widmark is cast as Colonel Jim Bowie, a reckless adventurer, known for his famous 'Bowie knife'. Bowie has come to fight for Texas independence with a small force of volunteers. He had strong personal friction with Travis which threatens to develop into a private war... The difference in their personalities resulted in the two men sharing a somewhat antagonistic competition for command of the entire garrison... On one point they did agree: \"The Alamo\" is the most important stronghold of Texas... <br><br>Laurence Harvey plays Colonel Travis, \"the grand Canyon of Texas,\" who arrives with 25 men to establish the first line of defense against Santa Anna... Travis is a disciplinarian officer who commanded the Texas defenders during the siege and battle of the Alamo, a genuine hero who anticipated a battle to the death, a polite gentleman who gave the men an opportunity to retreat with honor the ill-fated garrison but explained how important their defense of the Alamo is... His appeal from the Alamo of reinforcements becomes an American symbol of unyielding courage, heroism and self-sacrifice... Travis high moment in the film was when he fired his answer to Santa Anna with a cannon blast: Victory or Death!<br><br>With its seven Oscar nominations, including the Oscar-nominated hit song \"The Green Leaves of Summer\" and a superb score written by Dmitri Tiomkin and song-writer Paul Webster, and featuring some of the most spectacular battle sequences ever seen, \"The Alamo,\" - a sacrifice on the altar of liberty - becomes the 'Battle Cry' that broke Santa Anna's back...","user":"Nazi_Fighter_David","rank":[59,77]}]