[{"title":"The Monkeys Have No Tails in Samboango","rating":10,"date":"22 November 2000","review":"Wayne and Ford at their peak.<br><br>Somehow I missed this film until a few years ago on a cable movie channel. Growing up with WWII as the dominant theme of modern history and an appreciation of the older film stars, this film is without question the most realistic in terms of the message and of just passed events with superb performances in the old morality style of the 40's.<br><br>The old Navy, surviving in the Asiatic backwater where promotions could take years, bears the brunt of the onslaught of total war for America. A heroic tragedy of holding the line to bide time for the Nation to recover.<br><br>A story for all time, the greatest war movie of all time. No matter how large the budget and digital special effects, they will never capture the texture and feel of this film. The dying of the old Navy from Yangtze to Cavite with gutsy sailors like \"Boats\" living hard in the backwater paradise of the Pacific on $20 a month.<br><br>The tragedy of continuing defeat, overwhelming catastrophic events, the ill prepared Nation, the dying of the old Navy, all combine to make this film, made with event still fresh in the actors and film makers minds, a statement of that war and of the heroes which the audience knew first hand. It says, we knew these men and boys and they were as fine a heroes this country has ever produced and they will live larger than life for as long as this film exists.","user":"tlc75372","rank":[92,102]},{"title":"Geography Made Them Expendable","rating":8,"date":"13 March 2006","review":"They Were Expendable is John Ford's first Hollywood feature since his discharge from the U.S. Navy and the same can be said for Robert Montgomery. Both had served in the Navy and Montgomery in fact on P.T. Boats. From the last presidential election we now know them as Swift Boats. <br><br>It's an unusual John Ford film because the usual heavy comedic monkeyshines are rather subdued here. I'm thinking that John Ford wisely decided that World War II being recently over, the country's mood was joyous, but somber in terms of the heavy human cost.<br><br>They Were Expendable has the benefit though of the American audience knowing the ultimate victory. The story begins in the Phillipines in 1941 with Robert Montgomery as real life naval hero John Bulkeley, renamed Brickley for the film, trying to convince the brass of the usefulness of the P.T. Boat in combat, not just for scouting and courier duty. Of course that experiment is cut short and the P.T. Boats and their crews are rushed into some on the job experience.<br><br>During the film MacArthur, you might recall Gregory Peck saying that he was going to be evacuated from Corregidor by \"one of Johnny Bulkeley's torpedo boats.\" That scene is dramatized as a wordless Robert Barrat plays MacArthur traveling on the boat commanded by John Wayne.<br><br>Wayne is Montgomery's second in command of the P.T. boat squadron who is not thrilled to be there. He'd like to be on at least a destroyer. He gradually comes around though. He also gets a fling in the romance department with Navy nurse Donna Reed.<br><br>During that interlude John Ford had some of the crew outside singing Dear Old Girl in a comic vein. Ford was never one to not let a good bit of business die with one film. You might remember in Fort Apache and Rio Grande there was some serenading done. And Donna Reed got serenaded on her \"Hawaiian\" honeymoon with James Stewart in It's a Wonderful Life with Ward Bond once again being one of the serenaders. I'm sure Frank Capra would have conceded he stole that from Ford.<br><br>The story is first and foremost about some very desperate American armed forces who after Pearl Harbor were at the Japanese mercy. Pearl Harbor had totalled our Pacific fleet and no supplies could get through. Still the troops there fought on bravely, they were in fact by geography expendable. <br><br>Wayne and Montgomery give good but subdued performances. No do or die heroics here, just a sobering reminder of a terrible beginning for the Americans in the Pacific theater of World War II.","user":"bkoganbing","rank":[76,85]},{"title":"A film about following orders no matter how painful","rating":31,"date":"31 January 2002","review":"One reveiwer critices this film about lack of action he misses the point,all the characters are well developed which makes the ending so painfull. The acting is first rate every part is played with a great belief,,there are so many great scenes that touch the heart.The men are bonded together by their actions and when the bonds are broken through death or orders it hurts us all. Donna Reed is gorgeous to look at ,only a small role but well acted. At the end of the film you feel a lump in your throat and a tear forms in your eye,I love this movie.9/10","user":"chisum","rank":[50,55]}]