[{"title":"Vincent Price is Legend!!","rating":20,"date":"20 February 2002","review":"I'm not sure why this film is as underrated as it is.  This is an amazing, depressing and in many ways brilliant film based on the Richard Matheson classic novel \"I Am Legend\".  Vincent Price effectively conveys the terror and despair of being the last living man on an Earth that is now overrun with vampires and/or zombies.  The depiction of Price's day to day bleak existence is a moving and powerful thing to behold and the continual menace of the hordes of zombies is creepy in the same way as was later depicted in \"Night of the Living Dead\".  In fact, as noted by others here, one can not watch the scenes where the zombies lay siege to Price's boarded up house and attack his car without recognizing how close these scenes would later be copied by George Romero in his classic zombie films.  If you are a fan of horror film history or just looking for a classic and unique film with an interesting story, track down this lost gem.","user":"kdruhm","rank":[145,161]},{"title":"An under-appreciated classic","rating":7,"date":"6 September 2002","review":"This one seems to be less well known than others in Vincent Price's filmography -- possibly because the title makes it sound more like a romantic comedy.<br><br>In this first filmed version of Richard Matheson's superb short novel \"I Am Legend\", though, Price really shines in one of the best performances of his career. Far superior to its 1971 remake \"The Omega Man\" -- as if we needed yet another \"Charlton Heston vs. the subhuman hordes\" outing after \"Khartoum\" and \"55 Days In Peking\" -- the script follows Matheson's book almost scene-for-scene, but then, I think the author always wrote with one eye on the movie or TV rights.<br><br>Morgan (Vincent Price) is the only survivor of a worldwide plague that kills its victims, only to resurrect them as zombie vampires. (His own immunity was conferred by the bite of a vampire bat infected with a weaker version of the virus, when he was doing research in South America.) By day, he systematically searches out the plague victims and destroys them in the traditional Van Helsing manner, retreating to his fortified house when darkness falls and the vampires come out to play. Worst of all, his best friend Ben -- now a vampire -- is part of the crowd that nightly besieges his house, thirsting for his blood.<br><br>Unlike \"The Omega Man\", very little of this film is devoted to Morgan's one-man war against the vampires, who as others have noted have a kind of \"Night Of The Living Dead\" ambiance, minus the gore. Instead it focuses on his utter isolation, both physical and spiritual, his mission as an exterminating angel the only purpose now left to his life.<br><br>A large part of the movie is taken up by a flashback to three years previous, to the beginning of the plague, as his friend Ben arrives at a birthday party for Morgan's daughter bearing an armful of presents. Against the background of the children's shouts and laughter the adults worriedly discuss the appearance of a new virus. The world then proceeds to fall apart in a quietly terrifying re-enactment of the Black Death, complete with National Guard \"bring out your dead\" units and a 24/7 immolation pit for the anonymous, canvas-wrapped corpses. Morgan's wife and daughter succumb to the virus in a sequence that is quite stunning in its low-key, almost clinical lack of the standard histrionics. <br><br>The black-and-white cinematography is as stark and minimalistic as the story (and, admittedly, the budget). The exterior scenes set in a deserted Los Angeles -- well, actually Rome, shot in the early morning -- are often quite effective in mirroring his internal desolation. Cast and crew alike do an excellent job with the material, despite the monetary constraints. Unlike so many in our current \"bash you over the head\" school of film-making, the real horror of the situation is allowed to speak eloquently for itself.<br><br>If you're expecting the high camp of one of Price's Roger Corman flicks, you'll probably be bored stiff by this movie. If instead you're looking for a surprisingly good adaptation of a great story, you can't do much better than \"Last Man On Earth\".","user":"henri sauvage","rank":[127,145]},{"title":"\"I am the last...man.\"","rating":1,"date":"1 May 2002","review":"The Last Man on Earth is a great film to watch alone. Horror veteran Vincent Price plays Dr. Robert Morgan, a desperate and lonely man who's left alone in an apocalyptic world; A world ruled by zombie-like vampires as a result of a widespread plague. These vampire zombies are highly reminiscent of George Romero's walking dead in Night of the Living Dead. Price does a remarkable job interacting with practically nothing. He's alone throughout the majority of the film. His performance largely carries this low budgeter. When you watch the movie alone, you really feel where his character is coming from and a sense of hopelessness is established. The Last Man on Earth is really a thought-provoking, creepy classic. I recommend it be watched with Charlton Heston's The Omega Man to see another take on the same story (both were based on Richard Matheson's \"I Am Legend\").","user":"Backlash007","rank":[103,123]}]