[{"title":"Enjoyable, but not total fun","rating":6,"date":"15 May 2001","review":"The Mirisch company should have tried harder. It is bad enough having an Inspector Clouseau movie without Peter Sellers, but why no Blake Edwards to direct or William Peter Blatty[A shot in the Dark] to script? Instead we have a rather clever and better looking than Clouseau should be, in the shape of Alan Arkin and a rather boring director in Bud Yorkin. The problem itself is with the script which is unoriginal, tedious and not in the least bit funny. Served with a good script Arkin would have become an adequate Clouseau, but still not as funny or entertaining as Peter Sellers. This is like someone else trying to play Frank Spencer or Rigsby, from british television. Despite this Arkin is at times quite good for the film, wich does have its moments. But i suppose the lesson to be learned is if it aint broke dont fix it. If you haven't seen any other Clouseau movies then you will like this i am sure. Otherwise hunt down A shot in the Dark or The Pink Panther Strikes Again. A total waste!","user":"Dock-Ock","rank":[18,23]},{"title":"Pitiful","rating":3,"date":"15 January 2003","review":"Comparisons between Alan Arkin and Peter Sellers may be unfair, but let's face it, there's no way they're not going to be made, and when they are, Arkin unfortunately comes out on the short end of the stick. Sellers is so closely identified with the role of Jacques Clouseau that it's doubtful if ANYONE could have succeeded in playing him. Arkin actually wasn't a bad choice, though, when you get down to it. His comic talents have been proved time and again, he bears a close enough resemblance to Sellers to make die-hard Sellers fans comfortable, and the script is by two veteran \"Pink Panther\" writers.<br><br>So why is it such a complete dog?<br><br>Much of the blame can be laid at the feet of director Bud Yorkin, who completely botched the job, but the script is no prize, either; maybe the Waldmans didn't have their heart in it because Sellers wasn't doing it (or maybe Sellers and/or Blake Edwards had more input into the scripts of their films than anyone realized). Part of it is that Arkin doesn't have anyone of the caliber of the great Herbert Lom as Inspector Dreyfuss to work off of, or even a top-notch character actor like Graham Stark as Hercule, Clouseau's much-put-upon assistant. But I think a lot of the reason is, unfortunately, Arkin himself. Sellers' Clouseau was a catalyst for the disasters that inevitably befell him; he CAUSED most of his own problems without ever realizing it. To him they were just minor setbacks on the way to solving the case he was working on, because he was so thoroughly convinced of his own abilities--which, as we all knew, were virtually nonexistent--that he knew beyond a doubt he would solve the case and become the hero, which he usually did. You felt comfortable laughing at Sellers' Clouseau because, for all his bluster and misplaced conceit, you actually liked him. That's where Arkin's Clouseau fails. Whatever he is, he's not likable in the way that Sellers' Clouseau was, and doesn't engender the affection and sympathy the audience had for Sellers' Clouseau, despite his many failings.<br><br>While James Bond can go through several different actors' characterizations of him, there's really only one Inspector Jacques Clouseau, and that's Peter Sellers. Arkin tried, but he just couldn't do it. He shouldn't feel too bad, though; I don't think anyone could have.","user":"frankfob","rank":[29,41]},{"title":"Not bad, but not Sellers","rating":6,"date":"1 April 2003","review":"I guess it would be redundant at this point to say Alan Arkin's Clouseau can't touch Peter Sellers, which is certainly true. Nevertheless, I admit I liked this movie (though a lot less than the Pink Panthers, of course), the plot is actually credible and there are some truly funny moments.  I give Arkin credit for attempting a role heavily identified with another- and better- actor, and he's OK in it.  It's not a total disaster, as some people have claimed and worth watching, if only for the comparisons. ** 1/2 out of 4","user":"rcraig62","rank":[14,18]}]