[{"title":"The Chuck Barris vanity project.","rating":27,"date":"27 February 2004","review":"I always wanted to see The Gong Show Movie. As a kid, I was a big fan of Mr. Barris. I wanted to grow up to be just like him. He represented the ultimate in manhood.<br><br>Made near the end of the Gong Show's run in 1980, Chuck Barris made a critically lambasted vanity project about how much \"fun\" it was being the host of the program. Unlike Mariah Carey's \"Glitter\", Chuck Barris wasn't trying to make a masterpiece. He pretty much portrays a week in the life of himself. You get to see the \"talented\" contestants attempts to impress him to get a chance to appear on T.V. (some of whom were deemed too racy for the 1970's so this R-rated movie showcases performances that never aired). Wherever he goes, he runs into people who were smart enough to know that having zero talent was good enough to appear on The Gong Show; everyone is trying to audition for him on the spot with some zany numbers. Cameos by just about all his favorite judges appear (I liked Rip Taylor's hilarious role as a waiter) and there are some amusing numbers; especially the showstopper \"Don't Get Up For Me\". Although it's not a very good film, it's great to finally be able to see a time capsule of one of the most off-beat programs ever aired on the boob tube. My next wish: I want too see the \"Best Of The Gong Show\" on DVD. Now!<br><br>BTW, it was great to see \"The Unknown Comic\" again. The idea of putting a paper bag on your head while cracking horrid jokes was pure genius. I think he even had his own movie made in the mid-80's, too.","user":"BlackJack_B","rank":[11,11]},{"title":"Gene, Gene, The Reviewing Machine!","rating":5,"date":"10 September 2004","review":"Chuck Barris has had a most curious, yet successful, career in TV - creating some of the best of what would now be known as the first \"reality\" game show programs. He has even been the subject of a not-quite-weird-enough bio-pic \"Confessions of a Dangerous Mind\" (George Clooney directing the pitch-perfect Sam Rockwell from an interesting, though downbeat script by the awesome Charlie Kaufman)- but probably nothing rates as odder on the Barris gong than THE GONG SHOW MOVIE. <br><br>Barris plays himself in this underplayed curio about the strife of being Chuckie-Chuckie-Chuckie. The film seems to veer back and forth from being a behind-the-scenes expose of the nightmare it was for Barris to create, host and syndicate the wonderfully bizarre \"Gong Show\" TV series and a dour, serious filmed autobiography of the troubled, creative genius. Barris, as himself, seems to absolutely hate the Gong Show phenomenon he has created for himself, and overtly resents its mind-numbing success. As a reader coming in from the understanding of his Dangerous Mind \"autobiography\", it helps flesh out his malaise.<br><br>Directed by Barris and co-written by Robert Downey, Sr., the movie is observant and quite crude, rough and documentary-like, but unfortunately the viewer is left on the outside looking in and cannot celebrate the symphony of bizarreness that Barris created. We end up hardly laughing at the desperation and sadness that Barris conveys of his situation throughout the film. Though the show was a otherworldly treat in the most 70's, low-brow yet knowing way - the film (accurately?) portrays The Gong Show as a meat factory that just exists to churn out awful acts at the behest of it's self-loathing court jester/master of ceremonies and B-list jury of peers - and served up to its junkie audience who can't get enough.<br><br>This is a most unusual and somewhat fascinating portrait of the 1970's, and is probably easier enjoyed by those who can appreciate the cutting-edge nature of the production, and less by those who are seeking a filmed-version tribute of the cult classic TV show. Ultimately, the balance of self-examination and flat-out appreciation of the cancelled show is off-whack - but should only be seen through the eyes of knowing what you are about to see isn't what you ultimately THINK or hope you are about to see. I would have gladly wished to see Barris mock the acts, guests and surrounding sycophants with a bit more outer vengeance than the implosive, introspective tact he takes on here. But ultimately what's here isn't totally without the familiar faves - there's also The Unknown Comic, Rip Taylor, Jamie Farr and Jaye P. Morgan (and her uncensored breasts). By the way - look for Saturday Night Live's Phil Hartman in a bit part!<br><br>Pulled from release just days after it's initial opening date by Universal in 1980, and heretofore unavailable on video or DVD (unless you find it on eBay), I would recommend this lost piece of cult nostalgia for those truly interested in seeing an almost-honest, partially laugh-free, docu-drama wrapped around one of the most inherently cultural, whimsical touchstones of the me-generation. <br><br>By the way Universal - I WOULD BUY THIS DVD. Just in case you're reading this... maybe you and whoever owns the rights to the TV show (Sony?) could get together on this? <br><br>BACK WITH MORE... STUFF!!!","user":"britishdominion","rank":[22,25]},{"title":"A Great Flick for Gong Show Fans","rating":10,"date":"6 December 2003","review":"Actually, it's a MUST see for Gong Show fans.<br><br>The film is uneven, but there are some excellent scenes such as the hospital scene.<br><br>Plus, you get to see Gong Show rarities like the popsicle twins and Jaye P.'s unsheathing.<br><br>Note that 30% of the voters (so far) have given this film a 10 and about 30% have given it a 1 !","user":"marc-151","rank":[6,6]}]