[{"title":"Outstanding Henry James Adaptation","rating":10,"date":"28 April 2007","review":"Certainly among the finest literary adaptations, \"The Heiress\" was based on Henry James's novel, \"Washington Square\" and features arguably Olivia de Havilland's finest screen performance. Morris Townsend , a handsome young man with ambiguous motives pursues Catherine Sloper, a plain spinster, who is slightly past marriageable age and possesses limited social skills. The young woman, who is the heiress of the title, is vulnerable prey for a penniless fortune hunter.<br><br>However, Montgomery Clift plays Townsend in an enigmatic manner, and viewers can debate his true intentions. Catherine's father, played by Ralph Richardson, and her Aunt Lavinia, played by Miriam Hopkins, take opposite sides in Townsend's pursuit of Catherine. Although both her father and her aunt appear to see through the handsome suitor, Aunt Lavinia is practical and sensitive to her niece's emotional needs, and she counsels compromise in pursuit of happiness, if only fleeting. However, Catherine's father is unyielding and essentially unloving in his opposition to the match. Throughout, Dr. Sloper compares his daughter's virtues to those of his late wife, and Catherine comes up lacking in every quality that he values. Sloper threatens to disinherit his daughter if she marries the suitor.<br><br>Montgomery Clift may appear shallow and transparent to some, but in essence those are the traits of his character. While Morris is slick and obviously fawning, he is not intelligent enough to be totally deceptive. Only someone as naive and needy as Olivia could fail to grasp that Morris may want something more than her love. Olivia de Havilland transcends her other performances and skillfully and convincingly evolves from a shy, introverted girl into a strong, vengeful woman. De Havilland has often portrayed women who appear genteel and soft on the outside, but whose hearts and backbones can harden into pure steel (e.g. Gone with the Wind; Hush, Hush, Sweet Charlotte), and Catherine Sloper is the finest of those roles. With able support from Richardson and Hopkins, Clift and de Havilland make the most of an outstanding screenplay, which was adapted from a stage play. William Wyler directs with a sure hand, and the atmospheric cinematography captures 19th century New York life. Period films are often unraveled by their hairstyles, which generally owe more to the year in which the film was made rather than that in which the story is set. However, even the coiffures excel in \"The Heiress.\" De Havilland's hair looks authentic 19th century and underscores Wyler's fastidious attention to detail.<br><br>With an award-winning de Havilland performance, a handsome Montgomery Clift on the brink of stardom, and an engrossing Henry James story, \"The Heiress\" is one of the finest films of the 1940's. Without qualification, the film holds up to and merits repeat viewings if only to better argue the underlying motives of Clift and the fateful decision that de Havilland has to make.","user":"dglink","rank":[97,98]},{"title":"\"Her father had broken its spring . . .\"","rating":10,"date":"29 May 2006","review":"One of my favorite movies, based on one of my favorite books. Henry James sitting in the audience would have been proud of this insightful filming of his novel, \"Washington Square,\" because the film retains so much of the subtlety of his own writing. Usually, Hollywood eliminates any of the subtlety of a great author's voice (see the recent remake of \"Washington Square\" if you want to see a real Hollywoodization of a novel – it actually depicts a young Catherine peeing her pants in public – an inane \"Animal House\"-type Hollywood requirement that degrading a woman by showing her peeing is an erotic boost for any movie). But \"The Heiress\" is pure James. Olivia de Havilland is perfect as James' unlikely heroine, going from an awkward gawky girl eager to please her beloved father, to a simple, loving young woman who steadfastly stands by her lover, to an embittered middle-aged woman who understands that, as Henry James says, \"the great facts of her career were that Morris Townsend had trifled with her affection, and that her father had broken its spring.\" <br><br>If you liked this movie, read the novel. Listen to James' descriptions of Catherine and her father and see if this isn't exactly what Ralph Richardson and Olivia deHavilland portrayed: <br><br>\"Doctor Sloper would have liked to be proud of his daughter; but there was nothing to be proud of in poor Catherine.\" <br><br>\"Love demands certain things as a right; but Catherine had no sense of her rights; she had only a consciousness of immense and unexpected favors.\" <br><br>\" 'She is so soft, so simple-minded, she would be such an easy victim! A bad husband would have remarkable facilities for making her miserable; for she would have neither the intelligence nor the resolution to get the better of him.' \" <br><br>\"She was conscious of no aptitude for organized resentment.\" <br><br>\"In reality, she was the softest creature in the world.\"<br><br>\"She had been so humble in her youth that she could now afford to have a little pride . . . Poor Catherine's dignity was not aggressive; it never sat in state; but if you pushed far enough you could find it. Her father had pushed very far.\"<br><br>Clifton Fadiman, in his introduction to \"Washington Square,\" says that the novel's moral is: \"to be right is not enough. Dr. Sloper is 'right'; he is right about the character of Townsend, he is right about his own character, he is right about the character of Catherine. But because he can offer only the insufficient truth of irony where the sufficient truth of love is required, he partly ruins his daughter's life, and lives out his own in spiritual poverty.\"<br><br>Dr. Sloper's contemptuous \"rightness,\" penetrating and accurate as it is, is no substitute for the kindness and love his adoring daughter craves from him. In \"The Rainmaker,\" a great Katharine Hepburn movie, also about a plain woman seeking love, only this time with a loving father, the character of Hepburn's father sums up this moral that \"to be right is not enough\" when he says to his self-righteous son: \"Noah, you're so full of what's right that you can't see what's good!\"","user":"eadoe","rank":[51,53]},{"title":"Fantastic Film, fantastic Olivia!","rating":3,"date":"3 December 2004","review":"I saw this film about 10 years ago and have never forgotten it. Why it is not available on DVD - I just don't understand it.<br><br>Olivia de Havilland is heart-breaking as the woman who is so badly treated by her suitors and her father. I felt the portrayal of her father and the cruel way he treats her was so well played out and you could see how her soul is slowly being crushed. <br><br>I was so amazed and touched by the film, I went and got the book it is based on, Henry James' Washington Square. It was superb but nothing will make me forget the look on Olivia De Havilland's face at the end of the movie where you can see her features harden and all her youthful sweetness is gone. <br><br>Brilliant film!","user":"sarahlouise77","rank":[68,74]}]