[{"title":"Politics and UFOs make VERY uneasy bedfellows","rating":7,"date":"17 July 2001","review":"It is common to bash this 1980 sci-fi/conspiracy movie for its admittedly not-top-notch special effects and pretty much everything else; the limited budget has a lot to do with it.  But with the exception of the 1978 film CAPRICORN ONE, nobody else was trying to mix the two elements (sci-fi and conspiracy) together for the big screen.  In essence, HANGAR 18 can indeed be said to presage \"The X Files\" by a decade and a half.<br><br>The film begins with two astronauts (Collins, Hampton) encountering a UFO in orbit while launching a military satellite.  The satellite collides with the UFO, causing an explosion and killing a third astronaut in the cargo bay who had been watching the satellite's progress.  But the UFO makes a surprisingly controlled landing in the Arizona desert, thus necessitating its quick removal and forcing the president's chief of staff (Vaughn, an absolutely steely performance) to concoct a cover story to avoid serious damage to his boss's chances for re-election.<br><br>Naturally, both Collins and Hampton are fingered by Vaughn and his staff for blame in the incident.  This forces them to gather hard evidence to clear themselves, but it also means that they'll be pursued by government agents the entire way.  Meanwhile, at Hangar 18, located at an air force base in Texas, a team of scientists, led by McGavin, are learning everything they possibly can about the UFO and its alien occupants.  What they find about those aliens is how uncannily similar they are to humans.<br><br>Despite the film's technical imperfections, HANGAR 18 is still a pretty good and speculative science fiction film from Sunn Pictures, the same Utah-based film company that was known for making speculative documentaries during the 70s and early 80s.  McGavin is at his usual best, as he was in the 1972 TV film THE NIGHT STALKER.  In terms of plot, HANGAR 18 seems to use Watergate as a starting point and then mixes in elements of Kubrick's 2001: A SPACE ODYSSEY and Spielberg's CLOSE ENCOUNTERS OF THE THIRD KIND.  And although it is hardly on a level with those two great movies, it nevertheless works because of the approach it takes to the debate not only over UFOs in our present day but also the possibility that visitors from another world have visited Earth before.","user":"virek213","rank":[40,42]},{"title":"Thumbs Up From Me!","rating":7,"date":"8 July 2004","review":"Lots of bad press here for Hangar 18, but I was pleasantly surprised with its taught yet somewhat far-fetched script, believable acting(not grandiose by any standards), and fast, compelling pace. Sure, this is a lot of hokey sci-fi stuff about the government hiding an alien ship, discrediting astronauts to save one man's election, and eventually...well, can't say too much more without letting the proverbial cat out of the bag. I guess it is out of the realm of possibility that OUR government would do any of those terrible things? For a feature film, its budget is rather...OK, very small.<br><br>The film definitely has the look and feel of one of those good 70s television movies on a Friday or Saturday night. Gary Collins and James Hampton play the astronauts out to prove they have been set up after witnessing a spaceship whilst sending a satellite into orbit. Both actors are competent if nothing else in their roles. Throw in Robert Vaughn, William Schallert, Joseph Campanella and some other luminaries from the small screen. All the actors do competent jobs. The big acting bonus is Darren McGavin as the man in charge of learning about the alien spacecraft. McGavin plays the role with great credibility. Anyone else notice his Kolchak swagger and sneakers throughout the film? Hangar 18 more than anything for me made me think about certain things. The story has just enough juice to be almost profound at times. Now, I know it has cheesy effects...the aliens look like slimmed-down versions of Uncle Fester, but there are a lot of big budget sci-fi films that never generate any thought. Did you see The Matrix III?","user":"BaronBl00d","rank":[35,42]},{"title":"One of the first \"trust no one\" flicks.","rating":7,"date":"26 April 1999","review":"This movie is the first \"government conspiracy\" flicks I ever saw and frankly it spooked me at the time. The story about the accidental encounter with aliens and the consequent cover-up and framing of the astronauts was as eerie as any later X-Files show. Remember this movie came out in 1980, the only other movie with the concept of government cover-ups at the time was Capricorn One. I'm glad it was made in 1980, if it was done today it wouldn't have had the same punch.","user":"Animus","rank":[20,25]}]