[{"title":"The seal of confession is highly illustrated by Hitchcock's \"I Confess.\"","rating":9,"date":"12 August 2000","review":"If the transfer of culpability was a basic theme in Hitchcock's \"Strangers on a Train,\" it furnished the provocative dilemma to \"I Confess.\"<br><br>A German refugee, Keller (O.E. Hasse), murders a lawyer named Vilette (Ovila Legare) when he is caught stealing... Keller thereupon confesses his crime to Father Michael Logan (Montgomery Clift), a priest at the Quebec church where he is a sexton...<br><br>Vilette was blackmailing Ruth Grandfort (Anne Baxter), who was in love with Logan before he was ordained and who continues to love him in spite of his religious vows and her subsequent marriage to Pierre Granfort (Roger Dann).<br><br>Keller wore a cassock when he committed the crime and Father Logan is unable to supply an alibi for the time of the murder - a series of coincidences which eventually find the priest on trial for murder...<br><br>The dilemma of \"I Confess\" relates to Catholic church law which specifically forbids the clergy from disclosing those sins exposed in the privacy of the confessional... Thus forced into complicity with the murderer, Father Logan behaves as though he is guilty despite his innocence in much the same way Guy Haines takes on some of Bruno's guilt in Hitchcock's \"Strangers on a Train.\" The film's tension derives from the audience's knowledge of the cleric's ethical problem and its desire to see him break his vows to save his own life...<br><br>Montgomery Clift makes the clergyman's inner torment apparent simply by the anguished expression in his eyes, and creates sympathy for a man who could be an object of mockery by maintaining his dignity... <br><br>Compassionate, grave, and restrained, Clift delineates the priest's conflicting emotions with the distinguished nuances of expression... His face, vulnerable but brighter by discerning yet kind eyes, reveals his suffering with eloquent intensity...<br><br>While a determined Karl Malden looks for every scrap of information to clear the murder, an embarrassing crown prosecutor (Brian Aherne) is in despair to establish a motive for the murder...<br><br>With moody atmosphere, set against the background of picturesque Quebec photographed in black and white, \"I Confess\" is solemn and entertaining, never getting out of control, with an overpowering sense of doom and enough amount of suspense in the manhunt of a killer...","user":"Nazi_Fighter_David","rank":[58,63]},{"title":"Atypical Hitchcock","rating":7,"date":"24 July 2005","review":"\"I Confess\" is one of Alfred Hitchcock's least famous films, and it's easy to see why: there is no mystery (we know who the killer is right from the start); there is some suspense but no major set-pieces; there is very little humor (no Cary Grant-type wisecracks here). The movie is a somber psychological drama, and the story of a forbidden love, and perhaps a Christ allegory (the priest has to suffer for another man's sins - he has to bear his own cross). I wouldn't rank it among Hitchcock's best, but it certainly has some of the best acting you can find in a Hitchcock film: Montgomery Clift is superb in a difficult role, Anne Baxter is warm and utterly believable as the woman who is consumed by her love for him, and Karl Malden is perfectly cast as the nosy (no pun intended) inspector on the case. (**1/2)","user":"gridoon","rank":[46,53]},{"title":"Brooding, moody, deceptively simple, and beautiful study of guilt and honor","rating":10,"date":"30 October 2009","review":"I Confess (1953)<br><br>This is one of Hitchcock's darkest films, and one of the best for seamless believability--it lacks some of the breaks from verisimilitude that bigger hits like Psycho and Vertigo famously use. It also has the incomparable Montgomery Clift, who took intensity to new heights as the first in a series of great method actors in the 1950s. He really wasn't a Hitchcock kind of actor (the director liked the artifice and changeability of a Cary Grant or Jimmy Stewart much more), but he makes the film what it is, and Hitchcock surely knew it, and made the most of it. When the camera (in the hand of Robert Burks) sweeps up to a full screen view of Clift's face and you see those glowing, brooding eyes, you fall under their collective spell. Yeah, it's great stuff.<br><br>The plot is pretty simple and amazing--a priest (Clift) learns something in a confession that come to haunt him in unexpected and very threatening ways. Hitchcock manages to push the envelope a little, as usual, in this case by having an illicit-seeming sexual affair be one of the keys to the plot. This implication naturally complicates the priest's life, but during the main plot of the movie and in a cheery flashback for backstory. Anne Baxter, the principled, strong woman (also not a Hitchcock forte) is terrific throughout, terrific the way Ingrid Bergman was in Notorious. Unlike most of Hitchcock's output, there is essentially no comic relief here, and the light and camera-work are equally dark--and truly gorgeous.<br><br>The French New Wave directors really admired this particular film of Hitchcock's, and you can see why. But it is also just a great, fast, distressing American melodrama set in France. It's not sensational, but it is spectacular, one of my favorites among many by this odd, brilliant auteur.","user":"secondtake","rank":[25,29]}]