[{"title":"One of Best Westerns Ever Made","rating":9,"date":"7 March 2014","review":"Exceptional performances by three heavyweight actors, Gian Maria Volonte and Lee Van Cleef - both of whom, it's a shame, did not have all that many more opportunities to shine in quality films after this one - and Clint Eastwood, along with taut direction, editing, cinematography and gripping and unique music (by the great Ennio Morricone), make this movie a real standout. (The music's almost a major character in this film, in fact.) Stylistically iconic, this Sergio Leone opus has an endlessly fascinating and spellbinding story that surprises to the end. Plus, we really come to like the co-heroes, Van Cleef and Eastwood - we want to befriend them and emulate them. Volonte was priceless as a demonic villain - his facial expressions rich with narcissism and a strange kind of violence-fueled euphoria no one else has ever matched in film history, for my money. Though he clashed with director Leone and purportedly did not like the Western genre, Volonte's performance rises above the film's genre and could be favorably compared to the best portrayed villains of other more mainstream movies. Volonte brought a realism to his character and an intensity you don't see in many films. But so did Van Cleef, whose work in this film is incredible. You'd have thought other movie makers would have rushed to cast Van Cleef in important roles after this film, but no. Very strange. Though some might question the wanton violence in this film, the truth is that the real wild west was even more violent and the violence often much more capricious and random. Like all great artistic works, this film never grows old for me. I am always drawn to watch it again and again for it is of such a depth and complexity that it only reveals more of itself with each viewing.","user":"iamyuno2","rank":[19,19]},{"title":"The best classic spaghetti western in the Sergio Leone and Clint Eastwood trilogy!","rating":10,"date":"11 October 2015","review":"For a Few Dollars More (1965) is the best Clint Eastwood Western movie and one of my favorite personal classic western flicks ever! It is my third favorite in \"The Man with No Name\" Trilogy. I grew up watching this film and it was the first Clint Eastwood western movie I ever saw, I fall immediately in love with it and I just love this movie. It is Sergio Leone's best western film of all time my favorite. It is entraining and brilliant western flick with a great original epic story, great cast and the acting is fantastic. You have a great shoot outs, the music score is original epic. I always enjoy this film. It is my favorite Eastwood western movie. <br><br>In my opinion It is Sergio Leone and Clint Eastwood's classic film that they ever made together. Westerns like this film doesn't exit this days anymore. I have enjoyed For a Few Dollars More a lot. I love this one to death. The film is very entertained, is not boring and It has a good plot and story to tell. The characters, the action shooting sequences are just amazing and awesome. Sergio Leone does what he wanted to do with the film, and become one of the greatest epic classic western movies. I love this movie to death and it is my favorite film! There are other western films that Clint Eastwood made and directed but this one will be one of his best films in the history ever.<br><br>The first film was more about one hero but in this film there are two heroes. The bullets, the shooting is outstanding. The gun fights are awesome. This is a Western that simply delivers the goods, and it does so with a spectacular marriage of style and substance. From the opening scenes with Cleef and Eastwood, to the scenes in El Paso, and then into the set pieces in the stone ruins in the Mexico desert, For a Few Dollars More displays the utmost skill by Leone in his storytelling, as well as in his use of the camera.<br><br>The film is intelligent when Col. Douglas Mortimer suggested that the way to break the gang will be easy with one man from the inside of the gang (Monco) , because his younger. The story telling from El Indio about a carpenter who made a big closet were the safe was hiding in it was just plain brilliant.Monco breaks one of Indio's friends out of prison and is admitted to the gang, to prove his loyalty was awesome. The watch that Indio opens during the gun fight scenes and when the song stops by the watch he draw his gun and shoot anyone in the gun fight with him that was so awesome. The last showdown between Col. Douglas Mortimer and El Indio when the song stopped was TERRIFIC!<br><br>Why I love this movie? Simply because of Clint Eastwood and Lee Van Cleef. I love Lee Van Cleef so much in here because he plays the good guy, he kills bunch of outlaws whit his riffle. He befriends Monco and he kills El Inido on the end. He doesn't split the reward with Monco , but he lets him have it, the money on a honest way. Clint Eastwood as Monco did a fantastic job in one of his best performances as Bounty Killer Monco. He also kills bunch of outlaws, he also shoot Mortimer's hat, he never shoots an Innocent or unarmed person, that is why I love this actor and his character so much. Gian Maria Volonté did a good job on another style he also never shoot unarmed person, he only did that once for a women he fall in love. Mortimer's sister, on the end of the film it was reveled why Col. Douglas Mortimer was hunting El Indio and his gang. He was doing it for both: Justice and Revenge, while Monco just wanted to get money and become rich, but he changed his mind after he saw how Indio is evil and cruel person. The gun fight between Col. Douglas Mortimer and Juan Wild - The Hunchback ( Klaus Kinski) in the bar was fantastic! How Col. Douglas Mortimer killed him. I love this film to death I love it! Sergio Leone did a fantastic job directing this awesome flick in fact I think it is his masterpiece. The film that changed the western movies today and I love the music score from Ennio Morricone. The dialogue and the script was amazing, the weapons used in this film are awesome and they are used well. Action is plenty in the film.<br><br>What else do you want in an spaghetti Western film like this at all?! The fact is this is the greatest western ever made in the history. I love this film to death! It is my third favorite film in the Dollars trilogy. This movie is a perfect 10 it is my personal favorite western movie.","user":"ivo-cobra8","rank":[113,126]},{"title":"The finest example of the Spaghetti Western revolution","rating":9,"date":"4 July 2006","review":"Italian director Sergio Leone changed the face of the Western genre in 1964 when he introduced what would be known as the \"Spaghetti Western\" with the brilliant \"Per un Pugno di Dollari\" (\"A Fistful of Dollars\"). Not only the films looked grittier, violent and realistic; the characters in Leone's westerns became complex men with complex and obscure moral codes, very far away from the classic clear moral opposites of previous westerns. \"Per Qualche Dollaro in più\" (\"For a few dollars more\"), is the epitome of all this. It is a powerful, raw and ruthless masterpiece that transcended its genre and became one of the best movies of all-time.<br><br>\"For a Few Dollars More\", the second in the so-called \"Dollars trilogy\" (a group of films by Leone with the same style), is the story of two different yet very similar men, Manco (Clint Eastwood) and the Colonel Douglas Mortimer (Lee Van Cleef) are two bounty hunters who are after the criminal named \"El Indio\" (Gian Maria Volontè). An unlikely alliance occurs between the two lone wolves as they decide to cooperate and divide the reward, but are these two killers after \"Indio\" for the same reason? <br><br>Written by Fulvio Morsella and Sergio Leone himself, the film's main characteristic is the complex moral code the main characters follow. They are no longer the perfect clean heroes of classic westerns, both Manco and the Colonel have well-developed attitudes, motivations and purposes; they are neither completely good nor completely bad, they are just real. The story unfolds with a fine pace and good rhythm, it is probably the best structured of the \"Trilogy\" and the easiest to follow. It is also the one that represents the elements of the Spaghetti Western style the best.<br><br>Stylistically, the film follows closely the conventions established by Leone's previous film but it takes them to the next level. The excellent use of minimalistic cinematography and the superb musical score by Ennio Morricone complement Leone's realistic vision of Westerns and completely redefined the genre's conventions. \"For a Few Dollars More\" is a violent tale of two hunters, and visually the film transmits the same emotions the characters feel. No more myths, the Westerns never felt this real.<br><br>Clint Eastwood's super performance as Manco is very important for the success of the film, as he is the one that takes the audience through this brave new world, however, the star of the film is Lee Van Cleef as Colonel Mortimer. In one of his best performances ever, Van Cleef manages to be both menacing and interesting, giving life to Leone's brilliant script with great talent. Gian Maria Volontè as Indio complements the two big talents as the crazed criminal with a dark past, he is the perfect counterpart of the two lone wolves.<br><br>\"Per qualche dollaro in più\" is a near flawless movie, as every piece of the puzzle falls into the right place to create a marvelous and unforgettable picture. It's only minor problem may be the dubbing, but fortunately, it still is superior to the one heard in other Italian productions of the same time and it doesn't hurt the film. <br><br>Fans will always argue about which of the three films of the \"trilogy\" is the best, and while personally I prefer \"The Good, the Bad and the Ugly\" over this one, it is just a matter of personal taste as this film is as perfect as that one. A real classic that changed the face of Western as we knew it. 10/10","user":"jluis1984","rank":[105,118]}]