[{"title":"Delightfully bonkers","rating":9,"date":"22 May 2014","review":"The 1970s aren't particularly known for having the best Godzilla movies, but when Godzilla was good, he was very good, and this is one of those cases. In fact, Godzilla vs. Mechagodzilla is highly regarded by fans if the franchise for this reason- it's pure cheese and completely bizarre, but it actually also has drama that works (bet you thought you'd never heard anyone describe any of the Godzilla films from the 70s in that fashion) and a good plot too. Perhaps this has something to do with the fact that this was Godzilla's 20th anniversary, and so they decided to cut the bullshit and show him as a destructive force while still keeping him an anti-hero. Not that anyone in particular goes to see Godzilla for anything other than a man in a rubber suit whaling on nothing's, but while this film offers that, it has a good story and even some very interesting plot twists that keep the story all spiced up. It's also short and set at 84 minutes and it rarely fumbles.<br><br>As the title itself gives away, Godzilla faces off against... Godzilla. That's two Godzillas for the price of one- but this is a gigantic cyborg Godzilla, and you wouldn't expect the thing to work so well- but the execution is so tight and well done. In fact, it's revealed over the course of the film that Mechagodzilla is controlled by aliens from an external source. The basis for Mechagodzilla is that he appears when a black mountain rises, and when a red moon sets, two more monsters appear to destroy him. When he first appears, you're immediately greeted with a surprise as you think he's Godzilla, then he begins brutally beating Angurius- who is usually his ally. When actual Godzilla shows up is when we see him turn into a cyborg. The fights are especially well done and the last fight is just absolutely brutal. It's great to see the brutality returned to Godzilla after years of him being reduced to a camp type<br><br>Plot and character wise it succeeds too. You can actually care for the characters, even if you're not here for the characters. There's a subplot involving a statue which also succeeds due to the intrigue. A classic moment appears on a scene on a ferry where it's revealed one of the workers is an undercover alien, which is a very effective and shocking plot twist. It also results in a very impressive chase and action sequence, which cant be said for a lot of scenes set on a ferry<br><br>But ultimately the most memorable moment of the movie happens when the Azumi priestess goes to the island where King Caesar, Godzilla's ally in this movie, rests, and sings an ultra catchy yet haunting hymn to wake him up. It's an actual full three minute song and her vocal range is on full display, making every minute of it believable. The fight that ensues afterward is awesome too. While a lot of the 1970s Godzillas are rather forgettable and at times bad, at least this film actually succeeds in being enjoyable primarily because it's well written, has enough of Godzilla to go around and even the non Godzilla scenes are effective- much like the new Godzilla. An absolute recommend in every sense.","user":"Meven_Stoffat","rank":[8,8]},{"title":"Best of the oldies","rating":10,"date":"4 June 2019","review":"Epic monster fights and nice to see a polished more colorful updated version! The effects were awesome, crazy for it's time; similar to Star Wars, it's mind blowing for what was achieved. Story is great too. Highly recommend for monster/creature fans!","user":"UniqueParticle","rank":[7,7]},{"title":"An Enjoyable G-Film!!","rating":7,"date":"25 April 2009","review":"Godzilla's 14th film, his 20th Anniversary, is pretty good, better than the last two, that's for sure. Finally, we aren't bombarded with stock-footage, crappy monsters, and karate moves. The story was good, and so were most of the SFX. Plus, a reason of its own to give the film a star, it introduced MechaGodzilla, one of my favorite monsters! The story wasn't a rehash of the others and they actually brought back some of the best Toho actors, Akihiko Hirata and Hiroshi Koizumi! The music was all right for the most part, with its jazzy feel to it. The aliens are a bit of a disappointment, being monkeys, but they didn't ruin it like the cockroaches in \"Godzilla vs. Gigan\". This is the first film since \"Godzilla vs. Hedorah\", a whole three years (!!), for SFX director Teruyoshi Nakano to actually display something presentable and all of Mecha-G's rampage scenes are carried out nicely. But the doppelganger's chest ray looked too simple compared to his eye beams, which looked incredible. To the monsters....<br><br>Angiurus returns, now able to leap at his foes like Baragon in \"Frankenstien Conquers the World\", a bit odd but cool. His fight with Mecha-G is very physical, ripping Anguirus' jaws apart and all. Mecha-G was incredibly cool looking and all his weapons are brought to life fantastically. I'm glad he returns in \"Terror of MechaGodzilla\". King Seeser is actually a decent monster but I hate the fact that that braud had to sing for over a minute to awaken him! It was the Mothra song coming back to haunt us all. Godzilla is still the suit from \"Godzilla vs. Megalon\". The final battle was spectacular and fun goes to bloody levels never before seen in a G-film and the Monster King takes quite a beating. In this film Godzilla also doesn't do any goofy moves or that many human tactics. Of course, besides that scene where he missed his mechanical twin with his heat ray and seemed to snap his fingers in anger. The human characters all give good performances and a few espionage scenes, but the aliens' aluminum foil base wasn't that impressive.<br><br>I really enjoyed this movie and really think it's one of the better at a time when Godzilla films were really going downhill. The sequel surpasses this film, but the end of the original series I guess was inevitable at this point.","user":"gigan-92","rank":[10,11]}]