[{"title":"Wistful Preston Sturges romance","rating":10,"date":"27 January 2002","review":"Not as well known as \"The Lady Eve\" or \"The Miracle of Morgan's Creek,\" \"Christmas in July\" was an unusual film for the writer-director Preston Sturges: it's more wistful, less frenetic. Though it's filled with a myriad of those wonderful character actors that Sturges loved to use to fill the frame (including Franklin Pangborn and William Demarest), it's touching in its regard for the struggling young couple (played by Dick Powell and Ellen Drew) who get swept up in the idea of winning a slogan contest (\"If you can't sleep, it's not the coffee, it's the bunk!\"). The romantic mood seems to be set in the Depression era, reminiscent of the scripts that Sturges wrote for those Depression comedies \"The Good Fairy\" and \"Easy Living\": innocents get swept up in mistaken identities and come out winners anyway. Maybe it's not as manic as his classic romantic comedies, but it has its share of hilarious moments and it's full of charm.","user":"lqualls-dchin","rank":[35,41]},{"title":"Community jest...","rating":7,"date":"4 February 2009","review":"Short and sweet, bright and breezy, but not without pith, this early Preston Sturges feature helped further establish his \"wonder-kid\" reputation in the early 40's before his great classics \"Sullivan's Travels\", \"The Lady Eve\" and my favourite \"Hail The Conquering Hero\".<br><br>The simple premise of a hoax win in a national coffee-slogan competition for ordinary average nice-guy Powell is the springboard for a light morality tale along the lines of \"he who does good has good things happen to them\" - although not without the usual series of ups and downs, just as you'd expect.<br><br>Of course nobody here is really bad, even the duped killjoy Mr, no make that Dr Maxford of the sponsoring coffee company or Mr Shindler of the too-trusting department store from whom Powell buys gifts for the whole neighbourhood on the strength of the phony winning telegram placed on his desk by his prankster work colleagues. Even when he finds out that his win is bogus, Powell can't get angry at the tricksters, so it's no real surprise that his homeliness, honesty and humility wins everyone over, including his feisty girl-friend, played by Ellen Drew, with the predictable twist in the last reel that Powell's slogan wins anyway.<br><br>Powell is very likeable in the lead, although Drew is a little too high-pitched in delivery for my taste as the film develops. There's the usual troop of madcap eccentrics which peoples almost every Sturges comedy, with some nice little cameos, I particularly liked the actor playing the deadpan cop, not above making some contemporary allusions to Hitler &amp; Mussolini to stress a point.<br><br>The dialogue of course is mile-a-minute vernacular and I got a kick out of Sturges' Dickensian word-play over triple-barrelled lawyer's names (along the lines of \"Swindle Cookum and Robbem!\"). Right from the start, we get the \"screwball comedy\" template of a poor Joe and his girl, dreaming of something bigger waiting for something extraordinary to happen, with Powell and Drew's extended night-time scene on their New York apartment roof-top, and succeeding entertaining scenes including Powell's reaction to \"winning\" the competition and best of all the frenetic crowd scene when Maxford tries to get his money back only to cop a batch of rotten fruit (\"Don't throw the good stuff\" admonishes one parent to a tomato-wielding youngster), it's all good clean fun and ends up happily ever after. And get a load of that \"zoom\" shot back into Maxford's office at the end - it certainly got me out of my chair, not the last time Sturges employed camera tricks of this type - remember the memorable stop-start sequence to \"The Palm Beach Story\".<br><br>The movie celebrates community, the little guy who dreams of making it big and how to meet disaster with alacrity, in short a feel-good movie with a big heart, well worth an hour and four minutes of anyone's time.","user":"Lejink","rank":[13,14]},{"title":"Enjoyable Sturges flick...","rating":15,"date":"15 July 2002","review":"This may be my favorite Preston Sturges film.  It's as well written and well crafted as anything he made after it.  Sturges had a knack for creating unique characters and throwing them into even more unique situations.<br><br>Jimmy MacDonald is absolutely determined to make money the easy way; by winning a contest.  A few of his coworkers, aware of his desperation to win an upcoming contest, decide to send him a telegram in order to make him believe he's won the recent contest, along with the enormous cash reward. What begins as a cruel little joke (to find out how Jimmy would react to winning) becomes something much bigger.  It wouldn't make sense for me to explain the plot any further; much of the enjoyment in watching the film comes from how it unpredictably unfolds.<br><br>\"Christmas in July\" is rather unusual in comparison to some of Sturges other movies, namely his two most famous films, \"The Lady Eve\" and \"The Palm Beach Story\".  It contains more pathos and less sexual innuendos, but it never becomes cheap, manipulative melodrama.  It's also quite short in comparison to his other movies, but it's all the better for it.","user":"cereal_11","rank":[22,26]}]