[{"title":"Ridiculous, cute, and fun family entertainment","rating":8,"date":"14 April 2006","review":"This is a fun movie for the entire family. Well, of course, it's ridiculous but the kids will love it and you can laugh right along with them.<br><br>The absurd tale revolves around around a nutty scientist &amp; dad named Wayne Szalinski who is working on a machine to miniaturize objects. When his two kids plus their two neighbouring friends (the Thompsons) wander into his lab, Wayne inadvertently shrinks the four of them. Then he accidentally tosses them out in the garbage, so the poor kids have to brave the dangers of the lawn to get back to the house. And can the well intended but crazy scientist figure out how to bring the youngsters back to full size again? (Personally, my favourite aspect of the movie is the nutty father.)<br><br>The story has plenty of adventure and danger as the teensy weensy younguns brave the perils of the jungle (actually their lawn). They face thunderstorm like risks of potentially drowning in the lawn sprinkler or being attacked by giant ants, bees, &amp; other bugs. Not to mention the lawn mower!<br><br>Avoid the TV series of the same name, but this movie has some good family messages involving the two sets of parents (the Szalinskis &amp; the Thompsons) as well as the kids. And of course there's lots of hilarity and adventure. It should be rated higher than it is and fully deserved its popularity at the time. This film put the phrase 'Honey, I shrunk (or whatever) the kids' into people's everyday vocabulary!","user":"roghache","rank":[32,35]},{"title":"An imaginative Disney comedy with a welcome old-fashioned feel.","rating":7,"date":"15 February 2007","review":"My Take: A fine family entertainment with some neat special effects. <br><br>I grew up watching and enjoying this funny, fast-paced fantasy adventure. But when I watched it back then, I always seemed to start it on the part with the scorpion and the ant, so I only watch a few parts. But I finally found it on DVD and watched it from the beginning. And I really enjoyed it. It's really a fantastic fantasy, with elaborate special-effects and lavish \"enlarged\" sets.<br><br>The film is quite like the fantasy films filmmaker Steven Spielberg produced, like \"Back to the Future\" and \"Innerspace\" for instance. It depicts the adventures of average people, thrust into an adventure of a lifetime, and then must find away to get back safely. That's kinda like the premise of \"Honey, I Shrunk the Kids\", a group of neighborhood kids get shrunk to size by a weird machine crazy inventor Rick Moranis invented. Disney triumphs in creating an enjoyable fantasy that's sure to be a charm. The stop-motion effects are still impressive, even if special effects in the 80's have certainly moved on. It's one of the best live-action Disney efforts and a fine fun for the entire family.<br><br>This film is followed by a sequel \"Honey, I Blew up the Kid\", which is not quite as zany and imaginative as its predecessor. <br><br>Rating: ***1/2 out of 5.","user":"vip_ebriega","rank":[18,19]},{"title":"A small adventure of grand proportions.","rating":7,"date":"31 December 2007","review":"Basically this one great and fun adventure movie, for kids especially. It's a Disney movie, so it's most definitely kid orientated, which means that it doesn't have the most complicated script, drawn out characters, or other mind boggling elements but it more than serves its purpose.<br><br>What is the most appealing aspect of \"Honey, I Shrunk the Kids\" are its adventures elements. It was a great move to let the movie for most part be set in the backyard of an ordinary house, of a not so ordinary family. The shrunken kids have to overcome all sorts of dangers in the backyard, such as 'giant' insects, water drops, muddy rivers, lawnmowers and of course avoid being squashed by humans. A new adventure and obstacle awaits at every corner, which makes sure that there is always something happening in the movie and makes things flow well.<br><br>The movie is perhaps more adventurous and fun than really funny. The most comical aspects of the movie mostly come from the adult cast, from actors such as Rick Moranis and Marcia Strassman as the parents and Matt Frewer and Kristine Sutherland as the neighbors. They mostly make sure that the movie is a perfectly enough watchable and entertaining one for adults. Rick Moranis of course suits the role very well as a nutty scientist. He is perhaps also known best for his roles in the \"Honey, I Shrunk the Kids\"-movies than any other one.<br><br>The movie is well made and Joe Johnston shows himself again a capable director. I have always liked him as a director. He never made any really great movies but his movies are always entertaining, which always make a Joe Johnston movie a pleasant one to watch. This movie was his directorial debut and he could had done a lot worse.<br><br>The movie has some good effects, also especially considering the time it got made. The movie uses all kinds of effects. Mostly of course consisting out of over-sized sets and objects but also stop-motion effects, mechanical effects and some early special effects. Especially the over-sized objects aren't really convincing looking and are obviously made out of light and non-nature materials but I don't know, this seemed sort of right and a suiting style for a kids movie such as this one. The musical score by James Horner is also a perfectly fine one.<br><br>About as good and entertaining as a kid's movie can get, though there is also plenty left to enjoy for adults.<br><br>7/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[10,10]}]