[{"title":"where has this movie been?","rating":9,"date":"21 March 2005","review":"I caught this movie on AMC at 3 o'clock this morning (or so), and was blown away! What a tense, gritty drama - and what a cast! I was trying to figure out who was who, as they were all so young (Ed McMahon? Donna Mills? Ruby Dee without Ossie Davis? Wow!) Martin Sheen's baby face made his psycho character all the more frightening. To me, the movie is a great time capsule of the sixties, and of New York. I do have a complaint to register regarding the AMC channel - instead of squeezing the end credits to make room for commercials for the next movie, how about staying true to your movie fans who have a compulsive need to read the credits, and show them full-screen to the end? Who's with me on this one? Thank goodness for IMDb to get us through!","user":"jules32","rank":[70,78]},{"title":"The other passengers WERE believable","rating":20,"date":"20 August 2008","review":"Poster \"Sol1218\" wrote that he found it not credible that none of the other passengers on the train tried to interfere with the thugs or help their fellow passengers. But the reality of 1967 was that it was a rare New Yorker who would stick his neck out for a stranger.<br><br>Just three years earlier, in 1964, a terrible crime occurred in Forest Hills, Queens that made headlines world-wide. A barmaid named Kitty Genovese was attacked and killed on the street while dozens of neighbors in surrounding apartment buildings listened to her screams. During the attack, apparently one person yelled from a window and the attacker backed off for a few moments. But when no further interference took place, the attacker returned and stabbed Miss Genovese to death.<br><br>None of the neighbors even called the police. They all later said, when interviewed, \"I didn't want to get involved.\" That sentiment reflected the majority of New Yorkers in that era of rampant street crime: mind your own business, don't get involved.<br><br>The passivity of the passengers in The Incident was perfectly in line with the sensibilities of the time, and the fact that it took a visitor from Oklahoma (Beau Bridges) to step up to the plate, was also very apt.<br><br>All that being said, this movie is extremely powerful. The first time I ever saw it, on television, I was shaking for hours.","user":"insurancelawyer","rank":[26,29]},{"title":"brutal realism","rating":10,"date":"4 August 2002","review":"How did this little film slip between the cracks? This amazing film deserves mountains of more credit than it gets. It's a very real, brutal film that really tests our emotions.<br><br>It did to me, at least. The acting job (especially of the two leads) was phenomenal! Especially, by far, Martin Sheen.<br><br>The cinematography, the vicious personalities of the two street punks, the music, well... basically everything flat out works. Haven't we all felt like one of the passengers? Or maybe even like one of the hoodlums?<br><br>Great film. 10/10","user":"spectre316-1","rank":[39,47]}]