[{"title":"Sexy Sexy Pam Grier!","rating":8,"date":"27 October 2002","review":"Sexiest black woman of all time Pam Grier kicks ass and looks great doing it. This film has everything you are looking for in a blaxploitation flick. Scatman Crothers and the bartender from the \"Love Boat\"; what else would you want?  Great!","user":"billyjcoombsrogerscom","rank":[12,14]},{"title":"A Total HOOT! Yay Pam!","rating":10,"date":"7 December 2004","review":"I don't understand all the negative reviews this film has received on this site--it's a total hoot. It may not have the story or grittiness of Coffy or Foxy Brown, but it has all the fun elements, and plenty of 'em. I watched Foxy Brown expecting a hilarious time capsule of black 70s style, slang, and b-grade action, and was surprised that it was actually a great movie. THIS is the movie I expected, and it is great just for being what it is.<br><br>My favorite scene of all is when Ted Lange (Isaac from Love Boat) drives up in his Cadillac, trying to persuade Friday to join his harem. Pam is hilarious in this scene, as is Lange, with his WONDERFUL speech about his ladies' fine clothes, ride, heavy blow, and best of all, they each have their own personal health and welfare plan! Then cut to the 'ladies,' who are THE skankiest trash you could imagine. Friday refuses, and Fancy says 'Well, at least you have to admit my sh*t is HEEEEAAAAAAAVVVVVVYYYYYYY!' I'm sorry, who can resist this?<br><br>MINUTES after this we see Carl Weathers in his red-and-white plaid jacket with mirrored sunglasses! Then Chloris (friend of Friday's) throws MASSIVE shade at Friday for not running at her beck and call! Then Eartha Kitt delivers this speech about her new fashion collection, called 'the four seasons of S-E-X. rrroooawwww!' As you can see the hits come fast and furious in this little gem.<br><br>Special mention must be made of the fashion show. Four women come out VERY dramatically, as this insipid music repeats its four-bar melody over and over and over. They never alter the expression on their faces, they engage in these vogue-type gestures that are stiff and ridiculous after a certain point it becomes this sort of alien pantomime bearing no relation to anything human. Was this supposed, at one time, to be sexy? Is this what all our 'sexy' Britney's and co. will look like in 30 years? Take special note of the one in white--she looks like the creature from the black lagoon or that floating head from 'Zardoz,' and NEVER alters her living corpse expression.<br><br>Pam is great and fun as ever, and she has more to DO here than in Foxy Brown or Coffy, much as I love them. Here she plays more of a human with a sense of humor. There is also a parade of FIIIIINE-lookin' men ('You don't forget the fine-lookin' ones' says Friday), including Carl Weathers and Thalamus Rasulala. <br><br>There were also quite a few snappy little one-liners that went by so fast they're almost hard to catch. Anyway, not the best Pam Grier movie in terms of quality, but maybe the best in terms of fun, laughs, and just WAYYYY out-there 70s mojo.<br><br>--- Check out my website devoted to bad and cheesy movies: www.cinemademerde.com","user":"iago-6","rank":[21,28]},{"title":"Great fun, loaded with blaxploitation regulars!","rating":6,"date":"20 August 1999","review":"Friday Foster is probably the most fun of all the 70's Pam Grier flicks. Though not as good overall as Coffy or Foxy Brown, both had a certain amount of serious content; not Foxy Brown.  Here Pam's intrepid reporter discovers a dangerous plot to eliminate black leaders.  She's aided by Yaphett Kotto, hunted by Carl Weathers, and along the way she runs into Scatman Crothers, the guy who played the villan in Bucktown and the hero in Blacula, one of the cast of Across 110th Street and the bartender from the Loveboat.  The film is light, but very amusing...I recommend it for Pam Grier fans.","user":"DrSatan","rank":[8,9]}]