[{"title":"Warm, cozy & groovy...like a hot cocoa with a shot of peppermint schnapps!","rating":10,"date":"12 December 2001","review":"This is my favorite of all the Rankin/Bass specials (and they are all excellent). Many people get all the \"Animagic\" cartoons confused...so I'll try to pinpoint this one. This is not the one with Rudolph (\"...the Red-Nosed Reindeer\") and not the one with the Heat Miser and Snow Miser (\"Year Without A Santa Claus\"). This is the one with the toy-hating Burgermeister Meisterburger and.....the Winter Warlock!!<br><br>We get to see Santa Claus go from an orphaned baby raised by elves to a groovy, red-haired hip young adult who is outlawed for delivering toys to finally becoming the toy making/giving king of Christmas! We also get to see Mrs Claus as a groovilicious babe in her own right and she finally gets a name, Jessica.<br><br>Some charmingly dated scenes only add to the warm innocence of this show: like when Jessica realizes \"her own town has turned against her\" and begins singing of her love for and desire to be with Kris Kringle....transcending into a cornucopia of hippy-trippy flowers, swirls and polka-dots and finally catching a glimpse of her paper cutout reflection in the water fountain in the center of town. Remarkable!!<br><br>But, the show's main message is one of love and the courage to follow your heart and do what you know is right regardless of the obstacles that come in your way. A wonderful Christmas special that no holiday season is complete without.","user":"josephbrando","rank":[49,52]},{"title":"Timeless!!","rating":12,"date":"12 October 2001","review":"I will be 33 in January 2002.  I only mention this so that readers will be able to gauge my review of this classic based on my age.  While I was growing up, prior vcr tapes and dvd players, I and my friends would wait all year to view the various Christmas specials that aired each year.  I remember sitting glued to the tv taking in every second of the shows.  Back then if you missed part of the show or even the whole show you were border line depressed because you knew you couldn't see it again for a whole year. In some ways anticipation made the viewing of Christmas specials that much better.<br><br>SANTA CLAUS IS COMIN' TO TOWN(SCICTT) is in my top five Rankin/Bass specials.  Right along with RUDOLPH, FROSTY and The Year WITHOUT SANTA CLAUS.  I enjoy the 1970's feel this classic has.  The flowers that appear when Jessica sings, the simple toys the kids play with and the songs that are sung throughout this show.  I can only imagine what a modern version of this show would sound like with its boy band sounding songs and electric toys and video games.  Instead of watching Kris and Jessica court each other and wed we would probably see them live together while they consider marriage.  This was a scary classic.  The Winter Warlock was very scary when I viewed this as a kid.  No matter how many times I saw this as a kid I would always wonder if Kris would make it past the warlock.<br><br>I suppose the best thing about this type of Christmas classic is that when people my age view it they can escape back to their innocent youth for a short while.  Even though I now own the vhs of SCICTT and soon hope to purchase the DVD I make myself and my kids wait until Christmas season to watch it.  It's not quite the same as when I was a kid but anticipation still increases the viewing pleasure once we do watch it.","user":"AbeStreet","rank":[41,47]},{"title":"My favorite of all Christmas cartoons!","rating":10,"date":"6 November 1999","review":"I am an adult, and probably shouldn't watch Christmas cartoons, but I love them anyway!  \"Santa Claus is Comin' to Town\" is my favorite of all Christmas cartoons.  Anyone who knows me knows that I love this cartoon! (I was a kid in the 70's when all the Rankin/Bass cartoons were on during Christmas, so I remember and have most of them!)  The mailman (Fred Astaire) is just adorable!  Mickey Rooney as Santa was such a perfect choice!  I love to settle in a comfy chair, knowing I won't be interrupted, and put this tape in my vcr.<br><br>I agree (a little bit) about the cartoon being dated.  Yes, it has those tones mainly in the middle of the cartoon, but it can easily be dismissed. I would like to explain about the wedding celebration between Santa and Jessica in the forest.  They got married in the forest because \"no church would have them\".  This a wonderful, innocent Christmas cartoon - a joy for anyone to watch.","user":"pattyjef","rank":[27,31]}]