[{"title":"How (or is that \"howl\") did they always come up with something so neat?","rating":7,"date":"3 April 2006","review":"I think that more than anything, \"The Curse of the Werewolf\" does what too many werewolf movies fail to do: offer an explanation of how the first werewolf got created. Apparently, if someone is conceived under rather unpleasant circumstances, that person is a lycanthrope. After a beggar gets imprisoned in 18th century Spain, he rapes the jailer's daughter. She dies in childbirth, but her son Leon is raised by a nobleman. Sure enough, Leon is a werewolf. As an adult, Leon (Oliver Reed) tries to control himself, but unfortunately can't.<br><br>This is another addition to Hammer's cool filmography. It shows Leon's inner torment, knowing what will happen every full moon. As for associating Spain with werewolves, that country of course produced actor Paul Naschy, who has made a career out of playing werewolves; Portland's own Movie Madness even has a section devoted to him.","user":"lee_eisenberg","rank":[31,31]},{"title":"Werewolf\"ish\"","rating":6,"date":"7 October 2003","review":"A very involving Hammer production that chronicles the history and life of Leon (Reed) who becomes cursed at birth causing him to turn into a werewolf when the moon is full. This is a story driven movie. The action and violence is sparse, but that's not what this movie is about. Playing out like a historical drama, Curse of the Werewolf details werewolf mythology like I have never seen. The performances are fine, and the film has an ambient feel to it that makes it even more appealing. Don't sit down to this movie expecting a bloodbath, Curse of the Werewolf is a well written, brilliantly conceived, and nicely plotted thriller.","user":"Specters","rank":[30,33]},{"title":"Very enjoyable and different","rating":8,"date":"6 January 2008","review":"This was a highly unusual werewolf film and I am actually surprised that Hammer films went on to make many Dracula sequels but not werewolf ones, since this film was well made and quite enjoyable.<br><br>The film begins with a very long prologue--telling a sad tale about an evil man who was responsible for the curse that eventually made poor Oliver Reed become a werewolf. The entire story was quite interesting and VERY different from the Universal Studios vision of how one becomes a werewolf. Instead of being bitten by another werewolf, it was a rather convoluted curse. The only problem with this story, though, is logical. You see, Oliver Reed's adoptive father narrates the prologue BUT how he knew most of the details is quite impossible--as Reed's mother was a mute and didn't have communication skills to explain most of the story. Plus, parts of it she couldn't have known! I guess the narrator just read the script, because there was no other way he could have been privy to the information! Despite this serious logical flaw, the rest of the film was very compelling--with Reed making a very sympathetic creature. Plus, like the old Universal films, Hammer did a good job of not showing too much--only letting you see the creature near the very end of the film.<br><br>Excellent acting and production values combined with a very interesting though flawed script make this an excellent movie for fans of Gothic horror.","user":"MartinHafer","rank":[17,18]}]