[{"title":"Ultra-moody cop fiction.","rating":7,"date":"24 February 2007","review":"I saw this film on crappy pan and scan VHS when I was about 12 and I didn't really understand it and I wasn't really up on Ridley Scott's work. As a result, the impact of the film was somewhat lost on me. I was expecting an action film instead of a character drama with lots of police procedure. But now, older and wiser and with a brand new Blu Ray of the movie, I am finally able to appreciate how clever the film is.<br><br>The story unfortunately IS riddled with 80s Cop Movie clichés and goes through quite a lot of familiar motions. But if you see past that you'll appreciate the immense atmosphere and mood that Ridley Scott piles on. Simply put, Michael Douglas is Nick Conklin, a bad cop (pretty much the exact same character in Basic Instinct) who drag races on his superbike to pay alimony and pinches drug money instead of turning it in for evidence. Enjoying lunch with partner Charlie (Andy Garcia) in a steakhouse in New York's meat-packing district, they just happen to witness a Yakuza execution by wanted Japanese criminal Sato (Yusaku Matsuda, who was dying of cancer during filming and didn't tell anyone). After a quick punch-up and shoot-out they find themselves chaperoning Sato back to Osaka. But when they arrive there he manages to escape, leaving them embarrassed with lots of questions to answer.<br><br>Nick and Charlie find themselves in a very foreign and intolerant world and recapturing Sato proves to be difficult in many ways. Not the least of which is Japan's alienating culture (from an NYPD point of view) and rigid rules. Nonetheless, Nick is determined to catch Sato and restore his honor.<br><br>Like I said, the atmosphere of the film is overwhelming, which is really all the film needs. The clichés and stereotypes don't matter so much when you are involved this much. Hans Zimmer (his first film with Ridley Scott) provides a deeply emotional and very melodic score that'll be rattling around in your head for days. It's a shame it's never had a comprehensive CD release, as it's one of Zimmer's most impressive efforts.<br><br>You could call it a pretty 80s movies, but I still do feel that it holds up pretty well today. As one of Ridley Scott's more forgotten works, it's well worth checking out.","user":"CuriosityKilledShawn","rank":[74,84]},{"title":"One of the Top Cop thrillers of the last century, supremely underrated.","rating":10,"date":"13 January 2007","review":"Micheal Douglas has always been, at least for me, one of the better actors to portray a cop on screen. Very believable, very real, he just has a natural feel for this type of role. I think its due to the fact he starred as one on TV in \"The Streets of San Francisco\". Everything blends in this cop thriller. It oozes style and panache. It also has an underlying emotional core that I think gets underrated by critics. Douglas as Nick Conklin has some fine moments playing off the characters played by Andy Garcia, Kate Capshaw and especially Ken Takakura. This movie combines excellent acting, gorgeous cinematography, great atmosphere, along with some solid action set pieces...and gets it right. Director Ridley Scott brings all his cinematic guns to bear and spins these elements into a definitive police action thriller. I loved this flick when I saw it in 1989 and I still do. It may not be as audacious as when it premiered, time has seen to that(ex.action scenes have really gone virtual reality)but it's still a respectable addition to your DVD library. And of that fact there is no gray area!","user":"Joyyrider","rank":[66,87]},{"title":"Moving and thrilling action movie with cool visual style by Ridley Scott","rating":7,"date":"1 December 2008","review":"This solid thriller deals about a down-home cop(Michael Douglas)accused of corruption and his young partner(Andy Garcia). They witness a grisly killing by a Japonese murderer named Sato(Matsuda). They pursuit him and barely escape with their life, but get detain him. They're assigned to protect him but with painful results when the mobster is transported to Osaka. Then they are assigned to upright Inspector(Ken Takatura) and forced into action against Yazuka. Thus starts a clash of culture and a cobweb of intrigue which keep the spectators on the edge of their seats.<br><br>This is a superb, though predictable at times, blending of tough American police genre and Japanese gangsters by means an organization called Yazuka, a kind of oriental Mafia .Michael Douglas as down-and-out police and Ken Takatura are honorable Inspector are very fine . Good secondaries actors such as Andy Garcia and Kate Capshaw, Spileberg's wife. Appear uncredited John Spencer as the chief official and Luis Guzman. This first rate suspenseful action pic benefits from intelligent screenplay and visual dynamics, however is overlong, two hours and some. This special buddy-movie is full of neon lights from Osaka with a videoclip and advertisement spots style . The motion picture is glamorously directed by Ridley Scott as stylish as ever , similarly his previous film(Someone to watch over me) and others(Blade runner,Duelists , Legend) in which his visual style is impressive.","user":"ma-cortes","rank":[26,33]}]