[{"title":"The Great Terence Stamp","rating":3,"date":"3 August 2005","review":"A unique and fascinating film. Terence Stamp should have received an Oscar for his haunting appearance as an adult man revived after 30 years from a coma he had lapsed into at birth. He is totally convincing as the little child in the body of a grown-up man. Much more effective than Tom Hanks in \"Big\", but \"The mind of Mr. Soames\" is not a comedy, although it contains many comical and touching scenes. And in spite of the subject it is surely not an overly sentimental or sensational film, it's rather more a character study (although occasionally it is also very thrilling), in fact it's presented in an almost documentary manner, which makes it the more interesting. The film also gives a nice outlook upon the world &amp; society seen through the eyes of a little child. Outstanding photography, even poetical (the scenes when Soames is happy in the garden), and top quality actors in thoughtful roles. An undeservedly obscure film that should be more widely known.","user":"pauldeboef","rank":[33,34]},{"title":"A sleeper about a sleeper","rating":27,"date":"27 January 1999","review":"An underrated, pretty much forgotten movie that deserves to be better known. The premise - a 30 year-old man in a coma since birth suddenly awakened - had me hooked from the start. Terence Stamp gives an excellent performance as a baby in a man's body. How do you treat such a patient? Scientist Vaughn believes Stamp deserves a proper childhood, including play and affection. Scientist Davenport thinks that it's important that that Stamp be given an intense regular schedule of learning to catch up. It turns out both men are right (AND wrong). What happens in the second half of the movie will be foreseen by many viewers, but it's handled with intelligence and believability. Some viewers today may not be pleased with the ending, which is not cut-and-dried and sweetly happy. But it's not without hope, and it feels more real than any artificial ending that would probably be tacked on if the movie was made today.","user":"Wizard-8","rank":[24,25]},{"title":"not your run-of-the-mill movie","rating":20,"date":"20 February 2000","review":"If you are looking for something out of the ordinary,this movie is worth watching. It tells a deeply moving story of a man who has awakened from a coma that he has been in since birth and has 30 years of catching up to do. Terence Stamp plays the lead and is well suited to the part. He is a fine actor who has not recei ved enough accolades.","user":"rover-9","rank":[8,8]}]