[{"title":"Who are you, really?","rating":10,"date":"27 January 2007","review":"Honestly, I don't think I've ever seen anything quite like It's A Wonderful Life. <br><br>Does it take me back to that place in my heart, that makes me long for everything that once was great and it could be again? Does it remind me of my childhood, Christmas in my home? No. Maybe it's just simply what I always wanted from life and every man I want to be. <br><br>Everything about this film is well for lack of better words, perfect. No question to it any longer, the best performance by an actor I have ever seen. It's more than just beautiful, timeless or fair. All of Stewart is revealed. Everything coming together for Capra. Lionel Barrymore at his best, which seems to be his worst. <br><br>Sometimes I think there is a reason why somethings happen. And I'm pretty sure there is some magical reason why this film was made. I'm 27 years old and saw it for the first time Christmas Eve of this year. I've watched it 3 times since. The only movie to ever make me cry. I probably wouldn't have all the answers for you, if you asked me why. I'm still trying to figure Stewart out and just how beautiful was Reed.<br><br>What can I say? This movie is a life changing experience. <br><br>Makes me feel good to be alive. What a wonderful little world it is. And if I waited my entire life, it would not be a waste of time.","user":"JFHunt","rank":[530,572]},{"title":"Atop my Top Ten","rating":9,"date":"9 December 1998","review":"I am a film lover from 'way back, having even served a stint as a newspaper movie critic. Entries in my personal list of Greatest Films of All Time include \"Fantasia,\" \"To Kill A Mockingbird,\" \"Casablanca,\" \"Singin' in the Rain,\" \"North by Northwest,\" and \"The Sound of Music. But sitting atop all of them, as undisputed champ, is \"It's a Wonderful Life.\"<br><br>I have seen it hundreds of times (dating back to, oh, when I was a teenager I suppose, and our local PBS station ran it as part of a pledge drive). I drive my wife and family to distraction when we watch it together because I quote all the dialogue along with the actors.<br><br>I cry every time--and this is after viewing upon viewing--when Harry Bailey toasts his big brother George as \"...the richest man in town.\" The emotions in that scene are so true and pure that I can't help but be affected by them.<br><br>The performances are unparalleled. Stewart is brilliant as a small-town dreamer who loses and finds his way. His superlative acting abilities cause us to identify strongly with him (how many of us have lamented--even to ourselves--that no one seems to notice the sacrifices we've made?), which is, I think, why the movie bears up under so many repeat viewings. Reed is just lovely here, the epitome of sunny girlfriend, caring lover, devoted wife, dedicated mother.<br><br>Capra's talent as a screenwriter are all over this script. He knows just how hard to tug the heartstrings without becoming overblown or phony. And his technical wizardry is evident too. I've never seen--before or since--more natural-looking onscreen snow.<br><br>Watching IAWL has become a tonic, a pick-me-up when I really need one--whether it's the Christmas season or not. Its message--that each one of us is important and has *something* to contribute to the greater good--is one about which the world could use some reminding from time to time.","user":"dweck","rank":[376,406]},{"title":"A Great Influence...","rating":10,"date":"4 March 1999","review":"No movie ever made has influenced me more than this classic. I had the honor of doing a play version of it about 5 years ago. I had seen the film thousands of times, had loved it, but I never really knew what it meant. During the course of the production, I suddenly felt alive. I felt that I wasn't having enough fun. I felt that I wasn't doing enough in my life. Crazy things, like kissing my mother or my father. I hadn't really hugged one of them in a while. It makes you think. It's more of a thinking person's film than a mere Christmas film. If you think it's just a Christmas film, I insist you watch it again and again, until you get the message.<br><br>Stewart gives the finest performance of his career, in one of the most difficult characters ever portrayed. A character all of us are familiar with...a person looking to find himself/herself. It's the great struggle for finding what it is in life you really want to do. George Bailey teaches us so lessons throughout the film and in the end he teaches us the most important lesson of all, that life, although a long and winding road, truly is (for lack of a better word) wonderful...","user":"Coxer99","rank":[344,387]}]