[{"title":"Holmes' Creeping Menace","rating":10,"date":"11 February 2005","review":"While searching for THE PEARL OF DEATH, Holmes &amp; Watson encounter a master criminal and his terrifying backbreaking thug.<br><br>This vivid &amp; suspenseful film makes a welcome addition in the series of movies highlighting the exploits of Baker Street's most famous inhabitants. There is danger around every corner and Holmes must match his intellect against raw brute evil as he attempts to recover the Black Pearl of the Borgias. As always, Basil Rathbone &amp; Nigel Bruce are beyond praise as they bring Sir Arthur Conan Doyle's celebrated characters to life. To the viewers' delight, Holmes finds he can be thoroughly duped and Watson uses his mouth for something other than gab.<br><br>Holmes' rivals for possession of the Pearl are little Miles Mander and pretty Evelyn Ankers. Together, they provide the master detective with one of his most challenging cases. All three characters (most especially the men) make good use of cunning disguises to try to find the diminutive treasure.<br><br>Dennis Hoey as the inept but courageous Inspector Lestrade and dear Mary Gordon as Mrs. Hudson return to roles they've already essayed very well in the past. The always reliable Ian Wolfe has the small part of a helpful crockery shop proprietor.<br><br>The most intriguing member of the cast is Rondo Hatton, a tragic sufferer from acromegaly, a terrible disease which deformed his body into a grotesque horror. He is most effective as the sinister Creeper, especially during his few moments with Rathbone at the film's climax, and he was immediately spun-off into cheaply produced chillers playing essentially the same character. Apparently he hated being exploited, but this was to end sadly with his sudden death in 1945.<br><br>Movie mavens will recognize an uncredited Billy Bevan as a meal-bearing constable.<br><br>This film was loosely based on Conan Doyle's short story The Adventure of the Six Napoleons. It was preceded by THE SCARLET CLAW (1944) and followed by THE HOUSE OF FEAR (1945).","user":"Ron Oliver","rank":[14,15]},{"title":"Another excellent adventure for Sherlock Holmes!","rating":9,"date":"25 June 2005","review":"This entry in Universal's awesome and prolific series of Sherlock Holmes films is one of the best that I've seen. The series works because it offers a solid hour (or so) of light entertainment, which it peppers with good humour and an engaging plot; and that is something that is masterfully handled with this movie. The plot of this film is great, and it follows Sherlock Holmes as he makes a rare blunder which leads to a rare and valuable pearl being stolen from a museum. It is then left up to the main man to make up for his mistake as he attempts to search for the lost gem and get to the bottom of the mystery surrounding it's disappearance. This plot makes a great base for a tale about the great detective as it puts him in a position that we don't usually see him in - the man in the wrong. Aside from being amusing, this also gives us the chance to see a different side of Basil Rathbone's portrayal of the great detective. His mannerisms and facial expressions as he realises the trouble that his showboating has brought are priceless, and a highlight of the series on the whole.<br><br>Basil Rathbone and Nigel Bruce make for a great on-screen duo as Sherlock Holmes and his sidekick, Dr Watson and they are joined by the inept police sergeant; Lestrade, and that only increases the comedy element of the movie. The plot line this time doesn't break any new boundaries where mystery plotting is concerned, but it ensures that the film always runs smoothly through it's short running time. It also makes for some great dialogue, and Holmes' speech towards the end is of particular note for being really well done. The atmosphere for this movie is really well done, and as we follow someone that breaks people's backs during the night; this helps the story immensely. My only criticism of this film really is the same one that could be applied to most of the series, and that's that the film is far too short, and we can never really get our teeth into the mystery because the film just isn't on for long enough. However, aside from that this is still a very good Sherlock Holmes adventure and if you've enjoyed other entries in the series, no doubt you'll like this one too.","user":"The_Void","rank":[19,22]},{"title":"The Case of the Borrowed Ending","rating":26,"date":"26 February 2004","review":"Somehow the ending of THE PEARL OF DEATH was picked up and plunked down into MURDER, MY SWEET: The unarmed Detective in the dark, faced up against Miles Mander and a hulking brute, turns the tables through his understanding of the relationships between the characters. I wonder if the writers at RKO ever acknowledged this swipe from Universal? At any rate, both films make good use of lighting and creepy sets to exploit the situation, and both directors (Dmytrick &amp; Neill) know how to use the limited acting skills of Mike Mazurki and Rondo Hatton to best advantage. I liked Rathbone's pithy comment to the Police when they arrive to catch the baddies, \"You won't need your revolver. Nor handcuffs. Worthy of a hard-boiled Private Eye in any film noir!","user":"c532c","rank":[14,16]}]