[{"title":"This Weird Movie Will Catch You in Its Web","rating":8,"date":"8 April 2008","review":"A bizarre, evocative film which seems strange even now -- I can't imagine what audiences made of it in 1985. <br><br>William Hurt and Raul Julia play cell mates, one gay, the other straight, rotting away in a Latin American prison under the iron thumb of a tyrannical dictatorship. At first, Julia's Latin machismo makes him repelled by Hurt's flamboyant femininity, but the two gradually bond, thrown together as they are, and discover a kind of love that transcends conventions about love and sex and that can probably only exist between two people surviving in extreme conditions.<br><br>Hurt, already known as a strapping leading man at the time, took quite a risk playing this fey character, especially at a time when movies still weren't comfortable with mainstream portrayals of gays, but his risk payed off -- he won that year's Best Actor Academy Award and became just about the hottest actor in town for a few years there in the mid-80s. Julia has a much less showy role, but the success of the film is dependent upon the strength of both male leads, and he delivers. Sonia Braga plays the eponymous spider woman, a dream figure cobbled together by both men from their imaginations and memories of old movies.<br><br>This film is a big downer, but if you enjoy well-acted, well-written stories, then the depressing ending is worth it.<br><br>Grade: A","user":"evanston_dad","rank":[37,40]},{"title":"\"Film within a film\" really works","rating":9,"date":"26 August 2002","review":"Reading the other reviews, I see that homophobes have been duly warned about this movie, so I won't say anything about the relationship between the two men beyond that it is complex and beautiful.<br><br>What interests me more for the purposes of this little blurb is that no one has commented on how the \"film within a film\" (much like the \"play within a play\" in Hamlet) reflects the actual events unfolding in the prison cell. Molina (William Hurt) is ostensibly retelling his favorite film to entertain Valentin (Raul Julia) and make the time pass more quickly, but he himself admits that he \"embroiders\" the story to make it more real.  So who is to say if this film exists except in Molina's mind, and if it does, what really transpired in the film?  The story about the French woman who is in love with a German officer during World War II, and must decide whether or not to betray him, is an obvious parallel to Molina's decision to betray Valentin or not.  Even Molina says that he most identifies with Leni La Maison (Sonia Braga) in this film of his, and it's not just because he is a drag queen. It's because he has to choose between the man he loves and \"patriotism\" (in his case, represented by the police/government as well as his ailing mother).<br><br>This storytelling tactic works brilliantly, in my opinion.  Kiss of the Spider Woman is indeed original, quirky, and a must-see.","user":"deming","rank":[73,83]},{"title":"Powerful stuff...","rating":9,"date":"5 December 1998","review":"This film, about two thoroughly different souls turning into each other, is one of the all-time greats. The writing is crisp, the acting is phenomenal, and the story is exquisite. I have read the book in both Spanish and English, seen the musical four times, read the script of the play, and watched this movie over and over again... I recommend it to anyone who wants a true powerhouse drama, not a schmaltzy tearjerker.","user":"Tesse","rank":[49,60]}]