[{"title":"The best Jaws-inspired flick swimming around out there!","rating":10,"date":"20 May 2008","review":"Debut film of B horror director Joe Dante is this fun, exciting Jaws spoof that's the best of its kind! <br><br>A school of deadly, mutant piranha is released from a government laboratory and it's up to an alcoholic man and his detective love-interest to warn folks down stream!<br><br>A fast-paced, campy, and humorous ride all the way, Piranha is a genuinely entertaining B film that recalls not only Jaws but many of the classic monster flicks of the 50's. The screenplay by John Sayles has lots of good suspense and a witty kind of humor. Dante's direction is nicely done, keeping the energetic mood of the film high. The special FX aren't half bad, especially considering the limited budget. In fact the movie packs some truly gory images. Pino Donaggio's music score is beautifully well done.<br><br>Stars Bradford Dillman and Heather Menzies are quite good, making for some amusing and unlikely heroes. The supporting cast is good as well and has a number of veteran actors - Kevin McCarthy, Keenan Wynn, Dick Miller, and Barbara Steele.<br><br>Over all, Piranha is a good old-fashioned horror delight for genre fans. See it!<br><br>**** out of ****","user":"Nightman85","rank":[31,38]},{"title":"This movie bites....in a good way.","rating":15,"date":"15 November 2004","review":"In the wake of \"Jaws\" came countless man vs. nature flicks with everything from bees to grizzly bears to frogs coming out to get man back for his crimes against the ecology (and don't forget \"Night of the Lepus\" in which huge bunny rabbits munched on hapless victims!) This film is considered one of the best imitators, primarily because of its tongue-in-cheek approach and it's deliberately campy writing and casting. Menzies is a hotshot missing persons expert who goes in search of two young hikers who have disappeared. She enlists the aid of hermit-like Dillman who lives near an abandoned government testing facility where the hikers were last suspected to have been. When they come upon a murky tank and believe the bodies could be at the bottom, Menzies releases the contents, unwittingly unleashing a school of vicious, genetically-altered piranha onto an unsuspecting river full of camp kids and park revelers. From there, it's a race against the clock to get to Dillman's young daughter who is about to enter a camp relay race in the water downstream. The film is deliberately peppered with actors who've made their mark in either horror or suspense films and it makes no pretenses about its lack of originality (though it does manage to come up with some despite itself!) Dillman (sporting an atrocious come-and-go Southern accent) and Menzies have a surprisingly decent rapport with each other with a few amusing scenes tossed in amongst all the panic. McCarthy pops up as a terrified scientist who knows his plans have gone awry. Wynn has a cameo as a gruff, but likable neighbor of Dillman's. Steele plays an ominous scientist in cahoots with Army colonel Gordon to keep the whole situation under wraps. Bartel is the persnickety camp counselor and Miller is the smarmy amusement park owner, both of whom disbelieve that there's any danger. Despite it's minuscule budget and rather homemade effects, the film does generate a bit of eye-opening gore and more than a little discomfort as these tiny fish nibble away at anything in the water. If \"Jaws\" caused people to avoid the ocean, this film could make people think twice about cloudy rivers and lakes! The murkiness of the water only adds to the horror of it all as the bikini-clad tourists and innertube-wielding kids can't begin to see what's coming. It's just a sting, then a nibble, then blood everywhere! Some of the effects are tacky and amusing, but there's a certain level of true fear as well. If one likes this genre to begin with, it will probably be a pleasure to watch. Others may be less enthralled.","user":"Poseidon-3","rank":[29,36]},{"title":"Not just a cult film, but a cult film with all the right moves!","rating":10,"date":"10 July 2005","review":"On a dark, foggy night, two back-packers ignore the \"no trespassing\" sign, to engage themselves in a rest after a long while of mountain-climbing. They discover a pond, and instantly feel obliged to cool off. Before they can manage to enjoy this nice break, the most horrid feeling comes over them, and both become victims of a savage death, resulting in blood, only blood. Such an opening is familiar, yes, but also attention-getting, and enjoyable. This is \"Piranha\", the 1978 camp-classic horror film from acclaimed director Joe Dante and the production of Roger Corman. Given, the production values are some what less than \"Jaws\" and \"Close Encounters..\" but the heart and joy of film-making is also there, and thusly, the film is much more enjoyable than most Hollywood film of that era. The film is scripted by a then, young John Sayles, whom also makes a cameo! The two leads, Bradford Dillman and Heather Menzies are perfect, and chemistry is dead-on making for a very fun time indeed! The writing is, perhaps, the best part of the film, seeing as Corman obviously wanted a real cultish feel, and as such, the film has so many noticeable , fun, and convenient in-jokes such as a swimmer reading acclaimed novel 'Moby Dick', and lazy workers watching old cartoons involving fish. The thrills are pretty good too, seeing as the situation involves genetically enhanced knowledge within the fish. Therefor, it is much harder for Dillman and Menzies as they attempt to over power the deadly fish while chasing them down stream a beautiful Texas river. Dillman and Menzies lead a cast of familiar faces seen in earlier Corman films such as Paul Bartel, Dick Miller, and Barbara Steele. The piranha themselves don't look too bad, and thusly, the effects are pretty good for a low budget film such as this. Other goodies are one-liners, and other dialogs that are so witty, they will either make you howl, or are just plain great to hear over and over again. Yes, this film has all the right moves, as well as many other to boot! It is comic when needed, and when the element of serious conflict is present, so is the presence of serious characters. This film was remade in '95, with the most wretched cast and concept ever! And the thought of another remake causes my blood to boil! You cannot re-create an original classic! That is what makes it original! In any case, this film is a great classic, and an always enjoyable film, every time viewed!","user":"Banshee57","rank":[33,42]}]