[{"title":"Sad end to the life of author Charles Jackson (The Lost Weekend)","rating":20,"date":"20 August 2006","review":"In 1968, I was just 22 years old and driving a taxi part-time in Ft. Lee, New Jersey. One day, I drove Charles Jackson (author of \"The Lost Weekend\") from Englewood Cliffs, NJ to a run-down hotel in Times Square, New York City. I had seen and really liked the movie of the same name, starring Ray Milland, who did a wonderful job portraying an alcoholic on a weekend binge. The film was so realistic, I had a strong feeling that Charles Jackson had written the book based on his own life. I got up the nerve to ask him, and he told me that....yes, he indeed was the alcoholic portrayed in his book. We talked quite a bit about his life on the way into Times Square. He seemed like a very nice person, although he seemed quite depressed. However, it still came as quite a shock when, shortly after having him in my cab, I read in the papers that he had hung himself in his hotel room in NYC. That's an experience I will never forget!","user":"gene-perr","rank":[128,136]},{"title":"Powerful landmark film on alcoholism has lost none of its status...Ray Milland deserved his Oscar...","rating":16,"date":"16 April 2001","review":"I take exception to previous comments that call the film \"daring for its time\" or \"dated\". It's still a very powerful film and there is nothing dated about the theme of a man who loses his soul to the bottle. It was a landmark film in its time and still is--there is no question about its holding power and the excellence of writing, acting and direction. Yes, even by today's standards! It outclasses more recent films dealing with alcoholism as it focuses on one man's problem with the bottle--a problem that affects all of the people whose lives he touches--particularly his loyal girlfriend (Jane Wyman in one of her best roles) and Philip Terry as his more conventional brother. The emotions are stark and real. The pity we feel for Milland's character is also mixed with disgust for his weakness. It's an accurate depiction of an alcoholic's struggle for the next fix--a never ending search for the next bottle. The pseudo-babble of a previous commentator attempts to inject disdain for the film as outdated and outclassed by more serious works. Nonsense! This was a stark and powerful film in 1945 and I have news for you--it is just as powerful and timely today! No other American film comes close to it. It is as searing an indictment of alcoholism as you are ever likely to see and Milland fully deserved his Oscar.","user":"Doylenf","rank":[111,121]},{"title":"\"Before 'Weekend', alcoholism was treated as something funny. There were character actors who only played drunks, and always for laughs.There's nothing funny about a drunk.\"","rating":21,"date":"21 April 2006","review":"The often stated belief that alcoholism is a mere bodily addiction does not do the truth any justice. Alcoholism is more. It's a state of mind. It's addictive escapism for those who feel cheated by life, a way of avoiding fears and unhappiness, an illusionary method to make up for ones failures. Maybe that's why most therapies do not succeed. They solely concentrate on the illness, rather than on the cause of it. Of course, in many cases the cause cannot be helped...<br><br>In The Lost Weekend we accompany the failed writer Don Birnam (Ray Milland) surrendering to the self-destructive nature of his addiction. Despite being good-looking and intelligent, Don is a hopeless alcoholic filled with self-loathing (\"The reason is me. What I am. Or rather what I am not.\") The brand doesn't matter, the cheaper the better  to him it's all the same. Drinking seems to be his only way to escape from his misery and low self-esteem. \"Suddenly I'm above the ordinary. I'm competent. I'm walking a tightrope over Niagara Falls. I'm one of the great ones. I'm Michaelangelo, molding the beard of Moses. I'm Van Gogh painting pure sunlight. [...]\" That's what a drunk Don tells his favourite barkeeper Nat (Howard Da Silva).<br><br>Yet, in one aspect he is lucky. Unlike many of his fellow sufferers he is not alone. After years of abuse, his faithful girlfriend Helen (Jane Wyman) and his brother Wick (Phillip Terry) have still not deserted him. Compassionately they do their utmost to protect Don from himself by keeping him under close observation. With great effort they determined the most inventive hiding-places of his bottles and they even visited nearby liquor stores and bars, begging not to accept Don as a customer. There is nothing they haven't tried, but Don appears to be beyond salvation (\"I am not a drinker. I'm a drunk.\" he tells them.). Just before the three of them are about to go on a weekend trip, Don devises a cunning plan to temporarily get rid of the two persons who care about him, giving him time to acquire the liquid he treasures the most. Soon he is stone drunk, staggering through the streets, always on the lookout for the next drink. For Don there will be no weekend trip. Only the bottle and the desperate humiliations connected with attaining it.<br><br>The Lost Weekend is a a drama of great emotional vehemence, lacking the light heartedness of Billy Wilder's later works. It gives unclouded insight into the darkest corners of alcoholism and depicts the powerlessness of the alcoholic over himself. Wilder created great controversy at that time by letting the lead actor succumb to his addiction. He didn't shy away from showing the addict's humiliations when begging for money or booze. Neither did he hesitate to point out the addict's loss of all self-respect when stealing and lying to pay for his one need. The horrifying hallucination scene only adds up to the disturbing decline of Don Birnam's humanity, proving that the greatest horrors lie within our imagination.<br><br>This is an excellent film of lasting relevance. It is technically brilliant and shines with great dialogue (which is typical for Wilder). Its storytelling (flashbacks) is superior. Furthermore Ray Millard (Dial M for Murder) gives a terrific and equally courageous performance as the the self-destructive alcoholic. You can see the desperate self-loathing and calculating slyness of a true addict written on his face. <br><br>In the end it comes down to two choices. Don can give in to alcoholism and thereby give up on life. Or he can try to overcome his addiction and face his fears and discontentment. Although sheer will-power may not be enough to achieve the latter, it is essential for succeeding. And the cause isn't lost, for there is Helen to help and care for him. Don is not alone. May someone have mercy on those who are...","user":"Ford-kp","rank":[56,60]}]