[{"title":"I like it, so there!","rating":25,"date":"25 May 2003","review":"Watching CURSE OF THE FACELESS MAN transports me back to the days of \"Chiller Theatre\" on Saturday nights.  The premise of a man saturated with Egyptian embalming fluid and then sealed in volcanic ash and preserved by the radiation from deep within the earth is certainly an unusual one. (Notice how they sneaked \"radiation\" into the plot once again?)  It is also a movie you have to think about.  Quintillus \"sees\" through a sort of ESP and recognises the reincarnation of the woman he loved. Alas Richard Anderson is a little too hard headed as the hero.  Even after he sees Quintillus alive he refuses to believe his fiancee could have had a past life as the stone man's beloved.  Gar Moore, who had worked with Roberto Rossellini in the late 1940's, does not have much to do apart from spount some scientific jargon and looked concerned.  Bravo to Felix Locher as Dr. Emmanuel.  Mr. Locher, real life father of actor Jon Hall (Charles Locher) did not begin acting until he was 76. Look for him also in HELL SHIP MUTINY and in his most famous film, FRANKENSTEIN'S DAUGHTER.  The Faceless Man is played by Bob Bryant who usually did westerns.  The narrator sounds a lot like Morris Ankrum, could someone tell me if it is really him? The \"Museo di Napoli\" is actually Griffith Observatory and a stretch of beach in Venice, California not Europe, stands in for the Cove of the Blind Fisherman.  Okay so it is not full of CGI and the plot is predictable.  We watch B-movies to have fun, right? So let's watch it have fun like we did when we were kids.","user":"reptilicus","rank":[32,35]},{"title":"Brief review","rating":19,"date":"19 November 1998","review":"A citizen of Pompeii, entrapped by lava during the historic volcanic blast has turned into a solid stone mummy.  It comes to life, and assumes the film's leading lady is his lost love.  The usual fast paced, but cheaply made thrills by prolific genre director Edward Cahn (1899-1963).  The usual drive in stuff from that period.  The scenes where the stone man menaces the girl (who's one helluva screamer!) are a bit chilling.","user":"boris-26","rank":[13,16]},{"title":"Not without its amusements.","rating":6,"date":"30 April 2016","review":"Indeed, the title character of this patently ridiculous schlock feature does not have a face. Incased in stone, he was a slave named Quintillus Aurelius in the days of ancient Rome, when Mount Vesuvius erupted and caused the destruction of the city of Pompeii. He's discovered in modern times by archaeologists, and goes about crushing the skulls of people unlucky enough to merely be in his way. What he really wants to do is reunite with the long ago noblewoman he loved, who's conveniently been reincarnated as the movies' leading lady, Tina Enright (Elaine Edwards).<br><br>There's nothing particularly special here, but undemanding fans of low budget genre fare could find enough to keep them interested. It's cheaply made like so many other movies of its kind, and devotes too much of its time to exposition. There's also some pretty silly but endearing narration, which was spoken by the great and prolific character actor of the period, Morris Ankrum. The characters are entertaining (bravo to Felix Locher as Dr. Emanuel; he really looks like he's having fun reeling off that exposition). Edwards is a hell of a screamer, and both she and Adele Mara are definitely pretty ladies. Luis Van Rooten as Dr. Carlo Fiorillo and Jan Arvan as the requisite police inspector are solid. Richard Anderson is a jut jawed, decent enough hero as Dr. Paul Mallon, but man, oh man, is Paul a stubborn dummy. He remains hard headed and skeptical for too long.<br><br>In the end, this is an okay update of Mummy type stories, if not too memorable overall. Writer Jerome Bixby, producer Robert E. Kent, and director Edward L. Cahn truly hit paydirt with a subsequent joint effort, \"It! The Terror from Beyond Space\", the movie that many people regard as the principal inspiration for \"Alien\".<br><br>Six out of 10.","user":"Hey_Sweden","rank":[5,5]}]