[{"title":"The Human Condition II: Road to Eternity","rating":23,"date":"23 October 2014","review":"The Human Condition (Ningen no jôken) is a 9,5 hour long epic film trilogy directed by Masaki Kobayashi, based on the six volume novel by Junpei Gomikawa. The trilogy stays true to the novel's composition by being divided into six parts, meaning that each of the three installments are split in two parts, in between which are intermissions. Both parts in the first film begin with the same opening credits sequence, showing us some stoneworks portraying dramatic imagery (the similar intro opens all three films). The three movies, each long 3 hours or more, are called No Greater Love, Road to Eternity and A Soldier's Prayer.<br><br>So far, I'm two thirds into the trilogy and I find Road to Eternity to be lesser than the first film. RtE follows Kaji as a conscript in Japanese military, first concentrating on his experiences during basic training and later shifting to a battlefield. Now, RtE surpasses NGL on a technical scale; there's no sugar-coating of historical events, no Japanese actors trying to pass up as the Chinese (except in one, scarcely important scene) and no melodramatic orchestral music (instead, RtE sports a militaristic, more quiet soundtrack). <br><br>However, this entry in the trilogy reaches the point when the entire story starts to get really repetitive and you really get the feeling that you've seen Kaji humiliated and beaten up enough times to start getting tired by the film. There are a LOT of forgettable scenes of little importance which do nothing but prolong the runtime in order to provide artificial oomph. This is also true for NGL to some extent, but in the first movie I found the storyline to be way more absorbing. Most of RtE occurs in darkly lit, claustrophobic barracks and tight areas where you can't even differentiate the characters. This change of location just isn't as interesting to me as the camp in NGL, but it makes sense because Kaji's humanism is completely beaten to the ground in this movie, and the sudden set change reflects that.<br><br>Even though I think that the second movie is less captivating than the first, it still has two powerful things going for it; first, the cinematography, once again, is absolutely amazing and Kobayashi once more shows his talent in crafting widescreen, chiaroscuro shots. Second, the final 30 minutes on the battlefield are brilliantly shot, acted out, put together and manage to be brutal, tense and contemplative all in one. Obviously the actors playing the Soviet soldiers are Japanese so Kobayashi doesn't show their faces, but I think that little detail actually adds to the movie's symbolic value.<br><br>By the way, the reason why this is the shortest entry in the trilogy is probably because it was cut. The scene where Michiko strips naked for Kaji was censored by a government comitee.<br><br>7,5/10<br><br>I should also mention that this movie heavily inspired Stanley Kubrick's Full Metal Jacket (which I think is a much better film by the way). The novel upon which FMJ is based on, The Short-Timers, was written after Kobayashi's trilogy. Here are the similarities between the two films:<br><br>1) Both films are divided into two parts. First part is basic training, the second is set on a battlefield.<br><br>2) The main characters in both films (Kaji, Joker) are recruits who oppose the brutal military conditioning, but in the same time are able to adapt to their surroundings without losing their ideals. Both Kaji and Joker have feuds with their respective drill instructors, however the DIs also respect them to a point for showing their guts.<br><br>3) Both Kaji and Joker befriend a fellow recruit (Shinjo, Cowboy). They have discussions while cleaning the toilet.<br><br>4) Both groups have a weak, slow recruit who isn't able to adapt to given orders. In RtE it's pvt. Obara (who strangely looks like pvt. Baldrick from Blackadder Goes Forth), in FMJ it's pvt. Pyle. In both films, they do something stupid which makes the DI hate them (throwing a cigarette in the water barrel in RtE, hiding a jelly doughnut in FMJ).<br><br>5) Kaji/Joker takes Obara/Pyle under his wing, but everyone else hates the weak recruit. This character is constantly humiliated in both films. In FMJ, he's forced to act like a baby, while in RtE he has to behave like a geisha (sgt. Hartman also likes to compare his men with ladies).<br><br>6) Both characters get fed up and commit suicide on a toilet seat by pointing the rifle upwards and shooting (Pyle out of insanity, Obara out of shame). The music in this scene is very similar in both Kubrick's and Kobayashi's film. Pyle's suicide isn't committed on the toilet in The Short Timers, but instead in front of the other members of the group.<br><br>7) Some training sequences and punishments are very similar, if not identical.<br><br>Here's the album with comparison images: http://imgur.com/a/XeNP5","user":"mevmijaumau","rank":[10,10]},{"title":"one of the great (anti) war movies ever, certainly the pinnacle from Japan","rating":10,"date":"27 July 2008","review":"The Human Condition isn't an easy trilogy; it offers up tons of questions that even today have extreme relevance, particularly about man's duty to himself, to love and family, to country, to affiliation by an Emperor or Dictator, and what it is that's so insane about men in the staggering pit of hell known as war. As one can see in the second installment, The Road to Eternity, even what should be simple in a conventional war movie is turned just a bit to see the ugliness underneath. The first half of the film is Kaji, the trilogy's protagonist, in basic training and witness to more brutality towards the weak Obara (very well cast Kunie Tanaka) who commits suicide following a string of humiliations that are like Private Pyle squared Japan WW2, and how Kaji comes to grips with being a very good, disciplined soldier- the likes of which the army wants to control as they promote him- and, crucially, his last night spent with his wife Machiko (very tender performance from Aratama).<br><br>The second half is Kaji off on the front lines, leading up to a big, climactic battle between Soviet and Japanese forces, which is a total horror. Although Kobayashi only goes so far to make these battle scenes dynamic (that is compared to today's battle scenes, which have far more money and just a smidgen more gore to work with), it's overall another incredible accomplishment, as story and character matter always more-so than grandiose visuals or pomposity. We see Kaji going through another level of change, as he's stripped of his \"exemption\" status and is now just another grunt in this rigidly regimented military, and where, as is expected but no less mortifying, the Japanese see no sign of victory despite all signs pointing otherwise.<br><br>As in the first film, Kobayashi delivers moments of beauty, almost at times without trying. I absolutely was floored when the prairie fire scene turned into a desperate chase between Kaji and an escaping Shinjo, where what could have been a basic chase incorporated the fire and smoke and mud-piles into something else entirely. Or, indeed, little moments that suddenly make one's mouth agape, such as the freak-out from a soldier in the midst of the battle foaming at the mouth. If a few scenes might appear to be of the conventional sort (at least as much as Kobayashi would ever allow in this iconoclast approach), they're off-set by the wonderful performances, not least of which by Nakadai. Again he gives it his all, and matures just a little more, and displays a kind of bridge that Kaji is on between the kind-hearted but firm ways of No Greater Love and the, dare I say it, near bad-ass persona in Soldier's Prayer.<br><br>It's another great entry in an impeccable trilogy, if maybe not quite as awe-inspiring as the final film.","user":"Quinoa1984","rank":[20,22]},{"title":"The continuing story of Kaji--a man born at the wrong time and the wrong place.","rating":9,"date":"24 March 2012","review":"This is the second of three films that make up \"The Human Condition\" trilogy. The extremely long films are based on an extremely long set of novels (in six volumes) by Jumpei Gomikawa. The books are about the journey of a man named Kaji who is simply born at the wrong time and place. His ideas about the worth of the individual and the humanity of mankind fly in opposition to the militarism of WWII-era Japan. And, not surprisingly they get him in lots of trouble. In the first film, he's assigned to be the production manager at a mine that is worked by prisoners--and the people in charge couldn't care less about how many of them they kill in the process. But Kaji's humanistic ideals are put into action instead and at first they are very successful. But the military men hate him and when he stumbles, they attack him like wolves.<br><br>Here in part II, Kaji's been drafted and sent to basic training. He's seen as a trouble-maker because of his experience at the labor camp, but Kaji is a great soldier. And, unlike the average soldier in the company, he cares about the individual. So, when recruit Obara is beaten and humiliated, Kaji is the only one who sticks up for the guy--although with only one man supporting him and the rest tormenting him, what happens next isn't at all surprising--Obara kills himself. The soldiers in the unit are actually pretty happy about this--Obara was a weakling. But Kaji refuses to back down and fights his superiors, as he is fighting for what is right--and brutalizing and disregarding a weak individual is wrong.<br><br>Later, Kaji manages to be promoted and he's placed in charge of a group of older recruits (as the war is going badly, they began bringing up less and less fit men to serve). He refuses to brutalize his men and the leaders of the older veterans beat Kaji up regularly. He refuses to fight back--sort of like Gandhi. Again and again he's beaten and again and again he does nothing. And, he tries to protect his men as much as he can.<br><br>Later, when the war is all but over, Kaji is sent along with other ill-prepared men to meet the Russian army and their tanks. And, after this slaughter occurs, the movie ends...and Kaji is left alive on the battlefield.<br><br>Much of the film seemed to be a criticism on the pointlessly brutal system where underlings were beaten for no reason whatsoever by their immediate superiors. The officers did nothing to change this and Kaji still refuses to bend to this insane situation. Instead of training focusing on teamwork and camaraderie, it's based on destroying the weak and empowering the amoral. All in all, a depressing but well made indictment on the Japanese militaristic mentality of the day. If you are looking for a similar sort of film, try finding \"Fire on the Plains\" (also 1959) or \"The Burmese Harp\" (1956). Well worth seeing.","user":"MartinHafer","rank":[7,7]}]