[{"title":"Enjoyable time-passer ...........","rating":6,"date":"6 July 2006","review":"Fred MacMurray starred in a number of interesting color westerns in the 1950's. In this film, 3 brothers come face to face with violence, cowardice and personality conflicts. MacMurray , with his laconic sense of irony, shines in this film.<br><br>Jeffrey Hunter has the key role of the the young brother. Hunter was a great actor, who is best remembered to day for his role in The Searchers. He performs well in this one and is a good match for this interesting role.<br><br>This movie is only slightly above average, being aided by two fine actors at the top of their game. Worth a look for that alone ........","user":"revdrcac","rank":[17,18]},{"title":"You won your way, what difference does it make?","rating":6,"date":"17 November 2011","review":"Gun for a Coward is directed by Abner Biberman and written by R. Wright Campbell. It stars Fred MacMurray, Jeffrey Hunter, Janice Rule, Chill Wills, Dean Stockwell and Josephine Hutchinson. Out of Universal International Pictures, film is a CinemaScope production in Eastman Color, with photography by George Robinson and music by Joseph Gershenson.<br><br>Three brothers must contend with big personal differences whilst also trying to see off a band of cattle rustlers who are pillaging from their herd.<br><br>But you don't cover me with your shadow.<br><br>So many good things involved with this production it feels unfair to label it as dull, but dull is ultimately how it ends up being after film has run its course. The cast assembled is a strong one, the dialogue is sharp and well written, and the location photography out of Vasquez Rocks Natural Area Park is most pleasing. Prolific Western scorer Gershenson also produces a highly effective score, very reflective of the characters' stuttering emotions. But with a running time of almost 90 minutes the makers have over stretched the family feud premise by having too many periods of story inactivity. Biggest problem of all is that the coward of the title, Bless' (Hunter) back story is never fully formed, adding little snippets here and there doesn't do it justice. For instance: it's only late in the day that we find his reputation is tarnished outside of his family, the whole damn town are down on him. A better director than jobber for hire Biberman would surely have got more from this tortured character axis.<br><br>Stockwell and Hunter are not the best of actors all told, but they fit right into the roles of two brothers made of different stuff. Stockwell does a good turn as the young and fearless one, and Hunter as the middle brother of the three effectively conveys the psychological pangs that sting him during the plot. The elder brother is played by MacMurray, who offers up a weary surrogate father performance for this fatherless family. It's the death of the father that is the catalyst for Hunter's problems. While Hutchinson adds a bit of class as the fretful mother and Wills is always good value for money. Rule gets the short straw from the screenplay, in what is a critical (two fold) role, she isn't asked to do anything other than look pretty and say soothing words to tortured Bless. The action is competently constructed, though the art of throwing a convincing punch is sadly missing here. And the ending, whilst being predictable (no shades of the far superior Saddle the Wind here), has enough warmth about it for those not in need of blackness in their Western viewings.<br><br>By definition it is very much a B movie in the truest sense of the term, but there is good in the production, even if it is undone by slackness elsewhere. 5.5/10","user":"hitchcockthelegend","rank":[10,10]},{"title":"OK, but many boring repeated scenes, and no evidence of cowardice","rating":7,"date":"8 July 2012","review":"I read most of the reviews here, but saw the movie anyway because I like Westerns and Janice Rule, and I especially enjoyed two other Fred MacMurray Westerns, \"Good Day For a Hanging\" and \"Face of a Fugitive.\" The latter is a classic in my opinion.<br><br>Most of the movie was worthy -- the stars, production values, general story outline, dialog. It held my attention. But, I have to agree with most of the reviews here: there were long, boring, repetitious stretches. There were too many indoor talky scenes. The cattle drive scenes seemed small, cramped and cheap. There were hardly any scenes involving action, excitement or suspense.<br><br>My biggest complaint is that the movie consisted mainly of repeated boring scenes where Jeffrey Hunter's character declined to fight (with fists or guns) his adversaries. Some branded him a coward for this, but the way the scenes were structured, it seemed to me like a smart move to avoid meaningless, risky fights.","user":"chipe","rank":[7,7]}]