[{"title":"A beautiful film- and not only at Christmas.","rating":10,"date":"8 December 2006","review":"It's too bad that this film is unavailable in the United States. Many years ago it was given to me by a friend who taped it off some obscure broadcast station. I've shown it every year since and have never grown tired of it. There is much truth in this film, and all of its characters reveal something of themselves that we can all identify with. And what a cast-- Ralph Richardson, Celia Johnson, Margaret Leighton, Denholm Elliot, and Hugh Williams! Richardson's parson is one, regardless of one's faith, we would all love to know. And Johnson and Leighton display acting of the highest order. Elliot is superb as the restless son, and Williams as a world weary but understanding and compassionate friend of the family has never been better. This is a film that deserves wide attention and should be a Christmas staple. It is not only my favorite Christmas movie, but also one my ten favorite films of all time.","user":"bdwittkamp","rank":[37,39]},{"title":"A Lost Treasure","rating":9,"date":"17 February 2004","review":"Until recently I had never heard of this little gem of British holiday sentiment. I heard someone call it the \"Christmas movie for people who don't like Christmas movies\" and the quest to find it was on.<br><br>This is the story of a Christmas in which the emotionally wounded family of a Church of England clergyman come home and attempt to have a happy holiday. What happens is not your typical happy tearjerker, nor is it a Christmas nightmare. Its a reasonably realistic, as much as films of the time could be in 75 minutes, look at a family of emotional cripples as they all try to put their lives back on track. The ending while hopeful is far from certain, so much so that I cursed the fact that it didn't go on another five or six hours, my sole complaint about the film.<br><br>A word of warning, don't abandon the film until you get to the end. I wasn't enraptured of the film for almost two thirds of its running time. I was interested in what was happening but I didn't know if I liked it, and then suddenly all of the pieces were in place and it became this charming atypical jewel of a movie.<br><br>Forget Its a Wonderful Life, watch this instead, its so much more real.","user":"dbborroughs","rank":[50,54]},{"title":"An excellent film that is not often shown","rating":10,"date":"2 March 2003","review":"I think I have only seen this film about 3 times in my life.  But the impact it had on me each time I saw it was great.  A tremendous British cast, in a tremendous British film.  It just simply is not shown often enough, and on top of all that it is not available on Video/DVD.<br><br>A story of a family brought together for Christmas, and their lives during the war years clearly showing through.<br><br>Please let us have a change from the usual Christmas line up.  Either give us a treat and show it over the coming Christmas or release it on Video/DVD. After all, how many variations of a Christmas Carol can somebody take over the festive period year after year.","user":"Rosalind Jane","rank":[47,51]}]