[{"title":"Above all, a love story","rating":18,"date":"18 January 2006","review":"It's been a quarter century since I first experienced Altered States, Ken Russell's take on Paddy Chayevsky's novel of the search for a common bond between all of us, the ability to love. I personally don't care if Chayevsky disowned the movie or if Russell resented him for it or how many angels you can set on the head of a pin, for that matter. Altered States is a harshly beautiful and intellectual movie based on a book with the same adjectives.<br><br>I'm not going to praise the fine performances, the dazzling special effects, or the painful, emotional epiphany that the lead character, Eddie Jessup (William Hurt) experiences as he fights his way past the roadblock of pure intellect. I want to praise Altered States for its emotional and intellectual message of the power of love to embrace us all and heal our wounds.<br><br>Altered States is not for the weak of stomach or the easily offended. The imagery is disturbing and, at times, repulsive. There are scenes of blasphemy that I know have put off Evangelical friends of mine. But the central idea of a commonality, a kinship that humans have with one another and the danger of setting oneself apart to avoid the pain of interacting and loving is, I believe, supremely satisfying at both an intellectual and emotional level.<br><br>Altered States isn't one of the very best films I've seen, but it surely has been a source of joy for me. And if it doesn't turn your crank--or turns it the wrong way--then find your joy in another film or other media . . . and remember to love.","user":"inspectors71","rank":[116,132]},{"title":"One of Ken Russell's best films","rating":8,"date":"11 October 1998","review":"This is one of Ken Russell's best films. He manages to balance plot and wild visuals as never before. The acting is also first rate. I watched it again recently I think it still holds up surprisingly well compared to many modern sci-fi movies. The plot is intriguing, I keep thinking that there might be some truth to the concepts presented, and the fact is that our own brains are still largely unexplored territory. A special mention to the extraordinary music written by John Corigliano, and for which he was nominated for an Academy Award. It dares to be loud and violent, and complements the visuals extremely well. This is a wild, original movie unlike any other.","user":"fred-83","rank":[42,51]},{"title":"Not just for the FX...","rating":9,"date":"3 December 2006","review":"Okay, the character of Dr. Eddie Jessup is kind of a pompous ass, and there are a few groaner moments of, call it, self-importance.<br><br>But this movie breaks real ground. <br><br>One of my all time favorites.<br><br>And I'd like to point out that everyone is crazy about the much-touted and notoriously-expensive hallucination sequences, ... <br><br>Of course if you've seen Russel's \"Tommy,\" some of the over-the-top sequences will look familiar and tinged with peculiar British-isms. And then there's the ending - well, it's controversial, that's for sure - anticlimax or not ? <br><br>But for me the most electrifying parts are the ensemble cast acting. <br><br>In the scene where Blair Brown is trying to cope with the trauma of the events in the isolation tank room, there's a very beautifully conceived long single shot through house windows. Russel needs credit especially for the argument between Balaban and Haid - some of the best acting I've ever seen - character actors hardly EVER get to put this kind of stage-acting energy on film. It stays with me still. They truly seem absolutely furious with each other, their lines overlap, it's absolutely convincing. <br><br>Some of the greatest effects of this movie are simply good movie craft - when Jessup first sees the love of his life walk through the door, fantastically back-lit, and the music comes up and cross-fades into the next scene - it's breathtaking.<br><br>It's the moments like that, and the very intro of the movie, with the slow title crawl, the deadpan lines read by Balaban, the first shots of Hurt in the tank, the eerie music ... This movie still stands out, still looks good,... and stands superior to other, more recent imaginings of internal hallucination become external.","user":"boomaga1","rank":[51,63]}]