[{"title":"A masterpiece of NYC hard-edged realism","rating":10,"date":"29 April 2005","review":"This is an intense, unremitting, intelligent and incredibly fast-paced film which blends action, cinematic realism, art and humor into a masterwork of hard-edged crime drama. But to categorize this film as drama, suspense or action really does violence to it. This is just a great film, and it doesn't fit comfortably into any category with which I am aware. <br><br>Don't look here for any sense of fantasy-justice or n'er-do-wrong comic book heroism. Look here instead for gut wrenching nihilism, frustration with the unfairness of criminal justice in the hands of bureaucracy, and a solid, plot-driven story about a couple of cops who are just trying to do their jobs as best they can.<br><br>And by all means, don't watch this film if you aren't fully awake and willing to be taken down the electric, ambiguous, and compelling roads it leads to. If you watch this film with any part of your brain turned off you'll end up asking questions like \"plot, what plot?\" The fact that some people can't find it reflects more on them as film-watchers than it does on this film. This film does not offer passive entertainment like most of the contemporary action market does. It makes you pay attention, though, at times you might not want to. <br><br>Hackman and Scheider are incredible, with some of the greatest chemistry I have ever seen between two young actors. They play two hard-ass NYC detectives looking to end the war on drugs more-or-less permanently by taking down an international conspiracy which they have just barely sniffed out. And make no mistake, they, particularly Hackman's \"Popeye Doyle\" are at war, and treat their jobs as a battlefield. Doyle pursues his quarry with utterly wreckless abandon, endangering the lives of dozens of people along the way. While both men are absolutely terrific, this stands out as one of Hackman's greatest performances, and his Oscar is well-deserved (not something you will see me say often). Backed by a strong supporting cast, and some of the best live-action cinematography of the late 20th century, this film does not allow you to turn away, get popcorn, or even deal with bodily functions for its entire duration.<br><br>Considered in the early 70s to be 'shockingly violent', this film does not even reach a tenth the degree of passive violent repulsion of the average Tarantino film, and it relies, instead, on amazing performances, flawless direction, a phenomenal post-modern soundtrack and edgy, tense camera-work. Unlike contemporary action film garbage, it also gives you complex characters who you can care about, but never fully understand. I will cut this review short because I am running out of superlatives. Anybody remotely interested in expanding or just appreciating the artistic breadth and depth of mainstream film needs to see this.","user":"mstomaso","rank":[169,209]},{"title":"Slow, but worth it.","rating":19,"date":"19 September 2002","review":"The French Connection is number seventy on the AFI's list of top 100 movies, right before Forrest Gump.  But why is it known as such a great film? Why did it win Best Picture at the 1971 Academy Awards?  Why was it so important?<br><br>The French Connection was made in 1971, starring a then 41-year-old Gene Hackman in the lead, and directed by William Friedkin, who started his directing career with `Alfred Hitchcock Presents' in 1955.  The film follows an aging but truculent `bad-boy' police officer Popeye Doyle and his slightly kinder partner (Roy Schneider) in their journey to bust a drug-smuggling ring of French origin.  The movie itself is basically one big chase scene, following Popeye on his cat and mouse game of catch the crook.<br><br>The film has been classified as both an action and drama movie.  Both are right, in their own way.  The film at its core is a tense, slow-moving thriller, dramatic in its musical score and over-acted brutality.  Scenes are left to their own devices, moving forth indeterminately, in a very drama-characteristic fashion.  However, there's plenty of chasing and violence to satisfy an `action' classification.  This action, however, is played so that it's less about the adrenaline rush (so common in today's big-budget action flicks), and more about that tense underlying heartbeat. The style of the film then, is a very paced and dingy chase scene.  By today's post-Matrix standards, the film is slow.  But in its own way, it's subterrainiously charged.<br><br>The camera is mastered by cinematographer Owen Roizman, whose previous film, Stop, is essentially unheard of, and who went on to make The Exorcist with Friedkin two years later.  Shots are varied.  There are handheld shots of the streets, coupled with static medium wide, along with crane shots, along with close-ups and wide shots.  And even though the shots are extremely eclectic, one common theme shines through-realism.  Every shot composed is just a little bit shaky, a little bit unclean.  There's no truly innovative lighting used, simply that yellow coarse light that everything is eternally bathed in.  It succeeds in making the movie that much more tangible to the eye.  The mood created within is one of belief.  You can believe the movie, because it's shot in such a rugged manner.  The car scenes, filmed at night, use the same technique; red and white car lights with a subtlety lit car. It is clear that the film Taxi Driver, made 5 years later, contained car shots obviously influenced by the ones in The French Connection. Furthermore, actors' faces are lit without any superfluous shine or luster-they are simply real human faces, and are not hyped up.  This influenced cinema in the way that it brings the mood and story above the actors' egos.<br><br>The editing, done by Gerald Greenberg, is, in the same manner, very real. Characteristic of films made pre-computer based editing, shots are held for longer periods of time, and not as many cuts are used.  The editing is almost unnoticeable, because it seems to pass by so soft, especially during dialog.  However, conversely, it cuts much more often (but never frantically) during action sequences, like the bar roust or the car chase under the train tracks.  But still, drama is tensed out by holding shots long during action sequences, and it works.  But this never comes to fault. The few times when quick cuts are needed, they are used, such as the train crash.  In general though, the editing satisfies the mood of the film.<br><br>It is said that silence is golden, and in The French Connection, it seems to be just as valuable.  While the tense, stringy score (by Don Ellis) is important to the film in some aspects, its not used very often, and instead, director Friedkin employs simple background noise.  For instance, most of the scenes in the movie simply work with dialog and city noise.  This all goes back to the pre-established mood: realism.  The music is used only when it wont get in the way of the framework of the film.  So therefore, background noise suffices wonderfully for most action and dialog scenes. Some of the music is setting-based as well, and so, comes from the movie's plot itself, and doesn't break the reality theme.  Modern audiences might be surprised by the lack of `action-music', but car chases and fight scenes sans pumping bass are surprisingly welcome, and help the film, as well as add an aire of classiness.<br><br>Director William Friedkin is a director who knows what he wants out of a film.  For The Exorcist, it is told he violently slapped an actor who wouldn't cry, and, with The French Connection, he establishes his premise, and lets the story tell itself.  It is a different style of filmmaking. The French Connection is important to modern cinema not only because it taught modern directors the art of silence and visual suspense, but because it artfully embodies its theme.  Its story, rough characters, locales, color, and pace all bleed a very dark, yet very familiar reality; one that has shaped nearly every cop movie since its making.  While the film is at times hard to follow, simply because the story is left to its own devices so much (there are 15 minute periods of no dialog), but in the end, it succeeds admirably.  While not the best film ever made,<br><br>The French Connection is a classic, and worthy of the honors it has received.","user":"Bastian Balthazar Bux","rank":[137,173]},{"title":"One of the 1970s best crime movies, and yes, that means one of the best ever.","rating":15,"date":"15 June 2003","review":"'The French Connection' has really stood the test of time. William Friedkin is one American director who has almost been forgotten about, despite making some excellent movies like 'The Birthday Party', 'The Exorcist' and 'Cruising'. 'The French Connection' is his best movie by far, and one of the 1970s best crime movies, which means it's one of the best EVER. The lead actors are first rate, and the script by Ernest Tidyman ('Shaft') is a good one, but Friedkin makes this something special by applying documentary film techniques to this gritty and realistic detective story. 'The French Connection' was groundbreaking in this respect and influenced just about every subsequent cop movie, all the way up to contemporary TV shows like 'NYPD Blue' and the like. Gene Hackman is just terrific as Popeye Doyle. Hackman had been around for about ten years, and impressed many with his supporting role in 'Bonnie And Clyde', but this movie made him a major star. Along with 'The Conversation' and 'Scarecrow' it's still one of his most impressive performances. Roy Scheider was almost a complete unknown prior to this but he's also very good as Popeye's partner Buddy Russo. Scheider went on to some fine work in movies such as 'Jaws', 'Marathon Man', 'Last Embrace', '52 Pick-Up' and 'Naked Lunch', but never quite became the big name star that Hackman did. Bunuel regular Fernando Rey (cast by mistake after a misunderstanding, Friedkin thinking he was hiring a different actor!) and the underrated character actor Tony Lo Bianco, who had recently appeared in the cult classic 'The Honeymoon Killers', lead a fine supporting cast who really add to the movie's success.  The exciting car chase sequence in this movie is now legendary, and is arguably the best one ever filmed, but there is so much more to this film than just that. 'The French Connection' is a superb movie, and still better than just about any similar Hollywood crime thriller made in the last few years. Highly recommended!","user":"Infofreak","rank":[115,146]}]