[{"title":"Great fun comedy from the Hui's brothers!","rating":9,"date":"4 January 2015","review":"This is one of several Hong Kong comedies starring brothers Michael Hui, Ricky Hui and Sam Hui. Here, struggling actor Chih-Wen (Michael Hui) got a raw deal from MTV Studios by signing a binding 8-year contract and has performed live once only. He received a better deal with a rival company and, thus, conspires to steal his 8-year contract, with the help of his scientist-aspiring brother (Ricky Hui) and magician Shih-Chieh (Sam Hui). <br><br>Filmed in the late 1970s with classic bell bottoms, old cars, big hair-dos and hip music, this movie is a tastefully done comedy with witty humor, slapstick fun and wild misadventures. From Shih-Chieh's magic shows to Chih-Wen's daring escape from a henchman while in drag, you'll get pure fun and excitement while following the captivating plot of Chih-Wen trying to steal the contract while avoiding his ruthless manager. <br><br>The opening scene starts with a beautiful song sung by Sam Hui (although an extra is performing and lipsyncing the song), which quickly grabs your attention. This is followed by a pretty fast-moving plot and unforgettable characters. Overall, it's a must-see HK comedy.<br><br>Grade A","user":"OllieSuave-007","rank":[3,3]},{"title":"There have been better","rating":6,"date":"17 July 2000","review":"Michael Hui is one of Hong Kong's most talented scriptwriters and given the overall quality of his films, he's allowed one duffer from time to time.<br><br>The Contract isn't exactly poor and it only fails comparison when one compares it to other Hui efforts, such as the brilliant Security Unlimited (1981). The lead cast is the same: Michael Hui and his two brothers, Sam and Ricky, all playing friends who get caught in circumstances a little outside their control. Sam provides the theme tune, again, and while the melody is memorable, the song didn't hit the charts with as much vigour as some of this other offerings.<br><br>This time, the plot revolves around a contract signed with a TV studio whose CEOs are expected to commit suicide when ratings plummet. This more or less describes the silliness of the film and unlike other Hui-penned comedies, The Contract relies too much on slapstick and not enough on clever lines. Hui also relies on gadgetry - while this plays tiny parts in other films, it's written in here more.<br><br>For once, Ricky Hui doesn't play the sympathetic loser, but a technical inventor and genius with aspirations to become the next Thomas Edison; Sam is the usual mid-1970s stud who's also an aspiring magician; Michael begins the film as an unbelievably poor dancer and extra at a television studio.<br><br>There are some high points (Michael and Ricky attempt to get the contract back from the studio's safe) but in all, many scenes are milked way beyond what the script allowed through Hui's own direction. Good for those who appreciate Hui's humour and style; while served with less quantity, it should have enough pace for those who enjoy a 1970s Hong Kong comedy.","user":"Jack_Yan","rank":[1,4]}]