[{"title":"The first of the Lucky Stars films is more winner than sinner.","rating":7,"date":"24 June 2007","review":"More comedy than kung fu, Winners and Sinners is a crazy Hong Kong caper that follows the antics of a bunch of likable ex-convicts as they become unknowing recipients of a briefcase of missing counterfeit money and some printing platesitems much sought after by two gangs of criminals.<br><br>The first in the 'Lucky Stars' movies, this good-natured and silly comedy succeeds in being very entertaining (despite not really being THAT funny) largely thanks to its charismatic cast. Sammo Hung, Richard Ng, Charlie Chin, Jackie Chan, Shui-Fan Fung, John Sham and (token beauty) Cherie Chung all have starring roles, and even Yuen Baio and Lam Ching Ying pop up in cameos.<br><br>Of course, how funny you find this film will depend entirely on your sense of humour (let's say that the laughs are not that sophisticated); the quality of the action, however, cannot be disputed.<br><br>Jackie has only a couple of brief fight scenes, but truly shines during a roller skating sequence in which he performs some amazing stuntsfirst partaking in a competition, and then pursuing a couple of thieves. And if you're not gob-smacked when he skates under a moving lorry and then causes a multiple pile-up, then you should give up watching films altogether.<br><br>This being a Sammo Hung film, however, it is the portly one that takes centre stage when the real fighting begins, and fans of his work will not be disappointed. I always find Sammo incredible when he lets feet and fists fly, and in the warehouse-set finale, he delivers some amazing moves. Even if Hong Kong humour is not your cup of tea, Winners and Sinners is worth watching for the end battle alone.","user":"BA_Harrison","rank":[10,10]},{"title":"Five Lucky Stars","rating":7,"date":"17 November 2005","review":"Winners and Sinners (aka Five Lucky Stars) is a film that I liked better the second time I watched it. After shaken off all expectations of a \"Jackie and Sammo\" film and accepted the uneven and scattered nature of this ensemble movie I enjoyed it more. This movie was more important though when it came out then it is considered today. Jackie had a recent flop in Dragon Lord, though I did enjoy the movie, and Golden Harvest had been in a bit of a slump. Producer Leonard Ho got the idea from Cannonball Run (which Jackie Chan and Michael Hui had parts in) to create an assemblage of popular Hong Kong stars to star in this film. Winners and Sinners was a success spawning several sequels and reunited Jackie with Seven Little Fortune alums Sammo and Yuen Biao (who helped with martial art choreography; though his cameo as a fellow CID officer is less than a minute as a quick fight versus Jackie.)<br><br>The Five Lucky Stars are cons who after spending their time in jail take a straight job with a cleaning company led by Curly aka Jack So (played by real life democracy advocate John Shum) who was framed for instigating a crowd to do harm in a parody of his real-life exhorts. The other four are Ranks aka Larry (Stanley Fung), Teapot (Sammo Hung who also directed this) as a cat burglar, Vaseline (Charlie Chin) a slick thief, and Exhaust Pipe (Richard Ng who performance was nominated as Best Actor for the Hong Kong Film Awards) who is bad at thieving automobile parts. They all live with Jack's sister known as Sis (Cherie Chung.) Unfortunately they spend way too much time trying to get her attention, leaving a lull in the early parts of the film. However there are some great gags such as Richard Ng thinking he is invisible with Wu Ma's great response to shatter his misconception  \"...pretty good vision even when it comes to small objects\" and a blind couple playing a Rod Stewart song at a carnival.<br><br>There are some great stunt and fight scenes led by 7086 (Jackie Chan) a bumbling CID officer who beats up wrong suspects, kills his superior's turtle and accidentally throws a kid's ice cream away. When he is not destroying everything in his path he is part of an awesome stunt scene involving skates (at least he learned something good from The Big Brawl though he is doubled on some of the trickier roller tricks) and part of a good fight scene in a cafeteria with a little person with horrific teeth. The \"ouch factor\" is quite high in one scene where a villain gets kicked out of a window and lands on a concrete ledge than falls to the ground. I have the highest respect for these stuntmen who kill themselves for our enjoyment. This film definitely deserved the Hong Kong award for best Action Choreography.<br><br>The story is mostly non-existent until the boilerplate briefcase full of counterfeit bills makes it's appearance. It belongs to Chan Chiu (James Tien always good as a cigar chomping villain) who is head of a triad gang. He was going to trade it to another triad gang led by Ho Man but it got intercepted and eventually and unknowingly in the possession of the Five Lucky Stars Cleaning Company. Of course, Agent 7086 wants this briefcase too.<br><br>But this film was not made for the plot. It was made to be a crowd pleasing mixture of comedy and action, both of which it does very well. It parodies the more serious films with scenes such as Charlie Chin and Fung Hark On doing a martial art pose-down fight and the final action scene that blends comedy and stunts takes place in a warehouse which gets me thinking on how many films I have seen that have the last fight scene in a warehouse (rhetorical thought of course). There are some problems with the film besides the inert beginning including he abysmal electronic soundtrack that is eerily reminiscent of Heart of Dragon's soundtrack and the misuse of Lam Ching Ying as Chan's butler Chan. Overall this is an enjoyable film that is fun to watch that showcases several outstanding Hong Kong comedians and several outstanding action performers.","user":"SamuraiNixon","rank":[9,9]},{"title":"Well, this is rather silly","rating":7,"date":"19 April 2005","review":"I recently watched 'Winners and Sinners' with some friends when we thought we should celebrate Jackie Chan's birthday. After viewing it, maybe we could have a chosen a movie that featured more Jackie Chan in it. Oh well, maybe I'll celebrate Sammo Hung's next birthday (whenever it may be) by watching 'Around the World in 80 Days'.<br><br>'Winners and Sinners' is the first 'Lucky Stars' movie. Now 'Twinkle, Twinkle, Lucky Stars' makes a whole lot more sense, even though its been a few years since I've seen it. Five inmates befriend each other in prison, and when they are released, they form the 'Five Star Cleaning Service', only to find themselves in the middle of a Triad war.<br><br>'Winners and Sinners' is much more of a Sammo Hung film than a Jackie Chan film. Sammo directed and starred in this, while Jackie had a minor role as CID officer. Yuen Biao and Moon Lee even had a short cameo in a scene where Biao and Chan have a short fight. However, most of action is performed by Hung, and he pulls it off very well.<br><br>Apart from some entertaining action, 'Winners and Sinners' is one of those rather silly Hong Kong comedies that fans of Sammo Hung and Jackie Chan - especially their 80s work - should be somewhat familiar with. Some people will find it funny - I did, but others might not be amused.<br><br>'Winners and Sinners' is a nicely-done action / comedy, maybe not for everyone though - 7/10","user":"AwesomeWolf","rank":[9,9]}]