[{"title":"Packs a better sting than you would think.","rating":7,"date":"17 January 2006","review":"Killer bees don't always make for the best 'monsters' in the horror genre, but this British thriller is an exception.<br><br>Pop singer vacations on an island with a local bee keeper, while a mysterious swarm of bees has caused the death of a woman.<br><br>The Deadly Bees isn't as dull a film as some make it out to be. It has some nice high-powered shock sequences even though the bee FX aren't always convincing. The makeup FX aren't bad, namely the great work on an ill-fated Catherine Finn. The story is a decent mystery, based upon H.W. Herd's novel A Taste for Honey. The direction of Freddie Francis is pretty good, the sets are well constructed and the art direction is excellent. There's also a great dramatic music score to boot.<br><br>The cast is quite good. Suzanna Leigh is a decent heroine, but it's really leading actors Guy Doleman and Frank Finlay that turn in the best performances as some feuding, menacing bee keepers.<br><br>All around not bad. Certainly the best killer bee movie around and an underrated work.<br><br>*** out of ****","user":"Nightman85","rank":[30,32]},{"title":"\"My wife doesn't seem to realise the amount of work involved in bee farming.\" I quite liked it actually.","rating":7,"date":"2 December 2005","review":"The Deadly Bees starts in London where Inspector Thompson (John Harvey) of some unnamed Government Ministry receives a letter from a nutter who says he will release 1000's of deadly killer bees on an unsuspecting public, he has a quick laugh about it &amp; throws the letter into the bin despite the nutter even giving his address on the ominous sounding 'Seagull Island'... Pop singer Vicki Robins (Suzanna Leigh) has been working far too hard lately &amp; collapses while performing in a TV studio, her agent (Maurice Good) suggests she spend a couple of relaxing weeks with a friend of his on, yep you've guessed it, Seagull Island. Vicki arrives on the isolated Isalnd &amp; meets up with Ralph Hargrove (Guy Doleman) &amp; his wife Mary (Catherine Finn) who welcome her into their home, Vicki quickly learns that Ralph is a bee farmer &amp; the next person she meets Mr. Manfred (Frank Finlay) is also a bee keeper. The people of Seagull Island seem to have bees on the brain &amp; they come up in the conversation more often than one would expect, however it's not long before Vicki finds herself embroiled in a scheme involving killer bees that can be controlled to do their owner's evil bidding...<br><br>Produced by British studio Amicus The Deadly Bees was directed by genre veteran Freddie Francis &amp; I have to say I quite liked it despite it's daftness &amp; somewhat predictable storyline. The script by Robert Bloch &amp; Anthony Marriott is based on the novel 'A Taste for Honey' by H.F. Heard &amp; the central premise is rather silly &amp; takes itself a little too seriously, why does someone want to develop a swarm of killer bees in the first place? The plot which tries to keep the villains identity a secret &amp; then surprise everyone at the end, well I can assure you now that you would have to be pretty dumb not to see where The Deadly Bees is going as the script tries it's absolute hardest to convince you one way with unconvincing red-herrings that you just know there's more to it. I also found the bizarre sub-plot about Mr. &amp; Mrs. Hargrove having the hump with each other somewhat puzzling &amp; we never find out why they dislike each other so much or why Mrs. Hargrove is so rude to Doris (Katy Wild) the hired help! The villains speech at the films climax is also worth a mention as it feels &amp; sounds like something out of a Scooby-Doo episode with the villain explaining it all nicely complete with flashbacks &amp; how they did it. Having said that at only just over 80 minutes it moves along at a nice pace I was never bored, I found it quite fun &amp; entertaining on a dumb level. There are only a few bee attacks &amp; they are not graphic so don't expect a high body count or lots of gore.<br><br>Director Francis can't do much to liven things up unfortunately but does a decent job with the material at hand, the bee attacks themselves are poorly realised with some terrible special optical effects where the bees are super imposed over the actor who has to react &amp; seem afraid to nothing, there are also a few plastic bees stuck on people but they don't move or anything. There is one cool scene though where the camera has a bee in close-up on someone's skin &amp; we see it fly off without it's sting as it comes off in the wound. I really liked the 60's look to the film with the dated hair styles, clothes, furniture &amp; the horrible garish wallpaper colours! Did people really choose to have wallpaper those colours?<br><br>Technically The deadly Bees is solid throughout with nice photography, location shooting, music &amp; production values although those special effects won't impress anyone these days &amp; some of the 'exterior' shots are obviously studio bound. The acting is OK but nothing special, I have no idea why but the IMDb cast list credits someone named Percy Edwards as the voice of Tess the Dog! I can promise you now there are no talking dogs in this film so why did he provide the voice? Why couldn't the filmmakers just record a normal dog barking?<br><br>Despite it's flaws &amp; silliness I liked The Deadly Bees, it had a certain charm about it &amp; it entertained me for 80 odd minutes which at the end of the day is all I ask for. Personally I think it's worth at least one watch.","user":"poolandrews","rank":[26,30]},{"title":"Gripping Hammer horror style mystery","rating":7,"date":"1 May 2011","review":"A London pop star suffering exhaustion is sent to convalesce in the country-side where she encounters a toxic mix of deranged ambition and a hybridized strain of killer bees that threatens not only her fragile sanity, but also her life. Leigh is a relative lightweight amongst her accomplished co-stars, with Doleman as the no-nonsense farmer and Finlay as his eccentric neighbour jostling for position as the dominant bee keeper. It's a rather unusual premise on which to base a complex whodunit, but provides a surprisingly strong basis for the mystery to unfold. Doleman's strained relationship with his apparently invalided wife, and the curiosities of relationships in an isolated rural community serve as an intervening backdrop to the troubled Leigh and her increasing concern at the strange events she witnesses.<br><br>Veteran Hammer-horror director Francis has crafted an eerie little mystery, lacking none of the essential ingredients of a conventional mystery, with the notable exception of an impartial investigator. Most of the detective work is done by the protagonists, drip feeding the naive Leigh with twisted facts to conjure alibis and implicate the culprit. Francis does a fine job of concealing the mystery, carefully playing the doubt card, and tempering clues with red herrings and faux staging.<br><br>Opening to the groovy fusion of art-house pop culture, Leigh's character is framed as a victim of excesses in a progressive London scene (there's an implied drug addiction, but it's vague) and from there, the film juxtaposes to the opposite extreme - an ultra conservative, socially incestuous rural setting, a deep isolation both geographically and socially for the central character. It's an engaging tussle between old-fashioned values and an emerging modern liberalism.<br><br>Slated by critics, the film almost cheats itself with its bold title, because it's not ostensibly a movie of this genre. The bees are present as a vehicle only, and certainly they have comparably little to offer by way of shock value. But the intrigue that the many layers build, is compelling. Try it from a different angle and you may like what you find.","user":"Chase_Witherspoon","rank":[15,17]}]