[{"title":"The best possible film of Mann's novella.","rating":10,"date":"7 June 2004","review":"Luchino Visconti's \"Death in Venice\" is a masterpiece of utterly haunting beauty that will capture the imagination of anyone interested in the screen's capacity for breathtaking images. It is a poignant tragedy based on Thomas Mann's classic novella of the same name. Visconti has captured many of the essential qualities of the book and employed a superb visual style (with the assistance of the great cinematographer Pasqualino DeSantis) for a story which is essentially an interior one. It is about the struggle within the soul of a man, Gustav von Aschenbach, a composer vacationing in the Venice of 1911.<br><br>In Mann's book Aschenbach was a writer, but Visconti asserted that the book had been inspired by events in the life of Gustav Mahler, whose music, mostly the haunting adagietto of his Fifth Symphony, is used as background (and foreground) music, helping create an almost tactile mood of melancholy.<br><br>Dirk Bogarde plays Aschenbach, a man possessed by feelings of failure, haunted by the grief he and his wife (Marisa Berensen) shared over the death of their daughter. He is a man on the precipice of emotional collapse who finds both redemption and destruction in the contemplation of beauty. \"The creation of beauty and purity is a spiritual act.\" God and composers are alike.<br><br>In this film beauty becomes incarnate in the form of a young Polish boy vacationing at the same hotel, the Hotel des Bains on the Lido. The boy's stately mother is played by Silvana Mangano. The long-haired blond boy is Tadziu, aged 14, played by the Swedish Bjørn Andresen. Aschenbach is smitten by, then obsessed with, the boy's beauty, in a manner that is more spiritual than sexual, but which must also contain a good deal of sublimated sexual longing. <br><br>At first he merely steals opportunities to look at the lad. They never speak. Gradually he starts to seek him out, self-destructively spurred-on by the boy's coquettishness and knowing glances. Bogarde makes the character's longing as tangibly moving as it is ultimately pathetic.<br><br>All this takes place in a misty Venice dense with metaphorical gloom and a mysterious plague (cholera) carrying death to its inhabitants. In one horrifying scene a barber \"re-makes\" Aschenbach's face so that it is both a grotesque parody of youth and an ominous death mask.<br><br>Visconti's skill in recreating lush period detail, to paint family-album poses of aristocracy, to make beauty seem dangerous, to underline the complexity of human psychology, are all in evidence here. The color photography by Pasqualino De Santis, and the costumes by Piero Tosi are excellent.<br><br>The ending of the film is unforgettable: Gustav languishing on the beach, the Polish folk song in the background, the boy Tadziu in the water turning into an angelic apparition with extended hand. Overwhelming!<br><br>I cannot imagine a better film ever being made of Mann's great and essential work.","user":"ItalianGerry","rank":[111,129]},{"title":"A visionary masterpiece (but not for those with short attention spans)!","rating":13,"date":"13 April 1999","review":"Turn-of-the-century Venice is depicted in all its elegance and decay through the eyes of a composer who knows he has little time left to live.  The composer is obsessed not just with beauty, but with the ideas behind beauty, and his theories are slowly proved wrong when he finds himself infatuated with a beautiful teenage boy.  He becomes obsessed with the boy and amidst the backdrop of a city quietly dying with a plague, he simply observes and ponders, trying his best to keep his desires at bay.<br><br>The core of the film is in Dirk Bogarde's performance.  As there is little dialogue in the film, he must act with his eyes and through his mannerisms, and he never falters.  In the reflection of his eyes we see beauty as it is distinguished in the depths of all of our souls (well, those of us who have souls!).  We see the awe, the pain, the fever, the fear, the desire and the ultimate surrender all in that forlorn face.<br><br>The music (most of it by Gustave Mahler) also reflects all this, and Visconti's incredible photography of the decaying Venice pinpoints the end of an era in a way that is both dreamlike and unsentimental (despite the romantic quality of the film).<br><br>The film is slow and langorous, like the hush of the ocean sweeping the shore.  For those who like the visual quality of dreams and the somber romanticism of adagios, this film will be something to cherish forever.","user":"Zen Bones","rank":[57,67]},{"title":"More and more beautiful as the years pass by","rating":29,"date":"29 October 2004","review":"\"Slow\", \"slow\", \"slow\"... I read many people complain \"it's slow\"... slow what? This movie takes its time. All the most beautiful things in life take time. When you make sex with your girlfriend would you try to make it last five minutes? No you would like to make it last the whole night. When you eat good food in a good restaurant would you like to finish it in two minutes? No, you sit down, enjoy the place, the food, the company and the wine. When you visit an art museum, would you rush through the rooms? No, you would move slowly, pay attention, and stop at the artworks that mean more to you. So why should a movie be different?<br><br>If you want speed, then eat at McDonald's, rush in the tube, watch TV commercials, and pay a prostitute for a 5 minute work.<br><br>If you are looking for real emotions, deep feelings and thoughts that will last in your memory and heart for a long time, then you don't want to miss this movie.<br><br>One caveat: don't go watching it for the gay theme. This movie isn't about gay love, if you look at it through this point of view, it will let you down completely. This movie is symbolism from beginning to end, it does not speak of what you see. It speaks of the struggle of the artist to reach the beauty, so close, always unreachable, and, like another reader perfectly commented, so inevitably connected with death, because the only perfection that a living being can ever attain, is in the death. If you look at the movie from this point of view, it will show to you for what it is: a complete masterpiece, from beginning to end.","user":"Patatino","rank":[163,217]}]