[{"title":"view","rating":9,"date":"9 February 2006","review":"Wyatt was a character that you could connect with because he wanted to find something better than what life offered so far. The image that struck out the most to me was this idea of the cities versus the open road and expansive valleys. I noticed that when they were on the open road they were meeting interesting down to earth people that shared similar ideas with them. They come across the farming family that sit down for family meals and live off of the land. Wyatt seemed to admire this idea of living off the land and the willingness to offer them food and a place to sit while most people would turn strangers away. The family did not stereotype them or disrespect them because of the way they looked.<br><br>At the point in the movie when they picked up the hitchhiker you could tell the distrust that people had towards each other. Billy did not trust the man even though the man was simply trying to do them a favor. Trust in fellow human beings was something rare during the time and it seemed like kind acts were suspicious acts. Billy was not a trusting person but he was also a little bit paranoid, while Wyatt was willing to believe in the goodness of people and give them a chance before judging them. Wyatt figured that the trust had to start somewhere.<br><br>We can tell when the close minded communities are coming in to play because we are leaving the open road and coming to the small enclosed streets. When they run into George he is their saving grace from this small town. George offers a new perspective for Billy and Wyatt because he is a suit that does not judge them but he acknowledges the prejudices against them. He gives them the first straight answer they will receive on the way the world works. George's character was really refreshing and it was interesting that he is the one that gets killed by people that he 'represents.' I thought that the scene when they finally get to New Orleans and are tripping the cemetery is really telling of how religion was viewed by Wyatt and Billy. They are tripping and sitting on statues and graves and the girls start to take their clothes off while they run around and curse their parents and the world in the middle of funeral services. At one point Wyatt looks up at a statue and sees a great ball of fire crashing to the earth. This is an omen of how is life will end and it almost seemed like god was scorning them or something with that flash of fire kind of like the apocalypse.<br><br>An aspect of the filming that I found interesting was the transitions that they used to go from scene to scene. The characters would be sitting by the camp fire and then to go to then next scene of them riding off was the three panic-like shots of the incoming scene. I thought that this method went well with the film and the characters because they were always changing scenery in search for something more. They were restless souls with no limits but they do not find clarity in the end. Wyatt felt that their experience in Orleans was not what they had expected and that they had failed but the question of what they had failed at was something that could be many different things. Easy Rider was a shocking film in a good way a film that many youths relate to because of the sense of restlessness and the need to live and be real.","user":"Delonga22","rank":[46,48]},{"title":"This film was a rite of passage","rating":9,"date":"17 August 2005","review":"I cannot overstate the importance of this movie in my personal development.<br><br>In 1969 I was eighteen and a freshman at Cambridge University. I was also a near-fundamentalist and a member of the Christian Union. Its officials decreed that Easy Rider was unsuitable for Christian viewing; I'd seen some enthusiastic reviews which made me curious. Moral and spiritual dilemma followed. To view or not to view? I prayed about it - look, this is a long time ago, right - and decided that if it had been OK for the Christian Union's leaders to see it, if only to realise it was morally dubious, then it was OK for me. They hadn't been corrupted, presumably; the Lord would see that I wasn't either.<br><br>So I went and it blew me away. I thought then and think now, that this is a magnificently perceptive commentary on hippie culture and one that only the medium of film can deliver. Naive idealism is weighed against the squalid reality of drugs (and indeed alcohol). Freedom is portrayed as often aimless, self-indulgent and downright boring. The underlying morality could be seen as puritanical: a celebration of the free-lovin' drop-out Sixties it ain't, more a weary end-of-decade critique thereof. I would have thought there was much to commend it to the Christian Union moralisers, yet as ever they couldn't see past the surface - drug abuse, loose women. Yet it has its high moments, in more ways than one, and is always a treat for the eyes.<br><br>My decision to defy the Christian Union by seeing the film was an early step out of my fundamentalist prison and I haven't stopped walking yet. No-one's ever going to tell me what I can and can't watch again: nor will I censor anyone else's viewing. I'm still a believer, but not of the kind that the Christian Union would have thought will ever go to heaven. Guess I'll have to live with that.","user":"rjbrad","rank":[340,389]},{"title":"This used to be a helluva good country. I can't understand what's gone wrong with it.","rating":8,"date":"25 September 2004","review":"I was utterly surprised by this film. I was expecting nothing more than some short scenes of our now-infamous actors smoking marijuana followed by trippy Willy Wonka scenes . Oddly, this did occur, but this film was much more than that. This film should be shown in every American History class in the United States. It not only showed the beauty of the country of which we reside, but it also spoke about the people that reside in it. You know the old saying, 'Guns don't kill people, people kill people', well after watching this film, it is a very true statement. We are afraid of what is different. We are a culture that is afraid of change, yet seek it so badly. We are a society of hypocrites, androids, and ignorants. We thrive on the fact that we are the best country in the world, yet somebody shows any disassociation of routine, we are the first to question and get angry. I would dare say that we have moved so far from the 60s that I cannot see why our parents do not cry everyday. Their generations was a free-spirited, mind challenging culture that explored all possibilities no matter the cost. The experience was all they needed as a reward. Now, we are more concerned about money and the family-plan that we sometimes place ourselves on the backburner to life. Wake, eat, and pay the bills. What a sad daily structure that we have. When was the last time you considered the possibility of just jumping on your bike and riding until you hit water? Probably not for a long time  why? It is called 'bills' and 'responsibilities'. These are the choices that we chose to make, and for anyone to say that they cannot do it, I would have to challenge. You CAN do anything, it is whether you chose to do it is another question. I wonder what it will be like in another 30 years. Where will we be, and will the idea of individualism be lost? I can't wait to see <br><br>Outside of the deeply rooted themes of this film, I felt that Hopper (who also directed) knew exactly what he was doing behind the camera. He kept the talking short, the music loud and symbolic, and allowed the background to do the explaining. I loved the fact that we really knew nothing about Fonda or Hopper's characters. It allowed us to relate to them. You could easily add your story into their characters and have the life that you lead and wish to escape. Hopper was able to transform this film from a drug movie to a film about humanity. Fonda, who also helped write the film with Hopper, did a superb job of adding Nicholson's character into the mix.<br><br>Nicholson represented us, the American public and our love of liquor, football, and lies. I viewed Nicholson as the average American. He drank too much, was the product of a wealthy upbringing, but did not know much about the world. He was sheltered. He never smoked weed (in fact didn't even know what it was when presented to him), never left the state line, and never lived life. He constantly used the expression, 'I have always wanted to '. How many times do you hear this a day from either a family member or a co-worker? If you always wanted to do it, why haven't you? So, here we have Hanson, dreaming a dream but never following through, who is traveling with two guys that live the ultimate life and live by their own rules. They are complete opposites, but Hanson's words seemed to remain in my mind for a long time. He reminded me of one of my wife's students today that spoke about freedom. He knew exactly what it was, but never practiced it. Hopper and Fonda were walking (driving most of the time) representations of the word 'freedom'. It is tragic what happens to Harmon, because he (unfortunately) experienced the negative side of freedom  hatred and fear of the unknown.<br><br>There was one scene that just jumped out at me. It occurs in the diner before the incident later that night where our travelers experience hatred in the country they admire so much. They go from peace and love to fear and hate. It is as if they witnessed night and day. It was frightening to hear the words coming from people in that restaurant. It was not only scary to wonder what was going to happen to our narrators, but mainly that people were speaking that way to fellow citizens. I know that it still occurs today, and it is surprising to me. We bomb a country because they do not follow the same principles that we do, but we need to start asking ourselves this question  do we need another United States?<br><br>Grade: ***** out of *****","user":"film-critic","rank":[374,449]}]