[{"title":"Underrated Arabian Nights Classic.","rating":8,"date":"21 November 2003","review":"I first saw this film when I was a lad back in 1963. It was probably the most wondrous film I had seen - I must have seen it at least half a dozen times during its run in the cinema.<br><br>The story concerns a prince, played by he-man Steve Reeves, who must pass seven tests in order to find a legendary blue rose and thus save the life of a comatose princess, win her hand in marriage and the kingdom.<br><br>Under the direction of Arthur Lubin, this film boasts impressive (for its day) special effects, exotic sets and acting that raises itself above other Arabian Nights type films. The characters are well written which include the obligatory villains who are also on the blue rose trail and evil women who pack a deadly punch - or perhaps that should be deadly potion.<br><br>I think this rates as a classic of its genre. Catch it if you can.","user":"augustian","rank":[24,24]},{"title":"7 doors to a classic","rating":10,"date":"24 February 2003","review":"If you are a fan of Steve Reeves, then this is probably Steve at his best. A love story combining the elements of which led you to remember Aladdin and his adventures. This film has walking trees, flying horse, 7 doors, cloak of invisibility and evil women. Georges Chamarat plays the small and wonderful magician who helps the thief, Karim. A riddle must be solved to begin the journey of the 7 doors: Begin in the East, through the door that is not there? I remember seeing this as a boy in the sixties and is very much still a classic.","user":"jcholguin","rank":[22,22]},{"title":"A good surprise in Steve Reeves' career.","rating":30,"date":"30 September 2001","review":"I remember how great I found this movie when I first saw it as a child. Entertaining, inviting, beautifully scored and visually exciting, it was a good surprise for me, a muscle-movies fan then.<br><br>I found Steve Reeves could show something else than his stunning muscles. He gives this time a very lighthearted performance - surprisingly, I guess, for his legions of fans - a step ahead of his habitual towering figure and dark persona. He shows, maybe for the one and only time, that he could create a character that goes beyond himself, in this case, Karim, the Thief of Bagdad. Convincingly, this is the point. In excellent, slimmer shape, smiling, it was Steve Reeves in his apex, in a delightful, colorful movie.<br><br>This is a very lovable movie, and I rate it as the best in his career, if you put the seminal 'Hercules' aside as 'hors-concours'.","user":"marciodecarvalho","rank":[18,18]}]