[{"title":"A Stylish Mixed Bag","rating":5,"date":"16 October 2007","review":"Without even trying to, I have somehow managed to see four of director Jess Franco's 140-plus films over the last few months. The man has been so very prolific is so many film genres that he is seemingly unavoidable for anyone whose tastes tend toward the \"psychotronic.\" \"The Girl From Rio\" (1969) is one of his more coherent, impressively made, larger-budgeted, less sleazy efforts, at least compared to some other works in his gigantic oeuvre. In this one, formerly golden Bond girl Shirley Eaton plays a character widely referred to as Sumitra, although here she's usually called Sunanda (AND despite being based on Sax Rohmer's female villain Sumuru...don't ask). She and her all-woman army plan to conquer the world from their base city of Femina (near Rio), if American playboy on the run Jeff Sutton and crime boss Masius (the always-worth-watching George Sanders) don't get in the way. The film features excellent set and costume design, a chic and catchy theme song, unusual camera angles and a decidedly mod feel. Shirley is just fine in her villainess role, and viewers who enjoyed Maria Rohm's work in that same year's \"Venus in Furs\" (also by Franco) will just eat her right up here. The picture, for the most part, has its heart in the right place and is something of a gas. Sadly, it is also excessively padded with inevitable Carnivale footage, never goes far enough in terms of sex and perverseness, is grossly deficient when it comes to well-choreographed action scenes, and lacks the budget to make good on its admittedly smashing central conceit. The film's a mixed bag, to be sure, but a stylish and enjoyable one. I would never recommend ingesting psychedelics before watching it, but still, the picture almost demands to be seen that way...","user":"ferbs54","rank":[22,24]},{"title":"Big Battle in Rio de Janeiro!","rating":4,"date":"4 April 2007","review":"As I live in Rio de Janeiro I was curious to see this film. The other reason I picked up this film was that it was directed by Jess Franco (I had already seen \"Vampyros Lesbos\", \"She killed in ecstasy\" and \"Sadomania\"). These films are what I would call porn trash - they tell stories that offer us luscious images of female flesh, lesbianism, mild violence and really entertain us. \"Vampyros Lesbos\", in particular, is a psychedelic sound and visual trip, featuring the gorgeous Soledad Miranda, present also in \"She killed in ecstasy\". Jess Franco has a sophisticated visual style of his own.<br><br>But \"The Girl from Rio\"(called also \"The Seven Secrets of Sumuru) is absolutely amateurish. It tells no story at all. Its plot is a mixture of science-fiction, spy-thriller and soft porn trash. There is the detective, a mixture of James Bond and Flint (the main character?) always wearing flashy suits and carrying a suitcase containing 10 million dollars, there are the girls from Femina, a city located somewhere near Rio that intend to conquer the world and enslave the men, and there is a gang run by George Sanders. The 10 million dollars is what they are all fighting for. There are of course lots of girls.<br><br>Many fights, so badly done that people fall before they are hit. Femina was filmed inside and around the Museu de Arte Moderna in Rio. The gang run by George Sanders is composed by 5 people! There's a scene in which they run after the hero(?) wearing fantasy masks and after a ridiculous fist fight, he knocks them out and runs away. Incredible! Not to mention the \"apocalyptic final battle\" among the hero, the female warriors of Femina and the Gang of Five.<br><br>\"The Girl from Rio\" belongs to the category \"so bad that it's good\". I had my fun all right! By todays standards this film can't even be considered porn and the violence is mild.<br><br>If you see this film, do it the same way you would watch an Ed Wood movie and you'll have your fun. This film was made in such an easy-going way that if you let yourself flow with it, you will have a smile on your face when it ends.","user":"andrabem","rank":[16,19]},{"title":"Better than average Jess Franco outing","rating":8,"date":"23 August 2012","review":"Cunning and ruthless femme fatale Sumuru (deliciously played with lip-smacking wicked aplomb by Shirley Eaton) leads an all-female army who are planning to take over the world while operating out of Sumuru's base nearby Rio de Janeiro. Handsome American playboy Jeff Sutton (dashing Richard Wyler) reluctantly joins forces with shrewd crime kingpin Sid Masius (George Sanders in peak suave and sardonic form) in order to stop Sumuru. Director Jess Franco, working from a campy script by Harry Alan Towers, relates the entertainingly goofy story at a snappy pace, maintains an engaging tongue-in-cheek tone throughout, makes the most out of the exotic Rio locations, offers a few inspired bizarre touches (for example, a gang of chortling flunkies wearing freaky devil masks), delivers a funny sense of sharp sarcastic humor, and stages the reasonably exciting action set pieces with more competence than usual (the lively climax is especially rousing). Moreover, there's a nice sprinkling of tantalizing peek-a-boo nudity and a bevy of beautiful women to make things more sexy and merry: The luscious Maria Rohm provides a tasty eyeful as the sweet Lesyle, the comely Marta Reeves likewise impresses as fetching rich babe Ulla Rossini, and the foxy Elisa Montes is a kittenish delight as Sid's loopy, yet sultry main squeeze Irene. Daniel White's jazzy and energetic score hits the swinging syncopated spot (the groovy theme song is a total gas, too!). Manuel Merino's vibrant and stylish cinematography gives the picture a funky psychedelic look. Extremely enjoyable vintage 60's kitsch.","user":"Woodyanders","rank":[6,6]}]