[{"title":"There is really no way to correctly rate this strange experiment of a film","rating":18,"date":"18 January 2008","review":"About 2 months after obtaining this title, I've not been able to find words to describe this movie, other than strange and bizarre. Depending on your mood it's either a noble failure or a triumph in film making. I couldn't use the terms ground breaking to describe it, but there's something important about the texture of this film.<br><br>Imagine John Hughes and Sam Raimi kicking back and doing some hard drugs and deciding to make a movie together. It might look like this. It spends a good amount of time before it gets anywhere, focusing on four teen girls whose names seem to support their abilities, expertise, or interests. At this point, it plays almost like an average teen rom-com. But note the campy soundtrack, dancing school girls, and some rather strange almost comic book like backgrounds.<br><br>It starts getting interesting as the girls set forth to movie's namesake house. They flashback and do storytelling in the form of a silent movie. We get to see some slapstick characters which don't belong in a horror movie, and we have a roll call of our four heroines as they head off into the woods. Enter the House alluded to in the film's title.<br><br>So the horror begins. But this is Sam Raimi style horror. In fact, I wouldn't be surprised if some of this inspired Evil Dead - if the film was available - who knows. There's a whole series of odd scenes. Most notable is the infamous piano scene, where a piano devours someone. But that's not all. There's an evil kitty, a clock the spills out blood ala Evil Dead, a river of blood and some kooky camera work and odd cut aways! \"Ambitious\" might be the operative word to describe this movie. When I watch it, I'm not quite sure if it all works. The effects are crude, but not in the Ed Wood \"you can see the strings\" style. For me, some of it is like reading a comic book. They're bigger than life, not meant to scare you in the classical sense. But it is unlike anything you've seen before.<br><br>I guess if I have any gripe about the film, it's that it takes a good while to get really fun, but when you get there, it's an insane joyride. But it's not a normal movie viewing experience and a rating does not serve it well. Watch it for yourself - and it probably wouldn't hurt to have a drink or two while doing so.","user":"mrtimlarabee","rank":[61,73]},{"title":"Enough awesome to kill a rhino","rating":10,"date":"25 January 2003","review":"It has been said that Hausu is like Beetlejuice as directed by Dario Argento, only about ten times better than that would be.  While this description is admittedly vague, it's hard to think of one that comes any closer to being satisfactory.  Nobuhiko Obayashi's film defies comparison, seamlessly blending comedy, horror, and gorgeous visuals in a way that really must be witnessed in order to be appreciated.<br><br>The plot itself is nothing very new, and is a kind of supernatural take on Agatha Christie's \"Ten Little Indians\" -- Seven Japanese girls venture off to visit Grandmother in her big, spooky house, unaware that the house is in fact a demon that consumes virgins.  One by one, they are killed in increasingly bizarre ways -- One is eaten by a piano, one by bedding, to go on would be giving away far too much.<br><br>But the story isn't really what's important here.  Suffice it to say you have never seen a film like this before -- part satire, part camp, part coming-of-age story, merged with horror that is truly disturbing. The laughs are terrific and the scares are genuine; you may often feel unsure whether to laugh or shudder, and don't be surprised to catch yourself doing both at once.  As if this weren't enough, add to that Obayashi's completely unique visual flair; not a single shot goes by without astounding imagery and effects.<br><br>It is impossible to adequately describe Hausu for someone who hasn't seen it.  But if what I've written has made it sound even the slightest bit interesting to you, you owe it to yourself to seek it out and see for yourself.  Oh, and there are no subtitles, but you don't need them. Seriously.","user":"Jerk-off","rank":[76,95]},{"title":"Phantasmagorical + English Subtitled DVD","rating":10,"date":"8 March 2007","review":"In the hands of experimental Japanese filmmaker Nobuhiko Obayashi, the tale of seven \"unmarried\" young high-school girls who, during a school break, travel to a spooky, remote hilltop house to visit the reclusive, mysterious Aunt of one of their fold only to be consumed one at a time by the Ghost-House/Aunt in increasingly novel ways, is escalated into a spastic, phantasmagorical confetti burst of avant-garde techniques and tonalities. Not a minute goes by without some kind of imaginative and spirited experimental visual manipulation or interjection; from kaleidoscopic color schemes, to frame and time altering collage montage, to wild, high-concept mixed media integration (animation, mattes, props, sets, etc), to mini-movie injections (lovingly parodying/mimicking everything from silent film stylistics, to romantic fantasies to obligatory action scenes). Any and all workings of the film form are here incorporatedly warped; from imagery and editing to music and sound to content and presentation. Even the sketches of characters and their respective performances by the actors are hemmed in time with the overall off-the-wall configuration. (Example: Each girl is intentionally drawn with their stock personalities (the musician, the over-weight eater, the athlete, etc) novelly paraded in gleeful iconic irreverence.) The moods and tones of the film are equally melodic in their own discordant tangential way; seamlessly walking the line between comedy, horror and the deadpan aloof. It all adds up to a whole lot of fun. Where else could you see a girl eaten by a piano, an upright Bear helping cook dinner at a roadside noodle-stand or a man turned into a pile of bananas because he doesn't like melons!? With all its packed in candy-colored confections and novel door prizes, \"Hausu\" is a cinematic surprise party all in one...just add you.<br><br>Get an English Subtitled DVD at: allcluesnosolutions.com","user":"VideoKidVsTheVoid","rank":[52,70]}]