[{"title":"Jet Pilot Surprise","rating":9,"date":"16 May 2006","review":"At the ripe old age of 50, I was amazed to see JET PILOT today for the very first time. Not many Wayne films have escaped me, but this one had. As I was watching the film, it occurred to me that ol Duke must have enjoyed being a fighter pilot (as he should) because he played a pilot in at least 6 films I could think of off the top of my head. Janet Leigh was not overly convincing as a Soviet, but WOW is she gorgeous... WHO CARES. Still, if she had a convincing Russian accent and some leather this would have been the Duke's best effort! Great film of some wonderful machines, and such a treat to see them as well. I became a fighter pilot because of the F-86 though I was too old to fly one... this film features them constantly. Chuck Yeager stunted for the film and broke a tail in a Sabre pressing the envelope. Overall, just a nice film, that was totally unlike any Wayne film I had ever seen. Normally, you know exactly how the plot will go, and that Good, Truth, and the American Way will prevail... but this one... actually makes you wonder if that is going to be the case?!?! Maybe not for the Duke, you know he has a trick up his sleeve, but Janet Leigh?? She is a wild card and you never know till the end who will win out. This movie was akin to finding a $20 bill in your pocket from last year... it has been there a long time, and just a nice treat to come across it.","user":"larryludwigpilot","rank":[31,36]},{"title":"Janet Leigh in a flight suite.","rating":16,"date":"16 February 2005","review":"A little bit on the corny side, but still and over all good movie. John Wayne is pretty straight forward in this movie. He plays Air Force Col. Jim Shannon who get a surprise landing at his base by none other Janet Leigh. Who is a Lt, in the Russian Air Force. She pretends to want to defect and woos John Wayne. It's all just a Russian plot to get information to take back to the mother land. Big John falls for it hook line and sinker, only to find out after they are married she is just a spy. But who wouldn't fall for Janet Leigh? John Wayne in turn goes back to Russia with her to feed them useless information. Leigh then really falls in love with the Duke. Then they have to make a daring escape back to the good old USA.<br><br>Janet Leigh is just beautiful in this movie. There is a scene where she changes out of her flight suite that will keep you glued to the screen. Just watching her on the screen makes this movie worth watching.","user":"lee188","rank":[11,12]},{"title":"Gruff US pilot assists female Russian pilot to defect.","rating":9,"date":"20 January 1999","review":"Howard Hughes produced this ahead-of-its-time film in the late 1940's, but couldn't get it released until US Air Force clearance was approved in 1957. It sat on a shelf in storage for 8 years until its release.  John Wayne is his usual macho self, an American flyer, ladies man, infatuated with a Russian pilot who treats him like a spy.  A very young Janet Leigh is the pilot who falls in love with tough-guy Wayne and agrees to defect to the US as his wife.<br><br>The special effects in this film are quite convincing in spite of its age. Of course, the US Air Force helped everywhere needed to make the picture seem real.  Thought that the idea of a female Russian pilot was interesting since the movie was made long before women's lib.<br><br>John Wayne and Janet Leigh are especially good together as are the usual cast of colorful characters who help pad out the storyline.  This is one of my favorite John Wayne pictures.  He is surprisingly natural in his performance with a light touch of good humor thrown in for good measure. Most any John Wayne fan would enjoy this film heartily.","user":"raph-6","rank":[28,36]}]