[{"title":"Is it to late for this movie to have a cult following?","rating":10,"date":"24 November 2004","review":"I just watched this film because my dad recommended it as a movie he<br><br>remember as being funnymabey. I was skeptical at the beginning, I thought to myself a dated film with an absurd summery on the back. The only reason I sat and watched it was the list of actors, Sutherland and Gould. I was immediately enthralled. I have been a fan of Terry Gilliam films for a long time and to see a film that can achieve his insanity and social messages with out the elaborate sets and costumes Gilliam uses is astounding. The acting is superb, there is no other word that can encapsulate these performances. Every character is riveting until the end. The monologues given are thought provoking to say the least. My original thought that this film was dated could not be farther from the truth, I was in fact surprised by the connections that can be drawn to our modern times. I am surprised that this film did not receive more praise. It is also disappointing that the other Alan Arkin films were given less than glowing reviews. The only question I have is: is it to late to have a cult following for this movie? Anyone else in?","user":"honor-1","rank":[41,49]},{"title":"One of Donald Sutherland's most memorable scenes in a movie","rating":7,"date":"1 July 2006","review":"Sutherland's wedding monologue is so delightfully inspired, it should be available SOMEWHERE on the internet via search engine, but since it is not, I have quoted Jules Feiffer's brilliant writing below. Remember this is supposed to be a marriage ceremony: <br><br>Rev. Dupas (Sutherland): You all know.. why we're here. There's often so much sham about this business of marriage. Everyone accepts it: ritual. That's why I was so heartened when Alfred asked me to perform this ceremony. He has certain beliefs, which I assume you all know; he is an atheist, which is perfectly all right, really it is; I happen not to be, but inasmuch as this ceremony connotes an abandonment of ritual in the search for truth, I agreed to perform it. First, let me state to you, Alfred, and to you, Patricia, that of the 200 marriages that I have performed, all but seven have failed. So the odds are not good. We don't like to admit it, especially at the wedding ceremony, but it's in the back of all our minds, isn't it: how long will it last. We all think that, don't we? We don't like to bring it out in the open, but we all think that. Well I say, why not bring it out in the open. Why does one decide to marry? Social pressure? Boredom? Loneliness? Sexual appeasement? Love? I won't put any of these reasons down, each in its own way is adequate, each is all right. Last year I married a musician who wanted to get married in order to stop masturbating. Please, don't be startled, I'm NOT putting him down. That marriage, did not work. But the man TRIED. He is now separated, still masturbating, but HE IS AT PEACE with himself because he tried society's way. So you see, it was not a mistake, it turned out all right. Now, just last month I married a novelist to a painter. Everyone at the wedding ceremony was under the influence of an hallucinogenic drug. The drug quickened our physical responses, slowed our mental responses, and the whole ceremony took two days to perform. NEVER have the words HAD SUCH MEANING. Now THAT marriage, should last. Still, if it does not, well, that'll be all right, for don't you see, any step that one takes is useful, is positive, has to be positive because it's a part of life, even the negation of the previously taken step is positive, that too is a part of life. And in this light, and only in this light, should marriage be viewed: as a small, single step. If it works, fine! If it fails, fine; look elsewhere for satisfaction. To more marriages, fine, as many as one wants, fine. To homosexuality? Fine! To drug addiction? I will not put it down, each of these is an answer for somebody. For Alfred, today's answer is Patricia. For Patricia, today's answer is Alfred. I will not put them down for that. So what I implore you both, Patricia, and Alfred, to dwell on, while I ask you these questions required by the state of New York to \"legally bind you\" -- sinister phrase, that -- is that not only are the legal questions I ask you, meaningless, but so too are the inner questions that you ask yourselves, meaningless. Failing one's partner, does not matter. Sexual disappointment, does not matter. Nothing can hurt, if you do not see it as being hurtful. Nothing can destroy, if you do not see it as destructive. It is all part of life, part of what we are. So now: Alfred. Do you take Patricia to be your lawfully wedded wife, to love -- whatever that means -- to honor, to keep her in sickness and health, in prosperity and adversity -- what nonsense! -- forsaking all others, -- what a shocking invasion of privacy! Rephrase that to more sensibly say, if you choose to have affairs, then you won't feel guilty about them. -as long as you both shall live, or as long as you're not tired of one another.. ? <br><br>Alfred: Yeah. <br><br>Rev. Dupas: And Patsy, do you take Alfred to be your lawfully wedded husband, to love -- that harmful word again, could not one more wisely say, communicate? -to honor,-- I suppose by that it means you won't cut his balls off, but then, some men like that! -to obey,-- well, my first glance at you, told me you were not the type to obey. So I went to my thesaurus, and I came back with these alternatives: to show devotion, to be loyal, to show fealty, to answer the helm, to be pliant. -General enough, I think, and still leave plenty of room to dominate. -in sickness and health, and all the rest of that GOBBLEDYgook, so long as you both shall live.. ? <br><br>Patsy: (confused, speechless.. finally stammers:) I do. <br><br>Rev. Dupas: Alfred and Patsy, I know now that whatever you do.. will be all right.<br><br>Rev. Dupas: To Patsy's father, Carroll Newquist -- I've never heard that name on a man before, but I'm sure it's all right -- I ask you sir, feel no guilt over the $250 check you gave me to mention the Deity in the ceremony. What you have done is all right. It's part of what you are, it's part of what we all are. And I beg you not to be overly perturbed, when I do not mention the Deity in the ceremony. Betrayal, too, is all right, it too is part of what we all are. <br><br>Rev. Dupas: And to Patsy's brother, Kenneth Newquist, with whom I had the pleasure of a private chat, I beg you feel no shame, homosexuality is all right, really it is.. it is perfectly all right.. <br><br>Kenneth Newquist: (screaming) Sonovabitch!! Aarrggghh!! (assaults the minister.) (Marriage ceremony descends into a brawl.)","user":"trailmeister","rank":[24,29]},{"title":"Pitch-perfect black comedy","rating":10,"date":"27 July 2001","review":"It doesn't get any darker than this, folks.  Jules Feiffer shows off his penchant for absurdity and his mastery of the monologue (Lou Jacobi, Donald Sutherland and director Alan Arkin each get one powerhouse scene where it's basically all them with the other characters reacting). The cast is excellent and their handling of Feiffer's language is amazing. Elliot Gould's performance is particularly effective, and Vincent Gardenia as his father-in-law is hysterical.<br><br>I saw this film and then read the play it was based on, and both give off the same claustrophobic air of desperation while still being side-splittingly funny.  It is definitely worth hunting down.  In the words of Father Dupas, it is \"all right.\"","user":"craigjclark","rank":[18,21]}]