[{"title":"An excellent and exciting bikers go to 'Nam 70's trash exploitation classic","rating":9,"date":"10 January 2007","review":"Rough and tumble hog-riding Hell's Angels hellions Link (the almighty William Smith), Duke (the equally awesome Adam Roarke), Dirty Denny (former real-life Green Beret Houston Savage), Speed (Gene Cournelius) and Limpy (a fine Paul Koslo) are recruited by the CIA to rescue an arrogant presidential adviser (expertly played to the hateful hilt by director Jack Starrett) from the vile clutches of the Red Chinese in Cambodia.<br><br>Directed with his customary rip-snorting brio by the extremely underrated and always dependable Starrett (whose other credits include the Jim Brown blaxploitation vehicle \"Slaughter,\" the hugely enjoyable \"Cleopatra Jones,\" and the Satan worship car chase knockout \"Race With the Devil\"), this bang-up gutsy and thrilling little pip works like gangbusters. The pace storms along at a steady, speedy clip. The performances from the top-rate cast are all uniformly excellent (it's a real treat to see biker pic perennials Smith and Rourke on screen together, plus longtime favorite Filipino fat guy thesp Vic Diaz has a funny supporting part as a friendly mechanic). The incredibly explosive action sequences are staged with considerable incendiary aplomb (the big climactic raid on an enemy prison camp is a definite highlight). Moreover, the bikers themselves aren't glamorized or sanitized in the least. These dingy dirtball dudes are pure bad news. They are a scruffy bunch of mangy nonconformist malcontents who are as likely to brawl with each other as well as anyone else who crosses their bitter antagonistic path.<br><br>Better still, this remarkably bold picture fiercely ridicules America's involvement in the Vietnam war, clearly stating that we hurt these people more than helped them (the subplot about the Vietnamese prostitute with a mulatto baby is especially poignant and provocative). The fact that this defiant movie was made while the Vietnam war was still going on makes it that much more pertinent and resonant. And the crushingly downbeat bummer ending is likewise very powerful with both its unflinchingly cynical anti-government stance and unsparingly grim statement about the wasteful futility of war. In addition, this film was also influential in that it established the basic let's-bring-the-boys-back-home premise which was later reused in such 80's action features as \"Uncommon Valor,\" \"Missing in Action,\" and \"Rambo: First Blood, Part II.\" The Dark Sky DVD offers a beautiful widescreen presentation along with the following tasty extras: two radio spots, the theatrical trailer, a still and poster gallery, and, perhaps the single most savory bonus, a highly amiable, entertaining and informative commentary by stars Paul Koslo and William Smith.","user":"Woodyanders","rank":[8,10]},{"title":"William Smith is the Man","rating":6,"date":"10 January 2010","review":"William Smith is my all time favorite B-Movie actor- a truly talented individual whose list of lifelong accomplishments is extraordinary. He single handedly made movies like \"The Losers\" watchable and even enjoyable if you don't take them too seriously. The film centers around the U.S. Army hiring a motorcycle gang to rescue a presidential adviser being held captive in Cambodia. Smith plays gang leader Link Thomas, whose Army Sergeant brother sets up the mission. Most of the movie is spent focusing on events leading up to the mission with the gang partying, smoking, getting in fights and souping up their choppers as the rescue nears.<br><br>The acting is average, although a respectable cast (Adam Roarke, Paul Koslo &amp; Bernie Hamilton) was assembled. There is too much time spent on love interests which tends to bog down the film, but the latter half especially is very entertaining as the mission takes place. This is 70's schlock through and through, but is a treat for William Smith fans, as he gets top billing and the lions' share of screen time.<br><br>No one will confuse this with anything Oscar worthy, but so what? A good way to numb your mind for an hour and a half.","user":"ramsfan","rank":[5,6]},{"title":"OK biker/war flick.","rating":11,"date":"11 March 2003","review":"In order to rescue a Presidential Advisor (in a Francis Ford Coppola costume) from a group of Chinese Communists in Cambodia, the government enlists a subdivision of Hell's Angels led by William Smith to break in there and get him out. The back of the box said this film has more action than 'The Dirty Dozen' and 'The Wild Bunch' combined. To call that a vast overstatement would be a vast understatement. In reality, the film is a bunch of bikers having sex, getting drunk, getting wasted, getting into lame fistfights, falling in love, waxing poetic and building stupid-looking motorcycles sandwiched between two decent action scenes with 2nd rate Enzo G. Castellari slow-motion (which would make it 4th rate Peckinpah). All in all, it's actually not bad, but the climax should have been better considering the time we have to wait in order to get to it. Have ear plugs ready when the title song comes up. It's a soft medley probably sung and written by some drugged out hippie chick that doesn't fit with the movie at all.","user":"Samoan Bob","rank":[11,18]}]