[{"title":"A labor of love","rating":25,"date":"25 December 1998","review":"I am frankly mystified by the comments of those who seem to find this film disappointing or inadequate, and even more by those who claim to prefer the 1956 version, which I consider to be inferior in every respect to the later version, except for some top quality performances by Donald Pleasence and Michael Redgrave in supporting roles.  In my opinion, this later version of \"Nineteen Eighty Four\" is one of the best literary adaptations I've seen.<br><br>The film was obviously a labor of love for director Michael Radford, who also co-wrote the screenplay.  As noted in the end credits, the film \"was photographed in and around London during the period April-June 1984, the exact time and setting imagined by the author\".  If this were a big-budget Hollywood bomb, I might consider that a publicity stunt, but in the case of this little-known, little-seen British film, it's fairly obviously a form of homage.<br><br>The look of the film is extraordinary in its evocation of the world Orwell created, down to the tiniest detail.  Although that world was obviously very different from the real world of 1984, a deliberate choice was made to stick with the Orwellian vision in every way, anachronistic technology and all, and I firmly believe it was the right choice, as opposed to the \"updating\" we sometimes see in adaptations of classic \"futuristic\" stories.  Thus, we are treated to the baroque and slightly disorienting sight of black rotary-dial telephones, pneumatic document-delivery systems, old-fashioned \"safety razors\", tube radios, etc., all of which were already obsolete at the time of filming.  And of course, the omnipresent black-and-white \"telescreens\" with rounded picture tubes.<br><br>As Winston Smith, the story's protagonist, John Hurt is an inspired piece of casting; absolutely the perfect choice.  Not only does he fit the author's description of Smith to a \"T\", but with the haircut he's given, he even bears a striking resemblance to Orwell himself.  And there is no actor alive better than Hurt at evoking victimization in all its infinite gradations and variations.  Suzanna Hamilton, relatively little-known here in the US, also does a fine job as Julia.  The film also contains the final film appearance of Richard Burton, in one of his most fascinating and disturbing performances as O'Brien.  And the great Cyril Cusack does a classic turn as Charrington, the pawnshop proprietor.<br><br>Right from the opening scene, in which we look in on a screening of a short propaganda film, brilliantly conceived and executed by Radford, during the daily \"two minutes hate\", climaxing in Dominic Muldowney's memorable, genuinely stirring national anthem of Oceania played behind the gigantic image of Big Brother, we are catapulted headlong into Orwell's nightmare vision.  While not a particularly long novel (my copy is 256 pages), it is nevertheless dense with ideas, and it would be impossible for a standard-length film to include them all, even if the audience could stand all the endless talking heads it would require.  Given the inherent limitations, I think the film largely succeeds in preserving a good portion of the ideological \"meat\" of the novel.  It is certainly extremely faithful in the material it does include.  Even the incidental music by Eurythmics feels entirely appropriate, and doesn't in any way break the mood.  In fact, it even enhances it.<br><br>While I thought the 1956 version did a fairly good job for the time, it had a number of flaws in my estimation that made it far less successful an adaptation.  For one thing, although the world it portrays is grim, it's not nearly grim enough.  Also, Edmond O'Brien may have done a creditable job as Smith, but physically he's all wrong for the part.  The portly, even chubby O'Brien bears little resemblance to the slight, emaciated, chronically exhausted, varicose-ulcerated Smith described in the novel.  Neither is the 1956 version as faithful to the book; some of the material is softened, and there are odd, unexplainable alterations: O'Brien becomes O'Connor, and I don't think that Goldstein, the possibly imaginary leader of the possibly fictitious \"Resistance\", is even mentioned.  At 90 minutes, it runs a good 23 minutes shorter than the later version, which necessitates the trimming of even more of the novel, for all you literary purists.  In all, for me, the 1984 version of \"Nineteen Eighty Four\" is the definitive version; a remarkably vivid and memorable film.","user":"hojoe","rank":[111,119]},{"title":"Comments on Comments","rating":9,"date":"9 March 2004","review":"I really have only one thing to comment on. Most of the other reviewers have stated just about everything about this wonderfully gritty, dark, foreboding movie that still remains an eerie parallel to our lives today, especially in the last 2 years...<br><br>But I'm confused by the number of people who have commented that claim to be put off by \"the gratuitous nudity\" by the two characters of Winston and Julia. Given the fact that everything in this society--waking up, food, habits, desires, work, workers, even the underwear and overalls--is so uniform, has it occurred to viewers that being nude was the only link to identity that these characters had? Everything in their world depends, thrives on sameness. Without clothes, everyone is unique. The two lovers were already in dire conditions by committing the sin of feeling for another human being, let alone carnally but in the heart. And they had to deceive and pretend and go through the motions of the dutiful cogs in the Big Brother wheel. But their only shared peace and comfort was their sacred time alone, and in love. They had finally found their own identities through loving each other. Their nudity was merely symbolic of that. In that sense, their union and expressions of that union only becomes more fragile, beautiful and honest, in such a heartless, cold, indifferent world.<br><br>May that be truly said of us, and all of us...<br><br>OK, that out of the way...one of the most gritty, realistic, honest translations ever to grace the screen. Wouldn't have changed a thing. Highly, highly recommended, along with the original 1955 version of \"Animal Farm\". Perfect double-feature for a somber, thoughtful evening's viewing.","user":"eadaoin7","rank":[232,265]},{"title":"Faithful adaptation - maybe too much?","rating":7,"date":"22 June 2005","review":"George Orwell's literary masterpiece \"1984\" is presented with amazing accuracy and detail in this version filmed during the very months of the author's vision. The casting, set design, and atmosphere are all right on the mark for how I envisioned them during reading the book. This film is dark and uncompromising, and follows many of the dialogs verbatim from the book.<br><br>The flaw in the film, for me, is that I felt like I only enjoyed and understood this movie BECAUSE I had read the book already. There is a theory I once heard and agree with: the closer an adaptation is to the source, the more necessary it is to read the source. A good adaptation is faithful to the essentials of a story but makes necessary changes so that it not only becomes cinematic, yet also becomes something that a viewer unfamiliar with the source material can understand. I think if I were ignorant of the story, there are too many things that would confuse me in this film which the book seems to go out of its way to explain.<br><br>For example: Who/Where exactly is Oceania? How did the countries go from their current political state to the envisioned one? Why do the people gather in mass and scream passionate hateful exclamations at the screen? What exactly does Winston actually do? Who are the proles? I praise movies that can effectively tell a story without means of voice-over, a much overused device in films. In this case though, I think a little may have helped, not necessarily wall-to-wall, but sparingly used. The movie is effective by being more ambiguous than the book, but I tend to think maybe it is too ambiguous.<br><br>In summary, read the book if you haven't (either before or after seeing the film) to get a complete overview of the author's vision. With that as a foundation, this really is a good cinematic portrayal, and of a story that is still relevant and not impossible to come to pass. Obviously 1984 is long since gone bye-bye, but 2084 or 2054? Oppression can always come as long as people desire self-centered power and the masses don't pay close attention.","user":"mr composer","rank":[161,182]}]