[{"title":"\"From now on we're gonna be ready for plenty of trouble\".","rating":6,"date":"18 July 2010","review":"This one's a pretty entertaining B Western bringing together Johnny Mack Brown and Tex Ritter, AND Jimmy Wakely, AND Fuzzy Knight in one of your standard water rights tales that the genre regularly recycled. There's even a couple of gals on hand, good girl Mary Lee (Jennifer Holt) and bad girl Belle Turner (Mady Correll), who should have been given more time to mix it up in that cat-fight at Mary's Lost River Trading Post. The boys broke it up way too soon.<br><br>There's a fine mix of tunes sprinkled throughout the story, with Ritter's character, Montana Smith getting in a nice solo during an early scene. He later joins the Jimmy Wakely Trio in a cool rendition of 'Lone Star Trail'. Wakely's touted as 'The Singing Thrush of the Sagebrush' on a posted handbill but you have to be attentive to catch it. Wakely certainly had a fine voice, but his character here is pretty one dimensional, almost looking like he was in a daze whenever on screen. Couldn't figure that out.<br><br>Fuzzy Knight is introduced early as a sideshow magician and hypnotist called The Great Polario, but later reverts to his alter-ego Albert J Pendergast. He has a running gag with Earle Hodgins' Hopping Crow character, who keeps asking for his money back from Polario's less than entertaining matinée gimmick. There's also Fuzzy's urgency to get his steer Oswald back when it's rustled by the bad guys. Not only did Oswald make it back, but he played a role in making the save for the good guys' herd.<br><br>There's one element of the story though that's a bit of a head scratcher. Mary Lee starts out the story as Montana's girl and along the way winds up with Dusty Gardner (Johnny Mack Brown). You can point to that early bar song scene when Mary caresses Dusty's arm, and Montana gets jealous. But there seems to be no motivation for the romantic switch since it was the first time Mary and Dusty ever met. I guess stuff like this wasn't supposed to make much sense other than to move the story along, which it did to make Montana turn heel for a portion of the story. But the traditional good guys patched things up for the finale, with Montana riding off into the sunset and Dusty getting the girl.","user":"classicsoncall","rank":[5,5]},{"title":"The Wild Card on the Old Chisholm Trail","rating":5,"date":"15 July 2011","review":"The Old Chisholm Trail which is about Johnny Mack Brown trying to drive a herd to Abilene on said trail has three bona fide cowboy heroes in the cast. In addition to Brown, Tex Ritter and Jimmy Wakely get to do a bit of singing. Unfortunately Johnny Mack Brown could not sing a note and didn't try.<br><br>Brown runs into a bit of a problem with Mady Corell who has staked a claim on the only waterhole around and she wants $5.00 a head for every steer and cow that drinks there. <br><br>It's enough to make Brown stop driving his herd and start drilling for water on Jennifer Holt's property. Holt and Correll have a dandy fight that's broken up way too soon. <br><br>In the picture are medicine show entertainers Jimmy Wakely and partner Fuzzy Knight and a mysterious singing gambler in Tex Ritter. Ritter is the wild card in this film. Sad to say though his part is badly written, it could have been more interesting, but he's letting his hormones in regard to Holt and his jealousy of Brown interfere with the job at hand. <br><br>The Old Chisholm Trail boasts some nice musical numbers which don't get in the way of the plot. Still it's the storyline that could have used some beefing up.","user":"bkoganbing","rank":[4,5]},{"title":"Good Songs, So-So Film","rating":16,"date":"16 July 2011","review":"The corn is higher than \"a elephant's eye\" in this obscure Western trifle. Tex Ritter and Jimmy Wakely provide dandy singing of some excellent songs, elevating what is otherwise a superficial (and sometimes downright tedious) story about the battle for water rights along the old Chisholm Trail.<br><br>Johnny Mack Brown and his gang of cowboys are trying to get their thirsty cattle to market, but the only water left on the old Chisholm Trail is controlled by a flashing-eyed, raven-haired beauty played by Mady Correll who demands an extortionate fee from the cowboys in order to cross her land to water their cattle. When the cowboys, hopelessly broke and righteously indignant at this transgression of the Code of the Old West, refuse to pay, this feisty vixen spends the rest of the film double-crossing everyone, rustling cattle, sending her bully boys into several ridiculously harmless gunfights with the good guys, and otherwise making herself utterly repulsive to all right-thinking He-Men... when she isn't vainly tempting Our Hero with her Fatal Beauty, that is.<br><br>Unfortunately, I'm making this sound like much more fun than it actually is. The film treads the boundaries of campy parody without actually crossing that line... but it comes mighty close.<br><br>One of the highlights of the film is a cat-fight between our villain and the blonde-haired proprietress of the local saloon (played by the lovely Jennifer Holt), which is tremendous fun and over far too quickly. One of this movie's charms is that it doesn't take itself too seriously, which makes it acceptable to watch... although I found the comic relief provided by Fuzzy Knight as a cowboy-turned-sideshow-magician and Earle Hodgins as an outraged cigar-store-like Indian who wants his money back to be tiresome.<br><br>The film is at its best when the cowboys are singing their excellent songs and the plot disappears, but, to give the film its due, the script mostly makes logical sense (however far-fetched the motivations might be) even if you don't really care about anything that happens. The only cliché missing from this film is Jennifer Holt being the saloon girl with the heart of gold... she's too pure for that. Otherwise, this is pretty formulaic drivel with the exception of Mady Correll as the villain rather than some black-hat-wearing hombre.<br><br>If you happen to catch this film, there are several moments of campy goodness to amuse you. The songs are good (especially The Old Chisholm Trail, the opening number of the film). But don't go out of your way.","user":"glofau","rank":[4,6]}]