[{"title":"Another Woman's Midwinter Night's Sex Comedy","rating":8,"date":"26 April 2005","review":"Alice Tate (Mia Farrow) is living in New York City, married to Doug (William Hurt), a man from a wealthy family. They have two kids, a lavish condo and domestic employees. Alice eats caviar, spends her days shopping, getting manicures and pedicures, and so on. However, she's not very happy. She's even been thinking about having an affair. When she finally goes to see an acupuncturist, Dr. Yang (Keye Luke), on several friends' advice because her back is bothering her, he tells her that her problem is in her head, not her back. Through his extremely unorthodox treatments, Alice gradually transforms her life.<br><br>Although there is a fair amount of light humor in Alice, and it is relatively upbeat and hopeful, the bulk of this film is much more in the vein of director/writer Woody Allen's more \"serious\" straightforward dramas, ala Interiors (1978), September (1987) and Another Woman (1988). Interestingly, Allen has a strong fantastical thread running through Alice at the same time, and it references a number of literary classics--both thematically and occasionally in terms of more literal content-resulting in a kinship also with Allen's A Midsummer Night's Sex Comedy (1982).<br><br>At its heart, Alice is a film about awakening and then achieving authenticity. It is told with a nod to Charles Dickens' A Christmas Carol (1843) (which is even supported by the appearance of \"O Tannenbaum/We Wish You A Merry Christmas\" by Liberace on the soundtrack at one point), with slight references also to Lewis Carroll's Alice's Adventures in Wonderland (1865) and other fantasy literature, including J.M. Barrie's Peter Pan (1911).<br><br>The catalyst through all of Alice's revelations is Dr. Yang, whose slightly rundown Chinatown office is symbolic of Alice periodically making trips to another world for enlightenment, or making repeated treks to pose questions to a metaphorical Oracle at Delphi. Dr. Yang's treatments are designed to address the various ways in which Alice needs to \"open up\", the various emotional needs she must come to terms with.<br><br>It is interesting to note, especially after Allen's The Curse of the Jade Scorpion (2001), that the initial spark for Alice's transformation is provided by hypnotism, as that device appears for the same ultimate purpose in Curse. This probably has some significance for Allen outside of his life in film, although it is difficult to say whether its because he's undergone hypnotic treatment himself or whether he just sees it as a metaphor for digging beneath public facades which one has fooled oneself into believing, too.<br><br>Dr. Yang's treatments either result in encountering some important person or event from Alice's past and/or tapping into some unrealized potential. The encounters are often not with real persons. They can be memories made almost literal, ghosts, or hallucinations. These are the most direct parallel to A Christmas Carol. As in that story, eventually Dr. Yang's treatments lead Alice away from an embrace of materialism for its own sake to an appreciation of more humanist values. Of course, Allen makes it a bit more complex than this, so that the positive transformation also has an impact on personal relationships that could be seen as negative, as well.<br><br>Alice is also remarkable for its cinematography, which is usually symbolic of the dramatic scenarios. Sometimes this is very overt, as when Dr. Yang's office transforms into an amusement park midway (the slowly strobing red light was particularly exquisite, with red also symbolizing caution), and often it is subtler, as with the tracking shots of Alice and Vicki (Judy Davis) seen through various glass-like surfaces, or Alice and Joe (Joe Mantegna) through a fence as prison bars, or Alice and Dr. Yang with a wall in between them as the camera pans from one to the other, and so on.<br><br>Of course the performances are good--Allen can even get admirable performances out of actors whom I usually do not care for, such as William Hurt. Of course most of the dialogue can easily be imagined as emerging from Allen's mouth instead of whatever character happens to be on screen. And of course the music selection is a fine collection of mostly pre-bop classic jazz. In other words, this is a typical post-Annie Hall (1977) Allen film, so if you like his style, Alice is a safe bet, and if you already know you dislike his style, you're probably not even reading this far.","user":"BrandtSponseller","rank":[55,59]},{"title":"\"I've done things I didn't know I had in me. \"","rating":8,"date":"9 August 2005","review":"Less known that Allen's \"Annie Hall\", \"Hannah and her Sisters\", \"Crimes and Misdemeanors\", and \"Manhattan\", \"Alice\" is a charming and delightful film that can be viewed as Allen's remake of \"Juliet of Spirits\" with some obvious themes from \"Alice in Wonderland\". Mia Farrow plays a wealthy New Yorker who one day feels that something is missing in her sheltered and comfortable life. She turns to a Chinese doctor whose magic herbs help her to reevaluate her life and her relationships with her husband, lover, mother, and sister. She may not find the answers for all the questions but she certainly learned a lot about herself. During the few days that film takes place, Alice experiences romance, finds spirituality, and even enjoys the power of invisibility. This film has one of the most optimistic endings in Woody's film. Mia Farrow is absolutely wonderful.","user":"Galina_movie_fan","rank":[42,46]},{"title":"The Wood-man starts off the '90s in style","rating":9,"date":"9 December 2001","review":"This was the first Woody Allen film I got to see in the theaters and -- since it has such strong fantasy elements -- it was truly a magical experience.  Compared to a film like \"Crimes and Misdemeanors\" it's a bit of a lightweight, but taken on its own terms \"Alice\" is an enjoyable portrait of a woman trying to find herself and her spiritual center.  And there are plenty of funny moments along the way, which I wouldn't dare spoil for you. All I'll say is watch for Bob Balaban (the dead guy in \"Deconstructing Harry\") in the party scene late in the film.<br><br>This film also marked the first time Allen worked with the amazing Judy Davis, who would make more of an impression in \"Husbands and Wives\" two years later.","user":"craigjclark","rank":[20,24]}]