[{"title":"In the Manner of Grand Opera","rating":4,"date":"3 April 2007","review":"Mimi was one of a series of films that Douglas Fairbanks, Jr. did while visiting the United Kingdom from 1934 to 1936. It's a straight dramatic version of the Puccini opera, La Boheme.<br><br>Though The Rise of Catherine the Great is probably the best known and best received of the Fairbanks English films from this period, Mimi was a special one. It's also one of the few films that Gertrude Lawrence did and she did it at a time when she and Fairbanks were romantically involved.<br><br>In fact while making several films Fairbanks also appeared on the London stage in two different plays with Lawrence, Moonlight is Silver and The Winding Journey. Neither of those is first rank among the work of either Fairbanks or Lawrence. <br><br>And sad to say, neither is Mimi. Unfortunately realizing that their source material is from grand opera, both Fairbanks and Lawrence perform in the manner of grand opera. They overact outrageously, maybe inspired by the Puccini music that is used in the background. Doug and Gertie sure got no directorial help in this one. <br><br>Of course La Boheme served as the inspiration for the recent musical Rent and I'd suggest seeing that before watching Mimi.<br><br>Unless you're a big fan of Doug and Gert.","user":"bkoganbing","rank":[7,10]},{"title":"Dreary drama","rating":3,"date":"29 April 2016","review":"This film was made during the production regime of Walter Mycroft at Associated British.He was a former film critic so you would have though that he would have known better than to put this dreary mess into production.Maybe since the cast knew it was so bad they went very much over the top.The film is far too much like a theatrical production,with actors trying to project themselves to the back of the theatre.Probably the only point of note is the appearance of Gertrude Lawrence in one of her very few films.However it is difficult to understand the reason British producers to make films like this when the nation was in the grip of depression and seeking to be entertained.","user":"malcolmgsw","rank":[1,3]}]