[{"title":"Less is More","rating":7,"date":"28 November 2003","review":"The Car is a good example of how restraint in the horror genre can work. It honors the tradition of real suspense movies by hinting at more than it shows, and inferring more than it explains. From the cryptic opening quote by Anton Le Vey to the ending in which the two main characters disagree on whether this is really the end, this \"demon car\" film keeps asking more questions than it answers. For some, this will bring frustration, for others, it makes the movie that much more fascinating. The \"body count\" is a total of 10 people, with no explicit scenes. And there are no \"anonymous\" killings. Each victim is named and acknowledged as a real human being and a loss. This is a refreshing departure from gore-fests. I'd rate it a 7 1/2.","user":"guystr09","rank":[62,70]},{"title":"Come on down and get a good deal on existential horror!","rating":9,"date":"20 March 2001","review":"I was watching an episode of the animated sci-fi comedy \"Futurama\" on television and was laughing away at this episode about \"The Curse Of The Were-Car\" and sure enough....the car they had used was an animated version of that wonderful demon-possessed black sedan from 1977's The Car! Fond memories of that film flooded back to me....<br><br>Some critics dismissed The Car as a Jaws on wheels, and it was also lost in the wake of Star Wars' release pouncing any other films out at that time. The general audience was a bit befuddled by the more cerebral aspects of The Car and just weren't sure what they were watching. That's what makes this film one that has made a nice comeback on VHS/DVD for collectors who appreciated all the elements that made The Car unique.<br><br>While the film Christine was more of a commercial success, it was a much cruder telling of a story and didn't have a sense of wonderment that drew us into the fantasy. The Car was, as New York Press writer Jim Knipfel wrote, \"If Ingmar Bergman had made a horror movie about a murderous automobile, he would have made The Car.\" The philosophical edge didn't turn the story into a joke, but rather gave some weight to a fantastic and desperate situation, balancing the dread and the actions of the townspeople.<br><br>The Car is visually stunning, the desert location is used in a very scenic way instead of vast empty spaces that usually are obvious for film economics. Here, the locations are all over, bridges, mountains, and yes, open spaces...all are used well and keep the beauty in contrast to the sinister element driving through and plowing people down. Excellent camera work keeps this one a notch above even more mainstream films.<br><br>I've always though that cars up through the 1970s had faces on them, mostly expressions of anger or sinister intentions. The most beautiful cars in the world could just be so frightening if you look right at them. This black sedan custom made for the film could just sit there and do nothing (well, it does sit on dark streets sometimes) and you'll get chills.<br><br>Combine the scenery with the deadly car and the various personalities of the characters, and you have something more profound than just a movie about a mysterious car running people down. These people have purposes, ideals, and obviously problems, and put those against the situation they're faced with...this film is chock full of substance. In a way, like an \"art\" film, it is true as Knipfel also noted that Ronnie Cox (the alcoholic deputy) is weeping a lot and is seen mostly in doorways and windows. James Brolin (the sheriff) does tend to stop and stare at walls as if to find answers, and Kathleen Lloyd (the school teacher) decides to get in a debate with the Car as it has them trapped in a strangely placed graveyard.<br><br>While you won't be terrified out of your seat, you will definitely feel some goose bumps and find yourself with a serious look on your face as you gaze at several scenes. Yes, there is something about this film that transcended the typical horror genre. I have a first printing of the paperback novelization by Dennis Shryack And Michael Butler (Dell Books, May 1977) and the book does go a bit deeper into the why's and how's and such of the Car and the mysticism involved. But the film does a fine job of entertaining, even if you want to say it's schlock, you can't deny it's much elevated above the other B-horror efforts of the time.<br><br>Many, many horror films like the pretty-teens-in-peril ones being manufactured ad nauseam are pretty much forgotten after the initial video rentals die down. Then there are films like The Car that have been sought after for years and celebrated when it arrived on VHS/DVD for the first time since its theatrical release in 1977. Films as unique as The Car have held their own because there was care put into their production, more thought to its intention, and a long-lasting affect on those who have understood it and appreciated it.<br><br>Sure, a horror film doesn't have to be full of \"importance\" to be a fun and scary experience, but when film makers take that chance to make something more unique, then good for them! Long live The Car!","user":"hippiedj","rank":[91,105]},{"title":"WARNING!!-Please ignore all reviews on IMDb-Just watch the film and judge for yourself.","rating":10,"date":"11 January 2008","review":"If it wasn't for the fact that this site is a great reference point...I would just give up ever consulting IMDb again. 'The Car' is an exquisite, dark, modern B-Movie CLASSIC. The consensus of people that would rather give 2007's 'Transformers' a virtual 8/10 and this absolute peach a mere 5 has just about done it for me. I just give up. Honestly...I advise anyone with a half gram of sense to do the same. Does this review system actually represent the mainstream of movie goers? Or is it merely indicative of the moronic, populist, dumbed-down tripe that marks \"great CGI\" and \"All-Star Casts\". I'm beginning to feel more and more that its the latter. Increasingly, it seems there is a stockade consisting of all celebrity line-ups and patchy plots repaired by Mac Monkey Special effects, that effectively provide a barrier between us (the viewer) and any real talent.","user":"baz-howard2","rank":[58,67]}]