[{"title":"a favorite from the Ivan Tors team","rating":7,"date":"6 June 2010","review":"I have fond memories of this film, and watching it now they come back as strong as ever. Not only does lovely Bond girl Shirley Eaton make an appearance, but the stars of many of my fave shows of the 60s are present and accounted for: Lloyd Bridges (Mike Nelson of Sea Hunt), Brian Kelly (dad to Flipper), Marshall Thompson (Daktari himself), and David McCallum (the ever-cool Illya Kuryakin of U.N.C.L.E.). Along with the superb Keenan Wynn these cast members make a good compliment of aquanauts traveling in a futuristic sub on a mission to plant earthquake detecting devices around the globe. There's a solid script, just enough tension, and assured performances that supply a fun and diverting story. What really shines are the excellent underwater sequences courtesy of the Tors unit that set the standard for underwater action sequences (such as their Bond film sequences). Photographer Lamar Boren and director Ricou Browning do some of their best work here. The sub here is a real one (I found it decades later lying by the side of the interstate highway in south Florida next to an amusement park). It was built in 1956 by Martine Diving Bells of San Diego. Another nice part of this film are the great special effects by Project Unlimited (TV's Outer Limits and the props from the original Star Trek). While all the film seems quite dated now, it was believable action in its day, the sort of thing that was a not-so-guilty pleasure for a kid like me back then, and still very enjoyable today. Note the excellent score by Harry Sukman, which was released as a soundtrack LP that is a rare find these days.","user":"modern_fred","rank":[13,15]},{"title":"If you are a fan of \"diverting natural disaster\" films  you will enjoy this one.","rating":8,"date":"13 November 2005","review":"Enhanced by beautiful underwater cinematography  complements of Clifford Pollard  Lloyd Bridges gave a spectacular performance recapturing my fond memories of \"Sea Hunt\". I seem to be giving this film the only positive comments however, I really did enjoy the adventure, suspense, and even the somewhat \"campy\" personal interaction between the characters. Also, excellent performances by David McCallum and Brian Kelly  whom I remember very fondly from \"Man from Uncle\" and \"Flipper\". I found the plot as plausible as other \"diverting natural disaster\" type films both present and past. As the film begins, increased seismic activity throughout the world is threatening to produce more frequent and stronger earthquakes. Lloyd Bridges and his well trained crew  scientists and experts in their own fields  borrow a submarine from the military to place sensors in the ocean for early worldwide earthquake detection. Going along for the ride with the 4 men and 1 woman crew were 2 scientific experimental guinea pigs. Disaster threatens the mission a couple of times when a giant sea inhabitant becomes entangled in the sub after trying to eat one of the crew. Also, an underwater volcano erupts burying half of the sub in molten lava. However, quick thinking and fast action from our heroes bring a happy ending to the story. If you are a fan of \"diverting natural disaster\" films  you will enjoy this one  however  you need to catch it on TV because there is no DVD available and VHS is very limited.","user":"Charlou","rank":[19,25]},{"title":"Accurately captured the ideal of an era","rating":8,"date":"14 September 2014","review":"All those reviewers who disliked this film are largely correct: this film is largely geared toward boys, it's unrealistic, the science isn't sound, the acting might be considered weak, some effects are weak, and so on. But I still love it. So what are all those reviewers missing? <br><br>Well, it turns out there is a lot more to a film than just plot, acting, effects, soundtrack, and realism. Here's what negative reviewers are missing: This film accurately depicts a Utopian lifestyle of sorts, even in today's world. It fires the imagination. Imagine going on a round-the-world tour aboard a glass-ported submarine with elite scientists, an elite engineer, a beautiful blonde lady, being the first to explore new parts of the underwater world, playing chess (and winning!) against a state-of-the-art computer, going on a high-tech treasure hunt, working with state-of-the-art equipment, saving lives around the world due to your efforts, interacting with sea animals (via dolphin communication), and incidentally having adventures along the way. I can't think of *any* other underwater film, old or new, that realistically captures this feel of the ideal of living underwater as this film does. (\"The Core\" (2003) comes close to capturing the same cozy feeling of a state-of-the-art ship manned by elite scientists, but that was underground, not underwater.)<br><br>Films like this offer a visionary ideal for living, especially in this modern age where some people really believe that hedonism and materialism are the ultimate good, and that intellectualism and science are to be ridiculed and avoided since being \"cool\" is antithetical to intellectualism. The film also has some decent humor, and a nice, realistic mix of sexism and promotion of women's equality.<br><br>There are numerous other likable things in this film. The underwater scenery is beautiful, Shirley Eaton is beautiful, the equipment is cool, the inclusion of a chess game is terrific, the capturing of the daily submarine routine (planting sensors, playing chess) is great, and the constant presence of science provides an intellectual atmosphere.<br><br>Also, each the characters is likable in his/her own way. I especially liked Hank Stahl, whose mature insights into the ugly side of human nature are standard nowadays, and he is about the only character who is not foolishly chasing after Maggie the entire time. Also, although I'll admit it's puerile, I loved the guinea pigs, even though they were probably included just for humor and for young viewers. I even bought some guinea pigs as pets for the first time in my life as a result of re-watching this film as an adult!<br><br>There are a number of coincidences throughout that were probably accidental, but are either charming or humorous, depending on your taste in '60s movies and television: (1) a brief, repetitious, 2-note, Jaws-like musical theme in one underwater scene of the Hydronaut; (2) an UNCLE communicator-like 2-tone beeping from an alarm that goes off while David McCallum (Illya!) is in the scene; (3) a spherical sub streaming yellow dye, reminiscent of James Bond in the final underwater fight sequence in \"Thunderball\"; (4) a helicopter rescue of floating survivors at the end, reminiscent of the rescues at the end of \"Thunderball\" and \"You Only Live Twice\"; (5) entering into a briefing room where a monotone-voiced narrator is speaking, reminiscent of Number 1's briefing in \"Thunderball.\"<br><br>Some other delights for '60s fans are: (1) footage of the J. Neville McArthur Engineering Building at the University of Miami, with its charming, white waves facade; (2) Lloyd Bridges incessantly leaping into the water to try to be a hero at every opportunity, usually without enough air or without proper equipment, \"Sea Hunt\" style.<br><br>The chess match alone deserves some comment. You could view the inclusion of chess in the film only as an appeal to young adolescent males, but then you would be overlooking the Conshelf II underwater habitat of 1966 as depicted in National Geographic magazine, which had one well-known photo of two men playing chess next to a porthole with fish swimming outside. That photo, in turn, probably inspired the scene from the EPCOT ride Horizons that had two men playing chess beside a porthole in a futuristic underwater habitat. And that's not to mention the HAL-Bowman chess game aboard the spaceship Discovery One in the film \"2001: A Space Odyssey\" (1968). There is something about chess that is a good match with futuristic living quarters. Maybe it's the heavy intellectual component in both the game and the design of any such habitat, or maybe it's the contrast of ancient with futuristic (or should we say \"hypermodern\"?). Also, inclusion of the computer chess program in the film was an interesting, realistic, and historically significant. Even today online chess players on Yahoo often get caught cheating when they resort to their home chess computers for suggested moves, which is against the rules, so that twist in the plot was ahead of its time. Also, it wasn't until the 1980s that chess programs became strong enough that they could reliably beat most human players, therefore when Hank Stahl won the chess match even when Dr. Volker used a computer against him, that was realistic and ahead of its time.<br><br>The late '60s, despite its problems, was beginning to approach an ideal that was captured extremely well in this film. Everything from the pervasive white color of equipment (such as in the sub interior, ships, and helicopters) that gave a sense of cleanliness, to the orchestral score, to the constant scientific background (which was also prevalent throughout Disneyland in that era), to a simultaneous acknowledgment of women's strengths and weaknesses, gave a sense of progress, community, and balance of the physical, emotional, and intellectual. It shows us a paragon of human society that is realistically achievable. Acting skill or realism of the non-decompression scenes is irrelevant to this bigger vision.","user":"simnia-1","rank":[5,6]}]