[{"title":"My favorite film of all times, straight up","rating":10,"date":"23 May 2000","review":"This film set the standard for African-American film excellence when it was made. I heard on various stories on the film through time, that there was a push for an Academy Award nomination when it was released. This film plays on various emotions, and you definitely feel for all of the characters. Sure, some of the acting is a little wooden, but fortunately, those parts aren't pivotal. The music is sensational, and if you don't think the ending is a tear-jerker, you have no heart in your chest. If you watch \"Cooley High\", you will see that many, many films have copied various elements from it in order to strengthen their own films. The biggest example of this is \"Boyz N The Hood\".","user":"pwmoses","rank":[16,19]},{"title":"Underrated minor classic.","rating":14,"date":"14 February 1999","review":"This film, which was the foundation for \"What's Happening?\", contains the very things that recent films about teens and high school lack: comedy, and true emotion. The film takes place in Chicago, 1964, and centers on a group of lower-class black kids, including Preach, a smart student, and his close friend, Cochise, a great athlete who's on the verge of getting a scholarship. While it does contain similarities to George Lucas' \"American Graffitti\", the film has a lot of energy and substance to easily overlook that fact. There are many funny moments, including a scene where the boys joyride with Preach behind the wheel; a scene where the boys cut class and head to the zoo, ending with a hilarious encounter with a gorilla; and a scene where Preach hides from gangbangers in an occupied bathroom. There's also romance in the film, as Preach attempts to woo classy beauty Brenda; the two even lose their virginity together in a truly tasteful scene. The movie ends in tragedy, and since the characters have depth, we feel the loss. I highly recommend this one to all; it's got more going for it than 99.9% of what's playing today (and it's got a great Motown soundtrack to boot!).","user":"Rid.X","rank":[15,18]},{"title":"I love this movie, but it's hardly \"blaxploitation\"","rating":7,"date":"7 March 2004","review":"While this seems to be a black equivalent to \"American Graffitti\", I would hardly call this \"Blaxploitation\". Really not in the same boat as \"Sweet Sweetbacks Badass Song\", all those Pam Grier movies by Jack Hill, and the usual sort. Interesting to see Lawrence Hilton Jacobs in something other than \"Welcome Back Kotter\", or his low-rent action films. Interesting to note that \"Kotter\" comes up in a few posts, but I didn't see anyone mention that the TV show \"What's Happening\" (and the later, \"What's Happening Now\" I suppose), was based on, and inspired by this film, which is why I wanted to see it in the first place. This film is vastly superior to \"What's Happening\" (for many reasons, most obviously, the lack of the \"Rerun\" character), and has real heart. Also, it features some excellent use of Godzilla footage in the theatre scenes, something I always appreciate. If you haven't seen it, you really should.","user":"Judexdot1","rank":[14,17]}]