[{"title":"Fairly accurate film showing a difficult operation for the RM Commandos in WWII","rating":9,"date":"12 March 2007","review":"I loved this film. My father was a RM Commando and served during WWII. He knew most of the men chosen to carry out this mission. It follows the training and the mission of some volunteers who really didn't know what they were getting themselves into. The resultant camaraderie is poignantly shown.<br><br>It was not an easy mission and every one of the men knew there was little chance of them returning. Their job was to plant mines onto the hulls of German warships in France. They were, if successful to be picked up by the French resistance and secreted safely home. Only one of the original two-man crews survived. The rest were all captured and shot by the Germans.<br><br>My father always had a tear in his eye at the end of the movie as all the men were reunited, if only on screen.","user":"NineLivesBurra","rank":[15,15]},{"title":"Cheers For The British Royal Marines","rating":8,"date":"22 August 2008","review":"The Fifties were Jose Ferrer's peak years as an actor and he was getting acclaim for all kinds of roles he was trying out. Ferrer has never been thought of as an action hero, but in a film in which he directed himself The Cockleshell Heroes, Ferrer is outstanding in a part that someone like Clint Eastwood would have been more identified with.<br><br>This was one impossible mission given to the Royal Marines. I'm sure rowing crew at Oxford would have gotten one a starring birth on this squad. The idea here is to demolish German ships in the port of Bordeaux and render the harbor useless. The problem is that Bordeaux ain't on the coast, it's up the Gironde River.<br><br>In an amphibious operation the idea is for a picked bunch of Royal Marines to row kayak like canoes up the river after having been landed by submarine at the coast under cover of darkness. The canoes are there to insure silence so that no unaccounted for motors are heard on the river. Then the Marines are to attach mines to the various ships and hopefully they will blow up and the Marines would escape inland with the help of the French Resistance.<br><br>Sounds absolutely impossible, but it really did happen. The film takes us through the training and the mission and most of the Marines are killed. <br><br>This was typical back in the day, get a known American star for a British production to insure international distribution. In Ferrer's case having one of the great speaking voices ever in film, he could be acceptably British for the audience.<br><br>Ferrer the director got some great performances out of Ferrer the actor and the rest of his cast, particularly Trevor Howard as his second in command and administrative officer. Howard was the best in the cast, a tough man with a deep secret, he failed under fire just as World War I was ending and has a black mark on him. He gets a second chance 25 years later in another war. <br><br>Also to be noted is David Lodge the young Royal Marine who goes AWOL to settle some trouble back home with an unfaithful wife in Beatrice Campbell.<br><br>The film bears some resemblance to The Dirty Dozen and The Devil's Brigade, American productions from the next decade. But these Royal Marines weren't misfits made into a fighting force. They were some of the best of that generation who went on a mission impossible knowing that they most likely would not come back. <br><br>And it's to them and the rest of the Royal Marines that this American dedicates this review to.","user":"bkoganbing","rank":[21,25]},{"title":"One of the Must See War Movies","rating":9,"date":"9 October 2005","review":"This is one of my all time favorite war movies, first saw it in the 1950s. During what I call the \"afterglow\" of WWII we kids always played \"Army\" (any kid who didn't was probably considered a \"pinko\"), anyone who had served in WWII was 10 feet tall in our eyes. I grew up in an Anglophile family, so I was aware of Britain's war effort, and the fact that for nearly a year they carried the Allied war effort by themselves. Naturally when I reached adulthood and read the actual history I found this \"Hollywierd\" version hoked things up, unnecessarily in my opinion. The actual unit involved was called the RMBPD-Royal Marine Boom Patrol Detachment, that being a cover name of course. The actual commander was Major H.G. Hasler, nicknamed \"Blondie\" for his golden tresses (though at age 28, when the action occurs, he was prematurely bald.). Why Hispanic looking ( as he actually was ) Jose Ferrer was cast as Major Hasler-? Though Major Hasler served as a technical adviser to the film and he and Jose Ferrer hit it off, I have seen pictures of them together. The actual raid was called \"Operation Frankton\", Major Hasler had organized and trained his unit for such deep penetration raids both to inflict material damage on the Germans and to show them there were no safe havens for them. Why the names of the actual men were not used, I don't know, since only Hasler and his canoe mate Marine Sparks made it back to England, the others deserve to be memorialized. The scenes where the prospective members are required to land in German uniforms and then make their way back to the base is pure fiction, as is the Trevor Howard character of the embittered regular officer forced to play second fiddle to what the British call a \"Territorial\" (Reserve) or HO-Hostilities Only officer. Major Hasler was a career Royal Marine officer, had been on active duty since 1934 or so. I suppose a convention in WWII movies you have the hardened but Wise Old Regular and the Eager But Inexperienced Newcomer. Likewise the scene were one of the officers stand guard while one of the men beats up his cheating wife's paramour-another cliché.<br><br>That said, it is a great action movie, see it for that alone, then read the history, the movie will let you visualize the action better and appreciate the bravery of \"Our Boys\".","user":"rudge49","rank":[39,50]}]