[{"title":"The Devil must have missed his train, he never enters.","rating":16,"date":"16 January 2002","review":"This is one time a low budget and a cast of unknowns actually works in a movies favour.  ENTER THE DEVIL begins with a motorist (Happy Shahan who also just happens to be singing to C&amp;W song on the radio during this scene) getting his tire blown out by a sniper.  Picked up very fast by another driver you just KNOW he will never be seen again.<br><br>This movie, directed by first time (and only time) director Frank Dobbs breaks all the rules and somehow gets away with it.  We don't meet the heroine until 38 minutes into the movie and the man we think is going to be the hero  gets killed right before the big climax.<br><br>Mr. Dobbs must have really been impressed by the 1936 exploitation thriller LASH OF THE PENITENTES because this movie involves Ms. Kelly investigating what she thinks is a revival of the Penitente cult in the mountains along the Texas/New Mexico border.  She learns the hard way that \"This goes way beyond the Penitente cult.\"  Oddly enough these are not Satanists and The Devil is never mentioned by anyone.  These hooded, Gregorian chanting, torch carrying, knife wielding pyschopaths call themselves The Disciples Of Death and do human sacrifice because . ..because . . .well, they just do, that's all!  No explanation is ever given.<br><br>Gore is lacking for most of the film though the sacrifice scenes, where the killing is committed with a stone knife shaped like a cross, are pretty scary.  There is one death-by-fire where the victim is tied with barbed wire that is teeth grittingly suspenseful.  Though you can guess who the cultists are way before the revelation at the end of the film it does not spoil the mood.<br><br>Track this film down, you will find that it is worth your time.","user":"reptilicus","rank":[16,17]},{"title":"Desert Satanists.","rating":8,"date":"28 May 2010","review":"The action of \"Enter the Devil\" takes place on a barren Texas wasteland dotted with dirty little towns and mercury mines.A red-robed Satanic cult is kidnapping unlucky victims and sacrificing them in the name of the Devil.Meanwhile a beautiful doctor Leslie Culver is researching the book about devilish cults.\"Enter the Devil\" is a slow-moving and wonderfully dry horror movie set on the desert.There is a brilliantly conveyed aura of utter isolation that kept me intrigued.If you like strange horror/western hybrids give \"Enter the Devil\" a look.An obscurity that deserves to be seen and appreciated by countless fans of 70's horror.Enjoy your stay in Dry Lake.8 out of 10.","user":"HumanoidOfFlesh","rank":[14,16]},{"title":"Great drive in/grindhouse horror film you've probably not seen but should, has unjustly been lost to the ages","rating":7,"date":"24 January 2008","review":"(This review contains potential spoilers) <br><br>A man driving in the desert has his tire shot out. He thinks it's just a blow out and when he finds his spare is also flat he decides to walk to get help. Getting picked up by a fast moving pick up truck the man is soon reported missing. What follows is an investigation into the disappearance of the man and the uncovering of a strange cult near the US border with Mexico.<br><br>Minor classic and unjustly forgotten horror film seems to have disappeared into the mists of time. I don't ever remember seeing or hearing of this film until I ran across it in the Sinister Cinema catalog. I'm guessing that the film disappeared into the void since it probably had small distribution and was made about the same time as other western set horror films like Race with Devil, Devils Rain and others of that type. It's a shame since the film is actually quite creepy and even scary.<br><br>What makes this film work are a couple of key factors, first the visual sense. There is something about the way the shots are composed that creates a good sense of dread. The Film manages to take run of the mill horror film events and turn them into something else. Watch the opening sequence. The idea of a man driving in the desert can be boring. However we are drawn in to the proceedings almost instantly. We are there. As the sequence proceeds and the rock collector is picked up, we already have a sense of unease before he gets into the truck. It helps that we never see the driver and until the truck pulls away, we only fleetingly see the gun that shot out the car tire. We know that the man will not becoming back, a feeling reinforced by the fade to the torch lit procession of robed figures. Its eerie and the film is barely five minutes old.<br><br>The second thing that works in favor of the film is that it doesn't behave as most other films of this sort. The cliché's are not really there. Who and what is going on isn't ever really explained, there is no twist ending, characters come and go in ways you don't expect and the film sticks pretty close to reality, we don't get overwhelming supernatural forces at work, its all very real in a way most horror films never are.<br><br>You'll forgive the lack of details about the story, but as with most films this is a better film to see than read about.<br><br>If you can, see about tracking this film down. Its not readily available and it seems that the only ones carrying it are companies specializing in obscure films (Sinister, Something Weird, etc.). Also be forgiving since any prints out there seem to be scratched.<br><br>7 out of 10 on the general scale. 9 out of 10 on the drive in movie meter.","user":"dbborroughs","rank":[10,11]}]