[{"title":"Licenced to chill...out","rating":7,"date":"16 November 2004","review":"When it comes to Bond films I watch with trepidation, as I either really like them or absolutely hate them. Diamonds are Forever falls in the former category although I'm not totally sure why. It's like after the serious action-packed 60's they decided to just calm down and relax, this is the most chilled out and mellow Bond film there is. It has that air of coolness that only early 70's films seem to have. There is a plot of sorts but there's no rush to get there. John Barry's score is his most jazzy and laid back. You feel this was the Bond film that most inspired Tarentino. Do you think so Mr Wint, I do Mr Kidd. Connery seems to really enjoy himself playing Bond again, now surprisingly looking older than his forty years although he was still younger than Roger Moore when he played Bond for the first time the following year, the role seems to fit him even better than before. It's a cool...(7/10).","user":"simonrosenbaum","rank":[61,83]},{"title":"\"They can stimulate and tease me.\"","rating":8,"date":"15 June 2006","review":"You don't review James Bond movies, you evaluate them, rate them according to how well they meet expectations. There are certain things one has come to expect, even demand of a Bond film and each individual effort either delivers or it doesn't. So, here are ten elements that make a Bond film a Bond film and how DIAMONDS ARE FOREVER rates on a scale of 1 to 10: <br><br>Title: DIAMONDS ARE FOREVER: A slight perversion of the once popular ad line used to sell wedding rings, this title suggests romance, but certainly that is the last thing on the film's agenda. It's a wonderfully deceptive title. 10 points.<br><br>Pre-Credit Teaser: Bond \"kills\" Blofeld, which supposedly seems to tie up major loose ends from ON HER MAJESTY'S SECRET SERVICE. But considering that when last we saw him, Blofeld was murdering James' new bride, such a confrontation should have immense power. An important turning point in the series slips past with no acknowledgment. Though the opening does serve to show that Sean Connery is back and George Lazenby has been released from Bondage. 2 points.<br><br>Opening Credits: Maurice Binder's style of opening montage is wearing just a tad old and predictable. Pretty enough with its diamond-studded theme for 4 points, but not good enough to do justice to the: <br><br>Theme Song: It is said that originally the film was to be a followup to GOLDFINGER, with his brother taking up where Goldfinger left off. That never came off, but certainly \"Diamonds are Forever\" is a perfect companion piece to the earlier theme song. It, of course, has the fabulous Shirley Bassey doing the vocals again, but it also repeats the cynicism of applying sensuous lust to material wealth. It's an anti-love song, much like \"Diamonds are a Girl's Best Friend,\" only it doesn't hide its hard-edged avarice under a bouncy tune. It is, I think, even better than \"Goldfinger,\" and may be the prefect James Bond song: amoral, stylish and seductive. 10 points <br><br>\"Bond, James Bond\": Connery is back, a bit chunkier and a tad grayer, but apparently his extended vacation from the role of 007 paid off. Personally, I think this is his best Bond work as Sean strolls through the film with relaxed charm and a complete understanding that this film, if not the entire series, is a comedy. Bond purists tend to disregard DIAMONDS ARE FOREVER because of its flip attitude, but that is what makes it my favorite. 10 points.<br><br>Bond Babes: Lana Wood, Natalie's sister, is on hand as the mandatory eye candy, and is all-too-disposable as Plenty O'Toole. But someone had the bright idea of making the main Bond Girl someone with a flair for comedy. Enter maturing starlet Jill St. John, the epitome of 1960's cheesy, Playboy sexuality. Whatever her limitations as an actress, St. John certainly had the knack for using her sexuality as an amusing toy and still maintain the edge that she is a lot smarter than she looks. As Tiffany Case, her intelligence seems to diminish as the film wears on (it seems the women Bond beds all end up dead or dumb), but her ability to fill a bikini remains indisputable. 9 points.<br><br>Bond Villain: Ernst Stavro Blofeld is back again, though only his love of fluffy, white pussycats remains constant. The intense geek of Donald Peasence and the uncouth thug of Telly Savalas are replaced by Charles Gray, who opts to play the part with droll, bemused wit and -- radically -- a full head of hair. Gray never gained iconic stature as Blofeld (that would come later as the Blofeld-like narrator in THE ROCKY HORROR PICTURE SHOW), but for my money he is the best Blofeld, a villain of classy arrogance who is singularly unimpressed by Bond. 10 points.<br><br>Bond Baddies: Ah yes, Mr. Kidd and Mr. Wint; as played by Putter Smith and Bruce Glover, they are the Chip and Dale of Bond assassins; two more gracious and well-mannered killers would be hard to find. The film has been accused of homophobia for including a pair of gay killers, but considering the sheer number of assassins to cross Bond's path, it would be more discriminatory to exclude them based on their orientation. Wint and Kidd are at once gay clichés and yet surprisingly non-stereotypical. Nonetheless, they glide (prance? skip?) through the film with cold-blooded assurance and a rather endearing affection. And if they aren't butch enough, there's always Bambi and Thumper (Lola Larson and Trina Parks) on hand to beat the tar out of James. 9 points.<br><br>Plot: Blofeld hopes to corner the diamond market to use them on some sort of outer space laser with which he can -- again -- hold the nations of the world for ransom. Doesn't this guy ever learn? They even do the \"you've killed James Bond\" bit again. 5 points.<br><br>Production values: Bond's globetrotting brings him to the glitz and pseudo-grandeur of Las Vegas in all of its tacky glory. It makes for a nicely surrealistic backdrop, appropriate for the film's self-mocking attitude -- though a major chase scene is marred by the large number of tourists standing along the route, watching the filming. 7 points.<br><br>Bonus Points: The Bond producers' love of unorthodox casting pays off with the selection of country singer and sausage maker Jimmy Dean as the reclusive millionaire based on Howard Hughes. It is such a bizarre choice, yet Dean's country boy charm is a wonderful contrast to both Hughes' nutty behavior and to the bemused sophistication of Bond. 5 points.<br><br>Summary: DIAMONDS ARE FOREVER is a turning point in the series; the gritty, pseudo-realism of the early films is gone in favor of slick comic book sci-fi gloss. Whatever the series loses in thrills it makes up for in fun. <br><br>Bond-o-meter Rating: 81 points out of 100.","user":"majikstl","rank":[69,99]},{"title":"\"Oh, providing the collars and cuffs match...\"","rating":6,"date":"26 July 2001","review":"Diamonds Are Forever is often described as a Roger Moore film starring Sean Connery, but it goes even farther than that. Whereas Moore ushered in ironic/silly codings, Diamonds contains the most overtly camp humour the series ever indulged in. The film also contains the most amount of nudity, and arguably the rudest jokes of the franchise. The title quote is Connery's quip to a girl with ever-changing wigs, while later we get the immortal \"I'm afraid you've caught me with more than my hands up.\"<br><br>There's the sense of the odd, or uneasy, about this one all the way through. From the theme title (and what a great song!) precipitated by a cat's cry to the homosexual henchmen Mr.Wynt and Mr. Kidd. Their unnerving air is not the result of their gay, slightly homophobic, portrayal, but in Putter Smith's performance as Kidd. Not a trained actor, but an accomplished jazz bassist, this off-kilter playing creates an unconscious, unsettling atmosphere.<br><br>It's this juxtaposition which compels throughout. Like seeing Britain's top espionage agent doing the childhood \"snogging with yourself\" routine then smashing a man's head through a window just seconds later. It's a superficially lightweight film, but with a nasty, almost bitter undercurrent. Connery's obvious resistance to the role actually serves it well here, given that this is the first post-wife Bond movie. Bernard Lee plays an unusually terse M to complement this abrasive 007. Such a starch display cuts through the smug underpinnings of the character and makes the cheesy one-liners more palatable. He looks older than in any of his other Bond films - Never Say Never Again included  but this also fits his anguished, bereaved state. In line with this most misogynistic of Bond pictures, Jill St. John's character development passes from intelligent, through to devious and down into simpering bimbo.<br><br>Incidental music is a bit disattached, and often feels like it belongs to another film. It works against, rather than with, the picture it's there to support. Yet although not quite the best of the series, this and the following Live and Let Die are the most distinctive in look, feel and style. They're light, pacy, poppish takes on the format, full of comicbook verve and wit. Guy Hamilton's direction is also very good; making the most of the LA location with use of expansive aerial shots.<br><br>The plot seems fairly complex, though maybe that's because it's underdeveloped and submerged beneath slightly irrelevant setpieces. I had to smile at the line \"Get him off that machine, that isn't a toy\" as Sean boards the moonbuggy. I remember after the film it became one, a primary-coloured Dinky version with a spinning radar. Brings back memories, that.<br><br>Blofeld, who has now taken up cloning and cross-dressing, is played here by Charles Gray. Although at the time it was four years before he would become the criminologist in The Rocky Horror Picture Show, the two are now inseparable, in my mind at least. As if this wasn't enough high camp to go round, there's also Connery being demolished by Bambi and Thumper, a couple of sadistic female gymnasts.<br><br>If something about this quirky, offbeat Bond (and some sources list it as the seventh least successful in terms of gross) doesn't quite gel, then it greatly improves on repeat viewings.","user":"The_Movie_Cat","rank":[92,135]}]