[{"title":"James Garner shines in highly agreeable western spoof","rating":28,"date":"28 June 2001","review":"Here is a funny, good-natured parody of classic westerns, starring James Garner in the role he was born to play - the reluctant hero, tackling crises with his wits, not his fists.  You don't have to be familiar with western clichés to enjoy this film, but those who are in on the jokes will find it especially rewarding.  Of course, Mel Brooks' similar `Blazing Saddles' is better remembered today, but I feel that `Support Your Local Sheriff!' is the more successful film.  It achieves its results through the writers' ingenuity and the actors' flawless timing and delivery, as opposed to the riotous, hit-or-miss gags of Brooks' film.<br><br>Garner plays a drifter who is gradually making his way to Australia, for no discernable reason.  He arrives in an unruly western town that's been through three sheriffs in the past two months and is now in desperate need of another.  The town council is not choosy, and he is hired almost sight unseen.  Then he sees the jail - real nice, but no bars for the cells.  He picks the most incompetent man in earshot (Jack Elam) for his deputy, and sets about cleaning up the town.  Garner is adept at all the usual gun tricks and is in fact an expert marksman, but he prefers to talk his way out of tight situations, always getting the better of his intellectually-challenged opponents.<br><br>The real trouble begins when he arrests a whiny ruffian (Bruce Dern) for murder, and books him in one of the cells without bars.  In the true western fashion, his crotchety pop (Walter Brennan) and all his brothers ride into town to engineer a jailbreak.  What happens next would be criminal to reveal here, except to say that it consists of one comic gem after another.<br><br>Each line is written and delivered to perfection by a cast that seems to have been formed from a convention of old character actors.  Brennan is hilarious sending up his Old Man Clanton role from \"My Darling Clementine.\" His very presence in any western gives it a feel of authenticity, but here he proves to be a good sport in spoofing one of his definitive parts. Elam, Dern, and Harry Morgan contribute priceless support, and Joan Hackett is effective as Garner's most unorthodox love interest.  All this would be for naught, however, without Garner in the central role.  It calls for a very specific type of actor: quick-witted, sarcastic, astute, overly accommodating, and not especially tough.  This is a tailor-made role for Garner, and he fills it in such a way that any other casting would be inconceivable.  Thanks to him, the other performers, and the droll, clever screenplay, the film hits all the right notes for a pleasant and genial western comedy.","user":"rmears1","rank":[85,87]},{"title":"This is a scream!","rating":7,"date":"7 June 2004","review":"This is yet another of those \"they don't make 'em like this anymore\" gems.<br><br>And, this western is a comic gem. Okay, it's a scream!<br><br>The whole cast is perfect, playing perfectly to a wonderful script. While all the action circles around the perfectly cast James Garner, who is light and amusing. Although he is funny, he's still the straight man to to all the town loonies.<br><br>Bruce Dern and Jack Elam are over the top hilarious as a dimwitted bad guy and dimwitted \"town character\" respectively. Harry Morgan is as funny as he's ever been, which is saying a lot considering his role in What Did You Do In The War, Daddy? Walter Brennan is typically excellent in one of his later roles as the typically grump head of the bad guy's clan. Even the lesser roles, such as Kathleen Freeman as a passerby, are delightful in her 2-minute scene.<br><br>The late Joan Hackett is the mayor's daughter, the madcap, eccentric Prudy. plays comedy really well. She gets lovelier every time I see this. She's as beautiful as she is funny in this and she's a riot. She left us way too soon.<br><br>I wish one of our revival houses would run this coupled with The Cheyanne Social Club, another delightfully comic western from that great era in films. That would be one entertaining night at the movies!","user":"estabansmythe","rank":[50,51]},{"title":"Just Plain Fun!","rating":8,"date":"15 March 2005","review":"Now, I will even watch James Garner in a bad movie. That whole worldly wise, yet winsome thing he has going makes you think of that best bud you had in junior high.<br><br>But this is actually a very good, drown yourself in a bag of popcorn, and laugh your cares away film. <br><br>Is it a western parody or humorous homage to some of the great character actors in American western? It certainly doesn't have a mean bone in its body and doesn't rely on shock humor to get you chuckling. This film respects its predecessors and has good clean fun with them.<br><br>It's a DVD you can easily find for under $10, and well worth it.","user":"jeichenberger","rank":[31,31]}]