[{"title":"A Masterpiece from Naruse","rating":10,"date":"8 July 2003","review":"Finding Naruse Mikio films has been very, very tough, and after seeing this I'd say it's a tragedy. This is among the most gorgeous dramas I've seen - a brooding and dark melodrama, shot in velvety black and white, with stunning widescreen photography. <br><br>Based upon my viewing of this and one other Naruse film (to date), I'd say that Naruse's worldview is considerably more cynical than Ozu or Mizoguchi (both of whom he seems to often draw unfavorable comparisons with, from the relatively few critics to have dug into his work) - the strength of women will be taken for granted, or abused by a hostile world regardless of shrewdness, intellect or beauty, and there is a shy jaded quality to this film that gives it an engaging intensity, that while not nearly as subtle, objective or cerebral as Ozu, IS definitely more passionate. Here, and also in the earlier LATE CHRYSANTHEMUMS, Naruse's women are idealized, heroic - symbolic in a larger sense of outsiders or rebels (of any variety) in a social milieu that values discretion and certain forms of conformity above all else.<br><br>If you can find this film, I highly recommend it - more of Naruse's work should be made available outside of Japan.","user":"davidals","rank":[27,29]},{"title":"An exquisite character study","rating":10,"date":"6 March 2006","review":"Widowed Tokyo bar hostess Keiko is in her thirties and thinking about her limited choices. She could open her own bar but this would require financial help from clients and perhaps favors she is unwilling to give, or she could get married, but that would mean breaking a vow to her late husband that she would never love another man. Mikio Naruse's When a Woman Ascends the Stairs is an exquisite character study about a woman caught in a trap of financial obligations who is forced to perform a job she dislikes in order to stay afloat. It is both a depiction of one woman's courage and perseverance and a commentary on the limited opportunities for women in Japan with little education or family connections. Hideko Takamine is unforgettable as Keiko, the beleaguered hostess who is affectionately called \"mama\" by the younger barmaids.<br><br>Keiko is a graceful and charming woman who wears a traditional kimono but is under pressure by her devoted manager Kenichi Komatsu (Tatsuya Nakadai) to modernize her wardrobe and upgrade her living arrangements to keep up with growing Western influences. Of the many men in her life, three monopolize her attention: Mr. Fujisaki (Masayuki Mori), Mr. Sekine (Daisuke Kato), and Mr. Minobe (Ganjiro Nakamura). Each relationship starts out with promise but each leads to severe disappointment. She receives a marriage proposal from Mr. Sekine that turns out to be bogus. She tells Mr. Fujisaki that she loves him but promised her husband she would not remarry. Nonetheless, she is crushed when she learns that he has been transferred to Osaka.<br><br>The film complements the dramatic action with Keiko's inner dialogue. Backed by a cool jazz score that evokes the mood of Tokyo streets in the early evening, she contemplates how most women in Tokyo are going to their home when her work is first starting. In another sequence she muses, \"Around midnight Tokyo's 16,000 bar women go home. The best go home by car. Second-rate ones by streetcar. The worst go home with their customers.\" As Keiko struggles financially to help her aging mother, her brother who must pay a lawyer to stay out of prison, and her nephew who needs an operation, she knows that she would be better off if she would relax her standards, but she will not compromise her integrity. The stairs she must climb each night to her bar become a symbol both of her triumphant determination and her personal tragedy.","user":"howard.schumann","rank":[34,38]},{"title":"The Will of a Woman","rating":9,"date":"23 October 1999","review":"This is my first Naruse film and, boy, what a treat it is! Hideko Takamine is simply brilliant in her evocation of a madame in the ginza bar district, where businessmen go in the after-hours for drinks, flattery, and anything else they can get their hands on.<br><br>Takamine's Keiko is a woman bound by social constraints: an aging mother who needs allowance from her daughter to get by, a brother who must be saved from prison because he forged legal documents, a nephew who needs money for operation, rich businessmen and corporate owners who want her body in exchange for petty patronage...<br><br>Despite all these attempts to stifle her, to drain her body, labor, and emotions for all their worth and resource, Keiko emerges from life's disappointements and heartbreaks the strong individual she tries to be. Her refusal to be defeated by family, men, the institution of the ginza bar and survival itself is reflected in many elements. The playful music, for example, discourages us from reducing the film to yet another tearjerking festival. Keiko herself is an intelligent and sophisticated commentator on her life as a particular kind of \"fallen woman\". Throughout the film, there are moments of narration and commentary on the ginza bar-mystique. Here we witness a resilence and self-respect so tremendous that the notion of \"feminism\" of Mizoguchi's women have to be reconsidered.<br><br>\"Coming back was as bleak as a cold day in Winter. But certain trees bloom...no matter how cold the wind.\" WHEN A WOMAN ASCENDS THE STAIRS is a great testament to Takamine's acting wizardry and Naruse's sensitive treatment of the social construction of women - a particular way of brutalizing the individual.","user":"jacqui-3","rank":[43,49]}]