[{"title":"This is an excellent movie. I believe that one should read the book before viewing the movie.","rating":9,"date":"26 July 2002","review":"I read the book again before viewing the movie on video.  The book is very short and the movie follows the narration very closely.  Some of the narration is dropped, however, in the version I viewed.  The fisherman is a lot like many of us as we grow older and it is very heartwarming to see how he faces his tribulations with such a wise philosophy.  He does not harbor ill will toward anyone or anything, including the great fish, but accepts life and makes no judgements.<br><br>Spencer Tracy provides an excellent portrayal, as usual, of the main character.  The boy acted very well and I wondered what his future had in store for him.  I wondered if He would be effected by the Cuban Revolution a few years later.  I told my wife that it would be interesting if he became a revolutionary if the story continued.  It was very interesting to find that in real life, according to the Movie data base biography, his father was an economist and a principal participant in the Cuban Revolution a few years later.<br><br>A book well written and a film adaption that presents the story as I imagined it while reading the book.","user":"toto-19","rank":[25,29]},{"title":"A movie about an old man and his marlin.","rating":7,"date":"7 May 1999","review":"One of Spencer Tracy's top performances; it goes down with \"Captain's Courageous.\"  Most often a book is better then the movie but in this case the movie brings the book to life.  This is due to the somewhat larger then life character of Tracy.  The story, although classic and definitely worth while reading, is best summed up by Tracy's acting technique.<br><br>This was no location film which means the greater portion of realism must come from the actor.  A story about a man thinking and talking to himself while he is on a boat for three days would be difficult for any actor. Tracy brings the truest sense of humility and courage to this role.  It is enjoyable reading but I encourage anyone to see this movie.","user":"Quintus","rank":[24,29]},{"title":"A Good Adaptation & A Poignant Performance By Spencer Tracy","rating":12,"date":"12 December 2005","review":"Ernest Hemingway's \"The Old Man and the Sea\" is a fine story, but it gives every indication of being quite a challenge to any film-maker hoping to adapt it to the screen. This is a good effort, with a well-conceived approach to getting across the story and the main ideas. Yet it required above all the right leading actor, and Spencer Tracy comes through with a poignant performance that pulls everything else together.<br><br>Tracy is perfectly cast as the old fisherman. His voice is ideal, not only for the character but also for reading the lengthy voice-over narrations from Hemingway's text. The narration is used to communicate some of the story's key themes, and without just the right reader it probably would not have worked at all. Tracy also seems to identify with the character closely, since his mannerisms and body language almost always seem just right.<br><br>The action parts of the story rely heavily on stock footage, and sometimes on rather obvious models, but the action is not nearly as important as are the old man's character and his thoughts. Although there are some exciting moments in his battle with nature, it is what these bring out in him, not the events themselves, that are important.<br><br>What works especially well here are the old man's dreams and thoughts of the past. They are all-important in defining the character, and this adaptation manages them better than you could hope for, with the simplest of means. Once again, Tracy's narration matches the content perfectly.<br><br>The heart of the story is an honest but compassionate look at a man almost thoroughly ignored by the world, seemingly with little purpose to his life. His importance comes not from any outstanding achievement or valuable talent, but simply because he is a human being, with his own hopes, memories, and worries that are unique to him. This movie version succeeds well in rendering a touching picture of its main character.","user":"Snow Leopard","rank":[16,19]}]