[{"title":"\"An important film in the development of British horror cinema.\"","rating":9,"date":"23 December 2004","review":"POSSIBLE SPOILERS Government scientist Professor Bernard Quatermass (BRIAN DONLEVY) sends a rocket into space containing three astronauts. Radio contact is lost and later it crash lands in the English countryside. Two of the crew members are missing, but the survivor, Victor Carroon (RICHARD WORDSWORTH) is slowly being taken over by an alien fungus that feeds on the blood of animals and human-beings.<br><br>In a bid to win audiences away from their TV sets (something that was a real threat to cinemas at the time), Hammer elected to film the popular BBC serial THE QUATERMASS EXPERIMENT (the E was replaced with X in order to emphasise it's X certificate), which was the creation of writer Nigel Kneale. The gamble payed off and Hammer had a box office hit on their hands in 1955.<br><br>Seen today, THE QUATERMASS XPERIMENT is obviously very tame in comparison to modern day sci-fi and horror films, most of it's shock sequences occur off screen with the camera cutting away and harping back on reaction shots. Yet it is a milestone in the development of British horror cinema and along with the company's THE CURSE OF FRANKENSTEIN, it spawned this country's horror boom of the 1950's and 60's. Richard Wordsworth's Carroon is one of the most sympathetic monsters in British horror and there is a classic scene at the London docks where the former is hiding out in an abandoned boat and is awakened by a little girl who is having a pretend picnic with her dolly. Unaware of the true horror that's going on, the little girl naively asks Carroon if he wants to join them. One can see that Carroon is fully aware of what would happen if the girl touches him and runs away accidentally breaking her dolly.<br><br>Wordsworth is brilliant as Carroon and so is Brian Donlevy as Quatermass while director Val Guest's documentary approach gives the picture a sense of conviction.","user":"jamesraeburn2003","rank":[24,25]},{"title":"Xcellent! Xquisite! Xhelirating!!","rating":9,"date":"23 June 2005","review":"You can't even begin to describe how essential (and quintessential) this legendary Hammer-movie in fact is! It was the unexpected success of this movie that single-handedly caused the horror-boom all over Europe! If this adaptation from Nigel Kneale's play hadn't been so popular, Hammer Studios probably never would have started with re-telling other famous franchises, such as \"Frankenstein\", \"Dracula\" or \"The Mummy\". It was \"The Quatermass Xperiment\" that all of a sudden showed that the audience's hunger for morbid Sci-Fi and fantasy tales is insatiable and Hammer cleverly exploited this given bit by bit. The film itself is about 50 years old now, but it definitely still stands as one of the uncanniest and mesmerizing Sci-Fi films ever made. With its uniquely tense atmosphere, the astonishing performance by Richard Wordsworth and the intelligent script, this movie is an experience that'll keep you on the edge of your seat the whole time. Quatermass is the name of a brilliant (but slightly obnoxious) scientist who  apparently without permission of the legal authorities  launched a rocket with a 3-headed crew into space, to travel distances no other space-mission ever reached. The movie opens when a catastrophe already took place and the rocket crashes just outside London. Two crew members seemly vanished into thin air while the other (Wordsworth) is \"possessed\" with something. The unfortunate astronaut inexplicably turns into a monster that threatens to extinguish the entire world <br><br>The premise of alien-intelligence invading earth through an unfortunate space-mission is extremely stereotyped by today's standards, but \"The Quatermass Xperiment\" is one of the only oldies in the genre that still feels genuine and original. A form of criticism I often encountered while browsing through other users' comments is that this production supposedly hasn't dated well and that it's nowhere near scary. Frankly, I don't share this opinion at all. First and foremost because the film suggests more terror rather than showing it explicitly! I am aware that few people nowadays appreciate horror film if it doesn't contain graphic violence and tons of blood, but it really is the unsettling atmosphere what makes this film so brilliant. And besides, I do think that the special and make-up effects are staggering although half a century old. The images of Wordsworth mutating arm wrapped in a filthy overcoat and his facial metamorphose are still definitely creepy! To wrap it all up: \"The Quatermass Xperiment\" is an exhilarating and trend-setting genre film that should be viewed by every fan of fantasy-flicks. Giant thumbs up for director Val Guest who also made another Hammer classic, \"The Abominable Snowman\"","user":"Coventry","rank":[75,85]},{"title":"Quintessential 1950s Sci-Fi","rating":10,"date":"5 July 2003","review":"A secret rocket expedition to Space unexpectedly crashes back to Earth. One lone astronaut is found to have survived only he's disheveled, not quite himself as he seems to be on the verge of some bizarre transformation! And what happened to the other two astronauts on board - all that seems to be left of them is two empty spacesuits?! How and why? What and when? A mystery that needs unraveling, a strange journey into unknown previously unexplored territory and a scientist hero named Quatermass whose methods the viewing audience are not always going to be inclined to agree with even if he is in essence correct in his line of thinking on many levels. A likely inspiration for many later film and TV works including THE BLOB, THE FLY, \"The X-Files\" and much more. Science fiction does not get much better than this film which grips you with its terrific suspense as we see Victor Caroon (played as a tragic and terrifying figure all at once in a terrific performance from Richard Wordsworth) go where no man has gone before in more ways than one might imagine.","user":"Space_Mafune","rank":[44,49]}]