[{"title":"Do not change that channel! Check out this hysterically bizarre film instead...","rating":3,"date":"3 August 1999","review":"TERRORVISION is a very peculiar horror-comedy that has the word \"camp\" labeled all over it.  This fairy tale tells about a sloppy alien puppet monster who, presumably by accident, enters Planet Earth via a TV satellite dish. This enormous monster appears on the TV screen at first, then, talk about visual effects, it eventually materializes, appearing live, in the flesh!  Talk about audience participation!!<br><br>Gerrit Graham (PHANTOM OF THE PARADISE, THE ANNIHILATORS) and Mary Wodornov (EATING RAOUL) portray the Puttermans, a happily married suburban couple. They do not realize the \"realism\" of the monster they see on TV, HA!  This so-called \"couple\" leads a VERY dysfunctional family with a military obsessed son and his survivalist grandfather.  There is also a crazed daughter who loves heavy metal rock music, and her mentally inept boyfriend, who looks like Kid Rock minus the attitude and pizzazz.  There is also a horror movie hostess, Medusa (Jennifer Richards) who fits into this scheme for absolutely no plausible reason.  Meanwhile, the monster devours each of the family members one by one...later reproducing their heads when necessary in order to cover up its actions.<br><br>Planet Earth is in grave danger, once again and its only chance into stopping this hungry creature is an intergalactic police alien.  He explains to everyone that this creature was originally suppose to be disposed of...but instead, it lands on Planet Earth. This interstellar alien cop is the only one who can blast the gross alien creature into oblivion but...well, I'm sure that you are interested in finding out the rest, so go see this movie!<br><br>TERRORVISION is a funny, hilarious horror cult film that has plenty of humor to liven this movie up.  There are silly one-liners, hokey special effects, and a variety of \"eccentric\" characters to give this film strength. It is a stupid film at times, and the cast definitely overacts, but if you are looking for a nice, relaxing horror film that offers a very different style from the rest of the horror movies in this genre, then TERRORVISION is recommended for you!<br><br>This film was again produced by the one and only Empire Pictures, and you know what that means: cheesy special effects and acting galore!   The monster especially is the most ludicrous...hairball-type creature that I have ever seen on screen.  The rest of the special FX in this movie are standard fare though, with a elegant touch of cheekiness...<br><br>If you are in the mood for a humorously bad movie, then this picture is the perfect candidate for you!  In addition to being a delightfully stomach churning horror experience, TERRORVISION is a satire on the media-obsessed suburban middle class family.  Hey, these guys make \"The Simpsons\" look and act like those mature, civilized, and pleasantly lovable neighbors living next door.  If you thought that your own family may be \"dysfunctional,\" hey (trust me), the family portrayed in this movie will add new meaning to that word!<br><br>For a fine sense of humor that will appeal to cult film fans, TERRORVISION is destined to become that next \"special\" classic.  Beware, if you are not prepared to laugh and be disgusted at the same time, then perhaps you should skip this film...<br><br>RATING: ** out of ****.","user":"FlyBoyDC","rank":[31,33]},{"title":"\"Man, this is the dumbest movie I ever saw!\"","rating":7,"date":"7 October 2011","review":"Charles Band and Albert Band's Empire pictures have made some fun productions and \"Terrorvision\" happens to be one of those inclusions. Wacky sci-fi horror comedy with a terrifically animated cast featuring Mary Woronov, Gerrit Graham, Diana Franklin and John Gries with vividly chintzy special effects by John Carl Buechler. The cartoon-like premise is quite original and mock-serious in its approach, which sees the Puttermans a suburban family getting a new satellite TV which draws in a hungry outer space monster (which looks great). This monster then goes about eating the family, by transporting its self from one TV to another. Everything is done in a comical manner and purposely so, from the flamboyant performances to the colourfully cheap sets and then the creatively grotesque make-up effects. It's downright goofy and surreal, but still far from light-hearted with it streaming with numerous oddball sexual innuendo (especially since Woronov and Graham are playing swingers) and an Elvira like character known as Medusa. Director Ted Nicolaou does a capable job. Diana Franklin is cute and Chad Allen is likable as the young boy who goes up against the beast. While short-lived, it's a constantly amusing tongue-in-cheek outing that's fairly unpredictable, while at the same time haphazard. Despite the fair share of hate, I found it hard not to like this camped-out medium.<br><br>\"What you looking at you creep\".","user":"lost-in-limbo","rank":[14,15]},{"title":"\"WHAT IS?!!-what is this movie?\"","rating":10,"date":"21 October 2011","review":"Like a lotta y'all' I first saw this movie back in 199whatever when it was rented from a video shop called Rent-A-Tape! This movie is very funny and everyone who says so is absolutely right: This movie should not be taken seriously AT ALL. From that little ding sound of the opening sequence and the first scenes of a crappy toy alien planet, it's clear you're going to see something very silly! I love the spontaneous humour. Like in a scene just after the \"parents\" get it. There's a poster on the bunker wall of the Statue Of Liberty with the legend: \"If you still believe in me, save me.\" Just randomly thrown in there! This movie has got that comic book vibe going on like that of Creepshow. There's lots of vivid hues of red green pink and blue. Almost beautiful in a twisted kind of way. That's exactly what this movie is, a comic book come to life. I love all the film's music. All those quirky little noises and weird sounds all add to the film's fun and bizarre tone. Richard Band talks a bit about the music on the special edition of the House on Sorority Row. In this movie the monster...wins! Sometimes that can be a bummer, but in this instance it's fine, since hardly any of the humans are very likable anyhow. They're all so incredibly annoying and stupid. I didn't find the actors to be particularly over the top, with the possible exception of Gerrit Graham. He's really annoying! \"Pleasure Dome!\" Shut up! And until he dies(a rare mercy killing by T H B)he had the dumbest expression on his face. I'm actually a fan of Gerrit, just not here. So cartoony, it's painful to watch, is what it is! Grossest bit in the movie, Grampa's death. How can you beat a guy being turned into space glop, head first, then sucked right back up again! That's disgusting! I love it! Gimme more!!! A great scene is when the gay Greek guy gets it. It's eerily beautiful, with a jacuzzi full of glowing mist, and you can just see the pretty lady's head sticking out. It's fun, because at this point we know what the monster can do and what's gonna happen! That ain't no lady, dude! Poor Pluthar! Throughout the movie the green guy is on the telly, warning the world of the danger, but people just think it's a B movie. I find it very funny when he says that to avoid disaster, mankind has to disable all televisions for the next 100 years... We're doomed either way! It really makes me laugh when Medusa calls him an ugly b*****d just after whacking him with her purse! Do not smack the Hungry Beast. It looks like a gaping-mawed, googly-eyed giant turd-Slug, with the personality of a psycho dog! It's ability to mimic was really cool and gave it just that vital extra bit of oomph that made it more than than your average monster. You couldn't really say it's a Thing rip-off, because it can only manage the heads! And the way it could speak with them with their original personalities was so horrible! This thing won't just eat you, it'll eat your soul too... There's this awesome scene that is \"totally sicko\" where the monster, in a bed, imitates 5 people at once, including Grampa! Outrageous! The first glimpse of it is kinda creepy, when all you see is it's big ugly eye on the TV. It soon turns out there's more than meets the eye, however. I like the little glow and whoosh of air when it emerges out of a telly. Such a cool little effect, probably done with a torch and a fan or something. What's wrong with the whole alliance with the monster part of the movie? It's a nice break between the carnage. The monster actually manages to be cute. When they're teaching it to say their names, you can tell it still doesn't like Sherman. My favourite bit with said monster is when it's watching an old alien invasion movie, heartily singing a merry tune to itself and uproariously laughing! Sometimes when you see a lot of it, it does look a little stiff and you can tell it's a big puppet. Other than that, I've got no problems with how it looks. It makes the movie, can't deny it. At the end the world is doomed. By entering the TV dimension through a television studio, the monster will be able to appear anywhere in the world. A veritable smörgåsbord of couch potatoes! TV will eat you, I think is the message they were going for here! \"I danced by the light of the TV screen, all night long! I watched the Medusa's eyes turn green, but my own reflection I've never seen!\" These words are from the movie's title song. They are silly, nonsensical and downright stupid. But you know what? They work, and they rock big time! They're a lot like the movie itself. The monster's goofy but awesome, and there's at least one quirky character to suit anyone's taste. Once more I love the look of the movie. I really think they did a beautiful job. They gave the film I think, exactly the right look. It's very pop, there's nothing complicated about it. There's nothing artsy-fartsy. I mean, it's just, \"boomp\", here it is! The moment you look at the film, you get it. And they did a fabulous job with that.","user":"Foreverisacastironmess123","rank":[9,9]}]