[{"title":"Campy but fun, a great watch!!","rating":7,"date":"15 April 2001","review":"This film is pretty much a second-rate Russ Meyer film (in fact, it was written by a F.X. Maier...coincidence??;) The dialogue isn't as clever, nor as tongue-in-cheek, and the acting is definitely second best. but on the other hand, Quentin Tarantino (who re-released it in '97 through Rolling Thunder Pictures) was right when he said in USA Today `There's more action is Sisters than in Twister' The film is fast-paced, full of thrills (gotta love those low-budget, campy 70s films where everyone loses their shirt eventually...) and most of all, fun! Aside from the few scenes that just seem utterly pointless, and aside from Robbie Lee's incessant whining, it's a great film to watch; full of giggles and smiles.<br><br>As long as one doesn't take this film seriously, or compare it too closely to Faster Pussycat of Ultra-Vixens, it will be enjoyable to anyone looking for a cheezy laugh or three. And the prison scene is *priceless*.If I were to take it seriously it wouldn't rate higher than a five, but all things considered, 7/10.","user":"kergillian","rank":[14,14]},{"title":"Bad Girls, You Are Beautiful!","rating":9,"date":"1 March 2008","review":"\"Switchblade Sisters\" is one of the most awesome and amusingly incompetent trash/gangsploitation movies ever made; only back in the period when it got released nobody ever intended to make a bad film, of course. Personally, I enjoyed the privilege of seeing this film in a genuine grindhouse theater and with no less than writer/director Jack Hill present there to introduce the film and answer questions from the audience. Hill explained how he always dreamed of filming his very own version of Shakespeare's \"Othello\", yet this story was probably the closest he ever came to realizing that project. Irrelevant info, I know, but this just to illustrate \"Switchblade Sisters\" once actually was a remotely ambitious film and not just a piece of lesbian trash. The recent revival of drive-in &amp; grindhouse cinema (courtesy of Quentin Tarantino, who's also a giant fan of this particular film) enlarges the sleaze-elements and silliness of 70's movies even more, but you should always at least try and see it in its framework of time. That being said, \"Switchblade Sisters\" is first and foremost a delightfully absurd gang-wars movie and a thoroughly flamboyant portrait of female empowerment. This baby has it all! Stereotypical gang members that easily look over 30 but still attend high-school, big fat ugly lesbian prison wardens, romantic rivalry, jealousy, treason, roller-skating shootouts, secretly desired rape sequences and  last but not least  female Maoist guerrilla fighters. Maggie is the ravishing and potent new chick on the block and she eagerly joins Lace's Dagger Debs gang after proving herself in a knifing contest. The Debs are the girlfriends of the Silver Daggers and all together they hang out in a ramshackle hangar to play pool and sell dope. There's a gang war with the Crabs in the offing and jealous Dagger Deb Patch inflicts a dispute between best friends Maggie &amp; Lace when she notices they both fancy the same hunk. If you can overlook (and you simply must when you're interested in this type of cinema) the sometimes atrocious performances, one-dimensional characters and the absolute lack of logic &amp; coherence, you will find great enjoyment here! The clichéd situations inside the penitentiary (with the obese lesbian warden), out in the schoolyard (with the nervous principal) and in the skating hall (random M-16 gunfire!) are all sublime. The whole finale, from the actual virulent street war up until the main Jezebels' showdown contest, is simultaneously suspenseful, spirited and even a bit touching. The soundtrack is great, although clearly not as enchanting as the ones featuring in Jack Hill's ultimate Blaxploitation masterworks \"Coffy\" and \"Foxy Brown\". Speaking of which, this movie perhaps lacks the powerful and attention-demanding presence of a starlet like Pam Grier, but the girls here are still more than adequate. The supportive characters are actually more convincing than the main ones. Lace, played by Robbie Lee, is an often intolerable and whiny child and Maggie simply appears too cherubic to play a rough chick. I vote for Patch to be the Jezebel's unhinged leader! She's unreliable, deceitful, mean and stark raving mad. Awesome film, highly recommended to slavering sick puppies like myself.","user":"Coventry","rank":[18,19]},{"title":"THE ULTIMATE IN \"BAD GIRL\" CINEMA","rating":3,"date":"3 January 2002","review":"Sure this is a really, really stupid movie, but you've got to see it to believe it. The story of the toughest girls ever, The Jezebels, will leave you on the floor in a fit of laughter. Performed totally straight, this is like a really bad comic book brought to lurid life, complete with ear-wiltingly stupid dialogue. The  action is so improbable that it may as well be taking place on another planet! Don't miss it, and look for Don Stark (Bob Pinciotti on \"That '70's Show\") in an early role as gang member \"Hook\"(so called because a unique anatomical feature). Drink a six pack of tall-boys and get ready to crack up; you won't be disappointed!","user":"EL BUNCHO","rank":[16,17]}]