[{"title":"Not good, but nearly as terrible as I'd assumed.","rating":4,"date":"14 January 2009","review":"Did I just wake up on some bizarro world?! How else could you explain anyone giving this film a 10 or even scores of 9 and 8? Other than to provide unintended laughs, I just can't see the Billy Jack films as capable of earning anything close to these very respectable scores--even this one, which is probably the best in the series.<br><br>This film starts on a very, very poor note. Instead of storytelling, there is a long exposition by Pat O'Brien as he explains much of the setting for the film--and it's way too much! This long diatribe about the evils of nuclear weapons and nuclear power just seemed like sloppy film making-- like a political speech instead of a proper prologue. In addition, why not have the characters talk about this in the film itself? Having this prologue just seemed like they forgot to film these scenes and instead chose to sum it all up this way!<br><br>As for the rest of the film, it sure showed a lot of hubris for director/actor Tom Laughlin to consider remaking the Jimmy Stewart-Frank Capra classic film (currently #101 on IMDb's top 250). In this version, however, instead of appointing Jefferson Smith to the Senate (a beloved icon of children across America), the powers that be decide to appoint a man with a long history of manslaughter and possibly justifiable homicides!! I certainly remember Mr. Jack dispensing a lot of mayhem in his previous films THE BORN LOSERS, BILLY JACK and THE TRIAL OF BILLY JACK! Apparently the grafters do not remember nor do they read the newspapers, and so they decided to appoint an ex-con who is famous for fighting \"the man\". That sure makes sense!! What's next--appointing a member of the Manson family or a rabid dog or a tomato?! <br><br>What was likable about this silly film? Well, it was finally nice to see Delores Taylor (Laughlin's wife and co-star in the Jack films) stop being the perennial victim. Finally, after three films, Billy apparently finally taught her martial arts and she, as well as Billy, deliver some well-earned butt-kickings in one scene! This actually was well done and helped the film tremendously. Also, while the film stuck VERY close to the original material (too close if you ask me), the basic story, no matter how bastardized, is still very good--so good that Laughlin couldn't help produce a reasonably entertaining film--provided you turn off your brain and don't think too much about putting Billy Jack in this locale. Plus you gotta admit that Laughlin sure seemed sincere--and infused the film with some nice energy late in the film--and not in the form of butt-kickings (I half expected him to do this on the Senate floor)! This section of the film was, at times, too intense, but at least it was NOT an exact copy of Jimmy Stewart.<br><br>However, despite some good intentions, the premise of Billy Jack taking on and winning against the evil special interest groups is silly--and also way too idealistic--and probably will result in a few laughs. While not a terrible film, it pales in comparison to the Capra film and occasionally sinks into ridiculousness. Apparently audiences felt pretty much the way I did, as this film never even made it past preview audiences and so it never received a normal theatrical release--though the film was definitely better than THE TRIAL OF BILLY JACK (which made \"The Fifty Worst Movies of All Time\" book). Luckily for lovers of the bizarre and bad films (like me), BILLY JACK GOES TO WASHINGTON was finally released on DVD some time back.<br><br>By the way, because the film was never released until recently, this might explain the poorly executed edits and choppy transitions. Too often, scenes VERY abruptly change and the cuts just aren't made well. In addition, the sound track was too loud and too often dominated the film. Otherwise, Laughlin's direction actually was a bit better than usual...which still isn't saying all that much.","user":"MartinHafer","rank":[13,15]},{"title":"Not The Best Of The Billy Jack Films","rating":15,"date":"15 February 2007","review":"This was fourth and last of the Billy Jack Era however, this picture never made it to the theaters for any length of time. This picture was shown in Los Angeles as a sneak preview on April 16 1977. The next night the picture was again a sneak peak at the Admiral Theatre in Omaha Nebraska. Tom Laughlin resumes his role as Billy Jack and Delores Taylor resumes her role as Jean Roberts. While sitting in prison from the third film a Senator suddenly dies which leaves an open spot in the Senate. After the Senator death, it's revealed that he was conducting an investigation into the nuclear power industry, the remaining senator and the state governor must decide on a person who will play along with their shady deals and not cause any problems. Therefore, they decide to get Billy out of prison and give him the vacant sit. They figure by giving Billy the seat he won't give them enough trouble because he won't no anything. Billy is pardoned, released and nominated, after which he begins his duties. He soon notices that things aren't right, and starts trying to find out just what are going on. I didn't know this until I saw it in a magazine. Tom Laughlin and Delores Taylor were married. At the end of the movie, the couple kept the mailbags that were use in the Senate part of the shooting. The couple uses them on ski trips for there skis and equipment. The bags were confiscated by airport officials when they protested that the bags were property of the U.S. Mail. When this film was being shot, the Senate Scene had to be recreated because the film crew was denied asset to the real Senate Chamber. As filming progressed, Laughlin found it increasingly difficult to film in Washington, D.C. They were wrongly accused of desecrating gravesites in Arlington Cemetery. Even though it was the last of the four films, it wasn't the best. I will give this film 7 weasel stars an also will say the second and the third films were the best.","user":"garyldibert","rank":[8,9]},{"title":"Not that bad","rating":5,"date":"11 March 2013","review":"Skipping through the sat channels the other night I stumbled across this movie and thought I might give it a look. Having seen the original Billy Jack a few years back I figured it might be worth a few laughs if it was anything like the original. To my surprise it was much better then the first film. It had some decent scripting and Laughlin is not that bad an actor, especially when working with a seasoned veteran like E.G. Marshall. Despite a somewhat contrived plot the movie did get it's point across showing the corruption in Washington and how one man can make a difference. The movie is no Mr. Smith goes to Washington, but then Laughlin is no Jimmy Stewart and for that matter Jimmy is no Billy Jack.","user":"aland-16","rank":[7,8]}]