[{"title":"As good as ever...","rating":10,"date":"9 October 2002","review":"This movie had great memories from when I saw it as a kid.  Usually, the movie's never as good as it was, you know, when you see it again once you're older.  This one is still great, though!  The jokes and gags are, for the most part, routine and common, but I think Peter Ustinov made the movie. You just have to let go of everything and have fun with it.","user":"zerodegreesk","rank":[24,28]},{"title":"From the Newton School","rating":8,"date":"2 April 2006","review":"Watching Blackbeard's Ghost yesterday put me in mind of the late Robert Newton and his portrayal of Blackbeard in a classic film from the Fifties. Had Mr. Newton not died of chronic alcoholism in 1957, I'm sure he would have been the Disney studio's choice to play Blackbeard.<br><br>With Robert Newton not being available, the studio got another actor famous for a bravura performance, that of Nero and Quo Vadis. Who'd have thought that Peter Ustinov would have gotten another role that called for flamboyant overacting. Ustinov's Blackbeard is a combination of Newton's Blackbeard and his own Nero. And he dominates the film completely.<br><br>Dean Jones who was Disney's major leading man at the time who played the roles Kurt Russell was too young for, borrows a great deal from that other actor, who's career Disney rejuvenated, Fred MacMurray. In fact the similarities between this and Absent Minded Professor and Son of Flubber are too obvious to be missed.<br><br>Still those were two pretty funny films and Blackbeard's Ghost is in a great tradition. <br><br>Dean Jones is the new track coach at Godolphin College and he stays at the inn that's run by the descendents of the crew of none other than Edward Teach better known as Blackbeard. But they are a harmless bunch of senior citizens led by Elsa Lanchester. Yet that inn is coveted by gangster Joby Baker who's bought the mortgage. <br><br>Jones finds a faded piece of paper in an old bedwarmer and it's a spell that makes the ghost of old Blackbeard visible to him only. After that Jones plays straight man to a hilarious Ustinov. Blackbeard and is doings cause some romantic problems for Jones with Suzanne Pleshette, but in Disney tradition in the end the old buccaneer sets everything to right and escapes the limbo he's consigned to.<br><br>For Peter Ustinov fans, this is a must. You can see it in his face and his performance how much of a good time Ustinov was having with this part. It will translate into your enjoyment as well.","user":"bkoganbing","rank":[18,21]},{"title":"A good Disney movie.","rating":8,"date":"7 March 2001","review":"This was a movie that brought back good memories.  Our family went to see it at the theater back in the 70's.<br><br>It is a good story, with a few scenes that are very funny.<br><br>\nDean Jones has the lead (of course), and Suzanne Pleshette is also very good.  Peter Ustinov, is a great pirate for the kids to enjoy.<br><br>A good Disney movie, and a great family movie.","user":"wenz-2","rank":[21,25]}]