[{"title":"Casablanca Redux?","rating":19,"date":"19 October 2004","review":"I think this film gets a bad rap as most people see it as a Casablanca wanna-be based on the fact that the same players appear in both (even the singer Corinne Mura shows up here although she was uncredited in Casablanca). Granted, this is a propaganda film but so were hundreds of others made at this time. France gets particular attention as the sole cause of the Munich sell-out and Marshall Petain, old and misguided, gets all the blame......this is not exactly how it was but we have to remember that Vichy was collaborating with the Nazis. (Remember how Claude Rains threw away the bottle of Vichy water in Casablanca?) So we have to view this film in the context of the times.<br><br>Bogey plays his character just like Bogey.....no attempt at a French accent which probably would have been disastrous anyway and the cast is a melting pot of nationalities. But how can you go wrong with Bogey, Greenstreet, Rains and Lorre? They could make an educational film about the building and maintenance of an internal combustion engine interesting!<br><br>The flashbacks are not hard to follow, and although a rather awkward story telling method in this particular film, don't really take that much away from the screenplay.<br><br>Bogey's actions surrounding the survivors of the downed German plane were a bit surprising but hey, it was war. The entire fight on the ship against the Germans was the best part of the film.<br><br>Michele Morgan had absolutely nothing to do in this film which is too bad as she was a wonderful actress with a haunting beauty but this is basically a man's movie. <br><br>All in all, this isn't a bad film but it has suffered because of its comparison to Casablanca. Be warned that it is pure propaganda but I found it enjoyable and a window on a different time.","user":"Bucs1960","rank":[36,41]},{"title":"Bogart maintained an opposing balance of virtue and vice","rating":7,"date":"10 April 2005","review":"Wartime heroics never seemed exploited in quite so complex a fashion as \"Passage to Marseille,\" directed by Michael Curtiz <br><br>Bogart, a French journalist framed for murder because of his political views and sent to Devil's Island during World War II, escapes from his penal hell with four other convicts and winds up on a French freighter bound for home Hoping to rejoin the fighting Free French resistance movement, the men, all fiercely loyal patriots, become involved in preventing a takeover of the ship by Fascist sympathizers <br><br>This relatively simple plot line is then surrounded by a series of extraneous plots and subplots which were related in a series of single, double, and even triple flashbacks, making any semblance of coherency virtually impossible <br><br>Bogart's characterization is equally vague and complicated as he maintained an opposing balance of virtue and vice At one moment he is the picture of idealistic moral righteousness fighting against a callous system, and the next he debased his human nature as he brutally machine-guns some defenseless enemies His moral platitudes do not balance his immoral behavior, making for ambiguity and confusion...<br><br>The most important saving grace of \"Passage to Marseille\" is the supporting cast headed by Bogart's \"Casablanca\" co-stars Claude Rains, Sydney Greenstreet, and Peter Lorre, who all turned in strong character portrayals","user":"Nazi_Fighter_David","rank":[31,40]},{"title":"An International Smorgasbord","rating":8,"date":"12 October 2002","review":"Many serious film buffs have made the comparison between this movie and Casablanca.  The director and cast are almost identical.  They also take issue with the nested flashbacks, claiming that it confuses the story.  I disagree.  Think for a moment; if Casablanca had never been made, this would certainly be a riveting movie in it's own right.  It deserves to stand alone and be recognized - for the propaganda it was.<br><br>I won't go into the story itself, but I couldn't help making an observation about the cast.  This is supposed to be a story about French convicts who recognize the errors of their ways and come to France's aid when she needs them most.  Humphrey Bogart and George Tobias were from New York (the accents prove it), Philip Dorn from the Netherlands, Helmut Dantine from Austria, Peter Lorre from Hungary, Victor Francen from Belgium, Vladimir Sokoloff from Russia, and Claude Rains, John Loder, Sidney Greenstreet from England.  Only Michelle Morgan was French and she seemed more like an afterthought.<br><br>An honorable mention for my favorite director:  Michael Curtiz.  Many people have called him a studio hack and criticized him for his dictatorial rather than directorial attitude toward cast and crew alike, but anybody who could construct such diverse masterpieces as \"Casablanca\" and \"The Adventures of Robin Hood\", deserves much more credit than he ever got.  I urge you to review his screen credits.  He was prolific and uncompromising in the quality of his work.","user":"howdymax","rank":[12,14]}]