[{"title":"Striking '40's Prison Drama.","rating":7,"date":"30 March 2012","review":"Universal International's BRUTE FORCE is without doubt one of the finest prison pictures ever made. Outstandingly directed by Jules Dassin this brutal brooding and dark drama, has never been, or is ever likely to be, equaled. Produced for the studio in 1947 by Mark Hellinger the stunning black &amp; white cinematography by William Daniels, together with his amazing use of light and shade, perfectly highlighted the bleak grimness of being shut away on the \"inside\" where injury and death lurks from every crevice of the thick walls. Based on a story by Robert Patterson it was turned into a brilliant screenplay by Richard Brooks and composer Miklos Rozsa once again supplied one of his high octane tension filled scores.<br><br>Hardened convict Joe Collins (Burt Lancaster) is a \"lifer\" in the maximum security prison of Westgate Penitentiary. Together with his old boss Gallagher (Charles Bickford) - who is also doing time as the prison's newspaper editor - he plans an elaborate escape. But tyrannical head guard Captain Munsey (a brilliant Hume Cronyn) suspects a breakout is afoot and will go to any lengths to prevent it. In one intensely harrowing sequence in his office he interrogates inmate Louie Miller (Sam Levene) about the impending escape and savagely beats him with a hosepipe as Wagner's Tannhauser plays full volume on the phonograph. But Louie endures and tells him nothing. However through another informant Munsey learns the date and time of the escape and prepares his guards accordingly to thwart the breakout. With Collins getting even with the \"stoolie\" the picture ends in a bloody and vicious battle between the guards and convicts with many deaths on each side including Collins and Munsey who have it out in a climactic and spectacular fight atop the gate tower.<br><br>The acting is nothing short of superb! In only his second movie (after Hellinger's \"The Killers\" the previous year) Lancaster is especially good as the recalcitrant and difficult Collins (\"You're not fit for civil life and you won't accept prison life\" Munsey chides him.) Good too is Charles Bickford, Roman Bohnen as the weak and ineffectual Warden and really excellent is Art Smith as the kindly but perpetually hammered prison doctor (\"Yes Capt. Munsey - I'm just a very ordinary man. I get drunk on whiskey but you sir - you get drunk on power\".) But there's little doubt the picture belongs to Cronyn. In a powerful portrayal of the highest degree he simply chews up every bit of scenery there is as the sadistic and dictatorial Captain Munsey. Also of note is the score by the great Miklos Rozsa. Almost eclipsing his music for \"The Killers\" his brooding score here pinpoints the seediness and the ever present potential for danger and death within the prison. His sombre main theme, heard in its broadest rendition under the titles, is a slow dirge-like piece reflecting the despair and hopelessness of those incarcerated in a high security establishment. BRUTE FORCE is one of the composer's best noir scores.<br><br>The picture only has one drawback - the various and needless flashbacks depicting the women in some of the prisoner's lives. These scenes are merely padding and quiet unnecessary. They do nothing really for the movie except break the atmospheric continuity that already had been so well achieved and established. But thankfully they don't last very long and they make up what is only a minor quibble and does not prevent BRUTE FORCE remaining one of the finest gems from Hollywood's golden past.","user":"jpdoherty","rank":[35,37]},{"title":"Prison Noir!","rating":9,"date":"22 January 2009","review":"This is Westgate Penitentiary, the Warden is a weak man, the prison is practically run by the cruel and highly ambitious Captain Munsey. But the prisoners are no walk overs, they deal their own justice to those that don't tow the line, tired and fed up of mistreatment, and fuelled by the Munsey influenced suicide of a popular inmate, the prisoners, led by big Joe Collins, plot a break out, the fear of failure not even an option.<br><br>Brute Force is a cracking moody picture directed with innovation by Jules Dassin and starring Burt Lancaster (brilliant as Joe Collins), Hume Cronyn (Munsey), Charles Bickford (Gallagher) and lady support (shown in excellent flashbacks) from Yvonne De Carlo, Ann Blyth, Ella Raines and Anita Colby. We open in the pouring rain at the monolithic gates of Westgate Penitentiary, Dassin's camera looking up at the gate like some foreboding warning, William Daniels black and white photography is stark and making its point, all this as Miklos Rozsa's score thunders in our ears, it's clear that this is going to be a mean and moody prison picture.<br><br>So it proves to be, sure all the formula traits that lace most prison films are in here, but Dassin and his team have managed to harness an oppressive feel to put us the viewer within the walls of Westgate as well. This is a bleak place, there are six men to a prison cell, their only chance of staying sane is memories of loved ones and a unified spirit to not be put upon by the vile Munsey, we are privy to everything, we ourselves are part of the furniture. Brute Force thankfully doesn't disappoint with its ending, the tension has been built up perfectly, the mood is set, so when the ending comes it's explosive and a truly fitting finale to what has been a first rate prison drama. 9/10","user":"hitchcockthelegend","rank":[21,23]},{"title":"Brute Force is a knockout!","rating":30,"date":"30 October 2004","review":"I've read recent reviews of this film that condemn it for being \"outdated\" or not \"relevant\". Um, hello? This movie is is fifty-seven years old! As such, we are treated to typical 1940s Hollywood stereotypes and acting methods, not to mention references to the recently completed war. Yet, even within the pitfalls of the studio system, this film shines as a great example of film noir. <br><br>Director Jules Dassin is brilliant with light, and sets the example for the French \"new wave\" of cinema. Lighting Burt Lancaster from the side, or from underneath, makes him and the other actors look almost surreal.<br><br>Most of the dialogue is \"clipped\" and preposterous, but films from this era often suffer from this same problem. Yet \"Brute Force\" retains its original power simply by virtue of the dynamite performances, the stirring score, and the gritty techniques of Dassin. <br><br>I had to smile during the scene where Hume Cronyn's character turns up the Wagner on his hi-fi so the guards outside his door won't hear the inmate he's about to beat scream. This was mimicked during David Lynch's ground-breaking TV series \"Twin Peaks\" when a character turned up his radio before he beat his wife. Of course beating people isn't funny, but seeing obvious references in cinema is always a kick. <br><br>I highly recommend \"Brute Force\" to anyone who appreciates the art of film, great directing, and fine performances.","user":"bscowler","rank":[44,57]}]