[{"title":"An unusual movie for the times of 1948.","rating":10,"date":"19 March 2001","review":"\"The Snake Pit\" is based on a true story written by Mary Jane Ward in the hopes it would bring to the attention of the people, the horrors that a person faced in a mental institution at the time, pre-1948. The character, Virginia, was based on Miss Ward's own experience in a mental hospital.  Even though the film was nominated for various Oscars, it only won for the musical score.  I think that was probably because at the time mental illness was considered taboo.  Olivia deHavilland acted the character of Virginia brilliantly as did everyone else in the film and Betsy Blair in her portrayal of Hester looked like she was completely and totally beyond help.  Just look at her eyes.  You will see what I mean. To this very day, I think it is the most haunting and most accurate of all films that have been released on the treatment of emotional disorders.  I think all characters were portrayed as Mary Jane Ward wanted them to be portrayed, as I studied her book and watched the film while in high school in the early 1960's.  Great book and a great film not afraid to show the abuse by certain medical personnel.","user":"julianhwescott","rank":[64,66]},{"title":"Breakdown","rating":8,"date":"22 August 2005","review":"Hollywood in the forties was not exactly ready to deal with subjects such as the one depicted in \"The Snake Pit\". It must have taken a lot of courage to get this project started since it dealt with a serious problem of mental illness, something not mentioned in good company, let alone in a film that took the viewer into the despair the protagonist is experiencing.<br><br>Anatole Litvak, the director, got a tremendous performance from its star Olivia de Havilland. If there was anyone to portrait Virginia Stuart Cunningham, Ms. de Havilland was the right choice for it. The actress is the main reason for watching the movie, even after all these years.<br><br>The director was responsible for the realistic way in which this drama plays on screen. The scenes in the asylum are heart wrenching, especially the electro shock treatments Virginia undergoes. At the end, the kind Dr. Kik discovers a deeply rooted problem in Virginia's mind that was the cause for what she was experiencing.<br><br>Leo Genn is the other notable presence in the film playing Dr. Kik. He makes the best out of his role and plays well against the sickly woman he has taken an interest in helping. Mark Stevens is seen as Virginia's husband, the man that stood by his wife all the time. In smaller roles we see Lee Patrick, Natalie Schafer, Leif Erickson and Celeste Holm, and Betsy Blair.<br><br>\"The Snake Pit\" is a document about mental illness treated with frankness by Anatole Litvak and his team.","user":"jotix100","rank":[45,47]},{"title":"....a ground-breaking film....","rating":8,"date":"5 July 1999","review":"Considered brutal and scary in the day of its initial release, \"The Snake Pit\" was a ground-breaking film with its look into the horrors of a mental institution. Giving the film its vibrancy and life is the elegant Olivia De Havilland. This fine actress goes to town in this fascinating portrait of a young woman, Virginia Stuart, who, soon after marriage to the handsome Robert Cunningham (Mark Stevens) , descends into a world of paranoia and insanity. He takes her to an institution, but conditions there are foreign to Virginia. This Hollywoodization of life in a mental hospital, though tame compared to reality, still packs a punch. We follow this delusional woman as she tries to come to grips with where she is, falls in love with her kind-hearted doctor, Mark Kirk (Leo Genn), befriends other patients, and tries to hide out in the hospital.  Celeste Holm has a minor, but welcome role as Grace, a fellow patient who takes a liking to and protects the confused Virginia.<br><br>What a score for the lovely De Havilland! She really gets to show her stuff in this emotional role, and got an Oscar-nomination for her efforts. And kudos to director Anatole Litvak for a wonderful, but hard-to-take visit into a woman's not-all-there mind and her institutionalized world.","user":"boy-13","rank":[46,49]}]