[{"title":"Ground-breaking revisionist western and pure seventies gold","rating":9,"date":"17 July 2014","review":"This was one of the first neo- or revisionist-westerns and it really is a bit of a shame younger audiences mostly don't seem to know it: this is classic seventies gold. Arthur Penn, one of the driving forces behind the so called New-Hollywood (he also directed 'Bonnie and Clyde'), delivered a masterpiece - with a fantastic Dustin Hoffman. <br><br>It's an epic, tragic tale - but one told with an often very funny voice. Part satire, part honest look at America's dark and untold history, the tone and narrative structure of this film were ground-breaking. And it still looks fresh: the script, the acting, the camera, the music: everything still oozes quality more than 40 years later. A timeless classic. 9 stars out of 10.<br><br>Favorite Films: http://www.imdb.com/list/ls054200841/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[53,60]},{"title":"A magnificent film","rating":10,"date":"31 January 2007","review":"This is one of those movies you have to see if you like great films.This is a long movie but it is so good you'll never want it to end.I rated this movie a 10 but only cause the scale doesn't go any higher.<br><br>This is the story of Jack Crabb who begins the movie as a 121 year old man in a nursing home recounting his life.And what a life it was.He bounces back and forth in the Old west between the world of the white man and the world of the Native American.Crabb sees and does just about everything possible in both worlds.The joy and sadness and fun he has along the way makes for one helluva movie.<br><br>Dustin Hoffman is brilliant in this film.It may be his best performance ever yet it is somehow overlooked when many people think of his movies.It is a tour de force for Hoffman who plays an Indian and gunslinger and drunkard and muleskinner and many other things in this movie. Chief Dan George is nothing short of amazing in this movie.But yet one critic said he wasn't acting,he was just an Indian playing an Indian.Bah! Richard Mulligan was so perfect as General George Custer in this movie that he is who I see whenever I hear the name of Custer mentioned.Faye Dunaway and Martin Balsam create memorable characters too.<br><br>This movie makes one of the strongest statements I've ever seen about the treatment of the Native Americans yet you probably won't even realize it at the time.This is a movie that you'll replay in your head and then it hits you that there was even more there than met the eye.<br><br>The humor,tragedy and lush characters will stay with you long after you see this movie.This movie is based on the fine book by Thomas Berger and is very faithful to it.I recommend the book wholeheartedly, too.","user":"mrush","rank":[20,22]},{"title":"\" I Didn't Mean to Kill him, . . . just, distract him a little \" \"","rating":8,"date":"21 August 2007","review":"For many years in Hollywood, Native Americans were not allowed to portray themselves in films. One director commented, they neither know how to play Indians, nor can they act. Once this absurd idea was quashed and Native Indians were allowed to portray their own people, not only was the myth crushed, but some of them received the highest tributes the film industry could honor them with. Such was the case with this unusual story which was touted as the most forgotten hero of the southwest. Jack Crabb (Dustin Hoffman) plays a white boy who landed smack dab in the emerging historical west at the start of the colonization period. Through his own fanciful narrative, we journey along as he survives an Indian massacre, adopted into the native culture, then re-acculturated into the White world near emerging townships, and then through several high frontier adventures which culminates with, The Battle of The Little Big Horn. Chief Dan George is Old Lodge Skins a native American who made himself memorable to American Audiences plays tutor and mentor to Jack Krabb. Faye Dunaway plays Mrs. Louise Pendrake who is both step-mother and temptress to the maturing Krabb. Martin Balsam plays Mr. Merriweather who literally goes to pieces throughout the film. Jeff Corey befriends Crabb as Wild Bill Hickok. Finally there is Richard Mulligan who plays Gen. George Armstrong Custer, both as a serious military man and then as a lunatic officer. The entire film is destined for classic status, depending on history's eventual reflection of modern Native Americans. ****","user":"thinker1691","rank":[19,22]}]