[{"title":"Awesome movie. My all time fave. The best villain in the history of bollywood.","rating":10,"date":"9 September 2013","review":"This movie is just one of the best Hindi movie i have seen. Its one of my favorite film. It has all the elements that a good Hindi movie must have.\nThe settings of the hilly mountainous village, the dusty n tough terrain, the train sequence n the villain Gabbar played menacingly by Amjad Khan, were all awesome. Such is the impact of the villains acting is that u always remember him by his character's name frm the movie. One of the movies you remember for life.\nAmitabh Bachan and Dharmendra were awesome too. The character of Hema malini was cheesy n unbelieavable though. A woman riding a horse chariot that too in the cow belt area wher rape is rampant. Nevertheles the film is solid entertainment. \nIt is a story of friendship, courage and revenge, based loosely around the concepts of Akira Kurosawa's Seven Samurai &amp; The Magnificent Seven with shades of Once uopn a time in the west.\nA true cinematic masterpiece.","user":"Fella_shibby","rank":[34,39]},{"title":"No arguments.","rating":21,"date":"21 June 2002","review":"No film before or after Sholay has achieved as much - running to full houses in an unbroken 6 year stretch! Consider the fact that this happened in India - where the audiences have the most choices amongst all the people of the world. Consider the fact that no movie anywhere in the world has been able to reap even half this success that Sholay enjoys.<br><br>It is potent, does not pretend, and has clearly been made with courage and conviction. It was made for the enjoyment of its predominantly Indian, fun-loving audiences, so my dear detractors from the clan of the perennially cynical, reality-fed, fun deprived masses of the world, kindly excuse yourselves. Sholay is quintessential Mumbai produce - you either consume and enjoy in total acceptance, or you're not fit for the ride. It is as simple as that.<br><br>The world would be a poorer place without films like Sholay, not only because of the almost arrogant instantaneous and total suspension of disbelief it demands from its audiences, but because of the honesty and sheer power of that demand. You go to a boxing match to see two boxers fight it out, not to see them playing chess in the middle of the ring!<br><br>Sholay will always be an incredible and shining example of purity, because it was the purest attempt made to entertain, with absolutely no quarters even considered for critical acclaim from the so called pundits of cinema.<br><br>Yours truly is guilty of seeing this film 23 times to date, 17 of these in the theatres. And if opportunity allows, I wouldn't mind being sentenced to death with more of this guilt delightfully added to my conscience.<br><br>As with any other film, there have been many comments on what is wrong with Sholay. To these, here is my personal quote - \"A good film is about getting most things right, not about getting the fewest things wrong!\"<br><br>And here is my response to other heartless comments on Sholay being a copy of some other film or filmmaker's work - \"If every human was an original, we would have 6 billion different species without a single one to call friend or family\".<br><br>To argue against failure may be human, but to argue against success is sub-human. You may limit yourselves if you so wish.","user":"moviesenthil","rank":[51,66]},{"title":"Brilliant","rating":10,"date":"5 January 2004","review":"If you liked \"Once upon a time in the west\", \"The magnificent seven\" and \"A fistful of dollars\", you will love \"Sholay\". It takes all the good ingredients of a western, spices it with a lot of Indian ingredients and lets it simmer until you get one of the finest \"curry\" westerns imaginable. Though obviously very much inspired by the \"spaghetti\" westerns of the late 1960s/early 1970s, this easily surpasses most of the films it's modeled after. A masterpiece.","user":"hprill","rank":[73,101]}]