[{"title":"Benchmark British satire","rating":10,"date":"10 January 2006","review":"Along with Alexander Mackendrick's \"The Man in the White Suit,\" this is THE great satire of management-labor relations: less allegorical and more cheerfully crass. In a way this movie seems like a sort of crossroads in British comedy, poised between the warmer eccentricities of the Ealing films and and the screw-'em-all pop irreverence of the rising New Wave.<br><br>These days the film seems to be primarily remembered for Peter Sellers' magnificent caricature of socialist sanctimony, Fred Kite, but the whole gallery of players, many reprising roles from the earlier \"Private's Progress,\" is excellent. Carmichael, all inane, wild-eyed grins, is Woosterish as ever as the brainless but well-intentioned Windrush. Terry-Thomas produces a very funny sketch of middle-class middle management. It's a perfect picture of lazy hypocrisy: the man who settles into a do-nothing job, knowing exactly how awful it is but not caring so long as he gets through the day. He had a face made for contempt; watching his mustache curl as he reads an entry in the workers' suggestion box (\"Filthy beast,\" he mutters, as he tucks it away in a pocket) or as he picks his way through the rubbish of Kite's wifeless home is a joy. Price and Attenborough are, as always, first-class rotters, the iciest of the moneyed class, and Handl, Le Mesurier and Rutherford add vividly funny moments. As the war over Windrush expands from workplace to societal to domestic spheres, watching the various characters bounce and interact provides some of the movie's best-observed moments, such as the brief tea scene between Rutherford and Handl, who, though inhabiting utterly different worlds, seem to interact perfectly in mutual obliviousness.<br><br>And there is Sellers, of course, pitch-perfect whether marching around the factory like the lead float in a parade or rhapsodizing about Russia or going hilariously blank on live television. It's memorable work that might overbalance the movie's double-edged attack if it weren't human enough to be sympathetic as well.<br><br>All in all, silly, clever, raucous fun.","user":"miloc","rank":[54,55]},{"title":"Great, acerbic British comedy","rating":7,"date":"27 December 1999","review":"The cast alone is a triumph in this movie - some of the best British character actors who ever lived are here:  Terry Thomas, Miles Malleson, John Le Mesurier, all backing up Ian Carmichael as the earnest, silly-ass upper-class bumbler and Peter Sellers as Fred Kite, the Marxist shop steward.  Sellers in particular is wonderful; his Fred Kite is a lower class striver who has acquired just enough education to give him an inflated idea of his own abilities, but not enough to realize the gaps and inadequacies in his views.  He is a perfect realization in miniature of Taine's statement that there is nothing more dangerous than a general idea in a narrow, empty mind.  He boasts to his Oxford-educated gentleman lodger about the summer course he took at the university once, reminding him in a familiar fashion about the very good marmalade and toast provided by the college, while the obviously wealthy young man politely admits that he wasn't acquainted with the public dining hall during his years there.<br><br>The plot becomes more and more complex as the movie progresses, with almost everyone turning out to be on the take.  The climax comes in a free-for-all over a bag containing thousands of pounds intended to bribe Stanley into joining the sensible schemers plundering the public while paying lip service to public service and solidarity with the working class.  Malcolm Muggeridge has a interesting cameo in this scene, playing himself.  Most recent broadcasts of this movie have edited out the disturbing racist statements of the working class characters, but the original movie had no sentimental soft spot for anyone, workers or bosses.","user":"Rosabel","rank":[48,50]},{"title":"Why cant they make films like this anymore","rating":9,"date":"5 August 2006","review":"I remember seeing this film at the ABC Golders Green when it first came out and it seemed pretty funny then.It was on Channel 4 recently and i just believe that this gets better with age.I just wonder why cant they make films like this anymore.Do we have to rely on TV and \"Little Britain\"to satirise modern Britain.There are just so many small as well as big laughs .It makes you think whether you saw that first time round.Everything about this film was so true about Britain at the time that it was made.I recall that the Boultings were involved with a dispute with trade unions over which they litigated and which i believe they lost.This was their way of getting revenge.Every character is perfectly cast from Sam Kydd and his memorable stutter to dear Margaret Rutherford who was at her comedic zenith in the cinema at that time.Of course Peter Sellers gives what must be one of the top 5 comedic performances in British cinema.His shop steward is just so perfect.Oh why don't they make films like this anymore?","user":"malcolmgsw","rank":[35,37]}]