[{"title":"Seen on Pittsburgh's Chiller Theater in 1974","rating":4,"date":"27 December 2013","review":"1966's \"Terror Beneath the Sea\" is a forgotten sci-fi from Japan, less surprising once you learn it's from neither Godzilla's Toho, or Gamera's Daiei. It's actually a Toei production, one of three that made it to American shores, with \"Magic Serpent\" and \"The Green Slime\" better remembered. Apart from future martial arts star Sonny Chiba, we have teenage blonde Peggy Neal, who went on to star in Shochiku's \"The X from Outer Space,\" who promptly disappeared from the scene. The Gill Man costumes are initially intriguing, but become obvious through repetition, though the prospect of human beings being transformed into amphibian cyborgs manages to produce some effective moments. Director Hajime Sato really struck paydirt with his final film, 1968's \"Goke Body Snatcher from Hell\" (also from Shochiku), as nightmarish a combination of horror and sci-fi as any made in Japan. \"Terror Beneath the Sea\" was frequently seen on television through the late 70s (not much since), airing three times on Pittsburgh's Chiller Theater: Sept 14 1974 (followed by 1955's \"King Dinosaur\"), Mar 6 1976 (following 1970's \"The Beast in the Cellar\"), and Nov 25 1978 (following 1960's \"Gorgo\").","user":"kevinolzak","rank":[8,8]},{"title":"Beware the Processed Fishmen of the Sea","rating":5,"date":"5 September 2007","review":"MASTER PLAN: convert people into sexless fishmen, as prep for underwater kingdom and so on. Described as a Saturday matinée treat, this has elements of a James Bond thriller combined with Japanese Sci-fi of the sixties. Indeed, this begins as a typical Bondian teaser on a submarine, with the Navy testing a new kind of torpedo. Although it's a Japanese production, most of the cast is Caucasian, with the notable exception of Sonny Chiba. He and cute blonde Peggy Neal play a couple of intrepid journalists who go scuba diving in the wrong area. They're scared off by a fishman, a poor cousin of \"The Creature From the Black Lagoon,\" but lose the photographic evidence. Hence, being reporters, they go back and soon venture into the wrong caves, where there are now a lot of fishmen. It's all just a prelude to the reveal of an undersea installation (3,000 feet below!) headed by a mad scientist who has perfected the 'processed man' formula &amp; procedure - the method by which people are turned into fish people (or, 'water cyborgs,' as the gloating mad doc calls them).<br><br>Most of this is harmless fun, with most of the actors, perhaps due to poor dubbing, seriously overacting; a lot of the dialog is shouted when they should be speaking in a normal manner. This is especially evident with the two navy commanders, who always seem way over excitable. The mad scientist is strictly out of the 'sneering, cackling school' of nutty villains. The actress Neal also tends to scream or whimper during most of her scenes. Of course, when we get to that eerie conversion process, which is demonstrated slowly to the reporters before they themselves are victimized by it, one can scarcely blame her. This is where it gets a little creepy, another example of the Japanese preoccupation with mutating the human body in film. The pace is a little slow in the first half, especially with all the underwater scenes, but there's lot of action towards the climax, with the Navy submarine attacking and all hell breaking loose as the fishmen go out of control. The FX are low budget and the fishmen suits are not very convincing. Chiba makes a pretty good leading man here, a full 8 years before his famous \"Street Fighter\" role, though don't expect the same fighting ability from him here. Hero:6 Villains:5 Femme:5 Henchmen:4 Fights:5 Stunts/Chases:5 Gadgets:5 Machines:6 Locations:5 Pace:5 overall:5","user":"Bogmeister","rank":[10,11]},{"title":"A monster film mostly for young kids and bad film fans.","rating":3,"date":"24 June 2009","review":"Sadly, before Sonny Chiba made the wonderful martial arts films that made him so famous throughout the world, he starred in a bazillion films--including some real turkeys like INVASION OF THE NEPTUNE MEN (in the bottom 100 films on IMDb). Despite a fairly respectable current score of 5.5 on IMDb, TERROR BENEATH THE SEA is also one of these early bad films. Now it isn't nearly as terrible as INVASION OF THE NEPTUNE MEN (but what is?!), it's still mighty bad and a film only for kids and the curious.<br><br>The film involves Chiba and a cast of Westerners and Japanese investigating some strange creatures in the ocean. They look like a poor man's version of the Creature from CREATURE OF THE BLACK LAGOON--rubber body suits painted silver with putty-like faces. It turns out that they are the creation of a mad megalomaniac (Dr. Moore) who has learned to change humans into practically anything he'd like. Using a mind control device, these cheesy monsters do his bidding. And where does this crazed genius live? Yep, 3000 feet under the ocean--and it's up to Chiba and the US Navy to stop this crazy and his freaky friends. They never really explain how the subs are able to go that deep and Chiba's stupid red-headed sidekick wants to swim from there to the surface (they'd be crushed like grapes by the pressure almost immediately). Maybe originally they mean 300 feet and it was mis-dubbed! <br><br>The film looks very Japanese when it comes to the underwater battles and sub. There are lots of fires and explosions(!) under water and much of it looks really, really cheap--like they were created by someone who built the cities for the Godzilla films. Oddly, despite these silly special effects, some of the underwater diving scenes were very well done and filmed well and the color throughout the film was lovely--very vivid and clean. The costumes also aren't bad (other than the silver-suited freaks).<br><br>The film is entertaining silliness that bad movie fans and kids will like, but I can't imagine anyone else sitting through this odd film. Well,...at least it IS different!","user":"MartinHafer","rank":[7,8]}]