[{"title":"you have to remember the times","rating":13,"date":"13 October 2006","review":"the mid sixties...back before we were so culturally/politically correct...this movie wasn't ever meant to be correct anyway...it was a spoof of course and anyone who comments on it negatively without considering that needs some help.....Texas across the river is a signature film for dean....westerns that he loved so much...also a comedy which he was famous for...(many confirm that off camera he was far funnier than jerry lewis back in his earlier days)<br><br>Texas across the river is a perfect example of a spoof done in the sixties...and if you consider it as such you will find it to be excellent!....some have commented about joey bishop (jew) playing an Indian...well (hello) that is exactly why it works...it was meant to be tongue in cheek!...one should have little wonder as soon as the organ spits out a 60's rhythm and melody every time the indians are seen...or the surf sounding guitar also used in the soundtrack....I love this movie for what its worth....escapism....during a time (1966) of tragedy....the Vietnam war.","user":"shipes_j","rank":[25,27]},{"title":"Painfully funny!","rating":8,"date":"15 October 2005","review":"The first and perhaps, only time I saw this movie was a day or two after having hernia surgery in 1975. That viewing gave new meaning to the phrases \"busting a gut\" or \"being in stitches.\" I couldn't stop watching despite the pain from the laughter and would love to see it again. It was silly but hilarious nonetheless. Who says movies have to be anything but? Then again, I was/am a big fan of the \"Pink Panther\" movies, too. As one other review stated, maybe I won't find it as funny the next time around, but I still chuckle remembering Peter Graves and his unintelligible military commands and Joey Bishop's facial expressions. It certainly can be watched with the entire family, and you can't say that about too many movies these days.","user":"spratt-8","rank":[17,19]},{"title":"God, I love this movie!","rating":10,"date":"8 November 2007","review":"I saw this movie at the theatre as a kid and, thanks to regular television airings, multiple times through the years. I practically have the film memorized. And yet, I bust a gut laughing every time I see it to this day. There are so many memorable scenes and lines that will immediately bring a smile to anyone's face who has seen it; \"Texas isn't even a state, how big can it be?\", \"The coward attacked him from the rear\", the slapping scenes, the arrow in the rear, Joey Bishop as an Indian, Rosemary Forsyth in a wet blanket, \"No Comanche is a friend of mine\", that '60s guitar music whenever the Comanches are around, \"Only read Kronk\", and the oft quoted \"ARUHROAR HAR!\". Simply put, this film is funny. It's a horrible injustice that this film has not yet received a studio DVD release. I long to see this film again in a wide screen presentation without the awful pan and scan.","user":"Cards_fan","rank":[12,13]}]