[{"title":"Clarification of another's comment","rating":29,"date":"29 October 2004","review":"A previous poster on July 9, 2004 states how she is disgusted that the pledge as recited by the school children in this film omits the line \"under God.\" Please allow me to clarify. This film was made in 1945, and the phrase \"under God\" was not inserted into the pledge until the mid 1950s under the Eisenhower administration. This was done so as an anti-communist move. It was NOT originally part of the pledge. The producers of this film were by no means trying to be politically correct by not using it, nor was it ever edited out. The phrase simply did not exist in the pledge in 1945. Having been raised Catholic, I too noticed it right away the first time I saw this film, but a little research on my part quickly put that issue to rest.<br><br>And, like her, I also notice the grayed out bar at the bottom of the screen during the main title. Looks like something that was digitally superimposed over the film. (The same gray bar also appears at the end of the theatrical trailer.) I assume it's there to cover up a piece of the copyright, but what part and why? Who knows.","user":"tms1983","rank":[43,44]},{"title":"Old-Fashioned (Which Means Pretty Good)","rating":7,"date":"6 March 2006","review":"This was a just a plain, nice story, one of those kind I tend favor simply they don't have any \"bad guys\" in them and still keep the story interesting.<br><br>I expected Ingrid Bergman's character, \"Sister Mary,\" from what the liners notes on the video box said, to be a sort-of villain portraying a hard-line rigid nun but that wasn't the case at all. In fact, in her several philosophical disputes the priest \"Father Chuck O'Malley\" (Bing Crosby) I sided with her because Crosby was a little too liberal regarding punishment. (He never wanted to scold or punish any misbehaving kid., for example. No discipline is not a good idea, as parents know.)<br><br>The story is a little unrealistic in that a strong-willed business tycoon would not abandon all his business plans and hand over a brand-new million-dollar (today it would be many millions) building to a church. However, it's nice to see! These kind of old-fashioned films are almost collector's items today but they are pleasant to watch and pretty good entertainment.","user":"ccthemovieman-1","rank":[39,44]},{"title":"A slightly sugar-coated impression of Catholic education, but heartwarming","rating":8,"date":"21 June 2005","review":"I had often heard how this film was nominated for Best Picture and other important Academy Awards, so I was glad to see it on cable a few days ago. I was very pleased with it. The film builds up to quite an emotional, dramatic ending. There are some moments when Ingrid Bergman simply shines with a special radiance. Bing Crosby was excellent also, although I think he had many better songs to sing in his long career. The direction seems slow-paced at times, but in a way this measured pacing gives the audience a better chance to focus on the characters on the screen.<br><br>The story certainly touched upon some important issues of Catholic education in the 1940's and 1950's. There were always fine attempts to help children from the other side of the tracks to prosper in a private school, with assistance of various kinds. The postwar population boom, however, led to huge numbers of children being educated as cheaply as possible in crowded, old, unsafe buildings. It was not uncommon to have 70 pupils in one classroom. In this film the nuns are relentlessly polite, but in real life they had to be very strict to control large classes. The picture refers to \"fire traps\" and the fact that St. Mary's School was about to be condemned. How ironic this was, for just 13 years later -- on December 1, 1958 -- a fire swept through the antiquated Our Lady of the Angels elementary school in Chicago, killing 92 children and three nuns. That tragic fire led to sweeping changes in building code laws and the modernization of thousands of schools across America, both public and private.","user":"DennisJOBrien","rank":[22,24]}]