[{"title":"The Greatest Bad Movie Ever Made","rating":10,"date":"26 August 2004","review":"No, really. Sinbad is easily more entertaining than Plan 9 from Outer Space, which is more commonly considered the best bad movie ever.<br><br>I won't give away all the details that make this movie so laughably awful, but I'll mention a few that I hope will convince you to find and watch this film. (You can read a more comprehensive review at www.rinkworks.com/badmovie/m/sinbad.of.the.seven.seas.1989.shtml)<br><br>John Steiner hammimg up the role of Jaffar, the villain. In particular, he exclaims one two-letter word that must be heard to be believed. You'll know which one I mean when you hear it.<br><br>All the music is done by one guy on a synthesizer, a total of about five different sound effects are used in all the fight scenes, and all the lines are DUBBED OVER. It seems the filmmakers didn't have the ability to record live sound on the set. <br><br>All action scenes are done in slow motion, and this is made painfully obvious by Lou Ferrigno's flapping, overgrown, oiled man-pecs.<br><br>However, all these shortcomings pale in comparison to the dialogue. I'll conclude with a snippet:<br><br>Sinbad: Wait a minute. There's nobody here.<br><br>Poochie the Dwarf: There's nobody here.<br><br>Sinbad: I just said that. That's the point.","user":"secretbison","rank":[30,37]},{"title":"Sinbad smash!!!!","rating":3,"date":"21 February 2015","review":"Sinbad must recover five magical stones to free the city of Basra from the evil spell cast by a wizard. <br><br>His journey takes him to the isle of the Amazons where the queen tries to capture him, to a battle with ghost warriors on the isle of the dead, and ultimately to a battle with his own double.....<br><br>You know your in good company when the Cannon group logo appears for a film, and much like every film released by them, good or bad, you know what you are going to get, thanks to the title, and knowing that the only actor in this film you have heard of is Ferrigno.<br><br>Yes, the film is all kinds if bad, from the script, to the choreography, the awful acting and overacting of the cast, its a poor film.<br><br>But it's never boring, not for one minute.<br><br>When Sinbad escapes from a dungeon using deadly snakes as a rope, you give up all hope of watching a movie in the vein of the Harryhausen classics, and settle for men in very bad costumes.<br><br>Ferrigno, buff as he is, has no screen presence whatsoever. His lines are delivered flatly, and he has the same look on his face throughout the whole movie. His little speech to the animatronic, or finger puppet reptiles, is the single most funniest part of the film.<br><br>And I've not even mentioned the rock monster who tries to kill our hero by hugging him.<br><br>So, now we know, and probably the studio also knew that Ferrigno is the cheap Schwarzeneggar, who's great idea was it to have him fight himself at the end? <br><br>Even though I hadn't eaten all day, I felt stuffed at the end of this epic battle because of all the ham on screen.<br><br>Jafar has to be seen to be believed, he is brilliant because he is so over the top, but its impossible to describe his part.<br><br>All in all its a terrible film, but any aspiring filmmaker needs to see it, so you never make the same mistake..","user":"FlashCallahan","rank":[7,7]},{"title":"Hilariously Awful","rating":2,"date":"23 July 1999","review":"An incredibly fun, incredibly bad movie.  Definitely recommended for any fans of bad cinema, this movie has it all.  Plastic props, horrendous dialogue, plot holes galore, sophomoric special effects.  Lou Ferrigno (Hulk!) throws his sword away and wrestles with bad guys, in sloooooow motion action sequences that will have you yawning in anticipation.  Hats off to John Steiner as the EVIL Jaffar-his hammy overacting steals every scene he's in.  Listen especially for the scene where he's discussing his plans with the princess in the tower.  Just when you think he's done, he lets out this uproarious \"Ha!\" that's so random, you won't know what hit you!  I was laughing for minutes-then for hours afterward, just from remembering this one line.  Definitely one of the highlights of modern cinema-see this movie!  2/10, both points for the awesome performance of Jaffar.","user":"constructionbob","rank":[22,27]}]