[{"title":"Classic CAMP on the highways of New Mexico!","rating":10,"date":"30 August 1999","review":"A great piece of early 70's film: this gem has it all.<br><br>Some special moments:<br><br>The beautiful Claudia Jennings in go-go boots or naked throughout most of the film!<br><br>The truckin' music video inserted about mid film!<br><br>The overt violence peppered throughout (from the opening execution in a bathtub, to the final battle featuring machine gun toting hookers and lots of tragic death)... all set to some great CB-era country music and a few bit that they had left over from \"Land of the Lost\"!<br><br>The southern New Mexico locations that cradle our heroes in their struggle!<br><br>The turncoat, Seago, getting trampled by 30 head of cattle in the back of a weaving truck!<br><br>Any way you slice it, this movie has it all. Sex, violence, bad acting, found locations, and a wacky plot that just keeps coming. I watch it often and inflict it on friends as a sort of, \"bad-movie baptism\".<br><br>As long as I can watch Truck Stop Women, Gator Bait, and Unholy Rollers, Ms. Jennings will not be forgotten.","user":"tron-12","rank":[25,26]},{"title":"john martino where are you?","rating":3,"date":"3 September 2002","review":"this movie falls in to the\"its so bad its good catergory\" bad acting,terrible corny dialog,a first class laugh riot!! pick it up if you get a chance.<br><br>this film is blessed by the presence of the great john martino, and i couid never figure out why he disapeared after just a handful of movies,i thought he was great in this film,and as joey amato in capone, and of course paulie gatto in the godfather.","user":"mstock-1","rank":[11,13]},{"title":"One of Claudia Jenning's finest drive-in flicks","rating":2,"date":"2 February 2007","review":"This is a pretty decent 70's drive-in flick featuring the undisputed queen of 70's drive-in cinema, Claudia Jennings. Claudia and her hard-as-nails mother run a truck-stop brothel in New Mexico which they use as a base to get information on valuable loads that they can later hijack by pretending to be stranded female motorists (the sight of Jennings in short-shorts or hot pants is obviously enough to make any male driver slam on his brakes), hitting the poor guys over the head, and stealing their trucks. Jennings grows tired of her domineering mother, however, and teams up with a slick East Coast Mafioso who is trying to take over the operation. This leads to a violent show-down between the rural hicks and the \"citified\" urban mobsters.<br><br>This movie contains a lot of violence, exciting car chases (actually semi-truck chases) and general rural mayhem. There is plenty of topless-ness (if an unfortunate dearth of bottomless-ness) by Claudia and her female cohorts. For some reason the main mobster played by John Martino is named \"Smith\" (perhaps because this was the era of the so-called \"Italian-American Anti-Defamation League\",ironically created by infamous mob boss Joe Colombo), but he is nevertheless still the complete Italian Mafia stereotype(\"Fuggedbaboutit\"!). Busty bimbo Uschi Degert has her best role ever--she isn't fully dressed for one minute of it but doesn't utter a word of dialogue (lest viewers wonder what a thickly-accented Swedish immigrant is doing in rural New Mexico). Director Mark Lester does a good Cormanesque job of combining feisty feminism with gratuitous sexism (and frankly it's a lot more believable to see a woman like Jennings use her feminine wiles so she can conk a guy over the head with a crowbar than it is to see Peta Wilson or some other 100 lb. fashion model beating up musclebound guys three times their size with martial arts like in today's version of these faux feminist movies).<br><br>I would recommend ANY movie with Claudia Jennings, but this is one of her best","user":"lazarillo","rank":[11,14]}]