[{"title":"Not a bad film at all!","rating":7,"date":"14 October 2005","review":"This is the first film of Burt Reynolds' I have seen that he directed as well as starred in. Yes, some elements of the story are clunky but overall STICK is very enjoyable. Reynolds gives an excellent performance as always. Charles Durning is quite good as Chucky but is let down by the very obvious wig he is wearing for the part (at least I HOPE it's a wig). George Segal and Candice Bergen are both good as well, but it's strange how Reynolds and Bergen immediately get into a romance.<br><br>Stuntman Dar Robinson also makes a memorable villain as albino hit-man Moke. Since he was a stuntman I guess that means he did all his own stunts for the movie, which makes it even more cool. Very few stuntmen are good actors but Robinson plays the part well. The only problem is we don't see enough of him. The BIG bad guy, Nester, is played brilliantly too, but the actor's name escapes me right now. There's also a lovely song played over the end credits. I'm interested in reading the Elmore Leonard book this film was based on. I'm sure it and the film may be very different, but I still give the movie STICK a thumbs-up. I think it should get a DVD release.","user":"bannonanthony","rank":[6,6]},{"title":"80's flick, that entertains.","rating":5,"date":"24 June 2001","review":"The Good Stuff:<br><br>Candice Bergen looks gorgeous. Small role by David Reynoso. The late Dar Robinson as the \"Albino Hitman\". The Albino Hitman falling to his death while emptying his six shooter looks real cool.<br><br>The Bad Stuff:<br><br>Charles Durning in a blond wig is really hard to take (those crazy looking eyebrows!).<br><br>The Verdict:<br><br>Typical 80's flick with lots of flashy cars, drug dealers, one colorful hitman, directed by Mr. Reynolds, that even if looking dated manages to entertain.","user":"a_genda","rank":[12,14]},{"title":"Burt Reynolds returns as Stick!","rating":15,"date":"15 December 2001","review":"This movie is based on Elmore Leonard's novel of the same name, but for those looking for the novel while waiting for the movie to reappear on television or on order from Amazon, don't bother, unless you're a fan of Elmore Leonard's work. While Mr. Leonard should be given more than due credit for his adaptation to movie, the real work was done by Mr. Reynolds, who plays the character true to form.<br><br>I have to admit that one reason I love this film is because of its leading lady. Ms. Bergen seems to be able to play her own character in this film, rather than playing off Burt's character. Two of the best scenes are the one where she sums up the movie producer's porposal as fraud, and of course the intimate scene in her bedroom with Burt's character.<br><br>I am old enough to remember when this movie came out in the theaters. One review in a popular men's magazine at the time panned the movie, largely faulting Burt's performance (as I interpreted the review). Having been a fan of Mr. Reynolds films for many years, I was glad to see that he didn't seem to take such reviews to heart at the time, and continues to entertain us, even today.","user":"tgreene_msp","rank":[15,20]}]