[{"title":"What a joy!","rating":25,"date":"25 July 2003","review":"Fantozzi is such a lovely little movie. It narrates the antics of a lower class office worked employed by a faceless corporation. Paolo Villaggio used to work for a large international company and experienced the daily little humiliations and frustrations so often present in large offices. He used this experience to write a bitterly satirical book by the same title as the movie. Masked behind the funny stories of Fantozzi, there are the horrible realities of the daily work life of a humble worker. The movie is far less profound than the book. The slap-stick comedy is so good that everything else is forgotten. The attention to detail is impressive and can only be appreciated after a second or third vision of the movie. All the characters are very real and can be found in every day life. A must see for all those people that can see through the layer of basic comedy and find the bitter satire of a pointless life. Everybody else will enjoy the slap-stick bits. It can be considered as the granddad of modern classics such as `The Office'.","user":"folgore73","rank":[27,30]},{"title":"Under-appreciated classic","rating":8,"date":"30 November 2009","review":"Despite the absence of an actual plot (the movie is more or less a sequence of sketches), Fantozzi is probably the last hooray of the Italian-style Comedy. Sure, the general tone is much lighter if compared to classic Italian-style Comedies, but nonetheless the fire of a merciless socio-cultural criticism still burns under the see-through veil of the farce.<br><br>Accountant Ugo Fantozzi embodies every possible stereotype of your Average middle-class Italian of the 70s. Stuck in a frustrating job, exploited and made fun of by his coworkers, designated victim of his bosses, unhappy and disheartened family man (married to an unbelievably ugly and dull wife, and with a simian daughter), he always seems to draw the shortest straw. No matter what he does, and how hard he tries, Lady Luck will always turn her back on him. Better if after having given him some hope.<br><br>But mind you, behind all the improbable situations and the over-the-top comedy stuff, the message is indeed deeper. Everything Fantozzi wishes for is the so-called Italian Dream: after the economical boom of the late 50s, every Italian dreamt about landing a good 9-to-5 job, buying himself a house and a car, living a nice and quiet family life with summer holidays, plenty of hobbies etc. And, should things have gone very well, maybe a mistress too...<br><br>Instead, poor Fantozzi is stuck in a rut: he has a second-rate version of all of that... And the more he tries to attain \"happiness\", the worse it ends.<br><br>Clearly, the comedy aspect is prominent, and the movie is also enjoyable for its slapstick comedy, for its sketches and for its caricatural portrait of Italian lower/middle-class. But once the funny parts are an \"acquired taste\", you can see past it and the sadness of the characters appears, offering a whole new dimension to the movie.<br><br>In origin Fantozzi was a literary character, created by Paolo Villaggio himself (who'll star as Fantozzi in all the subsequent movies), and on the written page the social criticism was much heavier. The cinematic version made the satire more enjoyable, probably less sharp, but for sure not less noticeable.<br><br>In the end, Fantozzi is a classic of Italian Comedy, and has had a long-lasting impact on Italian language, comedy and society. Every single character, quote and episode is well known in Italy and can easily be \"recycled\" in everyday's life, even 35 odds years after its original creation.<br><br>Had it been \"just another silly comedy\", it wouldn't had the same impact.<br><br>The only real downside of the movie, and of the whole saga, is you have to watch it in Italian, possibly understanding the language to a decent degree. Otherwise many jokes and situations will go over your head","user":"Kalle_it","rank":[16,17]},{"title":"The first of the great Fantozzi-series","rating":10,"date":"8 March 1999","review":"This is the first movie of the long Fantozzi-series. And as it often happens all the follow-ups were never as good as the original. This movie is based on a book written by Paolo Villaggio himself (Fantozzi, main character in the movie). You can define it as the first movie of a new italian comedian style. It was the break-point of Villaggio's actor-career. Today he's one of the most famous italian comedians, a lot of people know Villaggio but everybody knows Fantozzi. The success of this movie is probably based on the fact that everybody can identify with Fantozzi. He's a normal worker, has a happy family an awful-looking daughter, some friends and he is into Signorina Silvani who works with him. You can compare Fantozzi to Al Bundy. Nothing works like he wants but at the end everything is alright. I don't know if the Fantozzi-movies have been translated to English, but if you have the chance to watch one of them don't miss it!!","user":"salvi70","rank":[20,23]}]