[{"title":"Best of the Bonds?","rating":9,"date":"28 August 2005","review":"The first three Bonds (Dr. No, FRWL, Goldfinger) are without question the best in the series, though From Russia with Love may well be the best of the best. It has all things we look for in a great Bond film - exotic locales, sinister villains, beautiful women - but it was made before Goldfinger established the ingenious-yet-demented-supervillain-plus-indestructible-henchman formula as canonical, so its plot line may surprise viewers reared on the later Bond films. For one thing, there's little or nothing in the way of gadgetry (though Q does provide our hero with a pretty nifty briefcase). Beyond a brief encounter with the faceless Number One, there's no arch-villain looming over the action, and the henchmen are at once less invulnerable and more interesting than most of their successors in the series. Particularly memorable, of course, are Lotte Lenya as the hatchet-faced Colonel (\"She's had her kicks\") Kleb and Robert Shaw as the brutish Donald \"Red\" Grant. Kleb's edgy menace is neatly offset by her terror at the prospect of failure (an option which Number One refuses to countenance); her subtle come-on to Tatiana Romanova was positively daring by 1963 standards, and she manages to do for footwear what Goldfinger's Odd Job went on to do for head gear. Grant is no superman, but a vicious, small-time thug, recruited by SPECTRE and transformed into a fearsome enforcer; his bitter encounter with Bond on the train speaks volumes about the class tensions that still underlay British society in the post-war era.<br><br>Connery, for his part, gets to build on the character he first fleshed out in Dr. No. His Bond really emerges here as a complex man, formidable but flawed. He's genteel and sophisticated, but he doesn't always keep his cool; unlike the too-often unflappable Roger Moore, Connery's Bond betrays both anger and fear when the circumstances seem to warrant it. He intervenes chivalrously to stop a fight between two Gypsy women, but he's not above slugging a woman in the service of his mission. I've always enjoyed the humanizing chemistry between Connery and Pedro Armendariz's larger-than-life Kerim (\"I've led a fascinating life\") Bey, the most charming of Bond sidekicks; their friendship comes across as genuine and multi-dimensional. Today's viewers (especially women) will likely find Daniela Bianchi's Tanya (\"I LOVE you, James\") Romanova an uncomfortably passive damsel-in-distress, but, hey: she's drop-dead gorgeous and has some nice scenes with Connery. The Turkish and Balkan settings are spectacular and the train sequence at the end is both exciting and suspenseful. Cold War scenario notwithstanding, this one has aged very well. Shake yourself a pitcher of vodka martinis and spend a Friday night watching Dr. No, From Russia with Love and Goldfinger.","user":"bishop_guido","rank":[139,177]},{"title":"Bond in a Cold Climate","rating":8,"date":"21 May 2006","review":"'From Russia With Love' is the second and last of the Bond films to be made without a rigid formula. With 'Goldfinger', the expected elements of the later films would all accrue in a single film, setting a template the series would struggle to escape from (and, for the most part, would not bother trying to). So, like 'Dr. No', there's only a single sex interest (let's not use the term 'love' too lightly), rather than the good-girl-survives, bad/tragic-girl-dies dichotomy that would later structure all the films (bar OHMSS and, interestingly, the Dalton films), and unlike 'Dr. No', the villainous plot is rather small beer and resolutely real-world - to steal a code machine and humiliate the British Intelligence community in the process. There's also no bombastic theme song, although Matt Monro provides an easy-listening version of the theme tune at the end (it's not half bad, actually, although Shirley Bassey's brassy 'Goldfinger' makes it seem antediluvian in comparison).<br><br>Effectively, this means that it's the last Bond film in which the makers were trying to make a film, not a Bond film. It didn't matter if the motifs were all there or not, it only mattered if it was a good film. Unsurprisingly, it has a good claim to being the best film of the series, and it's certainly the least self-conscious (compare with 'Thunderball', an artificial attempt to replicate 'Goldfinger' but making everything bigger).<br><br>So, Daniela Bianchi isn't really just the latest 'Bond Girl', but the character at the heart of this thriller - she pretty much is the story. Ursula Andress might have had an iconic entrance in 'Dr. No', but she was so much window-dressing, irrelevant to the plot, arriving late and with almost no agency in the events that unfold around her. By contrast, the crucial pivot of 'From Russia With Love' is whether Bianchi's Tanya will side with Bond or SMERSH - the age old 'love or duty' dilemma.<br><br>The film also takes time with detours that have little to do with the main plot - as in the sequence at the gypsy camp. There is a real feeling of a functioning world around Bond's escapades, rather than just colourful 'exotic' backdrops.<br><br>There also isn't an undue emphasis on big action set pieces - Bond's encounter with a helicopter (very 'North by Northwest' - in fact Hitchcock's influence is detectable throughout this film, from the Cathedral sequence, to the cool Blondeness of Bianchi, to the train setting of the second half) and the climactic speedboat chase are well-executed, but miniature next to those of later films. Tellingly, the best remembered action sequence is the fight between Connery and Robert Shaw on the train, and the series would never better this intimate, brutal struggle.<br><br>Shaw is by far the best of the series' bull-necked heavies - he's intelligent and charismatic as well as forceful, almost a Bond-equivalent. Lotte Lenya and Pedro Armendariz are both excellent in their supporting turns, reminders of a time when the series actually featured fully developed supporting characters, and Bianchi is good - she may lack the overt sex appeal of Andress, but she's a better actress, playing innocent without being either stupid or dull. Connery really grows into the role here, a long way from the pork-pie hatted clod he was in the first film but still untamed and prickly enough to be an exciting screen presence. It was a long slow decline from here to the tubby jobsworth of 'Diamonds Are Forever'.<br><br>The early Bond films often escape the critical gaze, and when they are subjected to it, it is usually through rose-tinted spectacles. 'Dr. No' is dull and poorly acted, 'Goldfinger' fun but rather shapeless, and 'Thunderball' just tries too hard altogether. 'From Russia With Love' is a polished little gem, a cold-war thriller done with great style, and a minor masterpiece, irrespective of the series around it.","user":"laika-lives","rank":[91,117]},{"title":"Classic Bond","rating":10,"date":"9 September 2005","review":"Following the surprising success of Dr No, it became obvious that Broccoli and Saltzman's next step as producers would be other cinematic adaptation of Ian Fleming's work. Their choice this time was From Russia With Love, a novel once pointed out by US president Kennedy as one of his favorite books.<br><br>Trying to capture the unique mood and look of Dr No, the producers brought back almost everyone involved in the first Bond outing ( excepting mediocre composer Monty Norman, whose clumsy tunes were replaced by a magnificent John Barry's score, in his first \"official\" collaboration in the Bond series). This includes Broccoli's long-standing collaborator Terence Young, screenwriter Richard Maibaum ,and, of course, Connery, that rough Scottsman, initially despised by everybody as a \"lorry driver\" , who nevertheless delivered an unforgettable performance as James Bond.<br><br>All these talents combined to produce what no doubt is one the best Bond films of all time. Contrasting with the over the top story lines which would very soon become synonymous with Bond, From Russia With Love is a gritty and realistic Cold War thriller,filled up with sex violence and pure excitement. Terence Young considers this to be his best Bond film, and the movie proves him right. It is full of stylish shots( the famous close-up of Romanova's lips while Bond says \"your mouth is just the right size\") and really hot( by the 60's standards) seduction sequences. Even the back projection, a technical device often unfairly criticized , works wonderfully. Although many have criticized the action sequences following Bond's scape from the train, I think they're excellent, adding to the film's sense of danger and excitement. The helicopter chase, in particular, is a moment of brilliant film-making.(And it's even better than the sequence From North By Northwest that inspired it) The shot of Bond and Romanova embracing in the foreground with the helicopter exploding in the background perfectly encapsulates what the entire movie is about:danger, romance, violence.<br><br>As for the cast, Connery seems more confident and relaxed this time, but when it comes to his job, he is as ruthless and cold as Fleming originally envisioned the character. Lotte Lenya wonderfully portrays SPECTRE mastermind Rosa Klebb (\"..such a disgusting woman...\" as Romanova states at one point) . But it is legendary supporting actor Robert Shaw who nearly steals the show as a cold-blooded hit-man with a psychotic strain to him.<br><br>All in all, From Russia With Love is definitely a must-see not only for Bond fans, but for every discerning film lover.A true classic.","user":"ThomasHayden","rank":[90,121]}]