[{"title":"Still Stands Up","rating":20,"date":"20 May 2003","review":"I was a little apprehensive renting the DVD of this movie after all of these years since its original release, but most of it holds up remarkably well.<br><br>On the DVD commentary tract, the makers of the film, looking back on it after 25 years, seem to be equally as surprised.  The director, Carl Reiner, points to an eight-minute scene in which it is just Denver and Burns talking in a bathroom.  There is no music, no fast cuts, no special effects, and the scene simply holds our attention on its own.  Mr. Reiner indicates that there is no way that the scene would be made that way today.<br><br>Some scenes are timeless, such as Jerry's first encounter with the Almighty via intercom in the all-white room.  Also classic is the infamous scene in the bathroom in which God first reveals himself in the flesh to a humbled and still somewhat disbelieving John Denver.<br><br>Unfortunately, not all of the movie holds up as well.  Some things, especially exteriors, seem very dated.  And even though it is quaint, it is hard to believe that an intelligent and capable husband and wife team would cherish a Supermarket Assistant Manager Job so much.  Ah well, it was another time when people still believed in sticking with one company and working their way up through the ranks.<br><br>I wish that the film would explore some of the harder questions of religion a little more seriously, but one wonders if the film would collapse if taken out of its sweet, feel-good movie formula in which it is helplessly trapped forever.<br><br>If anything, rent it for the performances of the two leads.  George Burns, playing the role at 83, is so good, that it is, (not to be cliched,) awesome.  However, what is equally as unbelievable is the performance of John Denver in his first and only acting gig.  He hits some of his notes perfectly, and it really shows a significant skill and timing to play straight man to a legend like Burns.","user":"Bbennet1","rank":[20,20]},{"title":"Gentle, but significant","rating":9,"date":"30 September 2004","review":"This is a warm, inclusive film. Maybe there's a bit of nostalgia in my comments, but I appreciate this movie's approach to faith. <br><br>God comes in a form that our modern society seems to enjoy dismissing-- the elderly. It's a delight to George Burns, who really does have all that mileage on him, and John Denver, whom no one will mistake for Laurence Olivier, create this relationship between the mundane and the spiritual that is relatable, relaxed and relevant. <br><br>In our culture, we already know about the forbidding and the punishing, and the hostility between faiths. <br><br>But here's a God who says, paraphrasing here, \"Jesus was my son. Moses was my son. Mohammed was my son. Buddah was my son. And so are you. And so is the guy who's charging you 18.50 for a piece of room service roast beef.\"<br><br>Inclusive, with gentle humor. Burns' performance suggests a being who has seen a lot of the world, and doesn't expect anything of importance to happen quickly. <br><br>It's a loving and practical relationship between the everyday and the sacred.<br><br>And the old hands, Barnard Hughes and Paul Sorvino, and the whole gang of great character actors, make this a treat to watch. And gee, having Teri Garr play exasperated. That's like asking Pavarotti if maybe he'd like to sing something.<br><br>Maybe a bit sweet for your taste, I don't know. For me, I can actually watch it whenever it comes on and enjoy every moment of it. (Like Paul Sorvino as a money grubbing preacher, protesting, \"And I PERSONALLY have been invited, to give the benediction.....at the SUPER BOWL!!!!\"","user":"steveareno90048","rank":[27,29]},{"title":"Do they make em like that anymore?","rating":10,"date":"27 February 2005","review":"I was reminded of this wonderful gem of a movie the other night when I watched Bruce Almighty again with some friends. That's been a favorite of mine in these last few years. Anyway it reminded me a little of Oh God for obvious reasons, the references to God, and the thought provoking quality mixed with wit and intelligent comedy.<br><br>Oh God was one of my favorite comedies growing up. It definitely is the kind of comedy that doesn't get made anymore unfortunately. I have yet to read the other reviews of this and hope to find some tens besides me, because while this was by and large a comedy, it was a delightful one and one that still lingers in my thoughts which is obviously why I decided to do a review. Comedies, when they are perfectly made, deserve 10's.<br><br>This is a 10 and one of the most thought provoking and beautiful comedies ever made. I am sure there are many growing up now, whole hosts of people, who have yet to discover this and I hope they do, particularly those who are fans of Bruce Almighty and are not aware of this wonderful movie from the 70's. <br><br>And not being a sequel person, I was a bit surprised that the sequel to this was just as good. My vote is 10 of 10 for excellent.","user":"triple8","rank":[26,31]}]