[{"title":"Iconoclastic sixties merriment","rating":8,"date":"8 October 2002","review":"I did have high expectations going into this film, being a fan of Cook and Moore through what is available of \"Not Only But Also\", and several other Cook projects like the superb collaboration with Chris Morris, \"Why Bother?\" The expectations were largely fulfilled when I got to see this film, via a rare showing on Channel 4 this last April, as a tribute to Dudley Moore. The remake with Liz Hurley in place of Cook (how crass and thoughtless a piece of casting? They should really have discarded the title \"Bedazzled\" and just made it a Faust update, and not made any association with the Pete n' Dud film) is of course an irrelevance, and it is truly emblematic of our culture that it has received so many more IMDb votes than this original.<br><br>This film succeeds where \"The Hound of the Baskervilles\", a later Cook-Moore vehicle, abysmally fails. \"Bedazzled\" contains the essence of their comedic appeal, rooted as it is in errant taboo-breaking and gleeful absurdism. The strong guiding influence of Cook is in the script, which he had strong control over, by all accounts. The concept is a modern spin on the Faustian legend, based in 1960s London (amongst diversions!). \"Bedazzled\", with this scenario and its effective portrayal, is thus most winning when compared to both concept and execution in \"The Hound of the Baskervilles\"' lamentable case.<br><br>We have Pete n' Dud centre stage, and both at their comedic peak. Moore as a hapless, beleaguered little chap, and Cook as a matter-of-fact, mischievous, cunning and charming devil. A devil called Mr George Spiggott, bizarrely! :-) The other turns are good, and merely complementary, with the various sins portrayed pretty well. Eleanor Bron is reasonable as the malleable (according to the wishes) but essentially quite undeveloped love interest of Moore's. Not that this particularly matters in a comedy such as this; and her hair is eye catching. :-)<br><br>The brazenly literal cameo from Raquel Welch is something of a scream I must say; no pretence at her being anything else, which I presume there has been in other Welch movies of the period.<br><br>The various segments in this episodic film, are perhaps variable in their quality, but none are poor. The episodic nature of the film really does work in its favour keeping it fresh, but having the wonderful London linking sequences the heart of the film. It gets most amusing as Cook's devil repeatedly outwits Moore and finds loopholes in his wishes to downright exploit. The \"happy family and home life\" wish is really quite bizarre and almost disturbing in its oddness, while maybe the \"rich\" one slightly overdoes Bron's bumptious ultra-sexuality, even if the whole segment works very well. The \"leaping nuns\" part is prime \"Not Only But Also\" in its hushed absurdity and is a joy. The art direction and music aspects are notably good, embellishing the film and drawing out its sixties context. This film has not and can not date, as it is all so tastefully achieved and its technical grasp never exceeds its reach.<br><br>The whole film I feel, works excellently, with dashes of irony and an effective restating of the Faustian morals. There is an engaging melancholy to this film, below its comedic surface. The scene of the old woman being fobbed off by Cook is briefly poignant and suggestive of a whole society's delusion. The scenes as Cook effectively knocks on the door of Heaven feel slightly sombre to me, as well as oddly comic. There are some quite thoughtful scenes of dialogue as well, with the droll Cook in his element, perched atop a postbox. Of course, the depressing outcomes of each wish for Moore's character, only add to the slightly prickly, problematic mood that underlies the film. The whole thing ends on a very apposite note, I should add with a glint in my eye.<br><br>I loved watching this film, and while I doubt it could quite be labelled a fully-formed \"masterpiece\", it is a startlingly good evocation of the 1960s in a way... and also very much an amusing, clever comedy, with the subversive spirit of Peter Cook stamped all over it.","user":"HenryHextonEsq","rank":[45,50]},{"title":"A clever and classy treat","rating":13,"date":"13 April 2002","review":"\"Bedazzled\", mainly because it's not available on DVD (and even VHS in the UK), has become something of a cult in recent years. This is also due to the simple fact that its a very good film, a very mannered and well-crafted high concept flick.<br><br>Dudley Moore and Peter Cook were still friends in 1967. They were two of British TV's most feted stars, and had also enthusiastically appeared together in a few ensemble comedy films. They were no slouches when it came to their first feature either. Stanley Donen was brought in a director, Cook toiled over the witty script, Moore did the perky score.<br><br>\"Bedazzled\" is slightly dated and is quite an uncommercial product overall, but its still a clever and interesting film. It doesnt deliver bellylaughs, but it is pretty thought-provoking and intelligent. There's funny one-liners (\"Yes, Irving Moses-the fruitier etc), totally original ideas (the animated fly sequence, Raquel Welsh as Lust), slapstick stuff and a top pop parody with Cook as the indifferent \"Drimble Wedge\".<br><br>The pathos and sadness underpinning the movie is perhaps best summed up with the conned old lady's \"Goodbye\" as the Eyewash men leave. \"Bedazzled\" is very British and very 60s, but it still a well-made and well-acted fantasy, much better than the silly 2000 remake.","user":"mathewshires","rank":[37,43]},{"title":"I'm The Horned One, The Devil, Let Me Give You My Card","rating":8,"date":"31 December 2004","review":"Cooke and Moore were possibly the finest comedians the UK has ever produced before Python and others followed Pete and Dud were the undisputed kings of the new cutting edge of comedy/satire in the UK.<br><br>But always just under the surface (and later out in the open) there was a sadness and dis-satisfaction to both Peter Cooke and Dudley Moore and I think some of that shows up in this film. Think of the old lady taken for all her money by the Devil and the cheery goodbye she still manages. Also part of the film seems to be dealing with the moral flexibility of people given their circumstance.<br><br>Stanley Moon (Moore) has limited opportunities as a short order cook all he desires is the love of Margaret one of the waitresses at the Wimpy he works in. But he is a good person, when after a botched suicide attempt he sells his soul to the devil (Cooke) he has all the opportunities in the world but it is easier for the devil to corrupt him.<br><br>Throughout the seven wishes (in accordance with 7 the mystic number, 7 days of the week, 7 deadly sins, 7 brides for 7 brothers..)Stanley can only think of his own needs and perhaps this is why they fail to make him happy. On his one opportunity to give a wish away to stop one of the devils petty tricks (sending a swarm of bee's to harass some flower children) he refuses saying 'Their mine and iv'e only got four left!' The other main theme of this film is more to the forefront dealing with Cooke and Moores attitudes towards religion and it's place in what at the time was the modern world. People were beginning to come away from the church and for the first time non-believers were becoming the majority. Part of the film lampoons religion particularly the bouncing nuns, but at the end it's god who wins out over the devil all be it by a technicality. In a way they showed the obvious contradictions and flaws in the Christian faith - religion nice idea but surely it cant be that way? If all of the above makes this film sound heavy going be assured it's not, and where as in others hands it may have become a pretentious mess it becomes a light hearted very funny comedy romp. If you just want a laugh on a Saturday night this will provide it, if you want to look deeper in and start divining meaning from every little aspect you can it's that sort of film.<br><br>Highly recommended 9/10 NOTE - AVOID THE REMAKE LIKE THE PLAGUE IT'S Awful","user":"no-skyline","rank":[35,41]}]