[{"title":"dark memories","rating":7,"date":"30 April 2011","review":"If you're expecting a typical slasher, you'll be disappointed. Frank LaLoggia's \"Lady in White\" is a more subtle horror flick, with limited violence and no sex or nudity. It depicts a boy who witnesses an apparition of a murder and then tries to find out what happened. The movie makes a lot of use of shadows to elicit its horror, and the answer to the mystery slowly but surely evolves. Moreover, it's also interesting to see a horror movie seen from the eyes of a child, as opposed to horny teenagers. Of course, there's no shortage of comic relief, especially from the boy's grandparents. This movie isn't any kind of masterpiece, but I still enjoyed it.<br><br>Starring Lukas Haas (the Amish boy in \"Witness\"), Len Cariou, Alex Rocco (Moe Greene in \"The Godfather\") and Katherine Helmond.","user":"lee_eisenberg","rank":[11,11]},{"title":"Decent","rating":6,"date":"27 July 2006","review":"I was able to see Lady in White today on TV. At first I was just mildly interested in what I believed to be a kids movie. Once I realized this film was no children's film, I was sucked right in.<br><br>Frankie is a young, smart child of an Italian family in the town of Willowpoint Falls. He has a great imagination and is able to express it on Halloween while in school. Afterwards however, Frankie is locked into the school's coat room for the night by two bullies and witnesses something remarkable. He witnesses the ghost of a little girl being killed by the hands of an unknown man 10 years prior. The ghost begins to follow Frankie and he sort of befriends her as he attempts to discover who killed the little girl and 10 other children in the town. <br><br>Lukas Haas is exceptional in the lead role of Frankie. He is sweet, fun-loving, and extremely enjoyable to watch on the screen. Haas does a fine job in his portrayal of the haunted boy and brings out his character quite easily. Alex Rocco also does quite well in his supporting role of Frankie's father. You are able to tell, even without it being talked about, that he is a good, kind man and father. That he is always looking out for his sons with the loss of his wife. Rocco shows his acting ability well.<br><br>Originally I thought this film to be a children's film and was quite convinced it was until I saw the coat room sequence. The acting of the little girl as she is killed by the invisible force is shocking and terrifying. I was truly frightened by the scene and knew it was no longer a children's film. My only complaint, which is a large one, is the lack of emphasis on the Lady in White. SHe is barely shown the whole film and it confused me slightly why they named the film after her.<br><br>Age does show on this film with the cheesy special effects. However the story is able to overthrow the poor special effects. The acting is solid, the story is well thought out and the characters are quite enjoyable to watch. <br><br>3 out of 5 Stars","user":"mOVIemAN56","rank":[28,34]},{"title":"I enjoy this movie every time I watch it!","rating":10,"date":"7 February 2008","review":"I just don't know what it is but this movie is like an \"Old Friend\" to my older sister and I. We always watch it together and now my 6 1/2 yr old watches it with us. I think because it's \"scary,but not too scary\" and YES we always end up singing that song for day's after we watch it.<br><br>When ever we ask people \"have you seen this movie\" they are alway glad we told them about it..it's one of those movies you either never heard of, or never thought to watch and once you do your glad you did.<br><br>I love the Halloween theme and the \"Little Sleepy Town\" feeling you get in this movie. Grandma &amp; Grandpa are by far my favorite's in this film, There is such a \"Loving Closeness\" between them.<br><br>It's just a good \"anytime\" movie.","user":"paradisegirl1966","rank":[22,28]}]