[{"title":"Without a doubt THE most underrated Hammer movie! I wholeheartedly recommend 'Captain Kronos: Vampire Hunter' to every horror fan.","rating":5,"date":"5 July 2004","review":"I'm a big Hammer fan and have been wanting to see 'Captain Kronos: Vampire Hunter' for a long, long time. Now finally I own it on DVD and after watching it four times I think it could very well be my favourite from the studio. It's definitely without a doubt THE most underrated Hammer movie. It did poorly at the box office but it now has one of the most enthusiastic cult followings of any Hammer film. Quentin Tarantino is reportedly a big fan of this movie and seeing how it inventively draws upon several genres (e.g. Westerns) it's really no surprise. Hammer's long running Dracula franchise was running out of steam by the early 70s, and they were looking for a new series. Enter Brian Clemens of 'The Avengers' fame, who had previously written 'Dr. Jekyll And Sister Hyde' for the studio. He came up with some innovative ideas and he thought that this would be the first of many movies to feature the Captain Kronos character. Sadly it wasn't to be, and attempts to spin off a TV series also fell through. Watching it thirty years later I just can't understand why! Anyway, German actor Horst Janson plays Captain Kronos, the enigmatic, sword wielding, dope smoking action hero, and John Cater ('The Abominable Dr. Phibes') is his hunchback assistant Professor Grost. These are two fantastic characters, and I would love to have seen further adventures by them! Horror buffs will also get a kick out of the rest of the cast. The gorgeous Caroline Munro ('Maniac') is a gypsy girl who falls for Kronos, John Carson ('The Plague Of The Zombies') is Kronos' old doctor buddy, Shane Briant ('Frankenstein And The Monster From Hell') is a local young gentleman, and Wanda Ventham (Colonel Virginia Lake in the cult series 'UFO') plays Briant's invalid mother Lady Durward. On top of that there's a fantastic cameo by Ian Hendry ('Repulsion', 'Theatre Of Blood'). Hendry had been one of the original stars of 'The Avengers' playing John Steed's first partner in the little seen early episodes. A hard drinker, his career eventually suffered because of his vices, but he is terrific confronting Kronos in one of the best scenes of the movie. I really find it hard to fault this film. I think it's a forgotten horror classic, and why anyone would even bother contemplating watching the likes of 'Blade' or 'Van Helsing' when 'Captain Kronos: Vampire Hunter' is sitting on the shelf waiting to be rediscovered is beyond me! I wholeheartedly recommend this movie to every horror fan. I can't see how any fan of the genre couldn't help but love this unfairly overlooked Hammer gem!","user":"Infofreak","rank":[51,55]},{"title":"A Different, Inventive Kind Of Vampire Film","rating":8,"date":"22 June 2008","review":"I've only seen a couple of Hammer horror films, but I'm impressed. They seem to be subtly effective if you're looking for a few thrills and chills, not overdoing the gore, being mild on the language but yet having a definite edge to them. <br><br>\"Captain Kronos\" isn't super but it's enjoyable. The direction is excellent, the DVD transfer looked nice, and - like a good mystery - there's a good twist at the end regarding the murderer, er.....vampire. For us guys, there are also a lot of pretty women in here, too. The acting isn't the best but who cares? It's entertaining, and not made to be taken seriously.<br><br>I enjoyed the team of \"Captain Kronos and Professor Hieronymous-Grost,\" and I'm surprised there wasn't a sequel. These two guys make a good team: Horst Janson as the younger, dashing swordsman, and John Cater as the older assistant. The latter provides a little comic relief, too. Their relationship reminded me a bit of Basil Rathbone and Nigel Bruce at \"Holmes and Watson.\" <br><br>The good captain is not your normal vampire hunter. He's just as anxious to get it on with the ladies, and he has a sexy one for a partner in Caroline Munro as \"Carla.\" Kronos also smokes \"herbal\" cigars! The brief touches of comedy, western, swashbuckling, horror, mystery, romance, sex, supernatural, and who-knows-what else all make it an inventive and fun hour-and-a-half. Hey, it even gives God several good plugs! This horror movie is different, all right.","user":"ccthemovieman-1","rank":[27,29]},{"title":"The Swashbuckling Vampire Moie","rating":9,"date":"14 May 2005","review":"Captain Kronos (Horst Janson)is a retired officer from the Imperial Army. He is handsome, debonair and has an eye for the ladies but his full-time job sees him seeking out and destroying Vampires with the assistance of his sidekick Professor Hieronymos Grost(John Cater)(now where have I heard that name before).Grost is a hunchback and an expert on the different types of Vampire and how to seek and destroy each different kind, for we learn there are many types. On the way to assist a former army buddy of his Dr Marcus(John Carson),Kronos frees the lovely Carla (Caroline Munro)from bondage and she joins our heroes on their quest to rid the world of evil. On arriving at the home of Dr Marcus, his old friend tells him of the blight that has been affecting the area namely Young girls are being found dead with blood on their lips but more importantly they have aged rapidly. Grost is immediately able to tell which kind of Vampires they are dealing with they are the kind that needs blood of youth to stay young themselves,so Grost sets out a plan to find them. Some thugs are hired by an unknown man in a local Inn to get rid of Kronos and his associates but they are no match for our swashbuckling hero and are soon dispatched without Kronos learning who the thugs employers were. There are unfortunately no witnesses who can describe or point a finger at the guilty parties but Kronos believes that the Durwood Family(real name Karnstein) is somehow involved and so sets about luring them into his trap. <br><br>Review:Captain Kronos:Vampire Hunter is a very unusual entry in the Hammer Canon. Director/Scriptwriter Brian Clemens film is full of interesting and original ideas which he brings to screen with an assured confidence. The Hooded figure that lurks in the leafy glades and stalks the local wenches is done very well and the identity is never given away until the end.The shadow of a crucifix that comes to life in a church is also a high point. The film is also quite funny with some very good witty dialogue that helps the film move along at a fair old pace. Kronos is a also not scarce on action and contains a good few Excellent action set pieces. Captain Kronos:Vampire Hunter was initially planned to be Hammer's next big franchise but sadly poor box office put an end to that which is a huge shame as it is truly a classic of 70s Horror and a film that all Hammer enthusiasts should see.","user":"Prof-Hieronymos-Grost","rank":[30,35]}]