[{"title":"This is a pretty comedy/horror movie!","rating":6,"date":"22 September 2006","review":"I have to give this movie a 6/10 because this is a very decent film that deserves praise. I don't know why so many people hate it. For one the little evil character, Troll, has a personality. The kids have personality as well and they're not some stupid one-sided characters. There are funny jokes inserted in the dialogue and the people who occupy the apartment are funny too. Unlike some movies from the same era this one actually has pretty good special effects that are pretty scary too. Just wait till you see a guy turn into a bunch of plants! Thats gross, but its also good effects. Check this movie out and remember it has nothing to do with the really crappy movie Troll 2.","user":"vortexrider","rank":[22,24]},{"title":"The origins of Harry Potter...whether you like it or not","rating":7,"date":"4 April 2015","review":"This is one of the best of the 1980's Empire Pictures movies by Charles Band to grace the VHS and cable TV generation of that time. As campy, goofy and downright fantastical as that era has to offer, this combines elements of witches, magicians and mystical forests with the eccentricities of a downtown New York apartment and its out-of-the-ordinary tenants. <br><br>Harry Potter Jr. (obviously an inspiration for J.K Rowling's groundbreaking novels) is a young boy that just moved into said apartment building with dad (Michael Moriarty in his usual crazy role). Apparently, Potter's younger sister is possessed by the \"Troll\", Torok, who is actually a cursed warlock that is trying to create a fantasy garden environment of elves and creatures out of the apartment and its tenants, all with the power of a magical ring. As the disappearances of the occupants grows, Harry befriends Eunice St. Claire, who is actually an ex-princess turned good witch that was once acquainted with the evil Torok. Now, young Harry Potter must team up with St. Claire to save his sister and the world as we know it from Torok and his sinister plan.<br><br>This is your typical 80's cheesy movie weirdness from Empire Pictures who's rubbery creature effects mimic the \"Ghoulies\" films, but is on a completely different level, incorporating many comedic elements along with charming, funny characters, fairy-like worlds and an exciting climax involving the young Harry Potter Jr., the fair-haired maiden and the Princess. This little movie embedded itself into history not only with the \"Harry Potter\" aspect, but its delightfully energetic performances from June Lockhart (Lost In Space), Julia-Louis Dreyfuss (Seinfeld), Moriarty, and not to mention Sonny Bono's transformation into a giant green sprouting turd. Enjoy it for what it is, a mixture of Tolken-like themes and the type fantasy-adventure cheesiness that put film-making of the 1980's in a class by itself.","user":"kclipper","rank":[16,17]},{"title":"Watch as a creature systematically takes over an apartment complex.","rating":6,"date":"11 February 2004","review":"I rather liked this one a bit, though I can see from its score that I am in the minority in my opinion.  Though at least most can agree this one is a lot better than the sequel.  This movie has a family moving into a new apartment complex.  Very quickly the little girl is taken by the title character and he takes her place.  Throughout the movie the troll disguised as the little girl moves from one apartment to the next turning each room into a seemingly new dimension or something.  The girl's brother has his suspicious and teams with this old woman to figure things out.  The old woman seems to know a lot and she looks a lot better with her hair down. Soon the entire apartment becomes part of this world the troll is creating and the boy must finish it off because the old lady just is not in the position to help at the end.  Rather fanciful and interesting...nothing to take to seriously, but I thought it was a rather good story and movie.","user":"Aaron1375","rank":[24,30]}]