[{"title":"A self-indictment.","rating":9,"date":"24 May 2006","review":"All that Jazz is a great film that almost seems to have dropped off the radar screen of classic musicals. The film gives us the account of a choreographer named Joe Gideon (Scheider) whose relentless way of living drives him straight into the grave. The character is based on the real life of director Bob Fosse who suffered the same fate in 1987. Gideon is a womanizing, drug abusing, perfectionist who begins each morning with the same routine. He pops a few pills, takes some Alka-Seltzer, jumps in the shower (sometimes with a cigarette in his mouth!), and declares it's \"showtime\" after giving himself one last look in the mirror. When we meet him, he's currently putting the finishing touches on a film he's just directed, and he's beginning work on a new Broadway musical. The man looks absolutely exhausted. He's always smoking. He seems on the brink of collapse from angina, and he frequently grasps his left arm apparently in an effort to determine if his heart is still beating or not.<br><br>The main idea behind this film is that Gideon knows he's dying. The life he has lived has assured him only a brief stay on this earth. As the film plays out, we see how Gideon comes to grips with his impending fate. His final journey is often touching; sometimes joyful. But above all, it is compelling and once it's over, you'll probably wish Gideon had hung on longer. He seemed to have so much to live for. Even the people around him who he's hurt in life (his ex-wife and current girlfriend, for example) still are a big part of his life. He has a wonderful daughter who he's just getting to know, as well. Without him around, there would certainly be an enormous void left for all of the central characters in this film. We see him confess his life's sins to Jessica Lange who plays an angel waiting to usher him into the afterlife once he finally succumbs to his medical problems. The closer the two of them get, the closer he is to the grave.<br><br>Fosse's direction is exceptional. His musical numbers (particularly Airotica) are top-drawer as you'd expect them to be. And he's never afraid to shock you with his camera-work. At one point we get an up-close and personal look at Gideon's heart surgery, and that's a bit grotesque for a musical. Remember this is the same director that showed us Dorothy Stratton's face getting blown off with a shotgun in Star 80.<br><br>Fosse also understandably knows these characters better that they know themselves. By the end of the film, you really know Joe Gideon, and you feel like you've lived part of his life. Fosse saw the same fate coming to himself, and indeed it found him in 1987. We often wish exceptional individuals would stick around longer, but then again it's the way they live that makes them so exceptional.<br><br>This film is highly recommended. 9 of 10 stars.<br><br>The Hound.","user":"TOMASBBloodhound","rank":[39,42]},{"title":"Beyond Brilliant (and I hate musicals!)","rating":10,"date":"19 June 2006","review":"Read my review of \"Newsies\" if you want my opinion of the musical genre. People just don't break into song-and-dance numbers in the course of their daily lives. Unless they are Bob Fosse, when suddenly doing so not only makes sense, but makes you wonder how we can go through life NOT singing and dancing.<br><br>What this movie is, is simple: Bob Fosse unveiling his life, his knowledge, and a detailed explanation of his creative process, for future generations to evolve. This film is part biography, part self-exploration, and part legacy. It is the \"legacy\" part that is overlooked by almost everyone. If you ever dreamed of becoming a choreographer, this is the ideal place to start, because you'll watch, over and over, as Joe Gideon (Roy Schieder as the fictionalized Fosse) puts his stamp on a dance number, a process so unique and brilliant that it could easily be classified as its own form of dance rather than a subset of modern dance. If three words could sum up Fosse's style of choreography it would be \"make it sexier.\" Then make it even sexier. Then, when you're done, you need to make it even sexier. The \"Airotica\" number exemplifies this, and served as the inspiration for Paula Abdul's \"Cold Hearted\" video.<br><br>The movie brings Fosse's inner circle and personal life to the screen, pulling absolutely no punches. Some call this film a form of narcissism, but it's hard to see how a man looking for self-given glory would portray himself falling apart physically and personally, the years obviously having taken a toll, as well as the emotional baggage that comes with abandoning family life (and a brilliantly played daughter by Erzsebet Foldi, in what would be her only film before she retired) for a girlfriend with some side dishes for variety. The women hate Gideon's infidelity, but love the man so dearly they know not to question or challenge it.<br><br>Throughout the film, we are treated to vignettes that comprise the mosaic that is the life of Fosse. Metaphors abound, and the music blends effortlessly into a film that can make two hours seem like two minutes. This is not a film that could have been written and will not be enjoyed by those of simple intellects. So much of the plot exists in the abstract, and it is up to the viewer to find what is often an incredibly subtle symbolism. Simply put, this is a well-constructed film. Fosse's ex-wife and dance protégé, Ann Reinking, auditioned for (!) and won the part based on her, while the supporting cast includes many solid names, even a young John Lithgow as Lucas. Fosse's daughter makes a cameo in the film, as does the film editor. The comedian who appears as the subject of a movie is based on Lenny, a previous Fosse film.<br><br>Joe Gideon is what everyone should be no matter what they do: someone who doesn't copy others, but develops their own vision and then methodically, sometimes maniacally, makes it happen. He lives in the moment, and squeezes everything he can out of each moment. This is evidenced by Gideon's brilliant work, but also by his rapidly deteriorating health caused by living in the party moments as well as the serious ones.<br><br>The ending number is for the ages, putting a spin on the sappy endings that musicals are famous for.<br><br>Your life is lacking until you have seen this film. That it did not win the Best Picture Oscar for its year was an absolute tragedy. It is one of the five best films of all time.","user":"ray-280","rank":[33,36]},{"title":"Brilliant summary of director/Co-writer Fosse's decent into show biz madness and death","rating":19,"date":"19 August 2003","review":"Fosse's ALL THAT JAZZ has been mistaken for a rip-off of Fellini's 8 1/2 for some time. But that is giving it short shrift as an illuminating, sobering account of one man's burnout in the face of enormous pressure from the elements of the entertainment industry which he's involved himself in, namely Broadway and the film industry. Based on Fosse's experiences directing CHICAGO on Broadway and LENNY for United Artists, it stars Roy Scheider as Fosse's always black-dressed alter ego Joe Gideon, who's long road to success has been dotted with drug addictions, one-night stands, betrayals, and show biz phoniness.<br><br>Particularly of interest in this film is the strong autobiographical quality of it. Fosse did, indeed, suffer his first heart attack during this 1973/74 period of his life. The film-within-the-film, \"The Stand Up,\" is an interesting variation on LENNY (1974, with Dustin Hoffman and Valerie Perrine)---much more irritating than that movie. LENNY ended up getting great reviews, for the most part, but it must have been a tough movie for Fosse to get his hands around, especially while dealing with his failed marriage to Broadway star Gwen Verdon (portrayed here by Leland Palmer). It's certainly portrayed as such in this film.  And Chicago seems to have been a challenge for him, too.  He obviously thought the original script for that show was lacking (as he actually went on record as saying) and that he had to spice it up for him to become interested in it.   (How fascinating would a Fosse film version of CHICAGO have been?   As it was, it looks as if eventual CHICAGO director Rob Marshall screened ALL THAT JAZZ many times in order to mine its many storytelling treasures, including the main conceit that most of the film's musical numbers appear in the minds of the main characters.)<br><br>Scheider has never been better and deserved real consideration as that year's Best Actor Oscar-winner (he lost, ironically, to Dustin Hoffman who won for KRAMER VS. KRAMER).  He is positively channeling his director's personality, down to his constant cigarette smoking and his artsy goatee (not to mention his snaky, rakish attitudes towards personality responsibility).  The fine cast also includes: John Lithgow as a rival Broadway director who may or may not take over Joe's show if he dies on the operating table; Max Wright (the dad on ALF) as the producer of Gideon's film; Sandahl Bergman (from CONAN and RED SONJA) as the lead dancer in the \"Take Off With Us\" musical number that disappoints the stage show's backers; longtime Fosse girlfriend and dancer Ann Reinking as Gideon's other serious bedmate; Cliff Gorman as Davis Newman, the lead actor in \"The Stand Up\"; the lovely Erezebet Foldi as Gideon's precocious daughter (Fosse's real daughter, Nicole, later appeared in the film version of A CHORUS LINE); Jessica Lange in her first serious role as the Angel of Death; Keith Gordon (an actor in CHRISTINE and BACK TO SCHOOL, who's now an acclaimed director of films like MOTHER NIGHT and the 2003 film adaptation of THE SINGING DETECTIVE) as the young Joe Gideon; Ben Vereen, energetic as a show-biz veteran who \"hosts\" Gideon's final decent into death. The list goes on and on....<br><br>And the tech credits are superb. The film won Oscars for its Tony Walton sets (Tony Walton has been married to Julie Andrews for years, and is an acclaimed stage and film set designer), its Alan Heim editing (Heim worked on NETWORK, among other things), its Ralph Burns scoring (which includes old jazz, classical, pop, and Broadway standards), and its Albert Wolsky costumes. Its photography, by Giuseppe Rotunno, is also great (Rotunno phtographed many Fellini films and probably had much to do with the lumping of Fosse's film in with Fellini's work).<br><br>Tying in 1979 with APOCOLYPSE NOW for Cannes Palme D'Or, this is one of the greatest movies ever made, I think, and you'll know that once the first moments--a mass stage audition unbelievably well-edited to the tune of George Benson's version of \"On Broadway\"--unreel in front of you. It's an unflinching look into the madness of one artist that, eventually, became his undoing (Fosse died in 1986, in his early 60s, of another heart attack, after completing only one more movie, STAR 80, and one more stage show, BIG DEAL).  See it and prepare to be moved in strange ways.","user":"dean237","rank":[78,96]}]