[{"title":"So weird, so bad, that it's a beautiful thing. Don't miss it.","rating":9,"date":"15 October 2005","review":"How can I begin to describe this amazing film? Random images pop into my head from memory... Tony Curtis as a dashing fortune-teller and huckster, prancing around his San Francisco bachelor pad wearing a sorcerer's outfit... one of his elderly female clients being possessed by an Indian spirit and being tossed down a flight of stairs... (you don't even need the pause button to see that the stunt \"double\" going down the stairs is a big dude in a dress and wig!!)... Burgess Meredith muddling through one of his last film roles, playing a senile old coot with amazing realism, to no one's surprise... an Indian shaman with a Yiddish-sounding New York City accent and a penchant for stale one-liners... a naked midget dressed up like an evil reincarnated Indian fetus covered with goo... a topless Susan Strassberg hovering in the fourth dimension and firing lightning bolts at the evil spirit using electrical energy from a huge 70's-model computer... YOU MUST SEE THIS FILM!!","user":"russmofo","rank":[49,59]},{"title":"Absurdist Fun","rating":14,"date":"14 June 2001","review":"While I must agree with many of the reveiewers of this film that say it is preposterous, silly, laughable, and the like, I must also add that watching the film is an entertaining experience.  Yes, the story about a fetus growing on a woman's back and then becoming a four foot Indian ripping his way out of a tumor the size of basketball stretches the line of credibility. This pint-sized spirit has amazing powers as he can literally freeze an entire hospital ward, call forth the devil himself, and take the skin off of people's bodies through his mind.  The most ridiculous aspects of the film, however, are the explanation and execution of how to fight the manitou. Apparently all things in life have their own manitou, so we see this incredibly powerful spirit temporarily beaten when Tony Curtis throws a typewriter at him.  We are to believe the spirit of the machine harmed this powerful spirit.  Yeah, okay.  The special effects are very outdated and some of those will just make you burst out laughing.  The scene where Tony Curtis(the former boyfriend of the girl with the shoulder-weilding fetus/pint-sized Indian spirit) and Michael Ansara(playing John Singing Rock or something like that who just happens to be an Indian medicine man ready, able, and willing to do battle with the most powerful Indian medicine man's spirit that ever lived...and this one apparently has ripped through the shoulders or bellies of five previous people) walk into the hospital room and see what I guess is suppose to be space will have you slapping your knee.  But the very worst scene has to be the finale which I will not explain in great detail.  Suffice it to say that Susan Strasberg(the poor woman aforementioned) is sitting up on a bed topless..., yes, you heard me, TOPLESS, throwing ele trical current from her fingers as she battles the manitou.  It has to be seen to be believed.  The acting in the film is not very good, but again very likable.  Curtis plays a mystic and some of his scenes are good in the beginning.  Ansara is ok, and Burgess Meredith gives the best performance in his five minute cameo.  The little Indian who could was played much of the time by Felix Silla, the same fella that played Cousin It on The Addams Family and has appeared in countless horr/science fiction films.","user":"BaronBl00d","rank":[30,35]},{"title":"Well, I liked it a lot!!","rating":9,"date":"10 March 2007","review":"I saw this when it first came out in the theatres, with my sister---we loved it and were blown away!! I've since owned it on VHS, and now have the wonderful DVD that was just released. Honestly, given the year it was made and such, it's not a bad film at all, and is one I regularly watch!! Sure, it's a preposterous story, and the effects come off a little dated, but I thought the ensemble acting was great---loved seeing Ann Southern, Stella Stevens, Susan Strasburg, Tony Curtis Et Al tackling this unique idea for a horror film. I thought many, many scenes were intense (the séance scene is a highlight!), and loved how William Girdler interpreted the story. I actually rate this very high, and only ding it because of the slightly dated effects. \"Hamlet\", it ain't , but it's a very enjoyable horror-romp for the evening, perfect popcorn fodder!","user":"raymond-x-jacobsen","rank":[25,29]}]