[{"title":"Ahead Of It's Time...","rating":9,"date":"27 June 2006","review":"Many people have the wrong impression of this movie. Most group it in within the \"cop/buddy\" genre and cheesy sci-fi. But \"Alien Nation\" is much more than that. In fact, it was way ahead of it's time.<br><br>I saw this movie in a dimly-lit, run-down Detroit-area theater at the age 14, an afternoon in the fall of 1988. I recall how the \"atmosphere\" of the movie matched that of the run-down theater I was sitting in. At 14, and with the title of \"Alien Nation\", a young kid like myself wanted to see weird alien creatures and lots of action. At the time, I was disappointed. This movie is about story, not action or weird aliens. Although I didn't really understand nor enjoy the movie at the time, it always stuck with me for some reason. So, nearly 18 years after seeing it on the silver screen, I re-watched it at home and was amazed by the depth of the story and the grittiness of the background. It was little wonder why I didn't like it at 14, but loved it at 32.<br><br>This story is really about race and immigration, with the hated race being alien immigrants. It shows how hatred and ignorance over race can transform one's personality, like the lead character played by James Caan.<br><br>Alien Nation asks questions about ourselves as humans. How would we react if aliens landed on Earth and announced they were escaping a brutal planet full of slavery and have immigrated to Earth? Would we accept them as our own, or would we force them to become outcasts? Would we allow an \"Affirmative Action\" scenario in regards to Aliens and Alien rights? Would we offer them high-paying jobs and/or top-notch education, depriving humans of those same jobs and quality education in exchange? To me, Alien Nation is one of the more possible (and perhaps likely) scenarios. Aliens delegated to run-down areas of big cities. Token jobs occasionally handed out because it's forced by the Government to do so. And a general disgust towards Aliens amongst the human population. In that regard, this movie was way ahead of the curve.<br><br>Great movie. 9 out of 10 stars. Recommended for those over 25, perhaps those with a higher intellect than most. Not recommended for someone looking for a \"Men In Black\" type of Alien movie. Not your typical Hollywood blockbuster filled with Aliens, that's for sure.<br><br>IMDb ROCKS!<br><br>JD","user":"jcdugger","rank":[44,48]},{"title":"Decent science fiction","rating":7,"date":"3 June 2001","review":"This is the film that inspired the excellent television show and the many specials that followed its cancellation. This film has good performances by James Cann and mandy Patinkin, that elevate it above the norm. It is a combination buddy film, crime drama and science fiction story. Surprisingly it comes together very well. This film is not the best of the genre, some of the television shows surpass it, yet it worth a watch.","user":"hatesdragons","rank":[12,12]},{"title":"Well made Sci-Fi","rating":7,"date":"19 October 2005","review":"Alien Nation is a cross over between Sci-Fi and the 'buddy cop' genre. What separates this from the usual buddy film is that instead of the difference being ethnic/class/gender, it is human (James Caan) and alien (Mandy Patinkin).<br><br>The clichéd beginning with the main character's partner being killed is done very well with stylish gunplay and set pieces. Caan really shines in the action scenes and it is great to see him in such a tough guy role. Caan is a great actor and can do more than macho as he shows in the scenes involving his daughter when Caan displays remorse, making the audience feel more sympathetic towards him. Caan aside, the cast is fairly mediocre, full of average actors except Terrence Stamp who puts on a good show as the bad guy.<br><br>Something I loved about this film is how similar everything is to The Terminator. This is due to the film being produced by Gale Ann Hurd and there being other members of the Terminator crew present. Like Terminator, Alien Nation greatly benefits from the dark, murky feel of the environment, giving it an edge over a lot of Sci-Fi films which suffer from being too 'shiny'.<br><br>The film does a great job at exploring racism, giving the impression of time repeating itself regarding the Western civilisations treatment of blacks when they were forced in to the country. Caan's conversion from despising the \"Newcomers\" to accepting them is admirable and convincing. It is not an overnight change and it is done discretely, very convincing.<br><br>As with a lot of escapism films, you can not take Alien Nation too seriously so it is best to approach this film with an open mind and desire to be entertained rather than wishing to be introspective. A very well made, enjoyable film.","user":"Lt_Coffey_182","rank":[34,41]}]