[{"title":"0/10. Bring me the head of Marquis de Sade.","rating":1,"date":"29 March 2020","review":"Heard a lot since my teen days.\nFinally saw this trash aft much resistance in my head.\nFast forwarded most scenes.\nTerrible at all levels. This ain't no movie man.\nOnly followers of Anti-Christ will like n approve these kinda films.\nThis is for the third time i gave a movie zero. In fact I dont even consider this trash to be a movie.","user":"Fella_shibby","rank":[28,28]},{"title":"One of the most gruelling films ever made","rating":17,"date":"17 January 2005","review":"Pier Paolo Pasolini, as is well known, was murdered not long after he finished work on this, his most audacious and confrontational film, yet even the most casual viewing of SALO begs the question - had he not been murdered, would he have taken his own life anyway? Every sequence, every shot and practically every moment of this film is so burdened with despair, barely concealed rage and a towering disgust with the human race, one gets the impression that Pasolini was barely hanging onto life - and any attendant shreds of hope - by his fingernails. Although ostensibly an adaptation of one of DeSade's most depraved works channeled through the horrifying excesses of the Second World War with the Fascist ruling classes as its (authentically vile) villains, SALO also contains a lot of contemporary criticism - Pasolini hated the modern world, and explained the stomach-churning 'banquet of s**t' as a none-too-subtle attack on the encroaching global domination of the fast food chains. (The scenes of sexual excess can similarly be read as a despairing attack on the permissive society - those who come to SALO expecting titillation or B-movie sleaze will be sorely disappointed.) Beyond the nihilistic content, which has been well documented elsewhere, the film has an overall mood that seems to have been engineered to make the viewer thoroughly depressed. Shot on washed-out, faded film stock using primarily static cameras, long shots, choppy editing and very few cutaways, SALO has a visual style reminiscent of cinema-verite documentary. Add to this the unnerving use of big band music, piano dirges and the (intentionally?) scrappy post-dubbed dialogue, and the distancing effect on the viewer is complete. SALO comes across as one long primal scream of rage, designed to shake the viewer out of his complacency, and in this respect, the film succeeds unequivocally. Whether or not you would care to watch this more than once, or indeed for 'entertainment', is another matter, but SALO is an important film that demands a careful viewing ONLY by those prepared for it.","user":"world_of_weird","rank":[495,557]},{"title":"Don't judge this film too quickly.","rating":30,"date":"30 April 1999","review":"It appears most people find this movie to be sick, pointless, and without substance. That's unfair.<br><br>This is the strongest movie I've ever seen, and it made an IMPORTANT impression on me, a big horrorflick-devotee. It made me question a lot of things about former favourite films, and made me realize how sick it is to make horror and violence into entertainment. The problem with most movies is that violence is not portrayed violent enough, horror isn't portrayed horrible enough. Most 'thriller' films have these ingredients softened so that people can enjoy it, and THAT'S sick. This movie is SANE. It shows horror and violence as it IS - totally revolting and disgusting.<br><br>I sat as on needles for 1 hour 40 minutes, and felt really bad watching this film. It grossed me out, but I understood why this film is both good and important. It gives a sane perspective on violence, as opposed to SICK, SICK Hollywood-action where people get killed by 'heroes' and nobody raises an eyebrow.","user":"marcopop","rank":[908,1]}]