[{"title":"High Concept, CAA-style!","rating":7,"date":"24 August 2003","review":"Ivan Reitman, fresh off the special effects high of \"Ghostbusters\" takes on romantic comedy that works in fits and starts in \"LEGAL EAGLES\".<br><br>Robert Redford, with breezy style, is a NYC D.A. who prosecutes at whim. Enter Debra Winger, a scrappy lawyer so desperate, she once chose to put a dog on the stand to make her case. The two fall in love (or about as 80's as it gets - they become partners) in representing an airy client (Daryl Hannah) who may (or may not) have committed a major art fraud/crime. <br><br>This is a time-capsule of a film... written by the guys who wrote \"Top Gun\" and \"Dick Tracy\", it's a big, over-packaged film that's both romantic comedy, star-vehicle, and glossy, synthetic who-done-it. All the Reitman glitz-and-polish is there (with big setpieces scattered throughout), and the movie is easy on the eyes, especially with Redford's easy, casual performance pulling the viewer along and Reitman's deft comedic touch.<br><br>It was also a troubled production to be sure: Bill Murray was once considered for the Winger role, creating a love triangle that would have found Hannah torn between the Sundance Kid and Nick The Lounge Singer - but alas, Murray opted out. In interviews long since the film's release, Winger claims no desire ever to work with Reitman again. <br><br>1986's \"LEGAL EAGLES\" is probably the textbook case of the all-powerful talent agency known as Creative Artists Agency packaging a Real Motion Picture - what industry wags call a \"filmed-deal\". But is Legal Eagles any good? Sure, I guess. It's competently directed, it makes great use of it's New York City art-world locales, it has a wonderful Elmer Bernstein score, great cinematography by the legendary Laszlo Kovacs and both Winger and Hannah make for delicious eye-candy when pared with Redford. Ultimately, it becomes systematic of what was askew in these \"packages\": the movie relies solely on the audience goodwill, fine craftsmanship and former successes of its primary players to carry the load. \"LEGAL EAGLES\" is by no means a failure, but wrapped in such a glossy serving, it's hard to really enjoy anymore than for its quick, empty calories. <br><br>I have a soft spot for this film - it's great to see Redford on screen seeming to have such a spirited good time after an absence from movie comedy for a number of years - but after all is said and done, \"LEGAL EAGLES\" is as enjoyable as a Big Mac, albeit one served on a fine china dinner plate. <br><br>PS - the TV version of this film has a curious, bizarre alternate ending which negates the whole court case!","user":"britishdominion","rank":[25,32]},{"title":"Subtle in parts, lightweight and easy to watch","rating":10,"date":"24 May 2004","review":"You don't get actors like Redford and Winger anymore. The subtleties in their facial expressions, the humanness of their characters are evident in each move they make and each action. In a sense, there is no 'acting', since the storyline, the characters and the flow reach a natural confluence. The only character that makes me feel a bit uncomfortable is Daryl Hannah's Chelsea - the performance artist. Brian Dennehy is also a little underutilised, but the movie is really a swinger for both Winger and Redford who make their attraction and talent as attorneys believable.<br><br>I've seen this movie about 5 times over the years and I never get sick of it. Though I know the plot, each time I find myself watching the actors rather than predicting the storyline. Its just great and really, so easy to watch and enjoy. There is humour, old fashioned romance, good IL' bad guys vs good guys, a bit of blood and gore and a lot of fine art thrown in. I highly recommend it!","user":"indigitum","rank":[23,30]},{"title":"A fun mystery/romantic comedy.","rating":6,"date":"6 August 1999","review":"Full of plot holes and expensive excesses, LEGAL EAGLES wouldn't be much without the genuine star power it receives from it's first class cast.<br><br>Redford is very charming as the assistant D.A. whose becomes involved with defense lawyer Winger (terrific as always) to solve a case that includes arson, stolen paintings, insurance fraud, and even murder.<br><br>The chemistry between Redford and Winger is very much like Spencer and Tracy and is very enjoyable to watch.  However, Daryl Hannah steals the show as the slightly off center performance artist who is in the middle of the complex case.<br><br>The film's story will not hold up under much thought and the many shots of buildings on fire will only appeal to pyros.  Still, this film is fun entertainment and is a must-see if you are a fan of one of the three stars.<br><br>I'd rate this a good 6 out of 10.","user":"Del-Con","rank":[15,20]}]