[{"title":"A beautiful and truthful film","rating":10,"date":"16 August 2005","review":"This is Mike Leigh's finest film.<br><br>It's a shame, but inevitable given the climate of the film world, that he has become celebrated for lesser works such as \"Secrets And Lies\" and the odious \"Vera Drake\" which I found almost unwatchably patronising. By contrast, \"Meantime\" is the truth - as anyone who grew up in 80s London will recognise. It's the truth about what Thatcherism did to the working classes, and to human values in general in Britain. It is not by any means, however, a socialist diatribe. It is instead a gentle and touching portrait of lives ruined by forces beyond their control or comprehension. The film's anger at this injustice is all the more powerful and effective for its understatement. Leigh's other great film, \"Naked\", abandoned this gentleness for brutality and it suffers in comparison accordingly.<br><br>That film was saved from being guilty of the charges of nihilism and point blank bleakness by the extraordinary performances of David Thewlis and the late great Katrin Cartlidge. But the acting in \"Meantime\" is in many ways even more impressive, as the actors have less material - less BUSINESS - to work with. The nuances of expression, of tones of voice, of body language are an object lesson in how to inject meaning and significance into silences and incoherence. Tim Roth tends to get the plaudits for his unforgettable portrayal of the mentally retarded little brother Colin, but Phil Daniels steals the film for me: his eyes are astonishing in the range of emotional depth they command, and his jerky, uncomfortable movements vividly describe a frustrated intellect driven to despair at the hopelessness surrounding him and the terrible fear that this hopelessness is creeping inside of him. But it is in the way that Daniels's character Mark expresses his love for his helpless and hapless idiot brother that finally secures the film's greatness. This love is fierce and hard-won, and most often manifested in petty abuse. But it is real love, true and unconditional, and the way Roth's character Colin responds to it is immediate and instinctive. The bond between them is the stuff of human dignity itself, and it is this that finally transcends the shuffling pettiness of the life they have had foisted off on them. <br><br>The most memorable image may well be Gary Oldman's skinhead Coxy rolling around in a gigantic steel bucket, frantically beating at the sides with a piece of metal - a Beckettian device if ever there was one - but there are so many perfect shots, so much to savour. The crane shot of Daniels aimlessly wandering around Piccadilly Circus, the long shot of Daniels and Oldman disappearing down the canal tow-path, the unexpected close-ups, the sheer range of the camera-work is breathtaking in such a cheaply made film.<br><br>If Mike Leigh ever makes a better film, or Phil Daniels ever gives a better performance, it will be a miracle. The fact that the film has gone from almost complete obscurity when it was made (1983) to enjoy a steadily growing cult status is indication that, gradually, more and more people are realising that, far from being a dated curio, this is a very special and precious piece of cinematic art indeed.","user":"adamblake77","rank":[48,55]},{"title":"Mike Leigh's Best.","rating":16,"date":"16 August 2003","review":"This is Mike Leigh's finest film. Next to this masterpiece his later feature films feel very contrived, it just flows beautifully. It's also very honest, the best depiction of the effects of unemployment I've ever seen on film. But of course as with all Mike Leigh's films it's all about the performances of the actors and they're all pitch perfect. I feel a bit sorry for Tim Roth, his first film role and without a doubt his greatest, how could he ever equal it, it was all downhill from here. A truly heartbreaking performance and if you're not moved by it then you have no empathetic feeling. I also particularly like the performances of Jeff Robert and Pam Ferris as the Mum and Dad. It's a tragedy that this film missed out on getting a theatrical release since it was a few months after it was finished that Channel 4 began shooting on 35mm with a view to feature film distribution. Because it's a 'TV' film it's unjustly ignored in comparison with Leigh's later films, but don't let that put you off, this is a masterpiece. The music is beautiful as well perfectly matching the mood of the film.","user":"phil6875-1","rank":[20,25]},{"title":"Another terrific film from Leigh","rating":8,"date":"19 April 2007","review":"I'm a big fan of Mike Leigh's gritty films, and 'Meantime' fits well into his admirable canon. He examines the lives of 'ordinary people' unlike any other filmmaker I know. Here, his microscope (forget the lens) is on a NON-working class (perhaps proletarian without the peasant's earth) family in 'estate' housing in the wretched suburbs of London. <br><br>Once again, as in all his films, Leigh, using his well-known improvisational rehearsal-and-execution technique, receives razor-sharp performances from his cast. At the centre of this work are two simply superb performances: Phil Daniels as Mark and Tim Roth as his mentally 'slow' younger brother Colin. Anyone who has had a sibling will recognize the evolution of the relationship between these two. It's universal in its reach.<br><br>Splendid acting abounds and carries 'Meantime'. As the parents, Jeff Robert and Pam Ferris are all-but-tactile with their sizzling frustration and rage. Gary Oldman as a deeply disaffected youngster is wonderful. A very brief scene where he rolls in a barrel, mindlessly banging it with both hands, is both riveting and disturbing.<br><br>The quibbles I have with this film are perhaps minor to some, but of concern to me. One is Andrew Dickson's music. Is that a zither playing in an Egyptian carnival dance band? It is initially just jarring, but then it becomes downright annoying and intrusive.<br><br>I quite frankly could have used subtitles in 'Meantime'. Whole sentences just went past me. It's necessary for the stark social realism of Leigh's settings, but for non-Londoners, this can, at times, be rough going. I listened to fragments of this dialogue and it became an exercise in linguistic irony: these characters live in the country where the English language was BORN.<br><br>Doesn't matter; it's still a great and very moving film.","user":"groggo","rank":[12,14]}]