[{"title":"Neat little comedy.","rating":19,"date":"19 November 2001","review":"In the hands of lesser a director and less talented actors, THE DREAM TEAM's plot about four mental patients loose in Manhattan would be silly and childish.  Here, it is funny as hell, you stayed glued to the screen.   The four patients are Michael Keaton, as a loose tempered but charming liar, Peter Boyle as an ex-executive who now believes he is Jesus Christ, Christopher Lloyd as a compulsive neat-nick and Stephen Furst as a catatonic TV commercial/Baseball fan.  <br><br>Their run-ins with unsuspecting New Yorkers come fast and fresh, no re-heated gags here.  Look for a young perky Lorraine Bracco and Broadway great Phillip Bosco in supporting parts.","user":"boris-26","rank":[20,22]},{"title":"Rise, my son, and walk!","rating":25,"date":"25 June 2003","review":"If you like Michael Keaton, Peter Boyle, or Christopher Lloyd, you will like this film.  That's guaranteed.  But even if you are not fans of the aforementioned talents, I think you will still enjoy this movie.<br><br>Keaton is at his sarcastic best with his role as a guy with anger problems. It's easy to empathize with him, especially in the situations he finds himself in.  I don't know of any other contemporary actor who could deliver these lines with the same effect.<br><br>Similarly, Peter Boyle surpasses his performance in \"Young Frankenstein\" with his comedic portrayal of a man who believes he is Jesus Christ.  His walk through a hospital is not to be missed!<br><br>Lloyd plays the control-freak authority figure wannabe with finesse.  It would be difficult indeed to watch this talented comedic actor play a straight role.<br><br>Stephen Furst is excellent as a man who can only speak in baseball metaphors.  Where the hell has he been since Animal House?<br><br>The plot is weak and quite predictable, but the lines delivered along the way are worth the effort.  One of the great sleepers.","user":"billyfish","rank":[24,28]},{"title":"Peter Boyle is a comic genius","rating":23,"date":"23 December 2003","review":"I mean it.  After seeing him in this movie, and Young Frankensteeen, and the occasional episode of Everybody Loves Raymond, I can't take him seriously in movies like Joe, Outland and even as Wizard in Taxi Driver. His performance in this movie is absolutely hilarious.  I've always had a soft spot for this underrated gem.  It's basically a screwball version of \"One Flew Over the Cuckoo's Nest,\" using that movie's famous baseball game scene as its starting point:  An easy-going doctor takes his patients to a Yankees game, and runs into trouble on the way there. And I don't really mind the crime subplot here as much as I did in Three Men and a Baby.  Everyone shines here--Michael Keaton (his reference to the World Trade Center was funny then, bittersweet now); Christopher Lloyd; Boyle; even Lorraine Bracco, in a small role.  And it's full of memorable quotes.  This movie never fails to put a smile on my face.","user":"drosse67","rank":[20,26]}]