[{"title":"US Version Stinks","rating":16,"date":"16 May 2001","review":"'A' Gai Waak/Project A(1983) is known for the physical comedy performed by its star, Jackie Chan.  No one does physical comedy with the same type of bravery like Jackie Chan does here.  Physical comedy is the hardest kind of comedy.  This is because a person has to be in excellent shape to do the kinds of stunts required in physical comedy.<br><br>\nProject A(1983) is my favorite film of the Jackie Chan/Sammo Hung/Yuen Biao collaborations.  Film proves why they are the Marx Brothers of Kung Fu Comedy.  These three actors are at home when working with each other.  The fight scene between the head pirate and Chan/Hung/Biao is done at a frantic pace.<br><br>\nThe stunts in Project A(1983) are dangerous and daring.  They are also filled with energy and style.  The stunt on the clock tower is both amazing and breath taking.  When it comes to stunt work, Jackie Chan is the best at taking chances in giving action scenes an ounce of authenticity.  The actors make the stunts look easier than they actually are.<br><br>\nJackie Chan does a brilliant job in the dual role of actor and director.  As an actor he gives a simple performance that is transcended by his ability to perform incredible stunts.  As the director he films the action scenes with high speed energy.  The best film for Jackie Chan as actor and director.<br><br>\nThe scene with Chan hanging from the clock tower is a fabulous homage to the famous sequence from the silent comedy, Safety Last.  Scene shows the actor's love for silent pictures and the Harold Lloyd film.  This scene is a throwback to the glory days of silent comedy.  Not only does it gives respect to Safety Last(1928) but also stands on its own as something memorable.<br><br>\nThe action scenes in the movie make any similar scenes from the average Hollywood action pic look puny.  A pure action film that shouldn't be mistaken for intellectual viewing.  The fight scenes are done with imagination and passion.  Action scenes from Project A(1983) are just as impressive as the action set pieces in Police Story(1985).<br><br>\nProject A(1983) is an entertaining tribute to the great silent pictures of Buster Keaton and Harold Lloyd.  Jackie Chan plays a character in the Keaton and Lloyd mold.  Its this aspect of Jackie Chan's arsenal that makes him a superstar.  Project A(1983) is a great example of a film with the techniques of a silent comedy.<br><br>\nIn comparing the USA version of the film to the Hong Kong version, I came to the conclusion that the version released here is a travesty.  First, the US version is missing some key scenes that made the film funny.  Second, the film was badly dubbed and poorly edited for its US release.  If I ever got this film on DVD its most likely I will get the Hong Kong version.<br><br>\nIts a pleasure to see Jackie Chan and Sammo Hung fight side by side in Project A.  Their films are usually terrific whenever they appear together. The fight scene in the tea house showcases their similar but slightly different brand of fighting technique.  Its a shame that these two haven't done anything with each other lately.<br><br>\nOne of the top films directed by Jackie Chan besides Police Story(1985), Armour of God 2(1991), and Project A part 2(1987).  Ho-Shan Kwan provides the comic relief as the hard headed Captain Chi.  Yuen Biao is good in a role that's over shadowed by Jackie Chan and Sammo Hung.  A film for fans of action movies and people who want to discover the films of Chan, Hung, and Biao.","user":"eibon09","rank":[28,28]},{"title":"Great stunts, great fighting","rating":9,"date":"26 July 2001","review":"Incredible movie, it ranks up there with some of Jackie Chan's best movies. It is not to be missed by any martial art-movie fan. The stunts performed in this movie is incredible. The clock tower fall by Jackie Chan is the most amazing one but I also loved some of the falls that Jackie's opponents did, a lot of people must have gotten injured while making this movie. The fighting scenes are top-notch, maybe not quite as good as the ones in Drunken Master II, which still remains my favorite Jackie Chan movie even though this one gets really close. Jackie Chan must be the most exciting man ever to appear in a movie, he risks his life to bring us entertainment, is he dumb, crazy or out of his mind? I don't know, all I know is that he's entertained me more than any other man ever has. Watch this movie and prepare to be amazed.","user":"Carl Tano","rank":[15,15]},{"title":"Fun and action-packed","rating":9,"date":"9 November 2002","review":"Boy, that lead-in stinks of a rotting cliche, doesn't it? But I really do enjoy this movie. Every time it hits cable, I watch it.<br><br>\nJackie Chan and Sammo Hung play wonderfully off of each other, even in the dubbed version. The story is realistic enough to be compelling, and the action sequences are superb. My personal favorite is the battle on the bicycles in the narrow back alleys.<br><br>The one thing that has made Mr. Chan my favorite martial arts actor is the way his movies infuse humor and slapstick into serious fight scenes, and Project A, in my opinion, does that better than any of his other films.<br><br>Highly recommended.","user":"knsevy","rank":[13,13]}]