[{"title":"Classic! The Best Dog Story Ever!","rating":10,"date":"2 April 2004","review":"While there are many really good dog films out there, in my honest opinion, they all submit to the leader of the pack, and that leader's name is Old Yeller. I first saw this film when I was 10 years old, and have been a huge fan ever since. While the acting is superb, and the story is top notch, the real star of this film is the 170 pound Labrador/Mastiff mix named Spike who played the part of Yeller with heart and soul. If you are one of the few in the world who does not know the story of \"Old Yeller\", be warned that you may shed tears after seeing what many consider to be one of the most heartbreaking scenes in movie history. But that scene only makes you love this movie even more as through tragedy comes hope and learning experiences. Don't miss one of the greatest classics of all time.","user":"cairn6","rank":[53,55]},{"title":"A really perfect little movie","rating":10,"date":"28 February 1999","review":"I must have seen this when I was a kid (on TV), but I'd forgotten just how good a movie this is.  The technical aspects are great (that color!), the acting believable and naturalistic, and the story moves along at a really nice pace.  There's nothing condescending or \"cutesy\" here, and the plot point of the kid trying to play grown up (ie, Tommy Kirk as man of the house while his father's away) is played out without the traps that so many coming-of-age films fall into:  In this boy's world, being an adult is about working and taking responsibility, not sneaking drinks and experimenting with sex.  Also, the \"messages\" were woven nicely into the script, not tacked on and rammed over your head.  It also helped that they had actors, rather than \"stars\".  This is really what family filmmaking (a term I generally hate) should be:  Something that kids and adults can appreciate.","user":"T-Boy-3","rank":[34,36]},{"title":"A Disney Classic","rating":8,"date":"20 November 2002","review":"Old Yeller is one of Disney's Best.  Superb performances all around, a very touching (especially for dog lovers, it might even be to painful for some i.e. my wife) with a very heart-wrenching ending. They don't make them like this any more. If you enjoyed Old Yeller, may I recommend you give The Yearling a try.  Which is even better (if possible) than Old Yeller.","user":"druryd","rank":[19,20]}]