[{"title":"Great film, full of humor and thrills.","rating":3,"date":"3 February 1999","review":"One of the best werewolf movies ever made, full of dark humor and gory thrills.  As most people know, this has one of the best  human/werewolf transformation scenes in cinematic history!  The only other movie to show such detail is The Howling.  This movie is really fun to watch, and if you are seeing it for the first time you will be shocked at some of the things you see.  Great performances from the cast, and an excellent script make this a memorable experience.  Unlike monster/horror movies today, this film has no computer-aided special effects.  It doesn't need them, for this is a landmark film.","user":"Deviant-7","rank":[100,120]},{"title":"Still Funny & Frightening After All These Years","rating":9,"date":"9 November 2005","review":"Here's a film that never fails to entertain, year after year. It's almost a quarter of a century old but hasn't become dated and the special effects, which were astounding in its day, are still good. Director John Landis is so good at making entertaining movies. This is one of his best.<br><br>The appeal to this film is the combination of horror, suspense, action and humor. The latter actually is the key ingredient because this can become a downright scary movie. The levity here and there is welcome relief. There is just the right amount of contrast between horror and comedy.<br><br>For parents wanting to know, there also is a fair amount of rough language and there two sex scenes, one as part of the story and one \"on screen\" in a porn- movie theater where the two male leads meet late in the story.<br><br>Jenny Agutter is the love interest in here, a very pretty woman whom Americans audiences aren't that familiar with. It isn't just her: neither of the two leading (American) male actors in this popular movie ever became stars, either.<br><br>An entertaining but silly sequel came out almost two decades later, \"An American Werewolf in Paris.\" I own both movies but much prefer this one.","user":"ccthemovieman-1","rank":[87,107]},{"title":"My favorite best werewolf film of all time a true horror icon classic!","rating":10,"date":"15 October 2016","review":"An American Werewolf in London (1981) is a cult classic horror werewolf slasher flick. It is my third favorite werewolf film of all time! <br><br>An American Werewolf in London is not only the best werewolf movie ever made it is also one of the best genre films of all time. I grew up watching this film and it is a childhood favorite of mine. I first saw this movie when I was 13 years young of age, it is a childhood movie for me and it is the first werewolf film I ever saw. I love this film to death and I think it is a great horror film of all time! It is one of my personal favorite horror werewolf movies of all time.<br><br>It is very scary, especially the ending you can see a human's head falling down the street. I don't know much about the cast I don't know almost anyone except actress Jenny Agutter I know her from Logan's Run (1976) and The Eagle Has Landed (1976). This film is directed by John Landis who directed a lot of comedy films. The movie was entirely shot in London, Surrey, and Wales, which you can see a beautiful country side in the UK. This film: The Howling (1981) and Dog Soldiers (2002) are my top 3 favorite werewolf films this will be my number 2 favorite film.<br><br>Plot: Two American college students are on a walking tour of Britain and are attacked by a werewolf. One is killed, the other is mauled. The werewolf is killed but reverts to its human form, and the local townspeople are unwilling to acknowledge its existence. The surviving student begins to have nightmares of hunting on four feet at first but then finds that his friend and other recent victims appear to him, demanding that he commit suicide to release them from their curse, being trapped between worlds because of their unnatural deaths.<br><br>This is a classic horror film about two young American men, David Kessler (played by Naughton) and Jack Goodman (played by Dunne), attacked by a werewolf on a backpacking holiday in England. With Jack killed, David is taken to a London hospital, where his disturbing apparitions of his deceased friend informs him that he is a werewolf and will transform at the next full moon. What I love about this film is: I love the story, the special effects and the humor in here. In the opening scene you have a really beautiful view on an England country side when you see David Kessler and Jack Goodman walking down the road. This movie is really beautiful shot I love that two young men best friends are traveling together and seeing England in a country side. I love the werewolf story and everything in it.<br><br>I love the characters in this movie, the story is a full long horror film with awesome black comedy in it, practical effects by Rick Baker that still rival some god awful cartoon ps1 CGI now a days!!! I have seen this film more then any other movie and it still feels fresh. And while filmed in the early eighties, it feels timeless. The blend of horror and humor are perfect. The horror comes at you brutal and/or fast and the humor is never forced but comes naturally out of the absurdity of the events (waking up naked in the zoo, having your dead friend tell you that you are a werewolf.) Oh man, this is such a fun movie. It's a great werewolf story with enough gore for the splatter junkies, and enough story to make it better than just some run-of-the-mill horror flick. This was created in a time when horror was HORROR, as opposed to these kiddie flicks with predictable jump scares we get today.<br><br>The special effects, done by the great Rick Baker, are absolutely astounding, even more believable than a lot of what we get today. The first transformation scene is one of the best to ever be featured in a werewolf film, especially with the convincing screams of pain from David Naughton. The actual look of the werewolf is also just as great, giving one of the most menacing and evil appearance I've ever seen on a wolf. The howl sounds like a mixture between a man's scream and an actual beast giving a call, a sound that sends a chill down your spine every time you hear it. These sort of details remind you that even though there's comedy in it, Landis did put great focus on the horror aspect of the film.<br><br>An American Werewolf in London is a 1981 British-American horror comedy film written and directed by John Landis, and starring David Naughton, Jenny Agutter, and Griffin Dunne.<br><br>Overall: An American Werewolf in London is a timeless excellent cult classic movie my favorite number 2 werewolf film of all time! Score: 10/10 I love this film, the acting is really solid the characters in this film a well written. The special effects in this movie are well made. This movie on it self's stays a true classic in a horror genre and it is way better movie, than these days horror movies that are in PG-13 ratings awful!","user":"ivo-cobra8","rank":[51,61]}]