[{"title":"Not exactly good, but not nearly as bad as it COULD have been... (minor spoilers here)","rating":10,"date":"10 August 2004","review":"This does not touch the Cronenberg movie (or the Vincent Price movies, from what I've seen of those), but is definitely worth the watch for fans of gross-out monster flicks. The plot? The son of Seth Brundle (Harley Cross) is born in a corporate laboratory. He grows up at a very fast rate (now played by Eric Stoltz) and falls in love while discovering the evil secrets of the bigwig and his scientists, who have raised him. Nothing helps him on his quest to destroy them more than when the metamorphosis that took place in Dad begins to take place even faster in Son. It has its funny moments (the under-used John Getz from the original gets some big, cynical laughs), as well as very emotionally moving moments (especially when Stoltz puts the mutant dog to sleep, which is very sad and touching). There is a hackneyed element, to be sure (the romantic part with the awful country song is something that would be perfectly acceptable to fast-forward through), but, overall, it's still a kinda fun movie that's more effective than many people might tell you. As far as the gore quotient goes, this one I would consider more of a splatter movie than Cronenberg's (which had its gross-out moments throughout, but wasn't as bloody as this one was). Still, if you like gore, I would suggest it especially. I myself have no problems with gore as long as I like the movie around it, and I liked \"The Fly 2\" enough to actually watch it more than once without that choice being under the influence of substances! Also, one way it was better than the first film was how it ended. While the ending to the first was somewhat abrupt (even if it was a great movie and didn't really need anything extra), this one features a happy ending that is not sappy (always commendable), as well as one of the greatest acts of vengeance ever agonizingly drawn out on film. All in all, I agree that \"The Fly 2\" doesn't really touch David Cronenberg's \"The Fly\" in overall quality, but it doesn't deserve the terrible reputation that's been heaped on it over the years, even if there's nothing to disguise the fact that is inferior.","user":"one4now4","rank":[37,39]},{"title":"Son of Brundlefly.","rating":7,"date":"30 June 2009","review":"It kinda goes without saying that with FX man Chris Walas taking the directorial reins from Cronenberg, the sequel to the 1986 horror hit The Fly ain't going to be on a par with its predecessor. But even though The Fly 2 doesn't quite pack the emotional wallop or sophistication of part one, it's still an enjoyable slice of hokey B-movie monster madness that should particularly appeal to those who love a bit of splatter with their big-bug action.<br><br>Part Two begins as Veronica, the pregnant girlfriend of tragic deceased scientific genius Seth Brundle, dies whilst giving birth to son Martin under the watchful eye of Bartok Industries, the organisation that funded Seth's telepod experiments (baboons don't grow on trees, y'know). Thanks to the unique human/fly genetic make-up he has inherited from his father, Martin experiences accelerated growth, and by the age of five, is a fully grown scientific whizz-kid (played by Eric Stoltz) working for his benefactor Anton Bartok (on the same telepod project that claimed his father's life) and romancing pretty computer operator Beth Logan (Daphne Zuniga).<br><br>Bartok (Lee Richardson), however, is not as benevolent as he seems: with his own wicked agenda in mind, he has led Martin to believe that his rapid growth is the result of a very rare growth disorder, and has kept the lad under continuous observation, waiting for the day that his dormant insect genes fully awaken to transform him into a multi-limbed monster.<br><br>Despite being a newbie in the director's chair, Chris Walas proves to be no slouch when calling the shots: working from a script by frequent Stephen King collaborators Frank Darabont and Mick Garris, he delivers a surprisingly polished product that offers spirited performances from B-list stars Stoltz and Zuniga, a touch of pathos with a memorable key scene involving a mutated dog, and a whole slew of top-notch special effects, the most stomach churning of which see one poor guy having his head crushed by an elevator! Yowch!<br><br>I do struggle a little with the notion that entering a telepod with another human being (especially a full clothed one) would revert a Brundlefly to perfect human form, but since this was something alluded to in the original, and there's a fitting payoff for the bad guy as a result, I'll cut the film some slack. Besides, I had lots of fun with The Fly 2, and that's what really matters.","user":"BA_Harrison","rank":[18,20]},{"title":"It's not Cronenberg, but it's not total trash either","rating":5,"date":"24 June 2006","review":"Seth Brundle's offspring, Martin, is born and begins his life in a controlled lab environment at Bartok Industries. He grows at an accelerated rate both physically and intellectually. After seeing some of the ruthless ethic that the company has towards its experiments and the length they go for results Martin goes on a rampage and escapes. Also, his mysterious and idling chromosomes start to become active and he begins to mutate. First he has better strength and speed and soon he turns into a monster.<br><br>Much of the visceral symbols and themes from David Cronenberg's film are lost at the expense of gore and special effects, but parts of this obviously inferior film are nonetheless engaging. The character's motivation is clear, the atmosphere is pretty defined, and the film's last act is pretty exciting. Featuring some good gore effects and a ruthless act of revenge against an evil character ultimately make this film more satisfying than its reputation would suggest. 5/10<br><br>Rated R for violence, gore/gruesome images, and a sex scene","user":"BroadswordCallinDannyBoy","rank":[17,21]}]