[{"title":"a childhood favorite","rating":15,"date":"15 July 2001","review":"I don't care what people say, THE BEASTMASTER is a fun film. Thanks to my parents having cable in the 80s, I virtually grew up with it. I can still recall spending many days and nights watching it on television. I probably had no idea of what was going on, but I just loved watching this animal lover named Dar rescue the hot Tanya Roberts while fighting against an evil priest. Marc Singer is great in the title role. If he were to cure world hunger, create world peace, or even be elected president, he would still be known as The Beastmaster. Tanya Roberts doesn't really do much, but looks damn nice doing it, John Amos is also good as a traveler who befriends Dar, and Rip Torn is as over-the-top as he can get. Lee Holdridge's score, composed in a short amount of time, provides a bit more epicness than the film could have created on its own, with a heroic theme that is used throughout. I was also happy to learn recently that Anchor Bay Entertainment is working on a Special Edition DVD of THE BEASTMASTER. I'm, naturally, very excited about this, for no matter what people say, THE BEASTMASTER was, still is, and always will be a childhood favorite.","user":"MichaelM24","rank":[37,37]},{"title":"Classic B-Movie swords-and-sorcery","rating":9,"date":"17 December 2002","review":"For one of the slew of quickly produced movies of the 80's this one is pretty good. You've got Marc Singer when he was young and fit (not leathery and ancient like in the later movies of this series) and Tanya Roberts who is hot in this film. You've got swordfights, sorcery, the whole works. That said, I did find the ferrets a little annoying, but that's just me.<br><br>On the whole the movie works well and there are some touches, like the flying humanoids that envelop and dissolve their prey, that just make the film.<br><br>SUMMARY: Hero who can talk to animals sets out to overthrow an evil warlord.","user":"Rob_Taylor","rank":[48,50]},{"title":"Caw caw caw --- \"He is the Beastmaster!\"","rating":8,"date":"14 February 2005","review":"How can anyone not like the Beastmaster? It's what movies are all about - it's got a hero, his woman, a villain, sidekicks, animals, loincloths, violence and much much more! It's one of the earliest of films that HBO would play about 4 times a day so it was almost always available. John Amos from Roots and Good Times cheeses it up but damn, do I have a soft spot for the guy. Dar looks like my brother Eric. Rip Torn is a villain with bad teeth! The freaky eagle/vampire things are nutty. It's got ferrets - FERRETS in co-starring roles! Plus a panther and hawks and B-dialog and swords and last but not least \"crazy-eyes\" herself, Tonya Roberts! Yowza! It's basically a goulash of afternoon delight. Straight B an 85 - 8 out of 10. Caw caw! Catch it one time or a dozen, you'll love it.","user":"Figgiedan","rank":[41,43]}]