[{"title":"Reasonable retelling of a portion of BG's life story","rating":29,"date":"29 April 2003","review":"Growing up in the 40's in Brooklyn, I heard the music of BG, Miller, Dorsey, Shaw, etc. on the family radio(Martin Block's \"Make Believe Ballroom\"). I became a big fan of Benny's in 1950, with the release of the Columbia LP of the Carnegie Hall concert and the 1937-1938 radio broadcast albums.The music on these live performance albums was outstanding and spontaneous as opposed to the sterile studio recordings locked into a 3 minute format for 78 rpm records. These albums resulted in a resurgence of Benny's popularity and, ultimately lead to the movie.<br><br>Steve Allen, while not a great choice, was probably the best at that time, since he was a popular TV personality and was a music lover and musician in his own right.  As for Donna Reed, well what can anyone say except that she was as beautiful as ever and the consummate pro as the female lead. A fairly fast paced film with loads of musical guest stars and some pretty good tunes made famous by and played by BG for the soundtrack.<br><br>Benny was not an exciting or controversial guy, so how do you generate enough interest to draw people to the movie,as is the case today. In 1955, good music did the trick.  About the only controversy about Benny was his reputation of staring down any band member who diverted from the the arrangement.  One former musician described in an interview how \"the old man gave me the evil stare for the whole number after hitting a wrong note early on\".<br><br>Too bad they could not synchronize the actual concert music with the movie. In particular, the quartet version of \"Stompin At The Savoy\" in which Gene Krupa's cymbal flew off the stand and was hit by Lionel Hampton on the way by without missing a beat, or the concert rendition of \"Sing,Sing,Sing\", probably the best ever recorded.<br><br>If you like this film go out and buy the newly released CD of the Carnegie Hall concert complete with 2 numbers previously excluded from other releases with intros by BG and no interruptions between numbers allowing you to hear the sounds of the band setting up for the next number, etc.  Just like being there.","user":"john.palmer","rank":[23,23]},{"title":"A great film","rating":10,"date":"19 May 2004","review":"This film is considered by many as being a pretty mediocre film, but I think this film is truly great. Maybe it's just a jazz-lover's point of view; Benny Goodman is my favourite artist, and is the man who inspired me to take up the clarinet. Steve Allen comes across as a likable Goodman, and manages to look the part. Donna Reed also does her job pretty well but the people in the film who will really catch your attention are the jazz musicians that are in the film, playing themselves. These musicians include: the very enthusiastic drummer Gene Krupa, the trombone player Edward \"Kid\" Ory, the vibraphone player Lionel Hampton and the famous band leader and drummer of the '20s Ben Pollack. Whether you like the film or not, you have got to like the music which includes such Goodman classics as \"Don't be that way\", \"Sing, Sing, Sing\", \"Let's Dance\" and \"One o'clock jump\". All in all, a highly enjoyable film which, as far as I am concerned, is better than the much acclaimed film \"The Glenn Miller Story\" starring James Stewart in the part of Miller. \"The Benny Goodman Story\" is a must-see for all jazz fanatics and all clarinet players. The film also features a very impressive rendition of Mozart's clarinet concerto (Goodman also gave classical music a try, as you can see, to great effect). I'd say that it is decidedly worth seeing. Enjoy!","user":"Elgroovio","rank":[22,24]},{"title":"Well made biopic of the first man to front an integrated band.","rating":8,"date":"5 April 2006","review":"Benny Goodman is respected in jazz circles not only as the first virtuoso clarinetist in the field,but,more importantly and influentially,leading the first band to have both black and white musicians on the stage at the same time.In Ken Burns' epic TV series \"Jazz\" BG is one of the few white musicians to get much more than a token mention - his importance in the social history not only of jazz but of the very fabric of life in America cannot be overstated.After the success of \"The Glenn Miller Story\" it was inevitable that Miller's more talented contemporary would become the subject of a biopic - the major difference being BG was still alive. Although respected by his peers BG was not liked,he was not a tolerant man and was very conscious of his \"star\" status,if any of his sidemen got more applause than he did he would go into a sulk and cut the solo out the next night.Of necessity,the portrayal of him by Mr. Steve Allen was not very accurate,although there was a remarkable physical similarity. Mr Allen,a great jazz lover and a fine pianist,taught himself to play the clarinet for the role and made BG seem a bit like an absent-minded professor,until he picked up his horn. Miss Donna Reed,beautiful,talented and,sadly,rarely mentioned nowadays in film literature adds style and class as the future Mrs BG. The music is wonderful,as it should be with the cream of former Goodman alumni to choose from.There are featured roles for Mr Teddy Wilson,Mr Lionel Hampton and Mr Gene Krupa(soon to have his own biopic with Sal Mineo in the lead).Of the older generation Mr Ben Pollack and Mr Edward \"Kid\" Ory are particularly welcome. The climax to the film is the legendary Carnegie Hall concert of 1938. The movie led to a welcome resurgence of interest in BG's music and a lot of British jazzmen went into the recording studios with \"hommage\" Benny Goodman quartets which must have helped to pay the mortgage. With the aforementioned \"Drum Crazy - The Gene Krupa Story\",the jazz biopic craze fizzled out,although W.C.Handy got a look in with \"St. Louis Blues - The Story of W.C.Handy\",but it was dire and failed to put bums on seats. Not until Clint Eastwood's \"Bird\" did the genre revive,however temporarily.By then both the movies and their audience had changed irrevocably. I suspect if \"The Benny Goodman Story\" was to be remade today it would be less adulatory in tone.The one story that I think sums him up most accurately and not unpleasingly concerns a rehearsal conducted in an unheated room.One after the other,band members complained about the cold until BG finally looked up from his music stand and said\"You're right,it is cold\".He put his clarinet down and went out of the room.The musicians cheered up,thinking he had gone to arrange for some heating.Three minutes later he came back wearing a thick pullover.","user":"ianlouisiana","rank":[8,8]}]