[{"title":"Terrific TV thriller...","rating":8,"date":"5 February 2006","review":"Lois Duncan's young-adult mystery novel \"Summer of Fear\" gets a fine, if low-budget, television treatment, capably directed by Wes Craven. Intriguing story features an appealing Linda Blair playing popular young woman and horse-rider whose family takes in her orphaned cousin--a perplexing girl who harbors secret evil powers. Craven's pacing is careful and sneaky, drawing the viewer in while mounting Blair's suspicions with just the right touch of creepy delicacy. Lee Purcell is excellent as cousin Julia, pulling off a showy role without lapsing into camp (although the make-up and special effects near the finish are somewhat cartoonish by today's standards). A compact thriller, very well done, and Blair--as always--is charming and makes her character easily identifiable to viewers.","user":"moonspinner55","rank":[16,18]},{"title":"Better Than The Book","rating":26,"date":"26 January 2004","review":"I already reviewed SUMMER OF FEAR/ STRANGER IN OUR HOUSE (see review below) but I just wanted to add something. A lot of the other commentors say that the movie is not as good as the book, or to skip the movie and JUST read the book. Well, I watched the movie, bought the book and read it and I gotta say: NO WAY is the book better! Theres really only three main differences in the book. 1. Instead of a horse Linda Blairs charactor owns a dog. The dog growls at Cousin Julia and nips at her but that in no way is as  threatning as when the horse goes aftyer her in the movie (a good scene in the movie). 2. While in the book Cousin Julia seems a tad \"flirty\" with the Uncle they dont really entale that anything else is going on...where the movie seemed to imply they were having an affair. And 3. The ending of the book has a confrontation between the Cousins that is \"wordy\"...they talk but they actually dont \"rumble\". The whole joy in the movie was the fight scene...and the book doesnt have a fight scene at all. Also not as interesting is the way the book \"handles\" Cousin Julia's \"dismissal\". The movie version was much more exciting! I'm going to throw in a SPOILER here so those interested in reading the book or watching the movie do not read the next line: The book has Rachel discovering Julias true identity and locking her in the dark-room. Later it is told that one of the brothers let Julia out and she left the house, The movie has a devilish catfight and Julia dricving off a cliff...then \"shocking\" us byu re-appearing at the end. ARE YOU KIDDING ME \"The book has a better ending\"??? NO WAY!!!!","user":"mamamiasweetpeaches","rank":[7,7]},{"title":"Straightforward Craven thriller is not bad - for a TV movie","rating":5,"date":"25 September 2005","review":"Linda Blair is this film's main draw today, but Lee Purcell is the real star of the show: at first I wasn't too sure about her, but she has the mysteriously seductive presence that her role calls for, and her performance literally gets better by the minute. This may be a Wes Craven movie, but it is also a TV movie, so it is rather tame in terms of sexuality and violence; there are few real surprises and few real thrills until the last 15 minutes and the (long awaited) catfight between Blair and Purcell. With its \"evil stranger is disrupting the life of a normal happy family\" plot, you could say that this film was ahead of its time; thrillers of this type didn't become popular until the early 90's, with \"The Hand That Rocks The Cradle\" and others like it. But one look at Linda's hair will convince you that it was NOT ahead of its time in other areas. In short, rent it but don't buy it. (**)","user":"gridoon","rank":[10,11]}]