[{"title":"Manchester United 1 Tottenham Hotspur 2","rating":8,"date":"22 April 2002","review":"The beauty of this film lies in the simplicity and purity of its message. If you want to get along, especially in a Northern English mining town in the 60's, do not ever hope for anything better.  If you do, the world's gonna come and kick you in the teeth.  Discuss.<br><br>Billy Casper has an empty life.  In trouble with the police for theft, he shares a bed with his brother (a discontent miner willing to take out his frustrations on just about anyone nearby), goes to a school with some dispiriting and brutally repressive teachers, and has nothing to look forward to but the day when he to descends into Hades to work the coalface.<br><br>Until Kes comes along.  Kes is a kestrel that Billy rears and trains.  Kes soars where Billy can only dream.  Kes is hope.<br><br>Ken Loach is the master of social commentary and I think this is probably his best film.  This film embodies what it means to be working class in all the best traditional ways.  You work, you do not have ambition, you are surrounded by people who have accepted their lot in life, you cannot hope for better, you won't be allowed to hope for better.  If that sounds brutal, it is and so is this film.  You aren't told right and wrong, you are told what is.  It is thrust in your face for you to deal with.<br><br>The best thing about this film are all the characters that surround Billy. All have had all spirit hammered out of them at an early age and are damned if any one else is going to have any.  The teachers casual and resigned brutality living what remains of their dreams by playing against the boys on the football field and imagining they are Bobby Charlton (and still losing) is perfectly displayed.  The shop keeper's humouring of childish enthusiasm because he knows it ain't going to last.  And most of all Billy's brother's spiteful depression.  His spirit has been freshly crushed and it still rankles.<br><br>And amidst this gloom shines Billy and Kes.  They soar above this nightmare like Andy Dufrense soars when he plays opera to the Shawshank inmates.  Ken is telling us hope is a jewel to be treasured especially when it is surrounded by those wishing it crushed and buried.<br><br>You must see this film, especially if you've seen the Shawshank Redemption. Be warned though, there is no redemption here.  Don't be afraid of the accents you non-Yorkshire folk.  Just think of it as Wallace and Gromit without the cheese.","user":"ProperCharlie","rank":[100,109]},{"title":"At times clunky, but an outstandingly powerful social commentary.","rating":8,"date":"29 September 2005","review":"Kes is the story of a few weeks in the life of a schoolboy, Billy Casper, against the backdrop of social disintegration that was the north of England in the late 1960s. Billy finds and trains a kestrel, investing in it all the latent energy that his school and rough home life have suppressed, and finding in it a release from the all too present reality of the rest of his existence.<br><br>An outstanding performance from David Bradley as Billy glues together the sometimes shaky portrayals of the other characters. As a contemporary social commentary this is a film that has many of the elements you might expect. Billy has an impoverished family with an elder brother working down the pit and a single mother struggling to cope with the situation in which she finds herself. His school is staffed by teachers who react to their part in a failing system with aggression towards the pupils. And he's quite at home with petty crime, stealing a pint from the milkman and a volume to help him train the kestrel from the second hand bookshop. But the film is saved from cliché by the honesty of the acting and the quality of the direction; it seems at times as if we're watching a fly on the wall documentary. The reactions of the boys to the rant and the caning they receive for being caught smoking is entirely natural. Brian Glover as the sadistic games master is all too credible. And the employment interview is too close to my own experience to be fiction.<br><br>The film moves to its inevitable and unforgettable conclusion and we're left wondering what happened to Billy Casper after the filming finished.","user":"alshepherd","rank":[44,49]},{"title":"Possibly the best British film of all time !","rating":10,"date":"30 August 1999","review":"Although Kes was not Loach's first film (he had made \"Cathy come home\" for television and \"Poor Cow\") it is probably his best both artistically and historically. Historically, the film is an important one, because it's the first one that gives an accurate description of a working-class environment. There had been several social realist movies made before it, such as Karel Reisz's \"Saturday Night and Sunday Morning\" or Tony Richardson's \"Billy Liar\", but Kes set a whole new agenda. Esthetically, Loach went a lot further than those before him, filming his characters in a quasi-documentary way. Also, the actors were, for a great part, non-professionals, which lent a further \"realistic\" touch to the film. For the first time, strong regional accents (Yorkshire) were allowed to flow freely.  Finally, the story itself is extremely compelling. Without being at all demonstrative or heavy, the film is the most powerful indictment of the british class system that has ever been recorded on film.<br><br>Billy Casper, the hero, is shown to have absolutely no chance of escaping his harsh milieu. At home, his half-brother bullies him and he finds no comfort from his mother. At school the behaviour of teachers, career-councillors and headmasters ranges from violent to merely condescending. It's this anti-institutional side to the film that makes it so powerful. Billy basically knows that he'll probably end up down the mine and he knows that school isn't there for his pleasure or his fulfillment but to tell him what to do. So, unable to express himself at home or at school, Billy develops a passion for hawks and devotes great time and effort to the taming of a kestrel. This passion comes to symbolise both the boy's hopes and his identity.","user":"CousinK","rank":[83,97]}]