[{"title":"A supremely rich and moving work of art (spoilers!)","rating":17,"date":"17 October 2002","review":"I saw Roberto Rossellini's \"Europa '51\" for the first time very recently and I can assure you it is without a question Rossellini's greatest film with Ingrid Bergman surpassing \"Viaggio in Italia\" and \"Stromboli\". It may well be Rossellini's greatest and most complex film, though I still have soft spot for \"Paisan\", \"Germania, anno Zero\", and \"The Rise of Louis XIV\"!<br><br>\"Europa '51\" is a supremely rich and moving work of art, highlighted by an extraordinary performance by Ingrid Bergman (perhaps her best ever)! It beautifully expresses the uncertainty, the despair,the search for hope at that time in history. Much like Rossellini's neo-realist classics, \"Europa '51\" shows only facts or raw physical reality, yet throughout the film Rossellini makes the viewer aware of something miraculous or spiritual. Rossellini deftly shows us the process of how a human being can transform from being a careless or ordinary to a gifted saint capable of changing the world. At first, Bergman's Irene is portrayed as hard working mother who has very little care for her son Michele and her people. Irene is shown chatting with her dinner guests who are apparently blind to the realities of outside world. But soon when Michele tries to commit suicide and ultimately dies, she is changed forever. Michele's suicide here is quite different from Edmund's in \"Germania, anno Zero\": Whereas Edmund's heartbreaking suicide is characterized by a sense of finality and lack of consolation, Michele's suicide in \"Europa '51\" provokes Irene's journey to sainthood. Irene's progression from ignorance to sainthood is truly a revelation. Rossellini's unique style, the use of eloquent close-ups, or the scene where Irene's face fills the frame as she looks at a female patient - serves as \"framing\" devices where we see Irene attaining something larger than life. Irene personifies a sense of change and endearment for her people; she suddenly starts to care for humanity, her eyes open to the harshness of the outside world. Though there is an apparent detachment in the drama much like most Rossellini's work, there is no question the viewer is invited to identify with Irene and share the development of her consciousness.<br><br>To me, the ending is hopeful and miraculous. Irene is behind bars, her friends come and recognize her as a saint. It is a shot full of beauty and eloquence. This is the only Rossellini film I saw that made me cry. I hope many people will see it and be moved by it as much as I did.","user":"Kalaman","rank":[22,24]},{"title":"Modern sainthood","rating":10,"date":"2 May 2004","review":"After filming stories about the resistance of the Italian people during the Fascist and Nazi regimes, and the story of a German child against the barren landscape of Berlin after the war, Roberto Rossellini made a movie about Francis of Assisi and started a love and work relationship with actress Ingrid Bergman. In his evolution to works like 'The Rise To Power of Louis XIV', he made a series of melodramas with Bergman, of which 'Stromboli' and 'Voyage To Italy' are always considered the most important. Add to that list this fine drama, in which bourgeois housewife Irene suffers a transformation when confronted with the misery of those who had not been benefited with the European 'economic miracle.' Considered a saint by those she helped (Giulietta Masina included), Rossellini makes quite obvious that Irene reached that state by detouring from the usual roads she took as the wife of a prominent industrialist (Alexander Knox.) Not only has she a Marxist cousin who curiously does not preach his philosophy, but gives Irene advise whenever she talks about the misery she is discovering- but she also ventures into the slums, helps a single mother, a prostitute and a thief. The final section of the movie reminded me of 'María de mi corazón', a latter film written by Gabriel García Márquez, based on a real story. As in 'María' there is neither opportunity nor chance to explain clearly what she's going through to husband or authorities, leading her to a dead end of desperation. Only sainthood will save her from the dehumanization around her.","user":"EdgarST","rank":[20,27]},{"title":"Ingrid Bergman creates an astonishing character!","rating":10,"date":"2 March 2005","review":"I suppose that when \"Europa '51\" was going to be filmed there was a great professional mutual understanding between Rossellini (the director) and Ingrid Bergman (main actress). It's really astonishing the way Ingrid Bergman's face changes throughout the movie. She really looks like a \"human God\" (specially towards the end) just by looking at her expressions. If you have the opportunity of watching \"Europa '51\" twice, you will notice that her character in the beginning of the story, where Irene Girard (Ingrid Bergman) is the mother of a well-off family, is totally different from the last shots. I also like how Irene contrasts with the way of living of the poor children and working-women. Although Rossellini's movie is a bit lengthy, bearing in mind it was made in Italy in 1952, many events occur with short scenes perfectly connected obtaining a gorgeous dynamism as a whole. I'm almost sure that my favorite scene is the same as the majority of the people who watched \"Europa '51\". I refer to the moving ending of the story. I also like how the camera moves around capturing the contrast of expressions between the sick patients and Irene. I encourage everybody to watch this masterpiece, even twice!","user":"ECLIPSE1977","rank":[19,26]}]