[{"title":"existential chase film, largely forgotten, but worth a look.","rating":9,"date":"3 August 2006","review":"FIGURES IN A LANDSCAPE is interesting for a lot of reasons: it was directed by Joseph Losey,it stars a very young Malcolm McDowell and it boasts a script by co-star Robert Shaw.<br><br>The set-up is very existential: 2 men are pursued by a mysterious black helicopter over a rough, desert terrain. We never learn the reasons for any of this or even where it is taking place.The atmosphere of dread is kept at a high level thru-out.<br><br>Everything about the film is as stripped to the basics as the title suggests. The men are never given much more than the briefest of backgrounds. But it is precisely this quality of mystery that gives the film its main points of interest. I would certainly like to be able to see it on a larger screen. The helicopter photography is very impressive and the shots of the two figures traversing the inhospitable terrain are striking.<br><br>Robert Shaw gives a ferocious performance. Malcolm McDowell's part requires him to be more subdued but he is capable and provides the film's main sympathetic character.","user":"raegan_butcher","rank":[35,39]},{"title":"Weird cinema, but worth catching","rating":5,"date":"18 November 2002","review":"Figures in a Landscape is the most peculiar film I've ever seen. I've seen a lot of peculiar films (The Keep, The Island, A Zed and Two Noughts, Eye of the Devil, etc.) but this one beats them all in terms of its curious nature.<br><br>It has almost no plot. What little plot there is details the efforts of two escaped convicts to evade a menacing black helicopter as they flee through the rugged landscape of some un-named South American country. Did they really commit a crime at all? Why does the chopper pilot want to catch them? Who are they? All these questions, so obvious and central to all the other films of this type, are left unasked and unanswered. This is purely a chase for the sake of a chase movie. Everything is left unexplained, and the immediate action is the only thing that is concentrated upon.<br><br>Given the existentialist angle that the film adopts, it is little surprise that it is unpopular.Many people feel cheated by the lack of explanation. I have a soft spot for the film, because it lets me decide for myself what is going on and what has gone before. I feel that Robert Shaw's performance is commanding, and the aerial photography is outstanding. However, I'm not saying that this is some kind of overlooked classic; nor even that it is an excellent film. It's just a wrongly panned film that has enough interesting features within its running time to make it commendable to anyone who has yet to see it.","user":"barnabyrudge","rank":[33,39]},{"title":"Definitely worth the wait","rating":8,"date":"2 June 2005","review":"I spent quite a few pennies to get my hands on this film as it was consigned to oblivion after its brief cinematic release some 35 years ago, and it was money well spent. They certainly don't make them like this anymore. From the off you're thrown into this situation with Shaw and McDowell as two convicts on the run and being pursued by a menacing black helicopter through hostile, mountainous terrain. The aerial cinematography is breathtaking at times, more real than anything you see on the silver screen today, and quite frightening too. The chase becomes personal, with one character hell-bent on destroying the enemy and the other just wanting to escape. It's compellingly brilliant - beautifully shot, in most parts, and well acted. There are some lengthy sequences which the majority of todays directors, and actors, would struggle to pull off without CGI. It does have flaws, most films do, but there are enough positives here and it's a shame it ended up as another of those 'lost' films. Okay we don't find out where they are, although it was shot in Spain, or what crimes they have committed, so what? It's a bloody good film, though I can't help but think, what a film it could have been.","user":"fellowdroogie","rank":[26,31]}]