[{"title":"Slow, Stately, and Magnificent","rating":10,"date":"2 January 2008","review":"WAY DOWN EAST was an old-fashioned melodrama even in 1920 when D.W. Griffith decided to film it. It's the kind of story that leaves itself open for spoofing, but Griffith approaches the story of a \"mock marriage\" and its aftermath with earnestness and a great eye for detail.<br><br>Aiding Griffith in bringing this story to life are three great stars: Lillian Gish as Anna, Richard Barthelmess as David, and Lowell Sherman as caddish Lennox. The supporting cast includes New England \"types\" that almost parody Dickens. Kate Bruce is the staunch mother, Creighton Hale the ditzy professor, Vivia Ogden the town gossip, Burr McIntosh the intolerant squire, Emily Fitzroy runs the hotel, etc.<br><br>The story of love, betrayal, tolerance, and redemption is slow moving and has (as usual in a Griffith film) subplots, but like the very river, all the actions and events slowly come together for the finale that left 1920 audiences in a frenzy. Indeed the ending is among the most famous in all silent films.<br><br>Gish is quite beautiful here. In her opening scene she is in her parlor with her mother making a broom, holding up the straw so that we see only her white cap and large expressive eyes. She's stunning. As Anna she goes through the gamut of shy maiden, young lover, wronged woman, timid servant, and town jezebel. Barthelmess is solid as the young and innocent David who falls in love with the servant girl.<br><br>Their final scenes in the blizzard (filmed on Long Island in a real storm) on the icy river (filmed in White River Junction, VT) are totally amazing. And they did not use stunt doubles. As Gish lies exhausted on the piece of ice she may or may not know that it's heading for the falls. There are scenes were her hand and hair trail in the icy river. Just amazing. Barthelmess uses the breaking ice as a trail so that he can reach Gish before it's too late. There are several shots where he falls off the ice or the ice breaks under him and he plunges into that wintry river. The entire sequence is as thrilling today as it was in 1920.<br><br>Gish once wrote that her long hair froze solid from being in the river water and snapped off with the ice.<br><br>WAY DOWN EAST is a great film.","user":"drednm","rank":[50,51]},{"title":"Fabulous and Frustrating","rating":9,"date":"17 January 2005","review":"This enormously successful film lives up to its legendary reputation. But it's also disappointing. <br><br>The atmospheric splendor of the cinematography and the melancholy mood set by the original musical score (on the Kino Video release) lull the viewer into the sense of reverie essential to appreciating this charming representation of countrified America facing the encroachment of big city evils.<br><br>The story is well-told by director D.W. Griffith, and the moral message of Woman's spiritual virtuosity is exploited without the sermonizing of some of his other pictures. There is a sensitivity and naturalness exhibited in the unfolding narrative of Way Down East and a graceful style seen in none of his other epic-scale ventures. In bringing the sweetness of his famous one-reelers to a major feature film, Griffith captured an almost magical tone and ambiance that distinguishes Way Down East as a masterful piece of intimate storytelling, rivaling Broken Blossoms (1919) in its intensity and sheer beauty.<br><br>However, it must be said that Griffith's sideline excesses in plot development are many and varied, hindering the progression of the central tale of Anna Moore's struggle to escape her past and search out a new life. Annoying bits of slapstick humor, totally at odds with the romance and tragedy of the main story, are indulged in while overly sentimental touches, like long, wistful close-ups, are equally aggravating. <br><br>Though otherwise superbly acted by Lillian Gish (Anna), her role is marred by the fact that some of her more emotional scenes are unnecessarily drawn out by Griffith. This is particularly true in the sequence of the death of Anna's illegitimate newborn.<br><br>Richard Barthelmess, as David Bartlett, Anna's sweetheart and savior, is outstandingly effective, as is Lowell Sherman as the decadent cad Lennox Sanderson who deceives Anna. Not all of the supporting cast was as competent or convincing, due largely to out-of-place comedic impersonations. <br><br>One huge stand out is Mary Hay who leaps onto the screen with a refreshing vivacity. The wit she imparts to her small role is the only really clever humor in the movie.<br><br>Long-forgotten today, but much discussed at the time, was the cameo appearance in the movie's prologue of popular New York society girl Mrs. Morgan Belmont, who played Diana Tremont, one of Anna's snooty Boston cousins. To do justice to her part, as well as to form an exciting contrast to the pastoral images to follow, Griffith went all out in the costume department, hiring top fashion designer Lucile (Lady Duff Gordon) to design glitzy gowns for the garden party and ball scenes.<br><br>Despite some errors in continuity, Way Down East's celebrated climax of Anna's rescue from an ice-flow as it drifts toward a roaring waterfall, is perfectly paced and as thrilling as it must have been to audiences in 1920. Considering the limited special effects of the day, the scenes are amazingly realistic. Gish lying unconscious on an ice cake as it zooms to destruction, her arm trailing in the current, is one of the most familiar silent film shots, even to people who know next to nothing about the genre, and although it has become almost cliché, its power is undiminished. <br><br>As a story, Way Down East is both fabulous and frustrating but its photographic beauty and emotional resonance are almost unparalleled in the Griffith oeuvre.","user":"randybigham","rank":[24,28]},{"title":"Gish brings it home","rating":8,"date":"12 October 2001","review":"Lillian Gish and fellow co-stars really bring home this great drama. It's interesting and exciting and wonderful to watch. Surely a legend of the 20th Century, Mr Griffith outdid himself with this successful film and Gish can only be praised for a great performance. Her pain and despair can be felt in the scene's where she realises she's been 'betrayed' and she nurses her child while he slips from this world. It's acting at it's finest for no words were necessary, it's all in 'the look'. Certainly 10 out of 10, but if I were to make one comment about this film in the negative, it would be it's length. Perhaps 15 to 20 minutes too long. Otherwise it's majestic.","user":"Rainsford55","rank":[16,19]}]