[{"title":"A film that almost never was","rating":7,"date":"16 November 2007","review":"I hate being nostalgic about movies, but I do remember a time when imagination was evident in every part of a production, when film posters were dynamic, visceral and iconic, when films looked like they were shot on film and not an HD camera with a sunset tint, when scores were done by orchestras instead of synthesizers and death metal guitars and, most important of all, when the lack of CGI technology forced the filmmakers into achieving visual effects through more practical means. The 1980s were filled with such movies and, looking back, I am glad that I grew up in that decade. Children now are exposed to altogether soulless movies.<br><br>Set in the late 21st Century, Enemy Mine has humans reaching out into the depths of space after achieving world peace. But a rival species, the alien race of the Drax, don't take to kindly to humans poking about the galaxy and an interstellar war kicks off. A human pilot (Dennis Quaid) and a lone Drac (Louis Gossett Jnr.) crash land on a remote desert planet and learn, the hard way, to stick together if they want to survive. Despite their ultimate conflict they discover that they are not all that different from each other and neither yet both are to blame for the war.<br><br>Enemy Mine suffered from severe problems during production. Apparently the original director, Richard Longcraine (Wimbledon, Richard III), shot the entire film on location in Iceland before being replaced by Wolfgang Petersen who re-shot the whole film all over again but changed the story somewhat in the process. So, in reality, there are two completely different versions of Enemy Mine. One which was released into cinemas that has become a classic in its own right and another that only exists in the vaults of Twentieth Century Fox. I would love to see this alternate cut.<br><br>The fantastic photography and production design look very, very good for a film from 1985. Some of the effect shots and matte paintings are simply gorgeous and the cutting between desert locations and desert sets is almost seamless. This isn't like an episode of the original Star Trek series in which the cast simply take a half hour drive to a bit of desert outside of LA, the desert locations with the matte painting backgrounds look utterly authentic.<br><br>If you like the look and feel of films like The Dark Crystal and Labyrinth then you'll appreciate the fantasy of Enemy Mine. I know I am going to sound like an old coot but they just don't make films like this anymore. Everything these days seems to be geared towards the average ASBO teenage boy. In ten years time I honestly think that films will be no more than a test card that offends and stimulates no one.<br><br>I will consider myself lucky that films like this were once made and that they were a part of my formative years.","user":"CuriosityKilledShawn","rank":[142,152]},{"title":"One of the Ten Best \"Forgotten\" Sci-Fi Classics","rating":4,"date":"4 June 1999","review":"A funny thing happened to me on the way to the video store...I ran across a sci-fi film that didn't rely on space battles, incredible special effects, or magnificent sets and costumes.  Instead, it relies on a touching and compelling human story of survival, hate and conflict - and of bitter enemies becoming unlikely allies and, eventually, close friends.<br><br>\"Enemy Mine\" is one of the ten best \"forgotten\" sci-fi classics - those rare little gems that got overlooked on their initial release, but live on in video release.<br><br>Practically abandoned at the box office, \"Enemy Mine\" found new life on video among fans of the kind of science fiction we only read about as kids - stories that expanded our horizons and made use look at the world in a whole new way, not just wowing us with their dazzling effects.<br><br>It is the story of hotshot starfighter pilot Willis Davidge (Dennis Quaid) who, after a dogfight with the reptilian, alien Drac, is stranded on a hostile planet with one of the enemy.  At first blinded by their hatred of each other, the pair soon learn that they can only survive by working together.  By doing so, they develop a strange friendship that helps break the wall of distrust between enemies.<br><br>If you get the chance to check out \"Enemy Mine\", give it a chance.  It's not likely to go down in history as the best sci-fi movie ever made, but it does have heart.","user":"Headshot","rank":[185,203]},{"title":"A Longtime Favorite","rating":28,"date":"28 February 2003","review":"Maybe I'm dating myself here, but this movie is more than just a movie for me -- it's a childhood memory. My dad (Who raised me on a steady diet of scifi) and I probably watched this movie eight times together before I turned nine, and so part of my love for it stems from the memory of those times together.<br><br>But \"Enemy Mine\" has a lot more going for it than just fond memories. Sure, the effects are pretty bad by *today's* standards (it was the 80's, 95% of Americans didn't even *have* personal computers yet, and by the standards of the day those effects were pretty darn impressive!)  But the story of two people who were trained to be enemies slowly becoming not just friends, but brothers, rings true despite the passage of time. (As Jerry [Lou Gossett, Jr.] says, \"Truth is truth.\") Lou Gossett, Jr. and Dennis Quaid are delightful, as always. And the scenes of Davidge (Quaid) interacting with Jerry's \"son\" are priceless.<br><br>People tend to knock 80's movies, especially 80's scifi movies, as being frivolous, self-centered and silly (like the decade they came from). But \"Enemy Mine\" definitely doesn't deserve this fate.  It is a well-acted, well-meaning movie with a message we could all benefit from listening to.<br><br>Skybright's Score: 7.5 out of 10","user":"Skybright_Daye","rank":[120,137]}]