[{"title":"Marie Windsor's \"a witch...whichever way it's spelled\"","rating":6,"date":"13 July 2002","review":"As mysteries go, No Man's Woman runs in the league of those populous puzzles that fueled so many old Perry Mason episodes: a lot of suspects, one of whom will be fingered.  But the movie preserves a starring performance by Marie Windsor, one of the all-time great broads of post-war poverty-row movies. She leads in more of them than one might think, most of them obscure (if not vanished) westerns, sci-fi cheapies, and crime programmers.  But, top billing or not, we get to see less of Windsor in No Man's Woman that we might like  too many people want her dead.<br><br>Among them: her industrialist husband (John Archer) whom she won't divorce unless he forks over a ruinous settlement; his girlfriend (Jil Jarmyn), whose pleas Windsor coldly rebuffs; Windsor's art critic paramour/business partner (Patric Knowles), who writes puff-pieces for her gallery and gets fired for conflict of interest (today they'd call it `synergy'); her loyal young assistant (Nancy Gates), whose fiancé she blithely tries to steal; and the fiancé (Richard Crane), onto whose boat she invites herself in order to seduce then blackmail him.<br><br>Windsor, as one exchange between characters goes, is `a witch...whichever way it's spelled.'  When her wicked-woman machinations have reached the boil, and just about everyone has indiscreetly remarked how they'd like to see her dead, a 3-a.m. intruder into her studio grants their wishes.  And so the search for the murderer is on....<br><br>Much like the roles Joan Crawford at this juncture in her career was playing in A-productions, Windsor's character is that of an honey-voiced schemer hiding her self-interest beneath a facade of piss-elegance  with every petty victory, the huge orbs of her eyes flash with satisfaction.  She was more memorable in The Narrow Margin and The Killing (better movies), but what she delivers makes one wonder why she never broke out of the B-movie ghetto.","user":"bmacv","rank":[25,26]},{"title":"A must for Marie Windsor fans. Overly formulaic but entertaining.","rating":7,"date":"4 January 2007","review":"Windsor plays a conniving, unfaithful wife whose fed up husband wants to marry a \"nice\" girl and is willing to make her a fair offer in exchange for a divorce. She makes an exorbitant demand and ups the price by 100 grand after he responds by throwing a drink in her face. This is followed by her shocked father-in-law's remark \"no matter how you look at it, that woman is a witch!\" To which his son replies \"no matter how you spell it either.\" A good example of some of the clever (not to mention funny) pseudo-profanity and \"no-no\" innuendo script writers had to develop back then.<br><br>As usual, Windsor plays her part to the hilt and makes a very credible villain. Unfortunately, the script writers went overboard with her character, almost making her a caricature of herself. They exaggerate her \"W\" or \"B\"ness to such a degree that it becomes unrealistic and even comical. What self-respecting cold, calculating gold-digger would publicly commit adultery with her secretary's fiancée before she was done squeezing her husband? Windsor herself seems to display an inner grin even with her nastiest facial expressions. She no doubt realized how ridiculous some of the script was. In the movie, she owns and lives in an art gallery. Since the real Marie Windsor was a multi-talented individual who achieved some success as a painter and sculptress, I wonder if this is simply coincidental.<br><br>I guess one purpose served by making her such a larger than life meanie is to make all the suspects seem equally likely to have killed her.<br><br>A mix of true \"noir\" and standard \"whodunit\" hurt by overdone melodramatics, yet still worth seeing.","user":"guanche","rank":[18,20]},{"title":"A whodunnit where just about everyone had motives to kill her!","rating":7,"date":"18 December 2017","review":"Marie Windsor stars as Carolyn Ellenson Grant, a nasty selfish lady. Her husband is desperate to divorce her, but she refuses and lives a completely separate life on his money. She also has a lover who she uses ruthlessly to get what she wants and along the way she decides to destroy a few lives for kicks. Eventually, she is killed and the police think the husband did it...not realizing practically EVERYONE had motives to do it! Can the poor hubby manage to prove his innocence?<br><br>The first portion of the film is more enjoyable than the last...though it is overall a very good movie. Watching Windsor playing such a conniving and god-awful person is incredibly enjoyable and it's a part that Joan Crawford could have done well in at this time...though Windsor was quite convincing. Worth seeing...and a bit like film noir in many ways.","user":"MartinHafer","rank":[8,8]}]