[{"title":"GOOD COMPILATION FILM","rating":9,"date":"8 August 2001","review":"\"The Bugs Bunny/Road Runner Movie\" is a good example of the compliation film. It's one of those films that are a kind of Whitman's sampler that serves as a good introduction to a wide variety of short subjects. While it is true that these shorts are better seen in their original form, why trash these neat features? At least the Warners compliations are seamlessly edited and the bridging material is often above average.<br><br>It helps to know that this film was originally released as \"The Great American Chase\". In fact, that title is STILL in the film. It is in the opening 20 minute prologue that is engaging and original but irrelevant since the title was changed. Adults will forgive it, but from my own experiences (when I first saw the film 16 years ago on tape), kids will get restless.<br><br>But after that, we get to the good stuff. The film is a sampler of Chuck Jones' work, hence the title \"Bugs Bunny/Road Runner Movie\". Road Runner was Jones' creation as was Pepe Le Pew (both are featured in the film, but the Road Runner gets the bulk of the second half) and Jones reinvented Bugs Bunny in the 50s and 60s from his previous incarnations. There are many good shorts included in the film. Daffy Duck's battle with the animator and his brush. Bugs Bunny vs. Wile E. Coyote: Genius. Classic Road Runner/Wile E. footage. Bugs fights Marvin the Martian on Mars. I can't list them all, but you get the idea.<br><br>Most critics dislike these films because they cut the original shorts. But most of these shorts are edited by Cartoon Network for TV (for time and more recently, racial comments)and precious few are available on video. So we should be grateful that at least there is one way we can at least see these shorts in some format (very little is actually edited, most of the shorts are intact) We can see a lot worse these days.<br><br>**** out of 4 stars","user":"Katmiss","rank":[7,9]},{"title":"an interesting compilation","rating":7,"date":"3 July 2005","review":"In \"The Great American Chase\", Bugs Bunny traipses through his house and tells us the story of chases. To make his point, he shows us several classic cartoons (some starring him) dealing with situations involving hot pursuits. Well, not all of them have chases; some are there just for fun. Bugs remembers how Chuck Jones sent him into space, where he met Marvin the Martian; then how Daffy Duck and Porky Pig tried to colonize Planet X and had to contend with Marvin the Martian; how Daffy (as Robin Hood) had a very hard time recruiting Porky (as Friar Tuck); how Daffy's scenery frustratingly changed every few minutes; how he, Bugs, ended up in a bullfight; how he and Daffy dug into Ali Baba's cave; how he and Elmer Fudd acted out \"The Ride of the Valkyries\"; how Wile E. Coyote tried and failed to eat him; and finally, how Wile E. decided to try something a little more his size, by which we mean the Road Runner. The Wile E. Coyote/Road Runner chase is really the best part of the movie. Overall, it's a pretty neat compilation of classic cartoons, and I liked the scene where Bugs remembers his \"fathers\" (Mel Blanc, Chuck Jones, etc.).","user":"lee_eisenberg","rank":[4,5]},{"title":"Enjoyable feature.","rating":7,"date":"20 April 2001","review":"This compilation of classic WB short cartoons is (expectedly) highly uneven, but generally enjoyable. Among the highlights: Bugs Bunny as a vengeful symphony conductor, he and Daffy Duck arguing about whether it's \"duck season\" or \"rabbit season\" (this sketch has a hilarious punchline), the surrealistic (and also somewhat sadistic!) \"Duck Amuck\", etc. The final \"Road Runner\" segment does go on a little too long. Overall, this is a nice way to spend 95 minutes mindlessly and painlessly, and also a good opportunity to see some of those shorts that you may have missed on TV. (**1/2)","user":"gridoon","rank":[3,4]}]