[{"title":"Extraordinary film!!","rating":10,"date":"20 December 1999","review":"An interesting movie based on three of Jules Verne's novels. Considering the special effects and computer enhanced animation of today, this movie stands as an historic marker of cinematic resourcefulness and imagination. Karel Zeman has brought to life the lithographic images of the original Jules Verne texts. this is a must see for classic science fiction and history buffs.<br><br>I give this movie 9 out of 10. Enjoy!!","user":"oigres","rank":[35,35]},{"title":"A Wonderful Film","rating":9,"date":"9 July 2003","review":"This is one film that I wish they would start showing on television again. When I was a child, I really was knocked out by the special effects.  I'm a sucker for any film that combines live action with animation and this film is no exception.  What really made me take notice was how the sets reminded me of the pages of a book and how the characters were almost like the illustrations come to life.  This is definitely a lost classic and I hope one day that it will be shown on television once again.","user":"Sargebri","rank":[40,41]},{"title":"A wonderful adventure movie with a unique look","rating":8,"date":"10 February 2006","review":"The movie is based on a Jules Verne book I actually have read once, about ten years ago. I remember I liked the book a lot, and this movie does a good job in telling the story. The most important thing in this movie isn't the story, however, but the highly original visual look it has.<br><br>The visuals are absolutely beautiful, and they are apparently achieved by a clever combination of animated drawings combined with live actors, stop-motion animation and sets that are painted so that they look much like from an animated movie. Combined by Jules Verne's own unique versions of airplanes and submarines and Karel Zeman's good directing results in a very well done and convincing visual style that manages to effectively hold one's attention until the end of the movie.<br><br>There are some problems as well, one of the underwater scenes at the end takes maybe needlessly lot of time for example, as the story in the first part of the movie is rushed through quite quickly. None of this matters much though since the movie is always highly enjoyable. A gem that deserves to be more well known for today's audiences as well. A recommended movie for the whole family.","user":"Man_With_a_Harmonica","rank":[18,18]}]