[{"title":"Is there a Maggie out there for ME?","rating":26,"date":"26 February 2003","review":"From a movie I had absolutely never heard of, Hobson's Choice has quickly flown to the top third of my all-time favorite film list. I happened upon this little gem by doing a Charles Laughton search in the video data bank of our university library computer system. I had been hoping we might have The Hunchback of Notre Dame. We didn't, but we DID have this wonderful period comedy.<br><br>Set in Salford, England in the 1890s, this David Lean film brims with good humor, spunk, fine black and white cinematography and absolutely first-rate acting. Charles Laughton plays Henry Horatio Hobson, a typical successful late Victorian Era businessman. One can almost picture him singing `A British bank is run with precision; a British home should expect nothing less,' as David Tomlinson would croon a decade later in Mary Poppins. A widower with three grown daughters, Hobson fancies himself to be king of his castle. Of course the daughters really wield the power-especially Maggie (Brenda de Banzie), the oldest.<br><br>When Hobson determines to marry off the two younger daughters, but declares Maggie too old for marrying (at 30), she takes it as a challenge. Virtually demanding marriage and a business partnership with her father's best shoemaker, Willie Mossop (John Mills), she engineers not only her own marriage but that of her sisters, as well.<br><br>Laughton was a true talent. I had never seen him do comedy. His round, rubber face is as expressive in Hobson's Choice as any comedian I have seen. His commanding stage presence is obvious. Many scenes stick in the mind, such as Hobson marching huffily toward his favorite watering hole, his lackey right behind him. With spirited march music playing, they stride through the street, making an amusing visual contrast. Laughton is tall, erect, and extremely rotund. He is headed straight forward, head held high and back arched proudly, as any proper self-made English gentleman of his day would be. His friend is perpetually hunched toward his benefactor, his thin, frail frame turned partially toward Laughton as he walks, intent on hearing and agreeing with every word Hobson utters. Others have already commented on the moon scene and his charge up the stairs after a night of drinking, both of which were delightful.<br><br>Of course de Banzie is magnificent as Maggie and Mills is great as Willie. His growth as the movie goes along is gradual and natural. The excitement of going out on their own, getting a loan and buying the needed supplies to open a business certainly connects with me. I have been there twice, although ultimately failing (at least on the bottom line) both times. Had I had a Maggie to support, encourage and inspire me, as well as to tend to the business side of things, I really believe I would have succeeded like Willie does. (Any Maggies out there???)<br><br>Daphne Anderson and Prunella Scales are very good as the attractive, but spoiled younger sisters. Obviously Maggie was raised in the earlier days when Hobson was building up his business and Vicky and Alice after he had acquired much of his affluence. The whole cast is extremely sound and Lean's direction is superb. I find myself surprised that I had NOT heard of Hobson's Choice. This is a dandy little film and a real plumb to have found as I found it. If you want to see a great film, either watch Hobson's Choice or watch another film with the VCR/DVD player unplugged. How's THAT for a `Hobson's choice?'","user":"mlevans","rank":[84,88]},{"title":"undemanding fun","rating":28,"date":"28 October 2003","review":"A far cry from the pomp and spectacle of Lean's later, grandiose productions, this gently romantic comedy of manners is based on Harold Brighouse's 1915 play, and sits alongside Great Expectations and Brief Encounter as one of the best films he made in black and white. Lean's restrained direction allows the sparkling scripts pithy banter plenty of room to breathe, whilst deftly avoiding the static wordiness inherent to most stage for screen adaptations.<br><br>At its core, Hobson's Choice has a towering performance by Charles Laughton, whose Henry Hobson is a marvelous mixture of snarling brute and whimpering child, huffing and sputtering his way through scene after scene of delightfully sexist dialogue. Crucially however, Laughton resists the temptation to go over the top, instead keeping his Hobson firmly on the plausible side of caricature, thus ensuring that the pathos of this potentially unlikeable character remains firmly intact, and whilst we eagerly await his comeuppance, we never lose sympathy for the curmudgeonly old fogey. Also outstanding is Brenda De Banzie as the long suffering but incredibly strong willed Maggie, an amazingly strong female character, made all the more remarkable given that the film has its origins in a text now 90 years old.<br><br>The crisp black and white photography, courtesy of Jack Hildyard(who also collaborated with Lean on his epic Bridge on the River Kwai) is stunning, beautifully capturing the grimy charm of its Victorian setting, and giving a vivid sense of gritty imtimacy to the dank interiors. Scenes featuring a drunken Hobson are gloriously realised, and gives rise to one of the films most enduring images, that of Hobson attacking the moons reflection in a puddle. Likewise, production design is impeccable, the crews recreation of Victorian era Salford even stretched to Lean throwing rubbish into the river Irwell(the council, on hearing that a film was to be made on location there, spared no expense clearing the riverbanks and water of any such refuse the week before cast and crew arrived, oblivious to the fact that this disarray was precisely the reason Lean and co. had chosen to shoot there).<br><br>This amiable comedy is often overlooked in favour of Leans more epic works, but to dismiss it out of hand as something the director cut his teeth on before moving on to better and brighter things would be a grave error. Its unassuming nature, and admittedly slightly saggy third act aside, it's a film with considerable charm, wit, eccentric characters and some hilarious set pieces.","user":"robot_sex","rank":[51,55]},{"title":"Perfect film","rating":10,"date":"11 July 2002","review":"Made by one of the greatest practitioners of film making ever, this is a superb story with excellent characters. I defy anyone not to enjoy Charles Laughton's towering performance. There is so much in this film to revel in. I love the way the men constantly think they are running the show when in fact the women are. Laughton clings on to the last vestiges of male power but is no match for his intelligent daughter played by Brenda de Banzie. The opening shot alone is superb with the wooden boot creaking in the wind. Although this is a slightly ominous first shot, the film soon becomes peppered with touches of comedy throughout. The scene when Hobson walks back from the Moonrakers pub is wonderful and sublime. Purely magical cinema as he looks at the moon reflected in the puddles and tries to catch it. Lean lets us take in the scene instead of rushing it. This film is often overlooked when people talk about Lean's oeuvre. I have no idea why.","user":"ellkew","rank":[48,53]}]