[{"title":"This one will lift your spirits - Guaranteed!","rating":7,"date":"6 August 2005","review":"Elvis made quite a number of movies. Most of them of the cookie-cutter, formula variety designed to showcase his wonderful voice, a fact that should surprise absolutely NO ONE. Lets face it guys, Elvis achieved his fame by way of his singing, not his acting. His selection of movie vehicles (especially later in his career) is ample proof of this.<br><br>Having said this however, The King was not without some native ability as an actor, both dramatic and comedic.<br><br>As proof of this I give you his two best movies: King Creole, in which he gave a very credible dramatic performance (and right along side the likes of Carolyn Jones, Walter Mathau and Dean Jagger no less); and this movie - Follow That Dream.<br><br>Follow that Dream is a wonderful piece that has several things going for it: To begin with, it was a straight comedy, his first and best. Very different from his earlier films where he played characters (like Danny Fischer in Creole) that were somber and even dark).In contrast, his portrayal of Toby Kwimper was innocent and fun. The chemistry between Toby and his father (Arthur O'Connell) was terrific. Second, the theme of the movie is a crowd pleaser. Its story line is pure \"David and Goliath\" with the State playing the role of the pushy and overbearing villain. And finally, there are the songs. What can I say folks the musical score is the King at his best. The score includes a perfectly lovely ballad - \"Angel\" together with two positively jubilant toe-tappers \"What a Wonderful Life\" and the title song \"Follow that Dream\".<br><br>One last comment: This movie lifts my spirit, and makes me happy. Now I know those are two perfectly ridiculous reasons to like a movie but, fact is, there are far too few movies that do that for me now-a-days and this movie is one of them. It may not be academy award material (I gave it 7 out of 10) but if you need something to put a smile on your kisser, this one is worth your while.","user":"dwoolsey90-1","rank":[43,45]},{"title":"Florida, Elvis style","rating":8,"date":"22 September 2005","review":"This is one of Elvis's best films in my opinion. And one where he extended his range a bit. Usually he plays he troubled youths, or confident smart people who are trying to prove themselves. Here's he's an innocent in the world and it's a tribute to his acting skills that he was acquiring that he didn't descend into being Gomer Pyle.<br><br>Of course the film is greatly helped by the title tune which in my opinion is one of his best movie songs. Follow That Dream rightly belonged among Elvis's golden hits.<br><br>With an innocence here that rivals even Stan Laurel or Harry Langdon, Elvis manages to defeat some pretty sharp characters. The film itself has a charming innocence about it that makes it thorough going fun.","user":"bkoganbing","rank":[26,29]},{"title":"This is my favorite Elvis movie!","rating":10,"date":"7 November 2003","review":"Most of his movies I've seen seem to be an excuse to have him sing songs. However, this one has a plot and good acting. It's a lighthearted story that is a joy to watch each time I see it. The comedy is great. Elvis' portrayal of Toby is SUBERB!! Even knowing the jokes that are coming I can't help but laugh because they are done so well. I prefer this movie over any other he made.","user":"kiddtaylor","rank":[23,26]}]