[{"title":"I'm on your ass 'til you crack! And when you do, I'll be there to blow you straight to hell!","rating":4,"date":"5 April 2009","review":"Who would have guessed that there was a Fred Williamson picture out there that is not worth watch? Worse yet, he produced and directed it, so he has no one else to blame.<br><br>It was a cop picture, and he is after the baddies that killed his partner, so you would expect plenty of action. You would be wrong. It just plods along with nothing special to excite you. Heck, even when Williamson and Maud Adams (the double Bond Girl) get in bed together with a smooth jazz background, the song ends and the scene changes just as they are getting started.<br><br>A little action at the end doesn't make up for slow pace for the first hour or so.","user":"lastliberal","rank":[6,7]},{"title":"Williamson's Cool Reflex","rating":10,"date":"17 February 2005","review":"The shooting title for this film was \"Soda Cracker,\" somewhere along the road the title of the film changed and \"The Kill Reflex\" is what we've got. Fred Williamson's character is nicknamed Soda Cracker (something his friends gave him). He's a \"shoot first - ask questions later\" Chicago cop, on a mission to track down the killer or killers who offed his partner; all this on his birthday no less. His superiors want him off the case, but that doesn't stop Soda from bustin' heads. The production costs are low, but the thrills high. And don't miss the super-cool conclusion where The Hammer jumps on the side of a train to catch the main baddie as he speeds away in his car - this is really one of The Hammer's coolest moments. Other things to watch for include: the super-sexy Maud Adams, the super-cool Bo Svenson, and the super-funky end credit theme song: \"Soda Cracker!\"","user":"DrunkenMaster2000","rank":[10,17]},{"title":"Possibly the worst cop movie ever made - LOTS OF SPOILERS","rating":1,"date":"23 March 2007","review":"Why would I sit down to watch a movie with the unlikely title \"Soda Cracker\"? Because the description said it was about a Chicago cop, and I'm a sucker for movies with Chicago scenery (having moved away from there many years ago). The first few minutes were rewarding, with lots of downtown shots (a few rather poorly framed, I'll admit). Then the list of clichés begin.<br><br>Cool hip black cop...scruffy white partner with whiny wife: \"You don't spend enough time with the kid.\" \"OK, I promise to come home early.\" So of course you know who gets blown away, right? Black cop vows revenge on the assumed killer. Grumpy old boss cop (one of the worst acting jobs in the film) of course says, \"You're off the case! Case closed! Don't touch the case!\" So of course we know what Soda will do.<br><br>More clichés: Cool sexy new partner. Cops on the take. A sexy night club singer (who actually sings an ENTIRE LONG song...probably Phyllis Hyman's exchange for acting in this dud). A ripoff of THE DEAD POOL, but with a toy helicopter instead of a toy car. Cop widow vowing to keep her kid away from cops. AARGH! Will it never stop? <br><br>There are even DIRECTORIAL clichés, like after the interminable gun battle at the end. Gunplay stops, everyone looks dead. So we get \"quiet scenery\" shots of the farm where the battle took place. You know, the usual thing. But they go on and on...five shots, six shots, seven shots...haven't we seen the whole freakin' farm by this time? Then the gunfight starts up again.<br><br>The music score is a load of 80s synth-score clichés with blips and blurps and drum machines. But to wrap it up, we have the worst closing theme song of all time, with these classic lyrics: \"Chicago cop, Chicago's finest. They call him Soda Cracker, but that's just a nickname.\" Wow, wonder how long they worked on THOSE lyrics! This is the kind of film you should watch when you're having some goofy friends over for a party. See who can guess the line before the characters say it, or predict the next plot twist. Worth watching only because it is the epitome of everything that can be done wrong in a cop film.","user":"LCShackley","rank":[3,5]}]