[{"title":"I know bad when I see it...","rating":7,"date":"6 June 2005","review":"I know bad when I see it. As a MST3K fanatic, I've seen the worst of the worst and loved every minute. I rented Killer Klowns thinking it would be so bad I'd groan and laugh the whole way through. <br><br>Gasp, Killer Klowns isn't bad at all- it's creative and funny. This movie doesn't take itself seriously, and that makes for fun time for everyone. <br><br>It's a contemporary monster movie with a 1950's Blob-ish feel. The Chiodo Bros. demented sense of humor, simple and coherent plot, kreepy-looking klowns and decent cast of actors makes for an entertaining Friday night movie.Pair this one up with The Lost Skeleton of Cadavra and you've got yourself a great double-feature.","user":"electronsexparty","rank":[82,95]},{"title":"Seriously deranged cult-stuff!","rating":7,"date":"5 May 2005","review":"Yes, this movie really does handle about evil aliens, shaped like clowns, that strand near a remote American village. Their circus tent mysteriously appears in the woods after a meteorite crash and the klowns (yes, with a \"k\") go on a rampage in the village to turn people into cotton-candy with their funky armory. Their mission is to take the human snacks back to their planet but a team of local dummies makes a counter-attack in their ice cream-truck! This movie unquestionably has the most absurd premise in cinema ever and you either love it or downgrade it as being a ridiculous piece of trash. I am a great fan of this campy horror-comedy flick and I can't possibly say anything negative about it. My best defense for this movie would be that it is an ingenious and successful attempt to parody and homage the 50's and early 60's SF classics in which paranoid people witnessed alien-invasions from all over the universe. But actually, the silliness of this movie doesn't require justification at all. It feels like the idea started out as a joke between 3 brothers and eventually it resulted in a long-feature film. The acting isn't very impressive (apart from veteran actor John Vernon in a great 'angry old copper'-role) and the dialogues are unimaginably dumb. On the other hand, the clown-costumes are terrific and the least you can say about the plot-twists is that they're creative (a Godzilla-clown, anyone??). So, in case you have only the tiniest sense of morbid humor in you, I strongly recommend tracking down this \"Killer Klowns from Outer Space\". It will, without a doubt, be one the most bizarre film projects you ever laid eyes on.","user":"Coventry","rank":[74,88]},{"title":"A bunch of aliens clowning around","rating":6,"date":"10 April 2006","review":"When it comes to silly movies, they don't get much sillier than this one. The title says it all, and its clear going into a movie called 'Killer Klowns from Outer Space' that you're not exactly going to be in for a serious ride. To be honest, I can't say I was overly enthused with this Sci-Fi spoof, but it's not hard to see why it's got a cult following. The film takes in the idea of clowns being eerie and frightening, and fuses it with the common theme of aliens coming down from space; thus giving us aliens that look like clowns. For what it is, the film is actually quite inventive; and while much of the action is clichéd and/or samey, it's the little things that ensure it doesn't get boring. As mentioned, the plot follows aliens from space that look like clowns. When their spaceship (a tent) lands in the forest, two kids rush to the police headquarters to tell the law that their town is being invaded. If someone gave me that story, I'd definitely believe it; but the law in this town is slightly more sceptical, and while the kids aren't being believed; the clown population is growing.<br><br>One thing I do like about this movie is the special effects. Rather than simply having the clowns being played by men in make-up and baggy clothes, director Stephen Chiodo has opted to make actual suits for the villains. The special effects are a lot like those seen in Tim Burton's Beetlejuice in the same year, and bode well with this absurd plot line. The style of the movie is consistently clown themed, and parts of the film such as the climax on the alien spaceship look great. The acting is typical B-movie, but the movie does benefit from several good performers. The young cast perform well enough with energetic performances that, like the rest of the movie, aren't delivered too seriously; but the standout is veteran actor John Vernon, who is great in the role of the sceptic police officer. The 'horror' in this movie is hardly potent, as much of it is sapped out because of the fact that it's all a big joke - but ideas such as people being cocooned in candy floss or eaten up by a shadow puppet are surreally frightening. Overall, this isn't a favourite of mine; but it offers ninety minutes of good fun and there's no real reason to hate it.","user":"The_Void","rank":[31,35]}]