[{"title":"Admirable stab at Melville fable (warning: reveals plot points)","rating":8,"date":"8 October 1999","review":"Peter Ustinov is generally a lot better at being a raconteur, chat-show guest and portly, engaging presenter of documentaries than film director, but this adaptation of Melville's short novel (note that the screenplay is based on a previous stage version) is surprisingly gripping.  Terence Stamp, in his first movie role, is excellent as the benign life-force, Billy. Pressganged into service aboard a Royal Navy Man'o'War (clunky symbolism - the ship Billy leaves is called the \"Rights of Man\"), he soon wins over the crew with his guileless respect for justice and fair play.  Robert Ryan is superb as Claggart, although perhaps this actor's tremendous capacity for sheer charmless evil overbalances the plot.  When Claggart is struck  down by the momentarily enraged Billy, he dies with a smile on his face, a detail which isn't in the book.  It makes Claggart into  a malevolent genius, when Melville wrote him as a preternaturally bitter and empty man.  But that's showbiz for you.<br><br>There's a lovely scene between Stamp and Ryan, presumably missed by those who refuse to recognise the latter's genius, in which Billy almost manages to win Claggart over; you can see Ryan's eyes getting almost misty (he was a great eye actor) as he contemplates the spectacle of his own bleakness compared to Billy's warmth.  But then, as he suddenly growls \"You would charm me, too.  Get away!\"  it's as if he suspected Billy if coming onto him.  Remarkable touch.<br><br> John Neville and David McCallum are fine as the officers with tortured consciences; Ustinov has to carry off the difficult moral turnaround, kind of the opposite of what Fonda spends a whole film doing in \"Twelve Angry Men\", and has seldom acted so well.  Perhaps in the book he's a less significant character, but for dramatic purposes the role obviously needed expanding, and it's done with taste and restraint.  Supporting roles are all finely rendered, with Melvyn Douglas especially red-eyed and gravelly as the religious Dansker.  Good stuff.  And unusually for an adaptation, a sizable chunk of the dialogue is authentic Melville.","user":"Lexo-2","rank":[51,52]},{"title":"Ryan's 'Claggart ' Unfogettable","rating":9,"date":"12 March 2006","review":"A nice, innocent kid getting brutalized by an incredibly-sadistic 1700s ship officer is not always easy to watch, but this is one of the better under-publicized films of its day. It sill holds up, some 40-plus years later, and I'm still wondering when a DVD will come out. The great cinematography alone makes this cry out for a good DVD transfer.<br><br>It was an apt choice to cast Robert Ryan as the sadistic \"Claggart.\" Ryan played mostly villains in his career and is extremely effective in that role here as an intelligent-but-sick-and-vicious bully. In fact, his character in Billy Budd remains one of the most memorable villains I've seen in a half century of movie watching. It isn't just his deeds. The looks on his face alone as he delivers his lines make him fascinating. <br><br>Peter Ustinov gives a great performance as the captain of the ship and a man who has to make a big, big decision about Mr. Budd, played by a young and boyish-looking Terrence Stamp. The character \"Billy Budd\" is about as pure and innocent as some of the characters Jennifer Jones played in the 1940s, such as Cluny Brown, Bernadette Soubirous or Jennie Appleton. Also of interest is Melvyn Douglas as the aging seaman.<br><br>This is simply a powerful and very involving film, one that is hard to forget.","user":"ccthemovieman-1","rank":[60,62]},{"title":"A Half Forgotten Classic the Deals with Good an Evil","rating":17,"date":"17 July 2002","review":"This film which was made at the now legendary, Allied Artists Studios (cough cough) is nothing short of a Masterpiece.  Filmed totally on board a reconstructed Man O'War, it features Oscar level performances by Peter Ustinov, Terrance Stamp, Melvin Douglas and the performance of a lifetime by Robert Ryan (as Klaggart, the very human manifestation of evil). If one accepts this movie as a biblical allegory, then it could not end any other way.  This is not your typical Hollywood fare, it is filled with intelligent performances, and good direction under difficult conditions. And it's in glorious black and white.","user":"StarCastle99","rank":[36,37]}]