[{"title":"Overlooked 80s cult horror.","rating":17,"date":"17 November 2001","review":"Philippe Mora does has made lots of very strange movies in his underrated career, some good, some truly awful. This is one of the better ones. If you analyze the plot too much the holes become big enough to drive a truck through, but just ignore the urge to do that, and you'll find you're watching an near-classic of transformation horror.<br><br>A newly-wed (Bibi Besch) is raped by a mysterious beast on her wedding night. Seventeen years later her son (Paul Clemens) is dying of an unknown illness. She and her husband (Ronny Cox) return to the scene of their past trauma to try and get some answers. They find some strange townsfolk who appear to be hiding some mysterious secret. Exactly what it is I won't say. It would not only spoil the movie, but I must admit I'm a trifle confused myself at the \"explanation\" for the weird events depicted on screen! Like I said, think about it too much and you'll ruin it. Just go with the flow...<br><br>'The Beat Within' contains plenty of creepiness and some gruesome murders. An added attraction for film buffs is the interesting supporting cast, which includes Peckinpah veterans R.G. Armstrong ('Predator'), L.Q. Jones ('Casino') and Luke Askew ('Easy Rider'), and character actors Don Gordon ('Out Of The Blue') and Mora semi-regular John Dennis Johnston. ('Flesh &amp; Blood')<br><br>'The Beast Within' rarely gets mentioned in discussions of 1980s horror movies, but it should. It may not be up there with the best of Cronenberg, Carpenter, Romero, or Raimi, but it's well made, original, strongly acted, and damn good fun!","user":"Infofreak","rank":[32,36]},{"title":"An atmospheric, underrated 80's creature feature.","rating":9,"date":"22 December 2008","review":"One of the better, and most overlooked, monster films of the 80's is this fun and effectively creepy B horror film.<br><br>On a dark and stormy Mississippi night, a woman is attacked and raped by a mysterious monster. Now, seventeen years later, her ill teenage son is starting to display some murderous behavior that keeps getting worse...<br><br>The Beast Within (based on the Edward Levy novel of the same title) is too often bashed by critics. Many complain that the storyline is convoluted, but frankly if everything were explained it would lose its sense of chilling mystery. There is much to be enjoyed in this off-beat creature flick. The story is nicely creative with a hint of old school horror and a good dose of building tension - all of which is dotted with some startlingly good murder scenes. The gruesome makeup effects aren't bad, this film has one wild transformation scene. Direction wise Philippe Mora does well in giving the film a great southern Gothic vibe as well as an oppressing atmosphere of dread.<br><br>The cast holds their own too. Ronny Cox (of Deliverance fame) and Bibi Besch do solid performances as the understandably troubled parents of our title character. Paul Clemens is also good, and strangely alluring, as the teen with the savage side. Supporting performances from Don Gordon, R.G. Armstrong, Katherine Moffat, and L.Q. Jones are good too.<br><br>The Beast Within is one under praised horror film. So what if there's a few plot holes, so what if it doesn't follow the book it's based on to the letter - it's a truly memorable horror ride that never has a dull moment. Check it out creature feature fans.<br><br>*** 1/2 out of ****","user":"Nightman85","rank":[18,20]},{"title":"A Beastly B Movie","rating":6,"date":"2 March 2008","review":"\"The Beast Within\" was a staple of TNT's MonsterVision many years ago, and its unique (yet often convoluted) premise reveals why: how many movies have featured a bloodthirsty cicada monster? Based on the novel by Edward Levy (adapted by future \"Child's Play\" director Tom Holland), the plot has happy newlyweds Ronny Cox and Bibi Besch running afoul of terror along a backwoods Mississippi road, where Besch is raped by some vague, subhuman creature; 17 years later, son Paul Clemens is exhibiting some extreme growing pains that include the occasional ghastly murder when his parents return to the scene of the crime looking for answers. While the plot never really comes together as well as it should, \"Beast\" is a model of B-movie efficiency that utilizes atmosphere, location, and some supremely grotesque special effects to leave the viewer rattled (director Philippe Mora also has an excellent grasp of light and shadow to create mood). In hindsight, the film has the type of contained, small-town-America aesthetic that has become the watermark of Stephen King's prose, and the cast is appropriately comprised of rather typical faces, not marquee stars. In the end, \"Beast\" is a wonderfully ghastly little flick with a creepy story that's executed just well enough to overcome some poor acting and an occasionally sluggish pace.","user":"Jonny_Numb","rank":[14,17]}]