[{"title":"Superbly Shot Noir","rating":9,"date":"18 November 2004","review":"The star of the film is really Figueroa's cinematography. He turns a few recurring motifs (e.g the dance sequences, the staircase to the heroine's apartment) into anchors. That and the rock-solid acting help give the melodramatic plot enough weight to work as a sort of lower-class tragedy. The story is simple. A woman works as a dance hall girl in order to put her sister through boarding school, the sister's only chance to make it out of the otherwise impenetrable class barrier. She runs into trouble with a third-rate hoodlum over some money they win in a dance contest. That relationship eventually undoes her. Figueroa shoots the film in high-contrast black and white with intensive use of spot lighting. This gives even continuous group scenes something of the feeling of montage. This gives him a continuous palette of edits ranging from soviet-style montage, to rapid cut closeups of individuals lit by themselves, to medium range scenes where the characters are foregrounded and backgrounded using spots, all the way to simple outdoor scenes shot in natural lighting (reserved for moments when we are in or near high-society). The music is quite good. The egregiously sexual dances give one a much clearer sense of the emotions driving the Salon than any description could. The bookend mariachi \"Si Juarez..\" (If Juarez had not died) is amazingly poignant close to the story. This film belongs to a rather common genre in Mexican cinema: the cabaretera film (stories about lower class women who work in dancehalls). Two other examples worth watching from the same genre, both available on DVD: La Aventurera, and Victima del Pecado.","user":"kinaidos","rank":[15,16]},{"title":"still near the peak of epoca dorada cinema from indio fernandez","rating":10,"date":"26 August 2005","review":"I finally got a chance to watch this by moving to Mexico and buying the DVD (143 pesos, or about US$13.50). You can get it on ebay occasionally and i think its well worth the asking price. The image has been digitally restored and it has both Spanish and excellent English language subtitles. I don't know why these haven't been made more widely available in the us yet.<br><br>Anyway, regarding the film: I was expecting it to be \"hopelessly dated\" as per a prior review and was pleasantly surprised to find this among Indio's more sophisticated works. I also liked the fact that he took a different turn and left the country for the big city. Gabriel Figueroa took advantage of the urban scenery with some great shots of the Zocalo, old town callejons, and dancing in the fabled danzon cabaretera. The story is never overwhelmingly complex but the acting is routinely superb and Fernandez manages to subtly lace the ambiance with the same universal human themes from his rural dramas; he was as much a student of Renoir as he was of Eisenstein.<br><br>Definitely give Salon Mexico a look if you get the chance. I guess you could call it \"hopelessly dated\" if you feel the same way about Casablanca or Double Indemnity. But then again you would be saying more about yourself then the film you are reviewing!","user":"ixta_coyotl","rank":[14,18]},{"title":"The real, made-in-Mexico thing. Not like mod, fake tabletops made in Australia.","rating":6,"date":"7 October 2002","review":"Quintessentially full of cliches and , unlike 'Enamorada' or 'Maclovia,'very dated but still interesting. Excellent rumberos and mariachis. On the trivia side, this was the very cabaret wherefrom American composer Aaron Copland, between pints of excellent lager beer, extracted inspiration for his ballet score of same title. On the facetious side, this is the very cabaret wherefrom Ms Nicole Kidman and a bunch of Australian pseudo-geniuses extracted inspiration for a rather recent plagiarism entitled 'Molino Rojo,' or  some stupidity of the sort. Only this is the real thing. Marga Lopez is much better than Kidman, Ramón Inclán (the unforgettable blindman of Buñuel's 'The forgotten ones') is MUCH, MUCH, MUCH better than that poor McGRegor thing and Rodolfo Acosta does have the REAL ways of a pimp. This TASTES like bas-fond. This IS authentic choreography, not extraordinary but still...","user":"jgcorrea","rank":[14,20]}]