[{"title":"Great Super Hero Movie","rating":8,"date":"23 June 2005","review":"This role is one of Ritters' best performances in a highly acclaimed career. His portrayal of a really nice and well-meaning guy, who has to make a tough ethical decision to help him pay his bills, is thoughtful and funny at the same time without being over-the-top Jack Tripper funny. Ritter and the Director give a great real-world look at super-heroes. How does he get to crime scenes? Can he dodge bullets? Where does a super hero get medical attention? <br><br>In a way it's sort of a misnomer to call him a super hero since he doesn't actually have any super powers, but his willingness to put himself in danger to help others is the core value that all super heroes must have. The fact that he goes out and tries to stop crimes anyway, without super powers, makes him even more courageous than a true comic book hero in a way.<br><br>Before movies like Unbreakable and Spiderman came along I called this movie the best super hero movie ever made. No special effects other than a few fires. No flying through the air. Just a real guy showing that courage and caring are what's really important. One of the best feel-good endings of any movie ever made.","user":"faolan-2","rank":[13,14]},{"title":"John Ritter is Charming!","rating":1,"date":"1 September 2004","review":"John Ritter is charming in his role as Steve Nichols. This movie is great, a cute comedy/drama that is sure to win your heart. John's character's charm is reminiscent of that of Jack Tripper. The character of Steve Nichols is sure to capture your heart while the story itself leaves a good feelings. Comical yet there's some real feeling in it. A story about a wannabe actor turned hero, what's better than that. I was a little worried about the whole Captain Avenger thing but its played out very well. And there are some very funny moments in this movie. Definitely a good movie to watch on a rainy day! And if you have seen it, but not in a long time, it's worth picking up again!","user":"LindsayBoo","rank":[9,10]},{"title":"Simple yet Powerful","rating":10,"date":"5 September 2001","review":"I love this movie. John Ritter portrays a classic good guy. - He's a struggling actor who was wearing a Captain Avenger costume to promote its film along with over 20 other actors throughout New york City. After doing the promotion, He was still wearing the costume under his coat while a shopping at a corner grocery store when it gets robbed. He removes his coat and prevents the robbery. The media gets word of a person wearing a Captain Avenger costume stopping a crime and wonders if he will reappear. John Ritter's character feels good about what he did and decides he wants to more. He prevents another crime and gets injured. He also gets locked out of his apartment for not paying his rent, so woman across the hall to gives him a place to stay while he heals. Politics get involved before the suspenseful ending -- This is a feel good movie with romance and a great suspenseful ending.","user":"thecoolestmike","rank":[11,15]}]