[{"title":"Where is she going?","rating":8,"date":"24 August 2005","review":"This film showed the arrival of Laura Dern, one of the most gifted actresses of her generation, to full realization. Under Joyce Chopra's direction, Ms. Dern proved she could carry this picture, as well as any other, just on the strength of her portrayal of Connie, the rebellious California teen ager, who experiences life and cruelty in ways she never expected.<br><br>If anything, the film might send some viewers to read some of Joyce Carol Oates novels for she is an original and important voice in American letters. Ms. Joyce is a prolific and generous writer who shows a sensibility toward young women in trouble, as it was the case with her magnificent \"We Were the Mulvaneys\", among other novels.<br><br>When we first meet Connie, she seems to be a careless teen ager from rural California, hanging in the local mall with her best friends Jill and Laura. There is trouble at home. Connie is a rebel and her relationship with her mother, Katherine, is not exactly the best. Connie is seen with Laura experiencing with local boys the rituals of flirting.<br><br>Connie gets much more than what she bargains for, when the mysterious Arnold Friend keeps turning at the hamburger joint where she hangs out with Laura. Arnold is a creepy individual who, being older, and more experienced man in matters of sex, shows up one Sunday, while her family is away, to entice the young girl with his \"smooth talk\". This long sequence shows Connie as the vulnerable young woman she is, accosted by a young man intent in getting what he wants.<br><br>To say that Laura Dern is perfect in the film, is not to do her justice. She is the whole movie. Her expressions, her reactions, are nothing short of what one would expect from a young woman in the same situation. Treat Williams makes a great appearance as the menacing Arnold. Mary Kay Place, as the mother is also good, as well as the rest of the ensemble playing cast.<br><br>Joyce Chopra shows she is a director who likes to takes risks by creating an original film out of Ms. Oates short story.","user":"jotix100","rank":[24,30]},{"title":"Insightful, realistic coming of age film","rating":21,"date":"21 February 2000","review":"This film is one of the most realistic \"coming of age\" films I have seen. In fact, parts of it gave me deja vu when I remembered the summer of my 15th year when my best friend and I first discovered we were attractive to men and didn't know quite what to do with that knowledge, as we made the transition from \"little girl\" to \"woman.\"  The main character, Connie, is clearly torn between wanting to bond with and be a part of her family and wanting to exert her independence, and trying to balance all of her roles as she grows up.  The best part of the film - which is a small moment actually, but very powerful - is when Connie plays James Taylor's Handy Man and her mother listens to it in another part of the house - that scene shows that mother and daughter are both going through \"growing pains.\"  Although the ending was a downer, it is worth seeing the film for Laura Dern's brilliant performance.","user":"divamom222","rank":[16,19]},{"title":"A Must-See for Laura Dern Fans","rating":8,"date":"27 August 2005","review":"Adapted from the short story, \"Where Are You Going, Where Have You Been\", by Joyce Carol Oates; this slow paced and moody film is for those who like introspective stories where you spend a lot of the viewing time in self-analysis rather than character identification. The mood is complemented by a lot of James Taylor on the soundtrack with \"Handyman\" repeated several times.<br><br>It is also one of those \"axe to grind\" films where fans of the short story feel compelled to whine about the adaptation not being faithful to their interpretation of the book, although Oates endorses it without reservation on her website. Any non-readers considering viewing \"Smooth Talk\" would be wise to remember the source when reading negative comments from this group. <br><br>To reach feature length it was necessary to expand on the short story and to dramatically depict events that are just briefly mentioned in the original version. Everything is still told from the point-of-view of 15-year-old Connie, increasingly estranged from her mother and marveling at her new-found attractiveness to boys. Fans of Laura Dern who have not seen this should seek it out as she gives an remarkable performance, arguably her all time best. Perfectly cast physically as a gangly coming of age teenager Dern plays Connie with such restraint and awkward hesitancy that anyone with acting for the camera aspirations should view this simply as a perfect example of the power that can be produced by underplaying a character.<br><br>The ending is restrained as well, making it unexpectedly powerful and haunting. They go out with Connie and her sister slowly dancing to \"Handyman\", leaving the viewer to process what has been shown and what has been implied. <br><br>Then again, what do I know? I'm only a child.","user":"aimless-46","rank":[21,28]}]