[{"title":"Ahead of it's time","rating":10,"date":"18 June 2005","review":"Wargames was a movie that was way ahead of its time. No one was making films about hacking into computer systems. The only computers used in movies were on space ships. No home computer has ever really been brought to the big screen. Wargames broke from the normal studio sci fi norm of either Earth being visited by aliens (E.T) or battles of Good and Evil in space (Star Wars, Star Trek). With the raise in hacker crime rate now, and seeing how Dependant we've become on computers, Wargames was a movie with it the eye on the future. Imaginative story, great cast (who, despite other reviews, do not phone it in) Wargames is a true gem, as it was recently listed by AFI as one of the top 100 sci fi movies of all time. Broderick was perfect as a slacker teen, and Ally Sheedy turns in one of her best performance, making the most of an under developed character. Dabney Coleman showed why he was one of the busiest actors in the 1980's (though he always better cast as a villain), and Barry Corbin could play almost anything convincingly. while the special effects may be dated by todays standard, Wargames helped shape the way people think and speak. Backdoors, hacking, were not common terms like they are today. Without a doubt, much in agreement with AFI, Wargames remains one of the most important films ever made.","user":"metalrox_2000","rank":[156,170]},{"title":"Shall We Play A Game?","rating":8,"date":"4 May 2004","review":"Cyberthrillers may not have started with \"WarGames,\" but it was here the form achieved an early peak. As more filmmakers follow its example of portraying a high-tech faceoff between man and machine, \"WarGames\" remains a standard to be measured against. While it's not a film classic, it's a very, very good popcorn thriller of uncommon craft, charm, and humanity.<br><br>Seattle high schooler David Lightman (Matthew Broderick) has only a few hours to undo what he thought was a sneak preview of an upcoming computer game but what instead got him tinkering with the U.S. Air Force's WOPR (War Operation Planned Response) computer system in such a way as to trigger a countdown to World War III. The FBI thinks he's a Soviet spy, while classmate Jennifer Mack (Ally Sheedy) is wondering if this isn't all really about a rejiggered biology grade.<br><br>Broderick is solid, and Sheedy even better, but what really sells this film is everything else. Start with the excellent supporting performances. John Wood as a reclusive professor and Barry Corbin as a tobacco-chewing general get much of the kudos, and rightly, but there's a whole deep bench of quality work beyond that, like Kent Williams as a curt White House advisor, William Bogert and Susan Davis as David's out-of-it parents, Alan Blumenfeld as the swaggering bully of a biology teacher, and Juanin Clay as a beautiful but underappreciated assistant (even by herself as she uses her own mouth as an ashcan for her boss's discarded gum.) You know the casting people behind this movie were on the ball when the opening sequence features two very recognizable faces, those of Michael Madsen and John Spencer, in what were film debuts for both.<br><br>That sequence with Madsen and Spencer as missile men point up another quality of \"WarGames,\" the way the movie works in terms of setting up expectations and developing pace. The harrowing business between the two of them is mercilessly presented (\"Turn your key, sir!\") and then effectively abandoned so as to work in the central storyline, the replacement of these men with computers. We get a macro-view where Dabney Coleman as a tunnel-visioned warroom executive effectively makes the case for \"taking the men out of the loop\" and then zoom back into what seems a totally unrelated story, that of slacker teen David Lightman and his high school travails.<br><br>The film could have just started with Lightman, and worked its way out to the business with the WOPR. But the early peek behind the curtain is a clever way of raising the stakes with the audience before the protagonist realizes what's up.<br><br>The set design, cinematography, lighting, and editing all work wonders as well. The NORAD warroom is really a character onto itself, the ultimate source of reality in this film (and better for my money than the warroom in `Dr. Strangelove,' an obvious inspiration.) The way the cameras dart around from terminal to terminal as uniformed USAF technicians follow the progress of an apparent Soviet attack, lighting onto one of them just before he or she relays an important piece of information, is highly addictive and entertaining.<br><br>There's some sloppiness in the movie. Madsen and Spencer's talk about this great pot Spencer's character has scored strains credulity in the high-security setting they are in, and its blindingly obvious that the two men we see exiting a helicopter and entering a jeep during the credits are not the same two men getting out of the jeep moments later. The musical score is terrible, except for the elegiac tune at the end by which time it's too late. And there's no real examination of the morality of Lightman's serial lawbreaking.<br><br>But this is a funny, exciting, consciousness-raising movie that is as entertaining now with the Cold War more than a decade behind us as it was all those years ago. For all the technical innovation on display, it's ironically appropriate we remember it for showing us how to butter an ear of corn, because it's the human side of the equation `WarGames' keeps in its sights at all times.<br><br>[The DVD features a terrific, candid commentary from director John Badham and writers Lawrence Lasker and Walter Parkes that gives one a real appreciation for the value of creative license as well as factual diligence in making a film of this kind work.]","user":"slokes","rank":[79,87]},{"title":"Let's play Global Thermonuclear War","rating":7,"date":"2 July 2009","review":"WarGames is a film which in some ways seems hopelessly dated and in other ways seems to have been way ahead of its time. There's the Cold War angle, the United States and the Soviet Union gearing up for the seemingly inevitable World War III and the nuclear holocaust that would go along with it. It's a 1980s storyline which doesn't play as well all these years later with the Soviet Union long having been consigned to the dustbin of history. Nowadays the threat comes not from one communist superpower but from...well, pretty much anywhere it seems. But then again this movie, made in 1983, is at its heart really about a computer hacker. Who, in 1983, even knew there was such a thing as a computer hacker? Ahead of its time this movie is.<br><br>While certain aspects of the story may seem less relevant today there is no denying that WarGames is an effective, entertaining thriller. There may be some flaws in the movie's logic now and again, not everything we see seems entirely plausible. But the movie works. The story centers around Seattle high school student David Lightman, who is not doing particularly well in school. But it's not because he isn't bright, he certainly is. He just seems unmotivated and perhaps distracted by his obsession with computers. That obsession plays itself out as he attempts to hack into a video game manufacturer's computer...and instead unknowingly hacks into a Defense Department computer. In playing the \"games\" on that computer he almost starts World War III. Whoops.<br><br>Matthew Broderick plays David and his performance is excellent as he portrays a young teen who finds himself caught up in a situation behind his imagination. Ally Sheedy plays his friend Jennifer, a character who seems a tad bit underdeveloped. It often seems that Jennifer's just along for the ride rather than having any real purpose in the plot. But Sheedy does well with what she has to work with. Our young hero and heroine are very much the focus of the story, at times to detrimental effect. All the adults in the story seem rather one-dimensional. Some of them have very important roles to play in the story yet we never know much of anything about them. Besides David and Jennifer there's really only one other character for whom there is any kind of character development going on and that character doesn't even show up until rather late in the proceedings. But this is a movie which will definitely hold your attention. It's a tense, taut thriller which also has some heart to it. And it often looks spectacular, most notably in the scenes which take place inside the NORAD war room, a movie set which was stunningly impressive for its time and actually would still be stunningly impressive today. All in all WarGames is a well-made, suspenseful, enjoyable film. It has its flaws but it is still a film well worth seeing.","user":"hall895","rank":[25,27]}]