[{"title":"Bing Goes His Own \"Way\"","rating":9,"date":"28 December 2001","review":"In `Going My Way,' director Leo McCarey taps into one of the basic tenets of human nature, that being the fact that even the most selfless individual has wants and needs that often go unrecognized or unexpressed.  It's a matter of understanding the human condition, being sensitive to what drives our fellow man and responding to it.  A young woman of eighteen leaves home because of a conflict with her parents, yet has nowhere to go; a man with a touch of `Scrooge' in him, who runs a Savings &amp; Loan has trouble setting his priorities; a gang of street-wise kids need some direction; an elderly priest after forty-five years has allowed his parish to slip into financial straits.  All circumstances that are affecting in their innate humanity, and it's into this that McCarey taps directly with his story, and it's the reason for the success of his film.  Simply put, it has heart-- and it makes it timeless.<br><br>\tFather Fitzgibbon (Barry Fitzgerald) has been at St. Dominic's in New York since it was built, but the financially strapped parish is in arrears on the mortgage payment, and Mr. Ted Haines Sr. (Gene Lockhart), of the S&amp;L that holds the note, would like nothing better than to be able to foreclose on the church, because then he could raze the building and turn it into a parking lot.  Meanwhile, the Bishop has sent a young priest, Father Chuck O'Malley (Bing Crosby) to St. Dominic's to look into the situation, and very quickly the good Father finds that he has his hands more than full.<br><br>\tSent to take charge without `taking charge,' in deference to Father Fitzgibbon's tenure, Father O'Malley has his work cut out just trying to save the church; but that's not all he has to contend with.  Found alone on the street by a local policeman, a girl named Carol James (Jean Heather) is brought to St. Dominic's, and Father O'Malley realizes that without some help, she's headed for nothing but trouble.  He also encounters a lad named Tony Scaponi (Stanley Clements), the leader of the gang that has been terrorizing the neighborhood, and turning that situation around becomes a priority on Father O'Malley's `to-do' list.  Then there is Mr. Haines Sr. to deal with.  But most especially in need of all (though he doesn't realize it himself) is Father Fitzgibbon, and this, too, Father O'Malley recognizes. Now it's just a matter of addressing all of these needs at once; and as Father O'Malley finds out, it's no easy task.<br><br>\tThere's something of the Angel, Dudley (played by Cary Grant in `The Bishop's Wife'), in Father O'Malley, as he is not only sensitive to the needs of those he encounters, but knows how to resolve their conflicts in a way that suits the best interests of all concerned.  His solutions may be those of a perfect, pie-in-the-sky world and not necessarily a reflection of reality, but it works because it captures the spirit of what this movie is all about:  caring and lending a helping hand to those who need it.  The solutions may be unrealistic and overly simplified, but the feelings and emotions of the characters are very real, and McCarey's ability to capture that essence of humanity is what earned this film the Oscar for Best Movie of 1944 (McCarey received Oscars, as well, for Best Director and Original Story).<br><br>\tAs Father O'Malley, Bing Crosby gives one of his best performances, which earned him an Oscar for Best Actor.  But as good as he is in this part, the award is something of a surprise; the Father O'Malley Crosby presents has the patience of a Saint and insight to match, and his mild mannered approach to the character makes his portrayal the kind that are usually overlooked and under-appreciated because of the apparent facility of the delivery.  And Crosby does make it look easy-- which also makes it very real, striking a chord as perfect as the solutions to the problems he solves along the way. It's interesting to note that when Crosby recreated the role a year later in `The Bells of St. Mary's,' though he slipped back into the character readily enough, it didn't seem to have that same depth or impact as in this one, but more of a `been there, done that' feel.  Then again, this story and the characters with which he is surrounded here are much richer and have much more definition than those of the sequel, and this film is much more emotionally involving.<br><br>\tBarry Fitzgerald received the Oscar for Best Supporting Actor for his portrayal of Father Fitzgibbon, and well deserved it was.  Father O'Malley may be the anchor of this film, but Father Fitzgibbon is it's soul.  And the final scene-- unexpected and extremely moving-- leaves no doubt about it. That scene, in fact, so powerful in it's simplicity, veritably sums up the sentiment of the entire movie.  It's a triumph for Fitzgerald, as well as McCarey, but the one who really comes out the winner is the viewer.<br><br>\tThe supporting cast includes Frank McHugh (Father Timothy), William Frawley (Max), James Brown (Ted Haines, Jr.), Rise Stevens (Genevieve Linden), Eily Malyon (Mrs. Carmody), Carl `Alfalfa' Switzer (Herman) and Adeline De Walt Reynolds (Mrs. Molly Fitzgibbon).  A heart-felt and uplifting discourse on the brighter side of the human condition, `Going My Way' reflects the good there is to be found in humanity if we but take the time to seek it out.  An entertaining, feel-good film, this is what the magic of the movies is all about.  I rate this one 9/10.","user":"jhclues","rank":[35,37]},{"title":"A movie that really sneaks up on you","rating":9,"date":"27 August 2002","review":"It's an easily underrated movie, particularly because it flatly refuses to do most of the things that people expect movies to do today; there's a defiant unwillingness to slip into easy melodrama (though I often like melodrama), or to spend too much time on comedy, etc. The movie won't pigeonhole itself, and I think this leads to its secret - at heart, it really intends to be about what it's like to be a priest. You CAN'T pigeonhole yourself in that role, because you can't possibly know what's coming up, or really keep perfect track of all the different threads of a community at the same time. You have to take things as they come, and this movie really does that all the way through.<br><br>And there's also a sense of the wistfulness that comes from giving up that \"plot-driven\" style of living - in the scenes where Crosby visits his old girlfriend, there's a tangible awareness on both sides that they don't really know what happened to the \"plot\" of their relationship - they just took things as they came, and it really turned out OK for both of them. Most of the movie's separate narrative threads are left off, and returned to, almost at random - and the main focus on the relationships between the characters is what ends up shining through as intended.<br><br>A lot of the film is spent on scenes that seem kind of inconsequential at the time (like most of everyday life), but they invariably lead to a payoff later in the film. There's a shot of Gene Lockhart watching his son leave - a silent shot that just holds on a medium shot of the father, watching his expression for about 10 seconds - that I found absolutely sublime in its effectiveness. To me, that single shot justifies the half dozen scenes that led to it. Ultimately, the movie is almost happy to laugh at the audience for being so eager to expect more of a story. As one character aptly says,\"Schmaltz is in this year\"; the people behind this movie KNOW that a lot of people will want to dismiss it, but won't let them off the hook so easily. It's looks deceptively simple to make a film this easygoing and yet moving. (Capra tried it later in his career, sometimes with Crosby, and yet he couldn't pull it off.)<br><br>The Oscar win is OK, though I think Double Indemnity should have won, and I also like The Miracle of Morgan's Creek a lot more as well (THE SPOTS!!!); but Going My Way belonged in the top 5 that year, along with Laura and I'm-not-sure-what-else. (Gaslight, maybe?) And I'll note that I do like the \"sequel,\" The Bells of St. Mary's (actually written first), a little better, too.<br><br>But as I wrote in the summary, this one really sneaks up on you; the last scenes prove much more moving than you expect, and the ending of the film - while initially seeming abrupt - leaves you suddenly saying, \"Of course - it's perfect.\" Just moving on.......<br><br>9 of 10<br><br>P.S. Is it really set in New York? That's never said, and there's so much talk of St. Louis that I think that more accurate a guess. The \"Metropolitan Opera House\" is mentioned, but that's a generic-sounding name. Honestly, I think they went to great effort to make it as unrooted in a single locale as possible.","user":"scgary66","rank":[37,40]},{"title":"\"Swinging On a Star\"","rating":9,"date":"14 November 2001","review":"A fairly old-fashioned film even when first released, Going My Way is probably a tough sell these days compared to other 'feel good' movies of its time. It's a little too long, a little too sweet, a little too casual, and has more than a little too much music. Then again, it also has Bing Crosby; and a Crosby picture without music is like a fish-tank without fish.<br><br>Bing plays a young, progressive priest assigned to the parish of an aging, stubborn, much older priest (Barry Fitzgerald) who desperately needs help in dealing with his church and congregation, and is too proud to ask for it. At first the old priest distrusts the younger one and regards him as too 'modern' in his outlook. In time the two men come to get along famously, but with a few bumps in the road along the way. The movie is a comedy and a sermon, a musical and a drama. It is at times painfully and at other times hilariously realistic. When it sticks to its central story it's just fine. But it zooms off in dozen different directions and at times seems to lose its way. In the end everything comes together neatly, but it takes an awful long time for the movie to get there.<br><br>Going My Way is literally the opposite of film noir. It is bright and sunny, and aggressively optimistic in tone. Yet it is set in the slums of New York in a parish surrounded by poverty and crime. Director Leo McCarey does not minimize the negative aspects of the parish community; if anything he emphasizes them,--in order to offer a cure, or rather cures: faith, hope and charity. The movie's sensibility can be summed up in the face and demeanor of its star, Bing Crosby, who manages to be smart, open, breezy, charming, sly and decent all at the same time. One can't help but be reminded, after seeing this film, that life's problems, heavy and complex as they are, can be addressed in other ways and in other vocabularies than those of social scientists and existential philosophers, and that simplifying matters, cutting them down to their essentials is perhaps as important as verbalizing them. Most people do not read the great books or discuss the great ideas, and for most of us complexity is a burden, simplicity a virtue. Without resorting to any theory or idea, Going My Way makes this point quite nicely, and offers some pleasant songs in the bargain.","user":"telegonus","rank":[56,63]}]