[{"title":"Deeply moving","rating":7,"date":"30 November 1999","review":"An unsparing portrait of a lonely spinster with nothing to go on but her own ever-weakening faith.  All the performances are wonderful, but Maggie Smith in the title role is revelatory.  One of the best performances by an actress that I've ever seen.","user":"KMR","rank":[25,26]},{"title":"My brief review of the film","rating":11,"date":"11 December 2005","review":"Playing an atypically quiet character for the most part, Maggie Smith is excellent in this film, and she deservedly won the BAFTA award for Best Actress for her role. As for the film itself, it is also powered by some fine acting from Marie Kean, and the motivations are interesting for each and every character - the film is a study of why different persons do what they do and what they expect in return. Sadly the snail's pacing is a bit slow for the material to have vigor, and some techniques used do not come off well, such as the melding of flashbacks and double narration with two characters each saying their thoughts. The gloom and anger in the film tend to verge on the excessive, but yet these sad emotions bring extra power to the story, and there really is not much of a story - in terms of events - to work with, but the film manages to do a satisfactory job. However, to call Smith satisfactory would not be justice at all. She is simply wonderful, in one of her last great performances, and the film is worth seeing for her work in it alone.","user":"sol-","rank":[14,14]},{"title":"Maggie Smith is just............................WOW!!!","rating":10,"date":"31 August 2005","review":"I own this VHS, which I found on eBay for like $5.00... I had no idea what a treasure I was receiving. I was looking for it because I will watch anything with Maggie Smith in it, and also because she won the Best Actress British Academy Award for it.<br><br>Maggie is in the top 3 of my favorite actresses. You give her a good role and she will just knock your socks off. She has mastered comedy and drama in a way that I haven't quite seen before. She does not play the role of Judith in this film. She IS Judith Hearne in all her depressing, desperate, lonely, and passionate glory. I could've cried my eyes out at her devastation over the spilling of the whiskey....and that's all I'm giving away. She simply reaches through the screen, grabs your heart, and rips it out of your chest. There is NO WAY you can see this film and not feel SOMETHING. It is one of the best, if not THE BEST performance by a female actor recorded.....and I've seen a lot of films.<br><br>I have no idea how this was missed by the Oscars, with practically zero money-making films like \"Monster\", \"Monster's Ball\", \"Vera Drake\", and \"Million Dollar Baby\" being recognized for the performances and not the commercial success now-a-days. Maggie's performance CRUSHED the nominees that year and the winner (Cher for \"Moonstruck\")... Find this, buy it, or something. My GOSH if you love a great performance, you just have to see this film!! You won't be sorry.","user":"donta49001","rank":[22,25]}]