[{"title":"It's generally considered to be the odd one out in the list of MacLean's books, but the film adaptation is reasonably worthwhile.","rating":5,"date":"5 February 2003","review":"Alistair MacLean spent most of his novelist days writing wartime suspensers or twisting, turning thrillers. The one book that he wrote which doesn't fit either of those descriptions is Breakheart Pass, a western set aboard a train. This film version of it is surprisingly enjoyable, and features the added bonus of an expressive, colourful characterisation by Charles Bronson.<br><br>The train is travelling to a fort in the Wild West with medical supplies to cure an outbreak of a nasty disease. However, some of the soldiers aboard the train are mysteriously disappearing, and anyone who's ever seen a film like this will figure out straight away that there's a murderer on board. Furthermore, the train must make its journey across hostile Red Indian terrain, where a fearsome ambush or a sabotaged stretch of track is only a spear throw away.<br><br>Bronson plays a mysterious outlaw who is held prisoner on the train, though there are plenty of clues that he may not be exactly who he says he is. Other well delineated characters are played by Richard Crenna, Jill Ireland, Archie Moore (yes, the boxer!), and Ed Lauter. One truly amazing sequence involves a rooftop scuffle between Bronson and Moore.... indeed most people who have ever seen the film remember it for that sequence more than any other. All things considered, Breakheart Pass is one of the better adaptations of a MacLean novel, admittedly not quite in the same league as Fear is the Key or Where Eagles Dare, but definitely worth seeking out, especially on DVD.","user":"barnabyrudge","rank":[36,39]},{"title":"enjoyable western","rating":5,"date":"5 March 2002","review":"This movie was made at the height of Bronson's career. He had just done Death Wish a year before and Hard Times and Breakout were the other two to follow. It must have made a packet and its easy to see why. A train heading for a destination where Indians await and mysterious murders happening along the way. Many characters make this movie seem alas Hitchcock/Christie and the music by Jerry Goldsmith is one of the best of the 70's. His music captures the mood of every scene whether it be high pitch as the train moves along or dark as the shady characters go about their business in the carriages. Some of the location shooting is breathtaking and i actually felt cold watching it. The acting is solid as expected. Bronson, Crenna, Johnson, Lauter, Durning and even Jill Ireland are all good while not giving much away to their character. The action explodes at the end and gunfire a plenty making this one of the most entertaining action films of that era.<br><br>8/10","user":"cornucopia9","rank":[43,49]},{"title":"Finally, someone read the book BEFORE making the movie!","rating":25,"date":"25 March 1999","review":"Alistair MacLean has always been one of my favorite authors, dating back to my high-school days in the mid-'60s.  He has written many outstanding books, and many films have been made from them.  Too many times, however, the title is the only thing that remains the same.<br><br>Not in this case, however.  Either MacLean himself was involved with this film, or the director actually read the book first before starting, as this film is faithful to the book.  A rarity indeed.","user":"BikeBill","rank":[47,56]}]