[{"title":"Seems almost an accidental classic","rating":9,"date":"7 October 2001","review":"I don't know if George Lucas really knew what he had in this picture--surely the screenplay seemed funny enough, and the thought of the cars and the period music was enticing--but did he really know these \"unknown\" actors would bring these characters to life? It seems almost a fluke, shot in 29 days and on a tight budget, but \"American Graffiti\" is a classic. It is perhaps pure nostalgia, mixing pathos and humor, sadness and craziness, hope and reflection in quiet little bursts of excitement. After cruising with Milner all night, teenage Carol hates to say goodbye but does, waving from her porch with the light on; Toad survives one bad accident after another, but his real moment is in hearing praise from his date (fantastic, husky-voiced Candy Clark, dolled up like a speeding Sandra Dee) just before she says good night; after chasing his dream date all night, Kurt (Richard Dreyfuss, green and anxious, and appealingly bemused) finally gets to talk to the stunning blonde wonder on the telephone, where she whispers a wrenching goodbye. The whole movie is steeped in reflection. It has great, great humor, yet it leaves one with a bittersweet melancholia. For yesterday is in the past, with our music, our memories and our hesitant farewells. ***1/2 from ****","user":"moonspinner55","rank":[165,193]},{"title":"The American Garden","rating":6,"date":"5 August 2004","review":"The summer of 1962, for these four Youths, it's the closest they will ever get to the Garden of Eden. The music, the cars, the drinking, the dancing, and the innocence, American Graffiti is a harder film to make than Star Wars. To identify with the generation and to create truth from the characters, George Lucas's masterpiece is American Graffiti. From the town Big shot, the future Race car Driver, the Perfect Couple, and the local Nerd, it is amazing how the audience identifies with all these characters from out past. Like a page out of the high school year book, this movie jumps back into the early 60's, before the war, before the lines were drawn, the age of innocence in America would soon be coming to an end. This is the last party of the summer before the dream finally ends.","user":"caspian1978","rank":[113,138]},{"title":"The single-greatest teen-age cruising film ever made","rating":3,"date":"3 January 1999","review":"American Graffiti, voted in 1998 to the American Film Institute's list of 100 superlative films, is as good today as it was upon its release in 1973. Countless films (such as Linklater's excellent Dazed and Confused) have borrowed heavily from Lucas' blueprint of multiple characters and storylines punctuated by wall to wall rock music.  If possible, you should try to see the 1998 documentary that accompanies the DVD release, as it provides a wealth of information directly from Lucas, Coppola, LeMat, Ford, Clark, Dreyfuss, Howard, and many others about the creation of the film from concept to box-office phenomenon.","user":"pooch-8","rank":[63,81]}]