[{"title":"I am Dracula....I Bid You Welcome","rating":10,"date":"2 May 2004","review":"\"Dracula\" is a true cinematic classic that still hold up well today more than 70 years after its initial release. Bram Stoker's novel had been filmed before, most notably the 1922 German masterpiece \"Nosferatu\" with Max Schrenk playing the vampire as a monstrous rat like creature with no redeeming qualities.<br><br> Bela Lugosi rose to instant fame with his portrayal of Dracula, a part he had been playing on stage for several years. Lugosi's interpretation is that of a suave and sophisticated nobleman with a hypnotic stare and a cultured Hungarian accent. This made the character more appealing to the ladies while at the same time terrifying to the audience when we see the monster revealed beneath.<br><br> The story has the tragic Renfield (Dwight Frye) arriving in Transylvania to complete a transaction with the Count which will allow him to lease a English castle. Before they leave for England by ship, Dracula turns Renfield into a quasi-vampire who obeys his master's every command. Upon arriving in England it is discovered that all of the ship's crew have been murdered and only a raving lunatic of a Renfield remain alive.<br><br> Renfield is committed to a sanitarium run by Dr. Seward (Herbert Bunston). Dracula seeks him out and discovers Seward's comely daughter Mina (Helen Chandler) and her friend Lucy. Dracula quickly \"kills\" Lucy and sets his sights upon Mina whose fiance Jonathon Harker (David Manners) is baffled by her sudden change in health and personality. Seward consults with a colleague Dr. Van Helsing (Edward Van Sloan) who quickly identifies the source of the problem as a vampire. They soon expose Dracula for what he is and......<br><br> The atmospheric sets of this movie set the tone for the story. Dracula's castle is dark, damp and web filled and his cellar is positively scary. So too is his English manor with the classic winding stair case leading to the cellar. The opening theme I found to be equally foreboding and frightening. I wonder how many of those early film goers realized that it was adapted from the classic ballet \"Swan Lake\".<br><br> Bela Lugosi should have become a major star after this film, but did not. His first mistake was the turning down the role of the monster in \"Frankenstein\" (1931). He did enjoy moderate success in the first half of the 30s playing various mad scientists and criminal masterminds. But he also accepted roles in several \"poverty row\" quickies which did little to advance his career. He had a brief return to glory in 1939 when he played \"Ygor\" in \"The Son of Frankenstein\" and again in 1948 again as Dracula in \"Abbott &amp; Costello Meet Frankenstein\". With his well documented personal demons, Lugosi wound up his career in cheap \"B' movies ultimately becoming the \"star\" in some of Ed Wood's \"classics\". Oddly enough, though he was forever identified with the Dracula character, he only played him on screen twice, in 1931 and 1948 as noted. He did play \"Dracula like\" characters in MGM's \"Mark of the Vampire\" (1935) and in Columbia's \"Return of the Vampire\" (1943).<br><br> Dwight Frye almost steals \"Dracula\" from Lugosi with his portrayal of Renfield. He takes him from a young ambitious businessman to a half crazed lunatic and back again. After this and his role of Fritz the hunchback in \"Frankenstein\", this great character actor never again achieved such heights. A real tragedy. Oddly enough, Stoker's book portrays Renfield as a minor character and it is Jonathon Harker who makes the unfortunate trip to Transylvania.<br><br> Also filmed in a Spanish language version.","user":"bsmith5552","rank":[97,110]},{"title":"How can it not be a classic?","rating":17,"date":"17 March 2003","review":"This is the movie that set the horror genre into action.  Sure there may be a few campy scenes that look like they might be out of some high school play production (the rubber bats and armadillos in Dracula's castle come to mind), but there is an unmistakable suspense and eerieness about the film. If you are lucky enough to find the DVD reissue from 1999, you have three great versions: the original 1931 version with basically no background music, the 1999 rescoring of the movie by composer Philip Glass, and the extremely interesting Spanish version, made at the same time as the original (with totally different actors).  If you have this DVD, watch the movie twice: once with no soundtrack and once with the Glass rescoring.... totally different movie.  Glass' score is great, but it doesn't really help the movie at all (it actually hurts it in many cases).  But the utter silence in Browning's original just makes my skin crawl!  The acting is actually quite great (Lugosi is, of course, phenomenal as is Dwight Frye as Renfield).  The fear, the suspense, and, believe it or not, the sexuality, combines for a great movie that was an unbelievable success in its first release ($700,000 in it first US release, $1.2 million worldwide).  Not bad for a movie made 72 years ago!","user":"meyers480","rank":[73,86]},{"title":"For my money,the scariest movie ever.","rating":9,"date":"31 October 2001","review":"I suppose we all have differing opinions on what is scary and what isn't.For my money though,this film tops my list.I have seen many a horror film,but few have made me shiver as this one did.The creepy silence virtually throughout the movie,coupled with Bela Lugosi's intimidating presence and Dwight Frye's chilling performance as Renfield(remember the eyes and the laughter?)give me chill bumps on top of chill bumps just thinking about it.Yes,the movie has flaws, but they are few and far between.Hey,it was 1931 after all,and movie making was still in it's infancy.I have seen the various opinions on this film,good and bad,and while it may not top a lot of people's list when it comes to scariest movie ever,it sure tops mine.Bone chilling!","user":"SmileysWorld","rank":[64,77]}]