[{"title":"A fine transfer of Orwell to the screen","rating":9,"date":"13 February 1999","review":"I don't understand why critics in recent years have never warmed to \"Animal Farm\". They believe it's \"disappointingly flat\" (Leslie Halliwell) or \"an illustrated study aid\" (Time Out). I remember when I first saw this film a quarter of a century ago. I found the betrayal of Boxer, the horse, horrifying. The description, \"an intellectual film, not an emotional one\" (Time Out), cannot be reconciled with my own recollections. Are British critics simply holding a British film of a British novel up to standards they would not apply to a non-British production? The film already contains evidence of a Disney influence, from adorable ducklings to a musical score with echoes of Prokofieff's \"Peter and the Wolf\", and an expiating ending that's not in the book. Any more of that sort of thing and critics would have accused the film of losing all of the book's bite.<br><br>George Orwell wrote a fable about revolution betrayed, and laced it liberally with references to the Russian Revolution. Much of this dimension is still visible in the film. A wise pig, Old Major, proclaims the revolution before dying. Old Major is sort of a Marx figure, although, to me, he seems to be drawn to look like Churchill. Proclamation made, nothing happens. However Farmer Jones is drunk and the animals don't get their feed. The Tsar's mismanagement produced his revolution as well. Russian parallels continue. Counter-revolutionary farmers (capitalist states) attack Animal Farm but fail. One pig, Snowball (Trotsky), tries to spread revolution to other farms (world revolution), but is murdered by his associate, Napoleon (Stalin), who prefers to consolidate his power at home. The film also has Five Year Plans, industrialization programmes, forcible collectivization, showtrials with quick executions afterwards, and historical revisionism.<br><br>But I saw this film perhaps three times long before I understood anything much about the political parallels. I liked it as much then if not more so. Knowledge of that side does tend to turn the film into an intellectual experience, but viewers who have no prior exposure to the historical facts receive the raw emotional jolt which more politically astute critics maintain the film lacks.<br><br>Regardless of whether you know a lot about Russia and her Revolution, or nothing at all, Britain's first animated feature is a film with a strong story which adults and mature kids should find absorbing, maybe even \"devastating\", as The New York Times once claimed back in the days when Stalin was still lying warm in his grave, if not in anyone's heart.<br><br>As for a rating on \"Animal Farm\", the sheep say, \"Four stars good, two stars b-a-a-a-d!\"","user":"Varlaam","rank":[59,66]},{"title":"Orwell's political fable as 50s animation","rating":8,"date":"25 January 2005","review":"Directed by Joy Batchelor and John Halas, and co-written by Batchelor from the renowned novel by George Orwell, this animated film benefits from a faithful rendering of the story and two talented voices - Gordon Heath narrates, while Maurice Denham does everything else (all the animals!).<br><br>The animals who were described in Orwell's text are all given cartoon form here - Boxer the horse, Napoleon the pig, the sheep, the chickens, and so on. The ending well-known from the book (where the pigs and humans join forces and you can no longer tell which is which) was changed for the film, but that's a small point when everything else is so accurate.<br><br>The atmosphere of the cartoon 'Animal Farm' is perfect - we see collusion, spying, killing, and a real sense of fear comes through as the animals' rules are eroded one by one by their chosen leaders, the pigs.","user":"didi-5","rank":[21,22]},{"title":"FASCINATING","rating":19,"date":"19 May 2001","review":"\"Animal Farm\" doesn't seem like a candidate for animation, but after seeing the lackluster live-action feature last year, this animated British film looks better and better each time I view it.<br><br>Oh, I've heard the complaints about it not being wholly faithful to the source material. I'm going to apply the same defense here that I gave to \"Gulliver's Travels\": the film is the last place to look for accuracy. A wholly faithful adaptation would have no doubt turned everyone off, but what they have left behind is fascinating: despite an upbeat ending, the flavor of the novel remains intact. How many films can you say that about? The stinging satire is there, the political parallels are there, but a certain entertainment value is there that wasn't in the novel.<br><br>The ultimate message of the film leaves the viewer somewhat sad, according to my experience. But that's a good thing, I think. The film was animated by the British animator John Halas, whose short subject \"The Christmas Visitor\" is widely available on public domain but hardly seen. He retains much of the same style as he did in his earlier short and makes a strong and honorable film.<br><br>The box and ads say \"Not for children.\" I think enlightened children will enjoy this film on one level and adults will enjoy it on an entirely different one. <br><br>If there's one thing wrong with this film, it's the ending. Orwell wrote an ending that was biting and necessary. By giving the film an upbeat ending, it somewhat undermines a first rate film. But I can't ignore the power of the previous 73 minutes, so I'm still recommending it.<br><br>***1/2 out of 4 stars","user":"Katmiss","rank":[25,27]}]