[{"title":"Fun Forties Horror","rating":10,"date":"4 August 2005","review":"I'm glad that I purchased \"Voodoo Man\". It is a pleasant way to pass an hour for fans of 1940's horror films. It is weird and strange, but has a certain beauty to it as well. I believe that it's the best of the horror films that Bela Lugosi made for Monogram during that time. Lugosi is a devoted husband to a wife that has been dead (although, still beautiful and looking as if she were in a trance) for 22 years. He has two of his helpers kidnap young women motorists off of a deserted road so that the young women's life forces can be transferred (via Voodoo) into his dead wife in order to bring her back to life. One pretty young motorist is missed by her cousin and soon the sheriff and his deputy pay a visit to Lugosi's home. Lugosi has a whole basement full of lovely young ladies who are entranced and standing behind glass doors in large cabinets. Will the missing cousin be rescued and the other young ladies be set free? Watch \"Voodoo Man\" to find out. The DVD that I bought through Sinister Cinema.com has the vintage trailer for \"Voodoo Man\" as a bonus feature.","user":"MarcoAntonio1","rank":[22,25]},{"title":"Gas station owner by day, voodoo caller by night","rating":6,"date":"25 February 2012","review":"A car pulls into a lonely country gas station. Owner George Zucco oozes out to greet the driver, a young woman. \"Stranger in this part of the country, aren't you?\" he inquires. She should not ask him for directions!<br><br>Yes, attractive young female motorists are disappearing, and it's not long before we learn that they are being misdirected onto a detour that will take them to a spooky mansion where Bela Lugosi is practicing—with Zucco's assistance—some very strange magic.<br><br>Lugosi has most of the best lines in this goofy but entertaining quickie. For example, his introduction to his wife, who died 22 years ago: \"She's deadonly in the sense that you understand that word.\" (Actually, she's dead in a way I do not understand, since she seems to walk okay but just doesn't have much to say.)<br><br>John Carradine is hilarious as a sort of nutty henchman; he is in charge of the hypnotized captives and moves from spot to spot in a sort of hippity-hop trot instead of just walking. Henry Hall is also funny as the local sheriff: \"Sheriff's job in this county used to be a cinch,\" he says. \"Now it's a pain in the neck\"—meaning, all of these missing motorist reports are really eating up his time. Wanda McKay and Tod Andrews are the attractive if rather bland young couple who are drawn into the mystery.<br><br>Zucco spends most of his screen time in a sorcerer's robe decorated with stars and crescents; Lugosi has one that matches. They lookumsilly. But they appear to be having fun—and although this picture is no great shakes and contains no great frights, it is indeed fun.","user":"csteidler","rank":[10,11]},{"title":"Voodoo, Science, and a Piece of String","rating":3,"date":"3 December 2010","review":"Sadly the days when a lone, mad scientist, toiling in the basement of his sinister mansion, could perform miracles over life and death with just a few test tubes and pulsing lights, without thought of glory or patent rights, have been curtailed by the corporate monopoly of science; the simple human desire to revivify the dead, trumped by the thirst for profit. Happily, voodoo has, thus far, eluded the grasping grip of greed (ouch!) and retained its humble individuality.<br><br>Voodoo Man returns us to that simpler time when science and magic worked hand in hand. It is another absurd poverty-row horror, filmed in seven days, in case you can't tell, by Bill \"One-Shot\" Beaudine for Sam Katzman's Monogram Pictures. Lugosi plays Marlowe, another mad scientist with another ailing wife. Indeed this wife is rather more than ailing: for 28 years she has been dead, but not in the sense we understand the word, of course. He tries to reanimate her by transferring to her the life force of abducted female motorists. Marlowe has some impressive technology – an impressive surveillance system, a car disabling ray, and some weird wife maintenance machinery. Still, he isn't one of those finicky skeptics who practice science nowadays. Like the alchemist, he recognizes the potential to improve scientific outcomes by utilizing magic.<br><br>This film is sensationally silly especially given the quality of the cast. This may not be Lugosi's most absurd role; unfortunately, the same can't be said for Carradine and Zucco. Carradine plays Toby, Marlowe's jogging, dimwitted henchman, who kidnaps women and doubles as Marlowe's percussion section. His bizarre performance is only over-cast by Zucco who plays Nicholas, gas station proprietor and voodoo priest. Zucco usually brings an air of dignity to the foolish roles he plays but this one is beyond him. While Toby bashes a bongo, Nicholas, in a cheap college gown and \"Phyllis Diller wig,\" chants gibberish at a piece of string in the name of Ramboonya who is, apparently, all powerful. And, to be fair, Nicholas is getting results until meddling relatives and policemen interfere with the ceremonies.<br><br>This film has remained too obscure and deserves a far greater audience. Amazing stuff.","user":"icaredor","rank":[13,15]}]