[{"title":"Good B-movie","rating":8,"date":"10 November 2002","review":"I caught this one really late at night back in 1995, and I must say, I enjoyed it.  It went under it's other name, Killbots, during that showing, and with a name like that, you know it's going to be cheesy and stupid. Cheesy it is, stupid it ain't.<br><br>Forget the misleading title or cover art on the box, this movie is very entertaining if you like b-movies.  I don't know why, but for once in a long while, especially in an 80's horror flick I was actually feeling for the characters.  I can't explain why, but the acting and direction were both well done, and though it's more of a horror spoof than anything, it is quite a frightening concept.  Though some of the deaths are stupid and the action scenes unrealistic, I couldn't help but see the similarities between this and Dawn of the Dead.  I mean, these kids, once they figure out what's going on (and witness the famous head exloding scene) they wage war with the robots...I mean they break out a freaking arsenal and lay waste to these things (yeah, like Dawn of the Dead, what kind of mall would have firearms in it?  I mean, one guy has an M-16 assault rifle!), though I can't remember them ever reloading once...it's all in good b-movie fun.  The major complaints I have with this one is that, like I said before, some of the deaths are 'throw away', obvious and without style (most of the movie, they are running from cheesy 80's laser effects shooting all around them, but never hitting them...of course, when they do finally make contact, you never expect it), but it is still a good movie to watch on a boring friday night with friends and a couple cases of beer.  I love the quote that the robots say every time that they dispatch one of the teens.  It is simply priceless. Also, watch for Barabara Crampton of Re-Animator fame as one of the horny teenagers.  <br><br>Overall not bad, and when I think of the title and what this movie is, I'm surprising myself in giving it a 8/10.","user":"boondocksaint20","rank":[27,32]},{"title":"Unreal circumstances, predictability, corny phrases, and partial nudity... what more could you ask for?","rating":9,"date":"20 July 2001","review":"What more could you ask for in a cheesy horror film from the 1980s?  This movie depicts a group of horny teenagers who are accidentally trapped in the mall overnight with three possessed security robots. Unreal circumstances, predictability, corny phrases, and partial nudity make this banal-plotted flick a true camp hit!","user":"carrotline","rank":[40,51]},{"title":"50% off Arms and Legs","rating":7,"date":"7 December 2001","review":"Well, there is a whole lot of cheese in Chopping Mall.  Remembering this movie from my childhood, I was compelled to rent it last night.  Well, I am glad I did!  Yeah, there isn't anything spectacular about the movie...There is a lot of Cheese (Automatic Rifles in a Mall?), but it still stands out as one of the better B-movies of the 80's.  <br><br>The Robots are pretty decent looking.  The acting is typical for the genre and timeframe.  The head explosion scene is just classic.<br><br>I now feel compelled to track this down on Ebay, since I don't see an American DVD release anytime soon...<br><br>Rent it and just enjoy the actual quality to this b-movie.  I don't mean the acting, but the scenery and the robots.  The CGI is laughable...but, that is another topic...<br><br>7 out of 10","user":"BHorrorWriter","rank":[31,40]}]