[{"title":"\"Listen little lady, you and I better go for a walk...\"","rating":9,"date":"3 May 2001","review":"Stephen Frears was the ideal choice to direct this quirky little gem. His first film before a prestigious career in television and then in Hollywood shows off his sensitivity, compassion and efficency as a film maker beautifully. Albert Finney gives an astounding performance as our hero, Eddie Ginley, whose life on the surface is far from glamorous. An unemployed Liverpudlian who gets by as a bingo caller and wannabe comic, he is loved by everyone except his repulsive brother William (Frank Finlay) and has recently had to suffer his girlfriend (Billie Whitelaw) leaving him and marrying the sinister William. Eddie however has a boyish love for film noir, the stories of Sam Spade and Philip Marlowe, and the music of Elvis. When he decides to advertise his services as a private detective, he finds himself up to his neck in murder, drug dealing and South African politics! Finney manages both a weathered Scouse accent and a remarkable impression of Bogart incredibly. He is a lovable character, excellently written and played, who could have sustained a whole series of films. Billie Whitelaw is the Lauren Bacall style femme fatale, and the outsanding Janice Rule the seductive villainess. A fine array of British character actors like Bill Dean, Fulton Mackay and George Innes sprinkle the whole film with colour and eccentricity. The in-jokes for fans of Bogart films are spot-on but anyone can enjoy this film, with some superb one liners and very touching moments. But the whole film is stolen fair and square by the soundtrack, courtesy of Andrew Lloyd Webber of all people! From fifties style rockers, to pensive strings to huge, grandiose thirties style epic themes, the score is a delight. The finest moment is suely Eddie's outwitting of the irreplaceable Fulton MacKay on a tube train. Writer Neville Smith (who plays a small role) showed a less humourous approach to a loner's hero worship of his idols in his 1979 tv play Long Distance Information, in which he played the lead character, Christian, an Elvis obsessed DJ who is working on the night of the King's death. Gumshoe is not really a comedy though, but a pastiche, affectionate and observant. It does have it's dark moments though, including a heroin suicide and a couple of moments of violence. And like any good Raymond Chandler, the plot is unbelievably complicated and the least important element!","user":"simon-118","rank":[38,40]},{"title":"Superb writing and acting make this as fresh as when first released","rating":9,"date":"20 August 2008","review":"I recently saw this for the fourth time, the first time having been in the cinema upon its release. This first viewing saw me classifying it as a pastiche along the lines of Woody Allen's \"Play it again, Sam\" or \"The Black Bird\" with George Segal. In fact, the script and acting of \"Gumshoe\" make it infinitely better than either of these two and put it into that rare category of films, which actually get BETTER with each viewing. For a film approaching its fortieth anniversary, obviously much of the background, (such as the physical locations in Liverpool and Billie Whitelaw's being 'locked' into her loveless marriage with Frank Finlay), are now museum pieces/views into the past. Overall, though, the film still comes across as amazingly fresh and entertains from beginning to end. The lightning speed patter and one-liners are razor sharp and the performances by ALL of the lead characters are stunning. The nearest parallel I can find is \"The Third Man\" and, while it is definitely not in that category overall, I still think this is a very good film indeed which was vastly underestimated when it first came out,(for example by me!), and which only grows in stature and the enjoyment it affords with each renewed viewing.","user":"csrothwec","rank":[19,19]},{"title":"Surprisingly fresh and very well written","rating":8,"date":"1 December 2007","review":"This film buzzes with excitement and whips along at a great pace. It's cliché precisely because Eddie Ginley sees everything that way. That's the charm. <br><br>The script works well, and is a delight if you concentrate (!) All the actors give deeply - the sparring between Finlay and Finney is marvellous. How they kept straight faces is a mystery - they seem to be enjoying it so much. <br><br>All the locations are raw and stark but never over-done or contrived. What you see is what there was in 1970's Liverpool and London. <br><br>A thoroughly enjoyable film with a top-class cast.","user":"nigel-47","rank":[27,28]}]