[{"title":"Serious Seventies. Quality Chan.","rating":12,"date":"12 December 2003","review":"If you're a recent Jackie Chan convert, or you've been watching his films since 'Police Story' his backlog of seventies films is a daunting place. There's a lot of terrible, terrible stuff out there. You might have seen 'Eagle Shadow Fist' or 'The Killer Meteors' and shied away from anything else. I wouldn't blame you. But he made some decent films in this era. It's just a matter of finding them.<br><br>The Director of Dragon Fist is a man called Lo Wei. I say a man, not a director. Lo Wei was more interested in Gambling than directing.<br><br>Bruce Lee nearly came to blows with Wei in the filming of 'Fist of Fury'. Wei spent more time listening to horse racing and sleeping than he did with a megaphone. The result? Lee got his own input. Better movie. That's maybe the point with Lo Wei. The less he directs, the more the other people direct. And that could be a good thing.<br><br>Lo Wei director or produced (almost) all of Jackie Chan's films between 1976 and 1978. Chan = Lee. That was the plan. At first anyway. His first starring role in this period was 'New Fist of Fury'. It didn't work. Wei was trying too hard. When he sleeps the stars talent takes over. Anyway, Chan can't play straight. Or can he?<br><br>Most of us will be cursed to see Dragon Fist in it's 4:3 pan and scan, poorly dubbed, damaged washed out version. Even taking this into account I think it's the best film Jackie did before 'Snake in the Eagles shadow.' (yes 'Snake and Crane arts of Shaolin' had the best action, but it wasn't as good a film.)<br><br>This film is crying out for a remake.<br><br>It takes the simple themes of revenge and distorts them till your not sure who's in the wrong. Or Right.<br><br>Yam Sai-Kun plays the bad guy. One of his earliest roles. He's a hard, hard man. In the late 60's he swam from China to Hong Kong with the aid of a basketball. He later played roles in Films such as 'Fearless Hyena' and 'Iron Monkey'. But this role, like Iron Robe Yen in 'Once Upon a Time in China' is one of his most psychologically complex. He chops off his leg early on to try and ease his guilt. His self redemption seems, to this viewer, to excuse him of his crime. That makes things more uncomfortable when it's the very crime that Jackie's out to avenge. Jackie, in his role as avenger, blurs the line between good and evil. He joins the 'bad guys' (to comply with the black and white polarisation of these films). He goes too far. But he goes further. There's always a point when you think. 'Come on Jackie, realise that your fighting for the wrong side, beat the hell out of them.' But he still fights. It's a dark film.<br><br>Budget constraints. Technological constraints. Lo Wei. Lot's of elements try and turn this film into the 70's schlock it's often compared to. But somehow it rises above all of this. The Choreography varies between the average and the mind blowing. Chan hasn't been better in a straight role until Crime Story (15 years later.) You can probably pick this up for a few pounds. If so it's a good place to start. Enjoy.","user":"wucan","rank":[24,25]},{"title":"surprisingly good dramatic 'fu film","rating":7,"date":"24 June 2006","review":"This is actually a well made film. because of that, I doubt very highly that it was directed by Lo Wei. My vote is that Chan, once allowed to choreograph the fight scenes, just went ahead and directed the film, much as what happened with Bruce Lee and The Chinese Connection, another film claimed by Lo Wei that he didn't actually direct. In fact that's pretty typical for Lo Wei - probably half the films he made were directed by the actors while he was off gambling, drinking, or sleeping it off.<br><br>At any rate: Although the film is heavy handed and a little slow, the story is not without interest (this is one of the few 'fu films where we see a potential villain repent and become a good guy), and the performances are all above standard for this genre in the mid-'70s. I believe this film, I believe its characters. Certaily not a masterwork, but a worthwhile dramatic 'fu film.<br><br>Oh, and the fight scenes are all pretty good.","user":"winner55","rank":[9,12]},{"title":"Gung ho Gung Fu...","rating":8,"date":"22 August 2011","review":"Interesting artifact for those who think that Jackie Chan's always been a \"fall guy\" for comedy. This one's about as straight-laced as they come, with some solid action and a storyline that keeps moving at a nice pace. Director Lo Wei oversaw at least TWO of the most important martial arts movies in history: THE BIG BOSS (FISTS OF FURY) and FIST OF FURY (THE Chinese CONNECTION); his reputation is therefore assured. DRAGON FIST boasts some nice cinematography to enhance the martial arts, but it's the choice of music I found most interesting: throughout the movie, we hear Jerry Goldsmith's score for the 1968 version of PLANET OF THE APES. It's sorta similar to hearing the unmistakable strains of the Isaac Hayes score for SHAFT throughout Wang Yu's classic fantasy, ONE-ARMED BOXER (or the theme from IRONSIDE in FIVE FINGERS OF DEATH, etc.)- and, like Wang Yu, Lo Wei's placement of the music is inspired. James Tien does a nice job as a turncoat, but this is definitely a Jackie Chan vehicle.","user":"poe426","rank":[3,3]}]