[{"title":"Pasolini dared to show the medieval era as extremely dirty, indecent, vulgar","rating":7,"date":"7 September 2008","review":"This is the second in Pasolini's series of setting classic bawdy tales to film In this case, he selected eight of Chaucer's Canterbury Tales, including the infamous miller's tale and the incident with the red hot poker kiss <br><br>The tales revolve around a group of pilgrims who are journeying to the shrine of Saint Thomas a Becket of Canterbury The trip is so boring that they begin telling each other stories that soon get obscene, gory and very sexy Pasolini adds another motif to his visualization by placing Chaucer himself into the movie, periodically cutting to him writing at his desk...<br><br>Pasolini inserts pleasure and amusement at social customs, especially marriage Some of the stories are funny, others are deadly serious The scene where a young man is burned for making love to another of his own sex, for example, is chilling...<br><br>In fact, Pasolini's using non professional actors, is more in keeping with the tone of the original than the usual romanticized versions...","user":"Nazi_Fighter_David","rank":[35,39]},{"title":"Eight tales about love and death.","rating":8,"date":"28 September 2004","review":"This movie is second of Pasolini's so called 'Trilogy of Love' (Il Decameron, I Racconti di Canterbury, Il fiore di mille e una notte; 1970-1974). All these movies are quite specific, there are said not to be that provocative or intriguing. They are greatly influenced by the fact that while directing them Pasolini was contented because of his intimate relationship with the 'innocent barbarian', actor Ninetto Davoli. It is also said that in 'Trilogy of Love' Pasolini became resigned to the present time world by escaping to the past. <br><br>However I don't think it's true. In these movies, Pasolini introduces to the audience an incorrupt world where people don't care about 'material aspects of life', they try to live at the full stretch, they seek love and, of course, sex and they do not respect 'the repressive limits imposed by religious and bourgeois morality' (Gino Moliterno). This is probably why Pasolini later declared that these three films were most ideological of his career (in his famous and long interview with Massimo Fini). I suppose Pasolini tried to confront such 'primitive' world with the world he had lived in and which he had hated so much (this confrontation is present all the time, especially by the contrast between the love and the death, by the contrast between the first tales, in which the human naked body dominates, and the last two tales in which pursuit of money causes death and perdition. Because of such end it is also suggested that I Racconti di Canterbury are very close to Pasolini's disillusioned last movie, Saló).<br><br>It is common to hear that Chaucer must have rolled over in his grave after this movie was released. But if you try to understand The Canterbury Tales in the context of Chaucer's attitude towards love in his (other) literary works, you will probably find that Chaucer would resemble to Pasolini alias Mr Chaucer ends the film with writing 'Here end the Canterbury Tales, told for the mere pleasure of their telling, Amen'.","user":"rathunter","rank":[24,36]},{"title":"Hilarious, shrewd, very funny","rating":10,"date":"15 July 2003","review":"This is a remarkable film. One usually remembers Chaucer's Canterbury Tales as difficult, religious old English burden of school, but Pasolini was smart enough to concentrate on the humor, which travels from rude slapstick (hot iron poker shoved up the villain's behind) to merciless show of greed and it's consequences. Only after the film did I take a fresh look at Canterbury Tales and lo! it was there all along... but it required Pasolini to lay it \\bare, for everyone to see.","user":"lhk-2","rank":[19,30]}]