[{"title":"Glorious Trash","rating":7,"date":"19 January 2009","review":"Amazingly entertaining and completely stupid Italian horror! A pop group purchase a mysterious unpublished Paganini melody from a mysterious old man. Turns out it's the evil melody he wrote to sell his soul to Satan! Or something. Anyway, when the band play their soft-rock-meets-synth-pop masterpiece \"Paganini Horror\" it's fated that Bad Things will happen!<br><br>So along comes Paganini in a cool mask, with a gold switchblade violin and some infernal powers, to mess with the group and their manager because... well, because he feels like it. Or maybe because he really hates '80s Euro pop, which is understandable really.<br><br>Then it turns out that the whole rigmarole has nothing to do with the group in a surprise ending which is partly surprising because of how little sense it makes (even for an Italian horror flick of the 80s!).<br><br>The amazingly 80s music and costumes are rivalled only by the dialogue and dubbing in terms of entertainment value, so while Paganini Horror might not be the finest of horror films it's certainly among the funnest! OK, so not much happens, really  some running around, some screaming, some killing, all freed from the constraints of logic and storytelling  and it's both well-paced and fine to look at, while some of the gore effects are superb (and the others are, of course, superbly entertaining). The score is better than the band's songs allow the viewer to hope for, too, and the small, rather mismatched cast are somehow perfect for this sublime nonsense.<br><br>The male drummer and video director are both completely ineffectual characters, the former played with some panache by Pascal Persiano, the latter portrayed in a flagrantly comedic style by Pietro Genuardi  but this movie's all about the women, and its the female cast who dominate from start to finish. Bonus! Two of the girls in the band are pretty hot (Maria Cristina Mastrangeli and Michele Klippstein), while the other one (Jasmine Maimone as singer/bandleader Kate) overacts with astonishing vigour, and Luana Ravegnini as their manager (less hot than the hot girls, but prettier and a better actor than Ms Maimone) alternates hilariously between being a hard-nosed boss-bitch and screaming along with the rest of the girls.<br><br>The aforementioned twist ending is incredible, and made me marvel once more at the talents of the film's two big horror-genre names, top-billed Daria Niccolodi and guest star Donald Pleasance, for delivering such idiotic lines with such bravura seriousness.<br><br>Pleasance is so gleefully sinister during his short screen time that his character comes across more charming than chilling (not surprising really!). Niccolodi's acting is as solid as ever, and she's sometimes lost amongst the screaming, overacting girls but it works because it's her character who delivers a lot of the important lines, and she's utterly pivotal to the greatness of the film's finalé.<br><br>For all the wrong reasons, this is a classic of Italian horror!","user":"CantripZ","rank":[12,13]},{"title":"A big Paga-no-no!","rating":3,"date":"28 May 2010","review":"When a predominantly female rock band are lambasted by their producer for failing to write a decent tune, their male drummer purchases an unpublished score written by violinist Paganini, who was rumoured to have murdered his wife and sold his soul to the devil in exchange for fame and fortune.<br><br>The band use the music as the basis for their newest song, and decide to shoot the accompanying video in the very house in which Paganini sealed his Satanic deal. This proves to be a bad idea when they discover that evil forces are still at work in the old building, where time and space have their own rules and a mysterious masked murderer lurks, armed with deadly violin equipped with a spring-loaded blade.<br><br>\"What a strange light,\" mentions one character to her friends as they investigate the spooky house at the centre of the Paganini Horror. \"It's more than strange\", comes the reply, \"it's weird.\" This dreadful exchange of dialogue (one of many) is fairly representative of this late-80s Italian horror as a whole: it makes no sense whatsoever—not surprising since it was written and directed by Luigi Cozzi, the man who gave us dumb, Z-grade, trash sci-fi flicks Hercules and Starcrash, and the very daft Alien rip-off Contamination.<br><br>Cozzi seems to be aiming at delivering a Dario Argento-style supernatural horror in the vein of Suspiria or Inferno, but being a total hack, only manages to emulate Argento's garish lighting with any degree of success. The plot is so muddled that even Argento's most outrageous work seems logical in comparison (believe it or not, one character is inexplicably killed by wood fungus!), the direction is basic at best, and the score is a diabolical mix of 80s pop-rock and classical music.<br><br>Not one of the cast puts in a credible performance, with particularly bad acting from Pietro Genuardi as the band's video director Mark Singer, who is supposedly a top horror film maker, but who works with a single shoulder mounted camera, no crew and absolutely no sign of a script or storyboard; even Argento's muse Daria Nicolodi and Donald Pleasance are dreadful, with Nicolodi overacting wildly and Pleasance looking rather embarrassed to be involved.<br><br>Don't go expecting much in the way of decent gore either: most of the deaths are pretty bloodless, and even the most gruesome moment—a woman's head crushed by an invisible wall—will have you laughing at the cheap effect, achieved by pressing the actress's face against a sheet of glass whilst running fake blood over her head.<br><br>If it hadn't been for the fact that a couple of the women are very easy on the eye and happily squeeze into body-hugging outfits, I probably would have fallen asleep way before Cozzi calls it a day and wraps the film up with a simply awful surprise ending.","user":"BA_Harrison","rank":[13,17]},{"title":"This Trash Is So Lame and Ridiculous That Becomes Funny","rating":3,"date":"27 February 2015","review":"The female rock and roll band formed by Kate (Jasmine Main), Elena (Michel Klippstein) and Rita (Luana Ravegnini) want to release a new album, but their producer Lavinia (Maria Cristina Mastrangeli) refuses since their songs are very poor. Their friend Daniel (Pascal Persiano) buys a piece of music from a stranger called Mr. Pickett (Donald Pleasence) that explains that the music was written by Paganini himself and never released. Lavinia believes that the music will become a hit and she hires the filmmaker Mark Singer (Pietro Genuardi) to make a videoclip in a manor she has hired from her acquaintance Sylvia Hackett (Daria Nicolodi). Soon Rita and Daniel disappear and the floor collapses beneath Kate that also vanishes in the hole. The survivors try to flee from the real state but they discover that they are trapped in hell.<br><br>\"Paganini Horror\" is a trash so lame and ridiculous that becomes funny. The awful story and screenplay associated to ham performances with a cast that overacts most of the time, highlighted by the dreadful dubbing in English and terrible cinematography make this movie a classic of the trash genre. There is no explanation why the members of the band are doomed to hell. I do not understand why Daria Nicolodi and Donald Pleasence accepted to include this film in their filmographies. My vote is three.<br><br>Title (Brazil): \"Paganini Horror\"","user":"claudio_carvalho","rank":[9,13]}]