[{"title":"Very Nice-Looking Noir-Melodrama","rating":8,"date":"24 January 2006","review":"For me, the best part about this film was the exceptional lighting which made this a great movie to see on DVD. The great black-and-white photography reminded of films like The Sweet Smell Of Success and To Kill A Mockingbird. The camera-work in this movie does not take a backseat to those great films, believe me.<br><br>Story-wise, it's a somewhat-familiar Joan Crawford movie with a bit more emphasis on the melodrama than the film noir, a la Mildred Pierce. That's a compliment because \"Mildred\" was a well-crafted story and so is this. It's an effective mixture of drama and noir. However, unlike \"Mildred,\" this Crawford character (\"Ethel\" aka \"Mrs. Forvbes\") has a worldly edge to her with a chip on her big shoulders. It's tough to sympathize with her in this story, frankly.<br><br>Kent Smith plays her naive, wimpy dupe for much of the film but when David Brian enters the scene, the movie really picks up. Gangster Brian is nobody's patsy and he's fascinating, portraying the most intense character in the story.<br><br>This is another one of the fine classic movies that never got a VHS showing but finally got a break with a recent DVD release, which is all the better since the camera-work is deserving of the nice look this transfer gives it. Once more, another impressive movie from 1950, one of the better years Hollywood ever had.","user":"ccthemovieman-1","rank":[40,42]},{"title":"The Damned Would Cheer After Seeing this Film ****","rating":9,"date":"28 September 2008","review":"5 years after \"Mildred Pierce\" and Joan Crawford is at it again. Again, she is poor and is willing to climb to the top no matter what. In this film, she becomes involved with organized crime and becomes a real pro in being used to infiltrate other wayward mobsters.<br><br>From poverty to that Mildred Pierce mink, Crawford gave a truly memorable performance. She will stop at nothing to get to the top.<br><br>Along the way, she seduces timid accountant, played masterfully by Kent Smith, to join the mob only two realize that the two of them are trapped.<br><br>Another favorite co-star of Crawford, David Brian appears as the head mobster who is against violence but must come to grips with it when renegade hood, the always terrific Steve Cochran, seduces Crawford and then goes after her when he discovers that she is a Brian stooge.<br><br>This is a gripping film-noir at its best.","user":"edwagreen","rank":[18,18]},{"title":"Excellent Performances","rating":10,"date":"3 July 2009","review":"The hard-working Joan Crawford scores again in this 1950 film. Here she plays a working-class mom who witnesses her son get killed while she's fighting with her oafish husband (Richard Egan). She bails the marriage and ends up as a two-bit model in a small dress manufacturing company. She models and takes clients out for a good time.<br><br>The she meets a timid bookkeeper (Kent Smith)and together they worm their way into a mob-like syndicate run by brutal David Brian. As they work their way up the ladder, Joan's small-town girl is transformed into a faux oil heiress/socialite with the help of a real-lie but broke socialite (Selena Royle). But when Joan is asked to head west (to Las Vegas) to get the goods on a scheming subordinate (Steve Cochran), all hell breaks loose.<br><br>Crawford is superb here. At age 45 or so she looks great and gets to display a range of emotions as the tough-and-determined Ethel/Lorna. Egan, Royle, Brian, and Cochran are all excellent. This one ranks among Crawford's best Warners films and not to be missed.","user":"drednm","rank":[21,22]}]