[{"title":"Satanic Late Hammer Flick","rating":6,"date":"15 April 2008","review":"\"To The Devil A Daughter\" of 1976 is on of the last films from the great Hammer studios, and, as it seems, it was a disappointment to many of my fellow Hammer fans. For understandable reasons, since this is the second of two Hammer films about Satanism and black magic based on novels by Dennis Wheatley. Both films star Christopher Lee and the first, namely \"The Devil Rides Out\" of 1968 is easily one of the most brilliant films ever released by this great Production Company. And \"To The Devil A Daughter\" can not nearly compete with \"The Devil Rides Out\", but, as far as I am considered it is still a creepy film that is more than worth watching for a Horror fan.<br><br>The performances are exceptional, and I am not only talking about the great Christopher Lee. Lee is brilliant as always, of course, but the cast includes quite a bunch of other great actors. Richard Widmark also delivers a great performance and so do Denholm Eliott, Michael Goodliffe and the great Honor Blackman. Young Nastassia Kinski is also exceptional in one of her very first roles. The cinematography is great, and the film is often very eerie, but it sadly lacks the wonderful Gothic atmosphere that Hammer fans love so much. The film has atmosphere, no doubt, but sadly not the typical Hammer-style. This may be the main reason why many fellow Hammer fans are disappointed with the film. And it was also the lack of Gothic elements that I disliked about the film. But even though it is definitely one of the lesser films from Hammer and it may disappoint on a certain level, the film is definitely a creepy flick that fans of the studios should not miss. If you expect a shining finale to 20 years of brilliant Hammer rule, you run risk of being disappointed. Just expect a creepy little film with a great cast and enjoy!","user":"Witchfinder-General-666","rank":[26,28]},{"title":"\"Hammer's final horror film.\"","rating":26,"date":"26 November 2004","review":"*POSSIBLE SPOILERS*<br><br>Father Michael Rayner (CHRISTOPHER LEE) was ex-communicated from the Church of England for attempting to bring a personification of the devil to Earth. Twenty years on and Rayner has settled in Germany with his devil-worshiping followers under the facade of the \"Children of the Lord\" cult. Rayner sends his godchild Catherine Beddows (NASTASSJA KINSKI) to England to join her father Henry Beddows (DENHOLM ELLIOT) for her 18th-birthday. Rayner intends to fulfil his old ambition and rebaptise Catherine into the service of evil. Henry who was forced into the cult's evil-doings because his wife was a member of the cult attempts to recant and places his daughter in the care of occult novelist Jim Verney (RICHARD WIDMARK) who must confront and destroy Rayner before he succeeds in making the devil walk the Earth in the form of an innocent girl.<br><br>TO THE DEVIL A DAUGHTER was Hammer's final horror film and the company's second attempt to bring one of Dennis Wheatley's occult novels to the screen. Wheatley was overjoyed by the company's filming of his novel THE DEVIL RIDES OUT (1968), but was apparently less pleased with Hammer's version of his popular TO THE DEVIL A DAUGHTER novel which Hammer had considered adapting for the screen as early as 1963. The film took a very respectable £13, 375 on it's opening week at the Odeon Leicester Square and it reached number three in the London Film Charts. On it's general release the film's takings were estimated at about £200,000.<br><br>Yet despite this success, Hammer's plans to film Wheatley's THE SATANIST were sadly scrapped. Thus continued Hammer's trip into oblivion which came to a head with an ill-advised remake of Alfred Hitchcock's THE LADY VANISHES in 1979.<br><br>TO THE DEVIL A DAUGHTER is a most enjoyable film. The script may be a little confused but the gore scenes are suitably erotic (more so than in most other Hammer films) and it benefits from good production values and an exemplary cast. Lee is excellent as the disgraced priest, a complete contrast to his portrayal of the Duc De' Richeleau in THE DEVIL RIDES OUT, while Richard Widmark shines as the hero. His performance is up to the standard of the Hammer heroes portrayed by Peter Cushing and Andre Morell even though his character only conflicts with Lee's once. The direction of Peter Sykes is good even if his other feature film credits like STEPTOE AND SON RIDE AGAIN (1973) may cause some initial doubts. Hammer purists consider this to be the company's worst film. It is more graphic than the earlier Hammer horrors and more or less ignores all the traditions of the company's earlier films, which makes it all the more better.","user":"jamesraeburn2003","rank":[25,30]},{"title":"Underrated","rating":27,"date":"27 July 1999","review":"Underrated thriller that despite being slow and meandering still manages a few nice shocks and is never less than interesting. This attempted to match The Exorcist for near-the-knuckle images and themes, and although it lacks that film's lasting power to haunt it does have a strong line in perversity that may surprise the most jaded unshockable viewer. Christopher Lee is great as the smiling, gentlemanly paganist - Natassja Kinski looks great and goes through the film like a day-dreaming naive child, which is exactly what she is supposed to be. Admittedly the creature at the end could easily have climbed out of a cornflakes packet as the depths of hell, but it doesn't ruin the film. Channel 4 recently showed a wide-screen version. It was well worth taping.","user":"sol-9","rank":[22,27]}]