[{"title":"A film so perfect, it's revolting","rating":19,"date":"19 November 1999","review":"\"Female Trouble\" is one of John Water's best movies, probably the best of his pre-respectable (read: pre-\"Hairspray\") flicks. Posessing a much more strong (and bizarre) plotline than the also brilliant \"Pink Flamingos\", \"Female Trouble\" documents the exploits of Dawn Davenport, a horrible juvenial delinquent turned criminal played by the unbeatable Divine.<br><br>\nThis was Water's last film to features his entire original ensemble of actors (Divine, David Lochary, Mink Stole, Mary Vivian Pierce, and Edith Massey) and each has a memorable and hilarious role. Stole steals the show as Dawn's \"retarded\" 14 year old daughter, but Edith Massey is also great as Aunt Ida, who constantly urges her nephew Gator to turn gay (\"The world of the heterosexual is a sick and boring life!\"). <br><br>The scene where Dawn hits Ida on the head with a fish is worth the whole price of admission. Recommended!!!","user":"zmaturin","rank":[29,31]},{"title":"John Waters' Masterpiece!","rating":10,"date":"31 December 2003","review":"This film is my favorite of all time!  All of the great elements of John Waters' films mesh together perfectly in this hilarious romp that operates around the theme of 'crime is beauty.'  All of the classic John Waters' actors are here, and most of them give their best performances. John Waters has said that this film is the 'ultimate Divine vehicle', and he's right.  Her look literally changes every ten minutes as she mutates from a teenage hair hopper with an attitude to an unwed, abusive mother, to crime fashion model to death row inmate.  Divine also has a small male role as the father of her own illegitimate child.  Edith Massey, my personal favorite actress, gives her funniest and best realized performance as Aunt Ida, the bitter, veangful fag hag who lives next door. This is not the most accesible of Waters' films, and truthfully, this probably isn't the one to start with if you're not yet a fan (I would recommend Polyester or Hairspray in that case), but if you want to see an early work thats not quite as gross as the others, check it out!  Waters himself says that this is his favorite of his underground films.","user":"FauxShow","rank":[20,23]},{"title":"9/10","rating":9,"date":"27 November 2004","review":"God bless John Waters. He's made some of the best, crudest feel-good movies, and this is one of his crowning achievements. It's amazing how his film, ugly-looking and full of lipstick-smeared freaks, can feel positive and upbeat; while he's mocking everything in sight, he doesn't stand back and protect himself with irony or winks -- he jumps right in there, and that involvement, that energy, is easy to see and feel. It's amazing that he can feature masturbation with needle-nose pliers, beating a child with a chair, a game of \"car accident,\" and Divine literally screwing himself and not have it be off-putting. <br><br>The very idea that Waters uses a fat transvestite with a beehive hairdo to illustrate his scorn for school shows he's not so interested in subtlety. And Divine is awesome, as always, his prissy, gravely scream -- a freak you want on your side. This is one of Waters' best satirical attempts -- there are digs at hippies and Hare Krishnas, and two scenes in particular are very prophetic: the gay encouraging, and the killing for art. Waters even mocks his own shameless exhibitionism in the testimony of the Dashers. 9/10","user":"desperateliving","rank":[25,31]}]