[{"title":"Black Peter","rating":8,"date":"10 January 2012","review":"This brought to mind CLOSELY WATCHED TRAINS, another early Czech New Wave film about a teenage apprentice who's none too excited about his work. Both are coming-of-age comedies with some moments of awkward teen romance. This film (Forman's first feature) actually predates Menzel's, and has more of a freeform, anecdotal structure. Although not explicitly a commentary on Communism, Petr's distaste for spying on customers clearly has some political implications. The film has a gentle, naturalistic pace with scenes that have a nice attention to detail. Ladislav Jakim struck me as a fine young actor, and I liked how the rival boy gradually developed into a more sympathetic character (particularly during the dance scene, which was my favorite part of the movie). Jan Vostrcil, the wonderful lead in Firemen's Ball, perhaps lays it on a little thick as the overbearing father, but it's a somewhat humorous performance. Although the comedy is quite mellow and subdued, there are a few laugh out loud moments. Unfortunately, the Facets DVD sports an ugly transfer, and woefully incomplete subtitles. Entire swaths of dialogue went by without translation.","user":"MartinTeller","rank":[13,15]},{"title":"Peter's nick already incarnates the spirit of Prague's unique Black Theatre","rating":7,"date":"11 September 2011","review":"this movie evokes to perfection a time, a spirit, even a country (Czechoslovakia) that no longer exist. It's perhaps the most Godardian film among those not directed by the then innovative French movie maker Jean-Luc Godard. It is full of abrupt cuts, hand-held shots, dialog obviously improvised, and so forth. But Forman's humorous tone is quite far away from Une Femme est Une Femme, or Bande À Part. His background is the neo-realist heritage of everyday topics, non-professional actors, and social concern. (Godard, let me remind you, went from rightist anarchist to Maoist wannabe sharkopath, from pioneering cinematic language to self- indulgent mimic.) Forman's subsequent comedies - namely Loves of a Blonde and Taking Off, were better structured - but Peter &amp; Pavla, almost half a century later, turned into a cute retrospective cameo.","user":"jgcorrea","rank":[8,11]}]