[{"title":"A Historic event recreated with skill and wit.","rating":10,"date":"10 July 2003","review":"Perhaps not many new viewers of this gigantic recreation are aware of the fact that this movie was filmed almost 30 years after the actual events took place.<br><br>The efforts to put History on screen were huge. Everything in this account of the facts, comes directly from those who were actually involved in it: from the British and German fighter aces to private Londoners, they all contributed to make this not just another \"war movie\", but rather a dramatized documentary with accurate precision.<br><br>This by no means signifies that it is just that. The sky battles were very carefully choreographed, in accordance to rules of combat, which were followed in the 1940s. Some planes were flown by the same veterans, so that when you see a Messerschmitt Bf-109 followed by Spitfire Mk 1, you know it's for real.<br><br>The technical efforts were immense and although the Messerschmitts have reworked engines and even the Heinkel He.111s have different aerials and engine specs, because they were updated by the Spanish Air Force for later use after World War Two, the difference is barely noticeable when one watches one of those spectacular aerial battles.<br><br>On the whole, this is a history lesson about how a people, isolated from the rest of the world, and in a minority position, withstood the overwhelming crushing machine of the Axis: the Luftwaffe.<br><br>More than a movie, this is a celebration to those brave people, both civilian and military, who did commit themselves against all odds, to resist and fight back a very aggressive and dangerous enemy.<br><br>This, together with \"The Longest Day\", \"Sink the Bismarck!\", \"Tora! Tora! Tora!\" and \"A Bridge Too Far\" is one of those rare examples to make history come to life again and should be considered as didactic material for schools.<br><br>An excellent multi-national cast and a skillful direction, make this a masterpiece of its genre.","user":"jlpicard1701E","rank":[129,141]},{"title":"Holds Up Well","rating":9,"date":"21 January 2002","review":"I recently reviewed this film after having not seen it since it was new. Being a 31 year military veteran I have a somewhat different frame of reference for watching films such as this. I look for things in a film many civilians never will. I don't think this one has ever been shown on TV in the US, at least not within a couple of decades, so it's certainly not overplayed here. Luckily, the tape I accessed was in excellent condition so it was crisp and new in appearance. It is still a very excellent film depicting one of Britain's most harrowing times and the unwavering heroism of those who fought so desperately to secure their victory. The film didn't enjoy many fine reviews when it was new as it was compared, as most war films are, to the plethora of fiction produced by the movie industry and REAL history usually comes off looking mundane by comparison. I have found this a similar oddity for many excellent films of war. This is one film that more than adequately stands the test of time and I would absolutely love to see a wide-screen DVD version of it offered. Although it helps to have an understanding of war in general, and in particular the second world war and the actual battle of britain, one can be ignorant of those facts and still come away well entertained. It is a wonderfully produced film, acted with talent and grace by a cast of performers who are now legendary. The sets, costumes and musical score are wonderful and perfectly compliment the cinematography. If I can find a copy I am going to add it to my library.","user":"bjones","rank":[66,72]},{"title":"The Window of Time....","rating":10,"date":"6 September 2010","review":"I was a youth living near Hornchurch RAF aerodrome during this battle and vividly remember the hot sunny September afternoons when we could watch great aerial dogfights in the skies above almost every afternoon. We ducked into the shelter if the dogfights were directly overhead, but the drama was too great to stay there if the coast seemed clear enough (This was probably unwise- on one occasion a piece of metal, later identified as part of the engine cowling from a Me 109, whistled into our garden a few yards from us - but what wonderful memories it has left me throughout a long life.) I avoided watching this film depicting the events for a very long time - I did not want to come up with some lukewarm judgment that yes it was quite a good attempt to re-create what I remembered so well. The greatest compliment I can pay this film is to acknowledge that I made a mistake - watching it, I learned what it means to be transported back in time and to be present again during one of the great moments in history. This experience totally transcends any reality TV.<br><br>My heading - the window of time- refers to the short period following any great event during which it is possible to create a worthy reproduction of it in pseudo-documentary form. Once this opportunity has slipped away it will never return. Recognition of this finally led to the long planned film actually being created - there were only just enough of the aircraft left flying, many of them having reached the end of a long period of service with the Spanish Air Force. Details like antennae changes were not really important except to survivors of the battle, but it was sad that the film has had to reinforce the myth that the United Kingdom was saved by the magic of its new Spitfire fighters - actually the brunt of the battle on the British side was carried by the more venerable Hurricanes which achieved the majority of the \"kills\" during this phase of the war. There were not enough Hurricanes still in serviceable condition to enable this to be shown accurately (one of the very few minor historical 'errors' in the film). We can all envisage an attempt to create a similar film today if it had not been made when it was. Very carefully constructed flying models, assisted by close-ups shot in re-constructed cockpits and some computer generated fighting effects, would all look incredibly real on the screen but at the end our reaction would be that we had watched a technological masterpiece, not a feeling that we were present during real events! The cast list reads like a who's who of the great British actors of the period, but as with the real events the Germans and all important Canadians, Poles and Czecho-Slovakians were also appropriately represented. Overall the acting level was consistently good and this film also incorporates one of the all time great moments on film - I am thinking of four very brief linked sequences totalling not much over a minute which essentially summed up the complete story. First Londoners, sheltering underground from the nightly blitz on September 15th, listening to a news bulletin reporting heavy German air attacks all day, their losses 163 planes with RAF losses 40 and 10 pilots safe; then Air Marshall Downing, asked by Churchill for amplification because Capital Hill believed German claims that the low RAF losses showed the final destruction of the RAF, responded \"I am not very interested in propaganda, if we are right we have won this battle - if wrong the Germans will be in London in a week.\" These were coupled with two very brief sequences, one showing returned German pilots assembling for their evening mess dinner and staring dismayed at all the seats which were not filled, the other the German invasion flotillas in the Channel ports being dismantled two days later. Historically this film has few inaccuracies but wisely does not address the ongoing question of whether the Battle of Britain or the Battle of the Atlantic (almost equally well served by the film \"The Cruel Sea\") was the more important. Whilst both were vital to an allied victory, the former was shorter and more intense - which made it easier to reduce to the scale of a film - whilst the latter dragged on right until the end of the war and ultimately claimed many more lives.<br><br>For a very long time to come this film will remain a standby in schools trying to increase awareness of key events that have shaped their world among today's children - many uninterested per se in history, But I was too personally involved to assess its likely appeal for other IMDb users - all I can say is that it a well made and gripping film which will not be quickly forgotten. Some critics dislike a very minor romantic sub-plot involving the wife of a squadron leader serving in the WAAF, who fears hearing of his death every day as she is plotting the movements of the planes - eventually he experiences a bad crash, surviving severely burned and facing a very long period of rehabilitation. But I believe this provided a very necessary reminder that great events are achieved only at high personal cost.<br><br>Real history buffs may note that there is a later DVD also entitled 'The Battle of Britain' (Classic Pictures- 2004) It carries the sub-title 'The Official History' and is essentially a documentary assembled from contemporary monochrome newsreel sequences, spanning a longer period that includes the night bombing 'blitz' which followed.","user":"bbhlthph","rank":[17,17]}]