[{"title":"A classics, phenomenal and arguably the best sci-fi flick masterpiece!","rating":10,"date":"23 April 2016","review":"Star Wars: Episode IV - A New Hope (1977) is a classic phenomenal arguably the best sci-fi film in trilogy away, the one that started all and arguably changed the face of cinema forever. I love this film is actually my number 1 favorite film in the franchise and it is George Lucas masterpiece - the man who make this film happening. He wrote and Directed him self, I love this film to death! I love everything that is in A New Hope. Before I go in to this movie I want to say after watching the new awful horrible movie Episode VII The Force Awakens, I decide to re watch the original Star Wars Trilogy and I have always loved A New Hope and I always will. This was the first film in the trilogy that I have saw as a kid and that I remember. Star Wars are starring Mark Hamill, Harrison Ford and Carrie Fisher.<br><br>The plot is actually more about Rebel Alliance, led by Princess Leia (Fisher), and its attempt to destroy the Galactic Empire's space station, the Death Star. It is a mission returning the plans of Death Star to the Rebel Alliance, while Galactic Empire want's them back and it is lead by Darth Vader (David Prowse). This movie is what it is, a perfect 10, because it takes the vision of one of the most imaginative directors on Earth, and realizes them almost perfectly with all the tools that fit the task -- actors, stunts, puppetry, models, and Special Effects.<br><br>Star Wars is a film that I have watch it now and I will always watch it , because how much I really, really enjoy this film. This fun, pure joy, entertaining and truly a great film is like a classic, I recommend this film to any fan of the Star Wars trilogy, my favorite will always be A New Hope. This was the film that I have saw the first time as a kid and it grow on me. I love introduction when C-3PO and R2-D2 are walking trough the desert on planet Tatooine and are captured by Jawa traders, who sell them to moisture farmers Owen and Beru Lars and their nephew, Luke Skywalker. Here is the first time we met the character Luke Skywalker. This is the scene where C-3PO is walking trough the desert him self and than he saw someone far away and yells for help. I love this scene and it is the scene I remember from childhood.<br><br>Which is your favorite character? My favorite character of all time is Luke Skywalker and I really love him so much. My second favorite character will be Han Solo but Luke Skywalker will be the ultimate hero of the galaxy for me.<br><br>I love this flick, I love the end battle on Death Star, Luke joins the Rebel assault squadron and Luke becomes one of the few surviving pilots. Vader leads a squad of TIE fighters and prepares to attack Luke's X-wing fighter, but Han returns and fires on the Imperials, sending Vader spiraling away. Helped by guidance from Obi-Wan's spirit, Luke uses the Force and successfully destroys the Death Star seconds before it can fire on the Rebel base. I love that scene.<br><br>I love John Williams score for Star wars which is the best score ever! It is an excellent score makes an actions scenes more exciting and more intense. George Lucas directed this movie well and did an excellent job been a writer as the same time been the director, the pacing is excellent the actors does an awesome job. I also love and I have enjoyed the character Darth Vader and I also love this film because it has a happy ending. Harrison Ford , Mark Hamill and Carrie Fisher did all a great joy playing their characters.<br><br>Carrie Fisher is really gorgeous in this film and for the 70's film it had great pacing and great imaginary story that dose not gives you only a snippet of the backstory. The fight scene between Darth Vader and Obi-Wan \"Ben\" Kenobi was excellent and the death scene of Obi-Wan was a honorable death. Alec Guinness did a perfect job as Obi-Wan \"Ben\" Kenobi he is excellent. <br><br>Overall: I have said everything about this film that I love I forgot to mention I love Han Solo, Princess Leia, Luke Skywalker (I love to death), Chewbacca, C-3PO and R2-D2. This flick get's a perfect 10 because it is the best beloved science fiction film.<br><br>R.I.P. Carrie Fisher (1956 - 2016) she was the perfect Princess Leia and she is very missed.","user":"ivo-cobra8","rank":[154,176]},{"title":"One of the most successful movies of all time (and I'm not talking about the Box Office take)","rating":10,"date":"26 October 2003","review":"What made this the hugely successful triumph it was? Was it casting, music, imagination, ingenuity, or luck?<br><br>I remember opening day at the theaters. I was old enough to remember every scene, every character, every nuance of this film; having committed it to memory forever, as if I would never again be able to see this beloved, instantly loved masterpiece.<br><br>I also remember that the HIT factor of this movie was so unexpected that you had to wait literal MONTHS to get the action figures promised on the cereal boxes. The pieces were still in the manufacturing process and we had to settle for coupons promising our toys in a few months. I wound up seeing this in the theaters a grand total of 36 times; much to my mother's dismay. She loved the movie as I did, but felt I was obsessed. Today, thirty years later, sitting here writing this review, I realize how right she was. I'm still obsessed with this movie, and with the subsequent movies which followed. I wait in great anticipation for Episode 3. I'm a fan, and I don't care what other people say about Episodes 1 &amp; 2. I don't even mind the \"prequel\" factor, as the situation at the time, dictated to Lucas which movies he would do first.<br><br>See, I remember the studios saying to him that he had to choose from the three central climactic books, and trash the rest, or just trash the whole idea. He didn't exactly \"sell out,\" he did what he had to do to get his movie...his vision...out there for us to see and experience. I admired his decision then, and I admire it now. Episodes 1-3 are being filmed now, because Lucas had the clout, the money, and the patience to give us his vision...his complete vision and not just the three center books of a 9-book series. I realize that now, there are dozens of books, but at the time, there were nine. And while most of us were happy with Episodes 4-6 and would not have missed 1-3 and 7-9, I personally am so very glad he has taken it upon himself to give us his full vision. I have enjoyed each and every installment with the same sense of awe and joy as I did this one.<br><br>The casting was the first triumph for this cinematic milestone. Ford is a charismatic and magnetic personality and portrayed Han with a professionalism that you'd expect from more seasoned actors. Sir Alec Guiness is an absolute joy as Obi Wan. His casting was precise and excellent in that part. Carrie Fisher portrayed Leia in a way that, up until then, had never been experienced. Most \"princess\" types before her were whining, whimpering, little snots who were incapable of anything beyond tripping and twisting their ankle in times of peril, while Fisher portrayed her character as a bold, brazen, yet sophisticated and educated woman who was aware of her surroundings and capable of defending herself and her realm with the utmost authority.<br><br>And Mark Hamil. He was perfectly cast as the whining little boy who wanted more, but was afraid to reach for it. He grows up quite well on film in these three installments, and endears himself to the audience so much the more for it. But a cast member who is almost always left out of these reviews is Peter Mayhew. Chewbacca. His character, as a supporting character to Han's, was exemplary. It's not easy portraying a walking carpet, yet holding the attention, admiration, and love of virtual millions. I am VERY happy about his being cast as Chewy in Episode 3. Couldn't happen to a more deserving...or capable...fellow. Bravo! And James Earl Jones's voice being used as the voice of Darth Vader, was pure genius. His commanding voice haunted the dreams of countless thousands of star-struck children for generations to come. I also have to say that this movie would not have had the charm it does had it not been for Anthony Daniels' C3P0. He is a gift and a joy.<br><br>The musical score by John Williams featured in this masterpiece was one of the contributing factors. But honestly, this movie's success was such a total surprise to everyone, including Lucas, that nothing could prepare the world for the aftermath of having witnessed this bona fide legend, first hand.<br><br>The story itself; replete with sub-plot after sub-plot, rich in dialog and detail, was beyond anyone's greatest expectations. Everyone, including Lucas, expected this movie to fail. It is a timeless classic, which I will not repeat here. There are too many movie reviews giving full details of the plot, and I won't be redundant beyond what I have already said.<br><br>However, that being said, there are a few points I would like to make concerning the symbolism of this endeavor. The Force is a metaphor for the psychic abilities with which we are all born. It was also a metaphor for hope and faith, dedication and commitment to the greater state of being. The Empire is said to have been a metaphor for the Germanic Nazi \"storm troopers.\" While the Rebellion is said to have been symbolic of (what would later become) the NATO forces who defeated them.<br><br>And then there are the effects. The effects were, in 1977, so awesome; so creative; so ahead of their time, as to ensure this movie's vast success for the next forty years. George Lucas enjoys an almost god-like status among sci-fi/fantasy fans worldwide.<br><br>This movie does not rate a rating. Usually, when I say that, it is because the movie is so bad, or disappointing that I don't have the heart to rate it. <br><br>But in this case, it far surpasses any 10/10 rating I could give it.<br><br>The Fiend :.","user":"Elswet","rank":[526,670]},{"title":"A long time ago in a galaxy far, far away... before the fans were divided","rating":9,"date":"21 December 2019","review":"George Lucas's Star Wars Episode IV was released in 1977 and became an instant hit with both people and critics. It didn't just become an instant hit, Star Wars Episode IV revolutionised cinema.<br><br>Almost everything about Star Wars is iconic. John Williams's musical score is still to this day one of the best movie scores of all time, the creative and unforgettable special and sound effects, the title crawl, the flawless world-building, and the perfect cast. Mark Hamill plays the soon to be hero whose characters gets remarkably developed throughout the film, Harrison Ford plays a charismatic smuggler with charming personality, Carrie Fisher plays the alluring princess Leia, Sir Alec Guinness skilfully portrays Obi Wan Kenobi and of course James Earl Jones creates one of the most memorable vocal performances of all time with his portrayal of Darth Vader.<br><br>My only real flaw with Star Wars is that its story is a bit too full of subplots but, despite that, every single scene is rich in detail, characters development and well written dialogue ultimately leading up to an epic conclusion.<br><br>Taking everything into account, Star Wars is a fantasy epic that will always be remembered as one of cinemas greatest feats.<br><br>Final Grade - 9/10","user":"Aaron_Kyle","rank":[157,197]}]