[{"title":"A quite shocking radio show","rating":7,"date":"28 December 2005","review":"This has always been one of my favourite Abbott &amp; Costello's, it's a short, frantic murder mystery with plenty of slapstick routines to keep us fans happy. I think the pace of it all and the average volume of Lou's voice probably puts some people off, but hey they can't really be fans then, can they?<br><br>A murder is committed in full view in a radio studio, Bud and Lou are on the case unasked as detectives before the \"real\" ones show up. There's an odd love interest with Patric Knowles and Louise Allbritton, because he comes into the story, departs gallantly saying he won't take charity from a woman, and after the murder also gets involved unasked. Favourite bits: Watt's a volt; Lou in the \"clues closet\", Lou crashing through glass windows leaving his fleeing shape and even making an impression on a wall - all complete with hat; Alexander 2222.<br><br>The marvellous wartime Universal studio atmosphere pervades with some beautiful shadowy lit shots at the radio station - in fact the A&amp;C films I love best are all from this period, replete with the atmosphere the Universal technicians achieved seemingly so effortlessly then. To a fan: one of their best, to an unbeliever: don't trouble yourself or the fans.","user":"Spondonman","rank":[21,22]},{"title":"Abbott and Costello Meet the Killer","rating":9,"date":"13 December 2006","review":"WHO DONE IT? (Universal, 1942), directed by Erle C. Kenton, is a perfect example of how good a comedy can and should be, a fast-paced story with murder mystery combined. The result: 77 minutes of non-stop fun. Starring the comedy team of Bud Abbott and Lou Costello, this is prime Abbott and Costello, and the first to actually showcase them to best advantage, having the movie all to themselves, much to the delight of their fans.<br><br>Plot summary: Chick Larkin (Bud Abbott) and Marvin Q. Milgrim (Lou Costello) are a couple of soda jerks (no pun intended) at the Radio Center drug store where they hope to interest somebody in using their \"Muck and Myer\" script to land them jobs as mystery writers for GBS radio. Jimmy Turner (Patric Knowles), a former English college professor, is hired as a new staff writer for the \"Murder at Midnight\" program, thanks to Jane Little (Louise Allbritton), his former sweetheart and the show's producer. This does not fare well with its Marco Heller (Jerome Cowan), who fears of losing his job as top writer. While Chick and Marvin attend the broadcast of \"Murder at Midnight,\" Colonel J.R. Andrews (Thomas Gomez), executive director and producer, about to make an important announcement, suddenly dies. His physician, Dr. Merek (Ludwig Stossell) diagnoses it as his failing heart but Jimmy discovers the victim was electrocuted and calls it murder. Chick and Marvin take the opportunity to act as detectives to solve the mystery themselves, even when Moran (William Gargan) and Brannigan (William Bendix), take over as investigators and wanting to place the two phoneys under arrest. Later, Marek is found murdered and a mysterious figure is seen roaming about the building. Juliet Collins (Mary Wickes), the script girl and executive secretary to the late Colonel Andrews, assists Chick and Mervin, in spite the fact that Mervin, who she has become interested, is using her to break into the radio business. Juliet even keeps the two from the clutches of the detectives. While doing a little detecting of his own, Jimmy finds a secret panel in Andrews' office consisting of coded messages, learning that a spy had been using the network to relay information over the air. Feeling he has discovered a motive, Jimmy, with the help of Jane, decides to re-enact the \"Murder at Midnight\" broadcast in order to trap the real killer. Easier said than done with Chick and Marvin around.<br><br>With plenty of gags, inside humor and classic A&amp;C routines expertly worked into the plot, WHO DONE IT? has everything going for it, highlighted by atmospheric scenery, a wild roof top chase resembling that of a silent Harold Lloyd comedy (with Costello hanging onto a extended flag pole way above the city streets), and a well-kept secret to the killer's identity, which is enough to categorize this as a top-notch mystery-comedy. Aside from the question of \"Who done it?,\" memorable stunts include Lou's involvement with an obnoxious elevator boy who tricks him into giving him five drinks of lemonade for the price of one; getting duped out of tickets to a broadcast; and by getting short-changed (\"give me two dimes for a nickel\"). For the record, the obnoxious elevator boy is wonderfully played by Walter Tetley, not by Bud Abbott Jr.<br><br>Other key A&amp;C scenes include: \"Limberger cheese\" (where Lou serves the ultra smelling item to a customer while wearing a gas mask); Lou's facial expressions in fright; the Bud and Lou exchanges of \"Votes and Volts,\" reminiscent to their classic \"baseball\" routine that's also worked into the plot without them enacting it. See how that's done. The big topper of them all is Lou meeting his match, tricking a dopey detective (William Bendix) into getting himself handcuffed. (This handcuff routine was reworked with Costello and Charles Laughton in ABBOTT AND COSTELLO MEET CAPTAIN KIDD (1952)). Let's not forget Costello's finest solo routine set in a drug store phone booth across the street from the radio station as he attempts to get through to \"Alexander 2222\" to claim his $10,000 prize from the \"Wheel of Fortune\" contest. Never able to get through becomes nerve racking, especially when everyone else is able to make their calls successfully. Character actress Gladys Blake takes part of this priceless bit as the perky operator with the nasal reply of either \"The line is busy,\" or \"Number, please?\" Although musical interludes could have easily been worked into the script, being set at a radio station and all, and having the popular Andrews Sisters supplying a song or two as part of the radio hour, it wasn't for the benefit not slowing down the pace. With a fine assortment of character actors, Mary Wickes, in a Joan Davis-type performance, is an excellent foil for Costello. Sadly, their second and final collaboration, DANCE WITH ME, HENRY (1956), was far from being the best effort for both.<br><br>While not as notable today as ABBOTT AND COSTELLO MEET FRANKENSTEIN (1948), WHO DONE IT is highly recommended viewing. Aside from availability on video cassette and DVD, it's cable TV history consisted of the Comedy Channel during the late 1980s, and American Movie Classics circa 2001. (***1/2)","user":"lugonian","rank":[11,11]},{"title":"A & C return to that other popular entertainment medium of the 1940s","rating":8,"date":"9 December 2005","review":"We think of Abbott and Costello as burlesque comics, but the medium that gave them the national exposure allowing them to go into film was radio. It was on radio that the sharpness of such routines as \"Who's On First\" was demonstrated to millions, laying the groundwork for the film audience that Universal benefited by. And it was WHO DONE IT? that was their film about radio. They are soda jerks in a restaurant in the building that a radio station is headquartered in. They both want to break into radio. But when they are finally on the premises of the station, they are among the witnesses (and suspects) at the murder of the station's owner (Thomas Gomez). Due to Costello's continuous ability to make errors, they are suspected of the murder by the two detectives (William Gargan and William Bendix) who are assigned to the case. They are determined to try to solve the case and clear themselves.<br><br>Gargan and Bendix were ideal foils for A &amp; C, especially Bendix who meets Costello's dumb with dumber. The nadir for both cops is when they are guarding the front of the office building from Abbott and Costello entering it while the investigation is continuing. Bud and Lou, determined to enter the building, walk in backwards, so the cops think they are seeing them walk out (at least momentarily). Rumor has it that Costello determined never to make another film with Bendix - he was jealous of the latter's getting more laughs than him. It may be true, but then Lou was doing pretty well on his own here.<br><br>As it is a war picture, the mystery also deals with a spy ring. The actual perpetrator is a surprise of sorts at the end. A good comedy, I give it 8 out of 10.","user":"theowinthrop","rank":[15,16]}]