[{"title":"Doctor Detroit","rating":7,"date":"8 November 2005","review":"I remember seeing this movie on VHS while I worked at a video rental store in the 80's. I thought it was a funny campy movie but Hey! I like these kind of movies now and then. I always like Dan Akroyd movies so it didn't matter if this was not up to snuff with the likes of Ghostbusters or Blues Brothers. It was hard to believe he made that film then. I recently acquired this movie on laserdisc just about a week ago. I had not seen the movie since the 80's. I since taped over my VHS dub many years ago. It was great to sit down and have a few laughs and once again see the 'Doctor' in action. The picture is clean with only a few spots and scratches. The sound is only analog and not digital but delivers very surprising and powerful for an older movie. It's a fun film never the less. Yeah! it was no box office smash or a great comedy or action film, but there's just something about these lesser movies that brings you back to a better time. Dan does a great job even with the film's downfalls. Hey he got a great wife out of the deal marrying Donna Dixon from the film! It falls in the category with the likes of 'Howard the Duck'. Both were box office failures but there are still those devoted fans out there still searching for these 'gems' everyday. So for me the 'Doctor' is always 'in' my movie collection.","user":"madmanmarkd","rank":[18,20]},{"title":"Campy as heck","rating":5,"date":"23 June 2000","review":"This is not the type of movie you watch for the clever plot and well-defined characters.  This is a cheap, bawdy comic romp to be enjoyed with the fellas at a weekend get-together or at a bachelor party.  Where else can you see a nubile young Fran Drescher wearing next to nothing and James Brown urging a crowd of scantily clad dancers to \"get up offa that thang\" in the same movie?<br><br>Nothing wrong with a little mindless entertainment, especially since Dr. Detroit doesn't pretend to be anything else.","user":"slaususe2","rank":[11,12]},{"title":"An in depth look at the human psyche","rating":17,"date":"17 April 2000","review":"In this move, Aykroyd presents a fresh look at what makes a man tick, his desires, feeling, emotions and passions. Aykroyd plays Clifford Skridlow, a somewhat nerdish college professor who is timid and mildly neruotic. This character speaks to a lot of us as we walk our way through life, often unnoticed and unsatisfied with our interactions with others. Longing for nothing but happiness, we weave our way through the obstacles of life much as Clifford rushes through the quad on the way to class, taunted and laughed at by the students surrounding him. But this isn't just another movie designed to identify with unsatisfied loners.<br><br>While enjoying dinner at an Indian Restauraunt (symbolizing the social and cultural diversity of humanity), Clifford is picked out by a local pimp to act as a scapegoat to avoid debt to Mom, of the infamous Mom's Limo Company. How many times have you been picked by those more successful than you to take the blame? It's getting a little to real at this point, as the action picks up it's pace. Clifford must invent an inner personality to cope with the feelings of rejection and hatred, and the character Doctor Detroit is born. He embodies all that Clifford wishes he could be, suave, feared, respected, wealthy, and adored by women. The metal hand on his left arm is a not so subtle attempt to portray the desire of the weak to be strong.<br><br>\nThe strong reference to Nietzsche's idea of men rising up from the ashes and becoming a strong race of supermen cannot be ignored at this point, and it's clear that this is more than just a silly comedy. With his newfound alter-ego and inner strength, the doctor conquers evil and saves the day. In a triumphant final speed, the Doctor retires his inner personality encouraging the gathered crowd to be strong and find their own inner selves, while returning to a life of a normal, unknown man.<br><br>But what will happen to him? Why did he choose to let his inner self die? Was this a sacrifice, or a lack of courage? What would Nietzsche think about this complex analysis? This movie will leave you asking these any many questions. Highly recommended, especially as an introduction to other great works such as Nietzsche's Beyond Good and Evil.","user":"debtman","rank":[20,28]}]