[{"title":"Odd but beautiful","rating":3,"date":"3 February 1999","review":"This has to be one of the strangest films I have seen and its sheer oddity is one of the reasons I enjoyed it so immensely.  \"Anatahan\" is based on the \"true\" story of Japanese soldiers who were shipwrecked during World War II and refused to believe that the war had ended until six years after Hiroshima.  On the island with them, the soldiers find a man and woman who did not leave with the island's former inhabitants and the movie's intrigue centers around the soldiers' murderous lust towards the woman.  What is so odd about the film is that the actors only speak Japanese and the viewer is led through the story by an English-speaking narrator (Sternberg, himself) who variously refers to himself as \"I\" and \"we\" but never clearly identifies who that \"I\" might be.  The narrative is further complicated by the fact that at several crucial moments the narrator admits that no one knows what happened while we watch those events occur onscreen.  These constantly shifting levels of \"truth\" make this film always compelling as we are overtly challenged to question what it is we are seeing and hearing.  Like Orson Welles' \"F for Fake,\" truth and artifice interact to create a complicated web of meanings which--at least in my one viewing--never provided easy answers.  \"Anatahan's\" brand of \"truth\" is a precursor to more recent films like \"Fargo,\" whose truths are meant to be taken ironically rather than as literal fact.  Although this film is hard to find, try to get your hands on it if only to see the final piece in a genius director's long line of work.","user":"mohaas","rank":[30,31]},{"title":"Sternberg's last masterpiece, one of the great oddities of American cinema","rating":10,"date":"6 April 2008","review":"This had been a holy grail film for me for many years, mostly from reading Jonathan Rosenbaum's descriptions of it....sounded like a truly sui generis film, a soldiers-stranded-on-island and reverting to barbarism story told entirely with quite artificial-looking sets and unsubtitled dialogue, with the director narrating...a completely noncommercial film from a frustrated, bitter middle-aged director tired of fighting the studio bigwigs, determined to make a truly personal film whatever the cost.<br><br>I finally located a pretty decent VHS copy a few months ago and watched it last night, and I must say it equalled or even exceeded by expectations -- this really is a film experience like nothing else out there. The photography and sound, even on a somewhat soft and fuzzy VHS, are just stunning -- the sound design in particular is worthy of Lynch, and really the film as a whole is one of the weirdest American features to be released before Eraserhead. Sternberg's narration interacts in all kinds of ways with the action on screen, sometimes anticipating events, sometimes contradicting what we see, sometimes questioning...the hermetic world created on the sound-stage is obviously unreal, and yet the lush beauty of the photography and sets creates a unique otherworld as powerful as anything in the massive-budgeted 'scope spectacles that would be Hollywood's bread-and-butter for the next decade. It's as if Sternberg knew where American film was headed, and told us he could do something much more interesting at a fraction the price.<br><br>And if all of this makes the film sound like an arid exercise in technique and style -- fear not -- the ending, with the island's sole woman reflecting back on the several men who met their deaths as the result of their fighting over her, is powerfully emotional and resonant.<br><br>I'm not sure my comments are at all meaningful, this is a hard film to wrap my head around...suffice it to say I recommend it as strongly as possible to those that can find it.","user":"OldAle1","rank":[16,16]},{"title":"The perfect end to a brilliant career","rating":3,"date":"3 July 2008","review":"This film actually had a run in Paris outside the Cinematheque and it attracted considerable attention. It's an audacious,in-your-face sort of quirky film that works on many levels. Sterberg's autobiography \"Fun in a Chinese Laundry\" spells out some of techniques he employed but the film needs to be experienced beyond a mere description. It was shot in an airplane hangar to begin with, with all the tinsel and tin foil representing an island jungle. The limited number of players (all non-professional) and space (on an island) make this more of a chamber work rather than the Hollywood cast of thousands and its subdued drama will disappoint some who want things to be more explicit. It's purely artificial and looks that way deliberately. The film is in Japanese without subtitles and the narrator in English is none other than Sternberg himself. He warns the audience of what will happen BEFORE it happens, thus leaving us free to discover the camera-work, the scenery and the atmosphere minus the drama. Drama there is, of course, but detached from what's happening on screen. Everything in the film - minus the very last shot, alas - is artificial, dream-like and absolutely fascinating. What a remarkable end to a remarkable career. I highly recommend it although I wouldn't know how to find it. Good luck!<br><br>Curtis Stotlar","user":"cstotlar","rank":[16,17]}]