[{"title":"a very well made, cult, animated film","rating":9,"date":"9 May 2001","review":"A very well made animated film that has garnered a cult following.  The animation was groundbreaking for its day.  The film features music by Cheap Trick and Blondie but the songs never seemed particularly awe inspiring to me.  I enjoyed the storyline, and the post-apocalyptic style of the film worked well and fit with some of the humor in the film.  The animation is very psychedelic in the way it is presented, and this unique added a lot to my enjoyment of the film.  Overall, I thought it was a very fun film.","user":"shawndevin","rank":[19,20]},{"title":"Sometimes I wish I was still 10 years old...","rating":5,"date":"16 June 2005","review":"I have to say, I was very excited when I learned that this movie was going to be released on DVD. I vaguely remember seeing this as a 10 year old in the 1980s and being impressed (granted, as a 10 year old).<br><br>So I rented it last night and was overall disappointed, but I must say its probably because I had over-hyped it with my own cloudy memories. I found the animation and the general artwork to be very impressive. The songs were fantastic, especially \"My Name is Mok\", but I found the characters to be generally annoying and the story lacking much development. Mok was the only character who was interesting and entertaining. Omar was a self-absorbed narcissist who doesn't give the audience a reason to empathize. Omar's companions were overly juvenile as were Mok's assistants.<br><br>The story has a great basis--dangerous post-apocalyptic world of mutants. But we don't really get much of a feeling for this world beyond the initial set-up. Also, we know that Mok wants to raise a demon, but why? Did I miss it or is it never really stated? I assume he wants to dominate the world, but it seems to me that he pretty much does already.<br><br>Overall, the movie is lacking character development and follow through on the story. The music is fantastic and the animation is great. Its kind of a mixed bag. I only wish it had lived up to my expectations.","user":"nick_clemons","rank":[24,26]},{"title":"Remastered and in better shape than ever.","rating":10,"date":"8 June 2005","review":"Unearthed Films just brought this classic out on DVD in a two-disc collector's edition. It's well worth the price! The two-disc set contains the original Canadian version, the altered American version, and the release of \"The Devil and Daniel Mouse\", the inspiration for this movie. Also included are \"making of\" features about both \"Rock and Rule\" and \"Devil\".<br><br>This movie is animated, but it's not for the very young crowd. It contains animated nudity, occasional adult language, and adult situations such as drug use and death. That said, I first saw it when I was 12 and wasn't scarred for life. This movie's got it all: great music, great animation (far better than \"Heavy Metal\", a similar film, which was released around the same time), and a storyline that appeals to a more mature mindset. If you think of animation as two categories -- anime or \"Care Bears\" style kid stuff -- this doesn't belong in either. It's a uniquely American animation style. And the music! Debby Harry, Iggy Pop, Mick Jagger, Earth Wind &amp; Fire, it goes on and on, a constant stream of music that not only doesn't distract, but is a complement to what's going on on screen. The songs have aged very well in the past 30 years. This movie's a musical, but its music flows naturally, without those \"And now I must stop everything and sing!\" moments that make musicals so tedious. The special effects are also amazing, the more so when you consider when this movie was made.<br><br>I was one of the people who wrote Nelvana, and then Unearthed, begging for this re-release, and I was one of the first to order the set. I'm happy to say Unearthed has remained true to Nelvana's vision -- this set is everything I hoped it'd be. Don't miss it.","user":"ivinian","rank":[25,28]}]