[{"title":"The Resurrection Of The Hudson Sisters","rating":10,"date":"21 April 2017","review":"Ryan Murphy's series \"Feud\" in which Jessica Lange and Susan Sarandon play Joan Crawford and Bette Davis at the time of Baby Jane and beyond. I got so engrossed the series that I had to see What Ever Happened To Baby Jane again. Wow! Now, it all feels slightly different, less campy more poignant. Joan Crawford as played by Jessica Lange - the best performance by an actress in many, many years - is a totally recognizable person, crazy or not. When George Cukor tries to convince Joan not to be so vindictive \"you're better than this Joan\" to what Crawford/Lange replies: \"No George, I'm not\" Fantastic! Like another user already mention, I agree What Ever Happened To Baby Jane and Feud will be feeding each other keeping each other alive for generations to come.","user":"terencebells","rank":[120,130]},{"title":"Feud or Baby Jane's Next Chapter","rating":9,"date":"19 April 2017","review":"I'm so engrossed in the Ryan Murphy's series \"Feud\" that watching again \"What Ever Happened To Baby Jane\" was unavoidable. \"Feud\" works on so many levels and the performances are so spot on that I suspect What Ever Happened To Baby Jane will have another life and in this new reincarnation it will teach us something important about Hollywood, about acting, about fame and about the fragility of the human mind. All this in great part due to \"Feud\" Jessica Lange's performance as Joan Crawford is already, for me, in a pantheon of its own. There is not a moment in which the illusion falters and this is more true episode after episode. Susan Sarandon as Bette Davis is also superb but her character is the more educated, stronger. A Yankee. So she provokes a very different kind of emotion. To all fans of the actresses and of Baby Jane you can't afford to miss \"Feud\" and, please, give it a couple of episodes to adjust but once you get to the third episode \"Mommie Dearest\" you'll be hooked in the greatest possible way. Enjoy.","user":"ggallegosgroupuk","rank":[115,125]},{"title":"Baby Jane 2017 a whole other story","rating":10,"date":"23 July 2017","review":"I've always being a fan of What Ever Happened To Baby Jane. I saw it for the first time as a teenager and Bette and Joan became my obsession. I tried to see everything they had done and did I? All About Eve, The Little Foxes, Now Voyager as well as Mildred Pierce, Humoresque. I warmed up quicker to Bette. Her horrible women were priceless and she was fearless. Joan Crawford kept me at a distance, I think the cosmetics got in the way. But now, watching Baby Jane in 2017 - thanks to the amazing Ryan Murphy series \"Feud\" - I saw a very different Crawford and her performance has grown in scope and depth. I know I shall see this film again. Fascinating to realize there is still so much to discover.","user":"janiceferrero","rank":[60,65]}]