[{"title":"Not true Thompson, but a fun film.","rating":7,"date":"5 October 2000","review":"Whether you like this film or not will depend heavily on how big of a Hunter S. Thompson fan you are. <br><br>On the plus side, this film is wickedly funny. Bill Murray (an actor who has been both great and terrible in his career) does a phenomenal job as the acid-drenched reporter, bringing chaos into the lives of the rigid and pretentious. The plot is peppered with \"respectable\" places being dragged into mayhem, and \"respectable\" folks trying (unsuccessfully) to cope behind plastic smiles.<br><br>It even ventures into some higher themes, such as innocent kids being jailed by a heartless criminal system, and Thompson's own struggles between being a practical reporter and a fun-loving idealist (notice how Lazlo repeatedly re-surfaces just when Thompson starts to take on \"real\" jobs).<br><br>It's biggest fault, however, was that it failed to achieve any of the higher accomplishments of HST's writings. What makes Thompson such a powerful writer (to me, anyway) is the way he'll often turn on a dime and deliver stunningly sober dialogs on the human animal and where he's gone wrong. Nestled in the midst of the wine, women, and song are soliloquies that drive home a more positive message, and none of those made it into this film (in fact, no significant chunks of actual text from HST's books appeared at all). It's like they shaved off the surface 50% of Thompson's work and discarded the rest.<br><br>Compare this to Fear and Loathing, which was darker and more counter-cultural, and contained whole narrations excerpted from the novel. The latter perhaps has less appeal to the average viewer, but I'd think more to a Thompson fan.<br><br>All-in-all, this film is a light-hearted romp into anarchy, and worth watching. But if you've never actually READ Thompson, do so, as this movie doesn't accurately represent him.","user":"jrabbit-2","rank":[40,46]},{"title":"Not for the casual Fear and Loathing Fan","rating":7,"date":"2 February 2005","review":"I finally watched this movie after watching Fear and Loathing in Las Vegas about 50 times and reading almost all of Hunter S. Thompson's books. I have to say that while I enjoyed the movie, most people won't. Unless you have a pretty thorough knowledge of HST's work, it won't make much sense, and its comedic value will not be enough to make it worthwhile. However, if you have read FNL on The Campaign Trail and Strange Rumblings in Azatlan, then the movie will probably be of interest to you. One area where this film is far superior to FNL in Las Vegas is in its depiction of Oscar Zeta Acosta, the attorney who is the basis for Carl Lazlo here and Dr. Gonzo in FNL. Acosta was actually a prominent civil rights attorney in the 60's and 70's, especially in the Chicano community in Southern California. He also was a notoriously hard partier by most accounts. This movie does a much better job of capturing his odd duality than FNL does, and Peter Boyle is quite sharp in the role - interesting to watch for those of you who only know him as the father on Raymond.","user":"Raoulduke1845","rank":[28,32]},{"title":"The man vs. the myth.","rating":10,"date":"12 May 2004","review":"Fist of all, as far as the comparison to Fear &amp; Loathing In Las Vegas (1998) goes, these films are completely different beasts. Fear &amp; Loathing is a adaptation of a fictional work based on real events. Johnny Depp and Benicio Del Toro are playing Raoul Duke and Dr. Gonzo, not Hunter S. Thompson and Oscar Zeta Acosta. They are playing caricatures of real people, indirect representations funneled through HST's imagination and exaggeration. Where The Buffalo Roam is more based in reality. Bill Murray is directly playing Hunter S. Thompson as he writes his writings, Johnny Depp played a character from his writings, there is a massive difference. And as such, in my opinion, both films succeed brilliantly. Fear &amp; Loathing In Las Vegas is a visually dazzling, imaginative, cinematic adaptation of HST's novel and Where The Buffalo Roam is a quirky, splendidly fun quasi-biographical journey and pure snapshot of life.<br><br>Bill Murray is fantastic in this film. His portrayal of HST is taken from life, more realistic, more from the man rather than from his text or the legend of HST. The whole film itself, mainly because of Murray's characterization and the realistic structured style of the abrupt interconnected randomness of everyday life, is infused with a undying sense of fun and love for words, imagination, writing, and the whole creative process, which seems to me to get more to the core of HST as a man than the various vignettes of Fear &amp; Loathing.<br><br>Where The Buffalo Roam is wildly entertaining, frenziedly hilarious, and immeasurably fun. But when the general viewing audience, who presumably do not have a true passion for HST and his works, views both films and are given the choice between the legend and the man, they more often choose the legend, which is usually the trend in history.<br><br>Whereas Fear &amp; Loathing In Las Vegas has a romance for the stories and the myth, Where The Buffalo has a romance for the man and the process, and both have it for his personal style, politics and priorities.","user":"VideoKidVsTheVoid","rank":[59,74]}]