[{"title":"Not far from over","rating":16,"date":"16 March 1999","review":"I don't understand why critics always scorn this film. OK, it doesn't have the magic of its predecessor \"Saturday Night Fever\", but it works as an \"80's point of view\" of the original film. The thing is that you should watch this film as a single one, not a 'sequel'. It has nothing to do with \"Saturday Night Fever\" but the main character Tony Manero (once again played by John Travolta) and his mother (Julie Bovasso) in a brief appearance. Fast forward from 1977 to 1983. Now Tony wants to be a Broadway star and keeps his struggle for a more mature purpose, as he himself is more mature. Manero's \"moody girl\" here is Laura (Finola Hughes, not so convincing), who also looks down on him. The funniest thing about \"Staying Alive\" is that it is directed by Sylvester Stallone! (No one remembers...) The soundtrack is one of my favorite, although it didn't received the deserved attention at the time of its release, nor did the movie itself. (I think people were afraid of another 'Bee Gees fever'). After this film, Travolta's career fell out of the spotlight only to be retaken in late 80's with \"Look Who's Talking\". Summarizing, in my opinion it is a very good movie, but don't expect this to be another \"Saturday Night Fever\".","user":"Daniel-Couri","rank":[52,65]},{"title":"ONE OF THE MOST MISUNDERSTOOD MOVIES EVER MADE","rating":10,"date":"11 July 2001","review":"Sylvester Stallone's \"Staying Alive\" is one of the most misunderstood movies ever made. It is the sequel to the very popular \"Saturday Night Fever\". However, \"Staying Alive\" is often pegged as a turkey in comparison to the first film. That is very unfair.<br><br>I wonder whether critics have anything against the film or Stallone himself. Stallone had established himself as a very capable director with \"Paradise Alley\" in 1978 and \"Rocky II\" in 1979 and \"Rocky III\" in 1982. But they seem unwilling to lay off Stallone and his many talents. I think he does an excellent job continuing the story of Tony Manero (played again by John Travolta).<br><br>If you love dance, you will love this film. Stallone uses his camera extremely well to capture the nuances of dance itself. There is one very strong sequence in which Tony and his on-again, off-again girlfriend practice for a Broadway musical that takes up about 12 minutes and is just exhilarating.<br><br>The story is also very good here. Tony is now a professional dance instructor in Manhattan who has a chance to get a part in the hottest new Broadway musical out there \"Satan's Alley\". Tony finds himself torn between two women and Stallone asks a lot of tough questions about relationships here that a harebrained movie wouldn't even touch.<br><br>Travolta is again on target here as Tony Manero. A lesser actor wouldn't even touch material as tricky as this, but Travolta takes the risks and it pays off. The music (by the Bee Gees and Frank Stallone) is excellent and fulfills the same purpose music did in the original. <br><br>\"Staying Alive\" probably won't ever receive the recognition it deserves. For those of you wondering, I am not being paid by Paramount to say this. My opinions CAN'T and NEVER WILL BE bought. I genuinely feel that this is an exceptional film and that it deserves better than it has received over the years.<br><br>**** out of 4 stars","user":"Katmiss","rank":[118,168]},{"title":"love this movie!!!","rating":10,"date":"9 September 2007","review":"I love this movie. I grew up dancing in my basement to this soundtrack. John Travolta always a genius and Cynthia Rhodes is brilliant. <br><br>I think it is best to not compare it to Saturday Night Fever. Saturday Night Fever is in a league of its own and I do think Mr. Stallone was not trying to recreate the original.<br><br>On its own it is a fantastic movie!! Killer soundtrack and amazing dancing!! The best scenes in my opinion, are the opening audition scene, that is some serious dancing from Travolta, as well as the last scene of Satan's Alley-\"Jump Damn it!!\" <br><br>What more can you ask for???","user":"shannonlorraine","rank":[16,19]}]