[{"title":"The French touch","rating":10,"date":"6 January 2000","review":"This second movie of the team from the Splendid (a french theater) is as interesting as their first \"Les Bronzes\". Many jokes and many hilarious shots. The style of the movie is pretty the same than the first but is not a bad imitation. You could see the two movies one after the others (this is an advice) and appreciate them at their true worth.<br><br>The fame of these movies is so great that in France, it is very usual to meet people who have seen them more than ten times. The success of the the actors is so good that they have made many movies after these ones and many of them were very good. (For example: \"le pere noel est une ordure\")","user":"anthony.bodin","rank":[18,19]},{"title":"You can find it with English subtitles","rating":10,"date":"27 September 2007","review":"It is an excellent movie!! A French monument! For English speakers, you can find the DVD with English subs on amazon.co.uk. Most of the actors are part of the French comedy group called \"Le Splendid\", and they're all simply awesome. This movie is a sequel of \"Les Bronzes\" which in my opinion is not worth watching. It's good but it's far below the laughing fest that is \"Les Bronzes font du ski\". The dialogues are perfect and the situations are just hilarious. A group of friends who met in a Club Med for single people reunite to go ski together. When they decide to do a helicopter drop at the top of a ski resort things start to go wrong...but it gets real funny for us! I'm French but I hope foreigners will get a chance to watch it since it was a huge success in France along with \"Le Pere Noel est une Ordure\" (also available on amazon uk)made by the same \"Splendid\" group.","user":"florencetournie731","rank":[7,7]},{"title":"Not dated at all","rating":8,"date":"5 March 2005","review":"Follow-up to smash hit \"Les Bronzés\" with virtually the same cast and director. This time of course the setting is not a tropic Club Med place but a winter-sports resort in the French Alps.<br><br>Except for a rather annoying 'seventies' disco-style soundtrack, movie hasn't dated at all. Among the many hilarious highlights there is the local \"wine\" tasting scene and the encounter in a remote cabin with some horny Italians. <br><br>Almost everyone involved went on to become a major star in French cinema, as Christian Clavier (\"Les Visiteurs\" and recently Napoleon Bonaparte in a prestigious TV-series) and Gerard Jugnot (lead in the 2005 Oscarnominated \"Les Choristes\"). But also director Patrice Leconte became one of France's most respected directors (Le mari de la Coiffeusse,Ridicule,\"Les Grands Ducs\", etc...).<br><br>If you like this try also the crazy \"Le Péré Noel est une Ordure\", made a few years later and again with virtually the same cast.","user":"pete36","rank":[6,6]}]