[{"title":"Nothing great but better than the original.","rating":7,"date":"14 May 2017","review":"Saw this in the mid 80s on a VHS. Revisited it recently on a DVD. This is creepy n better than the original. It is also disturbing n repulsive. There are some occasionally scary moments, decent make-up FX, chilling atmosphere n it also has Lalo Schifrins marvelous score once again. We also have some demonic possession n exorcism which weren't there in the original. Pure Exorcist rip off style. The film has moments of tension but it does get a lil boring coz of its length. The movie has some great moving overhead camera shots by Franco Di Giacomo. Decent cinematography there. I was put off by the incest scene. Burt Youngs character is one of the best thing about this movie. He is a typical abusive patriarch n the guy owns the role.<br><br>This movie being a prequel to the original, it contradicts the opening of the original film in two scenes. In the original, the murder happens while all of em r sleeping but in this one they r awake n they try to run. In the original, the bodies r removed in the night but in this one they r taken out in the morning.","user":"Fella_shibby","rank":[19,20]},{"title":"Unusual Horror","rating":8,"date":"13 March 2004","review":"I liked \"The Possession\" more than the original. Part one was so phony that it was even comical in parts (not to mention the over-acting). Part two contains more real life horrors such as incest, child abuse, domestic violence and mental illness. Yes, it is loosely based on the DeFeo case. However, I believe the director avoided direct links to the incident because of possible lawsuits. One disagreement I have with William C. Uchtman is when he stated in his review that Ronald DeFeo Sr. was a swell guy. Well according to \"City Confidential\" on A&amp;E, the father was very abusive and was reported to have beaten \"Butch\" to a bloody pulp one time for simply talking back at the dinner table. Wife beatings were also reported. So, the abuse scenes are quite valid. The part when \"Sunny\" points a shotgun at his father after he punched his wife is valid too except that, in the real case, Butch pulled the trigger with no shells inside. That was the only difference. The counterculture involved is also interesting. The Montelli's are no typical American family, you see this from the start when Sunny returns from buying a pack of cigarettes and has an arguement with his father who threatens to \"kick his ass\".<br><br>Yes, \"Possession\" did copy parts of The Exorcist, but it's still a good film with more gory scenes than the original.<br><br>If you like over-acted supernatural thrillers, you may enjoy the first. But if you want to see a movie based on a real murder case (though admittedly from a supernatural point of view), \"Possession\" is for you.","user":"YankeeDood","rank":[53,62]},{"title":"I have never yelled at movie characters more than this!","rating":8,"date":"26 August 1999","review":"May contain some spoilers:<br><br>It's true. I have read some of the commments in here and there's are actually two people that said the exact same thing about the film. And that was that the film should have ended when the priest was looking into the house and he sees the spirit of the dead girl walking. Then the old lady comes up to him and says she has heard stories about the house. That would have been an awesome way to end it and I then would have given it a ten. As it stands I am still giving it an 8 because even though the end was contrived and straight out of The Exorcist, it is still one hell of a scary film. And if you thought you had reason in the first one to yell \" Get out!\" then wait till you see this one.<br><br>The first hour of this film is absolutely terrifying. It has so much atmosphere and chilling scenes that I couldn't understand why people hated this film so much. The room in the basement is dark, dingy and the camera work is so spooky that you can't help but get suckered into believing that something is in there. When the mom is ironing and she feels something touch her arm and then the wind, that was a perfect scene. It was frightening. But the highlight of this film is when the family minus Sonny goes to church. It is here that Sonny gets stalked by an unseen force. And I even caught myself yelling at the TV, \" GET OUT! \" When he goes up the stairs and then down and then back up again into his room, it bothered me and it literally gave me chills. The camera work is so creative and haphazard that you really can't tell where the demon is. Is it on the ceiling, behind him, in front of him, where? That was a brilliant sequence in the film.<br><br>Some of the acting is pretty bad especially from the mom, but it makes up for that with its chills and tension. I really think that people that criticize this film are perhaps people that should watch it again. I saw it for the first time when I was about 16 and thought it was okay, but then I rented it today and it frightened me during the day. That is pretty good film making. And is it me or are Italian directors better at good horror than the average north American director? Because I've seen some pretty scary horror films that were directed by Italians and they seem to have a style all their own. Just a thought.<br><br>Amityville II is a perfect film to watch before the original. It is actually a prequel and it is good to watch them back to back. Give this film a chance and I'll bet it will scare you. It did a pretty good job on me.<br><br>8.5/10","user":"baumer","rank":[52,61]}]