[{"title":"Pushing the Limits","rating":7,"date":"16 June 2001","review":"Two scenes surprise, both with Marilyn Monroe: her singing of the \"After You Get What You Want...\" number in a ultra-tight, combination flesh-colored/white gown. It's obvious that the image portrayed is that she could be nude, with the frilly white covering her talents. The second is the famous \"Heat Wave\" number, in a skimpy outfit, with her navel appropriately covered, yet below is a flesh-colored \"window\" for more erotic symbolism. In 1954 nudity could NOT be shown, but those scenes probably BARELY squeaked by the censors. The film depicts the traveling, singing/dancing Donahue Family, headed by brassy Ethel Merman and Dan Dailey, with sons Donald O'Connor, Johnnie Ray (who wants to be a priest), and daughter Mitzi Gaynor. It's obvious the Monroe character was an afterthought to boost the film's success; the actress really didn't want to do the part, the studio allegedly counteracted by upping her salary and promising her the lead in \"The Seven Year Itch\" (1955). Nevertheless, Monroe looks great and is unforgettable, comedically, dramatically and musically. O'Connor is great fun and Gaynor is a knockout dancer. Between some slow stages, musical numbers are expertly staged, with magnificent sets and superb color schemes all throughout. The finale is surprisingly touching with a rousing title tune reprise by all; only way to watch this is on the pristine-restored widescreem (2:55 to 1) DVD.","user":"twanurit","rank":[29,36]},{"title":"That extra bow!","rating":7,"date":"2 June 2006","review":"20th Century Fox was no match for MGM when it came to musicals. Daryl F. Zanuk decided to gamble with this film where the talents of a Broadway star, Ethel Merman, would be showcased. Ms. Merman in spite of being the toast of Broadway, never made it big in Hollywood. After all, she was not a radiant beauty, but oh, could she belt a song that could be heard at the top of the balcony! Phoebe and Henry Ephron were brought on board to write the screen treatment and Walter Lang directed.<br><br>The musical was also blessed in that Irving Berlin's music is heard throughout in all its glory. Ms. Merman was the perfect actress to interpret the songs written by Mr. Berlin. They made a perfect duo, even though, for some viewers not used to Ethel Merman's singing style, it might prove an uneasy combination.<br><br>The story is simple enough. It follows the Donahues from the early days of vaudeville through some glittering years after. Molly and Terence Donahue had two sons, Tim and Steve, and a daughter, Katy. As the children grow up, the parents' popularity began to recede. The film deals with Tim, as a young man, as he falls for Vicky Parker, a beautiful singer who makes it big on her own. Vickie, who is more interested in her own career neglects Tim. As a result, Tim goes on his own to find himself, away from his family and Vickie.<br><br>The best thing in the film is Ethel Merman. She was a legendary figure and as Molly Donahue, she is at her best. Dan Dailey was the perfect partner for Ms. Merman. Donald O'Connor is also seen doing some fine dancing. Marilyn Monroe was a lovely woman to look at. As a singer, she had a small voice, but she used it well making the songs her own. Mitzi Gaynor plays Katy. Johnnie Ray, a popular singer of that period is terribly miscast. His Steve is the worst thing in the movie.<br><br>Although predictable, this film has some great things going for it. Some of the musical numbers are well staged and will not disappoint. On the whole as the camaraderie expressed by the title of the film is evident in the musical.","user":"jotix100","rank":[27,36]},{"title":"Good, Could've Been Great","rating":7,"date":"1 April 2002","review":"Contrary to what a lot of people seem to think of this film, my biggest complaint with it is Marilyn Monroe.  The studio shoehorned her into this film in their attempt to make the biggest musical extravaganza ever, and she just doesn't fit.  She's so out of sync with the other characters that she might as well be from a different planet.<br><br>Don't get me wrong.  I'm not a huge Marilyn fan, but she was good (and well-cast) in \"Some Like It Hot\".  She's just all wrong for \"No Business Like Show Business\", and she looks and sounds ridiculous.<br><br>To be fair, Johnnie Ray often doesn't hold up well before modern audiences, either, when he sings.  It's not that he's bad; it's that his style has come and gone and hardly been seen since.  Everything in this movie tends to be at least a little overdone, and asking Johnnie Ray to exaggerate his singing does not produce flattering results.<br><br>Still, Donald O'Connor and Mitzi Gaynor are as brilliant and exuberant as you could hope.  Ethel Merman is, well, Ethel Merman, and exactly right for her part.  Dan Dailey is like a reliable locomotive that never disappoints.<br><br>The story is a bit plodding at times, but it only exists to set up one gala musical number after another.  It only really bogs down when it gets caught up with Marilyn's character.  If the studio had just left Marilyn out of it, perhaps giving Mitzi Gaynor the love interest role, and toned down the general effort level just a hair, this would've been one of the all-time greats.<br><br>It's still absolutely worth seeing -- in widescreen format, if you possibly can.","user":"kensmark","rank":[16,20]}]