[{"title":"Unique monster, unknown classic","rating":2,"date":"2 July 2003","review":"\"The Magnetic Monster\" was a superior sci-fi B movie of the 1950's.  Rarely seen these days, it hasn't gotten the appreciation it deserves as an unusual sci-fi classic.  <br><br>Two scientist-detectives from the Government \"Office of Scientific Investigation (O.S.I.)\" are sent to investigate some bizarre events, like some guy found dead of radiation poisoning in an apartment building where metal objects have become magnetized.  They eventually discover the cause: somewhere there's a new, accidentally created radioactive isotope with the unique property to \"grow\" by assimilating surrounding energy into itself. As it grows geometrically, its magnetic field and radioactivity increase too, potentially threatening the very existence of Earth itself.  Our heroes race to find and destroy the thing somehow.<br><br>For its time, the plot tried hard to be realistic, with realistic-sounding science and a semi-documentary style reminiscent of detective movies.  Even a deliberate bit of comic relief as the detectives are initially stymied by false leads.  (\"Some guy phoned to complain that the battery in his hearing aid burned out and he wants us to look into the matter.\"  \"Oh, fine!\")<br><br>With the new crimes of computer hacker attacks and bioterrorist attacks, the notion of detectives with scientific training is no longer science fiction. When the Government started investigating the deaths of people from anthrax in October 2001, I thought O.S.I. had finally come to pass.","user":"sdlitvin","rank":[33,36]},{"title":"One of my favorite minor Science Fiction films from the fifties!","rating":8,"date":"8 July 2001","review":"Two agents from the Office of Scientific Investigation are sent to investigate high levels of radiation and magnetism centered above a hardware store. They discover that a scientist, who has since fled with the element, has invented a new highly dangerous radioactive element that is able to \"grow\".  If the element is not found and destroyed or contained, it could continue to grow until it sends the Earth off its orbit. The OSI men must locate the element and then find a way to destroy before its to late.<br><br>THE MAGNETIC MONSTER is one of the best low budget films from the 1950's. The story is intelligent and the science at least seems authentic. Ivan Tors deserves praise for trying to make a serious, realistic science fiction film. This is probably his best. His other science fiction films and T.V. series \"Science Fiction Theater\" also aimed for this kind of realism, but they were often to talky and slow moving. This film moves at the right pace and builds up to an excellent climax.<br><br>A few stray facts: Most of the special effects at the end were taken from the 1935 German science fiction film GOLD. This explains the outdated overcoat and fedora that Carlson wears at the the climax, to match the one worn by the German actor in the older film. Also Ivan Tors is said to have aped this films structure from the \"Dragnet\" TV series. The fictitious government agency The Office of Scientific Investigation turned up in Tors GOG (1954) and some episodes of \"Science Fiction Theater.\"","user":"youroldpaljim","rank":[27,30]},{"title":"One of the best sci-fi B-movies of the Fifties!","rating":8,"date":"16 November 2002","review":"One of the best sci-fi B-movies of the Fifties! Stalwart hero-scientist Carlson is really terrific and convincing too; stock footage of dynamo is realistically intercut with new footage of a movie set built to look exactly like the one in the German film GOLD (1934), in which stock footage from the 1934 film is intercut with new footage. The film succeeds on all levels, made for an adult audience, and although a 'modern' American film, it had a film crew with a heritage in German impressionist cinema of the 1930s. Highly recommended!  Great Science Fiction! Probably the only Fifties SF film besides ON THE BEACH (1959) to show the nuclear radiation problem realistically; especially chilling is the scene on board an airliner where the nuclear scientist who had a hand in creating the monster (Leonard Mudie) is dying of nuclear radiation and his gums are bleeding while he holds onto a briefcase in his lap containing the radioactive isotope. Rushed to a hospital after the plane lands, he dies in isolation. And a formidable, unknown, unseen monster! Badly dated now, but an effective, well-written thriller featuring the TV star of I LED THREE LIVES and the movie star of IT CAME FROM OUTER SPACE and CREATURE FROM THE BLACK LAGOON, Richard Carlson gives another fine performance.","user":"Dejael","rank":[27,32]}]