[{"title":"Step Over The Rope And Abandon All Hope...","rating":8,"date":"5 December 2008","review":"The Eighties...what a great, fertile, inventive time that was for horror. When the major studios discovered back in the late Seventies that indie horror flicks were cheap to make or just buy outright and distribute, they started crankin' 'em out...by the DOZENS. Way back when, THE EXORCIST turned the faucet on. The movies that would launch long-term franchises filled the tub. HALLOWEEN. Friday THE 13th. A NIGHTMARE ON ELM STREET. And then the tub started spilling over. CHILD'S PLAY. THE HITCHER. THE LOST BOYS. NEAR DARK. FRIGHT NIGHT. <br><br>Every company, great and small, started looking for the next EXORCIST, ALIEN, JAWS...the next big thing that would make millions. Enter Vestron Video. Vestron had started out doing some of the first direct-to-video pictures ever made, discovering that the market was HUGE. So big, in fact, that they started a movie division, Vestron Pictures. Their strategy was simple: make good (if not great) genre pics that would put asses in the seats, that they could then distribute through the video arm later on. <br><br>One of Vestron Pictures' first releases was a little number called WAXWORK. The plot of the old horror classic MYSTERY IN THE WAX MUSEUM was such a tried and true staple, the studios kept falling back on it again and again, finding fresh ways to retell the story. <br><br>WAXWORK took a little different approach from the straight-ahead versions, with a cast and a sensibility for horror that still screams \"Me Decade\" even today. Check out the victim's list: Zach Galligan (GREMLINS.) Michelle Johnson (BLAME IT ON RIO.) Deborah Foreman (VALLEY GIRL). Dana Ashbrook (TWIN PEAKS). Miles O' Keefe (TARZAN THE APE MAN). Then you throw in vets like David Warner, Patrick McNee, J. Kenneth Campbell, John Rhys-Davies, tap Bob Keen (HELLRAISER) to do make up effects, and you have yourself an Eighties' classic!<br><br>Like most films of the period, it starts off with a group of bored, young slacker-types looking for thrills, something...ANYTHING that would be a little more exciting than getting high, getting drunk, getting laid (well, ALMOST more exciting than that), and definitely more of a kick than going to college classes!<br><br>They find it, alright - in the form of an invitation to a brand new kind of museum. And this one is not your garden-variety, Madame Tussaud's-wannabe. The wax figurines are so lifelike that the displays seem to draw you in...<br><br>Well, okay, they DO draw you in. Here's the kicker: the displays are dedicated to some of the most well-known figures in the history of horror: Dracula. The Wolfman. The Mummy. The Marquis de Sade. Reenactments of their most horrible deeds as they drained blood, hacked and tore off limbs or crushed their helpless victims to death. Seeing the scenes gives patrons the feeling of being in the moment...but if they give in to the compulsion of stepping across the velvet rope around each display, they will find themselves living in that moment...FOR REAL.<br><br>And here's the REALLY bad news...if the monsters in each display kill you in the 'waxwork dimension', you become a permanent part of the display...FOREVER. So once that happens, the situation couldn't get worse...could it?<br><br>Oh, yeah! The proprietor of the museum has a darker agenda than just dispatching troublesome teens, as our heroes and victims discover with each person who 'disappears' into the museum. And seeing how that plan gets foiled is only part of the giggly, gory fun.<br><br>Remember that I mentioned that Bob Keen was the effects guy on this? He got his start as a modeler for movies like STAR WARS, SUPERMAN and ALIEN, cutting his teeth as he worked up to projects like HELLRAISER and THE UNHOLY. But he really served up his calling card with HELLRAISER and with this movie. Gore-wise, this is where the retelling of the Wax Museum story gets more interesting...because thanks to Bob, the visuals go where they never had before.<br><br>In a manner that would've made the suits at Universal flinch back in the Thirties, Keen and writer/director Anthony Hickox do away with the \"quaint violence\" that Famous Monsters used to wreak upon their poor victims. No camera pull-aways here, folks. Where somebody might only threaten to \"rip off your head and crap down your neck\", these boogeymen take that threat to its most intense extremes. No CGI fakery, either. This was back-in-the-day where almost all the effects were practical, live and in-ya-face...the way we like it!<br><br>Okay, so the clothes, the music, the casting and even the acting squarely establish this as what could be considered a \"period piece\" for horror, I guess. But like his colleagues David Schmoeller, Ted Nicolaou, Stuart Gordon and on occasion Charles Band himself, Hickox knows how to get the action going and keep it that way. <br><br>This is one of those gems that might've slipped under your radar, but definitely worth seeking out, hunting down and dragging back home to mount in your DVD library.","user":"cchase","rank":[35,35]},{"title":"Who Needs Gremlins?","rating":7,"date":"4 April 2006","review":"In a small suburban town, a group of college students visit a mysterious wax museum, where they encounter several morbid displays, all of which contain stock characters from the horror genre.<br><br>\"Can't a girl get laid around here without being burned at the stake?\" Let me start by saying Anthony Hickox is a brilliant man. This movie was his first time as a writer and director and he did it perfectly. Going on to make a Warlock movie and a Hellraiser film, he has established himself (though still remains under-appreciated).<br><br>The film stars the kid from \"Gremlins\" and his group of friends who encounter the guy from \"The Omen\", who along with a midget and a Lurch-like butler manage a wax museum full of horrible characters. Dracula, the Marquis de Sade, a werewolf, the mummy, and nine other nasties. Well, the museum offers a portal to each of these horrible worlds -- but if you die in the portal, you die in real life and become part of the museum.<br><br>This film is brilliant because of the perfect combination of horror and comedy. You will get spraying blood, mutilated flesh, and a dismembered hand that lives on its own (see \"Waxwork II\" for more on this and its connection to \"Evil Dead II\"). You will get a girl sexually aroused by being flogged (sado-masochism goes hand in hand with horror). But yet, it is funny. The midget is cute, one of the kids is just weird and you should hear the way Dracula says \"steak tartar\" or the scene where the AARP (old people) raid the place.<br><br>I could complain about the really odd plot and lack of sense. I mean, there is a part where the origin of the museum is explained. Not only does this make little sense, but there is no reason the man telling the story should know anything about it. Then there is the bit about the sculptures needing relics from their real-life bodies to become alive. Yet, there are sculptures of The Fly, the Invisible Man, and a scene from a zombie film. These things never happened, so how can they have real relics? <br><br>But you know what? It is so much fun, you just ignore things like this (especially compared to the complete nonsense plot of the sequel or \"House II\"...) Recommended? Heck yeah. Great comedy, great horror, great 80s film. Dana Ashbrook appears before the day of \"Twin Peaks\". Oh, and the professor from \"Sliders\" is in it, too.<br><br>My only concern is that allegedly the film was cut by the MPAA due to gore in the vampire sequence. I would love for that sequence to be put back together (and a director's commentary never hurts). This film would be even better with more blood.","user":"gavin6942","rank":[22,22]},{"title":"A Damn Good Episodic Gorefest","rating":8,"date":"29 March 2004","review":"There is something about episodic horror movies that I love.  Maybe it harkens back to my youth, when I devoured the EC Horror Comics reprints.  Something about each individual character having his or her own interesting death always has been a kick ass idea to me.  This movie is great.  Each character faces his/her own nasty (extremely gory) death scene in different \"exhibits\" in the wax museum.  A darn good time and some seriously great gore FX!  Loved it.  8/10","user":"reverendtom","rank":[27,29]}]