[{"title":"Entertaining freakfest","rating":25,"date":"25 June 2002","review":"This first sequel to the original \"Basket Case\" sees the return of Duane (Kevin VanHentenryck, who is in all of the Basket Case movies), and this flick introduces Annie Ross as Granny Ruth, who gives a memorable performance, and returns for \"Basket Case 3: The Progeny\". This second entry in the series is not as gory as the first at all, but it has better acting, more freaks, and a cheesy attempt at a love story between Duane and Susan (Heather Rattray). The freaks can get annoying at times, and at one scene, I quote my friend who said, \"Now it's just a bunch of freaks running around\". I recommend this only if you have seen the first \"Basket Case\", and it's not as entertaining as either BC1 or BC3, but still I'm glad to have it in my collection. Also, it has the sex scene nobody wanted.....Be warned! 7/10<br><br>Rated 18s for horror violence and some gore, language, sex?!, and brief mild nudity","user":"michaeldaly99","rank":[14,17]},{"title":"cant compare to the first one - but its very enjoyable anyway","rating":15,"date":"15 August 2002","review":"Crazy &amp; freeky sequel to the Basket case (82). By far inferior to the first part, basket case 2 looses control, as the balance of the film between being serious and (intentionally, i believe) rediculous is very fragile. Whatever the case, the entertainment value is very high - maybe thats due to that specific unbalanced element.<br><br>Basket case 3, on the other hand is really funnier, really gory in some scenes and delivers a fine result which pays tribute to the original's fame.","user":"KGB-Greece-Patras","rank":[10,12]},{"title":"we are together again!","rating":5,"date":"7 February 2002","review":"Belial and Duane are together again. Somehow they survived the heavy fall in the first episode. This time they get shelter in Granny Ruths place. She is a pro-freak-activist which helps and protects all of the \"unique\" creatures she can find. This time there are no doctors to mangle, but a bunch of evil journalists who are looking for fame by finding them. The rest is obvious. I liked this one just as much as the first one. The difference is that it´s a more humouristic and less scary sequel. It also has a twisted ending which makes it even more fun to watch. Enjoy!","user":"bjerho","rank":[7,8]}]