[{"title":"In defense of She Devil","rating":23,"date":"23 September 2001","review":"Reading the comments for this film, two aspects appear as the concentration to the films perceived flaws. The one is a lack of sympathy for Roseanne's character, Ruth. The other is a lack of appreciation for Meryl Streep's performance. Having watched this film many times since it's release, I think I can safely dispute this argument.<br><br>This film certainly I feel has all the markings of a cult favorite. It's dark humor, over charged performances as well as the overall look and feel wedges it someplace between \"Heathers\" and \"Ruthless People\". More on the nuances that I feel set this film apart from others later, but lets first deal with the Roseann/Streep problem.<br><br>Quite frankly, I see no problem. Meryl Streep's Mary Fisher is one of the screens funniest inventions. It seems quite clear to me that she enjoyed playing this role because there is no other way such a wonderful performance could have been created. On a number of occasions, there are lengthy shots with no change of camera where she drives through a range of hilarious emotions. How she handles a scene involving a dog licking her feet while she awakes is tremendous. I feel it is one of her strongest performances; she never turns it off, and always delivers it in the correct dosage.<br><br>\nThe issue with Roseanne's character, Ruth, is she is seen as manipulative, uncaring, a monster hell bent on revenge. Ruth, like everything else in this picture is a caricature.  This is very much the sort of role we would expect from Roseanne, the domestic goddess taking it all a step further. True, she does wallow in a mean spirited negativity, but it results in a positive outcome for nearly all involved. She takes control of her life and liberates Linda Hunts Nurse Hopper as well as countless women through her Vespa Rose Employment Agency. She returns life to the geriatrics in her care at a nursing home. As a result of Ruth's revenge, Mary Fisher at last becomes recognized as the serious writer she wished to from the start. We even know that Begley's Bob Patchett gets his comeuppance, and accepts it with grace and humility.<br><br>There are dozens of touches brought here which make this a movie so enjoyable to watch. Firstly, there is the remarkable physical change in many of the characters as the story progresses. Roseanne goes from looking like a reject from a freak show to a rather zaftig Joan Collins.  Linda Hunt and Sylvia Miles likewise transform, and Streep goes from a pink, frosted confection of a romance novelist, to a black turtle necked, bespectacled writer with a gift for the \"post modern metaphor\".  A certain tone is set when the establishing shot of Mary Fisher \"pink palace by the sea\" reveals her initials, M F, emblazoned on the massive gate. Streep is given countless occasions to do great business for the camera, as in a scene where her complete lack of comprehension in doing laundry leads her to put half a gallon of bleach and several dryer sheets in a washing machine. Best of all, she manages to give the finger to the \"serious critics\" while on the Sally Jesse Raphale Show.  I honestly don't feel this film is as bad as many would like one to think. If you sit back, and let it unfold as I believe it was intended to, you will find a clever picture that has just the correct amount of overarched villainy and cynicism as many of our favorite black comedies.","user":"citrohan","rank":[77,85]},{"title":"Hilarious! and clever too!","rating":9,"date":"17 May 2001","review":"This movie is not serious at all. That's the funniest part!<br><br>This movie is absolutely among my comedy favorites. Perhaps it was a bit ahead of it's time, I think - everyone should take a look at it again and have a laugh.<br><br>As a European I must say that it is ever so refreshing with a movie with such a black humor to it. The fact that everything is over the top makes it not less attractive, but brings the so-called \"authenticity\" of this story to an extend of fun, fun, fun. It is beyond \"real\" - it is there to amuse you and so it does. This movie is sarcastic, even to itself and indeed to the Fay Weldon novel that lies behind it.<br><br>Roseanne stars in her very best role ever as the ugly and poor Ruth Patchett who reveals herself as a superheroine in the vengeance department. To cast Roseanne in this role is a brilliant idea. She is obviously not afraid of being the most repulsive woman ever seen on video, and that only contributes to the laughs as she turns from the bearded lady into a business woman with a hard grip on her own destiny. Roseanne has always been accused of being a bad actress. I am not saying that she is a good one, but perhaps the character Ruth has a lot of Roseanne inside her - because her work here is in any way magnificent.<br><br>Meryl Streep on the other hand is absolutely faboulos. She has tried a few time to enter the world of comedy, most notably with the bizarre \"Death Becones Her\", but this might be her very best try in the genre. As the pink queen of romance, the Barbara Cartland of her generation, you might add, she sparkles with hysteria and selfconsciousness. Her Mary Fisher does make one of the funniest breakdowns as her \"Love in the Rinse Cycle\" fails as well as her relationship with Robert Patchett, Ruth's husband. Streep has the elegance that it takes to be - well, pink - but she is not afraid of tearing it down and plays the role with much physical courage.<br><br>Academy Award Winner Linda Hunt as always also makes a great appearance as Ruth's partner-in-crime Nurse Hooper. Along with Roseanne and Meryl Streep she benefits from her physical appearance, and all three of them changes as women in a very convincing way. For Linda Hunt, cookies does the trick, and her change from dry, bitter and hardworking to giggling business woman is very amusing indeed.<br><br>Finally I must say that the cinematography and editing of this movie is outstanding, as well as the musical contribution, e.g. the opening titles and the introduction of Ruth - it sure does follow the general irony of the story in a great way. Along with the extremely well-put dialogue this movie simply is - hilarious.","user":"Sally_Kirkland","rank":[51,56]},{"title":"Not enough praise was given to this little gem...","rating":8,"date":"6 August 2004","review":"I will admit from the outset that I have a soft spot for the trio of Seidelman films made in the mid-80's and early 90's-- Desperately Seeking Susan, Making Mr. Right, and this film.  There is something playful and quite outrageous about all three of the aforementioned movies with She Devil being the funniest due to great performances by the entire cast, even Roseanne Barr.  Although this movie was disregarded by most critics and ignored at the box office, it is truly a funny film with its cartoon-like situations and over-the-top characters.  Regardless of what everyone says, check out this film, especially when you find yourself in the mood for a cute and campy movie that is reminiscent of some of the great comedies of the 80's, such as Ruthless People.","user":"Sandcat2004","rank":[41,50]}]