[{"title":"Creepy Fairy Tale","rating":8,"date":"27 October 2005","review":"Title: Dolls (1987) <br><br>Director: Stuart Gordon <br><br>Cast: Carolyne Purdy Gordon, Guy Rolfe, Hilary Mason, Stephen Lee and Carrie Lorraine<br><br>Review: <br><br>Stuart Gordon. The name is synonymous with gruesome acts of myrth, gore, violence and other on screen mayhem. Normally his films are loaded with buckets of blood and gore, yet somehow in the middle of all the gory mayhem he manages to maintain a nice level of drama and character development. Here he decided (along with writer Ed Naha) to go a different rout. Something more along the lines of a fairytale.<br><br>The story is about these two rich snobs who go on vacation with their daughter. Along the road they are encountered by a storm that makes their car sink in the mud. So they decide to try and see if they could stay for the night at a nearby old mansion that they see from the road. A few minutes later three other people wonder into the house, Ralph a man who is a child at heart and the two punk rock girls who he gave a lift to. Unbeknownst to them, this is a spooky old mansion that has dolls that come to life. And kill.<br><br>Dolls came out around the time in which killer doll movies were extremely hot. Dolls appeared in 1987, one whole year before Childs Play did in 1988. After that in 1989 the Puppet Master series from Full Moon began. Dolls is a worthy addition to this list of killer doll movies because even though it is a low budget production, it doesn't feel like it. Gordon somehow managed to make the film look more expensive then it really was. So kudos for that to Gordon.<br><br>Right off the bat this movie got some things right. First off we get a real nice setting, perfect for this sort of horror film. We get a nice storm that never stops. We get the thunder and the lightning through out 90% of the film and we get a huge mansion with dark hallways filled with antiques. To top all that we also get two kooky and weird old folks who are the owners of the mansion and also happen to be doll makers. So as you can see, we get a nice setting for a spooky old fashion film, which in my opinion Dolls is. An old fashion dark fairy tale.<br><br>Thats one of the things I liked about this movie. How it emphasized the fact that it was a fairy tale. At one point the old man starts talking about magical nights that go on forever and never stop. That whole conversation right there kind of like gets you in the mood. You know your in for a spooky old time. Since the movie is about toys that come to like and kill, well its only fitting that we see most of the film through the eyes of Judy, the little girl. And since its told from her point of view, its only fitting that the movie is told in the fairy tale atmosphere that I've been talking about.<br><br>What we have here is a nice movie to get your little brothers, cousins, nephews etc. all scared with. Id put in the same category as films like Monster Squad, Invaders from Mars, Troll and The Gate. You know, kiddie horror. And that doesn't lessen to the coolness of the movie for me. Since it does manage to be a creepy flick in spite of its child like atmosphere. In fact the movie does manage to squeeze in a gory scene or two in there, just so you don't forget that this is a Stuart Gordon film you are watching.<br><br>The special effects are pretty good. Its a mixture between stop motion animation (like the one seen on the Puppet Master movies) and the use of puppets. I think it was very well achieved for a low budget horror flick. The dolls end up looking really creepy, specially in one scene where they all suddenly come to life and turn their heads. That scene was priceless for me.<br><br>All in all, this isn't the type of film you'd normally expect from Gordon since it does have a certain innocent charm to it. Its sort of a big departure from his previous films like Re-animator and From Beyond. Those films were drenched in blood and gore. Dolls is not as gory or violent but its creepiness still makes it quite effective. Good thing it is finally out on DVD with a couple of cool extras like a commentary with Stuart Gordon and storyboard to film comparisons. Now if they only released Stuart Gordons other lost film From Beyond (wich I hear MGM is getting ready to release) I could die happy.<br><br>Rating: 4 out of 5","user":"spacemonkey_fg","rank":[29,31]},{"title":"\"Once Upon A Time...\"","rating":8,"date":"16 November 2000","review":"If Sam Raimi had channeled the Brothers Grimm to write a story about dolls in the present day, this is about what they would've come up with. By turns charming, eerie and cringe-inducing, it allowed director Stuart Gordon to rein in the outrageousness he got to indulge in with \"Re-Animator\" and \"From Beyond\". There are shocks, there is gore and there is that pitch-black sense of humor, but everything is tempered by the wonderfully pleasant presences of Carrie Lorraine and Stephen Lee, as the only two decent souls in the midst of one of the most unpleasant casts of rotters I've seen in my recent if faulty memory; all of whom come to equally unpleasant, if not deserving ends. Just like in fairy tales...<br><br>The Bands and Gordon must've been avid fans of the old William Castle spooker \"Mr. Sardonicus,\" because they find casting perfection in Guy Rolfe as the kindly old dollmaker, who sort of extends the role (and his career) in the \"Puppet Master\" series. Distinguished character actor Hilary Mason plays off him well, and the two have a wonderfully morbid benevolence about them; like Gomez and Morticia Adams in their twilight years.<br><br>Working the other end of the spectrum are Ian Patrick Williams and the always excellent Carolyn Purdy-Gordon as the little girl's abusive and shallow father and \"wicked\" stepmother. Rounding it off are Bunty Bailey and Cassie Stuart as the brassy, blowsy punkettes who learn all about the virtues of etiquette...the hard way. <br><br>Anybody who thinks Chucky is state-of-the-art when it comes to walking, talking, murderous toys needs to check out the effects created by Giancarlo Del Brocco and John and Vivian Brunner. A lot of stop-motion combined with mechanics, (courtesy of the legendary David Allen) but you gotta appreciate the subtleties. Got creeps? Less is definitely more.<br><br>A nifty little rental if you can get hold of it.","user":"cchase","rank":[24,26]},{"title":"Entertaining Little Horror","rating":17,"date":"17 May 2002","review":"The Dolls was truly an enjoyable little horror film which never got the recognition it deserved unlike the evil Chucky from the Childs Play movies. The Dolls were around before Chucky!<br><br>It's an entertaining horror film which I won't give many details about because it will spoil it. There's certainly a few little twists in the story and nothing is quite what it seems.<br><br>The dolls themselves were quite creepy. Being a male, I've never had a doll obviously but after watching this film I have to wonder how women could ever keep dolls when they were kids. Dolls are so evil looking (some of them anyway).<br><br>This was a great film. I won't spoil the ending but wait till you see what fate befalls one of the main characters.","user":"Big Movie Fan","rank":[24,27]}]