[{"title":"One Of Eastwood's Darker Films","rating":8,"date":"25 November 2005","review":"Here is a very, very tense thriller about a New Orleans cop (Clint Eastwood) finding a serial killer.....and vice-versa.<br><br>This is a very dark (literally) film with a big film-noir look and feel. Neo-noir, I guess, is what they call post-1950 gritty crime films like these. <br><br>Eastwood's character in \"Tightrope\" is a complex one. On one hand, he's a wonderfully loving father of two sweet girls (one played by his actual daughter, and played well), and yet he is a weak man when it comes to prostitutes. But, whatever side he shows - light or dark - he's interesting, as always. So is the female star of this movie, Genevieve Bujold, a woman with a very intriguing face and just a trace of her French accent. Dan Heyada contributes strongly in a low- key performance.<br><br>Yes, this film is a bit too much on the seedy side for my normal tastes, definitely sordid, but very well done. It's a story that grabs you early and locks you in all the way.","user":"ccthemovieman-1","rank":[67,74]},{"title":"Flawed but fascinating film noir & Eastwood pushes to the limit his star status...","rating":7,"date":"4 June 2005","review":"...in a dark and unsettling psychological thriller. Directed by Clint's protégé Richard Tuggle (who wrote the screenplay to the earlier Siegel-Eastwood classic ESCAPE FROM ALCATRAZ (1979), the film's first half is uncertain and suffers from clichéd (albeit well staged and visualised) New Orleans locations - shady whorehouse dives, red light tinged bars and over officious police procedural rooms and locker-room banter.<br><br>The plot itself is functional but nothing special: a serial killer with a penchant for young, pretty blondes, is terrorising the city by disposing of prostitutes by strangling them and dumping the bodies all over the city. The twist in TIGHTROPE is that the killer is also dogging the footsteps of kinky cop Detective Wes Block (Eastwood), a lonely divorcée with two young children. Block eases off the shackles of a tough day job by frequenting the very same sleazy dives that his thoroughly unpleasant nemesis does.<br><br>A predictable game of cat and mouse ensues, but the film's stock film noir origins are transcended by Eastwood's continual playing with his own star status and by a very interesting exploration of his character's private obsessions and genuinely touching relationship with his two young daughters. Special mention here for real-life daughter Alison Eastwood, quite superb as the older and more perceptive girl, who clearly suspects her troubled father is up to more than just \"looking for something\" on his late night travels through New Orleans's seamier districts.<br><br>The more conventional opening section of TIGHTROPE is distinctly misleading, largely because about half way through, the film's most interesting character (played by the truly excellent GENEVIEVE BUJOLD) comes much more to the fore. As the feisty and fiercely intelligent Rape Crisis Center head Beryl Thibodeaux (nice use of Bujold's French-Canadian heritage here for a movie set in New Orleans!) Bujold's sharp dialogue exchanges with ultra macho Detective Wes Block-Clint Eastwood are a constant joy, and, of course, edge us deeper into film noir territory as Block's kinky sexual practise and failed marriage become the focus of the investigation.<br><br>Tuggle does a generally excellent job of keeping the material visually interesting, although he pays less attention to the minor characters, wasting a great character actor like Dan Hedaya for the role of Block's sidekick on the investigation. Overall though, this is an underrated film in the Eastwood canon and worthy of your attention. It's a slick genre piece with a surprising ability to probe the areas of Eastwood's star persona not normally explored in the Dirty Harry series.","user":"Bradford_Galt","rank":[43,50]},{"title":"A better-than-you-think Eastwood vehicle of the 80's.","rating":7,"date":"25 August 2005","review":"Wes Block (Clint Eastwood) is a New Orleans Homicide detective who's investigating a series of sex murders involving prostitutes and the further he delves into this seedy world. He finds out his own impulses are just like that of the killer's. This is when the killer starts to play around with Wes and he starts to believe he is his own chief suspect in these murders.<br><br>Totally different territory for Eastwood in this very slow and sordidly, dark thriller. It's maybe nothing new (and been repeated quite a bit) in its genre, but because of first-rate performances and it being sinisterly edgy. For me it lifts the film above the rest. Or maybe it's just my Eastwood fan-boy nature kicking in? Anyhow, this lowlife thriller is (extremely) HIGH on atmosphere, with it having an overwhelming sense of glum and intrusion. This is because most of the picture takes place during the nightlife, amongst the sleazy locations of New Orleans with indistinct lighting and prowling figures hanging around in the shadows. There's a great eye for detail in capturing the seedy lifestyle, with a lot of sexual desire, tension and gratuitous nudity flowing. Where our protagonist becomes attached to this lifestyle to compensate for his loneliness and heartache for companionship. This is because the more he gets close to the killer, the more he slowly learns they have much in common and the sleazy ways start to get the better of him. It sounds like we've been down this road before, with the cop getting closer to the killer, who's stalking and playing around with the detective. But hold on, what made the difference was the rough, raw and biting dialogue and the appealing characters were fleshed out rather nicely. Well, maybe with the exception of the killer. A lot of the story's focus, is more on Eastwood's character spending time with his daughters or fighting his lustful temptations. While, the killer uses that to his advantage, rather than actually delving into the killer's psyche, which I actually wanted to learn more about. <br><br>The cast are at the top of their game. Eastwood plays a laid back detective / dag of a dad. He brings to his character a man that's fighting the two different traits of his life. Eastwood portrays this insecure character superbly that you truly care for him and feel his pain and effort to be a perfect father figure to his two girls after the divorce. Genevieve Bujold is excellent as a crisis counsellor Beryl Thibodeaux. There are strong support roles from the likes of Dan Hedaya, Alison Eastwood and Jenny Beck also.<br><br>Story wise; some holes show up in the plot and it kind of falls by the wayside towards the end, but the excitement levels don't. At least the cracking finale was incredibly well-staged. For most part, it's incredibly taut and it never drifts away from being sombrely downbeat, well maybe with a couple exceptions involving family (with clichéd) moments, but saying that, it also had some of those moments that made you squirm in your seat. It's not-so graphic or hard-hitting in showing the killer's actions, which it could've been and probably gain more if so. It kind of stuck to just showing us the aftermath, with one murder investigation after another. But the material and the striking performances had some disquieting effect on me, even if it did feel like it was copping out and became your standard fare during the second half of the film. Unsettling moments occurred, but again nothing that graphically shocking. Backing it all up is a tantalising score that buzzes with such urgency and tensity. Also helping the mood is a jazz soundtrack that oozes with exoticism. Cinematography was well-arranged and its skewed and gliding angles went in hand-to-hand with the ill-natured style, though there was a lot shots focusing on the characters shoes.<br><br>Starts off, good enough, but you could say it probably does goes on for too long and head into familiar territory. It doesn't reach any great heights, but hey, I kept on watching and I was rather entertained. So, it did its job. In my opinion it's an above average, on the edge thriller, despite it's formulaic plot.","user":"lost-in-limbo","rank":[21,23]}]