[{"title":"Best animated feature of Disney's golden era - and what a killer soundtrack!","rating":10,"date":"20 December 2013","review":"There aren't many animated Disney films I don't like, basically every single one of them until the end of the seventies was amazing. But for me, this is the one which stands out. <br><br>Sadly, Disney himself never got to see the finished film (he died during the production), but this is one he would have been proud of. Crafted beautifully and with attention to every little detail, from the way the different animal species move to the colorful jungle backgrounds. <br><br>Wolfgang Reitherman has directed some of the studio's best - but here he has created his masterpiece. Outstanding animation, fantastic characters - and what a killer soundtrack.<br><br>A joy for every generation to discover anew (my 9-year old nephew currently has a bit of a Shere Khan fixation), I guess I will never outgrow this timeless classic. 10 out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[65,75]},{"title":"Compulsory viewing","rating":10,"date":"8 September 2006","review":"In case you're wondering, I'm 25 and my favourite films of all time include Heat, Once Upon a Time in the West and Apocalypse Now. This is just a pointer to how, considering the film I'm writing about, eclectic a true film fan's taste has to be. I'll start with one statement: this film should be compulsory viewing for every child. If, at the end of this film, you're face is not permanently disfigured from smiling, there's something wrong with you. Everything about this film is enjoyable. The characters so loving, the songs so memorable; everything is so uplifting. I first saw this as a child and right then I loved it, but not until you reach a certain age do you realise how much a film can affect you. Every character has something about them that you cannot fail to love. Baloo and King Louie are obvious - they are there for light relief, but even the sinister Kaa the snake and Sheer Khan the tiger are lovable in their own ways. Mainly I put this down to the voice cast and the way they portray their characters. Everybody with a good knowledge of film knows that Tom Hanks was the voice of Woody in Toy Story and that Mike Myers was Shrek, but who knows who provided the voice of Baloo? It shouldn't matter and, as is the case with The Jungle Book, it doesn't. The characters are what is important. Character and plot are the only things that matter in great films and this film has that theory at its bedrock. If you have a child, sit them down to watch this and I guarantee they will be transfixed. I'm 25 and I make sure I watch this every 12 months. Age wise I'm an adult, but I'm still a child when I see this on screen, and that's the way it should be.","user":"sam-wilson","rank":[25,29]},{"title":"The Simple Bear Necessities","rating":10,"date":"1 September 2004","review":"The Jungle Book, one of Disney's ultimate classics, it has great characters, an awesome story and terrific animation. I'll admit it, I adore Disney movies, I could never choose just one Disney movie as my favorite, I love them all for so many different reasons. The Jungle Book is one of my fav's though, after buying the new release on DVD, I realized that I love this movie now more than ever. The reason that I think this movie is so wonderful is because of the characters, they just brought so much life to the story and really made this into a wonderful Disney classic.<br><br>Mowgli is found in a basket as a baby in the deep jungles. Bagheera, the panther who discovers the boy, promptly takes him to a wolf who has just had cubs. She raises him along with her own cubs and Mowgli soon becomes well acquainted to jungle life. Mowgli is shown ten years later, visiting the wolves and getting his face licked eagerly when he arrives. That night, when the wolf tribe learns that Shere Khan, a man-eating tiger, has returned to the jungle, they realize that Mowgli must be taken to the man village, to protect him and those around him. Bagheera volunteers to escort him back. They leave that very night, but Mowgli is determined to stay in the jungle and loses Bagheera. Kaa, the hungry python, hypnotizes Mowgli into a deep and peaceful sleep, traps him tightly in his coils, and tries to devour him, but comically fails. The next morning, Mowgli tries to join the elephant patrol. Bagheera finds Mowgli and they argue; Mowgli runs away from Bagheera. The boy soon meets up with the fun-loving bear Baloo, who shows Mowgli the fun of having a care-free life and promises not to take him to the man village. Mowgli now wants to stay in the jungle more than ever. Shere Khan is after Mawgli though and won't rest 'till he kills him. <br><br>Seriously, these are some of the most memorable characters in Disney history, we have Baloo, the care free party bear that just wants to have fun and only needs the \"bear\" necessities of life. Begheera, a panther, that we've all known this kind of person, the one that just wants to get down to business and get as much done as quickly as possible, the party pooper, but deep down still has that heart. And one of Disney's most memorable villains of all time, Shere Khan, voiced by George Sanders, classy, sassy, menacing and vicious, I wouldn't be surprised if he was Scar's inspiration(the lion villain in The Lion King). If you haven't seen The Jungle Book, just buy it, believe me, it's worth the money. It's a classic fun animated film that I will love forever, still to this day I will always sing along to Bear Necessities, it's a good time.<br><br>10/10","user":"Smells_Like_Cheese","rank":[68,104]}]