[{"title":"The Classic War Movie","rating":10,"date":"24 June 2004","review":"Not much can be said of this movie that already hasn't been said. It captures the war, the man, and the conflict of the two. I thought the movie was very nicely tied together and I thought the reflections of Patton on the past was very necessary. Patton believed in reincarnation so in looking back at historical battles you can see how Patton developed his strategy. He was a student of great leaders and commanders and the movie developed that thought really well. The movie presented the characters, the actual war history, and the Germans extremely well and it is no wonder this movie received the awards it did. After watching this movie over and over again, I'm convinced that no one could have played Patton any better than George C. Scott. You can tell from the movie that he put everything he had into the character. My father-in-law was an officer under Patton in the 3rd. Army and has said over and again how realistic the movie is. I would recommend this movie to anyone looking for an excellent re-telling of WWII history.","user":"nabor7","rank":[84,96]},{"title":"Outstanding work by George Scott","rating":10,"date":"20 March 1999","review":"The best comment on this film was made by my father.  This was the last movie he saw in a theater.  He had served under Patton in WW2 and said that Scott had nailed Patton's character and mannerisms so perfectly that halfway through the opening speech, he expected Scott/Patton to look down and say, \"$@%#$@, Sears, get a haircut - your hair's too &amp;#%#$%@ long!\"","user":"Clothahump","rank":[150,181]},{"title":"A film about the man not the war","rating":20,"date":"20 April 2003","review":"Oliver Stone has said this film glorifies war, i disagree, what it does is show a man {Patton} who gloried in war, the war is shown through his perspective,and to Patton war is glorious and he revels in it.The performance of George c scott as Patton is brilliant, it shows a complex and demanding character riddled with contradictions ,who believes he was born to be a leader of men,the supporting cast is very good particularly karl Malden who plays general Bradley a calm experienced soldier with no dreams of glory, the perfect foil to the maverick Patton, the combat scenes are well shot and are never more than is necessary to support the narrative,the film rises above being very good to excellence due to  George c Scotts intuitive grasp of the character.","user":"kevin-caprani","rank":[123,148]}]