[{"title":"Canadian Gothic","rating":4,"date":"4 February 2000","review":"Young Carol Kane set the pattern for her screen persona as a kindly but dim bulb teen in this dark kitchen sink drama, set in small town Ontario during World War II. Her older brother home on leave brings with him a worthless army buddy, who forces himself upon her after a night of drunken carousing. Left pregnant she faces the wrath of her imbecilic father (Donald Pleasence, an astonishing performance), who cooks up a monstrous scheme to \"save the family honor\" which culminates in one of the most grotesque finales ever put to film. Bleak and utterly harrowing, this is the scratchy flip side to all those cloying \"nostalgia\" flicks of its era and a fierce condemnation of the patriarchal social system out of control. For all its seriousness of purpose, though, it's also very funny, rude Canadian humor permeating even its worst situations as the appalling characters show all their warts with jolly gusto.  Though unflinchingly realistic (period detail and speech patterns free of anachronisms) it's structured like a horror film (later director Fruet's specialty, unsurprisingly) and the final moment plays like the punch line of an especially tasteless joke. Not for all tastes, but recommended to those who caught the mordant hilarity of the equally poignant but merciless WELCOME TO THE DOLL'S HOUSE.","user":"michael.will","rank":[21,22]},{"title":"Almost authentic","rating":9,"date":"24 September 2006","review":"At first I thought that this was another dumb Canadian film financed by my tax money. Then it occurred to me that there was quite a bit in this film that was realistic and hard hitting. Anyone born after the 1960's won't appreciate that the negative attitude of everyone to a girl getting pregnant out of wedlock portrayed in this movie was the norm in Canada during the war and into the 50's. Nobody's being hypocritical. That's the way it was.<br><br>The old men and misfits who were pressed into Canada's \"Zombie Army\" to guard prisoners is also authentic.<br><br>The movie is quite authentic in its portrayal of a crummy town in the Maritimes. No, it's not Ontario. The accents are all Maritime except for Ms. Kane and Ms. Case, who are too American to fit the scenery. That's not to disparage their acting which is perfect for the characters they portray. Donald Pleasance does not exaggerate his accent. That's how people talk \"down east\".<br><br>Where the movie goes astray is in the economy of the wartime years. There is reference to food shortages but there seems to be no shortage of Scotch and beer. Also, the store that Jeannie robs looks exactly like a Woolworth's store of the era except that the shelves are brimming with things to sell. That was not the case. Finally, Sandy doesn't seem to have any problem getting tires (unobtainable) and gasoline (rationed) during the war years.<br><br>Give this movie more than 10 minutes of attention if it comes on late night TV in your area.","user":"Sonofamoviegeek","rank":[14,16]},{"title":"Wow!!","rating":8,"date":"17 June 2005","review":"16 year old Jeannie's(Carol Kane in her screen debut)brother has just come back from the army. He brings a friend named Billy along because Billy has no where to go. After a drunken night out, Billy rapes Jeannie as she sleeps on the couch. Billy and Jeannie's brother, Jimmy leave in the next morning and Jeannie is left hurt, afraid and pregnant. Once her parents find out, they blame no one but Jeannie. Her Mother begs the Father not to send Jeannie away. They let her stay but force her to marry an old man so they won't have to deal with gossip. Jeannie marries the old man and you can only feel sorry for her as you see this isn't a life she has wanted but has been made for her. Carol Kane delivers an awesome performance yet again. She blows me away every single time I see her in a movie. A lot younger here, I believe she is about 19, I still can't believe how great she was with it being one of her first films and all. I felt so bad for her through out the whole movie. Once again, mad props to Kane who without her this film wouldn't be as great as it was.","user":"sugar-bear","rank":[10,11]}]