[{"title":"Davis' portrayal of the lead character, Judith Traherne, was one of the most memorable in her screen history","rating":8,"date":"16 January 2009","review":"Judith is a wealthy Long Island society girl given to a dizzy lifestyle Self-assured of her affluence and her faculty over men, she is unprepared for tragedy, which strikes in the form of a brain tumor The underlying bravery and courage with which she faces this physical suffering eventually demonstrates the woman of substance that she is<br><br>Among her friends is Ann King (Fitzgerald), her secretary, and handsome young Alex Hamm (Reagan), who directs her toward brain specialist Dr. Frederick Steele (Brent). The doctor diagnoses her illness as one which will end her life within a year Judith falls in love with him and accepts his proposal of marriage When she discovers that her tumor is calamitous, she rejects the doctor's proposal considering it an act with compassion <br><br>Davis provides scene after scene with the special magic only she was able of bringing vividly <br><br>Swept into the current of events was Bogart playing an Irish horse trainer, who fails in an attempt to make love to her, yet encourages her to enjoy her time with her true love, George Brent <br><br>The film was remade in 1963 as \"Stolen Hours\" with Susan Hayward, and as a 1976 TV movie under its original title with Elizabeth Montgomery","user":"Nazi_Fighter_David","rank":[28,28]},{"title":"Love or hate her, this film shows why Bette was a star...","rating":9,"date":"5 November 1999","review":"By today's standards, \"Dark Victory\" might seem cliched.  Of course, that could be because it was so greatly copied!  Here is Bette Davis, a star in the fullness of her talent and ability.  Bette simply shines; she owns this film from first frame to last.  Ably supported by a wonderful cast (including a somewhat mis-matched Humphrey Bogart as an Irish-brogued horse trainer), it is still difficult to watch the film and not be constantly anticipating Bette's appearance in any scene she isn't in.  The ending, even in those days, might have turned out either wimpy or waspish.  In Bette's hands, it is neither.  It works in a way that literally drains one of emotions. I might also add that, while revealing only a bare back, Bette shows more sensuality than a dozen of today's more \"open\" actresses.<br><br>There is an old disparaging adage about \"showing the full gamut from a to b,\" in this movie Bette not only shows A to Z, but some letters that haven't been invented yet.<br><br>Despite my gushing over Ms. Davis, the film is solid in all departments.  If you wish to experience when melodrama is great movie-making, see this film.","user":"djkent","rank":[29,30]},{"title":"Bette Victorious","rating":8,"date":"28 April 2005","review":"This is the film of which Davis is supposed to have said \"There are some pictures that should nevah be remade!\" - and time has proved that she was right. Despite two updates/remakes, one theatrical (\"Stolen Hours\" with Susan Hayward) and one for TV (as \"Dark Victory\" with Elizabeth Montgomery) it's this 1939 Warner Bros. film which is still best remembered today. The reason, of course, is Bette Davis. She often insisted that there wasn't one of her greatest roles she didn't have to fight to get, and Judith Traherne was one of those roles. She pestered Jack Warner to buy it for her, and when he responded \"Who wants to see a picture about a dame who goes blind and dies?\" Davis assured him that at least ten million women would - and she was right.<br><br>And so we have a vibrant, touching performance that is among the most famous jewels in the crown of Bette Davis. \"I'm young and strong and nothing can touch me!\" she proclaims, and almost makes us believe it. We see her go through the denial/anger/bargaining/acceptance phases of her illness long before anyone named those stages. And when she looks George Brent in the eye and says \"Poor fool - don't you know I'm in love with you?\" we know from the way she says it that she's never said it before. Yes, it's quite possible that had GWTW not been released in the last weeks of December 1939, the question of who would be the first actress to win 3 Best Actress Oscars might well have been settled long before 1968.<br><br>Yes - we have to suspend disbelief here - Bogart with an Irish brogue? Surely his name - O'Leary - should have been enough. And the scene near the end when Davis packs Brent's suitcase to send him off - how could he not notice her fumbling around the room? Ah well, \"it's only a mooovie, Ingrid. . . .\" as a famous director once said.<br><br>\"Dark Victory\" may not be great cinematic art, but it's a thoroughly professional effort and it's obvious that the people who made it cared about it. Movie fans have been caring about it for 66 years, and continue to do so: a newly-remastered DVD will be released in June.","user":"Harold_Robbins","rank":[15,15]}]