[{"title":"Underrated buddy movie with superb performances from Rourke and Roberts.","rating":12,"date":"12 July 2003","review":"Watching 'The Pope Of Greenwich Village' almost twenty years after it was released you can't but help think a)what a great movie it is, and b)what the hell happened to Mickey Rourke and Eric Roberts, two of the most exciting actors of the 1980s? Rourke drifted off into boxing and b-grade action movies, and apart from some great cameos in movies by Sean Penn, Steve Buscemi and Vincent Gallo ('The Pledge', 'The Animal Factory', 'Buffalo '66' respectively) has almost been forgotten by the current generation of movie fans, and Roberts has also made way too many bad straight to video action films and is regarded as a joke by most people. It's so sad what happened to their careers, but this movie sees them both at their peak, and boy, they were both GREAT actors! The movie is directed by Stuart Rosenberg who made my all time favourite movie 'Cool Hand Luke' back in the 1960s, and Michael Cimino ('The Deerhunter') also worked on it uncredited. I don't know if this means it was a troubled shoot, I don't know the background details, but if that's the case it certainly doesn't show on screen.  Some people find this movie too rambling and anecdotal, but I loved it. It's a superior character driven buddy movie (which reminds me in places of Cimino's earlier overlooked 'Thunderbolt And Lightfoot'). Rourke and Roberts are dynamite together, and I would recommend this movie for them alone, but the supporting cast includes a credible turn from Daryl Hannah and a whole bunch of great character actors - M. Emmett Walsh, Burt Young, Val Avery, Jack Kehoe, and especially Kenneth McMillan (who later appeared with Roberts in another great \"forgotten\" 1980s movie 'Runaway Train') who plays a heartbreaking role as the poor guy who gets enmeshed in Roberts and Rourke's doomed robbery plan. 'The Pope Of Greenwich Village' deserves to be rediscovered. Any film buff who appreciates good acting will enjoy it, and youngsters who aren't aware of Mickey Rourke, or who regard Eric Roberts as little more than a figure of fun should check it out and be amazed.","user":"Infofreak","rank":[45,50]},{"title":"A Great Picture-Mickey Rourke's day in the Sun","rating":7,"date":"7 April 2002","review":"From the opening credits with that smooth Frank Sinatra hit \"Summer Wind\", this movie never lost my attention. A quaint story of two wanna- be rich guys from Little Italy who unsuccessfully stumble through life trying everything to make a buck without having to work for it. You can't help but sympathize however with the characters of ROURKE and ROBERTS. They leave a lasting impression with the viewer conveying how life can be brutal in all aspects; whether emotional or tangible. And how good guys really do finish last. It was nice to see a measure of revenge for the two in the last scene at the hands of crime boss BURT YOUNG. DARRYL HANNAH adds a great supporting role as ROURKE'S girlfriend who quickly loses patience with him. The one person I was most impressed with was MICKEY ROURKE. He showed such great promise as an actor in this film-his best, hands down.  I still can't believe how he allowed himself to deteriorate through the years in the way he has. He truly could have been one of the greats in the industry. That is far from an overstatement. Anyhow, this is a can't miss film-a sleeper. In my opinion, as good or better then some of my other favorites like Goodfellas, The Godfather etc. Enjoy it over and over.","user":"tsoprano88","rank":[38,42]},{"title":"What a delight!!","rating":13,"date":"13 January 2007","review":"I am now beginning to rent lots of movies and decided to rent \"the Pope..\" I've heard so many great things about it.<br><br>I AM a Mickey Rourke fan - however if I see him in a shitty film - I have no qualms in stressing my opinion.<br><br>A Rourke fan or not - this movie is a delight, from the shots of New York City back in 1984 - to Eric Roberts' acting, this movie was great.<br><br>I think the major problem most viewers on this site had was Robert's acting, I felt that Roberts overacted sometimes - or perhaps that's what the script called for and if so he gave a memorable performance - almost hilarious at times - the thumb scene is a prime example. I felt that he almost stole the show.. not because I thought his acting was amazing. because it was almost like a parody - I found it strange at times.<br><br>Rourke was cool, calm and focused - his acting was great.. and I LOVED his \"come over here..\" line.. almost seemed sexual to me.. I wondered what he was going to do.<br><br>I think everyone who commented on this film is right in saying how incredibly sad it is how Rourke's and Robert's career went down the tubes the way it did. We all have our demons I guess. The focus is to overcome them. Roberts is a B- movie actor. Rourke was never a B-movie actor - he was always a great actor with enormous potential who still has a shot of living up to his potential<br><br>he has recently been making a great comeback - \"...my best work is still ahead of me\" he commented. he came out of the grave. Amen to that!! <br><br>The special things about this film are the Acting and the nostalgic feeling one gets when looking at scenes of New York back in 84 (if you are from the east coast and live close to the city or are from the city - you know what I'm talking about)<br><br>Amen to the Pope - great little film, one in which I will buy to my collection.","user":"htbt","rank":[18,19]}]