[{"title":"\" Classic Audie Murphy \"","rating":8,"date":"4 December 2013","review":"Bullet for a Badman offers a decent storyline along with a sufficient amount of action to keep this story moving at a good pace. Interesting characters are the key to this film, and Audie Murphy gives a solid performance playing an ex-lawman, married to a woman who has a young son. Murphy's character is obliged to pick up his gun and go after an outlaw who was once a friend. Darren McGavin plays the outlaw who was once married to Murphy's wife and the boy is his son. The story follows Murphy and a posse tracking down McGavin who has committed a robbery, and he also holds a grudge against Murphy for raising his son as his own. The posse contains an excellent mixture of characters all well portrayed and lovely actress Ruta Lee adds some interest playing Mcgavin's girl. Add some hostile Apaches, some shoot outs, some twists and turns among the characters along with beautiful scenery, and Bullet for a Badman comes off as a satisfying western. Not a classic film, but very classic Audie Murphy, and thats good enough for me.","user":"PamelaShort","rank":[7,7]},{"title":"We were friends once, Sam. It's not easy to shoot an old friend.","rating":8,"date":"7 October 2011","review":"Bullet for a Badman is directed by R.G. Springsteen and adapted to screenplay by Mary &amp; Willard Willingham from a novel written by Marvin H. Albert. It stars Audie Murphy, Darren McGavin, Ruta Lee, Beverley Owen and Skip Homeier. Filmed in Eastman Color at Universal City, with the exteriors coming from Zion National Park, Springdale, Utah, photography by Joseph Biroc and music by Frank Skinner (Joseph Gershenson supervising).<br><br>Audie Murphy plays Logan Keliher, an ex-Texas Ranger who has to interrupt his peaceful life to strap on the guns again when ex-friend-turned enemy Sam Ward (McGavin) appears back on the scene with the intention of killing him. The animosity is strong from Ward on account that Logan married his ex-wife and raised his son as his own.<br><br>The relatively short running time and the B movie production budget afforded it, doesn't give a clue to just how good, and how chock full of interest, Bullet for a Badman is. It's certainly very traditional in the old Westerns sense, before the likes of Anthony Mann and Budd Boetticher gloriously filled their Oaters with psychological themes, but there is much to enjoy here from a character perspective as regards the human condition. Jealousy, vengeance, greed, love, hate and redemption, all get a turn in the Willingham's screenplay. Mix in some good old style shoot outs and run-ins with the Apache, and film condenses a lot in such a short space of time. There's also some twists and turns that work real well in the narrative, leading us to a beauty of an ending.<br><br>The male cast members work real well, especially Murphy who turns in one of his finest Western performances, while there's also a nice little support role for Alan Hale and snatches of stoic Western performers Ray Teal and Bob Steele. With most of the film set out in the wilderness, it's such a joy to see stunning location scenery expertly captured. The colour is not quite right to fully bring it to life, a shame since Eastman Color has had some great moments in Westerns, but Biroc belies the B movie production to please the eyes with the natural beauty of Zion National Park. Skinner's score is standard fare, and although the lady actors look pretty as pictures, that's about as good as it gets for them in this particular story.<br><br>In spite of some usual iffy B production problems (poor stunt doubles, bendy props), this is still a little cracker of a Western. One that deserves a bit more attention now it's readily available on DVD. 7.5/10","user":"hitchcockthelegend","rank":[13,15]},{"title":"Top Western with characters too realistic for modern audiences","rating":9,"date":"2 June 2012","review":"This Western might be best described as a \"motley posse\" Western. The irony here is that Audie Murphy's other famous posse Western, POSSE FROM HELL, probably sums up this posse just as well.<br><br>There are other similarities. Both posses are filled with very credible characters. The big difference here is Audie's character. In POSSE FROM HELL he played more of a Hollywood cliché, another of those rebels without a cause sorts who are angry for exactly no reason.<br><br>Here, he plays a more believable character, a mature man more in tune with the realities of the old West. Purists may grumble about the lack of dust and sweat on these colorful props and clothes, but there are two chief reasons for this spectacular style of cinematography. First, is it's artistic, of course. Secondly, and what we see is a problem later in the \"dust and dirt\" Westerns, is there is less confusion. The film is supposed to tell a story. With the vivid spectacle, we know what is going on. The trouble with showing what the characters see is that we don't know what is going on. Okay, the dork who pauses and magnifies each frame, he knows, but sane, mature people will refuse to do this.<br><br>The characters make this a superior Western, no doubt about it. Murphy is a \"stepfather\" whose son doesn't know his real father is not only an escaped convicted killer, but that he was once a Texas Ranger along with the stepfather.<br><br>The relationships and dialog concerning the family could still be used today. In fact, I've seen real father-wife-stepfather-child dialogs today that are almost identical to the lines in the film, from people who have never heard of Audie Murphy, much less seen the film. The directing and writing here, certainly of characters, is as full of insight as you will find.<br><br>That shouldn't surprise you, that a film from over half a century ago would have more insight. Hollywood really lost the \"insight\" and \"character\" with the seventies mainstream. These older films not only had writers who had to live more mature lives, but also had to appeal to more mature audiences than the later cubicle dwellers.<br><br>The subtle differences between the posse members also deserves note. The skipper plays the lawman of the group, and is much more like a real town lawman than people today would think, full of fear and desperation. The \"chief\" of Control plays a very realistic honest member of the posse. The two town tough guys, bouncers in the saloon, are shown to have their different personalities. One is pure evil, but the other has some \"manly\" qualities, refusing to kill the woman for thousands of tax free dollars. The old grizzled veteran reveals multiple dimensions about himself, but most notably his demonic side, a side which we see mostly in the characters we could almost respect otherwise, as he lightly discards the squaws he butchered.<br><br>Audie's nemesis begins the film with a demonic act, in fact. We never forget what he is, and that there is an evil in him that isn't in those of us who aren't psychopaths. No doubt, some of the IMDb bubble boys and beavis types, will think he's \"cool\", but to people who deal with reality on a more usual basis, Audie's character will be the one who looks \"cool\".","user":"drystyx","rank":[12,14]}]