[{"title":"One movie--Two movies???","rating":2,"date":"4 September 2005","review":"About the only redeeming quality is Joseph Cotton and, in this instance, that is not saying a lot.<br><br>But what really gets me is: About 30-40 minutes of this film is footage from another western made 11 years earlier--\"Sitting Bull (1954).\" In this movie, the Indians ride down on Custer from what could be northern California Sierra Nevada's or even somewhere in South Dakota while the 7th cavalry is riding through the arroyo's of southern New Mexico or western Arizona and they combine the footage from both films to make it look like they are fighting one another. The footage from Sitting Bull is also used in many things such as the escape from the stockade by the Indians and also various scenes when the Indians are shot and fall off their horses. One Indian, for instance, falls off his horse and practically rolls right into the camera on Sitting Bull and that same Indian, on the same horse, falls off again in this movie and practically rolls right into the camera. I have them on video back to back and am able to view them so it makes it really easy to detect the same scenes from the earlier movie being used.<br><br>It's cheap and shoddy!","user":"Flaming_star_69","rank":[30,32]},{"title":"Standard, but a couple of things stand out.","rating":23,"date":"23 October 2002","review":"This was made close to the end of the American fascination with western movies -- they were churned out in the fifties and sixties, but toward the end of the latter decade they sort of petered out, replaced by \"message movies.\"  The movie is straightforward enough, a basic cavalry movie, blue guys versus the Sioux Nation.  The acting is pretty standard and wooden; Darren McGavin isn't very good, though he always manages to be likable. Joseph Cotton doesn't do much with his role.<br><br>The thing about the movie that I enjoyed, though, is the final half hour or so. The basic plot of the flick follows Custer through his Indian fighting days culminating in Custer's Last Stand.  I've seen a number of other attempts to film this with varying degrees of success: \"They Died With Their Boots On\" is a great movie, but laughably inaccurate; \"Custer of the West\" is a laughable movie, and also laughably inaccurate; \"Little Big Man\" is an interesting movie, and again, laughably inaccurate.<br><br>\"Great Sioux Massacre\" is mediocre, but I found it reasonably entertaining and interesting in the way they depicted the final shoot out -- they got so many things right, from what I recall reading about Custer, I was surprised. For those who don't know anything about Custers Last Stand, what follows is likely spoiler:<br><br>They accurately showed how Custer split his group into three forces, which ended up being a bad idea and to this day inexplicable.  They showed Custer as a Colonel, not a General -- he was a temporary General during the Civil War, but was returned to Colonel rank once it was over. They referred to the fact that Custer had family members in his outfit -- a brother, and I think a nephew.  He wasn't depicted as a megalomaniac as in \"Custer\" nor just a maniac as in \"Little Big Man,\" but rather a competent general with too much ego for his own good.  They didn't even show him being killed last which likely was improbable, though there were no Cavalry soldiers who survived, so it's hard to tell what really happened in the final moments.<br><br>\nThey got somethings wrong -- his hair was red, not blonde, and though he normally wore it long, he'd had it cut prior to the final events; the uniforms were all wrong, but hey, one should be impressed with all that they got right.<br><br>A decent movie from a different time, though with its positives, still standard fare.","user":"sychonic","rank":[20,23]},{"title":"A travesty","rating":4,"date":"28 September 2005","review":"A travesty of a film, and one in which the usually competent Philip Carey and Joseph Cotton disappoint, though at least the latter can have claimed he was playing an often-drunken Major Reno. Darren McGavin stomps and jerks around as \"Captain Bill Benton\", so-called presumably because there is little relation with the real-life Captain Benteen. \"Benton\" is hazed by Reno, is keen on his daughter, strikes Custer, is captured/rescued by the Indians on his way to court-martial, is rescued again (this time by the cavalry), rides to warn Custer of the Indians' strength and is reinstated to lead his men at the fateful battle.<br><br>Individuals change their characters as the film progresses: Custer switches from idealism and anger at governmental corruption to political ambition; Reno evolves from drunk to semi-hero, in between resenting command of the 7th being offered to Benton (both then becoming self-deprecatory about their ability to lead); and the scout Dakota suddenly switches from hating and killing Indians to saving them (and when he deserts he is shot making a mad dash from the cavalry bivouac rather than slip away when scouting ahead of the column). Some of the minor actors appear to be waiting for cues or direction, and riders shot off their horses fall to the ground as safely as possible. Often the dialogue is artificial: \"I shall see you trouble my existence no longer,\" rasps Custer to Reno at one point.<br><br>The film starts and finishes with the sort of completely unrealistic military court hearing that mars several Westerns; in this case the evidence comes entirely from Benton, with no other witnesses being called.<br><br>The Battle of the Little Big Horn isn't too bad but apparently the footage was borrowed from \"Sitting Bull\" made ten years earlier. Certainly when the main characters are on screen they appear to be accompanied by only a handful of men.<br><br>By 1965 Hollywood should have been able to do better than this.","user":"Marlburian","rank":[19,22]}]