[{"title":"Die Hard 2 is my all time personal favorite Action film an underrated","rating":10,"date":"4 October 2015","review":"Die Hard 2 in my opinion is my third favorite decent action flick in a \"Die Hard\" series and a good movie to watch. It is one of my personal favorite action movies. It is one of the most underrated \"Die Hard\" films in the series and that not a bad one. His wife again a hostage, Christmas again, the same reporter from the 1st film, now a janitor Marvin is a helper instead of Argyle and so on. As far as sequels go, Die Hard 2 is excellent. Of course it isn't better than the first, but sequels rarely are. This film is like going to a circus: you sit back and watch crazy stuff happen, laugh, cheer, joke, and just have a good time. Bruce Willis gives a great performance in the lead, we have some solid villains, and some brilliant action set pieces. I say check it out. <br><br>I'm not one to subtract points for a lack of realism, or \"real world believability\" in films. Because of that, Die Hard 2 poses a very interesting case study for me. Real world believability is very difficult to not think about when watching this film. Why wouldn't the planes just reroute to other nearby airports? There are a bunch less than an hour's flight away, including Baltimore, Philadelphia, the three New York City-area airports, and so on. Why wouldn't they be able to call another close airport, or the Pentagon, or somewhere else nearby to have them contact the planes? They're near Washington, D.C., after all (don't forget that Dulles is 26 miles away from D.C., in Virginia, making it unlikely that planes out of fuel would begin \"dropping on the White House lawn\"). It seems like maybe this film should have been set somewhere like Salt Lake City, Utah instead. Why wouldn't they be able to show the runways through some other means, like a line of emergency or police vehicles with their sirens on? If the \"terrorists\" started shooting at the vehicles, or trying to blow them up, at least they'd be given an indication where the fire is coming from/given their location. Just how likely would it be that there's a big storm in the area on the day when General Ramon Esperanza (Franco Nero) is being extradited? How likely is it that he'd be extradited on Christmas Eve? Why the hell is John standing out on the runway in the snow waving a couple of flaming poles--just what does he think that will do? <br><br>Die Hard 2 is still awesome movie and sequel to the first one for me and I don't know why people are saying it is the worst one or why they hate it. I don't, I love it, more than the first one I love it. In 2005 was my first best action movie than the first one. What I love about this film is they show John McClain more as a human being. In the beginning at the airport when his car was taken away at the airport, the whole movie show's an actual terror the villains are more of a threat cause they're actual terrorists! The Action sequences are awesome, there is barely any Cgi in it, John McClane is again in another elevator shafts. I love the plot twist that was wonderful, the snow in the film, the mobile snow chase whit McClane was awesome. This film is not perfect It is good, it has some problems in it. Always enjoyed watching it. The problems for the airport I already mentioned, the most annoying to me was after McClane kills the henchman when he was saving Leslie Barnes he pushed a terrorist of the latter and that latter tower falls on a terrorist you can see that it is a dummy from close that should not been seen from close camera.<br><br>It is still It is one of my personal favorite action movies mostly in the winter when it is snowing. The first movie was hug success, Renny Harlin's job by making this movie make it even harder for him, to find a good story, and make a snow because they didn't had any actual snow at the time it was really hard. <br><br>I love it. The facts I love: Chase with the Snowmobile, shooting with blanks on Carmine Lorenzo, fights on an airplane, double cross, John's jokes... The General Esperanza on airplane from Val Verde the same country was named in Schwarzenegger's movie Commando, John's shooting with snowmobile, than John's fight by the church. Movie to me is really awesome. I enjoy watching Die Hard 2. 10/10 Grade: Bad-Ass Seal Of Approval It is my second favorite Die Hard film in the series.","user":"ivo-cobra8","rank":[98,106]},{"title":"A Total Thrill Ride","rating":9,"date":"10 March 2007","review":"Bruce Willis takes a lickin' and keeps on tickin', nearly outdoing himself in one of the great actioneers of our time. DIE HARD 2 has everything a true action fan could ever want: explosions, chases, plot twists, suspense, drama and all that other good stuff.<br><br>Just two years after his last near-death adventure, John McClane (what a great action hero name) battles bad guys who take over an airport's communication system around the holidays. Unless their demands are met, they will unceremoniously plummet planes to the ground one by one -- including one on which Mrs. McClane (Bonnie Bedelia) is a passenger. Of course Johnny, he of wise-cracking ways, is the only one who can save the day.<br><br>Like its predecessor, set almost entirely in a skyscraper, DIE HARD 2 makes the most out of its setting. McClane is as multi-purpose as can be, chasing mercenaries through luggage conveyors, grasping onto aircraft wings, running out onto the runway and, in a truly awesome scene, ejecting from a plane a split second before it bursts into flames. Throw in a snowmobile chase, the standard trip through the air ducts and a legitimate, interesting motivation for the crooks and you have a total thrill ride guaranteed to recharge your batteries.<br><br>Efforts like DIE HARD 2 won't win any major awards, but they'll do what films are supposed to do: thrust us into another world and entertain us. This is truly Willis and director Renny Harlin at their best.","user":"ReelCheese","rank":[60,74]},{"title":"You can't get too much of a good thing","rating":5,"date":"5 March 2001","review":"For those who argue that Die Hard 2 is a desperate re-hash of the original... So what?  I didn't expect a companion piece like The Godfather Part II.  Die Hard was about a really cool guy in a really bad situation, and the result was probably the greatest action movie ever made.  Die Hard 2 achieves status on its own just by being about the same thing. When so many movies want to be Die Hard but fail, why not just make another Die Hard? Director Renny Harlin (Cliffhanger)realized that because it's a sequel, there had to be more stunts and explosions. So there is.  Die Hard 2 (appropriately called Die Harder) ups the ante a bit and has fun with a flurry of furious action scenarios.  The fight on the wing of the plane is a classic in its own right, and Die Hard 2 stands alone as one of the best of the genre.","user":"trevor-41","rank":[99,134]}]