[{"title":"A Realistic Vietnam film Oliver's Stone's masterpiece","rating":10,"date":"14 October 2015","review":"Platoon is a 1986 American war film written and directed by Oliver Stone one of the most strongest realistic anti war films of all time. It is one of the best Vietnam war films I have ever seen that won the Academy Award for Best Picture of 1986 and best Director for Oliver Stone, as well as Best Sound Mixing and Best Film Editing. Stone's Vietnam film portrayed a real life human been on his point of view of the story telling that went on in his real life that he experienced after his tour of duty in Vietnam ended in 1968, Oliver Stone wrote a screenplay called Break: a semi-autobiographical account detailing his experiences and the life he was in Vietnam. The characters were portrayed more then a few soldiers they were portrayed more as a human been than been soldiers obeying an order.Platoon shows the Vietnam War was a big mistake, but being a fictional documentary on Vietnam is far from its purpose. It is one of my personal favorite war movies. I love this movie to death. <br><br>Those of us who did make it have an obligation to build again, to teach to others what we know, and to try with what's left of our lives to find a goodness and meaning in this life. <br><br>In Platoon, Chris Taylor (Charlie Sheen) is a young, naive U.S. soldier who, upon his arrival to Vietnam, quickly discovers that he must do battle not only with the Viet Cong, but also with the gnawing fear, physical exhaustion and intense anger growing within him. While his two commanding officers draw a fine line between the war they wage against the enemy and the one they fight with each other, the conflict, chaos and hatred permeate Taylor, suffocating his realities and numbing his feelings to man's highest value... life.<br><br>Chris sees his platoon fragmented into two halves, each aligned with one of two men -- Sgt. Elias (Willem Dafoe) and Sgt. Barnes (Tom Berenger). Those two soldiers are really two positive good things to see in the film because it sets the viewer on the seat of the edge. They both have nominally the same enemy (Viet Cong), but, really, it doesn't take long to realize that Elias is Good, and Barnes is Evil (the \"enemy\" does not enter into the moral equation of this film, at all it's an outside threat, same as malaria-carrying mosquitoes or even friendly fire). Elias feels the futility of the war and has respect for life; Barnes fights the war doggedly and has no compassion, period. Both are efficient soldiers fighting the same enemy, but really as is at one point aptly put by Chris Taylor himself,they are fighting for the souls of the platoon members, as the outcome of the war is never really in doubt.<br><br>The platoon reaches the village, where a food and weapons cache is discovered. While questioning the village chief, Barnes loses his patience and senselessly kills the man's wife despite his denials that they are aiding the Viet Cong. Barnes is about to murder the man's young daughter to force him to tell them to where the enemy is. <br><br>Elias doesn't take kindly to this kind of behavior. Elias and Barnes come closer and closer to open conflict, as Taylor becomes a veteran, obviously siding with Elias. Meanwhile, the fate of the platoon comes closer and closer to them, culminating in an explosively shot action conclusion. The end is dark, but morally satisfying.<br><br>Platoon is a legendary film. A film that I will always cherish, and a film that I will never get tired of. And the last Vietnam film worth a damn to watch. There isn't any War film today that was filmed as really human drama war today in 2015. It respectively represents the very essence of purposefully haunting powerful cinematography in the history.-- It is representing admirable cinematic craftsmanship and storytelling. A film that is sometimes impossible to watch for its frighteningly intense and emotionally draining account of the Vietnam War as it is waged both on the battlefields and within the very souls of men.<br><br>The best real human drama portrayed on screen anti-war film in Vietnam from the 80's, It is my favorite film that I will always love to death to see. I also don't watch this film for an action ; I actually see it for the war and how it everything was, what is more valuable and it is life: The film also have a message in it. The actors portraying the characters did make a believable performance as the real team of squad soldier fighting the Enemy the Viet Cong.<br><br>The battles with Viet-Cong are shown realistic mostly on the end of the final battle. 10/10","user":"ivo-cobra8","rank":[119,131]},{"title":"Platoon","rating":10,"date":"13 February 2020","review":"Platoon is the landmark definition of a war film. Pulse-pounding sequences stacked on well-performed portrayal of soldiers (Sheen, Berenger &amp; Dafoe) as well as a couple of heart-wrenching scenes that would be somewhat difficult to view. The film is Oliver Stone's most significant to date, especially since it's based off his own personal experience in the Vietnam War.","user":"MR_Heraclius","rank":[37,40]},{"title":"Hell is the impossibility of reason","rating":10,"date":"10 June 2010","review":"Why I think Platoon is probably the best war movie Hollywood ever made? Because it's very humane. I mean it. The director sees all his characters as victims of war rather than heroes or villains. Have a closer look at 'em.<br><br>Taylor has no power inside himself and is torn between the two fathers; he ends up with a physical act of revenge. This is not what one father taught him - and the other father is actually murdered by him. <br><br>Sgt. Barnes would never fit the postwar life and knew it damn too well himself; after all, he is not a fool although might seem a senseless killing machine at first sight. Vietnamese bullets could not kill him, his talent for survival being his enemy. So, he attempts kinda suicide twice (at least) begging others to kill him and thus end the pain tearing him from inside: first, in the potheads' bunker scene after Taylor's accusations; then, when Taylor finds him in the final scene.<br><br>Sgt. Elias was far too good to survive the Nam and maybe even challenged and annoyed lifers on purpose, waiting for some bob barnes to hit back :) It's a pity Stone excluded the stars' scene monologue which explains pretty much about Elias' ways and view of the future. In fact, for himself he sees no future. Not in this world that is all about betrayal and killing.<br><br>Bunny and Junior, one the embodiment of somewhat sadistic bravery and the other of cowardice. Their deaths are partly a morality, partly to show that it does not matter if you're black or white, brave or cowardly, war makes no difference wiping off everyone it can. <br><br>King, Big Harold, Francis are survivors yet victims, too. What is awaiting them in the \"real\" world where nobody understands and nobody respects anything? They are dreaming of a comeback to music, girlfriends, fun time - but reality bites, and who knows, will they find their spot under the sun or will be forced to use the skills obtained in the Nam and get engaged in crime and drug abuse?<br><br>Red O'Neill talking about his ability to predict if a guy is gonna make it or not. A reflection of his own fears: shall I stay alive and get out of here or not. The odds are that he is not, and Stone nails him to the place with Captain's order to take over what was once the Platoon... Bye Patsy.<br><br>The idea that Stone has been trying to bring forward to us is NOT (to my mind) a story of struggle between the good and the bad for the possession of Taylor's soul (remember, the boy became a murderer in the end), but: where is war there can be no escape. Leave hope everyone who enters.<br><br>Highest rate ever for that.","user":"alifanova","rank":[69,79]}]