[{"title":"Corny 80's gold","rating":6,"date":"28 January 2004","review":"There are a lot of people who are going on about how much Teen Wolf sucks. I disagree because Teen Wolf has a special kind of suck going for it. Not so bad it's good but corny as hell and better for it. I've been watching this movie since it came out and I love it. How can you not love Teen Wolf? Michael J. Fox turns into a werewolf and becomes a popular star of his high school basketball team. There is even a dance at his prom that is wolf related. The whole school turns wolf crazy but Fox learns the right lesson in the end. How can you not love this corny crap. I'll be the first to admit that this isn't a good movie and is incredibly stupid, but honest to goodness crapfests don't have Stiles or a breakdancing wolf. Take that American Werewolf in London. Recently Teen Wolf has been blessed with DVD release along with it's sequel, Teen Wolf Too, on one disc. 80's fans rejoice!<br><br>Bottom Line: It isn't worthy of even trying to call itself good, but it's a classic, doesn't take itself seriously, and occupies a honored place on my shelf.","user":"chvylvr80","rank":[57,68]},{"title":"I love this movie","rating":9,"date":"18 April 2003","review":"I appreciate certain actors differently as time goes by. For me Michael J Fox has been on the upswing while others, like Steve Martin, are headed in the other direction. There's nothing particularly unique about any of the elements of this movie except maybe the combination of all of them. Fox finds he can transform into a werewolf with superhuman powers - his \"problem\" makes him the most popular guy in high school and creates a winning basketball team. Forget that the wolf playing Fox on the court must be twice his size and four times the athlete, this movie is just a lot of fun to watch, helped considerably by Hampton as the understanding dad and Ursitti as the under-appreciated girl friend. Very rewatchable.","user":"RNMorton","rank":[25,32]},{"title":"Fox makes this movie","rating":7,"date":"25 March 2009","review":"I first saw Teen Wolf when it came out in 1985 / 86 and thoroughly enjoyed it. If I can remember correctly it flowed on from the phenomenal success of Back to the Future and Fox's star was shining bright at that time. Nonetheless - for a cheap, budget flick of questionable storyline - this film actually comes across well.<br><br>I recently bought the DVD (with Teen Wolf Too on it also) to see if my rose coloured memories stood the test of time. They did. The first hour of Teen Wolf (if you ignore some basic editing mistakes and clumsy cutting) is superb. The story deteriorates a tad from the school dance to it's inevitable ending - but it is still good enough for its time.<br><br>Fox is brilliant in this - funny, natural and a star in the making. The beach boys music is good too. And my boyhood crush on Boof hasn't abated one little bit through the years.<br><br>My two sons picked up the DVD about a week ago and loved it just as much as I did (even though they are only half the age of when I saw it - kids are just more advanced these days). They already know scenes off by heart.<br><br>Nice, feel-good film - 7/10.","user":"markymark70","rank":[5,5]}]