[{"title":"Gruesome, grotesque, grim British horror which must have slipped through on the Censor's day off.","rating":7,"date":"13 November 2000","review":"This is a totally bizarre British horror film which deserves cult status of the highest order - I can't believe that this didn't have problems with the censor, it is a disturbing, nasty piece of work and should undoubtedly have cult status.<br><br>'The Mutations' has Donald Pleasence as a Frankenstein-inspired scientist, Prof Nolter, who in-between his lecturing is trying to fuse humans with plantlife, to create a creature which has the strengths of both species. The nature of the film is introduced early, with a travelling funfair complete with freaks ( played by real-life freaks as in Tod Brownings early classic ), and a hideously ugly normal-sized man, who moonlights as Prof Nolter's assistant.<br><br>The film has so many points of interest its difficult to know where to start - the similarities to 'Freaks' are acknowledged  with a feast scene which includes the line \"He's one of us - we accept you\". The freaks are also shown to have more humanity than the other characters, although they do turn on their tormenter in the end, in a scene similar to the climactic chase in 'Freaks'.<br><br>There are also ideas and scenes close to the French classic 'Eyes without a Face'; Pleasance portrays a character similar to Pierre Brasseur's mad doctor, both living in a secluded mansion complete with pack of mad dogs.<br><br>As if all this were not enough, we are also treated to Julie Ege as the screaming heroine, showing of her acting limitations and bodily curves very nicely - special applause for the nude bath scene.<br><br>'The Mutations' is a real shocker, which viewed today has a strong impact - far more so than more famous 'shocking' films, like 'The Devils' and the earlier 'Peeping Tom', both of which viewed now seem relatively tame.<br><br>While not raising the film to any artistic height - it is a cheap 'B' Movie in all production areas - the film should really be seen by all film fans, and given its deserved status as a heavyweight of the gutter-horror genre.","user":"Wilbur-10","rank":[32,33]},{"title":"frightful disturbing b-movie","rating":8,"date":"21 February 2009","review":"OK i seen the mutations when i was younger at a movie theater in;Paterson new jersey and to this day i cant remember the co-feature. but it scared the hell out of me.its a basic mad scientist story,with a brilliant but unbalanced Dr played by the late great;Donald Pleasence who went on to play Dr loomis in the Halloween movie series(1978 to 1989)creating mutations from plants.i know very weird.it all takes place in england,much to the distaste of fellow scientist from America played by Brad Harris.he gets his subjects from a deformed man played by;Tom Baker(who played Dr who in the 70's)this guy is so gruesome he would give Frankensteins monster the willies.anyway lynch(tom baker)is co-owner of a traveling carnival.the main owner is a kindly dwarf played by Micheal Dunn,who does'nt approve of the Dr's intentions.and like the earlier movie;freaks this movie features real human oddities. the one that gave me nightmares was a guy called pop eye,i don't need to say what he does.also starring in this movie is Julie Ege and Jill Haworth.the mutations has been released to video under the title;the freak-maker.its not as good as Tod brownings freaks,but it is very unsettling.i re watched this recently and found it very entertaining but it no longer gives me nightmares.all i can say is its still a very good film,with a great cast.and Donald Pleasence played the best mad doctors.I'm giving mutations(aka;freak-maker)8 out of 10.","user":"johnc2141","rank":[11,11]},{"title":"This film might be okay for weirdos","rating":9,"date":"28 August 2002","review":"How on earth have I never seen this film before? I watched it tonight 'cause there was nothing else on Cable (again) - lucky me!<br><br>It started with some time-lapse film of plant-life and looked like a programme from the Open University - but then the soundtrack signalled something strange was happening...<br><br>\"Mutations\" owes a lot to Tod Browning's \"Freaks\" but offers loads more: some nice 70's nudity; plants that eat live rabbits (why not pet food?); dialogue that mentions \"cloning dinosaurs\"; a soundtrack that judders from spaced-out, slowed-down, phased bass to free form jazz. This is a minestrone of madness with some nice inconsitencies in the plot. Great!<br><br>Tom Baker was obviously heavily influenced by his role in this film and took most of the wardrobe with him for Dr Who!","user":"hexen53","rank":[27,31]}]