[{"title":"Don't try to match them drink for drink!","rating":7,"date":"30 May 2010","review":"Watching this film again in 2010, it is amusing to see how much they smoked and drank. Students would arrive for tutorials and the professor would pour out a generous glass of the hard stuff or at least sherry. Stephen's pregnant wife takes an afternoon nap with a bottle of beer on the bedside table. Charley arrives for lunch carrying a couple of bottles of liquor, which gets consumed in the afternoon. Not surprisingly William ends up passing out face down in the salad! Anyone playing the drinking game and trying to keep up with the characters would be out cold halfway through the film.<br><br>Everything about the film was note perfect, with the exception of Jacqueline Sassard's stiff performance. Her character was supposed to be Austrian, so why did she try to look like an Italian starlet with that dreadful eye makeup. Perhaps they could not afford Gina Lollobridgida! Not only did she not look the part, but her voice was flat and harsh. I spent the movie wondering what on earth any of the men saw in her. If only they had used Marianne Faithful, who would have looked like an Austrian and given off an air of unattainability, at least until her affair with Charley was discovered.<br><br>I could not help feeling that if Anna had been written out altogether and the object of desire had been the beautiful William, played to perfection by Michael York, it might have been more interesting. Perhaps there was an subtle undercurrent which I missed. Filmmakers were not quite so obvious in 1966. Other than that, the wonderfully atmospheric film beautifully conveyed the long hot humid summer days of the south of England and the polite banter of the elite academics disguising an envious loathing of each other as they drank their way through the day.<br><br>40 years on I have never forgotten one little quote in the film by the provost who, upon hearing that a study into the sex habits of students at the University of Wisconsin revealed that 0.01% had intercourse during a lecture on Aristotle, remarked that he was surprised to find Aristotle on the syllabus in Wisconsin. With snappy one liners like that, how can you forget this film.","user":"emuir-1","rank":[26,28]},{"title":"The best of the 3 Losey-Pinter collaborations","rating":10,"date":"28 June 2001","review":"Following their work on \"The Servant\" (1963) and before the more well-known, \"The Go-Between\" (1971), \"Accident\" can be seen as the best - certainly the most understated - of the collaborations between the English playwright, Harold Pinter, and the expatriate American director, Joseph Losey, who had lived and worked in London for some years.<br><br>As Pinter said in a 1966 interview: \"So in this film everything is buried, it is implicit. There is really very little dialogue, and that is mostly trivial, meaningless. The drama goes on inside the characters.\"  In the published screenplay his directions for one scene indicate that \"the words are fragments of realistic conversation.  They are not thoughts...\" and what comes across is the brilliant contrast between the nondescript, mundane, day-to-day attempts at communication between the characters combined with a hard look at the underlying reality of the characters' situations.  Nothing is like it seems to be.<br><br>If you like the work of Harold Pinter, this rarely-available film, is a brilliant addition. See it in combination with the other two to get a full picture of what Losey and Pinter achieved. I've seen the films at least 10 times each and they formed the basis of my 1974 MA thesis on the Pinter-Losey collaboration.","user":"johnwebber","rank":[47,55]},{"title":"Pinteresque, Picaresque and Picturesque","rating":8,"date":"28 January 2002","review":"From the very first shot Losey lets us know that to get the most from this film it's not what you see, but what you perceive, that matters. The opening shot of a country house is held steady for our eyes whilst the sound of an approaching (speeding) car and, inevitably, the grinding of metal on gravel as the accident happens, dominates our hearing. And so it is for the rest of the film. What is important is not, necessarily, what we see, but what we discern. <br><br>The complexities of the relationships between the main characters, the effect on all of them brought by the simple presence of Anna (Sassard), their infidelities and insecurities all contribute to make this a spell-binding 100 minutes or so of classic cinema. <br><br>The spare, Pinteresque, dialogue inspires the viewer to attempt to untangle the dynamics between the characters. Some poignant photography (for instance, the symmetry of Anna and Stephen (Bogarde) as they gaze out over picturesque English countryside whilst leaning on a gate but, at the same time, teasing us as to whether or not they will draw closer,) adds to our desire for a better understanding of these people and their relationships.<br><br>\nThe photography of rooms shot from odd angles (indeed, some of these shots seem designed to accentuate the angles of the characters every bit as much as the rooms themselves) all contribute to a complex web of relationships. Some sexy, sixties sax from John Dankworth adds an appropriate musical blend to the whole. And how many times does Stephen say to others `What are you doing?' as he strives to come to terms with his own infidelities and insecurities, let alone those of all those around him?<br><br>\nIt's an intense, but approachable, movie with little concession to humour, save perhaps for a couple of comments from Stanley Baker's picaresque character, Charley. But don't let that put you off; this is intelligent, challenging cinema, a welcome refuge from the shoot em up stream of movies we've become used to over the years.","user":"davidholmesfr","rank":[34,41]}]