[{"title":"One of Hong Kong's best films","rating":9,"date":"12 May 2003","review":"The Killer is widely regarded as John Woo's best all round film, and makes an appearance on an extraordinary number of people's Top 10 lists. This may be because it was the first Hong Kong movie a lot of people saw, as it was one of the first to get any kind of widespread attention in the US. It doesn't feature in my own Top 10, but that's not because it isn't good<br><br>Chow Yun Fat plays the titular killer, an assassin who begins to regret his life of violence after accidentally blinding singer Sally Yeh during an assassination. Danny Lee plays the cop on his case, who begins to find he can relate to the killer more than he can to many of his colleagues. Both men are shown to be men whose values of loyalty and honour are increasingly being forgotten by the society in which they live.<br><br>THE KILLER pretty much defines the \"Heroic Bloodshed\" genre, taking the code of chivalry from the old swordplay films and bringing it into the world of guns and bullets. Woo basically started the whole genre with the seminal A BETTER TOMORROW, but THE KILLER is the most distilled vision of the concept he or anybody else in Hong Kong produced. It's a very romanticised film - even though the main characters earn their livings from violence, they're painted as very noble characters and starkly contrasted with the real villains (led by Shing Fui On in his best role ever) who kill without honour. There's a broad message of peace and restraint from violence there too, though it's somewhat conflicted with the romanticisation of some of the bloodshed.<br><br>John Woo and Chow Yun Fat were serious box office gold when THE KILLER was made - apart from another Jackie/Sammo/Biao collaboration there was probably no more anticipated collaboration than this one. As such, THE KILLER was afforded a budget and shooting schedule that most Hong Kong productions could never dream of (though still no doubt miniscule compared to any Hollywood film of the time). This is evident in the quality of the production on pretty much ever level. The film has as high production values as any Hong Kong film ever made, and is surely one of the most technically accomplished. Credit for this must be shared between cinematographer Peter Pau, producer Tsui Hark and of course director John Woo.<br><br>I've always suspected that the real talent behind the film was probably Tsui Hark - it's rumoured that Tsui &amp; Woo fell out heavily because Tsui felt THE KILLER should be \"A Tsui Hark Film\" and not \"A John Woo\" film. Evidence for this is that Woo's earlier and later films have been largely lacking the substance and depth of THE KILLER (especially his Hollywood films, but everybody gets that in Hollywood). However, the interviews on the Hong Kong Legends DVD clearly show that Woo had a vision and pursuit of excellence that was the driving force in the project. He's spoken of very highly by his cast and DOP, who give him the full credit for the film's success. I'd like to hear Tsui Hark's side of the story though<br><br>The attention to detail in the film is most obvious in the cinematography. This was Peter Pau's first big film, and the one that established him as one of Hong Kong's top cinematographers. He gives Woo most of the credit for the film's visual style though, describing how much thought Woo would give to the way the camera should be positioned and move to bring out the emotional quality of the scene. I don't have the knowledge/education to be able to perceive how the camerawork in the film does contribute to the emotional depth, but I can acknowledge that it's effective.<br><br>Woo is often regarded by Western film makers as the best director of action in the world. I think Tsui Hark probably deserves that credit more, but Woo certainly redefined the way gunplay was choreographed and filmed. HARD BOILED is his finest work in this respect, but THE KILLER certainly comes second. The action was choreographed by Ching Siu Tung, who was evidently a little uncomfortable with choreographing gunplay when he worked on A BETTER TOMORROW 2 (sorry, but most of the shoot outs in that are just people running round randomly waving their guns at stuntmen). He'd obviously improved his skills a *lot* by the time of THE KILLER though, as the action scenes are exciting and violently beautiful. The grand finale in a church is surely one of the best gunplay sequences ever filmed, topped only by the finale of HARD BOILED.<br><br>Some Western audiences find THE KILLER too melodramatic, and for an audience not raised on the swordplay and kung fu films that influenced Woo the romanticised notions of loyalty, honour and integrity may seem rather alien and strange. It's a theme that has long been found in Hong Kong Cinema though, so perhaps it reflects a more Chinese set of values than the average American or European is used to experiencing. It would be especially rare to find such emotional scenes in a Hollywood action movie, where the action genre is usually considered to be wholly distinct from drama. Perhaps it's this that makes THE KILLER such a wide hit whenever it is screened in the US.<br><br>So, although I won't put THE KILLER in my Top 10 list, I definitely won't dispute the fact that it's one of the best realised films Hong Kong has produced. John Woo is unlikely to produce a film of this calibre again, and unfortunately it's unlikely Chow Yun Fat will do either. As for Danny Lee, this was undoubtedly the highlight of his career - Psychadelic Cop anyone? Sally Yeh also gives her most memorable performance, and a surprisingly convincing blind character for somebody that had no real acting training. Shing Fui On and Kenneth Tsang have never looked better either. In fact, for almost everybody involved this was probably the high point of their career.<br><br>9/10","user":"simon_booth","rank":[67,85]},{"title":"A true masterpiece","rating":10,"date":"30 December 2004","review":"I first watched the killer on recommendation i thought i would hate it...how wrong i was.It was obvious i was watching a classic from the opening credits with a lingering shot of hong kong and a somewhat sad tune playing in the background. The story starts with ah jong an assassin hired to pull off a hit job at a nightclub during the assassination he accidentally blinds a piano singer-jenny.Feeling guilty for what he has done he decides the only way to redeem himself is too help her get a cornea transplant and the rest...you will have to find out yourself.<br><br>John woo is known for directing heart pounding action sequences and these are as heart pounding as they get the final shoot out in the church is tense and exciting.The cinematography is excellent and often beautiful th camera works wonders and extreme close ups of faces are used effectively SPOILERS AHEAD.The ending of the killer is possibly the most downbeat in the history of cinema and nearly brought me too tears(ah jong's eyes explode after being shot several times).The killer is something you do not see in modern day movies...a film with a true meaning this story is of ethics honour and redemption and thats what makes it a classic.","user":"lordhood","rank":[60,76]},{"title":"John Woo is the master","rating":10,"date":"12 July 1999","review":"Before seeing a genuine Hong-Kong produced John Woo movie, I thought I knew what action was, and what the action-movie genre was capable of. I was wrong. The Killer was the single most impressive, awe-inspiring, jaw-dropping action movie I had seen in years, and is now one of my favourite movies of any genre. It is #2 on my all-time list.<br><br>Why? First of all, the well-known poetic violence of the super-charged action scenes make for a tremendously exciting film. These combine choreographed bloodshed (there is an almost constant stream of bullets) with raw emotion that puts even the best Hollywood actioners to shame. Look at Hollywood action movies today; almost all Hollywood action is inspired (not to mention plagiarised) from the \"heroic bloodshed films,\" the best of which is The Killer.<br><br>Quentin Tarantino and Robert Rodriguez are only the most obvious examples of American directors to put Woo's trademark stylized violence to use, and neither handle it as well as Woo.<br><br>But beyond this, the characters and the story are what drive this movie and what truly set it apart. The story of the relentless cop and the vicious killer is only the latest in a long line of detective stories, starting with Arthur Conan Doyle and Edgar Allan Poe in the 19th century, and continuing in every cop show on TV today. The hero and the villain are practically the same; they are only divided by an almost arbitrary line called the law. In The Killer, both \"Mickey Mouse\" and \"Dumbo\" are unrelenting, capable, though misunderstood, professionals. Their motivations differ, but they both have the killer instinct. The classic storyline of the interaction of the two characters who eventually realize their similarities and end up working together has been seen before, but never has it been used to such effect as in The Killer.<br><br>Woo's familiar themes of brotherhood, betrayal and loyalty also reach their cinematic peak in this movie. The viewer not only wants to see the next pyrotechnic action scene, but is actually concerned with the lives of the characters, an element that is almost always lacking in typical Hollywood fare.<br><br>Finally, the gun-battle scenes, when they come, are simply the most spectacular, mind-blowingly violent, yet strangely beautiful, action scenes ever imagined or filmed. And last but not least, is the unbelievably powerful screen presence of Chow Yun-Fat, as always cool incarnate. His effortless lead and the tension created by his playing off of co-star Danny Lee make The Killer as close as I have yet seen to the perfect action movie. I recommend it to any hard-core action fan and also suggest Hard-Boiled, though Woo's American efforts thus far have not been up to his Hong Kong works.<br><br>Rating: 10","user":"Anardil","rank":[75,99]}]