[{"title":"Truly nasty and exploitative Corman-highlight","rating":8,"date":"14 December 2004","review":"With some imagination, the best way to describe \"Humanoids from the Deep\" is calling it a nasty and perverted update of the \"Creature from the Black Lagoon\"-premise. That classic Jack Arnold featured oppressed sexual undertones while HftD is a downright outrageous and rancid flick. Not bad to see a woman directs a more or less anti-women movieeven though Corman hired someone else to shoot extra sleaze-footage. In many ways, it also feels like you're watching an Italian horror product! The style and atmosphere of this film are so silly, the violence is so explicit and the plot rips off several other genre classics. Don't be fooled, however, because this is an authentic Roger Corman production and definitely one of the most entertaining ones he ever was involved in. The plot handles about ecologically mutated fish that attack a little fish-town during the annual salmon-festival. The creatures, which evolve amazingly fast, kill the men and rape the women.<br><br>\"Humanoids from the Deep\" is an unbelievably entertaining gorefest! The monster-suits are some of the most efficient ever and they look truly despicable. The gratuitous nudity is  of course  a very redundant element but Corman surely knows that it sells. As mentioned before, this film rips off quite a few genre hits and cleverly uses eerie ideas (and music) from \"Jaws\" and \"Alien\". The make-up effects are simply disgusting  and that's a positive comment. Especially the grotesque finale, set during the yearly festival, contains some sickness every self-respecting horror fan should see. Even though the film could have used a little more humor to put it the wholesome into perspective a little, this surely is fundamental viewing for all fans of trash film-making. For some incomprehensible reason, Corman also put his money in made-for-TV remake during the 90's. That film might be fairly gore as well, but it entirely lacks the campy, light-headed fun of this original. Make sure you watch the right version!","user":"Coventry","rank":[42,54]},{"title":"Mutated salmon raping women? Beautiful.","rating":22,"date":"22 October 2000","review":"The fact alone that a woman directed this film makes it a curioso piece. It's indefensible trash that certainly works on a campy, visceral level. It also has the makings of some actual characters. Seriously, in the midst of the gratuitous nudity and bloodshed, I found the movie to be...  No wait a minute. Let's get back to the gratuitous nudity and bloodshed. I watched this movie expecting to see these two, and it delivered. I knew going in that this was going to be B-movie material, and that's what I got. I was entertained. You can sit back and analyze this movie all ya' want. I'm just gonna enjoy it for what it is. And what an ending!","user":"t_brown_17","rank":[15,18]},{"title":"A great if unintentional comedy","rating":5,"date":"28 August 1999","review":"There's a little sleepy seaside burg debating whether to add a new cannery. Life is slow there, and the fishing is dying. It turns out that the reason the salmon are disappearing is that the owners of the cannery company have been doing some DNA experiments on salmon. They accidentally released genetically altered salmon into the ocean, and those altered salmon were eaten by predator fish. This special diet turns the predator fish into - you guessed it - Humanoids From The Deep. (Add echo chamber in your mind).<br><br>Now what do you think the loony humans do? Hint: remember that the monsters have been living on genetically altered salmon, and then they have nothing else to eat but the real salmon. The humans go ahead and hold the 93rd annual Salmon Festival! It's like advertising a tourist attraction for salmon-eating monsters. Then there is a silly subplot, added after the fact by the filmmakers. The monsters are super-evolved and need to propagate their species. They don't seem to have any females in their race. They are also humanoid (Well, sort of. They appear to be as human as Vic Morrow, but just barely). They therefore need to kill human males and mate with human females.<br><br>First they come upon a girl and her boyfriend camping on the beach. He is a ventriloquist, for no apparent reason. They maul the twerp, and the dummy's eyes continue to follow the action, even after the ventriloquist is dead. This apparently supernatural phenomenon is never explained. (Hey, it's a Corman movie). The monsters proceed to rape her. Later, another girl's boyfriend is feeling her up in the water, and this makes the humanoids really horny, so they kill another twerp, and rape another girl. In the movie's final scene, she is giving birth, and ......    I think you can probably figure it out.<br><br>The movie's climax comes at the Salmon Festival, a carnival where humans and humanoids alike meet to share a few memories. The humanoids show that, while they are not smarter than average humans, they are quite a bit smarter than carny folk, and smell a lot better as well. Dental care is about even.<br><br>The monsters rip off the bra of the Salmon Queen before chasing her through the midway. Before tracking down the Salmon Queen, however, the monsters stop to ride some of the midway rides (say, they are genetically advanced), and of course slaughter the humans on the rides. Then the monsters stop for some cotton candy. Not by salmon alone does man live. Then they head over to the midway to play some carny games. One of the monsters is really hacked off that he can't knock down the bowling pins and win an Eeyore for the Salmon Queen, especially since he has seen some other monsters with Eeyore's and even one with a Tigger! He really gets steamed when he realizes that those other monsters were audience plants, allowed to win by the carny barkers in order to sucker in the players. Of course, when he finds this out, he rips the carny geek limb from limb and resumes chasing the Salmon Queen, intending to take her by force if he cannot woo her with presents.<br><br>But, by jingo, we humans are not defenseless, you know. Our salmon queens can take care of themselves, thank you very much. This gal squares off and dukes it out with the big guy. The human spirit endures. So if you evil superintelligent movie humanoids are out there reading this review, listen up. You'll never take us. If you think you can just come here and rape our women, Mr. Johnny Monster, you've got another think coming. We've got mighty tough Salmon Queens and Van Damme and Bruce Willis, and no movie monster or asteroid is going to crush this race, nosireebob.","user":"Scoopy","rank":[33,44]}]