[{"title":"A powerful antidote to conformism","rating":10,"date":"22 August 2001","review":"There are certain films that get under your skin, never to come out. They change your life, subtly altering your perceptions of reality, almost always for the better.<br><br>Dead Poets Society is one of those few films.<br><br>I saw the movie back when I was in High School. I had a teacher who told us that we really needed to watch it; in fact, it was our \"homework\" for the day. We didn't need to bring back a report, or talk about it in class. All he asked from us was to watch it, make up our own mind about it, and that was it. As you can imagine, many friends of mine didn't watch it at all; I did. And yes, I feel I changed a bit from there on.<br><br>Back when you are young, you never really stop to think what in the world you are doing with your life. You simply live for the day, hope your grades will be enough to pass, and that's it. Long term thinking involves maybe flirting with a girl. Nothing more. What this film showed me was that we have the responsability and the joy of being alive in this planet. That we are dust, and we will go back to it, so we have precious little time to make a difference. That we have a moral obligation to \"seize the day, and make our lives extraordinary\" (my favorite quote in all movie history). That the world, basically is ours. That the only limitations are within ourselves, and that we owe it to us to fight, to rebel against conformity, to change what we hate and keep what we love. That living in this world is a beautiful responsability, and that only cowards dare not to change it for the better.<br><br>The fact that the cast was basically my age, and was passing through the same dilemmas and situations I was facing made it all so much more powerful.<br><br>So here I sit, 12 years from that day. I still don't think I have seized the day completely. But I keep on trying; I always will. I wonder how many people were transformed by this gem of a movie; I hope many.<br><br>10 out of 10. A definitive masterpiece.","user":"fjhuerta-2","rank":[742,778]},{"title":"Seize the Day- One of the Greatest Movies Ever!","rating":10,"date":"17 November 2008","review":"Dead Poets Scoiety. I suppose if you were in High School sometime between 1990-2008, one of your teachers thought I'd be a good idea to watch this movie and I still remember my reaction and the ones of our fellow classmates: Yeah, probably a boring movie that will try to make the school look better and encourage us to do our homework and study for our tests. I couldn't have been more wrong. This movie definitely changed my way of thinking to a certain extent and there are very few films who have moved and touched me like this one.<br><br>The movie plays in 1959 and centers around a private academy somewhere in New England. The curriculum is extremely difficult and the teachers have no humor and are very strict. The new English teacher though, Mr John Keating (Robin Williams), who graduated from the very same school, uses unorthodox, but quite effective methods to teach the students about literature, and poetry. During their first lesson, he tells them that they can either call him Mr. Keating or \"Oh Captain, my Captain\", based on a quote by Walt Whitman. He encourages them to come out of themselves, use their energy to make their lives worth living and beautiful - Carpe Diem, Seize the Day! The plot also centers around two students: Neil (Robert Sean Leonard), who is funny and popular, but fails to gain his fathers pride, because of his wish to become an actor, and Todd (Ethan Hawke), who is very shy and unsure of himself, and is inspired by Keating to use his imagination and eventually we find out that he is very talented when it comes to poetry. After they find out about a club Keating was a member of while he was a student, the Dead Poets Society, which was forbidden by the school, they decide to reestablish it, what ultimately gets them into a lot of trouble.<br><br>There are several key factors, that make this movie as brilliant as it is. First of all there is the acting. Robin Williams, who I really like as a Comedian, really proves that he is a great actor, who can get deep into a character and play him with such passion and energy that you will forget he's an actor. Keating, whose teaching methods are indeed unusual and will probably make you laugh a couple of times, is a very interesting role, the teacher we all would have wanted, but not because he doesn't give homework or makes up very easy, open-book tests. No, because Keating shows us that we have to come out of ourselves, make the best of our lives and especially that there is a poet in everyone of us. Then there is the terribly under-appreciated Robert Sean Leonard, who also gives a very moving performance as a student, who is kept back by his father, and therefore fails to make his dreams come true. In my opinion he is very underused as an actor, and should have gotten a lot more leading roles. As for Ethan Hawke, he definitely was the best choice for the character he plays. We can literally feel his fear and shyness when he stands in front of the class and gets no word out, because he's so embarrassed.<br><br>Peter Weir, who is probably most known for his recent movie \"Master and Commander\" shows what a great director he is with this film and it definitely deserved the Oscar for Best Original Screenplay, and the nominations for Best Picture, Director and Leading Actor for Robin Williams.<br><br>Some of you may have heard about Roger Ebert absolutely negative review of this movie and that \"he wanted to throw up at the end of the film\". I can understand why people might not like the ending (I won't put any spoilers), but I think it just adds to the the beauty and drama of this film, a film that should definitely be on the IMDb Top 250 Movies. This is a movie, you must have seen!!","user":"fred-kolb","rank":[79,83]},{"title":"Carpe Diem, because the days don't stand still","rating":10,"date":"4 February 2005","review":"First of all, this is movie is my all-time favorite, out of all the hundreds of films I have seen. However, every time I mention this film, I have to answer most people's quizzical looks with \"It's a beautiful little 80s film that stayed in the 80s.\" After seeing it for the 24th time since I first saw it 5 years ago, on my 13th birthday, I can gladly say that this movie went far and beyond the 80s, and the power and inspiration of the message can be felt every day.<br><br>Dead Poets Society is a most underrated film by a most underrated director whose inspiring, uplifting and moral tales firmly grounded in reality are not nearly as appreciated as they should be. Here, we see one of his very personal and cradled projects, and he shows the visual style and concentration on characters in which he is so affluent. His control of the camera and the characters are very strong and very smooth. The cinematography is near perfect, with every shot, along with the editing, seamless. Also very compelling are the color-tones in every scene, perfectly matching the mood and events of the scene. Could you say this is art? Absolutely.<br><br>Then we have the performances. Robin Williams continues in stride as one who has to-date remained the most touching, heart-wrenching, awe-inspiring comedians with inarguable acting talent (he still remains my most favorite performer on the film screen). His Professor John Keating is a man who embodies every professor who you thought was cool and respectable, every person who taught or enlightened you in something out of the ordinary. In fact - dare I say it? - he teaches something EXTRAORDINARY! We have the tragically underrated Robert Sean Leonard in his role as the free-thinking catalyst student Neil. Why is this man not a household name/Hollywood heavyweight? His roles are always full of inspiration, energy, and tragic emotion that never fail to move an audience. His role in this movie is fresh, unhindered, and never pretentious as the cautionary tale of the movie. And then we have Ethan Hawke in one of his earliest roles as the point-of-view character. The entire supporting cast is very strong, also, providing the foundation and serve as the various emotional ties that further involve us in the story. Josh Charles's role as Knox Overstreet is a role that almost all guys can relate to wholeheartedly. And of course, all the actors who are in that Dead Poets Society do a fine job.<br><br>And lastly, the story. I won't summarize it since it's been summarized many times here, but I will say that it is one of the best coming of age stories for not only adolescents, but anyone. I have personally heard from nine-to-fivers who were inspired by this movie to change the situations of their jobs, careers, relationships for the better. I first saw this movie when I was 13, and immediately stamped, crowned and elevated this movie as my all-time favorite. Now that I am 18 and living on my own, with very different concerns than back then, I turn back to this movie over and over again, to find inspiration, solace and of course, entertainment. It is still my all-time favorite, and it still inspires me to seize the day and make my life extraordinary.","user":"blissfulmitch","rank":[312,347]}]