[{"title":"Rabid Weasels?","rating":10,"date":"2 November 2003","review":"This is one of those very rare films that combines good black humor with bloody, messy gore and does it perfectly.  Where `Children Shouldn't Play With Dead Things' fails miserably, `Return of the Living Dead' succeeds triumphantly.  It takes a tired plot (zombies eat teenagers) and makes it new again.  The teenagers here are not faceless, stupid, oversexed victims at all.  They are misfits and outsiders, the kind of kids who probably go to horror movies every day and make fun of the faceless, stupid, oversexed victims who populated the majority of the slasher films made in the 1980s. The nihilistic punk rock teens can identify with the zombies, and even though it is their ultimate fate to be consumed by them, you like them, you want them to survive and you're sorry to see them go even though the zombies are every bit as cool.<br><br>Long before `28 Days Later' appeared, `Return of the Living Dead'  presented us with FAST zombies, zombies who could run, jump and work together like a football team, tackling people and making it a group effort to tear their victims apart.  There are very few slow, shuffling monsters here; these are zombies to contend with.  They talk, they think, they problem solve.  Who could ever forget the Tar Man (my personal favorite) rigging up a device to tear down the metal closet doors, behind which our heroine has locked herself?  <br><br>The adult characters in this film are no less interesting than the teenagers.  James Karen is absolutely hysterical in his role as a medical warehouse manager, whose bumbling irresponsibility leads to the zombies being unleashed.  Clu Gulager is a stressed out corporate jerk who will do anything to save the name and reputation of the warehouse he owns.  And Don Calfa is excellent as the slightly shady mortician who may or may not be an ex-Nazi.  The mismatched cast really comes together and forms a bond here, fighting back and growing more desperate as the zombies grow stronger.  This film never lets up, not for one minute.  There are no long explanation scenes, no boring set-up, just in-your-face excitement from the very first scene.  It is the perfect homage to the Romero films; there is no happy ending here, only an ironic twist which will make even the most cynical doomsayer grin.  This film is already a cult classic and deserves its status.  It's as close to flawless as you can get.","user":"Gafke","rank":[164,177]},{"title":"Be a man Frank goddamn it!!!","rating":25,"date":"25 December 2003","review":"This is quite possibly one of the funniest movies ever made.<br><br>It succeeds not simply thru its humor but in the way that it takes the plot seriously. That is, the characters avoid doing anything cliché or 'movie-like'. They react to an amazingly unusual situation in a very logical, sensible way (even as things become more &amp; more desperate). Consequently none of the humor is forced. It all comes from the combination of having to deal with all the insane things that are happening to them in the sanest way that they can. The contrast of these two makes for absolutely brilliant comedy.<br><br>For example:<br><br>» They have to kill an already dead guy so they put a pick axe thru his head.<br><br>» This doesn't kill him so they saw his head off.<br><br>» This still doesn't work so they decide to incinerate him in the neighbor's crematorium.<br><br>» In order to do that they make up a \"rabid weasels\" story to tell the neighbor.<br><br>All of these things, as hilariously ridiculous as they are, actually make sense in the context of trying to deal with the situation. In other words, if you found yourself confronted with re-animated corpses you would probably do exactly what they do to try and stop them. And even as the situation slowly progresses from bad to worse to desperate the film maintains this idea.<br><br>In fact, the film quite brilliantly maintains this idea at the very end. As over-the-top as the ending seemed I can completely picture the military wanting to do exactly that!","user":"eskovan1","rank":[118,129]},{"title":"Crackerjack ...","rating":19,"date":"19 September 2003","review":"I love this film to living death ... Every actor got the right part, and they all got the part right.  High camp, higher parody, positively hilarious scenes so well set up that a mere facial gesture delivers the punchline, sometimes only a few beats of music delivers.  In the midst of all this ripping off of Romero's \"Night of the Living Dead\", it borders on worship of its inspiration.  Pathos holds hands with hilarity, genuinely creepy scenes bleed into high gear humor.  I haven't found a misstep.  There is a high quotient of \"Oh s**t\" scenes and they all work.  The undraped Quigley is neither gratuitous or prurient; just imagine the movie without her character; loses much.  This is a delicious, feverish living dead romp that plays out to one crackerjack musical score.  Everything meshes, everything works.  How do you fault a film that gets it all right?  This title will survive a long long time.","user":"Poe-17","rank":[68,75]}]