[{"title":"What a classic!","rating":29,"date":"29 October 2003","review":"This is one good horror flick. It really should have a better reputation than it does. Of course, it's silly and stupid... that's part of the fun! One of the things that makes this movie pretty unique is it has many scenes that are pretty serious and intense, while others are laugh riots on purpose and on accident. Perhaps the greatest thing is how creative these filmmakers got with the monsters. They go all out with nearly everything that you can (or CAN'T) think of: zombies, a spider woman, farting muckmen (hilarious!), a cellar hag, lizard monsters, the Grim Reaper, a half-cat weirdo in biker books with a hook in place of a missing hand, a tall, ugly monstrosity with an exposed heart and tentacles, etc., etc. Man, it's wild! There's also demonic possession, and a scene that has much in common with the first (human) possession in \"The Evil Dead\". \"Spookies\" also has an interesting story behind the movie: It was begun around 1984 as a horror-comedy called \"Twisted Souls\". That was unfinished, but they added more stuff in to make the paste-up movie that became \"Spookies\". Amazingly enough, \"Spookies\" doesn't look like remnants of separate movies. It was all put together very well, and the results definitely deserve more respect and recognition. I really want to see the uncut version, because it probably has more gore and would also probably clear up confusion about what happened in gory scenes that were obviously cut right out of the US version with an R rating. If \"The Evil Dead\", Lamberto Bava's \"Demons\", \"Night of the Demons\", and others were able to get by with how goofy they are, I think that \"Spookies\" (a movie just as equally goofy and creepy as any of the others) should be able to also. In my opinion, \"Spookies\" should be legendary.","user":"one4now4","rank":[28,32]},{"title":"There Is No Uncut Version Of This Above-Average 80s Horror Film","rating":7,"date":"22 May 2006","review":"IMDb readers are in luck: some of the production team behind one of the two films combined into the feature called SPOOKIES have been posting to the message boards for the film, and their insights into this really odd, enjoyable little flick are quite eye opening.<br><br>Unless I am mistaken in reading what they have posted, SPOOKIES began in 1983/1984 as a film slated to be called TWISTED SOULS -- credited to directors Thomas Doran and Brendan Faulkner -- about a group of people who travel to a secluded mansion in the middle of nowhere for some sort of party: The place is haunted or possessed by poltergeists who saw THE EVIL DEAD (amongst other films given visual nods) and the cast is killed off in entertainingly gruesome ways by a host of early FX horror meanies -- My favorite is the statue of the Grim Reaper that comes to life, scythe and all, though most fans seem to prefer the Muck Men, who pass gas uncontrollably while trying to maul their victims. \"Farting mud men\" or whatever.<br><br>For reasons I am still not 100% clear about the film was shelved for two years or so until 1985/1986 when a hack director named Eugenie Johnson was brought in to try and create a finished feature length film out of the well-produced but unused footage, shooting some additional scenes and editing them into the body of TWISTED SOULS in the same way that one might make a quilt on a loom: The two films are now inextricably interwoven into one 85 minute feature called SPOOKIES, which unless my notes are incorrect, was released theatrically &amp; on home video in 1987/1988 to a certain amount of popular acclaim.<br><br>Put quite simply, the scenes with the group of people in the haunted mansion with the Ouija board possessed chick are what is left of TWISTED SOULS, the remaining footage with the goofy made-up kids, the Angus Scrimm like old man, and the young goth babe in the white dress are what Ms. Johnson added to round out the runtime. The result is even more confusing than it might sound because the film abruptly changes gears &amp; tones in mid-scene as cutaway reaction shots by the weird monster kids are edited to make them appear as extensions to scenes which they were never meant to be in. The problem is that the production design and texture of film stock used for the SPOOKIES add-in scenes are notably different than the by then 3 years older TWISTED SOULS scenes, giving the film a discontinuous &amp; disjointed feel to it that one might mistake for clumsy editing. One minute you get a terse haunted house scene with 20 something adults panicking as they have to fight off animated killing fiends, the next minute you get stuff that looks like a nightmare sequence from \"The Wonder Years\". The film comes off as a cross between a horror farce like DEADTIME STORIES and a grim little effects thriller like SUPERSTITION aka THE WITCH, which may also have it's own grim sense of humor but is hardly played for laughs.<br><br>The final film known as SPOOKIES doesn't make sense as a linear narrative, and yet there is still something going on here that is pretty darn interesting. The bottom line on the film is that NO UNCUT VERSION OF IT EXISTS, unless you want to use Duchamp and say that Ms. Johnson's re-defined film with the added footage counts as a finished, single discreet object. It sort of kinda does, but only until you learn the story behind what you're seeing. And once you know the story behind the production -- and how to tell the two aggregate parts from each other -- it's hard to enjoy it as a single finished piece of art anymore, which is too bad. SPOOKIES doesn't suck but yet it doesn't exactly rule, and as Beavis &amp; Butt-Head teach us, stuff should either suck, or it rules ... By failing to achieve even that basic standard the film becomes a big, exasperating, confusing tease that looks great without managing to say a damn thing about what it is supposed to be. Here is a film that requires background reading.<br><br>That the original material from TWISTED SOULS is lost to time (or legal considerations, at least) is a travesty: This could have been one of the best haunted house movies of the 1980's, and instead exists only as a sort of incomplete, disorienting mish-mash filled with genuine dreck breaking up some of the most interesting horror scenes from that particular period of time. I find the film as it exists today as a fascinating example of how the worst intentions of even the most talented people can be used against their own better judgment: I'd love to even see a 40 minute cut of what's left that excludes the SPOOKIES additions, even if the film wouldn't have an ending. What ending there was tacked on isn't much to begin with, and sometimes trimming the fat from a steak helps one get to the meat a bit quicker without having to saw through all the chewy, wasteful gristle. If Ms. Johnson was not under a contract compelling her to do the work she has no excuse, because no matter how clever her additions were they only served to muddle up &amp; confuse what should have been a lean, mean little movie.<br><br>7/10: Someone call in a butcher next time.","user":"Squonkamatic","rank":[31,38]},{"title":"since when is death flammable?","rating":11,"date":"11 August 2000","review":"Spookies is shy and unsure of itself at first but its confidence grows and shows us what its got starting with Duke's \"What's behind this door?!\" and subsequent chair smashing. All it needed was a little encouragement, encouragement that other reviewers are denying it!<br><br>Farting muck monsters in the basement! A Grim Reaper made out of oily rags! (apparently) An un-dead Winona Rider lookalike! A zombified Michael Jackson impersonator! More movies should be like Spookies! The movie doesn't take itself seriously and so neither should the audience. The American public can only take so much terrorists at sporting events-world being saved by greasy wife beater shirt wearing hung over Bruce Willis-Nicolas Cage types from Brian Depalma until our souls are empty, minds numbed, and we become zombies. Wait! If that happens we can make more movies like Spookies! My optimism and hope for the world has been renewed!","user":"rustind-2","rank":[22,29]}]