[{"title":"One Of My All-Time Favorites, Too","rating":10,"date":"26 October 2005","review":"This movie never got much acclaim for some reason. When I read where Clint Eastwood said it was a personal favorite of his I smiled, because it's mine, too.....and I like a lot of Eastwood's movies.<br><br>This isn't just my favorite Eastwood film. It's one of my all-time favorite - period! That's probably because it has tremendous charm, with a good mixture of comedy and drama with characters you care about. It's definitely different from most of Clint's movies. <br><br>The famous Eastwood glare when he's mad is still there, and he still shows his violent side. However, it's not a violent story, just a tale of a modern-day man and his little troupe who want to be cowboys and Indians, and go on tour with their little Wild West show.<br><br>The film has nice, colorful photography and looks great on DVD. However, the story, not the visuals, is the main attraction. It's refreshing to see Eastwood play a role like this where he's a Mr. Rogers-type western hero for little kids, urging children to stay on the straight and narrow, mind their parents and say their prayers before going to bed at night.<br><br>Sondra Locke also is effective as the cold newcomer who reluctantly joins the group and slowly changes from a mean-spirited, sarcastic woman to a caring person. She shows a good comedic touch and is excellent in this film, perhaps her best effort since \"The Heart Is A Lonely Hunter.\"<br><br>The rest of the cast is fun to watch, too, and it includes one of my favorite faces and voices, that of \"Scatman\" Crothers. There is very little profanity in this film, too, which adds to the attraction and widens the potential audience of this neglected gem. I really think it's Eastwood's most underrated movie.","user":"ccthemovieman-1","rank":[61,67]},{"title":"Top marks: adds to Eastwood's body of work","rating":10,"date":"13 August 2002","review":"I think this movie is pure Eastwood: not trying for the spectacular or flashy, not aiming for any Oscars, but honest, well-crafted, original in theme, touching and memorable. It deserves more attention than it's gotten and is deeper than it's been given credit for. Eastwood himself has said that if he ever had anything to say as a director it's in this film. It's a great addition to Eastwood's large and impressive body of work, and shows yet again that he is never afraid to take chances.","user":"niall801","rank":[36,42]},{"title":"Lets hear a cheer for everyone's favourite cowboy.","rating":7,"date":"9 February 2007","review":"Bronco Billy the sharpshooting cowboy is the owner of a modern-day travelling Wild West Show that seems to get caught in one messy situation after another. And not helping is the lack of crowd figures to their show. But nothing is going to stop Bronco Billy along with his companions from living their American dream. Through some amusing chain of events a wealthy, snobby heiress Antoinette Lilly finds herself tagging along with the show and becoming one of Bronco Billy's assistant, after her new husband leaves her stranded with nothing.<br><br>I don't understand why they think this cap gun shoots nothing but blanks. While, Eastwood (who directs and stars) goes all sentimental, warm and fuzzy for a change. It wasn't as well accepted (despite it being one of Eastwood's favourites) and flopped at the box office with it receiving such poor jabs from most critics. Not to say it's great, but this comically light-hearted character journey has a certain amount of charm within its foundation that doesn't make it as bad as you would believe. Even with this whimsical nature, it never gets overbearing. Sure it can cause you to cringe at times, but it wears its heart on its sleeve and keeps it integrity intact. More often I found myself smiling at the shenanigans, well it was hard not to. It's simply a satire worked into an old-fashioned story of familiar ingredients, were there was plenty of things going on in the plot. Who knew these traditional plot devices could maintain such interest. This is because of a delightful bunch of wholesome performances, authentically zippy purple patches of random fun and Eastwood's conventionally hardy direction makes sure it ticks along sufficiently. Even if it's nicely shot, there's nothing overly flashy or quirky creeping up, so it's all about the loyal chemistry and assured story that keeps one compelled. Streamlining the moralistic story are deep insights and symbolic brushes of the true feeling of the American dream. You got to earn it, as it's not served on up on a plate for you and from that you make the most out of it to live up to 'your' dreams. Pacing-wise it can stall in stretches, but I didn't find it boring when that did occur. The stock characters here seem to be grounded by reality, despite some silly developments (mainly involving a mental institution). The relaxed Clint Eastwood chimes in with a wonderfully touching performance. He simply chews up the material with great vigour. A terrific Sandra Locke has a screen presence that's equally as dominating in the role of the stuck-up, cold-blooded high-end dame. Eastwood regular Geoffrey Lewis' oddball greedy turn was marvellously madcap. The performances of Sam Bottoms, Dan Vadis, Sierra Pecheur and Bill McKinney are pleasurably sincere as Eastwood's ragtag team.<br><br>If there's one Eastwood film that's unfairly lampooned. \"Bronco Billy\" gets my vote. This gratifying show must go on.","user":"lost-in-limbo","rank":[18,20]}]