[{"title":"PROPAGANDA-EFFECTIVE DRAMA","rating":8,"date":"18 June 1999","review":"Most articles on this film tend to overlook the intrinsic qualities of the film as film, though of course these are connected with the propaganda aspect. The opening scenes (the board meeting and subsequent meeting) are strong and the key to the propaganda: in a very short time it is effectively made clear what the point of view of this film is and what follows is an entertaining and propaganda-effective film. From the moment we are on the ship until the collision the film is drama routine, but one of the better sort. Really exiting is the film from collision till sinking, i.e. when the real drama emerges and the splendid special effects do their jobs; not one aspect of the outlined drama is forgotten, it is fast-paced and very well directed.<br><br>Of the cast it is Sybille Schmitz who excels, while other members also do a very good job; they must have done so otherwise the whole propaganda aspect would not have come across. There is one exception here: it seems that Hans Neilsen (playing the German officer) is very good, but he is not. It is often said that he speaks his lines as a Wehrmacht officer on duty, but for me his machine gun like delivered lines sound more like the staccato of the regular commentator of the Deutsche Wochenschau (compare this, when you have the possibility).<br><br>Though this film is obviously anti-British, it is rather anti English capitalist establishment and their decadence than anti-British per se *; an anti-capitalism not so much based on (to generalize) theoretical arguments, but (as most of fascist ideas) on the petty bourgeois middle class mentality and jealousy towards others who are better off. The crux for this is in the strong opening: it is here when Ismay remarks that he cannot take into account the interests of the small investors, they must bend to his need and of course greed. As such the focus of the propaganda is established; on the ship we meet very wealthy people playing with money (e.g. the gamblers) and people preferring money above people (Lord Astor, well played by Schönbock), these being decorum for the propaganda and an elaboration of the already established focus. Money (large sums bidden for almost everything) plays the major part in this film (it should have received first credit). Lord Astor even worries about stolen jewelry while the ship is sinking: money makes decadent. Compare for instance the cynic way of life upper deck and the more natural and spontaneous life lower deck.<br><br>[* Noteworthy is that after its re-release in 1950 it was quickly banned again in the Western zones, while in the Soviet zone it was screened without a problem; the anti-capitalism might have done the trick.]<br><br>The pro-German aspect and the answer to everything is German officer Petersen. He not almost single handedly saves a part of the passengers, he also shows the right spirit when it comes to human feelings. Only when the Baltic countess says she has no money anymore, he gives room for his feelings towards her; what a fine chap, he is! And it is from that point on that she does her duty as a human being and starts helping out with the rescue: money makes cynic.<br><br>There is also a hint of Durchhaltefilm here. Take for instance that schematic and ideological German rural couple; not a couple of flesh and blood, they seem to have walked straight out of a Nazi rural painting. Men and women are separated for the rescue, but this couple stays together: in an almost religious shot they hold hands expressing that nothing can separate them. They are separated by force of the panic, but reconciled again in the end. No catastrophe can undermine the simple German life.<br><br>This Titanic has its influence on film history as well. It has been ripped off at least twice, first in 1958 for A Night to Remember (a story widely known) and recently by James Cameron who for his Titanic but boring endeavour stole quite some story ideas and complete scenes; check this when you have the opportunity.<br><br>It is often written that this film was not released in Germany cause of the death (suicide, murder?) of its first director Selpin. Wetzel &amp; Hagemann in their survey of censorship in Nazi Germany (book, 1978) claim that this is not so. It had its unnoticed premiere in 1943 in unimportant cinemas, only to be banned in December 1944 for the well-known reason: the audience was not to be confronted with catastrophes.<br><br>Beware which version you see; as I understand it there are 2 versions. The longer one (the one I saw) includes a final scene in court; Petersen is the German J'accuse of Bruce Ismay, but there appears to be no British justice.","user":"J. Steed","rank":[38,44]},{"title":"A Dramatic, Effective Telling of the Titanic Story - From Nazi Germany","rating":8,"date":"20 July 2004","review":"It's not that common in movie history that a director angers the producer/distributor of his movie so much that the latter has the former murdered.  That's what happened to co-director Herbert Selpin in 1942 before the release of Germany's film contribution to the Titanic saga.  Dr. Josef Goebbels, Hitler's propaganda minister and self-anointed arbiter of culture in the Third Reich, had the Gestapo arrest Selpin who was reported dead in his cell the day after.  Suicide?  Ridiculous.<br><br>The Titanic story has been told many times on film, both as documentary and as drama.  Interest currently appears to intensify with the same speed as the over-visited wreck rapidly succumbs to a final ballet of disintegration.<br><br>Years ago The Film Society of Lincoln Center ran a retrospective of movies produced during the Third Reich.  For most attendees it was a revelation, and a disturbing one at that.  Many are familiar with the late Leni Reifenstahl's documentary paean to the Olympics (propaganda aside, one of the greatest films of that genre) and the odious \"Jude Suss\" is the iconographic movie symbolism of Nazi antisemitism. Few were aware how much genuine creativity, free of obvious dogmatism, emerged from that twelve-year period of German darkness and depravity. The retrospective made many think about the complexity of life in 1933-1945 Germany.<br><br>One of the films I saw was the 1943 \"Titanic\" which had a small premiere followed by an order from Goebbels pulling the movie.  Ostensibly, Germans were not to be exposed to seeing the panic on the great liner as it foundered (actually most Germans, especially those in urban areas, had more visible frequent reasons to panic by 1943.<br><br>Selpin (with co-director Werner Klingler) turned out a sumptuous, ornate and dramatically compelling movie.  Largely using the known facts, \"Titanic\" tells the well worn tale of a ship driven to unreasonable and dangerous speeds in order to set a record.  There are some significant deviations. Here, the English first officer - seized with some malady - is replaced by a German seaman named Petersen, a model of experience and rectitude.  J. Bruce Ismay, whose social life was justifiably ruined because of his escaping the sinking behemoth, is unrealistically portrayed as a grasping cad whose crudity was not found in the self-absorbed, rich and supinely confident real shipping magnate.  The vessel's master, Captain Smith, is overly subservient to Ismay but he responds well to the disaster.<br><br>This movie wasn't made on the cheap.  Given the deteriorating wartime situation, a lot of marks were expended for terrific sets and fine attire. <br><br>\nThere's no real Nazi propaganda.  The movie ends with a comment that English greed occasioned the loss of so many lives but very many books and articles from Old Blighty and the U.S. echo that view.<br><br>Because of its anti-British utterances, the Allies banned the movie in their sectors in Germany at first while it was freely available in the Soviet zone.  Hardly a surprise-that movie maven, Stalin, probably loved this capitalist-bashing film.<br><br>KINO VIDEO has performed a real service by releasing the film on DVD.  There are two versions-this release is the shorter one without the trial scene in which survivor Petersen rails against the British in court.  Actually the movie is stronger for that omission.  After she goes down, what else is there really to say?<br><br>There are some interesting special features on the disc including an early commercial short made by the White Star Line showing the amenities of RMS Olympic, another luxury liner built before Titanic (technically, Olympic wasn't a sister ship of its more famous and briefly triumphant successor but the differences aren't important).<br><br>This is an important release for Titanic buffs but also for those interested in film-making in Nazi Germany.  There were movies made that deserve current viewing for reasons apart from their historic association with a barbaric regime.<br><br>7/10","user":"lawprof","rank":[48,59]},{"title":"A film that should be seen before it's judged.","rating":8,"date":"8 May 2002","review":"Too many just dismiss this film outright as Nazi propaganda, and don't examine the film as a film.  Certainly when compared to the 1953 Hollywood TITANIC it's a far better made and less sappy piece of drama. And if it has a lot to be desired as history -- well then so did the Hollywood film. The performances, direction, and special effects are all excellent for the time. In fact, it's very surprising that the German film industry was able to mount such a first class production as this in the midst of the war.<br><br>Which brings me around to the propaganda aspect of the film: to my mind it's been very much over stated in accounts on the film that I've read. Apparently, the most vicious part of the film's propaganda content, a trial scene and end title which condemned Britain as a country driven by greed, have been omitted from all current prints.  Still, were it the \"Hate the British\" film it's often dismissed as, it's truly amazing to see the propaganda aspects in the film that are missed.  The Third Class are never shown being locked below decks as the ship sinks (indeed, when the ship's engines stop, they march up to First Class to demand an explanation from the Captain), and the crew and officers to a man are shown being skilled, efficient, and brave.  How could the Nazi's miss so many easy targets, and ones that have been included in almost every Titanic film to this day? And while it is true that Bruce Ismay is turned into a first class villain, driving his ship without regard for safety straight into the iceberg -- it's also been that way in every other Titanic film in which he's been portrayed (for example, the recent TV mini-series TITANIC -- which shows Ismay down in the boiler room screaming at the stokers to make the ship go faster -- like that really happened!).  It's all just a question of degree.  And if the film portrays the rich millionaires like John Jacob Astor as people who will use money, class, and power to achieve anything -- well, it's no worse than some of the stories -- printed amid all the bravery and self-sacrifice slop -- that appeared in 1912 newspapers.  Remember, after the disaster Ismay and the White Star Line were acquitted, people were led to believe all the First Class men died bravely, Captain Smith was blamed for everything, and the poor souls who lost everything when the ship went down never got a penny in restitution.  Thus, in the end, considering all the un-truths and legends that have sprung up around the Titanic story, I believe this film plays a lot less like a Nazi film and more like an anti-capitalist one.  Little wonder it played in East Germany after the war with no problem.  There's certainly enough \"Hate the Rich\" sentiment here to have warmed Stalin's heart.<br><br>So, to me anyway, it's almost refreshing to see a Titanic film that treats the whole affair as the monument to stupidity that it was.  Since it has nothing to do with history, one must examine it as the first example of film makers trying to come to grips with the \"Titanic Legend\". (One could also award that place to the 1929 British film ATLANTIC -- but for some unknown reason that film tried to pretend it was fiction.)  Looked at from that prospective, it's a fascinating piece of film making (and history) that deserves to be seen without the vicious \"Nazi film\" tag hanging over it. Certainly James Cameron must have seen a lot to admire in it; why else would he have copied shots and plot ideas un-masse.  (He also coped shots and dialogue from every other Titanic film ever made.) Thankfully, he didn't copy the film's greatest (abet fictional) moment: wireless operator Phillips releasing his pet canary into the night as \"Nearer My God to Thee\" plays in the background.  Did director Herbert Selpin crib this bit from von Stroheim's GREED?  We'll never know, as it's said he was murdered by the Nazi's before the film was completed.  So much for the benefits of creating a \"Nazi film\".","user":"jef29bow","rank":[38,50]}]