[{"title":"The real bullettime","rating":9,"date":"9 June 2003","review":"It says much about current cinema that this vintage slice of Hollywood is now considered too long and too slow by the modern generation of movie goers.  Howard Hawks labours to create setting, mood and pace introducing genuine characters are colourful for the flaws they have as their positive points presenting heroes one can empathise with, people with three dimensions, not thin caricatures that popular many of today's movies.<br><br>No character empathises this more than Dean Martin's broken down drunk Dude. Nicknamed \"Borachon\" by the Mexicans (Borachon is Spanish for \"Drunkard\") Dude battles with the demons that drove him to drink as he desperately tried not to let down Sheriff Chance, John Wayne, who believes in him more than he believes in himself.  Dude's pouring back of a glass of bourbon into the bottle is one of the most life affirming scenes ever committed to film.<br><br>Wayne never really does anything other than play John Wayne and Hawks spins on this playing with the ethos of the man.  The same steadfast values that mean Wayne's Sheriff John T. Chance will not release the prisoner Joe Burdette back to his murderous gang leave him stiff and awkward in front of Angie Dickinson's love interest \"Feathers\" creating perhaps the quintessential John Wayne movie in which the Jules Furthman and Leigh Brackett's screenplay explores the depths of the ideals that Wayne stands for.  This is a movie about not just about redemption, but about the reasons for a tough redemption in a World in which collapse and lawlessness are easier options.<br><br>And when Dude pours his Bourbon back, affirming that even though he cannot be the man he was but he can still be a good man, you will not be wishing it was film in bullettime.","user":"michaelwood","rank":[67,84]},{"title":"A beautifully controlled Western with a great score","rating":9,"date":"30 July 2001","review":"For many, Hawks' 'Rio Bravo' is the perfect Western... For me it is the antithesis of 'High Noon,' and the clearest exposition of Hawks' philosophy of professionalism... His tough lawman solves his own problem without going out looking for help... So he welcomes volunteers and in fact depends on them... What is more, he wins by displaying superior skills and quicker wits...<br><br>The survivors in Hawks' philosophy are the ones who conduct themselves with the greatest degree of coolness and discipline... It is not difficult to appreciate why Hawks has used substantially the 'Rio Bravo' plot, with only minor variations in both his subsequent Westerns, 'El Dorado' and 'Rio Lobo.'<br><br>In Fred Zinneman's 'High Noon,' Gary Cooper struggles to round up a posse that might help him deal with four desperadoes arriving on a noon train to kill him... In \"Rio Bravo,\" John Wayne is faced with a similar situation but takes on the forces of evil in the shape of a gang of local tyrants... <br><br>Wayne always makes us feel that somehow he'll cope... So when the wagon master Ward Bond asks him if he wants to use any of his men as deputies in fighting Burdette's men, he turns down the offer... Wayne, holding a brutish prisoner Joe Burdette (Claude Akins) on a murder charge, waits for the U.S. marshal to take charge of him... But the prisoner's powerful brother Nathan (John Russell) wants him free and is determined to release him by any method possible...<br><br>The obvious method is the traditional onehired gunmenand, in effect, the sheriff becomes a prisoner himself, in his own town But in this instance the lawman is not absolutely without help... The two deputies are a semi-crippled veteran (Walter Brennan) and a pretty hopeless drunk with a past 'fast' reputation (Dean Martin). <br><br>But the whole point about this cleverly conceived movie is that this unlikely trio do in fact have something to offer when the cards are dealt... Like the sheriff, they're professional people, and what Hawks seems to be saying is that whatever the odds, such people will always have the courage, and the deeds... This is demonstrated in one inspired sequence which has become a classic: Dean Martin  drying out and eager to win back his self-respect  tells Chance that he wants to be the one who chase the killer into a saloon, and that Chance should assume the less dangerous role of backing him up from the back door...<br><br>'Rio Bravo' is a beautifully controlled film... John Wayne, who re-created and heightened the mythology of the West, is at his best...<br><br>John Ford imitates Howard Hawks' tendency for having his male characters never back down from a fight even when it means they are initiating the fight themselves... In Rio Bravo's famous wordless opening, villain Claude Akins throws a silver dollar into a spittoon, daring Dude, so desperate for a drink, to humiliate himself, and get the coin... Hawks' clever camera emphasizes how far beneath the standards Dude has fallen... Now Wayne is ready to confront Akins...<br><br>The same scene in Ford's 'The Man Who Shot Liberty Valance.' Lee Marvin trips unarmed James Stewart as he carries a steak dinner to Wayne in the restaurant where he works... He stumbles and the steak falls to the ground... Stewart has been obviously humiliated... Suddenly Wayne enters the frame, and orders Valance to peak up 'his' steak, revealing his gun belt as he faces him... He is ready for the showdown...<br><br>In 'Rio Bravo,' Hawks' men win out primarily because they fight together... But Hawks helps them by having the outlaws mistakenly play a Mexican tune called 'cutthroat,' a song which Santa Anna tried to intimidate the Texans under siege in the Alamo... As the music plays, we see Dude putting down his glass untouched... He observes that his hands no longer shake...<br><br>In Hawks' 'Rio Bravo' there is tenderness, and humor... In Hawks' film, a man is defined by how well he relates to women, how well he handles pressure and how he reacts to danger... Angie Dickinson playing the gambling gal, enriches the mixture with a nicely judged performance... <br><br>'Rio Bravo' is an action Western, which captures a legendary West that fits the legendary talents of Wayne and Hawks... But what makes the film so special is the relationship between the individual characters... It is a traditional, straightforward Western, good-humored and exciting, rich in original touches...<br><br>The best moment of the film when Martin and Nelson join each other for some singing and guitar picking, and Walter Brennan joins in with his harmonica and his scratchy voice... The film has a terrific score by one of the great film composers Dimitri Tiomkin...","user":"Nazi_Fighter_David","rank":[61,78]},{"title":"Hawks' last masterpiece","rating":10,"date":"16 April 1999","review":"Disregarded at the time of its release, and still underrated by many critics, Rio Bavo is finally coming into its own as a masterpiece. One reason that it has been underrated is that,it does not seem a typical western for the fifties. Most of the great westerns of the period were darker and moodier. Witness for example, the great films of Boetticher and Anthony Mann, or-the supreme example-The Searchers.Others were 'revisionist' and often sought to convey a socially conscious \"teaching'- High Noon is the paradigm here. In contrast, Rio Bravo is unashamedly reactionary. Hawks actually claimed to have made the film as a reply to High Noon..In addition, there are very few pyschological or moral ambiguities here. Instead, we get a classic Hawksian scenario, also found in Only Angels Have Wings and To Have and Have Not. . in which a groups of misfits and outsiders bands together to defeat  evil. Here we have John Wayne- offering a performance of considerable subtlety and self knowledge- as the valiant, yet limited, patriarchal hero, John T. Chance. To save the day, he calls on a cast of standard Western characters:The old-timer( Brennan), the reformed drunk( Martin), The \"kid'( Nelson), and the \"hooker with a heart of gold( Dickinson).Thanks to Hawks' assured, efficient, direction,All of these actors transcend the stereotypes usually associated with such characters to deliver fine performances which are simultaneously \"realistic' and archtypal. Particularly worthy of notice is Dean Martin. John Carpenter once claimed that the scene of Martin's \"redemption\" was the greatest moment in all of cinema. That may be an exaggeration, but Carpenter has a point. It is both moving and unforgettable.In short, Rio Bravo is a triumph for Howard Hawks and his seemingly artless art.","user":"coop-16","rank":[102,135]}]