[{"title":"Bond goes East.","rating":8,"date":"19 September 2009","review":"This particular 007 entry (which was intended to be Sean Connery's last before he would agreed to return one more time for his sixth shot as 006 in 'Diamonds are Forever (1971)' and lets not the forget the unofficial 'Never Say Never Again' in 1983) was the first Bond film I encountered and from that it has always remained a total favourite. \"You Live Only Twice\" we see Bond travel to the land of the rising sun (Japan) in what is quite an expansive concept (dazzling set-designs with spectacular non-stop action) and very well-budgeted effort that lingers on a extremely comic-book-like tone (thanks largely to Roald Dahl's industriously well-guided screenplay that plays its cards close to the chest) with its characters, atmospherics and set-pieces that for me would make it one of the most creative and exciting inclusions to the series.<br><br>Bond heads to Japan racing to uncover the true mastermind behind the space-jacking that could see another world war, as British sources believe that the mysterious rocket ship which has seized American and Russian space shuttles originates from there, but those countries believe otherwise than each other for the acts.<br><br>Couple of things which made it more the memorable would be that it's the first chance we get to see arch villain SPECTRE Agent #1 Ernst Blofeld's face, than just the hand stroking the cat although the first hour we get enough of that. It's a devilishly meaty Donald Pleasence who just seemed the part of Blofeld. Now who didn't love the hidden lair that was in an inactive volcano, and of course Blofeld's pool of pet piranhas. The inventive gadget novelty was really making a mark, just look the deadly mini-copter named 'Nelly' and the dangerous effects of smoking around others. Strangely enough the (witty) script seemed to spit out a few self-knowing quips involving cigarettes, which became rather odd. Director Lewis Gilbert (who would go on to control the very similar in story-structure \"The Spy Who Loved Me\" and then following that the plain goofy \"Moonraker\") does a tersely capable job with a fast moving pace that shifted from one well organized set-piece to another (like the chase on-top of a rooftop in a fishing docks that's masterfully captured by cinematographer Freddie Young) to finally finish on a barnstorming climax (with none other than ninjas) and then a familiarly fitting final frame. Sean Connery might look a little tired (a bit funny trying to make himself look like Japanese under make-up), but remains just as charismatic and fittingly lean when it came to getting down and dirty (Bond and his tussle with Blofeld's massive henchman Hans comes to mind). The bond girls shape up nicely in the form of Akiko Wakabayashi, Mie Hama and the stunning German redhead Karin Dor. Tetsurô Tanba was good as Bond's Japanese counterpart. Bernard Lee, Lois Maxwell and Desmond Llewelyn treat us to their iconic roles. John Barry's classy music score has a smoothly oriental touch, which can get actively copious when called for and theme song \"You Only Live Twice\" is enticingly sung by Nancy Sinatra.","user":"lost-in-limbo","rank":[37,42]},{"title":"Old school Bond, but still one of the most fun Bond movies.","rating":8,"date":"8 June 2007","review":"My Take: Another fun Bond entry. Great Bond, fun villains, neat gadgets, and enjoyable action. <br><br>\"You Only Live Twice\" is business as usual for Bond. Not much new, and Connery seemed bored playing his role (explaining his disappearance in \"On Her Majesty's Secret Service\"). There is a lot to like in this film. Connery in \"You Only Live Twice\" is easily comparable to FROM Russia WITH LOVE and GOLDFINGER, but as Bond, he already has established that he is the best in the business and YOU ONLY LIVE TWICE does give him much to do. <br><br>This film does carry the original tradition of Bond. This time around, Bond is sent to Japan to investigate the disappearances of American space shuttles. While the United States suspect it's Russian interference and threaten to retaliate, the Brits faked 007's assassination, in order to clear the way for Bond to investigate what really is going on.<br><br>Some areas of YOLT are pretty campy (some of the patterns for the AUSTIN POWERS parodies are pretty evident), but the camp is part of the fun. It's a throwback to the good ol' not-to-be-taken-seriously adventure espionage fun. This is formula Bond, but loaded with great action, neat gadgetry (\"Little Nellie\" is one of the most beloved Q gadgets) and the glorious sets by the one-and-only Bond veteran Ken Adam make it another high-flying, if not exactly groundbreaking, Bond adventure and one of he series' more fun entries. <br><br>Rating: **** out of 5.","user":"vip_ebriega","rank":[26,29]},{"title":"Bond-san, Blofeld, Asian Delights and Production Value Supreme.","rating":8,"date":"1 May 2012","review":"You Only Live Twice is directed by Lewis Gilbert and written by Roald Dahl. It stars Sean Connery, Tetsuro Tamba, Teru Shimada, Akiko Wakabayashi, Mie Hama, Karin Dor and Donald Pleasence. Music is scored by John Barry and cinematography by Freddie Young.<br><br>Bond 5 and Connery once again tackles the role of 007. With American and Soviet space craft mysteriously vanishing from space, both nations are laying the blame at the other's door. Sensing a nuclear war could break out, M assigns Bond to Japan to investigate if there might be a third party stirring the hornets nest. Teaming up with the Japanese secret service, Bond uncovers evidence that SPECTRE is behind the plot to pitch the East and the West against each other.<br><br>This organisation does not tolerate failure.<br><br>Thunderball had broke box office records for Bond, gadgetry, outlandish stunts and a quip on the tongue had proved most profitable. It was planned originally that On Her Majesty's Secret Service would be number 5 in the series, but a change of tack to go for You Only Live Twice as the story gave producers Broccoli &amp; Saltzman the scope for a giganticus enormous production. However, it may be set in Japan and feature a Bond/Blofeld conflict, but Roald Dahl's script bares little resemblance to Ian Fleming's source novel. Although a massive financial success with a Worldwide gross of over $111 million, Bond 5 took $30 million less than Thunderball. Strange since this is a better film. Can we attribute the drop to it being a space age saga? Maybe, the rebirth of sci-fi was a few years away, and of course Bond had lost some fans who had grown tired, like Connery, of 007 relying on gadgets instead of brains and brawn to complete his missions. There was also the rival Casino Royale production, as bad as it was, to contend with, while the spy boom created by Bond had been overkilled elsewhere and was on the wane.<br><br>Extortion is my business. Go away and think it over, gentlemen. I'm busy. <br><br>True enough that You Only Live Twice has flaws, though they are far from being film killers if you like the gadgets and hi-techery side of the franchise? Connery announced once production was over that he was leaving the role of Bond behind. He had been close to breaking point after Thunderball, but finally the media circus, typecasting, the fanaticism and the character merely being a cypher for outrageous sequences, led Connery to finally call it a day. His displeasure shows in performance, oh it's professional, very much so, but the swagger and machismo from the earlier films has gone. Although Dahl's script tones down the \"cheese\" dialogue and unfolds as a plot of considerable World peril worth, characterisations are thinly drawn, making this reliant on production value and action sequences. Thankfully both are top dollar. And the ace up its sleeve is the long awaited face to face meeting of Bond and Blofeld.<br><br>The firing power inside my crater is enough to annihilate a small army. You can watch it all on TV. It's the last program you're likely to see.<br><br>Ken Adam's set design is fit to grace any epic in film history, as is Freddie Young's photography around the Japanese locales, Barry lays a beautiful Bond/Oriental score all over proceedings and Nancy Sinatra's title song is appealingly catchy. The action is excellently constructed by Gilbert (helming the first of three Bond movies on his CV), with the final battle at Blofeld's volcano crater base full of explosions, flying stunt men, expert choreography and meaty fights. Along the way we have been treated to Ninjas, Piranhas, poison, aeroplane peril and the awesome Little Nellie versus the big boy copter smack down! Then there's that Bond/Blofeld confrontation. Well worth the wait, with Pleasence visually scary with bald head (setting the marker for bald villainy to follow in TV and cinema it seems) and scar across his eye. Pleasence is also very low key with his menace, which is perfect, we don't want pantomime and the scenes with Bond work wonderfully well.<br><br>It made less than the film before it and it has fierce critics in Bond and Fleming circles. But it's a Bond film that pays rich rewards on revisits, where the artistry on show really shines through in this HD/Upscale age. 8/10","user":"hitchcockthelegend","rank":[30,35]}]