[{"title":"a great little gem","rating":10,"date":"8 February 2005","review":"I found this movie to be excellent. I think it did not find an audience because of its dark tone. It explores the concept of death in a unique way for a western. The light comedy interspersed was a nice relief. Definitely worth watching for any western fans. Glenn Ford was magnificent. Jack Lemmon, while showing his flair for comedy, was subtly profound. The movie itself is profound in a subtle way. We can relate to Lemmon's character easily-stuck in a boring job and wishing for something more. Finding something more however, doesn't bring the joy he thought it would. He changes and grows;his relationship with Ford is terrific. This is not a western that glorifies the life of the cowboy. Rather, you see the grim, hard life that tries to suck the sweetness of man out of him.","user":"wamsies","rank":[38,41]},{"title":"A Good Realistic Western","rating":9,"date":"20 June 2005","review":"As one of the other reviewers pointed out, this whole film is based on a few lines of an autobiography where the protagonist Frank Harris joins a group of cattle RUSTLERS for a spell. So in fact that as tough as Glenn Ford and his crew are, at least they're on the right side of the law. <br><br>Also Frank Harris is probably best known for the first definitive life of Oscar Wilde. And Harris like Wilde was born in Ireland. Might have been nice if Jack Lemmon had played him with a brogue.<br><br>Another reviewer pointed out that Jack Lemmon did not fit into the western film. True enough, but in fact this is the story of a tenderfoot who goes on a cattle drive and has quite the adventure. <br><br>Still and all Cowboy is a pretty good realistic western about life on a cattle drive. These drovers aren't any kind of heroic, but they do the job that has to be done. Jack Lemmon's ideas about cowboys are taken from the dime novels of the period. He gets rid of his romantic notions, but fast.<br><br>Among the supporting cast Brian Donlevy comes off best as the world weary former town marshal who joins the drive to get away from his job and meets a tragic end. <br><br>Cowboy came out in 1958 which was the height of Glenn Ford's career. Ford did some of the best westerns of the 1950s and Cowboy ranks right up there.","user":"bkoganbing","rank":[23,25]},{"title":"One of the best westerns ever","rating":4,"date":"4 July 2002","review":"I think that this is one of Glenn Ford's best performances.  He plays against type cast as a tough rancher with not much heart.  Jack Lemmon provides the heart for the film.  The film is realistic in it's portrayal of western life in the ninteenth century and is based on the Writer Frank Harris's real story.  Frank Harris was a hotel clerk who wanted to be a cowboy so bad that he gave his own money to buy a piece of the stock from Glen Ford's ranch with the condition that he could ride the trail.  Glen Ford loses his money gambling and has to take Harris(Lemmon's) deal in order to buy more cattle. Along the trail Lemmon finds the work hard and the men that he associates with harder.  Harris becomes tough but learns a lesson and in the end teaches something to Glen Ford along the way. The only problem with the dvd version is that it is in pan and scan format and it should be in wide screen as this is an epic western that needs the wide screen.  I recommend that the viewer who really wants to see this in widescreen request it on turner classic movies as that is the only place where you can see it that way. Enjoy this movie any way you can see it however.  It is like a good novel.","user":"rontaube","rank":[32,36]}]