[{"title":"I really liked this one--probably because I have always liked Richard Dix","rating":8,"date":"26 November 2008","review":"I don't know why, but I have always liked Richard Dix in films--even though many of his films were B-movies and he died relatively young (while filming the Whistler series). While not the greatest actor of his time, there was something likable about the guy and his acting seemed rather effortless. This film did nothing to hurt my predisposition towards him--rather it enhanced it greatly because he played such a gosh-darn swell guy.<br><br>The film begins with Dix in the role of a silent cowboy star much like Tom Mix. He was a hero to the kids and immensely popular. Yet, oddly, when the Talkies arrived, the studio tried casting him in contemporary dramas and the simple cowboy had a hard time adjusting. He was simply all wrong for the parts with his southern drawl and the studio \"brains\" thought that Westerns were dead. Feeling sorry for him being suddenly unable to find work, one director casts him in a gangster flick, but Dix refuses to complete it because the character was an evil coward and nothing like his old screen persona. His old fans meant too much for him to betray their trust.<br><br>Later, after the fan mail all but stopped, a kid who Dix had seen in the hospital years earlier arrived unexpectedly--having snuck cross country just to see his screen idol. The problem is that now Dix is broke and his name is nothing in Hollywood. However, not wanting to disappoint the scamp, Dix comes up with a great plan to pretend he still has his old ranch and is friends with all the big stars. This really is a tad hard to believe, but also very heart-warming and satisfying to watch. In particular, the twist at the end was great viewing. Probable? No, but really well worth seeing.<br><br>Aside from Dix's apparent effortless performance, another standout in the film was an incredibly radiant Fay Wray. While I must admit that I have NOT been kind to her performances in the past (since in too many films she only gets a chance to scream or faint--her acting opportunities were terrible), here she was great. Not only was she absolutely beautiful but she also did a great job playing in a variety of roles.<br><br>Overall, this is an exceptional B-movie. Despite a rather modest budget, it's highly entertaining old fashioned fun. Plus it's really worth seeing just to see the many acting doubles you see during the party scene. Also, in an interesting twist, Victor McLaglen's near-perfect double is actually his brother, Arthur--no wonder they looked so alike!!","user":"MartinHafer","rank":[18,18]},{"title":"We didn't need words...we had FACES!","rating":7,"date":"24 November 2008","review":"There haven't been many movies on the subject of THE most fascinating and terrifying era of Hollywood history - the chaotic and brutal transition from Silents to Talkies (that period ended WAY more Hollywood careers than the McCarthy blacklist era). The best known, of course, are \"Singin' In The Rain\" (the most complete treatment of the subject, and DAZZLINGLY funny), and \"Sunset Blvd\" (oh-so-dark, and with razor-sharp teeth), and they were both 20+ years after the fact. Here's one that's less than 10 years removed, when the wounds of the victims were still pretty fresh and oozing, and it's flawed but TERRIBLY fascinating in that light. This page categorizes it as COMEDY, but I didn't detect any (intentional) laughs, except perhaps in the bizarre (and tacked-on-feeling) party sequence near the end featuring actual stand-ins for many major stars of the day. One suspects that Dix played a major role in bringing this story to the screen, and that it might have represented his own story (his thinly-fictionalized character fails to make the switch to talkies because of a mild drawl, and because, supposedly, Westerns are finished due to the inability to take the new technology outdoors). As I studied his filmography on this site, I'm seeing that he was never unemployed during that era, but that he DID go from making 5 or 6 films a year in the mid-'20s to 1 or 2 a year in the early thirties, so I guess that might have been a sufficient jolt to his lifestyle to embitter him a bit. REALLY interesting stuff, and Fay Wray is GORGEOUS and memorable (as always). Absolutely recommendable to any Hollywood history buff.","user":"TheKingOfLasVegas","rank":[20,21]},{"title":"Light-Hearted and Sentimenal Story about the Advent of Sound in Films","rating":7,"date":"4 February 2010","review":"This is a most enjoyable film which is of particular interest to film buffs for several reasons. The story commences in 1928, the last year of silent films. The amiable actor Richard Dix plays Tim Dart, a star of silent cowboy films (an idea doubtless inspired by Tom Mix). He is in love with another silent star named Gloria Gay, played by Fay Wray, who is glamorous and alluring but loves her cowboy, and wishes he would take more notice of her. (Who could ignore Fay Wray and be unaware of her devotion? But then cowboys can be ornery critters.) All is going well otherwise, and they are both close friends and top of the bill with their respective successful careers. Dix has nationwide fan clubs of young boys who worship him, and we see him whistle-stopping all over America and giving personal appearances at schools and boys' clubs. Suddenly his tour is interrupted by a telegram summoning him back to Hollywood for a 'talking test'. All the silent stars are being tested on the new sound stages for their ability to speak, which had never previously been necessary. (We need to remember that this film was made only 8 or 9 years after this painful transition, when it was all a fresh trauma in everyone's minds.) Dix is not able to deliver his lines properly, and is upset that he has to wear formal attire and pretend to be in a drawing room where the dialogue is absurd. He flunks the test and is jettisoned by his studio, while Fay Wray is retained. With the advent of sound, cowboy films were discontinued for the first few years because the clunky sound equipment could not be used outdoors! So 'we are only shooting plays now and everything must take place indoors,' he is told by the studio head. Exit the cowboy stars. Dix is forced to sell his huge ranch which he had wanted to turn into a giant boys' home, and moves into a small bungalow, completely broke. He avoids Fay Wray because she is still successful and he does not want to be a burden on her. This is an interesting historical dramatisation of the effects of the 'sound revolution' in films, made near enough to the time to ring true and be convincing. Indeed, despite being keenly interested in film history, I had never realized prior to seeing this film that 'outdoors was out' at the beginning of sound, and that cowboy films were a temporary casualty, until the clumsiness of the sound gear could be reduced. I had never actually seen or heard that mentioned before, and it is a detail which has escaped most people of today. A young boy who hero-worshipped Dix turns up on his doorstep and persuades him not to leave Los Angeles. The boy had been near death in a hospital when they met on Dix's tour, and it was only belief in the fact that Dix cared about him which had pulled the boy through. Touched by this intense and total devotion, Dix regains some faith in himself and decides to 'borrow' his old ranch for a day and throw a big party for the boy, so that he can meet all the other famous Hollywood stars, and still believe that Dix is one himself. At this point, the film contains one of the most remarkable and innovative scenes in films of that time: the party indeed occurs and the famous stars are impersonated by their professional imitators and stand-ins. Some are so convincing that one wonders if they are actually 'real' and came along to pretend to be their own imitators for a lark. Certainly 'Mae West' is an imitator, as she sashays too violently and does not look quite right. W. C. Fields seems to be an imitator, but Charlie Chaplin looks eerily 'real', and so does Harold Lloyd in the background. 'Greta Garbo' appears and tells the boy she has to leave now because she wants to be alone. This is a truly bizarre and surrealistic part of the film, and it is worth watching the film just to see the party full of doubles. Eventually Dix realizes that Fay Wray has also lost her place at the top, and all the talk in the trade papers about her thriving career is just pretence created by her publicist to try to get her back into pictures. So they come together again and express their true love at last. But that is not the end of the film. What will happen to them? Will their careers revive, or will they go to live on a ranch as cowboy and cowgirl? What will happen to the boy? Is there to be a happily-ever-after, or will it all be a bit of a downer? This cannot be revealed, but it is all there in the film for those who have an interest in this kind of thing and are lucky enough to get hold of a copy or see it on TV.","user":"robert-temple-1","rank":[12,12]}]