[{"title":"Take it from a real submariner-","rating":10,"date":"7 July 2000","review":"on modern \"boats\" life isn't easy- but compared to the living hell that the German U-Boats were, modern submariners have nothing to complain about. People in certain professions don't like to watch movies about those professions (Doctors and Nurses shy away from hospital dramas, for example). Submarine sailors are different. We love to watch every submarine movie ever made, from \"Run Silent, Run Deep\" and \"Destination: Tokyo\" to \"The Hunt For Red October\", \"Crimson Tide\" and \"U-571\". Why? Because we can always use a good laugh. For those in the know, submarine movies are usually absolutely hilarious. Except this one. After being in the Navy for four years, serving with around 350 different men, and being acquainted with a further 200-300, all of them submarine sailors, I think that I can state with absolute certainty that this film is the ONLY submarine movie that ALL submariners take seriously. And that is the highest praise a movie like this can possibly get.","user":"shmuey barak","rank":[1,1]},{"title":"15 years and I'm still thinking about it","rating":10,"date":"8 September 1999","review":"Das Boot is not just a great war film: it's a great film period. Maybe it is true that epic themes make the greatest novels and films.  Here is a movie that explores heroism, duty, patriotism, hope, fear and the futility of war--all grand themes--explored in the confined, and collapsing, spaces of a German u-boat.<br><br>I saw this film when I was a freshman in college during a weekend that I later dubbed my \"depressing movie festival.\" (The Wall and Apocalypse Now were the other weekend \"entries.\")  Of these films, it was Das Boot that haunted me--when I laid down at night, I saw Jurgen Proctow's pained blue eyes.  When I woke in the morning, I felt as if I were escaping through the hatch of the submarine.  I could not shake the images, and now some fifteen years later, I still remember how completely meaningless the movie made everything seem, and the nihilistic message stayed with me for a long, long time.  How few films are there which affect the viewers on this level.  To say this film is \"powerful\" seems so weak a description.<br><br>Part of the \"power\" of the film comes, I think, from a certain restraint in the direction.  So often, films which aspire to move the audience quickly fall into melodrama, over-acting, and overblown images.  Too much.  These often succeed in the immediate response (usually crying) but fail to impact the viewer on anything more than a surface level.  Here, it is the small moments which fill the screen.  Everywhere, all around is War, but for these men as we witness them, war does not begin with a capital \"W\".  It is reality, not a grand concept.  The director lets the story shock and horrify the audience, not by forcing it, but by letting the story just tell itself. Drama, tension and resolution occur naturally in Das Boot, which contributes to the very real impact of the film.<br><br>Story is a 10, direction is a 10, acting is a 10 and the cinematography is a 10.  One of the all-time greatest films.","user":"susy-7","rank":[653,680]},{"title":"Epic","rating":1,"date":"1 April 2005","review":"What impresses me the most about the film, as the title makes apparent, is that it's a German made film about a German U-boat. Patriotism for my own country would tend to make me hate the crew on this ship by definition (especially if portrayed as typical mindless killing machine Nazis), but these characters are so well developed and played like human-beings facing difficult decisions that I find myself sympathizing with these guys.<br><br>I love the flow and pacing of the Director's Cut; it takes its time, and does not feel like typical Hollywood formula \"first major plot point at minute 12\" cookie-cutter routine. Das Boot gives us plenty of time to know these characters, discover how they kill time while waiting for orders, how they feel about their job and each other. Then when the action finally starts: how they deal with the possibility of dying deep underwater, how they react to the sounds of a sub going deeper than it should, the look on their faces as a destroyer is heard pinging them, and dozens of little personality quirks--subtle details that bring the crew to life. It truly does feel like an epic about a submarine crew, and I'm interested in some day viewing the 6 hour TV version.<br><br>The underwater battles somewhat remind me of Sergio Leone in that Wolfgang Peterson takes forever and a day to get the fights started. Unlike Leone, once the torpedos are launched and the depth charges dropped, the cat-and-mouse game is ongoing and relentless, but never boring.<br><br>And despite the fact that most of the film takes place inside a cramped submarine, Das Boot is never boring to look at; in fact, it's a visually spectacular film (given the dated special effects, who hold up reasonably well and add to the old-school charm). And the freedom of the camera in those tight corridors came as an incredibly pleasant surprise. The color and composition of the shots in those tight quarters -- particularly upon approaching the first destroyer when we get the first real glimpse of the interior prepped for war -- it is both haunting and beautiful.<br><br>Jurgen Prochnow delivers the most believable performance of a ship captain I've ever seen on film. All the emotions register on his face--his concern for his own life, ship, and crew; his hatred for the decisions he's forced to make; the disbelieving joy of beating the overwhelming odds--while simultaneously holding it back so the crew sees a strong unmoving man forever in control of the situation. His performance is, in a word, brilliant.<br><br>The rest of the cast also delivers amazingly believable performances, and trust me, I could write an entire review on the film's characters and their portrayals. It's both disappointing and satisfying that I'm not given enough space to do so (I wish I could state that about a tenth of the films I've reviewed here on IMDb.) I liked the entire crew of this U-boat, the war correspondent and his character arc as he realizes the truth behind these \"heroes\", the chief and his longing to return to his wife, Johann and the story of his redemption--all well cast, well acted, and believable.<br><br>Another aspect I adored about Das Boot - the controversial scenes simply rolled by with no more or less emphasis than any other statement the film makes. In fact, I saw the film before really reading anything or researching it and found myself somewhat shocked to hear about these \"talked about\" scenes. Granted, the film does pose some moral questions, but I felt the film handled it with grace and great subtlety, showing what it needs to get the point across and not a step further . . . unlike typical Hollywood where controversy gets bold print, italics, and a highlighter. Maybe I should move to Germany.<br><br>I can go on for a long while: Over three hours of wonderful visuals and strong performances, a sparse but great score (this film's lack of music is quite appropriate, making the presence of music much more impactful in its key places). Realistic writing from people who lived the experience first hand. As I said, I can go on for awhile but I'll sum it up and end this review with one statement: Das Boot is the definitive submarine movie.","user":"jaywolfenstien","rank":[485,515]}]