[{"title":"haunting, understated, and extraordinary","rating":10,"date":"10 November 2003","review":"(I)<br><br>From the very first sequence, this is a starkly shot film with a very unique visual signature to everything you see. A desolate, exotic locale for a movie: the North African desert. But this desert setting is perfectly in accord with the refreshing cinematic technique of Michelangelo Antonioni, who always stressed economy. Just as in his other works, there are no unnecessary ornaments or frills here. He introduces us to the strange, existential story in this film, and its odd, solitary, lead character-- in as clean, pure, and undiluted terms as possible. The principle here is that 'less is more'.<br><br>Some people really dislike this about Antonioni. He uses his camera in such a quiet way; and there is just this single, very terse figure/ground relationship which is the focus of his attention. But I think he knows that character stands out with more relief when its set against a minimalist background. Here, because characterization is channeled through Jack Nicholson, (far better even than in 'Blow-up' with David Hemmings) its more than enough. The brevity and scarcity in the film funnels you straight into Nicholson's awesome talent. We are along with him for the ride.<br><br>\nThe plot starts out cryptically and simply, with very little explained about the man the camera spends so much time on. Jack Nicholson is a reporter named David Locke, and he is covering an African civil war. But beyond this, you must infer most everything else about him from just what you see-just by observing his behavior, and nothing else. There is scant dialogue of any kind. The depth of Nicholson's character is conveyed in miniscule components, parsed out after long intervals. His overall demeanor is weary, frustrated, sullen; the typical traveler who cant get good service. But he is also dispirited with his mission and in a way, despondent about his whole future and way of life.<br><br>Then suddenly, he sheds his persona and takes on someone elses'. He is staying in an isolated hotel and a man in the next room dies accidentally-and Nicholson decides to trade identities with the corpse; leaving the hotel with this new identity and letting everyone think it is he who has died. It's the personal reasons for this act, which Antonioni explores throughout the rest of the movie: the consequences and responsibilities incurred when you gamble upon coincidence and invest in random chance.<br><br>(II)<br><br>'Passenger' follows the progress of a man through a personal crisis; an identity transformation. The film is split with a Doppler-shift down the meridian of the identity theft Nicholson commits. His problems after this act consist of trying to make sure his ex-wife and employers continue to assume he is dead; and deciding how much of the false man's life and business to play at.<br><br>With the plot as its laid out this way, we might not ever really ever know the full reasons why Locke exchanged personality for that of another. But Antonioni adds some really clever flourishes: since Locke was a news journalist, the video interviews he conducted up to the point of his 'death' are available both to the people who begin to hunt him, and to us. We actually see more of Locke revealed in these flashbacks than we do in real-time. It adds just the right note. We get a better idea of the reasoning behind this bold act, why he casually gave up his whole history on a whim.<br><br>In his assignments up to this side trip to North Africa, we discern that Locke is dissatisfied with 'the rules' governing his profession. He is a talented observer, and wants to be a good reporter. But he finds all the news he gathers is in a way, pre-constrained by cultural filters. Its not raw enough, instead, its already been processed for him. In other words, he is never getting the real story; as long as he is a reporter, people frame their information for him as a reporter. As long as he is an Anglo, people treat him as an Anglo.<br><br>But after the identity-shedding transformation, he is free; and he has the time of his life. Returning to London, Locke amusedly begins playing the role of the dead man: keeping his engagements, carrying out business deals. Theres no accountability; he is pretending to be someone else. Only one thing: the dead man was an arms dealer and Nicholson is getting into deep trouble by masquerading this way. His philosophical pleasure may be cut short sooner than he expects. He doesnt see the trouble coming his way, but we do. Its a sort of combination of film noir and road-trip movie here; and it works.<br><br>(III)<br><br>Things begin to unravel. Shady customers start to dog his footsteps. Growing increasingly edgy, as he continues to follow the strange itinerary, Nicholson hooks up by coincidence with a young architecture student backpacking through Spain (well-played by petite, dusky, sensual Maria Schneider). They're an odd pair; but their joining forces makes one of a most intriguing screen romances of the period. She isn't given much to do in the screenplay, but makes a wonderful calming presence to the brittle Nicholson. Her character insists that Locke should, in all rationality, continue his journey--she is rigorous about principles. Locke acquiesces and he continues on, down along the coast of Spain towards Africa again, on his fool's errands, to meet his fate.<br><br>I wont expose any more of the plot. But I will say the final sequence of this movie is extremely startling and powerful. I had never even heard about it; in my opinion it should be talked about much, much more. Totally daring and innovative. Antonioni really shows what he can do here-you simply have to see it.<br><br>There are some flaws, yes: a few of Antonioni's flashbacks come off lame and awkward- too abrupt. They're really irksome. And there is a sloppy element in the final denoument, which I still cant understand: the drivers school vehicle. I yearn for the movie to be re-cut to remove these failings. But its still very satisfying as is.<br><br>\n(IV)<br><br>The bottom line here is that Nicholson has, in this film, a showcase for his talents like few other projects I have seen him in. This film was made in 1975, just a year after 'Chinatown' and the same year as his cameo in The Who's `Tommy' and his lead role in Milos Foreman's `One Flew Over the Cuckoo's Nest'. Jack is quite young, fit, and good-looking when he made this film. Its rewarding to remember him as he was then, before he both let himself go somewhat physically, and also began playing so many 'sick, horny focker' roles. This is one of the highlights of his entire life's work, imho. Easily as memorable as Jake Gittes or MacMurphy.<br><br>\nJack is careful to do a good job in this movie--perhaps at this point in his career, he was still worried about major goof-ups. Its definitely prior to the point where he began to 'coast'. It looks like he took this film seriously--and probably enjoyed it immensely. Anyway, what other actor do you know today that could walk away with a difficult role like this one; an actor who would be as supremely interesting to us (as Nicholson is, in many scenes in this film) doing not much of anything for long moments at a time?<br><br>\nI doubt even DeNiro could have succeeded--he would have played it too 'tough-guy' and added too much gesture. Its Nicholson's laconic, dry twang, his sardonic gestures and those bored, squinty, seen-it-all eyes, that makes it work. There is a world-weariness about him in this performance that is quite special. The weight of past experiences exudes strongly from him; and its just what Antonioni needed. This quality defined him for this role like no other contemporary actor of his time.<br><br>Anyway, in this flick, you know he is doomed but you aren't really sure how Antonioni is going to do it. Antonioni creates massive tension with that very economical, severe camera style and almost no music. There are many scenes where the only sounds are the background noises from the environment itself; you can practically see Nicholson's sweat, hear his breath, and feel his pulse. Nicholson, surely very aware of this tight focus on him, maintains a rigid grip on his character throughout the film.<br><br>\nHe isn't at all cocky--his special trait is his vulnerability. Nicholson always seems tough on the outside, but also as if he can still be hurt (as we see here, and in Chinatown as well). Its a vulnerability very like Bogart's in 'Casablanca'. In fact, if this film had been made in a previous generation, (as Gene Siskel once claimed) there would have been no there actor besides Bogart who could have even pulled it off. But no matter what: its great to see Nicholson on his own, competing with no other strong castmembers, just cruising along as a lone, insecure American among hostile and unfriendly foreigners.<br><br>His characterization is superbly restrained and un-showy; his gestures and expressions are as bland as possible; and there are no wildly quotable lines or speeches (any Nicholson fan should view this film for this reason alone). Anyway, by the end of the flick, you are positioned so closely alongside Nicholson--so wrapped up in his fate--that the brilliant, low-key finale can take you by surprise and it leaves a terrific poignancy.<br><br>\nIn short, there are many reasons to like this film. I heartily recommend it. Its easily the best movie I have seen in some time. Its essential for appreciating both Nicholson and Antonioni. I encourage you to rent this movie on VHS as I am sure you will relish it as well.","user":"whitecargo","rank":[150,176]},{"title":"One of the best Antonioni films","rating":10,"date":"27 September 2005","review":"Michelangelo Antonioni's films are very static, with a few dialogues. They describe boredom of bourgeois class, they're cold. Sometimes they're unbearable: either you like them or you don't.<br><br>\"Professione: reporter\", to me, belongs to the most interesting period of Antonioni's career (between the second half of the Sixties and the first of the Seventies). Because in these years the Italian director made his most accessible works: \"Blow Up\" (1966), \"Zabryskie point\" (1969) and \"Professione: reporter\" (\"The Passenger\", 1974). These films contain more action and more situations. They are neither more commercial nor more mainstream, but they talk about an adventure or a dream.<br><br>A journalist in North Africa switches the identity with a dead man who looks like him. He does this to escape from his life and for living a more interesting one. But he'll pay for his choice...<br><br>It's difficult to say, but this Antonioni movie (with his recurrent themes and -in a smaller way- times) has a lot of suspense, if I can say so. Once you begin to watch it, you can't give up. The funny thing is that nothing really big or special happens: sometimes it seems a road movie, sometimes it is a typical Antonioni analysis of the society. Jack Nicholson -how young he was at that time!- fills the film, his performance and his expressions are brilliant. It's also interesting the chemistry with Maria Schneider, the lady of \"The last tango in Paris\" -an actress who never got the fame and the recognition she deserved.<br><br>Cinematography is fantastic. But, above all, the big surprise of the film is the final shot: a 7-8 minutes take without cuts, absolute amazing. It's not describable, it's a must!","user":"michelerealini","rank":[58,66]},{"title":"Famous concluding shot worth the wait.","rating":9,"date":"7 August 2003","review":"Slow but well worth the time it takes to arrive at the shattering conclusion.  Watch it more than once as there are many small visual cues and tips that add both to the plot and theme.  Jack Nicholson is superb - and surprisingly low-key - as the jaded and detached reporter who switches identity with a dead man out of boredom more than anything else.  Maria Schneider is fine in a somewhat underwritten role.  The real stars however are Antonioni's restlessly roving camera and the sublime locations which include the Sahara desert, a cable-car, and that bewitching Gaudi rooftop in Barcelona.","user":"mercuryadonis","rank":[62,72]}]