[{"title":"Taught, suspenseful thriller","rating":8,"date":"30 May 2003","review":"This film has been knocked by many people saying that Orson Welles was forced to work within the strict confines of the Hollywood system. I have absolutely no problem with this. Welles is a master craftsman. He made great films, period. In an interview he said that the studio cut out \" a couple of reels\" that take place in South America at the beginning of the story that he felt was the best part of the movie. As a viewer I feel that the film is compact and taut. Adding more to it would not help(in my opinion). On the contrary, I think adding more might make the film sluggish. As it stands the film remains dark. You feel that evil is present. You are just not sure what is going to happen next.<br><br>The performances in this film are for the most part excellent. Edward G. Robinson is amazing. This could have been a cardboard thin good-guy part. Instead he turns the character of Wilson into a smart, cunning hero. He is self-assured not obsessed. He understands what most people in the town don't: Kindler is a monster who is capable of anything. To catch such a man you have to be several steps ahead of him. Also excellent is Konstantin Shayne as Meinike. You can see the fear and madness in his eyes as he repeats \"I am travelling for my health, I am travelling for my health...\" before going through customs. Make no mistake, this man is \"an obscenity that must be destroyed\" to quote Wilson. Just look at his scene with the photographer in South America. He is used to people following his orders. Welles is also very good as Kindler/Rankin. There are moments that you actually feel sympathy for him. His obsession with fixing the town clock is very significant. Here is a man who needs things to be precise and structured. He wants total control of his environment(a good example is how he treats his wife). Welles hints at this man's mania but keeps him human. Even though you want him to be caught, you can't help wondering if he'll get away. Loretta Young is unfortunately just average in this film. She has some good moments (especially in the final scene when she confronts Rankin/Kindler)but her hysterics are just too much. The scene where Wilson is showing her the Nazi atrocities is well played. She keeps a certain composure that works well.<br><br>Overall, a very well made thriller with top notch performances and solid direction by one of cinema's masters. I give it 8 clock towers out of 10.","user":"Alberto-7","rank":[109,122]},{"title":"I'm traveling for my health","rating":7,"date":"31 January 2005","review":"I picked up this movie, mostly because of the cover and the price ($4). I was happily surprised as to the quality of the movie.<br><br>The story takes place after the end of World War II. Edward G. Robinson plays a government official named Mr. Wilson. He is in charge of the Allied War Crime commission. He is looking for an elusive war criminal. His name is Franz Kindler (Orson Welles). He is suppose to be the one who came up with the Nazi plan of mass annihilation. There is no evidence, nor any photographs of Kindler. To find Franz, Wilson releases Kindler's assistant (Konrad). Konrad inadvertently leads Wilson to Harper, Connecticut. Kindler is hiding out at an all boys school as a professor named Charles Rankin. Konrad arrives on Charles' wedding day. He is getting married to the daughter of a liberal Supreme Court justice.<br><br>This movie is definitely film noir, in the lighting and the grittiness of the events. It is also quite evident that this movie was directed by Welles himself. If you have seen any one of his movies, you can see how he functions. The story is enjoyable, if not slightly predictable (especially if you have seen other film noir films or have listened to any golden age radio programs). Overall, it is nice to see Edward G. Robinson playing the good guy for a change. I also thought Billy House had a standout performance as Mr. Potter (the owner of the local general store). He provides most of the comedy relief. I highly recommend this movie for fans of Edward G. Robinson, Welles or the film noir genre.<br><br>-Celluloid Rehab","user":"CelluloidRehab","rank":[61,68]},{"title":"Good Thriller With Welles, Robinson, & More","rating":4,"date":"4 March 2005","review":"It's quite interesting to see two acting legends like Orson Welles and Edward G. Robinson working together, and with a cast that includes those two plus Loretta Young, along with an interesting story, \"The Stranger\" is a pretty good thriller.<br><br>Welles and Robinson play an interesting cat-and-mouse game in the search for a former Nazi who is hiding out in a peaceful Connecticut town. It's fair to point out, as others have done, that the dialogue at times leaves a little to be desired, but Welles and Robinson have more than enough ability to carry it off anyway.<br><br>Loretta Young has a difficult role as the wife of Welles's character. The script does her no favors, either, but she gives a creditable performance as a character who is important to the story. Among the supporting cast, Billy House particularly stands out, getting surprisingly good mileage out of his role as the store-keeper.<br><br>Perhaps the most creative aspect of the movie is the effective use of the clock tower, both as a plot device and as an idea, along with the related themes of clocks and time. The tense climax makes good use of all of these elements.<br><br>Welles and Robinson were both parts of so many outstanding movies that sometimes their merely good movies can seem to suffer by comparison. As long as you don't try to compare \"The Stranger\" with some other film, but just watch it for itself, it's a good thriller and an entertaining movie.","user":"Snow Leopard","rank":[38,42]}]