[{"title":"\"If you want a friend get a dog!\"","rating":7,"date":"4 September 2006","review":"The friends of Eddie Coyle is one of the 1970's lost crime/cop movies of it's era which in all fairness deserves better treatment i.e. a nice restoration on DVD done in wide-screen would not go a miss! The biggest draw back of the movie from a box office draw perspective is that lead actor Robert Mitchum's stardom was on the wain by 1973 and his main body of fans would not have liked the character that he played. They would remember him for his roles as a leading ladies man or tough guy roles from his earlier films not an aging crook down on his luck who struggles to support his family. Although a rather sorry character the viewer is not sympathetic to Coyle although he probably doesn't deserve what's coming to him.<br><br>Secondly, it's located entirely in the Boston area unlike the more familiar seedy locations of New York, LA or San Francisco that provided many box office hits during the 70's. It moves slowly and does not feature the violence, shoot outs, car chases of the FRENCH CONNECTION, DIRTY HARRY or the later DEATH WISH movies, or a tough talking, wise cracking hero who would save the day by shooting first and asking questions later. Having said all that what makes this a good movie? Well to start with the fact that it's different from the above mentioned movies.<br><br>Robert Mitchums sleepy looking demeanor made him very believable as a worn out aging two time loser who can't face the prospect of more jail time was very good in his role. Also in the light of recent revelations about organized crime in the city and law enforcement corruption in the 1970's makes the movie more relevant today. What many people would not know is that the South end of Boston was notorious at this time for organized crime. In addition a large part of the city police dept as well as state law enforcement was riddled with police corruption. To make things even worse the local Boston office of the FBI was allegedly involved, the local media were intimidated and did not report what was going on and the political establishment also turned a blind eye too! This movie portrays this quite well and the fact that the movies conclusion is located at Bostons government center is in itself ironic if not significant.<br><br>The Boston underworld in the 1970's was spearheaded by James \"whitey\" Bulger a notorious convicted felon and local hood, who at some point was involved in all of Bostons seedy shenanigans. Right up until the late 80's Bulger wrecked havoc and even today is still one of the FBI's 10 most wanted. It's worth mentioning that because it provides a decent incite to what went on and thus makes the movie much more believable to those who might not have any knowledge of organized crime in Boston. In fact despite this some now believe that Bulger himself might have been an FBI informer too i.e. playing for both teams while enriching himself!<br><br>Yes the movie does move slowly, but it is more than compensated with a pretty reasonable story and a fine list of American character actors who are very believable in their roles. Alex Rocos is good as the lead crook, a baby faced Peter Boyle as an informer and the versatile Richard Jordan playing a bent FBI official top the cast along side Robert Mitchum. There are some great location shots of Boston, it's suburbs and New England in the Autumn. There is also a shot of the old Boston Garden featuring an ice hockey match with the Boston Bruins in their heyday led by the legendary Bobby Orr. For anybody interested to see what Boston looked like in the early 70's with it's greasy spoons and neighbourhood bars check this one out.<br><br>Many of the characters here are not likable at all, they are devious, manipulative, self centered and two faced, but I suppose it's true what they say \"no honor amongst thieves!\" It's not the greatest of films but not all that bad, it's well worth a watch for all of the above!","user":"dgrahamwatson","rank":[70,74]},{"title":"A bit of a mini masterpiece -- just as long as you know what you are in for.","rating":8,"date":"19 October 2005","review":"An ageing small time hood (Robert Mitchem - in the title role) is looking at jail time and wants to cut a deal with the forces of law and order. However this is just one of the many plates that he wants to keep spinning on their wobbly poles.<br><br>This is a film that is a bit different. Indeed having seen a million films (or it seems like it) you expect it go off in a different direction, grab hold of the drama and try and pep it up with cheap thrills. The Friends of Eddie Coyle fights against that - throwing away many of the free gifts that comes its way and focus on how a man can paint himself in to a corner.<br><br>This is Mitchem's best ever role. Never having been in classic this is the next best thing. The world weariness helps him for this part - you feel that he really has been in the crime business since it was invented and has really seen it all and done it all (as his bar room stories seem to indicate). However for Eddie the party is over. He is like a late Elvis - fat, bloated and living on his old reputation. Hoping that he can play both ends against the middle one last time.<br><br>The title has an irony. He really has no friends. He knows that too (because he is not stupid), although he has to make do with people that pretend to be. It is too late for another life and the bills keep having to be paid and food needs to be kept on the table. He is not a master criminal -- more a brave odd-job man.<br><br>While this movie hasn't been widely seen (it gets of odd plays on UK TV) a lot of important people have seen it. You can see the Sopranos in some of the scenes where people view crime as a business with death and prison being occupational hazards.<br><br>This is quite dark and mean, but you are comforted that the people getting hurt or doing the hurting are more or less the same. People caught in the vortex of earning an easy buck and it is far too late to start changing now. Friends is a tough movie and one of the few films I have seen that while steeped in crooks and crime remains fair and moral for every frame.","user":"Pedro_H","rank":[62,69]},{"title":"Probably Mitchum's best performance","rating":30,"date":"30 October 1998","review":"The film is, in every aspect, of high quality. Quality acting from supporting actors as well as stars, a quality script and beautifully directed. It is probably Robert Mitchum's best performance, one in which he is well supported by Richard Jordan and Peter Boyle who give wonderfully low-key performances as the other two main protagonists. It is one of my top ten.","user":"Keith-39","rank":[35,38]}]