[{"title":"Campy-cool Gothic antics","rating":7,"date":"27 May 2004","review":"Here's an early entry in the Italian horror revival of the 60s, following on the heels of Freda's \"I Vampiri\". It fits in well with the contemporaneous Gothics \"The Playgirls and the Vampire\", \"Slaughter of the Vampires\", etc., but is more superficial and haphazardly constructed. Most horror buffs have dismissed it as a clumsy imitation of its cinematic cousins. As proved by his later, supremely bizarre contributions to the horror genre, Polselli was a hack with no interest in continuity or story structure, but he certainly could sustain a ferociously obsessional, surrealistic atmosphere, and this title can be quite hypnotic despite its poor make-up and effects and relentless lack of narrative drive.<br><br>On the other hand, if you're a fan of kitschy early-60s Euro-chic, then by all means check this one out (if you can find it -- it only seems available on hazy grey-market copies that may have been clipped of brief sights of nudity and lasciviousness). The proceedings come to a halt every so often to allow the (supposedly classical) ballet troupe of leggy, leotard-clad bambinas an opportunity to break into sultry, acrobatic jazz ballet (shades of Chicago and Cabaret), to some mind-bending cocktail lounge music. It's as if José Benazeraf checked in one afternoon as guest director on a Bava picture! Definitely a cheeky, retro-chic cross-pollination, along the lines of \"The Hands of Orlac\" (remake) and \"Death on the Four Poster\".","user":"goblinhairedguy","rank":[21,21]},{"title":"Arguably the first Italian horror movie of early 60's.","rating":8,"date":"31 May 2010","review":"A group of sultry Italian ballerinas is terrorized by the vampire and his countess Lucia in an old and dusty castle.\"The Vampire and the Ballerina\" is arguably the first Italian horror movie of early 60's.Mario Bava's immortal \"Black Sunday\" went into production three months later.The film is worth seeing for its vintage B&amp;W atmosphere,a subtly erotic elements and glorious Gothic mood.All the ladies are strikingly beautiful and there is some tame bloodsucking action.Actually one of the dancers is a very young Femi Benussi.\"The Vampire and the Ballerina\" was shot in Piccolomini castle built in 1470 on the remains of a previous fortified structure and now surrounded by a wonderful green park.If you are a fan of Italian horror watch this stylish mood piece as soon as possible.8 out of 10.","user":"HumanoidOfFlesh","rank":[14,14]},{"title":"Superb Production Design & B/W Expressionism in Early Italian Horror","rating":8,"date":"18 November 2014","review":"By utilizing expertly lit Gothic interior sets, this film is saturated with an incredibly surreal look and feel. Viewing a pristine print of this film on YouTube, I was impressed with the production design, the gorgeous cast, and the intense power struggle and love/hate relationship between the two undead residents of the abandoned castle. <br><br>Between the moody chilling scenes there is a fair amount of eroticism, and frivolous fun. One of the more gripping scenes was that of a recently converted vampire in her windowed coffin being carried to the cemetery. The POV shots from the nascent vampire are of the towering Lombardy Poplars, passing under the arc of the cemetery gate, and seeing the dirt pile up on the coffin's window pane. <br><br>For true vintage horror fans who don't need lots of blood and gore, this film is well worth a look.","user":"marthahunter","rank":[11,11]}]