[{"title":"Dancing in Heaven","rating":18,"date":"18 June 1999","review":"If you didn't first see this movie between the ages of 8 and 15, you probably won't experience the same joy and nostalgia as those of us lucky enough to have seen it in those golden years of our lives.<br><br>Today I found out that two girls in my office also love this movie, and it was like finding two kindred spirits.  My sister and I used to watch this movie over and over again on cable.  Yes, it's predictable and cheesy, but that's what's so fun about it!  And was 80s pop culture (cheeseball pop music, teased hair, Velcro, loud clothes and dance TV programs--think \"Solid Gold\") ever so well documented on film?<br><br>Yes, you can watch Helen Hunt in her Oscar-winning performance in \"As Good As it Gets\"...but wouldn't you rather watch her become \"Miss D-TV\"?<br><br>Ah, the memories...","user":"angelcitygal","rank":[12,13]},{"title":"Girls definitely want to have fun","rating":3,"date":"3 June 2002","review":"Girls Just Want to Have Fun is the ultimate movie of the 80s. I was 8 years old when this came out and my friends and I would hold our own Dance TV, of course everyone wanted to be Janey but I wanted to be Helen Hunt's character Lynne.<br><br>Even though Sarah Jessica Parker had the title role and the hunky Lee Montgomery as her dance partner and boyfriend, this film belonged to Helen Hunt. She was absolutely wonderful as the best friend who helped Janey with her dream of being on Dance TV.<br><br>Jonathan Silverman was funny as Drew, Jeff's best friend that in fact the best friends were the one who made this movie more enjoyable.<br><br>\nShannen Doherty was also impressive as Jeff's little sister Maggie, but a little too old to be playing a 12 year old.<br><br>The music is brilliant, though a little dated and every time I see this movie it brings back all the nostaglia of growing up in the 80s.<br><br>\nA definite must see no matter how many times you've watched it.","user":"baybee","rank":[21,26]},{"title":"I still love this movie!","rating":3,"date":"3 November 1999","review":"I just rewatched it on the comedy channel.  It's such a feelgood movie.  It makes you want to dance. I always wished for a sequel.  I would love to see how the characters turned out years later.  Sarah and Helen are great in this movie.  And I think Sarah did alot of her own stunts because she was doing gymnastics at the time.  The dancing is great and the music is pure 80's fun.  The movie has a good storyline that moves along with just the right amount of suspense and timing.  This is a fun, feelgood dance movie.  I highly recommend it.","user":"Carrigon","rank":[17,21]}]