[{"title":"Good, But Could Have Gone Deeper","rating":6,"date":"1 January 2006","review":"Loosely based on fact, \"Tobruk\" tells the story of an Allied mission to destroy Rommel's fuel supply at the port city of Tobruk. The film is quite entertaining, and there are some good ideas in the script, and some nicely shot action scenes, but the film never really rises above average.<br><br>In 1942, the fate of the Mediterranean hangs in the balance. The Allies have devised a scheme to stop Rommel's advance to the Suez Canal. A group of German Jews led by Captain Bergman (George Peppard), now working with the British, will escort a company of English commandos led by the staunch Colonel Harker (Nigel Green) across 800 miles of harsh desert right into the port of Tobruk, where they will knock out the harbor guns which prevent British troops from landing in the harbor. Then the British will land a strike force to destroy Rommel's colossal underground fuel dump. The movie follows the trek across the desert, where the characters bicker over opposing ideals and motives, discover a traitor in their midst, get stuck in a minefield, etc. etc., and as expected, resolve their differences during a climactic encounter with the enemy.<br><br>\"Tobruk\" is ultimately a movie about conflicting ideals. There are plenty of noisy action sequences and suspenseful moments, but at the heart of the story is a weakly established conflict over different moral standards held by the main characters. Director Arthur Hiller had a significant background in directing TV shows, and it shows. \"Tobruk\" has a small-scale feel to it from start to finish. The sets  even the vast outdoor desert plains  are never filled with thousands of extras. This is a movie about what goes on between a few main characters. What's unfortunate is that in \"Tobruk\" they're never fully developed and, therefore, it's hard to care when they are settled. Major Craig is a selfish pacifist, but all he really does is bicker about how much he hates being on the mission. Nigel Green's Colonel Harker is a typical English officer, playing a part written as most Hollywood roles for the English characters were. He demands order, obedience and when men don't stand up to his authority he just shouts a lot and gets his way. Of the leads, George Peppard makes the most of his role as Captain Bergman. Bergman, a victim of Nazi terror, is out for revenge and out to help re-unite the Jewish people. What's hard to swallow is that Bergman already seems to know the Jews will re-unite in Israel, when it wasn't re-formed into a nation by the U.N. until sometime after the end of World War II. Despite this, Peppard is passionate but never overacts. This is the type of role he was perfectly suited for, and it was fun to watch his performance.<br><br>All that said, \"Tobruk\" is still a pretty good movie. The question of heroism and duty is answered quite well near the film's conclusion, as each of the leads is forced into a situation they would rather not be in, where they must put their lives at stake in order to accomplish something important bigger than they are. Harker states, \"We have few saving graces perhaps our willingness to die for what believe is all that matters.\" Craig comes to respect Bergman's religious ideals and backs him up during the final battle sequence. And with that said the final battle sequence is, quite simply, incredibly well-filmed. The Allied assault on the harbor guns is fantastic. There are dozens of soldiers running about on the beach as a huge artillery installation is blown to bits, and not the least part of it looks staged or faked. Later, this scene is put to shame as some of the heroes take out the entire fuel supply for Rommel with a tank. The fuel dump explodes in grand fashion, with dozens of huge explosions and orange fireballs, some of which must have been real. The visual effects are state-of-the art, especially when one considers that this film was shot in 1966. (It was nominated for Best Special Effects at the 1968 Oscars, but lost to Doctor Dolittle).<br><br>\"Tobruk\" is entertaining and a sufficient afternoon adventure story. From start to finish, and it looks and sounds very authentic. Nothing about this movie seems staged, and despite an average-quality script, it's engaging and thought-provoking. I would suggest renting it at some point.","user":"SgtSlaughter","rank":[25,28]},{"title":"Not the Real Story of Tobruk","rating":6,"date":"17 September 2006","review":"The Longest Day started a trend in Hollywood to have big all star cast productions showing with documentary accuracy good accounts of some of the major events of World War II. Other such films like this would be Patton, MacArthur, Midway, and A Bridge Too Far. Note I do not include The Battle of the Bulge in this list.<br><br>The seesaw struggle for Tobruk would make a great film as the key port city on the North African coast passes from Axis to Allied hands a few times over the 1940-1942 period. But if you're looking for a factional account of that story, this ain't it.<br><br>What it's about is an allied raid on the fuel bunkers at Tobruk that keep Rommel's panzers going. The idea is that a group of Jewish soldiers who like Paul Newman in Exodus fought in the British army and these are German Jews, led by George Peppard, with appropriate accents and language will disguise themselves as Nazi soldiers. They will escort British 'prisoners' into Tobruk led by Colonel Nigel Green who will blow up the fuel dumps along with a combined naval and air assault. Along for the ride is Rock Hudson, a Canadian major who dreamed up the idea.<br><br>Well at least they didn't make Rock an American since there no American soldiers in that part of Africa at all. But Canada has always been handy if you want to cast a name American movie star in a British locale. Fortunately it fits the plot situation here.<br><br>There's action enough for those who like that as I do. But the most interesting part about Tobruk is the relationships between the German Jews and the British. Hudson is the outsider here so he does see both points of view. There is some garden variety anti-Semitism among the British, but it's also tempered with the fact that as Nigel Green puts it, he and others served in Palestine before war in Europe broke out. <br><br>Nevertheless as Peppard puts it for the first time Jews are acting like a people since the days of Rome. They are going home to where they started post World War II, to Israel before that was a name of a nation. Anyone who wants to start trouble can find them there. Sad to say a whole lot of people have wanted to start trouble for their own reasons.<br><br>So much battle footage was filmed for Tobruk that four years later it got used in another vastly inferior film, Raid on Rommel.<br><br>Not a great film Tobruk, but entertaining enough. But hopefully the real whole story of Tobruk will be told.","user":"bkoganbing","rank":[23,28]},{"title":"Intelligent And Complex War Film","rating":8,"date":"15 February 2008","review":"Often when I see a fondly remembered war film from my childhood I am bitterly disappointed by it as an adult . Not so with TOBRUCK which I recently saw again a few months ago . The explosive action scenes hold up very well today as long as you don't compare them to SAVING PRIVATE RYAN or BLACK HAWK DOWN but this is a film from 40 years ago . Imagine how effective they must have been on its original release . And aren't they fairly graphic ? So much so that I noticed some of the violence had been edited for its afternoon showing on Scottish Television <br><br>One thing I hadn't noticed as a child is how complex the narrative is or smart the dialogue is . There's a couple of subplots one of which is a traitor in the group and of a couple of Nazi sympathisers with documents who want to contact the Grand Mufti of Jerusalem in order to bring the Muslim world on to the side of Nazi Germany . Interstingly enough the Nazis were pro Muslim and had at least two Waffen SS divisions composed of Bosnian s and Albanians . In narrative terms the screenplay is not in any way crowded with these two subplots As for the dialogue it switches from comic relief as in: <br><br>\" what you doing with your fingers in your ears ? \" <br><br>\" I can't stand the sight of blood \" <br><br>\"Close your eyes then \" <br><br>\" But I want to see what's going on \" <br><br>through to the serious and philosophical: <br><br>\" I've heard it said there's a bit of a Jew in all of us \" <br><br>\" Ja and there's a bit of the Nazi as well \" <br><br>You could be very pedantic and state that the German tanks are in fact American tanks dating from the 1950s but every war film from this period suffers from this flaw and very few are as intelligent or complex as TOBRUCK","user":"Theo Robertson","rank":[14,17]}]