[{"title":"A John Ford Masterpiece","rating":10,"date":"25 December 1999","review":"John Ford's film of social and familial change details the chilling effects hard economic times have on a large, but tight-knit Welsh coal mining family around the turn of the last century.  Told in narrative flashback by the youngest of seven children (5 young men and a young lady) it begins when the coalmines are new, the valley still green, and the village cohesive and close-knit.  As economic times worsen, the family and community fray and slowly disintegrate.  The backdrop village becomes darker and smokier as the family fights valiantly to remain together.  But unlike the treatment the story would probably get today, the family does not lose its dignity.<br><br>There is not much, if anything, to criticize in this movie, it's one of the best ever.","user":"gbheron","rank":[74,90]},{"title":"A Family Film In Every Sense Of The Word.","rating":10,"date":"16 August 2004","review":"There has been a tendency to downgrade How Green Was My Valley recently because it beat out Citizen Kane for Best Picture of 1941. It turned out to be John Ford's only win in that department. Because Citizen Kane now is lauded as the best film EVER, How Green Was My Valley lost a bit of luster. Yet on its own merits it's a fine film and can be seen again and again without any boredom.<br><br>It's like Ford's Liberty Valance in that it shows the progress that the world's first industrial society, 19th century Great Britain as reflected in that Welsh valley, just like the settling of the American West in The Man Who Shot Liberty Valance. It's the reverse here, the valley is a place people leave, or at least a lot of the good ones. Nearly all the Morgan children and Walter Pidgeon who plays the minister.<br><br>1941 and 1942 marked the high point in the career of Walter Pidgeon. He never quite made the top rung of actors at his home studio of MGM. Yet in those two years he happened to star in both the films the Academy designated as Best Picture, this one and Mrs. Miniver in 1942. He's an outsider, arriving full of ideals and then forced to leave to stop gossip about him and Maureen O'Hara.<br><br>Maureen O'Hara made her John Ford debut in How Green Was My valley as the lovely and fetching Angharad. She and Pidgeon are in love, but Pidgeon does not want to inflict is life of denial on her. They give each other up and later their relationship is the cause of gossip.<br><br>Arthur Shields the lesser known brother of Barry Fitzgerald is the head of the deacons at Pidgeon's church. A narrow, bitter man he's one of a string of religious hypocrite characters that Ford has in his films. Offhand I can think of Willis Bouchey in The Last Hurrah and Grant Withers in Fort Apache. Barry's in this too, playing the comical Cynfartha.<br><br>The center of the film is the Morgan family headed by Donald Crisp and Sara Allgood. Playing Morgan patriarch Gwyllym Morgan, Crisp gets the Best Supporting Actor for this wonderful portrayal of strength and dignity. Sara Allgood matches him every step of the way. <br><br>Besides Pidgeon and O'Hara, the rest of the film revolves around the generational conflicts between the conservative father and his more broadminded sons who want to get a union started. In 1941 America that was a timely theme as our American Labor movement got its first backing from a friendly government in the New Deal. The labor troubles that the Morgans and the other Welsh coalminers in the valley deal with was a very relevant. <br><br>One of the great things about this is that Ford never takes sides here. Donald Crisp is never shown as a reactionary fool for his opposition to unionization. Indeed Ford puts him on a pedestal for sticking to his beliefs.<br><br>All this is seen through the eyes of young Hugh Morgan, played by Roddy McDowall in his first major part as a juvenile and narrated in flashback by British actor Irving Pichel as the adult Hugh. McDowell has his own troubles here, he and Sara Allgood fall in a freezing river and both have health problems afterward. McDowell is the first of the Morgans to go to school and he's bullied by both pupils and a snobbish teacher. Young McDowell is taught to box by Rhys Williams to take care of the kids and later Rhys Williams as Dai Bando, an ex-pugilist takes matters in his own hands with the teacher in the films most hilarious scene.<br><br>As we move into the post industrial age, the labor themes of How Green Was My Valley seem quaint. But the family travails, and heartaches, and triumphs with that 19th Century Welsh Coalmining family are timeless. This is the real genius of John Ford.","user":"bkoganbing","rank":[76,93]},{"title":"A Welch valley","rating":10,"date":"31 August 2004","review":"John Ford was a director with a vision bigger than life, as demonstrated by his films. Richard Lewellyn's novel must have been one source of inspiration for bringing to life this story about a small town in Wales. The director had the good fortune to have Arthur Miller as his cinematographer for this tale about the stark conditions about the miners' lives. The small town comes alive by the vivid account one sees on the screen. At times, what we are witnessing before our eyes, remind us of the work of great photographers such as Margaret Bourke-White, whose pictures for the old Life magazine parallel Mr. Miller's stark photography in the film.<br><br>Mr. Ford uses songs in most of his films. In this movie as well as in The Quiet Man, this device enhances what we are watching. The songs are diversions for the stark reality in the miners' lives. Their every day misery is somehow eased when they sing with clear voices ancient folk melodies they, and their forefathers, have always known.<br><br>The Morgan family is at the center of the story. We hear the narration from Huw, the youngest member of this family. All the men work in the mine; they are all disillusioned by the working conditions and meager wages that they give without hesitation to the matriarch when they are paid. They appear content at the beginning of the film, but we watch them gradually abandon their village in search of a better life; who can blame them?<br><br>The cast assembled by Mr. Ford is first rate. Donald Crisp, as the patriarch of the Morgan family outdoes himself in this film. Walter Pidgeon as the local church pastor is excellent. The young and radiant beauty of Maureen O'Hara was so powerful, we can't stop watching her for a moment when she is on screen. Roddy McDowall as the youngest child of the clan in his first appearance is also a magnetic presence that holds the viewer's attention all the time.<br><br>The rest of the actors do incredible ensemble work to support the principals. Anna Lee, John Loder, Barry Fitzgerald, Anne Todd make us believe they are the characters they are playing. <br><br>Ultimately this is a John Ford's triumph. He is the force that welds everything together and in spite of all the bad things that happen to the family and the town, he seems to be telling us there still is hope and life will continue.","user":"jotix100","rank":[48,60]}]