[{"title":"Worth a look","rating":12,"date":"12 March 2002","review":"Ealing's adaptation of Dickens's NICHOLAS NICKLEBY had the misfortune to come out at the same time as the two splendid David Lean versions of OLIVER TWIST and GREAT EXPECTATIONS; everyone remembers these two film, while NICKLEBY has been largely forgotten. That's a great shame, because in spite of director Cavalcanti's obvious discomfort with the material, this remains a fine version of the novel, with all the great set-pieces (Dotheboys Hall, the Mantalinis, The Crummles theatre troupe) present and accounted for, and even such minor characters as the Kenwigs family getting their share of screen time. Of the performers, Stanley Holloway has a grand old time as Vincent Crummles, with Cedric Hardwicke a splendid Ralph Nickleby and Bernard Miles an equally good Newman Noggs. The inevitable streamlining of the plot towards the end has resulted in a felicitous idea, of which Dickens himself would have been proud: instead of Madeline Bray being married off to old Gride, it's Ralph himself who decides to marry her, which makes sense: if he can't have Kate to act as hostess, he'll have Madeline; and what better way to spite Nicholas than by marrying the woman he loves? The chase scene through the dark house at the end is masterfully done. Well worth a look.","user":"ashtree","rank":[23,24]},{"title":"One Evil Uncle","rating":9,"date":"22 May 2010","review":"In post World War II Great Britain there seemed to be a great revival in the work of Charles Dickens. Three of his classic novels were filmed in that period, Great Expectations, Oliver Twist, and Nicholas Nickleby.<br><br>Nicholas Nickleby is less known than the other two because Alec Guinness and John Mills got great roles and reached the top of the British cinema firmament as stars. Derek Bond in the title tole of Nicholas Nickleby never got to the heights that Mills and Guinness did. Still he was good in what was probably his career role.<br><br>Like the other two Dickens works Nicholas Nickleby involves the progress of a young man who has to overcome a lot of odds to attain prosperity and happiness. In this case his father dies and Bond with his mother Mary Merrall who is from the Billie Burke school of fluttery female and sister Sally Ann Howes look to his father's brother Cedric Hardwicke for charity.<br><br>But Hardwicke's not the charitable sort, in fact he's a scoundrel who has systematically lied and cheated others to build his fortune. He's not above using Howes as bait for his business and he sends Bond off to some 'school' that is little more than the work house we saw in Oliver Twist. Bond is a teacher there and leaves enraged at the treatment after giving the headmaster Alfred Drayton a thrashing the kind he relishes giving out to the kids.<br><br>Bond leaves with one of the kids played by Aubrey Woods who has been particularly abused and who in fact as it turns out was the victim of the most monstrous evil performed by Hardwicke. But we find out what that is toward the end of the film. Woods who has very few lines by facial expressions gives one of the most touching performances I've seen on film, he will live you longer than any of the other characters.<br><br>Dickens works abound in colorful characters and villains completely despicable. Cedric Hardwicke as Uncle Ralph Nickleby is a black hearted soul. Also standing out is Stanley Holloway head of a group of strolling players who gives help to Bond and Woods when they are at their lowest.<br><br>Nicholas Nickleby though it has been done on the big and small screen several times has this version to set a very high standard.","user":"bkoganbing","rank":[16,18]},{"title":"A Forgotten Filming of a Dickens' novel","rating":8,"date":"15 May 2005","review":"When Dickens wrote NICHOLAS NICKLEBY, his third novel, he was recognized as one of the leading writers of the age, but he was still learning his trade. PICKWICK was a comic masterpiece, but a picaresque novel. It had episodes that were actually short stories that could be taken out of the novel and published separately. He also tried to get some social criticism into the story, in the breach of promise suit and the debtor's prison sequences. But it remained comic (the trial sequences are hysterically funny). <br><br>OLIVER TWIST was totally reversed. Comedy was at a minimum (Mr. Bumble and his commentary on the law is a nice touch), but mostly it is a tale of poverty and crime, culminating in the murder of Nancy, and the death of Sykes and Fagin's trial and execution. TWIST was a good crime novel, and it's discussion of poverty causing crime affected the public. <br><br>NICHOLAS NICKLEBY was again tackling social issues: the existence of fourth rate \"private schools\" which were meant to hide the illegitimate offspring of wealthy men, or the legitimate offspring of remarried women whose new husbands didn't want them around. NICKLEBY, however, was Dickens attempt at a structured novel - something he never fully mastered. All of his novels had tangents and extra plots that were meant for public enjoyment in the magazines, but took away his creative concentration from the main plot. So at the start of NICKLEBY he puts in two extra stories that are told at an inn to entertain Nicholas and Mr. Squeers. Later he adds a storyline about Crummles and his theatrical troop. But he gradually concentrates on the main plot - Ralph against Nicholas regarding first Kate and then Madeleine Bray. Even here, however, extra plots are created and jettisoned.<br><br>It doesn't hurt the whole novel. It is a good read, and there are bits and pieces about Vincent Crummles and his company, the Mantalinis, Madeleine Bray and her father and Arthur Gride, that are well worth reading. But he throws in so much that parts of the novel are never really developed well: Sir Mulberry Hawk plans to deflower Kate, but finds that Lord Verisopht takes a protectors interest in her. George Orwell (in his essay on Dickens) feels Lord Verisopht is a fool, and he does die a fool's death (Kate never realizes his sacrifice). But he does sacrifice himself for her. This should have been explained better, and had Dickens written the novel ten or twenty years later it would have been better explained. <br><br>Albert Cavalcanti is best recalled for his \"Ventriloquist\" segment of DEAD OF NIGHT, with Michael Redgrave. He directed this film. As pointed out by some of the comments on this thread, his fine work directing this version of NICKLEBY was overshadowed in the late 1940s by David Lean's twin successes of OLIVER TWIST and GREAT EXPECTATIONS. He holds his own well. He trims out plot threads (such as Gride and the \"romance\" of Nicholas' mother and a madman). He also gives that fine actor, Cedric Hardwicke, the one real central role in his career. He is wonderful as Ralph, a malevolent moneylender, who ruins his own life without realizing it. The one moment in the novel when he is sympathetic (Ralph feels bad for Kate momentarily, when Hawk bothers her), is not in the film, which is a wise move. He should be totally hateful.<br><br>The other performers are good. Bernard Miles, a forgotten journeyman actor of his period (best recalled for the villain in the remake of THE MAN WHO KNEW TOO MUCH) does well as Noggs, the clerk of Ralph (they mutually dislike each other - this is not Scrooge and Cratchit). He eventually unravels the secret that destroys Ralph. Stanley Holloway, about to make PASSPORT TO PIMLICO and THE LAVENDER HILL MOB as well as the station master in BRIEF ENCOUNTER, is the grandiloquent impresario, Vincent Crummles. He is good as Crummles, but Nathan Lane's performance in the role was funnier and sharper. James Hayter, who would be Samuel Pickwick a few years later plays the Cheeryble twins, but there is little for him to do but be generous. It is an entertaining film, held together by Hardwicke's portrayal and Cavalcati's direction. I would recommend it to the viewer.","user":"theowinthrop","rank":[17,21]}]