[{"title":"Magnificent, joyous japery.","rating":10,"date":"31 January 2003","review":"\"Bringing Up Baby\" is a film I unconditionally love; it is so utterly sublime a comedy that I was truly sighing, awed, 'it can't get better than this...' at many points. Yet it regularly does; Hawks keeps the momentum going majestically; it is one incredibly surreal, bizarre tangent going off unexpectedly into another, at every juncture. He photographs and presents his actors in the most charming and amusing possible ways, and the film is certainly a more leisurely, perfectly pitched film than \"His Girl Friday\", which I nonetheless admire. There is a beauty in the photography and simple choice of perspectives and angles that matches the <br><br>There is not one actress in the annals of film who I adore more than Katharine Hepburn; she is a compelling performer, of great charm, intelligence and wit; of very real, idiosyncratic looks that to this eye are beautiful, vivacious, impish. In \"Bringing Up Baby\" her Susan Vance is a very interesting diversion from her more usual type of character - the slightly superior, in-control ice maiden, as shown in say \"The Philadelphia Story\". She is phenomenal in that film, yet here beguiling in a completely different fashion, playing a slightly scatterbrained, sprightly, charmingly delinquent woman, who seems to have no control over anything; least of all her feelings for Grant. Her giddy, breathless exuberance and anarchic helplessness are really endearing; it's a wonderful film that stretches out the credulity of Grant's wonderfully straight-laced character's resistance to Miss Vance. The ending is a gorgeous, satisfying pay-off, as he finally gives way, as would we all! It's a charming, suitable ending that rectifies the slight fall-off of the preceding jail section of the film. That is very amusing, but in a more predictable, slightly laboured way. In stark contrast to the first 70-80 minutes of the film, which amounts to about the finest sustained American comedy I have seen of that length - \"Way Out West\" and \"Duck Soup\" being shorter in total. <br><br>Cary Grant, truly an institution of a comedic player, is very different to his more remembered persona of later years. It's remarkable to see this absurd little man, bespectacled, unworldly and cutting an orthodox figure played so perfectly by the suave Grant. This is gleefully played on with the sublime scene where Hepburn and Grant are trying to catch the leopard - Kate butterfly net in hand! She accidentally happens to break his glasses and is even more taken with him without them... The tension between how we usually remember Grant and the character he is playing here does add an extra layer of amusement to the film. Need I really add that the rest of the film's company are note perfect? Charles Ruggles, Barry Fitzgerald and many more really give the perfectly matched stars a fine backdrop.<br><br>I shan't spoil too much of this heady, sublimely silly film... just go and watch it and see Howard Hawks, a master craftsman, at his best - there are no pretensions but making a quite wonderful character comedy - and Katharine Hepburn and Cary Grant on insurmountable form. With these delightful stars and anarchic, scintillating comic material, what we have on our hands is an unutterably fine film, one of my very favourites of all time. Where else are you going to get such plot threads running simultaneously as: a hunt for a rare archeological find buried by a dog, an absurd upper-middle-class family dinner and an escaped leopard?<br><br>Rating:- *****/*****","user":"HenryHextonEsq","rank":[79,112]},{"title":"What's with the recent bashing of this film?","rating":10,"date":"13 October 2004","review":"It's not just a classic - It's a timeless one! Katharine Hepburn (by her own accounts) was in two minds about playing screwball comedy. But she pulls off the characterization of the mad-cappest heroin/heiress ever portrayed on film. It's NOT Kate. It's Kate brilliantly breaking out of her 1930s typecast. The pace is fast, Cary Grant is brilliant as the professor Kate harasses/helps/falls in love with throughout. And what about Susan's aunt and the major? Priceless! Kudos to Baby, as well. I think maybe a few reviewers have been taking their humor from watching 1930s European comedies. Unless it's all out and out vaudeville or cabaret transpositions you're watching, I wouldn't recommend making those your standards for judging \"Bringing Up Baby\". Worse still if you're judging by American/European standards of the 21st Century. I'm not saying you're wrong, I'm just saying since you can't compare this to virtually anything of those, just enjoy the ride. The Acting you CAN compare, though. And I put my money &amp; soul on Hepburn, Grant &amp; Baby every time.<br><br>10/10","user":"senocardeira","rank":[98,145]},{"title":"A gem of 80 years","rating":8,"date":"8 May 2019","review":"An excellent and wacky rom com inspired by the movies of Laurel and Hardy, during which we follow the adventures of Susan and David from a golf driving range until the destruction of a dinosaur skeleton, not to mention the songs needed to calm down a leopard. Certainly, the scenario is far-fetched but that's exactly the global idea! Indeed, we regularly flirt with the absurd through dialogues of the deaf, misunderstandings and tutti quanti. The manifold gags reinforce the endearing side of Susan and David. Katharine Hepburn and Cary Grant excel in these atypical roles, and Walter Catlett is so hilarious. This black and white film of another era, between the Great Depression of 1929 and the Second World War, is a delight to be enjoyed with your sweetheart or with family.","user":"FrenchEddieFelson","rank":[16,20]}]