[{"title":"A prime example of the way highly styled entertainment should be","rating":8,"date":"1 September 2007","review":"Schlesinger made a great action-suspense film and married it to the artistry of unique talents Hoffman was, by then, a dynamic, young and incredibly versatile film actor with three Academy Award nominations already under his belt for \"The Graduate,\" \"Midnight Cowboy,\" and \"Lenny.\" <br><br>But the key to \"Marathon Man\" was the chemistry between its stars Perhaps one of the most gut-wrenching and most memorable scenes in the film comes when Hoffman is captured and tortured by Olivier who plays the role of a mean and vicious and sadistic Nazi war criminal, Christian Szell Olivier's performance resulted in a 1976 Academy Award nomination as Best Supporting Actor <br><br>In 1945, Szell ran the experimental camp at Auschwitz where they called him the White Angel He was a dentist and could provide escape for any Jew who was willing to pay the price He started out with gold, naturally, but very quickly worked his way up to diamonds <br><br>As Szell saw the end early, he sneaked his brother into America with the diamonds And they were right here, in New York, in a safe deposit-box until Szell's brother got killed in a head-on collision with an oil truck <br><br>Uniquely built, and with a marvelous, rugged face, Roy Scheider, well known for his strong performances in \"The French Connection,\" \"Klute,\" and \"Jaws,\" came on board as Hoffman's mysterious businessman brother, getting the rare chance to play a character that's both hero and villain Doc is a fascinating guy because he chooses to work out his problems in a much different way than Dustin's character does He was very touched and very moved by his father's death, but he abandoned all his hopes for whatever he intended to do and he became a spy, a killer, a very jaded personality <br><br>In doing something truly suspenseful, Schlesinger accomplished a film that's largely about fear and it's about pain and the infliction of pain because of fear The thrilling sensation of great expectations came on the 47th Street in the diamond district in New York, where Schlesinger gets the best of it","user":"Nazi_Fighter_David","rank":[72,87]},{"title":"Yeeks!","rating":8,"date":"28 July 2005","review":"Quite apart from the infamous torture scene, which I found extremely difficult to watch without howling in horror (actually that's a lie, I DID howl) this film is FULL of nervous tension that occasionally boils over - the way it's been done is masterful. The bouncing-ball scene in the darkened building should be utterly prosaic, but it really isn't - the way it's choreographed and shot brings such an air of menace and trepidation you'll be biting your nails off. There's much of a similar vein in 'Marathon Man', and although the storyline is sometimes almost buried through the relentless suffocating tension, it's extremely watchable (with a cushion to hide behind at certain points) and one of the greatest non-Hitchcock thrillers I've ever seen. Don't hesitate!","user":"deathinleamington","rank":[73,98]},{"title":"Fascinating and chilling in equal measure, the film is an exercise of pure threat told from the perspective of someone caught up in the firing line.","rating":8,"date":"9 February 2010","review":"Amidst the the early morning glare of the rising sun and whatever few others are up at this time, a young man jogs along the beaten track in an attempt to keep in shape. This, as he spots a fellow jogger and begins a fairly innocent 'chase', although the individual manages to outrun our young man to some pretty ominous music. The entire exchange is eventually inter-cut in a bizarre manner with some found footage of a marathon runner completely disconnected to the events we're witnessing. Marathon Man begins with this rather simplistic sequence of a young man jogging and very slowly turns what is an everyday activity, or an unspectacular image, into something that is quite sinister. It pitches the tone of the film perfectly, establishing an everyday guy and placing him in a sinister chase situation which it is discovered is so easily to get involved in, while systematically foreshadowing the eerie turns the narrative will take to do with having to run for one's life.<br><br>Marathon Man is like that; there's something very effective behind its ability to inject terror into a relatively routine situation. That very primal sense of 'running for one's life', whatever the situation, is tapped into perfectly by director John Schlesinger, who paints a bleak and uncomplimentary picture of New York City and of the scummy, lying and double-dealing lowlifes whom inhabit it. Amongst all of this is the character of Thomas Levy (Hoffman), nicknamed 'Babe', a student of history who is attempting to follow in his now deceased father's footsteps by engaging academically in the same field. Babe will later end up following in the same footsteps as his another family member; his brother Henry (Scheider), but for all the wrong reasons. Even Henry is referred to by his nickname for a lot of the film, that being 'Doc', thus repeating the process of use of an alias and tapping into that highly consistent theme of suspicion and what one's true identity is. In a film in which a lot of people act as if they're one thing in order to garner an advantage, this use of improper name and alias to act as an alter-ego is interesting.<br><br>But Marathon Man provides us with a ray of light in the form of Babe, a down to Earth and accessible lead with whom we are able to relate in his innocence and copious levels of naivety to his situation when espionage and betrayal catches up with him. In what might appear to be a complex and rather deep story revolving around said narrative characteristics of espionage, smuggling and spies; it is ironic that mere fate brings certain people to New York for certain reasons. This, when a stark disagreement between two elderly men about something that relates to times and events far deeper than mere road rage.<br><br>If Babe is a figure cut from a stone that shy but eager in his personality and traits, then Laurence Oliver's Christian Szell, a doctor well informed in the art of dentistry, represents the polar-opposite as this elderly and frail man, but someone who has made a life out of other people's sheer misery; a man that has seemingly existed to inflict pain and suffering wherever he's gone. When we first encounter him, he is a lonesome figure in a heavily fortified and secluded place of dwelling in the middle of a South American jungle. Several newspapers are scattered around, some in English; some in Spanish and some in German which establishes a sense of expertise in language, although the items that stand out are the uncanny skulls which line the shelves, most of which contain odd shaped teeth which catch our eye. The sequence informs us of a man whom requires security and isolation as well as someone whom is most probably trilingual. In one swooping camera shot, we are left to read into as much as we can about this one individual, while a lesser film of the thriller ilk would have seen a bunch of people gather in a room; brought Szell's face up on a screen and laid out everything for the uninformed characters and audience alike.<br><br>Babe's involvement in what it is he ends up neck deep in is ultimately instigated by the unsightly sequence in which the death of somebody we do not see coming occurs in his arms. The battered and bloodied body of a blade attack victim acting as the first truly pieces of shocking imagery Babe has seen, the blood from the body staining his plain, bright white vest that he wears thus staining him, and therefore linking him to the world the departing life was connected to. The film is a tight, gripping piece; a film that clashes a world of smuggling, deceit and murder with the quieter, more routine world of a young man who's nervous around girls and just attempting to make-good out of some pretty harsh living conditions.<br><br>It progresses to encompass a series of quite extraordinary sequences, the one of which everyone remembers more fondly than others being the torture sequence involving a dentist's drill, a sadomasochistic game of fear; terror; power play; ambiguous questions; honest but disbelieved answers and sheer pain. One other passage of play sees the lead running down a street in the early hours of the morning, whatever light there is being provided by way of the street lamps, as what we perceive to be a wailing, screeching musical score encompassing this, only for it to turn out to be an approaching ambulance which hurtles past, catching us all off guard. Marathon Man is a taut thriller, drawing its audience in and gripping them with a number of basic conventions, raging from the use of a mere MacGuffin to instilling a very visceral, very effective sense of fear by way of ambiguous character intentions and pure threat. If ever there was an essential thriller to see, it may well be Marathon Man.","user":"johnnyboyz","rank":[6,6]}]