[{"title":"Absolutely heartbreaking stuff.","rating":15,"date":"15 August 2003","review":"Occasionally Hearts and Minds comes over as too obvious and aggressive, as in the shockingly unflattering edits of glib, racist Americans piled one on top of another and the literal link the director draws between football and war.  (Then again, I'm 31 years old and just don't know how open such racism was then, but the cuts from bigot to bigot are just brutal and perhaps it's wishful thinking on my part to assume that the director was unfair.)  Also, it seems the communist NLF did no wrong that was worth putting in the film. Instead the director concentrated on eloquent nationalist sentiments.  I happen to agree entirely with the assessment of the war shown in the film, but even with my sympathies it's hard not to notice that this film that concentrates so brilliantly on the suffering of real people before an evil policy focuses almost solely on the crimes of the Americans and their South Vietnamese allies.  But maybe that was someone else's film to make and, at that moment in time, the director probably felt that there was enough coverage of NLF as just plain evil people.  It's a small gripe about such a mammoth film.  Documentary is not Truth, no retelling of an event ever is. Hearts and Minds is an unapologetically partisan film and is so much the better for being honest about it.<br><br>I'm `oriental' myself.  Well, `oriental' enough that I know all those slurs and dismissive comments would have applied to my family and me.  It was absolutely eerie for me to see people from Gen. Westmorland down to Americans watching parades on Main St. who had nothing but contempt for the people that to this day many swear the US was trying to save. <br><br>\nI'm not sure how many times I've ever seen the victim of bombing express himself outside of this film and that's sad.  How many people were bombed in the last century?  Millions certainly.  In the US we've become so accustomed to hearing that our foreign policy requires almost annual bombings somewhere on earth.  Particularly during the Clinton years, punishing through air strikes became so routine that it barely merited news coverage.  These attacks may not be as indiscriminate as they used to be, but how many people in our history did that one anguished man speak for as he wept about his family and his home?<br><br>The sheer carnage on display in Hearts and Minds made the whole war film genre seem perversely sentimental to me.  It's seldom helpful to hold up fiction to docu-footage, but, in this case, any number of moments from Hearts and Minds makes otherwise impressive films like Apocalypse Now! and Platoon seem like acts of bad taste.","user":"Lumpenprole","rank":[44,49]},{"title":"Difficult, important document of the era","rating":5,"date":"5 February 2005","review":"I'll admit up front that Peter Davis' documentary makes no effort to show the carnage and torture sponsored and perpetuated by the Viet Cong -- and the one substantial time it explores the way South Vietnamese civilians were imprisoned and tortured by their own government (in huge numbers, by the way), the film isn't very clear about who made these arrests. It concentrates almost solely on the inhumanity and pointlessness of our presence there in a pointless war which even our leaders were unprepared to comprehend.<br><br>It's not \"balanced\" within itself, but given the day-to-day barrage of standard media coverage of the Vietnam war during the time the documentary was made, I believe the making of this film represented an attempt to \"balance\" the average American's knowledge of what was really going on and how misrepresented the war was by our government and even by the major media most of the time.<br><br>All that being said, it's a vivid, important part of the mosaic of American war records. The images are enormously powerful, and where occasionally Mr. Davis' juxtapositions seem overtly manipulative, he still is to be praised emphatically for collecting and assembling this material in such a courageous and uncompromising way. It is essential viewing because of the power of its collected imagery and the lessons about America that we still need to learn. 30 years after the Vietnam war ended, there are still too many essential ways in which that conflict is not understood....and the degree to which we cannot seem, as a nation, to learn from the lessons of Vietnam is only too evident in the manner and attitude with which our leaders have handled and carried on the American military action in Iraq. <br><br>Having read a lot of the writings of Vietnam vets over the years about this war, I'm tempted to say that this documentary doesn't go far enough to show the core of absurdity and tragedy at the heart of this war and the way it put young Americans into a hellish situation for no reason and then left them there to be a part of a morally ambivalent, politically and humanly misguided situation, forever disillusioning and haunting an entire generation. But if this film can help younger people to understand just the tip of the iceberg of the enormous tragedy of America's involvement in a pointless 10-year war, then it continues to be worthwhile. <br><br>The film itself does not provide nearly enough \"backstory\" for a student or younger person who did not live through the era. Peter Davis presupposes that the viewing audience knows a lot of things which we knew at the time but which is no longer general knowledge for many viewers. But as a part of an overall attempt (using various sources) to understand that war and its colossal ramifications to our country's self-image, and as a reminder of how easy it is to slip into a tragic imperialism masquerading as some other kind of naive political idealism, it's an essential and vividly effective document of the times for which we owe Mr. Davis a huge debt of gratitude. There is much to be learned from films like this -- including things which our leaders today don't seem to have learned themselves, despite having lived through the Vietnam era.<br><br>It's also important to remember that until the Vietnam war, and later Watergate (reminders of which resonate in the presence in this film of \"Pentagon Paper\"- leaker Daniel Ellsberg), Americans generally believed what their government told them, and didn't think Presidents lied. It may be difficult now to remember there ever was a time when we trusted our government not to be intentionally misleading us, and if Mr. Davis makes a conspicuous effort to emphasize the duplicity of Johnson and Nixon in this documentary, it's probably because it was such a new and unbelievable concept to the overwhelming percentages of Americans before the Vietnam era took place.","user":"MCMoricz","rank":[50,59]},{"title":"A superior film/documentary","rating":10,"date":"21 December 2002","review":"Peter Davis created one of the most moving accounts of the Vietnam War and the attitudes at home when he produced \"Hearts and Minds\".  <br><br>The film looks unflinchingly at the nature of power and horrible consequences of war.  It is very much a pro-peace film, but uses the people who were there to speak for themselves.  It also seeks to probe deeper underneath the American psyche of the times and evolves into a historical document about the violent social rupture that happened between the fifties and the sixties. <br><br>In many ways, it feels like a punch in the gut to watch the film.  So many ideologies are laid bear....so many were false or misleading.<br><br>In the end, the film leaves you thinking about the price of war - and who is given the task to bear that price. <br><br>Truly deserving of the Oscar it received - and worthy of repeated viewing.","user":"greg-253","rank":[34,40]}]