[{"title":"Ninjas here, ninjas there, ninjas EVERYWHERE!","rating":8,"date":"8 November 2005","review":"American Ninja 2: The Confrontation is the best movie in the whole series and one of the best action movies I have ever seen. It has everything and what's more important: it has NINJAS! Tons of ninjas. In fact, there are so many ninjas in this movie that people got used to them. Ninjas wander around freely, shopping in supermarkets, hiding on roofs, driving cars, taking the sun on secluded beaches. This movie taught me one important lesson: ninjas are one of us and we should respect them. After seeing this great movie I say hello to ninjas on the street and I'm not afraid anymore to look under my bed in case a ninja is hiding there. We shouldn't be afraid of ninjas, ninjas are our friends! But back to the movie. It has three elements that make it so great: it has Michael Dudikoff, an exotic location, and a truck load of ninjas. The plot is simple, Dudikoff (himself being an invincible ninja) kicks some ninja ass then kicks some more and finally destroys the villain's master plan (sell clone-ninjas to other villains). But what makes this movie great is the unbelievable amount of action: ninja fights on a beach, bar fights, car chases, explosions, more explosions, sword fights. And if you think that ninjas perform only two basic functions: spying and killing, you're wrong. Because ninjas in American ninja 2 evolved, now they are also: bodyguards, sentinels, inept killers, car drivers, butlers, guards, human statues, decorations, extras, stunts, martial artists, masters of disguise and masters in ridiculing themselves. But why would a villain hire them instead of a conventional army? Because ninjas look cool and have three main characteristics that common soldiers don't have: they are FAST (the quickness with which their ass gets kicked is just amazing), they are SILENT (maybe they're silent, but that doesn't help them when they wander around in their black suits in broad daylight!) and they are DEADLY (I don't think they managed to kill anyone in the movie let alone even scratching Dudikoff). And the potential buyers are all a brilliant assortment of stereotyped villains: from the street pimp and the drug lord to the south-American dictator and the Arabian prince. And the main base of the villain is even more stereotyped, it has everything a villain dreams of: a representative logo (a lion with a shuriken in his head), a lab (with scientists and all), an arena (where ninjas can perform) and an office (from where the villain can dominate the world). And the most amazing thing is that if you are dressed like a ninja you can easily enter this heavily guarded complex and wander around freely. Ninjas walk the halls, buy coffees, take the elevators, go on cigarette breaks. They are just like us, but dressed like ninjas! Black ones, blue ones, red ones, it doesn't matter. The more the merrier. I learned the lesson and I'm sure you'll all learn it too after seeing this movie: ninjas are one of us. And remember, ninjas are EVERYWHERE!","user":"YugoNinja","rank":[51,53]},{"title":"The Citizen Kane, or crappy 80's ninja movies.","rating":10,"date":"21 July 2005","review":"Crapped out of the minds of the people who brought us: NINJA III: THE DOMINATION, CYBORG COP II, SPIDERS II: BREEDING GROUND, and +sigh+ the amazing BREAKIN' II: ELECTRIC BOOGALOO comes American NINJA III...I mean II. Whatever...<br><br>Joe Armstrong and Joe Jackson go to some island paradise, which of course in infested with ninjas. Good guys meet bad guys. Bad guys go dead. All is well in the land. <br><br>But THANK YOU GOLAN/GLOBUS for bringing us this trash...it might surpass DEATH WISH III as the funniest film of all time. It is perhaps one of those rare instances where every single person involved in any way with this film, was doing the most mediocre job possible. Truly some events like this only come along once in a lifetime. The fight choreography in this film is beyond comparison to anything in the modern world. It took three people to write this script, they probably thought it was clever that the first name of the bad guy \"THE LION\", is actually \"LEO\". HMMMMMM FORESHADOWING. Remember this word class....FORE SHA DOW ING.<br><br>One day I will buy the rights to this movie and re-dub it to my taste. <br><br>If you play with GI JOES and eat PASTE, this is probably you're favorite movie. If you're a 10 year old boy, you are forgiven. The rest of you FOR SHAME.<br><br>Steal this movie if you have to...it's worth it. American NINJA II **** stars.comedy.1987","user":"cannibalelvis","rank":[26,31]},{"title":"One of the greatest films of all time","rating":10,"date":"20 April 2006","review":"I first saw this movie when i was 13 on the wgn movie of the week. This was the showcase for numerous jean claude movies and Bronson Death wish flix. But this movie stands out on its own. When I first saw it I had never laughed at a movie so much in my life, and immediately I knew I needed to own it. SO i waited around and found out when it was on next and taped it off TV. Then the studying of greatness started.<br><br>There are numerous Flaws and items of interest that one should look for to help them through this classic. First and foremost is dudikoff ( the American ninja)'s delivery. Everything is said in the same monotone intense voice. For example, He would say the line \"I want to kill you!\" the same way he would say, \"I love you\" or \"The president has been kidnapped.\" And also his giant package that my girlfriend noticed last viewing of the movie which is ridiculous and pertruding.<br><br>Now for individual scenes; When Dudikoff and James are meeting with Wild Bill for the first time, look at Dudikoff at the end of the scene and you will see that it isn't dudikoff at all but a stunt double. Next the scene on the beach with the first conflict with the ninjas. Not only are the ninjas super bumbling but at the end of the scene James and Dudikoff are shown jumping off a 100 foot cliff, but in the cut away they gingerly land on the back of a speed boat without injury.<br><br>There are other scenes and memorable items but I must mention one more. 'THE SUPER NINJA' - There is a ninja in the movie that really isn't a character in the movie but a random ninja that is somehow immortal compared to the rest of the ninjas that dudikoff kills with a punch. This ninja flips onto a truck, gets knocked off, pulls out a grappling hook, holds on while being dragged, causes a motorcycle accident, flips back onto the front of the truck, still alive crawls up the front right before the truck that he's on flies into what appears to be a gasoline plant of some sort and into a giant fireball. Kudos.<br><br>THank you golan globus. I love you.","user":"Devo523","rank":[19,22]}]