[{"title":"My Favourite Zombie film this side of Pittsburgh","rating":9,"date":"30 December 2004","review":"Off the blocks let me just say that I am a huge zombie fan so I don't make statements like the above lightly. Secondly let me say that this is an Italian zombie film and Fulci only directed 15 minutes of it before handing over to Bruno (Rats, Night Of Terror) Mattei. This is no Dawn of the Dead folks.<br><br>That said this is easily one of the most entertaining zombie films I have ever seen. <br><br>The script is wonderfully horrible. Just check out the two scientists trying to find an antidote (\"Let's try putting these two molecules together\"). <br><br>The zombies come in all varieties. From moaning shufflers, to machete wielding maniacs, to birds! <br><br>The gore is plentiful. Legs are bitten off, arms amputated, stomachs burst open. <br><br>The pace is fast, flying from one zombie attack to the next. <br><br>Then there's the head in the fridge. Oh the head in the fridge! One of the greatest moments in horror since Ash got his hand possessed in Evil Dead 2.<br><br>You should know already whether you're the sort of person who's going to like this sort of film. Get some mates and some beer and you'll be in for a fun night.<br><br>Did I mention the head in the fridge?!?!?","user":"DocEmmettBrown","rank":[31,42]},{"title":"Zombie trash with a serious identity crisis.","rating":4,"date":"18 April 2008","review":"I've now seen this film twice, and I must say I enjoyed it both times. It's fast paced and fun, but ultimately daft. Having said that it deserves to be trashed because of screwing up what could have been a good follow up to the seminal original. It is clear for those who have seen the awful 'Zombie Creeping Flesh' that the films massive shortcomings can be owed to Bruno Mattei, and that the little that is commendable about it can be owed to Fulci. This is not idle Fulci sycophancy, the directors styles are starkly contrasted throughout, and you can tell who directed what, particularly in Mattei's case.<br><br>The film is centered around the outbreak of a virus (oddly referred to as 'top secret' by a scientist, it's secrecy apparently being more noteworthy than its potentially apocalyptic effect on mankind) somewhere in south east Asia. The virus causes zombie like behaviour in those affected, and the virus quickly spreads across a seemingly arbitrary area of land. Our protagonists unwittingly wander into the danger zone, and have to fight for their lives against hordes of infected Asians.<br><br>The film seems to be stuck half way between being a zombie gore flick, and an out and out action adventure, and this confusion is captured most clearly by the zombies themselves. They do not appear to have a set of characteristics common to all. Some are of the regular soulless shuffling variety, so well rendered in the original, and probably Fulci's creation here. The other main group consist of those who in being infected with the virus lost all sense of themselves, but incurred a savage aggression and a desire to earn a black belt in ninjitsu: Indecisively leaping around unsure of whether to continue honing their upper roundhouse technique or engage with their brethren in what looks like a mass tickle fest on their hapless victims. Martial arts skills aren't their only talents either, they are well versed in guerilla tactics, hiding on rafters and under bales of hay, and sometimes inexplicably falling from nowhere but the heavens themselves. This is all definitely the work of Mattei.<br><br>There is a third, more chatty, variety of zombie. This type apparently retain a sense of irony as well 'I'm really thirsty...FOR YOUR BLOOD'. The ridiculous twist at the end in which the DJ turns zombie but continues to preach ad libbed gibberish about the fate of mankind, only serves to enhance the WTF factor and obliterate any hope of a serious resolution.<br><br>Then there's the infamous zombie head which slowly propels itself through the air, a jokerish skeletal grin wrought across its face, as if to say 'yeah we know how bad this looks'.<br><br>The characters are all utterly one dimensional as you would expect. But its the pseudo comical dialogue and dubbing that really prevents us from taking their plight seriously. Having said that the first soldier to die does put up an impressively valiant display against an unstoppable zombie menace. Indeed this is the first and perhaps only time we hit real zombie agro, and one of the only effective scenes in the film.<br><br>The guy who played the chief scientist has heart, but no talent, utilising pauses in his lines entirely at random, so he ends up sounding like a confused asthmatic. The scientists' on screen attempts at finding an antidote are totally unconvincing 'now lets put these two molecules together!' <br><br>There are a few moments that stick out as genuinely effective however. In an early scene a female protagonist explores an abandoned garage. Upon entering a room we are confronted with a hazy view of a shifting figure in the corner and a squirming mass on the floor, all shot in an atmospheric diffused light. The silence is interrupted by the appearance of a speedy machete wielding zombie who trashes everything in his wake in his alarming desperation to have her. His sheer aggressiveness is one of the few moments of real horror in the film. The before and after theme conveyed through the hotel that plays host to the happenings of the earliest stage of the outbreak, and later as a refuge to our protagonists is imbued with an thick humid ambiance. There is a scene in which one of the soldiers cautiously approaches a boarded up room that clearly houses hordes of the undead, and this is quite tense. Things become more dramatic when they board themselves in the hotel unknowing to what lurks upstairs. But this is sloppily handled and not nearly as effective as it could have been.<br><br>All in all I would say this film may just about deserve to be called a royal screw up of a potentially effective tropical zombie fest, rather than simply a through and through bad film. If nothing else it has plenty of the unintentional laughs that I've come to expect from just about anything Italian and gory from the eighties.","user":"alexebbasi","rank":[10,12]},{"title":"An entertaining Italian Zombie flick","rating":7,"date":"9 October 2006","review":"Zombi 3 has an interesting history in it's making. Firstly, it is a sequel to Fulci's hit Zombi 2, with Zombi 2 itself being of course a marketing ploy to trick people into thinking it was a sequel to George A. Romero's Dawn of the Dead aka Zombi. Confusing enough? Basically, none of the films have anything to do with one another, but who cares when they make money. I guess Fulci himself starting to not care about the production about half way through Zombi 3 when he decided to walk out. Bruno Mattei was brought on board to help pad the film with additional scenes to lengthen the running time.<br><br>Zombi 3's plot is your typical zombie fare. Scientists develop a serum on an island in the Philippines, terrorists steal it unleashing a plague, and zombie run amok. The scientists want to create an antidote, while the military is set on mowing down everyone without prejudice. There are also brief inserts of a Radio DJ preaching about how we treat the planet. <br><br>Overall, I actually liked this film. I heard horrible things, but I find the goofy dialogue quite enjoyable. The film seems to be an attempt at raising awareness about pollution, corrupted military, Man playing God, etc. I get the feeling this was at one point a serious film, but it veered off in a weird direction, presumably when Mattei came on board.<br><br>Besides ripping off other zombie flicks, this was very reminiscent of Romero's The Crazies. You hear the Radio DJ breaking the good news with, \"When you see the men in white suits &amp; gas masks, Run to them for Help.\" This is of course played to the images of the men in white gunning down zombies. Later, they straight up steal a scene from Crazies in which one of the regular, uncontaminated people is killed by mistake.<br><br>The gore factor is pretty good in this one with zombie hordes around every corner. How is it cool? Let me count the ways1. Zombie Birth 2. Flying Zombie Head 3. Zombie Birds. 4. Zombie with no legs swimming in a pool. My favorite zombie was the machete-wielding maniac at the gas station. He was bad ass and nearly tore down the entire building trying to kill a girl.<br><br>Favorite Quote  When a sergeant insists on cremating a zombie, the scientists asks, \"Don't you think that once the ash is in the air, it will fall to the ground, and contaminate everything?\" To which the Sargeant boldly replies, \"Now you're talking science fiction.\" He also continues to mention the \"Science Fiction\" told by the scientists even at the end when everyone dies.<br><br>Extras: Gallery, Trailers, and Interviews, most notably the one with Mattei where he insists he directed 40% of the scenes, yet cannot recall which ones or any other significant details.<br><br>Bottom Line: A must see for zombie and Fulci fans.<br><br>Rating: 7/10<br><br>Molly Celaschi www.HorrorYearbook.com MySpace.com/HorrorYearbook","user":"carlykristen","rank":[17,23]}]