[{"title":"\"Just when you get rolling, your life makes a beeline for the drain.\"","rating":18,"date":"18 April 2010","review":"John Huston is amazing to me. He defined an entire genre with his foot barely in the Hollywood door, then he kicked the door down and walked in to clear well deserved Oscars as both writer and director, he took his Oscars with him to Africa to get hammered with Erol Flynn and go out on safaris leaving behind him a big production to go to hell, then came back to find they had nailed a new door in place of the one he had torn down so he didn't bother to knock at all this time, he packed his things and went to a small dingy bar where Mexicans and barflies go to kill their time to make movies about killing time, movies about misfits and people who are dead inside, movies like Fat City and Under the Volcano, to adapt Flannery O'Connor and James Joyce, to soar above and beyond what anyone might have expected from any director of his generation. It's 1972 and John Huston is still relevant as ever. How many directors can you name who turned out some of their best material in their fifth decade directing movies? Venerable relics like Clint Eastwood move over, American cinema (not simply Hollywood) already had a patriarch in place long before any of you looked through a viewfinder.<br><br>It's also amazing to me how an indomitable absolute badass of a successful director can know failure so well. This is a movie where people box but it's not about boxing. There's no triumph to be had here and the crowd gathered in the small suburban boxing hall in Stockton, California, to pass their time is not there to be pleased. Most of them are probably the same kind of deadbeat with no future and a sh-tty job as the third-grade boxers who beat each other for their amusement. We get the young upstart boxer with the fast legs and a bright future ahead of him if only someone could train him right but this character can only make sense when we see him standing next to Stacy Keach, the aging boxer who won't see thirty again and who maybe had a chance once but blew it for women and alcohol and now he's desperate for one last throw of the dice.<br><br>The sad beauty of Fat City is that we're not looking at some kind of last defiant stand, we don't enter the ring for one last moment of triumph with the lights blaring bright and the crowd cheering, this is not The Wrestler anymore than it is Rocky, the lights were not only dimmed long ago but they probably never shone bright enough anywhere except in the protagonist's head. The closest Stacy Keach came to glory some odd 10 years ago was in itself a failure. Were his eyebrows slashed with a razor or not that fateful night down in Mexico we never find out. For most of its duration Fat City is a beaten man with sunken cheeks and a grim unshaven wan face wearing an expression of incredulous outrage. <br><br>Then we're inside a rundown cafe, the walls are painted in sickly washed-out colors and old men play cards around tables in felt, and we sit down for one last cup of coffee on the cheap formica counter. We see the young boxer standing next to the washed-up has-been one who can't even be a mentor anymore and an old man, a walking shell of someone \"who was maybe young once\", comes over to serve us and it all makes sense. \"Maybe he's happy\" says the young one. \"Maybe we all are\" says the other, and we know we're not, life doesn't quite work out that way, but it's all we have. The old man turns and smiles a toothless smile (senile or knowing, who's to say) and Fat City fades out into one of the most touching heartfelt endings I've seen. Fatalists cannot afford to miss this one, it's the stuff dashed hopes and broken lives are made of. Rejoice.","user":"chaos-rampant","rank":[27,28]},{"title":"Overlooked masterpiece","rating":9,"date":"22 October 2005","review":"I had deliberately overlooked Fat City in the past believing it to be yet another twist on the formulaic and Hollywoodization of boxing stories. Was I wrong! I'm so glad that I unexpectedly caught this and was riveted from the get go. Fat City is an amazing film, made even more stellar by the casting of Stacy Keach, Jeff Bridges, Candy Clark and Nick Colasanto. It is hard to distinguish between these marvelous actors as their performances, under the hands of the maestro John Huston, are incredible. Stacy Keach is the focus however, and he carries the film with the able performances of the aforementioned. I believe this to be one of the most overlooked films of all time.<br><br>The characters are a bunch of losers, but they don't know they're losers and keep reiterating their dreams. They operate on a level that is below average and live in impoverished surroundings, always believing that something good is around the corner. There is no big win in this, the wins remain around the corner.<br><br>There's basically no beginning, middle and end. It is a study of the underbelly of a town in California, the seedy bars, the dirty restaurants, life in the one room with kitchen-in-a-corner of a walk-up fleabag hotel. Stacy Keach pulls you into this world, he lives and breathes the character he plays down to the last few minutes of screen time when he takes a look around the rathole of a restaurant he's in, surrounded by people like himself and the film freezes for about a minute before it moves on.<br><br>You catch his stark awareness at that moment. And all of his life, past, present and future becomes crystal clear to him. You don't think he's going to do much with this newfound insight. It doesn't matter. And that's the point. Bleak and beautiful. All in the same minute of time. 9 out of 10. Thanks once again, Mr. Huston.","user":"wisewebwoman","rank":[54,59]},{"title":"Requiem for losers and daydreamer believers.","rating":8,"date":"7 November 2005","review":"The down-to-earth tale of two small hall boxers -- at the opposite ends of their careers -- and the blows they take in and out of the ring.<br><br>This is one of the best American movies ever about normal working class lives where failure is common and the only thing you can do is pretend otherwise or drug it all away to nothing. I know why so many people prefer Rocky to this -- this is too real for them. Indeed it is almost too real for me! <br><br>Stacey Keach was given the role of lifetime in this. He really does look like a failing boxer turned to flab (although maybe that is nature -- not punches!) trying to find a life (of sorts) beyond the ring. Bridges really does look and sound like the daydreamer believer that makes the boxing game go round. Johnny No Talent who thinks he is Mike Tyson when his face finally clears up.<br><br>They don't make films like this anymore. The Europeans can, although they are rarely shown and end up too self indulgent. Everyone here gets what they deserve, which is sadly, very little. That is what sport is about in real life -- lots of people failing so that are very small few can succeed. The best the majority can hope for is some exercise and comradeship.<br><br>(This contrasts with most sports movies -- which are about glory. Or at least glory through struggle.) <br><br>This is the best late John Huston film and every single frame is a frame of reality and believability. Maybe that is what leads so many people to say \"so what\", the world outside their window has many of the same elements and there are many times you feel you are -- indeed -- looking at real life.","user":"Pedro_H","rank":[33,36]}]