[{"title":"Manchurian times","rating":10,"date":"9 November 2017","review":"Time is the ultimate judge, isn't that what they say? Well 1962's The Manchurian Candidate is all the evidence I need. It feels ahead of it's time still and so relevant. In 2004, Jonathan Demme - one of my heroes - remade it with Meryl Streep - one my favorites - and Denzel Washington - one of my favorites - and the whole thing felt so old hat that I had to see John Frankeihemer's 1962 version again. Wow! Angela Lansbury creates one of the greatest villains in movie history. She is phenomenal and like it happens she's the kind of monster you can't have enough of. Frank Sinatra is really good here and the creepiness of Laurence Harvey is unsurpassed. So, well, yes, time has confirmed and protected the greatness of this outrageous thriller.","user":"cristianocrivelli","rank":[75,77]},{"title":"The Garden Party From Hell","rating":8,"date":"27 August 2017","review":"While many cast members did an outstanding job in this disturbing and often violent political thriller, it is Angela Lansbury who stands out in her superb portrayal of a woman who not only dominates her son and husband but who wants to take over the entire country, if not the world! In the end, this is Angela's triumph, and I don't understand why she took second billing behind any of the other actors.<br><br>As much as I love Janet Leigh, she was handed a bizarre and somewhat minor role here which I believe only served as a deliberate distraction in that she never influenced Major Marco (Sinatra) as an agent working on either side. And don't get sidetracked by the fact that \"Pinocchio\" was playing at the Manhattan movie theater that she and Major Marco passed in the cab because that was probably a deliberate \"red herring\" too. Granted that Leigh and Tony Curtis, including their sensational divorce, were quite the rage at the time, but Angela deserved top billing here.<br><br>When I read that Lansbury has only appeared in 54 full length movies to date, it seemed like a number too small only because she leaves such a strong impression in so many of her performances dating back to Nancy, the maid, in \"Gaslight\" and Sybil in \"The Picture of Dorian Grey\". To this day, I am haunted by the memory of poor Sybil singing \"Goodbye, Little Yellow Bird\" in the latter. Lansbury masters a wide range of effective acting from the kindly, unassuming Miss Marple to the powerful, detestable Eleanor Shaw Iselin here. <br><br>In addition to a towering Lansbury, the excellent portrayals by Frank Sinatra, Laurence Harvey, Janet Leigh, John McIver, Henry Silva, and James Gregory as the annoying buffoon of a step-father contribute to the success of this political thriller. I think that director John Frankenheimer and screenplay writer George Axelrod should be commended for staying close to Richard Condon's original novel, and the stark black and white photography enhanced the gloomy and ominous atmosphere. The filming of the three separate interpretations of the brainwashing sequence alone was a unique and unforgettable cinematic experience.<br><br>What a dish like Jocelyn Jordan (Leslie Parrish) ever saw in Raymond Shaw is beyond me, and we have surely witnessed Harvey as the dark, brooding character before (\"Room at the Top\", \"Butterfield Eight\", etc.), but who else could play this morose character more accurately?<br><br>As to that newspaper headline \"Violent Hurricane Sweeps Midwest\", did you folks in the Midwest ever experience a direct hurricane? I know about the tornadoes and the floods, but a direct hurricane? Was that another subtle attempt at humor by the director? Anyway, I'll never look at another hydrangea without much trepidation and dread.","user":"frankwiener","rank":[21,21]},{"title":"A political and social thriller/drama ahead of its time.","rating":9,"date":"20 August 2001","review":"John Frankenheimer's surrealistic direction and George Axelrod's adaptation of the 1959 book by the same name offer Laurence Harvey a career defining role.<br><br>Set in 1950's, A Korean War veteran Raymond Shaw(Harvey) returns home to a medal of honor for rescuing his POW platoon from behind Chinese lines and back to safety.  One of the returning soldiers, (played effectively by Frank Sinatra) however, has recurring dreams of his platoon being brainwashed and Shaw committing acts of murder.<br><br>He eventually convinces army brass that Shaw is still a puppet of his Communist-Marxist operators.<br><br>Angela Lansbury, (although barely a few years older than Harvey was at the time) plays his mother in a tour de force role.  She absolutely captivates and steals every scene she is in, playing a very complex role that needs to convince the viewer of many things without much dialogue.<br><br>There's a rich cast of characters, including Janet Leigh, Henry Silva, James Edwards, and a painfully accurate James Gregory.  Each character weaves through the methodical subplots and tapestry of Frankenheimer's masterful \"Hitchcockian\" pace.<br><br>I won't give away the plot, but dear readers, allow me to sat that this one is really worth watching--until the nail-biting and chilling conclusion.<br><br>\nThere are many undertones in this film -- political, sexual, class and power, and social.  You will want to view this film several times to approach it from different perspectives.","user":"teren","rank":[124,145]}]