[{"title":"Early Signs of the Norman Lear Touch","rating":7,"date":"23 July 2002","review":"There is a lot more to this movie than initially meets the eye.  The obvious humor is good enough, but the social commentary that is wryly interjected makes this a funnier movie the second time around.  There is a lot of satire about the media, the tobacco industry and organized religion.<br><br>I can't be completely objective about this movie.  It was filmed in my home town when I was 9 years old.  My parents, grandmother and step-grandfather and LOTS of people I know are in the crowd scenes.  One of those little fuzz balls in the back ground is me, but alas, Hollywood never called &lt;grin&gt;.<br><br>Norman Lear, Dick Van Dyke and many of the other cast members returned to Greenfield, IA for the 30th anniversary celebration.  Norman Lear mentioned that the idea for \"All in the Family\" was rejected by the networks.  They never felt that the program would fly in middle America.  His experience with the good people of Iowa during the filming reinforced his belief that \"All in the Family\" would be a hit.<br><br>Watching this movie gives a glimpse into what was to become the genius of Norman Lear.  I don't think it is one of the world's all time great comedies, but it is certainly worth a look - or perhaps two.","user":"chron","rank":[19,21]},{"title":"Hilarious, Underrated Satire","rating":9,"date":"14 October 2000","review":"Fantastic movie comedy -- easily one of the best satires of American life ever put on film. Norman Lear wrote and directed this gem just before moving on to \"All In The Family\". \"Cold Turkey\" and \"All In The Family\" are his two greatest creations. It begins with the script. It's funny from beginning to end. The script has clever dialogue, inventive ideas, an eye for detail. I can't do it justice. Just see the movie. The cast includes many of my all-time favorites, including Dick Van Dyke, Bob Newhart, Tom Poston, Barnard Hughes, and Jean Stapleton. You'll see a lot of people you recognize from other movies and sitcoms of the 1970s, including many who turned up on \"All In The Family\" and other Lear shows. \"Cold Turkey\" is also the best movie showcase for possibly the greatest comedy team of all time. Bob &amp; Ray are brilliant satirizing newscasters of the time, like Walter Cronkite, David Brinkley, Paul Harvey, and Hugh Downs. If you're not a Bob &amp; Ray fan, hopefully this movie will make you one. Randy Newman's soundtrack is terrific. If it ever came out on a CD, I'd buy it in a heartbeat. And it helps that the movie, which is set in a small Iowa town, was actually filmed in a small Iowa town, rather than some Hollywood backlot. It gives the movie a feeling of authenticity. This movie should have been on the AFI 100 Best Comedies list. See it.","user":"tgibbs279","rank":[26,31]},{"title":"A diamond that deserves the DVD treatment","rating":8,"date":"21 July 2005","review":"I can't understand why a film with such big names, both in front of and behind the camera, is not available on DVD. Is there a conspiracy? Does \"Big Tobacco\" not want anyone to see this? I understand this is a \"niche\" film, but c'mon, surely there is a small distributor willing to pick up the rights and get this into the hands of the people? Dick Van Dykes name alone should be enough to warrant a release, along with Bob Newhart and Norman Lear. I guess that unless there are some big, firey explosions or gratuitous nudity (not that there's anything wrong with that)then something isn't worthy of a DVD release. This is a well-acted and scripted satire of the culture of smoking and gives great insight into how smoking was treated 35 years ago.","user":"bukster007-1","rank":[22,28]}]