[{"title":"Post-war psychological drama","rating":7,"date":"8 July 2008","review":"Rosalind Russell faces \"The Guilt of Janet Ames\" in this 1947 film also starring Melvin Douglas, Sid Caesar, Betsy Blair and Nina Foch. After the war, many, many films concerning psychiatry, mental illness, the mind, nerve disorders, etc. were released. Obviously readjustment and mental trauma were problems faced by many returning soldiers, and loss had to be coped with in many families. So it's no surprise that psychology became a huge subject.<br><br>Rosalind Russell plays a war widow whose husband threw himself on a grenade and saved five of his platoon. Angry and bitter, she has the names of the men, and sets out to meet each one to see if any of them were worth her husband sacrificing his life. En route to see one of them, she is hit by a car and has an hysterical paralysis so that she is confined to a wheelchair. One of the names on her list is recognized as that of a reporter, Smitty (Douglas), and he goes to the hospital to identify her. Though he has lost his job, is an alcoholic and due to leave for Chicago soon, he does a mental exercise with Janet that is inspired by the story of Peter Ibbetson. Ibbetson was an imprisoned man in a DuMaurier novel who was able through his imagination to leave the prison and reunite in dreams with his true love. Janet has to imagine each man, what he's like and what problems he's facing in order to gain some understanding of him. One man has a child, another man is married and he and his wife dream of building a house, another does work in the desert, one is a bouncer and another is a stand-up comic.<br><br>Once she is through with this exercise, Janet is able to admit some demons she has been carrying with her since her husband's death. Then it's Smitty's turn to face some facts.<br><br>Thanks to the acting of Russell and Douglas, \"The Guilt of Janet Ames\" is truly elevated. Russell looks beautiful, and her acting is wonderful. At first she's hard and angry (the word neurotic is thrown around a lot), but gradually, her character softens. Douglas gets to do more than be the light, debonair leading man here, and as he proved later in his career, he is more than up to it.<br><br>The message is that you can't live in the past and put yourself through the torture of what you did or didn't do, and it's an effective one that probably has as much resonance now as it did in 1947. There's still a war on.","user":"blanche-2","rank":[31,31]},{"title":"The impact of war, and people helping people","rating":8,"date":"3 July 2008","review":"A surprising little gem of a movie. Articulate dialog, a realistic view of the impact of war, the best performance I have seen from Melvyn Douglas, good (and awfully tough) role filled by Roz Russell. Some of the fantasy went a bit too far and I'd love to know why one of the five surviving soldiers was not shown (his wife was). I always wondered about the buddies I lost and whether I've been a good representative for their sacrifice. This show was creative and touching, some hints of film noir and an occasional light moment. I've seen over 4,000 films, probably two-thirds of which I cannot remember even with prompting. This one stands out for being different and effective. Too few like this.","user":"eospaulding","rank":[29,30]},{"title":"Ten hankie movie","rating":9,"date":"2 July 2008","review":"This was a metaphysical metaphor and probably if you aren't of metaphysical phase, you will have trouble with it. The guilt Janet expressed as being the cause of the loss of her husband is universal: \"I didn't allow him his dreams,\" \"I kept him in a job he didn't like,\" \"I didn't want children when he did,\" and all the rest. These are feelings -- true or not -- that every loving widow thinks hoping to bring him back, (how to bring him back is in \"A Course In Miracles\" -- a metaphysical treasure).<br><br>After Janet finds her truth, she turns to do the same for her \"healer companion\" Smitty, and the movie ends with that happening with the same gentle thoughts that she was healed by. It's a tear-jerker with redemption because it heals the troubled mind of guilt by looking at situations in a way that exalts human love for humanity.","user":"margaretwestlake","rank":[17,20]}]