[{"title":"Funny and exciting popcorn action movie","rating":8,"date":"9 July 2001","review":"This movie gets a thumbs up from me, not because it is a GREAT FILM, but because, when you put it next to similar movies--Chuck Norris or steven Segal movies-- it is superior.  <br><br>the action sequences are tightly directed and exciting. the humor works. but most important, Rutger Hauer is the main character. When is everybody going to figure out that this guy is a great actor? He is always natural, can be funny, pathetic, intense, anything. He's truly on the level of,say, Gene Hackman, he just can't seem to get into many A-level projects.<br><br>Blind Fury is a funny-exciting-goofy type of action film, kind of like a Jackie Chan film, and Hauer's presence raises the whole thing an extra level.","user":"withnail-4","rank":[28,29]},{"title":"Not As Good As I Remember, But Still..........","rating":8,"date":"17 May 2004","review":"BLIND FURY is one of those guilty pleasure films. The late Chicago film critic Gene Siskel cited it as such during a broadcast of the show he co-hosted with Roger Ebert several years ago. It is not a great film, but has real moments of warmth and humor that are hard to ignore. It's difficult to explain, but what could have been just another vapid action film, is fleshed out by good performances, a self effacing sense of humor, and solid direction.<br><br>During the opening credits, we meet Nick Parker (Rutger Hauer). Having been blinded during a firefight in Viet Nam, he is taken in by a local hamlet and nursed back to health. The villagers also teach Nick the art of the sword, we get several scenes of his progress in which he becomes a master. Jump ahead twenty years, as Nick wanders down a country road, walking stick in hand. He is on his way to visit an old friend from the war. After a silly scene involving switched hot sauce, Nick arrives to find that his friend, Frank Devereaux (Terry O'Quinn) does not live there anymore, having left for Reno. Well, Nick meets Frank's wife and son Billy (Brandon Call). Enter Slag (the Randall 'Tex' Cobb), who has come to kidnap Frank's son, to force Frank into making designer drugs, so that an evil Reno casino owner can pay off his debts. Anyway, after a especially violent debacle, Nick is sworn to protect Billy, and off they go to Reno to rescue Frank.<br><br>Admittedly, BLIND FURY is plot heavy, and a lesser film would have sunk under the weight. But the film never gets overly involved with the story, never really takes it to seriously. This is director Phillip Noyce's follow up to DEAD CALM, a tense thriller that put him on the map (he would go on to helm PATRIOT GAMES, SLIVER, THE SAINT). It is a campy ode to samurai pictures and westerns, war movies and ninja chop-em-ups. Noyce sets the right tone and keeps the action moving. Observe the scene, near the end of the film: there is a tense moment when Billy throws a sword to Nick. The sword sails in the air, in slow motion, the music builds and the sword slips right through Nick's hands. It is a wonderfully funny moment. <br><br>Another important aspect is the character of Nick Parker. As played by Rutger Hauer, Nick is a simple man, not a super hero. He reacts through instinct to the situations he finds himself in, and uses mostly evasive techniques (similar to Jackie Chan), to defend himself. Hauer does a good job blending the realities of blindness with the Hollywood clichés, which makes scenes in which he drives down one-way streets, and the like, very entertaining. The film makers also keep the violence in a backlit, comic book style, never becoming overtly graphic (the antithesis of something like KILL BILL, where the characters dance through geysers of arterial spray). BLIND FURY is an enigma, it is not wacky enough to be considered cult, it does not deal with important subject matter, yet it is still somehow affecting. It will be cast into the discount bins at your local mall, left to languish in obscurity. But for those who will give it a chance, you may be surprised by this standard action fare raised to a higher level by a talented cast and crew. 8/10.","user":"underfire35","rank":[48,55]},{"title":"Absurd With Zero Credibility......But Fun!","rating":7,"date":"28 April 2006","review":"Talk about \"suspending belief!\" Boy, if this is a prime case of that, I don't know what is, but, it's still pretty enjoyable to watch. You just have enjoy what happening and put your brain on the back-burner.<br><br>Rutger Hauer plays a blind man who winds up killing about 10-20 bad guys in fights, despite the fact (1) they can see; (2) they also have guns! <br><br>Yes, it's absurd, but it's all in fun especially with Hauer cracking jokes and showing compassion in all his violence. The villains, meanwhile, are so stereotyped you almost want to laugh out loud.<br><br>This whole movie is really like a cartoon, without the animation.","user":"ccthemovieman-1","rank":[38,44]}]