[{"title":"Quite unlike anything you'll ever see!!!","rating":10,"date":"25 September 1999","review":"This oddball Altman film came out in the same year as M*A*S*H, but the two movies are stylistically very different. BC employs a conventional plot structure, whereas M*A*S*H featured an episodic style. Also, the latter film is best defined by its irreverent humor and hedonistic characters. Brewster McCloud, on the other hand, is more of a zany fantasy inhabited by bizarre characters who are not as sympathetic as the M*A*S*H characters.<br><br>Differences aside, the two films do have some traits in common. Many of the same players are in both films (Bud Cort, Sally Kellerman, G. Wood, Michael Murphy, John Schuck, Rene Auberjonois, and Corey Fischer). Also of note, BC is the debut of Shelley Duvall and marks the first of her many projects with Robert Altman. Moreover, both films have a detached narrator-type device which creates a middle ground in between  the viewer and the main characters. In M*A*S*H, it was the camp PA system; in BC, it's the eccentric ornithologist/lecturer character. Lastly, both films make subtle statements about certain flaws in modern America. In M*A*S*H, this can be seen in the incessant ridiculing of the US military and US foreign policy. In BC, use of civil rights era gospel music and pithy references to Spiro Agnew and Nixon poke fun at American hypocrisy and ignorant conservatism.<br><br>The Houston Astrodome is without question a major character in BC. The protagonist (played by Cort) has one ambition in life: to take flight with a pair of wings he himself constructs. He lives in the bowels of the dome and spends his time there designing and building the instrument of his dream. He's always in danger whenever he leaves his \"home\" and the protection of his guardian (Kellerman). Whether he goes to the zoo or to a dome tourguide's apartment, he is in danger of being harmed by bigoted, violent people. In a sense, Brewster is not a member of the human race, but rather a bird trapped in human form. He finds haven in the Astrodome, but this is temporary and confining. He ultimately wants the freedom that \"real\" flight will provide him.<br><br>The themes of freedom and temptation are important in this film. Brewster longs for freedom, but is hindered in his realization of his dream by various characters and personal mistakes. Brewster can potentially \"fly away\", but there is one important condition. He can never have sex with a woman. If he does, he won't be able to achieve flight because his female guardian (Kellerman) will no longer protect him. But in typical human fashion, he falls for a girl. This character (Duvall) is his eventual downfall - literally! In the end, the film conveys the message that humans are never truly free. We are always controlled or confined by something, be it other people or our own desires or even the roof of the Astrodome. The dream of achieving flight is a metaphor in this film for man's incessant but futile wish to be free.<br><br>If you have no interest in these plot or thematic elements, Brewster McCloud is still worth watching just because of its bizarre humor, recurring jokes, and odd characters. Listen carefully, for there are many subtle jokes and satirical remarks. The trademark Altman audio style is used consistently throughout and if you listen carefully, you're bound to hear something funny or witty. When watching this one on video, be sure to crank the volume up high so that you clearly hear all the layers of Altman's \"thick\" sound mix. The ending - the final ten minutes of the film - is very memorable and provides a great finish to all the previous events. Unlike so many films, this movie's ending is neither anticlimactic nor corny, but rather profound and dramatic. You won't forget it!<br><br>Robert Altman created an absorbing, humorous, zany, and profound film in BC. To succeed in all these areas is no small feat. This film is a breath of fresh air when compared to the tripe Hollywood churns out on a weekly basis in 1999. I praise the work of Robert Altman. He's one of the few American directors in the past thirty years who's made interesting, unconventional, challenging, and highly entertaining films on a consistent basis and with his own unique style. It's a shame that only a few of his films (invariably M*A*S*H, Nashville, The Player, and Short Cuts; very rarely McCabe and Mrs. Miller) can be found in video stores. The obscure gems like Brewster McCloud (Thieves Like Us and Three Women also fall into this category) are nearly impossible to see, unless you buy the videos off the internet. Considering all the garbage produced by Hollywood nowadays, I advocate a revival of all the Robert Altman films made between 1969 and 1977 (\"A Wedding\" (1978) marks the beginning of the decline of his work, some might say). Oh, well. It never hurts to dream. Every once in awhile, a great Altman flick is shown on premium cable. I guess that is as good as it will get.","user":"Freak-30","rank":[39,47]},{"title":"Bud Cort takes flight in \"Brewster McCloud\"","rating":10,"date":"21 May 2005","review":"This is one of the most interesting films I have ever seen! I own a copy on VHS and had the pleasure of seeing it 4 times at the Film Forum in New York City a couple of years ago.<br><br>After having seen Robert Altman's \"M*A*S*H,\" his next film about the story of a young man who is building a winged contraption in the basement of the Houston Astrodome intrigued me. I had to see how the cast came together in their varied segments in this film and I wasn't too disappointed.<br><br>Robert Altman saw something in Bud Cort after seeing him in a NYC comedy revue, and then gave him a role in \"M*A*S*H*, and was so impressed with him in the scenes he had in that film that he gave him is first leading film role. Altman couldn't have found a better actor to portray the lead in this film! I am a huge fan of Bud Cort's, and he kept me interested throughout in what was happening to the quiet and introverted Brewster, who dreams of flying away in a marvelously-made, flying machine. He lives a sheltered, and somewhat lonely life, other than the company of his lovesick friend Hope, who brings him food, and Louise, a strange woman who is like a mother-figure to him. Brewster doesn't say much in the film, but after a certain door is opened in his life, he becomes very talkative, and that talkativeness leads to a situation that jeopardizes his flight plans.<br><br>I thought the opening with Margaret Hamilton was funny, as well as the scenes Bud Cort had with Stacy Keach, made up as old man Abraham Wright, Brewster's former racist and mean-spirited employer.<br><br>I loved Sally Kellerman as Brewster's enigmatic and protective mother-figure, Louise, and Michael Murphy as the 'Bullit-esque' Frank Shaft, in Houston, via San Francisco, to help the police solve some suspicious bird-related murders.<br><br>The rest of the cast is fine, with the Altman touch of fine ensemble acting from the likes of John Schuck, G. Wood, and Corey Fischer. However, I found Shelly Duvall, who I've liked in other films, very annoying in this one, her film debut. She plays Suzanne, a girl who works at the Astrodome and becomes Brewster's love interest. I had rather seen Brewster become involved with Hope (Jennifer Salt), than the shallow and chirpy Suzanne. I find that most of her scenes, except for the one where she seduces Brewster, slow down the film.<br><br>Look for a delightfully strange comic turn by Rene Auberjonois, as the \"Narrator\" of the film.","user":"tiwannae","rank":[19,23]},{"title":"Classic Cult Classic: For the Birds","rating":15,"date":"15 September 2003","review":"This movie is a million things at once. Some may find that as a bit of a turn-off, but then that's what a cult classic film is really about, isn't it?<br><br>Brewster McCloud is a reclusive boy who lives in the basement of the Houston Astrodome. He has a short job as chauffeur for a miserly old man. He is looked down upon for his meek appearance and his quiet manner. He dreams of building himself a set of wings and using those to fly away from all this suffering.<br><br>That's how the film starts, anyway. There are three basic stories in the movie: (1) Brewster McCloud's coming-of-age story, (2) the parallel metaphor of Brewster McCloud's dream of flying away from worldly sorrow, and (3) the murders of people who mistreat Brewster and who all die with raven droppings on their faces.<br><br>The real irony of this film is how the character of the Lecturer keeps pointing out similarities between the characters and certain birds, and yet the ending comes around, and we learn how unlike birds we are. There is so much information about birds, you wonder if this was an adult remake of an after-school special.<br><br>Overall, I'll have to use the word most of the other reviewers have used: quirky. There are things which are very different. There is the Pythonesque beginning where, as a woman sings the National Anthem and the credits roll, she stops, tells the band to try again in the right key, and the credits restart as well as the singing. There are small bits such as when a police officer holds up a lighter when his partner says there's only one way to know for sure if there's marijuana in a cigarette. And there is my favorite character, the Lecturer, who lectures the audience about the behavior of birds while he himself starts making strange noises and begins pecking at seeds...","user":"PorridgeBird","rank":[22,28]}]