[{"title":"Good Cheese","rating":10,"date":"19 January 2005","review":"Chances are, if Michael Pare is the star of the movie, it is cheesy. Not necessarily bad, but cheesy. \"Streets Of Fire\", in my opinion, was great, but cheese notwithstanding. This movie is of the Mad Max ilk, but instead of fuel, it's water that is coveted. Adam Ant plays a Manson-type cult figure who is trying to rob Bruce Dern's town of its water/treasure, and Michael Pare comes in to help Dern with a pretty motley bunch. Adam Ant was quite good, and Bruce Dern was funny. Michael Pare was....well...Michael Pare. No one will confuse his body of work with DeNiro or Pacino, but if you like him, as I do, well, it doesn't make us bad people, does it? <br><br>If you are looking for \"Saving Private Ryan\", this ain't it. If you are like cheese, this beats Velveeta.","user":"delta_tau_chi","rank":[13,14]},{"title":"A Superb Futuristic Offering","rating":8,"date":"8 January 2003","review":"A great eighties film forgotten by people. Adam Ant portrays a great little villain in a surrounding of horror and endurance. A great array of oddball characters banded together as a team is wonderful to watch.<br><br>In some ways it reminds me of Battle Beyond The Stars, another great film along the same lines - a group of very different people set against a venomous evil. World Gone Wild - Highly Recomended film.","user":"randy_rascal","rank":[11,13]},{"title":"As opposed to girls gone wild...","rating":6,"date":"1 August 2006","review":"Bruce Dern stars as a hippie who gets his son (Michael Pare) and a bunch of other mercenaries to help fight of Adam Ant (Who starts a church of Charles Manson) in this strange post apocalypse action flick. The thing that makes this weird is the cast which includes Bruce Dern, Michael Pare, Adam Ant, Julias Carry, Catharine Mary Stewart and Anthony James who all are offbeat actors with different styles of acting. All that was missing was Wings Hauser. Still I must admit this was a lot of fun due to it's sheer weirdness. The movie has mutant cannibals, a church of Charles Manson and Bruce Dern as a pot smoking hippie fighter who leads a civilization of flower children. The romance angle between Pare and Stewart is extremely amusing mainly due to the fact that it is just so unlikely. Stewart is of course the resident babe found in these type of movies. Although I was amused to see Stewart scold Michael Pare and Co. for killing mutant cannibals and then laughing about it, to which she goes in a long winded speech about how they are all animals, to which gets (quite understandably may I add) the mercenaries to laugh even harder. The action sequences are for the most part well staged and Adam Ant is really good in the role as the bad guy who is the priest of the church of helter skelter. World Gone Wild is such a bizarre movie one only wishes that this would have turned out to be a television show or at least established some sequels because right here could have been the greatest TV show ever. You could have Pare and Dern protect these villagers every week from some new villain and develop the silliness of the relationship between Stewart and Pare. World Gone Wild is no classic but this is perfect fodder for the B.movie fan who has an appetite for guilty pleasure post apocalypse movies.<br><br>* *1/2 out of 4-(Pretty good)","user":"fmarkland32","rank":[5,5]}]