[{"title":"A Timeless Tale Of Ruined Lives","rating":13,"date":"13 March 2003","review":"There are spoilers in this review.<br><br>What a dark, brilliant film.  Audrey Hepburn, Shirley Maclaine, and James Garner are absolutely wonderful in this timeless gem of a movie.  The immutable power of a child's false witness is seldom portrayed better than in this film.  History has shown that just a few impressionable adults and one vengeful child can produce a mountain of misery:  for example, witness the abominations of the Salem witch trials or the Wenatchee, Washington child sex ring.<br><br>Karen Balkin is absolutely perfect in the role of Mary Tilford, the vicious little rich girl who easily puts Patricia McCormack from `The Bad Seed' to shame as she falsely accuses her teachers of having a lesbian relationship. She ruins several lives with her deceit, breaks up an engagement, shuts down a school, and destroys the loving bond of her family.  It is wrenching to watch the desolation that ensues because of her bald-faced dishonesty: yokels stop in front of the abandoned school and point and stare, a delivery boy smirks at them, and the whole town turns their backs on them.  The end of this film is unutterably sad and poignant; Maclaine, the best actor in the group, wrings every last bit of pathos from her character, and the devastation is unapologetically crystal-clear.<br><br>The unfairness of life and its attendant majority group of people who readily accept easily-believed lies was never made more lucid than in this film.  The sad thing is that this sort of thing goes on every day, all over the world, which makes this film a cautionary tale about judging your neighbor too quickly.","user":"bregund","rank":[61,64]},{"title":"Lillian Hellman's Women","rating":8,"date":"15 March 2018","review":"Lillian Hellman is an American Icon. A woman ahead of her time, in every department. Her women are never easy to read but they are real. From the icy Regina in \"The Little Foxes\" to the sisters of \"Toys In The Attic\" - Jane Fonda played her, brilliantly, in \"Julia\", Here, her women walked a slightly edgier plane.\"The Children's Hours\" was a big Broadway success and William Wyler, one of the best, directed the film version as \"These Three\" in the 1930's, washing away any reference to homosexuality. I think that may be one of the reasons why he remade it in 1961 under its original title \"The Children's Hour\" Audrey Hepburn, Shirley MacLaine, James Garner, Fay Bainter and Miriam Hopkins who also was in the original in Shirley MacLaine's part. The film is compelling and looks wonderful and I think it's more a document of its day by one of the most courageous writers of her day. The strange thing here is that the women are the ones who remain firmly in their day, they show us the outrage from their perspective and that's why it feels \"dated\" They would behave very differently today but not the rich southerners. I believe, they would also remove their children from the school. just like they did then. The oppressed have move on but the oppressors, have diminished in numbers, but they havent changed much. A fascinating film.","user":"totalwonder","rank":[41,43]},{"title":"Ripe for re-release!","rating":22,"date":"22 September 1999","review":"A 'classic' film, (whatever that may be), can almost never be re-made in quite the same way again.  It's something that we've thought about for quite a while, though - and noted filmmakers (including Gus Van Sant and Sydney Pollack) have tried and failed to re-make films to jazz up their appeal, and make them more accessible to a wider audience.  It's something that passed through my mind quite a few times as I watched \"The Children's Hour\" today. Quite clearly, this is a film that more people deserve to see and know about, and it would certainly be interesting to try and re-make it, but we would definitely lose something in the translation.<br><br>The largest reason for this is because it is a film of a definite period - the issues raised in the film are widely discussed these days, whereas in the period the film was set, homosexuality was something to be feared and despised.  Similarly, we do not have the various elaborate codes of honour that are so prevalent in the film, and dictate the actions of almost all characters.  It's a pity, then, that this film will be alien to lots of people today.  The answer, however, is not in a re-make (the film is itself a re-make of a 1936 film by the same director called \"These Three\", and an adaptation of a play of the same name by Lillian Hellman), but a re-release of this fine example of moviemaking.<br><br>Boasting a terrific cast including Audrey Hepburn, Shirley MacLaine and James Garner, \"The Children's Hour\" is the story of two teachers, Miss Dobie and Miss Wright, who found a school for young girls in an idyllic town in America.  Then, out of boredom, spite and plain maliciousness, a child tells a vicious lie that will bring about the downfall of the school, the teachers, and all caught up in the horrible set of affairs.  It is quite possible to see the creeping evil and hatred that stems from Mary, the child concerned (played wonderfully by Karen Balkin).  Eventually, it reaches out and destroys all it touches.<br><br>The photography is great (it was nominated for an Oscar) - there are many scenes which are so wonderfully composed that each frame paints a thousand words: the climax of the movie is a great example.  The relationship between MacLaine and Hepburn is delicately and sensitively portrayed, especially for a cast who didn't know what they were doing (according to MacLaine in an interview for \"The Celluloid Closet\").  James Garner is also good in his role as the doctor about to marry Hepburn, although the movie is clearly not aimed at giving him the best lines.  There are also many, many superb supporting roles - and the film's strength comes from a great ensemble performance.<br><br>It doesn't really matter what the child accuses the teachers of (indeed we only find out a good hour into the film, although it has been strongly implied), because the film isn't really about homosexuality.  As MacLaine points out in \"The Celluloid Closet\" (a cracking documentary about the history of homosexuality in the movies), it is about \"a child's accusation\". It is also about the power held by a town to bring about the downfall of two perfectly nice, perfectly ordinary young people.  The are lines in the film that one should never forget and it should also make us think about the way our words shape the situations in which we live: (\"unnatural\" is a great example).<br><br>All in all, a lovely film from director William Wyler (\"Ben-Hur\", \"Roman Holiday\", \"Funny Girl\"), and one that deserves to be seen by a wider audience - re-release, please!","user":"Chris-564","rank":[101,113]}]