[{"title":"Good sentimental favorite made even more enjoyable by the comedy of Richard Pryor.","rating":7,"date":"23 February 2001","review":"Over the years when nothing else is on I watch Bustin' Loose from time to time, it is such a good feel good movie. Neat story which has Richard Pryor as con man Joe Braxton who is maneuvered into taking a group of disturbed kids from Philadelphia, Pennsylvania along with their teacher Cicely Tyson to a farm in Washington state owned by the aunt and uncle of Cicely Tyson. This movie is a great journey of respect and friendship it shows just how that no matter how different people are they can become friends and learn to care and respect one another. This is not typical Richard Pryor you don't find much strong language but Pryor is plenty enough his comical and funny self to make this film a winner. So if you haven't seen this give it a watch it shows from time to time on cable. Probably one of the better movies of Richard Pryor.","user":"Brian-272","rank":[12,14]},{"title":"A nice family comedy","rating":7,"date":"7 July 2001","review":"This is a really nice film. I bought it on DVD and saw it last night. I had seen it various times through the years. Last night was the first time I had seen it in along time. Without Richard Pryor it could have been an after school special. I have always liked Richard Pryor in his films, he always played a normal human being, he never got into the supercop comedies like Eddie Murphy did. Pryor showed in this film that he could be tender as well as funny. It is a little gem of movie, very lite, but very funny and heartwarming.<br><br>Grade: B","user":"flicklover","rank":[11,15]},{"title":"Bustin' Loose shows some warmth as well as laughs from Pryor","rating":6,"date":"26 February 2008","review":"In reviewing African-Americans in film in chronological order for Black History Month, we're now at 1981 with Bustin' Loose. In this one, Richard Pryor is a small-time crook who gets a chance at redemption when his parole officer asks him to drive a bus of troubled children and his fiancée (Cicely Tyson) across country from Philadelphia to Seattle on the way to Tyson's family farm. That obviously doesn't sound like a hilarious comedy and there are indeed some scenes Pryor has with some of the kids that expresses more of his dramatic abilities, as heartfelt as some of those scenes may be. There's still some of his unique comic talents here that may make you glad you gave this one a shot like his attempted con of several TV sets in a bogus delivery truck or his fooling the Ku Klux Klan into pushing the bus out of a mud-hole because they think all the kids in it are blind! Then there's his cowboy disguise with fake accent near the end that made me laugh pretty hard. Ms. Tyson, normally a dramatic actress, has a few humorous moments of her own that puts her in a new light. Threatens to lose steam after a while but all in all, Bustin' Loose is nothing Mr. Pryor had to be ashamed about especially since he thought up the story and was co-producer. P.S. It was here that he set himself on fire when he freebased on cocaine.","user":"tavm","rank":[7,9]}]