[{"title":"More disturbing than any film I have ever seen","rating":9,"date":"31 October 2005","review":"An elderly couple (Hilda and Jim -- voiced by Peggy Ashcroft and John Mills) -- who have experienced WWII -- prepare for a nuclear war believing every word that the government says and expecting a short and happy outcome should the worst happen.<br><br>I have watched a lot of movies and I expect to watch a lot more movies before I am through, but I won't see anything quite like this one. If you think you have seen everything and had everything possible thrown at you from a TV/Cinema screen -- then think again. <br><br>When The Wind Blows must be the most disturbing film I have ever seen -- and it is a low budget cartoon with a PG certificate! The movie starts by playing for laughs and introducing us to the daily routine of our elderly couple.They are living in the past and think of war in a kindly way. This is to soften us up for what follows -- and what follows will stay with you for the rest of your life.<br><br>Having your emotions manipulated by cinema is nothing new, but this film uses real government information and very real scenarios.<br><br>If only more people could see this film and debate the messages it contains we would have a safer and better world.","user":"Pedro_H","rank":[76,78]},{"title":"A classic little cartoon of hugely disturbing proportions","rating":9,"date":"26 September 2002","review":"I remember when this was released in the cinemas in 1986 in the UK. It had a fairly small release, yet attracted a lot of publicity. I didn't see it till it was on TV one Christmas - not the right time to show such a film. I was still only eleven or twelve and found it far more disturbing than any Nightmare On Elm Street, Poltergeist or American Werewolf that I'd seen. The fact that the couple are so naive and innocent along with the sweet, old-fashioned comic-book style animation really manipulates the viewer so cleverly, that when the bomb hits and the true tone of the film reveals itself, the viewer is caught off guard just like the innocent couple are. You are plunged into the dark, deathly tone of the storyline and compelled to watch in the hope that this sweet couple will survive, whilst at the back of your mind, always knowing that they have little time left. It still has the same effect now on a third or fourth watching. It's so disturbing to see, yet something so compelling that you cannot turn away or turn off. As an historical piece of eighties cold war/anti-nuclear protest filmmaking, this is a timeless film that should be studied as part of history education when it comes to the 2080's and the world looks back a hundred years on a part of the 1980's that weren't so optimistic. This is a unique film that stands alone in terms of animation and stands out from all the typically optimistic, big and bright blockbusters of the eighties.","user":"theojhyman","rank":[87,90]},{"title":"Blimey, ducks - there's only three minutes to go....","rating":3,"date":"3 November 2002","review":"This film is an amazing contrast: its extremely dark subject matter is totally belied by the beautifully-drawn backdrops and sweet cartoon style. As adult animations are so rare this style grabs you at once, and it is impossible not to be gripped. Anyone who doesn't remember the Cold War should note that the advice about the doors and painting the windows white was the true advice at the time. Where this film is so effective is its perfect charicatures of elderly folk determined to keep the British stiff upper lip, with no idea about nuclear weapons. My grandparents are exactly like this couple, I could see my nan also bringing in the washing during the four-minute warning. We never see the couple's son but his refusal to adhere to the government's \"Protect &amp; Survive\" advice, singing the Tom Lehrer song down the phone to his father, is a far more realistic attitude towards what is about to happen. Living only 12 miles from London when I first saw this film I was inclined to agree with the son (and still do). Although the geopolitical map of the world is different now this is still an immensely valuable film as it shows what the risks were during the Cold War and is a chilling reminder that although the Cold War may be over, the weapons are still here. It could not be more different in presentation to the equally brilliant but far more horrifying Threads - but the message is the same.","user":"jane-83","rank":[49,51]}]