[{"title":"\"So what!\"","rating":10,"date":"4 June 2000","review":"The 1956 sociological study of the serious, but rarely spoken about, problem of armed robbery of gas stations perpetrated by affluent young women in tight sweaters during the mid 1950's is one that should surely receive further serious study. The footage of the \"criminal attack\" on the innocent young man on lovers lane by the beautiful, but depraved, bandits is one that I found highly disturbing. The expose became even more shocking as the pulchritudinous quartet were enlisted into the service of a foreign power, and during a particularly nefarious mission to overturn chairs and tables and knock over books in a classroom, they almost succeeded in doing something terrible to our flag. Also, during the latter mission, policemen, guards, and members of the evil gang were shot during a ferocious gunfight. At the end, the leader of the gang is finally sentenced to the state penitentiary where she gives birth to an out-of-wedlock baby. She dies and the baby is rightfully made to serve out the remainder of her sentence. Meanwhile, the affluent, but self-absorbed, parents of the wayward gangster are given several severe talkings to by the same judge who sentenced their daughter, and they are told to attend church more frequently in the future. This shocking expose was written by Mr. Edward D. Wood, Jr. I for one definitely intend to give a great deal of thought to the problem of bad girls in tight sweaters.<br><br>10 stars...or zero stars...? I don't know how to rate Ed Wood's anti-masterpieces. They're so bad that they go all the way around the dial and become great! Hilariously greatly bad. Not as hilariously greatly bad as Plan 9, but then what is?<br><br>Pan-10","user":"pan-10","rank":[42,49]},{"title":"1950's delinquent scare film","rating":5,"date":"8 June 2005","review":"You might think that this is going to be one of those films that's \"so bad it's good\" because Ed Wood is involved but the truth of the matter is that while it's undeniably silly it's still nowhere as bad as other efforts by Wood. Story is about a seemingly \"good girl\" named Paula Parkins (Jean Moorhead) who has nice parents and does well at school but the truth of the matter is that she's involved in an all girl teen gang that robs gas stations and assaults innocent couples necking at lovers lane.<br><br>*****SPOILER ALERT***** Paula along with Georgia (Theresa Hancock), Geraldine (Joanne Cangi), and Phyllis (Gloria Farr) commit these crimes and sell their loot to an older dame named Sheila (Lee Constant) who has connections(!) but the truth is that Paula enjoys her bad behavior for the thrill of it. They assault a man and his girlfriend and they end up dragging him into the woods where Paula rapes him! A few days later while ransacking the high school the cops show up and during a shootout both Phyllis and Geraldine are killed. Paula and Georgia are the only two left and they end up killing Sheila but they also crash their car into a plate glass window which kills Georgia. During the trial Paula learns that she's pregnant and her parents want to adopt her child but Judge Clara (I. Stanford Jolley) decides that they have proved themselves to be bad parents and the child will become a ward of the state.<br><br>This small \"B\" film was directed by William Morgan who was a very good film editor (Song of the South, Tarantula) but as a director he had modest success and I guess the best thing you can say about his talent in this field is that he was capable. Ed Wood wrote the script and while this may be thought of as one of his better efforts there are still enough funny lines to keep your expectations up like the detective who barks out \"They're not kids, they're morons\" but the most monotonous speech comes at the end of the film with the judge. After denying the parents wishes to adopt their granddaughter Judge Clara starts getting a glazed look in his eyes and starts this long and meandering speech about moral obligation and mutters things about families getting back to respecting the 10 commandments and taking care of matters by using the good old woodshed. I'm guessing that Wood was just trying to add padding to an already very short film! A couple of things also stand out for me like the Madonna torpedo bra's that are worn and the fact that Phyllis gets shot by a shotgun but acts like she was hit by an arrow instead! How about the guy who gets raped by Paula? What was he screaming for? Maybe he had never gotten to home plate with a girl before but I came away thinking that Paula must have been very horny! Because Wood's name is in the credits most will automatically think that this is one of Ed's bad films but the truth is that Morgan's direction is adequate and Wood's script has a good edge to it considering it was made in 1956. Sure it's laughably outdated but for me that's part of it's charm and appeal and those who are interested in scare films involving juvenile delinquency this effort probably deserves a peek.","user":"rosscinema","rank":[17,21]},{"title":"Unique","rating":12,"date":"12 August 1999","review":"This film is pretty steady and mediocre (you can tell Ed didn't direct it), lacking the weirdness and spastic nature of Wood's other films. But, it also happens to be the only film you'll ever see where a MAN IS RAPED BY A GANG OF GIRLS! A truly unique moment in film history.","user":"Quetzl","rank":[18,24]}]