[{"title":"The Purple Plain","rating":10,"date":"5 June 2006","review":"I suppose the reason why I loved the film so much was that I was actually watching the film being made in Sigaria in Ceylon (Now Sri Lanka). I was part of an RAF Police team from RAF Columbo called to investigate the theft of some property from the set of the film. The visit also gave me the opportunity to actually have breakfast with Grgory Peck before the days shooting. I was astounded by the amount of detail that went into the making of the film, and the amount of responsibility put upon Jean, the continuity girl. Gregory Peck was a perfect gentleman, and I was so proud to actually be introduced to him by Brummie Benson, an RAF extra on the film set. To me, the film depicted courage at it's best, and as said by a previous critic , a simple story, with no over blown heroics,a good and believable cast, and a most enjoyable though somewhat predictable conclusion. But, NO bad language..... It's a pity more films of today cannot follow the same pattern. In all a very good example of the Royal Air Force at it's humble best, and a credit to the J.Arthur Rank Studios for its production","user":"roy-buswell","rank":[86,89]},{"title":"Peck at his most enigmatic","rating":7,"date":"4 September 2006","review":"A pot-boiler of a Film that is intelligently crafted by Director Robert Parrish. To some it may seem intolerably slow &amp; lacking pace, but to others like myself the Film does something that nearly all Films in the Fifties and indeed many now do not even attempt to achieve, and that is take the time to investigate the main characters in depth and in detail. This is done not via long tracts of dialogue, but via the un-said. In particular Peck and the astonishingly beautiful and talented Win Man Than as 'Anna' develop their relationship in the Film in the subtlest and most delicate of manners. I can find no further information on Win Man Tan, but her performance in this period piece, is one part enchanting, one part mesmerising. We understand fully how Peck's psychiatric problems eventually dissolve as hie begins to find perspective courtesy of love for 'Anna'. This Film is not staggering nor the best piece of Cinema you will ever see, but it is superbly acted, wonderfully cast, sparingly written, adroitly directed, and deserves to be watched by anyone who has a love of Cinema. Recommended, because what we see at our Cinemas today has MUCH to learn from Movie making such as this.","user":"mwarburton","rank":[50,51]},{"title":"Unusual, well written, acted and produced love/war movie.","rating":9,"date":"11 November 2004","review":"This is a Rank Company (British) medium budget production of a post war H. E. Bates novel. Well directed by Robert Parrish, the screen writing by Eric Ambler is quite good. It was shot on site in, what was then, Ceylon. (Same location as \"Bridge on the River Kwai\") <br><br>The young Gregory Peck plays Bill Forrester a Canadian pilot in the RAF serving in far off Burma in the closing months of WWII. He flies a two seat Mosquito fighter-bomber. (The actual aircraft was provided through the cooperation of the RAF and repainted in accurate camouflage and markings, for once.) Forrester, it seems, has gone \"round the bend\" after losing his new wife in the Blitz. He's self destructive, wanting to end it all in combat. \"You'd think that would be easy in a war\", he explains to Anna, \"but I just kept getting medals instead.\" Anna is a small, slim, pretty teacher, played very well by Win Min Than, a Burmese actress (how refreshing). They, of course, fall in love (It's a MOVIE, folks) and his life really seems to be turning around. But, on a routine flight, he and two others go down in a very remote desert area of Burma's central plain (hence, the title). From there on we have a rather good, believable survival saga.<br><br>The English love eccentric characters and this story has several, all well depicted by some of those fine performers who bounce back and forth between the British \"legitimate\" stage and cinema. Watch for Brenda De Banzie, who plays Miss McNab, an elderly missionary. (Ya couldn't miss her!)<br><br>The Purple Plain is a good movie, a fine movie really. Not too heavy, it's historically accurate with good production values. Forrester's growth curve coming out of his personal hell is quite interesting. I found the depiction of the native Burmese was respectful without being condescending. For instance, the love between Bill and Anna is portrayed in a very reserved manner, as it would be between a Westerner and a Christian Asian woman in real life. All in all, the story line and performances are very believable and very enjoyable. I highly recommended The Purple Plain, if YOU can find it.","user":"SmilingBrian","rank":[59,62]}]