[{"title":"Trailblazing \"Saddles\"","rating":10,"date":"14 December 2003","review":"A few years ago, Broadway producers decided to adapt a Mel Brooks comedy and made a bundle. Could it happen again with 'Blazing Saddles?' The movie already has four great songs; a half-dozen more of similar caliber would make for a strong score. 'Blazing Saddles' has a ready-made cast of over-the-top characters, strong audience identification, and some minor problems for a theatrical production (like blowing up the phony Rock Ridge) which are easily overcome.<br><br>But 'The Producers' was a cult film that never made it to Main Street and needed the second act of a Broadway musical to give it a place in popular culture. 'Blazing Saddles' could never open again as big as it did in 1974. In the summer of Watergate and Patty Hearst, here was one bit of madness people could enjoy. And it wasn't just random kookiness, but a film that broke barriers and courted controversy like no other major-release film of its time. No other movie had characters that were basically likable if stupid throwing around the 'N' word before. In fact, it hasn't happened since (and I doubt it would on Broadway today.) The whole notion of white people and black people living together was not new, but the approach of 'Blazing Saddles' was certainly new. In order to live together, we have to laugh together first. The only way this film was not a trailblazer was in that it blazed trails untaken by any film that came after.<br><br>Was Cleavon Little then a civil rights pioneer for the 1970s, in a way Martin Luther King and Malcolm X were the decade before? He's very good, bringing a lightness to the role that's equal parts Shaft and Bugs Bunny. Richard Pryor was one of the film's writers and Brooks' first choice for Sheriff Bart, but Pryor wouldn't have played the role in the same smooth way. Little is an amiable actor, one step ahead but never cocky about it. He makes for a sympathetic center, and he is flash in those corduroy threads.<br><br>Little didn't work much after 'Blazing Saddles,' which makes no sense. It was only the highest-grossing Western of all time, and Little was the lead actor in it. Maybe institutional racism wasn't the sole cause. After all, he had a distractingly rock-solid cast around him, particularly Harvey Korman as Attorney General Hedley Lamarr. Growing up in the '70s, it was a shock the first time I saw the unedited 'Blazing Saddles' with all the casual vulgarity spewing from the mouth of Tim Conway's slapstick buddy on the ultra G-rated 'Carol Burnett Show.' 'You will be only risking your lives, whilst I will be risking an almost-certain Academy Award nomination for Best Supporting Actor,' he tells his gang before they ride off to pillage Rock Ridge. If only the Academy didn't penalize comedies so, that might have been true.<br><br>Madeline Kahn did get nominated for Lili Von Shtupp, and deserved her Laurel and Hardy handshake for sure. Her Baba Wawa meets Marlene Dietrich performance is a comic masterpiece, and it takes guts to wear that dead-weed lingerie in which she performs 'I'm So Tired.' Slim Pickens (Taggart), Burton Gilliam (Lyle), Dom DeLuise (Buddy), and Brooks himself as 'the Gov' all shine, and the level of comic acting remains high all the way to the smallest roles, like the guy playing Hitler ('They lose me right after the bunker scene') and the cowboy who chews gum in line ('I didn't know there was gonna be so many people!')<br><br>Gene Wilder is a little young and ironic for the bitter ex-gunslinger known as the Waco Kid, but he grows into the role well enough. Certainly he was in tune with what Brooks was doing more than Gig Young or Dan Dailey would have been (Brooks' earlier choices for the part, with Young making it all the way to the first day's shooting before it was discovered he wasn't just acting the part of a hopeless drunk.)<br><br>'Blazing Saddles' doesn't make the IMDb top 250, but it's still one of the most significant video titles because it rewards repeat viewings so well. The wholeness of the film's comic spectacle is too dense to be absorbed in one viewing, especially when you are laughing too hard. It's a cultural landmark, yes, but it's even funnier now than it was 30 years ago, one of the funniest comedies that exist today. Making it into a musical now would almost be demeaning, but I suspect it will happen anyway.","user":"slokes","rank":[127,147]},{"title":"Hey! The sheriff is a ni... BONG!!!!","rating":10,"date":"16 March 2005","review":"Remember the days when humanity could laugh at itself? Blazing Saddles is a film that takes us all back to a more innocent era. An era where PC was just a couple of letters stuck together. I'll get this out of the way first: To all of you pc commies out there... the racism in this film is there to MAKE THE WHITE PEOPLE THE BUTT OF THE JOKES!!!! There is not a single person of color in this film who plays a negative character. The rednecks are what this film is really making fun of. I think most people realize this (hence the 7.7), but there are still a few who don't.<br><br>This is such a funny film. From the opening scene along the railroad tracks to the shot of Gene Wilder and Cleavon Little riding off into the sunset in a limo, the film provides an endless stream of laughs. Every time a person views this film, they can notice something truly hilarious that they may have missed the last time. Mel Brooks doesn't always hit the mark with his comedy, but this film was by far his best effort.<br><br>Cleavon Little and Harvey Korman give the best performances in my opinion. I think Cleavon Little stole every scene in every film I saw him in. He died way too young, and I wish he could have acted in more films. Korman's Hedley Lamar character is a real hoot. By the end of my most stressful days at work, I often find myself talking to everyone in his voice. So evil, and so calculating! He and Slim Pickens played off each other flawlessly.<br><br>Good luck catching an un-edited version of this classic anywhere but on the DVD. Forget about any kind of an effective remake, either. Not in this day and age.<br><br>Don't miss this film! 10 of 10 stars.<br><br>So sayeth the Hound.","user":"TOMASBBloodhound","rank":[209,250]},{"title":"shame on AMC","rating":10,"date":"10 December 2009","review":"I keep hoping that one of these times, AMC will show an un-edited version of this film. It is really disturbing and disheartening that the PC crowd is able to get this once superb movie channel to censor the films it runs. If I were Mel Brooks I'd be more than a little upset over this wanton editing of an otherwise classic movie. If AMC does this to Blazing Saddles, how many other films are facing the censor's knife or edit button so that AMC can safely assure itself that, by bowing to the beast of political correctness it isn't offending anyone. It makes one wonder how the decision to edit this film was made; was it just some folks sitting around and decided, \"hey, we can't show this stuff?\"","user":"bill-688","rank":[20,21]}]