[{"title":"Go Yeti!","rating":9,"date":"18 February 2008","review":"I just stumbled across a copy of this film recently on DVD, and consider it a very good find.<br><br>Since a kid, I've had a (somewhat) continuing fascination with Bigfoot, Sasquatch, the Abominable Snowman, etc. However, this is the first time I've come across a film that treats the subject intelligently, and with more thought than just providing a simple scare. This film was well acted, written (intelligently so) and directed, and created a genuine sense of suspense, and maintained an eerie mood throughout. You don't see the creatures full-on, but that's to the film's benefit and better over-all effect to those watching, especially in the almost film noir use of black and white photography.<br><br>This is no cheap monster quickie, or faux documentary (though I like some of those too), and though fairly low budget, it's still good.<br><br>So basically, I'd have to say this is the best film about the Abominable Snowman (or Bigfoot-like creature) I've seen. Like the Yeti...seek it out!","user":"armandcbris","rank":[17,17]},{"title":"Interesting take on what could have been a lousy movie","rating":7,"date":"17 January 2005","review":"I just saw \"The Abominable Snowman\" today and was pleasantly surprised by the film. When I read the preview for it on the TV it was under the Horror category, and knowing it was made in 1957, I wasn't sure I wanted to see it in fear that it would be too out-dated to be enjoyable. But what the movie did was, at a relatively quick pace, told a story of 5 men who travel into the Himmalayin mountains in search of a Yeti. As our travelers progress, we find out that not everyone has the same intentions for this creature. One thing I liked about this movie is how they don't show the creature fully, allowing people to enjoy the movie years later without ever having to worry about why the Yeti looks so stupid and fake. <br><br>*Possible Spoilers* In my opinion, one of the best things about the movie was how the entire plot set up the Yeti to be a fierce and man-eating creature. But the doctor realizes that the creature may not be this terrible monster but instead, a species that is saddened and hidden away in the cold mountains, away from humans. The final encounter with the creature proves this, when we see that their face doesn't resemble a monster but much more human-like. <br><br>Overall, I give this movie a 7.5/10 and I recommend it because it makes you think at the end, something most horror movies truly don't.","user":"MOONSALT90","rank":[13,13]},{"title":"Thrilling combination of adventure and horror with a message","rating":9,"date":"18 January 2005","review":"Dr. John Rollason (Peter Cushing), his wife, Helen (Maureen Connell), and a colleague, Peter Fox (Richard Wattis), have traveled to a remote location in the Himalayas, ostensibly to study rare plant specimens. However, Helen and Peter soon learn that John had an ulterior motive, when he reveals that a ragtag group of explorers, headed by Dr. Tom Friend (Forrest Tucker) are on their way to meet up with John. They plan to lead a small expedition further into the mountains, in search for the infamous abominable snowman, or Yeti.<br><br>The Abominable Snowman is a marvelous combination of adventure, horror, and a film with a broader message. The beginning may seem a bit slow to younger viewers, but it is crucial to the plot, and Peter Cushing, as always, turns in a tremendous performance. The monastery setting seems authentic, as do the climbing shots that follow, even though most of the film was shot in Hammer's UK studios and the mountains are actually the Pyrenees in France.<br><br>It doesn't take long for director Val Guest to build tension, first dramatically with the ulterior motive revelation and the conflict is causes between John and his wife, then during the Friend expedition's climb, and most importantly, when our crew nears the Yeti. Because the creature effects, especially in the 1950s, can't rival the viewer's imagination, Guest wisely keeps the creatures off-screen for the bulk of the film, and when we see more, it's in heavy shadows. This makes the Yeti material extremely effective.<br><br>The message at the end is sincere and poignant, as it also would have been at the time of the film's release, when anthropological exploration of seemingly alien cultures was still regular, captivating news.<br><br>Overall a 9 out of 10 for me, and very close to being a 10.","user":"BrandtSponseller","rank":[41,46]}]