[{"title":"Marvyn Leroy and Busby Berkeley, what a combination!","rating":10,"date":"3 December 2005","review":"\"Golddiggers of 1933\" is a fun movie to watch because all the right elements that went into the making of this motion picture. Mervyn Leroy was truly inspired, and his direction clearly shows he was in total command. The contribution made by the incomparable Busby Berkeley is one of the best things in the film. His choreography for the big production numbers is one of the most impressive thing he did for the movies.<br><br>The film is a sweet story about young hopefuls in New York trying to make it in the musical theater. Thus, we find the impoverished room mates, Carol, Trixie and Polly, who are so poor they have to steal their neighbor's milk! These young women are at the end of their rope when Barney, the Broadway impresario comes by to tell them about the new show he is working on. The only trouble, he has no money for it.<br><br>How naive and wonderful those movies that came during the great depression were! Everything was possible, in spite of what was happening in the country at the time. In fact, this film, as well as others of that era, served as an excuse for people that were facing a hard time making ends meet for escaping it all when watching a movie like this one.<br><br>The cast is excellent. Warren William, Joan Blondell, Aline McMahon, Dick Powell, Ruby Keeler, Ned Sparks, Ginger Rogers, and Guy Kibbee giving performances that endeared them to the American public of the time.<br><br>The production number of \"Shadow Waltz\" has to be one of the best ones in this musical genre ever produced. The number is an amazing one and a tribute to the man who staged it, Busby Berkley. It also help the chorus girls were dressed by Orry-Kelly and the music was by Harry Warren and Al Dubin.<br><br>\"Golddiggers of 1933\" is one of the best movies to come out of the Hollywood of those years.","user":"jotix100","rank":[47,50]},{"title":"Great Pre-Code Stuff","rating":9,"date":"25 January 2006","review":"This is the most perfect example of \"history on the silver screen\" that I can think of. When Ginger Rogers says, \"It's the Depression, dearie\" at the beginning to explain the chorus girls' bad luck, it's the key to the whole film. While the \"Shadow Waltz\" number was being filmed during an actual 1933 earthquake in L.A. a number of the girls toppled off the Art Deco \"overpass\" where they were swaying with their filmy hoop skirts and their neon violins short-circuited. The electrical hook-ups were also rather dangerous, especially if the neon bows came in contact with the girls' metallic wigs in that number. The culminating production number, \"Remember My Forgotten Man,\" is the most significant historically and illustrates Warner Bros.' \"New Deal\" sensibilities. Warner Bros. was the only studio that \"bought\" the whole Roosevelt approach to economic recovery. The year before, under Hoover, WWI vets were not only neglected in terms of benefits but were run out of their shanty town near the Capitol building. Starving guys were camping on the edges of most communities who'd served in the Great War fifteen years before. Of course, why or how this number fits into such a '30s girlie-type musical revue is anyone's guess. Berkeley never looked for reality, just eye-popping surrealistic effects.<br><br>About ten years ago I found myself sitting next to Etta Moten Barnett at a Chicago NAACP banquet. I was flabbergasted. She was in her 90s yet still looked lovely. She's the singer who sang \"Forgotten Man\" in the window. She also sang \"The Carioca\" in Astaire and Rogers' first pairing, \"Flying Down to Rio.\" She was quite gracious, though she did not have wonderful things to say about Hollywood of that era. The African Americans in both pictures were fed in a tent away from the general commissary area. <br><br>Ruby Keeler has a certain odd-ball appeal, like a homely puppy. She can't sing, she watches her leaden feet while she dances, and almost all her lines are read badly. Yes, she was married to Al Jolson, but that may have HURT her career more than anything. He was not exactly always likable. He was much older than Ruby and so full of himself. <br><br>This film is also a classic example of the PRE-CODE stuff that was slipping by---the leering \"midget baby\" (Billy Barty), the naked girls in silhouette changing into their \"armor,\" the non-stop flashing of underwear or lack of underwear, Ginger Rogers having her large coin torn off by the sheriff's office mug so she's essentially standing there in panties, and so forth.<br><br>A good comparison of before and after the code would be to examine this picture and \"Gold Diggers of 1935.\" The latter is so much more chaste, discreet, and less fascinating except for the numbers. There's not the lurid, horny aura of the Pre-Code pictures. And it's not quite as much naughty fun, either.","user":"deuchler","rank":[79,87]},{"title":"ereway inay the oneymay!!","rating":31,"date":"31 October 2003","review":"I've heard of this movie for years, but didn't actually see it until last week when Turner Classic Movies ran it. And it is positively stunning!! On the surface, it moves almost like a carbon copy of 42ND STREET- right up to the last-minute switch in players before the curtain goes up (although in this film, it's Dick Powell instead of Ruby Keeler). But its astringent look at trying to play Tin Pan Alley smack in the middle of the Depression gives it a very adult and tragic significance. It still has the Berkley dazzle- from the \"Shadow Waltz\" chorus girls (and electric violins) to the now-legendary \"We're In The Money\" dress rehearsal fronted by a pre-Astaire Ginger Rogers. (I was a teenager when my mother mentioned that one verse of this song was actually sung in Pig Latin- and I swore for twenty-five years that she was pulling my chain. It is one of the cleverest vocal interludes I've ever seen and heard.) But the three girls implied in the film's title- Ruby Keeler, Aline McMahon, and especially the sharp, smart, and gorgeous Joan Blondell- are the best things in the movie. And Blondell fronts the sublime finale number \"Forgotten Man-\" which pays tribute to the men (and women) of WWI and the ironies which followed. The staging of it- the marching which goes from triumphant to tragic, the torchy, gospel-like vocal of Etta Moten (the black woman sitting in the window), and the pullback shot of everyone coming downstage at the fadeout- is truly spectacular.","user":"movibuf1962","rank":[37,40]}]