[{"title":"Sequel? Prequel? Hard to tell, but it has some laughs","rating":11,"date":"11 January 2005","review":"The germination of the \"Pink Panther\" series of comedic mystery films is a complicated one. The first film in the series, \"The Pink Panther\", was actually the second one to be filmed! This film, \"A Shot in the Dark\", was originally intended to be the adaptation of a stage play, but director Edwards and actor Sellers refit the main character to accommodate the persona of Inspector Clouseu, which they were developing for \"The Pink Panther\". However, when the film was completed, it wasn't released and was deemed unfunny. Then when \"The Pink Panther\" was a hit, the studio released \"A Shot in the Dark\" as a sequel and a series was born. This explains why elements from the first film are absent from the second (Mrs. Clouseu anyone?) and why the second (actually first!) set the tone for the following films more than the first (actually the second! Confused yet?) Here, Sellers is front and center as the hapless and ever-clumsy Inspector. Freed from sharing screen time with a higher billed co-star (David Niven in the previous film) and without a particularly coherent plot to follow, he is allowed to engage in pratfall after pratfall and scenario after goofy scenario. Today's audiences may not completely go for the subtle, meticulously timed method of comedy shown here with emphasis on set up and repetitiveness, but patient and observant audience members should still find the film funny. By now, so much of the material has been cribbed or expanded upon, some of the edge is lost, but enough of the humor and situational gags are amusing enough to make the film worthwhile. Sellers insists upon the innocence of curvy stunner Sommer, a maid who has been found in a locked room with a dead body and a smoking gun in her hand. Time after time, he lets her out of prison and the body count increases. His thorough incompetence drives his superior (Lom) to insanity. Sommer's employer Sanders, a man of great wealth and taste, is also appalled by the bumbling Sellers, never more so than when he manages to practically trash a billiard room during a friendly game. One famous sequence has Sellers tracking Sommer down in a nudist colony. The modest Inspector navigates the idyllic hideaway using any available object to cover himself as the campers frolic behind shrubs and other props. Reed glams it up, but gets little to do as Sanders' bitchy wife. Another memorable sequence has Sellers and Sommer on a date with victim after victim falling prey to an assassin that's after Sellers. It's all a farcical enterprise that one must be in the mood for to fully enjoy. Otherwise, it becomes a little tiresome, but fans of physical comedy ought to lap it up. The remaining sequels were all sort of hybrids of \"The Pink Panther\" mixed with \"A Shot in the Dark\" and had fair success until the death of Sellers made it difficult to continue (but continue they did, using outtakes and other footage of the man! Anything to make a buck!) Henry Mancini provided some nice music, notably over the animated title sequence.","user":"Poseidon-3","rank":[65,77]},{"title":"Considered The Best Of The Series","rating":8,"date":"27 April 2006","review":"The second of the Pink Panther series, this is considered by most critics as the best of the lot, and for once I have to agree with them. It's almost a one-man show with Peter Sellers (\"Inspector Jacques Clouseau\") exhibiting his comedy talents, most of it the slapstick variety as he constantly runs into things and-or falls down. Some of that gets tiresome after a while but most of it works and gives the viewer a lot of laughs.<br><br>It was nice, after these years, to see the production in 2.35 widescreen. It made the photography a lot more impressive than the formatted-to-TV VHS. I had never realized how nice this movie looked. The sets in here - mainly George Sanders' apartment interior - were good, too, and Elke Sommer was always nice to ogle back in the '60s.<br><br>Sellers' boss, played by Herbert Lom, wasn't that funny but Burt Kwoul as \"Kato,\" Clouseau's \"trainee\" is fun to watch in all his sneak attacks. Sanders was funny, too, and he didn't have to say a word to get a laugh. Just the deadpan looks on his face as he watched \"Clouseau\" bumble around were priceless.<br><br>This is a bit slow in the beginning, but once it picks up it's funny the rest of the way. From a film history angle, it was interesting to see how morals had begun to change and how rules were becoming relaxed. In here, director Blake Edwards went out of his way to show cleavage of Sommer and there was an implied sex scene you wouldn't have seen a decade earlier. Also, in the end - although played for laughs - it turns everyone was having an affair with somebody.","user":"ccthemovieman-1","rank":[53,63]},{"title":"2nd Pink Panther film is the best","rating":8,"date":"15 January 2000","review":"A Shot in the Dark came out the same year as The Pink Panther, the film that introduced the world to the bumbling French detective Inspector Clouseau. In this second installment, a man has been murdered and all the evidence points directly to the beautiful Elke Sommer (including the murder weapon, which she's holding as she stands over the body!). Clouseau, of course, insists she's innocent and that he will prove it! Which just accelerates the process of driving his boss (Herbert Lom) insane. Clouseau, determined that Sommer is innocent, releases her from jail, thinking she'll lead him to the real culprit. Of course, other people die along the way, and each time Sommer's put back into jail, Clouseau doggedly releases her. The best part of the film? A scene in a nudist colony, where the bashful Clouseau must find Sommer and talk to her - when the police arrive to investigate yet another murder, they both leave the colony sans clothing. The sight of them driving through the streets of Paris completely nude (although we don't see anything naughty, of course) is priceless.<br><br>If you want to see Pink Panther films, do yourself a favor and begin with this one - it's as flawless as Clouseau is incompetent!","user":"dfranzen70","rank":[43,52]}]