[{"title":"The Shovel is My Pick","rating":6,"date":"24 April 2003","review":"Considering how late in their career this came, and how lame some of its predecessors were, this one is not too bad. And it's a joy to see some of the wordplay they were famous for make a welcome return amidst the routine slapstick. Sure, \"Take your pick\" \"The shovel is my pick\" is not on the same level as \"Who's On First?\", but it's still amusing enough, and it's fun to see them deal with one last Universal monster. 6/10","user":"richard-mason","rank":[14,14]},{"title":"A Fond Farewell","rating":5,"date":"28 March 2005","review":"When the murder of an archaeologist puts a valuable medallion into their hands, Abbott and Costello waste little time in trying to sell it--only to find themselves pursued by police, a slinky adventuress, an Egyptian high priest, and the mummy himself. The concept is amusing, but the real charm of any Abbott and Costello film is the charismatic comic interplay between the stars. Unfortunately, the 1955 MEET THE MUMMY finds the two at a creative low ebb.<br><br>Featuring such notable character actors as Richard Deacon and Marie Windsor, the film is competently made and very easy to watch, but to say it lacks the inspiration of Abbott and Costello's best work would be a tremendous understatement. At most, MEET THE MUMMY is mildly amusing in a broadly slapstick sort of way, good for an occasional chuckle at best. It would be their last film at Universal and their next-to-last screen appearance together, so it might be best regarded as a fond farewell.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[18,20]},{"title":"Good But BY NO Means Great","rating":25,"date":"25 November 1999","review":"This was the last feature for Universal that the two box office champs of the 40s did.  Having met Frankenstein, Dracula, the Wolfman, Dr. Jekyll, Mr Hyde, and the Invisible Man...Universal paired the two comedians with their mummy for one last go-round.  The effort is not entirely satisfying, yet all together bad either.  Bud and Lou seek their fortunes in Egypt when brought into a circle of intrigue, murder, and a curse of a mummy.  The rest of the film centers around their bumbling, situational comedy, and a couple of dance hall numbers.  The sets are pretty good, but the make-up for the mummy is definitely sub-par for the studio that brought us The Mummy in 1932. Richard Deacon stands out in a supporting role.  Some pleasant scenes involve Bud and Lou playing hide-go-seek with a dead body(much like was done in A&amp;C Meet the Killer), a trio of mummies treading through a hidden fortress, and a routine of Bud and Lou playing revolving hamburgers.  Not their best to be sure, but sure to bring a smile to you.","user":"BaronBl00d","rank":[21,24]}]