[{"title":"Underrated effort with some great moments","rating":8,"date":"31 October 2008","review":"\"Abbott and Costello Meet Dr. Jekyll and Mr. Hyde\" is a slightly underrated entry in their series.<br><br>**SPOILERS**<br><br>Failing to stop a fight in a crowded park, London Police Officers Slim, (Bud Abbott) and Tubby, (Lou Costello) are kicked off the squad. When they find a serial killer at a playhouse where the leader of the fight, Vicky Edwards, (Helen Westcott) is giving a dance performance, Bruce Adams, (Craig Stevens) and them give chase and try to trap him, only to find they have instead caught Dr. Henry Jekyll, (Boris Karloff) a respected member of the community. Finding a secret lab, which they believe is the place where he conducts his experiments, which turn him into the murderous Mr. Hyde. Teaming together, they race to get the monster before it is able to escape.<br><br>The Good News: This wasn't that bad of a film. The greatest thing is that Jekyll/Hyde story, which was always really a modern reworking of the werewolf myth with the mad scientist's laboratory in lieu of the full moon and silver bullets, is that this version of the Jekyll/Hyde story moves far closer to it's werewolf ancestor than most other versions. It's found in the prehensile design of the makeup and mostly in the last scene which has the monster threat being passed on to a line of police officers via a series of bites. The ending is it's most creative aspect, bringing the two mentioned themes into a film that haven't been mixed together in the past into a story that meshes them brilliantly is to be commended for it. It is also, at times, pretty funny, with plenty of great slapstick coming in throughout the film. The wax museum and dressing room gags are fall-down hilarious, and the round-robin stalking scene around a roof-top air conditioner allows for some nice laughs as well. With plenty of head-smacking, mistaken identity and pratfalls to be found as well, this can be just as funny as their other adventures. The wax museum sequence stands out as the film's highlight, as it's highly original, wonderfully played out, immensely creepy and full of energy, with nary a second wasted. It's one of the best scenes in their catalog, and remains quite good overall. The chasing at the end is a good way to end it, but lacks the energy of what came before. The opening attack, taking place in the fog-covered buildings, is suitably atmospheric and is a great opener. With a really good pace to it, this has a lot to like about it.<br><br>The Bad News: There isn't a whole lot here that wasn't good. One of the problems was the feminist subplot. While introducing the love angle that was to come, it doesn't serve any purpose beyond the first fifteen minutes beyond a fleeting moment at the ending, and there was a lot of other ways of getting the two together without forcing the angle upon the viewer. The few plot-points it gets easily could've been done in other fashions, and doesn't do much of anything beyond wasting screen time. It's thankfully dropped and forgotten about quite early in the film. Another problem is the repetitiveness of everything. Searching a possible hideout, everyone splits up, leaving the easily-scared one of the group to find the one responsible, go into a hysterical fit upon this, and run away in a comical manner, to be rejoined by the others and have his story laughed away as something. It's been done in their other ones, and doesn't really do much here other than provide a few giggles the first time, but wears thin upon repeated viewings. Beyond these, though, it's a fun entry.<br><br>The Final Verdict: A really underrated entry in their series, this one was a lot of fun and provides what is to be expected of these films. It provides plenty of opportunities for slapstick while giving a serious threat star treatment. At the very least, it requires a look-see for fans to give it a shot, it's not as bad.<br><br>Today's Rating-PG: Violence","user":"slayrrr666","rank":[9,10]},{"title":"Oldie but still a goldie.","rating":7,"date":"31 July 2006","review":"Have just sat down and re-watched this film with my 3 kids and can definitely say that they loved it. Although by this time in their careers Abbott &amp; Costello's top movie double-act crown was being swiped by those new kids Martin &amp; Lewis,this movie was a box office smash when first released and still holds up well today. The mixture of comedy and horror works a treat as it had done in \" Meet Frankenstein\" a number of years earlier and Karloffs performance adds real class to the tomfoolery on screen. Of course the Universal depiction of turn of the century London,( all fog shrouded streets and fish &amp; chip shops ) leaves a lot to be desired,I think it adds to the films charm in much the same way as when used in the Basil Rathbone Sherlock Holmes mysteries of the same period. Bud and Lou carry off their roles well and the romantic subplot seems not to intrude as much as in the boys earlier wartime comedies. All in all a good little film to be watched on a rainy Monday afternoon.","user":"stevemullin","rank":[9,10]},{"title":"One's Inner Hyde","rating":6,"date":"13 September 2010","review":"Watching Abbott&amp;Costello Meet Dr. Jekyll And Mr. Hyde the only thing that struck me wrong was the casting of Craig Stevens and Helen Westcott as the young lovers. Both are completely American and have absolutely no trace of English speech pattern for a story set in Victorian London. Even Bud and Lou's presence in the film is explained that they are Americans studying English police methods. Which begs the question, what police force in America would hire them?<br><br>The cultivated Dr. Henry Jekyll is played by Boris Karloff, but his Jekyll is not the scientist that we saw Fredric March and Spencer Tracy play. He's well into his experiments that now have him change without warning into Mr. Hyde. Unlike with Tracy and March, Hyde does not speak he just grunts and growls the way Karloff's Frankenstein monster does.<br><br>Westcott is Karloff's ward whom he has raised since childhood, but those aren't fatherly glances he's giving her now. Especially since young reporter Stevens has become interested in Westcott after covering her at a suffragette rally. It doesn't take much to get his inner Hyde going. <br><br>As for Bud and Lou none of their patented burlesque routines are featured here, but they still get plenty of laughs. Unfortunately for the film, their best moments are as London Bobbys trying to break up the suffragette rally where the women do get the better of them which is at the beginning of the film.<br><br>Of course at the end Costello gets jabbed with some of Karloff's Hyde serum and goes off on an inner Hyde journey of his own. Reginald Denny has a fine role as the English Scotland Yard Inspector driven quite crazy like Herbert Lom by this pair of American Clouseaus.<br><br>Not the best of A&amp;C, but the boys still had a lot of good humor still left for their audience.","user":"bkoganbing","rank":[5,5]}]