[{"title":"social drama meets soft porn","rating":29,"date":"29 September 2002","review":"This combination of social drama and soft porn has many bizarre moments, but is actually pretty well acted by Hugo Metsers and especially the stunning Carry Tefsen, with a off beat beauty that reminds of Liza Minnelli.<br><br>\nMetsers, just released from prison, gets a flat in one of the huge Bijlmer buildings near Amsterdam (brand new in the late sixties, when this movie got made). Soon he finds out that this building is full of sex addicted housewifes. He enjoys this to the fullest, eventually starting a small business in orgies. While most of the women seem to have no control over their lust after Metsers, his neighbour Tefsen, happily married but with a unstoppable sex drive, is in full control all the time. She encourages the young man to explore all the sexual possibilities this building has to offer, giving him the confidence he so badly needs after four years in prison. Later she runs the orgie business along side him.<br><br>After the movie was shown at the Dutch Film Festival in Utrecht this year, Tefsen appeared on stage. She was welcomed to an wild ovation and shared some set stories along with director Wim Verstappen. It turned out she actually saw the film in full for the first time that night and was pleasantly suprised by her performance some thirty-two years earlier. She also thought the movie was a beautiful time capsule, showing life in the Netherlands of those days in a pretty honest way. Tefsen still looked radiant at the festival and it is a shame she gets so few chances to show her talents as filmactress. Over the years she played many well-recieved parts on stage though, especially in musicals such as Oliver, Fiddler on the Roof, Man of La Mancha, Irma la Douce and the Dutch classic De Jantjes.","user":"jeroenantonius","rank":[23,25]},{"title":"Bad Movie","rating":4,"date":"4 August 2004","review":"It took the death of director Verstappen to show this one on TV in the Netherlands. Knowing that we normally don't have much of a problem with nudity on screen, Blue Movie must be something else.<br><br>And it is. The story and acting are laughable (apart from Metsers), and only serves to have Michael having sex with as many women in one flat as possible. Really, really silly.<br><br>The story tries to make some points near the end with a suicide but it's hard to take that serious after having witnessed one sex act after another. We sure have a sorry movie industry if this one is concidered as something of a classic.<br><br>4/10.","user":"TheOtherFool","rank":[15,28]},{"title":"Slow and awful by today's standards","rating":2,"date":"15 March 2009","review":"This was a huge success in 1971 in Holland. It was Dutch, had sex in it and was more or less rebellious. Many people saw the movie, even though not everyone admitted to have actually watched it! It was the era the Dutch got loose from their religion. They started to be more open minded. In this respect this movie should not be underestimated. It is a monumental step in Dutch history.<br><br>But now we are almost 40 years later. Seeing the movie again is an ordeal. It turns out to be a very weak film indeed. The soft core sex scenes are awful at best. The acting is terrible. The story line is ridiculous. And the movie is ssslllooowww...<br><br>Still part of the atmosphere around 1970 is captured very well. The location (the Bijlmer area in the South of Amsterdam, now slums mainly, then brand new) is well chosen. But I am afraid that is the only positive remark I can make about this disaster on celluloid.<br><br>You want to watch a comparable movie with more or less the same theme, but well acted and with a good story? Try Turks Fruit.","user":"Hans-56","rank":[5,10]}]