[{"title":"Classic 50's low budget Sci-Fi with strong performances.","rating":14,"date":"14 January 2004","review":"Ah yes! The good old days when Sci-Fi was simple. All you needed was a little radiation and most anything was possible. This movie was one of the last 50's Sci-Fi movies from Universal coming out in 1959-same year I did. Audiences then were not as sophisticated as they are now and quicker to give a movie the benefit of the doubt. This was the day of the Drive-In movie. Anyone my age or older should enjoy the simplicity of this film and the nostalgic quality of it. Good solid performances by Arthur Franz and especially Joanna Moore (whom would later become notable as one of Andy Taylor's girlfriends on TV). Plenty of the good old character actors from Universal's other Sci-Fi films give it a familiar feel. This movie doesn't ask you to think too much; when I was a kid watching Shock Theatre on a Saturday afternoon I didn't want to. Sure, the make-up could have been much better but from a distance the monster is quite scary.You don't have to look close to find a few blunders: lace-up shoe or loafer? You'll hear music from practically all of Universal's Sci-Fi and horrors movies: Tarantula, Frankenstein, the Mummy movies.This movie is probably not very entertaining to the younger generations of viewers other than finding it quite campy. How far we've come as an audience. But this movie tries hard and with its budget I've got to give it credit. It holds a warm spot in my heart and a solid place in my video library.","user":"dsturgil","rank":[35,38]},{"title":"Fun 50's Sci-Fi!","rating":7,"date":"28 November 2002","review":"I've always enjoyed this film that turned out to be Jack Arnolds last horror film and I really do not understand why some people think this is awful. There are some flicks that you don't have to take seriously and all you have to do is sit back and have fun watching. Sure, its silly but most 50's sci-fi is. Why is this worse than others? The music that is used is from other Arnold films most notably \"Tarantula\" and I'm sure Universal used the same score for countless other movies. A lot of Arnold regulars pop up like Whit Bissell, Phil Harvey, Ross Elliott, Richard Cutting and of course Mr. Ziffel, Hank Patterson! Eddie Parker plays the monster here in make-up, not Arthur Franz and Parker was also in \"Tarantula\" in two roles. Both as lab assistance who die of that deforming disease. Troy Donahue in one of his early roles is Jimmy and he's especially wooden. But Arnold knows exactly how to tell a story no matter how silly and the scene with the giant dragonfly is fun, so is the whole movie.","user":"rosscinema","rank":[29,32]},{"title":"Great, rare movie","rating":10,"date":"23 June 2006","review":"If you're a 50's \"B\" movie fan like I am, this is a gem. I saw this film back when i was a kid, something like 1962 or so, and it hasn't been on T.V. in years. I have a VHS copy of it but would love to find it on DVD sometime in the future. When a caveman throws a hatchet and it hits a cop square in the face, it leaves an impression on you when you're 10 years old. Of course, by today's standards, it looks kinda hokey, but you have to keep in mind that movies like this one \"pioneered\" this type of movie. I wouldn't trade a 50's \"B\" flick for all the new garbage in the world. Like, what could measure up to movies such as the transparency of \"The Amazing Colossal Man\" and \"War Of The Colossal Beast?\" Ah yes, those were the days. Back when sci-fi movies didn't have to be VULGAR to be entertaining. The special effects didn't even have to be good - we STILL loved it! I sure wish the Time Tunnel was a reality - I'd go back there in a new york second!","user":"StevenFlyboy","rank":[31,37]}]