[{"title":"Definitely one of the better B-movies!","rating":8,"date":"8 August 2004","review":"\"Night of the Creeps\" is definitely one of the better B-movies that are out there. Granted, like all B-movies it's a bit hokey at times, and also follows along the trademark lines with films of this caliber (obligatory boob shot, corny dialogue, poor camera techniques, etc.).<br><br>But give \"Night of the Creeps\" its due. First of all, it is fairly original for a B-movie. Alien slugs that infest the brain and turn you into a zombie may seem like a typical B-movie theme, but it's portrayed in a fairly unique manner. Given the time period of this movie's release, and it's obviously small budget, I'm quite impressed with the special-effects of the alien slugs as they race along the ground throughout the film. They're so simple, that it makes them look realistic and somewhat unnerving. In horror films, it is often the most simple effects that are the most discomforting to the viewer. I put these alien slugs along that line. <br><br>I really like Tom Atkins (\"Lethal Weapon\") as Detective Cameron too. He's the perfect actor for this particular role as the washed-up detective. Unfortunately or perhaps fortunately for Tom's career, it seems that he often got type-cast to play the depressed, on-edge characters. Atkins is one of the bonuses in this B-flick. <br><br>Another \"acting bonus\" would have to be our two young heroes played by Jason Lively (\"European Vacation\") and Jill Whitlow. Lively as always plays the young, likable clod. Somewhat bashful, somewhat moronic, somewhat accident-prone, but you can't help but like the guy. And Whitlow is just plain cute. I sometimes think that 80's flicks didn't have enough cute girls in them, but Whitlow is definitely one of them. <br><br>All in all, \"Night of the Creeps\" is good for a B-movie. It'll entertain you for sure, and you won't get sick of it while you're watching. It's definitely one to watch if you're into the B-movie thing.","user":"GorgonHeep","rank":[57,62]},{"title":"Underrated, too little known comedy horror gem","rating":10,"date":"21 February 2005","review":"After an \"experiment\" is accidentally released from a spaceship in a tube, it crashes on Earth where it infects a youth in the 1950s. Flash forward to the mid 1980s, and the youth is now cryogenically frozen in a university lab for study. At least until Chris Romero (Jason Lively) and J.C. Hooper (Steve Marshall) release him, and he begins infecting countless members of a small college town.<br><br>Director and writer Fred Dekker, who has had a lamentably short career as a helmer, wrote Night of the Creeps in seven days. He told himself that if he did not get to the end of the script by that self-imposed deadline, the whole thing would go into the garbage. If this is what one can come up with in such a flurry, maybe more scripts should have time limits. We should also be glad that he sold the script with a caveat: if he wasn't allowed to helm the film, he wasn't going to sell it. He's said that he didn't care if it sold or not at the time.<br><br>Why Dekker has received so little recognition and respect in the industry is difficult to say. Night of the Creeps didn't have the wide release and promotion that it deserved, especially given its $5 million budget (it's curious that TriStar didn't push more to make its money back). Both this film and Dekker's 1987 effort, The Monster Squad, are currently only available on bootleg DVDs in the U.S.<br><br>Night of the Creeps is one of the better horror/comedies of the 1980s. The script is clever, paying homage to everything from 1950s sci-fi horror to the zombie craze started by George Romero to 1980s slasher films and even John Hughes. Just in case one couldn't catch the homage angle, Dekker has a lot of character and place names that are tributes to various genre directors. Dekker's dialogue is witty and memorable--there are a few classic diatribes in the film that would be worthwhile and a lot of fun to memorize. Dekker's writing is self-conscious and self-mocking, predating Scream (1996) by 10 years (there is actually a whole class of 1980s and early 1990s flicks that were doing everything Scream was credited with revolutionizing). Dekker is not afraid to be joyously silly, as with genre character actor favorite Tom Atkins' response when asked if he's Detective Cameron--\"No, Bozo the Clown\". Dekker even gives us the 1980s high school classic of the hand-cranked middle finger.<br><br>But Night of the Creeps isn't just a comedy. The serious horror aspects of Night of the Creeps are extremely well done. The film is suspenseful, the effects are good, and there is plenty of gore for fans. Dekker could have easily made an effective retro horror film--most of the first five minutes are set in the 1950s, shot in black and white, and have an authentic feel, with just a dash of tongue in its cheek. He smoothly transitions from The Blob (1958) and Invasion of the Body Snatchers (1956)-styled sci-fi (with heavy Alien (1979) touches) to early 1980s slasher material, then to a more complex and fantastic collage of zombies, slugs and detectives seeking revenge.<br><br>While the film isn't likely to be appreciated by those who dislike mixing their horror with comedy, and especially won't be appreciated by viewers who don't even realize that it's supposed to also be a comedy, neither type is very likely to watch it in the first place--at least not for long. For those with the appropriate mindset and love of horror (it's a lot more fun if one is familiar with everything being referenced), Night of the Creeps is a gem that deserves better recognition. We should at least be able to buy it on an official DVD (and please put both endings on the disc).","user":"BrandtSponseller","rank":[82,99]},{"title":"I think thats the Morton Salt Girl","rating":10,"date":"21 November 2003","review":"For the genre, this film is outstanding. It has absolutely everything a horror film should. This includes a performance by Tom Atkins that is worthy of serious recognition. Zombies, exploding heads, creepy crawlies and a date for the formal. Like I said this ones got it all. Alien experiment is jettison from space and lands in Anytown USA where it releases a slug like creature that wants to get in your mouth and lay eggs in your brain. The movie begins black and white set in the early 60s, which is an awesome touch by the way, and then jumps ahead to the mid eighties where were treated to a sorority gals, frat nazis, a couple of pledge geeks(our heroes), Tom Atkins cop on the edge(who delivers some of the best lines in cinema history,i.e.\"Duck! It's Miller Time!\" Exploding heads aplenty, flamin'zombies, a great lawnmower kill, zombie cat, zombie dog, a parapelegic whos faster on crutches then his able friend, and a hilarious janitor who has only one repeating line. NOTC is everything you want from a film, a perfect 10!","user":"Cristopher_Jeorge","rank":[45,56]}]