[{"title":"Impressive fairy tale of good prince and thief versus evil vizier full of fantastic elements","rating":7,"date":"16 May 2009","review":"This is an Oriental fantasy about ¨thousand and one Arabian nights¨ plenty of incredible adventures, fantasy witchery and wizardly. The malignant vizier Jaffar (magnificently played by Conrad Veidt)with powerful magic faculties imprisons the prince Ahamad of Bagdad(attractive John Justin)who loses his throne, then he escapes thanks a little thief named Abu(sympathetic Sabu). They arrive Basora where Ahamad and the princess(gorgeous June Duprez) fall in love. But prince and thief are haunted by Jaffar , Ahamd is turned blind and Abu is become a dog. The story accumulates several fantastic ingredients such as transformation of the starring, a flying mechanic horse, magic bow, flying carpet and of course the colossal genie(overacting performed by Rex Ingram) who gives three wishes to Sabu , the magic eye, the figure of goddess Kali with several hands, among others.<br><br>This remarkable picture ranks as one of the finest fantastic films of all time. Produced by London Fim's Alexander Korda and directed by the definitively credited Ludwing Berger, Michael Powell and Tim Whelan with a stunning screenplay by Lajos Biro and Miles Malleson also dialogs writer and actor as Sultan fond to mechanic games. The WWII outbreak caused the paralyzing shooting, then the three Korda brothers and collaborators traveled USA continuing there the filming in especial on Grand Cannon Colorado.The splendid visual and glimmer Technicolor cinematography , setting and FX provoked the achieving three Oscars : Production design by William Cameron Menzies and Vincent Korda ,Cinematography by George Perinal and Special effects by Osmond Borradaile though today are dated and is urgent a necessary remastering because the colors are worn-out. Furthermore one nomination for the evocative and oriental musical score by Miklos Rozsa. This vivid tale with immense doses of imagination will like to fantasy fans and cinema classic buffs","user":"ma-cortes","rank":[21,21]},{"title":"Probably the best \"Arabian Nights\" film ever made.","rating":6,"date":"6 March 1999","review":"Most of the genre of \"Arabian Nights\" films were silly, cheesy, low-budget things, like \"The Prince Who Was A Thief\" starring Tony Curtis as an Arabian prince with a Brooklyn accent.  This is an exception:  A genuinely magical film, one of the best fantasy films ever made.<br><br>A beautiful film made in the most glowing of technicolors, it tells the simple story of a boy thief (Sabu) meeting a dethroned prince (the gorgeous John Justin), and helping him defeat the wonderfully evil usurper Conrad Veidt.  Like \"The Wizard of Oz\" made the year before, the performances are so good that you believe in what you see on the screen.  Flying carpets and horses, towering genies, dancing idols, it all seems perfectly believable and exiting.  A classic.","user":"otter","rank":[72,80]},{"title":"Wondrous","rating":11,"date":"11 November 2002","review":"After 60 some odd years THE THIEF OF BAGDAD is still one of the most<br><br>wondrous movies ever made.  Filmed in wartime England and without the<br><br>use of digital imagry, the film soars and makes believers of us all.<br><br>From Rex Ingram's memorable Genie, (has any laugh been better than his<br><br>rumbling \"BoohooHAHAHAH\"?) to the Flying Horse, the six armed murderous<br><br>doll, the immense spider and on and on, the film excites in a visceral<br><br>way that no FX person could duplicate today. Though we can see through<br><br>the primitive special effects, the genius of this film is that the story<br><br>is told so well that we suspend our disbelief and fly along on a magic<br><br>carpet ride that never flags for all of its almost two hour running<br><br>time. Miles Malleson's script (he also plays the heroine's father in a<br><br>delightful turn), is filled with what we now see as cliches, but they<br><br>still bring a silly grin to our faces as we acknowledge them, and love<br><br>them all the same. The acting is WAY over the top and absolutely delightful. Sabu is<br><br>perfect as the little thief Abhou, John Justin stalwart as the hero<br><br>Ahmed, Conrad Veidt all snarly and despicable as the evil Jafar and June<br><br>Duprez all gauzy and creamy as the princess. The real star of the film, the glue that holds all the pieces<br><br>together,however, has to be Miklos Rozsa whose musical score evokes<br><br>every Arabian Nights fantasy that we have ever dreamed. What glorious<br><br>music, what a wondrous fim!   (I was lucky enough to get an advance copy<br><br>of the new DVD of THIEF OF BAGDAD.  What a great print. Wait till you<br><br>see it! It will knock your socks off.)  I love Spielberg and I love<br><br>Lucas, but oh THE THIEF OF BAGDAD!!!!!!!!!!!!!!!!!","user":"rube2424","rank":[16,16]}]