[{"title":"Very underrated","rating":7,"date":"9 November 2002","review":"A Nightmare on Elm Street part 2 Freddy's revenge<br><br>May contain `spoilers'<br><br>`Mommy, why can't Jesse wake up like everyone else ?'<br><br>Firstly I'd like to say that I believe this to be the most underrated film in the series. Aside from the first film this is the only other from the series that I still like. As has been mentioned by other people, I think Freddy developed too much of a personality after this film, dispatching victims with comedic one-liners and more stylised, effects based death sequences. In this film his remains pretty much as he was in the first. In fact, probably a little darker.<br><br>One of the main problems People seem to have with this film is the implied bisexuality of its main character. I personally think it gives the film an Unusual twist. To quote Robert Englund (Freddy Krueger) `Nightmare 2 is a very creepy, very kinky film. It reverses the first one - instead of having a teenage girl in jeopardy, we have a bisexual male, and this factor is exploited by Freddy. There's a lot of stuff implied with the S &amp; M bar, stringing up the coach in the shower room bondage situation, and going to his boyfriends house for protection, the two of them take their clothes off as often as possible. All that adolescent mad teenage hormone stuff is explored, which of course Freddy is privy to'.<br><br>I like the nightmare sequences in this film. To me they have a quality that rings truer to real nightmares than that of the ones in the other sequels. When Jesse (Mark Patton) first spies Freddy lurking in the back yard and then the basement being a prime example. The school bus at the start is also a classic and another that springs to mind is when Jesse awakes in his room to find it's become so hot that things around it like a vinyl record have begun to melt.<br><br>The score is my personal favourite of the entire series. Christopher Young creates something very unusual using such bizarre sounds as whale calls to good effect. It is a complete departure from the cheesy synth score of the original and because it lacks that familiar piano motif that's heard in all the films, sets it apart much like the film itself.<br><br>There's also some nice camera work in there to, the shot that follows Jesse as he arrives at school the morning after the murder of the coach is good. Though my favourite has to be the shot that takes us up from the basement (albeit rather poorly cut as you go through the basement door) swerving up the stairs and into Jesse's little sisters room. Freddy's face is never fully visible unlike in the other sequels. Which I always thought was the way it should be kept. We only ever really see his face in a neat shot behind the flames of the broken Barbeque during the pool party scene.<br><br>The acting from all concerned is solid, Patton and Meryl Streep look-a-like Kim Myers (Lisa) the two leads being particularly good.<br><br>The film does have plenty of flaws, certain effects shots are very badly rendered. Witness the budgie exploding for a prime example and the awful creatures in the boiler room towards the end of the film for others. There's a lot of plot holes and the ending is decidedly weak but over all I really like the film. A lot of people say it's the worst of the series but in my opinion if you prefer number's 5 or 6 to this you are missing the point. I'll go out on a limb and say it's my personal favourite.<br><br>7 ½ / 10","user":"TheSkipper","rank":[31,37]},{"title":"A bad sequel, but an OK movie in the slasher horror genre!","rating":9,"date":"1 November 2015","review":"A Nightmare on Elm Street 2: Freddy's Revenge (1985), oh boy. It is not the worst movie in the series but is not the greatest sequel either. It is very Underrated which I understand why because the film has a lot of problems. It is my at least favorite film. Even tough it is a bad sequel it still follows the roots from first movie with a different story, different idea,different cast and that is good. The first time that a boy was a main hero in A Nightmare on Elm Street franchise. In the rest of the sequels was always some girl as a hero. 4,5,6 and the remake (2010) are seriously the worst ones in the movies, the best one is Wes Craven's A Nightmare on Elm Street (1984). Freddy was still serious - not as much joking around and you feel for the main character - plus his girlfriend was smoking hot - didn't know he was bisexual. What can I say? I don't hate the film and I like it for a bit but that's it. <br><br>I like the film because it follows the roots from the first film, It is mentioning Nancy Thompson (Heather Langenkamp) yes I am a Nancy Thompson fan! I love her very much and this film has respect to Nancy Thompson! While showing the diary and the telling the story's about her. Walsh family moved in to Thompson's house. That's what I like a bit this film. It is a horror film, Freddy kills a doesn't people, specially in the pool that was just awesome. Kim Myers as Lisa Webber was really smoking hot and she cared about Jesse. I like this film for it. Freddy stripped the coach down and killed him in that gay overtone because the coach was into some freaky sexual stuff, because I remember the coach being in leather and bondage looking clothes when he runs into Jesse.. So yeah Freddy killed him in an extreme version of what the coach liked. From the looks of the coach's bondage like clothes he had on you can assume he likes to be whipped and stuff like that. So his death scene was very fitting and that was awesome, I like that a lot. The love scene between Jesse and Lisa conger and defeating Freddy was amazing! The nightmare on the bus was just really extremely awesome even the ending scene was awesome. <br><br>The film has major problems that I just don't like that. For most of the movie Freddy's Glove was missing and they had to use the blades on his fingers. Reportedly it was stolen after filming and they had to scramble to make a replacement. They should have watch for that glove. Wes Craven refused to work on this film because he never wanted or intended A Nightmare on Elm Street (1984) to become an ongoing franchise (and even wanted the first film to have a happy ending), and also because he didn't like the idea of Freddy manipulating the protagonist into committing the murders. I agree with that, why the main hero has to get him self into been manipulated and go murdering people around? That's just not right and it is wrong in my opinion. The film was too short and it become a little boring by time to time. I didn't like the gay scenes including the couch who was a molester and a gay in this film. I am glad Freddy killed him. The story had potential, but it just failed. The part where Jesse runs into gym teacher at the s&amp;m bar and then he brings him back to the school and has him do laps and makes him take a shower, after he was tired. Looks like he was prepping Jessie for ass rape. That was the worst gay scene in the movie ever and it hurt the film so much! <br><br>Anyway with all the problems in the movie, the story did work well. Freddy in this film is at his darkest plus the make up FX by Kevin Yagher on Freddy made him look more and scary then I ever seen him look in any of the films after this one. It had a very good cast and effects and you finally saw Freddy's whole face it was a nice sequel. I think Jack Sholder did a great direction debut I don't think, he did a terrible job which he didn't. Robert Englund did a great job in this film, that is one of the reason the film isn't the worst than other sequels are. It is at least my favorite horror slasher film because it really did had a potential and it failed. It was OK sequel tough, but still a bad one and I have a lot of respect for Mark Patton cheers for him!!! Anyway I am giving this film a 7. rating even tough it deserves less.","user":"ivo-cobra8","rank":[62,79]},{"title":"Freddy's back to terrorize a confused teenage boy!","rating":7,"date":"17 June 2004","review":"Nightmare on Elm Street Part 2 (1985) was the second film in the Freddy Krueger series.  This time his main target is the son of a man who just but the Elm Street house.  Freddy preys on this sexually confused kid and forces him to do his bidding and uses him to serve his twisted needs.  Can poor Jesse over come the strong willpower of Freddy?  Will he be able to discover his true self?  Watch and find out, you'll be surprised! Strange stuff.<br><br>What I liked about this film was the filmmakers tried to do something different, and it almost killed the series.  The plot and storyline was too complex and byzantine for you average horror film. Much of the film's hidden context and meaning would go over the heads of most horror film fans.  If Sigmund Freud were alive today he would've had a field day trying to figure out this one.  Sadly underrated and unfairly neglected..<br><br>Strongly recommended","user":"Captain_Couth","rank":[67,89]}]