[{"title":"Two Pros Light Up the Screen","rating":9,"date":"25 July 2001","review":"This film is often overlooked but if you can find it, it is well worth your while.  Adapted from a stage play it is admittedly slow and talky, but it does challenge the intellect.  Guiness and Hawkins are brilliant as a churchman consumed with self doubt and a zealot consumed with the state. Their battle of wits forms the crux of this many layered work.  A rather pale love story added to the screen play simply detracts from the films power.  This is a film that will challenge you to think.  It requires work on the part of the viewer and, as a result, is not everyone's cup of tea. Any fan of great acting shouldn't miss it.","user":"Reb9","rank":[22,22]},{"title":"\"The Result Of Human Weakness\"","rating":7,"date":"9 November 2008","review":"Alec Guinness got to repeat one of the roles he did on the London stage with the screen adaption of Bridget Boland's The Prisoner which was directed by Peter Glenville who also did the original stage production. It was one of Guinness's personal favorites among his parts because of the Catholicism of the actor.<br><br>In fact the role really hit close, maybe too close to home, because like the character he plays in the film, Guinness was a child of a prostitute mother who escaped into acting as a refuge from a really bad childhood. Just as his character the Cardinal of an unnamed Balkan country now ruled by a Marxist dictatorship went into the church as a way of rising above the station he was born in life. <br><br>Jack Hawkins plays the state inquisitor, a psychologist by training who probes and finds the weakness in Guinness and uses it to get a confession of treason out of him. Pride and vanity are the trickiest of human sins, we're all guilty of it in one way or another. <br><br>In making this film Guinness, Boland, and Glenville were all adamant about keeping the main character Catholic and not some Christian preacher of an unnamed denomination as what the producers originally wanted to do, the better for a broader appeal they reasoned. Catholicism and the special burdens and duties it places on its clergy is precisely what makes the story valid.<br><br>According to a recent biography of Alec Guinness though it was never going to be anyone else but him in the role of the Cardinal, Noel Willman had done the inquisitor part on stage. Several people like John Gielgud and Peter Bull were considered for that part before Hawkins was signed for the role.<br><br>If the subject matter does seem familiar, the role is obviously modeled on Josef Cardinal Mindszenty of Hungary. And director Peter Glenville would have his greatest screen triumph in Becket, the story of another troublesome priest several centuries earlier.<br><br>Guinness does lay bare his soul in this film. For fans of Alec Guinness this film is a must.","user":"bkoganbing","rank":[16,16]},{"title":"THE PRISONER (Peter Glenville, 1955) ***","rating":7,"date":"11 April 2009","review":"Inspired by the plight of Catholic Cardinal Josef Mindszenty behind the Iron Curtain – already the subject of a worthwhile low-budget Hollywood film, GUILTY OF TREASON (1950; see above) – this prestigious British production (based on a Bridget Boland play, who adapts her own work for the screen) boasts two powerhouse performances by Alec Guinness (as the proud Prince of the Church) and Jack Hawkins (as the wily Interrogator). Their interaction is a beauty to behold and one cannot help but be reminded how these formidable actors had already worked together in, curiously enough, MALTA STORY (1953) and, of course, would go on to do so again under David Lean's Oscar-winning direction in THE BRIDGE ON THE RIVER KWAI (1957) and LAWRENCE OF ARABIA (1962). Although much of the running time is devoted to their rigorous one-on-one sessions (enough for it to be deemed a two-hander), the film allows (at least) another fine actor to shine: Wilfred Lawson as Guinness' jailer who grows to respect his prisoner with time. The small cast also includes Kenneth Griffith as Hawkins' eager-to-learn subordinate – incidentally, the latter also appeared in two episodes of Patrick McGoohan's later cult TV series of the same name but which bore no relation to this movie! – and Raymond Huntley as Hawkins' impatient superior. Conversely, the romantic subplot between doubting Communist Ronald Lewis and his Catholic girlfriend Jeanette Sterke seems forced and intrusive – almost like an afterthought (whereas it had been far more effectively handled in the aforementioned Hollywood treatment). But, as I said before, the film's trump card is its gradual depiction of the evolving relationship between the two leads, which really has no equivalent in GUILTY OF TREASON (where Charles Bickford's tormentors were various and generally shrouded in darkness). Although the main characters and the setting remain unnamed throughout (lending it a pretentious air of political allegory also missing from the earlier film), the controversial subject of THE PRISONER got it banned from participating in both the Cannes and Venice Film Festivals – although it did get nominated for 5 BAFTAs and, eventually, won a couple of other international awards.","user":"Bunuel1976","rank":[12,12]}]