[{"title":"Hades' Hoodlum","rating":10,"date":"5 June 2003","review":"Rico Bandello, a petty crook nicknamed LITTLE CAESAR, plots his rise to become crime boss of the Big City.<br><br>Edward G. Robinson made a tremendous impact in this star-making saga of a thoroughly detestable little man who bandies his way through society's underbelly for a short time until fate brings him his just reward. The evil spawn of a deplorable age, Rico cares for neither booze nor dames, only pure raw power. Even loyalty &amp; friendship are weaknesses to be deplored since no one can be ultimately trusted. Robinson, with his frightening eyes and large ugly mouth, makes this human scum fascinating to watch - a cheap little monster in expensive suits, a moral nonentity with a big gun.<br><br>Douglas Fairbanks Jr does a fine job with what little the script gives him as Rico's longtime buddy; the bland nature of his performance contrasts nicely to Robinson's florid acting style. Even more compelling is Glenda Farrell in an important early role as Fairbanks' girlfriend - this talented actress would soon become one of Hollywood's premiere tough talking brassy blondes.<br><br>Stanley Fields, Sidney Blackmer &amp; George E. Stone all deliver vivid portraits of crooks &amp; criminals that Rico must intimidate or use. Special mention should be made of William Collier Jr who gives a touching portrayal as the mob's getaway driver who loses his nerve and attempts to go straight.<br><br>Movie mavens will recognize an unbilled Lucille La Verne as the old crone who intimidates Rico near the end of the picture.<br><br>With LITTLE CAESAR and PUBLIC ENEMY (1931) Warner Brothers established themselves as the Studio that could produce topnotch, gritty crime dramas. The reputation was well deserved and the films were appreciated by movie viewers already enthralled by the headline exploits of real life Depression desperadoes.","user":"Ron Oliver","rank":[47,60]},{"title":"\"Is this the end of Rico?\" - Yes, But the Start of My Favorite Genre - Mob Movies","rating":7,"date":"1 April 1999","review":"LITTLE CAESAR was made at a critical time in U.S. history.  Prohibition was in, the depression was overwhelming, and mobsters were running rampant.  I don't think the filmmakers realized it, but they have made a movie that paints the \"Mafia\" as glamorous and flashy.  A message appears before the flick, telling the public how \"we\" must stop gangsters like Tom Powers (James Cagney,PUBLIC ENEMY) and Rico, (Edward G. Robinson, LITTLE CAESAR). The movie probably had youngsters and adults alike wanting to live the life of a man who had a city in his grasp, and no one who was anyone was \"yellow\".  All seriousness aside, this blueprint of a long history of mob pictures is silly, dated, and damn watchable.  You can't take your eyes off the screen.<br><br>A film with dialogue like the ultimate cliche \"Go on.  I'm...done for\" must be a waste of time right?  Not if you appreciate pre-historic cinema and the Vitaphone films of the early talkie period.  Actors like the great Edward G. Robinson were born to talk and deliver lines at machine gun pace.  This is what the audiences of the time were looking for.  And that mug.  Audiences would not see such a face on a gangster until Brando's GODFATHER.  If you love GOODFELLAS, THE GODFATHER, Cagney and Bogart films, and even PULP FICTION, this is a must see.  Experience an American original - the first potent \"La Cosa Nostra\" movie.  Rat tat tat tat tat!!!<br><br>RATING: 10 of 10","user":"Don-102","rank":[40,52]},{"title":"Still holds up very well","rating":14,"date":"14 October 2006","review":"Seminal gangster film about the rise and fall of Enrico Bandello, a Chicago hoodlum, based on the novel by W.R. Burnett. The prototype for Enrico was, like so many other gangster heroes, mobster Al Capone. If you know a little bit about his life story, you got your basic gangster plot for practically all films that followed, like Tony Camonte in SCARFACE.<br><br>This film was the first of \"the big three\", together with PUBLIC ENEMY (1931) and SCARFACE: SHAME OF THE NATION (1932) and provided the blueprint for the modern gangster crime flic. It was the first gangster film to reach a wide audience and launched Edward G. Robinson to stardom. The story is simple and straightforward and might feel a little overly familiar to modern audiences, but the film lost little of its power and still holds up pretty well. It's a tough movie, but mostly tough talking with not much violence on screen. <br><br>But the film would probably be instantly forgettable without Robinson's superb performance. Whenever he's on screen, his presence is incredibly menacing. The rest of the cast is so so, but Thomas Jackson as Flaherty, Rico's nemesis, gives a wonderfully cynical performance, mocking Rico and all the other gangsters. Like most other early gangster films, it lacks the real emotional depth and complexity that came with later films, like the French gangster films of the fifties or THE GODFATHER and was made primarily as popular entertainment. Pleasant entertainment nevertheless with Edward G. Robinson portraying the first classic gangster role in screen history.<br><br>Camera Obscura --- 8/10","user":"Camera-Obscura","rank":[20,25]}]