[{"title":"Keeps coming to mind.","rating":7,"date":"20 May 2000","review":"This isn't an award winning film. This isn't a well known film. But it has a good premise and is  one of my secret pleasures. Two Brothers in a long standing feud over an ancient family sword  and an American \"dupe\" that's been thrown into the fray. We watch his journey and education  in a different culture with different values (yet oddly similar to ours, and riddled with similar  weaknesses.)<br><br>The reason I know I like this one (even with all the flaws) is that it keeps coming to mind  from time to time. And after some thought, I think it boils down to basic examinations of how to live one's life. How important is Honor? Is it better to take the quick and easy $ or to work for it? How important are family bonds? Are the modern ways of life any better than the traditional ones? Is it ever too late to turn your life around? And so forth. These are why I like this movie. Sure it can come off as a bit preachy about duty, honor, loyalty and traditional ways, but it has always made me think about what is the best way to live one's life.","user":"khodgman","rank":[12,12]},{"title":"VERY intense at times and brutal, but I liked it!","rating":9,"date":"9 June 2002","review":"There are certain movies on IMDB that are enigmas. The ratings are low, but the reviews are GOOD. Such is The Challenge. Frankenheimer, who had a string of masterworks in the early 60s with Seconds, Manchurian Candidate, The Train, and at least the race parts of Gran Prix stumbled badly on several films thereafter. This, and French Connection II, helped get him back on his feet. <br><br>So which is right, the low ratings or the high comments! Duh. Always go with the latter in this case. The Challenge will make you feel like you were in Scott Glen's shoes, immersed in an alien culture that you come to respect and even fight for. And any film with a Goldsmith action score is already a plus.","user":"Mr. OpEd","rank":[17,19]},{"title":"Bottom 100?","rating":12,"date":"12 August 1998","review":"Geez, I kinda like this one.  It's an interesting look at Japanese culture from an outsider's viewpoint (compare it to The Hunted, with Christopher Lambert and Joan Chen).  It makes good use of the same hotel as the one used for the Tyrell Corporation in Blade Runner, and the office/swordfight at the end is a hoot as Scott Glenn turns mere office equipment into deadly kung fu weaponry!  Glenn's always worth seeing, even in this, one of his earlier works.","user":"Gislef","rank":[13,14]}]