[{"title":"Classiest cast of the \"Airport\" sequels and most serious.","rating":30,"date":"30 March 2000","review":"Landing after the TV sitcom-level cast/plot of \"Airport 1975\", but arriving before the ludicrous \"The Concorde-Airport '79\" is this slick disaster film entry.  Featuring Oscar-winning and nominated stars like Lemmon, Grant, de Havilland, Quinlan, Kennedy and Stewart, it also offers one of the best caliber casts of the '70's disaster cycle.  There is no deep thinking involved in watching the film, but it does offer some watery thrills and some fun thrashing around as the plane first skips along the surface of the water and then slips under.  Suspense builds as the pressure continues to wreak havoc on the plane's outer skin and, unusually for an \"Airport\" film, pretty many lives are claimed!  The death toll in this film is higher than the other three combined.  It's great to see so many once and future stars flopping around in the underwater tomb, but the main attraction is Lee Grant.  Clocking in with only about a dozen or so total minutes of screen time, she is utterly hilarious and unforgettable as a shrewish, boozy, sarcastic lush.  No one is safe from her rude, brash comments and she is a joy to behold for bad-move connoisseurs.  Her husband in the film is Christpher Lee.  Fortunately, they didn't marry offscreen or she would have become Lee Lee, but that's another story.......","user":"Poseidon-3","rank":[36,39]},{"title":"Mid Air Ocean Caper Gone Awry","rating":6,"date":"29 July 2006","review":"Gazillionaire James Stewart is shipping his collection of art to a museum and he's using his private jet to fly the collection and a few friends down to meet him in Florida. <br><br>Of course this attracts the attention of a few crooks who have a pretty well thought out plan and the copilot, Robert Foxworth, working with them. Of course all good plans go awry and they go down in the Bermuda Triangle into some relatively shallow area of the Atlantic.<br><br>Hey they could have gone down and been lost for decades like the Titanic was.<br><br>That's essentially the plot here and in true Seventies disaster film tradition you load the screen with big names, dress them fashionably and put them in harm's way. The rest of the film is devoted to their rescue.<br><br>Incidentally the footage devoted to the air sea rescue is the best thing about Airport 77. No member of the audience will not go away impressed with the U.S. Navy's capabilities in that regard.<br><br>Jack Lemmon is the pilot and in an action role which is normally against type for him, he does quite well. Almost twenty years before he supported James Stewart in Bell, Book,and Candle and now the billing is most definitely reversed.<br><br>My favorites in the film are Joseph Cotten and Olivia DeHavilland, a classy and elegant pair of passengers who so typify the glamor of old Hollywood.<br><br>Christopher Lee also performs against type, he's not the villain here in fact he turns out quite the hero among the passengers. Lee Grant is his trollop of a wife and I remember seeing this in theaters and the shouts for joy from the audience when Brenda Vaccaro punches her out.<br><br>I'm not sure which is a wilder rescue this one or that other James Stewart film The Flight of the Phoenix. There's no way any of them should survive.<br><br>But this is a Hollywood disaster epic, so all things are possible.","user":"bkoganbing","rank":[23,25]},{"title":"One of the better disaster films!","rating":7,"date":"23 August 2006","review":"Following the not-so-spectacular \"Airport 1975\" comes \"Airport '77\" which is a welcome addition to the Disaster Movie genre. In typical \"Airport\" fashion, a routine plane ride, this time carrying various celebrities and other high-profile people, gets into some trouble when it crashes into the ocean in the middle of the Bermuda Triangle....<br><br>Though the decor of the flash plane filled with VIP's is dreary compared to the fabulous colours of the chairs in \"Airport 1975\", the characters are a major improvement, along with the actual danger that the passengers and crew are placed in.<br><br>In typical Disaster Movie style, the cast is large, and many of them are forgettable, however, stand-out performances in \"Airport '77\" include Jack Lemmon in a serious role as the likable Captain Gallagher, Lee Grant is Karen Wallace a VIP guest of the nasty variety, the underrated Pamela Bellwood as a young mother, the lovely Kathleen Quinlann is as usual outstanding, but unfortunately under-used here, but the stand-out star of the film is of course Brenda Vaccaro as Captain Gallagher's girlfriend Even Clayton. Vaccaro is certainly one of the better leading ladies in a Disaster Movie, but is also a surprising choice. Nevertheless, she is fantastic, it is a shame she is not more recognized for her work.<br><br>Overall, \"Airport '77\" is a terrific, and often overlooked addition to the genre, with a super cast, great direction, and a very interesting scene in which the plane is raised from the ocean, according to the credits, this is the actual method used by the Navy, which is a nice addition to the film.","user":"boyinflares","rank":[25,29]}]