[{"title":"The Superb John Gilbert","rating":10,"date":"3 November 2007","review":"One of the great films of all time. John Gilbert stars as a callow lad from a wealthy family who joins up at the start of World War I. The film follows him through his early days in the army, his days in rural France, and then his time at the front, and finally his return home.<br><br>King Vidor directs this amazing film, one of the best war films ever made, with touches of humor and irony, but never losing sight of the horrors and stupidity of war.<br><br>John Gilbert would have won the Oscar for 1925 if the awards had started then. He's simply superb as Jack. You watch his eyes as this films goes on. In the beginning his eyes twinkle with glee and delight as he makes friends, finds love, and grows into manhood. Then his eyes change and go dead as he experiences war. This is one of the great silent film performances.<br><br>But the film also boasts great work from Renee Adoree as Melisande and Karl Dane as the Swede. Co-stars are Tom O'Brien as Bull, Hobart Bosworth and Claire McDowell as the parents.<br><br>The TCM copy I have has a incredible score by Carl Davis. There is one scene when Gilbert is off to the front and he can't find Adoree. The music is a discordant mishmash of previously heard tunes, and the music grows louder and louder until they find each other. The scene that follows is heartbreaking and unforgettable.<br><br>But this film is full of great scenes, including the one where Gilbert teaches Adoree to chew gum. So simple yet so charming. Then there's the shower scene where Gilbert has gotten a wine barrel (hilarious) so the guys can have a shower.<br><br>There is a great title card that reads simple: IT HAD BEGUN..... So few words and yet so full of meaning. The battle images are among the best and bring the full horror of war home. Vidor assembles amazing scenes of men marching in line to death, of men trapped in shell holes, of planes swooping over the bombed-out fields. This is an incredible movie.<br><br>TCM host Robert Osborne mentions that THE BIG PARADE played for an astounding 95 consecutive weeks in New York and that it rivalled THE BIRTH OF A NATION and GONE WITH THE WIND as the biggest money-making film of all time. This is the film that, along with THE MERRY WIDOW, made John Gilbert the king of Hollywood in 1925. And his crown was well deserved; he is magnificent.","user":"drednm","rank":[52,60]},{"title":"a gorgeous, harrowing story of heaven and hell","rating":9,"date":"6 April 2016","review":"I could try and pick apart some things with King Vidor's The Big Parade - the fact that the resolution is a little hackneyed (not a little, actually, more than a lot being a \"classic Hollywood Ending\" as you'd hear in the cliché terms), or that the romance that blossoms between the American nice guy Jim (John Gilbert) and the French farm girl Melisande (Renee Adore) is all predicated on the fact that they both find each other charming visa-vi not knowing the other's language at all. Some of these things keep it from being in the 'All Time Super-Great Silent Films', and yet when it's wonderful and moving and spectacular and brutal it's all of those things times a hundred. It's both a tender romance and a earth-shattering and horrible story of World War 1 (were there any others that were compelling, I mean that as a compliment by the way, not the 'bad' horrible in terms of quality of the art).<br><br>Vidor knew how to get in Big Parade not even so much the greatness in the full scope of the story - if you're looking close enough there's some problems - but in all of the little moments and things that you remember, which are all done with truth to whatever the main feeling is, and it's shot and communicated in a way that's sophisticated for the time. Hours after seeing the movie (and I'm sure this will also be days and weeks later) I'll remember how Jim sort of first piques Melisande's attention by being stuck inside of a giant barrel and walking around in the mud unsure where to go; or when the cake that's sent to Jim is split by him in three parts, the others going to his new friends Slim and Bull and he getting the smallest piece (both of them from other, working class backgrounds, unlike Jim who is more upper-middle class, so to speak, meant to bridge the gap and show war makes everyone equal in the eyes of combat); that moment when the guys are walking in the woods and people behind them just start falling down, one by one, via sniper fire before the bigger strike happens; when Jim and Melisande use the little translation book to try and express their feelings of love and happiness to one another, which is charming in an unironic way.<br><br>So many scenes and things are choreographed to such a fine point that I want to love the movie even more than I do: there's a sequence where you get Jim and all the other soldiers, who have been sort of hanging out in this French village without any combat, called in to head to the frontlines finally, and as Melisande tries so desperately to find her love (as he is too), and that moment where they connect and can barely let go, that couldn't be done today. I'm sure most directors would look at a sequence such as that, which goes on for about 6 or 7 minutes (and this includes when the two lovers finally connect and can barely be pulled apart as she chases after his military truck driving away) that seems so earnest that it might look corny. You have to commit to that level of high emotional resonance, but Vidor does and the actors do, and if you happen to be watching the version with Carl Davis's musical score, which verges on the sentimental and even brings up military march music at times, you can't help but go for it 100%.<br><br>The Big Parade is a long movie, but not really too long, and when it flows from setting up our primary characters and then moves into the war scenarios it's natural and compelling. And there's some great conflict for Jim with his romance due to the lady-back-at-home (which is part of why later on the final five minutes is just OK instead of great, though not without some impactful images and grandeur). And all in all, Vidor and MGM succeed at making a war movie that is not exciting in such a way that it makes war look glorious. On the contrary this seems more like the first part of a double bill with All Quiet on the Western Front (I'd be curious if that ever actually happened in a theater), and by having us spend a lot of time with Jim and his friends, the latter of which get into some shenanigans and do some tomfoolery and all that which is genuinely funny (i.e. a scene in a wine cellar and a frustrated mail scene are the highlights), it makes what they go through all the richer and experience.<br><br>It's a kind of pure story of heaven and hell found in humanity, and if anything its imperfections make it more endearing than many other films slick surfaces.","user":"Quinoa1984","rank":[11,11]},{"title":"One of the Finest Movies of Its Own or Any Other Era","rating":18,"date":"18 October 2004","review":"A fine silent classic that has held up very well, \"The Big Parade\" is one of the very best films of its era and of its genre. It has a nice blend of drama, action, and lighter moments, with plenty of good photography and settings. The characters are simple, believable, and unpretentious, and they are brought to life well by the cast. Its commentary on the war is to the point, yet in a thoughtful way, without the heavy-handed cinematic ranting that mars so many films about war.<br><br>The early scenes work very well in introducing some of the characters and themes. Its portrayal of the USA's entry into the war is intelligently done, while holding nothing back in its perspective. By not assigning blame or responsibility to any specific persons or countries, it enhances its portrayal of the kind of mentality that so often prevails in such situations. It is a believable, and sometimes subtle, sequence that works quite well.<br><br>Once the movie gets into the main story, it uses the \"parade\" imagery well, and combines it effectively with the personal development of the characters.<br><br>John Gilbert and Renée Adorée work quite well together, and Gilbert's army pals are both used effectively. There are quite a few memorable scenes as it depicts a full variety of wartime experiences. The lighter sequences are used particularly well, not as raucous humor but as moments of the more sensitive side of human nature that is still there somewhere amidst all of the turmoil.<br><br>There's much more that could be said about such an absorbing film, but watching the movie is more rewarding than reading about it. It's neither an action-heavy war film nor a superficial, easily understood movie contrived to prove a particular point; it's something much better that fully repays careful attention and appreciation.","user":"Snow Leopard","rank":[34,40]}]