[{"title":"An odd piece of work...","rating":7,"date":"19 July 2000","review":"For the longest time, I liked this movie better than the original Care Bears movie.  Well last summer, I watched them both together and decided I was wrong.  The first one is a better Care Bears movie (as you may have guessed if you read my review for it).  This one isn't a BAD movie, it's just... VERY STRANGE.<br><br>Well first of all, as a few people have mentioned, it completely disavows any knowledge of the first movie.  I can't think of another sequel that contradicts the original so blatantly (especially with the genders of some characters and how they all met).  When I was little and watching this, I was quite a bit confused and distraught.  I felt the same way watching it as an adult!<br><br>On to the reasons why the movie is actually pretty good (IF you disassociate it from the first movie).  I can't think of another movie for little kids with a DEMON as it's villan!  Now I am not for a minute suggesting that evil demons who want to steal the souls of campers and Care Bears are good, I just find it cool that there's a SUPREMELY EVIL BEING in a movie for little kids!  It's like that bizzare \"Santa Clause vs. Satan\" movie from Mexico you hear about sometimes.  <br><br>Anyhow, the demon's name is Darkheart and he wants this chick to help him get the Care Bears in return for him giving her special powers.  Very dark for a kiddy flick eh?  And did I mention that Darkheart appears to the girl most often as a WHINEY VOICED 10 YEAR OLD BOY???  Freaky!  Meanwhile some other kids are in Care-a-Lot looking after BABY CARE BEARS!  Oh, man! Demons and baby Care Bears IN THE SAME MOVIE!!!!!<br><br>Needless to say, everything gets cleared up in the end (but not before we get to see Darkheart trap the Care Bears' souls in this scary chandelere thing in one [surprisingly] deeply disturbing scene).  But I am left with the question of wether this movie has found the cult audience it so richly deserves.  I might just watch it again myself.","user":"La Gremlin","rank":[9,11]},{"title":"Is it really all that bad?","rating":10,"date":"22 June 2003","review":"In an era of such awful cartoons, I am rather in shock to see a movie with such good morals make it to the IMDB Bottom List for Animated movies.<br><br>\nThis movie does contradict the first. I won't deny that.  However, when I was in the target age group for this movie, I didn't even notice, nor would it have mattered if I did. The people who made it may have used \"New Generation\" to note that this is another way the Care Bear Family could have began. Perhaps we are meant to decide for ourselves how the Care Bear family truly began.<br><br>This was my favorite movie at age 3-6, and it did not scare me or confuse me at all.","user":"ShancyShance","rank":[4,4]},{"title":"I really liked this movie as a kid, and I still like it now","rating":8,"date":"12 October 2009","review":"Care Bears Movie 2: A New Generation isn't at all a bad movie. In fact, I like it very much. Yes I admit the dialogue is corny and the story is a bit poorly told at times. But Darkheart, while very very dark is a convincing enough shape shifting villain, and Hadley Kay did a superb job voicing him. Speaking of the voice acting, it was great, nothing wrong with it whatsoever. The animation is colourful, and some of the visuals particularly at the beginning were breathtaking. The songs and score are lovely, especially Growing Up and Forever Young, the latter has always been my personal favourite of the two. The care bears, who I do like, are adorable, and the human children are well done too. And the ending is a real tearjerker. All in all, harmless kiddie fun. 8/10 Bethany Cox","user":"TheLittleSongbird","rank":[6,7]}]