[{"title":"Visually stunning, provocative drama.","rating":5,"date":"5 October 2004","review":"Powerful drama centering around elderly NYC slum-area pawnbroker (Rod Steiger in Oscar nominated performance), tormented by his painful memories of Nazi concentration camp nightmare. Embittered, he brushes off all friendly people in his life, insisting that nothing matters and emotions are wasted. <br><br>Apparently \"playing the system\" for years, allowing king-pin thugs to use his store as a money laundering \"front\", while collecting his \"cut\", the no-nonsense pawnbroker is suddenly plagued by flashbacks, showing how his young wife and son are killed, and at once wanting to stop the evil workings of his hoodloom infested slum neighborhood. When the young \"apprentice\" he hired lays his own life on the line to protect him from being shot during a robbery, the pawnbroker shows his first human emotions since the horrific day he lost his family.<br><br>The flawless direction, masterful black &amp; white cinematography, haunting Jazz score, along with innovative handling of the themes (racism, prostitution, social reforms, etc.), make this nothing less than a masterpiece. There is a sequence with prolonged nudity, considered daring during the \"Hayes Code\" years, even if it appears tame by today's standards. The scenes are not gratuitous, but essential to the plot. Still these scenes may make this film unsuitable for pre-teens. <br><br>Like Shindler's List, this is a film many may find painful to watch. By 1965 standards, the mere attempt of giving insight into the evils of the Holocaust was a strong move. The resulting product withstood the test of time and will endure. Named as his personal favorite work, \"The Pawnbroker\" gives us Rod Steiger's finest performance! Highly recommended.","user":"mdm-11","rank":[85,91]},{"title":"Transcends the usual victim's story","rating":11,"date":"11 April 2003","review":"This movie gets under your skin. The story, the acting, the black and white fotography and Quincy Jones' soundtrack make this a very memorable experience.<br><br>Occasionally we are made to believe that victims of atrocious crimes are \"good people\". While it is true that they have suffered greatly and those who never did owe them sympathy, it is just not logical to conclude that victims have acquired \"goodness\" solely by being victims surviving their ordeal. The Pawnbroker deals with the fate of such a survivor. It does it in a way that is unique: The victim becomes a real, three dimensional person - a great performance by Rod Steiger - and the victim has a normal everyday \"life after\" that grinds on and on.<br><br>You feel sorry for pawnbroker Sol Nazerman, because you know that he has been through hell, that his family was annihilated, that he was humiliated beyond endurance in the most sadistic way. At the same time you have to admit that Sol Nazerman is not a very pleasant character. Is it the result of his terrible experiences that he is that way? The movie says as much, but does it really matter? Nazerman functions as an independent, tax paying citizen, and he is trapped within himself. He is slowly despairing behind the bars of his pawnshop counter. He is full of bitterness and self hate and meets material and emotional requests from others with sharp sarcasm.<br><br>What makes the story and the film really great is the way it shows Nazerman's inability to communicate within his surroundings. In the depiction of Nazerman as a misfit the movie goes beyond the specific historical and geographical circumstances  and in giving the social misfit a face and a voice lies the brilliance of all of Rod Steigers best performances.<br><br>POSSIBLE SPOILER AHEAD<br><br>The pawnbroker has a helper who is the person closest to him. Jesus, a cheerful, somewhat naive youth from the neighbourhood, is very eager to learn business from Nazerman. He is full of hope and convinced that by finding out his boss's \"secrets\" he could get on the way to prosperity. Nazerman at times shows a glimpse of love or even fatherly feelings for Jesus. For me the climax of the film is when Jesus asks his boss casually about \"his people\". Nazerman starts telling Jesus in a brilliantly phrased, sermon-like summary of the four thousand years of Jewish suffering. The miserable pawnbroker gets heated up, his voice and his anger rise. Jesus writhes uncomfortably. When it's over Jesus gulps and says: \"You are some guy\"  and the episode is over. It shows with much clarity - and this really impressed me very much - that Nazerman was not aware that he expressed himself in a way that a kid with the background of Jesus could not possibly understand what he meant to tell him. This unawareness of the pawnbroker will at the end of the movie cost Jesus life. Nazerman then \"comes to his senses\" and squarely blames himself for the tragedy. The end of the movie is really too cruel to bear.","user":"manuel-pestalozzi","rank":[23,23]},{"title":"Heavy Duty Lumet New York Drama.","rating":7,"date":"21 January 2005","review":"Rod Steiger considered this his best performance and he might be right. He is, for him, subdued for most of the film, although towards the end he punctuates his performance with silent screams. He's pretty good as the survivor of Auschwitz, consumed by survivor guilt, and denying himself any pleasures except the money taken in his pawn shop.<br><br>Various figures come and go in his life, although he shows no particular interest in any of them, and aversion towards many. The characters are rather sketchily done, as they might be in a play. There is the ambitious assistant, the whore, the gangster, the lonely man who wants to talk about Herbert Spencer, Reni Santoni as a quivering junkie, the pregnant young girl who wants to sell her engagement ring. (Not a wedding ring, mind you, this is an illegitimate pregnancy and in 1964 you were still in trouble if you had no husband and no opportunity for an abortion.) \"That diamond is glass,\" he tells the stricken girl brusquely. Steiger's Sol Nazerman is a pretty cold fish.<br><br>His relationship with his Latino assistant is key to Steiger's evolution. Steiger \"teaches\" him that nothing matters but money, so Ortiz very sensibly decides to help the local gangsters hold up Nazerman's shop. But the assistant, instead, teaches Nazerman something. Killed in the robbery, he teaches Nazerman to feel pain, which Nazerman then reaffirms by impaling his palm on one of those spikey receipt holders, a kind of stigma to go along with his concentration camp tattoos.<br><br>The movie was pretty much a shocker on its release. Partly because the audience got to see some naked breasts. Amusing now, isn't it? It was also knocked because of the way Latinos and blacks were treated. I don't know why. It would be surprising if the owner of a pawn shop on 116th street didn't have a lot of customers who were people of color -- good and bad.<br><br>The jazz score is loud and at times almost overwhelming. The photography makes 1964 New York grimy, smoggy, and dangerous.<br><br>If you haven't seen it, catch it if you have the chance. You're not likely to forget it in a hurry.","user":"rmax304823","rank":[47,50]}]