[{"title":"Deserves more credit but also deserves criticism","rating":11,"date":"11 September 2003","review":"DUNE is an odd film.  After having watched it several times over the years, I'm not afraid to call it a very flawed classic.  That sounds strange, but it fits for this movie.  Lynch got so many things right, but in the end the shortcomings of trying to squeeze an epic story into a little over 2 hours was simply too daunting a challenge.  Besides, I'm sure many went into the theatre expecting a film in the vein of STAR WARS.  <br><br>DUNE is not a story with which one can delve into brainless.  It does require thought, for it's inaccurate to portray it as anything less than a thinking person's story.  It's not space battles, laser-gun shootouts, funny aliens, etc. There's nothing wrong with those things, it's just not what DUNE is about.  It touches on everything from politics, religion, ecology, the true power of the human mind and will when fully realized, God, etc. Some heady stuff.  <br><br>So imagine trying to fit all that in a movie.  <br><br>Lynch got the feel, the imagery down, but wasn't able to cohesively bring the story around w/o really making it a Cliff Notes version of the story. You get the main gist, but don't get the \"full story\", the themes, etc.  So in the end it does disappoint because you're left  wondering what may have been had the movie conventions of that time  allowed for a 2 or even 3 movie epic.  Oh wait, STAR WARS did that.  I guess DUNE wasn't viewed as bankable enough to make such an investment.<br><br>Anyway, I still like the film a lot.  The visual realization by Lynch makes it a classic in my book, too bad it couldn't be matched by an equally strong script. I wonder if Peter Jackson would be willing to tackle another 3 film epic? Hmmmmmm.....","user":"superman2k38","rank":[47,49]},{"title":"Dune","rating":14,"date":"14 September 2004","review":"First of all I've read Herberts Dune saga and I loved the first book (the one the movie is about) and liked the rest.<br><br>Second there is a difference between the cinema version (137 min) and the TV version (190 min often referred also \"special edition\") which should also not be confused with the new version from 2000 (Frank Herbert's Dune). To keep it short the 137 version is great and the 190 min version sucks.<br><br>The TV version was split up to fill 2 evenings. For that they added about an hour of additional material not seen in the original version. While some of it is quite good like the prologue which went a little bit deeper into the Dune universe (Butlers Djihad) but most of it just destroys the atmosphere and the flow of the movie. On the technical side there is to note that the whole movie was Pan-Scanned which never is a good idea. Compared to the original version the quality really blows.<br><br>Now to the good one:<br><br>The movie is pretty much faithful to the book. There are things that were cut out from the book or it shows stuff that wasn't there, but what you see is CLEARLY Herbert's book which I thought is nearly impossible to translate into a (good) movie. It translates the \"feel\" of the book very well to the screen.<br><br>The most notable differences is that in the book Paul is at the age of 15 (at least at the beginning) while McLachlan more looks like 20 but I can live with that. The rest are minor things (like these sound modules) and some differences in continuity (the navigators needing the spice to well... navigate is revealed at the beginning).<br><br>The all actors give a solid performances. Notable are Kenneth McMillan (Baron Harkonnen) Patrick \"Captain Picard\" Steward (Gurney Halleck) and Sting as Feyd Rautha which really add to the movie.<br><br>The special effects range from crappy to good. The movie shines where it 's most important namely the sand worms which look fairly convincing. Personally I prefer (well done) miniature shots over those Episode 1/2 CGI effects which make especially environments look like plastic.<br><br>I think everybody who calls himself a Science-Fiction fan should have seen this movie which is a jewel under all those mediocre films that were spawned by Star Wars at that time. All the fans of the book should see it as what it is: A movie based on Dune. If you want the book word by word, don't watch the movie and read the book again.","user":"InspectorColumbo","rank":[204,260]},{"title":"Why does Lynch hate this one?","rating":9,"date":"15 April 1999","review":"To begin with, I have to say that I saw the movie first, and read the book years later. This seems to be important: Nearly everybody who read the book first hates the movie, but most of those who saw the movie first seem to like it.<br><br>Now, why is this so? I cannot really understand it because, in comparition to other movies based on existing literature, what we have here is a film which stays very close to the original story and does not add many new elements.<br><br>When I read the book, I could see the movie in front of me in nearly every chapter. So I really don't understand what Herbert-Fans had expected from this movie...<br><br>I for my part like it a lot. It has a very mystical atmosphere about it and the story develops nicely. Of course there are some elements which are simply not explained and are therefore very confusing, but somehow this seems to be a thing Lynch tends to do in every of his movies, so what? I like some simple scenes like the opening monologue a whole lot. I LOVE the music (which played in my mind all the time while I read the book), and I think the characters are very strong and (for example Letho Atreides) sometimes full of tragedy.<br><br>The part I like the most though is the worm-part. I think the special effects are not always brilliant, but seeing the scenes with the worms, I am really awestruck because they are so impressing.<br><br>All in all, I think this is one of the more underrated movies in Science Fiction history. It may be because the director himself was not happy with it, or because fans expected too much from a simple two hour movie. I always enjoy watching this film and listening to the soundtrack. And I would love to see a Director's Cut version.","user":"Starbuck-13","rank":[321,432]}]