[{"title":"Chilling ghost story","rating":9,"date":"14 June 2005","review":"\"The Changeling\" tells the story of a composer (George C. Scott) who, as the film opens, loses his wife and daughter in a tragic accident. Getting away from it all, Scott buys an old home to get his mind right and to get back to doing the work he loves. Soon he discovers that his house is haunted and filled with secrets waiting to be revealed. To say much more then that would be unfair to the first time viewer.<br><br>Suffice to say this is a chilling film with several good scares that aren't achieved by manipulating the audience. By that I mean loud chords of music on the soundtrack or the unexpected cry of a cat or something like that. \"The Changeling\" works for its scares and succeeds. Another big reason the film is so well done is the performance by Scott. For a change the hero in a ghost story is not a wimp but a strong, self assured man who is going to fight to the bitter end to find the truth and get his life back. Very few actors could have pulled it off better then Scott.<br><br>The supporting cast is headed by Melvyn Douglas (in one of his last roles) and Scott's wife, Trish Van Devere who projects a look of total terror as well as anyone I have seen.<br><br>Two moments that stand out are the séance scene which is eerie and the unexpected arrival of a child's toy ball. This film will give you shivers. If you are a fan check it out and make sure to watch it with a loved one cuddling up against you with all the lights turned out.","user":"jrs-8","rank":[100,109]},{"title":"First-Rate Haunted Horror","rating":10,"date":"10 November 2001","review":"George C. Scott loses his wife and daughter in a car accident, moves to Seattle, and rents a gigantic old mansion with a haunted secret past.  This film is skillfully directed by Peter Medak who gets more that even he probably bargained from a solid cast of actors, a wonderful script, and one great-looking eerie old house.  Medak creates tons of suspense with the barest sight of blood.  This film reeks atmosphere.  The house reeks atmosphere.  Scott's performance and that of veteran Melvyn Douglass reek atmosphere.  Doors creak, balls mysteriously bounce, water runs, windows break in the old house trying to tell Scott about the secret of a young child that once lived there.  The script is fanciful yet well-written and very creative.  Scott gives an atypically subdued performance that suggests passion, heartbreak, and tenacity.  The rest of the performers are very good too.  I cannot remember the last time Mr. Douglass gave a poor performance. Some of the scenes that really stand out in my mind are flashback sequences showing the terrible secret that has been hidden in the house for over 70 years.  Medak doesn't have a huge budget to work with here, but this movie beats out newer haunted house films like the remake of The Haunting by leaps and bounds.  This is one classy scare film!","user":"BaronBl00d","rank":[94,103]},{"title":"Very scary and atmospheric horror film","rating":8,"date":"13 March 2005","review":"In this sadly forgotten horror film, George C. Scott plays a music composer who has just moved to Oregon to escape the painful memories of his wife and daughter who were killed in a car crash. He rents an old and secluded mansion from the historical society as a place to live. Soon after he moves into the house, strange occurrences begin.<br><br>This is one of those horror movies that can be scary without being bloody and gory. It simply relies on atmosphere and frightening, but subtle images to deliver its chills, and it works. I will never be able to understand that \"R\" rating mainly because there is only very mild profanity and there is no blood or gore. Anyway, I would recommend this film to anyone who enjoys a good scary ghost story. 8/10.","user":"Idocamstuf","rank":[85,98]}]