[{"title":"Everything that The Beatles' Yellow Submarine should have been","rating":10,"date":"25 June 2005","review":"This is one of those films where it is easy to see how some people wouldn't like it. My wife has never seen it, and when I just rewatched it last night, I waited until after she went to bed. She might have been amused by a couple small snippets, but I know she would have had enough within ten minutes.<br><br>Head has nothing like a conventional story. The film is firmly mired in the psychedelic era. It could be seen as filmic surrealism in a nutshell, or as something of a postmodern acid trip through film genres. If you're not a big fan of those things--psychedelia, surrealism, postmodernism and the \"acid trip aesthetic\" (assuming there's a difference between them), you should probably stay away from this film. On the other hand if you are a fan of that stuff, you need to run out and buy Head now if you haven't already.<br><br>Oddly, the film has never received much respect. That probably has a lot to do with preconceptions. After all, it does star The Monkees--Micky Dolenz, Davy Jones, Michael Nesmith and Peter Tork--and The Monkees were a musical group of actors put together by producers Bob Rafelson and Bert Schneider to be a kid-friendly, bubble-gummy Beatles for a television series. In their era, they had as much respect as, say, Menudo, New Kids on the Block, The Spice Girls, and so on. As a fellow IMDb reviewer rightly notes--\"Perhaps people in 1968, thinking of the Monkees as a silly factory-made pop band rip-off of the Beatles, refused to see (Head)\".<br><br>The Monkees and Head have never been quite able to shed that negative public perception. It's a shame, because there was a lot of talent, both musically and otherwise, in The Monkees. It's probably odder that Rafelson, who directs here and co-produces with Schneider, and Jack Nicholson (yes, _that_ Jack Nicholson), who wrote the script and also co-produces, decided to take The Monkees in this unusual direction. It's as if New Kids on the Block suddenly put out an album equivalent to Pink Floyd's Ummagumma (1969) or Atom Heart Mother (1970). In fact, the songs in Head, written by The Monkees and frequent collaborators such as Carole King and Harry Nilsson, have a Floyd-like quality, somewhere between the Syd Barrett era and the immediate post-Barrett era. This is much more prominent than any Beatles similarity. Some people have complained about the music in the film, but to me, all the songs are gems. For that matter, some people dislike Barrett era (or other) Floyd, which is just as difficult for me to empathize with.<br><br>But what _is_ Head about? The basic gist is just that The Monkees are taking a trip through various film genres--there are war scenes, adventure scenes, horror scenes, comedy scenes, drama scenes, western scenes, sci-fi scenes, romance scenes, and on and on. Except, in the film's reality, this turns out to be happening primarily (if not exclusively) on a studio lot. At root, we're watching The Monkees shoot a film. Of course all of the scenes in the various genres have something surreal and self-referential about them, and they, and individual shots within a scene, tend to lead to one another using dream logic not dissimilar to the Monty Python television show. As a dream, Head tends to vacillate between a good dream and a nightmare, while often being one that would cause you to laugh in your sleep (something that I frequently do, by the way).<br><br>Technically, Rafelson uses a wide variety of techniques to realize the above. There are scenes with extensive negative images, there are a lot of very fast cuts (including a great sequence that features Davy Jones and Tony Basil dancing alternately in a white and a black room, wearing a combination of white and black reversed in each, that occasionally toggles back and forth as quickly as two frames at a time), there are a lot of bizarre segues, there is an animated cow mouth, there are odd editing devices, and so on. For my money, I wish this stuff wasn't just a relic of the psychedelic era. This is the kind of artistic approach I relish. It seemed like a good idea back then and I still think it's a good idea. I'd like to see films like The Life Aquatic with Steve Zissou using (2004) using these types of extended techniques. Now that would make that film surreal.<br><br>Interpretationally, some folks who aren't so in tune with the acid trip aesthetic have complained that it's basically b.s. to offer meanings for something intended to not have any. I disagree with such a pessimistic/nihilistic view; Head was intended to have a lot of meaning(s), and it's not just films without conventional plots that have multiple interpretations. Nicholson, Rafelson and Schneider have a lot of interesting things to say about The Monkees--the film postmodernistically comments on their manufactured status; pop stardom--way before Pink Floyd, Head conflates pop stardom and violence, from images of war to images of fans cannibalistically dismantling their idols; and naïve U.S.-oriented ideas of international perceptions and respect--well-armed foreigners in a desert surrender to Micky Dolenz just because he's an American, then later they blow up a Coke machine (again in the desert) for him because he's thirsty and can't gain access. The film comments on many other topics--from big Industry to police, surveys, spectatorship (especially in relation to tragedies), and on and on. Head is full of ideas, appropriately enough, with intelligent, multifaceted things to say about them.<br><br>Head deserves to be considered a classic--it's basically shooting for the same vibe as The Beatles' Yellow Submarine. Both premiered in November of 1968, interestingly enough, and both were intended as something of a summation of the psychedelic aesthetic. Yellow Submarine wasn't quite successful. Head is everything Yellow Submarine should have been.","user":"BrandtSponseller","rank":[92,103]},{"title":"A Psychedelic Documentary","rating":8,"date":"29 September 2002","review":"\"I am ... proud of 'Head',\" Mike Nesmith has said. He should be, because this film, which either has been derided by many of us or studied and scrutinized by film professors, works on many levels.<br><br>Yes, it's unconventional. To many, frustrating. It's almost as if the producers hand you the film and tempt: \"You figure it out.\"<br><br>You probably already know that The Monkees TV show was a runaway marketing success that depended upon business acumen and no small serving of public deception. TV shows are about selling soap and toothpaste first, than to entertain. That The Monkees broke out of the box for a short time to make \"Head\" is a testament to the group's popularity and importance in pop culture, despite where your head's at. Get one thing straight: \"Head\" is not The Monkees TV show.<br><br>So what we have here is a \"psychedelic documentary\" about Western pop culture from a source that has authority on the subject. \"Head\" is a movie that could only come from those \"inside the box\". By 1968, The Monkees' cast and crew were seasoned and weary professionals who had seen their share of promise and disappointment. The movie was a deliberate attempt at market repositioning. So, it did three things: Make a film the way The Monkees envisioned. Most importantly, reinvent the group to one not subservient to it's old bosses - and yas, hipper than before. Make a film that exposed American attitudes of information dissemination.<br><br>\"Head\", therefore, really is about media manipulation and its net result: deception. The mass media is supposed to inform, educate us on the happenings in the world at large, and ultimately asks us to form opinions of these events that can shape thought into positive action. Thus we assume the information we absorb to be complete and unbiased - otherwise, how can one establish a valued conclusion on any one idea presented by a book, newspaper or TV show? In one of the street interviews in \"Head\", a guy admits, \"I haven't looked at a newspaper or TV in years.\" Is he lesser or better the man? Even the drug parallels are a soft veiling of \"Things are not as they seem.\" Remember the old joke, \"Everything you know is wrong\"? The screenplay starts with The Monkees' public admission of it's own \"manufactured image\" and runs with the football - literally. Is the football scene in the movie a visual manifestation of the whole idea behind \"Head\"? Is the film a stream-of-consciousness exercise? Is the film the culmination of pot smoking marathons? There are too many coincidences that occur in the film that suggest otherwise. My guess is that \"Head\" is the culmination of motivations somewhere between intended and unintended.<br><br>Largely, the insiders responsible for \"Head\" seem to enjoy themselves in the revelries that take place in the film, but there is anger - anger at the chaos that characterized the late '60s and anger at the way the media, television especially, had changed culture in negative ways. Drugs and violence were strong negative forces in the late '60s and still are, but the producers of \"Head\" want you to know that poor \"information\" is a far greater danger.<br><br>Wars have been attributed to hoaxes and lies. What perfect way to spread disinformation than through TV? Repeatedly, the mysterious black box is seen as an obstacle to The Monkees and seemingly, all of us as well. In one scene, Peter is sullenly sitting in a saloon holding a melting ice cream cone, and is asked by a fellow Monkey, \"What's wrong?\" \"I bought this ice cream cone and I don't want it.\" The movie suggests that the first purpose of the media is NOT to inform, but to sell en mass blindly. \"Head\" goes further: put any idea into someone's head, and merrily goes he.<br><br>The filmmakers know this, and the danger is real. \"Head\" is either a movie that creates itself \"as we go along\", or is a deliberate statement. Perhaps, perhaps not. Maybe it is just \"Pot meets advertising\", as critics scathed in 1968. The jokes are on The Monkees and us. Be careful what you ask for, you may get it.<br><br>Cheers: A true guilty pleasure. Very funny. Intelligent. Will please the fans. Find the substance, it's there. Unabashedly weird. Bizarre collection of characters. Good tunage. Length is appropriate. Lots of great one liners, including my all time prophetic favorite: \"The tragedy of your times, my young friends, is that you may get exactly what you want.\"<br><br>Caveats: Dated. Drugs. No plot. No linear delivery of any thought in particular. At least twenty-five stories that interweave in stop-and- go fashion. So, may easily frustrate. May seem pretentious to some. People who can't stand The Monkees need not watch, though that in itself is no reason to avoid it. The psychedelic special effects may kill your ailing picture tube or your acid burnt- out eyeballs.<br><br>Match, cut.","user":"Saturday8pm","rank":[52,58]},{"title":"Head was like an AMAZING twilight zone episode exploring whether fictional characters have free will","rating":10,"date":"14 January 2007","review":"This all-but-ignored masterpiece is about the Monkees becoming aware that they are fictional characters in a movie (Head), and that everything they do or say had already been written in an (unseen) script they seem to be following. Head was written by Jack Nicholson, Rafelson, and Peter Tork during a three-day LSD trip in a suite at an expensive Hollywood hotel. The other three Monkees only acted in it.<br><br>They fight this every way they can by doing things not in the script. They deliberately flub their lines, walk off sets, tear up scenery, punch other actors for no reason; and ultimately, commit suicide by jumping off a bridge. <br><br>For instance, in the rapid flashes of a psychedelic party scene, if you watch frame-by-frame, you can see Rafelson sitting next to the camera and cameraman, very deliberately shooting into a mirror. He is revealing that the party is actually fake and is being shot in a studio with actors who suddenly drop out of character and walk away in the middle of a conversation when the Director yells \"cut!\"<br><br>The Monkees, however, never drop out of character because those characters are also who they really are. That ends up being the core of the Revelation soon to come.<br><br>At every turn, they realize their increasingly-bizarre actions were exactly what they were supposed to do in the scripted film they can't escape being in. You say they went crazy and walked through the sky (which turns out to be painted on paper and hung from the ceiling as the set's background)? No problem! Hey, hey, they're the Monkees, and those wacky guys just keep monkeying around! <br><br>In the end, even their deaths did not set them free. That was how the movie was supposed to end, and their motionless, waterlogged bodies are fished out of the river, put in another box, and stacked in a film studio warehouse until the characters are needed again for another studio production.<br><br>This is made all the more poignant by the fact that the Monkees really ARE fictional characters who forced themselves into the real world. They did it through the power of their music.<br><br>Ironically, near the end, Peter Tork has what he rightly sees as a hugely profound revelation that solves their problem, but unfortunately, no one listens. <br><br>Peter realizes: \"It doesn't MATTER if we're in the box (the film)\". He means that it doesn't matter if will is free or illusory, and that \"the only important thing is that you just let the present moment occur and occur... You need to just let 'now' HAPPEN, as it happens\", without analyzing or evaluating or judging whether the experience is \"valid\" by some abstract definition.<br><br>When you can't even tell the difference, will being free or not doesn't matter--tying to figure out if you are the \"real\" you is just a pointless waste of time.<br><br>I saw this film at a very important time in my life. I was trying to figure out how to escape being just \"that geeky, creepy nerd girl\" by thinking about it intensely instead of just having fun (i.e., sex) like everyone else did. But the revelation in Head broke my self-imposed recursive trap and helped me more than Rafelson or Nicholson or Tork will ever know.<br><br>For decades, I've watched \"Head\" and wished I could thank Pete.<br><br>Was this a good movie?<br><br>Uhh, how about, like...<br><br>==&lt; YES &gt;==","user":"Luxi_Turna","rank":[28,30]}]