[{"title":"A Triumph For Reginald Owen","rating":10,"date":"25 December 2001","review":"The wretched life of a disagreeable old man is forever altered one haunted Christmas Eve...<br><br>Charles Dickens' wonderful Yuletide story, A CHRISTMAS CAROL, is given the full MGM deluxe treatment in this superior Holiday film. The production values &amp; acting are both excellent, with just enough sentiment to appeal to the tenderhearted, and with liberal doses of horror &amp; hilarity stirred into the mix, until, like a fine Christmas punch, the result appeals to all.<br><br>The film's rather short running time keeps the action moving along briskly, with one famous &amp; beloved episode after another coming alive before the viewer's eyes.<br><br>Reginald Owen, in his best film role, is perfect as the grasping, clutching, tightfisted, covetous old sinner, Ebenezer Scrooge. Replacing the ailing - and highly respected - Lionel Barrymore, Owen makes the part his own, revealing the old miser's misery &amp; heartache, making the part thoroughly human. When he rejoices in his spiritual regeneration at the climax, so do we.<br><br>The roles of Bob Cratchit, Scrooge's amiable clerk &amp; Fred, Scrooge's friendly nephew, are both fleshed out more fully than in other versions. The acting skills of Gene Lockhart &amp; Barry MacKay turn them into something very memorable.<br><br>Special mention should also be made of Leo G. Carroll as Marley's morose Ghost; Lionel Braham as an impressively jolly Ghost of Christmas Present; and Kathleen Lockhart &amp; Terry Kilburn as Mrs. Cratchit &amp; Tiny Tim. All add fine brushstrokes to the overall picture.<br><br>Movie mavens will recognize Billy Bevan as an officer of the Watch; Forrester Harvey as an ebullient Fezziwig; Halliwell Hobbes as a jolly Vicar; and young June Lockhart, in her film debut, as Belinda Cratchit - all uncredited.","user":"Ron Oliver","rank":[50,56]},{"title":"Entertaining version, though not faithful to novel","rating":8,"date":"6 April 2006","review":"We are tremendous enthusiasts of A Christmas Carol in our household and watch virtually all the versions each Christmas, including the modern 1984 George C. Scott and the 1999 Patrick Stewart. Our overall favorite, however, is the 1951 black &amp; white classic with Alastair Sim, who absolutely IS Ebeneezer Scrooge, his conversion ringing the truest. (See my comments on these other films, if interested) This older 1938 version makes a delightful story with a fine, though Hollywood generated, atmosphere. Of course one could never expect in those days to see all the location filming or special effects available today.<br><br>Reginald Owen, with his stooped figure and awkward gait, makes a likely looking Scrooge. My main problem with this movie is that he simply repents far too early. Before the Spirit of Christmas Past has taken leave, this Scrooge regrets his past miserliness and is ready to give generously &amp; make merry. What is the point of the other two Spirits? <br><br>In addition to Scrooge's totally premature conversion, however, this movie takes far too many liberties with the novel. To name but a few... First, during Marley's ghostly visit, Scrooge summons to his chambers a trio of police officers from the street below his window. Not only is this unfaithful to the book, but totally destroys the ghostly, eerie, haunted atmosphere of the spectre's visit and poor Scrooge's resulting terror.<br><br>This adaptation makes no mention whatsoever of the young apprentice Scrooge's sweetheart, Belle, or his tragically failed romance. It does depict his sister, Fan, as younger, in keeping with the novel ...unlike most versions, which erroneously portray her as older, and claim that Scrooge's mother died in childbirth when he was born. However, Fan is, frankly, an annoying little chatterbox here!<br><br>The nephew, Fred, is supposed to be married, but in this tale he is engaged to Bess, their marriage apparently contingent on an improvement in his financial prospects. Lots of fabricated scenes, with the pair sliding in front of a church. However, I can forgive all this as Fred is wonderfully jolly &amp; hearty, true to the book. In fact, he's one of the best Freds.<br><br>Bob Cratchit is jolly &amp; likable but a wee bit too plump for the role of the poor clerk! Also, there's a fabricated story here in which Scrooge sacks Bob altogether. Tiny Tim is cute but far too old for the role; he's practically as tall as his father. Mrs. Cratchit is convincing, except that she is actually the one who proposes a toast to Scrooge after their Christmas dinner...quite the opposite of the novel's Mrs. Cratchit, who must be coaxed and cajoled by Bob before deigning to lift her glass to the health of her long-suffering husband's oppressive, stingy employer. That being said, otherwise it's one of the better versions of the Cratchit family's dinner, the goose &amp; pudding scenes all beautifully done.<br><br>The worst offense is a complete elimination of the 'morning after Christmas' office scene, in which Scrooge normally shows his newfound benevolence to the flabbergasted Bob. This is usually my favorite scene in the entire movie. In this version, Scrooge actually delivers his Christmas turkey to the Cratchits personally himself on Christmas Day, with nephew, Fred, and his fiancée, Bess, both in tow. <br><br>However, the Spirits are well depicted, Christmas Past a beautiful &amp; ethereal young lady, Christmas Present a hearty &amp; benevolent giant (who sprinkles from his torch the essence of Christmas cheer five times distilled), and Christmas Yet To Come the typical darkly shrouded &amp; foreboding figure. It's all well intended and difficult to really ruin this wonderful story. For all its omissions, embellishments, and deviations, it still makes for entertaining and heartwarming holiday viewing.","user":"roghache","rank":[46,56]},{"title":"One of the Most Beautiful Christmas Tales","rating":8,"date":"2 December 2012","review":"In the Nineteenth Century, in London, the bitter, greedy and cranky Ebenezer Scrooge (Reginald Owen) hates Christmas and people. He runs his business exploiting his employee Bob Cratchit (Gene Lockhart) and spends unfriendly treatment to his nephew Fred (Barry MacKay) and acquaintances. <br><br>In the Christmas Eve, he is visited by the doomed chained ghost of his former partner Jacob Marley (Leo G. Carroll), who died seven years ago and tells him that three spirits would visit him that night. The first one, the spirit of past Christmas, recalls his happy childhood and coming of age; the spirit of the present Christmas shows him the poor situation of Bob's family and the happiness of Fred and his fiancée Bessy; and the spirit of future Christmas shows his fate. Scrooge finds that life is good and finds redemption changing thoughts about Christmas, Bob, tiny Tim, his nephew and people in general.<br><br>\"A Christmas Carol\" is one of the most beautiful Christmas tales in the cinema. I do not recall how many adaptations of one of the most known Charles Dickens' short story I have seen but this 1938 is also wonderful. I do not have much more to say but recommend this magnificent family entertainment. My vote is eight.<br><br>Title (Brazil): \"Um Conto de Natal\" (\"A Christmas Tale\")","user":"claudio_carvalho","rank":[18,20]}]