[{"title":"Simply a beautiful love story","rating":10,"date":"18 June 2007","review":"I first saw this film when it came out and just fell in love with it. I cannot say why either, it just has a magical quality that draws you in. The setting obviously helps, Liverpool is a beautiful city, architecturally and spiritually and you get lavish helpings of both. The performances from the four lead actors are flawless to me, just the right balance of comedy and pathos, with special mention to Margi Clarke, whose brassy exterior hides a tenderness which she allows to shine through every so often.(As an aside I saw her do stand up once at Band on the Wall in Manchester, and boy was she rude!) I've seen comments on the boards saying people enjoyed it when it first came out, but now find it a bit ridiculous, and I can only totally disagree with them. I still watch this film at least a couple of times a year and never tire of it. If you haven't seen this gem, I can only suggest you get the DVD as soon as possible, and enjoy a film that exudes true human warmth.","user":"rocknrelics","rank":[15,16]},{"title":"Bawdy, working-class \"love story\" set in Liverpool","rating":9,"date":"9 November 2002","review":"Frank Clarke is my favourite writer of British Films (Letter To Brezhnev, Blonde Fist, and I have just found out The Fruit Machine.)  The film is set in Modern day working class Liverpool, where two friends Teresa (the one and only Margi Clarke) and Elaine (Alexandra Pigg) hit the town one night and meet two Russian Sailors. Elaine falls head over heels in love and when the sailors set sail Elaine writes a letter to president Brezhnev of Russia regarding her love and the need to see him again as she believes she is being prevented by the British authorities.  It is not however a soppy love story, fast paced and again quite true to working class life in Britain in the 1980's. A Film Four production again, who have made the best low budget British Films of the last twenty years.","user":"StokeBlokeUK","rank":[11,12]},{"title":"Lovely lark about Liverpool Loonies","rating":10,"date":"2 January 1999","review":"Atmospheric, un-slick, and utterly unique, Letter to Brezhnev captures a slice of the 1980s which seems all the more extraordinary in 1999.  Graced by realistic acting, deft camera work, and a superb soundtrack, one is successfully transformed to a period and a place, in this case wonderfully dreary Liverpool in the early 80s - New Wave music and the Cold War are in full swing.  Such a movie is hip today but rarely achieved.  The story may seem a little far-fetched - Liverpool girl (Pigg) gets Russian guy (Firth) with a little help from no less than the Soviet Premier - but some of us who grew up in the 80s like to think that it could.  The 80s were like that. Now, we just have awful, cynical, formulaic pap - Reality Bites and Boys on the Side...whine, whine, whine.  Why can't more movies like Letter to Brezhnev be made?","user":"Jerome-5","rank":[13,17]}]