[{"title":"Gotta love Varney","rating":10,"date":"25 March 2011","review":"Some may say that people will get tired of Ernest. It's hard to believe. He's been gone for 11 years and there's still no sign of people forgetting Ernest. If people were tired of him much earlier on, why, I ask you, did Varney make 4,000 commercials? Yes, 4,000. I didn't add an extra 0 here. That's unheard of with any one else. Varney was the only one to reach cult status with 30 second ads. I don't even like commercials and I found his thoroughly entertaining. I loved them so much,I bought them on DVD. With that said, \"Ernest Goes to Jail\" is hilarious. And, we get to see him play bad-guy, Mr. Felix Nash-quite a difference from Ernest's goofball slap stick. Nash is far from Ernest, being organized, clever and mean. In this installment from the Ernest line, Varney shows off his God given rare talents. Looking in the mirror in jail, he tries to come off as Nash by using different voices and facial contortions. It never fails to make me laugh. The ink pen scene is classic. It's so funny watching him try to clean off the ink only to smear it worse all over his face. Plus, he gets electrocuted 4 times in this movie. \"Hey,Vern! No one gets electrocuted like Varney, KnoWhutImean?\" The beginning of the movie has Ernest trying to start the floor polisher only to have it take on a mind of its own by dragging Ernest all over the floor and up the wall. Ernest's screams are just adorable. Especially 4 minutes and 34 seconds into the movie. Any other jail movie would be loaded with violence and bad language and the fact is, I wouldn't care to watch them. This is probably the only jail movie that was free of vulgarity and was still a treat to watch. Varney made his Ernest movies kid friendly-for all ages to enjoy. C'mon, we all know that Ernest was Jim's true calling because mostly everyone refers to him as Ernest. And no one will ever be able to replace him. I know that Vern missed Ernest. He even left a note for Ernest at www.vernssuicidenote.blogspot.com. I've read it. It's quite humorous as well. When I first saw \"Ernest Goes to Jail\" at 14 when it first came out, I wanted a house like Ernest's, right down to that cool washer and dryer. The 'electric toothbrushes' would be pretty nice to have, too. Brush all your teeth at the same time in half the time. We all know that Jim paved the way for people like Jim Carrey and Larry the Cable Guy, but Varney kept it clean. Though, Jim Varney is still my number 1. Of course, with any Ernest movie, it will receive the highest rating possible.","user":"bug76","rank":[9,9]},{"title":"Jim Varney at his finest!!!","rating":4,"date":"4 October 2002","review":"\"Ernest Goes To Jail\" is probably the BEST \"Ernest\" film ever made out of all of the films. Jim Varney once again gives us more laughs as he plays the idiotic Ernest P. Worrel. In the movie Ernest is assigned jury duty for a murder trial. Nash (who wants out of prison badly) the man who is on trial looks exactly like Ernest, and switches places with Ernest to escape from prison. So in the process, our rubber faced nit wit gets to spend some time in the slammer. Jim Varney once again does an excellent job as the bumbling fool Ernest P. Worrell as well as escaped criminal look a like Nash. I thought it was cool how Varney switched continuosly throughout the movie with the 2 characters. Overall this movie rules!!","user":"dootuss","rank":[12,13]},{"title":"Jim Varney's Best Ever!!!","rating":25,"date":"25 May 2000","review":"Ernest Goes To Jail is the 3rd installment in the popular series, and in my humble opinion, the best. Jim Varney brings so much humor and character to the table in whatever he is in. So many jokes in the Ernest movies I did not get as a child, however, after viewing them as adults, I find them even more funny. Ernest was actually quoting Shakespeare and his arrogant soliloquies were classic. Varney shines in this movie:doing all the different voices, faces, and characters we have grown to love. What I really like about this film is his portrayal of Mr. Nash,the villain. Jim Varney does a complete 180 turn from his bumbling, idiotic Ernest P. Worrell. The look, the voice, and the attitude are very different from the other character, which is a what a good actor should do if playing 2 roles. Varney pulls them both off remarkably well. Also Chuck and Bobby provide great slapstick humor as always, and this film is a comedy classic that can be viewed by all ages. Jim Varney left this old world way too fast, but he also left us comic treasures in film such as this movie.","user":"teenwolf97","rank":[12,14]}]