[{"title":"A contrasting opinion...","rating":8,"date":"19 March 2006","review":"The previous reviewers obviously did not care for \"Drifters.\" Far be it from me to prescribe what they should or shouldn't like, but I wonder if they were viewing a heavily edited and/or sped-up VHS print. (One of them referred to a 45-minute cut.) In fact, \"Drifters\" should run just over an hour, and while an extra 15 minutes might not sound appealing, those extra minutes are essential to the rhythm of this film. For \"Drifters\" attempts to create a gently rolling rhythm, much like the sea itself. I personally find the images hypnotic. This is an art film, after all -- not a \"documentary\" in the traditional sense. Yes, the film is \"about\" herring fishermen, their work, and their life at sea. But the film is really an experiment, and it only makes sense in conjunction with other \"documentaries\" of the 1920s: \"Nanook of the North,\" \"Grass,\" and \"Man with a Movie Camera.\" Perhaps a better classification than \"documentary\" would be \"non-fiction narrative film.\" At any rate, \"Drifters\" is historically significant because it was the first and only feature film personally directed by John Grierson. Grierson was, of course, the man the who coined the term \"documentary\" in a review of Robert Flaherty's second film \"Moana,\" and he went on to head the GPO film unit, where he nourished better filmmakers than himself, including Humphrey Jennings, Harry Watt, and Alberto Cavalcanti. Thus \"Drifters\" should possess inherent interest for fans or students of British documentary cinema; it's the only time Grierson had the opportunity to put his own personal stamp on a feature film.<br><br>Stylistically, \"Drifters\" was heavily influenced both by Flaherty's more poetical approach (with soft focus and lots of man-against-nature imagery) and Soviet montage (with quick-cut editing and lots of juxtaposition). The result is interesting, but not entirely satisfying. Following Flaherty's example, Grierson chooses to focus on one fishing crew. Unlike Flaherty, however, he never names or attempts to individuate the crew members, despite featuring two very strong and natural personalities (a bearded captain who lies awake at night and a cabin boy who's learning how to cook for the crew). Flaherty definitely would have personalized these people even more. On the other hand, Grierson manages to illustrate how these fishermen are related to the other elements of the fishing industry -- something that Dziga Vertov would have approved of. And Grierson shares Vertov's fascination with the relationship between men and their tools. (There's a lovely scene of a stoker lighting a cigarette with some burning coals he's just shoveled into the engine.)<br><br>On the whole, I recommend this movie to those who are interested in the history of documentary film-making, especially in Britain. But I also suggest that, if you're new to early documentaries, you watch some others first: Flaherty's \"Nanook of the North\" and \"Man of Aran,\" Cooper &amp; Schoedsack's \"Grass,\" Vertov's \"Man with a Movie Camera,\" and especially Jennings' \"Fires Were Started\" (a.k.a. \"I Was a Fireman\") and \"A Diary for Timothy.\" These films rank among not just the most influential early documentaries but also the most beautiful films ever made. (By the way, Panamint, a small Scottish home video company, has released a complete print of \"Drifters\" on DVD. It looks quite good for a relatively minor 1929 production. Just be aware that it's a PAL release and only available in the UK.)","user":"Tryavna","rank":[16,18]},{"title":"Pure Documentary","rating":28,"date":"28 August 2009","review":"If this film was made today it would be shortened to a one hour (or 50 minutes to allow for adverts) TV programme sponsored by a furniture store and be saddled with some past-it comedian attempting to develop a second career so that the programme would be as much about their reactions and experiences as it would the subject matter at hand. The documentary film, like all genres, has undergone so many changes as to be virtually unrecognisable from John Grierson's silent study of a fishing expedition from the 20s. Thanks to the fact of its silence, the film stands as an example of pure documentary-making, free of any personalities or voices explaining to the viewer what, more often or not, they can see for themselves. The fact that we can't hear the sound of the sea, the call of the sea birds, or the noise of the men at work doesn't detract from the film but concentrates the viewers' senses on the visual and also adds a certain romanticism to what, in truth, must have been a back-breaking and unpleasant job. The editing is superb, showing us everything we need to see in a natural and logical order, but with a rhythm that prevents it from becoming mechanical. The fishermen go about their duties with little hint of self-consciousness or awareness of the camera – other than that stoker, of course, who casually lights his cigarette from a flaming shovelful of coals before he throws them into the furnace. If, like me, you don't watch many documentaries, give this one a chance – it might just change your opinion of them.","user":"JoeytheBrit","rank":[6,7]},{"title":"From here to eternity","rating":24,"date":"24 June 2003","review":"I'm not going to put this down to the fact I am MTV generation or am simply too young appreciate such film making, because that would be simply untrue! I like the likes of Night Mail, Triumph of the Will and Nanook of the North!<br><br>Anyway fact of the matter is I really did not like this film! I thought it was one of the longest 45+ minutes of my life!<br><br>Some of the shots are too long and should have been cut many seconds before and I thought the structure could have been better, but hey I appreciate these were the early days in documentary film making and this was John Grierson's first effort!<br><br>4/10","user":"CocaCola18","rank":[5,16]}]