[{"title":"A masterpiece, one of L&H's best","rating":10,"date":"11 February 2005","review":"WAY OUT WEST <br><br>Aspect ratio: 1.37:1<br><br>Sound format: Mono<br><br>(Black and white)<br><br>Stan and Ollie are robbed of the deed to a valuable gold mine by a couple of fortune hunters (James Finlayson and Sharon Lynn).<br><br>One of Laurel and Hardy's most fondly remembered productions, WAY OUT WEST features career-best material, including a chase around the villain's apartment (\"Ah-hah!\" \"Oh-hoh!\" \"Ee-hee!\"), three wonderful musical interludes, and one of cinema's most priceless set-pieces: Stan and Ollie's soft-shoe shuffle outside a saloon as the Avalon Boys sing 'At the Ball'! Director James Horne was also responsible for many of L&amp;H's short films, and his no-frills style is eminently suited to proceedings: Every routine is reduced to its basic components, all the better to 'sell' the gags, both visual and spoken. The film opened in 1937 to a number of lukewarm reviews, but has since secured its place within movie history. A bona fide masterpiece.<br><br>NB. The Avalon Boys included prolific character actor Chill Wills among their number (he also provides Stan's 'deep voice' during 'Trail of the Lonesome Pine'), and some of the incidental music was written by Irving Berlin! Neither of these gentlemen are credited on the print itself.","user":"Libretio","rank":[35,41]},{"title":"Way Out West With Stan & Ollie","rating":10,"date":"18 January 2000","review":"Would you send Mister Laurel &amp; Mister Hardy off to the wilds of the Old West to deliver an important inheritance document to a young lady they've never seen? Probably not. But that is the hinge upon which this whole wonderfully goofy movie swings.<br><br>As always, the Boys are a pure joy to watch, whether they are trying to bust into a saloon in the dead of night, scuffling with the bad guys for a valuable scrap of paper or breaking into a delightful soft-shoe dance.<br><br>James Finlayson is very funny once again as the Boys' nemesis. Sharon Lynn, in a hilarious scene, gets to tickle Stan silly.<br><br>At one point Ollie begins to sing 'On The Trail Of The Lonesome Pine' in his clear high tenor. He had a beautiful voice, warm &amp; nostalgic. Just like the rest of this film, one of Laurel &amp; Hardy's best.","user":"Ron Oliver","rank":[33,40]},{"title":"Laughed so hard my head fell off","rating":10,"date":"17 December 1998","review":"This is truly one of the funniest movies ever made. I'll never look at another block and tackle without a chuckle. And of course that groovy soft shoe shuffle and the Trail of the Lonesome Pine are gems - cinema history. Stan and Ollie weren't just slapstick geniuses. Theirs was a subtle blend of visual, acute observational and surreal comedy that has rarely been matched and never beaten. This film exemplifies their craft perfectly and shows touches of where, twenty to forty years later, the Goons, Monty Python, Tommy Cooper and The Comic Strip were coming from. After seeing this I recommend Sons of The Dessert, their other feature length masterpiece.","user":"29055","rank":[33,40]}]