[{"title":"The Strange Case Of Dean Stockwell","rating":9,"date":"15 November 2007","review":"Watching this 1959 Richard Fleischer confirmed something I've always known. Dean Stockwell is a superb actor and an extraordinary presence on the screen. So, I think it's strange that he's not regarded as one of the greatest actors that ever lived. He started as a kid. He was Gregory Peck's son, twice. He was in musicals with Gene Kelly and Frank Sinatra. He was directed by Elia Kazan. He made allegorical movies like \"The Boy With Green Hair\" directed by black listed Joseph Losey. He was Edmond in \"Long Day's Journey Into Night\" sharing the screen with Katharine Hepburn, Ralph Richardson and Jason Robards. No to mention his work in \"Sons and Lovers\" or the movies with Wim Wenders and David Lynch. Here, in \"Compulsion\" his performance is worthy of an Oscar and in fact he go the accolades at the Cannes Film Festival sharing the acting honors with Orson Welles and Bradford Dillman. But, looking at it now he is the one that comes out as the one who passed in triumph the test of time. His performance is so rich so perfectly modulated that you go straight into the human center of his sick, appalling character. \"Compulsion\" deserves to be rediscovered and Dean Stockwell's performance should be the main reason.","user":"uhmartinez-phd","rank":[103,109]},{"title":"Murder and Dean Stockwell's Eyes","rating":9,"date":"27 April 2007","review":"Seeing \"Compulsion\" again after a very long time, it amazed me how well I remembered it. In fact I remembered every tiny little turn in Dean Stockwell's eyes. He is superb in the part of the young semi genius with a weakness for the shallow Bradford Dillman. The Leopold and Loeb case was the base for this thrilling Richard Fleischer film. It won acting awards for Stockwell, Dillman and Orson Welles at the Cannes Film Festival but with the benefit of hindsight, Dean Stockwell emerges as the winner against the famous test of time. Dillman seems a little bit too everything. Welles is great fun to watch and E G Marshall is terrific as the man determined to unmask the \"powder poofs\". Stockwell fainting at the trial, something that could have been so over the top, is in fact, shattering. The Leopold and Loeb story was also the base for Hitchcock's \"Rope\" and the wonderful Tom Kalin's \"Swoon\" Another version was rumored in 1991, directed by Martin Donovan with River Phoenix in the Stockwell part.","user":"littlemartinarocena","rank":[98,106]},{"title":"The Magic Of Dean Stockwell","rating":9,"date":"31 May 2010","review":"If \"Compulsion\" is still such a powerful film is, totally, Dean Stockwell's merit. What a sensational actor! I'm writing this the day after the announcement of Dennis Hopper's death and while I was looking for a Dennis Hopper movie to watch a came across \"Compulsion\" Not Hopper but Stockwell and I settled for that anyway. I was riveted by Stockwell's performance because everyone else (with the natural exception of Orson Wells and E G Marshall) seems so dated and acted that Dean's every moment is sheer magic. He doesn't shy away from the awfulness but makes his young monster totally human, provoking in us that element that Orson Welles's closing argument tries to bring to the forefront. If you love great acting, you can't afford to miss Dean Stockwell in \"Compulsion\"","user":"watkins-fairbanks","rank":[57,61]}]