[{"title":"Not Bert Convy's finest hour (I'm not sure what WOULD be his finest hour)","rating":13,"date":"13 March 2002","review":"This \"film\" is actually too lovably bad to actually hate.  But that doesn't mean I could watch it without being bound to a couch with a rope.  If you've seen the mediocre-to-bad \"Lifeguard\" starring Sam Elliott, replace the world of lifeguarding with the ultra-competitive lifestyle of club tennis-pros and replace Elliott with Bert Convy (of TV's \"Tattletales\" fame).<br><br>\nThe sight of Convy jumping over the net in too-white and too-small tennis shorts to congratulate Bjorn Borg on a game well-played is an image I have never been able to shake.","user":"Movie-Robot","rank":[11,13]},{"title":"Great accident!!!!","rating":29,"date":"29 June 2005","review":"My older brother and I talked our father into taking us to see this movie when we were very young. At the time, I was 8 yrs old and my brother was 14. We had no idea that they were showing a double feature that day. The first movie was one we had never even heard of before - Cheech and Chong's Up InSmoke. We laughed so hard I thought we were going to die. What a gem we stumbled onto. Then, Racquet started and I think we made it through about 45 minutes before leaving. The only memorable scene for me was one of two people having sex in a small hatch-back type of car and of the man's naked butt smashing up against the back (rear) window. Oh, and I think there was something about tennis to the movie. That's about the best I can do. So you see, if it wasn't for this horrible film, I never would have seen Up In Smoke on the big screen.","user":"losidiot1","rank":[9,13]},{"title":"Could be the worst movie ever...Bert Convey was the STAR!!!","rating":1,"date":"13 April 2000","review":"I played this movie when I managed a theatre in Tucson, Az. I believed it opened on Friday and closed on Wednesday. It's not even bad enough to be good. I've always felt bad for Phil Silvers. Thank God nobody saw this abomination!","user":"mark-162","rank":[4,7]}]