[{"title":"Henry Silva in a ceremonial robe and an over-sized Gene Simmons wig? What's not to love about this movie!","rating":8,"date":"17 August 2002","review":"Richard Chamberlain and Sharon Stone reprise their roles as Alan Quatermain and Jesse Huston in \"KING SOLOMON'S MINES\".<br><br>This time around, the quest is on to seek out a 'Utopian' society that has only been talked about, but never seen, hidden within a 'lost city of gold'. The 'lost city' is in fact just a small white-stucco duplex with three floors and a 'staircase' that is supposed to resemble that of a Mayan or Aztec temple and the 'gold' is nothing more than a big vat of brown water and tormented slaves dragging around pallets of gold Styrofoam blocks.<br><br>The good 'inhabitants' of this city are mainly fair-haired white folk with a handful of Africans wearing white robes, held under the tyranny of Henry Silva who is absolutely hilarious portraying a gold-infatuated crackpot who goes by the name of 'Agon' while donning ridiculous ceremonial robes and laughable KISS wigs.<br><br>Most hilarious are Cassandra Peterson (a.k.a. Elvira) as Silva's evil hench-woman and Aileen Marson who spends what little time she has on-screen wearing outfits and hair-styles suitable for an episode of 'DYNASTY'.<br><br>Chamberlain and Stone both know how ridiculous the script is, but make the most out of it with their antics and C-Grade acting methods. It is Silva who actually makes this movie work. His appearance alone is hysterical, the 'chariot' scene has to be seen to be believed. Most embarrassing is Robert Donner as 'Swarma', a sleazy filthy Indian fakir whose accent is more laughable than Will Ferrell's in \"AUSTIN POWERS\" as Mustafa.<br><br>A surprising and miscast addition to the series is James Earl Jones as legendary African warrior Umslopogaas (think of Grace Jones in \"CONAN THE DESTROYER\" as Zula). He has one good scene where he 'destroys' a sacrificial table with his axe, and that is about it.<br><br>Some other hilarious scenes to look out for would include Chamberlain blowing up a stone bench with a stick of dynamite and Silva being 'covered' in gold. Actually, it looks like he gets a bowl of gold porridge dumped on his head, and the next scene he is a gold statue (LMAO!).<br><br>Yes, \"THE LOST CITY OF GOLD\" is a turkey, but it IS darn hilarious! While there are no scenes of John Rhys-Davies spouting hilarious dialog such as, \"I shall crush your eye like a grape\", we do have Silva delivering new lines such as \"Alle-gleeeee-aaaaah!\". Cirque De Soleil, take a note!<br><br>I don't know why I like this movie so much. I saw it when I was a kid in the 80's and I laughed till it hurt, and I just watched it again this afternoon and got the same reaction. Trust me, there aren't too many movies out there that can still make me do that. <br><br>While this movie is not as good as \"KING SOLOMON'S MINES\", I still enjoyed it all the same. If it weren't for its dismal performance at the box office, I am sure a third 'adventure' would have been created to complete this trilogy, a C-Grade homage to Indiana Jones.<br><br>So to all you serious movie buffs out there - this movie is silly and makes no excuses for its actions. Just kick back and enjoy the hilarity, because I can guarantee you that this movie WILL make you laugh!<br><br>My Rating - 6 out of 10","user":"Aussie Stud","rank":[41,45]},{"title":"Plan Quatermain From Outer City of Gold","rating":4,"date":"29 August 2007","review":"Some films are made so bad that they are funny. \"Allan Quatermain And the Lost City Of Gold\" falls under that category; this is far beyond the most awful film I have in my collection. The script I'm sure disappeared on the first day of shooting, the acting is even worse and the special effects look if it had a budget of a couple of pounds. This is all elements which becomes the force of the film. You're not laughing because it's fun, but because it's bad. Maybe that's why I can still be entertained by it.<br><br>\"Allan Quatermain And the Lost City Of Gold\" is the adventure genre's \"Plan 9 From Outer Space\" (though the special effects are slightly better), and I can still enjoy watching this delightly dreadful disaster of an adventure film.","user":"Austin_Powers-1","rank":[9,9]},{"title":"Hey! I liked it!...kinda","rating":5,"date":"21 June 2001","review":"\"...makes Plan 9 from Outer Space look like Citizen Kane...(?)\"  C'mon. A bit of hyperbole now and then is OK but this comment is a bit overdone. Hey, I liked this movie.  Dumb?  Yep.  Lousy script.  Yep again.  I would guess that H. Rider Haggard would be rolling in his grave at the considerably less than good job they did on this one.  Is it dog?  Likely. I think that not only James Earl Jones did it for the paycheck.  I think Richard Chamberlain, Sharon Stone and Henry Silva did it for the paycheck too.  But, then Chamberlain made the Towering Inferno, which was not only bad but boring, in which he played a bad guy.  But, seriously folks, getting back to this amusing remake of King Solomon's Mines, you can't take this film seriously.  Too bad, though.  Being one who loves costume dramas, the script does leave some talented people with little to do but try and keep a straight face while stumbling through the action.  Check it out for yourself.","user":"artzau","rank":[19,22]}]