[{"title":"Anatomy of Insanity","rating":4,"date":"4 September 2004","review":"This is a wonderfully tense and intensely claustrophobic film with a slowly escalating and relentless psychologically terror. Roman Polanski stays true to his style from Rosemary's Baby and Repulsion. But this movie is more than a simple examination of the onset of insanity from within the person who is experiencing it. The theme of loneliness and the sense of purposeless petty existence are the real backdrop of this excellent work, the fact which makes it similar to Kubrick's Shining. Still, The Tenant has deeper literary roots. In my opinion, the inspiration for this movie came right from the great works of European literature -- the influence of Edgar A. Poe, E.T.A. Hoffmann and Nikolai Gogol is simply obvious. Poe's tales of madness out of loneliness, Hoffmann's stories of tragic delirium (most prominently, The Sandman, Majorat, and The Mines of Falun), and, of course, Gogol's eerie The Overcoat provided Polanski with the inspiration for this modern examination of the same topics.<br><br>Trelkovsky, a French citizen of Polish origin, is a nondescript and unassuming loner who moves into an apartment the previous occupant of which, a young woman, has thrown herself out of the window. The building is owned by the stern and ice-cold old man, who is hell bent on making sure his tenants do not make any noise and do not cause any trouble. He (and his underlings in the building) consider any sign of life to be \"trouble.\" The old man spends much of his time enforcing a near-police-state-like order within the building. Undeniably, all kind of extremely weird things are going on in the building and I will not dwell on them. But it is the strange intrusiveness of the police-state which injects real terror into Trelkovsky's life. Faced with absurdity after absurdity, he makes some meek attempts to complain and ask for explanations: instead, noone is even ready to listen to him -- he is being treated like a piece of dirt practically by everyone.<br><br>It is also important that Trelkovsky's plunge into madness occurs suddenly and very abruptly. It seems almost like a psychological breakdown and a rebellion at the same time. He has lived the life of conformity, compliance, and quite resentment, never able to stand his ground or even establish his individual sovereignty. Trelkovksy's meekness is simply striking. His sudden and violent obsession with not letting \"them\" make him into the previous occupant of the flat is a pathological and concentrated reaction to the years of pent up passive aggression and anger. The infernal scream at the end of the film is the wild shout of anguish. In a certain sense, the completely unexpected finale of the film presents a huge puzzle which is not really intended to be resolved. But Polanski seems to be investing it with important symbolic meaning. This world is full of multiple Trelkovskys, little, unnoticeable people terrorized by their own sense of total insignificance. This is a vicious cycle of dependence between people's unconscious yet compulsive cruelty to each other and the tortured compliance with this cruelty by others.<br><br>This is an excellent, dark and captivating film in the best traditions of European psychological Gothic literature. I strongly recommend to watch this movie and take a look at Poe's, Hoffmann's and Gogol's stories.","user":"lkil","rank":[122,140]},{"title":"The Art Of Terror","rating":10,"date":"9 March 2007","review":"Meek, tiny, almost insignificant. Polanski finds the invisibility of his characters and makes something enormous out of it. In front and behind the camera he creates one of the most uncomfortable masterpieces I had the pleasure to see and see and see again. It never let's me down. People, even people who know me pretty well, thought/think there was/is something wrong with me, based on my attraction, or I should say, devotion for \"Le Locataire\" They may be right, I don't know but there is something irresistibly enthralling within Polanski's darkness and I haven't even mentioned the humor. The mystery surrounding the apartment and the previous tenant, the mystery that takes over him and, naturally, us, me. That building populated by great old Academy Award winners: Melvyn Douglas, Shelley Winters, Jo Van Fleet, Lila Kedrova. For anyone who loves movies, this is compulsory viewing. One, two, three, many, many viewings.","user":"alainbenoix","rank":[181,213]},{"title":"Oh the pleasures of horror!","rating":10,"date":"1 October 2012","review":"How can I be so devoted to this film? I'm a fairly ordinary person with a very regular life, so, why am I drawn to this darkness. \"The Tenant\", \"Rosemary's Baby\", \"Kiss Of The Spider Woman\", \"Apartment Zero\" are films I've seen many, many times. All of them terrifying in their own way. Last night, I saw \"The Tenant\" again for the nth time. I was as riveted and unsettled as I was the very first time I saw it. There is something about playing with our inner-fears without actually confirm or deny anything that makes it a genre of its own. A provocation of sorts. If Polansky is unique behind the camera he is also remarkable in front of it. His performance here is a tragic-comic creation of the first order. For film lovers all over the world, this is a real must see!","user":"melissacasting-org","rank":[56,67]}]