[{"title":"Cultural Divide","rating":10,"date":"24 June 2009","review":"Watching Fiddler On The Roof I couldn't help but think that way back when he was a student, Sholem Aleichem must have gotten a Russian translation of Jane Austen's Pride and Prejudice. It must have influenced him so that I can't believe it was a coincidence that when he created the story of Tevye the Milkman he had five daughters and he was just looking to get them off his hands just like Mr. Bennett was with his five.<br><br>Of course the difference between Czarist Russia for Jews and being part of the landed gentry in early Victorian England is cultural light years. Still fathers, mothers, daughters and prospective sons-in-law are the same wherever you go.<br><br>Filling some very big shoes in the lead was Topol who to this day is still appearing in stage productions of Fiddler On The Roof. But in 1971 people still remembered Zero Mostel on Broadway. Mostel was no longer in it, but Fiddler On The Roof was coming to the end of its then record run of 3242 performances. Topol had done the London production though so he was no novice in the part. <br><br>Topol justified Norman Jewison's faith in him by garnering an Academy Award nomination for Best Actor. Leonard Frey who was Motel the tailor who was the only one from the original Broadway cast and not in the role he did on Broadway got a nomination for Best Supporting Actor. In fact I liked him best in the film, a Yiddish version of Willie Mossop, the worm that turned from another English source, Hobson's Choice.<br><br>The cultural divide is the thing about Fiddler On The Roof that does separate it from a Victorian novel to a story of a perennially persecuted people. The thing that got me was the people's utter resignation to their fate come what may. Paul Michael Glaser, later Starsky on Starsky&amp;Hutch, is the only one who's mad as hell and not taking it any more. For his pains he winds up in Siberia. Many have wondered why the Jews just marched off to the concentration camps two generations later. The answer in many ways is to be found in the characters Sholem Aleichem created from what he observed during his life. <br><br>Norman Jewison as a director filled the screen with this stage production. Small wonder among the Oscars that Fiddler On The Roof did win was for cinematography. The film also won for sound and best adapted musical score. The original songs were done by the Broadway team of Jerry Bock and Sheldon Harnick. Bock in writing the music had as keen an ear for the folk music of the culture as Richard Rodgers did in writing an Oriental score for The King And I.<br><br>If the role of Yente the matchmaker, a name as well as an occupation in Jewish tradition, wasn't in the original play, they'd have to have invented something to get Molly Picon in the film. The movie going public might only know her from such mainstream films like Come Blow Your Horn, but this woman who started as a child entertaining newly arrived folks from places like Anatevka became the First Lady of the Yiddish Theater. It wouldn't have been right to do Sholem Aleichem on the big screen without her in the film in some way.<br><br>Fiddler On The Roof is one of the best adapted Broadway musicals to the big screen ever done. And this review is dedicated to my late grandfather Isidore Kogan who came from Kamenets-Podolsk, a place just like Anatevka and settled here along with eight brothers and sisters in a watch repair business. I never knew Isidore, he died a week before I made my earthly debut, but he would have so loved Fiddler On The Roof.","user":"bkoganbing","rank":[37,40]},{"title":"On the other hand, the good book says that this is an excellent film","rating":10,"date":"5 June 2005","review":"Epic in plot, setting and length, Fiddler on the Roof tells a surprisingly tight and focused story that has \"universal\" poignancy--in a nutshell, it's about trying to maintain strong cultural traditions and identity in the face of a continually changing world, partially fueled by the youth, that doesn't necessarily share the culture's values or self-assessment of worth.<br><br>The plot is based on short stories written around the turn of the 20th Century by Sholom Aleichem, who was often called the \"Russian Mark Twain\". Aleichem wrote a number of works based on his character Tevye the Milkman, who has seven daughters (in the film, this was pared down to five). They live in the fictional Jewish shtetl (\"village\", or \"little town or city\") of Anatevka in Tsarist Russia in the early 1900s. The stories are \"slice of life\" stuff. A lot of attention is paid to Tevye's daughters and their potential suitors. One of the prominent conflicts with tradition is a struggle with arranged marriages versus marriages for love, but of course, being set in pre-revolutionary Russia, there are also political changes brewing, some of which have a profound affect on Tevye's family and village.<br><br>Aleichem's Tevye stories were first turned into a Broadway musical, which began its initial run in 1964 with Zero Mostel as Tevye. Producer and director Norman Jewison, who had had success with films like In the Heat of the Night (1967) and The Thomas Crown Affair (1968), and who was experienced as a producer and director for musical-oriented televisions shows, including \"Your Hit Parade\" (1950) and \"The Judy Garland Show\" (1960), was asked around early 1970 by United Artists to helm the Fiddler on the Roof film. To their surprise, Jewison wasn't Jewish. He got the gig anyway, and in August 1970, began an arduous shoot--much of it done in a small village in Yugoslavia that refused to cooperate when it came to weather (Jewison couldn't get the snow he wanted). He ended up getting a lot of pressure because the shoot went over time and over budget--this was one of the most expensive films of its time, which was an era of economic woes for Hollywood--but of course we know it paid off in the end.<br><br>Zero Mostel was out as Tevye, and Israeli actor Chaim Topol, or just \"Topol\", was in, based largely on Jewison seeing him in the role of Tevye in the London stage production of Fiddler. Jewison had said that he was shooting for more realism in the film, as opposed to what he saw as a kind of campy humor in the Broadway production.<br><br>In my eyes, Jewison ended up with a bit of both approaches in his finished film, but that's all for the better. Sequences like the opening \"Tradition\" montage are hilarious in their juxtaposition of a grand operatic attitude and the rhythmic coordination of cleaning fish, hanging slabs of meat, and so on. Yes, a lot of Fiddler is very realistic, but it's equally humorous and surrealistic most of the time.<br><br>The realism is largely thanks to the authentic settings, the fabulous production and costume design, and of course, the superb performances. The humor is a factor of the above with that Mark Twain-ish aspect of Aleichem's stories and the fine script by Joseph Stine.<br><br>The surrealism comes largely by way of the cinematography. Some of the visual sense is reminiscent of Marc Chagall's early work and his later, nostalgic depictions of his native Russia, and in fact, the image of the fiddler on the roof comes directly from a Chagall painting. Jewison saw the fiddler as a cross between a metaphor for the Jewish spirit (and this is explained in more detail via a few lines of dialogue in the film) and an actual physical manifestation of a spirit. However we interpret the fiddler, the shots of him and his presence in the film are certainly poetic. Jewison also gives us some fabulous, surreal, wide landscape shots, such as those of agricultural fields and the beautiful \"wasteland\" in which the train tracks are set. There are a few scenes set on the banks of a river, overlooked by a bridge, that are reminiscent of particular Van Gogh paintings. And as a more subtle bit of surrealism, Jewison had cinematographer Oswald Morris shoot much of the film though a woman's stocking--the mesh is very clearly visible in some exterior shots. Of course, there are also a couple more surrealistic touches in the plot, my favorite being the Tevye's Dream sequence, which features traditionalist Jewish zombies in an operatic attitude.<br><br>A musical couldn't be a 10 without great music, and Fiddler on the Roof has it. The songs are a marvelous melding of traditional Russian folk melodies, with appropriate twinges of Orientalism and the expected Broadway sound, but maybe leaning a bit closer to a modern opera. From that description, you might think that the music would be a mess, but all of the songs are inventive and catchy. They are seamlessly melded with the drama, furthering the narrative as they should. The choreography is excellent and it is well shot by Jewison. And Isaac Stern's violin solos are outstanding, of course.<br><br>Fiddler on the Roof takes an investment of time--it's three hours long, but it's well worth it. It offers great drama, great music, great humor and great tragedy in a beautiful package--you'll laugh, you'll cry, you'll sing, and you just might break a leg trying to dance.","user":"BrandtSponseller","rank":[135,160]},{"title":"A jewel in the crown of musical films!","rating":10,"date":"8 September 2002","review":"'Fiddler on the Roof' is about a humble milkman who schemes to marry off his pleasant daughters according to his family's 'traditions.'<br><br>'Fiddler on the Roof' is about a simple villager who insists that without their old traditions, he and the other villagers would find their lives \"as shaky as a fiddler on the roof.\"<br><br>'Fiddler on the Roof' is about a firm believer who carries on conversations with God, gently complaining about the afflictions the Almighty had put upon him... <br><br>'Fiddler on the Roof' is about a soft-hearted father and his self awakening to a \"new tradition\" which he experiences with his three eldest daughters whose actions call for reform...<br><br>'Fiddler on the Roof' is a powerful statement about the evils of prejudice and the importance of maintaining a warm and communicative family life in the midst of severe oppression...<br><br>'Fiddler on the Roof' is about traditional values at a time, like today, when there is confusion over those values...<br><br>'Fiddler on the Roof' is about love and fear, devotion and defiance, persecution and poverty, pride and dignity, sorrow and oppression...<br><br>'Fiddler on the Roof' takes place in the midst of a hostile and chaotic environment... <br><br>'Fiddler on the Roof' could be safely placed in the great tradition of film musicals... The songs evoke happiness and tears... The fiddler's hauntingly beautiful music came from the violin of the world's greatest virtuosos, Isaac Stern... Composer Jerry Bock and lyricist Sheldon Harnick captured the drama and conflict of the story from its incisive opening to, ultimately, the powerfully silent human circle at the very end... Their treatment of the music produced some outstanding hits like 'Tradition.' <br><br>'Tradition' is more than a simple musical number... The brilliance of this song is in its ability to introduce the impoverished village and its characters  from the figure of the funny fiddler to the pathos and witty humor of Tevye, to the creaky old rabbi, to the bright-eyed matchmaker, to the sharp-tongued Golde, to the indecisive tailor, to the audacious revolutionary, to the enthusiastic butcher, to the Constable who brings that terrible order  It is the solid center of the film.. Yet one by one, the traditions that the very poor dairyman of Anatevka and his people have cherished and lived are broken during the course of the film, as marriage are no longer arranged by the 'papa,' as men and women dance together in a public place, and, most grievous of all, as children marry out of their faith... The shattering of these traditions becomes even more intolerable to Tevye in the shadow of other dangerous forces which threaten to destroy the very life he is trying to preserve...<br><br>Under Norman Jewison's direction, the entire cast delivers a depth performance and a spectacular energy that brought smiles and tears to the audience... Few musical characters are so fully realized or so deeply engaging...<br><br>Topol warms hearts and evokes laughter with his deep humanity, wisdom and humor... He brings his own magnetism and appropriate world-weariness to the role... With his raspy voice, virile appearance, and alternating expressions of compassion and implacability, he reveals his thoughts to the audience, always quoting \"the good book.\" He even shakes a czarist soldier's finger rather than his hand, and questions his loyal wife after 25 years of marriage on whether or not she loves him...<br><br>Norma Crane brings out a concerned mother and a devout Jewish woman...<br><br>Molly Picon shines as the garrulous Yente, the village matchmaker who fails to arrange suitable marriages for the three strong-willed daughters...<br><br>Rosalind Harris makes her plain Tzeitel somehow beautiful... She defies 'Tradition' to marry for love rather than arrangement...<br><br>Michele Marsh is Tevye's second daughter, Hodel, the decisive young girl who follows an activist against the repressive regime...<br><br>Neva Small is both radiant and pathetic as the delicate middle daughter Chava, who unbelievably chooses love over family...<br><br>Leonard Frey is Motel, the young impecunious tailor who tells Tevye that he and Tzeitel had made each other a pledge...<br><br>Paul Michael Glaser is Perchik, the radical student from Kiev with liberal ideas, who asks Tevye's blessing, not his permission...<br><br>Zvee Scooler is the beloved Rabbi who offers this prayer for the Czar: \"May God keep the Tsar...far away from us!\"<br><br>Nominated for eight Academy Awards, 'Fiddler of the Roof' proves to be a splendid achievement with its strongly emotional songs that grows out of the characters' feelings...","user":"Nazi_Fighter_David","rank":[65,78]}]