[{"title":"The Ad Man of Her Nightmares","rating":9,"date":"12 March 2007","review":"Of the three Rock Hudson-Doris Day films my absolute favorite is Lover Come Back. It's not only a good sex comedy for Doris and Rock, but it's also a very funny satire on the advertising business of Madison Avenue.<br><br>In Pillow Talk Doris was an interior decorator and Rock a songwriter. They haven't changed their characters at all, but now are both in the advertising business. <br><br>Through an incredible combination of circumstances I couldn't possibly write Rock has created commercials for a product that doesn't exist and the doofus son of the agency he works for, Tony Randall, has ordered them given full blown airing. With Doris nipping at his heels for unethical practices, Rock and Tony hire a nutty scientist played by Jack Kruschen to come up with some kind of product for the commercials.<br><br>In the meantime Doris mistakes Rock for the scientist and now we're back to the plot of Pillow Talk as Rock decides to make some time with Doris. It gets pretty wild and wacky, especially after Kruschen invents something that has some very unforeseen consequences.<br><br>All the cast members do just fine in this very bright comedy that has me splitting a gut with laughter every time I see it. In addition to the cast members mentioned, I should also single out Edie Adams as the southern model who Hudson makes the commercials with.<br><br>Also to be singled out in what turned out to be his farewell screen performance is Jack Oakie who plays the southern client who Rock steals from Doris and gets all the wacky nonsense started.<br><br>Even given the changing mores, Lover Come Back holds up quite well and today's audience will love it as I do.","user":"bkoganbing","rank":[23,23]},{"title":"Hudson & Day can't lose","rating":8,"date":"16 June 1999","review":"Some may consider the Rock Hudson / Doris Day comedies of the 50's and 60's to be dated, corny, and sexist to boot but I find them still to be clever and sparklingly funny, and, viewed today, wonderfully innocent. The comic chemistry between Doris Day and Rock Hudson was unique and ranks with other classic pairings such as Cary Grant and Rosalind Russell. This movie will always have a nostalgic place in my memory, as it was the first 'adult' comedy I saw. I was fifteen and saw it in Radio City Music Hall with my church youth fellowship group on a trip to New York. My, how risque it seemed! Of note is Jack Oakie's delightful bit as the southern colonel in what turned out to be his last feature film (\"Just a tay-uch!\")","user":"rupie","rank":[32,36]},{"title":"Delightful and Witty Romantic Comedy","rating":8,"date":"15 March 2012","review":"In New York, Madison Avenue is the center of advertising world and like in a beehive, divided in workers and drones. Carol Templeton (Doris Day) is a professional that has just arrived from Omaha, Nebraska, to work in the Bracket, McGalpin &amp; Gaines Advertising expecting to be a winner through hard work. The unethical Jerry Webster (Rock Hudson) works in the Ramsey &amp; Son and entertains his clients with sexy women, bribe and booze to ensure contracts for his agency.<br><br>When the Southern J. Paxton Miller (Jack Oakie) comes to New York to close the contract of the Cera Miller account, Carol prepares a presentation to the old man. However, Jerry wins the account bringing Miller to a nightclub with strippers, booze and a party later in his penthouse with the strippers led by Rebel Davis (Edie Adams).<br><br>Carol is upset and goes to the advertising council to throw Jerry out of the advertising business. However, Jerry lures Rebel, who is going to testify against him, offering the position of VIP girl in TV commercials for the new product VIP. Then he asks the team to not broadcast but only file the footages since VIP that does not exist. However, the insecure Peter 'Pete' Ramsey (Tony Randall), who has inherited the Ramsey &amp; Son, orders a massive advertising campaign broadcasting the commercials to show himself off to his employees. In order to save his job and the agency, Jerry hires Doctor Linus Tyler (Jack Kruschen), who is a lonely man, to develop VIP. <br><br>Meanwhile, Carol decides to take the VIP account for her agency and she visits Dr. Tyler. However, she meets Jerry instead and believes that he is the famous scientist awarded with the Nobel Prize. Now Carol wants to convince Dr. Tyler to come to her agency and the cynical Jerry uses the situation to seduce Carol.<br><br>\"Lover Come Back\" is really a delightful and witty romantic comedy, with a funny story and a great screenplay that was awarded with the 1962 Oscar. Tony Randall is hilarious and his insecure character is among the funniest I have ever seen. Rock Hudson and Doris Day are excellent, showing magnificent chemistry. The two guys that stumble with Jerry Webster everywhere are also very funny. My only remark is to the disappointing rushed ending that gives the sensation that something is missing and makes Carol Templeton a stereotype of the women in the 50's and 60's. My vote is eight.<br><br>Title (Brazil): \"Volta Meu Amor\" (\"Come Back My Love\")","user":"claudio_carvalho","rank":[13,14]}]