[{"title":"My guilty pleasure film!","rating":7,"date":"4 November 2001","review":"This movie,as far as I know,never won any special honors.It perhaps is not listed as one of the top 1,000,000 movies of all time.It may not be considered by many to be a great film,but I (and I am not ashamed to admit this),love this movie.Perhaps it is the charm exuded by Burt Reynolds and Jerry Reed.Perhaps it is the beautiful Sally Field(she never looked better on film).Perhaps it is the comic genius of Jackie Gleason.Perhaps it is all these things rolled into one.This is the absolute \"king\" of redneck comedy movies(and I use the term \"redneck\" with the utmost affection).I am a fan of great films,but I have my guilty pleasure movies as anyone has. This one tops my list of those.Love it!","user":"SmileysWorld","rank":[116,125]},{"title":"Best of the good old boy movies","rating":7,"date":"27 July 2005","review":"I guess one reason I love this movie is because it doesn't pretend to be anything more than it is. It doesn't aspire to great movie-making. It was just supposed to be 90 minutes of entertainment on the big screen, and it's still entertaining. Take your brain off for a while and have fun with it. <br><br>There are hilarious lines, some funny pratfalls and even a bit of home-grown wisdom: \"How ignorant you are depends a lot on which part of the United States you're standing on.\" Or something like that. I get a kick out of watching the convoy/rocking-chair scene every time. Makes me wonder how in the world they got around Birmingham, but that's suspension of disbelief for you. LOL. <br><br>Wish director Hal Needham had remembered that Alabama State Troopers drive Fords, not Pontiacs, but that's a small thing. My dad remarked on it every time, though. <br><br>It's just cornball entertainment, rare enough these days. Pop some popcorn and have a blast watching it.","user":"catchick37","rank":[39,42]},{"title":"Back when Burt was god","rating":10,"date":"9 January 2007","review":"This movie,as far as I know,never won any special honours.It perhaps is not listed as one of the top 1,000,000 movies of all time.but I (and I am not ashamed to admit this),love this movie.Perhaps it is the charm exuded by Burt Reynolds. Perhaps it is the beautiful Sally Field(she will forever remind me of the little girl who lived next door but one who always managed to elude me)Perhaps it is the comic genius of Jackie Gleason. This is the absolute \"king\" of redneck comedy movies(and I use the term \"redneck\" with the utmost affection).I am a fan of great films,but I have my guilty pleasure movies as anyone has. This one tops my list of those.Love it! <br><br>Your enjoyment of the film depends on your first viewing experience. If like myself, you were a young boy growing up in the mid-eighties, you will have no doubt lived for the endless thrills, spills, car crashes, second-rate jokes and Big Burt as the Bandit, and its two sequels. It's easy to laugh at now, but there is a perverse pleasure in seeing bell-bottoms, grown men with CB radios and muscles cars the size of small houses, the likes of which most people won't have seen since 1982.<br><br>And as a side note only Star Wars grossed more than Smokey and the Bandit in 1977","user":"slightlymad22","rank":[42,46]}]