[{"title":"You Can't Go Home Again.....","rating":12,"date":"12 August 2003","review":"The effects of the aging process is touchingly portrayed by Geraldine Page in this warm human drama set in rural Texas in 1947.<br><br>Carrie Watts (Page), now a lonely widow, is being taken care of by her son, Ludie (John Heard) and his wife Jessie Mae (Carlin Glynn) in a cramped two-room apartment in Houston.<br><br>The two women spend all of their time being irritable to each other while Ludie is caught in the middle.  Though trying admirably to do the right thing by the two women in his life, the situation is tense.<br><br>Carrie yearns to return to the family farm where she grew up, hoping to recapture some of the happiness of her youth.  She has even tried to run away a few times, only to be stopped by her son and daughter-in-law who, in spite of their differences are only trying to spare her the disappointment of what she may find.<br><br>Her hometown, Bountiful, now basicly no longer exists.  The people just \"used up the land and moved on\".  All that remains are a few abandoned and deteriorating buildings, including her childhood home.  Nevertheless, Carrie finally succeeds in slipping away.<br><br>On the way, she meets a young wife, Thelma (Rebecca DeMornay), whose husband is overseas in the military behind enemy lines.  As they converse, it is obvious they are both on a quest, Carrie to recapture her youth and Thelma to hold on to hers, not knowing if she will ever see her husband again. Until he returns, she is going back to stay with her parents.  The two women form a bond and find each other a source of strength on the long bus ride. Though we hope for Thelma's eventual happiness, somehow we know that only disillusionment awaits Carrie in Bountiful.<br><br>Filmed as a play with the advantages of outdoor scenery, the entire cast and crew did a splendid job, presenting a difficult subject in a tasteful manner.  Page won an Oscar in what was to be her last role shortly before her death.  Besides the other supporting players, Richard Bradford was also outstanding as the compassionate Sheriff who helped Carrie obtain her goal. The period pieces, all of those old 40's automobiles and the architecture and scenery, the general \"feel\" of small-town Texas during that era, helped add to the realism of the film.  THE TRIP TO BOUNTIFUL should be recognized as a national treasure.","user":"wrdiggs","rank":[40,40]},{"title":"Where's the DVD??","rating":9,"date":"15 December 2004","review":"Geraldine Page won the Best Actress Oscar for this film in 1985. And it's no wonder why. The movie almost unfolds as a Broadway play. It may seem depressing at first, but that's the gift that Geraldine has in portraying the emotions of an aging Southern mother who yearns to return to the small town she left in Texas many many years before. For whatever reason, this film hits an emotional chord with me because Geraldine Page reminds me so much of my maternal grandmother. If you're into fast paced, action flicks - or comic farces, you won't like this film. But, if you really appreciate character development that slowly unfolds and develops in a film, you should not pass up this one!","user":"GareThere","rank":[37,37]},{"title":"Geraldine Page was the best female American actor of her era","rating":10,"date":"13 September 2005","review":"Note, I didn't say movie star as she certainly was not a movie star but was a veteran Broadway actor, a real actor and not a movie face with \"presence\". Charles Bronson once said that what big movie stars have is \"presence\", not acting ability. Page has both of these attributes here in spades, acting and presence.<br><br>This great film could be my grandmother's story but in reverse, as my grandma had a very caring daughter, my mother, but a resentful son-in-law in my father so I saw a very similar story first hand, which made me appreciate this film all the more.<br><br>Page did a marvelous job of showing the immense disconnect between two diverse generations, one raised early in the 20th century in an era of intense religious devotion and the other raised 40 years later in a WWII era of emerging personal independence. The resulting conflicts between the loving son's selfish and demanding wife and his self-sacrificing mother was the entire story until her eventful \"trip\" back home to Bountiful, Texas. Wanting and praying so hard to be able to take her last trip home consumed her entire life as she gracefully but tearfully faced her hateful daughter-in-law's cruel harshness each and every day, with her unfortunate son forced to try to act as mediator. John Heard was effective as her concerned son caught in the middle.<br><br>Page was marvelous in the special way she showed her character's intense religious devotion and principles in how she always treated all people with decency even when they were not that way to her, and in how she tried her best to get along and be friendly in the face of intense dislike and resentment. Understandably, her all-day hymn singing got on her son's wife's nerves, just as my Grandma's incessant hymn singing got on my dad's nerves and forced the same conclusion....both old ladies were practically forced to leave.<br><br>Page's son loved both women dearly but he was forced to be in the difficult middle ground, wanting to please his jerk wife and his nice mom but was increasingly unable to do so, thus the long bus \"trip\" back home for mom was an inevitable run-away trip that left the son in an even greater mess....now what to do?<br><br>On her bus trip home, Page's character's \"live and let live\" understanding of humanity, and her awareness that we are all in the same boat here on earth(even though it was God's glorious boat to her)led her to reach out to a fellow bus traveler with immense friendliness and compassion in the best manner of her religion's teachings. Rebecca DeMornay was perfect as that fellow bus traveler, a prim young military wife on her way to her husband. And, even though Thomas Wolfe was right when he wrote that \"you can never go home again\", Page showed the perfect combination of wonder and sad acceptance upon seeing her old, run down, country home place again after so many years away in the big city.<br><br>Though her caring son finally came to retrieve her back home to whatever improvements he had worked out with his wife, at least she got to see the \"old home place\" one last time. She could now rest in peace no matter what. See this great story just to fill your heart, and to see that people in this country once were just like Page's character, and it was a better place for it. <br><br>Movies don't get any better than this one. If you loved this film you will also love \"Places in The Heart\".","user":"bobbobwhite","rank":[30,30]}]