[{"title":"A cult movie in search of an audience","rating":10,"date":"19 February 1999","review":"Alex Cox's WALKER is a cult movie in search of an audience.  Ignored by audiences upon its original release, despised by critics (Leonard Maltin unfairly gives it a BOMB), WALKER is nonetheless a fascinating oddity of a movie that will be of interest to anyone who likes \"psychotronic\" cinema.<br><br>I am something of an expert on William Walker (1824-1860), the Nashville born doctor/lawyer/journalist who made his mark on Latin American history as a \"filibuster,\" or soldier of fortune.  As such, I have long wanted to see a movie about my \"hero.\"  I admit I was disappointed at first with Cox's film--it starts out as a serious biography, but it slowly degenerates into an arch, anachronistic political satire.  Some of the humor is over the top and gells uneasily with the more serious aspects of the film.  Sometimes I get the feeling that Cox and company just said \"to hell with it, let's make this a big joke.\" Repeated viewings, however, have revealed the film's strengths.  Ed Harris is perfect as Walker--he plays the \"Gray Eyed Man of Destiny\" exactly as I perceive the man's character to be.  The supporting cast, full of familiar faces, is also dead-on.  The music by Joe Strummer, formerly of The Clash, is a terrific blend of latino, jazz, country, and other styles.  Many individual scenes stand out; the climax, in which Walker orders the sacking of Granada, is a nightmarish image of the madness and horror of war. I feel WALKER is bound to become a major cult film--it is quite simply too strange to be anything else, and it deserves more than oblivion.  While others remember Cox's SID AND NANCY and REPO MAN, this picture is far more interesting and deserves more attention than those more celebrated works. WALKER is rarely televised and hard to find on video--but I strongly urge anyone who reads this to seek it out.  I promise you won't have seen anything else like it!","user":"Jonny L","rank":[52,61]},{"title":"Forget the critics, watch this movie!","rating":15,"date":"15 August 2001","review":"I'm totally baffled by the way Alex Cox's 'Walker' has been ignored, vilified, criticised, ridiculed and slandered over the years. Maybe it's political message cuts too close to the bone, or maybe the mainstream movie critics are even more conservative and short sighted than you think. Maltin gives it a BOMB rating, and even the usually perceptive Ebert totally dismisses it. Forget them! Watch 'Walker' and make your own mind up.<br><br>\n'Walker' is certainly no masterpiece, it has many flaws and problems. It isn't subtle political satire (polemic?), it's often crude and ill advised. Some of the actors, especially Marlee Matlin and Gerrit Graham are under-used. However, it is FAR from a \"bomb\"! Cox is a passionate man, and any failings here are due to that passion. The movie is a cry for help for Nicaragua and its people, and draws parallels between America's involvement in the 19th century and the 1980s. <br><br>This movie is clever, stupid, rough, accomplished, funny and tragic all at the same time. Ed Harris is marvellous in the title role, and many cult actors turn up in supporting roles. Cox is a Peckinpah devotee and some of that great director's influence can be seen on screen. But Cox is no carbon copy he's a true original. 'Repo Man' shows that, and anyone who enjoyed that or 'Sid And Nancy' should take a look at this, one of the most unjustly ignored movies of the 80s.","user":"Infofreak","rank":[40,51]},{"title":"one of the greatest films I have ever seen","rating":10,"date":"23 February 2007","review":"This is one of the greatest films i have ever seen. The only issue I have with it is that it is out of print. I'd do almost anything to find a copy. While not the most accurate account of LITERAL history, it still provides decent reference as long as it is taken in its intended symbolic context. It is a truly profound portrayal, a historical as well as a relevant political statement filled with striking imagery and an outstanding score. Possibly too abstract for some, but in all actuality a most outstanding movie. If anyone knows where i might be able to find a copy of this I would be most obliged. I recommend it to anyone interested in...well I recommend it to anyone really.","user":"groovy_dead","rank":[13,15]}]