[{"title":"The game's afoot","rating":25,"date":"25 October 2002","review":"There have been many adaptations of The Sign of Four as one of Doyle's most highly respected works. No adaptation follows implicitly, but this film does well at blending notable passages and dialogue from the book in with adventurous romps through London, and even to a carnival where death seems the main feature. Unlike other adaptations, rather than attempting to solve the case ourselves, we watch the villain at work and follow along as Holmes attempts to piece together the sparse clues. <br><br>Although the film takes great liberties in making the storyline unique and exciting, it still manages to convey the very heart of what Doyle intended. Richardson is an excellent Holmes; he portrays him with just the right amount of light humor and intelligence to make him enthralling even while in the background. He also does an excellent job of reacting. When Mary clings to him after a particularly jarring series of events, the uncomfortable Holmes untangles himself and insists on not making a fuss. One scene I happen to particularly like is when Inspector Layton is brought in to the crime scene. Watching him brush off Holmes' suggestions, while our favorite sleuth is attempting not to laugh or groan at his absurdities, is nothing less than humorous. I also appreciated finally witnessing the scene left out in many adaptations... the thrilling chase of the Aurora on the Thames. <br><br>Like many others, I find Ian Richardson the definitive Holmes, and mourn that not more films were made with him as the gallant and often eccentric private detective.","user":"KatharineFanatic","rank":[12,12]},{"title":"Excellent!","rating":9,"date":"3 June 2001","review":"It really is a disaster that only SIGN and HOUN were filmed with Ian Richardson. No other has been portraying Holmes in such a smooth and witty way - not even Rathbone whom I always considered a bit too perfect and  too cold. The setting and the costumes in the Sign of the Four are brilliant and the acting of all the characters is quite convincing. Unfortunately Watson is a shade too Brucian. Few changes were made to the story, but for the worse and therefore quite acceptable. It has been said more than once so far but I must repeat it: The boat chase is brilliant. I must give credit to another point. Although we do see Holmes in his Deerstalker and Inverness cape in some scenes, he mainly is dressed like a gentleman would be in those days. Richardson is not an all-cliche Holmes. 9 out of 10.","user":"ChrisHawk78","rank":[10,11]},{"title":"Above average Holmes adaptation","rating":6,"date":"6 March 2006","review":"This is not at all a bad adaptation of Arthur Conan Doyle's second Sherlock Holmes novel. Ian Richardson makes a fine (if too affable) Holmes, and David Healy (though portly enough to be Mycroft Holmes) is one of the screen's better Watsons. It's quite entertaining...and when I first saw it, I considered it the best Sign of Four adaptation ever made. In later years, however, I would discover the Granada productions...and their adaptation of Sign of Four, which far overrides this one in terms of faithfulness, style, pacing, direction, acting, and suspense.<br><br>There are a few problems with this adaptation which could have easily been rectified. First off, the plot structure is changed so drastically from that of the novel. Not necessarily a problem, in itself. But in this case, too much is revealed to us too early on, leaving little room for suspense, and making Holmes's deductions seem fairly anti-climactic. Rather than learning of the particulars of various events through Holmes's brilliant deductions, we actually SEE the events first, then watch Holmes work them out via deductive reasoning. The other major disadvantage to this structure is that the introduction (a representation of events that Conan Doyle didn't reveal to us until the final act!) is quite labored and unnecessarily delays the introduction of Holmes and Watson. By the time Holmes begins to seriously investigate the matter of the one-legged man and his strange ally, we are nearly halfway through the film. We already know far more than we should, and many of the events which follow are altered due to the shifting of later themes to an earlier point in the film, giving a very uneven feel to the overall piece. The first two acts are far too leisurely, and the final act plays out at breakneck speed.<br><br>Beyond that, some of the characters have been changed beyond all recognition. Again, this is a needless change, and does nothing to enhance the story. In fact, in some cases, notably the alteration of Thaddeus Sholto, the changes detract from the effectiveness of various scenes. Conan Doyle's Sholto was an extremely nervous little man...seemingly on the verge of a minor nervous breakdown at all times. This greatly enhanced the suspense of the story...as being in his presence made us, as readers, a bit jittery, as well. So, naturally, presenting him as a dashing young man with a fine gift for articulation deadens the impact of the scenes in which he appears.<br><br>I know I'm focusing on the negative here, but I find it difficult not to compare this film with the Granada production which usurped it three years later. That adaptation was practically perfect in every way...fantastic performances all around (including a spot-on Thaddeus Sholto, courtesy of Ron Lacey), extremely faithful to the source material...easily one of the best Holmes adaptations ever committed to film. Still, this version has a lot to offer, and is quite fun in its own way. Though I would have liked to have seen Holmes indulge in a few mood swings (and perhaps brandish his cocaine needle, just for the sake of accuracy), Richardson is one of the better Sherlocks. And Healy is no slouch as Watson, even if he doesn't match David Burke or Edward Hardwicke. <br><br>The truth is, I was duly impressed with this film the first time around, and I still quite enjoy watching it from time to time. View this and the Granada version back-to-back and debate the pros and cons for yourself.","user":"james_oblivion","rank":[5,5]}]