[{"title":"an incredible directorial vision, and a devastating lead in Falconetti, make this one of the greatest achievements in all celluloid","rating":10,"date":"7 February 2004","review":"Carl Th. Dreyer's The Passion of Joan of Arc was made, perhaps, years ahead of its time- my guess would be that if it wasn't burned after its initial release, it would've had as stunning an impact on the film world years down the line as Citizen Kane did. Though the use of close-ups and distorted angles were not completely new in this film, it felt like Dreyer was creating a new kind of cinema, one where reality, however cold and pitiful, was displayed with complete sincerity. There is also the editing (by Dreyer and Marguerite Beague), which has the timing that many directors/editors of the modern day could only hope to achieve (it has the influence of Eisenstein, only in a totally different historical context), and those moves with the camera by Rudolph Mate (who would go on to photograph Foreign Correspondent and Lady from Shanghai) that are precious- to call his work on the film extraordinary is an understatement.<br><br>And it was crucial for Dreyer to use the close-ups and tilted angles and shots where you only see the eyes in the bottom of the frame, and so forth- he's developing the perfect atmosphere in regards to a trial set in 15th century France. It's all those eyes, all those faces, holding all those stolid mindsets that send Joan to her fate. Pretty soon a viewer feels these presences from all these people, so strong and uncompromising, and Dreyer does a miraculous thing- he makes it so that we forget about the time and place, and all of our attention is thrown onto those eyes of Joan, loaded to brim with a sorrow for where she is, but an un-questionable faith in what she feels about God. I wondered at one point whether Dreyer was making as much a point on people's faiths and prejudices in the almighty, or just one on basic humanity.<br><br>There have been many before me who have praised Falconetti's performance to the heavens (Kael called it the finest performance in film), but in a way it almost can't be praised enough. What she achieves here is what Ebert must've felt watching Theron in the recent 'Monster'. I didn't even see her in a performance as Joan of Arc- I saw her as being the embodiment of it, as if Falconetti (with Dreyer's guidance) took Joan out of the pages of the trial transcript and her entire soul took over. There is something in an actor that has to be so compelling, so startling, and indeed so recognizable, that a person can feel empathy and/or sympathy for the person the actor's playing. All a viewer has to do is stare into Falconetti's eyes in any shot, close-up or not, and that viewer may get stirred to boiled-down emotion. <br><br>For me, it was almost TOO over-whelming an emotional experience- when Joan is about to get tortured, for example, I found myself completely lost from where I was watching the film, everything in my soul and being was with Joan in that chamber, and for a minute I broke out in tears. That's the kind of effect that Dreyer's craft and all the acting work (including Eugene Sylvain as the Bishop Cauchon, and of course Artaud as Jean) can have on a viewer. I'm not saying it has to, yet The Passion of Joan of Arc could- and should- be considered a milestone in cinematic tragedy, where the images that come streaming forth never leave a viewer, and the detail for time and place becomes just that, a detail for the main stage. Love Joan or hate her, this is for keeps.","user":"Quinoa1984","rank":[119,131]},{"title":"When Film Becomes Transcendental Art.","rating":10,"date":"2 August 2005","review":"It so often happens that some films take the long way to achieve their status of classics and worthy of being studied, frame by frame, by movie lovers who believe in the power of raw performance and skilled direction of cameras to depict a powerful visual set of images. When one sees films like VERTIGO which barely registered with movie-going audiences at the time of their release but after restoration went on to become one of the best films of the last century, it only shows that film, as an art, doesn't need a golden statuette to have merit, and when it's done exceptionally well, it can be seen in any context and any time period beyond its release date and will still hold its audience in awe.<br><br>Carl Theodore Dryer, to me, created what I believe is, alongside Orson Welles' CITIZEN KANE, the most powerful black and white film in cinema history. It would be difficult indeed to say which one is better since both films are landmark in their own cinematic styles and have been dissected frame by frame. Dryer's film has been criticized for either being a pretty collection of still images or being pure visual power: I choose the latter, because in watching THE PASSION OF JOAN OF ARC, I felt not only the extremely uncomfortable intimacy between Joan and her tormentors, but her sublime emotions as they pass through her face as she is mocked, cross-examined, humiliated, and burned at the cross. There is an unearthly beauty in Falconetti's face as she goes through the ringer of emotions not in the overacting style typical of the Twenties but in a completely modern way, as if she were living a reality so far removed from the corrupted priests who bash and condemn her, and her reality would therefore be dangerous to their own beliefs.<br><br>And what a stroke of genius, I think, to have the lighting on her face be soft, gentle, in contrast to her detractors who are always lit in harsh light which exacerbates their ugliness and betrays their \"devotion\" to God as mere politics. Dryer's style of cutting from one actor to the other is also different, and makes this film a surrealist experience, an unsettling, abstract tour through transcendental suffering. There are no defining shots which tell us where exactly is the story taking place (although we don't need to know after reading the transcripts), but we never are allowed as viewers a moment of rest from this suffocating intimacy between Joan and her inquisitors. Some bizarre shots and camera angles give the ending an even more disturbing and horrifying element of what we perceive as a gross injustice to what was a person who held her own beliefs and did not need the Church to sustain it.<br><br>Falconetti never did a film before this one and never returned to film acting after this. I have not read much about her, except that she lived in Argentina until her death in 1946. I sometimes wonder why she didn't act again (although she was known to be an accomplished theatre actress more known for comedies than drama) but those are the mysteries of actors who don't have the star ego and only make a few films. She came, only did this masterful performance, and left just as suddenly, and those who re-discovered this film and restored it to its full quality have to be commended for allowing us, who have come almost 80 years later, to experience the power of subtle acting.","user":"nycritic","rank":[74,83]},{"title":"When viewing it we look at it as looking in a mirror.","rating":10,"date":"27 December 2004","review":"What can one say about this work of art that has not been said many times before by those far better qualified to explain both it's importance and place as cinema and art? I shall not comment on the greatness of the film's technical achievements; the stunning cinematography, the production design, the brilliance of the screenplay based on actual transcripts from the trial, or the perfection of Mr. Dreyer's direction. The performance of Falconetti as Jeanne d' Arc has a profundity and depth far beyond my ability to illuminate. I suppose the best I can hope to do is to share my feelings, however inadequately expressed, of the effect it had on me. To say that it may be the greatest film ever made is to sound both obvious and trite. That a work of such beauty and simplicity, made seventy-six years ago can still have the power to move audiences in an era of multi-million dollar, hi-tech, bombastic over-wrought cinematic drivel is in itself a testament to the vision and genius of Carl Theodor Dreyer, Maria Falconetti and their collaborators. It is nourishment for those that hunger for something more in cinema, a feast for the soul. It is a reminder that film can indeed be art, and this film like all great works of art, lifts and transports us from the routine of our work-a-day lives to enable us, if only for a moment to experience the sublime. When viewing it we look at it as looking in a mirror. That is to say we look into ourselves. We question ourselves as to our own beliefs, or the lack thereof and the strength of spirit that enables an individual to endure the unendurable. Viewing it is a profound experience the nature of which for myself is transcendent rather than religious, because I am not in the least a religious person. Transcendent because it evokes emotions and thoughts that I cannot wholly account for, or adequately explain.<br><br>\"La Passion of Jeanne d'Arc\" is stark, radiant, exalted, simple, (but never simplistic), and ultimately sublime. The rest is silence.","user":"GulyJimson","rank":[143,166]}]