[{"title":"Very emotional","rating":10,"date":"29 November 2004","review":"I love this movie so much. I bought the DVD and I can't seem to stop watching it. The acting by the superb cast and the plot is what makes this movie stand out from many other good movies. Guy Green did an awesome job picking the cast.<br><br>SIDNEY POITIER:Sidney does a great job as Gordon Ralfe. An African-American business man who lives with his brother, Mark and tries to live an ordinary life. He is also a compassionate man who has a giving heart and doesn't judge everyone.<br><br>ELIZABETH HARTMAN:I think Elizabeth Hartman's performance is what makes me want to keep watching it over and over again. Hartman plays soft spoken Selina D'Arcy. Accidentally blinded as a child, Selina learns how to deal with life despite having not been taught very much. Selina only knows how to do the house chores and is used to the constant abuse by her mother and grandfather which whom she lives with. Selina is as fragile and naive as a small child. Although blind, Selina doesn't let that get in the way. Visits to the park and her small job of beading necklaces are how she and Gordon(Poitier)actually meet. Hartman's performance is the rare gem of it all.<br><br>SHELLY WINTERS:I didn't really like Winters in this role. But because she played it so well....I can say that I liked it. Winters plays Rose-Ann D'Arcy, a middle aged, foul mouthed prostitute who's also Selina's mother. It is her fault that Selina is blind. Her fault that Selina was raped and her fault that life is the way it is for Selina. But Rose-Ann doesn't care about anyone but herself. She bad mouths her own father and physically abuses Selina. She has a short temper and makes money the best way she knows how. She apparently makes life a living hell for almost everyone.<br><br>The love Selina has for Gordon is as pure and heart warming as true love can get. I don't normally like romance movies but this movie is far from that. It's a story of the love two people from different worlds have for each other and let nothing get in the way. I LOVE IT!!!","user":"sugar-bear","rank":[54,56]},{"title":"A Patch of Excellence.","rating":26,"date":"26 July 2002","review":"One of those genuinely moving and emotional films that toes the line to excellence and almost succeeds. Young Elizabeth Hartman (Oscar-nominated) is blind and has been a part of a household where she has been treated like a second-rate stranger and outcast by her cold mother (Shelley Winters is a smashing Oscar-winning turn). One day Hartman meets professional businessman Sidney Poitier in the local park and they become quick friends as Hartman is treated with love and respect by Poitier while Hartman's handicap means she does not know that Poitier is really African-American. Two pure hearts are able to overcome the cruelty of others in this fine American motion picture that is well worth one's time. It is one of the better films of the 1960s. Sidney Poitier was at the top of his career here. 4.5 out of 5 stars.","user":"tfrizzell","rank":[50,53]},{"title":"A great film...touching and thought provoking","rating":4,"date":"4 May 2004","review":"\"A Patch of Blue\" is a wonderful film which works on at least two levels: a romance and a social commentary. Unlike most romances, it manages to be touching without being melodramatic, and unlike most social commentaries, it subtly makes its points without manipulation or a hidden agenda.<br><br>It is the story of how Selina, a blind girl who is verbally and sometimes physically abused by her mother, discovers her independence with the help of a young, black professional, Gordon. Selina's entire life has been spent alone and indoors. She has not learned how to read Braille or how to get around on her own. She basically does not know how to live independently. She meets Gordon in the park one day, and he essentially begins to teach her how to live. A warm and trusting friendship develops. The obvious complication from their relationship is the fact that Selina's mother is a racist, and Selina does not know that Gordon is black.<br><br>Both characters are wonderful: Gordon is cautious but intrigued, knowing he is walking on dangerous ground. Selina is comically naive and eager with an unbreakable spirit. <br><br>If you get a chance, watch this movie! It is inspiring and is one of those rare films that actually makes you think.","user":"EmAn1213","rank":[46,50]}]