[{"title":"Gable and Monroe Are Terrific","rating":10,"date":"14 January 2008","review":"THE MISFITS is a delicate gem of a film, poetic and harsh and as cold as those western stars on the horizon that Gable and Monroe drive toward at film's end. The title refers to the wild mustangs they hunt, but it also describes the 4 main characters, each lost in a world they hardly recognize. At one point Monroe points to a mountain vista and says \"it's like a dream.\" Each of the characters is wounded and lost in some way. Marilyn Monroe plays a divorcée trying to figure out what to do next. Clark Gable plays a cowboy in a vanishing west. Montgomery Clift plays a rancher cheated out of his legacy when his mother remarries. Eli Wallach plays a guy whose life has come to a standstill after the death of his wife. The characters circle each other, trying to make connections, but their timing is always off. Gable and Monroe seem to find something until they go on the mustang hunt.<br><br>Gable is magnificent as the aging cowboy who fears \"working for wages\" as the final sign of giving in to the commonplace and losing the old west. But the old west is, of course, already lost. Most of the action takes place in and around Reno, the perfect symbol for what the west has become. His drunk scene (after he has seen his kids) is astonishing in its pain and ugliness. It's a great performance.<br><br>Monroe is stunning and gives a quiet and simple performance that shows what she could have done (had she lived). Leaving her \"dumb blonde\" persona in the dust, what we get here is Monroe the actress, and she's just plain terrific. Aside from the scene (done in a long shot) where she rages at the men after they have captured the horses, Monroe plays this character very quietly and with lots of small reactions (watch her eyes). It's a great performance.<br><br>Clift and Wallach do wonders with their characters and provide a lot of the tension since all three men pursue Monroe. Thelma Ritter is solid as Isabelle. Estelle Winwood has an odd role as the old lady collecting money. James Barton and Kevin McCarthy have small roles.<br><br>I think THE MISFITS is a must see for any serious film buff. The film collapsed under the weight of its publicity in 1961 and there was a huge backlash when Gable died within 2 weeks of finishing the film. Yet the film is gorgeous, a shimmering Arthur Miller poem to the worlds and people we've lost.","user":"drednm","rank":[107,130]},{"title":"A Lesson in Film","rating":1,"date":"1 August 2003","review":"This once nearly forgotten movie, the last film of Clark Gable and Marilyn Monroe is now coming forward in the lexicon of film history as an underrated gem.  Universally misunderstood for the most part at the time it came out it is clear now that this film was at least five of six years ahead of it's time. It fits in more comfortably with films of the late 60's and early 70's.   The screenplay by Miller is one of his most striking works. A story of a group of people lost in the wide expanse of the West in search of the discarded souls of their misspent lives. The film's beautiful cinematography by Russell Metty stands out as superb artistry at the demise of the black and white era. It shimmers with the silver of the deep expanse of the desert and the flat grays and blacks of the distant mountains upon which the last act of the story plays. The music by Alex North is among his best work and gives a savage punch to the aerial scenes and the round up at the end of the wild mustangs. Montgomery Clift, by now sliding into the last years of his life is touching in his performance of Perce. His broken cowboy with the broken heart is almost painful to watch. His phone call home to his mother is among some of his best work.  Eli Wallach gives a strong deeply moving portrait of Guido who has lost his wife, his way, and his humanity. He shines in his scene with Monroe where he asks her to save him. When she can't to at least say `Hello Guido'. Thelma Ritter is, well, Thelma Ritter in yet another of her excellent character roles. Ritter is the master of the one line wisecrack but here as Isobel she laces the cracks with an underlying sadness and vulnerability.<br><br>  As Gay Langland, Clark Gable gives what I consider to be the best performance of his career.  It was a brave move for Gable to take on the role of what on the surface seems another one of his typical macho made to fit parts. But as the story unfolds from Arthur Miller's pen Gay reveals that beneath his gruff, not a care in the world, cowboy is a man in deep pain and despair at his losses. The world has left him behind. Abandoned by his children the drunken Gable breaks so violently it is a shock to watch the great man fall. This is Clark Gable at his finest ever.<br><br>  Marilyn Monroe gives an astounding performance as Roslyn Tabler the newly divorced dancer. A damaged woman who finds in the company of these three men something to finally believe in, something to stand up and fight for, she finds life. It is a performance ground out in part from her own person and experience and in part by the director John Huston and the editor George Tomasini who helped a nearly destroyed Monroe create her stunning Roslyn. This, her last performance is her best and the true example of the collaborative creation that film really is. That Marilyn under the circumstances of her life at that time could be so good is a testament to her talent as an actress and a star. Watch her when she is listening to the other actors. This is where she shines; this is the true mark of a great screen actor. To be able to listen and draw you into the inner life of the character through that deceptively simple act of listening and reaction is her gift to the audience.  Her scene with Monty in back of the bar, sitting on a pile of trash, her afore mentioned scene with Eli Wallach in the speeding car. These are but a few of the examples in this film of her great talent. In the 1950's and early 60's there were only a handful of great young actresses in film, Elizabeth Taylor, and Marilyn Monroe where at the summit of the small mountain.","user":"MGMboy","rank":[120,154]},{"title":"Everybody's gonna die","rating":8,"date":"9 December 2006","review":"To view \"The Misfits\" in 2006 turns out to be quite a chilling experience. Prophetically in its \"doomness\" - personal doomness that is. Arthur Miller writes, unwittingly, his wife's swan song and she sings it with a combination of uppers and downers. Pay attention to Eli Wallach describing Marilyn to Clark Gable. Was that Miller himself being particularly misogynistic or what hell was it? She talks about herself, they all talk about her. She is a hurricane right in the middle of a human storm. Montgomery Clift seems to be talking about himself too. The whole bloody thing is really close to the knuckle. Arid, depressing, slow and yet, riveting, funny, mesmerizing. \"The Misfits\" should be seen for a variety of reasons but to see Gable and Monroe sharing a black and white screen a short time before their deaths is an experience on itself.","user":"carlostallman","rank":[82,105]}]