[{"title":"One of Wilder's most divisive film's amongst his fans.","rating":7,"date":"4 March 2008","review":"Adapted from Alexandre Breffort's stage musical, Irma la Douce in film form turns into something of a roller-coaster ride. Even allowing for the absence of the songs (a major gripe with purists), the film is far too bloated to really achieve the heights of being a great comedy classic. If it had been condensed to perhaps a 100 minute film then I think it could have achieved the splendour that some sequences hint at. As it is though, there is still much to enjoy, and nobody should be under the impression that this film isn't funny, because it is, but just how long can you stretch the joke Mr Wilder?<br><br>I think the chief thing that sticks out is just how did Wilder get such an overtly sexual farce past the censors? He pushes the boundary more than usual with this one, and I honestly would be surprised if he himself wasn't surprised to get away with so much cheeky sexual shenanigans. The sets are fabulous from Alexandre Trauner, and Andre Previn's score is perfect and in tune with the Parisian heart of the film, but the lead actors here are oddly not firing on all cylinders.<br><br>Jack Lemmon's hopeless romantic Nestor is the core humour character. A character who becomes jealous of himself! His transformation into an English fop is hilarious at first, but on, and on, and on it goes till the joke becomes a heavy weight on the film's shoulders. Lemmon is fine, he's just the victim of over ambition from Wilder. Shirley MacLaine is the title character and it doesn't quite come off, sure she gives it gusto and she looks fabulous (as always), but the role cried out for a more cosmopolitan actress, and this again comes down to Wilder losing site of things with this particular project.<br><br>It's a safe recommend for Lemmon fans, but for Wilder worshippers such as me the problems are evident in spite the film being his highest grossing film of the decade. A cautionary 7/10.","user":"hitchcockthelegend","rank":[43,53]},{"title":"Irma La Douce (Billy Wilder)","rating":10,"date":"16 October 2006","review":"Irma la Douce is a gem, one of Billy Wilders best films. Banned from TV for many years by network censors, it began as a Broadway play and ran from Sep 29, 1960 to Dec 31, 1961 playing at both the Plymouth Theatre and the Alvin Theatre in New York. It quickly won the attention of Hollywood and in 1963 debuted as a film starring Jack Lemmon and Shirley MacLaine. It is a love story, the story of a policeman turned reformer who falls madly in love with a beautiful young prostitute. The IBDB captures its essence best: \"Irma La Douce\" is not only French; it is intensely Parisian French. Set in an area tourists seek, but so seldom find, its musical idiom, its moral atmosphere, its plot and its argot are part of Paris not even all Parisians know; a part of Paris where the underworld is known as the \"milieu.\" A tart is a \"poule,\" a pimp is a \"mec\" and money is \"grisbi.\" If you remember Sam Seborn's affair with a prostitute in the first season of West Wing, you have the advantage. Mix with this belief in the underlying goodness of a person with the enchanting music and backdrop of Paris and you will find yourself pulling for Nester (Lemmon) in his quest to win Irma's hand. Marilyn Monroe was originally scheduled to play Irma but died before the film work began. As a credit to Wilder's casting, Shirley MacLaine's performance earned her an Oscar nomination for best actress. The film's cinematography received its own Oscar nomination and the music took Hollywood by storm. It's stunning Parisian melody, written by Marguerite Monnot and arranged for film by Andre Previn, won the Oscar for best music and remains one of the finest musical scores ever.<br><br>And within the cheerful comedy of the plot, the story's philosopher shines bright as the mentor for Lester who struggles to overcome the muk of daily life. Being none other than the bar tender and owner of the Chez Moustache, the bar and stage center for much of the film, Moustache lends his shoulder to Lester and instructs him in the realities of life: life accepts no conscientious objector and must be approached as if it were a war where only the strong survive. In other words, face the world as it is, not as you were told it was.<br><br>Watch this film on DVD and get the wide screen version if you can. If you find yourself critical of the film, remember that this is late 50's, early 60's America. It came out during the cold war, in a period where TV was still in its 'Andy of Mayberry' days. Movies were heavily censored and even the media was under intense scrutiny for what topics matters it discussed. Irma La Douce was buried from play and only lately rediscovered by VHS &amp; DVD fans. Transport yourself back to the \"Milieu\" and enjoy, you may just learn something about life!","user":"wjv-1","rank":[51,65]},{"title":"Why so little shown?","rating":8,"date":"4 February 2005","review":"Billy Wilder's Irma la Douce is an absolute gem. Coming after 'Some Like it Hot' and 'One, Two, Three' and before the similarly undervalued 'Kiss Me, Stupid' it is part of Wilder's most creative period. Shirley Maclaine is perfect as the hooker with the heart of gold and Lemmon is hilarious as the protective lover.<br><br>Largely shot in studio, Wilder makes hay with the control that this gives him, with a fabulous market where Lemmon works to keep Irma off the streets.<br><br>It is such a joy to see Lou Jacobi in the pivotal role of Moustache. His line delivery cannot be faulted and he is given many of the film's funniest moments.<br><br>It is also a joy to watch a great wit like Wilder show us that prostitution is a way of earning a living, not a social problem. May you smile in Heaven, Billy!","user":"Balthazar-5","rank":[45,59]}]