[{"title":"Siodmak and Lancaster (and DeCarlo and Duryea) scale one of the pinnacles of film noir","rating":10,"date":"10 January 2004","review":"Robert Siodmak and Burt Lancaster made beautiful movies together - two of them, anyway (The Crimson Pirate is, as they say, another story). Together, they mark Siodmak's most assured work in film noir - and indispensable titles in the cycle.  Siodmak introduced Lancaster to the world in The Killers; three years after that auspicious debut, he starred him again in Criss Cross. With his chiseled face and rugged physique, Lancaster was the embodiment of the all-American pluck that had just won a war and was setting out to assume hegemony of the globe.  So Siodmak cast him, again, as a loser.<br><br>Lancaster returns to his family home in the shabby Bunker Hill section of Los Angeles; he'd been away trying to forget his marriage, which went bad after seven months.  But absence made his heart grow fonder, and he thinks of his ex-wife (Yvonne DeCarlo) as a piece of apple core that gets wedged between the teeth and can't be dislodged, even with the cellophane from a pack of smokes. Ah, romance....<br><br>Lying to himself, he starts hanging around their old joint, The Round Up, hoping to spot her.  Neither a ritzy club nor a down-and-out dive, it's a blue-collar night spot divided down the middle, with the bar and phone booth on one side and, on the other, the tables and dance floor.  It's there he sees her again, doing a smoldering rhumba with young (and uncredited) Tony Curtis to the insinuating flute warblings of Esy Morales.  She's ready to get back together, and so is he, but pride gets in the way; in retaliation, she marries flashy gangster Dan Duryea.<br><br>But Lancaster and DeCarlo keep bumping against each other, like cellophane and apple core.  When Duryea confirms his suspicions by catching them together, Lancaster weasels his way out of a very tight corner by saying he's planning a job for them - knocking over the armored truck company he drives for, with himself as the inside man.  He rationalizes his complicity away by thinking he and DeCarlo will abscond with their share of the loot.<br><br>\nThe brutal heist, filmed in a fog of smoke bombs, goes awry, with lives lost on both sides.  Lancaster's arm is smashed, but he winds up acclaimed a hero - if one strung up by pulleys attached to his hospital bed.  Only his erstwhile friend, a police lieutenant (Steven McNally) figures out the role Lancaster really played, and disgusted by his thick-headedness, warns that he's not safe from Duryea's henchmen, even while he's recuperating.  He's right: Lancaster finds himself being abducted to the oceanside rendezvous where DeCarlo is waiting - and for a final reckoning with Duryea.<br><br>Siodmak's establishes full command from the movie's first shot - a stunning aerial glide over Los Angeles at night, swooping into the parking lot behind The Round Up where Lancaster and DeCarlo are trysting - to its last, a darkly poetic pietà.  Characteristically, he fragments the narrative through flashbacks, counterposing the hopes of Lancaster's return home with the desperation into which he has fallen.  He also slows down for virtuosic sequences that only a great director could bring off: a long scene when the heist is being plotted, with the bored DeCarlo smoking cigarettes (`It passes the time') while the Angels Flight funicular railway criss-crosses the window behind her; and an equally long one in the hospital, involving a cranked-up bed, a tilted mirror on the bureau, and a visitor in the corridor - a good Samaritan who turns out to be his worst nightmare.<br><br>\nCriss Cross displays almost documentary-style familiarity with the details of post-war life, when prosperity was finally trickling down to working stiffs.  Lancaster's sporty duds showed a new, liberated look that would become the standard for men's casual wear for half a century (and counting), and DeCarlo, at the high-water mark of her career, looks as smashing in her slacks and barettes and print dresses as no woman has since.  Siodmak catches the excitement of disposable cash in callused hands, but isn't condescending about it; but overzealous love for it, however unaccustomed, is still the root of all evils.<br><br>Another German expatriate like Siodmak, Franz Planer photographed the movie (and it's probably his finest hour, too).  He shoots the armored truck from a vertiginous, almost abstract angle as it invades a huge industrial plant, or savors the shadows hurtling across its hood as it speeds across an ironwork trestle.  Nor does the living scenery get short shrift - close-ups of both DeCarlo and Lancaster are voluptuous (and Duryea's especially fearsome).<br><br>As he was able to do in The Killers, Siodmak keeps the integrity of the script, never lightening the tone or taking refuge in sentimentality.  The blend of crime and doomed romance, the tug-of-war between passion and self-interest, finds perfect balance here. Of course, it's the simplest and most infallible recipe for film noir. As DeCarlo says, `Love... love! You've got to watch out for yourself.'  If only she'd said it a little sooner.","user":"bmacv","rank":[45,49]},{"title":"Follow the Corkscrew","rating":21,"date":"21 July 2015","review":"Sure, you've seen it all before: the snarling villain (Dan Duryea), the black widow babe (Yvonne DeCarlo), and the hapless fall guy who just can't help himself (Burt Lancaster). But this is vintage noir from the golden age, done with real style and conviction. What stays with me are those scenes that have since worked their way into the textbook. There's the nightclub scene, where Lancaster gazes longingly at lost love DeCarlo, while she sambas with new honey boy Tony Curtis. Meanwhile there's this pulsating Latin beat that keeps going and going and everybody's shaking it except poor Lancaster. You feel the doom in the air and know this has to end badly. Then there's that nervous scene in the hospital where Lancaster's all laid up. But who's this new guy. He looks like Joe Average, but is he. <br><br>Director Siodmak really knows how to shift gears and make these quiet moments creepy. Everybody's been waiting for the robbery, but it seems like a cloudy dream, the kind you only half remember and wish you could forget. Ghostly figures drift in and out of focus, yet which one's Lancaster and who's got the money. Hollywood's fog machines were really working overtime on this one. Of course, it all leads up to the final scene, which is about as good as noir gets. The moment of reckoning when everything comes together, this time with a good view of eternity and in the moonlight, no less. The feeling that it all had to happen from the beginning is so thick you can cut it with the proverbial knife.<br><br>Sure, the D-cup DeCarlo's not quite up to the acting challenge, and the great Duryea doesn't get enough scenes, but consider the screen time given to two deserving foot soldiers of the golden era. Once you've seen him, you never forget him: that raspy-voiced gnome Percy Helton as the bartender. There's been no one like him before or since, a sly little troll who's escaped from the pages of Grimm's Fairy Tales. Yet I've never seen him give anything less than an A-grade performance that lifted many a B-movie above the forgettable. On the other hand, there's the completely ordinary Robert Osterloh as the mysterious stranger. His face is sort of familiar. Maybe he's the guy who fixes your car or fills your prescription or on a really bad night, shoves a gun in your gut. But like Helton, he too never gave anything less than an expert performance. Too bad his little Hollywood star never glowed, but he sure made a lot of others brighter than they were.<br><br>It's all there and in the kind of irreplaceable black and white that Hollywood's been trying to remake in Technicolor for years. So catch up with this original and find out why.","user":"dougdoepke","rank":[12,12]},{"title":"Gritty noir the way I like it...ranks with the best...","rating":12,"date":"12 September 2004","review":"1940's seedier side of Los Angeles makes a fitting noir background for this highly well made film noir starring BURT LANCASTER as the lovelorn hero foolish enough to go back to his ex-wife (extremely well played by YVONNE DE CARLO) who has taken up with a bunch of hoodlums headed by the sinister DAN DURYEA. True love never does run smooth, especially in this kind of fatalistic melodrama in which we have a hint from the very beginning of a dark conclusion.<br><br>The fact that Lancaster works for an armored car service is worked into the plot and makes for the movie's most suspenseful and action-filled moments. Some nice support from Stephen McNally as Lancaster's wise friend and Richard Long as his brother. Percy Felton does a standout job as an inquisitive bartender.<br><br>Robert Siodmak squeezes every bit of suspense as the story builds to a gripping climax. The hospital scene is extremely effective as Lancaster becomes aware of the dangerous situation he's in.<br><br>Lancaster displays some vulnerability and sensitivity despite his rugged good looks and has one of his best early roles here, even more impressive than he was in THE KILLERS. Miklos Rozsa's superb background score gives a jagged edge to the suspense.<br><br>Any lover of B&amp;W film noir is guaranteed to find pleasure in this one.<br><br>Trivia: If you watch real closely, you'll spot the young Tony Curtis as de Carlo's dance partner in the crowded nightclub scene.","user":"Doylenf","rank":[27,30]}]