[{"title":"a period piece-- but of a great period","rating":17,"date":"17 January 2000","review":"It's hard to rate this film. Its got a soap opera plot pasted on to some really fine cinematography, editing, music and racing sequences. The real stars of this film are the cars, the beautiful F1 'cigar' cars of the 60's with their exposed engines and elegant lines. Within a handful of years aerodynamics and advertising would change the look of racing forever. Even the plot hints at the change taking place at the time-- from the gentlemen's league of the 50's to the ravenously commercial and brutally competitive environment that Formula 1 was to become. Frankenheimer followed the tour through a season, to the storied old tracks such as Nurburgring, Spa and Monza (before safety and television considerations changed them to much shorter, less idiosyncratic shadows of their former selves). There are cameos by Graham Hill,  Bruce McLaren, Jim Clark and Lorenzo Bandini, names tinged with tragedy in retrospect. Technically this film is quite an achievement. Many of its developments, however, did not really take, such a multiple images, and the splicing of soft music to intense action scenes. The film, then, is not one of great importance in movie history. But there are a lot of racing fans who hold a special, if not top, place for Grand Prix in their lists of favourite films.","user":"lotus49","rank":[73,77]},{"title":"Grand Prix","rating":10,"date":"8 April 2005","review":"Although it is almost 40 years old, it is still the standard by which racing movies are judged. The good news is the plot doesn't interfere with the racing scenes. It's also great to see drivers like Graham Hill, Phil Hill (glad he didn't quit his day job), Chris Amon, Jimmy Clark, and others on screen. The cars are incredible, even with their lack of aerodynamics and their skinny tires. The opening scene with the engines starting and watching the throttles work is just too cool. These were the 3-litre engines and it was back when drivers actually had to clutch and shift! It's also great to see the tracks as they were back then, especially Spa. Unfortunately they were incredibly dangerous and have been updated for safety reasons, but they were good to see in their old form.","user":"pehibbs","rank":[50,54]},{"title":"Magnificent","rating":10,"date":"7 October 2003","review":"The plot is ho-hum, the acting is superb, with Jessica Walter and James Garner especially terrific, but the movie is about formula 1 racing, and there has never been anything like it. The racing scenes merge image and movement and music and become transcendent. Even on the small tv screen, this movie is remarkable. But if you ever find it playing in a theatre, you'll be amazed.","user":"bholly72","rank":[35,37]}]