[{"title":"oh, mercy, mercy me","rating":7,"date":"7 November 2004","review":"An environmentalist group ( a la early 70s ) somewhat sensationally named \"Doomwatch\" takes an interest in some peculiar goings-on on a small island near the UK. As a disclaimer, we never saw the BBC series so we don't have any previous notions to compare this film against but, having said that, the film is an enjoyable, cautionary tale about pollution and official stonewalling. Some people have lamented over the film's obviously modest - read: small - budget, but in our opinion this does not handicap the effort. If anything, it serves to highlight what can be achieved by the use of good writing, good acting, and good directing. Though not a horror film per se, its moody atmosphere and imaginative makeup does blur the line between suspense and horror quite effectively, and does actually manage to make you care about the people in it, most notably the character of Dr. Shaw. It's been pointed out that this film does bear a certain resemblance to \"The Wicker Man\", but in our opinion this has been overstated; yes, in both films an investigating official is stranded on a small island with lots of local strangeness, but that's about the only common ground between the two. Both are enjoyable, but for totally different reasons. Bottom line: while \"Doomwatch\" may not be a great film, it is a pretty good one. Try it.","user":"march9hare","rank":[23,28]},{"title":"\"Does your bucket need emptying?\" I liked it.","rating":7,"date":"8 July 2006","review":"Doomwatch refers to the name of a Government environmental watchdog &amp; starts as head scientist Dr. Quist (John Paul) sends underling scientist Dr. Del Shaw (Ian Bennen) on a routine assignment to a small island named Balfe just off the Cornish coast to study the after effects of a recent oil tanker spill. Once there the locals are very cold towards him &amp; rather disturbingly he finds the body of a child buried in some local woods, he is also attacked by a deformed man in a barn. Having examined some of Dr. Shaw's samples the scientists at Doomwatch discover that the local wildlife &amp; seawater is full of a artificial hormone growth stimulant, a stimulant that has been dumped into the sea by an unscrupulous waste disposable company. Since the islanders eat fish contaminated with the hormone they begin to develop a disease known as acromegaly which makes the suffer very aggressive &amp; deformed, a large proportion of the island has become infected but they are very wary of outsiders. Can Dr. Shaw convince them to have proper medical treatment &amp; stop the disease from spreading even further...<br><br>This English production was directed by Peter Sasdy &amp; was a direct spin-off from the BBC TV series of the same name that ran between 1970 &amp; 1972, I have to admit right now that I have never seen a single episode of the TV series so I cannot compare the two but I really rather liked Doomwatch the film. The script by Clive Exton starts out like a horror with it's unfriendly villagers hiding a terrible secret, the outsider, the isolated location, dead bodies &amp; deformed people but then goes into thriller mode as the illegal chemical dumping takes center stage while the whole film is wrapped up with plenty of moral &amp; environmental message's which in todays ultra polluted world are very relevant &amp; pretty topical. Many have said how slow Doomwatch is, this is something I disagree with as I found it very entertaining, consistently engaging &amp; a very worthwhile way to pass an hour &amp; a half. I liked the story a lot, it manages not to give too much away too early which keeps things interesting. Even now I also think it's quite an original film, I can't remember seeing another film like it. The character's are good, the dialogue isn't too technical &amp; I never felt lost or confused &amp; I thought it was a satisfying film to watch although the climax felt a bit rushed &amp; a bit flat.<br><br>Director Sasdy does a good job, the opening 20 odd minutes where he sets the story up is great. There's a cool atmosphere that you might expect to find in a Hammer film of the period, he manages to create some nice tension &amp; some effective scenes although it's not really scary overall. There's no blood or gore but that's not what Doomwatch is about, the misleading artwork featuring deformed mutants probably doesn't help as Doomwatch isn't a straight horror or sci-fi but it does have horror &amp; sci-fi elements.<br><br>Technically Doomwatch is fine, it has 70's written all over it but that suits the story perfectly. It's generally well made on location in Cornwall which looks cold all the time. The acting is good.<br><br>Doomwatch isn't for everyone but I liked it a lot. I liked the story, the mystery, the well thought out script &amp; atmospheric locations &amp; make-up effects. I doubt I'll watch it again anytime soon but if your looking for something a bit different &amp; your a sci-fi/horror/thriller fan then Doomwatch may be worth an hour &amp; half of your time.","user":"poolandrews","rank":[10,11]},{"title":"The Village Of The Doomed!","rating":7,"date":"2 August 2013","review":"Doomwatch is directed by Peter Sasdy and adapted to screenplay by Clive Exton from the TV series written by Kit Pedler and Gerry Davis. Ian Bannen, Judy Geeson, John Paul, Simon Oates, Jean Trend, Joby Blanshard, George Sanders, Percy Herbert, Shelagh Fraser and Geoffrey Keen. Music is by John Scott and cinematography by Kenneth Talbot. <br><br>An environmental research agency known as \"Doomwatch\" sends Dr. Dell Shaw (Bannen) to the Cornish Island of Balfe to research the effects of an oil spill. Once there Dell finds the villagers on the island are hostile and secretive and it soon becomes apparent that something is very amiss on the island.<br><br>Inbreeding and Immorality?<br><br>Doomwatch has its problems, with some average acting and logic holes the size of the Moon, but its highlights far outweigh the flaws. Mixing environmental concerns with sci-fi horrors, even though Doomwatch is not a horror film as such, it's a film that boasts a credible script and high interest value with its mystery.<br><br>Essentially the narrative is split into two parts. The first part of the film is suitably eerie. Once Dr. Shaw arrives on the island there's a sense of doom enveloping the place. The inhabitants act oddly suspicious and the makers introduce distorted angles to emphasise the fact that something is badly wrong here. John Scott's music is perfectly off- kilter and foreboding and with the pace of the story purposely sedate, this allows Sasdy to fill the sense of place with paranoia and creeping unease.<br><br>The picture then shifts at the mid-point when the mystery of the island is brought to the surface. We then find ourselves in the middle of a science fiction story wrapped around a heart breaking revelation brought about by corporate idiocy and ecological negligence. Into the mix comes ignorance, be it from the islanders, the church or the mainland authorities. It builds up a head of steam in the last quarter, where passions run high and the final act leaves an impression that's hard to shake off. <br><br>Add some lovely location photography around real Cornish locations, and some skillful underwater shots as well, and this definitely has much to recommend. Yes it's dated in that 1970s British independently budgeted way, this is a Tigon production after all! But give it a chance by not expecting a Mutant Wicker Man type horror movie and you may just enjoy it more than you expected. 7.5/10","user":"hitchcockthelegend","rank":[5,5]}]