[{"title":"Good Lighthearted Fun","rating":8,"date":"21 December 2004","review":"Sometimes, one wants their movies to be an escape tool. That's what this movie was when it was made and what it has always been. Two young people vacation on a Greek Island and meet a French woman who has led a rather eclectic life. Educated, knowledgeable about life and just plain sexy she is. A love triangle ensues without all the recriminations that would result in the real world. The only \"pain and suffering\" is the normal feelings of sharing a lover with another.<br><br>The funniest part is the surprise visit from the American girl's mother and best friend. For all its risqué subject matter, the movie stays on the surface of all that and plays this for fun and laughter. It's just good old-fashioned escapism along the lines of \"California Dreaming,\" \"Hollywood Knights,\" and other movies of that genre. It serves to introduce us to Darryl Hannah and Valerie Quennessen, who was lost in an automobile accident in the eighties.<br><br>If you're looking for a movie that will give you a few laughs, a little titillation and some harmless sexuality, this is a good choice. Who knows, it may spark some interesting conversations between you and your significant other!","user":"Gator1955","rank":[26,27]},{"title":"This movie is so much MORE than just 'T & A'!! A subtle classic","rating":12,"date":"12 December 2004","review":"How can you NOT love a movie that actually has a clip from a 3 Stooges short?<br><br>But seriously, this movie has a way of getting under the skin of many who view it. Like \"Bagdad Cafe\", and \"Summer of '42\" this movie has a certain 'magic' to it that stays with you for a very long time afterward. It's not due to any one element, but rather, the synergy created between the beautiful cinematography of the lush Greek scenery, the chemistry between the drop-dead gorgeous cast (all at their absolute peak of sexual/physical ripeness), a dynamic, inspiring soundtrack, and a subtle, well-crafted plot (if you can actually call it that...it is more of a skeletal framework...a backdrop against which to explore the issues at hand) It is a more mature examination, a graduate course, if you will, of the sexual revolution. It is a victory celebration of polyamorous relationships. It's the other side of the coin of 'Bob &amp; Carol &amp; Ted &amp; Alice'. It is \"The Harrod Experiment\" coming-of-age. (To those of you who were 15 when you saw \"Summer Lovers\", I doubt you've heard of The Harrod Experiment. The casualness with which nudity is handled in this flick only contributes to the overall beauty of it. (I doubt the movie would have had nearly the same effect if the principals were Roseanne &amp; Oprah, with Pauley Shore playing the male lead...) Funny thing, when it came out, prurient minds dismissed it as the quintessential sleazy male fantasy. There was just one problem with this knee-jerk review...Females liked it as much (if not more) than male viewers!!! This movie has confounded the critics since its debut...and still does so as it continues to win fans 22 years after its release. It is one of the few truly realistic depictions of an 'alternate lifestyle', handled with exquisitely good taste with just the right amount of restraint. Even the editing is exemplary. Truly a classic bit of film-making.<br><br>Warning: View it at your own risk. As I stated, the 'message' of this movie is insidious, and can cause one to re-examine some long-held social conventions. Subsequent viewings only enhance this effect. 5 years before \"Dirty Dancing\", there was Summer Lovers.<br><br>The sole tragic note to this movie is that Valerie Quennessen died only 7 years after its release.","user":"cyberian","rank":[45,49]},{"title":"Greek Math: 1 + 2 = 3","rating":12,"date":"12 February 2003","review":"How best to describe a big slice of cinematic Velveeta?  The film concerns itself with three beautiful tan people (on an island of beautiful tan people) who find fulfillment in a relationship that involves the three of them together.  A tawdrier subject who would be hard to come up with, yet somehow it all comes across as (mostly) good, clean fun.  A pre-stardom Gallagher brings his self-conscious, sexually naive girlfriend (Hannah) to a splendid Greek island where nudity on the beach is common and sex and drugs are everywhere for the taking.  (Of course, our screen lovemakers pass on the drugs, lest they offend even more potential Puritanical viewers than they do by getting involved in a threesome!)  Penis and bare breasts are evident on screen before the opening credits even roll.  Gallagher is on the island approximately 10 minutes before he comes across serene, sun-basking Quennessen who is completely at home with the Bohemian nature of the island (and has one amazing pair of eyes, although Gallagher probably was more interested in another pair of hers!)  He pursues her at every opportunity until she catches him.  Expected resentments occur once Hannah finds out, but what sets this apart from the other 2000 stories about adultery that have been filmed is this...once Hannah meets Quennessen, she finds herself enamored of her so much that she starts to encourage the relationship between her and Gallagher.  The rest of the story you can glean from the title.  The best aspects of the film include the tremendously inviting and arresting Greek scenery and architecture, the ultra-pop soundtrack (which is occasionally intrusive) and surprisingly natural performances of the rather green lead actors.  Another plus, for many viewers will be the nonstop parade of non-surgically-enhanced breasts and buns of the young international cast of extras.  Flaws include a pretty weak script and occasional editing that looks like it was done with the proverbial chainsaw. The film benefits extraordinarily from the location shooting.  If it had been set anywhere else it would become the most tacky soft porn film of all time.  It is dispiriting to think of this junk as screen veteran Rush's last theatrical feature, though, admittedly, she is perfect as Hannah's confounded mother.  Her sidekick Cook gets in a few laughs before they are spirited off.  Gallagher and Hannah obviously went on to much better things. Unfortunately, Quennessen was dead within a few years from an accident and rising Dutch actor Tongeren killed himself that same year.  It's a bit of a time capsule...a pre-AIDS wallow in sexual freedom and exploration, that inexplicably remains rather innocent despite it's subject.","user":"Poseidon-3","rank":[23,26]}]