[{"title":"\"This is my yard/So I will try hard/To welcome friends/I have yet to know!\"","rating":27,"date":"27 July 2001","review":"This is it, kiddies, the Grande Dame of camp classics. The sheer ineptitude of everyone involved is staggering. Mark Robson directs without a trace of nuance or subtlety; Patty Duke and Susan Hayward come off as boozy drag queens; Sharon Tate and Barbara Parkins look and act as if they had taken one downer too many; Dory and Andre Previn's musical numbers are as funny as those in \"The Operetta\"--the \"I Love Lucy\" episode which parodied musical theater; Billy Travilla concocts some of the most glamorously god-awful gowns ever seen; and Kenneth (of Hairstyles by Kenneth, of course) must be personally responsible for the hole in the ozone layer, so lacquered, teased and towering are his creations. But, you know what? IT ALL WORKS. The source material--Jacqueline Susann's groundbreaking, scandalous novel--begs for sledgehammer direction, overripe acting and eyepopping fashions. Certainly, subtlety was not a hallmark of Jackie's work. If anything, VOTD should have been even MORE over-the-top. Due to restrictions of the time, the film is sadly devoid of such juicy plotlines as Jennifer's lesbian affair, Tony's preference for - ahem - rear-entry intercourse, and Neely walking in on Ted Casablanca's tryst with another man. What we have, instead, is an endlessly entertaining piece of cinematic trash that is nowhere near as racy as it would like us to believe; and that's part of its twisted charm. Because it fails on so many levels--as true art, as explicitly sexual titillation, or as a faithful adaptation of a popular book--it's downright inspiring that it comes together so brilliantly. VOTD's ultimate triumph is that, despite its incredible waste of talent, time and money, 30 years later, we're still watching.","user":"TJBNYC","rank":[77,85]},{"title":"\"My beautiful little dolls. Just one...and one more.\"","rating":5,"date":"5 May 2001","review":"The film adaptation of Valley of the Dolls is stupid, empty, overly melodramatic...and a lot of fun!<br><br>Jacqueline Susann's 1966 novel is my all-time favorite, and her gritty, glossy pulp material was severely diluted for the big screen. That is the main problem. Too many punches are pulled, the characters are sweetened up, and a completely ridiculous happy ending (which Jackie hated) is substituted for the book's bleak, satisfying conclusion. Mark Robson's film has none of the spirit of its basis.<br><br>With that out of the way, the movie is very enjoyable for what it is: An unintentional laugh riot. The dialogue is hilarious and eminently quotable--\"Boobies, boobies, boobies! Nothin' but boobies! Who needs 'em? I never had any! Didn't hurt me none!\" Most of the supposedly \"dramatic\" and \"touching\" scenes are a scream. Patty Duke is priceless as the speech-slurring, tantrum-throwing, self-destructive Neely O'Hara. Watch her flailing around during the \"It's Impossible\" number; notice the embarrassing position of her beads. Barbara Parkins seems to have taken one Seconal too many before shooting, as she appears to be completely anesthetized. Susan Hayward gets to bellow a lot, fight with Duke, and get her wig thrown into a toilet in the most famous scene. The only one who comes off really well is Sharon Tate, a talent who never got the attention she deserved in life. Hers are the only genuinely affecting moments in the film, especially her final scene.<br><br>The candy-colored photography is good, beautifully capturing the glossy red capsules taken at every turn. The hair and fashions are glamorous--and so is the hairspray can! Dionne Warwick sings the beautiful theme, and the rest of the songs are enjoyably silly. I have the soundtrack LP--TWO copies! In conclusion, the ultimate camp classic! I'm off to take another doll now....","user":"Vince-5","rank":[50,55]},{"title":"Oscar Time!","rating":7,"date":"7 June 1999","review":"One of the great landmarks in the history of American cinema.  This is one of those movies that tells it like it is, takes it on the chin, and really shows some SPARKLE.  Oh yeah, the wigs and gowns are fab, too, especially that sequined poison-green trapeze minidress Patty Duke is too trashed to get into towards the end.<br><br>There is a kind of sublime awfulness about the performances that elevates every sentence in the screenplay to some scriptural stratum of indelible elegance.  Lines like \"Gee, honey, that ole witch oughta be boiled in oil,\" \"You're not the BREADWINNAH either,\" and \"SPARKLE, Neely, SPARKLE\" ring with poetic resonance in one's mind long after viewing the film.  Especially when you find yourself compulsively watching it over and over and over again...<br><br>The montage sequences are unbelievably powerful.  Forget Medium Cool, you haven't experienced the true tacky splendor of the Sixties till you've seen Barbara Parkins' Gillian Girl Commercial.  Get the soundtrack and use the jingle composed by master artiste Andre Previn on your answering machine. Why, all your friends will be ringing the phone off the hook just to have a listen.<br><br>As Superstar Helen Lawson, Susan Hayward is head and shoulderpads above the rest of the cast, especially when she's attempting to lipsynch her way through \"I'll plant my own tree\" while dodging the giant translucent fake Calder mobile (probably built by Monsanto) that's slowly revolving around her.  The symbolic-castration wig-in-the-loo sequence has to be seen to be believed.  \"I'll go out the way I came in\" admirably sums up the sentiments of everyone connected with this movie after it was released.  See Patty Duke's autobiography for some anecdotes about the filming.<br><br>This movie pretty much destroyed Director Mark Robson's career, but it made pots and pots of money for the studio, and was still playing drive in theatres around the country years after its release.  And curiously enough, many women I have known now in their fifties and sixties felt drawn to this film, felt that it spoke to them (if not for them) in a way nothing else up till that time had done.","user":"Gothick","rank":[40,44]}]