[{"title":"Roboman... Good Grief... Did They Even Make An Extra Nickel From This Lame Re-Titling?","rating":6,"date":"30 July 2005","review":"WHO? (3 outta 5 stars) Actually, the movie was re-titled \"Roboman\" for its video release (let me guess... some time after \"Robocop\" came out?) and has some trashy cover art making it look some kind of killer-robot-on-the-loose kind of movie... which this most definitely is not! It's actually a very interesting suspense film/character study... kind of philosophical and very low-key. Elliot Gould stars in one of his finest roles... as a US agent who has to decide whether an important American scientist returning from a Soviet country is, in fact, who he claims to be. A nasty car accident on foreign soil almost killed Dr. Lucas Martino (Joseph Bova). Russian scientists saved his life by placing him in a newly-developed robotic body... but he is hardly recognizable as human anymore... so there is some questions as to whether he really IS Dr. Martino... or a Soviet agent pretending to be him to gain access to an important defense project. The entire movie deals with Gould's quest for the truth... and a very interesting story it is, too. The ending is particularly interesting... cross-cutting a final meeting between Gould and Martino with flashbacks to the medical procedure. Is Martino really Martino? And does it really matter? You won't know until the final, fascinating moments.","user":"hokeybutt","rank":[17,18]},{"title":"For Fans of Oddities","rating":6,"date":"24 July 2003","review":"For those like myself who enjoy films that fit into no particular genre, and would enjoy a scene like a silver-headed metal man happily driving a tractor, this thing may be for you. ROBO MAN, as it is known on the video box, is a pretty strange affair. It is actually more psychological cat and mouse game than anything else, with the poor, metal-headed guy caught in the middle. The movie intercuts scenes of Gould trying to pick the metal man's brain to find out if he is who he says he is/was, with scenes of Trevor Howard appearing to brainwash the same guy at an earlier date. The intriguing notion is that Gould has such respect for the ability of his perceived enemy (Howard), that NOTHING the metal man says will prove who he is to Gould. I left the movie uncertain whether Gould's stubbornness helped or harmed humanity.<br><br>Also, it may have been intentional, but Gould acts more robot-like than Mr. Metalhead. The performance of Metaldude is actually quite affecting. Kudos to Joe Bova.","user":"LynxMatthews","rank":[15,16]},{"title":"Very unusual paranoia thriller, probably TOO low-key for its own good though the plot is undoubtedly thought-provoking.","rating":5,"date":"1 February 2006","review":"\"Who?\" is an intriguing, low-key, totally unusual Cold War thriller that has faded undeservedly into obscurity. While not a lost classic by any stretch of the imagination, it remains a commendable little film which explores issues of identity and political paranoia in an affecting way. Based on an Algis Budrys novel, and adapted for the screen by John Gould, it is a film of much talk and little action.... therefore, viewers will need to give it a certain level of attention in order to follow the plot and understand the characters. Those who prefer special effects, explosions and other such brain candy will probably not enjoy it.<br><br>American scientist Lucas Martino (Joseph Bova) is badly injured in a car accident whilst in the Eastern Bloc. He is rushed to hospital and saved by Communist doctors, but his face and much of his body is so grotesquely disfigured that they have to use metallic plating to rebuild him. By the time Martino is \"repaired\", he looks more like a robot than a man. A while later, Martino is returned to the U.S, but his startling new \"look\" arouses immediate suspicion. The American government wonder whether the real Martino has been sent back to them or if they have, in fact, been handed a Soviet spy disguised as this strange robotic man. Agent Sean Rogers (Elliot Gould) is given the task of interrogating the robotic man, to find out if he is who he claims to be or an impostor. Martino insists that he is still the same man, and that only his appearance has altered, but Rogers suspects that there is more to the case than meets the eye. Could the whole thing really be an audacious Russian spy plot? Or perhaps the Americans DO have Martino but he has been brainwashed by the Russians into carrying out espionage activities for them? Or maybe even the bewildered metal man is genuinely telling the truth, struggling to come to terms with his incredible new appearance in a paranoid world where all around him refuse to trust him?<br><br>Gould is good as the \"hero\", a man whose sense of accountability towards national security motivates, and occasionally clouds, his quest for the truth. Also good is Trevor Howard as the Russian Colonel Azarin, who is seen in flashback trying to brainwash the injured Martino (not until the end of the movie do we learn if his brainwashing efforts were successful). But best of all is Joseph Bova as the robotic victim, evoking a mix of sympathy and suspicion with his voice and mannerisms, despite the fact that his face is concealed behind an inexpressive metal mask. Indeed, \"Who?\" is a well-acted offering throughout. The film's faults lie elsewhere. Jack Gold's direction is too pedestrian and low-key for the movie's own good. Many of the scenes are so dully staged and detached and grey that the film has a somewhat cold feel to it. An air of cynicism hangs over the proceedings - one might almost call it \"anti-entertainment\" or \"anti-cinema\". This actually damages the film in some ways and undoes the effect of the good performances and thought-provoking story-line. I'd still recommend \"Who?\" if just for its relatively strange ideas, but it is undoubtedly a picture that could have amounted to much, much more.","user":"barnabyrudge","rank":[12,13]}]