[{"title":"This review is for the restored full length version of this very harrowing film","rating":8,"date":"28 May 2015","review":"Originally showcased at the 1980 Berlin Film Festival, this was initially criticised for being far too long – that being 151 minutes. So it was edited down to just two hours and has become seen as a German classic in the intervening years. It tells the story of Hans and Lene who meet before the outbreak of World War II and fall in love – both are not pro Hitler and so are not Party members. It opens with the poem of the title 'Germany Pale Mother' by Berthold Brecht and it is read by his daughter. It was penned in 1933 but to hear it today it would be easy to mistake it being about Hitler and the War.<br><br>When Germany invades Poland Hans is called up and so begins the long years of separation. In the meantime they have a daughter – Anna – who is the narrator of the film and tells their story through her eyes and the experiences of a child. The war is cruel and then when it is over the cruelties seem to get worse. This film spans many years and the heartbreaks and travails of just existing – let alone surviving.<br><br>This is not a war film – it uses archive footage (which looks very aged indeed) interspersed with the later material to try to place the story better in the historical context. The acting is all superb –but the story is depressing. It is meant to be depressing I think to ram home the cost of war and what it does to the body, mind and even the soul. There are some very hard to watch scenes here and at the full length this does need some commitment. There is a line that is possibly meant more as a plea than a statement and that is when Anna says 'who am I to judge, I was just lucky enough to be born later'. German speakers will not be impressed by the sub titles though – pretty average as far as they go. This though is a great film, it is one that the BFI have helped restore and it is a difficult watch, but it is also a film that needs to be seen if only for its message and it needs to be preserved in the hope that such folly will never be repeated.","user":"t-dooley-69-386916","rank":[8,8]},{"title":"The horrors don't stop when the war does","rating":8,"date":"5 January 2017","review":"Germany, Pale Mother is a unrelentingly bleak film, made all the more so by the fact that it is a semi-autobiographical portrait of Helma Sanders-Brahms parents. The film covers about a decade or so in their lives, from newlyweds in Hitler's Germany to the reconstruction post- German era. <br><br>We first hear of Lene before we see her. Hans, and his friend Ulrich, spot her walking along the bank as they are boating along a river. Despite the fact that Hans finds her attractive he watches impassively as a dog belonging to some Nazi party members attack her, but is most impressed by the fact that she doesn't scream or flinch. They later attend a dance together and Lene asks him if he's a member of the Nazi party, something that's important to her, though she seems fairly apolitical and doesn't have strong feelings about the Nazis, even when she watches them haul off one of her Jewish neighbours. Lene and Hans marry and are quite happy together, but the happiness is short lived. Since he's a low level civil servant, who isn't even a member of the party he is quickly conscripted into the army to go fight in Poland, the first in several professional setbacks he will face as a result of not joining the Nazis. Things are great for Lene either. Though the early years of the war mostly involve waiting around for her husband to come home from leave and ignoring the fact that more and more Jewish families are being hauled off, the evil of the war will come and visit her much later. <br><br>I've often heard it said that in the most personal stories we find universal truths and this certainly is true in this film. Sanders-Brahms settles her point of view almost exclusively on her mother and her parents' marriage and yet it manages to cover so much, from the way in which Germans, even non-Nazis, ended up participating in the war through their willingness to look the other way, to the way in which Nazi corruption continued after the war. By focusing on her mother, Sanders-Brahms also turns some conventional wisdoms on their head. While the men were off fighting abroad, Lene has a difficult life, but she manages to get along, become independent, taking care of herself and her child. Some of the worst things that happen to her happen during \"peace\" and reconstruction, times when the men who are supposed to protect her betray her in horrible ways. <br><br>Eva Mattes, as Lene, has by far the showiest role and she is pretty fantastic in it. The real star though is Sanders-Brahms direction. There are so many bold choices, from using herself as a voice-over, splicing in documentary footage of a little boy being interviewed so that it looks as if he is having a conversation with Lene, a shot of the swastika reflected in a pool of water, which are haunting and poignant.","user":"ReganRebecca","rank":[4,4]},{"title":"Deeply Depressing","rating":6,"date":"6 May 2001","review":"This movie reminded me of a caricature by Sempé:  a crowd leaving a cinema, an utterly depressed look on all their faces.  Seeing this, a young man cueing at the box office says to his girl friend:  \"wow, this must be a really good movie!\".<br><br>\"Deutschland, bleiche Mutter\" is a very bleak movie, more interesting as a document of the generation born around the war years than of the war years themselves.  If that's what you're looking for, you have struck gold. Otherwise be warned, it is not a movie for the easily depressed (or easily bored, for that matter).","user":"Karl Self","rank":[16,28]}]