[{"title":"Animation is not just for kids and male teens.","rating":8,"date":"8 October 2002","review":"I waited a bit before contributing a review for I wanted to read a few reviews to see if what I thought would be true...and it is. So let a lady step in and point out a few things for those who are interested in viewing this film.<br><br>This film was actually started in 1978, and finally released in 1981 and I was there to see it. It is based on the adult fantasy sci-fi America version magazine \"Heavy Metal\". The original origin of the magazine is French, very adult, very graphic, very sci-fi, lotsa nudity BUT excellent and compelling storytelling.<br><br>The key phrase is \"Adult, Fantasy, Illustrated\".<br><br>Just because its a 'cartoon', does not mean its for kids.<br><br>Looking at the Animation now in 2002, its dated. In the mid-80's Japanese Anime has set and kept raising the bar on this kind of adult anime genre. This early mainstream American attempt was good, for it had a good model, the magazine, Heavy Metal.<br><br>If Heavy Metal had waited to be produced until now, with all the advancements on technology, animation, graphics, art we have at our disposal, I only wish that the popular artists and storytellers of the magazine Heavy Metal were involved. It would be a different film indeed, and it would get an NC-17 rating. The only pieces that were trademarks of the Heavy Metal magazine were \"Soft Landing\"/\"Grimaldi\" \"Den\" and \"Taarna\".<br><br>More specifically, \"Taarna\" WAS exactly what the American Heavy Metal Magazine was all about and uncredited was Jean Giraud who has done a hell of a lot of work in the magazines history....both American and French versions is the cause for that. You may know his work by his other more famous name, \"Moebius\".<br><br>If you ask me, the film could have gone one of two ways: just like the magazine story by story without the silly connector of the green orb, or with just the one story of \"Taarna\". Back in 1978-1981, I would assume the Studio Executives could not venture into that manner without getting squeamish about box office so what we have is a tip-toe cross blend between the two. On one level it works, on another it does not. Its a viewers decision.<br><br>I like this 1981 version of the movie Heavy Metal, although a few stories didn't live up to the level of the magazine content..or were not presented as such. \"Neverwhereland\" should have NEVER been cut, I would have taken it over \"Captain Stern\" any day. \"Neverwhereland\" seemed to be along the lines of the magazines' content, too bad it wasn't included. \"Harry Canyon\" I could have taken or left, made no difference.<br><br>Additionally, I JUST loved \"Den\" and \"B-17\". I loved the soundtrack, for Metal is America. But just like the magazine, it was adult, it was fantasy, violent at points and contained nudity. It was early \"R\" Adult Animation American Style. (I know...Fritz the Cat was an \"X\" rated Animation that instead of using humans, used felines. Besides, Fritz was Ralph Bakshi's ticket outa Disney Animation and Robert Crumb is the 70's counter culture!)<br><br>This film, \"Heavy Metal\" was also marketed as the male dream: Metal Music, Sci-Fi, Fantasy, Nudity.<br><br>But wait...why was I...a woman interested?!?!?<br><br>It was \"Taarna\". This was the first animated woman in an American made mainstream animated adult feature film that the world needed, that the world depended upon, that was tough, that was independent, not a size four but voluptous, and was still very sexy. Nowadays, it may not mean much, but in 1981 when I was a teen and saw this, it meant a lot. Snow White, she wasn't and was she the Wicked Witch of the West either and that is how women were portrayed up till the release of Heavy Metal.<br><br>When I read a few stories in the adult magazines Heavy Metal from the late 70's to the early 90's, both American and French versions, the women in the majority of the stories, although drawn by European men and set in uncertain futures, wear...and in many cases...don't wear at all... and involved in explicit sexual situations..the women WERE the heroes!!<br><br>All in all, keep in mind Heavy Metal was made for an adult audience, just like the magazine. It's not just for the teenaged guys, its not just for the stoned and metal heads, its not just for the trekies or x-filers. It's a good effort for its time but if you're expectting work like in late 80s/90's Japanese Anime like \"Katsuhiro Ôtomo's Akira\", etc., or 2001's \"Taro Rin's Metropolis\" remember its 1981, and American, and NOT quite like its name sake Magazines, but its still good.","user":"lambiepie-2","rank":[145,164]},{"title":"A true Cult Classic, and well worth seeing.","rating":10,"date":"1 February 2001","review":"I have to admit, I loved this movie from when I first saw it.  A true cult classic, and second in Midnight Movie viewing only to Rocky Horror.<br><br>I think one reason that this movie was looked forward to for so long is that it was unavailable for so long.  I remember around 1984 when a release was planned, and a dispute with the multiple musicians caused it to be pulled. But thankfully this was finally resolved, so we can own it again.<br><br>I bought a pirate copy when i was in Japan in 1988 (On Beta no less), and almost played it to death.  And having been a fan of the comic when I could find it, I think it told the stories very well.  I admit that the \"green sphere\" link was silly and did not work, and that the original \"carousel\" concept would have been much better (watch the DVD release for details on this).  The simple fact that I have bought 3 copies of this time and still own all 3 of them says something about the movie.<br><br>Harry Canyon, Den, and Taarna are the be the most remembered pieces of this movie.  Each in itself could even be fleshed out to hour long length, and still be enjoyable.  So Beautiful, So Dangerous is enjoyable, and Harold Ramis and John Candy steal the show with their voices (\"Hey man, you got any of that plutonium niborg left?\").  And I admit, the film version of the story was MUCH more enjoyable then the original one from the comic.<br><br>PS:  Watch for the cameo of a destroyed USS Enterprise.  I love pointing that out to people that miss it.","user":"mushrom","rank":[55,64]},{"title":"TAKE A RIDE...ON HEAVY METAL","rating":26,"date":"26 April 2001","review":"One of my all-time favorite flicks is this animated anthology of stories all bound together by this glowing green \"Locnar,\" an orb of evil unmatched in all of time and space.  The animations are terrific: \"Harry Canyon\" about a futuristic cabbie in NYC, \"DEN\" about a nerd who is transported to a far off land as a hulking muscleman, \"Taarna\" about mankinds last stand against the power of the \"Locnar,\" and others. My personal favorite is the short \"B-17\" about a bomber in WWII and the horrible power of the \"Locnar.\" As I mentioned previously, the animation is spectacular...reminding me of a day when not everything was computer-generated.  Features Cheap Trick, Riggs, Nazareth, Black Sabbath, Blue Oyster Cult, Devo and others on the kicking soundtrack. Overall, a classic of the 80's: one that shouldn't be missed at any cost. My Highest Recommendation.","user":"sick_boy420xxx","rank":[60,71]}]