[{"title":"\"Our people cannot live together. There is a wall between us.\"","rating":7,"date":"13 April 2008","review":"\"Kings of the Sun\" is the story of a civilization burst into full flower <br><br>In their profound desire to win favor from the deities, the Mayans made human sacrifice the keystone of their religion <br><br>Keeping the Buddhist monk hairstyle as his trademark, Brynner easily steals the show with his virile personality, distinctive look, speech and mannerism He is Black Eagle, the barbarian chief who comes to the defense of the Mayans <br><br>George Chakiris plays Balam, the jaguar, king and son of kings to the ninth generation Although in spite of being young and brave and untried, Chakiris lacks the heroic stature with which the role might have been satisfied <br><br>Shirley Anne Field is the delicate Ixchel who would never leave Black Eagle except if he ever used to tell her that he loved her <br><br>Richard Basehart is the high priest who tried to make the king understand that he cannot bring this new life to his people without giving a life For a thousand years they've been bound by this law The gods cannot be cheated <br><br>Leo Gordon is the tyrant Hunac Kell His strength is a sword of metal and the Mayans are powerless against it <br><br>Filmed beautifully in Chichén Itzá, Yucatán  Mexico, J. Lee Thompson's motion picture is colorful and highly entertaining","user":"Nazi_Fighter_David","rank":[28,34]},{"title":"People of the Sun","rating":8,"date":"7 March 2007","review":"Anyone interested in seeing Hollywood's version of the Maya should view this noted 60's entry. The film is punctuated with panoramic locations, magnificent sceneries and considerable numerical extras for sustained blockbuster effect. Entittled, \" The Kings of the Sun \", this film is a worthy offering to entertain young and old alike. Assembled for the cast are Yul Brynner as Chief Black Eagle, George Chakiris as a Mayan Chiefton, Richard Basehart as a Mayan Priest and Shirley Anne Field as Ixchel, a beautiful princess. Accompanying this artistic rendering is it's rousing, nearly overpowering musical score composed by legendary Elmer Bernstine. The film depicts the story of a Mayan people amid its cultural throes in which Chakiris, replaces their dying king, but is forced to flee by a deadly rival menacingly played by Leo Gordon. Commandering an entire peaceful Mayan tribe on the hinterland of the Yucatan and sailing to the shores of America, Chakiris not only establishes a new beginning for his following, but collides culturally with Brenner and his Native American tribe. Aside from Eviserating cultural traditions, pummeling ancient deities and perhaps trampling on the Historical record, the film events are nevertheless worthy of tongue in cheek possibility. In the end, one can smile happily at this wonderful attempt and praise it for its dramatic sincerity. **** .","user":"thinker1691","rank":[20,24]},{"title":"One Among Movie Kings of Adventure","rating":7,"date":"1 July 2007","review":"The Mayas, one of the most mysterious and interesting civilizations that the world has ever seen, have not been popular movie heroes in cinema history. Except for Mel Gibson who recently directed APOCALYPTO, a stunning picture showing the twilight of the Mayan kingdom, not many people know that there was also J. Lee Thompson before who made KINGS OF THE SUN. He directed it in the early 1960s and, as a result, the film is filled with its era, with the style of the 1960s film-making. The reason why this movie is short of popularity is its highly limited access, not many TVs broadcast it, in most stores it is entirely skipped. Yet, recently, I had a chance to see KINGS OF THE SUN on Polish TV. And how did I feel about it? At first, I said to my friend who gave it a viewing with me: Nice little movie\" but after the second viewing, I noticed something captivating in it, I began to like it.<br><br>It is so because of entire different reasons than in case of APOCALYPTO. I don't like the idea to compare these two movies because they are totally different. What KINGS OF THE SUN lacks APOCALYPTO has and vice versa, including authenticity of language, cinematography, performances and music. The major reason why I was stunned by KINGS OF THE SUN is the presence of Yul Brynner. He is terrific as Black Eagle, a heroic chief of the Indian tribe who, at first, is hostile towards the new invaders; consequently, he is to be sacrificed to the God of Waters, and finally, finds himself in the absolutely unexpected circumstances. Brynner had many roles that were great but whoever claims that it is one of his very best ones is right. The way he says to Balam Your woman is beautiful\" enthralled me. The moment he observes a peculiar new city from a high tree remained in my memory as exceptionally outstanding. The final sequence is supplied with emotions also thanks to him. I admit that other cast do fine jobs, including George Chakiris as king Balam and Richard Basehart as priest Ah Min, but Brynner absolutely rocks. While he was the king in THE KING AND I, he is \"the king of KINGS OF THE SUN.\"<br><br>The pure film factors like cinematography, direction, editing are quite fine here, yet, they are not top notch. Perhaps, that is the reason why the movie has not become one of the top movies of the genre like other films of the time. But one thing is important to mention: it is a pure adventure, not an epic but the fictitious nice little story of love, courage, fight for independence, coping with social problems, building up a new life in a new place. The character of Balam is well developed he is the King for his people, the one who says NO\" to the fanatical religion and the insane idea of human sacrifice. His final speech is pretty thought provoking What do gods really want of us? What sort of sacrifice?\" Yet, nothing draws your attention to profoundity or history - all is there around adventure goal, like in other films of the time, including THE VIKINGS (1958) by Richard Fleischer or THE LONG SHIPS (1964) by Jack Cardiff. Pity that these two cultures, the Vikings and the Mayas, have not been put on screen more often in purely historical films while there are much more educational films about Rome, Egypt or Greece. But that is a different story. KINGS OF THE SUN, for entertainment's sake, is really a rousing adventure.<br><br>The last interesting aspect of the movie I'd like to mention is its musical score which is really memorable, not very easy to tune but fits well to the scenes and the entire spirit of the movie. Music is affected by adventure, fighting, emotion... all that leaves an impact in the viewer. Consider, for instance, the rapid tunes interrupted by gentle ones when Ixchel (Shirley Anne Field) is trying to tame\" the Black Eagle. Another wonderful musical moment is when they sail on the sea, the whole picture is stunning. It is so thanks to cinematography, authentic locations, including popular pyramid of Chichen Itza, but music adds much as well.<br><br>I have a fresh memory of this movie since I have seen it recently. The case with you may be different, perhaps it has faded in your memory due to many years that have passed since you last saw it. Maybe, it is the first time you have heard of this movie. But I give you my honest advice, look for it because it is really worth seeing. Whether KINGS OF THE SUN is going to be released on DVD or not, it is absolutely worth seeking out. Doesn't have the power of APOCALYPTO, doesn't offer the authentic use of languages as well as native cast, yet, Brynner will leave you breathless and some other aspects will unexpectedly satisfy you. 7/10","user":"marcin_kukuczka","rank":[16,20]}]