[{"title":"Remarkably well-organised western in which not one single second is wasted and the tension is built up admirably.","rating":10,"date":"16 April 2006","review":"John Wayne was totally wrong to call this movie un-American. Courage and cowardice are universal emotions, and the attitudes of the characters in High Noon are, I think, incredibly truthful and telling. I know that if I lived in the Wild West, had a job and family, and was asked to stand up and fight against a gang of gun-toting psychos I would probably not be able to do it. That's why Gary Cooper's Will Kane is such a remarkable character in terms of self-respect, morality and inner strength. It's the way he MUST uphold the law even though it will perhaps cost him his wife and his life. It is the various townfolk with whom most of us will identify, even if it makes us feel shame or unworthiness to admit it. No matter how bravely we act, nor how much we want to think heroically of ourselves, 90% of us would cower in the shadows when the time came to do what Will Kane does in this movie.<br><br>On his wedding day, dependable lawman Will Kane (Gary Cooper) has just handed in his badge and is preparing to leave town with his bride Amy (Grace Kelly) when he receives devastating news. An old adversary, Frank Miller (Ian MacDonald), has been pardoned for crimes that he should have hanged for and is on his way to Kane's town of Hadleyville to get revenge. He is due on the noon train, leaving Kane one hour to either run for his life or make preparations to fight. Kane and Amy set off at full gallop, hoping to put some miles between themselves and danger, but Kane doesn't get far before he feels compelled to turn back. With the new sheriff not due for a day, he just can't let go of the extraordinary sense of duty and responsibility he feels towards his town. However when he gets back to town he gets quite a shock - for no-one has the guts (nor, in some instances, the inclination) to fight alongside him against the Miller gang. As time ticks unstoppably towards noon, Kane gradually realises that if he's going to stop Miller and his boys, he's going to have to do it alone!<br><br>Cooper's performance is extremely powerful and he received a thoroughly deserved Oscar for it. Kelly is good as his bride, although many viewers will find her character hard to like. Lloyd Bridges has a brilliant early role as Kane's deputy, while the very best of the supporting pack is Katy Jurado as a Latino woman whose \"history\" with most of the men in town puts her in an unenviable position when the shooting starts. Fred Zinnemann directs the film outstandingly, making each scene fit into the grander scheme of things with literate precision. Any aspiring young film-maker wanting to learn how to pace a film correctly should watch High Noon with a close eye, for it is unparallelled as the most perfectly paced film of all-time. The music by Dmitri Tomkin - plus that incredible ballad \"Do Not Forsake Me Oh My Darling\" by Tex Ritter - is just one more element that makes High Noon one of the great masterpieces. There's nothing else to say - if you haven't already, go out and see this film NOW!","user":"barnabyrudge","rank":[165,200]},{"title":"Tense and Suspenseful Western","rating":10,"date":"18 March 2018","review":"On the day of his wedding with Amy (Grace Kelly) and simultaneous retirement of the position of Marshal, Will Kane (Gary Cooper) receives a telegram advising that the criminal Frank Miller (Ian MacDonald) had been released from the prison. Now he is coming to the town in the noon train to kill Kane, as he promised in the judgment. Kane arrested Frank five years ago and he was sent to North to be hanged. However he was sentenced to life and for some unexplained reason, Frank was pardoned and released. Three other gunmen are in the station waiting for Frank. Having less one hour and half to organize his defense, Kane tries to organize a posse but sees every citizen turns back to him, in a cowardly way and he stands alone against the killers.<br><br>\"High Noon\" is a low-budget western with a tense and suspenseful storyline. The tension is built in real time and Gary Cooper has an outstanding performance in the role of a Marshal moved by his duty to protect the town that does not deserve him. It is sad to see his former friends finding excuses to turn down his request for helping. The performances are top notch and the viewer gets tense while the clocks show the fatidic noon coming. Grace Kelly is astonishing beautiful and finds redemption in the conclusion when she saves Kane. The final scene when Kane drops his badge on the dirty floor is memorable. \"High Noon\" is certainly one of the most credible westerns of the cinema history and might be one of the best. My vote is ten.<br><br>Title (Brazil): 'Matar ou Morrer' ('To Kill or To Die')","user":"claudio_carvalho","rank":[23,26]},{"title":"A Man Who Won't Run Away","rating":10,"date":"29 May 2006","review":"For me, Will Kane embodies the American ideal of a hero: a man who stands up for what is right, even when nobody else does, even when the temptation is strong to stick the head in the sand.<br><br>Will Kane explains his outlook at the outset: there is no point in running away if that means spending the rest of your life watching your back. His best chance is to face his enemies on his home ground. At this point, he still thinks that honest folk will stand by him. The rest of the movie is a study in character: will he stand his ground when his entire world crumbles around him?<br><br>It is puzzling that Howard Hawks, John Wayne, and others thought of High Noon as un-American. I am not sure if this is because of the allegory of the McCarthy era; or the people of an American town collectively sticking their heads in the sand; or the Marshal throwing his badge to the ground in the last scene.<br><br>Clearly, the movie does not criticize McCarthyism itself. (It has nothing to say about communism, either.) It appears to criticize the people who did not stand up to McCarthy and the HUAAC, but it can equally well be seen as a comment on the appeasers who did not stand up to fascism or communism.<br><br>In any case, not too much must be made of the anti-appeasement angle, because the townsfolk is not the primary focus of the movie: the focus is on Will Kane. When the townsfolk behave like cowards, that gives Will Kane a chance to prove that he is a hero. If the town had stood by the Marshal, we would have seen, at best, an excellent Western like Rio Bravo, but not a masterpiece like High Noon. For Will Kane to be a hero, it is necessary that he stands alone.<br><br>No statement can convey the dramatic impact of Will Kane throwing his badge away, but it is worth discussing what this gesture means. For me, it means that the town and the badge were not worth fighting for. Will Kane fought for principle: he fought because he does not run away.","user":"SnorriGodhi","rank":[74,95]}]