[{"title":"\"Death is only death, SWINE!\"","rating":7,"date":"20 September 2014","review":"Sleazy sword-and-sorcery fantasy as only Roger Corman can produce it, \"Sorceress\" is good fun provided that you're not too demanding. It delivers a generous amount of amusement and fun, especially when it comes to the ridiculous dialogue, and its delivery. For the most part, it doesn't do that much to stand out from the pack of other, similar films during this time. But that all changes when it gets to the climax, a full-on assault of cheese and spectacle, complete with light shows and otherworldly creatures.<br><br>A large part of the charm, of course, lies in the casting of luscious twin sisters Leigh and Lynette Harris, playing warrior women Mira and Mara. It seems that one of them needs to be sacrificed by power-hungry villain Traigon (snarling and hammy Roberto Ballesteros). They take the fight to him, aided by such characters as the hunky young Erlick (Roberto Nelson) and the proud Valdar (Bruno Rey), a guy who wouldn't look out of place in a Lord of the Rings feature.<br><br>That's really all you need to know, so you can discover the silly pleasures of this lowbrow feature for yourself. John Carl Buechler handles the creature duties, creating a likable \"goat man\" sort of character as well as a variety of ape-like beasts. The music is liberally borrowed from the earlier New World productions \"Battle Beyond the Stars\" and \"Humanoids from the Deep\". The action scenes are basically decent. The Harris sisters aren't exactly very good actresses, but this viewer can't imagine many fans of this type of thing caring all that much.<br><br>The sad postscript is that this turned out to be the final directorial credit for exploitation master Jack Hill (\"The Big Doll House\", \"Coffy\", etc.), who had a falling out with Corman over the matter of the editing. In the end, Hill retained a producing credit under his name but the direction was credited to a pseudonymous \"Brian Stuart\" (the names of Cormans' sons).<br><br>If you like fantasy features to be on the cheesy, sleazy, low budget side, watching this will be a no-brainer.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[18,18]},{"title":"An absolutely terrible movie, but DAMN, is it entertaining!!!","rating":7,"date":"7 December 2001","review":"In the fall of 1982 (which is the correct release date) I went with a friend to see this film simply because the poster looked so cheesy. For some odd reason this was the second half of a double bill with WITHOUT A TRACE, a serious film about child kidnapping! Including my friend and I there were about eight people in the theater when SORCERESS began to roll, and I dare say that the eight of us got at least $100 worth of laughs for our $3.50. This is one of the most inept films from the short-lived barbarian flick cycle, and that's really saying something! It appears that they lost the dialogue track and had to re-dub, giving the movie the look  of a foreign film. I won't go into the plot since the previous review really nails it, but you simply haven't lived until you see the \"epic\" battle between gods Calgara (a giant Mexican woman's head with oatmeal on half of her face) and Vitaan (a seriously fake foam-rubber winged lion/man.goat?). As bad as this is, it is never boring, and is so crazily entertaining that I honestly rate it among my ten all-time favorite movies. VIVA SORCERESS!!!","user":"EL BUNCHO","rank":[43,47]},{"title":"Boobies!!!","rating":6,"date":"14 February 2008","review":"Hmmmm, picture this if you will; a pair of sexy twin sisters who have a delightful tendency to bare their (perfectly formed) breasts at any given opportunity, barbarians, boobies, cruel torture routines, boobies, monsters, boobies and magic..... Yep, everything any self respecting, red blooded male could ever want for in a film in fact, feature in this highly enjoyable sword &amp; sorcery outing brought to us by director Jack Hill. <br><br>The film never makes the mistake of taking itself at all seriously and is chock full of tongue in cheek moments and double entendres in addition to the requisite action goodies.<br><br>Highlights of special note include some particularly well rendered and creepy looking zombies, a cringe inducing scene where a main character narrowly avoids suffering a wickedly sharp spike up his back side(!) and a super hammy main villain.<br><br>Tremendously fun if you approach it in the correct frame of mind (and probably even better when one is drunk). Oh, did I happen to mention the beautiful boobies on display in this?","user":"HaemovoreRex","rank":[34,39]}]