[{"title":"Not that bad, people!","rating":27,"date":"27 July 2002","review":"In comparison to classics like \"Foxy Brown\" or \"Coffy\" this one  obviously looses, but the film itself is not that bad as some people  claim! Okay, it maybe looks more like the episode of a 1970s TV serial than a movie for the big screen, but it has got some decent entertainment values, although the above mentioned films were more violent and sexy. Once more Pam Grier plays a revenging lady which does away with some corrupt guys who killed her father. This amazing main actress it definitely the coolest Afro American actress on our planet and it´s a shame that she´s nowadays wasted in quite meaningless stuff like John Carpenter´s \"Ghosts of Mars\"! Another memorable part is given by Austin Stroker, a forgotten 1970s actor, who was great in films like \"Assault on Precinct 13\" (Made in the times when Carpenter still shot good movies...) or \"Battle for the Planet of the Apes\". Better watch \"Foxy Brown\" or \"Coffy\" first to see some real Pam Grier Blaxploitation classics, but you can easily check out \"Sheba, Baby\" without that feeling to have your time wasted!","user":"DJ Inferno","rank":[16,17]},{"title":"Hotter 'n' Coffy! Meaner 'n' Foxy Brown!","rating":6,"date":"14 February 2016","review":"This lesser film from Pam Griers' days as a blaxploitation queen is nonetheless mildly pleasing. Because it's rated PG, it has less punch than Pams' best stuff. Some viewers will really miss the elements of sex and graphic violence. The script, by producer David Sheldon and cult director William Girdler, is somewhat less than inspired, with only one sequence - the pursuit through the carnival - that could be considered memorable. The cast is also more colourless than usual. But Pam, in her inimitable fashion, could make just about anything watchable. Hell, this is worth watching just to see her in a wetsuit.<br><br>Pam plays our title character, Sheba Shayne, a Chicago-based private eye who returns to her hometown of Louisville, Kentucky. It seems that aggressive gangsters are constantly threatening her father Andy (Rudy Challenger) and his loan business, which Andy runs with Shebas' good friend Brick (Austin Stoker). Inevitably, the bad guys will have a full scale war on their hands once Sheba steps into the fray.<br><br>The ever engaging Stoker of \"Assault on Precinct 13\" fame is a good leading man for Pam, and D'Urville Martin is lively as \"Pilot\", a lowlife criminal. Christopher Joy is a hoot as a peddler who for whatever reason dresses more like a stereotypical pimp. Dick Merrifield is amusing enough as smiling, smarmy white guy villain \"Shark\". And it's nice to see Girdler regular Charles Kissinger as a mostly ineffectual white detective. Pam is great entertainment and eye candy as always, even if her role here isn't really on a level with her most famous ones.<br><br>The action scenes are passable (one comeuppance offers a spin on something we'd previously seen in \"Coffy\"), and the music score by Alex Brown and Monk Higgins (with vocals by Barbara Mason) is good, even if, like so much else here, it's also unmemorable.<br><br>Completists of the filmographies of Pam and Girdler will definitely want to check it out, no matter if it's not their best work.<br><br>Six out of 10.","user":"Hey_Sweden","rank":[5,5]},{"title":"PG Pam Grier equals big yawn","rating":5,"date":"23 September 2007","review":"No, this isn't Coffy, Foxy Brown, or even Friday Foster. It's Pam Grier toned down for the kiddies.<br><br>Unfortunately, with the loss of real action and Pam's boodilicious body, we also have to suffer through bad direction and a really lame script.<br><br>It is impossible to find a memorable quote from this film as there are none. The acting is wooden and, in most cases, just what you would expect from a flick that trades on the great roles Grier has had to date.<br><br>I was bored to tears.","user":"lastliberal","rank":[15,22]}]