[{"title":"Black Narcissus is a story of ghosts, wind, faith, frustration, sexual tension and madness.","rating":31,"date":"31 August 2001","review":"I have seen Black Narcissus in three different ways.  First I saw it in a movie theater when I was 7 or 8 with my mother.  I remembered it as being beautiful to look at and rather strange, and I fell in love with the idea of The Roof of The World.<br><br>I next encountered Black Narcissus as an older adult.  I purchased Black Narcissus in VHS format.  I devoured the film scene by scene.<br><br>\nThe film is ravishing, spectral and profound. The idea of someone being given a trust much heavier to bare than their abilities can handle opens the door to all sorts of possibilities.  The suggestion that all the nun's had lives before they became nuns and not all of them are suited to \"The Life\" adds depth and tension.  The introduction of a bare-chested, handsome man in shorts adds lust and temptation to the mix.<br><br>One of the best characters in the film is one that no other poster has mentioned.  The marvelous character actress who plays the role of Aiyah, the caretaker of \"The General's House of Women.\"  A woman who is already slightly mad when the film begins.  A woman who lives in the glorious past of the place.  She conjures ghosts. She casts shadows.  She has a voice as harsh as a parrot's.  She is priceless and wonderful in every scene, for she is not just mad, but wise.  She is the key to \"The House of Women\".<br><br>In the Alfred Hitchcock film of Rebecca, Mrs. Danvers, the mad housekeeper of Manderly, asks the new Mrs. DeWinter: \"Do you believe that the dead come back to watch the living?\"  In Black Narcissus, the viewer gets the feeling that just around the next turn or at the top of the stairs is one of \"The General's Women\", watching these odd women who live without men.<br><br>A previous poster mentioned the superb sense of \"place\" in the film and I agree.  The Palace is a player.  It has a personality and a mystery of its own. So is the ever-present wind.  Jack Cardiff, the genius who performed miracles with light and painted backdrops to photograph a film set in the Himalayas without ever leaving England, can't be praised highly enough.<br><br>The cast is splendid.  Deborah Kerr's tortured Sister Clodagha registers every emotion, every longing, every doubt and every fear with her eyes and the set of her chin. Dame Flora Robson, better known as Elizabeth I in so many films, portrays Sister Philippa, the nun in spiritual crisis.  Her, \"I think it is this place.  You can see too far.  I think you either have to give in to it, like Mr. Dean, or leave\", neatly sums up the entire film. When she can't bring herself to plant vegetables instead of the flowers she loves, she knows she MUST leave or lose herself and all she has worked for, forever.  Judith Furse, the capable and sturdy Sister Brione has no such concerns. Hers is an unquestioning faith.  Kathleen Byron as Sister Ruth, (the extra burden the Mother Superior foists on Sister Clodagha as a test of her dedication and skill at managing a small but dynamic group of women),is excellent in her demanding role as the nun who cracks.<br><br>A beautiful young Jean Simmons is sensuous as Kanchi who seduces Sabu who is very good as the young Prince, who has set himself to learn just about everything and who thinks the nun's shunning men \"Isn't very nice. After all, Christ was a man...\" He is named Black Narcissus by Sister Ruth.<br><br>David Ferrar as Mr. Dean may have \"given in to the place\" but he is still civilized enough to empathize with Sister Clodagha and resist Sister Ruth's advances.  He has predicted that the nuns will last \"until the rains come...\"<br><br>Black Narcissus is filled with magic images and haunting echos.  The \"flowering of the snows\" scene is breathtaking. The chapel scene frightening and tense.  The \"Bell\" scene horrifying. The final view of \"The House of Women\", viewed by Sister Clodagha from the valley below is heart-stopping: A mist rises slowly and inch by inch blots out the Palace, until it is only a dream in your mind's eye. Then, a large leaf is seen.  One drop falls. Then another, like tears of regret.  A black umbrella is opened.  Mr. Dean sits on his pony and runs his hand through his thick black hair.  He had said the nuns would be gone with the first rain, and he was right.<br><br>\nBrian Easdale's brilliant score underlines the changing moods and the mounting terror, but never overwhelms the action.<br><br>My most recent encounter with Black Narcissus is the new Criterion DVD. The commentary and behind-the-scenes photographs and the marvelous documentary, Painting with Light, is as extraordinary as the film.  It is a revelation. The sharper image doesn't bother me as much as it does a previous poster, but I do, when I have friends over to watch Black Narcissus, start with the VHS film and then put on the DVD for the special features.  That way I get the best of both worlds.<br><br>If you love great films, great acting or just stunning cinematography, purchase Black Narcissus.  It will haunt you forever.","user":"countryway_48864","rank":[149,159]},{"title":"Nuns story.","rating":9,"date":"2 April 2002","review":"As time goes by,Powell and Pressburger's movies become more and more important and crucial in the evolution of the seventh art.The first time I 'd seen \"black narcissus\" I had missed the whole point:this is the kind of film you've got to see several times.<br><br>Five nuns are leaving their Calcutta convent for a mission in the Himalaya mountains.In this place,where the wind never stops blowing,they will settle in an old \"palace\".These nuns have faith,they believe in what they are doing ,be it teaching,nursing,educating,or carrying the word of God.But their faith will clash with a thousand -tear-old wisdom(the Holy Man),a population who mixes up religion with magic,and Mister Dean, a Bunuelesque pragmatic man.<br><br>The natives will not change,but the nuns will.Their faith gets still tangled in prejudices;two examples:<br><br>-A young noble man wants to study in the mission.When sister Clodagh (Kerr) refuses,he points his finger at the crucifix and says \"Wasn't HE a man?\"\" He took the shape of a man\" the baffled nun answers.<br><br>-Sister Clodagh wants to get rid of the Holy Man,who spends his time gazing upon the world around him.\"What would Jesus Christ have done?\" Dean ironically asks her.<br><br>After hearing sister Philippa's (Flora Robson)worried confidences,sister Clodagh feels that her past is coming back to haunt her.The flashbacks are extraordinary,dreamlike and a bit eerie.Clodagh comes to the door to meet her fiancé ,there's only darkness.The past and the present are worlds apart,in time and in space and seem to be two unconnected ones .It recalls the real world and the beyond in \"a matter of life and death\" (1946).And the infinite space of the 1946 work is here the highest mountains in the world.By the same token,the hunting with hounds flashback forecasts \"gone to earth\" (1949).Powell and Pressburger are real auteurs who build a coherent work.<br><br>The nuns actually discover that they are women made of flesh and blood.One of them,sister Ruth goes as far as falling in love with Dean and relinquishes religion.The night scene during which she paints her lips against a hellish backdrop in front of a terrified sister Clodagh is a riveting tour de force that even Luis Bunuel did not equal.The fighting around the (hell) bell between a white Clodagh and an all dressed in black Ruth will leave you on the edge of your seat.<br><br>There are so many things to say about \"black narcissus\":Jean Simmons appears in a silent ,but vicious part.This is probably Deborah Kerr's towering performance,and she's only on the threshold of a brilliant career -she will play a nun once more in John Huston's \"heaven knows mister Allison\" ,but although I do love that director,her part here is far superior-.Jack Cardiff's award-winning color cinematography was years ahead of its time.It works wonders in the sensual scenes but the most beautiful picture remains for me the last one when the rain begins to fall on green leaves.<br><br>A sparkling black diamond.","user":"dbdumonteil","rank":[141,153]},{"title":"A film about nuns and lust ... but it's not what you'd expect.","rating":30,"date":"30 January 2001","review":"A story about a community of nuns ... doesn't sound very exciting. But in fact, `Black Narcissus' is as erotic, spellbinding, and suspenseful as any of today's psychological thrillers.<br><br>Directing team Michael Powell and Emeric Pressburger manage to combine a number of unlikely and potentially sensational elements - eroticism, desire, and isolation - into the story of a company of Anglican nuns who attempt to establish a civilised community in the former bordello of the Rajah, in the untamed hills of the Himalayas.<br><br>Their leader, Sister Clodagh, communicates with the indigenous leader of the land via a profligate Englishman, Mr Dean. Worn down by the hostile surroundings and the isolation, Sister Clodagh finds her nuns becoming restless and discontent. It is when one of her them, Sister Ruth, becomes infatuated with Mr Deans, that the fragile and repressed community begins to implode.<br><br>Pressburger and Powell deliberately used studio exteriors and special effects rather than shooting on location in order to ensure that the characters and their story remained the focus of the film, and not its exotic setting. This lends to the movie a heightened, mesmeric atmosphere which contributes highly to its artistic success, and earned two Academy Awards.<br><br>The famous wordless sequence towards the end of the film displays a particularly interesting approach. The music to this sequence was written and recorded first. Played back during the recording of the sequence, it dictated the movements and motivations of the actors.<br><br>Still completely convincing today, `Black Narcissus' is one of Britain's most important and innovative films.","user":"SilentType","rank":[92,100]}]