[{"title":"Definitely Underrated Film","rating":7,"date":"25 October 2006","review":"\"Conduct Unbecoming\" is a sort of thriller settled in a British regiment in colonial India. The widow of a heroic officer is assaulted by an unrevealed comrade in arms and an investigation takes place.<br><br>In my opinion, though not a classic and not even perhaps a great movie, this film is a most interesting product for those of us who enjoy \"who did it?\" movies. It takes place in a most original environment and its substance increases with subjects like military honor, loyalty, camaraderie and cowardice.<br><br>The cast is perfect and another highlight in the film with very convincing performances from Trevor Howard (as usual), Cristopher Plummer, Richard Attenborough, Michael York, Susanah York and always reliable James Donald in a minor role.<br><br>I'm sure that with a more imaginative and strong director than Michael Anderson (Stanley Kubrick, John Frankenheimer just to name a couple), this could have been a great film, nearly a classic).<br><br>But nonetheless, \"Conduct Unbecoming\" stands as a fine piece of entertainment in its genre and surely is worth a watch.","user":"ragosaal","rank":[26,31]},{"title":"Very worthwhile!","rating":10,"date":"8 August 2006","review":"Certainly excellent acting by an excellent cast. Its only boring if you don't understand the time, place and principles. This is hard to do in the 21st century. Honor, loyalty and comradeship are rare commodities today, not really highly valued or understood. That makes this film all the more worth watching and pondering. To be a common man in a position of such infallibility is beyond imagination today, but such were the colonial British in the Victorian era. I find this story absolutely fascinating and Stacy Keatch's performance as the only American in the film one of his best. Acting, writing, directing and beautiful color, I loved it. I'm grateful its finally on DVD.","user":"baskethilt","rank":[29,39]},{"title":"What my family would call 'a real it's-him'","rating":31,"date":"31 January 2001","review":"If you're familiar with Fametracker and its 'Hey! It's that guy!' feature, you'll understand what I mean by an 'it's-him'. It's when you watch a film and all the way through you're pointing at second banana actors going 'Oh look, it's him'. One of the pleasures of this film is trying to work out exactly why so-and-so's face is familiar and then realising it's Prior Robert from TVs Cadfael, or something similar.<br><br>I read the play Conduct Unbecoming at school, and while this film does not go quite as deeply into the themes it throws up, ie moral bankruptcy in the British Raj/army and macho values in general, it remains a well-made, well acted period drama redolent of the distinctive spirit of the period.<br><br>Then again, I could be biased because I find Milington so dishy (he played Herod Agrippa in I, Claudius, in case you're stumped!)","user":"blessed_damosel","rank":[19,33]}]