[{"title":"It's a metaphor rather than a \"seagull movie\"","rating":7,"date":"23 February 2005","review":"If I was rating this movie back in 1973 when I saw the film in the theater on opening day, then it would have been a 10. Age does take it's toll on our opinions and we're 32 years down the line, hence my rating's decline from perfection.<br><br>One must keep in mind when viewing this film that if you expect it to be a Disney story about seagulls, then you are going to be gravely disappointed. In fact, Richard Bach, the writer, fought tooth and nail to prevent exactly that Disney influence in the face of a studio that wanted to add animated fake mouth movements over the photography of the seagulls.<br><br>The story is presented through the persona of seagulls, but it is NOT about seagulls. Like the book of the same name, the movie is actually a metaphor about people and life and the pursuit of learning and something better than \"pack mentality\". Those viewers who keep an eye toward those subtle metaphysical principles will recognize the jewel at the heart of the movie. Those viewers with no thought of higher principles or those looking for an animal movie may conversely wish they had never heard of it.<br><br>Alas, the movie studio seemed to be populated by the latter group. Ultimately infighting between Bach and the pro-mouth-movement studio honchos who wanted to retrofit the movie after its release resulted in the demise of the theatrical release within a few weeks of opening. Granted, there was a limited audience for the movie, but Bach didn't care since those who needed the message would find it and I personally think it would have lasted longer if left alone.<br><br>The photography is stunning and the soundtrack by Neil Diamond is stellar. Granted, by today's standards, both the movie and soundtrack are dated, but then so is anything made in the 70's.<br><br>When it came out originally I took everyone I knew to see it who was even slightly interested in such metaphors and all of them loved it. It remains to be one of my favorite movies in principle even today despite the dating.<br><br>If you are going to watch it today, just allocate two hours of your life that are free of constraints in which to relax and learn one small simple quiet lesson and then enjoy the spectacular scenery while you are doing it. If you can do that, you will love it.","user":"Resonant1","rank":[59,66]},{"title":"One of the best films ever made?","rating":10,"date":"3 July 2008","review":"I watched this movie at the cinema theater in 1975 or 1976. I loved it! Then i rented it on VHS back in the 80's, and thought it was one of the best films i'd ever seen. Now, i was so lucky to find it on DVD, with Norwegian subtitles (Not that they're really needed here, though). This is clearly a very different film. Very quiet and beautiful, and with Neil Diamonds beautiful songs, that match perfectly. If a film intends to mean anything, the audience needs time to think. In todays modern, fast, loud movies, you hardly get time to breath, lot less to stop and think. With this movie, however, you get plenty of time. And the quiet, beautiful scenes are a part of the message delivered: Take your time, live your life to the full, don't be afraid to try what hasn't been tried before, don't hesitate, and don't stress. And first and last: Don't just accept other people's \"thruths\". Go find out for yourself. If it works for you, it works! I rated this film 10/10, because it's not only a very good film, it's unique! There has never been another movie quite like it, and probably never will be. This is a brilliant masterpiece of a film.","user":"filmfrik","rank":[20,24]},{"title":"A BEAUTIFUL FILM","rating":10,"date":"22 March 2003","review":"Sorry I disagree with some of the others here, this is one beautiful film, in story, photography, music.  Neil Diamond's score is first rate, the the film is unlike any other made....beautiful and full of feeling. If you don't have a heart and hate beauty, skip it. If you do, don't miss it, it's really a work of art.","user":"mntwister","rank":[39,51]}]