[{"title":"Third installment in ¨Commando trilogy ¨ directed by Antonio Margheriti and starred by Lewis Collins","rating":5,"date":"23 October 2009","review":"This action-packed film deals about some stalwart mercenaries . A team formed by a misfit troop of commando-for hire are contracted (by Lee Van Cleef, Paul Muller) to attack a lord-ringer's stronghold and retrive a floppy disk. They're commanded by a tough and two-fisted Major (Lewis Collins) helped by a war veteran (Manfred Lhemann). The band of mercenaries (Romano Puppo, Mike Monty, Bobby Rhodes : customaries in Italian B series) land deep into jungle to obliterate some drug-lords in Asia's infamous Golden triangle and much movement and danger ensues. The bunch includes a Thai native girl who falls in love with the veteran war.<br><br>This fast-paced movie contains adventures, thrills, mindless agitation and lots of noisy action for the most part. Big name cast by known actors as Lee Van Cleef and Donald Pleasance in a histrionic and sympathetic role. Screenplay by usual Tito Carpi but some spectacular action scenes cannot a silly script save. Stirring final full of explosions, shootouts and burning installations ; furthermore some plot twists. Cinematography is quite well, capturing the atmosphere of everywhere, in addition some moving images shot with camera above the shoulder. Embarrassment musical score composed by synthesizer isn't composed by Ennio Morricone. The picture is produced in average budget by Erwin C. Dietrich, ordinary producer and director of soft-core genre and Jess Frank's habitual financier. The motion picture is regularly directed by Antonio Margheriti. The film was realized in the wake of ¨Wild Geese¨ (Andrew V McLagen) and ¨Wild Geese II¨(Peter Hunt). And belong a trilogy constituted by ¨Codename : ¨Wild geese (1984)¨ and ¨Command leopard(1985)¨ starred by similar actors and same technical equipment and director. This jungle-setting exploitation movie will appeal to Eurotrash buffs.","user":"ma-cortes","rank":[11,12]},{"title":"Flirting with cult status","rating":4,"date":"4 November 2016","review":"Average Euro-styled jungle action flick is the third of the trio that was borne of the Anthony Dawson- Lewis Collins mid-80's partnership, Der Kommander is essentially the same as its predecessors with a few plot tweaks.<br><br>Good use of miniatures again, lots (emphasis) of things blowing up, people of SE Asian appearance dressed in military fatigues being catapulted in the air doing somersaults, that sort of a spectacle which you either tolerate or fall asleep watching. <br><br>Collins is again wasted in a one dimensional role as the suave kick-ar$e mercenary with the eternal 5 o'clock shadow, whilst the supporting cast though lacking a principal female lead, does have some surprising depth with Lee Van Cleef, Donald Pleasance, Brett Halsey, Paul Muller, Romano Puppo, Bobby Rhodes, Mike Monty and John Steiner (as well as series regulars Manfred Lehmann &amp; Thomas Danneberg). That's an impressive cast assembled for a very average jungle war pic, even by Euro-trash standards; had Klaus Kinski returned for this final instalment, the acting chops would've been in the cult movie stratosphere. Van Cleef sadly does not look well and so it's perhaps regrettably no surprise that he died shortly after this film's theatrical release.<br><br>If you've seen Codename Wildgeese or Kommando Leopard, then you've essentially seen Der Kommander (sans Klaus Kinski of course). Lots of old and borrowed, but nothing new. Would be nice to have these three movies as a box set for an evening of cheesy goodness, especially now that most of the cast have left the mortal coil, all much too soon.","user":"Chase_Witherspoon","rank":[3,3]},{"title":"Third time unlucky!","rating":10,"date":"10 October 2001","review":"This film follows CODENAME WILDGEESE and COMMANDO LEOPARD.  It is not as good as either of those films, due mainly to the fact that the action sequences lack the tight editing and loud sound effects of the two earlier films.  The acting is good, and far better than your average B movie.  Fans of these European films will get a kick out of the cast of B movie favourites Collins, Van Cleef, Pleasence, Halsey, Lehmann, Puppo, Monty and others.  May director Margheriti continue to work, I for one will still watch his films.","user":"Mazzarini","rank":[4,7]}]