[{"title":"incredibly charming story","rating":10,"date":"21 July 2005","review":"I really liked this movie a lot--especially because it had such a great ensemble cast. This movie was absolutely stuffed to the brim with characters from this community to give the movie great life and charm. In particular, the acting by Raimu as the baker was dynamite. He is a one-namer (like \"Cher\") that looks like a slightly skinnier Oliver Hardy and manages to use a wide variety of facial expressions and body language to convey so much emotion. When his heart is broken by his philandering wife, you really find yourself feeling for the guy! Overall, it was extremely well-acted and well-written and I strongly recommend it. However, be forewarned that the videotape by Interama Video Classics is VERY poor quality AND they use white subtitles that are often very hard to read. I don't know why, but almost EVERY French film from the 1930s I have tried to watch on video is almost unwatchable due to the degradation of the print. I'm not sure why this is, but it could easily turn people away from classics like this movie, and that would be quite a loss, as Marcel Pagnol who wrote this film was a true artist and master of his medium.","user":"MartinHafer","rank":[29,31]},{"title":"The best of the Pagnol films","rating":10,"date":"24 January 1999","review":"My favourite of all the Pagnol films, including the recent ones, due to the timeless, moving performance by the great Raimu as the lovelorn baker. The French stars of that period have never been surpassed as character actors, and for this film the writer was a great character author.","user":"Peekie","rank":[15,16]},{"title":"Baker's Dozen","rating":10,"date":"12 September 2006","review":"This one comes with a rep that almost dares you NOT to like it for none other than the Great Orson Welles declared it the greatest movie ever made and star Raimu the greatest actor. Welles is no slouch himself and many there are, including myself, who consider his own Citizen Kane to be in the all-time No #1 spot but, let's face it, old Awesome knows a thing or two when it comes to judging celluloid. This is, of course, a Marcel Pagnol production which presupposes several things; it will be set in the South of France barely a Long Shot from Marseille and it's twelve to seven to feature Raimu heading an ensemble cast of Pagnol regulars. So it is here with Raimu as the eponymous baker who has barely sold his first batch than his wife takes it on the Jesse Owens with the local stud. The smiles, if not outright belly laughs, on the faces of the villagers freeze pretty damn quick once they realize that no wife equals no bread which means that they set about locating and returning the wife. End of (very simple) story. But as someone once said it's the way you tell them and Pagnol has Scherezade beat seven ways from the middle; once again as in his celebrated trilogy (Marius, Fanny, Cesar, in case you just got here via a wormhole) he evokes an entire community with just a few strokes of the pen or, in this case, lens, so that what we have is a lovingly painted portrait of a small town not a million miles from the one Jack Ford devised for The Quiet Man and complete with a richly assorted set of residents. The closing scene where the errant wife ignites the fire in the oven may be a tad symbolic but when it occurs in such a warm film who cares.","user":"writers_reign","rank":[8,9]}]