[{"title":"Very hard to get, but wonderful","rating":9,"date":"24 June 2001","review":"Simply an awesome movie. I have no idea whatsoever if I got the movie the way intended. But what I did get was a couple of things. It's one of the funniest and most bizarre films I have ever seen. No matter what happens, people crashing motorcycles, getting beaten etc, no one, ever, shows any emotion. Just the \"classic\" japanese stone-face. There is no soundtrack in this movie either, and tempo is kinda low, but explodes now and then with meaningless violence. This might sound like utter crap, but Kitano pulls it off, and does it very well. It works, it's fun and it's interesting.","user":"OriginalMadman","rank":[24,30]},{"title":"It's about change.","rating":8,"date":"8 February 2010","review":"A lot of the comments have been about the film's relationship to the nature of violence, and it's true that it is a violent film. However, that's not the point of the movie. The film starts showing a young man sitting in the dark. He comes out into the light and walks slowly to where the action is taking place. He is dull, uninvolved, uninterested in what's going on. In the beginning, events happen to him. It is only after he is attacked by a hoodlum that he begins to take action himself. He volunteers for the mission to buy a gun and while on that expedition he is exposed to a wide variety of experiences that force him to become a more active personality. After his return he shows himself to be a take charge guy. The symbolism of the butterfly eggs is one of metamorphosis. The title \"Boiling Point\" has a meaning of change, the point at which water turns to steam. Finally, the last scene is of him in the same darkness as he was at the beginning, but this time when he emerges his movements are quick and jaunty. He is a different man.","user":"cheathamg","rank":[12,14]},{"title":"Kitano's very different yakuza film","rating":8,"date":"14 June 2002","review":"Takeshi Kitano's yakuza related trilogy consists of Violent Cop, Boiling Point and Sonatine. All these films are very different together, but they still share the usual elements of Kitano: Violent Cop is the bleakest, Boiling Point is the funniest and also oddest and Sonatine is like the combination of these two previous films, and Sonatine is also the greatest in the trilogy and also one of Kitano's most beautiful and greatest films. Boiling Point is very comic, but has also some Kitano elements of beauty and peace that we could see in his forthcoming films like Sonatine and Hana-Bi. Boiling Point tells the story of a baseball team and its relationship with the local ruthless yakuza gang. When couple of the team members decide to get a gun and fight some justice to the situation, we meet Kitano's character, a little criminal, who also has troubles with the yakuza. Kitano's character in this film is the most perverse and twisted I've ever seen! What follows is tragic and comic happenings as these tragicomic people try to get rid of the greedy and exploiting yakuza criminals, and stay alive at the same time.<br><br>There are many fine elements in this film, and this is pretty close to Sonatine, as both films have peaceful and incredibly beautiful scenes involving sea and flowers. The comic elements are very black and it is easy to see that Kitano was a comedian before starting his masterful directing career. His humor is often cynical, ironic and very personal. Just remember the scene at the bar, for instance! Kitano's humor demands brains to be fully understood and it is never as easy to laugh at and enjoy as some Jim Carrey farce (nothing against Jim, though). But Boiling Point is definitely not a mere comedy, it is a Japanese yakuza story with comical elements. The yakuza is presented here as stupid and childish bunch of criminals, who have to prove themselves that they are bad guys and worth respecting. There is a brilliant scene involving flowers and two machine guns, as Kitano and his pal decide to finish the miserable life of one yakuza team! In Kitano's films, usually guns are for men like extended penis: so important in order to \"be someone.\" Violence is usually the only way Kitano's characters are able to communicate together. <br><br>The elements of beauty are always heart stoppingly effective in Kitano's art, and the scene at the flower field is very fantastic and memorable. And this was only the beginning as we witnessed the beauty and power of films like Sonatine and Hana-Bi couple of years later. Takeshi Kitano is simply one of the greatest artists I know, and his cinema is as unique as cinema itself was in its birth, over 100 years ago. There is no comparison for his films, they are so personal and come straight from the heart of this man.<br><br>Boiling Point is not Kitano's greatest film, but still more than noteworthy. It is tragic, funny, exciting and challengingly symbolic at the same time, and thus as personal as Kitano's masterpieces. There are many great scenes and acts committed by the characters, and perhaps the only flaw in here is that the film is little too long and slow at the end part of the film. But once the end scene comes, it is again something we could expect from Kitano, and is pretty similar to Sonatine's finale.<br><br>Boiling Point deserves 8/10 rating as a very interesting piece of Kitano cinema, and this is a hint of what was to come from this man couple of years later!","user":"Bogey Man","rank":[11,16]}]