[{"title":"One of the sexiest and smartest American sex comedies of recent years.","rating":10,"date":"29 September 1998","review":"American college student Patrick Dempsey travels to beautiful Quebec City to spend Christmas with girlfriend Jennifer Connelly, who informs him upon arrival that she's no longer in love with him.  Spending the vacation with her eccentric family -- including nudist/Pascal expert Andre Gregory, staunch Catholic Florinda Balkan and the luscious Sheila Kelley -- teach him a thing or two about the mysteries of life, love and women.<br><br>Cleverly written and gorgeously mounted -- wait til you see that house -- \"Some Girls\" is the kind of offbeat and eccentric comedy that the French often do so well but Americans rarely attempt.  Little-seen upon its initial release, the film has developed a well-deserved cult following.","user":"NeelyO","rank":[31,41]},{"title":"The film is fiction, the family is real!","rating":16,"date":"16 February 2000","review":"The family in Some Girls are the Taylors of Montreal...the screenwriter actually dated one of the Taylor sisters and fictionalized them into this movie...The father is actually world-famous philosopher and McGill U. professor Charles Taylor. Their late mother *was* very Catholic...and the legendary house is real- an old wooden Metcalfe Avenue mansion, in Westmount- since sold, but still there. Of course, this film annoys them to no end - so don't mention it if you're invited to","user":"ajkandy","rank":[27,39]},{"title":"Truly A Work of Art...","rating":25,"date":"25 April 2000","review":"From its inception, the cinema has always attempted to identify itself as a form of art.  While there can be little doubt that many movies over the years have indeed earned this claim, most films released in recent years would cause the viewer to wonder whether the images on the screen were indeed the work of an artistic director and cast, or simply bombardments of entertaining images aimed at mindless audiences eating stale popcorn.  For those seeking to renew a confidence in the fading notion of the artistic motion picture, `Some Girls' (1988) is a must-see masterpiece.<br><br>`Some Girls' is the bizarre yet thoughtful comedy which centers in on the experiences of a young and naïve character named Michael, one of Patrick Dempsey's first roles.  Michael is thrust into a whirlwind of confusion and emotion from the minute he arrives in Quebec to visit his girlfriend, Gabriella D'Arc, played by Jennifer Connelly, during Christmas break.  He is immediately confronted with a dizzying array of bizarre events, beginning with an abrupt statement by Gabriella informing him that she is no longer in love with him, but nevertheless wishes for him to stay at the at the D'Arc's home (a chateau which is an architectural delight).<br><br>At dinner the first night, Michael is introduced to the rest of the D'Arc family, one of the most unusual and dysfunctional and families one could ever dream up.  Michael's eyebrows are first raised when he meets Mr. D'Arc, a hilarious part played by Andre Gregory, Gabriella's perpetually naked father, who is an eccentric philosopher obsessed with the works of Pascal. He also meets Gabriella's strict Catholic mother, the family's priest, and Gabriella's two sisters, Simone and Irenka, played by Ashley Greenfield and Sheila Kelley, respectively.<br><br>The comedy develops as the sexually frustrated Michael continues to pursue Gabriella in a desperate attempt to regain her love, while unsuccessfully trying to fend off the constant advances of her two sisters seem to be more than willing to engage his appetite.  More often than not, Michael finds himself in compromising (yet unfulfilled) situations with one or more of the three sisters, only to be caught, usually in the nude, by Mr. Or Mrs. D'Arc (or even worse, the dog, Beowulf).  The story sharpens with an unexpected twist as Gabriella's maternal grandmother, played brilliantly by Lila Kedrova, is introduced.  Granny, mentally and physically decrepit, escapes from her hospital into the wintry wilderness north of Montreal, which leads to an all out search and rescue operation undertaken by the family, with Michael tagging along for the ride.<br><br>In the end, it is Michael who finds Granny (or rather, Granny finds Michael), who confuses him with her late husband.  In a series of scenes that are uncomfortable and yet compelling, Michael gains a new perspective on both nudity and love.  Even though Granny seems confused about who Michael is, there is no mistaking the both the depth and simplicity of her words.  While Michael's romantic mishaps and the D'Arc family's antics are enough to make the movie funny, the scenes with Granny are the ones that dominate the film and give it meaning.<br><br>Directed by Michael Hoffman, Mark Bentley, and Robert Redford, `Some Girls' is filled with more symbolism than any other movie in recent memory.  The rich and profound imagery is a currency which is well spent throughout the entire film, all the way from the names in the film, (Beowulf, Lumiere, etc.) to the displays of classic works of art such as Unicorn tapestries. The most dominant symbol in the movie is Botticelli's `Three Graces,' a painting which graces the cover of the movie.  The symbol is fully revealed in the last scene of the movie, where the camera pans up to the painting, which has served as the backdrop in the airport as Michael says goodbye. In that instant, the three D'Arc sisters are enveloped in the lore of the Three Graces of mythology, innocent goddesses of revelry and love; the personifications of feminine charm and beauty.  Greek mythology ascribed to the Three Graces (or Charities) the creative power to inspire works of poetry and art.  How fitting for a movie which is truly a work of art in and of itself.<br><br>`Some Girls' is not only rich in character and symbolism, however.  It is also the canvas for a brilliantly woven set of themes, including love, sex, nudity, life, and death.  Each of these themes, most notably nudity, is explored in great detail during the course of the film.  Michael's quest for love brings him to a new understanding of the fine line between lust and true love, as is evidenced in the awkward scenes with Granny.  Similarly, the prolific amount of scenes suggesting nudity address the many forms of nudity, from the intellectual and natural nudity of Mr. D'Arc, to the innocent yet meaningful undressing of Granny, to the hot and steamy revelations of each of the D'Arc sisters.  One of the most powerful themes, however, is that of life and death, which is expressed in one of the most moving and unique death scenes ever filmed.  As Granny closes the curtains, Michael, and the audience, learn what life, death, and love are truly all about.  Similarly, Sanna Vraa gives a short but stunning performance as the young Granny, in a mysterious return at the grave which solidifies the story's lessons on life, death, and love.<br><br>As wonderfully compelling as this movie is, it should be viewed with a great deal of discretion.  Young viewers, especially young teenagers, should be discouraged from seeing `Some Girls.'  Also, those viewers whose standards are offended by constant references to sexuality and nudity would be wise to refrain from seeing `Some Girls.' The movie is rated `R' for a reason; the sexual content and themes are very provocative.<br><br>It is precisely because of this provocation that the movie is so worth seeing for the intended audience, mature viewers who have an appreciation for art, in all its forms, as well as an awareness and understanding of human nudity and sexuality.  For those viewers, `Some Girls' is bound to not only be a delightful experience, but also one which is both challenging and rewarding.  To them, a screening of `Some Girls' will seem like more of an evening spent in a truly artistic setting, such as a museum or opera, than just a crowded movie theater full of mindless spectators chomping away at that stale popcorn.","user":"grimes2020","rank":[38,58]}]