[{"title":"Warning Spoilers: Misidentified","rating":6,"date":"31 December 2002","review":"Many people have made the connection to the Friday the 13th series with Sleepaway Camp for obvious reasons.  They both came out within a few years of each other and all the action takes place at a summer camp.  However, the primary theme in the Friday the 13th series is vengeance.  Vengeance of a mother for the neglect and drowning of her son and then vengeance by the son for the murder of his mother.  Of course vengeance is also key to all the murders in Sleepaway Camp but for entirely different motivations.  The murders of Sleepaway Camp come from sexual repression, being picked on, and sexual molestation.  All these derive from feelings of shame and embarassment which is different than the motivations of Friday the 13th. A better comparison for Sleepaway Camp would be Psycho.  First let me say that in no one are the two comparable, Psycho is a masterpiece of story, directing, acting, and camera work, Sleepaway Camp is none of these.  But they share similar thematic characteristics.  Norman Bates suffers an Oedipal complex but when his mother takes a new lover he kills her and suffers tremendously.  He is overwhelmed by guilt and shame and brings her back to life in his mind.  But whenever he sees an attractive woman he feels guilty and shameful and murders them because his mother is jealous for his affection.  Sleepaway Camp is a more bizarre twist on these themes. Angela's (who turns out to be a boy) father and sister are both killed in a boating accident.  But unlike Jason, Angela does not wreck havoc on the camp for those deaths.  Instead Angela is adopted by her demented Aunt and forced to become a girl because the Aunt already has a son, Ricky.  There are two scenes in which I'm guessing a young Ricky and Angela witness two men, presumably Ricky's father and his lover having sex.  These scene is followed by a scene in which suggests a sort of sexual molestation between young Ricky and young Angela.  These two pivotal events greatly affect Angela and cause a sexual crisis within him/her.  What begins the rampage at Camp Arawak is another sexual molestation performed by the cook on Angela. This act sets her/him off the deep end and she/he begins to kill anyone who hurts her/him in any way.  Then to complicate matters she begins to have a relationship with Paul.  Angela has a gender identity crisis and cannot decide whether she/he is attracted to Paul or to other women.  It probably doesn't help her that she is surrounded by Men in booty shorts and half shorts, who would be mistaken for flamboyantly gay in today's culture.  So she decides to have a relationship with Paul and seems happy but he wants more, to feel her breasts, which of course she doesn't have.  Angela finally loses all control when she catches Paul cheating on her with Judy.  She brutally murders Judy by raping her with a curling iron.  Then she goes berserk and kills four younger children in their sleeping bags.  I think they kicked sand at her.  Then she decides to reveal her secret to Paul. And she does and promptly decapitates him.  Finally in the creepiest scene that I never saw coming she makes a crazy face with a gaping open mouth, ax in hand, completely naked and breathes heavily making slight animalistic noises.  This facial expression is comparable to one that Norman Bates makes dressed as the mother at the end of Psycho.  The sister of Marion is in the basement, finds the skeleton of the mother and then turns to see Norman dressed as the mother making a very similar crazy expression.  So in conclusion Psycho is a much more accurate comparison because both involve characters who are sexual confused, are men who dress as women, and kill when their sexual identites come into crisis.  I do not think Sleepaway Camp is a great movie, but had it better acting and special effects it could be. It is a thoroughly rich text.  The reason many people have responded to the ending, which I found shocking and disturbing and will unfortunately never leave me, is because it plays on deeply disturbing psychological events in people's lives.  And for that matter I think it is much scarier than a Friday the 13th or Nightmare on Elm Street which are basically about vengeance for the murder of a person.","user":"spknezek","rank":[45,55]},{"title":"There are two scenes in this film that I will never forget","rating":8,"date":"13 July 1999","review":"Horror films seemed the easy way to make a quick buck in the 80's.  There was an abundance of them that graced video.  I don't think half of them actually made it to the big screen.  You can add Sleepaway Camp to that list.  This is a typical scary film.  It has it's moments and it is scary in some parts.  It has some nice humour especially when they play camp jokes on each other.  But having said all that, this movie is as good as it is and it's not too bad ) because the mother in this film is creepier than Mrs. Bates and she actually makes you want to kill her.  But the two parts that I will never forget are images that are firmly planted in my brain, especially the part of it that stores nasty horror elements in it.<br><br>\nThe first was the death by curling iron.  It is so horrific that it bothered me so much that I had to cover my eyes the second time I saw it.  It is qutie graphic, not because of what they show, but because you know how nasty it is.<br><br>But the one thing that will stay with me and probably anyone else that has seen this film is the very end.  That last shot is so horrific, so way out of left field that you never see it coming.  It just hits you and then it ends.  It has a power of its own.  And judging by the comment on here from other users, they feel the same way.  This is a film absolutely worth checking out.","user":"baumer","rank":[90,117]},{"title":"Creepy","rating":6,"date":"11 June 2005","review":"This was part of a Cheesy Horror night and most of the time my friends and I were just amused by the funny 80s hair and clothes but the ending freaked us out, it is really creepy! And, they freeze it on a freaky image for nearly(if not all) the whole credits. Ick. Nobody expected the ending to be what it was. Most of the film is your standard summer camp horror movie - though the body count is rather high - kids getting it on, pranks etc.<br><br>I recommend this film for its 80s value AND shock ending, though now everybody has told you the ending is shocking then you will probably spend the whole movie trying to figure out what it is.","user":"Pigalina","rank":[6,6]}]