[{"title":"Gloria Swanson Is Zaza!","rating":10,"date":"16 October 2006","review":"Gloria Swanson plays Zaza, a spirited French music hall star who battles her rival (Mary Thurman) and chases after a rich man (H.B. Warner) only to get her comeuppance.<br><br>In a stretch for Swanson, Zaza requires her to portray a French woman in a silent film. Through gestures and facial expressions she succeeds admirably in playing a character unlike any other in her long career. The brazen Zaza is always adorned with the letter Z on her clothing, jewelry, hats, etc.<br><br>The film is marked by a terrific music hall sequence in which Swanson swings way out over the audience and tosses flowers down on various men. Thurman cuts the rope and sends Swanson smashing onto the floor. Later they have a great catfight scene in the country cottage Warner houses Zaza in.<br><br>Lucille LaVerne is the drunken aunt. Ferdinand Gottschalk is the duke. Helen Mack is the daughter. Yvonne Hughes is fun as the maid.","user":"drednm","rank":[31,35]},{"title":"I Can't Help Falling in Love With You","rating":8,"date":"12 June 2013","review":"I am not a fan of tear jerkers in which women must suffer because they've fallen in love with a married man. Nonetheless, I greatly enjoyed this movie, in no small part because star Gloria Swanson treads the difficult performance between misery and self-mockery so adroitly.<br><br>I was just settling into grudging appreciation when Miss Swanson began to play the piano and accompanist Ben Model broke into \"I Can't Help Falling in Love With You\". The next time the sheet music was displayed, I checked. The title was \"Plasir d'Amour\" but the notes were the Elvis Presley hit. I only hope that Ben has a chance to explain it to the audience before the next performance.<br><br>That settled, I began to appreciate the movie again and it grew with each scene. Allan Dwan got superlative performances out of his actors, including the usually boring Mary Thurman. By the time the movie ended and there were no villains, I realized this was as good as a popcorn movie gets.<br><br>I don't know when you'll get a chance to see it -- the only known complete copy is at the Library of Congress and there's some blurring and minor decomposition towards the end. However, if the chance, comes, see it.","user":"boblipton","rank":[9,13]},{"title":"Thoughts, Corrections, and Commentary on ZAZA","rating":28,"date":"28 May 2019","review":"I have not seen this film, and likely never will, but the three comments I have read here (occasioned on my part by a recent viewing of the Claudette Colbert 1938 version) need some thought and at least one correction. 1) Why should it be a 'stretch' for Swanson or any other actress to play a French woman, especially in a silent film?, 2) Is the second reviewer so removed from music that he does not know that \"Plaisir d'amour\" was one of the most famous love songs ever written (by Padre Martini, a sometime-priest)?, that it was well over 100 years old at the time of the play's setting (1898), and close to 200 years old when it was somewhat destroyed in order to become the Presley hit, \"I Can't Help Falling in Love With You\"?; also that it had been recorded by several dozen of the greatest (mostly) classical singers of the 20th century long before Elvis the Pelvis laid eyes upon it?, 3) While it is not inconceivable that Sarah Bernhardt might come to mind in connection with the character of Zaza, it should be noted that Zaza is a music hall star, while Bernhardt was arguably the most famous and most respected serious actress of her time, that time being the last third of the 19th century and the first quarter of the 20th (even though she always acted in French, even in America), and that her position then might be roughly analogous to Meryl Streep's today rather than to, say, Lady Gaga's! Also, in 1898 Bernhardt was hardly in her 'prime', being 54 years old (a lot older then than it would be now!) and a very famous star actress for 30 years. And, in 1898 I doubt that two respected French playwrights would have insulted their country's leading actress by writing a play about some of the less savory aspects of her life. Not to mention that in 1898 much of that information was hardly available to them or to the general public. I point out the unlikelihood of such an assumption rather than its absolute falsity, for we will never know for sure. The story was filmed 3 times before 1940, and twice during Bernhardt's lifetime, but outside the outstanding stage success Mrs. Leslie Carter achieved in the role in America, to this day the role is mostly associated with the American opera star, Geraldine Farrar, who achieved great success in it as her last new role at the Met, this in Leoncavallo's operatic version of the play. It does seem that, after Leoncavallo's death (1919) and Farrar's retirement from Opera (1922), ZAZA lost considerable ground. In fact, the only time most of us have heard of it since then was when Claudette Colbert filmed it in 1938 (and she was apparently a last-minute replacement for Isa Miranda, thus giving it a star imprimatur it would not otherwise have enjoyed), and in very occasional operatic revivals since the end of the Second World War.","user":"joe-pearce-1","rank":[2,2]}]