[{"title":"Decent early 80s' slasher with some script flaws","rating":5,"date":"29 March 2018","review":"RELEASED IN 1983 and written &amp; directed by Mark Rosman Stoller, \"The House on Sorority Row\" chronicles events at a sorority house outside of Baltimore where seven girls responsible for an accidental death start dying one by one during their graduation party. <br><br>The film borrows elements from \"Black Christmas\" (1974) and the French horror \"Diabolique\" (1955), like the unused swimming pool to conceal a body that later disappears. The first act is quite good, particularly the accidental death scene, which is well-acted for no-name actresses. Only two of the seven went on to a career in acting: The protagonist who plays Katie (Kate McNeil) and the slutty girl, Vicky (Eileen Davidson). Speaking of the girls, they present a realistic feminine smorgasbord with Morgan (Jodi Draigie) arguably being the most attractive. None of them, however, are anything to go gaga over (looks-wise, that is). <br><br>What marred the film for me was the dubious writing. For instance, wouldn't the girls be perplexed at how a dead body mysteriously made it to the attic? What caused it to suddenly fall down the trap door? Why don't any of the girls look at the face of the corpse to verify its identity? Would a couple of girls who know very little about guns seriously enact a prank using a questionable mixture of bullets and blanks? If you can get past these issues, \"The House on Sorority Row\" is a decent early 80s' slasher with a worthy plot and pretty good production values. <br><br>THE MOVIE RUNS 1 hour 31 minutes and was shot at Eltonhead Mansion in Pikesville, Maryland, with establishing shots done at University of Maryland, College Park. ADDITIONAL WRITER: Bobby Fine. <br><br>GRADE: C","user":"Wuchakk","rank":[6,6]},{"title":"Formulaic Slasher, but Quite Fun","rating":7,"date":"18 September 2016","review":"The House on Sorority Row is formulaic, but I'm sure it only feels that way because so many slashers have taken its template and mined it for their own use. We follow the good girl, the girl who is sure to be our final girl, and we're introduced to the other characters who all reveal flaws that will surely lead to their deaths at the hands of our killer.<br><br>In this movie, the first act introduces a motive for our killer, and we spend the rest of the movie trying to guess who it might be, while also wondering when and where our next victim will be offed. Some kills are better than others, but that can be said for all slashers.<br><br>Unlike the best the genre has to offer, the movie never makes you truly care for any of the victims, they all played a part in a crime early in the movie, and that hinders the movie's ability to get you invested in their fates, but it's still a fun time. I enjoyed the scenes at the party, particularly one scene where the camera in one smooth shot follows each of our sorority sisters as they try to act naturally as they keep a terrible secret.<br><br>For any slasher fan this is a can't miss. For anyone looking for something more, you can probably do better elsewhere.","user":"keithbrown-90195","rank":[5,5]},{"title":"Familiar slasher antics with a few nods to Les Diaboliques","rating":6,"date":"30 March 2017","review":"THE HOUSE ON SORORITY ROW is a standard slasher outing of the 1980s with an almost all-female cast. The plot has much in common with I KNOW WHAT YOU DID LAST SUMMER, which came much later, and features a group of college friends who pull an unfunny prank that leaves a middle-aged lady dead. They decide to dump her body in a swimming pool to make the death look like an accident, but then the murders start...<br><br>This rather cheap film is pretty much par for the course for the genre. It goes for the gory rather than scary approach although the crude nature of the special effects work puts this far below an equivalent production like BLOOD RAGE. The back story is pretty ridiculous and clichéd and the film is never scary, but on the other hand it is fast paced with lots of incident. The best and most mysterious aspects of the script are ripped off the French classic LES DIABOLIQUES.","user":"Leofwine_draca","rank":[4,4]}]