[{"title":"What can really be said?","rating":10,"date":"21 January 2003","review":"I normally don't comment on movies on IMDB, but in this case I feel like I should. I love movies, and I want to make them, and this movie is a perfect example of fine filmmaking.<br><br>This is one of the few movies that I have seen on the small screen (originally seeing it air on AMC, I believe, and then on the DVD I just watched) that made me get that feeling in the pit of my stomach. That little gnawing sensation that the director would hope you feel while watching his thriller.<br><br>Jack Lemmon's performance is a fine one, and Jane Fonda and Michael Douglas follow. I felt so much empathy of Lemmon, who's character Jack Godell, only wanted people to listen to his warning.<br><br>But what impresses me most about this film is the lack of a score, and this is also what makes it beautiful to me. Apart from the opening titles there are no background music to increase the tension, because none is needed. And while the credits run, white on black, in silence it drives the point home.<br><br>\nI use the movie as an example to anyone who says music makes the movie. I think the movie should make the movie and the music should only amplify that. But for The China Syndrome music is not necessary to get across the realism and the urgency depicted here. The characters portray all of this far better than the music ever could.<br><br>I highly recommend this movie, it is one of my favorites. If you like movies, you won't be disappointed. If you like movie soundtracks more, you might not want to give this one a go.","user":"LionTamarin","rank":[120,135]},{"title":"Crackerjack thriller!","rating":8,"date":"29 January 2006","review":"Intelligent, nail-biting drama came out of nowhere in 1979 and soon was on the cover of every newspaper in America (when life imitated the film). A nuclear power plant employee in Southern California is threatened by superiors when he decides to go public with the real story behind an accident at the plant. Ostensibly a stuck valve problem, a piece of film secretly recorded by a TV news-crew shows that it was an accident verging on disastrous proportions--and worse, that safety conditions are being scrubbed to save millions of dollars, a cover-up that endangers everyone's lives. The movie occasionally gets too technical (especially in the second-half) and could use more human interplay, however the performances by Jack Lemmon, Jane Fonda (as a puff-piece newswoman in the right place at the right time) and Michael Douglas (as a freelance cameraman) are superb. The throwaway bits involving nuclear protesters is both entirely accurate and bitterly satirical, and the news-biz (with its corporate structure and vapid yes-men) is vividly captured. ***1/2 from ****","user":"moonspinner55","rank":[32,34]},{"title":"Places and people on the verge of meltdown...","rating":7,"date":"22 May 2007","review":"All the right elements seemed to conspire here to make this a memorable thriller for years to come. You have the stellar cast - Michael Douglas in an uncharacteristic 'free-spirit' role that pretty much launched his movie career, Fonda playing her typical forthright female doing her bit for womens lib, and Jack Lemmon as assured as ever showing us a man with a crisis of confidence. Give them a hot-button topic about big business being duplicitous, and that's encouraging for a kickoff, but to have life imitating art so soon after is a marketing man's dream.<br><br>The script is impressively taut, intelligent but mercifully keeping the jargon to a minimum, and there is a genuine sense of sustained tension brought in play by the director as our three protagonists race to beat the clock. If you like 'whistle blowing' dramas, then this is not quite as good as \"The Insider\", but the whole thing is more than nervy enough.","user":"Howlin Wolf","rank":[12,12]}]