[{"title":"Underrated teen flick.","rating":7,"date":"7 December 2001","review":"This is a great, great film. Quite possibly one of the most accurate depictions of high school life I've ever seen. Lucas is funny, touching, and insightful. Corey Haim gives a truly winning performance as the tormented title character and makes the audience sympathetic towards him. Charlie Sheen, Kerri Green, and Winona Ryder all leave their mark in this film as his few friends and the rest of the cast works nicely. The great thing about this movie is that, although billed as a romantic comedy, it is more of a drama that explores the difficulty of being an outsider, this film doesn't give in to teen-flick cliches, it is almost relentless in terms of causing the audience to feel sorry for Lucas and at times it's downright scary. This film really made me think about how stupid high school social structures can be, it really is that bad for some people, in fact it's worse. I think this film is an emotional, moral masterpiece. I hate high school, I love Lucas. If you want to see high school for what it really is...skip \"Ferris Bueller\" or \"10 things I hate about you\", see Lucas, good stuff.","user":"BrandonHamilton","rank":[39,42]},{"title":"Heartwarming","rating":8,"date":"15 April 2006","review":"I saw Lucas for the first time today... more than 20 years since it first came out. I have to admit, I'm a huge 80's fan and even though I was just a kid during the 80's I consider myself to be pretty familiar with the pop culture of the time. However, for some odd reason, I never got around to seeing Lucas. I have to say that, despite the fact that this movie is so old and I've seen movies with similar plots since, this movie still made me teary-eyed. I absolutely adored Corey Haim when I was a young girl and his role as the sweet, vulnerable, yet highly intelligent nerd gave me the fuzzies... the same way he used to when I was young. He, along with the rest of the cast (including Kerri Green, Winona Ryder, and Charlie Sheen), gave a great performance... typical of the 80's teen flicks (with an over-abundance of clichés), but, nonetheless, touching. It's definitely up there with the all time classics: Sixteen Candles, Pretty in Pink... and any of the flicks including the Brat Pack. Definitely worth seeing if you're in a nostalgic mood and want to revisit the old days of knee-high tube socks and head bands.","user":"elipooh","rank":[29,31]},{"title":"The locust will be back soon...","rating":7,"date":"6 October 2001","review":"...and \"Lucas\" is still a charming and sentimental little high school campus comedy with a message about what's important in life (and it ain't football). Telling of a goggle-eyed \"shrimp\" (Haim) with little going for him, save his indomitable spirit, who tries desperately to win the affection of a pretty cheerleader (Green), \"Lucas\" is a crowd pleasing blast from the past with its priorities in order. In this day when movies with messages are rare, \"Lucas\" is a good family flick (for 13 and up) worth revisiting.","user":"=G=","rank":[21,23]}]