[{"title":"Sweeping and romantic epic saga of the Russian Revolution","rating":9,"date":"10 May 2006","review":"This is one of the most hauntingly beautiful, timeless epic romances of all time, set against the backdrop of the Russian Revolution. Stunning cinematography combines here with a turbulent historical setting, an unforgettable idealistic hero, and one of the most compelling fictional love triangles of all time. This surely ranks among the best of director David Lean's many masterpieces. It is based on Boris Pasternak's novel, which I confess to not having read so cannot comment on the faithfulness of the film.<br><br>The story revolves around the dreamy physician and poet, Yuri Zhivago, and his dramatic experiences during the tumult of the Russian Revolution. The story is told in flashback mode during later Communist years by Yuri's half brother, Yevgraf, a Soviet Army officer, to the young woman, Tanya, who may be the long lost daughter of Yuri and his lover, Lara. As a sensitive young boy, Yuri's mother dies and he is adopted by a foster family, the Gromekos. Later reaching adulthood, he studies medicine and marries his childhood sweetheart, Tonya, and they have a little boy, Sasha. However, earlier at their engagement party, he has found himself strangely drawn to a beautiful &amp; mysterious woman named Lara. Soon all their personal lives are thrown into turmoil by World War I and the Bolshevik Revolution.<br><br>The handsome Omar Sharif is brilliantly empathetic in the role of Zhivago, masterfully conveying his character's emotions. Who can forget his intensely expressive, tear filled eyes at some of the more emotional moments, especially with snowflakes melting on them? A physician but also a poet, Yuri has a deep appreciation of the beauty around him. His gentleness and idealism stand in sharp contrast to the horrific violence of war and revolution, as Yuri witnesses such atrocities as dismemberment and cannibalism. Also, this is a man who remains very much an individual despite the Bolshevik's philosophies of collectivism.<br><br>That era's devastating events unfold, including the Bolshevik Revolution and subsequent Civil War between the Tsarist Whites &amp; the Communist Reds. However, the main conflict here is internal within Yuri's own heart, as he is torn between fidelity and passion. He deeply loves his sweet, gentle, and dependable wife, Tonya, and struggles to remain faithful. Yet he is tempted by a forbidden passion for the alluring Lara, a nurse at the wartime army hospital where both are caring for wounded soldiers. Lara serves as his muse, speaks to his soul, and is the inspiration for his poetry. Unlike most modern cinematic tales of infidelity which involve little restraint or guilt, Yuri and Lara desperately seek personal integrity as they are repeatedly brought together (and separated) by the upheaval of war and revolution. Surely if Yuri is 'the worst of sinners, then he is the worst of sufferers also'. <br><br>The two women in Yuri's life, wife and mistress, stand in sharp contrast, though both come across as sympathetic characters. The lovely Geraldine Chaplain portrays his ladylike, aristocratic wife, Tonya, who is well bred and has been schooled abroad. The daughter of the bourgeois Gromeko, she is actually Yuri's step sister, which might understandably tend to elicit more platonic than passionate feelings from her husband. Yuri and Lara succumb to their passions even as the blameless Tonya is pregnant with Yuri's second child. Tonya is a warm, loving wife and devoted mother, undeserving of her husband's infidelity. <br><br>Julie Christie plays the gorgeous &amp; enigmatic Lara, a woman whose station in life makes her vulnerable to misuse by men, yet she possesses a genuine resourcefulness and inner strength. As a teenage girl, she is seduced and violated by the lecherous Victor Komarovsky, a despicable politician and her own mother's lover. She falls under repeated abuse by this vile &amp; contemptible character, who calls Lara a slut and treats her as such. Later she is fiancé &amp; then wife to the misguided idealist and activist, Pasha, who holds intense political ideologies which become more crucial than his wife to him. Pasha later becomes Strelnikov, the obsessive Bolshevik officer who eventually comes into confrontation with Zhivago. During much of the tumult, Lara entrusts her own &amp; Pasha's daughter, Katya, into the care of others. Of course the legend of Lara lives on musically in Maurice Jarre's lovely, haunting Lara's Theme.<br><br>Supporting cast members include Rod Steiger, who is perfect as the villainous Komarovsky, and Tom Courtenay as Pasha / Strelnikov, a shy and pure individual who earns the abused Lara's respect and love, later going on to become a cold hearted revolutionary. Alec Guiness portrays Yuri's half brother, Yevgraf, and Ralph Richardson is Tonya's aristocratic &amp; gentlemanly father, Alexander Gromeko.<br><br>This film has amazing Oscar winning cinematography throughout. During World War I and the Revolution, there are vivid scenes of battle, mass desertion, and endless march through the desolate, blizzard ridden Siberian wasteland. Also visually stunning is the spectacular train ride Yuri and his family must make from Moscow to the Urals, site of the family dachau. However, surely most viewers' truly unforgettable pictures are the snowy white sleigh ride and the magnificent ice castle at Varykino. No other film can compare in its depiction of winter scenery. This sweeping panorama, the era's tumultuous political events, and the emotional portrait of one sensitive man's experience of them, create a visual masterpiece and a truly immortal screen saga.","user":"roghache","rank":[111,124]},{"title":"Romance And Revolution","rating":9,"date":"10 December 2006","review":"You really do miss something when you see a formatted version of Doctor Zhivago as I recently did. This is the kind of film that was made literally for the big screen. It's what epic movie making is all about.<br><br>I also think that you should see this on the big screen back to back with Warren Beatty's Reds. Two very opposite views of the Russian Revolution, one from the inside and one from the outside. You could have a very interesting discussion on which is which.<br><br>The title character, played by Omar Sharif, is Dr. Yuri Zhivago who is both doctor and poet. He was orphaned as a child and raised in the house of Ralph Richardson and Siobhan McKenna. He marries their daughter, Geraldine Chaplin who of course he loves, but naturally like a sister. <br><br>The real passion of his life is Julie Christie who is married to a committed Bolshevik in Tom Courtenay. Courtenay is also a guy, with shall we say, some issues. She loves him in her own way though and goes to search for him when he volunteers for the army to subvert it as the Bolshevik plan was when Russia entered World War I. <br><br>Christie meets Sharif at the front and the passion ignites. But all around them the society they knew and were brought up in is crumbling about them. Their story set against the background of the Russian Revolution is what Doctor Zhivago is all about.<br><br>Zhivago knows change was inevitable, the old order in Russia was ready to be toppled. But he's a poet and not one to let his art be subverted for the sake of the state. Fortunately he's also a doctor and his services are needed, in fact the Bolsheviks rather brutally insist on his accompanying one of their brigades as a medical officer.<br><br>I still remember as a lad the acclaim Boris Pasternak's novel got world wide when it was published while being banned in his home land. After winning the Nobel Prize for Literature, Pasternak died shortly thereafter. It's a pity he did not live to see this film, I think he would have approved.<br><br>From the deserts of Arabia to the steppes of Russia, David Lean certainly knew how to direct a film that involved vastness. Yet the people of his stories be it Lawrence of Arabia or Doctor Zhivago never get lost in the spectacle. Lean makes you care about the characters that Pasternak created, you get involved in the romance of Sharif and Christie, you want to know if they'll make it in this country undergoing revolutionary convulsions.<br><br>Other performances of note are Alec Guinness as Sharif's half brother Yevgeny Zhivago, a committed Bolshevik himself and Rod Steiger as the opportunistic Komorovsky.<br><br>Doctor Zhivago won a host of awards in several technical categories, strangely enough it wasn't nominated for Best Picture in 1965 though. It is a classic and even now with the Soviet Union a memory, I doubt if even a Russian made remake of Zhivago could equal what David Lean and his wonderful cast gave us in 1965.","user":"bkoganbing","rank":[49,57]},{"title":"One of the most ambitious and watchable of the \"big\" Sixties films....","rating":9,"date":"23 May 2005","review":"\"Doctor Zhivago\" tells a simple love story in a turbulent setting and, for the most part, avoids easy resolutions to disordered emotional relationships Even though the focus is openly on those relationships, everything in the film recurs around the general destructive effects of the Russian Revolution The irrational actions of both World War I and the prolonged struggles among the various Bolshevik factions are the driving forces behind the tragic plot <br><br>In adapting Boris Pasternak's novel to the screen, writer Robert Bolt tells the story in flashback, with the powerful Gen. Yevgraf Zhivago (Alec Guinness) questioning a teenaged girl (Rita Tushingham) about her past He thinks she might be the daughter of his brother Yuri (Omar Sharif), the dreamy poet-physician and Lara (Julie Christie), the love of his life<br><br>Flashback to their youth and the first time that Yuri and Lara's paths cross on a streetcar He's a promising, successful medical student and poet, engaged to his childhood sweetheart Tonya (Geraldine Chaplin). Lara is the daughter of a dressmaker who has a long-term \"arrangement\" with Victor Komarovsky (Rod Steiger), a political chameleon who comes out on top no matter who is in power Lara's fiancé Pasha (Tom Courtenay) is an idealistic revolutionary who is part of that change Komarovsky's interest in Lara is not platonic <br><br>As those relationships are being selected, protesters are marching in the streets and the Czar's troopers are taking them seriously In the first big confrontation between a demonstration and a cavalry charge on snow-covered streets, Lean avoids the inevitable comparisons to Sergei Eisenstein's Odessa steps scene in \"The Battleship Potemkin,\" but he can't he1p but make a few references to it The clash in the streets also serves as a counterpoint to Komarovsky's seduction of Lara, and the two elements are cleverly interwoven The combination of the personal and the political has rarely been so striking as it is in that effective sequence<br><br>The most memorable scenes, however, take place during World War I and the revolution: a mass of deserters meets a mass of replacement troops on a lonely road; Yuri and family embark on a long severe rail journey from Moscow to the Urals and negotiate territory controlled at times by Red Guards and at times by White Guards; a machine gun attack on an unseen enemy across a field; Yuri's being harried into service and then his long trek back home through the snow<br><br>Lean gives the film an impression of stark, beautiful expanse Like all love stories, \"Doctor Zhivago\" depends on viewers' involvement with the characters, and these work very well While Lara is the effective expression of the pain and chaos of those cataclysmic times, Yury can see no happiness in his existence without the love of this beautiful woman, which to him is immortal... And while something was broken in Lara's whole life, she continues to be for Yuri an expression of life, and from the distressing emotion of losing her a new and unexpected life of poetry arises <br><br>Julie Christie and Omar Sarif are attractive, but not in conventional Hollywood terms, and their supporting cast could not be better The film remains one of the most ambitious and watchable of the \"big\" Sixties films, and one of the best depictions of revolutionary and post-revolutionary Russia with all its turmoil and torment","user":"Nazi_Fighter_David","rank":[52,63]}]