[{"title":"A lovely film","rating":8,"date":"6 February 2005","review":"Ride 'Em Cowboy has always been my favourite Abbott &amp; Costello film, since the first time I saw it at 10 years old. Other films of theirs had some of the classic routines, maybe better stories too, but this one has some great routines, great atmosphere and a lot of great songs too. And just as importantly Anne Gwynne never looked lovelier ... even when she was ogling Dick Foran! Was that why she didn't she make the A-list?!<br><br>It's that Universal Studios 1941 atmosphere that counts most, and Don Raye &amp; Gene de Paul had cooked up some marvellous tunes as well, my favourite being Give Me My Saddle. The marvellous Merry Macs had their bit with Wake Up Jacob, a glorious little ditty I think is still not available on CD. Most of todays music experts would go for Ella's classic A-Tisket A-Tasket though, whilst probably commenting on how demeaning it was for her to appear in such a film. But as far they're concerned not for anyone else appearing though!<br><br>Favourite bits: Lou's dream sequence \"You will You won't\"; in the chase \"putting out the brake\"; the romantic midnight horse ride to the gorgeous I'll Remember April; many other bits of Bud &amp; Lou's, all putting a smile on my face: not forgetting the poker game, breaking in Wildcat, the Red Indian dummy sketch etc. Was Sunbeam the young squaw an inspiration for Tex Avery's cartoons?<br><br>82 minutes of joy to fans, however if you don't like A&amp;C, b&amp;w films from 1941, Westerns or slushy music there's nothing for you here.","user":"Spondonman","rank":[17,19]},{"title":"The boys own Way Out West?","rating":7,"date":"4 March 2008","review":"Well obviously not close to that brilliant offering from Stan &amp; Ollie, but this is a nice genre attempt from Bud &amp; Lou.<br><br>The guys here are peanut vendors at a rodeo show, after accidentally burning their boss's foot they hide away on a train heading west. They end up at the Lazy S ranch and get work despite the fact that they clearly have no idea what they are letting themselves into.<br><br>That's as much as you need to know really, there is the usual mix up of songs, love interest, and pure mania that goes with the decent films from the boys considerably large CV. A running plot strand of the guys on the run from Indian's because Lou has accidentally got engaged to a squaw, makes for some great and humorous scenes, but the stand out sequence takes place at a swimming pool, wonderfully funny part of the film. The film isn't really one to win new fans to the comedic talent of the pair because the running time could be too long for some with this brand of humour, but for those already converted, the film sits nicely up at the top with the best of their work.<br><br>A-ticket, a-tasket, a green and yellow basket! 7/10","user":"hitchcockthelegend","rank":[12,14]},{"title":"\"Don't worry sister, we'll have a bow and arrow wedding.\"","rating":6,"date":"17 February 2005","review":"Abbott and Costello found themselves in a wide variety of films; \"Ride 'em Cowboy\" is their take on mangling the Western genre. They're aided by genuine \"B\" Western stars Johnny Mack Brown and Dick Foran along with pretty Anne Gwynne as the romantic interest for Foran's character, Bronco Bob Mitchell. Bronco Bob is largely a mythical character, invented by Mitchell when he was a starving writer. But his Western stories were hugely successful, so the Mitchell exploits grew larger than life until he can no longer live up to the image of his creation. Arriving at the Lazy S Ranch, Mitchell and the boys take a stab at dude ranch life and try to get ready for the annual rodeo celebration, in which Mitchell has agreed to compete. Therein lies the recipe for this Abbott and Costello brand of Western fun.<br><br>With no sign of the Andrews Sisters from their earlier films, the musical chores are picked up by The Merry Macs and Ella Fitzgerald. A quick peek at Ella's filmography reveals that her standard \"A-Tisket, A-Tasket was performed in seven films between 1939 and 1948, and it's done here in fine fashion. Dick Foran also croons a tune as the obligatory singing cowboy.<br><br>Lou Costello proved he could ride a runaway torpedo in 1941's \"Keep 'Em Flying\"; here he does the same on a stampeding bronco, with Bud along for the ride. The film also offers some of the same sight gags found in Warner Brothers cartoons of the era, notably Lou's having his \"palm re(a)d\" in a dream sequence dominated by Indians.<br><br>\"Ride 'em Cowboy\" gallops along at a fairly quick eighty six minute run, a lot of it at a frenetic pace. Abbott and Costello fans will enjoy their favorites here, as the boys show they can be at home in any setting.","user":"classicsoncall","rank":[9,10]}]