[{"title":"Orpheus Descending","rating":8,"date":"29 December 2017","review":"Based on the play \"Orpheus Descending\" by Tennessee Williams directed by Sidney Lumet with an exceptional cast: Marlon Brando, Anna Magnani, Joanne Woodward, Maureen Stapleton and Victor Jory. I saw it for the first time when I was still in my teens and I had an opaque, sticky memory of the film so when somebody suggested to see it on DVD I knew we were in for an opaque, sticky evening but, as it happens, I was dead wrong. \"The Fugitive Kind\" is riveting with an opening monologue by Brando that is astonishing. A 1960 Brando when he had still, I imagine. hopes to be the actor, the man he wanted to be. There is an animal innocence in his eyes in his moves. The magnificent Magnani, who learned her lines phonetically because she didn't know English presented Brando with a challenge as an actress and as a woman. I hear it wasn't pretty but the result is a feast for the eyes and the ears. The film may not be perfect but I don't think the original material was either so what we got here is a unique opportunity to see this enormous artists giving their whole. That alone makes it a collectors item.","user":"pauletterich-la","rank":[35,37]},{"title":"not Williams, Lumet, or Brando's best, but it's still pretty damn good!","rating":8,"date":"14 November 2007","review":"The Fugitive Kind is a hot story of desire and loss and craving and heartbreak between a man and two women set in the deep south. Sounds like quintessential Tenessee Williams, and it is in spurts. Sometimes Williams leans towards being a little preachy, however true (little moments like when Brando and Stapleton have a quiet back and forth about racism via her painting kind of nails it on the head much), but it's his skills at doing melodrama that strike up the coolest beats. In fact, this is one of those super-cool movies of the late 50s that could have only starred someone like Brando, who looks at times disinterested in the scene but at the same time completely engaged, curious, smooth, harsh, and knowing of what life can bring with his trusty Ledbelly-signed guitar. It's not necessarily a towering work for the ages ala Williams collaboration 1 Streetcar Named Desire. But that doesn't mean it should be much under-looked either.<br><br>As an early effort for Lumet it's also a scorcher dramatically; he's so good with the actors that whatever little missteps the script might take in pouring on the poetic prose in how some of the characters talk (there's a scene between Brando and Anna Magnani's characters by some ruin of a spot where she says people used to make love that is actually quite boring) can be usually forgiven. Magnani especially is interesting because she should be a case of miscasting, which, apparently in later years, Lumet admitted to. She seems low-key at first, but her strengths bloom out tenfold when it comes time to act like the hard-knock-life kind of woman she is, who's in a crap marriage and had a horrible affair with a man who didn't do anything after the summer they spent together. Now she's put into a situation where she does and doesn't want this drifter, and vice versa, and she's sometimes just as cool (though also quite tough and demanding in that big Italian mama way) as her counterpart.<br><br>Meanwhile there's also Joanne Woodard, who has the kind of part many actresses love to chew on; feisty, outspoken, loud but also emotionally moody to the point that she admirably tries (and doesn't quite get to) the heights of Vivien Leigh with her classic Blanche Dubois. Overall, Lumet gets a good feel for the period- and shot in New York state no less- while working with good material and an even better cast. It won't ever be as revered as his other work, and at the same time it's much better than some would give it credit for, where the tragedy acts like another sweaty Southern caricature bemoaning existence and fitting on a bad pair of shoes.","user":"Quinoa1984","rank":[34,39]},{"title":"Extremely poignant and captivating!","rating":9,"date":"28 August 2000","review":"Tennessee Williams was a stunning writer for the theater... The impact of his plays can overwhelm an audience with its superior force...<br><br>Written in 1957, \"Orpheus Descending\" is a reconstruction of Williams' 1940 \"Battle of Angels,\" filmed under Sidney Lumet's direction as \"The Fugitive Kind.\"<br><br>Williams subtracted elements of the ancient myth of Orpheus and Euridice to examine the sadistically patriarchal Southern Gothic town and to create a violent plot, involving ruined love, weakness, sex, betrayal, vengeance and lingering hatreds... \"Orpheus Descending\" shows how social prejudice threatens the lives of identified outsiders...<br><br>This classic play is not quite his masterpiece... \"A Streetcar Named Desire\" is... It lacks some of the regretful charm of \"The Glass Menagerie\" and the entire impact of \"Cat On a Hot Tin Roof.\" Nevertheless it is a deeply moving work of art...<br><br>Williams was known for his compelling dialog and themes that - for their time - often seemed strange or shocking... He vividly suggested the sexual tensions and prevented violence of his tormented character, usually with compassion as well as irony...<br><br>The film focuses on a handsome drifter from New Orleans, named Val Xavier, wearing a snake skin jacket - Williams' trademark of a rebel, non-conformist - Val is a \"fugitive kind\" who comes in off the highway... He is a rural Orpheus who descends to rescue his love, not in Hades precisely, but among the intrigue, chatter, and violence of the hot-tempered town of Two Rivers, Mississippi... He is a wandering guitar player who embarks on an affair with a lonely frustrated unhappy storekeeper's wife Lady Torrance...<br><br>Anna Magnani is intelligently sensual and charming as Lady... Joanne Woodward is the hungry grotesque drunken Carol who tries to seduce Val in a cemetery... Both women are so intense, that they force you to become involved with them...<br><br>The genuine community provides also interesting watching: Victor Jory, positively magnetic as the brutal oppressive husband Jabe Torrence; the vindictive sheriff R. G. Armstrong; and the soft-hearted Vee (Maureen Stapleton).<br><br>Lady Torrence is a study of the immigrant woman who has acquired a patina of resilient toughness but who slowly admits her sensuality... She catches perfectly contradictory emotions of one who is wary of the stranger but who longs for his healing touch...<br><br>With handsome magnetism, Brando is no less compelling... He is quite convincing avoiding all the clichés of the drifting Don Juan... With some kind of lucid intensity, he mixes his character's predatory and uncivil arrogance with flashes of sweet tenderness...<br><br>The film (definitely worth seeing) is extremely poignant and captivating... The direction is excellent and the action moves very smoothly, never allowing you to relax...","user":"Nazi_Fighter_David","rank":[77,95]}]