[{"title":"I am adopting cats.....yesterday!","rating":10,"date":"17 March 2009","review":"I give this one a ten. How? Well, if you love rats, you will hate me. Let me just start off by saying I have never written a public comment, so do be gentle. I am also rather desensitized to horror films. Salo, Irreversible, and others I am ashamed to mention, hardly phase me. I've seen other rat films. Older rat films, and new ones haven't bothered me. I had purchased this film with about 20 others, and it looked silly, was inexpensive, so why not? I find myself awake this morning at 4:30 am, and in need of mild entertainment. Here is where my horrific morning begins. <br><br>I am a 24 year old female, so to all you guys reading this, never show a woman this movie. Show her Cannibal Holocaust, not this. I slap in my DVD of this film, pull my covers back and wait for 90 minutes to pass. 10 minutes later I am screaming like a wild woman being attacked by the Texas Chainsaw Massacre. This movie is INSANE! I own 1000 horror movies, and I thought I had built up enough tolerance and desensitization to endure any form of human torture. Wrong! This is one evil, hideous, demon possessed rat. By the time an hour had passed I was clutching on to my baseball bat, and wouldn't you know? A shadow from my ceiling fan caused a sharp movement on the floor., and I was running down my hall in a terrified frenzy. It may be that girls like me just can't cope with a rat, but it might just be that this movie is hell bent on preying on everyone's natural dislike for these foul little beasts. I sat and hoped that WHAT I KNEW WOULD HAPPENwould not. It did. I was so happy when this movie was over, but ever happier I gave it a chance. It is rare I feel fear, and this was a great reminder. It isn't Citizen Kane, sure, but it is more entertaining. It is my worst fear, realized. Except for that whole broom in girlie prison thing. I digress. <br><br>I know you guys are tough! I know you ARE THE MAN! BUT! If you can make it through this movie without jumping in your seat, well, you should join the Navy Seals. Or better yet.you would make a great executioner. This is a nerve wrecking modern spin on MAN VS. MONSTER. No kidding! <br><br>This movie gets a ten from me. After sitting through 1000 movies that people say are scary, I find this fabulous little gem, and come to realize just why I love horror. This is horror. Nobody gets tortured, raped, or beheaded. That is fine, considering how brilliantly the film makers took a simple fear and found a way to torture the audience, and not one lesbian bimbo vampire was skinned alive. I was impressed. <br><br>I wish I was so well versed and I could give you the most complex analysis of the technical specifics. I am not. Peter did a great job in being convincing, and some of the camera work is great I think. The camera often acts as the eyes of this evil monstrosity. The mans wife in this movie is really pretty, and you see her boobs. So, you guys might like that if nothing else. I think the film was very well done, and most effective at making it's point. I would tell you all about the shocks, but that would ruin them for you. Some must be seen to be believed.<br><br>I'm a girlie girl, sure. I bet you can't make it through this movie, in the dark, without your baseball bat either. If you are on the fence and wondering if you want to give it go, do it. But, remember, it can bring out your feminine side. Isn't that the definition of scary for you boys? <br><br>Either way, for my own sanity,I am adopting a cat today.","user":"BeautyAddiction101","rank":[40,47]},{"title":"Humour and irony make it good","rating":6,"date":"26 February 1999","review":"Frankly, I was surprised to know that this movie was directed by George Cosmatos, the creator of such action films as Rambo-2 and Cobra. `Of Unknown Origin' is an absolutely different one. I found it interesting and amusing. It has everything that every good horror film should have  the spirit of suspense. Of course, Peter Weller acts very convincing. I think the movie wouldn't have its strange and surrealistic atmosphere without his talent of acting. The most remarkable episodes include one with Weller talking about the problem of rats in the US during the dinner with his boss. But as a whole I would say that what makes `Of Unknown Origin' a good movie is humour and irony, which one can easily trace from the beginning till the end. I would recommend this film for those who like horror movies not only because of special effects.","user":"casso","rank":[20,22]},{"title":"Peter Weller's almost one man show","rating":8,"date":"2 April 2006","review":"Though I don't really consider it a horror film, if you are one of many who happens to be afraid of rodents this film will terrify you. Hell, even you you don't mind rodents it might freak you out a bit. Peter Weller is always a great actor, and he stars in this film as Bart, a man who wages an all out war with one hell of an angry rat while the rest of his life begins to fall apart because of it. He is the only leading actor in this film, and he carries it almost completely on his own. His dinner table speech about the dangers of rats was both hilarious and a bit unnerving at the same time. I liked how this film was almost self-mocking in parts, though it always kept a straight face about it and never went to far. The rat's point of view shots really show this. The scenes with the rat were all very well done, congrats to whoever trained the rat. The plot was very original, and I liked how smart the rat was. Always a couple steps ahead of poor ol' Bart. I think I jumped a foot when the damn thing came out of the toilet. Last but not least, that was one heck of a bat he made near the end! Overall, this is a great film. Admittedly it's a bit cheesy in places, but it knows what it is and handles itself very well. Highly recommended.<br><br>8.5/10","user":"Vampenguin","rank":[19,21]}]