[{"title":"The Real Seattle Sound","rating":10,"date":"24 July 2000","review":"Written and directed by Steve Kloves, `The Fabulous Baker Boys' is a tale of music and brotherly love set in Seattle.  The Baker boys are Jack and Frank (real life brothers Jeff and Beau Bridges), who eke out a living playing piano together at various venues throughout the Emerald City, a basic lounge act they've been doing for fifteen years.  Frank is the responsible one, because he has to be; he has a wife, kids and a home in the suburbs.  He manages their business, secures the bookings and is content to stick with a formula that works.  For him, it's not about the music, it's about keeping food on the table for those who depend on him.  Jack, on the other hand, is unattached and could care less about the business end of the partnership.  As long as it affords him a modicum of security as well as dignity, he is more than willing to just go along for the ride. <br><br>\tFor Jack, though, underneath it all, it is about the music; it's about jazz.  On off nights he will steal away alone to some small club to play, and deep down inside he knows that this is not only what he really wants, but needs.  And he knows he could be great, if only he'd let himself go. The trouble is, he's been with Frank his whole life, and as long as the act is working he just can't make the break.  Unless something happens, his dreams are destined to remain suppressed and unrealized. \tIt is only when one of their regular clubs balks at rescheduling them that the brothers begin to realize that perhaps their act is getting a bit stale. So they decide to try adding a singer to the act.  After a memorable scene in which a number of young hopefuls are auditioned, Suzie Diamond (Michelle Pfeiffer) enters their life.  She joins the act on a trial basis, and after an amusing and somewhat tentative beginning, infuses it with new life, though Frank continues to adamantly resist too much of a departure from their original show.  (`Does anyone really want to hear Feelings' again?' she asks him at one point).  Ultimately, however, Suzie becomes the impetus for change that Jack has needed all along, and the stage is set for the decisive moment, which comes when the dignity of the brothers is compromised due to an incident on Frank's part of uncharacteristic carelessness.  When Jack tells Frank, `We've never been clowns before' you know exactly how deep it has cut. \tKloves has fashioned an entertaining study of relationships, change, and the effects of complacent loyalty and self-denial; and the importance of following your own heart.  When Jack sits down alone at the piano in that smoke-filled club, we know that this is where he is meant to be.  Filmed on location in and around Seattle, with a terrific score by Dave Grusin,a supporting cast that includes Jennifer Tilly (Monica) and Ellie Raab (Nina), and a classic scene in which Suzie Diamond croons `Makin' Whoopee' atop a piano, `The Fabulous Baker Boys' is an absolute gem you do not want to miss. I rate this one 10/10.","user":"jhclues","rank":[83,86]},{"title":"A singer changes a brothers' music team and their relationship","rating":9,"date":"11 December 2007","review":"Jeff Bridges and Beau Bridges are \"The Fabulous Baker Boys\" in this 1989 film also starring Michelle Pfeiffer. The Baker Boys have been playing dual pianos on the lounge circuit for years, with Frank (Beau) acting as the booking manager and accountant. When the bookings dry up, the brothers decide to hire a singer. She's Susie Diamond, a gorgeous blond with a sultry voice and sexy appearance that gives the Baker Boys the pizazz that they need to pick up better gigs and more of them. Of course, one can't wait for the handsome, quietly intense Jack (Jeff) and Susie to give into their sexual chemistry, despite Frank's warnings that Jack's hit and run technique will not work with a teammate. When Frank is called away on a family emergency, more than sex happens. Ultimately Susie's bluntness and ability to see a situation for what it is makes Jack realize he hates the act, hates the way his brother handles it, and hates himself for not pursuing work as a jazz musician.<br><br>Someone wrote that the plot is thin - not really. The sibling dynamics are real, pent up, and the product of years of lip-biting, Jack becoming more and more introverted and Frank more desperate to work so he can support his family. It takes an outsider to bring tempers to a boil.<br><br>The film is very well done, with great music throughout, including some very hot singing by Pfeiffer. The highlight of the movie is Pfeiffer rolling around on the piano as she sings to Jack. She's really at the height of her beauty and can compare favorably to any Hollywood goddess of the past. Her performance as a street-wise singer who's had it tough is excellent, right down to the chewing gum and the crystal jewelry. Beau Bridges is perfectly cast. He plays a working musician for whom music is a job - and yet he's proud of the act, insistent on having \"Feelings\" in every show they do, and likes songs like \"Bali Hai.\" Then we come to Jeff Bridges, certainly one of the sexiest men to ever come down the pike - tall and handsome, he is the essence of true jazz musician here - passionate on the piano, cool, loving the night life and the attendant bad habits of drinking and smoking. He's all tied up in his inability to break free of his brother, and it's expressed in every non-expression, every puff of his cigarette. He's fantastic.<br><br>Another reviewer on this site stated that non-musicians probably can't understand Jack's frustration about the music. It's true, I'm a trained musician and related to his crisis immediately. But I think many people are in jobs they don't like, many people have a book they never finished because the kids came along - I think this is a very appealing story.<br><br>I remember this film getting a big build-up when it was released, but many people on IMDb feel it's underrated. I didn't realize it was, but if it is, it shouldn't be. What a movie - a strange kind of a love story for sure, between a man and his music, but a love story nevertheless.","user":"blanche-2","rank":[18,18]},{"title":"It's not getting any better than this","rating":10,"date":"18 March 2005","review":"TFBB is such a terrific movie, you feel like a child in a toy store wanting to tell it all. Everything in this story falls into place, the pace is great, the acting is brilliant and yet it's in the details that one discovers the masterpiece. There's the audition scene, the little story about the sick dog and the girl from next door to show you Jeff Bridges does care, the introductions by Beau as they perform in their special place, The Starfire Lounge and then repeats the same line in another cocktail bar, the bathroom scenes in the hotel they do their Festive season gig (quite different what you might have expected from a bathroom scene between Michelle Pfeiffer and Jeff Bridges !), the dog leaving the elevator in the hotel on his own to join his boss who is playing alone, his kind of music. This movie gets better with repeated viewings, so buy it instead of renting it.It's a mystery to me why Steve Kloves did not make more films and instead waited to become a scriptwriter for the Harry Potter films more than 10 years later.","user":"jéwé","rank":[41,44]}]