[{"title":"Better than feared","rating":6,"date":"10 April 2020","review":"\"Der Schnüffler\" tells the story of a harmless taxi driver who finds himself right in the middle of a political scandal, threatened from all sides and in permanent danger.<br><br>I didn't expect much from this title but have to admit that it is actually an enjoyable film. Not to be mistaken, the humor is very slapstick and shrill but at least the plot itself is clever enough to make for an interesting story. The plot is actually not far away from \"Burn after reading\" but the style is a lot more openly comedic, which is a bit much at times but at least consequently carried out.<br><br>All in all not a masterpiece but a fairly decent comedy that has some nice aspects but tends to exaggerate in terms of humor.","user":"blumdeluxe","rank":[0,0]},{"title":"TAKE A DEEP BREATH, IT IS ONE OF THOSE","rating":4,"date":"18 May 1999","review":"Another one of those failing Hallervorden vehicles. It is probably meant as a parody on West-East spy films (at least the design of the credits lets one think so), but the result is no more than a series of self-repeating, tedious and childish jokes. Hallervorden's character gets his strength from inhaling nail-varnish, something I also tried to sit this one out.","user":"J. Steed","rank":[3,16]},{"title":"Hallervorden for the most distinguished audience? Not really.","rating":4,"date":"25 August 2016","review":"\"Der Schnüffler\" or \"Non Stop Trouble with Spies\" is a West German live action movie from 1983, so this one will have its 35th anniversary soon. It is among the most known works by director Ottokar Runze (over 90 years of age already) and the writers Rateuke/Schmige worked on other Hallervorden films as well. This one here runs for approximately 90 minutes and I already mentioned the name of lead actor Didi Hallervorden, who is pretty well-known today. I am not familiar with female lead actress Catherine Alric and the only other cast member I know is Tilo Prückner, who has been a successful and prolific actor for decades now. This one here is a bit more adult-oriented than most other Hallervorden comedies. You see female breasts and there is a decent deal of shooting stabbing, blood and murder in here, which makes it slightly darker than what Mr. Palim Palim usually did. Fittingly, only people from the age of 12 upwards are allowed to see it. Sadly, story-wise this is not an experiment gone right. All the dramatic moments felt fairly forgettable and I never could take it seriously as a thriller or crime movie. I do believe that Hallervorden has talent in this area too as he has shown us in \"Das Millionenspiel\", but together with his pretty childish (not meant negatively) approach to comedy, it just doesn't fit at all. Alric also added very little in terms of performance and the ending almost made it look like a pretty weak Bond parody (it was probably intended that way without the \"very weak\"). As a whole, these 1.5 hours are nowhere near the 1980s had to offer in terms of German cinema and Hallervorden has done better on many occasions too. It is very rare that I don't find him convincing as an actor, but here it felt that way occasionally. Maybe he was not the best choice for the character. Main language is of course German as the title already suggests and not Russian as stated on IMDb. I give this one a thumbs-down. Not much was working in the film#s favor here and especially not the political references. Watch something else instead.","user":"Horst_In_Translation","rank":[1,4]}]