[{"title":"Magical Misty Tour de force","rating":9,"date":"25 December 2004","review":"I first saw this when about 10 years old, it made little impression on me then, probably because I couldn't hope to appreciate it or understand it all when so young. Next time I was 25 and was bowled over by its imagery, and as I've got older come to appreciate it more and more.<br><br>So much for watching it through a child's eyes and accepting the fantasy at face value! At the beginning Cocteau states \"Once upon a time...\", but really for discerning adult cineastes (and/or poets) to drop their guards and enjoy it for what it was - a magical filmic fantasy. It's uniformly marvellous in all departments, direction, photography, acting, music, design, and Cocteau trotted out all his favourite cinematic tricks - just part of the sequence between Blood of a Poet in '30 and Testament of Orphee in '61. The script was suitably steeped in non sequiteurs and puzzles to add to the heaviness of it all. Er, not that it matters but what happened to Ludovic?<br><br>The wonderful dark brooding smoky atmosphere is the most important aspect though - there are few films I've seen with such a powerful cinematic atmosphere, Reinhardt's Midsummer Night's Dream is one and Dead of Night another etc. But the romantic melancholic atmosphere here was something ... incredible. It was only possible with black and white nitrate film stock to capture such gleaming, glistening and time- and place-evoking moving images - it hasn't been quite the same since 1950 with safety film in use.<br><br>If you're an adult about to give it your first (let yourself) go, I envy thee! All in all a lovely inconsequential fantasy, make what erudite and informative allegorical allusions you will.","user":"Spondonman","rank":[62,71]},{"title":"Visually stunning","rating":23,"date":"23 October 2000","review":"When special effects anthologies are shown \"Metropolis\" is called the grandfather of film FX, \"2001\" is the son and \"Star Wars\" is the grandson. Invariably the French are forgotten.   This is shameful, since the French were truly the masters of FX or \"trick\" shots.  Following my analogy, Cocteau was the heir apparent of Melies.<br><br>\"Beauty and the Beast\" not only beautifully re-tells a beautiful story, but powerfully displays the Beast's magic.   Cocteau's genius is that he makes simple editing techniques look like art and in this movie like the combination of art and magic.  Watch what happens when Beauty gives one of her sisters a present from the Beast's castle which the Beast meant only for Beauty.<br><br>The version I saw was in French with English subtitles, but the visuals, in glorious black and white, are so stunning, you could almost cover up the subtitles and still understand what's going on.<br><br>I can't recommend this movie enough!  It is #1 on my foreign film list.","user":"Kinch417","rank":[41,48]},{"title":"A Great Freudian Fable","rating":10,"date":"12 March 2008","review":"To a degree of success few films have ever achieved, Jean Cocteau's Beauty and the Beast (1946) balances film's opposite yet equal capacities to record life as it is and to create completely imaginary landscapes via editing and optical effects. Most Cocteau films veer heavily toward the fantastic, the mythic, the poetic, or the surrealistic, but in Beauty he rendered a mise en scene based largely on 18th century Dutch painting, employed an invisible camera and editing style, and relied on conventional storytelling techniques in order to make his retelling of the classic fairy tale as realistic as possible. Nevertheless, Beauty and the Beast is primarily noted as among the most successful adaptations of a fairy tale ever made and one of the greatest fantasy films of any type. And this is true despite Cocteau's enormous handicap of working in a recently war-ravaged country with minimal financial and technical resources.<br><br>One influential and provocative interpretative approach to Beauty and the Beast is through Freudian psychology. From this perspective, Beauty's story is a symbolic sexual drama in which a young woman breaks free from a psychologically incestuous relationship with her father (and brother?), overcomes her fear of male sexuality and of her own, and ultimately enters mature womanhood.<br><br>Strong evidence to support this interpretation can be found in the framing of the film's opening and closing scenes. In the film's opening scene Belle's suitor, Avenant, shoots a (phallic) arrow that misses its ostensible target and enters a ladies-only bedchamber where it lands across the mirror image of Belle on the floor she is polishing. Uninvited, Avenant invades the bedchamber, retrieves the arrow, and uses it to embrace/restrain Belle. He then proposes marriage, and - when he is denied - forces his attention on Belle with something close to physical assault. From a Freudian perspective, Avenant represents the unleashed libido that Belle is not psychologically or culturally prepared to confront directly.<br><br>Avenant, in turn, receives his just comeuppance in the film's final scene when he is slain by an arrow from the bow of Diana, protector of chastity and the presiding goddess in the Beast's garden pavilion. Entry to this pavilion (female sexual nature), is permissible only by using a golden key, dominion over which the Beast has chivalrously granted to Belle. (i.e. the woman says when) Yet with the aid of Belle's evil and duplicitous older sisters, Avenant comes into false possession of the golden key. This alone would negate the legitimacy of his entry to the pavilion, but he decides to enter even more illicitly by smashing the hymen-like glass portal hidden on the building's roof, thus prompting his ironic execution via the same phallic symbol with which his pursuit of Belle had begun.<br><br>This framing symmetry of two spatial \"violations\" in the opening and closing scenes of the film is not accidental. It underlines the difference between the Beast's tempered, courtly masculinity and Avenant's unrestrained ego and desire. The film ends not only with the Beast's transformation into the handsome prince thanks to Belle's loving gaze, but also with the transformation of Avenant into the guise of the beast, a physical manifestation of his unrestrained inner animal. That Avenant, the Beast, and the Prince are played by the same actor suggests their Freudian interplay of id, superego, and ego - which Belle is also working out in feminine terms as she resists and then accepts the journey from her father's house, through the Beast's castle, and on to her married royal destiny.<br><br>Many scenes throughout Beauty and the Beast acquire added depth through a Freudian approach. The cutting of the rose in the Beast's garden, for instance, can be seen as a symbolic violation that evokes the Beast and begins the liberation of Belle from bondage to her father and evil-sister Mother substitutes. Edited in jump cuts, the threshold scene when the Beast first carries Belle into her castle bedchamber depicts the repeated transformation of Belle's costume from servant/child to woman/bride, the very journey she must undertake as she leaves her \"maidenhood\" and her father's house and accepts her passage to adult female sexuality and maturity.<br><br>Belle's journey between the Merchant's house and the Beast's castle is facilitated by two decidedly Freudian symbols of masculine sexuality: the horse, Magnificent, and the Beast's hunting gloves, steaming with the blood and scent of his animal/masculine power. Indeed, the magic words that Belle must say to prompt Magnificent's gallop back to the castle indicate the psychological necessity of her journey: \"go where I am going! Go, go, go!\" The relatively more subtle symbol of the stallion as agent of transportation is later replaced by the glove which not only steams with the Beast's masculine power, but which she dons while reclined on the respective beds of her bed chambers in the Castle and the Merchant's house.<br><br>That Belle's journey of maturation must be undertaken, despite her reluctance, is most poignantly underscored in the scenes of Belle's return to the Merchant's house after she has lived for a while in the Beast's castle. In her father's house, she rapidly regresses to the physical and psychological bondage that had characterized her condition at the beginning of the film - only now the audience, if not Belle herself - is painfully aware of the arrested development it represents.<br><br>Like so many Greta Garbos, we want her out of the there and back with the Beast where she belongs!","user":"EThompsonUMD","rank":[34,40]}]