[{"title":"Custer deserves a more colorful script...and a better Custer...","rating":5,"date":"22 January 2007","review":"Handsome but dull western (courtesy of Spanish landscapes) to depict Custer on a mission to steal land from the Indians. A blond ROBERT SHAW looks convincing enough on horseback but something about his accent seems wrong and charisma is lacking. The Indians look more European than like American Indians and too many of the action scenes are slow paced and repetitive as Custer and his men go on various missions.<br><br>MARY URE as his wife, Libby, has little to do but register impatience with being kept in the background between battles with long waits before she shares the screen with real-life hubby, ROBERT SHAW. A more mature looking JEFFREY HUNTER (sporting gray hairs) is Will Benteen, one of Custer's more loyal officers.<br><br>The mountainous plains in Spain are no substitute for our standard glimpses of John Ford territory with not a single shot looking as though photographed in the American West. But it's the dull storyline that defeats the movie from ever becoming anything more than a series of handsomely photographed outdoor sequences. A surprise Indian attack by the Cheyennes on an Indepdence Day Celebration is one of the more colorful moments and triggers Custer's determination to fight the redskins, no matter that they greatly outnumber his men.<br><br>Nothing in Shaw's performance suggests the color and vigor of Custer's bigger than life personality nor does the screenplay do any real justice to the man or the myth. As storytelling goes, the first half of the film manages to be just plain dull and the film only picks up speed as it nears the climactic fight at Little Big Horn.<br><br>Battle skirmishes with Indians are, on the whole, well staged and full of furious gunsmoke and flying arrows--but the big set piece is saved, of course, for the finale which comes too late to save the first half of the film from the doldrums. One is left with the impression that some inventive fictionalizing would have helped (as it did with THEY DIED WITH THEIR BOOTS ON).<br><br>Summing up: A very miscast Shaw plays Custer as a snarling villain who barks orders and the story has a plodding script. Could have been much more impressive if filmed in the U.S. on more realistic locales with more accurate casting. A cameo by ROBERT RYAN is no help at all.","user":"Doylenf","rank":[11,13]},{"title":"Pure Invention","rating":6,"date":"14 June 2003","review":"I`ve got to disagree with some of the comments on this page about Robert Shaw`s accent . It may not sound American but in no way does it sound English . It sounds to my ears as a sort of bastardised Irish and this may well be accurate for the period . Consider the accents for GANGS OF NEW YORK where Martin Scorsese came to the correct conclusion that Americans didn`t speak with the same accent in the mid 19th Century as they do now and so invented a slightly different accent for the American born characters . Perhaps it`s the American actors in CUSTER OF THE WEST who have got their characters accents wrong ?<br><br>!!!!! SPOILERS !!!!!<br><br>But I do agree that much of this film is totally inaccurate when it comes to the historical parts of this alleged biopic . I admit to knowing very little about the wild west but much of what is seen here doesn`t ring true . Custer whips his men into shape by running them around the fort . It`s possible this may have happened but to have Custer as the last man standing strains all credibility especially when a trooper doing something physically light like beating a drum collapses . Are we to believe a man running up flights of stairs all day is less likely to become exausted than a man beating a drum ? Did injun war parties really wipe out whole towns as seen here during the Indian wars ? I`ve no idea  but I do know enough about American history to comment that the Battle of Little Bighorn didn`t happen like it was portrayed here . No matter how often Hollywood tries to rewrite history it can`t change the fact that George Armstrong Custer died early in the battle , he did not as shown here remain the last man standing . Even more insulting is the suggestion that the Indian chief gave Custer the chance to walk away from the battle , a choice Custer refused in order to die a heroic death . This is more fabrication on the part of Hollywood producers.<br><br>There are some good points about the film . Despite being somewhat intrusive Bernardo Segall`s score is very good and I remember from my childhood the haunting scene of the calvary Sgt escaping down the logging trough only to be killed by Indians waiting to ambush a train . But CUSTER OF THE WEST isn`t really a film that will appeal to people who hate westerns while western fans will become very irritated by the artistic license employed","user":"Theo Robertson","rank":[10,12]},{"title":"Movie Re-writes History, Poorly...","rating":25,"date":"25 January 2002","review":"I'll make this short and sweet, on second thought, I'll try to! For anyone who has studied history and even scanned a chapter about Custer, could tell that this story line seemed to be made-up as it went along. I have watched this movie only once, and that was more than enough. I understand Hollywoods need to add to, or change charactors or situations to sell a movie. BUT, when they feel the need to give Gen. Armstrong Custer an english accent, Wow!!! Flags went up as soon as he spoke. Ok, ok, overlook that. The thing that gets me the most is the way this movie seems to change the man, to what (I Guess) they wish he was. That too can be overlooked. But, when you change history around to such extremes as, lets pick on the Battle of the Little Big Horn. The way it is acted out is not only corny, but totally oblivious to the truth. The movie has Custer confronting the Indians right before the battle, (According to both versions{The Indians &amp; The Whites} of history, HE DIDN'T).In the movie he didn't flee up the hill(as he did inreal life), away from the village,  then finally dismount at almost the top of a hill, surrounded, there to die, and where some mutilations took place.Custer, being the last man standing(YEA, RIGHT!), gets an offer from the chief to let him go, (There was no, I repeat NO SUCH OFFER!) as there was in the movie. Enough you say, there had to be some good. Robert Ryan, in his, much to small a part, was, as usual top notch. However, the story being sooo far fetched ruined it for me. MY RATING: For the valid attept to make a movie,I give 1 Star, Add 1 Star for some decent Charactor Actors, &amp; add 2 for Robert Ryans far too few moments. But, I have to subtract 1 just becaus they thought we wouldn't notice the english accent. 3 Out of 10 STARS","user":"BALLARDITE","rank":[27,39]}]