[{"title":"THE Horror Movie of the 70's","rating":9,"date":"31 December 1998","review":"And it took a TV movie to achieve this feat.  But there's no denying the powerful intersection of screen writer Richard Matheson, producer Dan Curtis, and Darren McGavin in perhaps his best role (after A Christmas Story).  Ably assisted by Jeff Rice's original novel, Night Stalker works on every level.  The humor is there, but a bit subdued.  The vampire is a feral beast who is strong, invulnerable, and drinks blood...and that's it.  No lame transformations into a bat:  The script's portrayal of Skorzeny the Vampire echoes that of Christopher Lee (Hammer also resisted displaying much of Dracula's superhuman abilities).<br><br>Skorzeny has none of the sexuality or personality of Dracula, but in a sense the movie isn't about him even if he's the \"Stalker\" of the title.  It's a movie about Carl Kolchak, reporter and undeterred seeker of truth.  He could be stalking a story about corrupt politicians, or mobsters, or whatever. The only difference is here, he's after a vampire.  This extra supernatural element rises it above what few dramatic reporter-featured movies there are out there.","user":"Gislef","rank":[31,32]},{"title":"One Heck of a Movie","rating":10,"date":"12 July 2000","review":"Item - Take one modern setting such a Las Vegas and tell a story of vampirism set there. Item - Add one eccentric, cynical reporter out for a good story with a great personality. Item - Add supporting characters that are interesting. Item - Add a fine cast headed by Darren McGavin as the relentless reporter Carl Kolchak. and  Simon Oakland as the head of the newspaper Kolchak works for.  Also add great supporting stars such as Barry Atwater, Larry Linville, and Claude Akins. Item - Have one of the kings of horror fiction...Richard Mathseon write a script based on the excellent novel by Jeff Rice. Item - Add the final ingredient of artful direction and you have one great movie that was made for television and that spawned a sequel and a television series on the title character. The Night Stalker is easily one of the best horror films ever made and certainly one of the best ever produced for television.","user":"BaronBl00d","rank":[36,38]},{"title":"One of the best made-for-TV movies ever","rating":10,"date":"14 September 2000","review":"The 1970s produced a large volume of made-for-TV movies, and, unlike today, they did not have to be about relevant social topics or preach political correctness. Back then, TV movies could actually be made with no intent other than to entertain--what a decade!<br><br>The Night Stalker is one of the very best of these made-for-TV films. Be warned, the production values are not as good as a feature film, but the story, the writing, the acting, and the director's mastery of creepiness make up for any other faults. From McGavin on down the line, the acting is terrific! In fact, Carl Kolchak may be McGavin's finest role. Richard Matheson's writing is up to his usual standards of excellence. Barry Atwater is a great bit of casting as the vampire. If there is one fault, and it has to be laid at the feet of the director, it is the inept use of a stunt man as a substitute for Atwater during the action scenes. In some scenes it is painfully obvious that it is not Atwater; it's a wonder the scenes weren't clipped. But this is the price that is paid for a TV movie with a short shooting schedule. As a whole, The Night Stalker is one of the very best vampire movies ever made. Don't let a few faults deter you from an otherwise classic bit of horror film-making. Remember, this is a TV movie; if you want lots of gore, don't waste your time.","user":"mr. sardonicus","rank":[46,50]}]