[{"title":"\"If a man gives you freedom, it is not freedom. Freedom is something you take for yourself.\"","rating":7,"date":"15 September 2008","review":"Marlon Brando's involvement in the making of \"Burn\" came about directly as the result of his politician idealism and his desire to make films with a comment on the human situation In 1968 he was deeply concerned in supporting civil rights causes, particularly those to have reference to black and Indian conditions, and, according to his friends, he was greatly disturbed and depressed by the assassination of Robert Kennedy and Martin Luther King <br><br>\"Burn\" begins in 1845 as Sir William Walker (Brando) arrives on the island of Queimada, truly as far as can be judged as a harmless traveler but actually an agent of the British government ordered to incite a revolution that will shatter the Portuguese control on the island and permit the British to put their hand on the valuable sugar-cane total product Queimada has a population of two hundred thousand, of whom only five thousand are EuropeansThe main town is a well-protected port with a fort and a garrison, a governor's palace, a cathedral, a bank, a hotel and a brothel <br><br>The English gentleman recognizes he must play the part of a political Pygmalion He looks around for a suitable subject to train as a revolutionary and he selects José Dolores (Evaristo Marquez), a large, handsome black dock-worker with an air of confidence Walker also recruits Teddy Sanchez (Renato Salvatori), an almost-white clerk with political ambitions Walker persuades José Dolores to steal the bank of the island, and once he does, Walker reveals his name to the government, thereby turning Dolores into a hunted bandit The ingenious Walker then teaches Dolores and his followers in the use of firearms and gradually absorbs in them ideas and feelings to overthrow the Portuguese government <br><br>The film is quite obviously political in tone, and is a passionate piece of propaganda in the anti-colonial struggle Brando's interpretation of Sir William Walker is apt to call up memories of his Fletcher Christian This is another Englishman, whose gentle speech and soft manners disguise with courage and determinationWalker is not a villain but a cold, inflexible pragmatist with a hard work to accomplish","user":"Nazi_Fighter_David","rank":[34,38]},{"title":"An intelligent action filled political thriller.","rating":10,"date":"15 October 1998","review":"One of the most under-rated films of all time. Marlon Brando is at his best playing the cool, witty Sir William Walker. The film is taut and fast paced. Add to this an intelligent script and beautiful scenery as well as an ironic political story and you have an excellent film. Brando carries the film in his portrayal of Sir William Walker, who is ready to play either side of the political struggle to satisfy his government's (Great Britain) needs. He is equally at ease with the rich upper class plantation owners as with the slave sugar cane cutters allowing him to take advantage of both. Where the film triumphs is in its ironic showing of how colonial powers will stop at nothing to get what they want no matter what the cost. Are the islanders of Queimada any better off as an independent country but relying on the British for trade, or as a colony of Portugal? Hard to say. The sugar cane cutters are no better off that's for sure. The musical score by long time Sergio Leone contributor Ennio Morricone captures very well the senselessness of the revolution as well as the fact that the slaves are just pawns in a much larger and dangerous game.Apparently the actor who plays Jose Dolores was an illiterate sugar cane cutter and had never even seen a film. Even with this handicap, he still manages to give the heroic Jose an air of dignity. It is nice to see a film that does not accept that everything is all right in the world and that such a trivial thing as having sugar for our tea, can have life and death consequences for so many people. A film not to be missed.","user":"Alberto-7","rank":[38,47]},{"title":"A Complex Political Thriller","rating":9,"date":"9 May 1999","review":"Albert Oyahon (a previous review) seems to have said it all. This indeed is a deeply complex, gripping and deeply political film. For those who are used to simple moral tales it will seem confusing, uncomfortable even, but for those who relish the complexity of the human condition it is a challenging and thoughtful film. The number of truly outstanding political thrillers can be counted on the fingers of one hand (A Man For All Seasons and Z come to mind) but this ranks amongst the best. With the possible exception of On The Waterfront, it is difficult to think of a film in which Brando gave a better performance. He is outstanding as a complex political manipulator. The film also has qualities that arise only when different cultures (in this case Europe and The Americas) come together. To an intelligent filmgoer I cannot recommend this film too highly.","user":"Paul-250","rank":[31,39]}]