[{"title":"Interesting Shaw Bros horror flick - watch it for the last 15 mins.","rating":12,"date":"12 July 2011","review":"Hex follows an uneasy menage a trois in a traditional Chinese mansion where fear, paranoia, and violence consume everyone unfortunate enough to come near. \"Tanny\" Tien Ni plays Madam Chan, a woman dying of consumption. Her abusive alcoholic husband, Yeung, played by Wang Jung divides his time between drinking and abusing her and the help, which shortly consists of just Yi Wah (Chen Szu Chia), a newly-arrived family friend from the country. When murder comes to mind as a way out of this claustrophobic situation, the characters stir up more evil than they can cope with.<br><br>I've not seen Diabolique, which this film supposedly borrows heavily from, but I think that Hex owes a lot to the Hammer films of the 60s and 70s. Lonely house, check; interpersonal problems, check; plot twists, check check; little exposition bits done in voice-over, check check check! This film could do with 15-20 minutes being snipped out of it, and it relies on a lot of techniques that now look very hackneyed - the mirror there-but-not-there thing, the soundtrack bumps... Still, one of the final scenes - which it is no spoiler to say is a kind of exorcism - is weird, wonderful, erotic, creepy and very surprising. The penultimate scene is also genuinely quite disturbing. Tanny gives a good performance, as do the other two. For what is a pretty standard horror flick, a consistent message runs through the various twists and character developments: that fear and violence come from within as much as from without, and that vengeance is often too easily taken. Ultimately, no one can claim the moral high ground.<br><br>Overall, this is a flawed but interesting horror that saves its imagination for its last 15 minutes. It has been nicely restored by Celestial Pictures for their Shaw Bros rerelease programme.","user":"sccoverton","rank":[9,9]},{"title":"The last twenty minutes or so are quite sensational","rating":7,"date":"17 March 2017","review":"After about twenty minutes I was wondering if I was going to stay with this. We have an abusive husband bashing the maid and then when the sick wife interrupts, bashes her too. The he goes out drinking and comes back and does it all again. All with much screaming and shooting Cantonese style. Gradually, however, things change, we get to see a spooky pond, some wonderful interiors and a hint that something is going to happen. It does and there is just about enough in the various exotic scenes with all the potions and magic rituals to keep us engaged as things are gradually ramped up some more. The last twenty minutes or so are quite sensational. The naked witch dance is unbelievable and the subsequent naked calligraphy equally impressive. This is not the finest Hong Kong ghost mystery but it is certainly different and does have that final segment.","user":"christopher-underwood","rank":[6,6]},{"title":"Beautifully filmed period horror that starts off great but...","rating":6,"date":"29 March 2017","review":"Beautifully filmed period horror that starts off great but then some misplaced humor and bad practical effects conspire to almost completely destroy the mood. A few different plot twists, perhaps one too many, are added in an attempt to keep it all interesting and it mostly works.<br><br>That final plot twist, though...it left me confused initially, enough so that I wasn't sure I even wanted to figure out if or how it fit into the plot. After I ejected the disc it was still bugging me and I put it back in and did a quick review of the final 30 minutes. Glad I did; everything clicked into place.<br><br>There are those visually impressive scenes, both beautiful and creepy. Plus a naked exorcism dance/writhing scene that is so freakishly weird it has to be seen to be believed. What immediately follows that was pretty impressive as well.<br><br>Uneven film that, when all was said and done, I found to be worth the watch despite its flaws.","user":"Mike_Olson","rank":[5,5]}]