[{"title":"Melodramatic magic from the gods.","rating":9,"date":"3 October 1999","review":"There are some things in life I don't understand.  Applied mathematics. Bunions.  The working class persistantly voting conservative.  Frank Borzage languishing in critical limbo.  What is wrong with you people (I mean critics, not you, dear reader)?  It can't be because he made silly women's pictures, because Ophuls, Murnau, Sirk and Minnelli have all appeared in Top 100 lists in the last two decades.  I don't get it: Borzage was definitely a master: of light, space, plot, critique and emotion.  His films - of which I have only seen four, not for want of trying - are among the most emotionally intense and beautiful things in cinema.  They offer the straightforward weepie thrills we expect from melodrama, as well as an unexpected critical dimension.<br><br>Although I just about prefer the faded self-pity of THREE COMRADES, SEVENTH HEAVEN is probably his masterpiece.  It is astonishing in so many ways: let me list some.  The more I see of her, the more remarkable an actress I find Janet Gaynor.  The film's progressive politics - an impoverished victim, suicidal, prostituted, heinously whipped by her sister, transforms into a loving wife, fierce protector of her home, member of the workforce, and eventual carer of her husband - owes much to her all-encompassing performance.<br><br>The use of light and shade to represent the emotional life of the characters.  The (Americanised) Expressionistic use of space, which breaks up conventional point of view to provide varying levels of experience and ways of looking.  The deceptively delicate poetry of the imagery.  The tacit outrage at a system that forces people to live so badly.  Even the movie score, uniquely, shows an intelligent perception of what Borzage was trying to do.<br><br>Diane and Chico have many obstacles thrown in their way, both individually and collectively, but the most terrifying and inexorable is that of the war. It is quite shocking to find a melodrama - by its nature domestic, local, specific, small-scale and personal - erupt into a war film, that most national of crises.  The effect is wrenching, but no more so than the events of the melodrama which alternated the most radiant highs with the most despairing lows.  Witness the astonishing, jerking, tracking shot as Diane flees her sister, shattering the smooth rhythm of composition and editing.<br><br>Borzage, like no other director before Kubrick, is responsive to the farce of war, as well as its horror.  There are sublime scenes of comedy amidst the carnage.  The battle scenes put pretenders like ALL QUIET ON THE WESTERN FRONT to shame; the sheer scale and irrationality of war bursts the screen. Points of identification become lost, the tyranny of destruction is a perversely beautiful thing.  <br><br>It is in this context that the couple's transcendent love must be seen. What could have been as a desperately mushy romance with its talk of the Bon Dieu and heaven, becomes a necessary rebellion, a refusal to succumb to social pressures, war, nation's follies, domestic horrors, betrayal or death.  So the ending is not preposterous, but the perfectly comprehensible hallucination of a woman who, having been raised from hell, could not possibly leave heaven now.  Imperishable.","user":"alice liddell","rank":[56,64]},{"title":"Stairway to Happiness","rating":8,"date":"21 March 2003","review":"SEVENTH HEAVEN, released as 7th HEAVEN (Fox, 1927), directed by Frank Borzage, is a tender love story set in pre-World War I Paris that unites two unlikely people to become popular twosome of the silver screen, the pert and angelic Janet Gaynor and the tall but not-so-rugged Charles Farrell for the first of twelve movies they were to appear together.<br><br>Chico Robas (Charles Farrell) is a sewer worker in the streets of Paris whose ambition is to be promoted to street-cleaner. Although he is self-confident, he lacks religious faith, believing God has disappointed him to a point of becoming an atheist. Not far away is Diane (Janet Gaynor), a frightful young girl, is being abused by her vengeful sister, Nana (Gladys Brockwell), who pleasures herself by whipping the frightful thing for the slightest cause. When Nana feels she's been cheated out of living the life of luxury with her visiting rich uncle (Brandon Hurst) due to Diane's truthfulness to his questions of not actually being \"good girls,\" Nana grabs her whip and starts beating her as she runs out the door and into the streets. Lying in the gutter and in the process of being strangled, Chico comes to the girl's rescue, frightening Nana away. Shortly after-wards, Diane decides to take her own life with Chico's knife, but is soon stopped by him. When Diane is denounced to the police by Nana, Chico, once more comes to her defense, telling the law-abiding officer the waif is his wife. As the police intend on checking out his story, Chico, who now feels pity for the girl, invites her to staying his apartment, a seventh floor walk up flat which Diane soon calls, \"Seventh Heaven.\" During that time, Chico obtains the job he wants and looks forward to bigger and better things. As for Diane, because of Chico's self-confidence that makes him a very \"remarkable fellow,\" she no fears life. She soon proves her courage first by defeating Nana when confronted with her face to face, and after-wards by going through life alone after Chico enters the military with the outbreak of the Great War. In one of the film's most memorable scenes set during their long separation, Chico and Diane communicate with each other through their hearts and minds every night at the stroke of eleven as promised prior to his departure. Then on one particular evening, Chico is caught in a bombing explosion which sends the message immediately to Diane, now occupying her time as a munitions worker, sensing something has seriously gone wrong.<br><br>This sentimental love story, based on the play by Austin Strong, by 1927 standards, was so popular that it earned Janet Gaynor an Academy Award as Best Actress, the first to be honored for such an award. Simultaneously, she won for SUNRISE (1927) and STREET ANGEL (1928 while Frank Borzage was voted as Best Director. Twentieth Century-Fox remade SEVENTH HEAVEN in 1937 with an added plus to spoken dialog instead of the use of title cards, with the new Diane and Chico enacted by Simone Simon and James Stewart. Like Gaynor, Simon was short and fixed up to resemble her while Stewart, like Farrell, was the ever-so-tall \"remarkable fellow.\" However, SEVENTH HEAVEN appears to work well as a silent than during the changing times of the 1930s, which by then seemed old-fashioned and outdated. With the sound version 22 minutes shorter than the original two hour silent, the elements between two central characters remains the same, right through the young couple climbing seven flights of stairs, an exhausted journey, as a trip to \"seventh heaven,\" hence the title. Had SEVENTH HEAVEN been made some years earlier, it is my envision that it would have been directed by DW Griffith, starring Lillian Gish as the abused waif, with Richard Barthelmess playing Chico.<br><br>Also in the supporting cast are Ben Bard as Colonel Brissac; David Butler as Gobin; Albert Gran as Boul; Emile Chautard as Father Chevillion; and George E. Stone as The Sewer Rat. Gladys Brockwell as the abusive sister, stands out with her performance in her key scenes, especially with those vengeful eyes that would be an instant reminder to resembling that of Joan Crawford shortly before Crawford began looking like Crawford.<br><br>SEVENTH HEAVEN was one of the twelve selected films to appear during the summer months on public television's 1975 presentation of \"The Silent Years\" as hosted by Lillian Gish, with a piano score by William Perry from the Paul Killian collection, and off-screen female vocalist singing to the title tune of \"Seventh Heaven.\" In the Critic's Choice Video Masterpiece Collection distributed in 1997, the SEVENTH HEAVEN copy remained the same as it played on TV back in 1975, with color tinting as an added treat. The Perry piano score was replaced with the original synchronized Fox Movietone score featuring the song and vocalization of \"Diane\" in its soundtrack.<br><br>In spite of how SEVENTH HEAVEN will play to movie goers today, the movie itself represents the kind of movies made popular during the silent era and should be treated as such. But it is Janet Gaynor, under the tender direction of Frank Borzage, whose expert know-how, succeed in making this sugary romance into something special. (***)","user":"lugonian","rank":[31,36]},{"title":"remarkable film","rating":10,"date":"11 July 2003","review":"This could have been something awful.  It's high schmaltz, really fever-pitched melodrama, and the plot relies on a huge number of coincidences.  But it all works beautifully, through a perfect combination of acting, directing, and photography, not to mention the incredible lighting and set design.  This is one of the great silent movies, and one of the great screen romances.  Janet Gaynor had quite a year in 1927, turning in fantastic performances in this, as well as F. W. Murnau's Sunrise. 10/10<br><br>A year later, Buster Keaton in The Cameraman would do a brilliant spoof of the famous staircase crane shot from Seventh Heaven.","user":"plaidpotato","rank":[25,29]}]