[{"title":"Haunted Art","rating":8,"date":"2 November 2005","review":"I saw \"Bunny Lake Is Missing\" for the second time last night at San Francisco's Castro Theatre. The first time was also at the Castro twelve years ago during an Otto Preminger festival. Preminger made a number of better films  \"Laura\" and \"Anatomy of a Murder\" come to mind  but I have a special fondness for \"Bunny Lake\" even though at times it drags and is overly talky.<br><br>Among the merits of casting Carol Lynley and Keir Dullea, it can be successfully argued that they look like siblings  often not the case in films  which works very well for this film, as does their ethereal out-of-body quality. <br><br>Criticism has been made that the role of Ann Lake was written one dimensionally and therefore offered Lynley little to do but weep and whine; but this may have been Preminger's intention to support that part of the plot that suggests Ann may not have a daughter and that Ann herself may be more than a bit unbalanced.<br><br>Dullea is an unusual looking actor who can photograph good looking or simply strange. Preminger used this well early in the film, although he seemed to lose subtlety as the narrative headed towards its denouement.<br><br>The film's superior black-and-white widescreen photography is one of its strengths. London locations and interiors are effective and impressive. I especially liked the doll hospital cellar sequence with Lynley holding an oil lamp as she moves about, the high angle shot of the backyard the begins the final sequence, and several sequences when characters pass quickly from one room to another.<br><br>The sexual subtext is not as hidden as it would have been in the 50s, but subtler, say, than after 1970; its ambiguity adds to the film's texture without getting in the way. <br><br>In fact, 1965 seems a perfect time for this film to have appeared since the cinematic fulcrum was still well placed to balance a filmmaker from older Hollywood who also enjoyed pushing the envelope. A little bit later, color photography would have been mandatory, and the characterizations would have moved into a much more bizarre, psychedelic arena.<br><br>Perhaps because of how its strengths and weaknesses combine, the film has a seductive, haunting integrity for me. As the film began with the Saul Bass titles and Paul Glass's score, I felt a pleasurable sensation of awe which I used to feel more often when seeing a movie, and which reoccurred a number of times in \"Bunny Lake\".<br><br>Try to see this film on a large theater screen to experience the full power of the black-and-white widescreen cinematography. Otherwise, view the letterbox DVD on a screen large enough to allow you to see details. There is much to enjoy in \"Bunny Lake Is Missing\", so don't miss out.","user":"warrenk-2","rank":[59,67]},{"title":"Great British movie","rating":9,"date":"30 June 2004","review":"Stuffed with wonderful character actors and recognisably shabby locations - like the little school in an old house where the cook is making junket (whatever happened to junket?). Her accent is familiar: she once played a beautiful spy in 39 Steps, warning of leaking \"secrets vital to your air defence\". After many viewings, it's easy to forget that it's a mystery and everyone is a suspect. Has Bunny been abducted by sinister Martita Hunt (the slightly dotty founder of the school)? Or creepy Noel Coward (the landlord)? The Zombies song \"Just Out of Reach\" keeps being reprised.<br><br>They were more famous, though, for a song called \"She's Not There\". How's that for intertextuality? The script is by John and Penelope Mortimer. John is famous for the Rumpole series, and Laurence Olivier's detective has echoes of Rumpole, muttering that bus conductors never notice anything - they are dreamers and philosophers. Noel Coward's character too is very Mortimerian: \"There are many at the BBC who bear bruises left by the love of Horatio Wilson.\" Mortimer reveres Shakespeare and Conan Doyle and sometimes it shows.<br><br>The plot is stuffed, sometimes clunkily, with issues that were only just beginning to be spoken about: perversion (in the person of whip-wielding Horatio), teen pregnancy (Anne Lake seems about 20), unmarried motherhood and abortion. Anne chose to have her baby and raise it on her own. This is still a difficult course of action, but in 1965 it was groundbreaking, especially if you were - as she is - middle class.","user":"lucy-19","rank":[86,101]},{"title":"More surprising than the outcome is how well Carol Lynley holds her own against Laurence Olivier!","rating":8,"date":"3 August 2002","review":"Carol Lynley does some fabulous work here as American woman newly arrived in England whose little daughter is apparently kidnapped from school on her first day. The catch is, nobody knows the child and Lynley is having trouble proving she even exists! Terrific mystery from director Otto Preminger, an uneven filmmaker who does strong work just up to the finale (which is somewhat anti-climactic). Laurence Olivier is the police inspector on the case and he's very smooth, cunning and yet sympathetic to Lynley. There are some mod overtures which seem misplaced, and Noël Coward has a gratuitous bit as Carol's drunken landlord (and BBC celebrity!), yet the film does have many sharp bits of minute detail, intriguing and funny supporting characters, terrific cinematography and locations. Does it all add up? No, but it's inscrutable fun nevertheless. *** from ****","user":"moonspinner55","rank":[80,96]}]