[{"title":"Campy silliness on skis","rating":6,"date":"1 March 2006","review":"Previous entries have trashed this movie, as though it aspired to compete at Cannes and fell woefully short. Lighten-up. This movie was clearly made as a low-budget retread of the time honored \"underdog overcomes arrogant favorite\" and \"boy-meets-girl, boy loses girl, boy wins back girl\" themes played out on skis. Think Caddyshack with snow. Is it cheesy? You bet. Is it sophomoric? Certainly. Is it more fun than any other non-Warren Miller ski movie? No doubt. If you want a fun, sometimes silly, mindless ski movie, well, go no further. If you want a \"highbrow\" skiing movie, well, good luck, no one's made one yet. If you want painful, self important preposterousness try watching Aspen Extreme. Now there's a ski movie with delusions of grandeur. At any rate, Hot Dog never takes itself seriously, and if it suffers for it's gratuitous nudity and simple-minded plot, well, it isn't the first, and won't be the last. But it certainly never pretends to be anything other than what it is - campy low-budget fun with some good non-choreographed ski scenes. Disclaimer: If you don't ski, don't love skiing, or never lived in a ski-town for a season, some of this movie's \"charm\" may be lost on you.","user":"pbhai","rank":[25,28]},{"title":"Classic 80's cinema","rating":9,"date":"4 April 2000","review":"How can people put down this movie?  It is a classic raucous comedy from the 1980's.  There is lot of nudity, and their may be some ethnic stereotyping, but I remember this as being my favorite movie from when my family first got a VCR.<br><br>The skiing sequences are filmed beautifully, from a time when extreme skiing was just being born.  If you are a fan of Warren Miller, you'll probably enjoy the scenes from the competition, and also the free-skiing.<br><br>But who can forget the classic Chinese Downhill scene?  I saw this movie on cable last night, and it's still as good as it ever was.","user":"HartfordHammer","rank":[21,24]},{"title":"THE classic early 80's ski flick","rating":10,"date":"4 February 2003","review":"Did you ever own white Vuarnet Cat Eyes? Are you stoked that padded ski sweaters are coming back in? Did you ever want to be the toast of Tahoe, ski all season long, party every night and hang out with a wacky bunch of ski bums with names like Thrasher and Squirrel? Then check out this early 80's classic (I know, it came out in '84, but it's SO '82). Harkin Banks is the wunderkind from the sticks who hooks up with Dan O'Callahan. Dan is the good time Squaw Valley veteran who's a permanent fixture on the competitive ski scene, sharing slopes and hot tubs with his party hardy co-horts: the nutty Squirrel Murphy, who digs zinc oxide, sexy ski bunnies and long gondola rides; Kendo Yamamoto, who doesn't speak much English, but can tear down the mountain like a Kamakaze; punk rocker, Thrasher, who dances to his own tune, even at parties; and a host of semi-nameless others. But what would a crazy party flick be without some bad guys? Enter Rudy Garmisch, zee Austrian ski champ and nemesis of the Squaw Valley locals. He and his loyal \"Rudettes\", mostly nameless guys and fraulines also from zee Austrian slopes, push some of the locals out of the upcoming competition with promises of good television ratings and new sponsorships from internationally minded companies. Uh-oh, ol' Dan's not happy with that at all! Toss in a battle over a cute blonde runaway, Sunny, and you have a recipe for trouble on the slopes. Not to worry, all's well that ends well. After all, what tiff can't be settled over a friendly game of Chinese Downhill? Not sure you wanna play? No worries...there's nothing one of Dan's famous \"Leg Spreader\" cocktails can't fix. And to top it all off, there's some fantastic ski footage set to even more fantastic early 80's music. Why they even bothered to make Ski School in the early 90's was a mystery to me - how could they do the ski party flick any better than Hot Dog? Surprisingly enough it was also pretty damn good. But Hot Dog: The Movie is still the original and the best.","user":"colparker","rank":[13,16]}]