[{"title":"Quite Possibly The Most Realistic Film I've Ever Seen","rating":10,"date":"21 August 2005","review":"The first time I watched this, I really didn't know what to make of it; it was so different from any other film I had ever seen. It seemed as if it was filmed with virtually no budget, the sets and atmosphere were completely dingy, the setting and much of the language was foreign to me, and it felt like a kind of homemade independent film. However, upon a second viewing, I see it for the richly-textured masterpiece that it is, and for the awesome attention to detail that must have gone into it which I had taken for granted the first time.<br><br>There have been other films with similar subject matter in alternate settings of cultured men reduced to a kind of forgotten primitivity, but I think the thing that sets this movie apart is the fact that director Ted Kotcheff remains completely neutral toward all of the characters - both the cultured schoolteacher as well as the locals. By the end of the film, no character remains unscathed, and yet no character is completely without sympathy, either. It must be quite difficult for a director to remain impartial, especially when most stories require audience sympathy for a protagonist versus an antagonist for story momentum. This impartiality establishes an incredible realism in the film which is difficult to shake off. Here, as in life, things just happen to the main character organically - whether there is any rhyme, reason, or moral to any of it is the complete burden of the audience to figure out.<br><br>Another key aspect to the film is its universality. Most people would like to believe that in the modern world, and especially a modern country such as Australia or the U.S, that such ugly colloquial primitivity has been largely purged from polite society, but they would be quite wrong. I can equate some of my own personal experiences with those of the main character in this film, and so felt an uncomfortable recognition as I was watching this. Moroever, virtually every scene in the film I could envision actually occurring - something I cannot say about any other I can think of. Sam Peckinpah's filmic explorations of perverse masculinity, some of Samuel Fuller's work, and \"Deliverance\" are the only movies that achieve something close to the kind of effect this movie has, and even Peckinpah felt the need to resort to flashy cinematic stylistics to get his points across.<br><br>This movie has not aged one bit, and probably never will. It is a tragedy that it has all but disappeared even in its own country of Australia. Director Kotcheff displayed an amazing early talent; it is too bad that his career never reached another peak like this - even in \"First Blood\" and \"Uncommon Valor\" - two of his other films with similar themes. And that the same man ended up directing \"Weekend at Bernie's\" and episodes of \"Zalman King's Red Shoe Diaries\"!!! The world is a crazy place, and one need only watch this film to realize this fact.","user":"Sturgeon54","rank":[113,135]},{"title":"Under the weather down under","rating":9,"date":"14 July 2009","review":"Kenneth Cook was posted as a young man by the Australian Broadcasting Commission (our state-owned broadcaster) to the NSW outback mining town of Broken Hill in the early 1950s. This experience provided the basis for his scarifying first novel, \"Wake in Fright\", published in 1960. In the novel, Gary, a young schoolteacher bonded to the State Education Department to teach in a desolate desert whistle stop, visits \"Bundayabba\" (Broken Hill) on his way back to Sydney, surf and girlfriend for the vacation, loses all his money in a two-up game in a desperate attempt to pay off his bond and descends into drunkenness and depravity with the friendly locals, who all appear to be carrying on as they normally do.<br><br>This film was made from the novel in 1970 by a production company hitherto associated with light TV entertainment. The then fairly young Canadian director, Ted Kotchoff, with a couple of foreign leads, Donald Pleasance and Gary Bond, was quite happy to accept Cook's ugly Australians as his local characters and his parody of \"mateship\" as the social cement binding them together. The dialogue may be spare but the editing (by Tony Buckley) is great, and we are right inside Gary's head as he loses it.<br><br>I saw this movie when it first came out in New Zealand, where it passed almost without comment. Australian audiences did not flock to see it, and the general critical reaction was that it was too confronting. Nearly 40 years later, restored by the Australian Film Archive, it is a well-made classic which still has plenty of punch. Gary Bond as the hapless schoolteacher is very convincing. Chips Rafferty as the local policeman with a pragmatic approach to enforcing the law exudes a low-level air of menace. Donald Pleasance as \"Doc\" the alcoholic ex-doctor who leads Gary astray is not so much menacing as over the top, but very amusing all the same. The rest of the cast are suitably ocker.<br><br>Much has changed in the outback since the 1950s. Most of the people you rub up against in the bars of mining towns are likely to be from somewhere else, and you'd be lucky to hear those harsh bush accents. Broken Hill has shrunk a bit and is now a pretty quiet place. The Education Department no longer goes in for bush slavery - this is no more than an historical portrait. Yet many city dwellers still see the outback as Gary sees it – a place full of drunken homoerotic dickheads who abuse their environment, treat women like public conveniences and whose idea of mateship is to keep their mates drunk. \"Wake in Fright\" is best seen as very vivid fiction, a horror movie in fact. I don't think Kenneth Cook set out to write non-fiction. Neither was Ted Kotchoff trying to make a documentary. But, with the aid of several good actors and a host of authentic extras he created such a realistic atmosphere that many viewers were misled.<br><br>The film, which launched the career of Jack Thomson for one, is said to have given the Australian film industry a boost, even though few saw it. Certainly some fine films followed ; \"Picnic at Hanging Rock\", \"The Getting of Wisdom\", \"The Devil's Playground\", \"The Chant of Jimmy Blacksmith\" for example. But history prevailed – modern Australia was not yet ready to film.","user":"Philby-3","rank":[34,39]},{"title":"Stunning new print seen at TIFF","rating":9,"date":"27 September 2009","review":"I had the great good fortune to obtain a ticket for a one-time-only screening of Wake In Fright (aka Outback) at the 2009 edition of the Toronto International Film Festival. I had heard of the film and read reviews of it, but it had receded from my memory before I noticed it in the festival program. Ted Kotcheff was known to me as the talented Canadian director of such artful Canadian films as The Apprenticeship of Duddy Kravitz (1974) and subversive Hollywood offerings like North Dallas Forty (1979) but I had not connected him to WIF.<br><br>The screening was part of TIFF's Discussions series, which features an extended, moderated Q&amp;A after the film. I believe this one ran at least one hour, and was very informative and interesting. But first the film.<br><br>Briefly, school teacher John Grant (Gary Bond) is contracted by the government to teach in a one-room schoolhouse in Australia's primitive Outback. The school year ends and Grant thankfully boards the train for a six week summer vacation. But he loses all his money when drawn into a stupid gambling contest in the first settlement the train reaches. He is thus just as helpless and alone as any civilized man among dangerous savages (think The Naked Prey with drunk, horny rednecks chasing the titular hero.) Grant first meets the local lawman Jock Crawford (Chips Rafferty) who appears unconcerned with the pervasive drunkenness in his community. He insists they get sloshed together, and unwittingly leads him to the gamblers, who play a simple-minded game of heads or tails with two coins. Grant wins at first, but then loses it all. Destitute, he has no choice but to accept the sodden hospitality of the locals. We get the idea (via excellent acting by Mr. Bond) that the educated young man is not happy being at the mercy of these lower-class savages. But their brutish acting-out is partially accounted for (but NOT excused) by the scarcity of sex -- whatever each of these man-children desires, men or women, they just aren't getting enough! An excellent sequence in the film is the attempted seduction of Grant by Janette Hynes (Sylvia Kay), daughter of one of Grant's erstwhile \"mates.\" Loneliness, desperation and sexual frustration are etched in her face, and she leads Grant out of a drunken party for a walk, intending to do the dirty literally in the dirt, but her intended vomits up one of the 1,000 or so beers he downs in the film. Her wretchedness as she flees sobbing back to her father's house is just devastating.<br><br>The most controversial scenes in the film were shot during actual kangaroo hunts, conducted at the time with no decent regulation, for the benefit of foreign pet food companies. Drunk as lords, the Aussie crew speed through the desert in a \"Mad Max\" hunting truck, shooting every poor 'roo they can find. In the grisly climax, Grant agrees to kill an animal with a knife and his bare hands.<br><br>Later, seriously alcoholic 'Doc' Tydon (the great Donald Pleasence, at the peak of his brilliance) sexually assaults the (finally) unconscious Grant in his filthy hovel. Grant \"wakes in fright\" to find the good Doc asleep on the floor, naked except for a woman's baby doll nightie. \"Gay panic\" ensues, and after an unsuccessful attempt to hitchhike out of the town, he returns to the cabin with his kangaroo rifle and confused intentions. (SPOILER) 'Doc' returns, but Grant turns the rifle on himself and fires. He awakes in a hospital bed, and signs a statement saying the shooting was an accident. He is discharged just in time to return to his school house.<br><br>At the Q&amp;A we learned some interesting facts: The film was shot on location in a small Aussie town, and the bar, gambling hall, the Hynes ranch, the schoolhouse, etc. are real, and together with the stark cinematography impart a sense of one of those faintly recalled nightmares that seem like a true occurrence. Mr. Kotcheff told us he was aiming to create claustrophobia in wide-open spaces, and in my humble opinion he succeeded.<br><br>The 'roo hunt was filmed documentary-style at a real hunt. The filmmakers consulted with Australian anti-hunt groups who told them to go ahead, so that the Australian public could see the cruel slaughter for themselves. It's quite sickening -- the hunters amuse themselves by shooting to wound, then watching the bleeding animals jumping about in pain. The killings by knife were simulated, shot in a black-out tent to match the night-time of the documented hunt.<br><br>The film was well received by critics at Cannes (and the restored film was re-screened there this year), and the director remembers being told by his hosts that it was an important film for Australians, and that it could only have been made by an unbiased outsider. Its North American release (as Outback) was botched -- perhaps deliberately, since (I suppose) unfettered alcoholism + gay rape + graphic animal slaughter wasn't expected to sell well, even in the cinema's post-60's creative ferment.<br><br>Eventually, the film was forgotten and the master negatives misplaced. The film's editor spent two years on his own time and dime tracking it down. He found the reels in a Pittsburgh, PA warehouse, in containers marked for destruction. Restored, remastered and revived, it has met with accolades in Australia, at Cannes, and of course here at TIFF.<br><br>Needless to say, I am anxiously awaiting the DVD release!","user":"targosfan1","rank":[34,40]}]