[{"title":"Wilhelmine Perspective","rating":10,"date":"15 March 2006","review":"Erich Maria Remarque's novel and the film made from it may possibly be the greatest anti-war statement ever created. All Quiet on the Western Front won a deserved Best Picture Academy Award in the year it came out and brought great prestige to Universal Pictures as the first Oscar in that category won by that studio.<br><br>Lew Ayres is the student leader of a bunch of German school boys in 1914 who listen to the voice of their school master and enlist in the war that's just been declared. The whole class enlists and that's not hyperbole because in Germany at the time it was the boys who got the education and the girls if they got it, got it separately from the boys. <br><br>I'm sure that viewers of All Quiet on the Western Front today probably are asking why that school master and so many of his generation were urging their youth on to such folly. Very simply that their generation had a quick victory in 1870 in the Franco-Prussian War. Every generation since wars were recorded figures their war experience will be the same for their children.<br><br>Only it wasn't. On the western front the Allied and Central Powers armies were locked in a bitter stalemate that ran diagonally across France and Belgium from the English Channel to the Swiss border. This went on for a little over four years. In fact had it not been for the fact that America joined the Allied side and the French and British held out until they did, I'm sure an honest armistice would have been declared long before November 11, 1918.<br><br>You lived, fought and died in those trenches. Either you were defending or you were attacking the other guy's trenches against murderous automatic weapon fire and long distance artillery batteries. All Quiet on the Western Front was the first great war film of the American sound era and graphically shows that.<br><br>And it shows that from the enemy perspective. That's something today's audience can't appreciate, the fact that the film was from the Wilhelmine German perspective. Remember these were the enemy a dozen years before. But the experience in the trenches was universal.<br><br>Lew Ayres became a star with this film and it effected him so deeply that he became a committed pacifist which caused later problems in his career. He's the voice of reason and civilization and the voice of a lost generation of Germans who would never have listened to the demagogic appeals of the Nazis. <br><br>Louis Wolheim plays the veteran soldier who befriends Ayres and his school boy chums and teaches them how to survive in the trenches. It turned out to be his greatest role. He was a brutish looking man and played mostly those types in silent films. All Quiet on the Western Front would have been the start of a whole new career opening. But Wolheim died the following year just as he was to start filming The Front Page. Adolphe Menjou took the part of Walter Burns in that film which Wolheim was to have.<br><br>The third really stand out performance is that of John Wray who some might remember as the brutal prison guard in Each Dawn I Die. Wray plays an officious mail man who is in the German Army Reserve. He gets called up and this little nobody gets rather impressed with himself and his new found authority as a training sergeant to Ayres and his friends. Later on at the front, he gets a view of combat he wasn't quite ready for.<br><br>All Quiet on the Western Front with its eternal message of peace and life will be one eternal film, it will be shown and appreciated for many generations to come.","user":"bkoganbing","rank":[110,123]},{"title":"A great pacifist work!","rating":8,"date":"8 October 2000","review":"In 1930, three great pacifist films were released, in the United States, Lewis Milestone's \"All Quiet on the Western Front;\" in Germany, G.W. Pabst's \"Westfront 1918;\" and the English film by Anthony Asquith, \"Tell England.\" Of the three, Milestone's film was the one that has received most acclaim...<br><br>Based on the novel by German author Erich Maria Remarque, \"All Quiet on the Western Front\" tells the story of a teenager brought up to believe in the values of patriotism, militarism and the glorious death... The teenager returns on leave to his school where the schoolmaster who has taught him the values that he now despises greets him with ecstasy...<br><br>As a fighter he is treated with great respect, and the eager young children wait to be aroused by thrilling tales... He has none. There is no heroism. There is no glory. 'We live in the trenches and we fight. We try not to be killed - that's all!'<br><br>The film is totally committed to its proposition war is evil; not only the First World War which is portrayed in the film, but all war.<br><br>The motion picture, considered among the screen's most powerful indictments of the futility of war, contains many excellent sequences and set-pieces which still keep their power: the pair of boots being continually taken over as successive owners are killed; Lew Ayres talking impotently on about the brotherhood of man and the futility of killing as he watches his French enemy die beside him in a shell crater; Ayres carrying the wounded Wolheim on his back and talking cheerfully to him, ignoring he has been killed by a shell splinter; and of course, the closing scene of the hand reaching out from the trenches to seize a butterfly only to fall back slowly as an enemy's bullet falls home...<br><br>Despite dated moments, this highly emotive war film retains its overall power and remains a great pacifist work... The film won won Oscars for Best Picture and Best Director and was nominated for Best Cinematography &amp; Best Writing...","user":"Nazi_Fighter_David","rank":[57,64]},{"title":"Great acting, great directing make a sincere, emotional film.","rating":17,"date":"17 May 2001","review":"To say that this movie is one of the greatest war films of all time would be an understatement.  Naturally, since the picture is based on Erich Maria Remarque's marvelous novel, the screenwriter was given quite a powerful story to begin with.  The three main reasons why I consider this movie so forceful are the acting, the cinematography, and simply the sincerity.<br><br>Lew Ayres, the man who plays Paul Baumer, convincingly portrays the main character in many ways.  First of all, the sheer innocence of his facial appearance adds a poignant touch to the film, because the overwhelming theme of the story is how the war effects all young people of each nation, whether that person dies in the trenches or survives only to lament his days in the war.  Ironically, when the film was initially being put together, Remarque, the novelist who won critical acclaim for writing the book, was asked to play the role of Paul.  Having seen time in the war the producers must have thought him aptly prepared to play the role.  But he declined because he had other commitments and because he felt he was not such a great actor.  Lucky for us, because Ayres gives a powerful performance.  Other characters with relatively minor roles have major importance in the film because they portray touching, heart wrenching scene s of death.  These peripheral characters all help add to the general tone of the film (and the book) because they show how dark and terrible the war can be; and they in turn show how propaganda can be so harmful, because most of the soldiers in Paul's regiment are volunteers who receive a very rude awakening when they discover what the war is really all about.  The acting is simply superb, and perhaps this is due to the fact that the famous director George Cukor was an assistant who, although uncredited, came onto the set to help supervise the actors (possibly because director Lewis Milestone's English was not too good).<br><br>The cinematography of this film is absolutely magnificent.  The film rarely has gory sequences because the director finds other ways to imply death and still have the same emotional effect.  One way in which he does this is by showing single body parts (such as a hand or a leg) and allowing these appendages to show the death of the soldier as a whole.  Also, the cameraman uses overhead angles at times with great skill and also focuses on the trenches at times as the soldiers fall back into them after being shot (which implies that the trenches are a symbol of hell, because soldiers fall into them to die).  In short, the cinematographer Arthur Edeson allows the camera to do the talking and to drive the film, rather than the dialogue (speaking of which, there is relatively little; the actors' facial expressions do the bulk of the talking in the film).<br><br>When I say this film is sincere I really can't give you any tangible evidence to prove the point; all I can tell you is to see the film.  The film at times overwhelmed me with emotion to the extent that I got goose bumps from watching some of the more agonizing scenes.  In a way, this movie is much like a silent film.  This stands to reason because it came at the very beginning of the 'talkie' age, only three years after The Jazz Singer (1927).  Also, Milestone directed silent films before this one, and he seemed to know that less focus on dialogue and more focus on acting would bring about an overwhelmingly emotional and well, sincere, film.  The film obviously had an effect on its star, Mr. Ayres, because once World War II began and he was drafted into the war, he conscientiously protested serving in the army because of his opinions towards war.  I believe he admits that his opinions stem from his work in this movie.  Certainly this is a powerful admission, because his protest caused him and his films to be blacklisted in Hollywood, and his career suffered greatly because of his ideals.  So if you don't believe my words about the power of this film, believe his.","user":"kian_ef","rank":[120,140]}]