[{"title":"The figure and natural wonders of Jane Russell in her last film for Howard Hughes...","rating":7,"date":"30 October 1999","review":"\"Underwater!\" is a routine treasure-search adventure with Jane Russell (Theresa) in love with Richard Egan (Johnny) diving with him and with Dominic (Gilbert Roland), his best friend, in the deep blue water of the Caribbean looking for bars of gold lost in the wreck of a Spanish sailing ship...<br><br>The essential point of the film is not the legendary treasure shared in part with an unscrupulous 'bandido' named Rico (Joseph Calleia) but a nice shot worth to be remembered: Jane Russell in her distinctive particular one-piece red bathing-suit moving underwater in front Sturges' camera...<br><br>With a great Latin music score, and the blessing of Father Cannon (Robert Keith) for winning his gold cross, and with Lori Nelson (Gloria), the owner of the beautiful boat in love with Dominic, the film photographed in SuperScope and Technicolor, imparts a special Latin flavor, serving one and only purpose, the figure and the natural wonders of Jane Russell in her last film for Howard Hughes...<br><br>Ironically another pin-up girl, and another 'Jane' was about to be born, the screen goddess Jayne Mansfield.","user":"Nazi_Fighter_David","rank":[33,37]},{"title":"Pioneer Movie","rating":15,"date":"15 October 2005","review":"I enjoy this movie very much and try to watch it periodically. As someone who took up SCUBA diving the year before this movie was made, I'd like to call attention to the fact that it is the first full length feature movie in which SCUBA was used. In fact, it was so early in the development of equipment that the tanks that they were using were smaller than the 72 cubic foot tanks that became standard for steel tanks.(There were other sizes.) Also, note the two hose regulators that are all but obsolete, the early flipper designs, and the primitive back packs. To some, the story may seem a little corny, but so were early aviation pictures and early submarine pictures. This considered, I think that the movie deserves look.","user":"arturo-27","rank":[28,32]},{"title":"The sunken treasure","rating":6,"date":"4 January 2006","review":"Howard Hughes was a producer that had a lot of talent for discovering beautiful women that went on to have better careers with other vehicles than the ones he decided to create for them. That seems to be the case of this John Sturges' 1955 film \"Underwater!\" in which the curvaceous Jane Russell starred for the last time for Howard Hughes.<br><br>The film is a curious one. We are introduced to Johnny and Dominic, two underwater divers who are searching for those sunken ships in the Caribbean, especially this one, not too far from Cuba. As they stumble into the old Spanish galleon, they find a man that appears to be a sort of pirate awaiting for them because it's obvious they are after those treasures.<br><br>As Johnny and Dominic go back to Cuba, we are introduced to Theresa, Johnny's wife, who is dead set against spending money chasing his dreams. But when Dominic meets Gloria, by chance, she tells him about the yacht she has been left with by a departing old flame. So the four friends, and a priest who knows about those sunk ships, go in search of the riches trapped underwater.<br><br>The film doesn't bring anything new to this film genre. In fact, it's pretty tame stuff we see in a predictable story we know how it will end. The best reward for the viewers of \"Underwater\" is the beautiful Jane Russell at her best. She was one of the sultriest women working in films during those days. The problem is the male stars who give by the numbers performances. Joseph Calleia is the only one that shows any spunk as the man who wants the riches from under the sea.","user":"jotix100","rank":[20,23]}]