[{"title":"The Perkins Factor","rating":10,"date":"27 July 2009","review":"No matter how many times one sits through this Hitchcock classic, Anthony Perkins always manages to surprise you. It is a sensational performance - for which he didn't even get an Oscar nomination - I have no way of knowing how much preparation he dedicated to the creation of Norman Bates, maybe no more than usual, but the details of his performance are astonishing. Never a false move and if you follow the film looking into his eyes, you'll be amazed as I was. The madness and the tenderness, the danger and the cravings. A mamma's boy with hellish implications and yet we see, we feel connected to the human being, we are not horrified by him but of his circumstances. In short, we kind of understand him. That alone puts him miles and miles away from other cinematic monsters. From Richard Attenborough as the real life Christie in \"10 Rillington Place\" to the hideous, unredeemable Christian Bale in \"American Psycho\". Here Hitchcock and Herrman create an universe that Anthony Perkins inhabits with the same kind of electricity, nerve and shyness that Norman Bates projects throughout the film. Janet Leigh falls for it if not him. She, like us, sees the boy trying to escape his dutiful son's trap. He is in my list of the 10 most riveting characters ever to be captured on film.","user":"mark-lovellsamuels","rank":[172,182]},{"title":"It's the Little Things","rating":10,"date":"5 September 2001","review":"So much has been written about this film that all I can do is add my own voice of approval and say that I consider it to be a masterpiece, and add a few things often overlooked or not commented on that add so much to the movie's cumulative power. It's often the little things that make a film work. Here are a few examples:<br><br>a.) The absolute realism of the first twenty minutes of so, which are so true to life that they might have come from a documentary on how people lived in America forty years ago. There isn't a false note,--or a missed one--as each vocal inflection and raised eyebrow carries great meaning even if, on the surface, not much appears to be happening.<br><br>b.) Marion and the motorcycle cop. The cop is dark and sinister in appearance, due mostly to the bright desert sun, and never takes off his sunglasses. His conduct is at all times professional; he never raises his voice, and comes across as calm and rather perceptive; and he seems truly concerned over Marion Crane's fate, though he is unaware of her actual predicament. Marion is, alas, a bad actress, and the cop sees through this, if not to the heart of the matter, yet we don't want him to follow her. Despite his appearance the cop is not the angel of death but rather Marion's last chance. Had she confessed to her crime she would have escaped the fate that awaited her; and if she had just been a little less clever, and driven more slowly, and the skies remained clear, he might have followed her to the motel and intervened on her behalf.<br><br>c.) California Charlie. John Anderson is wonderful as the fast-talking, semi-streetwise small town used car salesman. At the end of almost every other line of dialogue he seems on the verge of discovering who Marion really is, then pulls back or comes to the wrong conclusion. He senses that she is being watched by the cop; but he also wants to make a sale. The scenes at the used car lot are both highly realistic,--and perfectly acted and timed--and also a little frightening, from the opening, \"I'm in no mood for trouble\", to the final \"hey!\" just before Marion drives away. We know that something isn't right, but the problem isn't with the car lot; it's Marion's plight casts a dark shadow over all her scenes there, despite the brightest sunlight imaginable.<br><br>d.) Chitchat with Norman. Once Marion and Norman settle down for a light meal in the parlor their conversation turns to general things, and Norman is a good observer, if a bit awkward socially. Without actually lying Marion gives herself away with a throwaway line (\"Sometimes just once is enough\", in a reference to private traps) and Norman seems to catch her drift, if not the actual meaning of what she's saying, and allows it to pass. We can see that he is moody when he angrily leans forward and delivers an angry, though controlled tirade against putting people in institutions. Every camera angle and line of dialogue in this scene has meaning and carries enormous weight, and yet the drama plays out in a light, relaxed mode, and the performers seems truly connected to one another at its conclusion, strangers no more. This is in my opinion the best written and most beautifully acted, edited and photographed scene I have ever seen in a movie. The handling of every nuance is prodigal and masterful, and the end result nothing less than staggering.<br><br>e.) The sheriff's house. When Sam and Lila wake up the sheriff and his wife in the middle of the night we see a splendid example of people talking to one another without either party understanding what is in fact going on. The result is a mini-comedy of manners; but it is also good exposition, as we learn of Mrs. Bates' death (and the dress she was buried in, \"periwinkle blue\"). John McInyre's sheriff dominates this scene (and no other), and expertly delivers its punchline, \"Well if that's Mrs. Bates in the window, who's that buried up in Greenlawn Cemetary\".<br><br>f.) Arbogast and Norman. The private detective's interview with Norman is played low-key, and yet we sense the tension in Norman's voice and manner, and know that Arbogast does, too. Something is amiss. This is beyond the question of who killed Marion. The stakes feel very high in this sparring match, and though Norman wins on a technicality, we know that Arbogast is coming back for more.<br><br>g.) The shrink's explanation. This part of the film has been criticized by many for being a sop thrown to the audience. I disagree. After all, the movie came out in 1960, and by the standards of the time some explanation seems in order, and Dr. Simon Oakland is as good a man for the job as I can imagine. His analysis of Norman's pathology is cogent and extremely well delivered. Yet throughout his speech, with all its Freudian brilliance, the doctor offered a take on the story that we in the audience, even if we can accept it, can never be satisfied with. He can explain the character of Norman Bates rationally, but he cannot make our response to his story and its effect on us feel ultimately safe, feel somehow in control and finalized. Yes, one can put people like Norman under the microscope, and even dissect what one sees, but this doesn't stop such events as unfolded in the movie any less likely to occur. Ask Milton Arbogast.<br><br>\nIn conclusion I'd like to say that great films are made up of outstanding little things, not just big moments or fancy effects. There is in fact nothing fancy about Psycho, which is on the surface is a somewhat plain-looking movie. Only when one looks beneath the surface does one see the teeming millions of small things,--gestures, glances, sudden changes in lighting, razor-sharp editing, and all above the refusal on the part of the director to let any one factor dominate--that we understand the meaning of the word genius, the meaning of the word creative.","user":"telegonus","rank":[218,236]},{"title":"Anthony's Norman","rating":10,"date":"19 May 2017","review":"Getting into Hitchcock's Psycho, 57 years after its original release is like assisting to a masterclass of sorts. We can now identify what made this little lurid tale into a classic. Hitchcock himself, naturally, but now we know the first director's cut was a major disappointment and that Alma Reville - Hitch's wife - took over, re edited and the results have been praised, applauded and studied ever since. Janet Leigh's Marion Crane created a movie landmark with her shower scene. Bernard Herrmann and his strings created an extra character that we recognize as soon as it reappears under any disguise but, what shook me the most now in 2017 is Anthony Perkins as Norman Bates. His performance has evolved with the passing of time and its effect has remain as chilling, as moving, as funny and as real as it was in 1960. It's interesting to watch Gus Van Sant's 1998 version with Vince Vaugh as Norman Bates. If you look at the film, shot by shot with Berrnard Herrmann's strings - it's pretty fantastic. - Play it in black and white if you can. The problem and it is a monumental problem, we wait for Janet Leigh and Anthony Perkins, if the casting of Anne Heche was really bad - not a hint of Janet Leigh's humanity, the casting of Vince Vaughn was incomprehensible. Not just not credible for a moment but annoying, very annoying. Anthony Perkins brought something profoundly personal to Norman Bates and as a consequence we connected with his sickness. We felt for him. Okay, sorry, I didn't mean to go there but I felt compelled to because I saw again Psycho (1960) ad Psycho (1998) at 24 hours from each other and realized that the main flaw of the 1998 versions is the absence of Anthony Perkins.","user":"arichmondfwc","rank":[94,101]}]