[{"title":"Shakespearean in Kalidas' Land","rating":7,"date":"1 June 2013","review":"I don't remember any other movie where story was largely based on a family/set of people and they acted in it. Do you remember any movie? Shakespeare Wallah, loosely based on Kendal family, is one such example. Bollywood knows this family by virtue of their strong bond with the Kapoors. Jennifer – wife of Shashi Kapoor – was a Shakespeare Wallah. A Merchant Ivory movie, directed by James Ivory, is sort of a folklore in India Crossover Cinema.<br><br>Movie is about a family of English actors – Buckinghams - who stage plays in India. Story showcases an evolving India where a nomadic family tries to accommodate themselves. Story has an pivotal plot of family's daughter falling in love with an Indian, played by Shashi Kapoor, who is in a romantic relationship with a Bollywood actress. Largely autobiographical, film achieves a lot in terms of storytelling and performances. Movie highlights the downfall of theatre culture in India and rise of Bollywood.<br><br>Shakespeare Wallah will be remembered for many things. Satyajit Ray's music will be one of them. In fact, a large part of the crew was Ray's and that includes a familiar name – Subrata Mitra. Story is brilliantly carved by Ruth Prawer Jhabvala. Her being close to Kendal and Kapoor added the realism such movies demand. Like typical Ivory movies, movie is subtle statement of filmmaking.","user":"user-169-219219","rank":[4,4]},{"title":"Loss of past time","rating":10,"date":"11 May 2013","review":"The exquisite mood captured by this masterpiece is unique in my experience of motion pictures. \"Colonial rule\" in India was not English, but British. The many Irish, Welsh and Scots who lived and died in India would hate to be called English. However, the dedicated husband and wife thespians are eccentrically English, of course. Their daughter, Lizzie, has never been outside India, and knows less of England than Sanju, the man she thinks she loves. The action is not set during the last days of the Raj, as reported in some reviews. Nabokov's \"Lolita\", which is pointedly displayed early in the film (perhaps because it is also about the seduction of one culture by another), was first published in 1955, and Indian Independence took place in 1947. Sanju drives a white Mercedes, which I wouldn't like to date, but which is very definitely post-1955. The film was made in 1965. The rise of Bollywood must have been taking place at about this time. Much of the delicate ambiance of the film is totally lost if the audience is misled into believing that India was like this before Independence. Only the ghost of the Empire lingers on in this quiet story. It is not really about a \"clash\" of cultures, with the violent hostility which that word implies; rather, it gently acknowledges that the old order is changing, giving place to a new. Indian potentates no longer personally strangle unwitting intruders for entering their women's quarters. I hope not, anyway. The lives of Lizzie's parents are irrevocably inter-woven with a vanished time: they will die in India. Because Lizzie has no place in the new India, she has to be sent away to a home she doesn't know. Her Indian playboy friend cannot commit himself to marrying her.<br><br>Nevertheless, the truth is that in spite of the mockery directed against the theatre of Shakespeare by a more aggressively volatile element, very many actors on the imperial stage conceived a genuine love of India, and its high and ancient civilisation, and this affection could be recognised and reciprocated, and still is, in some parts. The love affair is, even today, not yet wholly extinct, at least at some levels. This is an infinitely more nuanced work than David Lean's rather nasty and one-dimensional interpretation of E.M.Forster's shallow \"Passage to India\". Ruth Prawer Jhabvala, who wrote the screenplay of Shakespeare Wallah, displays a far finer spirit, greater precision and deeper humanity. Separation at any age is also a loss.","user":"eyesour","rank":[8,10]},{"title":"humble beginnings","rating":7,"date":"23 March 2007","review":"I have watched Merchant-Ivory productions in the cinemas of my native country and was impressed by the fine evocations of the times they presented added obviously by a considerable budget for costumes and technical apparatuses. This situation does not exist in this movie which is poorer but still very fine. The relationship between English and Indians as well the antithesis between the quality theatre and the emerging native movie industry exemplified in the the feud between the English girl and the Indian movie star vying for the heart of the male character was impressive, although being neither English or Indian I could not escape the conclusion that the English were associated with quality theatre while the Indians with popular movies and this equation obviously had a qualitative element in it. The version I saw did not contain subtitles therefore I had some difficulty apprehending the Shakeaspearian performances which are interspersed in the movie. Nevertheless it is a movie I recommend since what I like most was the general impression it conveyed.","user":"georgioskarpouzas","rank":[12,17]}]