[{"title":"Feel-good slasher","rating":7,"date":"4 October 2010","review":"This juicy slice of summer happens to be one of the most professional Italian movies made on US soil. You get young people partying, 80s metal non stop, wet t-shirt contests, pretty girls making a buck or two on the side with older gents, sharply dressed biker gang, shady local government figures, and a leather-clad masked killer who offs everybody in high voltage fashion. The story isn't very special, a beach town biker gang leader gets fried on electric chair, while John Saxon the sheriff and Michael Parks the doctor see to it. BTBGL's last words consist of a vow to avenge his own death. Later it's summertime and horny young people start turning up dead. Amidst all this two friends ride into town to join the party. Will it all turn out well? This film is one of the most watchable slashers out there. It's so well made, well paced and well acted (well, it's campy but not horrible) that it almost qualifies for a \"feel-good slasher\". You might not like it if you're a \"gore hound\" and only want to see people suffer, because here everybody's having fun.","user":"asgard-5","rank":[12,13]},{"title":"A guilty pleasure of mine","rating":8,"date":"26 March 2003","review":"I first saw this movie on USA UP ALL NIGHT as WELCOME TO SPRING BREAK. Normally,I don't like slasher flicks at all,but this film has a goofy sense of fun,as if it's making fun of itself. Running gags run rampant (\"How 'bout them GATORS!?\") and the acting is absolutely horrible. I found it to be an interesting,surreal film with beautiful scenery (check out the phosphate mine!) and laugh-out-loud moments,some of which are intentional.","user":"Beast-5","rank":[10,11]},{"title":"An enjoyably junky piece of 80's slasher trash","rating":8,"date":"12 January 2006","review":"Hey, you ever have one of those nights when you couldn't decide if you wanted to see either a terminally brainless T&amp;A laden \"Porky's\" on the beach sex'n'booze lowbrow comedy or a comparably vacuous seaside mystery horror slasher pic? Well, you can actually see 'em both in one gloriously junky 90 minute sitting thanks to this crackerjack handy-dandy combo hybrid of the above-cited sub-genres. An enigmatic psycho biker dude whose face is obscured by a dark visor electrocutes a sizable volume of fun-loving, hooch-sodden, hormone-crazed hedonistic collegiate chowderheads partying their sun-tanned butts off during Easter vacation in Miami Beach, Florida. The murders totally baffle the local cops, who in time-honored B-pic tradition wish to keep the whole thing hush-hush so the resort town can still milk mucho money from the addle-pated twenty-something tourists. So, it's up to the token serious, self-disciplined nice college guy (amiable Nicholas De Toth, who makes for a refreshingly earnest and unmacho reluctant protagonist) and a sweet barmaid gal (winningly played by the incredibly cute ultra-honey Sarah Buxton) to find out who the true culprit is on their own. <br><br>Done with the right amount of energy and competence to qualify as a perfectly acceptable and enjoyable serving of \"screw intelligence and just give me the lowdown trashy horror exploitation flick goods\" Saturday night schlock, this engagingly drecky beaut proves to be a whole lot of top-notch dopey fun. Director Umberto Lenzi, working from a slim, yet serviceable script by Larry Kirkpatrick (who also wrote the equally dumb, but satisfying \"Primal Rage\" for Lenzi), keeps the proceedings lively and eventful by tossing in a rowdy gang of hog-ridin' hellions called the Demons (!), a bunch of thrashing' heavy metal tunes roaring' away on the soundtrack (the theme song \"Don't Break My Heart\" by Kristen really smokes), a few wet t-shirt contests, several grisly murder set pieces (Alessandro Rambaldi did the great, gruesome gore f/x), a throbbing' rock score by Goblin's Claidio Simonetti, crude condom gags, plenty of attractive babes in skimpy bikinis, a \"Jaws\"-style \"let's keep this homicide stuff quiet 'cause it's bad for business\" cover-up conspiracy sub-plot, more idiotic horny toad college revelers than you can shake an empty beer can at, and even a little gratuitous female nudity. The stand-out supporting cast adds greatly to the overall sleazy merriment: John Saxon lends his usual sturdy, hard-nosed, imposing presence as a mean, hectoring, buzz-crushing police captain with a kinky S&amp;M bondage fetish for chains, leather and dog collars, Lance LeGault gruffs it up nicely as a stern hell-and-brimstone preacher, and Michael Parks makes the most out of a miner part as a fidgety, alcoholic coroner. Okay, it sure ain't no work of immaculate art, but \"Welcome to Spring Break\" definitely does the trick as a pleasingly upfront and undemanding timewaster.","user":"Woodyanders","rank":[11,14]}]