[{"title":"Another take on the famous Leroux novel","rating":7,"date":"29 October 2006","review":"Each \"Phantom of the Opera\" deviates somewhat from the Leroux novel - with the original silent film with Lon Chaney perhaps being the exception. In the '40s Nelson Eddy version, the police chief and an operatic baritone are Christine's suitors instead of Raoul (though the baritone is named Raoul) and it's hinted that the Phantom is her father. His acid in the face was the result of a misunderstanding at the music publisher's.<br><br>In this particular \"Phantom,\" from Hammer Studios, the Phantom (Herbert Lom) has an Igor-type assistant, and here Christine's suitor is the manager of the opera house (Edward de Souza). There is also a real villain, a plagiarist in the form of Lord d'Arcy (Michael Gough). Most notably, it has a production of \"Joan of Arc\" with music written by Edwin T. Astley that is actually very pretty and beautifully sung.<br><br>Everyone does a terrific job in this - Gough is hateful as the supposed composer of the opera; de Souza is a hunk and a good romantic interest for Christine; and Heather Sears as Christine is very sweet and, like all Christines, lacking the diva quality her rival has. In this film, the rival singer is a very minor role. The dubbing of the voices is wonderful.<br><br>Herbert Lom, normally a comic character in the \"Pink Panther\" series, is a great phantom, performed at a time when the Phantom didn't have to be better-looking than the ingénue. The Phantom is not a huge role in this film, but an effective and highly sympathetic one. He seems a little less nuts than some of them, though he's clearly not completely there.<br><br>The final scene of this film is very exciting, and the final picture very powerful and sad. This is a really excellent version with not much emphasis on the horror aspects of the Chaney film. It has good production values and is very well directed.","user":"blanche-2","rank":[17,18]},{"title":"Atmospheric Opera Fun","rating":8,"date":"31 August 2001","review":"The novel The Phantom of the Opera has been filmed at least ten times plus now. This entry by Hammer Studios is one of the better ones, bringing a liberal change in storytelling as well as some very atmospheric settings and camera work. Directed by Terence Fisher, this film, like Fisher's The Gorgon, is highly poetic. The phantom is a former music professor who has been pushed into his life of seclusion and physical deformity. He is a figure of sympathetic pity rather than horror. It is this point of view which makes this film very interesting as the phantom is not the monster but rather just a man who has been mistreated trying to cope and resurrect his life. Yep, he still lives in the sewers of Paris. The Hammer sets are wonderful all around, particularly the opera house and the winding underground sewers. Hammer also puts their stamp of luxuriant looking cinematography on. Herbert Lom plays the man behind the mask. Lom does a nice job in the film as do all the leads. Heather Sears is a striking heroine, and Edward Da Souza makes an affable leading man. The real star, apart from Fisher's direction, is Michael Gough. Boy, can this man play a mean individual. Gough's screen time is magic as he malevolently belittles everyone around him, steals things that are not his, and lewdly leers at anything in a skirt! The film also boasts some fine staged opera numbers and a beautiful soundtrack. Many scenes show Fisher's competence and ability to create lush moods whilst being able to provide good storytelling.<br><br>A fine Phantom edition.","user":"BaronBl00d","rank":[14,15]},{"title":"Hammer horror does the Phantom","rating":9,"date":"7 October 2002","review":"This is the Phantom that scared the heck out of me when I was a kid, and comes in second after the classic Lon Chaney version.  It is the only color version that really works, here given that garish, over-the-top gothic treatment that worked so well for Hammer Studios.  It doesn't have the ponderous, plodding feel of the book or other versions, and follows through with a scary shot-in-the-arm or two.  More complete video stores should have this on the shelf.","user":"Greg-o-rama","rank":[22,26]}]