[{"title":"\"We can always try to forget our past\"","rating":6,"date":"19 January 2007","review":"While Gosta, a seaman, arrives in Gothenburg, a young girl, Berit, makes a suicide attempt in the city harbour. After saving her, a rather promising relationship seems to begin but much work needs to be done from both of them in order to be together. <br><br>In 1948, Ingmar Bergman seems already familiar with the themes that he will never stop examining throughout his career. He observes and studies human behavior in everyday circumstances, in an effort to get a glimpse of its roots. Berit is depressed, but her situation has a long story, starting from her childhood. Growing up with a mother that never cared for anything and anyone but herself and a father that had a problem hiding his temper, she ended up in a reform school and the implications are therefore predictable. Gosta has just finished working in the ships and he finds himself working in the docks of Gothenburg, despite his ambition for something bigger. They are both in the need of a clean start in their lives, carrying their burdens from the past on the left and their dreams for the future on the right. <br><br>When they first meet, they can't possibly imagine how similar they are. In fact, they seem incapable of realizing anything because of the wall they have built around them in order to protect themselves. But she desperately needs to free herself from her mother (who impersonates all of her past) and he desperately needs to find someone to relief him from his loneliness. So, they will fight through all the difficulties for these goals. Eventually, she will learn to have some faith in other people, he will learn to forgive and they will both learn to face the past. <br><br>This film also works on a political level as the story takes place among the dock workers struggling everyday just for the essentials. Bergman himself admits the influence that the Italian Neo-Realists had on him in his first films and Port of Call is a characteristic example. It is mostly shot on location and the work in cinematography is really admirable, the black and white photography and the camera movement is stunning and Bergman proves how talented he is when it comes to framing. The leading actors give notable performances, especially Nine-Christine Jonsson. <br><br>Overall, Port of Call is an interesting film, a typical example of the first period in Bergman's filmography that will reach its climax with \"Summer with Monika\". The story may sound clichéd and naïve at times, but it is its honesty that engages its viewers, as well as the masterful shots of the great Swedish director.","user":"theachilles","rank":[13,16]},{"title":"Port of Call","rating":9,"date":"24 September 2017","review":"After making it through many of the more well-known Ingmar Bergman films, I've turned my attention to early Bergman. This Ingmar Bergman retrospective has certainly been the one with the loosest viewing schedule, which isn't to the project's detriment. With a filmmaker like Ingmar Bergman, one with pronounced themes to his films, it is interesting to see how he carries out those themes in each period of his work. In his 1948 film, Port of Call, Bergman examined the intricacies of human existence through the eyes of a suicidal factory worker desperate to escape the weight of her overbearing mother. Starring Nine-Christine Jönsson and Bengt Eklund, Ingmar Bergman perfectly explores the struggle of living a life free of the strains of complicated human relationships and the prisons of our own minds that many are often unable to escape from.<br><br>Berit (Nine-Christine Jönsson) recently released from reformatory school following an attempted suicide, is back under the thumb of her manipulative and overbearing mother. She sees a way out when she meets Gösta, a man she is able to convince is the first one to experience her passions. Berit, unable to properly experience love, sees Gösta as, not only a way to break free from her mother's influence, but also to escape her laborious job at the factory. A marriage would also prove to Berit's social worker that Berit was establishing a stable foundation for herself and would be free from the threat of returning to the reformatory school. Her plans for freedom with Gösta are foiled, however, when he cannot forgive her past.<br><br>Family troubles, especially overbearing or neglectful parents are a constant theme in the films of Ingmar Bergman and apparently have been since his earliest features. The intricacies of familial disconnect are fascinating, and Bergman tunes into those intricacies in a way I have seldom seem from other filmmakers. One of my favorite aspects of Bergman films is how he illustrates the brokenness of people, and how that brokenness contributes to their inabilities to form successful relationships. I continue to be amazed how keenly Bergman tapped into the human spirit. Another mainstay in Bergman's filmography is how often he depicted people working jobs they don't like in order to maintain lives that were personally unfulfilling. Much like in Summer with Monika, our protagonists in Port of Call worked jobs that robbed them of their essential human fulfillment and left them in a constant state of emotional exhaustion. The only place to relieve the stresses of the world is in the cinema. The scene in which Berit has removed herself from every disappointment of existence when she is freely laughing in a crowded theatre was extraordinary. It reminded me of the scene in Louis Malle's Au revoir Les Enfants where the only place everyone was equal and could enjoy themselves was during a screening of Charlie Chaplin's The Immigrant. Cinema as an artistic medium has relieved the pressures of existence since its inception, and Ingmar Bergman films are no exception to this rule.","user":"oOoBarracuda","rank":[5,5]},{"title":"Personal freedom is a major theme of this lovely, bleak, but not pessimistic, early Ingmar Bergman movie","rating":5,"date":"5 September 2009","review":"Berit is a factory girl fresh out of reformatory school and fresh from an attempted suicide by drowning when she meets a sailor named Gösta at a dance club. He beds her down that night, and later, when the two become lovers, allows himself to assume that he was the first man to do so. Meanwhile, Berit is desperate to be free: free from the badgering and manipulation of the mother she is forced to live with, free of the dirty work of the factory and free of her social worker and the constant threat of returning to reformatory school. Her already unhappy life is complicated when an old friend from the school desperately needs her help.<br><br>Personal freedom is a major theme of this lovely, bleak, but not pessimistic, early Ingmar Bergman movie. We yearn for Berit to find freedom from her unpleasant life, and most of all freedom from loneliness, just as we hope Gösta can free himself from jealousy and the specters of long-gone rivals for his affections.","user":"J. Spurlin","rank":[5,5]}]