[{"title":"Impressive classic from the 1950s.","rating":8,"date":"9 February 2004","review":"Robert Lansing plays a scientist whose brother is trying to perfect a way to make solid objects pass through each other. Lansing finds out about his brother's radical concept and tries some experiments of his own. He succeeds so well that he takes the idea a step further: he makes himself pass through solid objects.<br><br>The process has an adverse affect on his mind, and he starts walking through the walls of banks at night, stealing the cash. Unfortunately, the use of his new power causes him to age rapidly, and the only way he can rejuvenate himself is to absorb life-energy by passing through another human being -- even though this kills the victim.<br><br>Robert Lansing's performance is quite good, and so are those of co-stars Lee Meriwether and Patty Duke (age 12). Robert Strauss (\"Stalag 17\", \"The Seven Year Itch\") is sadly miscast as an unscrupulous fellow scientist. Director Irvin S. Yeaworth, Jr. created a good film on a meager budget, just as he did with \"The Blob\".<br><br>The special effects are impressive (and in color), devoid of any cheap \"see-through\" superimposed images. Whenever Lansing walks through a wall, he looks like he's stepping into an opaque liquid. Watch for an eerie scene in which Lansing walks slowly across a room towards an intended victim, passing through tables and chairs.","user":"Bruce_Cook","rank":[36,37]},{"title":"Surprisingly effective little sci-fi'er","rating":7,"date":"13 November 2002","review":"Producer Jack Harris and director Irvin Yeaworth were responsible for two of the more off-the-wall sci-fi flicks of the '50s, \"The Blob\" and this one (they also did \"Dinosaurus,\" but that's a whole other story). Both films appear to have been made around the same time, in 1957; while \"The Blob\" was released then, this picture, for some reason, wasn't put on the market until two years later. Actually, all things considered, I think it's a better film than \"The Blob,\" although \"The Blob\" is actually more fun to watch. Lead actor Robert Lansing would at first glance seem to be an odd choice to star in a sci-fi movie; he was one of the more intense actors of his period, and you wouldn't think that his somewhat gruff demeanor and rugged, craggy looks would be the qualities you'd expect to find in an actor playing the lead in a sci-fi film; those parts were usually played by men who were more conventionally better looking than Lansing--and, frankly, younger. However, Harris and/or Yeaworth knew what they were doing when they cast him, as he fits this part to a tee; the coiled intensity he brought to all his roles really works here. His character is a basically good guy who lashes out when he discovers he's been betrayed (his ne'er-do-well brother steals his girlfriend) and in the process comes up with a scientific discovery that allows him to pass through solid matter. He also discovers that the side effects of this condition necessitate his draining the \"energy\" from others in order for him to survive. It's intriguing to watch Lansing's transformation from a decent if somewhat grouchy man to a homicidal, power-crazed \"mutant\"; where a sci-fi standby like John Agar would have either underplayed it or gone over the top, Lansing manages to strike just the right note, and really makes you pity, if not empathize with, the creature he's become.<br><br>Female lead Lee Merriwether has always been, in my opinion anyway, much underrated as an actress, being judged more for her status as a former Miss America than for her talent. However, she had a relaxed, naturalistic quality that many actresses with far more training and experience lacked, and I think it adds to the believability of the picture.<br><br>\"The 4D Man\" is no masterpiece, of course, but it's definitely one of the more intriguing, and thoughtful, sci-fi epics of the '50s. An interesting premise, very good special effects--considering the relatively low budget--solid performances and a much more adult tone than the usual '50s sci-fi flick make this a keeper. Check it out.","user":"frankfob","rank":[42,44]},{"title":"The 4D Man, some of the neatest special effects ever.","rating":8,"date":"12 April 2005","review":"Wow, I searched for years to get this on DVD. I first saw it back in High School on one of those midnight horror shows in Australia (Deadly Earnest was the host...anyone from Australia remember him??).<br><br>I remember being obsessed with the walking through walls special effect, the way in which bits of his clothing would appear first, then the rest of him.<br><br>It's funny how a film can stay with you from childhood. The day I got the DVD, I was stoked. Not the greatest film ever made, but I am a die hard fan. I admit to being surprised by the score, very jazzy for such a dark story. I thought Robert Lansing and the rest of the cast were cool. They gave some considerable depth to what was after all very much a 'B' movie.<br><br>Check it out!","user":"Fiend-Without-a-Face","rank":[31,32]}]