[{"title":"Who'd Be Selling Fish At THIS Hour?","rating":10,"date":"10 July 2001","review":"This is hardly an original insight, but anyone who dismisses Bob Hope as the tiresome, unfunny comic from those dreadful '60s 'comedies' he appeared in is missing out on a real national treasure - his films up to around 1952 are hysterically funny, and his ROAD entries with cohorts Crosby and Lamour are among the best of 'em. Hope, along with the brilliant Preston Sturges, had restored Paramount to the comedy throne they'd occupied in the early 30s; from the lavish budget and attention to period detail throughout UTOPIA, it's obvious that the studio was not ungrateful. For my money, ROAD TO UTOPIA is the funniest film he ever made (though there are half-a-dozen others close on its heels). As in all ROAD movies, the engine powering the vehicle was the lightning-quick banter between the two leads; Crosby smooth as snake-oil , Hope perpetually suspicious and cowardly. And with excellent reason, as no straight man ever victimized a foil the way Bing routinely does to Bob. ROAD movies always threaded their satires of B-movie plots (this one spoofing Robert W Service-style frozen-North melodrama) with plenty of topical humor, much of it capitalizing on the fans' awareness of the stars' personal foibles (Crosby's rivalry with Sinatra, his investments in thoroughbreds, Hope's disastrous box-office returns in LET'S FACE IT), and there's a goodly amount of what later generations referred to as 'breaking the fourth wall' ( they talk directly to the audience at varying points). What elevates UTOPIA over the others is the sky-high breezy confidence of everyone involved this go-around. The cast and crew, coming off ROAD TO MOROCCO, were on a roll and knew it and they ride that momentum for all it's worth, Hope's constant kibitzing particularly hilarious from start to finish. Der Bingle gets to groan a couple of subpar songs (as opposed to MOROCCO's highlights - 'Ho Hum' and 'Moonlight Becomes You' - this outing's 'It's Anybody's Spring' and 'Welcome To My Dream' are instantly forgettable) but the team's 'Put It There, Pal' is infectious fun and Miss Lamour's 'Personality' is sexy and sprightly. A further note on Lamour - she's luxuriously beautiful here, an ice-cream sundae with curves (why she's never ranked with the decade's top screen sirens is unfathomable: she's every bit the looker that Lake, Grable, Hayworth &amp; Sheridan were, and a better singer besides). My apologies for not quoting any of the zingers from the script, but there are just too many of them to play favorites with. ROAD TO UTOPIA is well worth the effort it'll take you to track down; get cracking.","user":"fowler1","rank":[21,21]},{"title":"Delayed Road trip.","rating":9,"date":"23 June 2004","review":"Road to Utopia was one of several films made during World War II and shown to GIs before reaching the civilian public. Saratoga Trunk and The Two Mrs. Carrolls are two other examples. We have some evidence for this statement. First and foremost Robert Benchley died a year before<br><br>the film had it's premier at the New York Paramount on February 27, 1946. Benchley, noted humorist and sometime film actor, provided some off and on-screen narration for the Crosby and Hope monkeyshines. He was reputed to be a big fan of both and I think he just wanted in on the fun.<br><br>Also, Crosby recorded most of the songs for Road to Utopia on July 17, July, 19 and December 8, 1944 at Decca studios. The song Personality wasn't recorded by him until January 16, 1946, however in the film, Dorothy Lamour sang it. <br><br>It was worth the wait for the civilian public. By now the boys had the surreal nonsense down pat. Dorothy Lamour plays Skagway Sal who's father is murdered in the first minutes of the movie by killers Sperry and McGurk. Dotty beats it up to Alaska to look up Douglass Dumbrille, her dad's best friend for assistance. As Douglass Dumbrille invariably does in these films, he's looking for the goldmine her father left for himself.<br><br>The killers take the next boat with the map that they stole from Dad in hand. But they don't reckon with the sharpie and the schnook who have stowed away on the boat to Alaska. Crosby and Hope steal the map and the killer's identity.<br><br>The plot I've described so far could be a melodrama, but not in any film with the title beginning \"Road to......\" Between talking bears, talking fish, and a cameo appearance by Santa Claus the laughs come fast and furious.<br><br>Jimmy Van Heusen and Johnny Burke wrote the songs for this surreal madcap and gave Dotty two songs, Would You and the aforementioned Personality. Crosby got his ballad, Welcome to My Dream, and a philosophical song, It's Anybody's Spring. The last one he sang on board on a ship talent contest with Hope accompanying him on the accordion. They lost to an organ grinder and a monkey which prompted Hope to comment on the next road trip he was bringing Sinatra.<br><br>And Crosby and Hope sang Goodtime Charlie which didn't make it to vinyl and Put It There Pal probably the best known of the duets they sang together in the Road pictures. Lots of dated references in the lyrics there to Crosby's horses and their respective radio sponsors. But today's audiences would still enjoy it.<br><br>One interesting fact was that the Catholic Legion of Decency a very powerful group in those days made objections to suggestive lyrics in Personality. Hard to believe in this day and age, but as another songwriter a generation later put it, \"the times, they are a changin'.\"<br><br>Road picture references are sometimes dated, but the laughs are eternal.","user":"bkoganbing","rank":[23,24]},{"title":"very entertaining","rating":8,"date":"23 October 2005","review":"'Road to Utopia' is a musical comedy starring two performers who are caught up in a conquest to find gold in Alaska. 'Road to Utopia' is a highly entertaining film, and it's easy to get caught up in the adventure.<br><br>Some of the comedy elements in the film are probably a little bit dated, but those that are not dated and still very funny and witty. (These include the narrator comments directed to films, the Paramount mountain, the talking animals, and the Santa figure emerging from the Alaskan landscape with gifts for Crosby and Hope). The music is also dated in terms of what traditional audiences enjoy today, but I still thought it was done very well and played an important part in the story.<br><br>'Road to Utopia' is enjoyable, and it is highly recommended. If you're tired of all the films made in the past 20-30 years, this is a gem.","user":"rebeljenn","rank":[19,20]}]