[{"title":"A bad day, a superb film","rating":15,"date":"15 May 2004","review":"John Sturges directed this quintessentially tight-constructed masterpiece. This is how it was done in the good old days: nothing falls by the wayside. Tight, clear characterizations, with minimalist dialog, costume, manner, and facial expression all reflecting the inner lives of people in their self-constructed hell. Check out how Hector (Lee Marvin) uses the word \"boy\" to suggest racial overtones well in advance of the slowly-revealed background plot; how Macreedy (Spencer Tracy) in his dark suit and no-nonsense manner contrasts with everyone else's casual dress and edginess, perfectly reflecting his role as avenging angel; how Coley (Ernest Borgnine), trying to run Macreedy off the road, resembles (probably unintentionally) Joe McCarthy, especially as caricatured by Walt Kelly; and of course how the arch-villain, Reno Smith (Robert Ryan), suggests limitless power with his inimitable smirk and almost languid movements: he controls the town without actually doing anything overt--until Macreedy forces his hand. Nicely turned performances by other major players, too: Dean Jagger (the drunkard Sheriff Tim), Anne Frances (nervous Liz), and Walter Brennan (loquacious, self-justifying Doc). The suggestion that one man can--literally single-handedly--make a moral difference is inspiring (and how that one hand utterly confounds Coley is a nifty, low-key precursor of Bruce Lee-inspired acrobatics). This is a keeper.","user":"pj-103","rank":[123,148]},{"title":"A Classic","rating":9,"date":"12 March 2004","review":"A film of rare economy, elegance and stillness. Pretentious as it may sound, there's a perfect balance of tension and space about this film. Not a word or scene or character is wasted or unnecessary.<br><br>The other reviewers here give a plot outline and performance details. Tracy dominates the picture, his black and white appearance setting out the clarity of his moral position. The other main presence in this classic picture is the silence. Sturges SHOWS us silence, and what denial can do to a community. <br><br>I'd just like to make a recommendation to those who think that great cinema need sound and action - watch Bad Day at Black Rock, and sink yourself into its opening emptiness and cut-to-the-bone story.<br><br>9/10","user":"Parthurfilm","rank":[98,120]},{"title":"Legendary actor Spencer Tracy leads notable cast in unmissable film","rating":10,"date":"29 November 2000","review":"\"Bad Day at Black Rock\" is only a short film by present day standards (at just 81 minutes) but in that time it manages to pack in more intrigue, mystery and action than many Hollywood films of two hours or more. Expertly directed by John Sturges in breathtaking colour and CinemaScope the film holds your attention throughout its tight running time. \"Bad Day at Black Rock\" has an exceptionally talented supporting cast including Robert Ryan, Ernest Borgnine, Lee Marvin, Anne Francis, John Ericson, Dean Jagger and Walter Brennan who all give accomplished performances - particularly the baddies Ryan, Borgnine and Marvin.<br><br>Spencer Tracy was deservedly nominated for the Best Actor Award but unfortunately for him 1955 was a very exceptional year with so many fine performances from other actors including Ernest Borgnine in \"Marty\" (the winner), James Cagney in \"Love Me Or Leave Me\", James Dean in \"East of Eden\", and Frank Sinatra in \"The Man With the Golden Arm\". Tracy had in fact won the Best Actor Award twice before - for \"Captains Courageous\" in 1937 and for \"Boys Town\" in 1938 so his memorable screen acting had already been recognised by the Academy voters two years running.<br><br>Tracy plays the mysterious John J. MacReedy who arrives at the small Western town of Black Rock causing suspicion and concern among the local residents who are hiding a dark secret which MacReedy eventually uncovers. Robert Ryan (Reno Smith) is the chief heavy well supported by his two menacing henchmen Ernest Borgnine (Coley Trimble) and Lee Marvin (Hector David) who are intent on getting rid of Tracy one way or another. Insults and intimidation seem to have no effect on Tracy who is determined to carry on with his one man investigation against all the odds. With the eventual help of Anne Francis (Liz Wirth) and Walter Brennan (Doc Velie) Tracy doggedly pursues his mission through the 24 hours period of the film. When threats and violence won't stop Tracy then Ryan has to resort to attempted murder leading to the dramatic climax.<br><br>Some favourite lines:<br><br>Tracy (to Marvin): \"I don't know why you're so interested but the name is MacReedy. It's all in the ledger\".<br><br>Borgnine (to Tracy): \"Well, if it's not MacReedy, the world's champion road hog\".<br><br>Walter Brennan (to Tracy): \"They're going to kill you with no hard feelings\". Tracy: \"And you're going to sit there and let 'em do it!\".<br><br>Train Conductor: \"What's all the excitement? What happened?\". Tracy: \"A shooting\". Train Conductor: \"Thought it was something. First time this train line has stopped here in four years\". Tracy: \"Second time!\". (Last line in film).<br><br>\"Bad Day at Black Rock\" is a superior high class thriller that deserves to be in anyone's \"Top Ten\" list of all time classic films.  It's certainly in mine!   10/10.   Clive Roberts.","user":"clive-38","rank":[70,89]}]