[{"title":"One of the Most Entertaining Movies Of Its Genre","rating":31,"date":"31 May 2005","review":"This classic version of \"House on Haunted Hill\" is one of the most entertaining examples of the low-budget, black-and-white horror films that used to be such a mainstay for movie fans. It has few frills, but it does have some thrills, and in particular it has a cleverly written story that is told at a brisk pace, with a good deal of interesting and pleasingly macabre detail.<br><br>Horror legend Vincent Price is in his element as the mysterious millionaire who invites a houseful of guests to spend the night in a supposedly haunted mansion, and his performance will give his fans everything that they expect. The supporting cast is solid, led by Elisha Cook, who is very good as a nervous, tipsy character whose rambling proclamations of doom add the right touch of offbeat suspense. The settings are given plenty of detail that makes the characters' explorations of the house even more interesting.<br><br>The story is nicely written for the genre, making very good use of the possibilities in the setup, throwing in some good turns, and resolving everything in a resourceful fashion. And it's not without some real suspense - even those who normally watch low-budget horror features solely for the camp factor might get an actual start once or twice as everything plays out. And even if you don't find anything scary, there is plenty here that makes it enjoyable to watch.","user":"Snow Leopard","rank":[79,89]},{"title":"Vinnie Throws One Heck of a Party!","rating":6,"date":"6 February 2000","review":"Vincent Price asks five strangers to spend an evening in a haunted house for ten thousand dollars a piece.  With his estranged wife in tow, the seven house guests begin a nocturnal odyssey of mayhem, murder, and the macabre. This film is a great vehicle for Price's unique talents as an actor, and is also a very atmospheric film due in large part to the direction of William Castle.  Castle gives us all kinds of horror in the traditional vein...a severed head, a skeleton, the screaming-without-end hysterical young woman, the plot twists and turns, and the firmly planted tongue-in-cheek.  The cast is very good, with Carol Omhart, as Price's elegant and gorgeous wife, and Elisha Cook, as a drunken sot who continually rants about all the evil that has happened in the house, as standouts.  This is a great Halloween film, or one that you turn off the lights to watch.","user":"BaronBl00d","rank":[44,48]},{"title":"Fantastically entertaining camp classic! A must see for all horror fans.","rating":28,"date":"28 October 2002","review":"Forget the awful, senseless remake, the original 'The House On Haunted Hill' is one of the most entertaining and enjoyable chillers of all time. William Castle's over the top camp style is an acquired taste for many, but once you enter into the spirit of things you're in for a wild, fun ride. The legendary Vincent Price is in his element here as the cynical millionaire trapped in a loveless sham of a marriage, and Carol Ohmart, who I have only ever seen in the cult classic 'Spiderbaby', is a knockout as his tough as nails \"better half\". Their haunted house party guests, led by the much loved character actor Elisha Cook, Jr ('The Maltese Falcon' ,The Killing',etc.etc.), are well cast and amusing, and the whole thing is a hoot! I recommend this movie to all horror fans. It is quite possibly the single most entertaining horror thriller of the 50s. Supremely silly but still scary at the same time. Great stuff!","user":"Infofreak","rank":[67,79]}]