[{"title":"Flubber Byproduct","rating":7,"date":"29 May 2007","review":"By the time Son of Flubber was released by Walt Disney in 1963, Fred MacMurray was firmly established in the third phase of his career as star of G-rated Disney films and television situation comedies. MacMurray was able to do this because of a unique clause he had written into his contract with CBS which produced the My Three Sons show that he starred in for a dozen or so years. All of MacMurray's scenes in all episodes were filmed at the beginning of the cycle so as to allow him to do those Disney films as well. It worked out great for him.<br><br>Disney took virtually the entire cast of The Absent Minded Professor and added several new faces as well. In the previous film, MacMurray revolutionizes rubber by making a substance that bounces higher with each bounce than lower. That film ends with MacMurray flying to Washington in his Model T (you read it right) to give flubber for the defense of the free world.<br><br>But Washington, DC red tape being what it is MacMurray and his new bride Nancy Olson aren't seeing any money any time soon. But not to worry, Fred's found a byproduct of flubber that he calls flubber gas. A lighter than air substance that really makes anything fly.<br><br>In the first film, MacMurray used his college's basketball team as a test for flubber. In Son of Flubber, flubber gas is tested during a football game with the same hilarious results. In fact more so because in this film Paul Lynde is the stressed and harried play by play announcer of the college football game. For me he's the highlight of the film.<br><br>In Son of Flubber, Disney gives us an entertaining and worthy successor to the Absent Minded Professor that after almost fifty years will still appeal to anyone not made of stone.","user":"bkoganbing","rank":[16,17]},{"title":"Light-hearted fun if you don't take it too serious","rating":6,"date":"9 August 2008","review":"There is no disguising that this is an obvious attempt on Disney to cash in on the success of \"The Absent Minded Professor\" made 2 years earlier. No one can fault them for that - however, there seems to be little originality in this version. You would think they would have made a greater attempt at new gags and originality. Unfortunately, that is not the case.<br><br>There is the same sports scene set-up. In AMP it was a basketball game. In SOF it is a football game. There is the same romantic rivalry between Brainard (Fred McMurray) and Professor Shelby Ashton (Elliott Reid), over Brainard's wife, Betsy (Nancy Olsen). They do throw in a 4th party in this film for good measure -Desiree de la Roche (Joanna Cook Moore) - as Brainard's old flame who has her sights set on him again. There is another prank on Professor Shelby while he is driving in his car (this time its filling with water from a Brainard created rain cloud inside the car). You still have Alonzo Hawks (Kennan Wynn) trying to destroy Medfield College by calling in their overdue loan. You have the same cops from the prior moving getting their new squad car destroyed again. So as you see, not a lot of originality here.<br><br>The worst scene in my opinion is the ending of the court room scene. The giant fruit and the marching band were way over the top. I did like the stunts on the football field, however. Some of the jumping and flying ball players looked very realistic. I also liked the closing shot of the satellites, the flying football, and earth in the background. Pretty good special effects.<br><br>It is interesting that McMurray was an accomplished saxophone player, so look for him playing the actual music during the Halloween party. Also, Paul Lynde makes his film debut in this movie. I liked seeing William Demarest (later to be Uncle Charley on \"My Three Sons\") in a small role that matches him up with McMurray. He doesn't begin \"MTS\" until 1965 which is 2 years after this film. Also, you may remember Joanna Cook Moore as the actress that played Andy's girlfriend Peg on \"The Andy Griffith Show\" for 4 episodes in 1962. Perhaps it helped her land this role. She has another claim to fame - she married Ryan O'Neal in 1963 and is the mother of Tatum O'Neal.<br><br>Overall, this sequel doesn't play quite as well as the first. It is still entertaining in places and has a host of noteworthy supporting players.","user":"PudgyPandaMan","rank":[8,9]},{"title":"much more entertaining than the Prequel,The Abesnt MInded Professor (6.5/10)","rating":7,"date":"23 November 2008","review":"this sequel to The Absent Minded Professor is actually a better movie.i found it funnier,more entertaining and it had a better story.the character were expanded a bit more,which makes sense,since it is a sequel.unlike Professor,this one doesn't have any slow or boring moments.it's much better paced.i like the fact that the wife had more to do in this one.the movie is just as silly,but it's meant to be,and if you keep that in mind going in,you'll probably enjoy it more.it's not high art or anything,but it will keep you entertained for 102 minutes or so.and it's fun for the whole family.my vote for The Son of Flubber:6.5/10","user":"disdressed12","rank":[9,12]}]