[{"title":"TOP GUN rocks, plain and simple","rating":5,"date":"5 August 2003","review":"I can't believe the reviews I have read about Top Gun being technically inaccurate, not enough character development, an overall simple and childish plot... gimme a freegin' break! This film was made to look cool, sound cool, and define cool. Yeah, okay, the MiG-28s are really F-5 Tigers; I've read the 'goofs' section before. And Tom Cruise's height. And about 'Maverick going supersonic - I'll be there in 30 seconds,' and the laws of physics preventing him from covering 200 or so miles from the carrier in that time. Whatever! So what! If Top Gun had tried to be accurate and true-to-life in every respect, it would have been some oh-so-serious flick like Courage Under Fire. Here's some examples of what I mean:<br><br>1 - what's the best way to evade cannon fire? Do a snazzy barrel roll. Problem solved!<br><br>2 - the MiG pilots have tinted visors. The good guys don't. Go figure.<br><br>2.5 - Russian planes are actually grey or green. The MiG 28s are black. The Tomcats are... yeah, you guessed it... white! Good vs. Evil.<br><br>3 - Modern air-to-air combat is usually fought at distances of tens of miles between aircraft. Top Gun uses much cooler spitting-distance WWI era tactics.<br><br>4 - \"It's too close for missiles. I'm switching to guns!\" Enough said.<br><br>5 - the generic guy carrying coffee who gets knocked over by the fuming air-control officer. We never see him get up. Classic.<br><br>6 - even the edited TV version is a few steps above normal-cool. \"... you'll be flying a cargo plane [edit]... out of Hong Kong!\"<br><br>7 - the way Iceman says, \"Mayday, Mav's in trouble. He's in a flat spin, and heading out to sea.\"<br><br>8 - the graceful way Top Gun maintained a PG rating, without using the F-word once.<br><br>Top Gun came out in 1986. That's 1986. Seventeen years ago. It rocked then... it rocks now. Just watch it and have some fun.","user":"Artdoag2","rank":[429,534]},{"title":"I always liked a bit of cheddar","rating":9,"date":"30 April 2004","review":"Absolute cheese on a stick, but Top Gun proves that that's not always a bad thing. This movie's got everything - an arrogant prodigy who'd be out on his arse if he wasn't so good, a sensible, uglier best friend, a love interest (although she's a bit of a mess), an arch nemesis and his dumb sidekick, a few cool high fives and catchphrases, an emotional death scene, a euphoric victory scene and of course, some unforgettable action scenes. What more could any red-blooded child of the eighties ask for!? And anyone born around 1980 will remember how everyone was doing that double high five and saying 'talk to me, goose' to the kid next to them in class. Certainly one of my all time favourites.","user":"punkmacinally","rank":[210,262]},{"title":"And all the Air Force got was \"Iron Eagle\" .....","rating":3,"date":"3 November 2002","review":"If there's ever proof of the cachet of Naval Aviation, this is it. Those poor Air Force guys got a trio of \"Iron Eagle\" flicks that went from bad to horrible, whereas the Navy flyboys got this great 1980's classic. Sure, it's cheesy and corny, but it makes the cheese and corn taste pretty damn good. A cynic might argue that it's just a two hour long Navy recruiting ad (one that worked for me, two years later I found my ass in Pensacola sweating through AOCS, short for Aviation Officer Candidate School, the program immortalized in \"An Officer and a Gentleman\") but by making a pro-Navy movie, the filmmakers also got invaluable technical assistance from top Navy aviators, and it shows.<br><br>For starters, although this movie takes numerous liberties in order to entertain, the basic setup, in which fighter pilots from the fleet get sent to NAS Miramar, aka, \"Top Gun\" for intensive training, is 100% accurate. The Navy, back during Vietnam, was getting sick of losing too many pilots in air-to-air combat. The problem, they discovered, was their fighter jocks had been trained for purely long-range missile interceptions, meaning they'd lost their dogfighting skills. And, in Vietnam, several American planes were accidentally shot down by their own side by missiles, so, as a safety factor, enemy planes had to be visually identified, meaning American pilots were back to engaging the enemy at short range, hence the need for dogfighting. The \"Top Gun\" school was started as a result, and the rest is history.<br><br>Now, back to the movie. Tom Cruise is Maverick, a hotshot pilot but also somewhat unstable. If \"Risky Business\" launched his career as a movie star, then \"Top Gun\" cemented it. Guys wanted to be like him, and women of course lusted after him. The plot is pure formula, but executed with consummate professionalism. The team who put this movie together knew exactly how to push all the right buttons. But the crème de la crème is surely the flying. I don't think that any movie, before or since, has ever rendered air combat in a more convincing and dramatic fashion. For nearly 100 years fighter pilots have been the modern equivalent of olden knights, men who brought a sense of glamour and romance to the deadly art of war, and this movie gives them a fitting tribute.<br><br>8/10","user":"ericjg623","rank":[179,223]}]