[{"title":"The Nun's Story","rating":8,"date":"13 June 2008","review":"Jacques Rivette's La Religieuse (The Nun), 1966 is the adaptation of Denis Diderot's novel (1760). The movie tells a harrowing and simple story of 16 year old Suzanne Simonin (played by incredible Anna Karina), who is forced by her mother to enter a convent where she undergoes a lot of suffering including beatings, humiliations, semi-starvation, lesbian attentions from the Mother Superior (charming Liselotte Pulver of Das Wirtshaus im Spessart) and attempted rape by a priest. Made by the acclaimed New Wave director, \"The Nun\" feels more like a traditional (in the best meaning of this word) film, linear, poetic, moving, and very sad. Even before the film was completed and shown to the viewers, the association of former nuns and the parents of students in \"free\" schools demanded a banning order. This film was met with great controversy upon its release and was banned despite initial approval. Ironically, the scandal had benefited to the increased interest for the novel - many copies of Diderot's book were sold following the banning of the movie. Despite its controversy, the movie is not so much a criticism of the Catholic Church but more a condemnation of the society in which a woman had only two choices allowed by her family - marriage or the convent.","user":"Galina_movie_fan","rank":[13,13]},{"title":"the feminine control factory of 18th century and beyond","rating":10,"date":"28 January 2009","review":"The Nun might be just another very good, possibly excellent and heartbreaking piece of \"religion is rotten and the people in it control people in terrible and soul-crushing ways\" movie-making akin to Carl Dreyer if not for its last third or maybe second half (it's something of that length). For a good while Jacques Rivette's film from the book by Denis Diderot is about Suzanne (Anna Karina), a young woman who is passed along from her parents, one the mother wanting to go to the afterlife \"clean\" without the burden of her sin which was connected to Suzanne's father not really being her father, to a convent and forced to say she will be celibate and devout and all that jazz. Jazz as in life as a nun, forced to say that she believes wholly in God and will deny herself everything in order to serve him- when he calls or feels like it of course.<br><br>In this first half or so the film is about as close as one can get outside of Carl Dreyer to it being about the pain inflicted upon an innocent in a world dominated by a) a natural prejudice towards women, in this case to go completely rigidly by the rules - or, b) for that matter, a hell placed upon those who *dont* want to be nuns and just want to experience something else in the world. We see Suzanne subjected to this convent at first run by a helpful and loving Mother Superior Mme de Moni only to die and her replacement be so hard-pressed as to eventually see Suzanne as being possessed by a devil, keeping her away from the other nuns, locked up without food or water, or any legal counsel. <br><br>This part seems straightforward as does the eventual Priests-find-out-Mme-is-unrelenting-and-transfer-her story progression... but something very fascinating happens, something that makes The Nun from what is already a heart-rending and tasteful story of repression and super 18th century Christian fervor into a great film. The second convent, on first appearance, is total bliss compared to the former one. Suzanne is treated to happy nuns, a happy Mother Superior Simonin, and even some lighthearted revelry like playing games outside, something that would have never happened at the previous convent. But there's also an underlying uneasiness that is confirmed by the Mother Superior being, how should I say, \"clingy\" to at first Suzanne's story and then Suzanne herself. <br><br>It's not just enough for Rivette, by way of the book, to show religion being domineering and cruel and at best complacent in the expected sense, but for another look at what should be religious organization run by caring and spiritual people to be also total kooks. It's like Rivette puts down this section of some fun like the slightest of reprieves and then to bring it back under the rug, and it's something really special to see. It's a bleak story not simply because a woman who has no rightful place in a convent of nuns is forced into it and made into another cog in the religious machine, but for the lack of hope conveyed in what good there is, the goodness of people devoted to a life of faith, that is revealed. It's an incredibly precise indictment on organized religion and society that allows how it runs as much as captivating morality drama.<br><br>The Nun can also be read as a searing feminist statement, but going into this part might make this too long a review. Suffice to say The Nun, a controversial film (at the time) made from a controversial book of its time, conveys what it wants to say in stark locations and even starker performances from the supporting cast. The two actresses playing the significant Mother Superiors in the story deserve credit, yet the main reason to see the picture is for Anna Karina. She makes a sense of purpose in every scene, a performance that is startling for it being so removed from ex-husband Godard's usual self-conscious comedy/dramas and into something that requires her to plunge the depths of whatever she can handle emotionally for the character. It turns out to be the best serious performance of her's I've seen to date outside of maybe Vivre sa vie. Suzanne, thanks to Karina, is so sad a character, so right in her common sense and driven almost mad by this rigid and monstrous Christian dogma that you cant take your eyes off her for a second. It's rare to see a performance this tender and selfless to the dark and light in human being. A+","user":"Quinoa1984","rank":[25,29]},{"title":"A Major Work of the French Cinema","rating":8,"date":"31 August 2018","review":"During the 17th and 18th centuries it appears to have been quite common in Catholic countries for young women to be forced to enter convents against their will; this is, for example, the fate of one character in Manzoni's \"The Betrothed\", written in 1827 but set around 200 years earlier. \"La Religieuse\" by Denis Diderot is another work of literature which deals with the same problem. The main reason for this phenomenon was economic; although many convents required a \"dowry\" from prospective entrants, this was generally less than the amount of the dowry needed to attract a suitable husband, and once the girl had taken her vows the family no longer had any responsibility for her upkeep. In the case of Diderot's heroine Suzanne Simonin, however, there is another problem. She is the offspring of an extra-marital affair and her mother's husband is not her biological father. Suzanne's mother, therefore, resolves to shut her daughter up in a convent, partly because she believes that this will prevent her husband from discovering the truth, partly because the presence of the girl in the family home is a constant reminder of her adulterous affair, about which she now has a guilty conscience. <br><br>The film follows the unhappy Suzanne's life as a nun. It falls into three sections, corresponding to the three Mothers Superior under whom she serves. The first, Madame de Moni, is a kindly woman who knows that Suzanne has only entered into the religious life with great reluctance and does her best to make the girl's life bearable. When de Moni dies, however, the new Mother Superior, the fanatical and puritanical Sister Sainte-Christine takes a dislike to Suzanne, whom she sees as rebellious, treating her harshly, whipping her, putting her on a diet of bread and water, and forbidding the other nuns to have anything to do with her. (Sainte-Christine is also referred to by her family name, Madame de Tourmont, a name probably chosen because of its similarity to \"tourment\", French for \"torment\"). <br><br>With the assistance of a sympathetic lawyer, Suzanne asks to be released from her vows, on the grounds that she was forced to become a nun against her will. This application is unsuccessful, but at least she is transferred to another convent. Sainte-Christine is reprimanded by the Bishop for her treatment of Suzanne, but is not otherwise punished. This change in Suzanne's fortunes, however, is not necessarily for the better. Whereas Sainte-Christine's regime was characterised by an excess of religious zeal, life in the new convent is marked by an almost total lack of it. The nuns pay only the bare minimum of attention to their religious observances, spending most of their time in gossiping, eating and drinking and frivolous entertainments. Suzanne is befriended by the Mother Superior Madame de Chelles, who despite her elevated rank is a gay (in the original sense), light-hearted young woman, not much older than Suzanne herself. What the naive Suzanne fails to realise is that her new friend is also gay in the modern sense of the word and is offering her rather more than platonic friendship. <br><br>There are some excellent performances, from Anna Karina as the naïve but spirited Suzanne, Liselotte Pulver as the hypocritical de Chelles, Francine Bergé as Sainte-Christine and Francisco Rabal as Dom Morel, a priest who offers to help Suzanne but might also have self-serving motives. For a French movie this one is surprisingly international- Karina was Danish, Pulver Swiss and Rabal Spanish. Another important role is played by the German Wolfgang Reichmann. <br><br>When this film was made in 1966 it was promptly banned by the French authorities. It might have been the swinging sixties in the Anglo-Saxon world, but De Gaulle's France was a surprisingly conservative place. The authorities objected to what they saw as a disrespectful attitude to the Catholic Church, even though the action takes place 200 years in the past and the events depicted are fictitious ones. The film, however, is not particularly erotic; in Diderot's novel Suzanne and de Chelles actually end up in bed together- the younger girl is too innocent to realise what is happening to her- but this scene is omitted from the film. <br><br>The decision to omit this scene was, I think, the correct one, as \"La Religieuse\" was not made as a soft-porn fantasy but as a serious examination of three different types of religious hypocrisy, that of de Chelles, that of Suzanne's parents and that of Sainte-Christine, whose treatment of Suzanne owes more to an innate sadism than it does to genuine religious fervour. The serious nature of the film is emphasised by the austere look which director Jacques Rivette brings to it. Most of the action takes place in enclosed rooms, giving it a claustrophobic feel, and the predominant colour is the grey of the convent walls and of the nuns' habits. The moral climate in France gradually became more liberal, the ban was soon lifted and today \"La Religieuse\" can be seen as a major work of the French cinema. 8/10","user":"JamesHitchcock","rank":[8,8]}]