[{"title":"Germany, bleak father;","rating":8,"date":"26 June 2007","review":"Supposing this comment was not about \"Fatherland\", what would the sentence \"Berlin filmed in the final years of its partition\" call to mind? I am pretty sure most film fans would answer \"Wings of Desire\", Wim Wenders' iconic portrait of Germany's former (and future) capital. Few would think of Ken Loach and his mostly overlooked 1986 \"Fatherland\". And yet, this modest movie is as eloquent - not to say more - as Wenders' creative allegory of the Berlin of the late eighties, a couple of months before the fall of the disgraceful Wall. In \"Fatherland\", both the East and the West Side of the cities are shown in a very documentary-like style, including the Wall that parts them, complete with its checkpoints, watchtowers and memorial crosses at places were \"defectors\" got gunned down. And did you know that half a dozen of the technicians who worked on \"Fatherland\" would embark on Wim Wenders' \"Wings of Desire\" one year later? <br><br>The story (for there is one) concerns a protest singer by the name of Klaus Drittemann (his second name meaning \"Third Man\", an obvious allusion to Graham Greene, Harry Lime and another German city partitioned after the war, Vienna). An East German citizen, Drittemann has annoyed the communist authorities with his committed songs so much so that he is now banned from performing on the scenes of his country. Worse, he is forced to emigrate to West Berlin, leaving his wife and little boy behind. Across the border, he is awaited by the executives of an American record company who are eager to turn his \"defection\" into big bucks and untold political propaganda. But Klaus won't be exploited so easily and soon proves more interested in tracking down his father, a concert pianist who also left his family in East Berlin and who has disappeared for a decade.<br><br>This first part of the film rings amazingly true and it is easy to figure out why. As a matter of fact, \"Fatherland\" tells the true story of his main actor, Gerulf Pannach. A protest singer himself in East Germany, jailed in the seventies, forced to emigrate to the West; Pannach performs his own songs, the most remarkable of which being his aptly titled \"Singing the Blues in Red\". The icing on the cake is that Gerulf Pannach is an excellent actor (although this was to be his only appearance on the silver screen) and he brings a note of brooding determination and ironic disillusionment that enriches his character. On the other hand, in this first half, Loach manages to present the two sides in an impartial way, putting forward their mutual good and bad points. This is made possible thanks to Klaus Drittemann/Gerulf Pannach's attitude, at ease neither in the communist nor in the capitalist system. <br><br>The second part, although more suspenseful than the former one, is a bit baffling at first. With Klaus in search of his missing father, isn't Ken Loach starting a new, independent story and losing the thread? Indeed, he has his main character leave Germany for England, on more familiar ground, the viewer thinks a bit ironically. A new character is even introduced, Emma, a French-Dutch journalist, who has found out the address of Drittemann's father, now living in hiding in Cambridge as James Dryden. But as soon as the conversation between the Harry Lime-type father and his son starts everything finds itself in its place again: the issue is Germany and how free people can get in a place where they can be under the yoke of Nazism, Communism or Capitalism. Besides that this second section is enhanced by the presence of Fabienne Babe, a fresh unaffected actress who does justice to a role which is not without ambiguity.<br><br>All in all, this is a thought-provoking, historically important work that would deserve to be better known.","user":"guy-bellinger","rank":[17,18]},{"title":"On personal integrity in oppressive regimes","rating":7,"date":"22 June 2011","review":"Although the film Fatherland is made by the Englishman Ken Loach, it is essentially located in Germany. Part of the dialogs are in fact in the German language. It is striking that I could not buy the film on Amazon.co.uk, and eventually found it in the megastore Dussmann in Berlin. Fatherland looks like a low-budget produce, just like many other Ken Loach movies. It lacks spectacle and glamor. Nevertheless, Loach invariably is talented in the selection of his themes. Here the subject is living under conditions of oppression, and maintaining ones personal integrity. The main character is Drittemann, who is a singer in the former German Democratic Republic (GDR, or in German DDR). In his song texts and interviews he rebels against the regime, and as a result is constantly threatened by the prohibition to travel, occupational expulsion or even imprisonment. On the other hand, he is devoted to his country and therefore can rely on some sympathy, even within the regime itself. Eventually, the regime gives him the choice: back down (make excuses etc.), or be exiled to the west (without his wife and son). Being unable to adapt socially, he prefers the latter. Of course the authorities in West-Berlin want to hail his defection as a victory of their system. However, this is not so easy. Although the dissidents, fighting their system like an underdog and Don Quichote, naturally obtain our warm sympathy, their personalities are usually highly unpleasant, rude, asocial, pigheaded and egocentric. For it are these character traits, that allow them to remain dissidents. Dissidents are innate quarrelers, without proper leverage, bordering on mental disorder. When Solshenitsyn finally emigrated to the USA, he immediately turned into a severe critic of the American way of life. Soon the mutual love waned, and Solshenitsyn settled in Europe. Anyway, in the west Drittemann attempts to trace his father, who defected several decades earlier. His father has the reputation of being a true Bolshevist, who could not stand the bureaucracy and intimidation. In the end, Drittemann finds his father in England, where he lives under the name Dryden. It turns out that his father is an opportunist, and has even worked as a spy for the CIA and the fascist Gestapo. Now that his true identity is revealed, his father fears to be killed by the American or Bolshewist secret service. Indeed a few days later the father dies by means of strangulation, either due to suicide or murder (the narrative does not clarify this matter). It is clear that the movie addresses the issue of maintaining ones individual integrity under existential threats. Personally, I am more fascinated by the problem of how to yield constructive criticism. The story had the chance to elaborate on this matter, since Drittemann seems to paraphrase the GDR singer Wolf Biermann, who went into exile in 1976. Biermann is an abusive version of the young recalcitrant Bob Dylan. Some citations of Biermanns texts may be enlightening: \"In the newspaper I see your mugs. And still tomorrow you will rot and be forgotten. Now you sit in fat blubber like thick German maggots\". Or: \"The laziest pigs call us stinking lazy. The liars pretend to speak the truth. The most twisted dogs demand sincerity. Civil rights are abandoned, and they call it real freedom. Socialism has won, means that the bureaucrats gain their jobs\". Etc. No self-respecting government would appreciate such populist and anti-intellectual phrases. Singers like these are a warning that demagogic opposition may turn into something worse and more evil than the reigning order. Perhaps the people have become aware of this aspect, because today such songs are rare. In conclusion, although I enjoy the theme of the dissident singer, I find the working-out by Loach unsatisfactory. But it was never boring.","user":"eabakkum","rank":[4,5]},{"title":"Too long for its own good and includes pretty forgettable characters too","rating":4,"date":"26 February 2017","review":"\"Fatherland\" or \"Vaterland\" is a West German movie from 1986, so this one had its 30th anniversary last year. The director is Ken Loach and he recently made the headlines with his new work on Daniel Blake (including several BAFTA nominations). This is also I guess why this one we have here went up a bit on the IMDb star-meter. Anyway, it runs for 100 minutes roughly in the version I saw and here we have the only acting performance from musician Gerulf Pannach's career. It is a lead performance and he seemed like a good choice because his character here has some possibilities to his own life and career. Just like Wolf Biermann for example, Pannach was critical with the SED regime in the GDR and the fact that he starred in films like this one on the other side of the Wall certainly did not help things at all. There are even some people who think the SED regime may have used radioactivity on Pannach that could have resulted in his untimely death to cancer. We'll never know. The script here is by Trevor Griffiths, an Oscar nominee for Warren Beatty's \"Reds\", so the background has some parallels.<br><br>Now about the action: We have an East German musician who commits a crime (according to the regime) and is told that he has to choose between leaving the country or going to jail. He does the former, but has to leave behind a whole lot that he loves, not just his family, but also the people who admire him and love him for who he is in terms of the approach to music and politics. The East German regime of course treats him as a traitor afterward who apparently did not care about his fans or the GDR. Plus there is also a background story about the protagonist's father who was in a similar situation decades earlier during another crucial time in German history and the parallel between father and son. I personally thought the first 40 minutes or so were really interesting, when it is all about re-integration and I liked how the film depicts that the left as well as the right side of the Berlin Wall are both scum basically and that Pannach's character is nothing but a tool that they both (want to) use for their own despicable purpose in order to show their people that their ideology is the only right one.<br><br>It is interesting how the film basically always relies on Pannach's character's interaction with one female. Be it the woman he loves, an agent who welcomes him in West Germany or a French journalist with whom he is supposed to have a special connection. I write \"supposed\" because I was not feeling this connection at all. To me, Pannach and Babe had almost no chemistry at all and this was a negative deal-breaker here. I never had the impression during their pretty long screen presence together that I was watching authentic characters and dialogue. Such a pity. Everything until then was pretty good, but then it was really going south. It becomes an entirely dialogue-driven film the longer it goes and with the dialogues not working as meaningfully at all as they were supposed to work I must say I am pretty disappointed. There was certainly potential for more with a better final story arc. I don't even think it was the problem of the actors. This decline in quality is also why I give this movie a thumbs-down eventually and don't recommend checking it out. \"I, Daniel Blake\" is still my favorite 2016 film from what I have seen so far and easily will stay in the Top5 or Top3, but with the three-decade-old \"Fatherland\" Loach is nowhere near the level of his most recent projects.","user":"Horst_In_Translation","rank":[0,2]}]