[{"title":"What Is The Meaning Of This? A Beacon Of Light.","rating":9,"date":"19 October 2005","review":"The Music Box was the first programme on TV that I saw my daughter really laugh at, aged 14 months in 1981, when the piano dragged Ollie at speed down the steps yet again. Probably also the first thing I laughed at too and at the moment the last in the latest of hundreds of times! Well, Laurel &amp; Hardy shaped my and millions of others' senses of humour so I like to think hers was as well. Kids today who get the chance to see this and who can't get past the pre-digital black &amp; white images to the gold that lies within are not only missing a treat but are probably also making an crucial life-choice too. All of the human condition is contained herein, therefore making it essential viewing also for extra-terrestrials!<br><br>They have to deliver a piano to an address - all kinds of catastrophes follow thick and fast. The gags are so perfectly written and executed, and are as utterly relentless as Stan &amp; Ollie's drive to deliver the piano come Hell or pond-water. High-class slapstick disasters follow each other every minute of the 27 (un-remastered version), usually happening to Ollie - although Billy Gilbert's cosy little love-nest was looking a little dishevelled by the climax! The steps have been a Los Angeles tourist attraction for many years now, maybe the most fitting monument to L &amp; H that there could be - if you like this little film that is!<br><br>All in all and probably predictably my favourite L &amp; H outing, notwithstanding the similar brilliance of Sons Of The Desert, County Hospital, Thicker than Water, Busybodies, Below Zero etc etc etc.","user":"Spondonman","rank":[37,38]},{"title":"The Best of the Best of the Best","rating":9,"date":"2 January 2001","review":"L&amp;H are without doubt the best comedy double act of all time regardless of media format. Its amazing that their best movies are now 70 years old and yet remain timeless in their humour and inventiveness.<br><br>I've had the pleasure of seeing most of their movies - shorts &amp; full format - and all of them have their own individual quirky qualities that other comedians still can't fathom.<br><br>The Music Box won them a well-deserved Oscar and although it is an excellently choreographed movie I personally don't think its their very best.<br><br>However, my opinion doesn't matter because any L&amp;H fan will regard this movie as their favourite. The story is so simple yet so inventive and full of kinetic &amp; emotive energy.<br><br>Stan &amp; Ollie have to deliver a Piano to a highly strung guy who can't stand pianos. But just to make life a little interesting the guy's home just happens to be perched on a hill with the longest flight of steps in history to whit S&amp;O have to push &amp; pull their awkward delivery.<br><br>Some of the gags we've seen many times before but it doesn't matter because the added sparkle derives from the human emotions &amp; expressions delivered with such panache from Stan &amp; the long suffering Ollie - the way he looks-to-camera in a pleading kind of way just drives me wild with laughter &amp; sympathy.<br><br>I can't find a single fault with this movie short, except that it just flies by so quickly. How I wish today's contemporary comedy writers could spend a few hours in a dark room watching how the masters of comedy produce such wonderful scripts. It proves that there is no need to have cheap &amp; vulgar language, innuendo &amp; explicit violence to make any audience, young or old, laugh with mirth.<br><br>The Golden Age of comedy is dead, long live the Golden Age; long live Laurel &amp; Hardy!!!<br><br>*****/*****","user":"Sonatine97","rank":[22,23]},{"title":"A Hilarious Comedy Classic","rating":6,"date":"6 July 2001","review":"This is one of the great classics of comedy, with Laurel &amp; Hardy at their very best.  It has a wealth of good material, and also shows their ability to extract every possible laugh from a relatively simple situation.  It also includes appearances by Billy Gilbert and Charlie Hall, two of their best supporting players.<br><br>Stan and Ollie are delivering an old-fashioned player piano (or music box) to a house at the top of a hill.  They encounter one difficulty after another getting it up to the top, and when they do, their troubles are just beginning.  They use the situation to set up a lot of creative gags, all delivered with excellent timing.<br><br>There isn't any description that could really do justice to this hilarious short film - if you enjoy classic comedy, you will want to see \"The Music Box\" for yourself, so that you can enjoy two masters of comedy at their best.","user":"Snow Leopard","rank":[17,18]}]