[{"title":"Hilarious and Clever!","rating":9,"date":"21 April 2004","review":"What a film! \"Dirty Rotten Scoundrels\" has a really clever plot, in which Lawrence, a high-class playboy (Michael Caine), and Freddy, a petty con man (Steve Martin), make their living by seducing and cheating rich ladies. However, the little French town is too small for both, so they decide to set up a bet in which the loser has to clear the area. Pretty and naive Janet (Glenn Headly) is the object of their contest, and each one of them engages in ever-more ingenious tricks to try to rip her off and win the bet, yet with unpredictable results.<br><br>The movie is hilarious, and despite its 15 years' of age, it is as fresh as it has been when it was first produced. Steve Martin of course is the funniest character of all, with his fantastic \"Ruprecht\" performance being unforgettable. Go ahead and enjoy this film. It is worth it! 9/10.","user":"jcanettis","rank":[73,77]},{"title":"Dirty + Rotten = Genius","rating":9,"date":"23 December 2003","review":"This film made an impression on me before I even saw it. I was in a theater, and a trailer for \"Dirty Rotten Scoundrels\" came on. While a voice-over talked about the value of movies promoting morality and civility, you saw Martin and Caine strolling along a beachfront, smiling beneficently as they greet passers-by. Then Caine shoved cotton candy into a kids face while Martin pushed a woman off a ledge.<br><br>It's a great sequence, and is featured on the DVD with its own commentary from director Frank Oz (when has that ever happened before?) but a little misleading. Actually, while both men are scoundrels, neither is quite that vile. Caine's Lawrence Jamieson is actually a bit of an altruist, as we find out, with a code of only taking in people who can afford to be taken, and finding ways of spending the money that are not entirely self-serving. Martin's Freddy Benson is less disciplined and more small-time in his cons; he'll steal candy from a baby and tell you it's for his poor sick Gram-Gram if caught, but he is likeable, too, an underdog with little idea how the game is played at the highest levels, but eager to learn.<br><br>The fact you can like these characters is a compliment to Martin and Caine, as well as director Oz and the team of writers. Tone is everything with a film like this, and as Oz says in his commentary, so important in making the comedy work. He notes he was going for a 1950s feel in the picture, I'm guessing with Hitchcock's \"To Catch A Thief\" in mind. The great score by Miles Goodman is solid enough to deserve its own CD reissue, with an air of light sophistication that buoys the proceedings on screen. Most importantly, since much of the comedy involves people taking advantage of one another, having everything put forward in such a gossamer manner helps you digest the story without leaving a bad taste.<br><br>Martin shines in many scenes, especially when playing Ruprecht the idiot man-child and when stuck in jail trying to remember the name of the only man he thinks can bail him out (\"James Lawrenceton...no, wait, James Jesterton....no, no, it's definitely, um...\") I knew Martin could be funny, and with the exception of \"All Of Me\" this is probably his best comedic performance, but Caine is a revelation. A straight man, yes, but with delicate timing and some clever characterizations that he pulls out of a bag, like an Germanic psychiatrist with some unusual ideas about curing lameness. You forget how good Caine is in comedy, despite his performances in films like this, \"Blame It On Rio,\" and \"Without A Clue.\" Glenne Headly is a revelation as the woman caught in the middle of Jamieson and Benson's scheming, every bit as good as her male counterparts, but say no more.<br><br>Great actors, great tone, but the plot is the best thing this film has. It's a remake of a 1964 film \"Bedtime Story,\" which teamed Marlon Brando and David Niven for what should have been a dream team but went flat instead. This time, the script is helped by actors who can not only deliver funny lines but make them funnier, and by an ending (according to Oz in his commentary, one worked out over several long dinner meetings with Martin) that is simply perfect.<br><br>Finally, Oz needs to be recognized. He was only making his second non-Muppet film here, but the result in my view is one of the best comedies anyone has ever done. He manages to get the best from everyone, including the actors and cinematographer Michael Ballhaus (some amazing night shots of the French Rivera waterfront you never tire of looking at), and delivers a rare jewel of a film, a laugh-out-loud comedy that leaves you with a warm feeling inside.<br><br>Ian McDairmid plays Arthur the butler in this, teaming him with Oz yet again. Almost titled this review \"Yoda And Palpatine On The French Riviera;\" it's interesting McDairmid plays the one guy in \"Scoundrels\" who's really on the level.","user":"slokes","rank":[90,99]},{"title":"Hilarious!","rating":10,"date":"21 June 2006","review":"Everything clicks in this laugh-out-loud gem. Steve Martin and Michael Caine are in top form as Freddy Benson and Lawrence Jamieson, two con men who agree that this town (on the French Mediterranean coast) ain't big enough for the both of them. To solve the problem, they agree upon a solution - the first man to swindle $50,000 from a naive young woman gets to stay. The competition brings out the very best of their very worst, with Martin posing as a paraplegic and Caine as a psychiatrist eager to help convince him it's all in his head. Glenne Headly, as the target of the cons, deserves special mention for her brilliant performance.<br><br>One of the strongest assets of \"Dirty Rotten Scoundrels\" is that the story is interesting enough, with its various twists and turns, that it would work great even without being funny. The laughs - and there are many of them - are a sort of gut-hurting bonus. The scene in which Caine tests the nerves in Martin's legs must rank as one of the most uproarious in film history. This one from director Frank Oz (certainly no slouch in the comedy department) is not to be missed.","user":"ReelCheese","rank":[49,53]}]