[{"title":"The great lost Brit crime movie?","rating":3,"date":"3 August 2003","review":"Forget the flashy but empty \"cor blimey guv\" Brit crime movies of the last few years like 'Snatch' and 'Sexy Beast'. Apart from 'Croupier' and 'Gangster No. 1', most of them aren't worthy of being mentioned in the same breath as the brilliant but largely forgotten 'The Long Good Friday', 'Mona Lisa', and the most underrated of all, 'The Hit'. Terence Stamp, playing a character not too dissimilar from the one he later portrays in 'The Limey', is a former gangster who grassed up his criminal mates years earlier. Now living in semi-retirement in Spain he is unexpectedly kidnapped by two hoods (John Hurt and, in one of his earliest screen roles, Tim Roth) who plan on taking him to Paris and killing him as punishment for betraying the criminal code. Of course, things don't go quite as planned and along the way the sexy Laura del Sol gets forced against her will to accompany them. This is a very fresh and interesting film that is more character than action based so might not appeal to the Guy Ritchie crowd. It's their loss. Stamp is just brilliant and his interaction with Hurt and Roth makes this a must see movie. The supporting cast also includes the legendary Fernando Rey ('The French Connection') as the cop on their trail, and Aussie veteran Bill Hunter as a crim in the wrong place at the wrong time. 'The Hit' is one of the most overlooked British movies of the last twenty years, and highly recommend viewing for all discerning movie buffs.","user":"Infofreak","rank":[52,62]},{"title":"To close for comfort.","rating":9,"date":"1 February 2007","review":"Ten years ago Willie Parker testified in court against some of his criminal buddies and ever since then, has been waiting for them to settle the score while hiding out in Spain. Soon enough his tracked down by two hit men, the slick professional Braddock and his raw rookie Myron. Who plan to take him back to Paris to meet up with those he done in, but on their trip there they stop off at a Madrid apartment that includes an unplanned kidnapping of a young Spanish girl, Maggie. Through the trip Parker's pondering manner starts getting on the pairs' nerves and the feisty Maggie makes matters even worse. Nothing is truly going to plan with these constant distractions and the Spanish police are hot on their trail. <br><br>I wasn't expecting to like \"The Hit\" as much as I did. But came away really enjoying and thinking highly of this oddity, after knowing nothing about it to begin with. It was neat blind purchase (well, it only cost $2), which really did pay off. This colourfully kooky British crime feature has a premise that likes play mind games by breezily building upon the animated characters and random situations they find themselves stuck in. It's about them finding their feet and coming to terms that death might be around the corner. Nothing to fear in something you shouldn't be afraid off. Peter Prince's tautly fleshed out script has real sensitivity about it and goes down well with the simple road trip storyline. While rather talkative, the dialogue driven outing has a lyrically deeper underbelly, where personalities clash with amusingly engaging and wittily sly results. Action is little, but it doesn't suffer from it and when it unfold, its intensely drawn up. Director Stephen Frears paints a poetically subdued feel to it with such freshly assured and suave direction. He truly sets up some beautiful visions without losing any of that brutal edge when called for (the surprising climax takes the cake). Mick Molloy's fetchingly sublime photography-work incorporates the alluringly picturesque backdrop of Spain with elegant scope. He even frames diverse scenes with inspired shots that have you in awe. Eric Clapton plugs away for the sweepingly airy opening title and Paco de Lucia stirringly upbeat Spanish flavour to the music score kicks up the energy levels and unpredictable vibe. The technical side of the production is pretty top-draw and sufficiently done. The performances are all marvellous in crafting out their characters and feeding off each other with believable chemistry. An outstandingly novel John Hurt plays the professionally cool, tough as nails hit-man Braddock with such cold venom. Character actor Tim Roth (in his film debut) is brilliant in a total opposite persona as a young clueless, hot-wired rookie Myron getting a little too attached to their captivates. Terence Stamp stands-out in his turn of the lively accepting Willie Parker, who throws up some words of wisdom along the way and strangely becomes fixated with his closing destiny. Laura del Sol dashingly fine as the strong willed Maggie who adds the sparks. Also showing up in short, but potent roles is Aussie actor Bill Hunter and Fernando Rey playing an officer closing on their tails. <br><br>\"The Hit\" is a focused, well thought-out production that I believe to be perfect across the board. Some people might find it to lead nowhere, but seductively enterprising is what comes to my mind.","user":"lost-in-limbo","rank":[31,36]},{"title":"Simplicity Pulled Off.","rating":7,"date":"19 February 2006","review":"I can't believe that this film had gone for so long without me knowing it was around. I'm a big fan of the crime/drama genre so when I stumbled across the fact it was going to be on some free to air digital channel at about one in the morning a couple of months ago, I thought I'd give it ago. In fact, I'd never heard of it before nor have I since. No one seems to know of it and it's a damn shame as this is a VERY underrated film, especially surprising given the fact John Hurt, Terrance Stamp and Tim Roth are in it.<br><br>The film deals with human interaction between a 'grass' from ten years back, a rookie gangster and an old-time gangster in almost superior form to many other films. The fact it takes a 'road movie' approach gives us more time to develop with the characters, as well as the characters themselves to do a bit of bonding. What follows is some fascinating dialogue between the three (and between a young Spanish girl on a lesser extent) and some very interesting relations building up. The stone cold presence from Hurt, the silent but 'you know he's up to something' Stamp and the, almost, 'comic relief' character in the form of Tim Roth all combine in a truly mesmerising mixture of events. I was glued to the screen.<br><br>The narrative also takes on a mysterious, almost multi-layered approach when talking about the police hot on their tail. The fact we never hear the detectives talk or any of the police communicate leaves us with a sense that we know what's going on but we're not actually there, almost as if the three male characters in the car are dreaming up the scenes themselves as to what MIGHT be happening at their last point of call if the police had yet arrived.<br><br>The action and dialogue is well spaced, even though the script is great anyway, and you truly struggle to work out what might happen next. The disturbing way in which Stamp seems to say nothing at all yet communicates with Roth like he's known him for years twinned with the fact panic hits him like a train later on in the film and he suddenly becomes a chatter box is an amazing juxtaposition which really adds to the experience.<br><br>Another attractive aspect of the film is the setting. This also acts as a juxtaposition as the beauty and heat that oozes from the screen really counterbalances the disturbing reality that Hurt and Roth's characters are there to 'get' Stamp and make him pay for his previous actions as well as the sadistic interior that makes up Hurt's character. You can't get too caught up in the setting which you only really see when the journey is being killed off, and you know that with every second that rushes by on the road; Stamp is apparently closer to his death - clever stuff.<br><br>The film is simple. The narrative is easy, there aren't too many characters to deal with, there aren't too many on screen distractions (unless you count the girl) meaning you have more reasons to focus on EXACTLY what's going on and although the film looks a little aged, I can guarantee it's thoroughly enjoyable.","user":"johnnyboyz","rank":[22,25]}]