[{"title":"Worth its weight in gold.","rating":10,"date":"21 March 2000","review":"Whilst it would make few people's \"All time top ten\" lists, I'm hard pressed to think of a film which is so relentlessly enjoyable as \"Kelly's Heroes\". Part war movie, part comedy, part bank-job caper, the different elements combine seamlessly to produce a distinctive and memorable film.<br><br>Clint Eastwood, in an unusually subdued but nonetheless commanding performance, plays the leader of a platoon of restless GIs in the chaos of post D-Day France.  When he captures a German officer who just happens to be in possession of a solid gold bar, Clint extracts the necessary information and before you can say \"Three Kings\", he's hatched a plan to make it 30 miles beyond enemy lines to nab the $16 million stash.  He can't do it alone, of course, but has no trouble in convincing his fellow troops that if they're going to be killed in this war, the reward for them should be worth the risk.  Enlisting the help of Quartermaster \"Crapgame\" (Don Rickles) Sergeant \"Big Joe\" (Telly Savalas) and Sherman tank driver \"Oddball\" (Donald Sutherland) among others, Kelly and his platoon of ironic \"heroes\" are soon on their way to an eventual showdown with the German Tiger tank unit guarding the bank...<br><br>All too often cross-genre pictures can be let down if the balance isn't right, but that's not the case here because each element is as good as it can be.  The action and battle scenes are well executed, especially that in which Oddball and his Shermans attack a German depot.  The comic relief is genuinely funny rather than cheesy, and includes a beautiful scene at the climax of the movie which gently parodies Clint's spaghetti-western days, complete with the strains of cod-Morricone music.  The suspense is well maintained where necessary, such as the scene where the platoon is caught exposed in the middle of a minefield with a truckload of Germans bearing down on them.  And of course there is the ensemble cast, which is uniformly excellent.  Keep an eye out for a young Harry Dean Stanton, and Len Lesser, who is better known as Uncle Leo in \"Seinfeld\".  Sutherland's proto-hippie (\"Always with them negative waves, Moriarty!\") and Carroll O'Connor's manic General  Colt are just two performances which live long in the memory, alongside the ever-reliable Eastwood and Savalas.<br><br>There are a few points made about the madness and futility of war if that's what you're looking for.  Allied bombers knock out bridges by day, German mobile engineers rebuild them by night... neither the Americans or the Germans seem to know what's going on or where their lines are supposed to be... behind the lines our heroes are attacked by their own aircraft... General Colt  mistakes Kelly's gold-inspired push for a patriotic determination to end the war, and mobilizes his army to follow him, chastising the staff officers around him for failing to show the same spirit!<br><br>But ultimately, this movie is about entertainment rather than political comment.  And as such it is one of the most successful examples of its type, as the almost total absence of negative comments from this page should indicate.  The script by Troy Kennedy Martin (\"The Italian Job\") is tight, and direction by Brian G Hutton (\"Where Eagles Dare\") equally assured. Perhaps regarded as lightweight in comparison to other, more serious \"men on a mission\" movies such as Robert Aldrich's \"The Dirty Dozen\" or Hutton's aforementioned \"Where Eagles Dare\", the film has nonetheless been influential.  For example, although David O Russell's \"Three Kings\" veers off on a tangent and makes more of a serious comment on the US role in the Gulf War, its matchbook plot (ie that which can be written on the back of a matchbook) is the same as \"Kelly's Heroes\".  And in the speakers mounted on the side of Oddball's tanks, used to blast music at the enemy and freak them out, there is more than a hint of the Wagner-playing helicopters in Coppola's \"Apocalypse Now\", still some nine years hence at the time of this film's release.<br><br>In my humble opinion, therefore, \"Kelly's Heroes\" is a supremely enjoyable way to spend a couple of hours.  You will be doing yourself a favour if, next time you get the chance, you take a look.  It's rare that I see a film and don't think at least once that I'd change something about it, but if there is something to change in \"Kelly's Heroes\", I don't know what it is. With that in mind, I give it a...<br><br>(10/10)","user":"Oro-Indiano","rank":[39,41]},{"title":"Great WW2 Buddy Pic","rating":8,"date":"5 July 2003","review":"Utterly hilarious World War II adventure picture, with some great acting by all of the leads, fine action sequences and superb scenery.<br><br>\nKelly (Clint Eastwood) captures a German colonel (David Hurst), who inadvertently tells him where the Germans are hiding $16,000,000 worth of gold bars. Kelly enlists the aid of his platoon to trek behind the German lines and steal the cash.<br><br>The movie features a top-notch cast of veterans and would-be stars. Eastwood (THE GOOD, THE BAD AND THE UGLY) has a quiet, serious role and floats through the entire picture. Telly Savalas (PANCHO VILLA) makes a great counterpart as the loud, short-tempered and cynical platoon sergeant. Donald Sutherland (THE EAGLE HAS LANDED) steals the show, though, in a very offbeat role as a hippie-style tank commander. He delivers some utterly 60s dialog with great style and is uproarious. Don Rickles is funny, too, in a smaller role as Crapgame - a rear-echelon supply clerk who goes along on the trek for a profit and gets more than he bargains for. Carroll O'Connor (THE DEVIL'S BRIGADE) has an un-necessary but zany role as General Colt, a blustering officer who can't understand why his red-blooded American soldiers aren't cutting through the German army. The role is obviously a knockoff of George C. Scott in PATTON, and O'Connor does an excellent job.<br><br>\nThe supporting cast is fine, too, though not many make much of an impact. Jeff Morris is a hoot as Cowboy, a transplanted Texas hick, with Harry Dean Stanton in support as his sidekick; Stuart Margolin is a jittery radio operator; Len Lesser is a construction officer who gets conned into going along to build a bridge for the guys, and ends getting really screwed over by Kelly's boys; Hal Buckley is the platoon commander who only cares about getting his yacht to Paris; Gene Collins is the baby-faced youngster. David Hurst is lovable as the dim-witted German colonel, and it's really a shame he gets killed - especially by one of his own tanks. Karl Otto Alberty (THE GREAT ESCAPE) has a nice, small role near the end as a Tiger tank commander, and there's an anti-war spin when Kelly and crew let him escape unscathed. Watch for John G. Heller (OPERATION CROSSBOW) as the German patrol leader during the minefield scene.<br><br>The movie also features some terrific action scenes. The minefield debacle is suspenseful and nail-biting, and eventually filled with tons of gunfire and neat explosions. The final battle, in which the dozen or so heroes manage to wipe out a garrison of Germans in a small French village is expertly filmed, with some great camerawork and lots of good, convincing special effects. Some major aspects of this sequence were ripped off in SAVING PRIVATE RYAN - Tiger tanks in the street, a sniper in a bell tower, machine gunners firing from bombed-out buildings - the whole general look of the sequence was completely conned.<br><br>The Lalo Schiffrin score is light-hearted fun, and Mike Curb Congregation's \"Burning Bridges\" theme is a good song but doesn't at all fit the theme of the movie. The film was shot in Yugoslavia to take advantage of lower production costs. It actually looks a lot like central France, with plenty of hedgerows, bombed out buildings and such - nothing like the mountains and rivers of THE BATTLE OF NERETVA.<br><br>I saw this movie on Turner Classic Movies, appropriately letterboxed at about 2.35:1 with hardly a flaw in the print. Colors are accurate and the image is pretty sharp. TNT used to play an awful, orange-looking print of the movie (with the dialog edited to pieces, also) The audio is fine and sounds clear and loud, but the gunfire and explosions lack intensity. The film is also available on DVD.<br><br>KELLY'S HEROES is a witty, lighthearted WWII adventure which I don't think any fan can miss. If you need to sit back and watch American GIs kick German butt for 2 and a half hours for a goal as lofty as pure, all-American greed then this is your flick.","user":"SgtSlaughter","rank":[69,77]},{"title":"A war movie buff's guilty pleasure.","rating":9,"date":"9 August 2004","review":"I'm the first one to rant at ridiculous war movies. The history has to be right, the uniforms, and so on and so on. Plots have to be creditable or I'm the first one to cry foul. But then there comes along movies like Kelly's Heroes. It's violent and meaningless really...but funny and very exciting. The gear is accurate for the most part, which is far more than I can say about the bulk of so called serious war films. Even with the infamous Tiger tank the film makers attempted to at least make the Russian built Yugoslav T53s they were using look like Tigers. I think they were T53s, they did such a good job of making them look like Tigers it's hard to tell. The whole film is a 1960s anti-establishment slant thrown on a pretty standard WWII story about GIs on a mission behind the German lines. In this parallel universe John Wayne type mission, these guys are out for number one. It's their mission, not the US Army's or the Allies. With a headlines crazy General chasing behind them with his photographer looking to pin medals on \"his boys\" for piercing the German lines and apparently leading his \"charge\", they're heading for a town full of Germans guarding a bank with three Tiger tanks. Clint Eastwood has to pick up the means to complete this personal mission along the way without the secret leaking out. We even have 1960s Hippies in this silly war torn 1940s world. Donald Sutherland is a riot as a stoned Sherman tank commander who seems to have stepped into a timewarp and emerged in 1944 and found himself at the helm of an armored unit. Several then unknowns are in the film, including Harry Dean Stanton and Gavin Mcleod. Beautiful scenery and photography shot in what was then Yugoslavia. Excellent attention to equipment detail. Good, if over the top, performances all around. Suspense and excitement. Very funny. And possibly the silliest pothole laden plot to ever pass itself off as a war movie. If you're a war movie buff with a sense of humor you'll love it.","user":"k_rkeplar","rank":[84,98]}]