[{"title":"Worth a look.","rating":7,"date":"26 March 2002","review":"If you can ignore the dopey ending, the movie has some very nice surprises best of which is the incredible performance of GD Spradlin as the sheriff. This may be a lightweight movie but he does not throw away his role.  He's genuinely scary and believable as the tyrannical sheriff.  Jenilee Harrison is also at her most sexy in 1984.  She was a mouthwatering beauty back then! The film rolls along pretty blandly but the scenes with C. Thomas Howell getting framed are pretty well done and plausible.  If you can get over the guy owning his own Sherman tank, the  decision to use it makes at least some sense by that point in the movie.","user":"pappythesailor","rank":[15,17]},{"title":"I enjoyed it","rating":7,"date":"16 March 2004","review":"I didn't see this when it came out, so when it appeared on cable late one night I didn't expect very much.  But it exceeded my expectations.  It's the story of an honorable man who is pushed too far.<br><br>Yes, there are some stretches of the imagination to be made.  For example, with all the gunfire, I don't remember anybody getting killed or seriously wounded.  The good guys are too good and the bad guys are too bad.<br><br>But I enjoyed a few scenes a great deal.  For one, the portrayal of the small town, that seems idyllic at first but is rotten to the core.  I especially appreciated the scenes between Sgt. Carey and his son, the way that the military was shown pulling together as a family, and the others who help the group trying to get to the state line. These were all people that I wanted to cheer for.","user":"marzolian","rank":[22,27]},{"title":"A fun Movie","rating":7,"date":"27 March 2005","review":"This is an old fashion good vs. evil movie that is fun. Movies don't always have to have some heavy deep plot. Sometimes it's great to watch a movie that is fun that you can cheer, and this is one of them. It's now over 20 years old, but it still holds up as a fun movies to watch and enjoy.<br><br>A big surprise will be to many is to see James Cormwell playing a simple deputy sheriff, and what Command Sergeant Major Carey does to him.<br><br>James Gardner, as always, carries the film very well. He is a very believable CSM, and Shirley Jones has a military wife down pat. A young C. Thomas Howell does a good job too as a military son. G.D. Spradlin plays the very mean Sheriff that is very easy to hate. And Jenilee Harrison did this movie at the same time she began a two year run on Dallas, and she looks great in this movie. The whole cast together works great for this movie, and it's great for the whole family.","user":"bgarry999","rank":[15,19]}]