[{"title":"Don Bluth's Best work!","rating":9,"date":"30 December 1998","review":"Anybody who doesn't like this movie just doesn't love animation. How can a proclaimed fan of feature animation not be dazzled by the extravagance of Don Bluth's work seen in NIMH? Here is a perfect example of what happens when artists are given free reign to just create whatever their vivid imaginations may produce. To me, the greatest triumph of this movie is the art itself. Its greatest flaw is that it was cheapened by a sequel! Why in the name of HUMANITY was a sequel made? A masterpiece of this magnitude should not be so insulted as to be milked for every dollar that the bean counters say it can!<br><br>But I digress...<br><br>Bluth's use of highly stylized art to influence your emotions is rarely seen in others' work. The whole point of animation is that you are not limited by the bounds of reality, so thorns and cobwebs can be just that much more twisty and foreboding. Owls' eyes can glow- not because they do, but because it just plain looks cooler. The bright and sunny entrance to the rats' lair can suddenly fade to a background of blood red as Mrs. Brisby runs in terror from Brutus' electrified blade. What plot holes does using a lit electric lamp as a diving bell produce? Who cares? The concept just looks awesome on screen! The effects animation is spectacular in this movie as well. The glow of Nicodemus' eyes, the sparkling of the fairy dust ink and the flaming letters of the movie title screen are great, and the radiance emitting from Mrs. Brisby as the sheer strength of her character lifts her home from the mud is fantastic.<br><br>If the story were no more than a shabby framework to lace all of this cool art together, it would be good enough, but there's a lot going for it as well. It's not a complicated story, but its message of love, devotion, and courage shown in the meekest of people (mice?) is enough to inspire anyone! Mrs. Brisby's simple wish for the safety of her family drives her to the greatest of courage, despite her apparant simplicity and weakness. She stands as a model for all of us to aspire to.<br><br>Animation should never be considered something just for kids. It should not require the characters to burst into song at regular intervals, or the story to be sappy and condescending. NIMH does none of this. It is truly a movie for movie-lovers of all ages. Disney, take a hint!!! Don Bluth, keep making movies like this, and your field will reach an entirely new level of acceptance among older viewers in America.","user":"ZeroByte","rank":[76,79]},{"title":"Perhaps the greatest postwar animated film","rating":10,"date":"13 August 2004","review":"The short version: 'The Secret of NIMH' isn't just a masterpiece: it's the best classically animated film since the early 40's. It's up there with 'Bambi', which is to say, this is about as good as it gets.<br><br>I remember walking down the street when I was about 19, and seeing the poster for 'The Secret of NIMH' up in a theatre, and immediately thinking \"This film is going to blow my mind.\" A week later, I was sitting in an empty theatre, watching the last credits rolling down the screen after everybody else had left, and the house lights were up, thinking \"yep.\"<br><br>A bit of history is probably in order for a film of this importance. Flashback to about 1980. Disney animator Don Bluth walks out, halfway through production on 'The Fox and the Hound', taking several other key animators with him, and declaring that he was going to recapture the spirit of classical animation, which Disney had forgotten about.<br><br>Nearly three years later, NIMH debuts. Critically it is well received, but lack of distribution and advertising means it's swamped by such an historical non-entity as Disney's 'Tron'. Accepting an animation award for best film, Bluth remarked \"Thanks. We didn't think anyone had noticed.\"<br><br>NIMH is a glorious achievement. It puts to shame anything which Disney had done for a quarter century, and singlehandedly did exactly what Bluth set out to do. It revived the spirit of classical animation, and at the same time it proved that there was room on the block for another player than Disney - not an unimportant fact when you consider that at the time there was no Dreamworks or Pixar, and no feature animation section in Universal or MGM.<br><br>As to the film itself: from the first moment you are treated to a gloriously rich, sumptuous, seamless animation and background art, the likes of which hadn't been seen since Disney's war years. Particularly stunning is the movie's use of colour to enhance moods. The dark blues and blacks of the stunning 'lantern elevator' descent into the rats' city, and the tractor scene - the background starts out in subdued tones and ends up flaming red as the action peaks. One reviewer at the time wrote \"I felt as if I was watching the invention of color, as if I was being drawn into the depths of the screen.\"<br><br>The characters are beautifully conceived and drawn, and the voice characterisations are spot-on (including the animation debut of Dom de Luise as Jeremy). And, significantly, there is only one song, and it's not sung by a character (significantly, 'Balto', one of the few animated films since which can hold a candle to NIMH, followed the same principal). Jerry Goldsmith's score supplies the emotional power for the rest of the soundtrack.<br><br>Even more importantly though, the film is incredibly emotionally potent, and not in a sentimental, kiddy way. It has genuine choke-you-up power which will appeal to adults. <br><br>Bluth ditched the double storyline of the book, relegating Jonathan Brisby's more substantial role in the novel to a short piece of background information revealed in an explanatory flashback. Personally I think this was the right decision. To do otherwise would have been to take the spotlight off Mrs Brisby, and probably diminish the film's coherence and power. <br><br>So, Don Bluth achieved his goal: his debut feature film was the greatest animated achievement in 40 years. Sadly, it was also his only masterpiece. He peaked on his first outing, and afterwards declined into mediocrity, while Disney picked itself up and overtook him. In fact, ironically, there were signs of this in 'The Fox and the Hound', which despite being plagued by Bluth's departure amongst other catastrophes, turned out to be Disney's best movie since the 60's, even if it would still be the better part of another decade before they started hitting their marks consistently.<br><br>Today NIMH enjoys the sort of cult following it deserves. It's just a damn shame that its greatness isn't more widely acknowledged, and an almost equally great shame that a generation later it was cursed with one of the most insulting, wretched sequels in cinematic history.<br><br>It's an important film, and it's a great film. In the two decades since it was released, only a small handful of animated films have approached its stature.","user":"Lupercali","rank":[152,165]},{"title":"Magical, Fantastic, a real delight","rating":10,"date":"10 March 2005","review":"The Secret of NIMH after twenty three years is still an absolutely fantastic film. I hold it in such high regard as the even more obscure Gay Pur-ee (with the voice talent of Judy Garland, also wonderful) and Disney's Robin Hood.<br><br>Criticisms can be made of the film. For one, \"faithful\" isn't exactly an adjective that can be used when describing it's relation to the source material: \"Mrs. Frisby and the Rats of NIMH\" by Robert O'Brien. However, the novel was a Newberry Award winner and it deserved an excellent film which is what it received.<br><br>The book itself had two separate story lines, one focusing on Mrs. Frisby and her plight, and the other a lengthy backstory involving the rats of NIMH. For the animated feature, Don Bluth and his team chose to focus on Mrs. Frisby's plight and for this I am grateful.<br><br>In Mrs. Brisby we have a totally unique and a truly delightful heroine. She isn't some young boy getting ready to go on a fantastic adventure or some sort of great, brave hero. She's just a mother, a mother whose first concern is her family. And she makes a fantastic hero, showing that courage isn't just involved in facing down fierce monsters (though when she has to do that she finds the courage). She never stops pushing herself and though she might be a very small mouse, she has a very big heart.<br><br>As a kid I walked away thinking how cool Justin was, but now that I'm older I have complete respect for Mrs. Brisby. It's an excellent film both for children and adults alike.<br><br>And how about Derek Jacobi as Nicodemus? Dom deLuise as Jeremy? Not to mention Elizabeth Hartman, whose short career was never-the-less magnificent. Thank god for film that we might have her talents available to us for all time!","user":"Endlessinstant","rank":[42,47]}]