[{"title":"Early Talkie With Merit","rating":28,"date":"28 November 2001","review":"Early Hitchcocks are all worth seeing to observe how the Master's style evolved over the years.  This story, based on a Clemence Dane book, is interesting, if only for the sub-texts flowing through it.  The dialogue comes in fits and starts, which is common in the early sound  films and some of the camera work is rudimentary.....but you can still spot the Hitchcock touch in the nuances of some of the scenes.  Herbert Marshall is especially dashing as Sir John; he was a particularly attractive actor in his early years.  Nora Baring is servicable as the accused but it is Esme Percy, as Fain, who is intriguing.  As a \"half-caste\", originally written by Dane as gay, he is either overacting like hell or is fascinating in his interpretation....there is a fine line. Regardless, he holds your attention when he is on the screen.  The film moves slowlllllllly, very slowlllllly.....but for Hitchcock and early talkie buffs, it is well worth it.  Catch Una O'Conner in her younger years as the landlady.  She's a treat.","user":"Bucs1960","rank":[40,43]},{"title":"skewering the straightforward","rating":9,"date":"24 December 2004","review":"One of the most conventional stories Hitchcock ever filmed, this is an innovative early curio full of clever moments, a vibrant feature that overwhelms its intelligent but lifeless (and dated) script. It is not a match for the stunning BLACKMAIL, but it is a worthy followup after the less interesting JUNO &amp; THE PAYCOCK.<br><br>Sir John's quest to clear the woman he helped convict of murder charges takes a familiar whodunit path, but the performances help make this a unique film. All credit goes to Hitchcock for crafting another visually arresting movie and for knowing precisely how to tell the tale without overreaching (something he accomplished even in his weakest movies).<br><br>You'd expect that this movie, full of pioneering experiments, would feel like an antique; so many of the things it attempts have become tired clichés, yet the actors and director ensured that MURDER! would retain a freshness that is potent even now.<br><br>Without revealing too much, the sequence that really stays with you occurs near the end of the picture at a circus. This climactic, dark scene will leave you reeling in disbelief. Each time I see it I come away wondering how he managed something so remarkable -- and in a sense, terrifying -- to wrap up this Agatha Christie-like plot. Hitchcock's brightest years are ahead of him at this point, but the circus scene may be a career highlight.<br><br>The director disliked \"whodunit\" stories due to their rigid structure and the lack of opportunities for suspense, and admittedly this story is not as exciting as THE LODGER or BLACKMAIL, but he does milk the plot for all that it's worth and I think most anyone would be entertained by it. For Hitchcock buffs, this is a must, and thanks to the copious experimentation it's also recommended to anyone who is interested in early sound cinema.","user":"dustybooks","rank":[54,63]},{"title":"Slow-Moving Whodunit With Some Good Features","rating":4,"date":"4 June 2001","review":"This was one of the few times that Alfred Hitchcock filmed one of his stories as a \"whodunit\" in which you are not sure until the end who committed the crime.  \"Murder!\" is often slow-moving, but it has some good features, and is worth watching the whole way through.  It was one of Hitchcock's earliest sound pictures, and he tried some new things here, some of which work quite well.<br><br>Herbert Marshall stars as Sir John, a famous actor who sits on a jury for a murder case.  After the case is decided, Sir John starts having second thoughts over whether the verdict was really correct, and he decides to investigate on his own.  His investigation itself moves rather slowly, but it has some entertaining moments.  Everyone connected with the murder was part of a theater group, and Hitchcock gets some good mileage out of having the characters alternate between their real identities and their stage roles.  There are some pretty good scenes, most especially the one of the jury's deliberations - it is quite amusing, and a not-too-subtle example of Hitchcock's lack of confidence in the infallibility of the legal system.<br><br>There is not very much of the suspense for which Hitchcock is famous, but instead there is some subtle humor and a lot of atmospheric detail.  While not having the sustained excitement of Hitchcock's best films, \"Murder!\" is still worthwhile as a slightly different kind of film by the great director.","user":"Snow Leopard","rank":[30,35]}]