[{"title":"Excellent Social Commentary on a Thankfully Bygone Era","rating":7,"date":"5 August 2006","review":"I first saw this film, when it was originally released in 1969 at the ABC Edgware (now, a block of flats and a gym, very much in line with the film's partial theme of community break-up), but was somewhat disappointed because it didn't contain the original music nor - until three-quarters into the film, the original format - Alf, Else, their daughter Una Stubbs and Tony Booth as her husband the \"scouse git\". Now, 37 years on, I think differently. Although somewhat episodic, it beautifully captures a bygone era, with excellent footage of London during WW2, a good feel of the old East End, plus old-fashioned pub culture without the plastic fittings and lager and the traditional family all eating around the table. There is the quaint working class Tory ethos embodied by Alf, not quite, the not for the likes of us of The Ragged Trousered Philanthropist, rather the loyal, home-owning, small-minded bigotry of someone who perceives himself as a self-made man, who has not made quite as much as he thinks he deserves.<br><br>There are some lovely home-truths and vignettes within this setting: the £1,500 paid for the house (not a bad price in this day and age!), the mortgage from the Council and the scrimping and saving to pay it off. Dandy Nicholls as the \"silly old moo\" housewife ultimately wears the trousers and guides the household through. There is also pathos from Alf's 5 shilling contribution to the Church in the hope his two up, two down will not be demolished to make way for flats and ultimately bathos, as the family is forced to move to a high rise block in Essex, where community and the sense of community hardly exist.<br><br>No more, the chat with the neighbour while carrying out ablutions through the wall of the outside \"bog\", the sheets of newspaper, which, during the war-scenes, enabled Alf to wipe his posterior with Hitler's picture, long since gone. It is far closer to reality than the fluffy adverts with the dog and the loo-roll of the present day.<br><br>Hopefully, the old-fashioned racism depicted by Johnny Speight with his sharp ear for dialogue and knowledge of the area, dissipated throughout the '70's and '80's as even Alf-like characters got to admire national role models such as Trevor MacDonald and Lenny Henry.The World Cup footage, presumably from Goal, interspersed with Alf and son-in-law in the Wembley crowd, were more evocative than most of the four-yearly diatribes we get as the England team seek to emulate their predecessors, with higher expectations than the results could possibly justify.<br><br>It is very much Warren Mitchell's film, his performance stands in comparison with any of those in more critically acclaimed '60's films such as This Sporting Life or the Loneliness of the Long Distance Runner. Norman Cohen, the director, deserves credit for this too.<br><br>All in all, a worthy and atmospheric social drama with, yes, a little comedy, which being what it is, contributes to a period piece, which has stood the test of time well.","user":"michael-1151","rank":[13,15]},{"title":"Superior television spin-off","rating":31,"date":"31 May 2004","review":"One of the first television situation comedies to get the cinema treatment, 'Till Death' avoids the trap of being just an extended television episode which befalls many other adoptions, by opening out the story. It is more a prequel than merely being the 'film of the show', showing us the history of the Garnett family, from just before the start of the Second World War to the 'present day' of 1969, taking in the 1966 World Cup on it's way.<br><br>It is the wartime sequence of the movie (it roughly takes up the first 45 minutes of the film) which for me is the highlight of the picture. You really do get a proper sense of time and place. The credit mainly goes to the director, Norman Cohen, who gives what could have been a static television-style play, a real cinematic treatment.<br><br>The script by Johnny Speight is generally excellent and (as far as I know) isn't just a re-packaging of old television material. Ironically the movie falters when it moves 'twenty or so years later' and moves into the more familiar setting of the series That said, Rita's wedding is a memorable set-piece, moving between drama and comedy (and very uncomfortable viewing at times, due to Garnett's racism). <br><br>It's Mitchell's movie, of course. It's a credit to the actor's talents that that you can't help liking Alf, despite the fact that Speight's script constantly under-cuts and mocks the character.<br><br>It's an oddly bitter-sweet movie, as a community which had survived the Blitz is eventually disbanded, with the Garnett family exiled to a bleak modern concrete tower block. There is a real sense of loss here and it is this which places it a few notches up from the normal television spin-off. It's a pity that this movie will always be over-shadowed by its more controversial small screen incarnation, as it deserves a wider audience. It also showcases a rather brilliant title song, by Ray Davies, which any fan of The Kinks should check out.","user":"david-697","rank":[9,12]},{"title":"\"Innit marvellous!\"","rating":6,"date":"20 September 2001","review":"Alf Garnett is one of TV's finest - and most misunderstood - comedy creations. Alf's brought to life by socialist writer Johnny Speight and tremendous comic actor Warren Mitchell. Mitchell is Jewish, yet Garnett is a blistering satire of right-wing bigotry.<br><br>The film version of Till Death Do Us Part is superior to the misguided sequel In Sickness and in Health, though slightly behind the '65 TV original. The first half of the movie lacks the ethical counterpoint of his Labour-voting (\"Randy Scouse git!\") son-in-law, yet still scores with Mitchell's classic study of loud-mouth stupidity.<br><br>The joke is Alf himself, not his views, and seeing him denounce Hitler's fascism then, in almost the same breath, rally against \"Eye-ties\" and \"coloureds\" is a fine parody of small-minded ignorance. This is a man who gleefully cries, \"get a bit of action now\" at the outbreak of the Second World War. A man who proffers \"Ugly, innit?\" at the birth of his own daughter. On being told his daughter's mother-in-law goes to church every Sunday, he rants, \"I said I was religious - I didn't say I was a bloody religious maniac!\" Often it's the way he tells 'em. Other Alf philosophies include repressing student demonstrations with a plan to \"bung that lot out to work at fourteen, same as they done in the old days\". \"Wasn't that bad,\" he says about Hitler, when deciding, with hindsight, that we should have joined forces with the Third Reich, \"Had his faults.\"<br><br>Alf's the man who has an opinion on everything, no matter how ill informed, and regularly expresses it, preferably in a crowded pub, to anyone that will listen. Alf's only flexibility in his views is in having a photograph of Winston Churchill ready to take the place of Neville Chamberlain's when he resigns.<br><br>This form of satire takes risks and can be shocking - during the film Alf criticises the calibre of the Japanese after Hiroshima and insults the Pope. \"The coon's got a sense o'humour\" he declares of a young girl before collapsing in a drunken heap and plastering his daughter with beer at her wedding reception. A documentary on Mitchell's life saw him recount a tale of a man who approached him in the street, praising him for \"having a go at them coons.\" Mitchell's response was \"we were actually having a go at idiots like you.\" That said, while an elitist amusement, the fact that this material became such a mainstream hit means that real-life bigots will ultimately see it as a vindication of their views, making it questionable entertainment.<br><br>Working a half-hour sitcom into a feature-length narrative is inevitably hit and miss, though Speight must be praised for doing something new with the format rather than just crafting a triple-length episode. Where the series saw Alf tirading against 60s counterculture, the first half of the movie is a kind of pre-story, with Alf and Else in the middle of the blitz. The film's recreation of 40s England is well realised, even if editing in stock footage of aircraft disrupts the illusion somewhat. Direction by Norman Cohen is also often cleverer than you might expect for this type of material.<br><br>At the halfway mark we get a \"nearly 20 years later\" caption, taking us up to the present date and the series' timeline. A three-and-a-half-minute dream sequence in the final stages may seem like filler, but it was good enough for Chaplin in The Kid, so it gets by here. Maybe the problem with the central character is that Mitchell makes him so likeable in spite of himself. Some famous names offer support in the film - Brian Blessed, Bill Maynard, Geoffrey Hughes, Anthony Booth and Frank Thornton - but, other than Booth, none of them get much of a look in, this being Mitchell's film all the way.","user":"The_Movie_Cat","rank":[9,12]}]