[{"title":"Mel Brooks is a genius!","rating":10,"date":"10 November 2003","review":"Spaceballs is one of my favorite comedies of all time, it's actually one of those few movies that I know every single line too. I know that seems a bit sad, but this film has so many memorable lines that it came so natural. I've watched this movie since I was a little girl and the strange thing is that every time I watch it, it just seems to get funnier and funnier. I don't understand how a person could not laugh with this film, it just has perfect humor that I'm sure could make the emotionally stunted person laugh. How could you not laugh at Rick Morannis as Lord Helmet? He was beyond a perfect choice for Helmet, he was the complete opposite of what Darth Vadar was, and he didn't have a problem making fun of himself. In fact, the whole cast looked like they had the ultimate blast making this film, everyone clicked so well. The story is one of Mel's finest parades, of course, this one is of Star Wars or pretty much any space film.<br><br>Lord Helmet and President Skroob wish to steal all of Planet Druidia's fresh air and transfer it onto their own, but they must get the combination to the air shield that is protecting it. King Roland's daughter, Princess Vespa, runs away from her wedding, since King Roland is the king of Druidia, Lord Helmet kidnaps her to get the combination. King Roland asks space rebel, Lone Starr and his faithful side kick Mog(half-man half-dog) Barf, to save the princess. But things quickly turn bad when Helmet does get the combination and now Lone Starr must use the \"schwartz\" and defeat Lord Helmet and Skroob before they suck all the air from Druidia.<br><br>Spaceballs is seriously just a great comedy, I guarantee you that you will have a good laugh by watching this film. Every scene is just so funny, my favorite is always the one with Lord Helmet playing with his dolls and Corinel Sanders walks in on him, you'll just have to see what I mean, but it's the funniest scene in my opinion. But there isn't one scene that isn't funny. If you are a fan of Mel Brooks, I don't see any reason why you shouldn't love this film, it's my second favorite just behind Young Frankenstein, but that was a tough choice. I highly recommend Spaceballs for anyone, please see this film, you won't regret it.<br><br>10/10","user":"Smells_Like_Cheese","rank":[106,133]},{"title":"Yuks in \"Space\"...","rating":9,"date":"9 February 2000","review":"Leave it to Mel Brooks; no one else could make a space movie with references to \"The Wizard of Oz\", \"The Godfather\", Mr. Coffee and flying Winnebagos.<br><br>\"Spaceballs\" is just about the best post-\"History of the World Part I\" film Mel has made and that's saying something, considering how many great jokes Mel and Company is able to pull off while within PG territory.<br><br>Easy enough to guess that this is Mel's take on \"Star Wars\", complete with his own versions of C-3P0 (Dot Matrix), Princess Leia (Princess Vespa), Chewbacca (Barf the Mawg) and a combination of Han Solo and Luke Skywalker (LoneStarr).  <br><br>Oh, and let's not forget Dark Helmet!  The very embodiment of evil (Mel Brooks-style) who not only wears a black cloak and headpiece but also a stylishly-wide black tie.  And when he strikes...it's usually not above the belt.<br><br>The gags come fast and furious and, as is usually the case, all the regular faces show up (Graham, DeLuise, Van Patten) and Mel gives it all he's got. Lots of space sagas get equal ribbing (the \"Star Wars\" trilogy, \"Alien\", \"Planet of the Apes\") and there isn't a cliche that Mel fails to notice. <br><br>\nYou can't blame Mel Brooks for thinking this genre needed a good skewering. He started it in \"History of the World\" with his \"Jews in Space\" coming attraction and continues it here.  My only complaint: Mel, why did you have to wait so long??<br><br>Eight stars, plus a half star more for Pizza the Hutt; I loved it, especially when the pepperoni started running.  Also for President Skroob's (Brooks') comment after being mis-transported (\"Why didn't somebody tell me my a** was so big??\").  <br><br>Okay, nine stars.  Mel Brooks strikes back!","user":"Mister-6","rank":[94,120]},{"title":"Of course it is my dear... I guarantee it!","rating":10,"date":"17 November 2005","review":"A joyous, hilarious fairy-tale (which just happens to be set in a galaxy resembling one far, far away, a long time ago)! Many cheap, childish, utterly irresistible gags. Special effects of sufficient quality that they don't distract. Excellent ensemble acting with Rick Moranis a real highlight. And a space Winnebago...<br><br>One of Mr. Brooks's finest efforts! When the cod-seriousness of Episodes I, II and III gets too much for you, just imagine Mace Windu with his Schwartz tangled and pop this movie on.<br><br>Now, it's getting a bit stuffy in here so I'm off to inhale some delightful Perri-air.","user":"thrasyllus","rank":[65,83]}]