[{"title":"Let Bud and Terence entertain you.","rating":8,"date":"19 June 2003","review":"'Lo chiamavano Trinità' is one of the most charming and funny comedies ever made. The incredible duo Spencer/ Hill is fabulous. When you watch 'Lo chiamavano Trinità', it's like you get a good feeling all the time (you will get the same feeling if you watch the sequel). 'Lo chiamavano Trinità' is very unpretentious - and the simple jokes hits you all the time. It has also wonderful music (the sequel has even better music). Trinity is for me without doubt one of the most charismatic characters ever in filmhistory. I have to mention a quote:<br><br>Mescal: It's mierda! (When tasting the farmers soup) <br><br>Rating: 8 of 10.","user":"latsblaster","rank":[53,59]},{"title":"One of my all-time favorites!","rating":10,"date":"6 September 2001","review":"I LOVE this movie! Probably the most epic with Bud &amp; Terence. Super-funny spaghetti western. All the typical elements of their films are present: lots of bar fights, people flying everywhere, the usual, wonderful cheap jokes... legendary the final mega-fight between the mormons and the bad guys! A Must-see for every age!  :D","user":"sperman69","rank":[47,53]},{"title":"One of the few comedy westerns I like - - watch out for the lousy DVD","rating":7,"date":"7 October 2004","review":"(aka: THEY CALL ME TRINITY)<br><br>I have to admit I'm not one for comedy westerns but this one was actually funny in parts. It's almost as funny as SUPPORT YOUR LOCAL SHERIFF (1971) and I would almost consider it a welcome addition to my DVD collection were it not for the fact that the current Direct Source Media DVD weren't so awful. <br><br>Trinity (Terence Hill) a dirty, dusty drifter-turned bounty-hunter comes to town to pay a visit to his horse-thieving half-brother Bambino (Bud Spencer) who's pretending to be the real sheriff. Bambino's looking for the best way to rustle some of the Colonel's horses before he leaves and he's not interested in letting Trinity cut in. In the meantime, the Colonel (Farley Granger) is doing some plotting of his own, not only to get rid of Bambino but also to displace some Mormons who are settling on some land he wants for his own cattle.<br><br>The fights, the stunts and the gunplay Trinity and Bambino play on the Colonel's men is hilarious. I like it when Bambino uses the bottom of his fist to hit the bad guy's on the top of the head. And the ending fist fight scene at the Mormon's camp cracks me up. No wonder this film made Hill and Spencer popular in Europe. <br><br>Like I said, the DVD is a travesty with a transfer that's watchable but looks like it was lifted from a VHS source. The print itself the transfer was taken from is pretty grainy with bad splices and an audible hum in the soundtrack. It deserves a failing grade.<br><br>The TRINITY series needs the Anchor Bay DVD treatment, really bad. Since these Euro westerns were so popular, I'm surprised they haven't secured the rights to it yet.<br><br>7 out of 10<br><br>-","user":"westerner357","rank":[32,37]}]