[{"title":"A cult film about cult practices...","rating":9,"date":"19 September 2003","review":"The best British horror film ever made? Probably, yes. The best horror film ever made? No. The best occult thriller ever? Quite possibly.<br><br>The film was in part conceived as a vehicle for Christopher Lee to get away from his Hammer roles and give him a chance to demonstrate that, yes, he could actually act. Perversely, however, the film is in many ways homage to the films produced by the Hammer studio and is at the same time their antithesis.<br><br>Although Lee's Lord Summerisle was certainly a stronger character than his Hammer caricatures, and was suitably sincere and sinister, it was left to Edward Woodward's bumbling, pious Highland Police Sergeant to carry the film.<br><br>The rest of the cast are not as strong as the two central characters. Famously, it was always suggested that Britt Ekland's voice was overdubbed for the entire film. Robin Hardy has now denied that, stating that only her singing was dubbed. Even if the other actors' performances fail to match those of Woodward and Lee, somehow, it doesn't detract from the film.<br><br>Almost as famous as The Wicker Man itself are the stories surrounding the film. The version first released was almost completely butchered from an original, almost grandiose cut of 102 minutes to a more concise 87. Christopher Lee has always maintained that this was a crime against the greatest piece of art with which he had ever been involved. The original negatives were then accidentally thrown out!<br><br>When a fuller version finally surfaced in 2001, Lee's contentions were (at least in part) proved. The film was overall improved, and save for a couple of points of rather clumsy editing (the flashbacks Edward Woodward has as the penny drops spring to mind) and the pointless scenes before the flight to the island, it ran more smoothly and made more sense.<br><br>The film's greatest asset comes through in whichever version you actually see. The eerie sinister atmosphere never fails to be conveyed. Somehow, the fictitious Scottish island setting of Summerisle, which could so easily turn twee at any moment steers clear of the territory occupied by Brigadoon or the now happily deceased BBC TV drama 'Monarch of the Glen'.<br><br>The setting's remoteness, which could have been its worst enemy, is actually its greatest ally.<br><br>Perhaps the most interesting thing about the film, however, is the way that it steadfastly refuses to fit precisely into any genre. It is all at once a horror, a thriller and even a musical! Unbelievably, these things come together and fit into the film.<br><br>The music in The Wicker Man is unique, always adding just the right tone of eeriness or bawdiness to proceedings. A strange mix of elements including traditional folk music, it's as innovative and interesting as the soundtracks to Blade Runner, or The Virgin Suicides. The opening title sequence to the tune of Corn Rigs succeeds in transporting you with the plane over the remote coastal peninsulas and out into the Irish Sea towards Summerisle.<br><br>My only criticism of the film (and I really am nitpicking here) is the way it goes about establishing Sergeant Howie's Christianity. I can't conceive of the Howie character adhering to any religion other than one of the obscure forms of Presbyterian Protestantism practised in parts of the Highlands of Scotland. These scenes contain an apparent reverence for the sacraments that appears more Catholic in nature. This distinction in religious backgrounds is important to understanding Howie's attitudes. Nevertheless, I am truly nitpicking when I make this criticism!<br><br>But what ultimately makes this film is its ending. Without giving the game away for those who have not yet seen the film, it is inevitable, and yet wholly unexpected when it finally comes.<br><br>The Wicker Man would be a classic of its genre - if it had a genre. Instead, it has to be ranked as a classic film.","user":"united100","rank":[193,230]},{"title":"Creative, entertaining and tragic. A beautiful picture.","rating":10,"date":"27 September 2003","review":"The Wicker Man' follows the story of Sgt. Howie (Edward Woodward) who travels to the Scottish island of Summerisle to investigate the disappearance of a young girl. However, the entire population of the island, including the girl's own mother (Irene Summers), denies that such a girl ever existed and as the righteous Howie investigates further he learns the terrifying truth of Summerisle. <br><br>Famed for an exceptional yet short performance from the legendary Christopher Lee as Lord Summerisle, The Wicker Man' is a textbook example of how to create a virtually seamless horror/thriller. Director Robin Hardy at one point thought this low-budget movie would never be made as he was forced to work with a very small budget, a short shooting schedule and a studio on the verge of bankruptcy that was in fact declared bankrupt just a few short months after filming was completed. However, The Wicker Man' was made and nowadays is accepted as one of the finest horror/thrillers of all-time despite not receiving the praise it so deserved back in the Seventies. The Wicker Man' was brilliantly written by Anthony Shaffer who chose to add very subtle clues as to what would happen that are made more apparent on further viewings. With the added advantage of obvious research into the pagan rituals The Wicker Man' sought to portray the movie is left with a chilling feel of realism. <br><br>An enchanting soundtrack is blended marvellously into The Wicker Man' which seems to lull the viewer into a false sense of security. Despite the constant foreboding feeling created by the intricate plot and top notch acting, there is a certain playful feeling that is brought about by the elegant soundtrack making it difficult to actually envisage any evil events occuring. One could be forgiven for wondering on a first viewing just where this bizarre little movie is going but the story has a quality about it that can grab the viewer and keep their interest all the way to the bitter and awfully haunting ending. The final scene as the credits roll is an image that is now engrained on my mind with all its emptiness and despair. As the curtain falls on this performance (so to speak) it becomes hard not to question the events leading up to the end and the humanity of these islanders. In some ways The Wicker Man' is an unsettling history lesson that makes itself seem all too real. <br><br>Edward Woodward gives a tremendous performance as the increasingly baffled Sgt. Howie. He played his character convincingly and Howie's eventual realisation of what is going on around him is portrayed so well that it adds more realism to the movie. Woodward was able to take a character that may be a figure of loathing in another type of horror movie and make the audience feel empathy towards him. The strong religious beliefs within Howie thoroughly clash with the free-loving pagan society which adds humour and distress at the same time. However, as mentioned before, Christopher Lee somehow stole the show playing the relatively small part of Lord Summerisle. His magnificent onscreen presence seems so powerful that one forgets that he is only in the movie for a short amount of time. Added to this great mix was Britt Ekland as Willow, the beautiful landlord's daughter. Her seductive, nude dance (though a double was apparently used in parts) was one of the most erotic moments in horror and helped to contribute further realism to the movie. The scenes featuring the clashing characters of Howie and Willow are both amusing and tense making for some interesting character interaction. <br><br>The Wicker Man' is undoubtedly a cult classic of the horror genre which I recommend to all fans of horror/thrillers. Visually pleasing with some superb acting and direction as well as a fine screenplay. My rating for The Wicker Man'  9/10.","user":"Snake-666","rank":[255,317]},{"title":"Chilling insight into ancient paganistic rituals, slightly chipped","rating":7,"date":"5 January 1999","review":"The bizarre and chilling tale of a fool chosen to be king for a day.<br><br>The shocking denouement of this film has stayed with me for many years, far longer than scenes or images from more famous films.  A classic of its kind, it deserves the re-release it will probably never get.<br><br>Superficially a mystery thriller, this intelligent and well researched story delves into the beliefs and rituals of Ancient Britain, its folk mythologies and music, and reveals some of the un-settling fears that lie at their root.  Set on a remote Scottish Island and giving the appearance of being a Whisky Galore, Local Hero type community, there is yet something off-centre about the townspeople that Edward Woodward, as Sergeant Howie, has come to investigate.  The presence of Christopher Lee as the eloquent, commanding Lord of the Isle, gives the film an insidiously creepy edge suggesting a Hammer Horror lurks around the next wee wall.  He is perfect in the role.<br><br>The story un-folds like a cross between Chinatown and Rosemary's Baby, as the dogged Howie gets led all over town, up one blind alley and down another.  Clues are dropped all the way about what is really going on, but we don't heed them.  Until it's too late.  Too late to walk away.<br><br>The standard video version runs for 85 minutes, cuts many important scenes and shows others out of sequence.  A BBC version shown in 1998 ran around 95 minutes.  The full version ran 102 minutes but I have never found it.<br><br>However, whilst uneven in parts and certainly flawed this is one of the most intelligent and interesting stories I have ever seen on film.  See it yourself and you too will have many meetings with 'The Wicker Man', in your dreams, in the dark, where you cannot escape.","user":"xander-2","rank":[185,228]}]