[{"title":"One of the best Feldman movies","rating":9,"date":"25 October 2000","review":"Marty Feldman was an extremely funny and under appreciated comedian and this film is one of his funniest.  You probably will remember Feldman from his Mel Brooks days in YOUNG FRANKENSTEIN and SILENT MOVIE.  However, he also had two other worthwhile films to check out:  THE LAST REMAKE OF BEAU GESTE (1977) and IN GOD WE TRU$T (1980).  In Think Dirty, Feldman wrote the screenplay and stars to wonderful comic effect.  Most of the funniest moments are sex-related and there is a brief nude scene with Julie Ege, but overall the film portrayed in a seemingly innocent tone.  The basic idea of using a controversial topic (in this case sex) to sell a product is not an advertising novelty, but Feldman pulls it off with a good deal of funny moments, especially the day-dreaming sequences and the animated bits (by Richard Williams Studios of PINK PANTHER fame). I happen to disagree with Leonard Maltin's review of this film (and this is not uncommon).  I would recommend this to any Monty Python fan or anyone who enjoys the Farrelly Brothers and Mel Brooks comedies today.","user":"cellorey","rank":[20,26]},{"title":"sexiness sells","rating":15,"date":"15 August 2011","review":"Although a completely silly, absurd movie, Jim Clark's \"Every Home Should Have One\" (also called \"Think Dirty\") is also sort of a spoof of advertising and commercialism. Marty Feldman plays an ad exec hired to come up with a sexy way to advertise porridge. And when I say sexy, I don't mean it lightly! I mean, have you ever seen Julie Ege?! <br><br>I figure that, like \"Bob &amp; Carol &amp; Ted &amp; Alice\", this movie was basically capitalizing on cinema's new permissiveness. Even so, there is some REALLY funny stuff here. Some scenes made me absolutely crack up. Feldman was truly showing what he would later bring to Mel Brooks's movies.<br><br>Also starring Judy Cornwell, Patrick Cargill (the police chief in \"Help!\"), Jack Watson, Penelope Keith and Shelley Berman.","user":"lee_eisenberg","rank":[7,8]},{"title":"An all-time favourite for maybe the wrong reasons!","rating":21,"date":"21 November 2004","review":"I remember seeing this for the first time when I was about 7. Children In Need was on BBC 1 (or maybe Comic Relief) and I was allowed to sleep downstairs to watch the whole event. Anyway, I found this on the other channel at about 2.30am, and I was totally blown away by it. Not least the funky theme tune, the cartoons, those eyes, Julie Ege etc. Anyway, a couple of years later I got it on VHS...surprise surprise, the cut I'd seen on ITV had been trimmed significantly. The bit with the hot dog vendor, the fantasy sequence where Teddy imagines a fight sequence with the vicar had both been cut, with maybe some other bits. I've seen this film more than any other film, and have collected as much stuff to do with it as I can; 4 posters, lobby cards, and approximately 60 black and white stills. If anyone has anything else related to this film, please get in touch. A few things bother me though; how did Shelley Berman get involved?Why is Alan Bennett uncredited? Shelley Berman turned up in Friends a few years back, and his character's name was Kaplan, as in this film. Was Kaplan his own persona, or was this a nod to the film? Does the US cut differ any from the UK?","user":"gpshovlin","rank":[11,14]}]