[{"title":"Terrific, moody slasher!","rating":10,"date":"8 February 2007","review":"In the wake of Halloween and Friday the 13th, many similar films were released, most of which had little or no distinguishing features. One of the most effective and atmospheric was My Bloody Valentine.<br><br>Shot in Canada and very infamous for it's brutal battle with the MPAA, My Bloody Valentine is a surprising success, and a wonderful addition to the slasher genre. The acting is good, which comes as quite a shock for any slasher lover. The deaths, while obviously edited, are very effective and intense, especially the laundry room sequence. The image of the killer, dressed in a full miner's garb, smashing the lights along an already dark mine shaft, while a group of victims try to escape is terrifying.<br><br>The setting is quite interesting. Most Canadian films try to disguise the fact that it's Canadian. Well, this movie doesn't, which makes it very neat.<br><br>I'd say that it's lush photography, good acting, frightening set pieces and killer, and brutal deaths make this is one of the most impressive slashers of the 80's, maybe of all time.","user":"cmoore0013","rank":[49,57]},{"title":"Give 'em hell Harry.","rating":8,"date":"18 November 2004","review":"My Bloody Valentine is one of the best and most well-made slasher flicks of the 80's. It's also one of the better holiday themed horror movies around!<br><br>A crazed miner is determined to stop the celebration of Valentine's day in a small Nova Scotia town, with the help of a trusty pick ax that is. <br><br>* minor (or miner, I'm not funny.) spoilers *<br><br>While the film doesn't re-invent the wheel for slasher movies, it still manages to stand out well from the rest of it's kind. The climax in the mine creates some great suspense in an atmospheric and claustrophobic setting. The cast is quite likable and good, even though there's not a known name in sight. And the gore hounds should enjoy the happenings, cutting out hearts and pick ax murders, even a nasty death-by-dryer and a face scalded in a boiling pot. It's still gory despite cuts made by the MPAA. There's also the occasional touch of colorful dark humor.<br><br>The direction, while simple, is well done with some good shock cuts. The music score is a nicely moody one, even beautiful in a way. Over all, the film holds together well.<br><br>Seek it out slasher fans! This is one enjoyable cult film that is not to be missed!<br><br>*** out of ****","user":"Nightman85","rank":[37,43]},{"title":"The Slasher That Paramount and the MPAA Tried to Kill","rating":7,"date":"24 November 2009","review":"Twenty years ago, Harry Warden went nuts and slaughtered a bunch of people on Valentine's Day. The mining town he hailed from canceled subsequent V-Day dances, but when they try setting one up again, Warden seemingly returns with his pickax, ready to hack the local kids up and leave his mark. Things can only go bad from here.<br><br>Director George Mihalka brings us another holiday-themed slasher, riding the success of \"Black Christmas\", \"Halloween\" and \"Friday the 13th\"... and paving the way for \"April Fools Day\". But George is a nice guy and I don't want to say he's just one among the crowd. There were hundreds of 80s slashers, but only a few stand out today. \"Bloody Valentine\" is, of course, one of them.<br><br>Even in its original, neutered glory (anywhere from three to nine minutes were cut) the film stands as a good film. Without any really notable actors or actresses (okay, so Neil Affleck had a brief role in \"Scanners\"), and being Mihalka's one big mark, the film carries itself on story, acting and blood. The blood, while lacking a times, comes gushing through in others. And like any good slasher, the killer's identity is not revealed until the end... leaving us guessing until the last twist of the knife (or ax).<br><br>Slasher fans need to pick up the Lions Gate special edition. While the double-disc with \"April Fools Day\" is cheap and still worth watching, you don't really know this film until you've seen it uncut. The gore, oh my, the gore! It's actually a shame that it took so long for a company to come along and save this film because it was even better than we once assumed... Mihalka could have been one of the 80s greats (and, in my mind, he still is).<br><br>If you've been a horror fan and avoided this one, please see it. Sure, it's mostly mindless fun -- kids drinking and making out, getting hacked up -- but I can watch variations of this formula dozens, scores or hundreds of times. There's something fun about a simple stalking film that you can't always get from other films that try too hard to be clever. And I like thinking films, but a night with buddies and booze... you need a slasher. And this is the one you should pick.","user":"gavin6942","rank":[14,15]}]