[{"title":"Suspenseful","rating":10,"date":"25 October 2002","review":"I was the edge of my seat! A suspenseful Who Done It with compelling performances by Pamela Franklin and Stephen Boyd in challengingly complex roles.  The plot is fairly progressive for its time - the topic of mental illness still somewhat taboo in our society.  I read somewhere that Stephen Boyd was so taken with the story and the character, he took a sizeable pay cut to play the role of Alex.  Versatile actor that he was, he seemed to most enjoy those demanding and unusual character roles with substance and depth that really challenge an actor and in which he performed so notably well. And Pamela Franklin, at the age of 14, is an incredible actress taking on a role that veterans would not have managed nearly as well.<br><br>Great story - great film - great acting!","user":"joandaniels","rank":[34,40]},{"title":"Mysterious Mystery","rating":9,"date":"9 June 2011","review":"Does that sound redundant? It's not, you know. Think of all the 'mysteries' that show the murderer in the first few scenes (\"The Big Clock\", \"Sleuth\", etc.). \"The Third Secret\", on the other hand, waits until almost the last scene to reveal the murderer, which makes it a much more satisfying mystery.<br><br>But what sets \"The Third Secret\" apart is an exceptionally well-written script with some of the most intelligent dialogue to come down the pike in years. What a refreshing departure from the current fare, loaded with f-bombs and other obscenities. This picture is written for grown-ups by a grown-up. Couple this with flawless performances from all concerned, and you have a picture worth at least a seven in our rating system.<br><br>I can go no higher because this movie is a bit long-winded, with protracted scenes of very capable actors engaged in aforementioned dialogue to the point of tedium. You will, however, enjoy the overall premise - that the death of a well-known psychiatrist was a murder and not a suicide. Very cleverly handled with a twist ending. \"The Third Secret\" is well worth your time. It's just that it seems to last longer than it actually does.","user":"GManfred","rank":[11,13]},{"title":"Striking psychological thriller","rating":5,"date":"5 July 1999","review":"I first saw this as a kid, in 1970, on tv, and thought the nightmare sequence at Diane Cilento's home to be one of the scariest scenes I'd ever seen on film. After 29 years the impact is somewhat diluted, but overall the film holds together pretty well. Take a look at the extraordinary Douglas Slocombe panavision cinematography, the driven performances of Franklin and Boyd - an underrated actor if there ever was one - the striking set pieces on the Thames riverbank. It should be restored and re-issued on a VERY big screen. Scorsese, where art thou?","user":"Grasse","rank":[21,28]}]