[{"title":"every once in a while a movie like this comes on the TV","rating":9,"date":"19 December 2008","review":"The time and the setting (late 60's LA) seem among the most authentic of any movie from that period, probably owing to the director who wasn't trying to exploit the culture like so many American directors of the time did. The film transcends nostalgia, and is very worth seeing for the style, authenticity, and music (provided by one of LA's greatest bands, Spirit). The main character played by Gary Lockwood (lots of TV credits over the years) is under great direction by Demy, who helps to make him into an American version of someone out of French New Wave. And into the wave comes Anouk Aimme, whom he meets in an LA \"model shop\", about as cool and detached a woman as ever graced the screen.","user":"RanchoTuVu","rank":[15,15]},{"title":"Worth catching","rating":5,"date":"5 February 2003","review":"This little seen Jaques Demy film is no lost masterpiece but is well worth catching. One of the most notable features is how well it captures a look of late sixties LA rarely seen in other movies. The story though is slight and the acting is uneven. Psychedelic rock fans should watch it to see the legendary Spirit - their music is on the soundtrack and they have a few lines. To sum up - an oddly interesting film not a great one.","user":"cwarne_uk","rank":[27,29]},{"title":"Sweet, European style drama with amazing LA milieu","rating":9,"date":"16 May 2005","review":"I saw this movie when I was 17, and shortly thereafter decided that I had to move to Los Angeles. In the years since, MODEL SHOP has remained so unavailable and obscure that I was never sure if the movie was really good, or only good to an impressionable small-town 17-year old seduced by its dreamlike visuals of the big city.<br><br>After seeing it again at the American Cinematheque, I have to commend my younger self for having good taste. The unusual locations and spare, sun-bleached desert look give the film an almost hallucinatory air. Only an outsider to LA like Demy can find the poetic beauty in desolate beach cottages strewn among sand-blown paths and churning oil derricks.<br><br>Demy's story of one day in the life of a disillusioned architect conveys a rich emotion perched between confusion, love, fear and optimism. I can't wait to see it again...","user":"aaarrgh","rank":[35,40]}]