[{"title":"From a Japanese girl","rating":3,"date":"3 November 1998","review":"This is the first time I commented on a film. I saw this yesterday night for the first time. And I just cried.<br><br>I cried for Jim. I cried for the pain our country caused in the innocent civilians. (Japan can be so stupid!) I cried for the pilots of the Zero-sen.<br><br>I've read and seen lots of movies of these pilots. They're called tokoutai in Japanese. They get on their planes knowing they will die. It's a suicide mission, and they were very proud of it. I know if you're on the winning side you may not sympathize these pilots, but they were just fighting for their country. In those days, the emperor was everything. They taught you to die for the emperor at school when you were only in 1st grade.<br><br>But I don't know the war. I've never experienced it. I can't understand the concept of dying for your emperor. So I sympathise with Jim. Jim is a symbol. A symbol of innocence, of the horrors of war. His singing proves that too. He's also the ray of light for these prisoners. His energy and vitality are important aspects. It brings out some human characteristics in the sergent as well.<br><br>Christian Bale was remarkable. He should be commemorated or something for this performance, cause it was just brilliant. So was John Malcovich.<br><br>Overall it was great. One of the best movies I ever saw. It made me think, a lot. About war, about Japan, about history, and about humans in general.","user":"Angel326","rank":[280,306]},{"title":"Extraordinary performance from Christian Bale","rating":8,"date":"31 May 2004","review":"I had put off watching this until recently, I do not know why, I had not read reviews and for some reason imagined it to be a movie about a young Japanese prince(!!).<br><br>I was captivated by the performance of Christian Bale as a privileged young boy named Jim Graham, growing up in Shanghai, very far removed from the poverty and despair all around him. When war breaks out, this changes him forever and hence the story.<br><br>After some harrowing experiences he winds up in a prisoner of war camp where he befriends some interesting characters and quickly adapts to a life of conniving and subterfuge to survive.<br><br>The transformation of Jim is beautifully captured, Steven Spielberg is a gifted director of child actors and gets a maximum performance always.<br><br>I was enthralled from beginning to end, young Jim was forever changed by his experiences and this change is portrayed starkly here when he is finally reunited with his parents.<br><br>8 out of 10 for equally impressive performances from John Malkovich and Miranda Richardson, but Christian Bale's performance deserved an Oscar.","user":"wisewebwoman","rank":[117,145]},{"title":"Extraordinary film","rating":8,"date":"19 August 2001","review":"Reading through the reviews, there were a lot of people who didn't understand this film.  This is Spielberg's venture into the realm of art in cinematography.  This film is a visual masterpiece and you are swept along from beginning to end.  Yes, the tale gets a bit loose in spots and you never know what's going to happen next.  But, if you're willing to give up warm and fuzzy for lush visual images and startling leaps of character, you'll see what Spielberg's trying to accomplish.  This film makes use of the talents of Miranda Richardson and gives some early exposure to the likes of John Malkovich and Ben Stiller, but young Christian Bale steals the show. The reviewer that commented on the \"gothic\" effect of the Tai-Pan's going to the costume ball being driven through Shanghai was right on.  This film is rife with such scenes and does not disappoint.  It's wholly misleading to look for some kind of action story underlying this film.  The tale, taken from the book, is straightforward enough:  a young boy's boost into manhood through the second world war.  The film is full of memorable moments and visually very, very pleasing.  As art, it is excellent.  That's likely why it wasn't a blockbuster, as say, e.g., Poltergeist, Close Encounters and the Jurassic Park films, were.  But, hey.  That's the cost of creating art as opposed to crap. And, crap does draw a lot of flies...","user":"artzau","rank":[186,236]}]