[{"title":"a delightful, kitschy film","rating":7,"date":"1 January 2003","review":"This is a movie you cannot watch without smiling due to its many kitschy, laughable elements. The only son of a wealthy old English family of frog-worshippers heads a bike gang called the Living Dead that discovers how to come back from the Great Beyond by wishing really, really hard. Hijinks ensue as the bikers kill themselves one by one and come back, ready to commit better mayhem than they ever could when alive because now they are indestructible.  The story features unbelievably short skirts on all the girls; a hippy folk song about the glory of living and dying as a biker; young moms being terrorized by the Living Dead as they push prams in their go-go boots and hot pants; interior decor that inspired the makers of 'Austin Powers;' and arcane frog-worship ceremonies that ultimately lead to the undoing of the gang.  Never a dull moment.","user":"eileenmchenry","rank":[42,44]},{"title":"What does the title have to do with the film? Who knows!","rating":8,"date":"20 August 2004","review":"I've just watched this great film, and I just can't believe I haven't watched it sooner. What a movie! It's got everything a great seventies horror should have - groovy music (very reminiscent of Air's soundtrack for The Virgin Suicides), a well-spoken biker gang, hilarious suicide attempts, the living dead, as well as a bizarre occult fascination with frogs. Or were they toads? Who cares. It's a great film anyway, and I was pleasantly suprised at it's total lack of sex and gore. It just goes to show that you can have an entertaining horror film without resorting to exploitation.<br><br>And as for suprise endings, well, you'll never see this one coming, I promise you!","user":"trouserpress","rank":[25,27]},{"title":"The coolest movie I have ever seen--no exaggeration!","rating":9,"date":"22 December 2004","review":"I really don't want to say this is my favorite movie, but it sure is tempting. I know full well how cheesy and ridiculous it is... but it's also the most rockin', stylish, all-out groovy flick I have ever seen!<br><br>I have no idea why this is classified as a horror movie. As far as I can tell, it's meant to be a comedy. A very, very black comedy. The movie's brilliance is that it takes extremely touchy subjects and turns them into lighthearted jokes. The basic message, as far as I can tell, is that there is nothing wrong with mass suicide, anarchism, or devil worship... in fact, it can even be fun! Now, can they really be SERIOUS about this? I think not. The entire movie is a joke, and a very funny one.<br><br>With scenes such as a a biker jumping to his death after telling a cop \"I'll be right down!\", a biker blasting out of his grave on his motorcycle, a biker coming back from the dead in the morgue and calmly walking out like he just woke up from a nap, etc., all accompanied by some seriously sweet rock music, this is about as cool as it gets. I defy anyone to come up with a more entertaining movie than this.","user":"Chromium_5","rank":[33,37]}]