[{"title":"In one of her most natural performances, Liz is a cheerful light, buoyant in movement","rating":8,"date":"26 January 2009","review":"\"Father of the Bride\" is a mainly delightful family comedy which benefits from a strong central performance...<br><br>One night at dinner, daughter Kay casually announces her engagement... Father and mother react on cue...<br><br>Following practically all the events of Edward Streeter's charming novel, the Oscar-Nominated screenplay is a series of comic and warm set pieces: the loving father asks his daughter to invite his future son-in-law for dinner; girl's parents meet boy's parents; prospective bride quarrels with prospective groom... The vignettes are applied with the light Minnelli touch at its most charming, and they are acted with captivating nonchalance by the incomparable Spencer Tracy in the title role and by the beautiful performances of Joan Bennett, Liz Taylor, and Don Taylor <br><br>As the complaining middle class father, thoughtful to his daughter's welfare and watchful as to the distributing of his money, Tracy is incredibly amusing... Torn by jealousy, Tracy is all good-natured father exhausted by the complete weight of the problems leading up to the happy day...<br><br>But it's an ensemble show, and as the typical spoiled daughter of a typical mid-American bourgeois, Elizabeth has one of her joyful screen moments, altering and urging her beloved ones with such gentle, persuasive, winning, and gracious manners","user":"Nazi_Fighter_David","rank":[20,22]},{"title":"Every Father's Worse Nightmare","rating":8,"date":"4 December 2001","review":"\"Father of the Bride\" is Spencer Tracy's picture. His performance as the overwhelmed father of the bride is outstanding.<br><br>The plot is simple. Stanley Banks'(Tracy) daughter Kay (the beautiful teen-aged Elizabeth Taylor) announces her impending marriage to Buckley Dunstan (Don Taylor). Mother (Joan Bennett) gets into the act and before you know it the bills are mounting and father is going greyer by the minute. There is the usual pre-marriage argument between the two lovers, the ever increasing guest list, a frantic rehearsal and finally the big day itself with father trying to maintain his sanity throughout.<br><br>The supporting cast is excellent. Leo G. Carroll is good as the befuddled caterer, Melville Cooper does a funny bit as the church deacon and the still beautiful Billie Burke along with Moroni Olsen appear as the parents of the Groom.<br><br>\"Father of the Bride\" under the able direction of Vincente Minnelli, is the kind of family comedy that we rarely see anymore.","user":"bsmith5552","rank":[22,31]},{"title":"an MGM corker","rating":16,"date":"16 April 2004","review":"My favourite performance of Spencer Tracy's from all the work he did in thirty-seven years in the movies - here he plays harassed father Stanley Banks struggling to cope with the comedy of his daughter Kay's wedding. Kay is played by the young and beautiful Elizabeth Taylor, who had just been married for the first time in real life; and her intended is played by Don Taylor, an actor I haven't seen in anything else, and can't really remember doing anything of interest in this.  The family is completed by Joan Bennett as Tracy's wife, and Rusty (later Russ) Tamblyn as their youngest child.<br><br>Although the movie does play up the comic potential of the wedding situation - the dad dreams of losing his trousers as he walks down the aisle, for example - it also has moments of poignancy, especially in the last few sequences where the parents dance together in the post-party mess of their once-pristine house.  This kind of thing puts the movie above the ordinary, and is exactly what was missing in the Steve Martin remake years later.<br><br>And don't let me forget Billie Burke and Moroni Olsen as the groom's parents - really funny!","user":"didi-5","rank":[29,43]}]