[{"title":"One of my favourites","rating":10,"date":"13 June 2001","review":"\"Russkies\" is basically a sweet movie. I'm not a sappy person, and it almost made me cry. (I had a huge lump in my throat.) There is just something about seeing people care for each other that really makes me happy. And \"Russkies\" gives me a warm feeling. The chemistry between the actors is incredible. What's even more amazing that three of them were young and quite inexperienced. Although its plot isn't very realistic, it's okay, because the meaning of it is not lost. And I think the whole point behind this little movie is that - this is gonna sound incredibly cheesy - friendship knows no boundary or age difference. That last scene between Danny (Joaquin/Leaf Phoenix) and Misha (Whip Hubley) had me in near tears. And one thing Misha said really hit home. I don't remember the exact words, but he said people don't trust each other. I think it's very true.<br><br>I bought this tape mainly to see Joaquin as a little kid. I know he's an awesome actor but I didn't know he was already awesome as a child. Those eyes, even at such a young age, can speak volumes. Joaquin/Leaf gave a truly great performance as Danny, and so did the other two kids whose names have escaped my ailing memory. I know nothing about Whip Hubley, and when the tape ended I thought he really is a Russian. Good performances all around, even from Summer Phoenix who wasn't in it a lot and that actress who played the blond boy's sister whom I usually can't stand.<br><br>All in all, \"Russkies\" is worth watching.","user":"tripwires","rank":[8,8]},{"title":"Very cute little movie.","rating":7,"date":"17 August 2005","review":"I remember seeing this movie when it first came out in the theaters--the L.A. Times gave it a favorable review and it sounded kind of fun. It was.<br><br>It's dated now ('80s clothes, '80s politics), but it's an amusing, somewhat corny little movie that will entertain and amuse. I thought that the interaction between the three boys and \"their\" Russian sailor seemed genuine, and I liked the premise. The scenes where the boys have a \"day out\" with their new (Russian) buddy are especially fun to watch.<br><br>Whip Hubley is cute and likable as the stranded Russian (but, oh, that big '80s hair cut he's got!). Leaf Phoenix (now known as Joaquin) is excellent as one of the boys. (I recall how the L.A. Times review took special note of Phoenix's performance, and predicted that he had a great future ahead of him. Boy, were they right!) Also take note of Benjamin Hendrickson (playing Phoenix's Hungarian father who has no love for Russians). Hendrickson is mostly known for soap opera work, but he has an effective supporting role in this film.<br><br>This is a little movie with some laughs and a good heart. It's not a *great* film, but still enjoyable. James Newton Howard (still early in his career when this movie was made) does a good job with the score. I even bought the soundtrack (on LP at the time) and it is enjoyable to listen to on its own!","user":"lacrescenta","rank":[12,14]},{"title":"Surprisingly sweet","rating":10,"date":"25 May 1999","review":"Going into this movie you may be skeptical, but fear not. This movie is very entertaining, the characters are all pretty well played, and the whole message is worth seeing the movie. Leaf Phoenix and his brother River, where among the best juvenile actors of the 80's. Unfortunately, the movie is no longer available for purchase and is pretty hard to find.","user":"MikeK-7","rank":[5,5]}]