[{"title":"Peter O'Toole as Lawrence, what a treat!","rating":10,"date":"10 July 2018","review":"Did you know that Cary Grant had been approached to play it? Yes, as well as Albert Finney and that made a lot more sense but it was Albert Finney who said, have you considered Peter O'Toole? Who? - Yes, I love that story. It goes to prove that certain things are meant to happen. I'm sorry if I'm going on about it. But I saw Lawrence Of Arabia for the nth time in a 70mm print in a crowded theater and what came across as the one major reason this film will be relevant forever is Peter O'Toole. His performance is timeless because it is unique. Cinematic and theatrical but always true. David Lean brilliantly created a sense of intimacy in O'Toole's eyes within the vast, arid landscape. I know the film has its detractors. I heard once director Michael Apted call it a \"silly movie\" Wow, I had Michael Apted's quote in my mind when I saw the film last and for the life of me, I don't know what he meant. I love this film.","user":"maureenmcqueen","rank":[83,91]},{"title":"Simultaneously personal and panoramic","rating":10,"date":"23 May 2004","review":"Sweeping, epic and literate version of British adventurer and soldier T E Lawrence's experiences in Arabia during the First World War. Lawrence, miraculously well played by Peter O'Toole, \"went native\" when sent into the desert to find Alec Guinness's Prince Feisal. Before long he was striking out himself against the Turkish Ottoman Empire, which still held sway in the region at the beginning of the last century. Lawrence's efforts to unify the various Arab factions are particularly prescient.<br><br>Lawrence became an inspirational warlord whose neutral presence amongst the Arab tribes, lead by Omar Sharif and Anthony Quinn, amongst others, served to glue together shifting and uneasy alliances. As well as wrestling with himself, with his own demons, and with the cruel desert environment, the Englishman was also faced with culture clashes which pitted not only the imperialists against the indigenous populations, but also the mercenary practices of the Arab guerillas against the discipline of the British army. In the end, Lawrence himself does not know which side he is on, nor which party he belongs to. Set against a backdrop of the Arabian desert, the nomadic allies under Lawrence's direction, attack and disrupt the Turks' efforts to maintain control of the territory, whilst the elephant - the British army and its heavy guns under General Jack Hawkins - pushes ever deeper into the area: not until his job is done does Lawrence learn that the French and British governments have carved up the middle-east between them and that the battle-lines for the 21st century are already being drawn.<br><br>Scripted by the inimitable Robert Bolt and directed by David Lean, Lawrence of Arabia is one of those films without a weakness, despite drawing complaints for its near four hour length. The dialogue, cinematography, soundtrack and especially direction are superlative; likewise the supporting actors. But it is O'Toole at his charismatic best who steals the show in his starring debut; he never looked back. It may take an effort to watch this movie, but is well worth the ride and will, by the bye, provide some insight into the fractious and volatile world of Arab politics. <br><br>One of the best films ever made.","user":"MidniteRambler","rank":[174,208]},{"title":"Still my personal favourite","rating":10,"date":"26 January 2005","review":"I first saw this film on its release, aged 13, and it forms an important part of my transition towards adulthood. I am pleased to see that it consistently rates 20something in the IMDb listings, even from others (whom I envy, for I can't see it with fresh eyes) who are seeing it for the first time. Pleasing too is that some of those are also teenagers, for whom a forty-three year old film must itself seem part of the past. As for the minority who are bored by intentionally slow pacing (and for whom punctuation, paragraphing and grammar are a lost art), I suggest they learn a little about the history of film-making (from which it may become apparent that much of today's fast editing techniques were invented in the 1920s: try Eisenstein's October, for example).<br><br>From the universally admired cinematography of Freddie Young, the long shot of Omar Sharif's floating mirage entry, the pre-CGI battles and pan-up scene changes, to O'Toole's florid but career-defining performance and the (then) novel time-shift narrative, this film set standards not matched even by Lean himself, and, as many reviewers have commented, financially and practically unlikely to be attempted today. I too have rarely seen such clarity of image outside of Imax, and in my view the script by Robert Bolt (and I now have learnt, an uncredited Michael Wilson) is the finest in cinema. Maurice Jarre's music and some of the acting style now seem a little excessive, but repeated viewing (around 35 times in my case) does not diminish the impact and quality, and the restoration and now DVD release still, after all these years, approaches the effect of that first 1962 viewing.<br><br>It is rare that repeated watching of a film (as opposed to a live performance) does this, and the reasons go beyond the photography, performances and editing. In my opinion, it is because the characterisation and storytelling encourage an appreciation of the ambiguity and inconsistency behind our motives and behaviour, and, in a wartime scenario, in the contrast between political expedience and personal morality. For a 13-year old, this opened a window into the adult world, and it explains why the story has resonance far beyond its setting. The film doesn't require an understanding of middle-east politics (though it does have some very current relevance), but it does require an ability to look, listen and understand. The fact that so many people rate it so highly says everything about its wider impact. When The Matrix and even Lord of the Rings have slipped out of the ratings (and the adolescents who inhabit these pages have grown up), I believe this film will still be in the 20s or 30s, perhaps enabling young people to once again see the world through adult eyes.<br><br>Like Ali, I fear Lawrence. I fear the power of art to change us, to challenge our preconceptions. Every time I see this film I learn a little more, discover something new. When I was 13 I didn't understand much, but this film helped me to see that I wanted more, knew more, than my peers. I can't rate it more highly than that.","user":"iain_connell","rank":[390,484]}]