[{"title":"A great satire","rating":10,"date":"26 July 2004","review":"Some of the recent comments are wholly unjust to this movie. The point of the film is to make fun of phony sentimentalism, sanctimonious posturing, and the general tendency of the media to put profit ahead of grace, dignity, and the simple truth. Carole Lombard is not only beautiful, but an exceedingly talented actress (in this and everything else she did). The writing cuts to the bone, exposing hypocrisy in all its forms. The film is as fresh today, and is as relevant to the culture, as it was when it was made. As for the notion that a movie made in 1937 offends someone's sense of what is politically correct in 2004, and therefore deserves criticism, give me a break.","user":"beynac","rank":[72,77]},{"title":"Hungering For Our Celebrities","rating":9,"date":"17 May 2007","review":"The team of David O. Selznick producer, William Wellman director, and Fredric March leading man, after having had a big hit the year before with A Star Is Born, teamed up again to create one of the great screwball comedies of the Thirties in Nothing Sacred. <br><br>The inspiration for this film comes from the fertile imagination of Ben Hecht best known previously for co-authoring another newspaper classic, The Front Page. Hecht takes it a step further and while the Morning Post reports the news faster and better than its rivals, it doesn't create the news. Here the media is satirized for creating a celebrity.<br><br>Poor Carole Lombard as Hazel Flagg, country girl from rural Vermont who is misdiagnosed by her country doctor Charles Winninger as having incurable radiation poisoning. It's a small news item over the wire services.<br><br>But when hotshot reporter Fredric March gets a hold of it, he convinces his editor Walter Connolly to build up the story by bringing Lombard to New York and ballyhooing her into celebrity status. Lombard and Winninger by now know an error in diagnosis was made, but who can turn down an all expense paid trip to New York? The story just mushrooms until it gets away from any kind of control.<br><br>The difference sometimes between comedy and drama is often so slight as to be imperceptible. There's not much difference between Fredric March's character in Nothing Sacred and Kirk Douglas's in Ace in the Hole. Both are down on their luck newspaper people looking for a comeback and both exploit a story to their own ends, March comically and Douglas tragically. But the plots are more similar than one realizes.<br><br>Even today we still hunger for our celebrities some of whom are nothing but professional celebrities. The sad life of Anna Nicole Smith is proof of that.<br><br>When you think about Anna Nicole Smith though Nothing Sacred appears dated it actually has a very timeless message about the power of media to create and destroy.","user":"bkoganbing","rank":[29,30]},{"title":"Very Sharp-Edged, Sweeping Satirical Comedy","rating":4,"date":"4 April 2005","review":"The writers, crew, and cast of \"Nothing Sacred\" really do treat everything in accordance with the movie's title. No aspect of human society is immune from the sweeping satire. The comedy is fast-paced and often very sharp-edged, and almost any viewer will find it hitting close to home at one time or another, so it is best not to take it too personally. Yet this is not a mean-spirited feature, in that it treats everyone the same way, and it shows sympathy even for the very characters whose faults it so ruthlessly exposes.<br><br>Frederic March, as a hardened newsman, and Carole Lombard, as an appealing woman who is nevertheless living a lie, make a good combination. They are both likable enough to make you care about them even when they are at their most opportunistic. The supporting cast, likewise, features several good performances, with the likes of Walter Connolly and Sig Rumann getting some fine moments of their own. William Wellman shows a good feel for the material, getting good mileage out of the story without pushing it too far.<br><br>This kind of feature is somewhat unusual even among movies of its genre. Most satires choose their targets, ridicule them, and put the opposing forces in a positive light. But \"Nothing Sacred\" takes no sides between the small town and the big city, between the powerful and the powerless, or between one character and another. It points out the human flaws to be found in almost all of us.<br><br>This is the kind of movie that can only be enjoyed if you don't take it personally or too seriously, because in that case the message will be misunderstood. Rather than targeting any one kind of person, it intends to make some more general points about human nature that, while sometimes rather pointed, are encased in enough humor to make them palatable.","user":"Snow Leopard","rank":[43,46]}]