[{"title":"Exceptional winter alpine filming in Upper Engadine","rating":9,"date":"10 January 2007","review":"The simple storyline is about Diotima, an inspirational dancer played by Leni Riefenstahl, and her love story with Karl, a tough mountain lover who, in the best German romantic tradition, finds the Absolute climbing the highest peaks. The greatness of the movie is in the winter mountain scenery and in the filming of ski competitions. Some of the filming was done in Upper Engadin, in Sils-Maria, a small Swiss village about 6 miles west of St. Moritz. In one scene it is clearly recognizable the Mount Margna and in a few others, the village of Sils-Maria is visible with the Hotel Alpenrose and the Chesa Zuan (both are still standing and look remarkably similar). Some other filming is probably from the nearby Val Fex, and there is also a beautiful view of the Silsersee with Maloja visible in the distance.<br><br>Considering the limited technical support available for winter alpine filming in 1926, it is remarkable that the photography is mostly crisp and engaging, and that it shows the peculiar light quality of Upper Engadin. <br><br>Riefenstahl's acting is fantastic but inevitably dated. She is expressive and intense, with a bit of influence from Weimar Expressionism. She outclasses all other actors, who appear unidimensional.<br><br>A movie strongly recommended, if only for the incredible quality of alpine photography and for the timeless Riefenstahl performance.","user":"atorri","rank":[17,18]},{"title":"Early mountain film noted more for photography than its lead actress","rating":7,"date":"16 March 2008","review":"Most famous now, certainly, for containing the first starring role from actress and dancer, later director Leni Riefenstahl, this was director Fanck's second \"mountain film\" and in late 20s Germany probably didn't really stand out amongst the many other examples, including Alfred Hitchcock's now-lost The Mountain Eagle released the same year. And Riefenstahl's performance isn't really enough of a reason to see the film unless one has a significant interest in her; she's not really that good, rather amateurish here, and her dancing though decent enough seems entirely of the pagan/ritualistic type and gets rather tedious after a while.<br><br>It's an old story, too -- the love triangle, in this case a mistaken one as Diotima (Riefenstahl) falls instantly in love with mountaineer/ski instructor Karl (Luis Trenker, magnetic and giving far and away the best performance here) only to have his younger friend Vigo (Ernst Peterson) fall for her. Tragedy is the end result, but not before we get to see an awful lot of great mountain climbing, cross-country skiing, and ski jumping footage. It's the photography and action sequences that make the film worth a view, not the stilted storyline. Curiously the film seems to have a rather pagan, earthy attitude towards God and nature, only to have that disrupted in the final frame by a very Christian-seeming \"FAITH\".<br><br>The Kino DVD is quite beautiful and alternates between bluish and sepia tinting, but I have to take issue with the music, apparently scored and performed specifically for the film by a small ensemble; it's nice enough on its own but doesn't fit the Teutonic grandeur or wildness to my ears...more of a Buster Keaton or silent western score, it seemed to me. My advice is to turn down the music and crank your own Wagner, Bruckner or perhaps best of all, Mahler.","user":"OldAle1","rank":[6,6]},{"title":"The Dancer, the Skier and His Young Friend – A Melodramatic and Tragic Triangle of Love","rating":7,"date":"27 November 2010","review":"The dancer Diotima (Leni Riefenstahl) meets the engineer and skier Karl (Luis Trenker) in his cottage in the mountains and they fall in love for each other and have a love affair. When Karl's young friend Vigo (Ernst Petersen) meets the dancer after a presentation and she gives her scarf with a smile to him, the infatuated Vigo mistakenly believes she is in love with him. Karl sees Diotima innocently caressing Vigo and he believes that Diotima is betraying him with his friend. Karl decides to commit suicide and invites Vigo to climb the dreadful Santo Mountain North face during the winter thaw with him. His best friend joins Karl in a tragic journey.<br><br>\"Der Heilige Berg\" is a melodramatic and tragic story of a triangle of love among a dancer that loves the sea; a skilled skier and engineer that loves the rock; and his young friend that loves the dancer. The plot is absolutely naive in 2010, but after all this is a 1926 film when the society had other moral concepts. The infamous Leni Riefenstahl, who directed the Third Reich's propaganda for Hitler one decade later, performs the dancer and pivot of the tragedy. Her dance is weird and clumsy but this is a silent movie and the viewer never knows what she was listening while dancing. If the romance is not interesting in the present days, the cinematography and the camera work are stunning considering the size, weight and technical resources of the equipment in this period. All shots outdoor were actually made in the mountains, including the ski race and the scene on the cliff, in the most beautiful parts of the Alps over the course of one and half years. My vote is seven.<br><br>Title (Brazil): \"A Montanha Sagrada\" (\"The Holy Mountain\")","user":"claudio_carvalho","rank":[12,14]}]