[{"title":"A red-blooded action adventure under King's direction...","rating":9,"date":"15 July 2000","review":"In this stunning Technicolor swashbuckler, the Crown pardons the greatest of the buccaneers Henry Morgan (Laird Cregar), and appoints him governor of Jamaica in the place of corrupt Lord Denby (George Zucco).<br><br>Morgan asks that all pirate activities in the area be ended...<br><br>When Captain Billy Leech (George Sanders)and his crew refuse the amnesty offered by Morgan, Henry Morgan calls upon Jamie and his pal, Tommy Blue (Thomas Mitchel), to bring the renegade Leech... <br><br>Jamie, meanwhile, set his eyes on Denby's fiery daughter, Margaret (Maureen O'Hara), but all of his advances are rejected... He has been unable to win her away from her fiancé, a foppish gentleman, who, Jamie discover, is conspiring with Leech and supplying the captain with information about English treasure ship sailings... <br><br>Angered by the continuing loss of ships, the government accuses Morgan of being in collusion with Leech, and the Assembly demands his impeachment... <br><br>To get his friend off the hook, Jamie decides to take action and track down the 'Black Swan' at sea...<br><br>Unlike Olivia De Havilland, Maureen O'Hara demonstrates that she was not that kind of heroine who would be satisfied to remain ladylike on the sidelines... If her romantic scenes still lacked passionate conviction, her hot-tempered, liberated nature and her beauty were more than sufficient compensation for most of the viewers...<br><br>\"The Black Swan\" garnered several Oscar nominations, in addition to Leon Shamroy's award for cinematography...<br><br>The film remains as a classic adventure spectacle with magnificent settings: 17-century costumes; pirates ships in battle on the high seas; pirates armory including cutlass, swords, pistols, daggers; dazzling swordplay; lusty romance; conspiracy in silence; treasure hunt; spectacular special effects, and exciting action scenes all the way...","user":"Nazi_Fighter_David","rank":[37,43]},{"title":"The most Stylistic in the swashbuckler genre","rating":8,"date":"10 July 2000","review":"Tyrone Power was undoubtedly the most stylish and certainly the most handsome and articulate of the great Hollywood swashbuckers from the 30s to the late 50s. In this movie he coyld not have been bettered (Flynn and Douglas Fairbanks Jr. included), The starry cast,music,costumes and settings brought vividly to life the Spanish Main,Maracaibo and other Pirate ports of call.With a great family theatrical tradition behind him,Power's presence enriched every movie he made (what a twist of fate that he died exactly as his father Tyrone Power Sr.did,filming a duel scene -\"Hamlet\" and \"Solomon and Sheba). I believe that Power's acting ability even today is not fully recognised,simply because the Studio System   restricted   his choice of film.Let anyone hear Power recite the poems of Byron (available on disc) and realise his premature death was a tragedy.\"THE BLACK SWAN\" could be said to represent a golden period in the history of Hollywood swashbucklers.","user":"david-564","rank":[31,37]},{"title":"Avid lover of Pirate films","rating":24,"date":"24 August 2004","review":"This movie is so wonderful. I remember seeing it for the first time when I was around six years of age, and Tyrone Power became my first crush. After seeing the Black Swan I became ridiculously obsessed with pirates. (My mother wondered if there was something wrong with me, considering all the other girls on my block were playing with Barbies and I was watching movies about pirates.) I think the cinematography is just perfectly lovely in this film, and Tyrone Power truly is a great actor. People speak truthfully when they say he did not get the credit he deserved, (much like Johnny Depp) but I deeply respect the late actor, and he captured my heart. If you love films of mutineers, swashbuckling adventure, and roguish characters, then this film is for you. It will sweep you away to an old world where gallantry was sought after and pirates were the scum of the earth.....","user":"liljc55","rank":[30,37]}]