[{"title":"A disturbing psychological horror film with a twist ending","rating":13,"date":"13 September 2001","review":"I first saw this film as a child but its images haunted me for many years. This terrifying film has rarely been broadcast since, but was recently shown on American Movie Classics and I found it as frightening as I remembered. It is notable for the performance of the legendary acting teacher, Uta Hagen, whose film and TV appearances are limited but whose teachings are highly regarded in the acting world. Her role as Ada, the Russian grandmother of mysterious twin boys with a terrible secret, is perhaps not one of the great roles in film history, but her performance lends the film a tragic depth which makes the events seem all the more horrible. TV's John Ritter also has a small but important role as another member of the family beset by crises and dire events. And the late Portia Nelson, one of the nuns from THE SOUND OF MUSIC, also makes an appearance. Like many horror films of the 70's, this film sets a child's innocence against a malevolent force but, unlike The Exorcist or The Omen, doesn't involve supernatural elements. The horror is almost entirely psychological and involves the twins' relationship and a grief-stricken family. It would be foolish to give away too many details because the plot twists and shocking ending are so effective, but this film, without explicit violence or gore manages, to make an impact and is a must-see for horror fans.","user":"tommyrockt","rank":[69,86]},{"title":"Powerful stuff.","rating":8,"date":"11 August 2013","review":"\"The Other\" is an adaptation of the Thomas Tryon novel, scripted (and executive produced) by Tryon himself, which tells us a story of evil set against the backdrop of a peaceful farming community in Depression era Connecticut. Director Robert Mulligan (\"To Kill a Mockingbird\") milks the location for a lot of atmosphere - and the finale is particularly sinister - but the horrors of this film are largely psychological, which will appeal to those genre fans looking for something subtle.<br><br>It stars legendary acting teacher Uta Hagen, in one of her rare film roles, as Ada, the doting grandmother to twin boys Niles and Holland (played by actual identical twins Chris and Martin Udvarnoky). Niles is the more grounded one and Holland the more mischievous one. They also live with other relatives including an incapacitated mother, Alexandra (Diana Muldaur). Niles has been taught a special \"game\" by Ada, which allows him to see through the eyes of others.<br><br>But don't let that lead you to believe there's much if any of the supernatural in this story. It's done in a more realistic manner, and the effectiveness of the film hinges on ambiance, mood, and performances. Hagen is quite wonderful, and the Udvarnokys - who unfortunately never made another film - offer completely natural, unaffected portrayals. The excellent cast also features Victor French, Lou Frizzell, Portia Nelson, John Ritter (in one of his earliest big screen appearances), Jack Collins, and Ed Bakey. Production design (by Albert Brenner), cinematography (by Robert Surtees), and music (by Jerry Goldsmith) are all beautiful. This is one of those films that does take you back to a different time and place. The end is haunting and not likely to be forgotten by the viewer anytime soon.<br><br>The story's critical revelation actually occurs sooner than you might expect, but things only build from there; Tryon still has more twists and turns up his sleeve.<br><br>Highly recommended to horror fans, especially those who favour the traditional variety of horror.<br><br>Eight out of 10.","user":"Hey_Sweden","rank":[8,8]},{"title":"Underrated Chiller From A Great Director","rating":9,"date":"20 September 2008","review":"I remember very clearly that parts of the Thomas Tryon novel just about had me wetting myself, it was that scary, and I wondered if the movie version would do it justice. In many ways, it nearly surpasses the book...which is something that rarely ever happens. Some people don't care for the performances by Chris and Martin Udvarnoky as the twins, Niles and Holland, but the fact that they weren't typical \"Hollywoodized\" child stars enabled them to give more naturalistic performances, thereby making them more believable...and creepy.<br><br>And what can you say about one of theater's Grande Dames, Uta Hagen? I think this was the only film I've ever seen her in, and she's spectacular. Well before \"bad kids\" became a genre cliché, this one beats all the other like-minded thrillers by a mile, even THE OMEN. (Well, maybe not THE BAD SEED, though.)<br><br>And as the cherry-on-top, Jerry Goldsmith turned in one of his best scores on this one. And DP Robert Surtees' work is so beautiful in contrast to the sheer horror it has us bear witness to...<br><br>Director Mulligan deserved all the praise he got for THE OTHER, and more acclaim than he did get because of the fact that it was considered a \"low-class horror movie.\" When you watch it, though, you may not think so by the chilling ending. See if this doesn't stay with you for weeks afterward, the way it did for me...","user":"cchase","rank":[26,31]}]