[{"title":"See oldies as babies - Don Johnson and Nick Nolte","rating":9,"date":"15 August 2005","review":"Great nostalgic road trip for those who remember the 1950's - Johnson is the mechanic and Nolte is the driver on their way to compete in Grand Nationals Drags in California - movie hits on all cylinders with buddy film + cool car film + new guy in town film + evil townie hoods + misguided cop + lesson learned factors all working to achieve the Fabulous Fifties mood. Two or three good female acting roles will keep the ladies interested too - as if seeing Johnson and Nolte in all their pre-hunk hottiness won't attract them anyway. The Don Johnson drag racing scene rivals the James Dean scene in Rebel without a Cause. Soundtrack is superb. This film will appeal to anyone interested in hot rods from the 1950's--1960's up to the 1970's.","user":"seagem","rank":[13,17]},{"title":"Never a dull moment!","rating":8,"date":"31 January 2002","review":"This was one I watched fifty times on late-70's cable. This movie never lets up for a second as it's filled with great action, pretty girls, great 50's music and bad dialogue. Not to mention a young Nick Nolte and Don Johnson! How can you go wrong? The car is incredible too, I used to think the \"extra juice\" they'd give it during drag races was the wildest thing. The crazy cop is hilarious. I used to look for \"sail rabbits\" after seeing this one haha. Not to be missed, especially by car fans of fans of films set in the 50's.","user":"stevenfallonnyc","rank":[11,15]},{"title":"Lost bit of Americana here....","rating":20,"date":"20 September 2003","review":"This movie recalls the golden days of the hotrod culture, now virtually lost in time, as far as newer generations of Americans are concerned.  Watch it and see a little bit of history.  This is a \"hotrod movie.\" Or at least it recalls the golden age of hotrod movies. This one comes at least 15 years too late.  There were many of them made, and very few are around anymore, except inside some film archives somewhere....","user":"anonreviewer","rank":[9,12]}]