[{"title":"Frogs on the warpath.","rating":6,"date":"20 November 2002","review":"If this movie ultimately fails to be scary (and it does), it's not because the filmmakers didn't try; they did their darnedest to make those frogs look as menacing as possible. But it was all for naught, because frogs are fundamentally un-vicious creatures and, well, they cannot be trained to look mean. They don't care about us annoying humans! They just want to hop around! So this movie can't hold a candle to, say, \"The Birds\". That doesn't mean it's not enjoyable though - it is, in a schlocky way. It's colorful, it's beautifully photographed, and Sam Elliott is rather cool, as 70s leading men go.     (**1/2)","user":"gridoon","rank":[31,40]},{"title":"It Won't Make You Croak","rating":8,"date":"8 July 2004","review":"Statistically, this movie was a hit. Made for $200k, it grossed over $2 mill in the US alone. This was the secret of success for American International Pictures.  Keep the budgets low, and the base of horror fans will show up and you'll make a profit. 1972 was the year for horror.  A large number of films catered to the horror fan, many were cheaply made. But they all made a profit. Frogs is an example of a movie poster created before the movie was filmed. Frogs don't kill anyone in the film, but they made a cool poster. So they were thrown into the mix of alligators, lizards, snapping turtles, snakes, spiders, etc. Since many of these creatures make people queazy, it must have seemed like a slam dunk to film- fearmakers. However, the animal performers are less than convincing. Especially the alligator, where producers sped up the film to make him look like he's moving quickly. The acting is as good as can be expected for this type of film. Joan Van Ark and Sam Elliot debut here (Van Ark had done a soap). Milland is good as the cranky old rich stereotype. If you're looking for a \"tame\" horror picture to keep the kids interested, this might be it.  For adults, it's value is mainly nostalgic.","user":"g_man07302","rank":[11,13]},{"title":"A real skin-crawler!!","rating":8,"date":"1 October 2005","review":"Despite a seemingly hokey premise, Frogs is one of the more memorable and effective entries in the nature-revenge genre.<br><br>Family living in Florida's Okefenokee Swamp have been exterminating the local wild life, now it seems that the creatures are all out to kill them!<br><br>Frogs is a movie that never fails to be sweat-inducing, especially to those who don't like reptiles! All manner of swamp wild life is used for this film - snakes, spiders, gators, lizards, heck even a turtle! So with all these critters coming for our unsuspecting human characters there's plenty of tension to be had! Director McCowan makes good use of the boggy setting and gives it an atmospheric feeling of certain doom! The eerie score also helps as well.<br><br>The films cast is good. Veteran Ray Milland is perfect as the Crockett family's stubborn elder. Young, attractive Sam Elliot is decent as a nature photographer who happens on the scene. Joan Van Ark is good as Elliot's love interest and Adam Roarke as her no-account brother. The supporting cast is also on cue.<br><br>While Frogs may be a B thriller that's best taken tongue-in-cheek, it's solidly done and is sure to cause a few chills!<br><br>*** out of ****","user":"Nightman85","rank":[21,32]}]