[{"title":"The rhythm of the city...","rating":19,"date":"19 April 2012","review":"This movie has an unmistakable 1980s vibe that gives it a certain charm. Viewers familiar with \"Oliver Twist\" will find it interesting how Dickens's story is adapted around dogs and their owners in modern-day New York City.<br><br>Billy Joel impresses as the voice of Dodger, a mutt with New York attitude. He's joined in the cast by Cheech Marin, Bette Midler, and Dom DeLuise (as a derelict Fagin).<br><br>The best character, in my mind, is the city itself. This is definitely a New York City movie, tapping into the city's personality and capturing many of the landmarks in the animation.<br><br>The movie has a visual aesthetic that is not quite like the style of other Disney films, which is kind of cool. There's some great character animation, such as with the imposing villain Sykes (Robert Loggia). CGI framework is used effectively throughout the film to animate cars and things.<br><br>OLIVER &amp; COMPANY is definitely a product of its time: the late 1980s. The movie is dated by the clothing worn by the humans, the models of the cars, the music (smooth and synthesizery, with the main title song sung by Huey Lewis), the gritty urban look, and even the character designs (see the hot dog vendor or the hairspray-loving canine Rita).<br><br>In a superficial way, OLIVER &amp; COMPANY reminds me of THE RESCUERS. Both have a unique aesthetic \"feel\" that strays from the classic Disney style and seems to capture the sensibilities of the times. OLIVER is as quintessentially 1988 as THE RESCUERS is 1977. (Both films also portray contemporary New York City, involve animals helping a cute little girl, and explore some dark and emotional territory.) OLIVER &amp; COMPANY is dated, but gloriously so.<br><br>The next animated film released by Disney would be THE LITTLE MERMAID (1989), which launched the company's 1990s renaissance of timeless masterpieces, shaped by Alan Menken's Broadway-influenced musical direction. It's interesting to see the quaint, contemporary style of OLIVER, knowing that Disney would soon go off in a different direction.<br><br>With no nostalgic ties to this film, I can say that it's a decent flick, although it wouldn't crack even my top 20 Disney movies. Love the NYC stuff. Joel's \"Why Should I Worry?\" is a musical highlight. The story has a surprising emotional impact and the climax is both dark and exciting.","user":"jimjo1216","rank":[15,15]},{"title":"I absolutely love this movie!","rating":10,"date":"14 May 2002","review":"Oliver and Company is probably the least appreciated Disney movie ever, and yet it is excellent. I have loved it since I was very very young. I had a giant poster from its original release, and I would sing along to \"Why Should I Worry?\" and \"Streets of Gold\" while jumping around on top of couches, pretending I was Dodger and Rita. That's how \"into\" the movie I was. And I wasn't alone. My friends memorized the soundtrack, too, and we would persistently sing the songs in school. I guess there is just something very appealing about dogs getting around the city by jumping around on top of cars! And when we ran the sprinklers, I would wash my feet in them like Dodger-singing, of course. Oliver and Company is really, really good. It has superb voice talent and animation. Yeah, Tito's ear tear does switch from left to right at one point, but I would NEVER have noticed that...anyway, the story is not weak at all. It is unusual, granted, but then it's a weird twist on Oliver Twist. Most people love this movie. A few have bashed it for petty little reasons. Overall, there's nothing not to like. The music is outstanding. The character design is great. My favorites are Rita and Georgette. They're both very different but they're both very pretty. And they can sing, too. If you look at the backgrounds, at one point you can see dogs from other movies. During \"Why Should I Worry?\" there are Peg (she found a home!), Jock, and Trusty from Lady and the Tramp, and dalmatian who resembles Pongo. There are a lot of cute dogs in this movie who only appear for a second..like the two in the convertible during the WSIW reprise that Dodger and Tito gawk at until Rita pulls Dodge away. Sykes is one of the baddest bad guy ever-- He's got a scary car and scary dogs. This movie is funny, the chase scene exciting. Recommended.","user":"thereseuphemiaabernathy","rank":[51,57]},{"title":"A truly touching and hilarious adaptation of Oliver Twist","rating":9,"date":"13 July 2003","review":"We've seen a musical version of Oliver, even an animated series, but an animated musical with a cast of dogs and kitten called Oliver set in New York, you'd think it would be a disaster.  But, thanks to Disney magic, this film is a classic filled with songs that are never forgotten as well as that wonderful combination of comedy and family drama.<br><br>When a homeless kitten comes across a street-wise dog with a gift for song and stealing hot dogs, little Oliver finds himself the member of an exclusive gang of thieving dogs.  But before he even executes his first crime, he is discovered by a lonely little girl in need of a friend.  Chaos soon ensues as Jenny and Oliver get caught up in a kidnapping by the classic evil villain.<br><br>It's a fun filled romp to be enjoyed by one and all over and over again.","user":"cimorene_fantasy","rank":[32,36]}]