[{"title":"A Perfect Movie Made With Love by Entertainment Pros","rating":10,"date":"26 March 2005","review":"\"They don't make movies like this anymore\" is the usual phrase heard about classic movies. More appropriately \"They CAN'T make a movie like this anymore\" applies to \"The Quiet Man\".<br><br>John Ford directed John Wayne and Maureen O'Hara in a number of classic unforgettable Westerns with a familiar supporting cast including Ward Bond, Victor McLaughlin, Mildred Natwick and other pros. \"The Quiet Man\" moves these familiar icons from the post Civil War American West to the post World War II rural Ireland.<br><br>You don't have to be Irish to appreciate the visual beauty of the Irish countryside and villages or the beauty of Maureen O'Hara, but your appreciation of the story is enhanced if you know something about the unique Irish culture.<br><br>Ireland and America have been tightly bonded from the earliest Colonial Days of America and are permanently intertwined since the Potato Famine of the 1840's sent tens of millions of immigrants to populate the vast U.S.<br><br>John Ford perfectly casts John Wayne as the Irish born, U.S. raised troubled ex-boxer returning to his birthplace and Maureen O'Hara as the Irish beauty . The rest of the lovingly assembled cast contains mostly familiar faces in supporting roles.<br><br>The script covers vast ground in a mostly light-hearted manner. The story plays like most John Ford/John Wayne/Maureen O'Hara movies as one step larger than life.<br><br>It's clear that everyone appearing in this movie LOVES being in the movie. Maureen O'Hara never looked more beautiful and thrives as the woman in the middle between two warring men, her brother (Victor McLauglin) and her suitor (John Wayne).<br><br>The over-the-top village to village brawl between John Wayne and Victor McLaughlin is hilarious and ultimately warm hearted. It sums up the strange Irish notion that you have to physically pummel a man before you can have his friendship and respect.<br><br>There are big scenes and little scenes, but every scene is a delight.<br><br>This is a movie that can't and won't ever be made again. It's a movie that everyone should enjoy.","user":"Dutch1968","rank":[88,99]},{"title":"A Stick To Beat the Lovely Lady","rating":10,"date":"3 October 2005","review":"The filming of The Quiet Man was the culmination of a dream by John Ford to make an Irish picture in Ireland. He bought the rights to the story over a decade before and peddled it to every studio in Hollywood and was turned down.<br><br>He went to Republic Pictures partly because John Wayne was just winding down his contract with them and he wouldn't have to pay him extra, and partly because Herbert J. Yates's small studio was the last stop. Ford got the permission for The Quiet Man on the condition he do a sure fire moneymaking John Wayne cavalry picture first. So Ford, Wayne, and Maureen O'Hara did Rio Grande first before setting out for Ireland.<br><br>In her recent memoirs O'Hara said that this was her role of a lifetime, she knew it would be before one frame of film was shot. She'd been playing in a load of ridiculous Hollywood drivel films as a redheaded Bedouin princess and she did them essentially for the money. This one was to be a labor of love.<br><br>Love yes, but a labor nonetheless. John Ford was a talented, but strange man to work for. He could be a bully and a tyrant on any set he was on. She was grateful to him for the career making roles she got with him, but recognized his faults. She relates in her memoirs that Ford used his influence to knock her out of an Oscar Nomination for Mary Kate Danaher in 1952 over some trivial offense Ford thought O'Hara committed and took umbrage.<br><br>It was a family affair for Wayne of sorts as well. His kids came to Ireland with him and you can see them at the horse racing scene as extras. Young Patrick Wayne spoke his first movie lines. He also had with him his second wife, Esperanza Baur who was not his kid's mom. She was a tempestuous sort and they would soon part in a very ugly divorce.<br><br>Sean Thornton who was born in Innisfree, but went to America as a toddler, has come back to his native Ireland after making a name for himself as a prizefighter and killing a man in the ring. He and Maureen O'Hara have an instant attraction for each other. However Wayne does run afoul of her bully of a brother, Squire Will Danaher played by Ford regular Victor McLaglen.<br><br>Wayne and O'Hara marry, but McLaglen won't turn over the bride's dowry. And Wayne won't contest him for it.<br><br>So with a little help from The Taming of the Shrew and a bit of Falstaff thrown in, things are put right in Innisfree. More I won't say. <br><br>As in all of John Ford's films and this is one of the best, he got some grand performances from some of the most minute characters in the film. Some of his regulars like Ward Bond, Mildred Natwick, Ken Curtis, Barry Fitzgerald and Arthur Shields with the rest of the roles played by Dublin's acclaimed Abbey Theatre players. One of my favorites is Jack McGowran who played Feeney, Squire Danaher's little toady factotum. <br><br>The music was arranged by Victor Young who did a grand job of using traditional Irish melodies in the score. One song, The Isle of Innisfree was recorded by Bing Crosby for Decca and sold a few platters for him the year The Quiet Man came out. <br><br>The Quiet Man is an annual classic for St. Patrick's Day, the same way It's A Wonderful Life is for Christmas. At least in America it is. I've wondered if it is as well received in Ireland as it is here. I think John Ford, the former Sean O'Fearna, was hoping it would turn out that way.<br><br>Mr. Ford, you got your wish.","user":"bkoganbing","rank":[134,160]},{"title":"An Exile dreams of Inishfree","rating":10,"date":"24 November 2000","review":"It's not only the fact that I'm actually from County Mayo in Ireland where most of the outdoor scenes from The Quiet Man were filmed in the summer of 1951, that makes it my favorite movie of all time. This film has damn near everything for everyone in it without being offensive to anyone (Though the occasional hypersensitive Irish person or Feminist or \"Yank\" might take unfounded offense at the various pokes of fun that are made at various traditions!)<br><br>For the romantics this has romance in abundance and probabaly some of the most famously erotic (and much copied - A further indication of how hight in esteem this movie is held) scenes ever put on celluoid (without ever more that an absolute minimum of bare flesh being exposed to satify the puritans). Steven Spielburg most famously gives the cottage kissing scene the nod in \"ET\" and it was said of the \"Wet shirt\" Graveyard kissing scene in the rain that, during the many takes it took to get it in the can, Director John Ford only got John Wayne to do everything he wanted to do to Maureen O'Hara himself.<br><br>For the action brigade it has probabaly the longest and one of the most enthralling fight scenes of any movie.<br><br>For the comics the entire film is laced with Irishisms and good humor and wild banter and loads of \"craic\"<br><br>For the weepies it has tragedy and death and a haunting from the past.<br><br>\nAnd for the pure sentimental including myself the film has my beautiful country lavishly and lovingly displayed in glorious technicholor compliments of Winston C Hoch amnd Archie Stout which deservedly won it an Oscar for cinematography.<br><br>And it has all this and more...<br><br>If one cares to delve deeper it touches on themes of Shakespeare (Taming of the Shrew) and the best traditions of Irish literature (JM Synge and WB Yeats).<br><br>Testament to it's greatness are the many books and documentries that have been created about it in it's wake (Try Des McHales \"The Complete Guide to the Quiet Man\" or Gerry McEntees' \"In the footsteps of the Quiet Man\" for starters!) along with the many tourist that still visit Cong, County Mayo in search of their own dream Inishfree.<br><br>I've lost count how many times I've seen this movie both in Ireland and in Exile both here in the US and in England, but suffice to say that at this stage I can now quote liberally from such classic lines as Feeney's: \"Silence if you please, Parlimentary procedure, Squire Danagher has the floor\" or Micheleen Og Flynn's \"Homeric, impetious\" upon viewing the marriage bed of Sean and Mary Kate and coming to his own conclusions on the events that may have occured in it.<br><br>After owning a variety of VHS (both Pal and US versions) of the movie I've finally purchaced the DVD also which allows one (If one so wishes) to watch every frame of the movie digitally remastered - If you are a fanatic like me or Quiet Maniacs as we are sometimes known this allows you to catch a glimpse of such things as a fly landing on Maureen O'Hara cheek during one shot or (In a daring unintentionally risque scene for the 1950's) her momentarially exposing her underwear whilst jumping over a trunk.<br><br>If you haven't seen this movie (and I'm increasing surprised how many of the younger Blockbuster New Release weaned movie viewers haven't) get yerself down to yer local video store now and look in the Classic Shelves for one of those classics that is sure to be there alongside Ben Hur, Gone with the Wind and Casablanca and rent it out for a great nights entertainment. Better still go and buy a copy 'cos once you've viewed it once like me you'll most likely be hooked and will want to watch it again and again (Even sometimes late at night, round Christmastime, sipping a hot Irish whiskey!)","user":"PeterJordan","rank":[68,79]}]