[{"title":"A young Michael Caine at his best.","rating":26,"date":"26 November 1998","review":"\"Play Dirty\" is one of those rare films that reassures you that some filmmakers are willing to try something different with a tired genre. The World War Two epic has been done a thousand times, but this one is different. Michael Caine is his brilliant self, supported ably by Nigel Davenport and Nigel Green in this film which has drawn comparisons to the \"Dirty Dozen\" but, I believe, strikes ground of its own. Andre de Toth directs with a style that was well before its time, giving this film something others lack - longevity. A top flick worth seeing. *Three and a half stars*","user":"Davros-4","rank":[27,29]},{"title":"Spare, brutal, grinding war movie in the blowing sands....","rating":7,"date":"31 October 2010","review":"Play Dirty (1969)<br><br>You almost have to see this anarchic, nasty, selfish, brutal WWII movie as a comment on Vietnam, and on war. It's 1969. At first you think Michael Caine, for all his talent, is miscast, but the odd displacement of his character among a lot of very hardened, serious men is part of what works.<br><br>This is not like any WWII you've seen. It's an odd mixture of hardship, tedium, humor, and straight up masculine grit. It's set in the Sahara, so dunes and sand and dry nasty weather rules. There is a mission at hand, and these men have to be unorthodox and ruthless to succeed. But there are long stretches of just traveling and conquering the desert, of going day after day through storms and lack of storms. There is also fighting amongst the men, a somewhat horrifying (and unnecessary) attempted rape, some bloody carnage of natives, and of Germans, a long twenty minutes of Fitzcarraldo heroics with some cables, and so on.<br><br>But in the end, it really does capture something essential of war, including the nonsense of some of it, and the lack of rules, and the lack of personal safety that comes from chaos, and the difficulty of companionship and trust.","user":"secondtake","rank":[12,12]},{"title":"Superior war movie, fast paced and cynical","rating":9,"date":"18 October 1998","review":"Somewhat similar to \"The Dirty Dozen,\" in that its plot features a group of convicts recruited for a deadly mission during WW 2, this fast paced war epic is much more stylish and unpredictable than that crudely made, if undeniably entertaining, Robert Aldrich blockbuster.  With great performances from Michael Caine and Nigel Davenport, as well as able support from a cast of fabulous British actors, the film features one terrific action sequence after another, with plenty of surprises in store.  To say anything more would surely ruin many of those surprises for the unsuspecting viewer, but it should be noted that the story comes to a screeching halt with what is possibly the greatest and most hilarious \"Ooops!\" in film history.","user":"TORSO!","rank":[36,41]}]