[{"title":"A very powerful personal experience","rating":21,"date":"21 October 2002","review":"Ingmar Bergman's mystifying masterpiece, Persona, opens with an image  of light from the lamp of a film projector and then the film running  through the spools. This is followed by a series of images that  includes a spider, a montage from silent comedies, a spike being driven  through a man's hand, and faces in a morgue. The film then cuts to an  enigmatic picture of a young boy watching women's faces appear on a  giant screen directly in front of him. Are these strange images  reminding us that we are only observing a film, not reality?   As Persona begins, Sister Alma (Bibi Andersson), a nurse, is assigned  to care for an actress, Elizabeth Vogler (Liv Ullman) who suddenly  ceases to speak in the middle of a performance of Electra. Alma learns  that there is nothing physically or psychologically wrong with  Elizabeth. She just refuses to communicate verbally. Alma and Elizabeth  retreat to the head physician's summer cottage on a small island to  complete her recuperation. Although Alma is the only one who talks, the  relationship grows and Alma is happy that she has found someone who  will listen to her sympathetically. She begins to share with Elizabeth  some of her most vulnerable moments. A high point in the film is Alma's  detailed description of a sexual encounter she had with two teenage  boys while sunbathing on a beach in the nude. Elizabeth appears to be  an attentive listener who, by facial expression, encourages Alma to  reveal more and more personal details.   Alma, however, is deeply hurt when she opens Elizabeth's unsealed  letter to her doctor. In the letter, Elizabeth reveals how she is using  Alma as a \"study\" and finds her infatuation \"charming\". Feeling  betrayed Alma lashes out in anger, first berating her patient, then  begging for forgiveness. As soon as physical and emotional violence is  depicted, Bergman stops the narrative and repeats images from the  opening sequence, adding a close-up of an eye as if to remind us again  that we are merely prying observers. The relationship of the two women  now becomes a struggle of wills. Alma grows more desperate as Elizabeth  gets stronger and more dominant. Sensing this new power, Elizabeth  seems to transfer her personality to the weaker Alma. Every nuance of  emotion is unforgettably conveyed in the facial expressions of these  two remarkable actresses.   Persona is filled with surreal images and dream sequences in which it  is very difficult to distinguish between illusion and reality. In one  scene, Alma sees Elizabeth entering her room at night, then exiting.  When Alma asks her the next morning if she was in her room, Elizabeth  shakes her head no. We do not know if she is simply not telling the  truth, or the event did not occur. Bergman does not offer help. The  same is true for scenes when Mr. Vogler appears or when Elizabeth looks  at a picture of her son that she tore up at the beginning of the film.  Being left on our own to make sense of these discontinuous elements, we  are forced to discard thinking in traditional linear ways.   I can't say that I fully understood Persona. It may be suggesting that  the persona we assume is merely a mask to cover our fears and  insecurities? It seems that Elizabeth is playing a role as actress,  wife, and mother. She wants to abandon this inauthentic role by  refusing to speak. Alma, on the other hand, acts like a dutiful wife  and supportive nurse, but secretly yearns to be what she perceives  Elizabeth to be: strong, independent, and self-reliant. In a memorable  scene, the faces of the two women are morphed into one composite in a  classic overlapping shot, an image that says to me that underneath the  roles we play, we are all the same.  After successive viewings, however, I realized that Persona's greatness  does not lie in understanding, but in its unbearably intimate and  poetically realized images, magnificently conveyed by cinematographer  Sven Nykvist. The raw power of this film totally drew me in and allowed  me to get in touch with my own feelings of hurt and desperation in  trying to reach people in my own life who cannot or will not respond.  Persona is not just a classic I objectively admired, but a very  powerful personal experience.","user":"howard.schumann","rank":[260,309]},{"title":"'The human face is the great subject of the cinema. Everything is there'","rating":10,"date":"18 June 2004","review":"When talking of Bergman, critics and viewers usually name Wild Strawberries, The Seventh Seal, Cries and Whispers ahead of Persona. While those films are all amazing and stay very high on my list of all time favorites, for me, the truly unique and inspirational s 'Persona' - Bergman's enigmatic masterpiece.<br><br>The story is seemingly simple: <br><br>\"A nurse, Alma (Bibi Andersson), has been assigned to care for a famous actress, Elizabeth (Liv Ullman), who suddenly stopped speaking during a performance of Electra and has remained silent ever since. When they go to stay in a seaside house owned by Alma's psychiatrist colleague, the apparently self-confident nurse gradually reveals more and more of herself in the face of Elizabeth's silence, and is shocked to read a letter the actress has written implying that Alma is an interesting case-study. The two women seem almost to exchange identities, or to become one (strikingly expressed visually in a famous shot); in a dream sequence (or perhaps fantasy), Elizabeth's husband comes to visit and seems to think that Alma is his wife. Finally Alma, back in her nurse's uniform, catches a bus to go home, leaving the almost-mute Elizabeth alone.\"<br><br>Whether Alma was able to get her identity back remains one of the film's many questions. <br><br>What is absolutely wonderful in the film  performances from two actresses. Anderson is the one who has to carry almost the entire dialog, her voice is one of the film's priceless treasures while Ullman is equally powerful in expressing hundreds of emotions through her face and eyes. Sven Nykvist's camera, the third star of the film makes two stars shine so bright.<br><br>Each scene in 81 minutes long film is memorable, some of them just unforgettable. For instance, the long scene where Alma reveals her most intimate memories of a sexual encounter with two boys while sunbathing nude with another girl on an empty beach, is infinitely more erotic to listen to than it would have been to see in flashback. <br><br>There is so much to think about in Persona. One major question concerns Elizabeth's silence: is it elective, as happens in Tarkovsky's \"Andrei Rublyov\" , or is it some kind of mental breakdown?. The documentaries about the war horrors that Elizabeth watches on TV suggest the former; the fact that it suddenly happens during a stage performance of \"Electra\" suggests the latter. I keep thinking about it. Why \"Electra\" of all plays? The story of the daughter who hated her mother and wanted her dead  does it reflect the accusation brought up by Alma that Elizabeth did not love her deformed son and wanted him dead? Did Elizabeth become so overwhelmed by guilt realizing that her life reminded so much of Electra's story? We don't know for sure, and Bergman does not help. The identical monologue in which Alma is accusing Elizabeth is the film's resolution. We hear it twice: first time, camera is concentrating on Elizabeth's face, second time  on Alma's. Is Alma talking about Elizabeth or herself or both? After that encounter on the beach, Alma became pregnant and had an abortion. The monologue may reflect her feelings of guilt and emptiness as well as Elizabeth's. Does it really happen? <br><br>Is Elizabeth a vampire sucking the life out of her victims only to use them as characters for her acting roles? Is that the ultimate price the artist is paying for being a great artist? Does he need lives and souls of others to be able to create? Can he/she love the ones who utterly depend on them and need their love? This film and later Autumn Sonata (1978) with Ingrid Bergman as a concert pianist show famous stars as selfish women who can't and don't love their children. The same question was brought up also in the earlier \"Through a Glass Darkly (1961)\" - in the relationship of the writer and his daughter. <br><br>Then there is the question of whether there are really two women at all; could the whole film be played out as a fantasy of one of them, or indeed of somebody else? Is there a sexual attraction between the two women? It might be or might be not. I believe, David Lynch has watched \"Persona\" very carefully, thought about it and used some of its ideas in his own \"Mullholland Dr.\" <br><br>There are so many questions in this incredible film that are left unanswered. For almost forty years, viewers and filmmakers alike have been trying to find the answers. One thing is obvious  this is one of the films you want to watch over and over again. I think it should be seen by any viewer. If you've seen it already  see it again. You'll learn something new. If you have not seen it  you are in for a great experience. See it for Sven Nykvist's camera work, for Liv's face, for Bibi's voice, for the unique and mysterious world that is Ingmar Bergman's universe.","user":"Galina_movie_fan","rank":[179,221]},{"title":"A Masterpiece","rating":10,"date":"21 April 2005","review":"PERSONA may well be Ingmar Bergman's most complex film--yet, like many Bergman films, the story it tells is superficially simple. Actress Elizabeth Volger has suddenly stopped speaking in what appears to be an effort to cease all communication with the external world. She is taken to a hospital, where nurse Alma is assigned to care for her. After some time, Elisabeth's doctor feels the hospital is of little use to her; the doctor accordingly lends her seaside home to Elisabeth, who goes there with Alma in attendance. Although Elisabeth remains silent, the relationship between the women is a pleasant one--until a rainy day, too much alcohol, and Elisabeth's silence drives Alma into a series of highly charged personal revelations.<br><br>It is at this point that the film, which has already be super-saturated with complex visual imagery, begins to create an unnerving and deeply existential portrait of how we interpret others, how others interpret us, and the impact that these interpretations have upon both us and them. What at first seemed fond glances and friendly gestures from the silent Elisabeth are now suddenly open to different interpretations, and Alma--feeling increasingly trapped by the silence--enters into a series of confrontations with her patient... but these confrontations have a dreamlike quality, and it becomes impossible to know if they are real or imagined--and if imagined, in which of the women's minds the fantasy occurs.<br><br>Ultimately, Bergman seems to be creating a situation in which we are forced to acknowledge that a great deal of what we believe we know about others rests largely upon what we ourselves project upon them. Elisabeth's face and its expressions become akin to a blank screen on which we see our own hopes, dreams, torments, and tragedies projected--while the person behind the face constantly eludes our understanding. In this respect, the theme is remarkably well-suited to its medium: the blankness of the cinema screen with its flickering, endless shifting images that can be interpreted in infinite ways.<br><br>Bergman is exceptionally fortunate in his actresses here: both Liv Ullman as the silent Elisabeth and Bibi Anderson as the increasingly distraught Alma offer incredible performances that seem to encompass both what we know from the obvious surface and what we can never know that exists behind their individual masks. Ullman has been justly praised for the power of her silence in this film, and it is difficult to imagine another actress who could carry off a role that must be performed entirely by ambiguous implications. Anderson is likewise remarkable, her increasing levels of emotional distress resounding like the waves upon the rocks at their seaside retreat. And Bergman and his celebrated cinematographer Sven Nykvist fill the screen with a dreamlike quality that is constantly interrupted by unexpected images ranging from glimpses of silent films to a moment at which the celluloid appears to burn to images that merge Ullman and Anderson's faces into one.<br><br>As in many of his films, Bergman seems to be stating that we cannot know another person, and that our inability to do is our greatest tragedy. But however the film is interpreted, it is a stunning and powerful achievement, one that will resonate with the viewer long after the film ends.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[165,206]}]