[{"title":"The best cycle film for me.","rating":8,"date":"2 November 2011","review":"As a few other reviews have stated, this is a different kind of costner. An earlier, less-famous costner. He was very good in this, i didn't see the end coming either. The fact that there isn't many well known faces in this film is what makes it so watchable, because you have no pre-conceived biases due to not knowing any of the actors. You just concentrate on the storyline &amp; what they're doing, instead of thinking about all the other stuff they've been in. The music was brilliant as well. Some f*cking breathtaking cinematography on the mountain race scenes. A simple film, executed well and with a satisfying ending. Also took me a while to realise his teacher was the guard from \"lock up\" &amp; the owner off McDowells restaurant from \" Coming To America\" LOL.","user":"jamesbarnshaw","rank":[8,9]},{"title":"an adrenaline-pumping, yet heartwarming bike movie","rating":9,"date":"11 April 2001","review":"American Flyers should not be passed over by non-athletes just because bike racing is a central part of the movie.  Sure, its a must-see for all cyclists due to the great racing sequences and thrilling ending(great movie to watch when you're cycling indoors!), but it's also a moving story of two brothers.  Theirs is a complex relationship which never borders on sappiness.  It may not be perfect, but American Flyers delivers great action and acting and a moving story of the inseparable bonds between brothers and their mother.  Don't pass up the chance to see this forgotten gem","user":"gregk23","rank":[14,20]},{"title":"It coulda been great!","rating":6,"date":"14 August 2001","review":"This sentimental film which one reviewer terms a \"cult classic for cyclists...\" is disappointing.  Yes, as a former cyclist who was racing at a time long before cycling was popular, it does have some scenes that bring back memories of the adrenaline rush of riding in the pack (I was usually well at the rear) and the long hours of training.  The scene where they have to sprint past a pit bull is memorable too, but most cyclists can outsprint dogs.  However, when you compare this film to the 1979 Breaking Away, it doesn't stand up.  Frankly, I found the theme of an athlete with a potential life-threatening condition to be a bit over-wrought and excessive sentimental.  David Marshall Grant has his day in the sun alongside Costner and gives less than a memorable performance.  Rae Dawn Chong is, as always, charming but the rest of the cast fades away.  This is not a bad film and is one that could have been outstanding, with a bit of work.  It's too bad that Hollywood too often makes films based on sport stories which avail little about the sport itself. Indeed, their portrayal of the sport winds up being what they (Hollywood marketeers) think main stream America thinks the sport looks like. This film was made before cycling was brought into the public eye by such outstanding American athletes as Davis Phinney, Greg LeMond and Lance Armstrong.  My impression that the reviewer who chose to deem this film a \"cult classic for cyclists\" did so because there wasn't much else out there to fill that bill.","user":"artzau","rank":[18,29]}]