[{"title":"If you're not with us, you're against us","rating":19,"date":"19 July 2003","review":"\"The Lost Honor of...\" not only tells an interesting story with powerful writing, acting and cinematography, but is also a must see for those disturbed by the power<br><br>authoritarian governments (communist, fascist, and everything in between) possess to exploit individual human rights.  I wish we could view this film as a well made relic of the past, but unfortunately its subject matter is as relevent  today as it was in 1970's West Germany.  As in Katarina's world, terrorism is again the favored epithet of the day as the U.S.'s social and political climate moves away from a conversation between differing individual view points and towards an 'on message'  insistence on absolute conformity.<br><br>Katarina is a young maid with little money, who sleeps with a man she barely knows, a man who is under surveillance as a suspected terrorist.  Because she was seen with the supposed terrorist, her life is torn apart by police interrogators and a press that only reports \"facts\" which support its particular ideology, even if the details must be fabricated. Although those who know Katarina tell the press and police of a bright, sweet, and quiet girl, her reputation is run through the gutter by the men who translate her private life to the public world.  Eventually, Katarina takes on the attributes of a stereotypical terrorist because the state has given her no choice but to become radicalized.  Simply because Katarina will not give up her dignity and privacy, she becomes an enemy of the state.<br><br>For Katarina, her private life becomes glaringly public, and the public judges her based on both the fabricated evidence presented by her accusers (both press and government) as well as their own assumptions about how a woman should behave.  In the society that surrounds Katarina, the state functions through conformity, and those who do not conform instantly become the enemy.   As a woman, Katarina bears the brunt of this brutality, as her sexuality becomes both exploited and demonized.  The young maid becomes a media fixation, a beautiful sexual terrorist.<br><br>Although much of this might sound familiar, the film relates these political and social paradoxes on an individual, personal level.  As in Katarina's case, sensational news stories rarely investigate the cogs which make them front page headlines-they only reinforce easy reactions of judgemental outrage.  \"The Lost Honor of ...\" shines a bright light on the lives that are trampled beneath the broad strokes of an unyielding and inhuman militarized state and the press and public which supports it.","user":"spyit","rank":[27,31]},{"title":"Powerful film based on Heinrich Böll novel","rating":9,"date":"5 February 1999","review":"This film is based on the novel of the same name by the German author Heinrich Böll.  The book is purported to be written by Böll as a result of an ongoing feud in the German media between Böll and the publisher of the German daily tabloid the Bild Zeitung, a publication known for its lurid and sensational reporting of the news.  In his story, Böll attempts to show how damaging irresponsible journalism can be to the lives and reputations of innocent persons caught up in the tide of current events.<br><br>The story begins with Katherina Blum attending a party where she meets and is strongly attracted to a young man.  She invites him to her apartment and they spend the night making love.  The next morning, the young man has gone and the police are storming her door seeking to arrest the overnight guest as a terrorist.  Instead, Katherina is arrested and taken to the police station for interrogation as his accomplice.  The young terrorist has been killed and Katherina is unable to prove that she had no knowledge of his activities.  A tabloid reporter becomes obsessed by the case hounds Katherina, mercilessly destroying her reputation and any semblance of a normal life.  The emotional tension continues to build, finally reaching a violent climax.<br><br>This is a very powerful and well made film.  Böll's message regarding sensational and irresponsible journalism is very clear.  After suffering along with the innocent Katharina through the insult, pain and dishonor of her ordeal, I came away from the film with an altered point of view toward tabloid journalism and commercial news reporting in general.  In a world where reporters are being found guilty of manufacturing news stories, media agencies are providing dramatic reenactments of sensational news events, and names like O.J. Simpson and Monica Lewinsky are used as teasers to improve the ratings of news programs, this film is a must see.","user":"Nick-163","rank":[29,34]},{"title":"Woman's life is destroyed by ruthless tabloid stories","rating":9,"date":"4 October 2004","review":"This is one of a handful of German productions of the 1970s critically acclaimed by world cinema. \"Die verlorene Ehre der Katerina Blum\" tells of the seemingly innocent love affair of a young woman with a man who turns out to be a fugitive bank robber. Twisting and turning the story to make it more \"readable\" a tabloid reporter shamelessly destroys the woman's reputation, even leading to her arrest as an \"accomplice\" to the crimes committed by her \"boyfriend\".<br><br>The film shows in detail how the situation impacts many people, including Katerina's employers, neighbors, family memebers. All speak highly of her, yet the newspapers always manage to print distorted facts, embellishments and outright lies. The ending, though unexpected and shocking, will satisfy the viewer, who by now completely empathises with the title character who had been \"railroaded\" by the press for no other purpose than to sell more papers. A five star classic.","user":"mdm-11","rank":[17,19]}]