[{"title":"The Canadians Must Laugh At This One","rating":5,"date":"27 July 2007","review":"The building of the Canadian Pacific railway was as much a milestone in the history of Canada as the transcontinental railroad in the United States of America. But the circumstances were so incredibly different the Canadians must have had a laugh and a half at this Hollywood story of one of the great events from their history.<br><br>The great challenge of the railroad was getting it through just that last stretch of mountains in British Columbia. The track went through a mountain trail known as Kicking Horse Pass and it was quite the engineering feat. That was the main story with the building of the Canadian Pacific.<br><br>But we have here is the plot of Union Pacific essentially brought under the Maple Leaf with villain Victor Jory stirring up the Indians to prevent the Canadian Pacific from getting through. Of course since he's up against chief engineer Randolph Scott, you know how this is going to come out.<br><br>Randy as was the case in a lot of his westerns has two girls to choose from, railroad brat Nancy Olson and Quaker doctor Jane Wyatt. I really think Wyatt was a bit ridiculous pushing her pacifist beliefs in the middle of the Indian attack at the climax.<br><br>On the plus side that Indian attack is one of the best I've ever seen in a western and you will be on the edge of your seat during the final shootout between Randolph Scott and Victor Jory. Also look for a good performance from the always dependable J. Carrol Naish as the locomotive engineer and Scott's sidekick. Also Dick Wessel as a murderous bartender is also quite good.<br><br>Too bad that this particular episode in Canadian history got Americanized though.","user":"bkoganbing","rank":[32,36]},{"title":"Fair Western, but not very accurate","rating":4,"date":"24 January 2005","review":"In the opening of the film there is a scene of a modern steam-powered freight train leaving Calgary, and there the accuracy comes to an end. This film is supposed to be based on the building of the Canadian Pacific Railway, but it's pure Hollywood hokum. Nobody did their homework. There is the usual shoot-outs, gun battles, renegade Indians, \"bad guys,\" sabotage, and the \"romantic angle.\" None of these things happened during the building of the Canadian Pacific; the ever-present Mounties saw to it. In defense of the film it is a typical out-of-the-file story. Not good, but not that bad either. Randolph Scott is good (Randolph Scott was always good!) If you're looking for a Saturday-afternoon-matinée Western, this one will do. If you're looking for an accurate story of the building of the Canadian Pacific, forget it.","user":"toowoomba","rank":[30,34]},{"title":"Excellent cast amid spectacular scenery, eh","rating":9,"date":"19 April 2009","review":"Generally, one has to read only \"starring Randolph Scott\" to know one is about to experience cinematic pleasure.<br><br>This film is different -- only in that Scott's character, Tom Andrews, has a double romance and is tempted to give up his fists and guns.<br><br>His first romance is with an intriguing character, a wild young woman who is so obviously smitten with Tom we are made happier by basking in her love.<br><br>Watching Nancy Olson in that role, I marveled at the strength she gave the character, Cecille Gautier. She also gave dimension, and beauty, and made Cecille someone we had to support.<br><br>As Tom gets involved with Dr. Edith Cabot, played by Jane Wyatt, who has probably never looked lovelier, we wonder which of the two women will lose.<br><br>The romance, though, is a sub-plot, and the major plot is the battle to complete the railroad, a battle against the elements and seasons, and against topography -- that spectacular scenery that even today lures tourists by the millions -- and against humans, some of whom are nefarious, some of whom are merely trying to protect their traditional way of life.<br><br>Besides the stars, cameo bits by such outstanding players as Earle Hodgins and Edmund Cobb and the incredibly prolific George Chandler (more than 400 roles!) make \"Canadian Pacific\" a great movie.<br><br>John Hamilton, with more than 300 roles to his credit, was usually seen as a police officer or judge or, most famously, the irascible Perry White in the \"Superman\" TV series. Here he shows his actor's range playing a peace-seeking priest.<br><br>The script, from a story by Jack DeWitt, and written by DeWitt and Kenneth Garnet, really fleshes out the characters, especially in the beginning with some charming dialog.<br><br>The music, by Dimitri Tiomkin, is something different from him, especially at the beginning, but is, of course, great. It is, after all, by Tiomkin.<br><br>The print I saw, recently televised by Turner Classic Movies, was not in great shape, and the sound had a wobble to it, but the movie was so good, the problems became very minor.","user":"morrisonhimself","rank":[15,18]}]