[{"title":"Surreal, absurd, unique","rating":10,"date":"1 March 2004","review":"Greaser's Palace is a comical, chaotic, absurdist and surreal religious parody. It's like El Topo meets The Life of Brian. Alan Arrbus plays a strange messiah-like zoot-suited actor/singer/dancer called Jessy, who one day parachutes into a field close to a Western town where a host of odd characters hang out, the main one being a constipated chap called Seaweedhead Greaser, who runs the titular saloon.&nbsp;Jessy has some miraculous traits - he can walk on water and heals some of the locals by telling them: \"If you feel, you heal\". One of the most memorable scenes (and my favourite) is when Jessy approaches a group of people praying and says to them: \"I bring you a message. Exactly six miles north of Skagg Mountain in the Valley of Pain, there lives an evil devil-monster. His name is Bingo Gas Station Motel Cheeseburger With A Side Of Aircraft Noise And You'll Be Gary Indiana. And he loves to hurt people. The last time I saw Bingo Gas Station Motel Cheeseburger With A Side Of Aircraft Noise And You'll Be Gary Indiana, he told me what he wants to do. He wants to come down here and kill each and every one of you. But I said to him: 'Bingo, wait a minute!'. And the reason I said that is because I believe in you people. I believe you can do the job. I believe you can help each other. I believe you can make this world a better place to live in. That's it\".&nbsp;<br><br>If you haven't seen this film then it must go on your must-see list of films, category surrealism. Chaotic cineastes will approve.","user":"Afracious","rank":[21,22]},{"title":"Genius or Madness? You make the call!","rating":7,"date":"7 December 1998","review":"Movie Review:   Sometimes in film a scene which is weird, horrifying or disturbing is carried to such an extreme that it transcends being grotesque and becomes beautiful. Jodorowsky's \"Santa Sangre,\" Fellini's \"Satyricon,\" and all of Lynch's films have moments like these. Unfortunately, \"Greaser's Palace,\" though it tries really hard, never quite goes from ugly duckling to swan. Weird, horrifying and disturbing (and sometimes hilarious) it is indeed, but the pieces in the puzzle never quite come together. I must say this, though, Robert Downey has made one hell of a riveting film. I couldn't turn away from my TV screen for an instant. The movie seems to be a rather loosely told version fo the passion of Christ, set in the wild west. There is a Christ figure (who arrives on earth rather anachronistically via a parachute wearing a pimp suit), some disciples (about 17 of them), a miracle or three (some walking on water, some raising of the dead, a little healing, a little stigmata, etc.), and the obligatory being nailed to a crucifix. However, I don't recall the rest of the plot being in the Bible. I'm not going to try and describe it, except to say that the Christ figure is a singer-dancer-actor going to Jerusalem, to get an audition with the great agent Morris. Indeed, in one scene he puts on a little song and dance routine for his disciples, but they aren't impressed with his performance until he starts screaming and bleeding from the holes that appear in his hands, at which point they applaud. The image of Christ as showman, rather than a shaman, is quite provocative, and the audience that is only satisfied when their savior is in pain seems to be a glimpse into human nature not often afforded the viewer of this film, which is filled with cartoony violence, stilted dialogue, and unnatural posturing. The fact that this hint of truth about what we really want out of entertainment (in an age when we pay $29.95 to watch the Ultimate Fighting Championship on Pay-Per-View, who wouldn't enjoy a little screaming and stigmata?) comes in the midst of all these people doing their best to act inhuman, or at least unhuman, may indicate that there is more to this film than meets the eye. But is the movie good? I'm not certain about how good or bad it is, but I know that I was mesmerized by it. There were so many disturbing, fantastic, and humorous things...A few that come to mind are: --Herve Villechaize as the diminutive gay man who has \"Jesus\" over for dinner and flirts with him. --Herve's \"wife,\" a bearded man in drag who angrily squeezes the Messiah's testicles after he refuses to sleep with the couple. --The woman who keeps getting shot throughout the film by an unknown assailant. --Mr. Greaser's intense orgasm and/or bowel movement which causes his palace to explode (I didn't understand either...). --Lamey Homo's description of the afterlife, \"I was swimming in a rainbow with naked babies, and I turned into a beautiful smile,\" which he repeats three times during the film (he keeps getting killed and brought back to life). --The Holy Ghost. --The Native American who gets his lower back problem fixed when the Messiah turns out to be not only the son of God, but also a fairly good chiropractor. --The savage beating of a transvestite nun by Lamey Homo and the monk. --Etc. Throughout the film I was continually trying to determine whether I was watching the work of a genius or a just a load of crap. I'm still not sure, but I know one thing; this movie is fascinating, and though it never really becomes more than the sum of its parts, they certainly are interesting parts. \"Greaser's Palace,\" is weird, funny, disturbing, gross, ugly, and strange, and I wholeheartedly recommend it. I guarantee you won't forget this film.","user":"Sat-2","rank":[19,21]},{"title":"The Anti-Gibson: The Passion of Christ told as a Spaghetti Western with a side of Shrooms...","rating":10,"date":"18 June 2006","review":"A woman (Job, Everyman, or Adam/Eve, though she plays another rather more narrow character in this multiple/simultaneous role) suffers the slings and arrows of a cold vicious cosmos at the center of a hot barren desert. Ouch!, it hurts, it REALLY hurts!! Trust me on this..... she gets walloped! Including the worst pain a mother could endure.<br><br>Greaser (Caesar) as absolute despot, runs the world in small, a dot on the map in the middle of this desert. He is inhumanly patient, ruthless, vicious, gleeful, cruel, capricious, and whimsical. Over the course of the film he personifies welds of any two of these traits. He has an entourage of minions, lackeys, and wannabes. They perform his bidding without question. The balance of the town residents have no power, but are at the complete mercy of Greaser (standing in not only for Caesar, ruler of the known world, but also personifying the indifferent, uncaring world and cosmos). But he has the worst case of constipation the world has ever seen. For all his power, and all the aid of the Mariachi brothers, and the shining love of his own mother who he keeps in a cage, - he can't make.<br><br>People go about their business as best they can, - with many rather bizarre distractions. There is a transvestite nun, or the ugliest female nun ever imagined (taking THAT bromide to its extreme logical conclusion, one quite ridiculous, but somehow fitting in this picture). A rancher has vaguely necrophilic fantasies regarding the local First Peoples. Christ Jesus turns out to be a rather exceptional chiropractor. Our female heroine keeps getting kicked in the teeth, again and again, - and again for good measure. She seems stuck in the Old Testament. Greaser's perenially disappointing son, Lamy Homo, also gets this treatment at the hands of his own father. The sins of the fathers visited upon their sons, the errors of history repeating themselves from generation to generation. An old coot in a white dress nicknamed Petunia, but who's real name is Luci(fer) tempts our other protagonist, Jesse, who although is technically not a criminal, is treated as one. A guy in a Charlie Brown ghost sheet with two round black eyes cut out protests that his role is too small. A little game of chance takes forever.......<br><br>That same Jesse arrives earlier in the film via an extreme wide establishing shot of a conestoga wagon rambling, creaking, and rumbling as it crawls across the desert plain. Just as it passes, - and the scene is sedate since there's nothing else happening,- Jesse arrives in the Old West from the top of the frame via a giant parachute, hits ground, dusts off his Zoot-suit, and unsurely gains some footing with some shuffling dance steps. He continues this perfect if uncertain timing over the plain, seeking..... something.<br><br>He finds \"the agent Morris\", a poor excuse for John the Baptist in any century, who also sees other futures, since he seems to wish to protect his head by wearing a space helmet.<br><br>In bemused/focused reverie, Jesse performs numerous miracles for the townsfolk;some of whom become cloyingly annoying. And for this receives the attention, and the rare(unique)if unspoken admiration of Greaser. He appears on Greaser's stage, to be approved or rejected by the audience. The female lead (Adam/Eve/Job/Everyman) takes on perhaps her most significant role as that of Judas.<br><br>Long before the pointlessly cryptic DaVinci Code (an insult to both Catholicism, the whole of Christendom AND Leonardo DaVinci, not to mention the likely intelligence of any typically well-read history buff; and again another Hollywood flick filmed in MurkyVision!) - Downy Sr. presents the \"fact\" of the act between Jesse and Mary Magdeline; oddly, for a film so apparently zongo and off-center, the only major departure from general Christian orthodoxy. A bad one at that, but well,it was the 70s, it was spring, we were young.....<br><br>The quietest scene in the entire film is perhaps the most powerful, - where Jesse is chastened by His Father - \"You... get... going!!!\", played by a perfectly cast, cloud-white bushy-haired, bushy-bearded, Amish-looking grandfather. All in the midst of spectacularly gory and absurd carnage. Sounds like the world to me.<br><br>Despite all the couching in absurdest non-linear plotting, extreme violence SEEMING to be merely lurid and gratuitous, and the many bizarre characters and subplots to nowhere, this is really a very gripping, awesome, violent, fabulous, eye-catching, mind-catching, amusing, hilarious in places, and ultimately heart-rendering re-telling of the Passion of Christ. (NOT the second coming as this or that reviewer has stated.) There are two other scenes which vie with the Father/Son meeting for most powerful/compelling/affecting sequences in the film. I omit their descriptions to provide motive for your unfilled spare time.<br><br>Repectfully, Larry Hiam","user":"Larry_Hiam","rank":[15,17]}]