[{"title":"Retreating In Korea","rating":8,"date":"18 May 2007","review":"Through a combination of bad diplomacy and an understandable war weariness from World War II, the USA was caught completely off guard when the Communist North Korean government attacked the Southern forces that we were training. We had few enough forces and they were driven to what became known as the Pusan perimeter in 1950 when General MacArthur pulled off the two pronged counterattack out of the perimeter and from the landings at Inchon.<br><br>Robert Ryan is a lieutenant leading a small group of survivors who are caught behind enemy lines to safety. These GIs are not battling for any glory, but simply for survival. Also retreating are Sergeant Aldo Ray in a jeep with a shell-shocked Colonel Robert Keith. Ryan commandeers both Ray and the jeep for his needs.<br><br>Ryan is a good officer, but by the book. Ray is a good fighting man, but very insolent. The remainder of the film is how these two guys who grate on each other's nerves, but manage to work together.<br><br>The film is directed by Anthony Mann, best known for his westerns in the Fifties that mostly starred James Stewart. Men in War is probably best compared to Bend in the River. Jimmy Stewart is taking supplies to settlers for their survival and his own and Ryan is essentially doing the same thing in this film. <br><br>Ryan was a multi-faceted actor who sometimes played leads, but mostly did good character parts as bad guys. He had worked with Mann and Stewart previously in The Naked Spur where he was as bad as they come. He's just as convincing as the gritty, but decent lieutenant here. Mann and Ryan would team again the following year in God's Little Acre, a subject far removed from the Korean War.<br><br>Men in War is a good film, photographed very realistically in the outdoors and has the look and feel of a newsreel with depth.","user":"bkoganbing","rank":[34,36]},{"title":"Director Anthony Mann deserves a lot of credit for this fine war flick.","rating":7,"date":"13 January 1999","review":"Men In War was directed by Anthony Mann,who was really more known for his big budget westerns. This, his first and last attempt at a war film, stands out with its realistic battle scenes involving stylish camera angles and innovative editing. Robert Ryan as Lt Benson and Aldo Ray as \"Montana, are outstanding as their characters are at odds from the very beginning. Look for James Edwards, who was one of the first black actors to rise above the general sterotypes, even before Sidney Pottier came along. Men In War is worth seeing, especially the last half of the film as it builds to an intense conclusion.","user":"gitrich","rank":[28,31]},{"title":"\"God help us if it takes your type to win this war\"","rating":8,"date":"23 April 2009","review":"'Men in War (1957)' had been sitting on my video shelf for quite a few months, but I was very interested in watching it. Anthony Mann, generally known for directing Westerns, here avoids the conventions of his favoured genre, and a brief glimpse of the opening scene had promised a stark, realistic war-time drama, unconcerned with patriotic gallantry and instead focused on the psychological torment of being exposed to continuous conflict. My expectations were, for the most part, excellently met. In a wonderful year that included stunning war pictures from Stanley Kubrick, David Lean and Mikhail Kalatozov, 'Men in War' manages to hold its own, despite what was likely a comparatively low production budget. Part of the film's merit lies in its focus on characters. There are, in fact, two \"wars\" at play in the film: between the American platoon and their faceless Asian enemies, and between feuding soldiers Lt. Benson (Robert Ryan) and Sgt. Montana (Aldo Ray), who must construct a tentative alliance if they are to emerge intact from enemy territory.<br><br>In 1957, Stanley Kubrick released 'Paths of Glory (1957)' which featured perhaps the most spectacularly realistic scenes of warfare until 'Saving Private Ryan (1997).' Mann's film, produced in the same year, strives for a more modest brand of realism, one less concerned with fireworks than with isolation punctuated by the unexpected threat of danger. In most WWI and WWII pictures, the major battles are played out amid gunshots and canon-fire, exploding earth and dying soldiers. The Korean War (1950-1953) presented American soldiers with a new kind of conflict: guerrilla warfare. Lt. Benson leads his platoon through enemy territory in an improvised retreat, and, at times, it even seems as though the men are engaged in a peaceful forest hike – the unbroken silence is not unnerving, as it probably should be, but deceptively reassuring. One soldier (James Edwards, the pioneering African-American actor from 'The Set-Up (1949)') even appears to forget his circumstances entirely, lulling himself into a false sense of security that is sharply and inevitably encroached by a silent enemy ambush.<br><br>Robert Ryan is ideally cast in the leading role, bringing to the character his characteristic intensity, world-weariness and self-doubt. Though undoubtedly a dedicated leader, Lt. Benson finds even his own resolve cracking under the pressure of seclusion and imminent, unseen peril. Even more interesting, however, is Aldo Ray as Sgt. Montana, who would be a selfish, dishonourable scumbag if it weren't for his unwavering devotion to a shell-shocked colonel (Robert Keith), and his meticulous knowledge of enemy tactics. The remaining soldiers, including Vic Morrow and L.Q. Jones, are unfortunately relatively anonymous characters, and their eventual dispatching is mostly without emotion – or perhaps by then we've simply become so hardened to the prospect of death that we can't feel anything. Though the obligatory heroic ending strays onto the beaten track, I was mostly impressed with how 'Men in War' generally avoided clear-cut heroics. The soldiers killed by enemy attacks are betrayed by unlucky circumstances or momentary lapses of judgement; even the final assault on an enemy stronghold seems almost pathetically inadequate.","user":"ackstasis","rank":[14,15]}]