[{"title":"Intense, Haunting & Terribly Sad","rating":10,"date":"2 July 2004","review":"The Dead Zone, along with The Shining and Salem's Lot (1979) is probably one of the best cinematic adaptions of a Stephen King novel. The Dead Zone centers around young schoolteacher John Smith (the awesome Christopher Walken) who leads a pretty normal life in a small town in Maine. John is a nice young man with a classroom full of students who like him, a pretty girlfriend he wants to marry and a good relationship with his mom and dad. But late one night, a horrific car accident takes all of that away from him...and replaces it with the gift - or is it the curse? - of precognition. John awakens from a five year coma to find his girlfriend married to another man, his job long gone and his parents much more feeble and shaken. But the one thing he does have - and isn't sure he wants - is a powerful ability to see both into the past and the future. Everyone he touches is an open book - the nurse whose house is burning down, the doctor whose mother escaped Nazi occupied Poland, the reporter whose sister killed herself...and a brutal serial killer who is raping and strangling young women. But the worst is yet to come. John meets an eager and ruthless politician (Martin Sheen) who is determined to get into the White House and declare nuclear war in the name of God. John finally decides to make use of his harrowing visions and sets out to change the future, even if it means he will not live to see it for himself.<br><br>This is an emotional, sorrowful tale of loss, grief and sacrifice. John is no superhero, no butt-kicking killing machine out to stomp the bad guys. He's a sad, lonely man with a limp and a terrible case of bad luck. The pain of John Smith haunts the expressive face of Christopher Walken throughout the entire film, and the rage he feels at the rotten hand that life has dealt him is understandable, believable and shattering. This is a man who has suffered every pain and loss that a man can suffer, yet is still determined to make the world a safe place for those he loves, even if it means losing them forever.<br><br>John is indeed one of screendom's saddest heroes - accessible, believable and heartbreaking. Christopher Walken is thoroughly convincing in his performance here: very likable and, at the same time, frighteningly intense. The cold, eternal winter in which the film takes place just reinforces the sense of loneliness and alienation. The violence is brief, but shocking, and the images are so powerful that they remain with you long after the film ends. Martin Sheen is also incredibly good as the dangerously psycho politician, and Brooke Adams is the dark ghost of regret as John's true love, Sarah. <br><br>This is a powerful, unforgettable film, whether you consider it a mystery, a horror-thriller or a tragic love story. Don't miss it, if you can help it. 10 huge stars!","user":"Gafke","rank":[79,85]},{"title":"As far as King adaptations go, this one is ace","rating":7,"date":"11 March 2005","review":"\"The Dead Zone\" is one of the few King novels turned into really good movies. It is very true to the book in its first two thirds and integrates some nice new elements in the last. Making Sarah a supporter of Greg Stillson was a brilliant idea that adds a bit more intensity to the finale. Some details of the novel are only hinted at or cut out entirely (Johnny's mother's religious delusion, his first accident on the ice, the Wheel Of Fortune, etc), but compromises have to be made when turning a book with 500 pages into a feature length movie and I think the right editing choices have been made.<br><br>\"The Dead Zone\" is not only an overlooked gem when it comes to Stephen King adaptations, it's also one of Cronenberg's best directing jobs, not very typical of his work, but pretty timeless. Sure, nowadays the accident at the beginning, Johnny's visions and the shootout at the end would be made more gripping and spectacular, but those minor flaws don't really make the movie seem all that dated.<br><br>Of course, having read the book I enjoyed the movie as a portrayal of events I had pictured in my mind before. I don't know, if \"The Dead Zone\" is thrilling to first time viewers, too, since the plot leaps a little, being a series of episodes rather than one continuous story. After all, I believe that Christopher Walken's performance is strong enough to carry most of the story and make you care about this character and his fate. In fact, all the roles have been cast pretty accurately to my personal imagination.<br><br>This movie is an artifact of the times when Hollywood's most important directors would fight for the opportunity to adapt one of Stephen King's novels. It's every bit as enjoyable as \"The Shining\" as a movie, it's just based on an inferior model. Still, \"The Dead Zone\" can be recommended to King fans as well as those who are indifferent to his work.","user":"Superunknovvn","rank":[71,78]},{"title":"Brilliant thriller with a superb performance from Christopher Walken. One of the very best Steven King adaptations.","rating":22,"date":"22 May 2003","review":"I'm a great admirer of David Cronenberg, and \"The Dead Zone' could well be his most underrated movie. The problem is that it's just not very Cronenbergesque, and being \"Deprave\" Cronenberg's first mainstream Hollywood movie, and coming hot off his provocative and mind blowing 'Videodrome', many people regard it as some kind of sell out. I really cannot agree. If you forget your preconceived idea of what Cronenberg movies SHOULD be (and let's not forget his other career oddities 'Fast Company' or 'M. Butterfly'), and just accept it for what it is, you'll see that it is a very well made and well acted thriller, and is almost impossible to fault. In my opinion it joins Kubrick's 'The Shining' and De Palma's 'Carrie' as the most effective Steven King adaptations to date. Christopher Walken is on top form here, and I think gives one of his very best performances. The supporting cast are also excellent, the lovely Brooke Adams ('Invasion Of The Body Snatchers'), horror veteran Herbert Lom ('Mark Of The Devil'), Martin Sheen ('Badlands'), Tom Skerritt ('Alien'), Anthony Zerbe ('The Omega Man'), and Cronenberg regular Nicholas Campbell, who is involved in the movies most unforgettable sequence. I've lost track of how many times I've watched 'The Dead Zone' over the years, but it never fails to hook me in, and I always get something more out of Walken's performance every time I view it. This movie may not be typical fare from David Cronenberg, but it is one of his most straightforward and entertaining films. Highly recommended.","user":"Infofreak","rank":[68,78]}]