[{"title":"Wonderful debut","rating":9,"date":"13 November 2007","review":"In a small town in occupied France, the tranquil life of the occupants of a country house (an uncle and his niece) is disturbed when a new German officer, Lieutenant Werner Von Ebrennac is billeted and takes up residence in their home. Not wanting to be seen to be collaborating with the enemy they both agree not to let the foreign presence interfere with their everyday life and to this end they even refuse to acknowledge their new guest when he speaks to them. Von Ebrennac a musician and budding composer understands their stubbornness and each night he joins them in their living room and regales them with his stories, on topics such as his love of France, the influence of his father, the war and his passion for music, all of his thoughts and questions go unanswered by the uncle and his niece, he puffs on his pipe while she continues to knit, all the time never making eye contact with their unwanted guest. Privately they both seem to have a growing respect for Von Ebrennac,a learned, romantic and cultured man who imparts his knowledge of French literature with a vitality that can't help but enthuse the listener, he even resorts to wearing civilian clothes in order that his hosts feel more comfortable in his presence.<br><br>After the fall of France to the occupying Nazi's, Jean Pierre Melville who fought in the famous battle of Dunkirk found himself demobbed from the French military and subsequently ended up in London where he tried to do his part for the French Resistance, it was there that his love of Cinema gave him his first inkling of what his first project would be, he wanted to adapt the infamous and iconic Resistance book, La Silence de la Mer by Vercors, After the war Melville approached Vercors looking for his permission to adapt his work, which was denied. Despite this setback Melville set out to make the film anyway, another problem that beset him was that he had no Cinematic training and in the highly regulated and unionised France this was going to be a sticking point if the film was going to be made, but his determination fuelled the project and soon Vercors was on board, after Melville made him an offer that the film would never be released unless it was accepted by an esteemed Resistance audience at a private screening and if it didn't compromise his book, of course the film was widely accepted with only one vote against. Melville strived for authenticity and even used Vercors' own home for the filming and also employed actors that had been in the Resistance.<br><br>Jean-Marie Robain plays the Uncle and his voice is for the most part only heard in voice-over, both he and Nicole Stéphane's (the Niece) performances by their nature have to be very subdued and all emotion is shown with but the slightest of glances and hardly any movement. Vernon has nearly all the on screen speaking parts and the film is broken up into his ever more emotive musings on life that border on soliloquy and its his performance that holds together the film, when after a brief trip to Paris to meet some old friends, he returns devastated in the knowledge of the atrocities that are to happen and that have been happening, he must now admit to his hosts that his interpretations of his countries ideals have been erroneous. A sublime debut from Melville that influenced many of his fellow countrymen, like Bresson, Truffaut and Godard, with but the slightest hint of what direction his career would take, his gathering together of first timers succeeded in creating a film that bucked many of the filmic trends of the day and as such helps retain its freshness and power even today.","user":"Prof-Hieronymos-Grost","rank":[31,32]},{"title":"adieu my love","rating":9,"date":"8 June 2004","review":"France 1942. Jean Pierre Grumbach alias Melville is away in London with General de Gaulle. France is occupied by the German nazi swastika. Jean Bruller, actually an illustrator, writes a novel 'LE SILENCE DE LA MERE', which is published by the underground 'Edition de Minuit'. Bruller calls himself Vercors. On Feb. 22, 1942 the book is ready to be issued and distributed in Paris by messengers on bicycles. <br><br>Melville first read the novel in English. He reports, that he was absolutely determined, that it would be his first film. He returned to France and negotiates with Vercors to buy the rights for his resistance novel. Vercors refused to let Melville have it. The book had virtually served as a Bible during the war and had become part of the French national heritage. Finally Vercors and Melville make a deal: The future famous director guarantees to submit the film as soon as it was finished to a jury of resistant selected by Vercors. Should one single member of this Jury be opposed to the film being shown, Melville promised to burn the negative. <br><br>The trouble was, that Melville was unqualified professionally, had no union card and in fact not obtained the rights to the book. Still, the director of the GTC laboratories Colling encouraged Melville and did the chemical work for nothing and the later famous lighting cameraman Henri Decae was the operator of the hired and not so well working equipment. The film was made in Vercors own house and Howard Vernon, a German (Swiss?) starred, as well as a friend of Melvilles Jean-Marie Robain, a wartime comrade, and a family friend Nicole Stéphane, whose profile and limpid eyes Melville loved and who was according to him a Rothschild, what the CGT didn't like so much.<br><br>What is it all about ? Uncle (Robain) and his niece ( Stéphane) live together in a house outside some village that is occupied by the Germans (and drink expensive coffee all the time). They have to tolerate a German lieutenant (Vernon), who comes to live upstairs and has a bad leg and who works in the Commandantur. He is a well educated composer of music and has never been to France, though he has traveled the world  except France. When he after work comes back to the uncle-niece couple (he sucking a pipe, she knitting) he knocks at the door and speaks (mostly in his German uniform) in French to the owners of the house, who never answer to him or comment on his statements, explanations, ideas, longings, who never say good night. They are just listening to him. <br><br>What is the lieutenant speaking and dreaming of ? He imagines the genius of German music and the greatness of French literature being united in a peaceful Europe. One day our lieutenant Werner decides to go to Paris, that he avoided a long time. The opera like action inside the (Vercors) house is now taken to open air Paris, Vernon with his officers cap is a tourist in front of several well known Paris Buildings and we watch him attending a party of officers, who wise Ebrennac up, that they never intended to respect the French culture or let it at least exist as it is. They make clear that the occupation has just one aim, finish the French for once and for all times. Ebrennac looses all hope, returns to the cottage of uncle and niece, packs his luggage and reports to them what he had heard in the officers Club in Paris. He decides to go back to the front. He leaves the house and this is the time, when the niece says just one word: Adieu.<br><br>Certainly the film has an anti-cinematographic aspect and there is little action. But you watch every minute with growing interest how the relationship between the three is developing. There are simple means, two or three walls, a ceiling, a door, a uniform, a ball of wool, a flickering fireside and the over and over repeated greeting of the officer, that he wishes a good night. Are we even witnessing a quiet love affair ? It is probably not in the book, but I like to accept that idea, sympathy for the devil. (Andre Gide: I think the girl was a fool. She deserved to be spanked.)<br><br>The film is full of fine details. All of them put splendidly by Decae into a black and white photography as if that sort of film was just freshly invented. The church at the horizon (where would that be ?) behind a field of corn and the forgoing panning shot followed by a slow pan toward a gun barrel. The scene when the lieutenant and his corporal cross a bridge and three French occupy the sidewalk and don't move a single inch. The group of officers caps on the table at the soiree, the perfect focus in the kitchen (Gregg Toland's way) and the nice scarf of the niece towards the end, which looks like decorated by Jean Cocteau, but was drawn by Melville himself, who greatly admired Cocteaus work. Its all much more than just a first film of a future independent film maker. <br><br>Melville tells us, making the film was the happiest year in his life. Decae and Melville did the editing from 35 mm rushes in a hotel room. They projected on to the wall. They filmed in total penury. After putting an original music to the film (cost as much as the whole film, 120 musicians) in October 1948 the film was first screened at the studio des Champs-Elysees, in the presence of a top-drawer audience. Now at last Pierre Braunberger came in and managed to persuade Melville to give him the film. It did well at the box office. <br><br>And thanks to young Howard Vernon, who passed away only recently at the age of 82. And Cocteau thought the mentioned scarf was a work of his.<br><br>Michael Zabel, Offenbach/Rodenbach","user":"luckysilien","rank":[54,60]},{"title":"Melville's first film, a classic and innovative work in the history of cinema","rating":10,"date":"6 June 2010","review":"This film is famous for several reasons, all of them valid. The film is based upon a novel by Jean Marcel Bruller (1902-1991), writing under the pen name of 'Vercors'. The novel appeared in 1942 and was circulated secretly throughout France by the Resistance, at great danger to the lives of all concerned, under the noses of the occupying Nazis, and it became a classic work of defiance of the oppressor. Jean-Pierre Melville, who had never made a film and did not even know how, decided after the War that he had to film this story. He completed the film in 1946 and it was finally released in 1949. He shot the film in the novelist's own house for the sake of authenticity. It was half-financed by Nicole Stéphane (1923-2007), later an actress, whose first film appearance this was, as the niece. She was apparently related to the Rothschilds and thus part Jewish. She later acted in six further films, including Melville's film of Jean Cocteau's LES ENFANTS TERRIBLE (1950) and she played Marie Curie in MONSIEUR ET MADAME CURIE (1956), retiring as an actress in 1958. After that, she was producer of six films, commencing with the famous and politically provocative MOURIR À MADRID (1963) and ending with a TV film in 1988. In this film, she speaks only four words, despite being a leading player, but her performance is superb nevertheless. The story concerns the enforced billeting of a German army officer in 1942 in the country house of an elderly man (played by Jean-Marie Robain, puffing imperturbably on a pipe) and his young niece (Stéphane). They adopt an attitude of passive resistance, by never speaking to the German officer. Perhaps the most amazing thing about the film is the truly remarkable performance of Howard Vernon as the officer. The story is based upon a real experience in that same house by the author of the novel. The officer is a highly-refined and cultured Francophile, who likes to refer to all the famous French authors, even the Jewish author Proust, with affectionate regard. He sits down at one point and beautifully plays a Prelude by J. S. Bach. All of these scenes take place in the drawing room of the house, where the officer delivers long monologues to his hosts, and to which they never reply. He opens his heart to them and tells them of his deep and abiding love for France and French culture, of his passionate belief that the German Occupation will bring a wonderful and indeed a mystical union between the two cultures. His eyes glow with fervent idealism as he says these things. He explains that he always refused to join the Nazi Party, which is why he is only a Lieutenant in the Wehrmacht instead of a high officer, as he is well into middle age. Vernon's character is based upon a mixture of the real officer who was billeted in the house and the highly-cultured author, Captain Ernst Jünger, who was based in an administrative role in Paris during the Occupation. Jünger (1895-1998) lived to the extraordinary age of 103, and was author of many famous novels such as ON THE MARBLE CLIFFS (1939) and THE GLASS BEES (1957). Forty years after the War, he published a novel about Paris during the Occupation entitled A DANGEROUS ENCOUNTER, which I have read and did not think was particularly successful. His diaries of the period in Paris are also published as GARDENS AND STREETS (1942, never translated into English). During his time in Paris, the intensely Francophile and anti-Nazi (though otherwise very right-wing) Jünger fraternized with people such as Jean Cocteau. Jünger and the officer billeted with Vercors were both idealistic and old-fashioned conservative officers of the regular German Army, known as the Wehrmacht, who tended to be highly cultured and not in sympathy with the lowbrow Nazis, whom they often despised. It was these people, such as my own distant cousin James von Moltke (executed by the Nazis), who plotted against Hitler and tried to assassinate him. The performance of Vernon shows the officer displaying the most perfect and impeccable manners, bowing to his hosts and wishing them good night and confiding in them with almost reckless abandon about his hopes and fears. They never respond until the end of the film. He even tells them he admires them and understands their behaviour. But the turning point of the story comes when he visits Paris, which he has longed to do all his life. After seeing the famous monuments and soaking in the incomparable atmosphere of the world's most wonderful capital city, he then pays a visit to his childhood friend at a headquarters office where he is serving as an SS officer. As we all know, or should know, the Wehrmacht was one thing, but the SS was quite another. He is utterly horrified to learn of an extermination camp called Treblinka. (This mention of Treblinka, actually chronologically impossible for him to have learned about in 1942, was inserted into the script by Melville, who was Jewish, and did not appear in the novel.) The discussion of Treblinka occurs in German, and in the original French release of the film, it was not translated by any French subtitles. Vernon's SS friend then goes on to boast about how the Nazis intend to destroy French culture root and branch, as decadent and un-German. This totally shatters Vernon and destroys all his idealistic illusions about his role. He returns to the house in the country and tells his hosts of this terrible experience and these monstrous revelations, hoping for some glimmer of sympathy from them at his disillusionment and the horror of what he has learned. But they just look at him silently. The DVD contains an interview by cinéaste Ginette Vincendeau, as well as a lengthy printed booklet by her.","user":"robert-temple-1","rank":[19,20]}]