[{"title":"Forgotten Comic Gem","rating":27,"date":"27 July 2004","review":"When I saw this film in the theatre the whole audience was laughing out loud. The humor was intelligent and witty, unlike today's market-researched and audience-tailored bombs. It's a film made for adults about adult sensibilities, and important issues we all face sooner or later.<br><br>It's not a film that's funny from one moment to the next, but is a poignant tale about a woman (played by Sally Field) dealing with some profound changes in her life. The moments of humor (good, funny, smart moments) are sprinkled in here and there to lighten the tale, and told in a way that will be appreciated by veteran movie goers.<br><br>I wish I had more to say about it, but it's been so long since I saw it last that I can't add too much more to the other positive comments, other than to say that I want to see it again :-)<br><br>A top notch cast delivers good funny performances for a film making style that's been long forgotten, and wrongfully shelved. One can only hope that a DVD of this film will be forthcoming: A good one from the original negative, letterboxed, and in 5.1 Dolby, and not some low-cost quick-to-market, full-screen, hack cine-transfer job.<br><br>DVD RE-SCREENED; \"There is no Monica you dumb...*%&amp;$@!!!\" I bought the DVD when it came out, and enjoyed reviewing this American remake of a racy Brazilian \"sex comedy\". Again, I don't have too much more to add to my review or anyone else's other than it was a film made at a different time for a different audience. Today's romantic comedy's geared for adult teenagers are, by comparison, embarrassing. But that's just me.","user":"Blueghost","rank":[13,14]},{"title":"Kiss Me Goodbye","rating":7,"date":"7 May 1999","review":"Very attractive cast propels this comedy/fantasy about the ghost of a deceased husband (Caan) who pays a visit to his widow (Field) as she's about to remarry (Bridges). Robert Mulligan's touch of genius is at work one more time. The story may be a bit strained at times, but the results are satisfactory altogether in the end.","user":"Coxer99","rank":[8,8]},{"title":"Very enjoyable","rating":8,"date":"11 February 2002","review":"A light movie that is a lot of fun to watch, 'Kiss Me Goodbye' is also not the first movie you think of when doing a filmography for Sally Field, Jeff Bridges or James Caan.  But they are all perfectly cast in this comedy that has a lot going for it. <br><br>James Caan plays Jolly, the Bob Fosse-like (well, without the cigarettes and open heart surgery) and deceased husband of Sally Field, who reappears the week Field is marrying a 'nerd', Jeff Bridges.  Only Sally can see or hear James Caan so it sets up a lot of comedy, most of which is hilarious. Everyone liked Jolly, alot, including Sally, and Jeff is less likable.  He's like Cary Grant in 'Bringing Up Baby', down to the research job at the museum doing what Claire Trevor calls 'digging up dead people.'<br><br>Stand-out scene - the three of them going to the country for a relaxing weekend, and all hell breaking loose.  <br><br>Claire Trevor is funny as Sally's domineering mother, Paul Dooley is his usual dependable self as a former priest who gets involved when Bridges decides to 'exorcise' the ghost of Jolly, and Mildred Natwick is the owner of the country bed-and-breakfast.  <br><br>Touching at the end, funny most of the way through...8/10.","user":"Boyo-2","rank":[16,18]}]