[{"title":"John Ford's First Epic Look At American West","rating":10,"date":"13 December 2000","review":"A young boy grows to fulfill his murdered father's vision of seeing THE IRON HORSE, the mighty transcontinental railway, stitch the country together, binding East to West.<br><br>Bursting with excitement &amp; patriotic fervor, THE IRON HORSE is the film which put young director John Ford on the cinematic map. He brought together all he had learned from years of making shorter, smaller films and he produced a product which heralded his enormous contributions to sound films in the years to come. This is a `director's picture' in that the stars, as good as they are, are almost negligible; what was important here was Ford's vision &amp; his ability to place it before the audience. Indeed, he does not even bring his leading man (George O'Brien) on screen until 45 minutes into the story - a shortcut to disaster almost anywhere else.<br><br>(In all fairness it should be noted that O'Brien, handsome &amp; strong-limbed, does very well as the gentle hero. He would find similar roles in other epic films of the decade. J. Farrell MacDonald, as Irish Corporal Casey, is the prototype for many comically eccentric fellows who would appear in other Ford westerns.)<br><br>The film often takes on the aspects of an ancient newsreel. Cattle drives, Indian attacks &amp; endless track laying all look utterly real. Particularly fascinating is the depiction of the dismantlement of the end-of-the-track town, so that not even a dog is left, as it is moved many miles further on to the west. This type of arcane information is what makes watching very old films so enjoyable.<br><br>THE IRON HORSE represented the largest migration out of Hollywood for location shooting up to that time. Nothing like this had been attempted before, so Ford &amp; his lieutenants were forced to make up the rules as they went along.<br><br>Hiring a circus train, the small army of extras arrived at the subzero Nevada location in January of 1924. The conditions which greeted them were authentically primitive. It was so cold, the extras quickly began sleeping in their costumes. Finding the train to be flea ridden, they moved into the sets and began living exactly as the characters they were portraying. The female extras especially suffered from the rugged conditions. A frontier mindset seemed to take over many of the cast &amp; crew; the circus tent, which doubled as both the movie saloon and the crew's commissary, eventually had to have the catsup bottles removed from the tables to discourage the many fights which kept breaking out.<br><br>Authenticity found its way into the movie in other, more positive, ways. Several of the elderly Chinese extras, representing laborers on the Central Pacific, had actually worked on the real McCoy sixty years previous. They came out of retirement to appear in the film &amp; enjoyed themselves immensely. Ford also managed to locate the two original locomotives which met at Promontory Point, Utah, in 1869 and reunited them for the film's climax.<br><br>Composer John Lanchbery has contributed a splendid soundtrack to the restored video version, incorporating several contemporaneous tunes of the period. It would be intriguing to double bill THE IRON HORSE with Cecil B. DeMille's UNION PACIFIC (1939), which tells the same historical story, but with a completely different tack &amp; set of fictional characters.","user":"Ron Oliver","rank":[26,27]},{"title":"Where East Meets West","rating":9,"date":"8 October 2005","review":"THE IRON HORSE (Fox, 1924), directed by John Ford, is an story set during the middle of the 19th century America about the building of the first Transcontinental Railroad. One of the very best examples of a lavish scale western produced during the silent era, said to be the answer to Paramount's earlier production of THE COVERED WAGON (1923), but most importantly, the first major project for Ford after nearly a decade in the director's chair to now gain the recognition he truly deserves.<br><br>The story opens with a prologue set in Springfield, Ill., 1853, revolving around Davy Brandon, first as a youngster (Winston Miller) with deep affection towards Miriam Marsh (Peggy Cartwright), his childhood sweetheart. Davy's father (James Gordon) is a surveyor who dreams about the crossing of the western wilderness, while Miriam's father, Thomas Marsh (William Walling), is a skeptic. However, one of the citizens, Abraham Lincoln (Charles Edward Bull), believes in this man's theory and knows he'll accomplish his means. Setting out to accompany his father on a mission to survey an appropriate route through the mountains for the coming railroad, Davy bids a tearful farewell to Miriam. During their westward journey, Davy, who is hidden away because of foreseen danger, witnesses the brutal killing of his father by a white man dressed up as an Indian whose only identification if the loss of a thumb and two fingers on his right hand. After burying his father, Davy is taken in by a passing scouting party. A decade later, 1862, Abraham Lincoln is president of the United States; Davy (George O'Brien) is a Pony Express rider out to fulfill his father's dream leading into the building of the Transcontinental Railroad; and Miriam (Madge Bellamy), now engaged to Peter Jesson (Cyril Chadwick), an Eastern surveyor working for her father actually working for Deroux (Fred Kohler), the richest landowner, who stands to profit if the railroad goes through instead of through the pass. After being reunited with Miriam, Jesson finds himself in stiff competition. The two men become bitter enemies, especially after Jesson's attempts in doing away with him. Matters become complex until the golden spike gets hammered into the rail on that historic day of 1869 as east meets west through the continental railroad.<br><br>In the supporting cast are Gladys Hulett (Ruby); Jack O'Brien (Dinny); three musketeer pals of J. Farrell MacDonald (Corporal Casey); Francis Powers (Sergeant Slattery); and James Welch (Private Schultz), as well as historical figures of Buffalo Bill Cody, Wild Bill Hickock and John Hay enacted by George Wagner, John Padjan and Stanhope Wheatcroft.<br><br>THE IRON HORSE (title indicating the locomotive train) plays like a D.W. Griffith production with prologue, historical figures, flashbacks and epilogue, and like a screen adaptation to an Edna Ferber novel telling its story through the passage of time, along with soap-opera ingredients (complicated love triangle), but no usual conclusions of central characters going through the white hair and wrinkles aging process. Overall, this is John Ford's storytelling, cliché as it may be, placing fictional characters against historic setting, along with the oft-told murder-mystery subplot of a son out to avenge his father's killer, a historical movie that's become an important part of cinema history. Ford, the future four time Academy Award winning director, with a handful of motion pictures to his credit, best known for westerns, would provide similar themes in his future film-making. As popular as THE IRON HORSE was back in 1924, it's amazing that Ford didn't attempt doing a remake, especially in 1939 when westerns reached it peak of popularity. It took Cecil B. DeMille to attempt a similar story with UNION PACIFIC (Paramount, 1939) starring Barbara Stanwyck and Joel McCrea. Like THE IRON HORSE, UNION PACIFIC, which tells its story in over two hours, features villains, Indian massacres and thousands of extras. <br><br>George O'Brien, a rugged actor, was an ideal choice for the role of Davy Brandon. Although he worked under Ford's direction numerous times in latter years, and showed his capability as a dramatic actor in F.W. Murnau's SUNRISE (1927), he never achieved major stardom. He did work steadily mostly in \"B\" westerns through the early 1950s. Co-star Madge Bellamy offers her typical heroine performance, caught between two men who vie for her affection, but is far from being a strong character. While the acting overall is satisfactory, from today's viewpoint, some heavy melodramatics as the method of fainting by youngster Davy after witnessing his father's massacre, or Bellamy's performance in general, might provoke some laughter. Scenes such as these can be overlooked by great location scenery as Monument Valley, a race against time and action scenes typically found in Ford westerns.<br><br>Television history to THE IRON HORSE began when it became one of the movies from the Paul Killiam collection to air on public television's 13-week series of \"The Silent Years\" (June-September 1975), hosted by Lillian Gish. In her profile about THE IRON HORSE (accompanied by an excellent piano score by William Perry), Gish talks about its location shooting in the Nevada desert, the use of 100 cooks to feed the huge cast, and 5,000 extras consisting of 3,000 railway workers, 1,000 Chinese laborers, many horses and steers. Decades later, THE IRON HORSE made it to the American Movie Classics (1997-1999) and Turner Classic Movies (TCM premiere December 9, 2007 ) accompanied by orchestral score with 15 minutes of additional footage as opposed to the 119 minutes presented on both \"The Silent Years,\" and the Western Channel in 2001. Distributed to home video Critic's Choice in 1997, availability on DVD came a decade later.<br><br>THE IRON HORSE may not be historically accurate as promised through its opening inter-titles, but it's sure an ambitious John Ford production to still be entertaining today. (****)","user":"lugonian","rank":[16,17]},{"title":"One of the great, early Westerns, still recommendable.","rating":3,"date":"3 August 2002","review":"The Iron Horse was both Ford's 50th film and one of the most important silent Westerns. Until the 29-year-old director came to work on this epic project, he had gradually built up an expertise and standing with a number of smaller productions, many of them oaters, few of which survive today. This 1924 film consolidated his talent and gave him a creative reputation which lasted until he was deemed 'old fashioned' at the start of 1950s.<br><br>It's a story that characteristically combines the grand with the intimate, through a celebration of the coming of progress. The Iron Horse's narrative covers such issues as the Civil War, Lincoln's presidency, the Indian wars, Buffalo Bill, Wild Bill Hickok, ethnic relationships, cattle trailing and railway history in a span of little over two hours - all with an absence of narrative strain still impressive today. Ford's skill in marshalling many disparate elements into one large canvas, successfully orchestrating history (proudly announced here as 'accurate and faithful in every particular') is one example why he was such an exemplary Western director.<br><br>\nGeorge O'Brien plays Davy Brandon, whose father dreams of rails eventually crossing the continent. After setting out for the west, Brandon senior is killed by the evil Two Fingers (Fred Kohler). Years later Davy sets to work for Union Pacific, scouting for a short cut through Cheyenne territory that will ensure the success of the transcontinental link up. Aiming to prevent this are the dastardly forces of corrupt surveyor Jesson (Peter Chadwick) and half-breed Baumann (Kohler). Meanwhile, Davy discovers his childhood sweetheart Miriam (Madge Bellamy) is engaged to the disreputable Jesson. The rest, as they say, is history. <br><br>Throughout Ford's career he was wont to use symbols to indicate the coming of progress in the West. In My Darling Clementine (1946) it was the social dance at the unfinished church. In Liberty Valance (1964) the desert flowers on Tom Doniphon's (Wayne's) coffin. The Iron Horse is dedicated to George Stevenson and, not unexpectedly, here it is the railway itself that represents the growth of civilisation. Its ultimate success as an enterprise is less that of a profitable commercial venture than of beneficial ideal, as visualised by President Lincoln. <br><br>Amidst the idealism of railway expansion, Ford includes the broad comedy common to many of his films - the Irish and Italian labourers continuing a friendly rivalry. Their work songs, spelt out in caption cards while they construct the track, punctuate the action, creating convenient breathing spaces between more dramatic scenes. The 'three musketeers' - as Slattery (Francis Powers) Casey (Farrell Macdonald) and Schultz (Jim Welch) are called - have their own amusing scenes based around some frontier dentistry. But essentially they function as a kind of comic chorus, their earthy, ethnic interjections keeping the film's idealism down to earth. There's an element of this too in Judge Haller (James Marcus), a Roy Bean character, whose dispensation of frontier justice is as arbitrary as it is often inspired. <br><br>Least convincing to the modern viewer is the character of Miriam, whose simpering virginity comes closest to the two-dimensional women found often in the world of D.W. Griffith's melodramas. Her condemnation of the clean living Davy's visit to the saloon, immediately after being with her (where, ironically, he has gone to patch things up with Jesson) seems almost wilfully annoying; ludicrous even, given the rough environment in which she finds herself. But that her heart belongs to the muscular scout is never in doubt, a fact made clear by their rapport in the opening scenes set in their childhood. In addition, once she has gained womanhood, her pending relationship with Jesson is condemned by implication as President Lincoln looks askance at their match. The same dramatic shorthand is employed through the palpable tension when Davy and Baumann first meet, an impending confrontation telegraphed as sharply as any message sent by mechanical means. <br><br>There is also a intense psychological antipathy between Davy and Jesson, notably in the standout barroom scene. In these moments O'Brien plays well, almost making one forget Ford's great films with Wayne to come. But, by necessity, this is principally a film of the great outdoors where Ford excels in portraying man battling against external obstacles, rather than facing internal stress. In his Stagecoach (1938), which was to later revitalise the genre, it would be a different story, one of comparative intimacy. Here, the heroes and villains who react together along the railroad work out their differences in the open air with grand gestures, fisticuffs and work songs, rather than anguished conversation. And it is these epic scenes that remain in the mind when the film is done. The attack of the Indians on the supply train, their furious shadows thrown against the sides of the carriages; the snow swept work camps; the many panoramas of frontier life; Davy and Bauman's final conflict in the sleeper 'house'; the final meeting at Promontory Point for the 'wedding of the rails', and so on.<br><br>\nSuch visual grandness does not preclude economy however. One only has to think of hurriedly arranged burial of 'the old soak' and the marriage held at North Platte, or the establishing scenes at the beginning of the film, to see how Ford was fully in command of his material, switching scale and focus with ease. <br><br>With the joining of the two railroads and the closing of the bond between Miriam and Davy, there is a natural conclusion to both the human, and the mechanical elements of the story - Davy actually waits until the final spike has been driven home before committing himself to her side. Thematically, Fritz Lang was to acknowledge a debt to Ford's classic in his Western Union (1938), which has a related story, but his film is the slighter of the two and less innocent. Ford's epic remains the definitive telling of these particular events and its authenticity can still be recommended today.","user":"FilmFlaneur","rank":[24,28]}]