[{"title":"Good Old Fashioned Grindhouse Fare, But Could Have Been So Much Better","rating":6,"date":"19 February 2010","review":"The Evil That Men Do is at once typical and atypical Charles Bronson 1980s fare. On one hand, it contains the grind house trademarks of graphic violence and gratuitous sex that characterized most of Bronson's eighties output. At the same time, it touches on serious political themes that most of his other action films shied away from.<br><br>In particular, the film examines the torture being carried out by right wing Latin American regimes during that decade with tacit American support. Unlike most of the right wing vigilante films that Bronson appeared in, this film takes a subtle, if not particularly well explored left wing tack.<br><br>The film's violence will not disappoint action or gore fans. The opening torture sequence, reportedly heavily cut, is still quite gruesome. Furthermore, the villains meet some of the nastier deaths in action film history, particularly in the bloody climax. The Columbia / TriStar DVD release renders all this in a beautifully restored print, making it look like it was released yesterday, rather than 26 years ago.<br><br>However, one cannot help but wish their had been a more open examination of the political themes that underlie the film, particularly the American involvement in human rights abuses. The film itself begs for a remake, focusing on torture during the War on Terror.","user":"TheExpatriate700","rank":[12,13]},{"title":"The Evil That Bronson Does!!!","rating":8,"date":"22 July 2007","review":"J. Lee Thompson's \"The Evil That Men Do\" casts tough guy actor Charles Bronson of the \"Death Wish\" franchise as a no-nonsense professional killer who reluctantly comes out of retirement on his desert island to eliminate an individual who specializes in human torture. Dr. Clement Molloch (Joseph Maher of \"Heaven Can Wait\") interrogates and tortures prisoners for Third World Latin American dictators. The villain's surname 'Molloch' is a variation of the word 'Moloch,' an Old Testament god of the Ammonites and the Phoenicians to whom children were sacrificed by burning. The Molloch here doesn't torture children, but he is appropriately nefarious when he makes his adult victims suffer. Unquestionably, the evil doctor is a human rights violator like few you will ever see in movies. The scene at the outset of the action where his men and he attach electrodes to the nipples and genitals of a highly respected journalist Jorge Hidalgo (Mexican actor Jorge Humberto Robles) and gives him bursts to electricity to learn what he knows is pretty strong stuff even for an R-rated movie. Mind you, Thompson doesn't show the devastated areas, we simply see a completely nude man hanging in a sling with the wires trailing from his chest and pelvis. Dr. Hector Lomelin (Jose Ferrer of \"The Shrike\") visits Holland (Charles Bronson) on his island, where he resides in a kind of self-imposed exile and asks him to kill Molloch. Holland is saddened by the news of his journalist friend's death and then he watches several videos that Lomelin provides of interviews with Molloch's victims and hears about the man's horrendous crimes against mankind. Nevertheless, Holland refuses to accept Lomelin's offer until a later scene when he shows up unexpectedly at the professor's class room.<br><br>Nothing gets in Holland's way once he takes the job. He refuses to work for pay. He arranges for Lomelin to get him a woman and a child to pose as his wife and daughter so that he will attract less attention from the locals. In one amusing scene, Holland and his faux wife Rhiana Hidalgo, wife of the death journalist (Theresa Saldana of \"Defiance\") enter a dive of a bar. While Holland gets their drinks, an enormous Hispanic guy decides to join them and fondle Rhiana. Holland surprises this gigantic hombre by knocking the table out of the way and seizing the dastard by the testicles and crushing them in the iron grip of his fist. Of course, this hulk crumples into a huddle of arms and legs at Holland's feet and offers no further interference. This display of self-defense attracts the attention of Molloch's bodyguard, Randolph (Raymond St. Jacques of \"Cotton Comes to Harlem\") and he joins our hero and heroine. Shrewdly, Holland tells Randolph that Rhiana and he are looking for someone else to have sex with and the deal is sealed. They go back to Holland's motel and Holland immediately kills Randolph with a knife and hangs him upside down to bleed his corpse out in the shower.<br><br>\"Guns of Navarone\" director J. Lee Thompson pulls no punches in this hard-as-nails thriller with his depiction of either Molloch's savage torture techniques or Holland's icy methods of disposing with his antagonists. Consequently, \"The Evil That Men Do\" still retains its edgy quality some twenty years after its initial release. On the other hand, Thompson doesn't resort to sensationalism for the sake of sensationalism, and this thriller is fairly straightforward without any outlandish or unbelievable scenes. This is one reason that I think makes it so good. The closest that you get to exploitative sleaziness involves Molloch's evil sister Claire (Antoinette Bower)who is a lesbian. Another scene has our hero wielding a mean pump action shotgun with deadly proficiency. Although he was past his prime at this point in his career, Bronson is nevertheless in fine form as the gimlet-eyed, tight-lipped assassin. The grim finale at a mining compound where Molloch gets his comeuppance from past disfigured victims resembles the ending of Todd Browning's horror classic \"Freaks.\" The miners surround Molloch's car and shove long spikes through it with the villain trapped in the back seat with nowhere to run. The wild thing is that Joseph Maher is totally convincing as the heinous villain, but as an actor he didn't specialize in villainous roles. Theresa Saldana is convincing as Jorge's wife who accompanies Holland on his mission. People who prefer their crime dramas with a hard boiled intensity will savor this grim saga. Ken Thorne's offbeat music is a plus.","user":"zardoz-13","rank":[12,14]},{"title":"Misunderstood movie","rating":8,"date":"16 January 2008","review":"The person who wrote the previous comment about this movie is missing the entire point of this movie! Yes, this movie was basically made for the viewers to grow hate towards \"El Doctor\" and be really happy at the end when Charles Bronson wins and the village folks who the doctor has been torturing over the years come out, corner him and simply tear him apart.<br><br>Sure the movie is very graphic and the writers could have written a better script; but, the way the previous comment was written it leads me to believe the writer should stick to watching Disney or Pixar movies only! Guess what? The type of torture that is shown in the movie is VERY REAL and being from Central America myself I have heard the horror stories about real life sadistic bastards.<br><br>I see the movie in a different way, an educating way to let the rest of the world know what does REALLY go in my poor countries and although in real life there is no Hero like Charles Bronson's character, at least the movie allows us to escape and dream of these sadistic bastards getting what they truly deserve in the end.","user":"alexp-keaton1234","rank":[21,29]}]