[{"title":"A rough, tough and ruthless film...","rating":7,"date":"21 May 2005","review":"As long as there are criminals, films will be made about their exploits.. Though what we call \"a gangster film\" in the 1970's bears little resemblance to the classics of the 1930's, it is still a film about big-time criminals and organized crime Only the baddies have been changed to assist identification <br><br>\"Badge 373\" is a case in point It is a simple story, based on the exploits of Eddie Egan, a real New York policeman who also, for good measure, plays a part in the film<br><br>Ryan, a New York detective, is suspended for causing the death of a Puerto Rican dope runner Taking a job as a bartender, he learns that his old partner on the force has been killed Then, with the law against him because he is no longer a policeman, and harassed also by the villains, he sets out to avenge his friend's murder<br><br>The twist is that these villains are no longer liquor and heroin smugglers, big-time gamblers or bank robbers They are Puerto Ricans Some of them are men who seek to foment a revolution on their island; others, led by a sinister figure in dark glasses called Sweet William, are the crooked element who will supply the necessary guns and ammunition Ryan, played by Robert Duvall, wages his own solitary war against both parties<br><br>It's a rough, tough and ruthless film, in which Duvall is as brutal as his adversaries; towards the end, he callously chops down a night watchman in order to gain entrance to the Brooklyn docks In fact, it is very difficult to have sympathy for any of the characters in \"Badge 373.\" Perhaps this is intentional Perhaps cinema audiences of the future will not require to identify sympathetically with the characters they watch<br><br>Certainly, this was true in \"The French Connection.\" No one could deny that it is a tremendously exciting film ... but could anyone have a feeling of sympathetic identification with the central cop character? Gene Hackman stirred the blood, but it was difficult to be concerned about whether he lived or died","user":"Nazi_Fighter_David","rank":[22,26]},{"title":"Gritty, grim character study of a suspended policeman bent on vengeance.","rating":28,"date":"28 May 2009","review":"There is only a certain window of time (around the late 60s to the early 80s) that a police film of this type would have been made with the kind of gritty, deliberately ugly, murky, downbeat sort of verisimilitude that's on display here. Before that, studio craftsmanship and censors would have prevented it and after that the gaudy style of the 80s and then the refusal to accept \"under the top\" action and effects made it impossible. Here, Duvall plays a paunchy, tough, New York City police detective who is suspended following the questionable death of a suspect who fell from the top of a building during a drug raid. Soon after, his partner is killed and, despite not officially being on the force, Duvall sets out to determine who has murdered the man, who may or may not have been on the take. His investigation takes him into a world of revolutionary Puerto Ricans who are interested in rising up against the oppression of their \"rulers,\" the United States. Meanwhile, his new lady love Bloom is having trouble accepting the dangerous, rough and tumble lifestyle of Duvall. With the occasional aid of his superior Egan (whose real life exploits as a cop provided the basis for this and other stories), Duvall winds his way through a minefield of murder, hate, gunrunning and racial unrest (with antihero Duvall himself portrayed as intolerant of Hispanics and pretty much any other minority.) Duvall, gut on display and frequently disheveled, is excellent in his portrayal of this common, insensitive, driven man. It's a warts and all performance in which he lets loose with any variety of foul language and slurs with little regard for his own vanity. Nonetheless, the audience is on his side because the enemy kills anyone who takes his part. Bloom hasn't got a large role and it isn't really a rewarding one, but she manages to make the most of it. Darrow makes a late film appearance as a criminal kingpin and, for some reason and to his detriment, wears dark glasses for 98% of his screen time, day or night. Egan is hardly a stunning actor, but does help in the way of authenticity as he sprang from this environment prior to working in films. Few other performers make a particular impact as the film is mostly concerned with Duvall and his quest through the mire of a dank NYC, though fans of \"The Electric Company\" may be interested in seeing Avalos as an arrestee trade epithets with Duvall. The city as presented here mirrors the dreary, dirty New York of so many movies from this era, something that prompted the city to reinvent itself as much as possible and take a turn towards a cleaner and more user-friendly town. Enough can't be said of the bleak, drab atmosphere (offset by the sunny and green surroundings of a cabin that Duvall retreats to after being assaulted.) There's a set piece, involving a wild chase in which Duvall commandeers a public bus in order to escape a gang of thugs, which is audacious and realistic at the same time. The same type of scene would today be shot with frantic editing, overwhelming speed and lots more destruction, though it's far more believable the old way. The script is riddled with (now) politically incorrect putdowns and plentiful foul language (kudos to TCM for recently airing the film unedited, albeit overnight!), which may offend some viewers, but American films were enjoying a new freedom in those and other areas and the envelope was forever being pushed. Hardly a perfect film, it is at least a thought-provoking one. There is a rally included in which real-life activist Luciano presents a diatribe against Puerto Rican oppression and raises some interesting questions (it's a shame, though, that so many people portraying Puerto Ricans in this movie keep pronouncing it the incorrect \"Porto\" Rico, which is jarring to those who know better.)","user":"Poseidon-3","rank":[7,8]},{"title":"Goofy rather than gritty","rating":4,"date":"6 August 2016","review":"Being a huge fan of gritty New York films from the 70s and 80s, I was quite excited to chance upon this film. Starring Robert Duvall, a stalwart of this era, and involving an angry cop in 70s NYC, I had my aims set high. Unfortunately, aside from some nice footage from the era, this felt to be a waste of time.<br><br>Robert Duvall is a racist, grizzled cop, suspended from the force after a suspect falls off a roof whilst escaping arrest. Following his suspension, his partner Gigi turns up dead in Brooklyn with his throat cut. Turns out that Gigi had been doing some sneaky deals relating to a shipment of arms going to Puerto Rico.<br><br>Badge 373 was notable for upsetting some of the Puerto Rican community, who had called for the film not to be released. Duvall's character is unpleasant, racist and not at all sympathetic, however, the Puerto Rican characters are mainly made up of hoodrats, petty criminals, crime bosses and junkie hookers, often Caucasians in brown make-up, and none at all redeemable. In the film's defence, the scene where Duvall visits a 'libra Puerto Rico!' rally does give valuable screen time to portray the pressures and frustrations that mainland US Puerto Ricans were facing at that time, and I get the feeling from this that the director did not intend to make a racist film, possibly even sympathetic towards Puerto Ricans, but just made an incredibly clumsy effort at portraying racial relations at that time.<br><br>Coming from the year that gave us Serpico and The Seven-Ups, Badge 373 also feels very dated, even in comparison to Bullitt or Point Blank some 5 years earlier. The soundtrack and Batman-style fight scenes hark back to family friendly 60s TV shows like Dragnet or The Untouchables, the bus chase scene, for some the highlight of the film was well conceived, but is just goofy in practice, more reminiscent of one of the Smokey And The Bandit films.<br><br>Badge 373 is a rather embarrassing watch, especially for Duvall who was in his prime as an actor at this time. Strictly only for genre completists.","user":"jim_skreech","rank":[8,12]}]