[{"title":"Great film, good for everyone","rating":7,"date":"14 March 2006","review":"A somewhat expurgated version of the gospel of Luke, Brian deacons version of Jesus is appealing, if somewhat un-animated. I have a great love for this film ( mainly due to the fact that it was the first film about Jesus I can remember seeing from my childhood.) Not as epic as Zeffirelli's film, nor as graphic as Gibson's, a faithful representation with only a few omissions ( I'm sure either due to budget or time constraints). the acting is at times somewhat melodramatic, but that is part of the charm of this film. the cinematography is not ground breaking but certainly serves its purpose and doesn't overshadow the story, and really thats one of the best things about this film, nothing in it overshadows the story as a whole.","user":"Beyfenn","rank":[17,20]},{"title":"Jesus came to all of us","rating":10,"date":"10 July 2006","review":"To write about such a delicate film as about Christ Himself in this age of an extreme political correctness is a tough task. This work appeals immensely to all the believers and works out fine to convert all the newcomers. To the non-believers, this work will seem dull and boring, but then, let's be straight - this is the most accurate, the most precise and elegant retelling of the Gospel According to Luke. Since I am a Protestant Christian myself, I must say that this film really did help me to understand who Jesus is and what He was doing among us the people on Earth. The play of Mr. Deacon is very good, he does an extremely difficult work and he does it well. I remember my eyes were wet with tears during the Crucifix scene, and then my heart leaped violently with joy during the final scenes. The film is very well done, by seeing the sandy dusty plains and hills of Israel, you feel the smell of age, you do believe in the truth of the plot and you do follow the film scene by scene. A very serious and thoughtful work.","user":"denis888","rank":[25,31]},{"title":"The Life of Christ as recorded in the Gospel of Luke","rating":10,"date":"25 January 2005","review":"This was, I thought, the best cinematic summary of the life of Christ I have yet seen. Brian Deacon, who portrays Jesus, looks the part and speaks with quiet authority. His interaction with children in the movie gives a moving picture of the tenderness of Christ. The words of Christ are given in modern translation making it easy for the viewer to understand the language. Simon Peter (Niko Nitai) looks the part and acts it well. The movie allows about the same amount for the last week of Christ's life as does the gospel (about 25%). While not a perfect movie (nothing on earth is perfect), this is a delightful one. If you are looking for an accurate picture of Christ which accords well with the Bible, this is it!","user":"johnjhafs","rank":[23,30]}]