[{"title":"What a groovy movie!","rating":6,"date":"10 February 2008","review":"Sumuru (Shirley Eaton) is a woman bent on world domination. Her plan is to have her army of women get close the world's most powerful men, kill them, and assume their power. But standing in her way are two secret agents  Agents Tommy Carter (Frankie Avalon) and Nick West (George Nader). They convince a couple of Sumuru's followers to come over to their side before leading a raid on her island. But will they get Sumuru? <br><br>The Million Eyes of Sumuru is just quirky enough for me to really enjoy it. It's the kind of movie you can't take seriously  you have to go with it. I just love these 60s spy-type movies with their armies of scantily clad women, secret island liars, and groovy secret agents. What an awesome time it was! And, the fact that The Million Eyes of Sumuru was shot in China with a cast that includes Eaton, Avalon, Klaus Kinski, Maria Rohm, and Wilfrid Hyde-White (of all people) only adds to the already bizarre feel of the movie. Movies like this may not be for everyone (just take a look at the IMDb rating), but for me their just too much fun.<br><br>I would love to see a cleaned-up, legitimate, Region 1 release of The Million Eyes of Sumuru. I'm convinced I would have rated the film higher than a 6/10 had I not been watching the MST3K version of the movie recorded off of Minneapolis public access television in the late 1980s. The Million Eyes of Sumuru deserves better than that.","user":"bensonmum2","rank":[9,10]},{"title":"Not without its moments.","rating":6,"date":"1 September 2018","review":"Shirley Eaton, who earned some screen immortality as the babe covered in gold in \"Goldfinger\", plays the title Sax Rohmer character in this patently ridiculous, very tongue-in-cheek international-intrigue action flick. Teen idol Frankie Avalon and George Nader of \"Robot Monster\" infamy play some sort of special agents who must foil the efforts of our villainess, a feminist looking to replace world leaders with her ladies. She has the whole shebang: an island stronghold, secret passageways, an armoury, etc.<br><br>Featuring tons of gunfire but very little blood, \"The Million Eyes of Sumuru\" is a hoot and a half. You realize very quickly that it's not meant to be taken seriously, with its goofy performances and acres of really dumb dialogue. For this viewer, it never really induced belly laughs, but it put a smile on his face a number of times. Certainly it's hard to go wrong with a bevy of sexy female baddies. The sensual Maria Rohm got an \"introducing\" credit here, playing the role of Helga, a girl who's not too far gone, and is able to rejoin the forces of good. Nader and Avalon are amusing, with Nader making for a horrible dime store version of James Bond - but a very upbeat one. Special guest stars Wilfrid Hyde-White and Klaus Kinski are most welcome; the former almost always has a smile on his face, and Kinski is priceless as a leader named \"Boong\". But the performer to really see this movie for is Eaton, who does like she's relishing this moment in the spotlight.<br><br>The exotic settings are of course a plus (this is set in some fictional Asian locale, but was filmed in and around Hong Kong), and the picture is gorgeously photographed in 2.35:1 by John von Kotze.<br><br>One thing must be said before this review concludes: this script, as silly as it is, includes some surprisingly \"meta\" moments for 1967.<br><br>Eaton reprised her role in \"The Girl from Rio\", which was directed by Euro-cult favourite Jess Franco.<br><br>Six out of 10.","user":"Hey_Sweden","rank":[5,5]},{"title":"A beautiful female version of Fu Manchu attempts to take over the world","rating":8,"date":"15 March 2006","review":"Just as Prehistoric Women is the ultimate vehicle for Martine Beswick and the favorite film of her cult following, so is this the ultimate for Shirley Eaton - and many of us who are Eaton cultists are also Beswick devotees, as one was a brunette and the other a blonde, but all difference ends there - slinky, sophisticated English lovelies who in the 1960s each had a second female lead in a bond film (Beswick in Thunderball, Eaton in Goldfinger) and each went on to play deliciously decadent bad girls, particularly in their best remembered films. Here's the pity - while Prehistoric Women can easily be picked up on video or DVD, Su Maru remains difficult (to say the least) to find. Even among those semi-secretive distributors of great-bad B movies on the Net. Anyway, the old Sax Rohmer story is updated and given a 60s feel, with George Nader as a flimsy James Bond wannabe and Frankie Avalon (?!), fresh from the Beach movies, as his sidekick. (By the way, about 20 years ago, Avalon swore to me that Eaton was the most beautiful single woman he'd ever seen in his life, and that as incredible as she is on film, cinema doesn't do her justice - looking at her in person, at least back then, made you want to pass out. I believe him!) She's the leader of an all (gorgeous) girl conspiracy to take over the world, and at one point hangs George Nader in a jail cell and whips him. (Leather whip, of course - this may be where 'mainstream kink' all began). Each of her associates is a knockout, all wearing black satin and leather costumes, and they seduce then kill men. This is a decidedly anti-feminist vision, made perhaps in response to the then-recent publication of Betty Friedan's The Feminine Mystique, which kicked off the modern woman's movement. Lots of near nudity, as this was made just before the ratings system fell apart and full frontal would be allowed about two years later. A tease, but lots of fun, very campy, and played with tongue firmly in cheek.","user":"dougbrode","rank":[22,31]}]