[{"title":"Great old cowboy movie deserves resurrection.","rating":10,"date":"24 March 2004","review":"It is just shoddy handling that has made this splendid entertainment drop out of sight. It should have gone on accumulating admirers down the years.Director George Marshall missed out on attention too, though this film, DESTRY RIDES AGAIN and his succession of Glenn Ford films have a consistent, light handling that shows he was one of the best people in this field. Let's throw in the fact that Broderick Crawford has his biggest pre ALL THE KING'S MEN role. He gets as much screen time as top billed players Scott and Francis and acts them off the screen. He's terrific, in a straight role, as the chief Dalton Brother.<br><br>The film has the standard ingredients - shoot ups, chases, western timber town atmosphere, over-laid with the usual plot elements about the wrongly persecuted family. What isn't expected is the expert pacing, emphasis and the humor - the lynch mob bursting into the jail to find the whole gang waiting for them, guns drawn, is classic. The film also has one of the best filmings of the Yak Canutt routine of falling under the runaway coach horses. A class act.","user":"Mozjoukine","rank":[22,25]},{"title":"Have fun with the Daltons","rating":8,"date":"10 February 2005","review":"Most films about outlaws made in the fifties and before had in common a certain sadness, because you knew from the beginning that the outlaw hero was doomed. You would suffer with him, knowing there was no hope, that he would die at the end. This film has a different approach, the hero here is Randolph Scott and he is not one of the Daltons, just a friend of them, he is even a rival of Bob Dalton (Broderick Crawford) in relation to Julie King (Kay Francis). So the whole fun of the film is on the great action scenes where the Daltons do one incredible thing after another. They just don't stop, they go from a bank robbery to a train robbery where the law is waiting for them inside the train. Mary Gordon as Ma Dalton is remarkable. The fact that you can follow the Daltons without getting emotionally involved, makes this an unusual, enjoyable western, more cheerful than most of its kind.","user":"tmwest","rank":[13,14]},{"title":"Early western about the bad guy myth - with good stunt work!","rating":6,"date":"25 June 2004","review":"Another new DVD release from the vaults of Universal that's about as action-packed as JESSE JAMES (1939), which also came out around the same time. This too, carries the same western myth that Hollywood has about certain outlaws. If society had only treated them fairly, then they wouldn't have become outlaws in the first place.<br><br>The Daltons have been railroaded off of their farm and turned into outlaws by greedy land speculators who manipulate the law to suit their own ends. So begins the chase out of the courthouse, through the woods and onto a moving train in order to make good their escape. It even has some good Yakima Canutt stunt work involving a stagecoach robbery. <br><br>Randolph Scott and his love interest Kay Francis really are on the sidelines as those who are siding with the Daltons in spirit, even though they aren't out robbing bank and trains with them. They're really are only supporting players here even though they headline in the credits. <br><br>The real star is Broderick Crawford who despite his New York Bronx accent, really shines here as the lead Dalton, even scene-stealing away from Brian Donlevy who takes a back seat. This movie is Crawford's show, no question about it. <br><br>Director George Marshall has done better with oaters like DESTRY RIDES AGAIN (1939) and Texas (1941), but this film is no slouch, either. There's not a lot of deep plot characterizations but if you want 40s action that moves along pretty nicely, then you can't go wrong here.<br><br>6½ out of 10","user":"westerner357","rank":[13,15]}]