[{"title":"Not NEAR as bad as all these comments","rating":6,"date":"20 February 2006","review":"I don't know for sure but after reading all of these comments at least half of them seem to come from the same person using different handles. All seem to say the same thing that this tried to be a Top Gun with helicopters. I really didn't see any comparison to Top Gun whatsoever. No more than there were people flying and there was a love story. Someone mentioned the Iron Eagle series. If one copied the other it was probably Top Gun copying Iron Eagle Since Iron Eagle came out 3 - 4 months earlier. <br><br>I just got finished watching this movie Which I saw originally on NBC. <br><br>I thought originally that this was a Made for TV movie for some reason but I guess after reading here that it was put out at the theaters. I would have loved to have seen it on the big screen but admit I would not want to pay 7 dollars to see it. IT still rates better than 1 or 2 stars and all the bad insults it is getting here. I agree with one of the people that posted here that it would go great as a \"Movie for Guy's who like movies\" As a guy I love movies with action. I am not in the army and know a \"Little\" about the equipment. I am not a fighter pilot though and am not in the military. As a civilian I love this movie as an action movie. If I wanted to see realistic and authentic representations of Millitiary equipment I'll go to the History Channel. If I wan't an action movie with just the right amount of comedy and romance I'll go see fire birds again.<br><br>Is it realistic? NO Is it fun? Yes Is it accurate? No are there some corny lines? Yeah but let me ask you this. All these people talking about Top gun being so big... how many pilots would really fly upside down and flip off a Russian and take it's picture? how many pilots would really do those kinds of fly by's and still be in the Navy? and I won't go into the corny lines from that movie. <br><br>All in all Firebirds is deserving of just as much respect based on it's merits as a fun action/romance movie as is Top Gun without comparing them to each other.","user":"theghost1","rank":[31,37]},{"title":"i was entertained","rating":6,"date":"8 July 2008","review":"i actually enjoyed this movie,which is basically Top Gun with Apache helicopters.i don't think it was a great movie,but it was entertaining.sure there's some bad dialogue and the movie is pretty low key for its kind.the romance angle comes off as silly and unnecessary.but the flying sequences were OK.at least they could have been worse,and i have seen worse.the movie doesn't exactly stretch the acting talents of Nicolas Gage,Tommy Lee Jones,Sean Young,or anyone involved,for that matter.the story is not original,either.yet,like i mentioned earlier,i was entertained,and that's something.for me,Fire Birds is a 6/10","user":"disdressed12","rank":[11,12]},{"title":"Not as bad as many say","rating":7,"date":"20 April 2006","review":"Frankly, I don't really understand why people complain so much about this movie. Top Gun ripoff? Maybe - so what? As something of a \"military otaku\", I've seen both, and I'd say I know enough about the matters portrayed, as well. Is it realistic? Not really, but it does provide simple, enjoyable entertainment and great viewing experience for the aviation fan in you. The footage is indeed great.<br><br>People keep bringing \"Top Gun\" up over and over. Just as unrealistic, if not worse. I'd say, TG is far more far-fetched than Fire Birds. Why does everyone hold TG in higher regard? It came first, but... that's about it.<br><br>I hear complaints about bad acting... I can't really tell, as the Polish edition has, just like everything else, that annoying lector instead of subtitles, efficiently making all the original dialogs inaudible. The dialogs, however, seemed quite okay in translation.<br><br>Honestly, I really like this movie. It's been in my collection for a dozen years now, and I've gotten myself a DVD recently. What's important to understand, is that it's one of those movies that are NOT supposed to have a deep storyline. The plot is nice and simple, just enough to keep a story going and show off the Apaches.<br><br>I love Top Gun, for its beautiful F-14 footage and a simple story that doesn't get in the way of the viewing experience. And i don't really mind the corny lines and obvious lack of any realism. It's not a documentary, it's an action movie, one of the few of its kind (aerial action movie?) As for Fire Birds...<br><br>I love Fire Birds for the same reasons - beautiful AH-64 footage and a simple story that keeps the thing going and doesn't get in the way of what I want to see there in the first place - the Apaches in action. I don't mind the corny lines nor flaws in realism. Just like TG, it's not supposed to be a documentary. It's an action movie of the same, rare genre as Top Gun. I wish there was more of those...","user":"jquest-1","rank":[17,22]}]