[{"title":"Among the best of the Hammer films","rating":8,"date":"11 October 2008","review":"THE STRANGLERS OF BOMBAY is included on a DVD of another Hammer film, THE TERROR OF THE TONGS. Both films are very similar, though STRANGLERS is definitely the better of the two despite the absence of big name actors. This is because the film did a great job of making the sets look like India and using actors that might be Indian--whereas in TERROR, English actors almost exclusively played Chinese parts (making the film look really cheesy).<br><br>Amazingly, THE STRANGLERS OF BOMBAY is based on a true story, though I am pretty sure the names and a few details were fictionalized. In the nineteenth century, a bizarre cult dedicated to Kali (the goddess of death and destruction) was ultimately destroyed by the British in India. This cult not only adored Kali, but was dedicated to murder and robbery--and it was apparently a pretty serious threat.<br><br>The film gets very high marks for its script and direction. The film is exciting, well-paced and engaging. Despite having little of the cache of many other Hammer films (no Christopher Lee or Peter Cushing) and being in black and white, it's as solid and exciting a drama as you can find from this studio.","user":"MartinHafer","rank":[17,18]},{"title":"The Britishers succeeded in wiping out the cult, which murdered millions of people.","rating":7,"date":"21 June 2019","review":"I saw this for the first time recently cos Thugs of Hindustan aroused my interest in the Thugee cult.\nWhile Thugs of Hindustan is more of an action, adventure n comedy film, Stranglers of Bombay is a horror film.<br><br>Captain Lewis of the British East India Company, is investigating why a large number of natives are missing.\nLewis believes an organized cult group is robbing n killing people.\nThe cult is headed by a godman (George Pastel).\nThe film has lots of strangulation scenes, a nasty eye piercing scene (fans of Fulci rejoice), a snake n a mongoose fight, a glimpse of a tiger n most of all a very horrifying truth.\nThe Britishers eradicated the worst horror, Sati n gave us Indians education but our recent politicians r taking us n our country back to the medieval era with the kinda lynching prevailing in India.","user":"Fella_shibby","rank":[15,16]},{"title":"Nasty goings on in the jungle","rating":6,"date":"23 June 2005","review":"The Stranglers of Bombay was made by Hammer in 1960 and I found this quite good. It is rather violent for its time.<br><br>A series of rather gruesome murders in India turn out to be the work of a religious cult, known as the Stranglers. These people kill just for fun and they enjoy it. A British soldier based over there investigates these killings and nearly becomes a victim himself, but a mongoose appears and killing one of these animals is one of the Stranglers' tabu's. The leader of the Stranglers is killed at the end, along with most of the other members.<br><br>The cast includes Guy Rolfe (Mr Sardonicus), Jan Holden, Andrew Cruickshank, George Pastell, Allan Cuthbertson and Roger Delgado (First Man Into Space). Good parts from all.<br><br>The Stranglers of Bombay is worth checking out, especially if you are a fan of Hammer.<br><br>Rating: 3 stars out of 5.","user":"chris_gaskin123","rank":[9,10]}]