[{"title":"Fun","rating":8,"date":"27 April 2007","review":"If you like British humor, then this movie is just plain fun. Check it out on a rainy Sunday afternoon. If you like, \"Carry on\" movies or \"Those Magnificent Men in their Flying Machine's, then it might be for you. It's a typical British cheeky,sexy farce.OK it does't have the production values of the great 60's flicks, but it's still great fun. Check out the cast, Vincent Price, Barry Humphries (aka Dame Edna), Judy Greeson. A guy goes to sea and drinks nothing but champaign for a year, meanwhile the entire earths water supply is contaminated.Every guy on the planet can't, ya know. Except this guy, and off we go from there. Kinda reminds me of \"The Cave Gap\" in Dr.Strangelove","user":"crediki","rank":[10,13]},{"title":"Dire... but better than the original","rating":3,"date":"29 December 2014","review":"In many ways, watching \"Percy's Progress\" is a depressing experience. <br><br>Not only because it was a failure as a comedy, but that the quality cast it assembled and capable director/producer team had seen much better days and illustrated how much of a rut the UK film industry was in the mid-1970s<br><br>The film's humour, a predictably endless series of double-entendres, is generally tedious.<br><br>Having said that, it could've been worse and is a slight improvement on the original 1971 film, \"Percy\". <br><br>This is because \"Percy\" tried to have it's cake and eat it too; be both a low-brow sex comedy and a serious analysis of the central character's predicament (and unsuccessful on both counts). This resulted in star Hywel Bennett's sad sack performance which belonged in another film.<br><br>At least \"Percy's Progress\" doesn't pretend it's anything other than a bawdy sex comedy and is a bit livelier than it's predecessor. It's farcical elements aren't particularly funny, but at least it's trying. <br><br>And there are minor pleasures in the performances. As the central character (although actually playing a different person from the first film technically), Leigh Lawson is an improvement on Bennett and is a fairly amiable rogue of a character.<br><br>And there are inevitable minor pleasures from a strong cast, including Corbett in an enjoyable performance as a Harold Wilson- type PM. And any film that has Vincent Price in it is always raised a level or two.<br><br>But overall, apart from being curio of 1970s UK cinema, this is a film not worth seeking out.","user":"Marco_Trevisiol","rank":[2,2]},{"title":"More Percy filth","rating":4,"date":"20 June 2010","review":"'Percy' was a 1971 British comedy starring Hywel Bennett as the recipient of the world's first penis transplant. Three years later, a sequel - 'Percy's Progress' - appeared. Bennett chose not to return, so Leigh Lawson ( later to become Twiggy's husband ) replaced him. In a bad note of continuity, 'Percy' is now the name of the lead character ( in the first film, he was 'Edwin' and 'Percy' was the nick-name given to the penis ). Bennett's shy antiques dealer has become a more extroverted character, determined to sleep with everything in lipstick and a skirt. After his marriage to the lovely Moira collapses due to his constant infidelity, Percy decides to escape from Britain by taking to sea in a luxury yacht. He spends a year on his own ( how awful that must have been for him! ) before going ashore, seeking female company. He finds that a U.S. bomber has crashed, releasing into the sea a toxin called P.X.-123, rendering every man on Earth impotent. Because he had drunk nothing but Bollinger 69 for a year, Percy is unaffected. When the girls at the local bordello realise this, they pay him for his services. Percy returns to a hero's welcome in Britain, and scores of red-hot women demanding his attention...<br><br>If you think all this sounds pretty ghastly, you would be right. The first 'Percy' was a one-joke affair, but this has virtually no jokes at all. Lawson is rather good as the amiable cad, but has nothing to work with. Sid Colin can be blamed for the script, along with Ian La Frenais ( the wit of 'Porridge' and 'The Likely Lads' is conspicuously missing ). The only vaguely amusing moment comes when U.N. countries stage a televised beauty contest to find girls of all nationalities to sleep with Percy ( among them Maddy Smith ), hosted by a Terry Wogan lookalike played by the late Alan Lake. Harry H.Corbett plays the British Prime Minister, clearly based on Harold Wilson. Other big names camping it up to no avail are Vincent Price, Ronald Fraser, Milo O'Shea, Bernard Lee, Elke Sommer, Julie Ege, Judy Geeson, and Barry Humphries. Its a little disconcerting to see the force behind the splendid 'Barry McKenzie' movies in something so dismal as this. Denholm Elliott reprises his role as 'Emmanuel Whitbread', the surgeon who originally grafted 'Percy' onto Edwin Anthony.<br><br>Quite a lot of pop songs - by Tony Macaulay - grace the soundtrack, presumably an effort by the producer to recover some of the budget ( location filming took place in Cyprus ) through the issuing of a tie-in record. Raymond Hitchcock, author of the novel on which 'Percy' was based, wrote a novelisation. In Harry and Michael Medved's book 'The Golden Turkey Awards', the film is nominated in the category of 'Most Unerotic Concept In Pornography' ( it did not win ).<br><br>This marked the end of the long-running collaboration between producer Betty E.Box and director Ralph Thomas. What a sad picture for them to go out on.","user":"ShadeGrenade","rank":[4,6]}]