[{"title":"One of the most underrated movies of the eighties","rating":16,"date":"16 September 2004","review":"Umberto Eco's novel has something of a reputation as one of the great unread bestsellers. To have it on the shelf in the early eighties was a fashion statement as much as it was a literary necessity. And yet when the film was released, it was attacked for being an ineffective adaptation. Turning the 600-page novel, a detective mystery enriched by descriptions of medieval life and semiotic ruminations characteristic of Eco's academic writings, into a mainstream two-hour movie was, of course, ambitious. Four credited screenwriters and an international co-production gave off a sense of struggle and indecision. The movie was, and remains, easy to deride.<br><br>It's true that the film, directed by Jean-Jacques Annaud, has to skip, or skirt, much of Eco's detail - the famous pages-long description of the doorway, for example, is acknowledged by a few camera shots - but it takes the novel's literary strengths and offers a cinematic equivalent: a vivid depiction of monastic life which thrusts the viewer into the period of the story. In this respect, the production is exemplary: cinematographer Tonino Delli Colli, art director Dante Ferretti and composer James Horner were all operating at the top of their game.<br><br>And, as Renton in Trainspotting (1996) knows, Sean Connery proved a perfect choice as William of Baskerville, the 14th-century Sherlock Holmes figure investigating the deaths in an Italian monastery. It's one of Connery's best performances, a happy marriage of character acting and star casting: he suits the physical description of William and he properly conveys the character's wisdom, caution and sense of regret. Christian Slater's Adso, the narrator of the novel, is a surrogate for the viewer, expressing bafflement at the mystery story and awe at William's deductive powers; while F. Murray Abraham works wonders with the underwritten part of the inquisitor Bernardo Gui.<br><br>The Name of the Rose is one of the most underrated movies of the eighties. That it wasn't brilliant should not detract from the fact that it's as good as it is.","user":"edwardlamberti","rank":[183,205]},{"title":"Criminally underrated by some, hailed as a masterwork by others. Who's right? The \"masterwork\" campaigners, of course!","rating":9,"date":"16 December 2004","review":"'Variety' got it completely wrong when they called this film \"sorrowfully mediocre\" and \"sluggishly staged\". For in all honesty The Name of the Rose is one of the greatest films of the '80s, and a film that grows in greatness every time you revisit it. Based on a major bestselling novel by Umberto Eco, the film is an excellent murder mystery further heightened by its authentic period trappings and a clutch of tremendous performances.<br><br>Brother William of Baskerville (Sean Connery) and his young apprentice Adso (Christian Slater) are monks who arrive in a 14th Century monastery having been summoned for a religious conference. Soon after their arrival, a series of bloodthirsty murders take place and the friars still alive begin to fear that either the Apocalypse is upon them, or a highly disturbed individual is out to bump them off. Brother William has a penchant for sleuthing, so he probes into the mysterious deaths and discovers that each victim had laid his eyes upon a Greek manuscript hidden deep within the interior of the monastery. He gradually realises that the killer must be targeting those who know of the book's existence, but just as he is about to solve the killings an inquisitor (F. Murray Abraham) arrives and tries to discredit Brother William's theories, preferring to blame the crimes on non-existent heretics and satanists.<br><br>The film is very realistic in every way - the cold, uncomfortable monastery; the graphic murders; grotesque and disfigured characters; a startlingly explicit sex scene; authentic-sounding dialogue; excellent indoor and outdoor locations; and well-researched costume designs. Furthermore, it is a superbly paced film, never in too great a hurry to unravel but never so slow that it becomes a plod. Connery is great as the hero, surpassed only by Abraham in a breathtaking role as Bernardo Gui the inquisitor, and Slater does well considering his tender age as the loyal apprentice. Both Roy Scheider and Michael Caine were short-listed for the Connery role, but I don't see how either actor could've done better with the character. Jean Jacques Annaud directs outstandingly, capturing every shadow, every expression and every plot piece with the eye that only a director obsessed with his material possibly can. The Name of the Rose makes the top #50 of the 1980s without question.","user":"barnabyrudge","rank":[148,175]},{"title":"It doesn't get much better than this.","rating":10,"date":"16 April 1999","review":"A murder mystery set in a medieval monastery, this film manages to be intriguing, amusing, thrilling and terrifying.<br><br>It was adapted from the first novel by the Italian semiotician Umberto Eco, a book concerned with the monopolization of knowledge.  Eco approached this subject by concocting a series of mysterious deaths that occur in an isolated monastery, which eventually prove to revolve around a small coterie of disobedient monks who are partaking of a forbidden book.  This leads to the discovery of the monastery's great secret, a vast hidden library where the knowledge of the ages is being allowed to rot away by authorities who hoard the books on the paternalistic justification that the knowledge they contain is too dangerous for ordinary people to possess.  The library is a vast maze, and being lost in it is one of the novel's central episodes. (The maze theme, and particularly the library-as-maze, is one Eco shares with Jorge Luis Borges, and it feels here almost like the baton passed from one marathon-runner to the next.)    It is a novel filled with the love of books themselves, and dressed in a stunning evocation of one of the bleakest periods in the intellectual history of the last 2000 years.<br><br>Jean Jacques Annaud's masterful adaptation of this book wisely retains some of the novel's elements, and transmutes others into terms far better suited to the medium of film.  Annaud creates the milieu of the monastery, bleak, dank, claustrophobic, almost drained of life, brilliantly.  (This film is the only way I'd ever want to visit a 13th century monastery.)  The suppression of individualism that is part and parcel of this monastic life is the obvious outward expression of the mindset that would suppress the product of centuries of human thought and writing.  Into it he brings William of Baskerville, excellently cast and wonderfully played by Sean Connery... a man who appears to be a monk solely because it is the only occupation in which he had the opportunity to study and exercise his mind. An obvious pre-cursor to Sherlock Holmes, William believes his eyes and ears, even when they contradict doctrine and the Official Line.  He is brought in by the Abbott to explain deaths and quiet the rumors... before the impending visit of a notoriously ruthless official of the Inquisition. To the Abbott's great dismay, William dismisses an easy explanation and instead seeks to unravel the mystery.  And coming ever closer is hovering threat of The Inquisition, which is eventually embodied on screen by the sinister F. Murray Abraham.<br><br>Where Annaud's film departs from the novel is in shifting the emphasis away from \"the suppression of books\" as the central theme.  It remains a powerful symbol, but it is not required to stand on its own for the idea behind it. It is touched on in a wonderful scene where William first enters the library/maze and realizes what's hidden there, books he's heard legends of and longed to read his whole life, and he becomes totally giddy with the joy of this discovery.  But the seduction of the maze, the high-point of the novel, is a distinctly literary effect, and Annaud and his writers shrewdly perceived that it would be rather flat on screen.<br><br>Instead, they center on the suppression of Free Thinking by the Inquisition, and the ruthless forms of terrorism employed to intimidate the \"useful\" minds into staying in their place, and thinking only what they are told. The human drama of the flames of the Inquisition \"read\" far more effectively on film than the intellectual drama of the imprisoned books, and that is driving force that makes the film, in its own medium, every bit as effective as the book.<br><br>In all, this film is an entertainment for the mind as well as the senses, filled with remarkable performances an indelible visions.","user":"metaphor-2","rank":[110,132]}]