[{"title":"One of the most misunderstood movies ever...","rating":6,"date":"6 December 2002","review":"I wish I could have a few minutes to hear Vincent Ward's take on the marketing of the movie, because I never have seen anything so mis-marketed. I could see some US film distributor scratching his head and saying, \"gee? how are we going to make this dreary arty movie about the black plague appeal to the lowest common denominator of the US market?\", \"Ok, let's slap sci-fi and time travel on it...\"<br><br>Navigator is a beautifully filmed, well acted, impressive movie that (hear this!) has nothing to do with time-travel, or \"monks dodging 20th century stuff\"...it is an allegory! (look that up).  What Mr. Ward does is, rather than rely on expensive and silly special effects to spice up fantasy dream sequences, simply juxtaposes 20th century settings with the 14th century time frame of the film to give life to a boy's fantastic visions, and story told to give hope and entertain the desperate people of his village...his visions, done in color and film with the 20th century as it backdrop is as fantastic to the people of his village, as if someone from the 14th century actually did travel through time.  With premonitions of the arrival of the plague to his village (which turn out to be heeded), the villagers of a winter bound poor community hover in fear and look for any omen good or bad to give them some sign of what is coming.  With a fantastic narration of a quest (ala the holy grail) to mount a spire on a church in a faraway land, that if done before sunrise would save the village, a boy describes his fantasy which is shown to us, complete with sea monsters and dragons (all represented by 20th century contrivances).<br><br>For those seeking real time travel, stick to the true sci-fi, you will be disappointed...<br><br>For those interested in seeing a dark, moving tale of the desperation that must have been felt by the people who lived through the plague without understanding what it really was...a tale where the fantastic is really our wonderfully mundane world...check this out.","user":"fes_net","rank":[58,66]},{"title":"One of the greatest unknown films.","rating":9,"date":"15 April 1999","review":"This film is almost unknown. None of the cast ever achieved fame, and Vincent Ward, while an able director, is not very prolific. However, I still cherish my memories of this movie. I saw it nearly 11 years ago, and every detail , and all of the performances, are still fresh in my mind. It is  a fantasy of extraordinary beauty, which does not use a single special effect, and which conveys the thoughts and beliefs of \"mediaeval\" peasants better than a dozen high-priced epics.","user":"coop-16","rank":[32,37]},{"title":"A believable representation of medieval people. (minor spoilers?)","rating":8,"date":"20 September 2004","review":"I just saw \"The Navigator\" for the first time last night, and I must say that it is a very well done film. Unlike Hollywood films, the medieval characters are not simply modern men in medieval garb, nor are they treated as ignorant buffoons. The portrayal of the characters is highly believable.<br><br>They see everything with religious and medieval attitudes, and try to cope with the nightmare world of a modern city as best they can, in order to complete their pilgrimage / quest. This is perhaps the greatest strength of the film, as it helps the viewer to successfully suspend his disbelief and identify with the characters.<br><br>It may be subtle, but there is also medieval symbolism used in the movie.<br><br>There are some things in the movie that don't quite make sense, like the complete willingness for the foundry workers to help a group of people who should for the most part seem insane to anyone not knowing they are actually from the fourteenth century, or the apparent pathological need for every car driver in the movie to try to run the characters down, without any attempt to swerve, stop, or otherwise avoid them. These, however, are merely nit picking trifles, when placed in the context of the full story.<br><br>It is not the greatest movie I have seen, but I would definitely say that it is worth a look. It's respect for and realistic depiction of it's medieval characters is a strength that really helps to hold the movie together.<br><br>I give it a thumbs up.","user":"boingo_the_clown","rank":[13,14]}]