[{"title":"Woody Allen's own \"Amarcord\"","rating":9,"date":"21 August 2006","review":"Radio Days (1987)- written, directed, and narrated by Allen:<br><br>What a beautiful, kind, gentle, ironic, warm, sentimental (in a very good way and yes, I am talking about Woody Allen's movie, that's right) yet perfectly balanced delight. It is a series of sketches about young Joe (young Allen, of course, played by Seth Green - that was a surprise), an adolescent in Brooklyn, NY during 1930s-1940s who was passionately in love with radio which was a king. The film is a tribute to the magical radio days and the myths and legends about radio personalities, the memory of a grown man who never forgot where he came from, the love letter to his always fighting and arguing (\"I mean, how many people argue over oceans?\") but loving relatives and a very funny comedy (the way only Allen's comedy can be). It is the film where pretty like a doll and painfully naive Sally (Mia Farrow) asks who Pearl Harbor is? Where gorgeous Diane Keaton sings and Diane Wiest, his beloved Aunt Bea never gives up hope of one true love. He never told us if she found it...<br><br>\"I never forgot that New Year's Eve when Aunt Bea awakened me to watch 1944 come in. I've never forgotten any of those people or any of the voices we would hear on the radio. Though the truth is, with the passing of each New Year's Eve, those voices do seem to grow dimmer and dimmer.\"<br><br>The Radio days are gone but thanks to Allen, the voices of the times passed are still clear and sound and they always will be.<br><br>9/10","user":"Galina_movie_fan","rank":[51,53]},{"title":"Nice Piece Of Nostalgia","rating":8,"date":"16 December 2005","review":"If you are looking for the normal amount of big laughs from a Woody Allen film, then you will be disappointed here. It's not that kind of film.<br><br>I was anything but disappointed, but I knew what the film was all about before I saw it. Actually, what drew me to it was that I had read where this was a wonderful visual film, filled with rich colors and great set designs. It did not let me down. This is a great visual tribute to the 1940s, to be exact from 1938 to 1944. A real treat for the eyes.<br><br>The story centers around a Jewish family in Queens and the importance that radio shows had in that day-and-age. Also profiled in here are some of those radio performers.<br><br>It does have laughs but not as many as the normal Allen movie because the idea of this is simply to be a nostalgic piece, mainly Allen's tribute to his own family days of growing up, what it was like around his house.<br><br>It was interesting to see Seth Green playing Woody as a youngster with flaming red hair. The most interesting person, however, was Diane Wiest who played a man-chasing sister-in-law. The film gives you a real flavor of the period, of New York and of a Jewish family.<br><br>Overall, it's simply a nice film....and gorgeous to look at. Sometimes I think some of Allen's work is overrated but, boy, here is one that is definitely underrated.","user":"ccthemovieman-1","rank":[43,45]},{"title":"Like a Warm Coat on a Chilly Evening","rating":10,"date":"26 July 2001","review":"This movie shouts one word: WARMTH. The colors, the plot, the characters, they are all wonderfully warm.<br><br>I've watched this movie with senior citizens who were around in the forties. I once watched it with a Jewish guy who grew up on Long Island (albeit in the early 30's, not the 40's). All comments were the same: THIS was life in New York during wartime.<br><br>Vietnam was my war, so this era was a mystery to me. However, any time a genius like Woody Allen can create a film that not only makes me and my rowdy friends laugh, but gets guffaws from my dear old Mom as well, it deserves a little fanfare.<br><br>I didn't even mention the solid gold music.<br><br>See this film at once!","user":"bbbaldie","rank":[45,48]}]