[{"title":"Playing records backwards can be hazardous to more than the needle.","rating":6,"date":"12 January 2004","review":"A classic in the eighties genre of horror. It features goofy heavy metal music and demons. Stephen Dorff plays young Glen, who discovers a hole in his backyard is a doorway for demons. After his friend Terry plays his metal album backwords and they coincidently bury the family pet(you always need a sacrifice) in a hole in the backyard, they awaken demonic spirits which destroy the home and try to kill them. A funny take(even if not meant to be) on back masking and the influence of rock music on children. This film features some classic stop motion in the lines of Jason and the Argonauts. They are attacked by reanimating dead, droves of tiny demons and a head demon the size of a bus, which bares a strong resemblance to a Clash of Titans creature. This all stemming from a movie that would normally be a dud given the time period. It shouldn't be taken too seriously, but will amuse you for about 85 minutes. This is yet another underrated, hardly seen eighties gem.","user":"bootblacker","rank":[32,36]},{"title":"Scarry then, cult classic now!","rating":8,"date":"8 November 2005","review":"Demons? Metal Music? Steven Dorff? Why not!!!<br><br>So... the gateway to hell or whatever is in the backyard of Steven Dorff's suburban home... and a metal band foretold all of this... and Demons threaten this world... Doesn't that sound great?<br><br>As a kid this was scary watching this with a baby sitter and such but now it just seems campy. But I still love it every time!<br><br>OK... it is a bit cheesy, and the DVD quality is awful.... but come on...it's like 5 bucks at Best buy!<br><br>Seriously... if you haven't seen this movie and your into cheesy horror flicks just give it a try... keep the classics alive!","user":"dr_Meatus","rank":[47,61]},{"title":"Underrated Cult-Movie","rating":7,"date":"1 November 2006","review":"The boy Glen (Stephen Dorff) and his best fried Terry (Louis Tripp) accidentally open a gate to hell when a rotten tree is removed from the backyard of Glen's house. When his dog die and a friend of Glen's sister, the teenager Alexandra (Christa Denton), buries the animal in the hole, demons from an ancient civilization are released, seeking for two human sacrifices to dominate the world. Glen, Al and Terry, who are spending the weekend alone in the house, fight to save their lives and close the hole.<br><br>I do not recall how many times I have seen \"The Gate\" on VHS and now on DVD. The funny story has a terrible conclusion, but the special effects were amazing in 1987. This cult-movie is very underrated inclusive in IMDb but who cares? I still love this little gem of the fantastic cinema. My vote is seven.<br><br>Title (Brazil): \"O Portão\" (VHS) / \"O Portal\" (DVD) (\"The Gate\")","user":"claudio_carvalho","rank":[39,54]}]