[{"title":"One of the most underated western dramas.","rating":29,"date":"29 March 2001","review":"There are a handful of western films that have immersed me in the story and the characters so effectively that I never grow tired of viewing them. Even though I may have seen the film fifty times or more, I get so involved in the film that I hope that one plot element will change and the story will have a different ending.  Those films are:  \"High Noon\", \"Shane\", \"The Shootist\" and \"The Gunfighter\".<br><br>It was Peck's idea for Jimmy Ringo to have a mustache--to Fox studio head Darryl Zanuck's disgust.  Zanuck thought that moviegoers liked to see a clean-shaven Peck.  The picture was not a box office success at the time, but it ranks among the Top 10 western films of all time in my book.","user":"mathewgarth","rank":[22,23]},{"title":"Memorable First Adult Western","rating":7,"date":"30 March 2010","review":"The fifties is regarded as the decade of the great classic western. For a whole ten years Hollywood was consistent at turning out the best and most mature tales set in the great American West. Gems like \"Shane\" \"High Noon\" and \"The Searchers\", to name just a few, were from this era. Along with the Randolph Scott/Bud Botticher collaborations and the splendid projects of such directors as John Sturges (\"Escape From Fort Bravo\" /\"Last Train From Gun Hill\") and Delmar Daves (\"Broken Arrow\"/\"The Last Wagon\"/\"3 Ten To Yuma\") there was also the splendid collaborative efforts of Jimmy Stewart and Anthony Mann with their remarkable contributions to the genre with \"Winchester 73\", \"The Far Country\" and \"Naked Spur\".<br><br>But the first picture to really start things moving on the road to producing western films with a dimension of intellect and reality was THE GUNFIGHTER. Produced by Nunnally Johnson in 1950 for 20th Century Fox this was the first time audiences would be exposed to an \"adult\" western. A dark downbeat story of the last days of a gunfighter (perfectly performed by Gregory Peck) told with genuine realism and honesty. Stylishly written by William Bowers and William Sellers the screenplay was based on an original story by William Bowers and Andre deToth. Sharply photographed in monochrome by the great Arthur Miller the movie was directed with a positive flair by Henry King.<br><br>Peck plays Jimmy Ringo the now world weary legendary gunfighter who after many years arrives back in town to see his estranged wife (Helen Westcott) and their small son. Hoping for a reconciliation - and with plans to start over in California - his presence in the town causes a great stir among the citizens and of course attracts all sorts of young guns out to make a \"reputation\" for themselves one of whom, alas, will be responsible for the doom of the protagonist in the final reel.<br><br>The picture is fleshed out with a marvellous cast. Millard Mitchell is excellent as the reformed outlaw turned Sheriff who once rode with Ringo and now wants him to leave town before trouble erupts. Good too is Skip Homeier as the brash errant young gun and Karl Malden as the amiable saloon owner. Helen Westcott gives a good performance as Ringo's wife. A well measured portrayal of a woman who still loves her husband and who promises to leave with him which ultimately can never be. Helen Westcott was an interesting actress! Very attractive with classical good looks she was born in 1928 but never distinguished herself in film and is remembered now only for THE GUNFIGHTER and possibly for her humorous turn as the Lady Diana in \"The Adventures Of Don Juan\" (1948) as Juan's \"betrotted\". After many parts in many indifferent films she became just another working actress mostly on Television. She died in 1998.<br><br>THE GUNFIGHTER stands up today as an engrossing taut and dramatic western which shows little signs of wear. But I have a problem with the omission of any kind of musical score. The great Alfred Newman composed a cracking defiant and robust main title and only gave what amounts to a coda for the closing of the picture but there is no underscoring whatsoever during the movie. And there are a couple of scenes that cry out for some scoring and would have benefited with the addition of music. For a studio that boasted one of the finest music departments in Hollywood under Newman's direction Fox were the worst offenders of sparse scoring during this period. Who knows? Perhaps it was a money saving Zanuck decision but a practice I always found to be impractical, doctrinaire and at the expense of more meaningful dramaturgy. Motion pictures are not plays which depend solely on the spoken word to connect to an audience. Film has the facility, through music, to heighten emotions, point up feelings of love and loss and to embellish triumphs and pathos. Therefore, since the possibility exists to add music to a film soundtrack to enhance dramatic impact, movies should be scored!<br><br>However, underscoring not withstanding, THE GUNFIGHTER still manages to remain one of cinema's most cherished and highly regarded westerns.","user":"jpdoherty","rank":[37,42]},{"title":"A Great Classic , But Hardly The First Adult Western","rating":9,"date":"25 May 2012","review":"The Gunfighter is surely one of the great classic Westerns of the late 1940's/early 1950's era. Yours truly saw it in 1950, when it was new, with my family in the local small-town theater. It made as powerful impression then as is possible on a 6-year old kid, and it gets better and better with subsequent viewings for the fading old geezer.<br><br>Tautly and skillfully directed by old studio veteran Henry King, and filmed in stark black and white, this hour and twenty-five minute picture moves along at a brisk pace with nary a wasted scene, all along building suspense while painting intense character studies. Gregory Peck, as the title's badman, and Millard Mitchell as his lawman friend, both turn in overpowering performances, with fine support coming from Jean Parker, Karl Malden, Helen Westcott, and Skip Homeier. The Gunfighter is tough, tense, poignant, gritty, authentic, dramatically engaging, and first rate in every way. The story by William Bowers and William Sellers drew an Acedmy Award nomination. The movie was well received by critics but not by the paying public for some reason. Yet it is now widely, and deservedly recognized as an all-time classic Western.<br><br>That being said and without detracting from its formidable merits, The Gunfighter was hardly the first \"adult\" or \"mature\" Western, as pundits on this forum and elsewhere keep saying. To think so, you must practically ignore most of the \"A\" Western pictures produced in the 1940's. Does Red River (1948) with its tough, brutal, overbearing antihero and its grand epic story seem to you to have been made for children? No, and neither were any of the \"A\" Westerns of the same era. \"Adult\" can't mean sexual situations here, because there was no hanky-panky in The Gunfighter. But there was a plenty in Duel In The Sun (1946), Peck's first Western and a text book example of the way Old Hollywood movie makers knew how to steam your eye glasses without really showing much! And if show and tell is required, get a load of Marlene Dietrich's outfit in the opening scene of The Spoilers (1942). Some very immature types think \"mature\" means displaying a nihilistic attitude. If that's you, check out Lust For Gold (1949 -- see my review). You can wallow in its angst and love it! But that wasn't the attitude The Gunfighter had anyway. If \"mature\" requires a dark, brooding, doom-laden, noir-type story, take a gander at early Robert Mitchum opus Pursued (1947), or Ramrod (1947). Are we talking a concentration on character development, adult, even sexual situations, complex dramatic development, try Canyon Passage (1946), Whispering Smith (1948 -- see my review), or The Sea Of Grass (1947 -- see my review). Below is a partial list of others embodying more or less the same \"mature\", \"adult\" approaches to the Western genre.<br><br>Yellow Sky (1948), Abilene Town (1947), Station West (1948), Honky Tonk (1941), Silver River (1948), Barbary Coast (1935), Cimarron (1931), Dakota (1945 -- see my review), San Antonio (1945 -- see my review), California (1946 -- see my review), My Darling Clementine (1946), Flame Of Barbary Coast (1945), Blood On The Moon (1948), Colorado Territory (1948), and of course Stagecoach (1939). And many others.<br><br>The Gunfighter was following an established tradition, not setting a new one. But it is a fine example. A true classic from the waning days of Old Hollywood's Golden Era! In a few years, they wouldn't be able to make 'em like this one any more.","user":"oldblackandwhite","rank":[8,8]}]