[{"title":"Dom's Finest Moment, One of Burt's Finest Too","rating":9,"date":"26 July 2001","review":"This was, without a doubt, the most hilariously comic performance that the brilliant Dom DeLuise had on film. When, in the midst of a depressed \"woe is me\" rant, he looks up and asks \"Do you think we'll ever switch to the metric system?\", well, it just don't get no funnier than that. His botched suicide attempts, as well as his eagerly wanting to help Burt with HIS suicide, oh heck, just go rent it yourself! You'll love it.<br><br>Burt was brilliant too. He holds a thin line between wanting to die and wanting to live that is believable. It's a real shame that this movie often gets me blank stares when I tell others about it. More people know about Four Weddings and a Funeral (a movie so horrid that I still refuse to watch another Andie McDowell flick) than this quiet classic. (sigh)","user":"bbbaldie","rank":[25,31]},{"title":"The living \"End\"....","rating":8,"date":"19 October 2000","review":"Death is serious business, no doubt.  No moreso than the people who come in contact with it.  In fact, is there ANYTHING funny about dying?<br><br>If you're Burt Reynolds and you find out you only have a few months left to live, then YES.  And the evidence is in one of his maiden directing efforts, \"The End\".<br><br>As a terminally-ill man, Reynolds practically drives himself crazy trying to get his life in order and end it at the same time.  However, he has to deal with an inattentive ex-wife (Woodward), flaky parents (Loy and O'Brien), an even-flakier girlfriend (Field), an overly-mature daughter (MacNicol), a dense lawyer (Steinberg), a novice priest (Benson) and a schizophrenic mental patient (DeLuise) who wants to help Reynolds reach his end goal in the worst way.<br><br>The topic is morbid, to be sure, but there are indeed (dark) laughs here. Reynolds' hand never falters and he makes the most of every scene he's in as a man who's at the end of his rope (literally, in one case) and can find no solace even in chasing down a funeral procession to find out what the guy in the hearse died of.<br><br>To say that DeLuise steals the movie isn't enough; he steals it, runs for the border, makes a clean getaway and never looks back.  There is more bad taste to be had when we discover his character is Polish and Dom then rattles off a few bad Polish jokes to Reynolds.  \"Kids can be cruel\", Reynolds consoles.  \"What kids\", DeLuise responds, \"I heard these from my parents!\"  How inspiringly nasty.  My one favorite scene has to be where Dom tries to help Burt jump out of the bell tower in the mental institution he is incarcerated in (You're right: it's not high enough!\").  It's great and there's a lot more scenes like that, sprinkled throughout.<br><br>For some of us, though, it's hard to laugh at suicide, let alone death.  But the morbid, gallows humor here doesn't celebrate death like a lot of bigger-budget movies do - this is a movie about life, living and doing everything you can while you have the chance.  And THAT is really what \"The End\" is about - not the end but everything you do before the end gets here. And in that respect, Burt succeeds.<br><br>Eight stars and a golden noose for \"The End\" - the movie that'll make you love life...and think twice about coming near Dom DeLuise with a Polish joke.  Ever.","user":"Mister-6","rank":[15,19]},{"title":"Burt's best and most unappreciated.","rating":10,"date":"12 June 2005","review":"Up there with Groundhog Day for philoso-comedy. Carl Reiner makes every second count. Dom is desperately lovable. Sally shows she can act. And Burt is at his understated best. Unfortunately for Burt, he was 25 years too early with this now timely reflection on death and dying -- boomers did not want to be worried about death in 1978. Now that we are beginning to realize that we too are mortal, this movie should get the appreciation it deserves. Those of you who are turned off by movies dealing with ethical and personal dilemmas won't like this movie. You would think that with all the attention paid to the ethics of extending life and assisted suicide that this movie would be required viewing for the right AND left. I am convinced the Burt will be remembered because of this movie. Death be not proud.","user":"thwingr","rank":[12,15]}]