[{"title":"Great movie","rating":30,"date":"30 January 2002","review":"I haven't seen this movie in years, but I remember I saw it at the movie theatre and really enjoyed it. It was a great chance to see Dan Blocker in another role besides \"Hoss Cartwright\". It also had other cast members such as Jack Elam and Mickey Rooney who were truly enjoyable to watch.","user":"ridgerunner773","rank":[15,17]},{"title":"uplifting, heartwarming, innocent","rating":30,"date":"30 December 2001","review":"I found this movie to be uplifting, and heartwarming.  Dan Blocker is funny in his innocent way.  It promotes high morals and is the kind of movie that the whole family can watch.  A funny, innocent love story that you'll want to add to your library.","user":"grmpbob1","rank":[7,7]},{"title":"Good stuff","rating":8,"date":"7 April 2004","review":"I saw this movie maybe twice--once in the theater and once on TV--all over 30 years ago. Then I obtained a very good VHS copy and it is in my collection. It is very good and deserves a release in some form. I enjoyed some very comic moments: Jack Elam plays a half-crazed, legally blind bounty hunter with thick spectacles, teaching his finger how to read a wanted poster; Jack Cassidy ends up in jail and loses his temper because the one locking him up is too stupid to understand he's got the wrong man; Nannette Fabray gives the burly Dan Blocker a big roundhouse punch which seals their romance. The plot is a classic: a mail-order bride no-show motivates the town to fix their only blacksmith up with a saloon girl substitute, who just arrives in town. There a lot of subplots that are slapstick. The scenes between Fabray and her hostess where Fabray reveals that she's unexpectedly fallen in love with the gentle giant of a blacksmith; and the scenes between Fabray and Blocker are quite good and are what makes this film better even than what its writer or director probably intended. I would have directed Fabray to keep in mind that her character--while probably matching Fabray's intelligence and robustness but not her sophistication--is not accustomed to having such deep feelings. Perhaps a scene or two more to contrast her relationship to Panama Jack with her newly-discovered capacity to deeply love a man who is not a Western stereotype (but probably closer to the majority of men actually living in the post-Civil War West), the unarmed, simple rough-cut but still part of Victorian America--blacksmith named Charlie. This movie is a hidden gem because it's a product of an old-school cast that whose careers started in an era where actors cared deeply about their work. I cannot see today's TV or movie crowd making such a movie without treating the subject matter and their characters as beneath them--or adding unneeded sex scenes, more violence, profanity, politics and message--so that they could show their constituent audiences, or their equally cynical paymasters, that they're determined to be \"realistic.\" Folks, get a copy of this if you can; it's worth it.","user":"tonellinon","rank":[6,6]}]