[{"title":"Duvivier le magnifique.","rating":10,"date":"22 July 2002","review":"While Godard and co were still in diapers,Duvivier,Renoir and Carné were inventing the best French cinema that had ever been. I would trade you all M.\"A bout de soufflé\" filmography for \"un carnet de bal\"<br><br>Leonard Maltin gives a four stars rating to this 1937 movie,and all we can do is approve of his judgment.The movie of nostalgia,of time passing by,of disenchantment,\"un carnet de bal\" is all this and more.<br><br>On the banks of a lake -the romantic place par excellence-,a woman is remembering her past.Her madeleine de Proust is her dance card .\"Memories tumbling like sweets from a jar\".But these sweets leave a bitter taste in the mouth.<br><br>She goes back in the past,in search of her long lost dance partners. She will have to delude herself:what she discovers is ruined lives,regrets,embittered characters,human wrecks.Time is a hard Master and it leaves no one unharmed.As always in Duvivier's work,the harder they fall,the better the sketches are.For it is basically a movie made up of sketches,Julien Duvivier's métier.All youth ideals have gone down the drain:the brilliant medicine student has become an abortionist;the lawyer with bright prospects now has a lousy shady cabaret;one of the woman's beaus is dead and his mother gone nuts acts as if he's still alive.Two of them have escaped from a doomed fate:but one has become a priest and the other keeps his love for something else than women .<br><br>The movie made up of sketches ,as I said, had always been Duvivier's forte.Here ,there are seven flashbacks,one prologue and one short epilogue :strange how this final resembles that of Mitchell Leisen's \"to each his own\" (1942),when the boy says to Olivia De Havilland:\"I think it's our dance mother\".Having directed with a topflight cast \"tales of Manhattan\" (1942) in America,Duvivier went even further in the \"sketches movie\":in \"sous le ciel de Paris\" ,he used intertwined little stories till all these subplots became a seamless whole.<br><br>Yes ,Julien Duvivier's importance in the seventh art is incalculable.","user":"dbdumonteil","rank":[37,40]},{"title":"Shadow Waltz","rating":10,"date":"10 September 2006","review":"This is one of the Great ones: In terms of French cinema in the first full decade of Sound it belongs right up there with Marius, Fanny, Cesar, Quai des Brumes, Le Jour se leve, La Femme du boulanger, La Grande Illusion and you can't put anything higher than that though Duvivier's own La Belle equipe and Pepe Le Moko both come within a whisker. It's the kind of film that would be difficult to make today as would, for example, Dial M For Murder. Frederick Knott wrote Dial as a play in the early fifties and the Hitchcock film version was released in 1954 BUT the entire plot (our old friend the 'perfect' murder) hinged on the fact that in those days only the upper and middle classes had telephones at all and those were in fixed locations and in this era of jack points and cell phones the idea of someone obliged to answer a telephone located on a desk in front of heavy drapes behind which a murderer was lurking ready to strike when the phone was answered would be ludicrous. Carnet is similar inasmuch as 'dance cards' are unheard of today belonging as they do to a world of stately dancing and courtly manners where even a 'nice' girl would as soon turn up to a dance totally naked as without a 'full' dance card - many of us will remember how, in Meet Me In St Louis, Judy Garland and Lucille Bremner 'marked' the dance card of an out-of-towner loading it with every dead-beat in town. So, yes, it is archaic but fortunately those of us who care to can have archaic and eat it courtesy of the Art/Revival House, Movie Channels on TV and/or the DVD. Living by a lake a widow comes face to face with what today we would call a mid-life crisis; vaguely melancholic and slightly wistful lest she did, as she suspects, marry the wrong man, she allows her thoughts to drift to her first dance and the names on her very first dance card who, on a whim, she decides to trace. WE know of course that you can't go home again even if we've never even heard of Tom Wolfe let alone read him but thankfully Christine feels otherwise. It was a nice touch to find that the first name on the card is dead - but try telling that to his mother, the great Francoise Rosay - as if to say right from the word go that love dies, baby, if you neglect it. One by one via a night-club semi racketeer, a monk, a ski instructor, the mayor of a small town, an epileptic doctor with a lucrative sideline in abortion and a gay hairdresser the scales fall and/or are stripped from her eyes leaving her sadder but wiser. Some of the top names in French cinema step up to the plate, Harry Baur, Louis Jouvet, Fernandel etc and no one strikes out. Henri Jeanson and Julien Duvivier brought honour to the French cinema with this one that remains a must-see and before I sign off let me acknowledge a genuine altruistic contributor to these boards who, with exceptional kindness, sent me not only this gem but seventeen others. Watch this space.","user":"writers_reign","rank":[15,17]},{"title":"A quintessential film of the classic age of French cinema","rating":9,"date":"24 January 1999","review":"This is one of the quintessential films of the classic age of French cinema. One just has to look at the credits: directed by Duvivier, with Fernandel, Baur, Jouvet (one of his best roles), Marie Bell, Francoise Rosay... all of them at the peak of their form. And held together musically by Jaubert's haunting theme melody, which I can still hum in the nostalgia cupboard of my memory fifty years after I first heard it.<br><br>The story is slight. Actually it is a series of vignettes, strung together by the bittersweet pilgrimage of a woman who sets out to find again the men who signed her first dance card. But that is just a pretext for a marvelous set of character sketches played by a marvelous cast of character actors served by a great character director.","user":"Peekie","rank":[9,11]}]