[{"title":"A Classic and A Period Piece","rating":4,"date":"4 October 2001","review":"Those who acquired a taste for 1920s Berlin in 'Cabaret' ought to see this film inasmuch as it is the real thing. Lotte Lenya (Weill's wife in real life and the actress who played the evil Rosa Kleb in 'From Russia With Love') and Carola Neher (fled Hitler for the Soviet Union then betrayed by communism -- she died in a communist prison camp in 1942) each offer an unforgettable singing performance. Carola Neher's song alone is worth the price of admission -- she outclasses even Dietrich.","user":"smprescott","rank":[22,25]},{"title":"Ensemble genius","rating":10,"date":"5 January 2005","review":"Great musicals always have great people working at every different level in a united way. The script, the songs, the actors, the camera-movements all must stand on their own while contributing to the musical proper. We have classic cases of this where all those involved went their separate ways and were never able to recreate that magic. Instead of this somewhat accidental result, we have here a carefully calculated masterpiece. It was recognised that this was an important social work, and there were a number of things that needed to happen in its execution. They needed Brecht's (a dramatist becoming increasingly fascinated with cinema) cooperation, they got it. They needed a capable expressionistic director, they got it. They needed creative writers to narrow the work down to a typical film length, they got them. They needed strong powerful actors to circumvent any possible lingering sentimentality, they got them as well. This was an age where film was becoming run by the studios, but in creative ways striving to create great art, and we have stunning works like this to prove it.<br><br>5 out of 5 - Essential","user":"returning","rank":[24,28]},{"title":"Life is Money, Food, Sex, Nothing","rating":8,"date":"4 September 2005","review":"Sometimes, if I ever feel especially depressed at something going off in the world I like to trot this one out to make me take an even more jaundiced view of things. This surely would be no. 1 in the Top 100 Most Cynical Movies Ever, even after all these years (the simultaneous French version is not so earthy, a more flowery artiness coming out instead). For me, it's the best movie I've seen of Pabst's, most of his post-WW2 stuff has eluded me so far.<br><br>The Guild Of Thieves' leader gets married to the Guild of Beggars' leader's daughter, causing friction between the two highly organised and respected professions, but inertia in the police who are in the Thieves' power. Prostitution, aberration, bigamy, thievery, extortion, bribery, corruption (and complete cynically cheerful indifference to it all), you name it it's here - after all it is all that Man can do! Laconic-looking Ernst Busch's searing inter-ditties leave you with the distinct impression that someone was rather tired with the world! The savage sounding German words spew out, whilst reading the English subtitles is sometimes heavy going in digesting all of the conceptual opinions in time to digest the next. Would that Bobby Darin had got his tonsils round a few more of the extraordinary gossamer Brecht/Weill songs from this! Lotte Lenya sparkled doing her Pirate Jenny number, being just a part of my favourite bit in the idling whorehouse.<br><br>All of the people involved in 3G are \"lost to sight\", except to the handful of Artheads who occasionally hold cultural revivals of Weill, Brecht or Pabst. There was a memorable series of events in London in 2000 to mark the 50th anniversary of Weill's death, but 99.99% of the general public passed it by.<br><br>Soon we will all be lost to sight too, along with all of our fractious opinions and silly vices.","user":"Spondonman","rank":[18,22]}]