[{"title":"Enjoyable, Entertaining","rating":26,"date":"26 September 2004","review":"I don't know why, but every time I think of this film, I'm reminded of \"Fish Called Wanda, A\". John Cleese, and Stanley Baker seem to be almost impersonating each other. They both play stuffy, uptight people, who end up becoming mixed up in some sort of convoluted plot involving grand larceny, etc. (after being introduced to some glamorous female). And there's the third party - in \"Fish Called ...\", it's the incredibly stupid American (Kevin Kline), however in this film, it seems to be the equally daft Earl of Dorset (David Warner). Both films end up with a sort of race to Heathrow Airport, but the similarities in plot-lines end about 5 minutes before the closing titles. I did like the way the robbery was handled (very cute) - particularly the 'phone conversation between Mr Graham's immediate superior and the parts played by both David Warner and Ursula Andress in the adjacent office. Some nice shots also of seventies London, and great comments by the Earl of Dorset on British Rail (as it was then known).","user":"erolgalip","rank":[18,19]},{"title":"double crossing partners execute bank heist set in London.","rating":10,"date":"25 July 1999","review":"An excellent, intricate bank heist involving three uneasy partners (baker, andress and warner) who plot a raid on the vaults of baker's firm. The plan  is aborted  on  several tries amidst great tension,  until the elements finally fall into place on a \"perfect friday\". The added suspense  of who will double cross who, along with a great finale, make for a fun film that has aged well in the subsequent hi-tech","user":"rugis","rank":[16,17]},{"title":"Too gimmicky, but suspenseful.","rating":6,"date":"10 August 2001","review":"In the first half, the elliptical narrative is very confusing for a first-time viewer; throughout the movie, the direction is sometimes unnecessarily gimmicky, employing fast cutting and close-ups a little too often. Still, the movie has some truly suspenseful set pieces (where you're afraid that even an accidental \"wrong\" glance may destroy everything), several nude scenes with Ursula Andress and a kicker of an ending. Much better than \"Dollars\" with Warren Beatty.    (**1/2)","user":"gridoon","rank":[6,6]}]