[{"title":"Plot and structure wise it is light but it produces plenty of memorable and hilarious scenes","rating":23,"date":"23 October 2005","review":"Laurel and Hardy are shopping for ingredients for their next get rich scheme  making and selling liquor during prohibition. Of course when Laurel sells a bottle of beer to a policeman, there is only ever going to be one outcome and the two finds themselves on the way to the big house. Locked up with a mean spirited collection of fellas, Stan and Oliver take their chance to escape and find themselves wanted men on the run.<br><br>Having just watched the very structured \"Our Relations\" it was noticeable when I stepped back into the much looser Pardon Us. The basic plot is no more than a nail on which to hang a series of comic scenarios and, as such, it works because it is pretty funny for the majority. The story is pretty weak but it does allow for a solid spoof of jail clichés as well as a pretty un-PC but funny scene where the boys try to pass themselves off as cotton pickers. Despite not having this flow to it, the film does have a couple of good stand out scenes that will please everyone with their typical silliness and mix of looks and double-takes.<br><br>Laurel and Hardy are both on form and are served to their strengths well. Finlayson is wonderful in a great classroom scene and he got the biggest laughs from me with a master class in slow burns and double takes. Long is enjoyably tough as The Tiger while Lucas is a good warden. The support cast are roundly good even if they are mainly there to carry the scenes rather than the comedy. The musical numbers are obvious but still good  with Hardy getting a good chance to show off his baritone talents.<br><br>Overall a thinly plotted affair but one that delivers quite a few memorable and hilarious scenes, connected with generally amusing moments.","user":"bob the moo","rank":[12,13]},{"title":"Comedy On The Lam","rating":10,"date":"21 June 2003","review":"In &amp; out of prison, Stan &amp; Ollie just can't seem to stay out of trouble.<br><br>\"PARDON US\" was the Boys' first starring feature film. Rather disjointed and poorly edited, it plays more like a few of their short subjects strung together. However, the Boys never falter and they deliver a film whose parts are greater than its whole.<br><br>The film was meant to be a spoof of MGM's popular THE BIG HOUSE (1930) and it helps to have seen that earlier movie to fully appreciate this one. Many of the standard conventions of the typical prison film are mocked here: the understanding' warden, the dangerous convict cell mate, the confinement in Solitary, the escape chased by bloodhounds, the prison riot.<br><br>A few comedy pieces in particular stand out: Stan's loose tooth; Ollie in the dentist's chair; the Boys trying to settle into the constricted confines of an upper bunk. James Finlayson, Stan &amp; Ollie's old nemesis, makes the most of his one scene as the prison schoolteacher driven to despair by the Boys' good-natured idiocy.<br><br>Walter Long is lots of fun as the Tiger, the meanest convict in the prison (Boris Karloff played the part for the French language version). Movie mavens will spot an uncredited Charlie Hall as the dental assistant.<br><br>An added delight is Babe Hardy's rendition of Lazy Moon,' one of the decade's finest film songs. Ollie had a warm, evocative voice, full of feeling and emotion. Here, backed by the magnificent Hall Johnson Choir, his song reaches out of the screen and down the decades to touch the hearts of the audience.","user":"Ron Oliver","rank":[13,15]},{"title":"The Boys In The Big House","rating":6,"date":"4 March 2008","review":"Being the lads first full length feature it's not surprising that much of it feels like filler, certainly the jokes are not quick fire and the culminating outcome doesn't quite leave the viewer fully satisfied. However it should be noted that Laurel &amp; Hardy's average output is still better than most other duos who would follow in their slipstream, and Pardon Us does have those moments that ooze comedy class. Witness both Stan &amp; Ollie trying to control a machine gun with typical riotous results, enjoy Stanley's tooth problem that becomes a running gag, and of course enjoy Oliver's incredulous looks at the camera. It's solid if unspectacular, but certainly worth a watch now and then, 6/10.<br><br>Footnote: Other user comments allude to certain aspects being un PC for the modern age, who cares is what I say, this is after all Laurel &amp; Hardy in the 30s, it worked then and really it still works now, harmless and enjoyable fun.","user":"hitchcockthelegend","rank":[17,21]}]