[{"title":"Different, Appealing Fantasy-Romance","rating":9,"date":"24 June 2006","review":"I found this to be one of more likable medieval (13th century) fantasy movies I've ever seen. It works because of the great mixture of action, beautiful photography, likable lead characters, humor, touching romance, suspense and no offensive language. Yes, here is an adult film that everyone can watch, and that' no cliché.<br><br>Rutger Hauer and Michelle Pfeiffer are handsome leads but Matthew Broderick, as \"Phillipe Gaston,\" is the star of the show. He provides the humor and is involved in almost every scene. <br><br>There is a lot of \"religion\" in here, both shown positively and negatively. Broderick's character acknowledges God and constantly talks to Him. Hauer refers to Him, too, but Broderick is the talker. However, here is yet another case of a French Catholic clergyman being the evil \"bad guy.\" (Is one ever shown in a positive light?) John Wood effectively plays the nasty \" Bishop of Aqulia.\"<br><br>This is a \"curse\" story about two humans who turn into hawk (Pfeiffer) and wolf (Hauer) by day/night never seeming to be human at the same time so they can be lovers and live happily ever after.<br><br>It's interesting all the way, with my only suggestion that it could have been a \"10\" had it been chopped about 15-20 minutes in length.<br><br>Overall, though, a solid film and one that has been enjoyed by everyone I know who has seen it.","user":"ccthemovieman-1","rank":[39,40]},{"title":"As Entertainment, Damn Near the \"Perfect\" Movie","rating":14,"date":"14 November 2000","review":"As a former video store employee, I am proud to say of all the films I ever recommended, LADYHAWKE came back with all favorable reviews, and not once did anyone I rented it to take me up on my \"money-back\" guarantee.<br><br>\nNo surprises there. Despite the production's troubled history between two studios (Fox and Warner's) and endless rewrites by an army of scribes, it still finds everyone involved at the top of their game, and early into most of their careers!<br><br>Rutger Hauer's bad guys were always more interesting and charismatic than his good ones, but his role as Captain Etienne Navarre was the noteable exception. In the best shape of his career both physically and artistically (with the exception of BLADE RUNNER'S Roy Batty), he painted the perfect portrait of noble hubris, tinged with the ache of unfulfilled love for his fair maiden, and the sorrow of an eternal curse that could never  be lifted. Even Errol Flynn would've been envious.<br><br>Michelle Pfeiffer has been many things in her career: earthy, sensual, campy, courageous, but she would never achieve the combination of radiant strength and vulnerability that she did as Isabeau D'Anjou. There have been other actresses who have looked better and given deeper, more nuanced performances since hers...but it's a REAL short list.<br><br>When I saw the previews, I was pretty sure that the main thing I would like the least about this movie was Matthew Broderick, whose Philippe \"The Mouse\" Gaston was a character I was pretty sure would grate on my nerves. And for the first part of the film, he definitely does. Credit it to Matthew's likeability and talent that before the film's end, though, you're rooting for him as much as for the two leads.<br><br>And let's not forget an extremely impressive supporting cast: John Wood (WAR GAMES and JUMPING JACK FLASH), Leo McKern (the OMEN films and PBS' \"Rumpole of the Bailey\"), Alfred Molina (PRICK UP YOUR EARS, RAIDERS OF THE LOST ARK and the TV series THE LADIES' MAN) and a wicked turn by Ken Hutchison as Navarre's nemesis. <br><br>For the couple, the friends or the family who want action AND romance, too, you can't do better, (and can always do worse.) And as far as the \"music\" controversy is concerned, I am a longtime fan of Andrew Powell's work back from his early days with Alan Parsons, and later with The Project, and I thought that the juxtaposition of the contemporary music with the medieval setting worked perfectly. This is, after all, a fantasy, not a historical record of true events! Enjoy it for what it is!","user":"cchase","rank":[95,102]},{"title":"One of my all-time FAVORITE movies","rating":10,"date":"11 September 2005","review":"What a great story. This has been one of my favorite movies since it first came out. (I saw it with my best friend, who had a crush on Matthew Broderick.) Anyway, it's a very stirring, timeless (except for the music) story of love, heartache, hope and redemption. Wonderful.<br><br>Rutger Hauer is amazing. Strong, even frightening at times, but still tender and vulnerable. Of course Michelle Pfeiffer is at her absolute most beautiful. She really does seem to possess \"the face of love\" as Phillipe says. But Matthew Broderick really makes the movie. He's more than just comic relief (although he is hilarious); he keeps the story grounded. Without the character of Philippe the movie would be too ethereal, untethered. Philippe is the everyman--our connection to the magical beauty of Navarre and Isabeau.<br><br>I've heard that the story is based on a medieval legend, but I haven't been able to find it. If anyone has a link, please post it as a review on this site; I'd love to read more about it. Thanks!!","user":"Barb-20","rank":[59,64]}]