[{"title":"A great Tour de Force by a fine cast, interpreting a great story","rating":10,"date":"13 April 2006","review":"I watched this movie in a USAF chow hall on the island of Makung in the China Strait with about 20 other airman. The year was 1960. We were stationed there on a missile site. Our targets were 7 Chinese missile sites. Their target was us. <br><br>I was 22 years old and immortal. <br><br>Until I watched this movie.<br><br>When the movie ended, I will never forget the fact that no one moved for perhaps 10 minutes. There was just the bright, blank screen and the sound of the end of the film going around and around. Thiketa-thicketa-thicketa................... No one ever said a word about what we had just seen. <br><br>We, or at least I, never forgot this movie. As said earlier, it was more than scary. It was sad.<br><br>It seems strange now, 40 some years later, to be telling people that you really should watch this film and watch the masters at work, with a script that is chilling. And you know what? We still haven't outlived the possibility...........","user":"hfelknor","rank":[266,285]},{"title":"Gives new meaning to the word 'shudder'","rating":9,"date":"26 September 2002","review":"I made the mistake of watching this film at 11 pm, in a theater with only 4 other people. We were scattered about...and alone. I have seldom wanted to be in a group as much as I did that night. I almost got up and went to sit in a row with one of the 4. Directing? Brilliant. Cinematography? Brilliant. The cast? Exceptional. Ava Gardner (still beautiful), Gregory Peck, Fred Astair and Anthony Perkins are inspired. I have always wanted to go to Australia. Many years later I got the chance. As the coast of Sydney came into view I started to cry...and didn't know why? Then I realized, I was 'hearing' Waltzing Matilda and remembering.","user":"lottatitles","rank":[62,68]},{"title":"Perfectly paced and well acted, it keeps melodrama minimised","rating":10,"date":"4 May 2000","review":"In an era (1959) and on a topic (nuclear war) that usually demands melodrama, \"On the Beach\" resists. In fact, the all-star principal cast and director Stanley Kramer seem to treat the topic as a stage play, focussing on the individual. And that is how such a story should be treated. Life on the northern hemisphere has been destroyed a defence mistake by one of the (then) two superpowers. Gregory Peck's nuclear-powered submarine was submerged at the time (they stayed under water for a hell of a long time in those days). The sub heads for Melbourne, Australia, which is one of the only places in the world not yet affected by radiation. But the radiation will come, and this is where the truth of the piece comes out.<br><br>The inhabitants of 'the end of the world' go through what you would expect: denial, anger, clinging to the thinnest hope, and finally, resignation. As I said at the start, this is clearly a story about the individual. Kramer knows this, and the cast of Ava Gardner, Tony Perkins, John Meillon and Fred Astaire play it with a reality that is all too rare. Even recent films like Final Impact fail to deliver on this count. The real joy of the film is the pacing, which gives the cast the chance to play it like it should be played. Astaire proves he is an actor, and only once slips into his raised eyebrow 'top hat and tails' mode. It is a well thought out movie without the Hollywood ending, but such is the art of Kramer that the ending is a good resolution, not just a funeral. The camera work is exceptional throughout, starting with the continuous shots in Peck's submarine. I don't know about the Waltzing Matilda music at the start, however. But it does work later in the piece, and makes it worthy of the Academy Award nomination it received.","user":"Kafca","rank":[81,94]}]