[{"title":"William Castle Presents Joan Crawford In EMOTE-O-RAMA","rating":7,"date":"14 May 2005","review":"Like all William Castle films, the story of STRAIT-JACKET is slight, full of holes, and often silly to the point of absurdity. Long ago Joan Crawford came home to find her husband in bed with a floozie and snatched up an ax. Adjudged insane, she is locked up in an asylum for twenty years, but now she's home--and pretty soon some really weird things begin to happen around the old family farm. Could it be, oh, I don't know... JOAN? Throughout his career, producer-director William Castle liked to build his movies around gimmicks: TINGLER had \"Percepto,\" 13 GHOSTS had \"Illusion-O,\" and HOUSE ON HAUNTED HILL had \"Emergo.\" But STRAIT-JACKET had something better: Joan Crawford herself, who plays in a style that can only be described as \"Emote-O-Rama.\" Say what you like about Crawford, she never gave any performance less than one hundred percent, and in STRAIT-JACKET she gives one hundred and fifty. In the opening scenes, 60-something Joan has the unmitigated gall to play Lucy in her 20s! Later, as Lucy in her 40s, Joan plays the role like a nice little old lady who occasionally drops acid: when she's not busy with her nervous breakdown, she sucks down bourbon, attempts to seduce her daughter's boyfriend (even to the point of putting her fingers in his mouth), knits like a fiend, lights a cigarette by striking a match on a record album, raises hell at a dinner party... and all of it about as subtle as a bulldozer.<br><br>But they didn't call her a star for nothing: not only does Crawford manage to carry it off with complete conviction, she actually manages to endow the character with considerable pathos along the way. And I have absolutely no doubt that THIS was the film Faye Dunaway studied the most when preparing to play Crawford in the infamous MOMMIE DEAREST; watch both back-to-back and you'll know exactly what I mean.<br><br>The rest of the cast is pretty interesting as well, featuring Diane Baker as daughter Carol, Leif Erickson as Crawford's brother, George Kennedy as an unsavory farmhand, and a very young Lee Majors as the ill-fated husband--not to mention Mitchell Cox, a Pepsi V.P. Joan was favoring at the time. There are cheap special effects (amazing, how she can neatly lop off a head or two with a single blow), Pepsi-Cola product placements, and even some dialogue that would do Ed Woods proud. It's all campy and bizarre and hilariously weird and ramped up to the nth degree by Crawford's full-force performance.<br><br>With a somewhat better script and production values, STRAIT-JACKET could easily have matched Bette Davis' more sophisticated HUSH, HUSH SWEET CHARLOTTE; as it stands, however, it is a cult movie in all caps. The DVD release is very nicely done, with the film itself in excellent condition. A collection of Crawford's costume tests gives a surprising insight to actress' personality, and a particularly nice little making-of documentary includes comments from Diane Baker. (Note: don't watch the documentary, called \"Battle-Ax,\" until after you've seen the film: it's a spoiler.) Strongly recommended to Castle, Cult, and Crawford fans! Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[75,80]},{"title":"''The Best In Axe-ploitation!''","rating":8,"date":"5 August 2005","review":"No matter what script she was given to do, Joan Crawford was a pro. In this William Castle classic, she proves it again. The plot has been rehashed in previous reviews, so I can get to the heart of the matter here. Joan plays an ex-axe murderess with typical fury, beautifully combined with a poignancy which may be completely unexpected, but nevertheless completely appropriate. Well supported by the underrated Diane Baker, Leif Erikson, Rochelle Hudson and George Kennedy, she gives meaning and depth to what otherwise would have been just another horror film. Whether playing scenes with daughter Baker's boyfriend (John Anthony Hayes) or his snobbish parents, (Howard St, John and Edith Atwater), Crawford is on the money, using her years of experience to transcend her material. Thanks to her, \"Strait-Jacket\" is a worthy thriller from a Legendary Star and a fondly remembered director. See Castle's other collaboration with Joan, \"I Saw What You Did\" (1965). It's a winner, too!","user":"phillindholm","rank":[36,41]},{"title":"Who says Castle couldn't direct?!?","rating":10,"date":"7 November 1999","review":"This is one of the most enjoyable horror films ever.  The closing credits gag reveals the spirit of the picture - it is not to be taken seriously.  By the way don't spoil a great laugh by reading what that gag is, in the \"crazy credits\" section.  This is pure camp fun, played brilliantly by Joan Crawford in an Oscar worthy performance.  The opening narration is hilarious - and Joan's get-up (black fright wig, clinging floral dress and clanging bangles) is outrageous.  You'll probably guess the surprise ending - but that's not what this film is about.  Besides the fun element there is also a subversive political statement - Castle sets his axe-murder horror on a sweet little farm, that looks like a set from a family sit-com.  And the family that live in it are too good to be true as well.  But all this is a facade, as insanity, lust and murder lie just below the surface.<br><br>Also of note in the cast are George Kennedy - excellent as the twisted handy-man, and Diane Baker as the perfect daughter.  And apparently that's Lee Majors being hacked up at the start of the film.  Castle does a brilliant directing job, but it's Joan's film all the way - what she can do with knitting and matches is truly amazing!  And the scene where she attempts to seduce her daughter's boyfriend is nothing short of magic.  I can't believe that an actress who could play this scene with such good humour, could have taken herself as seriously as \"Mommie Dearest\" suggests. Do not miss this over-looked classic.","user":"David-240","rank":[36,42]}]