[{"title":"Orson Welles as a Cretan?","rating":10,"date":"30 April 2005","review":"Writer/Director Orson Welles' F for Fake is a fast-paced, complex, surrealistic and philosophically thought-provoking documentary about fraud, fakery, and fictions. Even though its style is still novel when seen now, 30 years after F for Fake's first, quiet release in Europe, it was even more unusual in the context of the 1970s, and it presaged \"MTV-style editing\" by almost 10 years (considering that the style wasn't even the norm on MTV when that cable channel first appeared).<br><br>Even trying to tell someone what the film is literally about is quite complex (fitting for something that gives its title on screen as \"?: About Fakery\"), but we could say that it circles around six primary personalities, if we include Welles himself, who is frequently present on screen as a narrator/tour guide/resident magician. The core focus may be famed art forger Elmyr de Hory, who is supposedly responsible for a large number of fake Matisses, Modiglianis, Picassos, and so on that are hanging in museums around the world. Next up we have Clifford Irving, who wrote a biography of Elmyr de Hory, but who is perhaps more famous for writing a fake \"authorized\" biography of Howard Hughes. Next, we have Howard Hughes himself. Then there's Picasso. And finally, as a bookend to the film, we meet co-writer and long-time Welles confidant/partner Oja Kodar, who has many functions with respect to Welles in the film--assistant, surrogate, object of desire, and so on, and who had many more, perhaps questionable, functions with respect to Welles outside of the film.<br><br>Welles moves from topic to topic in a quick, stream of consciousness fashion, which is fascinating to think about in the context of the film, since stream of consciousness is by its nature spontaneous and unplanned, whereas the kind of meticulous editing that Welles does here takes months to plan, experiment with and finalize. So the apparent stream of consciousness is itself fakery, as suits a film that explores such ideas on countless levels.<br><br>Welles also weaves fact and fiction in F for Fake seamlessly, often without comment. The story of Oja Kodar and Picasso is fabricated, but much of the other material is more documentary in nature than one might think. It just happens to be documentary about creating fictions, whether impostors, as in de Hory's paintings (and amusingly, Welles himself--who had formal visual art skills--does a cartoonish portrait of Howard Hughes and signs it \"Elmyr\"); deceptive statements covering fictions, as in Irving's fake biography of Howard Hughes; manipulating public perceptions, as in the case of Hughes' and Picasso's public relations; creating artificial situations, as in Kodar's \"piece\" involving recording the reactions of men to her stroll through traffic; or combinations of all of these tactics, as in Welles' own work as an artist/entertainer, including the War of the Worlds radio broadcast (1938), which is portrayed here with clips from Earth vs. the Flying Saucers (1956) without identifying the conflation, Citizen Kane (1941), which was a thinly veiled portrayal of William Randolph Hearst but which Welles claims here was initially intended to be about Hughes, and of course, F for Fake itself. There are many other ways in which \"fakery\" is broached (even including subtle references to simulacra with items such as maps). The above are just the most conspicuous threads in the film. There is also a lot of criticism of \"expertise\"--Welles even conveys a kind of thoroughgoing skepticism as to its verisimilitude.<br><br>There are many ideas to be gleaned from F for Fake, but one of the most important, and certainly one intended by Welles, is that perhaps we're a bit too harsh when it comes to the conventional wisdom on frauds and fakery. Welles invokes the more accepted forms of fraud/fakery such as fictions and magic, and suggests that perhaps what is most important isn't the status of a work in terms of whether it is derivative or has precursors, or an artist's intent when it comes to originality and such, but merely the aesthetic quality of the work in question. If we believe a painting to be good, aesthetically, is it any less good aesthetically when we later learn that it is \"merely\" a copy of a Matisse, or a fake Picasso? The work itself didn't change--only our background knowledge has changed. Is our background knowledge part of the art object that we're judging? These are not easy questions to answer. A lot of ink has been spilled in the philosophical field of aesthetics over such issues. Even if we have an answer we're comfortable with--and mine happens to agree with Welles'--we have to admit that it's not a very clear-cut issue. At least not as clear-cut as the popular attitude towards frauds/fakery has it.<br><br>But even if you were to watch F for Fake without cognizing the ideational content, it would still be a fascinating and rewarding experience. The cinematography is as varied as a typical Oliver Stone film, and it's frequently beautiful (just look at the marvelous shots of Welles sitting on the bench in a park at \"different times of the year\"). The cuts from one shot to the next are captivating, with Welles even using edits to construct sentences. Welles will say a few words, he'll immediately cut to Irving, then to de Hory, and maybe back to himself, with all the words flowing together as a single line of \"dialogue\". There are also stark contrasts with this style, as in the latter section of the film, which has longer periods of Welles and Kodar simply standing in a large empty space, talking to each other, verbally relaying the story of Kodar, Picasso and Kodar's grandfather.<br><br>While F for Fake isn't exactly \"light viewing\", and anyone not acclimated to documentaries might have difficulty appreciating it, it is a masterpiece that any cineaste should be familiar with.","user":"BrandtSponseller","rank":[43,48]},{"title":"The masterful legacy of the man who changed the history of modern cinema","rating":9,"date":"17 September 2000","review":"\"F for fake\" stands for the last movie Orson Welles really directed and, as for many artistic legacies it's the final demonstration of the genius of the artist, becoming some kind of briefing of his entire career.<br><br>It's hard to explain this movie and why I really enjoyed because, as many other Welles's movies, it's full of surprises and twists.<br><br>Filmed as a Documentary, this film introduces us the personae of Elmyr, a painter who lives out of painting copies of famous pictures of Van Gogh, Picasso, Vlaminck and many others and making them look like they're the original one.  Welles also introduces to us two more people; an actress and a biographer.<br><br>With many resemblances to Welles's own life, the director of such wonderful pieces as \"Citizen Kane\" and \"Touch of Evil\" plays with the audience some sort of magical trickery.  What is real and what is not?  If Elmyr is able to paint a perfect copy of a famous picture and fool the world greatest experts, is he as good artist as the originals he's copying?<br><br>Working as a perfect metaphore of Welles own experiences in art (he's not only been movie director but radio speaker and even painter) \"F for Fake\" remains as a perfect legacy of the ideas of one of the greatest and most gifted cinema artists. Don't miss it!","user":"Marc Ambit","rank":[39,45]},{"title":"F For Fantastic, Farouche, Fanciful, Farcical, Fabulous.","rating":6,"date":"6 September 1999","review":"There is so much zest, wit, fun, cheek, energy in this supremely entertaining film, that it's a crime that Orson Welles never directed another one.  It's packed with as many ideas and potential future directions as CITIZEN KANE, but bizarrely hasn't received an nth of that classic's acclaim.  Indeed only Godard's later documentaries seem to be at all influenced by this delightful fancy.<br><br>The film dazzles on so many levels.  As a story about five interesting characters - two art forgers, a charlatan biographer, Howard Hughes (famous recluse, and disseminator of misleading information and doubles), and the great Orsino himself, myth-maker and magician.  Their stories, fascinating in themselves, mingle, juxtapose and clash, to provide a complex essay on the nature of art, the links between illusion, life, forgery and artifice.<br><br>Elmyr is a master forger whose 'works' appear in many galleries.  His story makes us ask: what is art? What is it about art that moves us - the thing itself, or its perceived value?  In an age of mechanical reproduction, can authenticity survive, is it a viable (or even desirable) option?  Does any of this actually matter?  Maybe because everything in a post-modern culture is reproduced, the aura of the original work of art (pace Benjamin) becomes even more powerful.  Or maybe a proliferation of fakes, doubles, illusions asks us to profoundly question received truths, official versions, 'authorities', who would make us believe in repressive wholes and canons, stories that tell one experience, and deny many others.  Art itself is a forgery, of nature or the imagination - the forger is little different from an interpreter (e.g. Welles and Shakespeare): he cannot help stamping his own personality on the work.<br><br>These questions are very complex, and cannot be grasped in one viewing. The film's form is bewildering and exhilirating.  Welles promises us, in this tale of fakery, truth for an hour, but this is a truth we must make out for ourselves.  Breathless narration; visual puns; the weaving of documentary footage, stills, reconstructions, other films; tireless, confusing editing; rapid subject changes; all manage to disrupt and complicate an essentially straightforward story.<br><br>Welles the narrator is an absolute delight, a jovial trickster, with his gorgeous hearty laugh, games, aphorisms, comments, allusions; and yet behind it all is an extraordinarily depressing account of his own career, the perception of failure and broken promises, and the onset of mortality.<br><br>The last 20 minutes is an extraordinary coup de cinema, as well as a masterpiece of storytelling.  The Legrand music is playful and energetic, before finally slowing down for a very melancholy climax.  This film is a remarkable one-off: frustrating, irritating, stimulating, astonishing, hilarious.  It always pulls the rug from under your feet, and you gleefully await your next tumble.  Only Bunuel began and ended his career with the same passion and genius, the same desire to demand the most from his audiences, refusing to rest on his considerable laurels.  Absolutely wonderful.","user":"alice liddell","rank":[62,75]}]