[{"title":"All About Great Writing and Great Acting...","rating":10,"date":"20 March 1999","review":"In show business, there is probably an Eve Harrington born every day. Someone who butters up to a performer of note, acting innocently, revealing none of the coldhearted ambition they really have.  Anne Baxter plays this type of person to a tee.  She looks like a baby-faced fan, but little do we know, there is a fame machine at work in her mind.  Bette Davis, as Margo Channing, star of the stage, is a veteran who has seen it all.  She is quite the egotist.  Margo is a brilliant actress and she knows it.  Eve discovers her blind spot and moves in on her like a quiet storm.  This is the premise of ALL ABOUT EVE, Joseph L. Mankiewicz's masterpiece of sly wit and subtle manipulation.  Mankiewicz also wrote the picture (winner of the Best Picture Oscar of 1950) with such skill, the talented cast need only to memorize the lines and deliver them with the proper technique.<br><br>The performances are great, regardless, especially by Bette Davis and the always detested George Sanders, one of my favorite actors of the Golden Age of Hollywood.  The film is narrated initially by Sanders, who plays a ruthless swine of a theatre critic, then by Celeste Holm, the wife of Eve and Margo's playwrighter, then Bette Davis in the performance of a lifetime. The movie is about 90% dialogue, much like a play.  The words are so crisp and sharp, you never sway or lose interest.  These characters are just too interesting.  Bette Davis has a cavalcade of unforgettable dialogue. \"Fasten your seatbelts.  Its going to be a bumpy night!\"  This is the one everyone remembers, but I would be remiss to get into any others.<br><br>The picture runs well over 2 hours, but it doesn't seem like enough. Mankiewicz could've held a seminar of screenwriting by showing this.  George Sanders is the only actor of the roster to bring home an Academy Award, and rumor has it Davis and Baxter, who was just 27 at the time, were feuding during much of the shoot and lusted the Oscar.  Time has been very good to the film as well.  1950 was a wonderful year for movies and ALL ABOUT EVE's artistic equal that year was the equally well-written SUNSET BOULEVARD, which took us behind the scenes of a tainted Hollywood.  EVE takes on theatre and treats Hollywood like an afterthought.  There are many references to the film industry, usually involving the scenes with Margo Channing's boyfriend, who is attempting to make a career on the silver screen.<br><br>The movie is highly unpredictable, especially the last scenes which tie the ideas of the story up.  There is an Eve everywhere and each character gets what he or she deserves. Fasten the belts and listen up.  This is screenwriting at its finest.","user":"Don-102","rank":[84,96]},{"title":"Icons On The Verge","rating":10,"date":"12 July 2011","review":"As close to perfection as they come. A film than can be viewed again and again without ever getting tired. Bette Davis's Margo Channing is a film icon of major proportions. A point of reference. Her fear of the abyss is as human as it is at the center of this selfish, insecure, sacred cow. She is surrounded by some other sensational women. Thelma Ritter, Celeste Holm, Anne Baxter and in a tiny but telling part, Marilyn Monroe - a graduate from the Copacabana school of dramatic art. Wittily prophetic. George Sanders is another piece of extraordinary casting and writing. \"I'm essential to the theater\" Indeed. And here is a film that has become essential to anyone who loves movies\"","user":"kehoerobert","rank":[48,54]},{"title":"About EveryMan, About EveryWoman, About EveryLife","rating":10,"date":"11 August 2005","review":"You will see yourself in every character in this very intelligent, entrancing movie. Though set in \"the theatre,\" the story could just as easily have been told in a small town, a corporation  even a religious organization. Being set in the \"glamorous\" world of entertainment  its seems all the more timely in these days of fame, fortune and the insufficiency (almost shame) of being ordinary. The theatre setting also underscores the reality that the world is a stage, and all its people, players.<br><br>So much to study in this movie: the genuine, trusting (and romantic) human; the streetwise, good, hardworking human, who's seen it all and doesn't embrace it; the jaded, heart-hardened, deceitful loser with power, who admires the same and disdains human goodness; the ambitious sociopath who fools so many; the unsuspecting onlookers who see only the façade of success; the inescapable fact that supreme achievement has been had by very low characters; the painful passage of an aging woman into the light of knowing she's loved for being beautiful beyond her appearance, for being HER; the touching portrayal of her lover who remembers his love for her as he passes on a much younger, beautiful, talented actress; the sorrow of a (betraying) friend who discovers the frightened and lonely heart of her successful friend  The dialogue is sharp and clever, barked and growled, smarmy and tender A truly human movie about being human. Go  find yourself in everyone!","user":"anita_delre","rank":[59,69]}]