[{"title":"This is such a BEAUTIFUL film, with a message that will never die.","rating":3,"date":"3 March 2001","review":"Although I was only a year old when the Neverending Story first came out, I remember watching it over and over as a little girl. My grandma got it for me when I was little and I remember making her watch it with me almost every day--sometimes two or three times in the same day. Then somehow I lost the tape, and although I still remembered and loved the movie, I forgot just how magical it really was. Then finally, (after years of \"I wonder what happened to...\") I found it. I realize now that in finding it I not only rediscovered a part of myself, but a beautiful world I forgot existed.<br><br>I admit that I am still waiting for a luck dragon to come and take me home to Fantasia. I belong there. A part of me lives there and so does a part of everyone, although they may not be aware of it. This is without a doubt the most beautiful movie ever made (although Legend comes close) and its message will never die as long as people hold on to their dreams. Barret Oliver's performance as Bastian still makes me cry. He speaks to that part of all of us that is not afraid to \"do what we dream.\" Noah Hathaway was perfect for the part of Atreyu. He is one of the most beautiful and realistic heroes ever depicted. And Tami Stronach as the Childlike Empress (Moon Child) remains one of the most beautiful characters ever to grace the screen. The acting is wonderful, and the background scenery is breathtaking.<br><br>But the Neverending Story is more than just a movie. It speaks to that part in all of us that will never let go of our dreams. It is a story that will never end as long as there are people to appreciate its message. Everyone should see this movie and remember: Fantasia IS real. And \"Fantasia can arise in you.\"","user":"Moon Child","rank":[215,250]},{"title":"My life changed that autumn afternoon...","rating":23,"date":"23 June 2001","review":"The Neverending story is by far the best \"Fantasy\" film ever made and I doubt that it will ever be topped. I saw this movie with my dad one cold autumn afternoon, and my life changed forever that day. This movie taught me that fantastic places and wonderful creatures really do exist. You only have to want them to. Even today, aged 23, working in the computer industry, I find myself slipping in the Neverending Story soundtrack in my CD player and dreaming away to Fantasia...<br><br>This movie the most beautiful and touching movies ever created. It's an example of a timeless story, told with wonderful creatures and dazzling vistas of the land of Fantasia. The amazing and perfect soundtrack help capture your heart and won't let go until the end credits fill the screen. At which time you notice that you've been crying for the last ½ hour. I consider myself extremely lucky that this wonderful movie was shown to me at such a young age, telling me that the world is what you make of it.<br><br>And luckily, this September I can watch it all on DVD!!<br><br>This is a masterpiece, nothing less","user":"JohYowza","rank":[222,276]},{"title":"Dark, if not surreal fantasy delivers a good message.","rating":10,"date":"23 May 2005","review":"Finally, the truth about stories. The fact is, nothing ever really ends, and thusly, someone had to say so. That's what this movie does, and it does it ever so elegantly. A young boy, who knows so much about the \"Lord Of The Rings\", and \"Beowulf\" is about to find out something more real as he borrows a mystical book he finds enchanting. the even more powerful fact, is that once the book is opened, it will never close. Just as life never really ends on this earth, neither to stories. The book, titled \"The Never Ending Story\", is about Fantasia, a world that is dying, and an unbelievably horrifying substance known as \"The Nothing\", is enclosing it. A young warrior must face the danger of finding a cure. On earth, or in the book, life is intertwined to reach the ultimate answer to a young boys fears, and a young warriors quest. Film is full of some really lovable characters such as Falkor, the luck dragon, and the Rock Biter. Then, there is the Gmorg, whom I believe, is the most wretched creature in cinema. That thing is scary! In any case, film starts out as colorful and mystical, and grows dark and nightmarish with every scene, leading to a wonderful message about the substance that keeps Fantasia , and every other world out there, alive. Beautiful, just beautiful. A classic.","user":"Banshee57","rank":[88,106]}]