[{"title":"Great little horror flick from a very accomplished team of horror film makers.","rating":9,"date":"20 July 2004","review":"From the team that brought us the horror classic; Re-Animator comes From Beyond; a tale of a mad scientist and his search for the ultimate pleasure.<br><br>Like Re-Animator, From Beyond is based on a story by the fantastic horror writer H.P. Lovecraft. The acting here comes courtesy of two of Re-Animator's best actors; Jeffrey Combs, a man that is well known in the world of B-Movie, and Barbara Crampton; the scream queen that we all remember from the infamous 'head' sequence in Re-Animator. There is also a role in this movie for Ken Foree, whom horror fans will instantly recognize from the classic film, Dawn of the Dead. I didn't know he was in this movie, so it was a nice surprise for me. From Beyond is also brought to the screen by the same team that brought Re-Animator to the screen; Stuart Gordon in the director's chair and Brian Yuzna producing. With a group of people as accomplished in the horror genre as this fine bunch, what could possibly go wrong?<br><br>The plot of this movie is good because it very much plunges into the unknown, and as well all know; it is that which makes horror frightening. This movie is also made good by the fact that once the horror starts, it doesn't stop and that's always a good thing for a horror movie as nobody likes waiting for the next horror sequence to turn up. The team of Gordon and Yuzna obviously knows that relentlessness makes a good horror movie as it is evident in all horror movies that they have worked on, together or separately. The idea behind it is also an original one, as ever with H.P. Lovecraft and it leaves a lot open for creativity, which is capitalized upon very well by Stuart Gordon with his interesting and effective creatures that are brought into the film as a result of the scientist's foray into 'the beyond'. The story, it could be said, is unrealistic, which is true of most horror films. However, the way it is brought to life seems realistic and as there is some explanation to the point of the machine and that which it does, so the audience can somewhat believe it; much to the film's credit.<br><br>In the 80's, horror reached a new point; gone was the creativity of the 60's and 70's, and a new area of over the top and extremely gory horror was opened up. From Beyond very much capitalizes on this 'new wave', but unlike a lot of the 80's films that did, From Beyond manages to pull it off so it is both interesting and creative and therefore it is a cut above the majority of other 80's films of the same ilk. From Beyond is not a masterpiece, but it is very good and fans of the horror genre will certainly find something to like about it. Recommended.","user":"The_Void","rank":[66,79]},{"title":"one of the wildest and most entertaining horror films","rating":8,"date":"21 November 2005","review":"Its been a while since I saw this, but I fondly remember it as being one of the wildest and most entertaining horror films of the 80s. I liked it even more than Re-Animator, partly because there is something more intriguing about parallel dimensions and the connection to schizophrenia, than Re-Animators simple (though still entertaining ) \"dead come back to life\"-scenario. Some of the outlandish effects seem to be influenced by Dali, bodies in a constant state transformation and re-evaluation. It is mind-boggling that it is still so hard to get a hold of on DVD, I only watched a British VHS copy years ago which had some cuts and I still long to see the original unrated version. The score, by Richard Band, is also impressively aggressive and atmospheric. Would somebody please just release it on DVD! They just don't make them like this anymore.","user":"fred-83","rank":[34,41]},{"title":"Campy and cheesy at times but spine tingling all the way thru","rating":10,"date":"20 April 2002","review":"This is done by the same crew that gave us ReAnimator and while it follows in the same tradition of camp, cheese, and corn, \"From Beyond\" offers something more. There is sexier sex from Barbara Crampton, fresh from the Young and the Restless daytime soap. It is hard to decide if it is her Femme Fatal or her Black Leather Dominatrix that is the sexier. She does them both so well. Jeffery Combs gets a true starring role in this time out and offers much more depth to his reluctant hero character. His mentor/adversary Dr. Pretorius, played by Ted Sorel, is the essence of perverse genius. The special effects are also more intense and a step beyond anything else you're likely to have seen. Especially the battles between Pretorius and Combs' character, Crawford Tillinghast. With all the tongue in cheek humor, the campy sets and costumes, and the cheesy dialogue there still lies a truly spine tingling and disturbing storyline beneath it all. This movie could have easily been just another campy horror film but the terror of perversion makes it so much more.<br><br>This film disturbs and entertains, excites and amuses a unique vision unlike anything else.","user":"ElvesBrew","rank":[49,64]}]