[{"title":"a splendid period piece of a dark part of South Africa's history.","rating":12,"date":"12 July 2004","review":"I believe this to be one of Marlon Brando's most underrated performances. The film itself is a splendid period piece of Apartheid South Africa. I rarely see this movie mentioned in biographical comment with regard to Brando's career, and yet, it is a stunning performance. I assume the lack of comment is the fact that he only played a supporting role, and that the subject of apartheid probably denied it a higher profile. As somebody who has lived in South Africa, both before and after apartheid, i cannot tell you how accurate the performance of Brando is in this role. There is no doubt in my mind that he must have studied meticulously before playing this part. I do not know why, but there are a large percentage of professional people in South Africa who have an almost perfect \"Queen's English\" accent...but it is tinged with a slight South African edge which only the most perceptive can detect. Not only does Marlon Brando capture this perception, but he somehow manages to replicate it, which i have always found truly incredible. You would have to live South Africa to know how fantastic his voicing is in this part, but believe me, apart from the power of his acting, this role is a truly stunning illustration of his amazing ability. I hope this movie will obtain the higher profile it deserves in the future.<br><br>Manny Wah Hong Kong","user":"hkmanwah","rank":[35,39]},{"title":"Accurate but incomplete portrayal of the old South Africa","rating":9,"date":"29 March 2005","review":"If you want to understand what the old South Africa could be like at its worst, this movie accurately portrays it. Well acted and only slightly over-dramatized, it gives you the sense of how the ruling culture was blind to its own injustices. Those who oppose the main character from within his own family make some valid points, and that makes it all the more chilling.<br><br>As someone who lived in South Africa until shortly before the year this movie is set in (and was forced to leave because I opposed apartheid), I can't fault the authenticity of this movie but I want to caution viewers not to form all your opinions of white South Africans from this type of film. There is a good side to every culture, but it is harder to portray and doesn't always make great box office.<br><br>If this movie leaves you hating anyone, you are taking away the wrong message. If it leaves you realizing this could happen anywhere, and ordinary good people can easily find themselves on the wrong side in situations like this, that is the right message to take away.","user":"ctepizkp","rank":[48,56]},{"title":"watch it and never forget.","rating":10,"date":"24 April 1999","review":"One day in South Africa in the 1960's, a young black man was walking along the street with his aged mother.  Coming along the road was a young white man.  The young black man knew that apartheid law and custom meant that the white would probably barge the two blacks off the pavement and into the gutter. The law would protect him and the young black man might be imprisoned for defending himself.  The young black man tensed his muscles and prepared to defend his mother, but was amazed when the Englishman stepped off the pavement and doffed his broad brimmed hat in greeting. Later on the two would become friends and allies.  The white man was to become bishop Trevor Huddleston, the black man, bishop Desmond Tutu.<br><br>That story is NOT the story of A Dry White season, but it is of a kindred spirit.  Like the gesture of Trevor Huddleston, the story of Ben de Tor is a gesture against apartheid.  A glimmer of hope, but merely that, a flicker.<br><br>It must be five years since I saw a Dry White Season but I still remember how I felt leaving the cinema.  It is a film which will stay with you.<br><br>The plot follows a white South African on an adventure through bewilderment, revelation, denial, disgust, and a futile attempt to fight a grossly unfair system.<br><br>I can't go into detail after this length of time but the cameos in this film would be worth the video rental.  Marlon Brando (yes) steals the show as the lawyer who knows exactly how hopeless the fight against apartheid is but agrees to fight anyway.<br><br>The political situation today in South Africa is a world away from that of A Dry White Season.  Watch it and never forget.","user":"shell-26","rank":[43,50]}]