[{"title":"Realistic horror","rating":6,"date":"23 February 2006","review":"I think of Cujo as \"realistic horror\" because it is something that could really happen. People really do get killed by rabid dogs...this film just exaggerates the truth a bit. I can't say I really enjoyed this film as it is not what I look for in horror films. It's a very good film - well acted, well directed, suspenseful and emotional, but it's not really \"fun\" to watch. It starts off with the dog getting infected, and from then on tension is built up slowly as you sense the dog is getting angrier and angrier. Eventually it snaps and starts killing people. The bulk of the film focuses on when Donna and her son are trapped in the broken down car because Cujo attacks whenever they try to leave. You can feel all the desperation, pain and isolation of Donna and her son as they lay trapped inside. It makes you think twice about dogs and certainly what you would do in such a situation. Would you run, attack the dog, or wait until help arrives? <br><br>This is not a fun, campy or cheesy horror film, so don't watch if you're a fan of cheese. It's for those who want to feel suspense, fear and pain.","user":"Tikkin","rank":[51,61]},{"title":"A film that tells you that your demons will come back to haunt you.","rating":8,"date":"16 July 1999","review":"We all know Cujo is a giant St. Bernard that has to kill because he is rabid.  The film works as a horror film because of that concept, but this film and the story writer behind it believe that paybacks are a bitch. Retribution is always around the corner and when it is your time, you don't know if it is going to from a guy in a hockey mask, a massive great white shark,a 58 red and white Plymouth Fury, some idiot with long finger knives or a lovable Saint Bernard.  Whatever it is though, sin always accounted for.  Cujo subscribes to that theory.<br><br>Everyone that dies in this film, with the exception of maybe one, does so because they are not very likable people to begin with.  They are all tainted and when Cujo gets a hold of them, we are almost glad that he wants their blood.  But it is the climax of the film that is the most intriguing. Because here we have a woman who has gotten rid of her sin.  But she now has to face the music not for what she is doing, but for what she has done. And if you read the book, you will see that it sticks to that theory and message much more than the film does.  It is understood that Cujo has to have a happy Hollywood ending, and that is fine, but the book tells a much more clear yet paradoxically convoluted tale of a boy, his dog, and how sin is never really forgiven.<br><br>What is also great about Cujo is how it shows the dog coming unravelled. We see the transformation from lovable suck of a family dog, to vicious killing machine that has an insatiable need for blood.  We see his nose get more wet, we see how certain noises bother him more and we see how much saliva this dog has stored up in his nasty mouth.<br><br>Cujo is a good movie.  It is scary, especially the last half hour and it actually has a point.  It also does a fairly good job of bringing King's vision to life.  It is not easy to do that, after all King has a very vivid imagination.  But Cujo comes close.  Very close","user":"baumer","rank":[68,89]},{"title":"Hardcore horror.","rating":6,"date":"10 December 2000","review":"Hardcore horror fans won't be disappointed (although for a while they may think they will be) with this extremely bloody and gruesome shocker. The attack scenes are about as intense as possible - the director almost pushes them TOO far. But the first half of the movie is plodding, filled with unnecessary scenes, and the kid's constant whining (although justified) is sure to get on your nerves.   (**1/2)","user":"gridoon","rank":[32,44]}]