[{"title":"Restored ! with nudity!","rating":9,"date":"19 June 2005","review":"THE AGE OF CONSENT made in 1969 on Dunk Island of the great barrier (coral) reef was quite a success in Australia in its day. Apparently though it was heavily cut Internationally with some nude scenes deleted and the first 10 minutes shortened. Well the planet can now rejoice because a carefully restored complete version is now available and has had a premiere screening in Sydney in the magnificent 2300 seat State Theatre as part of the 2005 Sydney Film Festival. It will appear Internationally in festivals and then on DVD for all to savor. The story is by Norman Lindsay, a world renowned artists whose bacchanalian paintings of luscious nude sirens have caused erotic reactions (good and bad) for over 100 years. (See the film SIRENS)..... THE AGE OF CONSENT details an artist (here called Bradley Morrison) similar to Lindsay, played by a fit and tanned James Mason who travels to tropical isolation in an attempt to regain his artist eye. He does of course with the form of shapely nude teenage island muse, Cora: Helen Mirrenin her first voluptuous role. There is so much to enjoy in THE AGE OF CONSENT from Mason and Mirren's balanced careful performances to the secondary characters, mainly in the form of spectacular handsome and virile 24 year old Harold Hopkins, an Australian actor in one of his first appearances. He has been unjustly ignored in this film's reputation and it is time to celebrate his appearance (as the spunky gauche youth, Ted) and recognize his astonishing good looks and hilarious turn trying to be Cora's boyfriend. Ten years ahead of Mel Gibson and far better looking, fitter and far more screen presence. Unfortunately his film career did not succeed as well. Today, Hopkins is not well known and looks more like Andy Warhol. Celebrated Brit director Michael Powell whose comedy THEY'RE A WEIRD MOB was a massive local success in 1966 turned his adept hand to this romantic tropical artistic fruit salad with generally very enjoyable results. Certain sequences just between Mirren and Mason are so effective that the viewer is left with the extraordinary feeling of having actually been there with them that day on the beach. Sadly this was Powell's last film in a career lasting over 30 years producing endurable classics in both the UK and Oz. Subplots involving Mason's racing pal who pesters him for cash and follows him about, to Cora's hag-like granny who berates her beauty are overplayed and create pantomime, but this is a small detraction from what is a generally astonishingly visually beautiful romantic drama of loneliness and artistic endeavor. The color photography, I was thrilled to learn, was achieved by duplicating the original Technicolour method of a three reel tint (YCM) on black and white stock then matching all three to create a color negative. As I marveled at the sublime color of this restored print I had wondered how it was so perfect. An after-film Q&amp;A segment revealed this color film(ed) method and I am happy to pass on this important piece of tech info. THE AGE OF CONSENT is a film of its time but also with content explicit and exquisite for a new century audience. If one gets the opportunity to see this restored version, it contains visual delights and location atmosphere captured carefully and restored lovingly that transfers to the viewer with humorous ease. Yes Mirren has hairy legs and Mason doesn't wear underpants and the lesser characters are Aussie parrots..but that's part of the story! Enjoy THE AGE OF CONSENT. It is a film of which Helen Mirren today would be especially so proud...as would Harold Hopkins. One scene where Cora wistfully buys herself a cheap children's plastic handbag at the local store is genuinely touching depicting her lonely wish to own something 'nice'. The delusion and loneliness captured perfectly for this beautiful sad girl stuck in paradise but without real appreciation (except for Mason). The opening scene is now hilarious with a risqué painting of the Columbia woman Logo as part of a provocative art exhibition.","user":"ptb-8","rank":[106,117]},{"title":"He only wanted her for her body","rating":13,"date":"13 May 2004","review":"He only wanted her for her body--to paint, of course....<br><br>I just saw this film and found it absolutely delightful. As others have noted, Helen Mirren is a wonder as a young girl working out the relationship between her body's strength and its beauty, and how each can help her get what she wants. There is one moment, when she takes control of a motorboat after having dumped a would-be lover overboard, when I saw the future Jane Tennison. James Mason is also marvelous as the obsessive painter. The natural setting, on the Great Barrier Reef, is liberating and beautiful but the heart of the movie is the little cabin which goes from a dump to a layered, painted work of art. This man's passion to make things, to create color and line on every available surface, seems to fill the movie's surface too. Near the end, when Cora enters the cabin and we see her surrounded by his paintings of her, the relationship between art and life seems to be a very happy one. It's too bad Michael Powell didn't get to make more films in the 1960s and early 70s. I think that if I could have seen this film at the time it was made (when I was a girl in my late teens, for whom nudity was not an option) it would have meant a lot to me.","user":"jshoaf","rank":[56,62]},{"title":"A light film, with some hilarious moments.","rating":24,"date":"24 October 1999","review":"Compared to the many classics Michael Powell had previously directed, this Australian film is just a light, piece of fluff, but it is worth watching to see the young Helen Mirren and another solid performance by James Mason, who must have had a particular interest in playing this part as he also co-produced the film. Don't be misled by the title, the issue of sexual relations between an older man and an under-age girl is only really hinted at, the main theme being the need for an artist to find new inspiration. The tone of the film is essentially light, and, for me, the highlight is a couple of hilarious scenes in which Jack McGowran, as Mason's scrounging mate Nat Kelly, meets his comeuppance at the hands of a man-hunting neighbor of Mason's.","user":"pinback-3","rank":[40,44]}]