[{"title":"Very few risks in this heist film","rating":5,"date":"24 April 2018","review":"Thief Mike Daniels (Albert Finney) plans to break into the biggest bank in England for one last haul. His team sets up a false office in order to interview architects with the idea they can coax the suitable candidate into mapping out their underground digging job. Down-on-his-luck American Stephen Booker (Martin Sheen) seems to be the ideal candidate for the job, but he scoffs at the idea of being a criminal. That is until he finds out his wife (Susannah York) reallllly wants to start up her interior decorating business. OH NOES! So he descends (literally) into a life of crime in order to finance her dream. The \"loophole\" of the title refers to the fact they will break into the vault through the ground and set off a motion detector, but when the cops arrive they will see no one inside the bank and think it is glitch. I'm a sucker for bank heist pictures for some reason and this one definitely falls into that category. Unfortunately, while it has a great cast and is well made, it really takes no risks. There is some tension in the final third as rain starts to flood the sewer system and the men must rush to get out, but even that is handled rather mundanely. Sheen also sticks out like a sore thumb and it is easy to believe the role was written for a British fellow (his wife is a Brit after all) and then changed to an American to increase potential markets. Still, it is worth a look at least once if you loves you some men digging in confined spaces.","user":"udar55","rank":[7,7]},{"title":"Solid bank heist thriller","rating":6,"date":"22 August 2017","review":"LOOPHOLE is one of those bank heist thrillers that were all the rage in the late '70s and early '80s. Other worthy additions to this sub-genre of filmmaking include SEWERS OF GOLD and A NIGHTINGALE SANG IN BERKELEY SQUARE. This one's a little slower-paced than those, a little grittier too; it's more of a character piece, with Martin Sheen's protagonist getting plenty of back story in particular. The heist itself doesn't occur until the climax, but it is very well portrayed with a maximum of suspense. Another highlight is the supporting cast, made up of familiar character actors, all of whom do their bit; watch out for Albert Finney and the likes of Jonathan Pryce in an early role.","user":"Leofwine_draca","rank":[4,4]},{"title":"The \"so called\" impossible bank heist","rating":9,"date":"19 August 2010","review":"This is a very good caper film. The crooks are very professional, and they do not use any forms of violence. Martin Sheen plays a down on his luck architect, drawn into assisting with a large bank heist involving the use of the underground sewer system. The pace of this film is slow, but it keeps the viewers interest. Jonathan Pryce appears in this film in an early role as one of the crooks. Albert Finney is great as the leader of the gang, and Colin Blakly is equally good as his assistant. Susanah York does not have much of a part as Martin Sheens wife. I give this film a nine out of ten. It is definitely worth a look. See it if you are a fan of caper films, see it even if your not a fan of caper films.","user":"Tony Rome","rank":[10,13]}]