[{"title":"Surprisingly good! Atmospheric and imaginative witchcraft chiller.","rating":9,"date":"9 November 2002","review":"'Horror Hotel' (sadly the copy I bought has this tacky title, which is the only thing I can fault about it) really surprised me at just how creepy and atmospheric it was. I was expecting some camp fun, but it is actually a very effective and inventive movie for such a cheap effort. The story sucks you in, and the acting for the most part is above average. Christopher Lee is billed as the star, which isn't exactly true, but he is excellent in his scenes, and Patricia Jessel is even better in a very enjoyable duel role. I also admire how director John Moxey (his movie debut. He also went on to make 'Circus Of Fear') was able to conjure up a spooky New England town with basically just a few sets and some fog. A great example of imaginative low budget horror movie making at its best! Highly recommended to fans of 'Carnival Of Souls', and 'Black Sunday'. 'Horror Hotel' isn't a great an achievement as either, but it shares some similarities in style and feel. This is one extremely underrated movie!","user":"Infofreak","rank":[70,76]},{"title":"One of the best B&W horror movies of the 60's.","rating":23,"date":"23 October 2002","review":"I first saw this movie in the mid 70's late one Saturday night on Sinister Cinema in Portland, OR and it kind of scared the crap out of me. They replayed it about a year later and same thing: It scared the crap out of me. I have now seen it 6 or 7 times over the years including twice in the last few months with the VCI Entertainment version of the dvd.<br><br>The movie doesn't scare me like it used to, but it still amazes me how it transports me into it's own world of the fog shrouded town of Whitewood, Massachusetts. The story itself is common enough: A woman (Patricia Jessel) is burned at the stake for witchcraft and she leaves a curse on the people of the town as she is consumed by the flames. Forward 300 years to the present day and we have Nan Barlow (Venetia Stevens) as a self determined college student who decides to write a paper on witchcraft. Her professor, Alan Driscoll (Christopher Lee), gives her directions to the town of Whitewood where 300 years earlier an alleged witch was burned at the stake. She goes to the town and after a few days disappears. Her brother then goes to the hotel where she was last seen, and runs into all kinds obstacles, not the least of which is the innkeeper of the Whitewood Inn, who just happens to look exactly like the witch burned 300 years earlier, and also Christopher Lee who happens to be a long ago resident of Whitewood<br><br>There is an old, blind priest who stays in his church despite the fact that he has no congregation. His granddaughter, Betta St. John (Patricia Russell), who seems to not be a witch, and has just returned to the town to take care of her grandfather, runs the local used book and antique store. She had befriended Nan before she disappeared and is now working with her brother, Dennis Lotis (Richard Barlow), to try and find out what happened to Nan.<br><br>Of course they run into the witches along they way and there is a showdown of sorts. The strength of this movie is in it's crisp acting and smart script. Especially notable are Patricia Jessel, Christopher Lee and Venitia Stevens. Despite it's low budget, the director, John Llewellyn Moxey, has made an altogether unforgettable film. This ranks right up there with other unique horror movies such as Carnival of Souls (1962), The Wicker Man (1973), The Thing From Another World (1951), and Village of the Damned (1960).<br><br>The VCI Entertainment release is just what this movie has needed for years. An excellent transfer at 1.66:1 with two extra minutes of footage added from previous video and dvd releases. There is a commentary by director John Llewellyn Moxey and another separate commentary by Christopher Lee. There are also three interview segments with Lee, Moxey and Venetia Stevenson. Pretty impressive extras for a 40 year old low budget movie.<br><br>The commentary by Christopher Lee is interesting in that he has not seen this movie since it came out 41 years earlier. He is watching it with an interviewer from VCI who knows more about what is going on in the movie than Lee does. But Lee's ability to recall information about people and give anecdotal information is unsurpassed. He is literally a walking, talking encyclopedia of info on people he has worked with over the years.<br><br>This is one of my prize dvd's and I really cannot recommend it highly enough. The VCI version lists for around $25 but I have seen it cheaper. There are also several basic versions without the extras (or extra footage) of the movie along with another movie on one dvd. Most notably the Diamond Entertainment version where it is packaged along with Carnival of Souls for under $10.","user":"Rastacat1","rank":[42,45]},{"title":"An Incredible Piece of Studio Bound Horror!","rating":4,"date":"4 June 2000","review":"A true masterpiece and a perfect example of how imagination and desire can overcome a small budget in film making! \"Horror Hotel\", aka, \"City Of The Dead\" is one of my all-time favorite horror classics. Beautiful black and white photography, a stock pile of atmosphere, a literate script, terrific acting and chills galore! I have seen this gem many times, first when I was very young and caught it on the Late Show. It has had an effect on me everytime I see it. The plot seems familiar I am sure, a witches cult is operating in a small New England town but there is much more then that! From Christopher Lee to the chilling witch hunt and stake burning of the opening to the climatic battle with the coven in the graveyard. Outstanding! Mist and fog drown this small town and what strikes me most is that this entire production was studio bound!!! no location shooting, all done in a studio and it comes off without a hitch! I happen to have a copy of this film on video that I cherish. It's not a newly remastered, pristine copy. It's a copy that seems to have been copied from a television broadcast and I love it! It looks grainy, old, had pieces of hair and dirt on it and I wouldn't trade it for the world. It brings back great memories of films shown when I was young in the 60's and 70's and adds an extra dose of charm and atmosphere to the film. A true classic and one I highly recommend!","user":"modrock62","rank":[39,43]}]