[{"title":"One of the funniest movies ever!!","rating":18,"date":"18 August 2003","review":"Yes it's cheaply made, yes it's stupid, and yes it's cheesy, But, this is one of the funniest movies that I've ever seen.  Johnny Yune is great in this one (I wish he would have made more movies).  His one liners are so cheesy that you can't help but laugh, and his facial expressions when he is swinging those nunchucks makes me hit the rewind button every time...... Anyone who does not find this movie funny does not have a sense of humor!!!","user":"haroldd","rank":[20,21]},{"title":"Surprisingly good B-movie!","rating":11,"date":"11 November 2001","review":"I had read the short review of this movie in \"The Video Movie Guide\" over and over, thinking it would be bad; but by luck, it was on T.V. one summer afternoon, so I watched it. Well, they were wrong (again).<br><br>This movie was good. It at least did its job in making me laugh like crazy at times, which is tough for anything coming down the pike these days.<br><br>Johnny Yune, a now forgotten comedian, plays Bruce, so-called because people mistake him for Bruce Lee (he looks nothing like him). Bruce gets himself involved with the Mafia, who use him and Ralph Mauro as unknowing guinea pigs to deliver \"Chinese Flour\", which is really cocaine, to various bosses from L.A. to N.Y. When things go sour, the late Margaux Hemmingway tries to off the heroes.<br><br>The film is very cheap-looking and dark, but there are some absolutely funny lines delivered by Yune.<br><br>When he's in Las Vegas and he's asked about gambling<br><br>Bruce: Ah Gambling! In China, I knew a woman who made her husband a millionaire through gambling. Only thing was, he used to be a billionaire.<br><br>When he's at a black church and asked to testify.<br><br>Bruce: We were so poor that when a thief broke into our house, we'd rob him!<br><br>Early in the film, his adventures at a dojo are pure slapstick, as well as a scene where Yune and Mauro are in a Texas jail, and they use the Chinese Flour to cause a jailbreak, then when the cocaine is on the clothes of the prisoners, they start sniffing at the clothes to snort the coke! Hilarious.<br><br>You won't find this on DVD, but you'll find this hidden gem somewhere in a video store. See it.","user":"BlackJack_B","rank":[18,19]},{"title":"This guy is wrong","rating":2,"date":"2 October 2004","review":"First, I loved the movie. I thought it was hilarious. But then again, that was MANY years ago when I saw the movie. I miss funny movies from the 1980's, when it was easier to laugh at ourselves.<br><br>I think the dude who posted the bologna and deli comments missed the point. The movie wasn't meant to poke fun at Asians or Asian Americans. It poked fun at EVERYONE. And more specifically, everyone BUT Asian Americans, who were ignorant of all people of Asian decent. It reminds me of the line Gene Wilder had in \" Blazing Saddles. \" \" They're common people, simple folk, people of the land... ya know? MORONS. \" <br><br>Some people don't get it. Some see it as it is. And some people ( like myself ) just love the movie for nostalgia reasons. It was simple humor and funny. No one in the movie needed to curse like a sailor or shoot and kill people to entertain. TV and Movies NEED that these days. God Bless Johnny Yune wherever he may be... and thank you, sir.","user":"Darkmonarch2003","rank":[12,13]}]