[{"title":"80 mins of absolute joy","rating":10,"date":"14 April 1999","review":"From the golden period of British films, this has my vote for one of the funniest of all time. Screened yesterday at my Film Society to a rapturous audience, I was astonished at how well the comedy has lasted (made in 1950!).  It is really down to the expert timing and inimitable playing from two of the finest actors Britain has produced: Margaret Rutherford and Alastair Sim. Adapted from a play by John Dighton, this farce is briskly handled by director Frank Launder. The plot is simple: A ministry mistake billets a girls' school on a boys' school. I will always laugh when I think of this film.","user":"Hugh-14","rank":[49,51]},{"title":"St Swithin's versus Nutbourne!","rating":8,"date":"17 August 2008","review":"A bumbling error at the Ministry Of Education results in Nutbourne Boys School having to share with St Swithin's School For Girls. This bemuses the respective head teachers of each school and leads to all manner of chaotic goings on, however the two are forced to come to an uneasy alliance in the hope of averting major trouble.<br><br>The Happiest Days Of Your Life is based on the John Dighton play from 1948, with Dighton writing the part of Headmistress Whitchurch specifically for Margaret Rutherford. Replacing George Howe from the play in the role of Headmaster Pond, is Alastair Sim, and herein lies the crowning glory of this filmic adaptation, Sim &amp; Rutherford are perfectly wonderful, bouncing off each other to keep what is basically a one joke movie, highly entertaining. Directed by the gifted Frank Launder, and produced by the equally adroit Sidney Gilliat, The Happiest Days Of Your Life is a quintessentially British movie, obviously a precursor to the St Trinians franchise, the film entertains the children with it's high jinks clash of the sexes heart, whilst tickling the watching adults with its very saucy undercurrent. Thankfully the chaotic ending cements all that has gone before it to leave this particular viewer with a grin as wide as Nutbourne Rail Station. Great fun. 8/10","user":"hitchcockthelegend","rank":[24,24]},{"title":"Margaret Rutherford at her Best!","rating":10,"date":"31 March 2001","review":"After a long run in the West End this charming film re-cast Margaret Rutherford as the Headmistress 'Miss Whitchurch' in this financially successful adaptation made in 1950.<br><br>All interior shots took place at Riverside studios in Hammersmith, London. The exterior scenes were filmed on location at a public girl's school near Liss in Hampshire.  During the 12 - week shoot both Margaret Rutherford and Joyce Grenfell were staying in a hotel nearby and would often visit the school during the evenings where they would happily enjoy the company of the real school mistresses.<br><br>Although the film's script contains only two original lines from the original play the leads and supporting actors are in fine form and you can only feel sympathetic for their predicament especially in the final scenes.","user":"Mark Whiston","rank":[23,23]}]