[{"title":"good drama wrapped in a B production","rating":7,"date":"2 September 2005","review":"\"Beyond a Reasonable Doubt\" is a curious film - it has the look and feel of a B movie and two stars who had seen better days - Dana Andrews and Joan Fontaine - yet it's a good script directed by Fritz Lang. A novelist (Andrews) and his future father-in-law, a newspaper magnet (Sidney Blackmer) work together to prove that the death penalty isn't justified by framing Andrews for a recent murder.<br><br>I thought the story excellent with some exciting twists, though the whole movie has an underplayed (not to mention inexpensive) feeling to it. Fontaine seemed a little old for her role. However, she does a good job as a sophisticate, and Andrews is good as well. Barbara Nichols does a fine job in a typical supporting role for her.<br><br>Lang returned to Germany after this film, his last in America. It's an effective plot but one wishes the man who made Metropolis and so many other fine films was given more of a budget for his swansong.","user":"blanche-2","rank":[33,36]},{"title":"Last but by no means least for Lang!","rating":8,"date":"17 November 2004","review":"For his final Hollywood film, Fritz Lang decided to expose the pitfalls of capital punishment for circumstantial evidence. For this film, Lang has kept it simple; with the entire movie focusing on the central premise and not a lot of anything else going on. Filmmakers can sometimes saturate a film with lots of sub-plots, and it can have a huge detrimental effect on what the film is trying to achieve. By keeping it simple, Lang gives himself time to fully explore the implications of his plot and the film is made more compelling because of this. The story follows Austin Spencer; a person of stature that is continually campaigning against circumstantial evidence being used as a means to send someone to the electric chair. His efforts are unsuccessful, until he has the bright idea to have a man sent to death row on circumstantial evidence, only to be pardoned at the last minute by means of the evidence to prove his innocence being brought to light. Enter Tom Garrett; Austin's son in law to be, and the man that agrees to frame himself for murder...<br><br>This is perhaps Lang's best assault on the American justice system; he has created a story that is interesting and very plausible and it works a treat in that it gets you thinking about the fact that with this kind of law; someone really could be killed for something they didn't do. Of course, the chances of someone risking being put to death to expose this are unlikely, but then again; it's only a movie, so you can expect to suspend your belief a little for a point to be made. Beyond a Reasonable Doubt also features one of the most finely tuned plot twists that I've seen in a movie. Lang shows us everything about the plot; from the first ideas, to the setting up, all the way to the trial and because of this; the final twist comes as a complete surprise. It's been done and done a million times since this film, but despite this; Beyond a Reasonable Doubt still has the power to shock the viewer. <br><br>Beyond a Reasonable Doubt is one of the highlights of Lang's illustrious filmography. It has an unfairly low IMDb rating, and I hope that you will not use that as a means of deciding whether or not to see this film. It is efficient story telling at it's best and this is one of the highlights of the film noir era.","user":"The_Void","rank":[46,55]},{"title":"An excellent modernist noir","rating":6,"date":"16 September 2008","review":"Fritz Lang's last film in America saw him reunited with some of the people with whom he had made WHILE THE CITY SLEEPS, and while the budget is still clearly poverty row, once again he comes up with a terrific commentary on the ills at the heart of fifties America. This time, it's the death penalty that forms the centrepiece of the film - or it seems to be, since that's the plot motor. But look closer, and you'll find it's actually about two of Lang's most familiar subjects: guilt and hypocrisy. Almost everyone in the film lives a double life, most obviously Dana Andrews' writer, but even Joan Fontaine's deeply frustrated spinster, who really can't wait to marry Andrews, and whose horror, when she discovers his double life is palpable. Lang floats above his subject matter elegantly, occasionally dipping his toe into the sleaze (a wonderful scene towards the end with a Miami strip-joint owner), getting terrific performances and indicting an entire society.","user":"tsavc","rank":[9,9]}]