[{"title":"Hysterical","rating":10,"date":"29 January 2005","review":"I don't know why but it seems that what is 'funny'is about the most difficult thing to agree on. For me, I can count really funny films on two hands(dirty rotten scoundrels; planes, trains and automobiles;marx bros., woody allen,big business; romy and michelle's high school reunion; liar,liar ; monty python's holy grail, and now, The Man With Two Brains .)I can't believe i missed seeing this film up to now, and i'm so glad it was on some film person's recommended list because i have just finished an hour and a half of continuous laughs. what a treat of a screenplay.steve martin is the naive simpleton brain surgeon who gets taken in by devilish scheming wicked witch kathleen turner(such a beauty).a lot of visual gags but it's the wordplay that makes it so continuously funny.(see the discussions part of this site for many of the funniest lines) Boring? No Way. a 10 for me.","user":"film_ophile","rank":[32,38]},{"title":"Clearly, viewers either love or hate this movie","rating":10,"date":"21 November 2003","review":"Even among Steve Martin fans, there are those who love his \"zany\" work (MWTB, the Jerk), and consider his more \"commercial\" hits (All of Me etc) a sellout, and those who see it the exact opposite.<br><br>I love this movie. I am amazed when I view it for the 73rd time and still fall down laughing.<br><br>I hope saying this doesn't sound smug, but I suspect those who don't find it funny are missing a lot of the jokes. The fast pace and dry delivery of a lot of hysterical lines are the best part of the movie.<br><br>I'm a Steve Martin fan, and this is easily my favorite Steve Martin movie (and possibly my favorite movie of all time - being able to always make me laugh no matter how down I am is worth a lot!)","user":"ctnow","rank":[50,63]},{"title":"Murmur!","rating":8,"date":"17 April 2004","review":"Policeman: \"That woman's not drunk, she's dead!\" Dr Michael Hfuhruhurr: \"Oh, i better get her to a cemetary right away!\"<br><br>Dr. Michael Hfuhruhurr: The only time we doctors should accept death is when it's caused by our own incompetence. <br><br>Shameless madcap farce from Director Carl Reiner (The Jerk, All of Me, Dead Men Don't Wear Plaid, That Old Feeling) is part romance melodrama, part sex comedy, part thriller, part medical drama, and all silliness. Yet it uses this silliness to touch on a fairly risque philosophical issue - what exactly makes us human? Kathleen Turner is in temptress mode as Martin's new wife who lives to torment men, and forces Martin to seek comfort elsewhere... with a brain in a jar!<br><br>Anne Uumellmahaye: I don't think there's a girl floating in a jar anywhere who's as happy as I am.<br><br>You have to admire the over-the-top and on-the-edge comedy pairing of Reiner and Martin which produces genuine hilarity, letting-loose fun and general enjoyment for a nice friday night hour and a half (good length too!).<br><br>Two thumbs way-up!","user":"Ben_Cheshire","rank":[41,52]}]