[{"title":"An Excellent and Unusual British Wartime Picture","rating":7,"date":"7 April 2000","review":"THE WAY AHEAD is to some extent a cliche-driven movie, but given the timeframe of its production, I feel it portrays very well the mindset of the ordinary citizen of a country under extreme duress, as well as the tribulations of the many regiments being reconstituted as the war progressed seemingly forever. While it is difficult for us to imagine what it must have been like to live under the constant spectre of loss and possible defeat, even some understanding of the way things were for the British in 1944 will permit a casual viewer of THE WAY AHEAD to appreciate its positive message and the call-to-duty which it implies.<br><br>When compared against many of the similar American WW2 'propaganda' films, THE WAY AHEAD comes across as a down-to-earth story which I'm sure many could identify with at the time. For us, the 21st-century viewer, this movie is a welcome glimpse of the British perspective back then, unique in both plot and characterization compared to the more common U.S. fare of the period. In addition, it provides the enthusiast with dozens of rare snapshots of the use of unique British Commonwealth WW2 equipment.","user":"c15ta","rank":[44,46]},{"title":"Best war movie made in the 2nd World War","rating":8,"date":"30 April 2004","review":"I really can't understand some of the more negative comments from some reviewers from the USA about this movie.  For me, it is far superior to equivalent American wartime propaganda movies (including enjoyable but hardly realistic efforts such as 7 Graves To Cairo and Sahara), and made and acted by a British cast who were serving servicemen as well (unlike a certain J. Wayne or H. Bogart).  Carol Reed gives us on the surface a cliche ridden movie but his gritty visual style which would become his trademark plus a script that still gives depth to a by now familiar concept lift this way above other movies made at the time.<br><br>The soldiers don't look pristine and for most of the time, don't act heroically until the last 5 minutes.  They're not an elite unit (as in Sands of Iwo Jima), they grumble, complain and stagger their way to the front lines but nor are they goofballs, pranksters or loveable rogues.  They are ordinary men in difficult times, which was what the film makers wanted to show.  They are not all broad stereotypes either; some, like the characters Davenport or Brewer, may on the surface seem like the upper class toff and the cheeky cockney but again, the way they interplay with the rest of the cast, they become more than just representatives of their class. <br><br>\nFor an old war movie, I was impressed with the action.  Early on, when the two old soldiers are talking about how much better it was in the army in their day, we get a juxtaposed montage of David Niven in training, showing how hard it is.  A lot of the burning troop ship shots are done hand held, which adds to the tension.  The Tunisia scenes look very authentic and see how Reed indulges in rapid cutting, disorienting explosions and run down and dirty art direction.  The only film that comes close to achieving this kind of grittiness in the war years is \"Guadalcanal Diary\".","user":"ubercommando","rank":[68,74]},{"title":"Wonderful","rating":10,"date":"11 March 2006","review":"Having lived in England at the time this movie depicts, I can attest to the absolute authenticity of its content. The characters were those I met every day during those awful years of turmoil. I am also advised by my husband, an ex-paratrooper, that this movie was used as a training film for all recruits, because of its strict adherence to actual army conditions in those days. The main joy for me in watching this film is the group of actors who were so familiar to all of us during those years. From Stanley Holloway (later so famous as Eliza Doolittle's father) to Jimmy Hanley, the handsome, easy-going boy-next door, and all the others in that wonderful ensemble cast - they all appeared in many different movies and were always welcomed as old friends whenever we saw them on the screen.","user":"mowens1","rank":[39,42]}]