[{"title":"an important and neglected film","rating":10,"date":"5 July 2003","review":"I was nine years old when I first saw 'Breaking Away', and I think the book adaptation may have been the first more-or-less novel-length thing I ever read. My wild enthusiasm after leaving the theatre was similar at the time to my previous reaction to 'Star Wars', a fact that I attribute to the natural electrical charge of the endings of both films.<br><br>Of course, a nine-year-old lacks the world experience to empirically understand the central messages of this film, and at the time my primary devotion to it was centered around Dave Stoller's orange Masi racing bike, a thing that I coveted with the passions of a kid on Christmas Eve.<br><br>\nThe movie made me mad with bicycle lust, and I frowned on every Huffy I saw at school. I used to draw pictures of Masi, Bianchi and Olmo bikes all the time after seeing this, and I shamelessly begged my parents for an Italian-made, Campagnolo-equipped racer - a futile thing to do, as my parents knew not to purchase something that expensive for a boy who would physically out-grow a pair of Levis within a school year. Ultimately, I was propelled into the worship of Eddy Merckx while all my classmates were digging into their Terry Bradshaw Topps cards, unaware - as I'm positive they still are - of who the hell Eddy Merckx even is.<br><br>BUT...'Breaking Away' is not just a bicycle film - not by a long-shot, and I knew it then too, but that just wasn't very important to me at a time when bicycles were all-important.<br><br>Despite my youthful energies, I never did pursue bicycle racing,(although I am definitely a touring enthusiast whose passion for Italian-made bicycles has finally seen fruition) but 'Breaking Away' never left me. It was the REST of the film that eventually got to me - and somewhat later in life - when my emotions and experiences with the world ran deeper.<br><br>\nIn short, this film explores many strands: the aimlessness of youth colliding with the responsibilities of adulthood; the often heartbreaking romantic fantasies of people who wish they could be something else; lying and cheating and the false nature of gains made through them; the importance of strong family relations and friendships; and life in small-town America - and it does all this with extraordinary craft, honesty and sensitivity. It's beautiful, and more importantly, it is soulful and original. Although certainly dated in appearance, I'll even toss in the cliche that it is *timeless*, because the themes and characters are so.<br><br>The characters themselves are all wonderfully brought out by the  perfect casting - it's been said here, but the fact that Dennis Christopher never achieved star-status is truly a shame and a waste of a potentially amazing talent. He played the lead role with a believable intensity and a really quite perfect understanding of his character. Dave Stoller's painful self-realization after the Cinzano race was as memorable a job of acting as I can think of. Paul Dooley and Barbara Barry were also wonderful, as were Quaid, Stern and Haley - every one of them created a personality for their characters, both in dialogue and physical reaction. The rest of the cast was likewise fine, each actor doing the best they could with what were sometimes stock roles (the college kids, for example, including Robyn Douglas, the female romantic role)<br><br>The direction, story and, most especially, the dialogue were great as well.<br><br>I also picked up a love of Mendelssohn and Rossini when I was just a kid after seeing this - the film score was superb, all the while taking the Stanley Kubrick/Woody Allen approach by choosing some choice compositions of a time long past, rather than belabor the audience with the refried horrors so typical of modern film-score composition.<br><br>I hope this movie doesn't become a relic - it seems its own sleeper status has kept it shelved over the years. Mention it to just about any American born before 1975, and they'll know what it is, but only in the way I did when I was nine: they'll usually say something like, \"oh yeah, the bicycle film! I remember that one\", and then they'll likely have little else to say about it, which is a shame. I still whole-heartedly place this movie among my very favorites every time, and I trumpet it whenever I get into discussions with other people about the movies I love.","user":"charlie_bucket","rank":[122,126]},{"title":"A film to treasure!!!","rating":10,"date":"5 January 2000","review":"Breaking Away is a picture that is better than the sum of its parts.  Oh, its parts are wonderful.  The writing is sharp, observant, and funny (It won an Oscar!), the acting is superb (how Paul Dooley was nixed a nomination never mind the award I'll never know), and it is a well shot film.  But its charms go even deeper.  It is the story of four young men in their late teens, who are staring adulthood in the face after a year of leisure in the \"small town\" of Bloomington, Indiana, and how they deal with watching successful college kids pass them by.  It is also about a young man in search of an identity (including that of a Italian bicycle racer), and of a family that is loving and supportive, almost in spite of itself.  All these add up to a richly enjoyable, deeply moving family picture that gives us many moments to treasure (a large number include Paul Dooley as the frustrated and confused, but eventually loving father).  Like other sports movies (the lead character races bicycles), it has a contest at the end, and like many much poorer ones, it ends with triumph.  But we cheer not only for these immensely likeable \"cutters,\" but for ourselves, for being treated to this bittersweet, touching, and wonderful movie.","user":"GregRG","rank":[66,67]},{"title":"Charming Sleeper","rating":10,"date":"15 July 2000","review":"I went to see this movie when it first came out.  We had decided to go to a double feature of two movies that we had never heard of, knowing that in that day and age, a double feature meant that at least one, if not both movies, had to be pretty awful.  The first film was Starting Over with Burt Reynolds, and it was fairly good.  So my friends were sure that the other would have to be terrible, but we had nothing better to do, so I convinced them to stay.  Before three lines of dialogue I was absolutely hooked.  I have seen it at least twenty times and the witty dialogue and rapport of the characters gets me every time.  The music accents the film beautifully. The cinematography is gorgeous.  But the story is what really matters. Four guys finding there way in a place where they feel little hope for the future, one a dreamer whose dreams are crushed, but he finds the spirit to pick up and start dreaming again.  Delightful all the way around.","user":"Bree-8","rank":[64,66]}]