[{"title":"If some one remakes this, I'm sending out a posse.","rating":17,"date":"17 August 2000","review":"To face a script in which most of the plot revolves around the dialogue of only two people in one location must be terrifying.  Thank goodness for Katharine Hepburn and Humphrey Bogart.  John Huston's adaptation of C.S. Forester's The African Queen was solid.  And the decision to film on location in Africa helped develop the concept of nature as a viable character within the plot helps solidify the film. But without Katharine Hepburn, and Humphry Bogart, this film could have been reduced to a nice little travelog on the beauty and terror of African and the pretty animals living there. Within The African Queen each character undergoes metamorphosis. Charlie Alnutt grows from an apathetic man who enjoys the inside of a bottle, to a courageous man. Rosie in turn allows herself to be human, and vulnerable perhaps for the first time in her life. With lesser actors these changes would have appeared rushed, unexplained,and a dull beginning to an inexplicable romance. But it isn't. It's a captivating film. Rosie's brittle smile, Charlie's face as his vices are destroyed, these are moments of brilliance in an incredible film. I highly recommend it.<br><br>It's also worth noting that this was not an easy film to make. These performances survived crew and cast illnesses, constant mechanical errors and inclement weather. For more about the conditions it was created under, I suggest you read Katherine Hepburn's The Making of The African Queen or How I went to Africa with Bogart, Bacall and Huston and almost lost my mind. She's not the sanest author in the world, but all the more enjoyable.","user":"Kayt R","rank":[93,114]},{"title":"Out of Africa with Bogey and Kate","rating":9,"date":"6 February 2002","review":"This is one of those films whose special effects and scenery must have been astounding at the time (1951), but which seem mediocre at best today. BUT, and that's a big 'but', this does not detract from the greatness of the movie overall. The scenery truly is beautiful, for one thing--and the direction and cinematography is great. <br><br>However, what truly makes this film a classic, and deservedly so, is the performances given by the lead actors. For their one film together, Humphrey Bogart and Katharine Hepburn pull out all the stops. Bogart is crude, dirty and a low-life river-rat with a heart of gold. He gives the Oscar-winning performance of his lifetime. Hepburn is prim and prissy, but always manages to win us over with her radiance and vulnerability, as well as that core of steel and strength she lends to all her on-screen characters. He's charming, in his way; she's achingly beautiful in hers. You can't help but warm to Charlie and Rosie, and truly, genuinely root for them to get together.<br><br>\nThe ending is predictable; all 'opposites-attract' romance adventure stories are. You know without a doubt that the sunset will be there for Charlie and Rosie to ride off (or swim) into together. But you still hurt when Charlie hurts; and you still smile like a fool when he sees Rose, and when he tries to explain her forthrightness away by jungle fever. You believe the love, and that's what the African Queen is all about.<br><br>Oh, and the gin and leech scenes, of course. Those are brilliant, as everyone else here has already mentioned! ;)","user":"gaityr","rank":[43,52]},{"title":"Don't Take This One For Granted","rating":10,"date":"3 June 2005","review":"THE African QUEEN is probably one of the most widely available films in the world, on sale in the electronics department of virtually every major retail chain, a commonplace at every rental counter, frequently seen on television. It is hard to imagine any one in the western world, especially in the United States, who has not seen the film at least once--and probably more than once. And so we take it for granted.<br><br>That is a mistake. Based on the famous C.S. Forester novel, which it follows quite closely, THE African QUEEN is the simple story of pragmatic river-rat Charlie Allnut (Bogart) and high-minded Methodist missionary spinster Rose Sayer (Hepburn) who are thrown together by chance when German troops sweep through Africa during World War I. Once safely aboard his beat-up riverboat \"The African Queen,\" Allnut desires nothing more than to dodge the Germans until war's end; Rose, however, determines to strike a blow against the Germans by sailing the boat downriver to attack a German battleship.<br><br>There are so many fine things about this movie that they are hard to innumerate. Filmed on location in the Congo, the cinematography is remarkably fine without being obtrusive; the script, which is at once subtle and very purposeful, has a remarkably natural tone; the two stars--who play the vast majority of the film alone together--give justly famous performances; and Huston's direction is so fine that we never feel even the slightest hint of directorial manipulation. As an adventure, it has a sense of realism that most adventure stories lack; as a character study it is remarkably detailed and finely wrought; as a love story, it is quite touching without engaging in common sentimentality. And it can be enjoyed by many people of diverse backgrounds and ages without the faintest qualm.<br><br>If you haven't seen THE African QUEEN in a while (or heaven forbid never seen it at all) don't take it for granted thinking you'll catch it sooner or later. Sit down with the film and watch it with fresh eyes. You'll be amazed.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[129,170]}]