[{"title":"Not just a kung-fu masterpiece, one of the last century's great cinema triumphs","rating":10,"date":"16 September 2004","review":"I just never expected anything like the experience of watching \"A Touch of Zen\". I settled down to watch a quaint old film from 1960s' world cinema. Three hours later I was exhilarated after stumbling across of the greatest films made in the 20th century - and it wasn't a moment too long.<br><br>The film is carefully structured, in three contrasting sections. It is only when you look back that you realize just how cleverly King Hu has created those three sections. The same characters, for the most part, appear in each section, but each focuses on a different combination. The first section focuses on the artist Ku, slowly building a picture of a quiet life in a rural backwater. The second switches tempo, with amazing martial arts action focusing on the fugitive Ku and her friends. The final section calms down again, as the mysterious Buddhist monk comes into sharp focus, and the martial arts become more and more amazing.<br><br>All this takes place in the most beautiful Chinese countryside, sometimes bathed in light (the use of sunlight and the monk is particularly impressive) and sometimes in dramatic thunderstorms, making the film even more of a delight to watch. Don't be put off by the 'kung-fu' label, this is even better than \"Crouching Dragon, Hidden Tiger\".","user":"gray4","rank":[46,59]},{"title":"Mood-driven journey to spiritual enlightenment","rating":17,"date":"17 July 2005","review":"To think that I used to accuse King Hu of doing injustice to the wuxia genre with boring storytelling and slow action, I must have been on crack at the time--as his best works completely transcend elements of conventional film-making. In A TOUCH OF ZEN, It's not the story or the action that stands out; although they are part of the system, they are secondary to the theme of spiritual enlightenment, which is what counts in Buddhist philosophy. When the abbot confronts the East Chamber agent, the art of combat is strictly utilized by the abbot to guide the agent to \"put down his sword, and attain peace with Buddha.\" There is a haunting sight when the bookworm scholar is amused by his tactic which fooled the agents. He thinks he has reached the peak of perfection, but then he sees dead bodies lying around who have suffered from his tactic, and the only thing on his mind is a woman whom he lusts. As book-smart as he is, he still suffers from worldly affair like everyone else. Only at the end when he accepts Buddha is he able to live in peace.<br><br>Aside from the philosophical points, ZEN also scores strongly in establishing mood, suspense, and fascinating visuals. The Jiang Hu in this film feels incredibly authentic, and the rich mise-en-scene is refreshing compared to the limited Shaw Bros studio offerings. I loved the photography throughout; it beautifully captures the spiritual wonder of ancient Orient. In framing still shots, King Hu chiefly employs medium and medium close-ups, mounting his camera at an upward angle so we can always see beyond the characters, perhaps to suggest existence of higher wisdom.<br><br>One observation I would like to propose is that although ZEN is probably a milestone in Chinese cinema, it would be a minor masterpiece compared to the best works from 60s Japan. The lush photography and haunting images from KWAIDAN come to mind as a comparison. No doubt, King Hu also learned a few tricks from the likes of Kurosawa, such as pointing his camera at the sun which occurs frequently in ZEN.<br><br>[9/10]","user":"PiranianRose","rank":[18,24]},{"title":"most remarkable","rating":10,"date":"14 January 2001","review":"Hsia Nu is not only one of the most remarkable martial arts movies one could imagine, but in any sense a most remarkable film. I at least am unable to name many other three hour long movies which I have not found slightly lengthy (not to say boring) at some stage. Moreover Hsia Nu is the kind of film one definitely would want to watch on the big screen of a cinema, something rather rare as far as martial arts films are concerned and generally rare for anything not an extremely expensive super-production.<br><br>Its panoramic nature sequences have not only esthetic value, but are also symbolically relevant. In fact if one wanted to do this, it would be possible to interpret the whole movie as an allegory of human existence. Fortunately there is really no need to get out the heavy guns of symbolism and artistic value to convince oneself that Hsia Nu is a great movie. It is gripping and entertaining, amusing and serious, and infused with a pathos hardly ever encountered in European (or American) movies. Pathos of course is something difficult to handle, but the director and cast of Hsia Nu manage it very well. The film has its deliberate light moments, but it never invites laughter at its moments of pathos.<br><br>Of course we are talking here about a martial arts movie. And indeed, the fighting sequences are brilliantly done - there definitely has been no progress since 1969 - but there is not only that. There is in fact not all that much fighting if one considers that this is a three hour film, and the fights do not carry the plot. In some sense Hsia Nu resembles more a Japanese samurai drama than what we more customarily associate with the Hong Kong and Taiwan martial arts genre.<br><br>The plot is very long and complex - though perfectly understandable, and even logical - therefore I do not see any real interest in retelling it here. Suffice to say that it contains most principal human emotions: loyalty and treason, love and revenge, hunger for happiness and for...enlightenment. The acting is brilliant, and especially a more masterly 'great master' character, a monk in Hsia Nu, would indeed be difficult to find in any martial arts movie.<br><br>If anybody is not convinced by the merit of the martial arts genre and just wants to give it a sole and unique chance, then this is the movie that might convinced such a snob that cinematographic 'art' is not necessarily grey, quiet and slow, but can be colourful, vibrant and full of pathos.","user":"hgz","rank":[26,37]}]