[{"title":"An \"off-beat\" Mummy film","rating":7,"date":"28 May 1999","review":"This entry in the \"Mummy series\" is unlike all the others, but that's what makes it interesting!<br><br>One of THE most interesting sequences in this film is when the Princess awakens in the bog (due to the sunlight), and slowly rises to her feet, totally covered with mud, and staggers to town.   A very dramatic scene!","user":"Norm-30","rank":[26,28]},{"title":"Atmospheric","rating":29,"date":"29 May 2013","review":"Even in America we're not safe as bulldozers unearth the ancient Egyptian mummy and his favorite obsession, Princess Ananka<br><br>Kharis is on the loose again. Of course, being on the loose for this mummified foot-dragger means he's a danger only to those too dumb to run. Fortunately, these movies are loaded with slow-learners. Actually, this is one of the better of the series, with lots of shadowy atmosphere and a really nubile Mrs. Folger otherwise known as Princess Ananka (Virginia Christine). No wonder Kharis is so anxious to carry her off, especially in that flowing white gown. I'd trade for his bandages and gimpy foot any day. And catch her rising jerkily from the swamp. These moves are enough to make you doubt whether she's human or not.<br><br>Too bad the rest of the cast seems at times to be sleep walking, except for Addison Richards (Maj. Walsh) and Kay Harding (Betty) who manage some lively personality. Peter Coe is a particularly unfortunate choice as the high priest. He sounds about as scary and exotic as my next-door neighbor. But who cares. It's old tangle foot and the moody gloom that keeps fans like me tuned in.","user":"dougdoepke","rank":[13,13]},{"title":"Kharis IV: Born on the Bayou","rating":6,"date":"12 February 2014","review":"The final entry in the Kharis the mummy series is also the weakest, although still a good watch. At the end of the last film, Kharis and Ananka disappeared into the swamp. Decades later, the swamp is drained. For some reason, this film moves the location of the swamp from New England to Louisiana! So obviously somebody didn't think continuity was that big of an issue. Anyway, Kharis is revived by yet another Egyptian high priest (Peter Coe). Meanwhile, Ananka resurfaces from the mud and we discover she is played by Virginia Christine. Why Ramsay Ames didn't return to the role I'm not sure, but Christine does fine. Needless to say, Kharis is once again anxious to find his lost love. This was Lon Chaney Jr.'s last turn as the mummy. This one's got some marks against it but it's a fun movie. Nice atmosphere and some creepy moments. Universal horror fans like myself will like it most.","user":"utgard14","rank":[9,9]}]