[{"title":"The Devil is a Car...","rating":10,"date":"8 May 2002","review":"This is a very unusual but interesting Czech vampire movie from 1981 - a doctor discovers that a hyper-modern formula 1 racing car is not run by fuel but with human blood! He's trying to find out the mystery of the bloodthirsty car together with a vampire hunter, but a mighty racing organization is already hunting them.<br><br>This plot sounds rather like a trashy 50's b-movie horror, but in fact is a very witty comment on the modern fetishes of speed, high tech power and mobility - and also, as usual for cultural artifacts of the Cold War area, a critical view on capitalism. There are some remarkable, terrifying scenes like a dream sequence with the car eating the doctor or a surreal sex sequence. The experimental electronic score is also outstanding, and only the acting seems a bit wooden sometimes. Anyway, this Czech horror movie is being watched!","user":"Mikew3001","rank":[11,13]},{"title":"Vampire from Ferat","rating":8,"date":"27 March 2000","review":"Translation to English may be \"Vampire from Ferat\". It is about revolutionary car. It doesn't need to stop at gasoline stations. It's very fast and cheap. It only needs ... blood! Imagine how much would you save having this car - of course if you survive your ride! This is classical horror with cars. Anyway - this movie gives you unique chance to see wife of our present president nude! I am not kidding - it is really she!","user":"pavel.vetesnik","rank":[7,11]},{"title":"Bloodsucking car.","rating":7,"date":"8 September 2010","review":"\"Ferat Vampire\" is the story of the nurse who is hired by Ferat manufacturer to drive new model of a car during races.A physician thinks that Mima's racing car is using human blood instead of petrol.\"Ferat Vampire\" was actually shown in Polish cinemas and television during early 80's.The film is a bizarre mix of horror,black comedy and sci-fi and it features prototype model of Skoda car.The acting is decent and there are some shocking surprises and plenty of delicious black humor.If you are new into Czechoslovakian horror watch \"Upir z Feratu\" in pair with \"The Cremator\".One thing for sure:I'll never look the same at black Skoda again.7 racing cars out of 10.","user":"HumanoidOfFlesh","rank":[2,3]}]