[{"title":"Another Wonderfully Inventive Film from Jacques Tourneur","rating":8,"date":"27 December 2006","review":"Jacques Tourneur used his vast reserves of creativity to turn small-budget films into fascinating movie-going experiences. If \"Out of the Past\" is one of the best films noir to be released in the 1940s, then \"Nightfall\" must be one of the best from the succeeding decade.<br><br>Aldo Ray plays James Vanning, who, with his doctor friend Edward Gurston (Frank Albertson), finds himself in the wrong place at the wrong time and ends up knowing the whereabouts of a bag of stolen money, wanted mightily by two bank robbers (one played with droll relish by Brian Keith). Fate, always a principal character in any film noir, brings James together with Marie Gardner (an impossibly young Anne Bancroft), a fashion model who becomes his girl Friday. Meanwhile, an insurance investigator (James Gregory) working on behalf of the robbed bank has James's number and comes calling. All of these characters finally collide in a memorable and rather grisly ending.<br><br>\"Nightfall\" is tremendously stylish and playful. It very much resembles Tourneur's earlier noir, \"Out of the Past,\" in its thesis that a man can run but never hide from his past. But it also reminded me of \"On Dangerous Ground,\" Nicholas Ray's strange offering from 1952, in its juxtaposition of a shadow-filled urban environment filled with anonymous (and perhaps dangerous) strangers with the wide open (and no less frightening) spaces of the country, where anything can happen and no one will know. I don't know if Aldo Ray was considered a good actor at the time, but he does a terrific job here -- who better to play an American everyman caught up in a sticky web than this all-American jock of an actor? He and Bancroft sizzle in their scenes together, and one of the movie's highlights comes when they are racing away from one of Bancroft's fashion shows with the bad guys in hot pursuit, and Ray, frustrated by the fact that Bancroft can't run in the impractical gown she was just modeling, picks her up and runs with her into the safety of a cab, after which she leans against him and says, \"You're the most wanted man I know.\" This scene and line got laughs and applause at the screening I attended, but you could tell that people were laughing with the film and not at it.<br><br>This film is one of the highlights of the noir genre, and I highly recommend catching it if you get a chance.<br><br>Grade: A","user":"evanston_dad","rank":[46,50]},{"title":"Chance and coincidence in one terrific film noir","rating":15,"date":"15 January 2003","review":"Although it is far from a masterpiece, \"Nightfall\", a low-budget film noir (stunningly photographed by Burnett Guffey), is one of Jacques Tourneur's finest films. What amazed me about \"Nightfall\" was the way it resembles Tourneur's previous films in its depiction of chance and coincidence. The similarity to \"Out of the Past\" (the duality between past and present, city and country, the use of flashbacks) is somewhat obvious. But consider the opening chance encounter between Vanning (Aldo Ray) and Marie (Anne Bancroft). It recalls the similar (though different) chance meetings between Irena and Oliver at the zoo in Tourneur's \"Cat People\"(1942), and Dr. Bailey and Cissie on the train at the beginning of \"Experiment Perilous\"(1944). If you watch it closely at the opening scenes, Marie's seat beside Vanning at the bar is empty BEFORE she appears. So, we expect the seat to be filled. I didn't notice it when I first saw the film, but critic Chris Fujiwara's observations in his splendid book, JACQUES TOURNEUR:THE CINEMA OF NIGHTFALL, were immensely helpful. Fujiwara adroitly notes, \"Throughout Nightfall, chance and unconscious processes determine key events. Tourneur's standard procedure of showing the effect before the cause underlies the inexplicability of these events, their fantastic nature\".","user":"Kalaman","rank":[45,50]},{"title":"Despite some story gaps, a first-rate suspenser...","rating":7,"date":"8 March 2008","review":"David Goodis' pulpy novel becomes exciting, well-cast and acted crime-drama, peculiarly titled since most of the action takes place in the snow-covered mountains of Wyoming (perhaps \"Snowfall\" would've been more apropos). Two innocent campers run violently afoul of two trigger-happy bank-robbers, with 350 G's getting lost in the frost. Hollywood never quite knew what to do with Aldo Ray: polite and beaming (like an overgrown Boy Scout), Ray's ingratiating manner and wobbly, scratchy voice made him difficult to type-cast in the 1950s. He's just right here, playing tough guy up against cold-hearted Brian Keith and buddy/big brother/love-interest to model Anne Bancroft, who gets caught in this crime web and yet doesn't seem to mind. Despite a sluggish start and a few details that don't come together (such as why the crooks' car runs off the road in Wyoming, or why the two bank-robbers don't follow Aldo Ray when he runs through the river with the satchel of loot), director Jacques Tourneur handles the criss-crossing plot with buttery ease. Add in some amusing parallels to the later \"Fargo\" and you've got the makings of a cult classic, one that Columbia Pictures rarely revives. *** from ****","user":"moonspinner55","rank":[27,29]}]