[{"title":"The best Annie","rating":10,"date":"15 December 2018","review":"A memorable adaption of the Broadway play. Hands Down, the best Annie. The set designs are classic, the casting is impeccable, the costumes, the talent! There is at least one additional song that fits in seamlessly. Aileen Quinn as Annie is iconic. An inspirational timeless and, so far, unsurpassable production. Annie '82' is perfect","user":"theknownames","rank":[9,9]},{"title":"Curiously maligned musical adaptation is a delight","rating":8,"date":"15 May 2017","review":"Any movie buff alive in 1982 will probably remember the critical lambasting directed at the big screen adaptation of the popular Tony-winning Broadway musical Annie. But watching it with an unjaundiced eye, it is difficult to understand the hatred then or now.<br><br>Based on the long-running Little Orphan Annie comics and the acclaimed Broadway hit, Annie keeps the same narrative beats as its predecessors. Curly-haired carrot top Annie is a 10-year-old orphan in Depression-era New York City, whose upbeat attitude and refusal to be cowed by the obstacles thrown at her makes her a thorn in the side of boozy dictatorial orphanage matron Miss Hannigan. By luck, Annie is offered the chance to temporarily reside at the palatial estate of billionaire Oliver Warbucks, and she proceeds to melt the heart of Warbucks and his staff, while Miss Hannigan, her devious brother Rooster and his floozy Lily hatch a scheme to cash in.<br><br>It is hard to see where all the carping comes from. The film retains all of the favorite songs and numbers from the stage hit, while getting rid of dead wood like \"Hooverville\" and adding a few of new songs that fit right in (i.e., Sandy, Dumb Dog, etc.). Director John Huston opens up the film so that it never feels like a filmed stage play, which is usually the main complaint of people in Broadway to film translations. He nicely captures the tone and spirit of the Depression-era NYC. If the number celebrating \"NYC\" is missing, it is more than made up for with \"Let's Go to the Movies\", where Annie experiences her first movie-going experience at the lavish Radio City Music Hall where period-garbed Rockettes kick with abandon. I would say that the clips of Garbo's Camille could have been cut in this segment, although it would defeat the last sight gag. Ironically, everyone had the knives out early on for Huston, claiming he was an inappropriate choice for director. I would argue that Huston is infinitely more successful here in crafting joyous musical interludes as opposed to the dead air that \"acclaimed\" director Clint Eastwood perpetrated in Jersey Boys.<br><br>I would also venture to say that Huston's use of his lavish budget is present everywhere and used to great effect, particularly in the film's second half, which concludes with an exciting rescue that avoids the ho-hum effect that impacted the stage version's problematic second act. And while the visit with FDR and Eleanor Roosevelt, with everyone singing on \"Tomorrow\" may seem hokey, it was no more so than in the show, and there are many highlights to counteract that saccharine bit. \"You're Never Fully Dressed Without a Smile\" featuring the orphans is a lovely bit and both \"I Think I'm Gonna Like It Here\", \"It's a Hard Knock Life\" and \"Little Girls\" are all showstoppers.<br><br>Aileen Quinn nicely anchors everything as an appealing Annie (although I daresay some of the other orphan girls give her a run for her money in the talent department). Carol Burnett hams it up with abandon in a scene-stealing turn as the chronically inebriated Miss Hannigan. Albert Finney walks the tightrope between stern and warm as Daddy Warbucks. Tim Curry and Bernadette Peters are a memorable Rooster and Lily (their Easy Street is also a highlight), while Ann Reinking is a delight as Warbucks' secretary Grace Farrell.<br><br>Ironically, for a film declared a misfire by so many critics, I have not come across any musical fan or child who does not get caught up in its effervescent joy. Definitely a film to watch to chase away the blues and instill some hope. Steer clear of the woebegone modern remake with Jamie Foxx, whose sole saving grace was watching the same critics who trashed this film suddenly develop amnesia by pretending they originally liked it and the remake was so bad.","user":"mnpollio","rank":[8,8]},{"title":"The best!!!!!!!!!!!!!!!!","rating":9,"date":"20 May 2001","review":"!!!Spoilers!!!<br><br>The very first time I watched this film, I was hooked. God only knows how many times I have seen it since. And every time I have cried at the bit where Rooster, Lily and Miss Hannigan kidnap her from Daddy Warbucks.<br><br>Carol Burnett, Tim Curry and Albert Finney are all excellent. As is Aileen Quinn as little orphan Annie. In fact the entire cast are brilliant. Annie is by far one of the best films I have ever seen. One of my favourite parts is the bit where they come in from the movies and Grace and Daddy Warbucks put Annie to bed while she's sleeping. And another fave is when all the kids from the orphanage go looking for Daddy Warbucks' house because they know what Rooster, Lily and Miss Hannigan are up to. Absolute brilliance. One thing I have to say is never, never, never, never watch the sequel. It is complete rubbish!!","user":"Bob-785","rank":[25,30]}]