[{"title":"Cruise goes with what works","rating":7,"date":"7 September 1998","review":"This movie is basically paying homage to Top Gun.  The same team that made that movie a success got together to create another pumped up movie. <br><br>\nCruise plays Cole Trickle, a very cocky and smooth indy car driver that lost his ride and decided to head to NASCAR with team owner Tim Daland,(Randy Quaid), and be coached by legendary crew chief Harry Hogge (Robert Duvall). During the Daytona 500 Cole and nemesis Rowdy Burns are involved in a nasty wreck that hospitalizes both of them and threaten to end their careers.  They become friends but Cole realizes his mortality and must overcome it if he is to ever race effectively again. <br><br>This has better romantic chemistry than Top Gun.  Due in part to the fact that Cruise and Kidman really were attracted to each other and we know the rest is history.  The action scenes are great and filmed superbly.  It's also a very loud movie.  It received an Oscar nomination for best sound. It's just another mindless action movie to help relieve boredom.  7 out of 10.","user":"Bryan-15","rank":[40,50]},{"title":"I feel the need, the need for Speed","rating":6,"date":"12 February 2007","review":"The producers, director and star of Top Gun get together again for this above average racing drama. Its nowhere near as good as Top Gun of course but its no disaster. Tom Cruise is good as the daftly named racing driver Cole Trickle and the ever reliable Robert Duvall offers classy support. Michael Rooker is excellent as Toms rival and Randy Quaid shows a more serious side to those who only know him from the Vacation movies. Surprisingly the usually good Nicole Kidman is rather bland as the love interest although to be fair she's not given a heck of a lot to work with. The music is of course all important in a movie like this and it has a pretty good soundtrack including Maria McKee's Number One hit Show Me Heaven, but again Top Gun had a much better soundtrack with Hans Zimmmer no match for Harold Faltermeyer. Tony Scott directs with his usual style, if you have seen Top Gun or Beverly Hills Cop 2 you'll no what to expect, very flashy and VERY LOUD. With a slightly less predictable story this could have been a lot better but as it is its a pretty enjoyable way to pass a couple of hours.","user":"LuboLarsson","rank":[24,29]},{"title":"Feels like a Sunday afternoon","rating":25,"date":"25 January 2002","review":"-SMALL SPOILERS-<br><br>I was a NASCAR fan before this movie came out, and I still am. This is an enjoyable movie that (somewhat) accurately portrays the on-track action I watch on Sundays. To be honest, I didn't care that much about who was in it or the plot that it had, I was in it for the racing from the beginning. The actors and writing hold it together and, from a fan's perspective, the racing is great, although the cars are incredibly tough and drive all over the walls and each other, something you can't do in a real race. Still, the racing stays true to life and, with one exception, the cars remain on the ground. They don't seem to be on the moon or some other zero-gravity environment like in DRIVEN. If you're a fan of NASCAR, you'll love this movie.","user":"obidiah182","rank":[7,7]}]