[{"title":"Transcendental","rating":10,"date":"19 October 2005","review":"The best sci/fi movie of the 50s. It's different from most others in that it has a theme; it's not just a series of scary and threatening events. The smaller Scott Carey gets, the braver and more resourceful he becomes. As he shrinks, he reaches a kind of spiritual enlightenment.<br><br>The only sour note (besides the special effects, which may seem primitive by today's digital standards, but which I, as an 8-year-old in 1957, seeing this for the first time, thought were astounding) is the scene with the Little People. The metaphor of \"you are as big as you feel\" is laid on pretty thick, and that particular set of special effects (especially that big coffee cup Clarice drinks out of) didn't fool me, even as an 8-year-old. Incidentally, up until recently, TV showings of this movie usually cut that scene out, although the names of the actors who played the Little People were left in the end of movie credits.<br><br>However, the point is well taken, and Scott realizes that as his physical size decreases, his mental and spiritual powers are increasing. The final scenes are a testament to Transcendentalism. For example, Scott says in the narration that he no longer hates the spider who has been threatening him during his imprisonment in the cellar. He understands that it has as much right to survive as he has. In Transcendental terms, he is saying that existence is neither good nor evil, it simply \"is.\" (Do people in California really have tarantulas in their cellars?) The wonderful last scene, where Scott (the absolutely gorgeous Grant Williams), bruised, battered, exhausted, looks up at the heavens and is no longer afraid, is one of the most empowering scenes in all cinema. This man has been so beaten down by fate that he is literally disappearing, and yet he affirms existence, and resolutely continues to move forward to whatever that next plane of existence may be. This ending is a far cry from the usual finales of sci/fi films of the 50s, where destruction is generally the resolution of the crisis. Here, there is no destruction, only transcendence. I never get tired of this film.","user":"LomzaLady","rank":[111,131]},{"title":"Incredible indeed.","rating":9,"date":"17 April 2002","review":"Along with \"invasion of the body snatchers\"(1956) \"forbidden planet\"(1956) and \"the fly\" (1958),the best movie sci-fi offered in the fifties.<br><br>Richard Matheson's remarkable novel was adapted by himself,thus the movie is an accurate rendition.Differences are kept to the minimum,and are probably due to censorship:one character,the pedophile,who wants to take the hero to his home has been removed and the relationship with Clarice remains platonic.Besides,Matheson focuses here on the second part of his novel,which takes place in the basement.<br><br>The special effects are absolutely stunning for the time ,but what's the most extraordinary is that they take a back seat to the hero's frames of mind:the voice-over is never redundant and Matheson's brilliant lines,a thousand miles above the B-movie level,perfectly convey his hero's plight.\"Arachnophobia\"(1990),with a much more comfortable budget pales into insignificance when you've seen Grant Williams'fight with the spider.The doll house,the scenes with the midgets,the metaphysical final are as awesome today as they were half a century ago.Do not miss the cast and credits at the beginning either. During its second half,except for the voice-over,the movie is almost silent and Jack Arnold sustains the interest with only one character.<br><br>With its inexorable progression -the hero slowly becoming on his own-,its first-class screenplay and a fine direction by Jack Arnold,who could ask for a remake? This movie and the three I mention above are genuine classics,they have in common fears hidden in collective unconscious.","user":"dbdumonteil","rank":[92,108]},{"title":"An Unbeatable Sci-Fi Classic!","rating":8,"date":"14 May 2005","review":"THE INCREDIBLE SHRINKING MAN (4 outta 5 stars) Not many of those hokey-looking old sci-fi movies from the '50s are still as effective 50 years later... but this one definitely hasn't lost any of its power. Great script written by Richard Matheson, who later went on to do much good work for \"The Twilight Zone\" and even today is still producing scripts for such films as \"Stir of Echoes\" and \"What Dreams May Come\". The story is fairly simple- after passing through a mysterious cloud on the ocean, our hero Scott (Grant Williams) discovers that his clothes seem to start feeling looser. More time passes and he discovers that he is now shorter than his wife. Day after day, he becomes smaller and smaller until he becomes so small that an ordinary housecat becomes a terrifying threat to his very life. The special effects might seem unconvincing to modern eyes... but the otherwise high-quality of the editing and direction make the action scenes as effective and suspenseful as anything you likely to see spewed out by today's CGI factories. I was totally unprepared for the ending of this film... you'd never see a movie end this way nowadays... but you never too many of them end this way back in the '50s either! A classic!","user":"hokeybutt","rank":[40,45]}]