[{"title":"Effective and Uneasy","rating":8,"date":"3 August 2003","review":"This is something like a full-length episode of the Twilight Zone, popular at the time of the movie's release. It's cheaply made, the photography is grainy, the story basically simple, and the acting nothing to write home about -- but this is one effective film if you're into dread.<br><br>Candace Hilligoss is a pretty blonde with a sharp nose and a vulnerable quality about her. (She might remind the viewer of that Twilight Zone episode that starred Inger Stevens continually running into a guy in black, \"The Hitch Hiker,\" maybe?) Candace Hilligoss is not a major actress but it's difficult to imagine a better fit between the individual and the role. She's pretty enough so that men might find it pleasant to stand next to her in the supermarket checkout line, but not too pretty. Her face is defined by its bone structure so that you can almost see the skull beneat the skin. Her slanted, over-sized blue eyes suggest some sort of startled prey animal. And her movements, her body language, are both clumsy and extremely feminine. She wobbles when she runs and minces when she walks. And she's the right age too -- thirtyish -- not a fledgling with a great big Future ahead of her. The successive loss of her friends, her home town, her job in Utah, her room in the boarding house, and eventually her car, is enough to leave anyone in a state of desperation -- especially someone whose sole marketable skill seems to be playing the organ. <br><br>The narrative has been gone over so I'll skip any description of it. What distinguishes this movie from others of its type is that, with the exception of the opening scenes of the accident at the bridge, there is no one at all who acts in a perfectly normal manner. (Unlike Inger Stevens, Hilligos has no ordinary sailor to pick up and talk to.) The pervading sense of disquiet is enhanced by the efficient use of locations -- a church, a vast ballroom, a decrepit and deserted amusement park at the end of a pier. And I think the performers contribute as well, their very amateurish awkwardness promoting in the viewer a feeling that \"something\" is not quite right about what we're witnessing. Even the scenes of quotidian life -- finding a job, fending off a neighbor's advances, trying to be polite to a polite landlady -- seem to be imbued with a kind of hard-to-define cockeyed quality, as in a De Chirico painting. Hilligoss is living in a universe in which nothing, and nobody, has an identity whose validity can be taken for granted. Not even her psychiatrist can be trusted to be what he seems. <br><br>There are no big shock moments. Nobody gets slaughtered in a shower. Nothing is \"evil\" in any ordinary sense. Everything is simply \"wrong.\" And the only music in the score is played on a church organ, mostly eerie chords that shimmer in the background. It's quietly done by director Herk Harvey.<br><br>Sidney Berger, who plays Hilligoss's odd neighbor, was in real life a speech instructor at the nearby University of Kansas. The leader of the dead is played by the director. This weird, subdued piece comes to us out of Lawrence, Kansas. It's pretty good for Lawrence, Kansas. But don't set your expectations too high. It's an old black-and-white horror movie, made by amateurs on a minescule budget. But within the limits set by those conditions, it's pretty good for anywhere, for that matter.","user":"rmax304823","rank":[127,142]},{"title":"Semi-Forgotten Classic","rating":23,"date":"23 August 2000","review":"Not many people know of this film, surprisingly--this is one of the most intelligently constructed and atmospheric horror (for lack of a better term) movies of all time. Whenever I do run across someone else who has seen this film, there is an instantaneous, unspoken understanding in regards to the enduring creepiness of this film.<br><br>My first viewing of COS occurred when I had inexplicably awoke in the middle of the night as a boy and switched on the TV. I had missed the opening minutes, but was powerfully drawn into the story. I sat transfixed until the shock ending, and think I just stared until after the sign off and following screen static. The next day I was not entirely sure I had actually watched this film or dreamed it--nobody else had ever heard of it and I never did catch the title (for some reason, its never shown much). Needless to say I was creeped out for days! Films that can affect one's sensibilities like this are golden! Find it and watch it in the middle of the night--alone.","user":"jkstevens57","rank":[100,115]},{"title":"Way Ahead of Its Time","rating":10,"date":"20 January 2006","review":"\"I don't belong in the world.something separates me from other people\" says Mary Henry (Candace Hilligoss) in perhaps the most lyrical horror film ever made. It is the unlikely 1962 masterpiece \"Carnival of Souls\" which philosophically fleshes out the premise of \"Twilight Zone's\" \"The Hitch Hiker\" episode (January 1960). The one where Inger Stevens (as Nan Adams) plays a young woman driving cross country who keeps passing the \"same\" man standing by the side of the road. Its masterpiece quality was unlikely because it was the low budget first feature film of Herk Harvey (a director of educational short films), using actors with little acting for the camera experience, and with a story structure adapted to fit sets and locations to which Harvey had free access.<br><br>One of these locations was an organ factory. This not only dictated the film's unique and beautiful score but it suggested a profession for the main character (Mary Henry), a church organist. With this they really got lucky because it brings in many disturbing religious images and undertones. A church organist seemingly possessed by her instrument, as her playing alternates between the spiritual and the profane, deeply disturbs her wrapped-too-tight\" minister who would have benefited from Pollyanna's advice about the \"rejoicing texts\". The organ factory also serves nicely for a Carol Reed-type angular shot with the huge organ pipes in the foreground and the diminutive figure of Hilligoss far below. This early shot sets the existential tone for what will follow. Finally, there is the moment when she is alone on the highway and her radio will only pick up organ music.<br><br>The other location is the abandoned Saltair Pavilion outside Salt Lake City. Much of the story takes place here as Mary Henry is mysteriously drawn to the place. Watch for this shot of her in front of a promotional poster for the Pavilion, on the poster is a look-alike blonde with the same hairstyle. Since the late 19th century, Saltair had been a family swimming/recreational facility built out into the Great Salt Lake. The huge pavilion looks like a strange cross between an Eastern Orthodox church and an Arabian Nights palace. The falling lake level doomed the swimming feature but the place operated as an amusement park until abandoned five years before the filming of \"Carnival of Souls\". At the time of filming the actual pealing paint, broken glass, collapsed staircases, and general disorder made for a better location than even the best production designer could have constructed. It also works well from a \"language of film\" symbolic perspective as Mary is shown walking through an unnatural circular passage, which reinforces other subtle off-kilter elements that occur throughout the film.<br><br>While much of the film's texture was the happy result of the low budget necessity of using these available locations, the casting of Hilligoss worked out even better. Probably cast because she was the most beautiful actress available for the price, Harvey hit a home run because she brings exactly the right sterile and distanced qualities that the film needs in its main character. Hilligoss might have been an acting-for-the-camera novice but she had extensive stage experience. Harvey was able to get an extraordinary nonverbal performance from her, unexpectedly taking the film deep into the concept of human alienation. Much like \"The Incredible Shinking Man\", with its existential theme of separation from society, \"Carnival of Souls\" also transcends its genre and explores the isolation of someone who feels they no longer belong. And like \"TISM\", the resolution is the realization that loss of identity is freedom, that the infinite and the infinitesimal are the same, that you are not alone because you are a part of something bigger.<br><br>The two occasions where Mary Henry suddenly becomes invisible to everyone are much more vivid because Hilligoss is so beautiful. Unlike a person of average appearance, an especially beautiful woman walking down the street is used to drawing stares from virtually everyone. For such a person the phenomenon of sudden invisibility would be far more jarring than for those who are used to not being noticed in the passing crowd.<br><br>For budget reasons, egg white was used on the faces of the \"dead\" cast members, including Harvey himself who plays Mary's recurring apparition. This has an especially eerie effect with black and white film and would be adopted a few years later by George Romero for \"Night of the Living Dead\".<br><br>Educational film veteran Frances Feist plays Mary's cherubic landlady and John Linden plays her slimy (on the make) neighbor. Both are excellent, and the disjointed and stilted acting style of their scenes with Hilligoss will remind many viewers of David Lynch's \"Eraserhead\".<br><br>Then again, what do I know? I'm only a child.","user":"aimless-46","rank":[70,81]}]