[{"title":"Just the way a thriller should be","rating":8,"date":"9 August 2009","review":"Edward Dodd (James Woods) is a run-down lawyer who no longer shines the way he did 10 years ago. Back then he was writing history, saving the Black Panthers and stuff of the like. Now he protects drug pushers and street peddlers. Nevermind what excuses he finds for this gradual decay of affairs, for a skilled speaker and lawyer Dodd never ceases to be - this can be seen even as he defends crooks. Roger Baron (Robert Downey Jr) arrives to clerk for him and realizes the idea he had of Dodd no longer suits the reality of the man. Thus he proceeds to ask him to take a prisoner case.<br><br>This courtroom thriller has all that kind of movie should have; we see a well-crafted pace that keeps you tied to your seat, the kind of acting from James Woods that is hard to find nowadays, Robert Downey Jr also dons the recently-graduated idealistic law student to a tee. The film is reminiscent of a John Grisham novel. Margaret Colin as Kitty Greer is also great. In fact, every actor in this flick does a better-than-average role. Lacking in cheesiness, having the proper pace, the kind of twists that make it just a little less than predictable, and good acting plus a nice mix of occasional black-and-white flashbacks with the present and an original score by Brad Fiedel (Terminator, Terminator: 2) that fits the pace perfectly make for a movie that is clearly lacking in recognition.<br><br>Highly recommended thriller, 8/10.","user":"tha_mongoose","rank":[20,21]},{"title":"One of Wood's best performances... seriously.","rating":8,"date":"4 March 2007","review":"This is a very well done court room drama that is based on an actual case from actual liberal left wing attorney, J. Tony Serra. James Woods plays the fictionalized version of Serra, under the name Eddie Dodd. Robert Downey, Jr. plays Roger Baron, a young idealistic lawyer that comes to clerk for the once famous Dodd- with dreams of defending civil liberties and making a difference. <br><br>He arrives only to find the once rebellious and justice minded Dodd defending drug addicts and drug dealers. One evening a young Korean woman &amp; lady come to his offices looking for help. Her son was sent to jail 8 years ago &amp; is now accused of murder because of a prison fight that resulted in the death of a member of the Aryan army. Despite the fact it's not his area of \"expertise,\" Roger convinces Dodd to take the case. <br><br>For Dodd, this case, this young man, Shu Kai Kim played very well by Yuji Okumoto, represents so much more than just another case. Dodd himself is looking to reclaim his own enthusiasm, freedom and hope. The District Attorney is played very reliably by Kurtwood Smith (poor guy- pre \"70's show\" he always seemed to play a bad guy.)<br><br>The main reason I like this movie are the actors. Yes, the story is somewhat predictable- but there are some turns that make you doubt who is innocent &amp; who is guilty on first viewing. James Woods' performance in this movie is one of his most versatile and enjoyable. He transitions with ease from humorous sarcasm to an almost raw vulnerability. One of the best scenes is one in which he tells his client, \"I know you're innocent- even if you've forgotten.\" After 8 years in prison, Shu isn't the same man he was when he went in. Just as Dodd tells Roger at the beginning of the movie that 10 years is a lot of time- in other words, despite his shinning past as a defender of civil liberties- he has also changed. Cynicism is something that creeps stealthily into everyone as age and time increase. In the movie \"And Justice for All\" they delve into the difficulty of being a defense lawyer &amp; having to defend people you may know full well did a heinous crime of some sort. This has to change a person and that is part of what this movie is about. <br><br>All the other actors, including Margaret Colin as the PI Kitty Greer, are believable and supply good support for the main character of Dodd. This is basically Woods' show, and that's okay with me since I'm a big fan of his. He was also fabulous in \"Salvador\" but then I think he is fabulous. If you like Woods, you'll like this movie I think - if you like a good story, I think you'll like this movie.","user":"rondine","rank":[17,18]},{"title":"For The Greater Good?","rating":9,"date":"27 November 2006","review":"The title role in True Believer is played by Robert Downey, Jr., who is an eager young law school graduate looking forward to interning with famed civil rights attorney James Woods.<br><br>Woods who's a throwback to the hippie days of the Sixties is now making a living defending drug dealers and other various and assorted dregs of society. He's an attorney and bills have to be paid. By the way note that his office has his living quarters in it, a practice perfected back in the day by Roy Cohn. <br><br>Out of the blue comes a mother looking for an attorney for her son who killed an Aryan brother in prison. But she's also looking to re-open the case that got him there in the first place, a Chinese gang killing that he swears up and down he did not do.<br><br>Woods and Downey go to work and what they uncover is a frightening case of official corruption. It's an object lesson in how law enforcement can if it wants to, manufacture evidence to convict someone if they want them bad enough. In this case it's to cover up the real murderer, but I won't say more.<br><br>James Woods is just about perfect casting in the role of the aged and jaded defense attorney whose young assistant helps him recapture some of his youthful idealism. Robert Downey, Jr. aids and abets Woods every step of the way in this.<br><br>But the best three performances in the film by far are Miguel Fernandes as the corrupt and maniacal police snitch, Kurtwood Smith as the District Attorney of New York County and Yuji Okumoto as the imprisoned defendant.<br><br>Kurtwood Smith came to be known to millions as lovable, irascible Red Foreman in That Seventies Show. Here he's one hard-nosed District Attorney who sanctions all kinds of rule breaking for what he considers the greater good. He's far from TV's Adam Schiff or the real life Robert Morgenthau.<br><br>True Believer is a nice drama about some people who take on the system and win.","user":"bkoganbing","rank":[15,16]}]