[{"title":"Oft-maligned film actually offers many delights","rating":9,"date":"1 September 1999","review":"I know it goes against the general tide to praise this film (the only other place I've ever read a really positive review of it being the back of its own video cover), but I'm going to do it--and I'll even attach my name! For, in my opinion, this musical adaptation by Leslie Bricusse of Hugh Lofting's delightful \"Doctor Dolittle\" series succeeds in a great many respects. I was enchanted as a child when I saw it in the cinema, and I still enjoy watching it on video with my own children.<br><br>The admittedly meandering plot combines elements from various of the Dolittle books, but it essentially concerns the Victorian veterinarian's quest for the Great Pink Sea Snail, an animal whose language he hopes to add to the thousands he has already learned. Thus the first part of the movie takes Dolittle and his friends through several adventures on their way to earning the money to make the journey, while the second finds the entourage actually setting sail (on the aptly-named \"Flounder\") for Sea Star Island and their goal. And, even if the musical *is* so front-end-loaded with big numbers that the second half seems anticlimactic, and even if the resolution of the plot's final conflict *is* jarringly abrupt, and even if the film's direction *is* a tad slow, it is *also* the case that I find more than enough pleasures along the way to compensate for these shortcomings.<br><br>One is Bricusse's marvelous score. Besides the Academy Award-winning \"Talk to the Animals,\" he includes two other showcase pieces for star Rex Harrison's trademark \"powerful patter\" delivery, the humorous \"Vegetarian\" and the impassioned \"Like Animals.\" Other up-tempo winners are \"I've Never Seen Anything Like It\" (brilliantly put across by Richard Attenborough--the twinkle never leaves his eye!--in what amounts to an extended cameo as wily circus-master Albert Blossom) and \"Faraway Places,\" while tender ballads \"When I look in Your Eyes\" and \"Beautiful Things\" are very affecting. And if \"After Today\" seems to have been pulled from the trunk of another show by mistake, the other Anthony Newly numbers--including \"My Friend the Doctor\" and \"This is the World of Doctor Dolittle\" (as well as the lovely \"Where are the Words,\" which is on my soundtrack album but not in the video)--are spot on.<br><br>Another pleasure is the cast. As the Doctor, Harrison is wonderful, of course. The film was originally conceived as a reunion project for him and composing team Lerner &amp; Lowe, who'd written \"My Fair Lady,\" and it's clear that the part was written for the star. But I'm impressed that eventual Lerner &amp; Lowe stand-in Bricusse, though he was obviously influenced by \"My Fair Lady,\" resisted what had to be the temptation to turn the main character into Henry Higgins--and that Harrison also didn't see the gig as a mere Higgins reprise. The charming Doctor--kind to animals, children, and people from all walks of life; educated and capable but somehow sweetly clueless at the same time; gentle but rousable to anger on behalf of his charges--is a different character, and Harrison gets him right.<br><br>As for the other leads, Anthony Newly, for once, is perfect as the elfin Matthew Mugg, while child actor and \"whatever-happened-to\" candidate William Dix is a fine if underused Tommy Stubbins. Even Samantha Eggar, in the mis-conceived role of a tentative love-interest for Dolittle, does well with the part she's been given. And strong support is provided by the aforementioned Attenborough, Peter Bull as the beefy English squire who is the closest thing to a villain in this piece, and Geoffrey Holder as Willie Shakespeare, head of a quirkily-PC group of island natives encountered during the voyage.<br><br>Finally, there's the appearance of the film: it's beautiful. If you find you can't enjoy a musical unless it's shot on a soundstage, the wide-open spaces won't work for you, but I loved all the wonderful locations.<br><br>This is a big movie, long and theatrically-structured (Overture, Act I, Entr'acte, Act II, and even Exit Music!). They don't make them like this anymore--which sounds like a straight line, but I mean it in a regretful way. :-) I recommend \"Doctor Dolittle\" heartily, and I think the family will enjoy it even more if, before you watch it, you read a couple of the original Dolittle books together first!<br><br>[P.S.-- don't be put off this film if you didn't happen to like the similarly-titled 1998 Eddie Murphy vehicle which billed itself as a remake. They're completely different!]","user":"philosophymom","rank":[61,69]},{"title":"Adorable Family Musical from the sixties with a flawless performance by Rex Harrison.","rating":10,"date":"25 June 2004","review":"My childhood favorite still holds up! In 1967 I remember sitting in the theater in awe of this tall Englishman that could sing &amp; talk to animals.<br><br>As an adult I can sit and enjoy another brilliant performance by the Late Great Sir Rex Harrison (God bless him!), this time as the Good Doctor Dolittle. <br><br>Leslie Bricusse has done a wonderful job combining some of the Hugh Lofting tales into a Big Hollywood Musical! I only wish that all the songs made it to the screen. Two were cut, I guess for time (Where are the words?, Something in your smile) but show up on the soundtrack record &amp; CD. Robert Surtee's photography is gorgeous! It really should have walked away with an Oscar that year.<br><br>Richard Fleischer brings it altogether beautifully. His direction is just the right pace, letting us enjoy all the fantasy that is set in front of us. No quick cuts, loud noises - Hell, everything that audiences today never see. There is nothing wrong with taking time telling a story - I wish the new Hollywood understood that. <br><br>The circus number with Sir Richard Attenborough is just as entertaining today as it was in 1967. The Pushmi-Pullyu may not hold up to the digital effects of today but it's still just as lovable. <br><br>This family film is a treasure and it certainly is more to what Hugh Lofting envisioned compared to the recent Eddie Murphy films.<br><br>If you ever have a chance to see this in a Theater - GO!<br><br>The DVD has a beautiful transfer - I do wish the DVD had more extras, such as the two songs they cut for the final release. But it should be in the family collection. <br><br>Remember it has Rex Harrison in the title role. That alone should give you a reason to see it - If you haven't already","user":"tsch875125","rank":[33,42]},{"title":"The Great Doctor Dolittle","rating":8,"date":"7 May 2003","review":"I was taken as a child to see this movie in 1967 and loved it. I ended up buying the soundtrack, coloring books, puzzles, etc. It charmed me that much. Today, I still find it to be a great yet under-rated film. The DVD is nice, but this is a movie that is really meant to be seen on the big screen. That is why I also own a copy on 16mm film. What a difference it makes seeing it in this format. Regardless of how you watch it, this movie is entertaining for kids and adults of all ages. Those who might get bored with it are those who prefer the newer version with Eddie Murphey over this classic from 1967. Which, by the way, got nominated for Best Picture and won the Oscar for Best Song (Talk to the Animals). Rex Harrison's performance is outstanding as the wonderful Doctor Dolittle. I give this timeless film an 8 out of 10.","user":"nicemess61","rank":[21,26]}]