[{"title":"This Is the End...","rating":10,"date":"23 March 2018","review":"Apocalypse now is not only the best war film ever made but it's also one of the best films of all time as it won the prestigious Palme d'Or at Cannes and it's constantly recognized as a benchmark in cinematic history. Based on the novel \"Hearts of darkness\" by Joseph Conrad this film is not so much about the Vietnam war, it is about war in general and serves as a deep study into the dark places of the human soul and how war can affect the individual. Apocalypse now depicts a timeless story about a universal human struggle, the duality of man, consisting of morality, the savage primordial instinct and what every person chooses to base his actions upon.<br><br>The film has a simple premise, US Army Captain Benjamin Willard (Martin Sheen) is ordered on a dangerous mission into Cambodia through a river, to assassinate a renegade, Colonel Kurtz (Marlon Brando), who has gone insane and set himself up as a god among the local native tribe. It's an accessible premise, allowing for the film to be consumed by even the most casual movie watchers, and yet this film is anything but shallow. It's a journey into madness and hysteria, an observation into the darkness of humanity. I could write a book analyzing this film, there's just so much to talk about. My interpretation is that the river is not only the passage to find Kurtz but also the descent into madness and a reflection to the character's inner journey towards evil that is accomplished through the main theme of the movie, dehumanization. The journey through the river is also reminiscent of Dante's perilous journey through unspeakable surroundings and horrors. There are three major stops before Kurtz and each stop on the river furthers the dehumanization that war has brought, as well as implanting a new type of evil to the characters.<br><br>The first stop is with lieutenant Kilgore. That stop shows that Kilgore and his soldiers have been consumed by the love of war after they dehumanized the enemy. Their love of war has blinded them so much that they see no negative and can't comprehend the consequences the war will bring. In one scene of the movie, the \"heroic\" marching of the helicopters to lay wrath upon their enemies, Captain Kilgore uses Wagner's Ride of the Valkyries to pump his soldiers and scare his enemies and like the mythical creatures Valkyries, he is the decider of who lives and who dies on the battle. At this stage, although everyone has removed any shred of humanity from the enemy, they still understand the innocent.<br><br>The second stop is the USO show where we see the loss of morality as well as the dehumanization of the innocent. At this stop we see that a soldier dehumanized everyone aside from himself, becoming very selfish and losing any compassion for anyone but themselves. The soldiers that have passed through this stop would be willing to put anyone at risk for their instant gratification. Now as the characters go deeper into the river metaphorically they go deeper into themselves to explore their own evils which are becoming more apparent.\nThe last stop before Kurtz is the Do-long Bridge and it's at this point that a soldier has gone too far, he's experienced so much trauma and so much evil that he lost grip with his own sanity and thus he dehumanized himself and can't return to a normal state of mind.<br><br>The final stop on the journey is Kurtz, at this point only Willard and Kurtz have passed the madness stage and they are competing for the heart of darkness, the ultimate evil that we all have the capacity to have. Kurtz is in possession of the heart of darkness as he associates evil with strength. Bypassing the madness stage he's able to see the world for what it truly is, filled with hypocrites and he decides to bury his hatred and simply act on instinct. Willard at the end of the film rises from the river reborn as a new man ready to obtain the heart himself. He kills Kurtz and leaves the compound with his heart corrupted. In the end Willard has a choice, succumb to evil and stay in the compound having taken Kurtz's place as the leader of the savages or abandoning them into their fates...throwing his weapon, he emerges from the bottomless pit he had fallen through the heart of darkness and by saving Lance and choosing not to exterminate the tribe, he has completed his personal journey and tested his soul to the very limit. Both of them at any point could have just stopped but they didn't, they wanted to explore the depths of their souls and just how much further they could go.<br><br>The film presents this study of the human psyche through Carmine Coppola's eerie score, hypnotic images, and some haunting scenes, essentially taking the viewer into the depths of hell. It's here where Coppola succeeds the most. His ability to create a living \"hell\" is so amazing, and it perfectly captures the mindset of the soldiers. It provides a commentary on war and religion, making the subtext even vaster. The film is weirdly beautiful and a true picture of the evil and hell from within ourselves.<br><br>The cinematography by Vittorio Storaro is phenomenal and it provides a hallucinatory feeling throughout the film's runtime - from the faces of the losing minds covered in endless sweat, and the sight of figures within the shadows to a dark trenched riverbank - everything is captured in a stunning manner, conveying the hellish imagery and still taking the viewer's breath away. Coppola's direction transcends itself, the camerawork is at its absolute best when it comes to the use of lighting and shadows, most notable during Col. Kurtz's first appearance. The troubled production obviously didn't hurt the film at all, and most likely increased the dark quality it portrays. Apocalypse Now is beautifully haunting, utterly hellish, terrifyingly intelligent, and magnificently wrought, it slowly pushes you into the horror and absurdity of war, but also its meaningfulness and beauty. Not only is this one of the best films ever made, it's a psychoanalytical journey into places none of us would dare to venture to on our own. It is Francis Ford Coppola's magnum opus as he sacrificed everything to make it work. Rightfully deserving its place as one of the greatest on the cinematic pantheon, immortal for its contribution to cinema, and a truly unforgettable experience, Apocalypse Now is cinema at its most complete, crystalline and pure.","user":"notoriousCASK","rank":[149,166]},{"title":"In my opinion, Coppola's best work","rating":10,"date":"21 December 2004","review":"My favourite movie of all time. This was a flawed piece of work by Coppola and seeing the documentary 'Heart of Darkness' made it even more compelling. Coppola at this point was king of Hollywood after making 'the Godfather' and 'GodfatherII' and had developed the ego necessary to even dare try to make a movie like 'Apocalypse Now'. Through sheer arrogance he went to the Phillipines with a partial script and thought he would know what he would do when he got there. Just as Captain Willard thought he would know what to do once he got to Col. Kurtz's compound. And just like Willard, he DIDN'T know what he was going to do once he got there. This is such a masterpiece of American cinema, beautifully photographed and the river is such a perfect metaphor and backdrop for the story. What I like most about 'Apocalypse Now' is that it offers no answers or conclusions. Consequently, because of this open-endedness, it infuriates some viewers who like their movies to be much more obvious. <br><br>This movie defies categorization. Some call it a war movie which it isn't at all, really it is more of a personal study of man. The best pic about Vietnam is 'Platoon' in my opinion and if a viewer is seeking a retelling of the Vietnam War go there first for answers. <br><br>Coppola should be commended for his take on the bureaucracy of war which he conveys quite effectively with the meeting with Gen.Corman and Lucas (Harrison Ford) and the Playmate review. The sheer audacity of Kilgore makes him an unforgettable character and the dawn attack will always be a Hollywood classic.<br><br>It is an almost psychedelic cruise to a very surreal ending which makes it a movie not accessible to everyone. Very challenging to watch but rewarding as well. I could offer my explanations on each scene but that would be totally pointless. This movie is intended for interpretation and contemplation as opposed to immediate gratification.<br><br>A little footnote, definitely if your a first-time viewer of Apocalypse Now, watch the original version first, the 'Redux' version is, I think, more intended for the hardcore fan and is more of a curiosity than a 'new and improved' version of the movie","user":"jokeco68","rank":[591,724]},{"title":"The Dark Side of Man","rating":10,"date":"14 August 2005","review":"Francis Ford Coppola's \"Apocalypse Now\" is not a Vietnam War film. Do not confuse it with one. It is set to the back drop of the war, but it is a metaphorical exposition on the deteriorating effects that war has on the human psyche. It is also one of the most audacious films ever made, produced, or even conceived (second to the Lord of the Rings trilogy. To call it a masterpiece would be an understatement of proportions as ambitious as the film's production levels.<br><br>Opening with no credits and following a memorable first scene playing to the tune of the Doors \"The End\" as Martin Sheen's Captain Benjamin L. Willard hallucinates to images of helicopters and napalm, the plot is essentially laid out in the first 15 minutes. Willard's mission is to \"terminate... with extreme prejudice\" Colonel Kurtz (Marlon Brando) who has invariably gone AWOL in the far reaches of the Cambodian jungle and, as told by his general, is \"out there operating without any decent restraint, totally beyond the pale of any acceptable human conduct. And he is still in the field commanding troops.\" Kurtz is a delusional Colonel now being worshipped by a large group of followers who have dubbed him a god. For Willard, this covert operation seems somewhat more manageable than actual combat, yet, the journey he is about to take will be a personal quest that will challenge the limits of his human behavior.<br><br>Teaming up with a small crew, they embark down the vast reaches of the river in a rickety boat. Along the way, Willard educates himself on all things Kurtz. During Sheen's raspy voice over, he details his thoughts on the abundance of material he reads. Kurtz was a highly decorated and respected Green Beret. He was a normal man with a family, until a part of him succumbed to the horrors of human brutality and he led himself down the path that Willard is being led. The descent into the jungle is marked by a mesmerizing aura that echoes the battles being fought not to far away. Eventually the power of the experience weights on the group as drugs and a sort of solitary confinement attacks their senses. But Willard seems unfazed and desensitized in his quest to find Kurtz. As he reads about this mythic figure, he is drawn to the man's power and why he has become what he has become. We know that Willard's slow decay will parallel that of Kurtz's.<br><br>Marlon Brando has been revered for decades. His presence: unmatchable. His genius: undeniable. But for those unacquainted with his acting prowess and unaccustomed to his physical nuance, Brando can be perceived, in the eyes of an uncompromising film-goer, as a hack. He is most certainly not. Brando was difficult to work with, hard to interpret and impossible to understand, but his talent for unintelligible rants and unparalleled monologues is irrefutable. The man obviously knew what he was doing even if we didn't. His Colonel Kurtz is a being of limitless delusions and continual profundity.<br><br>If the film is any indication of the journeys into hell than Francis Ford Coppola's actual experience with making this masterpiece is a true life account of one man's fanatical struggle to produce a movie. It is reported that during the film's 200 plus day principle photography schedule, Coppola contemplated suicide. The film was not only an undeniable struggle to make; it is a grueling film to watch. Coppola's sweat and blood seep through the pores of the steamy locals and his dedication filters through the orifices of Martin Sheen's haunted soldier Willard.<br><br>I can not help but feel a warm sense of nostalgia for this type of film. At the dawn of all that was original and unprecedented, films that challenged as well as stimulated were commonplace. Audacity aside, Apocalypse Now is pure film-making. My respect and admiration for Mr. Coppola is of the highest order. But I shudder at the return to what has become the norm for today's standards for film: a lack of innovation. It is not simply the unoriginality of the world of cinema today; it is the fact that nobody seems to care to tell a story anymore or to tell one with heart. But we still have the great ones like Coppola's masterpiece, a film which bathed in its ability to give us something deeper than that which we could comprehend.<br><br>That depth in Apocalypse Now is the step into madness. The killing can disturb. The loss of innocence can unhinge. But it is the damage from within; the countless barrages of images that distress, unnerve and detach us from our everyday world and the memories that plague our deepest thoughts that eventually segregates us from humanity and propels us into the realm of the instinctual, the savage and the animalistic. If the thought of killing does not provide sustenance, the act of killing provides man with its fundamental catharsis.","user":"ramstar22","rank":[223,284]}]