[{"title":"Not bad","rating":5,"date":"12 July 2006","review":"Sorority House Massacre isn't too bad at all, but there is nothing original or fresh about it either. The basic plot is the same as Halloween (killer from an asylum escapes in search of his sister) and borrows a little from Nightmare On Elm Street (lots of weird nightmares about the killer). The nightmares don't really add much to the film, so I think it would have been better if they had been left out. The build up to the climax is a little slow, but once the action kicks in there are surprisingly a few tense moments, such as when the killer tries to climb in through the window.<br><br>Overall, Sorority House Massacre is just an average slasher flick. Watchable, but not very original. Also not very gory, so gore-hounds should look elsewhere.","user":"Tikkin","rank":[8,9]},{"title":"Contrived Roger Corman-produced slasher is better than it should be","rating":6,"date":"25 May 2015","review":"\"Sorority House Massacre\" follows Beth, a college coed who is spending Memorial Day Weekend at a sorority house with several sisters who want her to join. The house seems strangely familiar to Beth, and a series of dreams and bizarre visions link her to a madman who is dead set on nabbing her in the house.<br><br>In some ways a \"Halloween\" ripoff of the highest order, \"Sorority House Massacre\" takes the blueprint of Carpenter's classic and bases itself on the precise premise without an ounce of shame. Madman breaking out of a psych ward, shots of a group of girls walking through the tree-lined suburbs to class (except here the location is unabashedly California, and the girls college students). While some people have ripped this film for its shameless imitation, genre fans are more likely to appreciate the funky weirdness the film has to offer.<br><br>There are tinges of a psychic thriller set inside the slasher framework here that are handled surprisingly decently; lots of talk of ghosts, dreams and psychology, and brainwave connections make for some inventive plot fixings. The flashbacks and Beth's bizarre visions of the villain are edited and presented in a startling fashion, and somehow manage to be mildly creepy. The film is much less gory than the title would suggest, which is another reason the film falls in line with a psychic thriller perhaps more than a straightforward slasher. The performances are ho-hum at best, but for a low-budget late eighties horror flick, they are completely respectable. <br><br>Overall, \"Sorority House Massacre\" is a heck of a lot better than it should be. It is contrived and at times silly, but there are some genuinely startling on screen encounters with the villain, and the film is engaging in all of its hokey eighties corniness. The obnoxious late- eighties \"Saved By the Bell\" wardrobe and California atmosphere is also another amusing point of interest. 6/10.","user":"drownnnsoda","rank":[7,9]},{"title":"Surprisingly good!","rating":5,"date":"5 September 1999","review":"I had resisted renting this for a long time, expecting something very typical and stupid. And in some ways, it was pretty campy (watch for the dress-up session!) but once the horror gets started, it gets pretty good.<br><br>Beth, a girl plagued by obscure but genuinely creepy nightmares, moves into her new sorority, just when most of the girls leave for Memorial Weekend. She stays back with three others, who, that night, are joined by four guys for a night of fun. Seems pretty typical, right? Yeah, I suppose. But it does get good.<br><br>Through some study on the dreams, and memories, Beth realizes that this is the house she used to live in until her brother killed the family and attempted to kill her. And, surprisingly, it's not one of those \"what a coincidence!\" things when the crazy brother escapes the local asylum. It seems as if the the brother and sister have some connection in their dreams, and he knows she is at the house. So he breaks free (pretty easily) and goes on a hunt for her, but only after wreaking havoc in town, stealing a car, and breaking into a hunting store to get a knife and kill the owner.<br><br>\nIt's nighttime, and it looks like Beth's dreams are becoming reality. They even find a hidden knife under a brick in the fireplace that she thought she imagined. Then the brother gets there, and the fun begins.<br><br>It's not stalk 'n slash, though, except for a few. Three guys are killed off, and then, when making out with her boyfriend, a girl is killed in a tent, and her boyfriend buck naked, escapes, gasping, \"Some guy just killed Tracy!\" Okay, so it is pretty campy, especially because he remains naked for a few minutes before miracuously finding some (girls?) pants in one room. Then the surviving four realize that they are trapped...with the killer...in the house....<br><br>Very good from there. The characters are likeable, and the killer is very twisted. It's great when he sees each of his victims as a family member he killed, right down to the end of the climax, which ends so well with Beth saying something like, \"Get away from me, you sick son of a b*tch!\" when she finally finds a knife while he is pulling her towards him.<br><br>\nOverall, an innovative movie, if you can look past the many stereotypes, and the cheese. The acting isn't terrible, and the characters become likeable, especially the last two girls. Definitely check this out, just for the really great horror towards the end.","user":"WritnGuy-2","rank":[9,13]}]