[{"title":"For Some Working Capital","rating":6,"date":"21 October 2007","review":"Dark City would probably be an unknown film today if it were not for the fact that it introduced Charlton Heston in the starring role in his very first film in Hollywood. If not for that it would rate as a passably good noir thriller.<br><br>In fact Dark City did not even lead to Heston getting his real screen break in his second film. After having done Dark City, Heston just happened to be passing by Cecil B. DeMille's trailer, one of many contract players toiling in the last decade of the big studio system at Paramount. DeMille who liked tall leading men for his films and had made up his mind to cast an unknown in the role of circus boss in The Greatest Show On Earth saw Heston and his height got him the part. Later on DeMille learned about Dark City and had it run for him and was convinced even more.<br><br>For a man who played such noble characters later on screen, Dark City presents Heston as a cynical gambler whose bookie joint got raided. Needing some working capital to get back on their feet, Heston, Jack Webb, and Ed Begley find a sucker in the person of Don DeFore and rope him into a poker game. DeFore loses his shirt and when he signs over money that isn't his to cover his debts, he later kills himself.<br><br>That sets psychotic older brother Mike Mazurki on the trail of those responsible. And Heston is desperate to get some kind of line on the brother before he winds up dead.<br><br>Part of the reason Dark City isn't a better film is precisely because Heston is not a nice guy. There certainly is no rooting interest in what happens to him. Especially when he starts romancing DeFore's widow Viveca Lindfors in an attempt to get information on Mazurki.<br><br>The film was later remade taking it out west as Five Card Stud with Dean Martin in the Heston role and Robert Mitchum taking Mazurki's part. The victim in this case was a card cheat who the other players lynch, though Dean Martin protests that. Doing it that way made you care more what happened to Martin than what eventually will happen to Heston.<br><br>Lizabeth Scott as nightclub singer/girl friend of Heston, Harry Morgan as a retainer at the bookie joint, and Dean Jagger as the homicide cop round out the cast.<br><br>It's interesting to speculate though what kind of turn Charlton Heston's career would have taken if Cecil B. DeMille hadn't spotted him that day on the Paramount lot.","user":"bkoganbing","rank":[27,31]},{"title":"Good Crime Noir on Verge of Being Great; Good Cast and Direction","rating":7,"date":"14 September 2005","review":"This film is crime noir since Danny Haley, its lead played admirably by Charlton Heston, in his first major Hollywood starring role is running an illegal bookie joint. The film, as no one else seems to have noticed, is about a man who because his British wife left him after the war and he is disillusioned by the military-industrial complex's fostering of postwar injustice, has taken up \"hustling\" instead of trying to play by the Establishment's rules. All throughout the movie, people keep blaming Danny for untrue things, his crime being in giving up on an increasingly corrupt postmodernist national government--i.e. neither being an altruistic Democrat nor an overworking Republican. In the film, Danny's place is raided by honest police officer Dean Jagger. The raid leaves Danny with no source of income. A stranger, Don DeFore, strikes up a conversation in Danny's hangout; he ends up in a poker game with Danny's bookie friends Soldier (Harry Morgan), Barney (Ed Begley Sr.) and Augie (Jack Webb). DeFore loses 5000 dollars in a crooked game, pays with a cashier's check and hangs himself in his hotel room that night--some of the money was not his...But, soon after, Barney is found hanged, and the rope was just put around his neck to make the crime look like a suicide. The jumpy, coward Augie and Danny figure that they are going to be the next targets, since they learn Arthur has a psychopathic brother, Sidney. They fly to Los Angeles to seek out the man's widow and get a photo of the brother. Soldier did not participate in the card game. He goes to work in a Vegas casino run by his old-time boxing friend Swede (Walter Sande). This intriguing setup is then turned toward Danny's life-altering meeting with Arthur's gorgeous widow (Viveca Lindfors). He has avoided making a commitment to Lizbeth Scott, a lounge singer who is very much in love with him. But seeing how determined the honest Lindfors is to make a life for her son, he decides to try to get enough money in Vegas to pay the widow back and pair with Scott. The kicker in the deal is the crazed Sidney is still hunting him and Augie as well. Cinematography is luminous B/W by Victor Milner, and the art direction by Franz Bachelin and Hans Dreier complements the great William Dieterle's direction effectively by my lights. Franz Waxman provided serviceable music, Sam Comer and Emile Kuri did complex set decorations; and the female participants looked lovely partly thanks to Edith Head's costumes.Larry Marcus' story \"No Escape\" has been adapted here by Ketti Frings, with John Meredyth Lucas. The script's episodic elements prevent this movie from being recognized for the fascinating character study it is. It is about what happens to those who for whatever reason stop trying to fight for life in the world of normative values, whoever the opponent, and who enter the world of the collective--crime--for whatever reason. In this story about Danny, the man who escapes the \"dark city\" he had thought to hide from life in, Charlton Heston is very good for his age. Jack Webb, a powerful radio actor, here turns in what I regard as his best screen performance ever as the nasty and cowardly Augie., Ed Begley Sr. was one of Hopllywood's best dramatic actors, infusing a small part in this feature with his usual dynamic intelligence; and Harry Morgan as the brassy \"Soldier\" is charismatic and effective. Viveca Lindfors is very well cast I suggest as the suffering but courageous wife; Don Defore was very good at playing a man shallower than he appeared, and here he has a lot to work with. This film is the first since Ayn Rand's \"Love Letters\" to reunite DeFore and Lizbeth Scott. Scott had limitations in drama although she was adept at comedy, and here she looks lovely as the singer, Fran. Others in the cast who showed to advantage included Dean Jagger, Walter Sande, Walter Burke, and many lesser known persons. Mike Mazurki was miscast as DeFore crazed brother but does his powerful best as usual. This is a very seminal-transitional film, I claim, from a period when noir films, crime or otherwise, had been set in the underworld, to the period where the breakdown of U.S. society had begun to affect law-abiding folk. It is also one of the post-war angst films wherein the war to \"make the world safe for democracy\" had been revealed as leading to difficulties for returning servicemen. It just misses being very good indeed.","user":"silverscreen888","rank":[23,26]},{"title":"What's your excuse Danny ?","rating":9,"date":"6 July 2010","review":"The description \"Film Noir\" still seems to cause lots of confusion: some people seem to think that every black &amp; white movie with some cynicism in it is a Noir movie. By extension, Dark City is often labeled as Noir. It's OK with me to use jargon, but let's only use it correctly, shall we<br><br>Although Dark City certainly has elements of the Noir genre, there is a very simple reason why this movie really don't qualify as such: indeed the cynical main character Dan Haley slowly but surely turns into a better man, gradually allowing his conscience to play a more important role in his life, and taking several correcting steps after a life of causing sadness and anger. In the end, there's even the promise of a bright future for him with torch singer Fran. All this is very un-Noir ! That doesn't make it all of a sudden a bad movie. On the contrary !<br><br>To me, Dark City actually has a very clever psychological plot. All along the way, we get bits of information about why Haley has become a cynical hoodlum. He has been a courageous soldier during the war, but the infidelity of his British wife led him to kill her new love interest. Charges against him were dropped, but it clearly left him quite cynical about interpersonal relationships. Still, he's not rotten to the core. We get first evidence of this, when he discovers that his poker game buddy Augie has been cheating in a game that left L.A. business man Arthur Winant penniless.<br><br>Another indication of his double feelings about the world around him can be found in his relationship with Fran:<br><br>Fran: Don't you ever need somebody Danny ? Danny: What for ? Fran: Just to need<br><br>Although he keeps on pushing lovesick Fran away when she's once more trying to get too close to him, he will remain -in his own particular way- loyal to her.<br><br>So, if one of the reviewers complaints about the lack of chemistry between Heston and Scott, he seems to have completely missed the point this movie is trying to make. Of course there are no sparks flying around here !!! Heston's character is still too much influenced by his troubled past, by the betrayal of his love by his British wife and a friend. He's still in the process of adapting, of regaining some hope. In the end of the movie, he's only beginning to think about romancing again.<br><br>Then, several small elements distributed cleverly along the storyline like Tom Thumb's crumbs will lead to big changes in Haley's life. His friend Soldier's remark that he's \"Worse than the others\" is one of these little seeds, that makes him reflect about his actions. Another one is dropped, when Swede tells him about the Irish boy he killed during a boxing contest. Swede brought all the money he could find to the mother of the deceased young man, but she spat him in the face. This element makes Haley review his reactions concerning Victoria. Victoria too has an important impact on his life, as he sees how she's taking care of Billy, protecting him against uncle Sidney, and how difficult she must have got it, after her husband came back from the war. (Unless he was boasting, he is supposed to have been involved in Special Operations, a kind of work that generally leaves no one without psychological changes. The man is a heavy drinker, and although he has a gorgeous wife and a young son, he's soon playing Casanova in Chicago, dating Fran). Fran too drops several little seeds in Haley's mind, and so does the Police Captain. Although he remains outwardly cynical, all these little drops soon find a way to his heart. The fact that he was upset when he discovered that Augie had been cheating during the poker game already made it clear he wasn't rotten to the core. There still was the possibility for him to change his life. The several meetings with people he has after the suicide of Arthur Winant all turn out to be guiding lights to the right path of life again. And in the end, the patience and extreme loyalty of Fran is rewarded. <br><br>So, although this film starts as a Film Noir, this clever movie is in fact about how all kind of positive little events can set in motion important positive changes in someone's life. It's about hope, about starting all over again, about how something positive still can come out of sad events, such as a suicide. Real Film Noir isn't about optimistic at all. The main characters are cynical and self serving, and don't go through changes. Or if they do, it's only to become even more cynical at the end. See for ex. Fred MacMurray's character in Pushover, or Lizabeth Scott herself in Too late for tears. That's Noir with a capital N. <br><br>I was extremely pleased by this movie. I'm still trying to find out who actually sung the songs Lizabeth Scott's singing in this movie. Although she took 2 ½ years of singing lessons in the 1950's, and even released an LP, she never reached a sufficient good level to leave an impact as a singer. But the female singer who sang the songs in Dark City surely did. It are haunting melodies such as \"Letter from a lady in love\" or \"Old black magic\", sung with a sultry voice. Globally: nice storyline, fine cast, a movie that's worth adding to your collection ! 9/10","user":"VanheesBenoit","rank":[17,19]}]