[{"title":"Brief encounter in California","rating":7,"date":"5 December 2005","review":"This surprising film was shown on TCM recently. Not having seen it, and not having other choice, we decided to take a look, and quite frankly, it was a surprise. The film, directed by Melvin Frank and co-written with his partner, Norman Panama, shows two stars that endeared themselves to the American public at their best.<br><br>The story is just a pretext and a vehicle for the stars. The plot kept reminding us of \"A Guide for the Married Man\", but that's all the comparison, because one has nothing to do with the other. In fact, this is a film made in 1960 when nothing too risky would be tackled for the screen, yet, it presents two straying adults who suddenly find an attraction where dislike existed before.<br><br>Bob Hope was the surprise in the movie. He doesn't have a chance for uttering his one liners, as the script doesn't allow it. It was one of the best films in which he appeared, in our humble opinion. Lucille Ball was an excellent comedienne, and she shows it on this film.<br><br>The interesting supporting cast makes the best with the material they were given to play. The excellent Ruth Hussey is seen as Bob Hope's wife. Don DeFore, plays Lucille's husband. Louis Nye is also seen in the film.<br><br>The film is light and will charm anyone wanting to spend some time in the company of some of America's best comic talent of the past.","user":"jotix100","rank":[28,34]},{"title":"Lucy and Bob","rating":7,"date":"22 November 2006","review":"Lucy and Bob in a 1960 romantic, satiric comedy. What more could you want?<br><br>This is very aware for its time and has some wonderful period scenes. Hope and Ball seem to have very complementary comedy styles which play extremely well off each other.<br><br>This movie came out way back in 1960, yet Bob Hope mentions problems raising kids in the electronic age. How forward looking.<br><br>The black and white format takes nothing away from this movie, including the scenes of Acapulco when they're alone together. <br><br>All in all, an extremely enjoyable movie. I like Lucy much better in this style than her slapstick routine, although she's great in that too. Give this one a look sometime, it's worth it.","user":"oldmotem","rank":[18,21]},{"title":"Very good.","rating":8,"date":"8 December 2005","review":"This movie surprised me. I really enjoyed it. Lucy is stunning as a glamor star. She gets the soft focus and lighting, the glamor hair and makeup, but the showstopper is the glamor wardrobe. I've never seen her look more beautiful.<br><br>I did not know that Lucy had made it so far in her movie career as to be able to star as a glamor girl, opposite Bob Hope yet. Another notch on the resume of this fascinating woman.<br><br>My wife and I had just been discussing Lucy's talents as a straight actress and by coincidence this movie came on the next day. I had the opinion that Lucy was best in comedy and was not quite right in a straight role. This movie proved me wrong on that! She is convincing and when she kissed Bob I really believed it.<br><br>Bob is also great. His comedy style here is more subtle than usual, playing funny bits off in a straight style without the usual hamming. The bit with the hankie made me belly laugh.<br><br>The subject matter of this movie is similar to other movies of the early 60s as the sexual revolution was just starting...all clean and above board on the surface, yet doing their best to titillate us with sexual situations and innuendo. As I said in my review of Bob's \"I'll Take Sweden,\" I find this juvenile and boring. There's no shock value left by now, so it falls flat. However, this movie tackles more serious subjects than simply titillating sex, namely the subjects of infidelity, marriage, and marital boredom. That is more interesting and even in 2005 I found the subject matter moving and thought-provoking.<br><br>The script is tight and witty, with good dialog. The plot is also more or less water tight with plausible motivations.<br><br>Good stuff....worth watching.","user":"LarryBrownHouston","rank":[14,16]}]