[{"title":"Obscure and underappreciated","rating":5,"date":"5 September 2001","review":"Evidently not many people have heard of this movie.   I saw it when I was a kid in the 1950s and was impressed, being an aeronautics buff even as a child (and still so today).   The story revolves around a new advanced design commercial airliner called \"Reindeer\", in service in the UK and an aeronautical engineer (portrayed by Stewart) who suspects that the aircraft might have a design problem that could result in a structural failure of the vertical tailplane from metal fatigue... an at-the-time relatively new field of science in aviation.  After one of the airliners is lost in a crash (and the tailplane is not among the wreckage) Stewart's character (Theodore Honey) begins testing of a production tailplane in a large research lab, vibrating it to see if, after a carefully calculated number of hours of vibration, the tailplane will suffer a structural failure.  His theories about the proposed failure of the lab test subject tailplane assembly after a select number of hours of vibration are reinforced by a similar number of flight hours on the first airliner that was lost, which confirms his convictions that the crash was indeed the results of a structural failure brought on by metal fatigue.<br><br>The problem is that Mr Honey is a bit of a recluse and eccentric, a widower and single parent, and considered a bit of an odd duck by his contemporaries.  However, he has credentials and his work is taken seriously enough to allow him to convince his employers to conduct the structural design lab tests, even though they do not really take him seriously on his metal fatigue theories and for the most part seem to be simply patronizing him... ...until Honey finds himself traveling via air and the airplane he gets onto happens to be a Reindeer... with enough acquired flight hours on the airframe to be dangerously close to the failure point according to his calculations.   Honey, upon realizing that the airplane has the \"required\" flight time on the clocks to be in danger, embarks upon a quest to do something about it as only an eccentric genius can, and the story takes off from there (again, no pun).<br><br>The combination of a laid-back American actor like James Stewart and a somewhat abrupt British cast tends to accentuate Stewart's Theodore Honey, a normally reserved but very absorbed engineer caught up in his work, surrounded by a pack of hustle and bustle Brits.  It's quite a contrast. Good support from Glynis Johns as the stewardess aboard the Reindeer and Marlene Dietrich as movie star Monica Teasdale, also a passenger aboard the airplane, both of whom get caught up in Honey's apprehension and fears of an impending disaster that he is certain is staring them in the face, although nobody else really takes any of it seriously... until Honey takes matters into his own hands after the airplane lands without incident and he learns that it's scheduled to remain in service in spite of his rather uncharacteristically loud and spirited pleas to have it grounded.    His solution to keeping the airplane grounded until his lab tests are concluded is certainly an interesting turn of events.<br><br>Considering the vintage of this film (1951) it has decent F/X and remains a bit of a period piece, demonstrating how air travel used to be done before mass transport Jumbo Jets and economy class seating.  This film is an aviation enthusiasts sort of movie as well as a story of the little guy who believed in his convictions and the few people around him who believed in him as a person... even though they may have doubts about his work and his theories.<br><br>Good cast across the board, with some standouts like Jack Hawkins who is always fine, and Marlene Dietrich who at first seems to be there solely as Star Appeal although after a bit of time passes, her presence becomes more and more genuine.   There is some good character development in this film, albeit sometimes a bit rushed and the ending is also rather abrupt... but typical of many British films of the period.  All and all, it's a film well worth watching for the fine performances and the engrossing story... and as a sidenote, for the look back at the way the fledgling airline industry and how it was coming into its own.<br><br>It also inadvertently provides a sobering point to ponder since this film was produced several years before the British De Haviland Comet jet airliner entered service and disastrously became aviation's first great example of the potential for a catastrophic structural failure caused by a design fault, which although corrected quickly, still didn't save the airliner from the stigma it suffered when several crashed after they experienced explosive decompression at high altitude from something as simple as having cabin windows too large and the wrong shape.<br><br>The British airline industry must have collectively flashed back to this film during the mid-1950s and the Comet's woes, and how prophetic \"No Highway In The Sky\" must have seemed at the time.<br><br>This film also includes some considerable supporting talent, almost all of which went uncredited, such as Kenneth More and Wilfrid Hyde-White.","user":"tonyu-2","rank":[69,72]},{"title":"Inspiring, entertaining, and prophetic gem of a film","rating":8,"date":"31 August 1999","review":"I first saw \"No Highway in the Sky\" when I was 11 years old. What has always impressed me about the film is the fact that it shows how the courage of the little known people of the world can accomplish a greater good. Theodore Honey (Jimmy Stewart's character) is a written-off by his peers, superiors and the outside world as a strange sad little man. He is a widower, and a single parent. All he has is his daughter and his work to keep him going.<br><br>But he is also single minded in his pursuit of his knowledge and his craft. He gathers his data, forms his postulate and relentlessly pursues his goal regardless of the establishments thinking on the matter. When he realizes that he or people that he has met and starts to care for may be injured or killed if does not act on his theory, he has the moral fortitude to act to save their lives and prevent tragedy. Unorthodox, yes. Odds against him? Yes. Do you admire him? YES!!! Dr. Honey versus British Government and British Airways is prophetic. (e.g. The British Comet disasters of the early 50's happened after this film was made) (Also think about the engineers at Thiokol battling NASA over the Challenger launch) James Stewart, a pilot himself, shows us that this courage of facts versus opinion and profit is the courage that should be encouraged and rewarded.<br><br>35+ years later, I am an engineer and I owe a great deal of it to this film.","user":"Dennis-81","rank":[40,42]},{"title":"An Underated Inteligent Thriller","rating":28,"date":"28 April 2004","review":"This movie is one of the few films about airplane disasters that really goes into the fundementals of design and construction problems.  For it deals with metal fatigue, and how it causes an apparently marvelous airplane to become a death trap.  The film is well written and acted by Jimmy Steward, Glynis Johns, Marlene Dietrich, and Jack Hawkins.  There is nothing to say about that.  I only feel that it is interesting to think of the author of the screenplay, Nevil Shute.<br><br>His real name was Nevil Shute Norway.  He is remembered for his writing, in particular the novels A TOWN NAMED ALICE and ON THE BEACH.  But he was also an aviation engineer.  Working for Vickers, he helped design all types of aircraft.  In particular, he helped in the building of the zeppelin R-100 which Vickers designed in a contest between private industry and the government.  A Labor government in office was trying to demonstrate the superiority of government sponsored projects over private industry.  The R-100 proved a perfectly adequate zeppelin, that did a maiden trip to and from Canada safely.  The government sponsored R-101 crashed on its first voyage in France, and killed 44 out of 48 men on board, including the Secretary of State for Air, Lord Thomson (who had pushed the project) and most of the government's aviation experts.  Shute wrote a very good account of his career as an engineer, and of the R-101 Tragedy, entitled SLIDE-RULE. I recommend reading it if you ever get a chance.  It helps explain the experience he brought to the writing of NO HIGHWAY.","user":"theowinthrop","rank":[38,42]}]