[{"title":"A Sci-Fi with a capital \"S\".","rating":10,"date":"22 May 2004","review":"I have always been attracted by science, since my early childhood. I remember seeing this movie and being fascinated by the science and technology on display in it. Today, as a MSC EE, I can see that the science in \"Andromeda Strain\" is accurate. In fact, it's the most accurate of all Sci-Fi movies I have ever seen (and I have seen the great majority of Sci-Fi cinema).<br><br>That's one reason I love this movie.<br><br>But there are other, probably subjective reasosn for my adulation of \"Andromeda Strain\": believable people and believable situations (no \"last microsecond decision/action/occurance\", no over-the-top behaviour, just human quirkyness, no one-man-does-it-all but teamwork and birth of ideas) and the avoidance of the cliche of only-1-will-survive. So, yes, I liked the script a lot.<br><br>I also thought the actors were good and the setting was brilliant. I am not put off by dated computer technology: the film clearly illustrates the computing capabilities at the beginning of the '70, and I find something educative and strangely reassuring in that.<br><br>I give it 10/10, and am sad that nobody produced a Sci-Fi as scientificly accurate ever since.","user":"haggar","rank":[152,181]},{"title":"Near Perfect","rating":9,"date":"20 March 2003","review":"Robert Wise is an under rated director but in his body of work are such gems as 'The Body Snatcher', 'The Set-Up', 'The Day the Earth Stood Still', 'Odds Against Tomorrow', 'The Haunting', 'West Side Story', 'I Want to Live!' and on its own terms, 'The Sound of Music'. He managed to make genre films more interesting and watchable than other more celebrated directors.<br><br>\n'The Andromeda Strain' is an engrossing film from beginning to end. It is science fiction, alien virus comes to earth type thing, but has more depth than just that. The scientists, played very well by Arthur Hill, David Wayne, Kate Reid and James Olson, are fallible and have real emotions. Yet in them is a longing to know, to discover, to solve. Most popular cinema celebrate the fist or the gun but part of the excitement of this film is the use of the intellect to tackle the problem. Brains and not brawn is key.<br><br>The early scenes in the town of Piedmont are fascinating. Nothing dramatic, only small details adding up to a large tragedy. Restrained film making is not common but in this case it is really effective. After these scenes the film moves on as fear and wonder grip the scientists to a satisfying conclusion. <br><br>The electronic music is just right, the sets are atmospheric, the hard ware plausible and the photography simple and effective. A mention should be made of Paula Kelly as a nurse, an excellent actor and shamefully under used in films. (She is great in 'Sweet Charity' too.)In a supporting role she gives an intelligent, spirited performance. <br><br>A near perfect film. Hopefully no one will re-make it.","user":"henry-girling","rank":[103,121]},{"title":"The finest example of how to make science-fiction movies","rating":8,"date":"23 December 2002","review":"The Andromeda Strain is virtually perfect. And it doesn't need the special effects of Alien to succeed in telling the similar story of alien life and our contact with it. The movie is captivating right from the starting credits that introduce us to story. Of course, the director had a brilliant novel of Michael Crichton, but he also did his best to bring this novel to the screen sacrificing neither the main idea, nor the minor details. Actually, all the details that mark every scientific thriller by Crichton are there in the film. The Andromeda Strain doesn't have any dinosaurs, it only has a small virus, but overall it is a much better film than any of the Jurassic Parks. And it succeeds in telling us a great story about science much better than some modern CGI-filled movies like Invisible Man.<br><br>Finally, the acting is flawless, the actors are great, sets are excellent. If you want to see a great sci-fi movie, choose this one and you want be disappointed.","user":"danila_1","rank":[106,126]}]