[{"title":"The best of the series excellent slasher film the best Friday the 13th movie ever","rating":10,"date":"24 September 2017","review":"Friday the 13th: The Final Chapter is my all time favorite horror slasher 80's film it is the best one and it is tied with Friday the 13th Part VI: Jason Lives it is my third favorite Friday the 13th film this is a good a really good film. It is one of my personal favorite horror movies. It is my favorite film this is the best one I will always watch this film as many times I will want too I loved it so much I loved it! <br><br>Kimberly Beck, Corey Feldman and Crispin Glover made this film work for me. This is Joseph Zito's best film he ever made. After this Joseph Zito went and directed Missing in Action movie with Chuck Norris a year later he directed another actioner Invasion U.S.A. again with Chuck Norris. <br><br>I enjoy this movie much you have beautiful cast in here you have a lot's of nudity, great gory and bloody scenes, great kills great heroes. I just love this film to death from setting from acting from jokes everything I love in this film. I think is better than Part 1 and 2 but that is just my opinion. MILES way better then lackluster Part 3: 3D.<br><br>Corey Feldman is great as Tommy Jarvis the main hero in this film this is his best film. I love him in The Lost Boys and in this film he was fantastic. Kimberly Beck as Trish Jarvis was excellent in my opinion really excellent I love her so much in here. Crispin Glover was great before he went to star a year later in Back to the Future (1985) my all time favorite film. Amy Steel convinced Peter Barton to play the role of Doug in this movie it was her talking that convinced the actor to make this movie. You have Double mint Twins Camilla and Carey Moore they are great twins. Judie Aronson from American Ninja and Dessert Kickboxer is in this film I barely recognize her but she is in this film. E. Erich Anderson as Rob did a good job as the guy who want's to avenge his sister death.<br><br>Special makeup effects artist was Larry Carr, Tom Savini and Kevin Yagher who were practical special effects. No CGI bull sh**t no shaky cam I love all gory and practical effects used in this film. Yes Kimberly Beck can act! There was a beautiful jump scene trough window in which the actress fall. I kind a got a feeling that Wes Craven's Scream imitated that scene and copied it with Sidney (Neve Campbell) falling down from the window on the boat.<br><br>The characters in IV were less cartoonish and more likable. I felt for Jimmy and Sarah, they were sweet kids. And ole big jaw, who bites it in the shower, wasn't such a bad guy. Nor was he an egregious stereotype. It feels like the franchise came into its own here. The Final Chapter is well-paced and well-acted, fit with campy dialogue, bloody deaths, and nudity galore. It uses the same formula as previous entries but it's a step above in execution. And it successfully managed to provide closure for the franchise... for a short time, anyway.<br><br>The cast is also a little more varied this time around, with the introduction of the Jarvis family as well as Rob. Even though he doesn't accomplish much while alive, Rob was a great addition to the formula as the one guy who actually knows what the hell is going on. His mission, to hunt down Jason and avenge his sister, was an interesting turn for a series full of oblivious dopes. Too bad he doesn't use his genre savvy as well as he should have, losing his best weapons early on to sabotage and then putting up little-to-no actual fight once he finally comes face to face with his prey. Though in the end, without him (the machete and the all-important newspaper clippings are of course Rob's) Trish and Tommy would have probably had no chance in fending off the maniacal Mr. Voorhees.<br><br>Which brings me to another thing. Jason is a ruthless killing machine in this one. He doesn't spend 10 minutes walking around and closing barn doors to elicit responses from the curious. And this being an early sequel, he's still active and apt to run after a victim rather than slowly walk and conveniently teleport in front of them. Which makes the end sequence one of the last that had any real urgency to it. And the gore, in addition to being really effective, doesn't seem quite as harshly cut from this one.<br><br>The Final Chapter ties the original run of the series together well, and is the last Jason entry that can really be taken seriously.<br><br>This is my number 3 favorite Friday the 13th movie I will always watch it, it is my favorite film. It is one of my personal favorite movies. It is one of the strongest in the franchise, The Final Chapter stills holds greatly on suspense, unpredictable scenes and bloody, gory kills! Even if I love Jason Lives to death, this seriously should have been the end of the franchise! <br><br>This movie get's my Bad-Ass Seal Of Approval 10/10 this movies are great I love this film to death I love it I highly recommend it to the fans.","user":"ivo-cobra8","rank":[90,110]},{"title":"The best in the series.","rating":7,"date":"27 June 2015","review":"I've seen every Friday the 13th movie more than once. I'm a horror completist, what can I say, and Friday the 13th happens to be one of the more campy and fun horror franchises out there. The first three were fine - all had great ideas, great kills, and great atmosphere. Unfortunately, there was at least one thing off in each of those movies. The original's climactic ending hasn't aged well and some shots linger for way too long, and some parts of Part III felt clunky and poorly paced. Part IV isn't perfect either, but it's a step above its predecessors for a number of reasons.<br><br>1. The acting - No one watches horror for the acting, I understand that, but when a horror movie has a likable cast and characters you can relate to and root for, it makes the experience all the more enjoyable. Crispin Glover is great as a nerdy, horny white boy and his dancing skills are unmatched. The lead girl and the rest of the supporting cast are all convincing as well, and the boy Tommy Jarvis actually isn't annoying for a child actor. In fact, he's pretty darn good.<br><br>2. The nudity - No one watches horror for the- okay, some people watch horror for the nudity, and boy is there nudity in this one. For the \"final\" chapter the crew went all out, throwing two gorgeous sisters and numerous blondes into the mix and having all of them show their tits and ass. Yeah, both, and although its gratuitous and adds nothing to the plot, it's a nice break from the bloodbaths and I'd take a little eye candy over forced dialogue in a horror movie any day of the week.<br><br>3. The pacing - The movie begins with Jason's \"dead\" body being sent to the morgue, and it isn't long before the body count ensues. The hospital scene is excellent for a few reasons. One, it has two characters that have less than five minutes of screen time but more personality than anyone from the first two F13s, and two, their deaths are awesome. It's a briskly paced movie and surprisingly keeps a large amount of its cast alive for a majority of the film, yet there are enough disposable characters to keep the body count going. It's a great balance.<br><br>Everything else comes down to good writing and good directing. I like the addition of a family, I like the group of teenage Jason fodder this time around, and there really aren't many dull moments. The inclusion of a seasoned backpacker was a nice touch, and Jason finally getting the sh*t kicked out of him was no doubt satisfying. Although the whole Tommy arc didn't work out in the next installment, he was a nice addition in this one and actually contributed a lot to the story.<br><br>Not only is this the best Friday the 13th film, but it's a damn good slasher in its own right. The characters are likable, the third act is plenty suspenseful, it's an entertaining ride from beginning to end. If you like '80s slashers and want to see some good looking people get terrorized by Jason Voorhees then there's no reason not to check this one out. And check out the others too because, why not?","user":"lnvicta","rank":[60,72]},{"title":"Friday the 13th The Final Chapter: Vast improvement on the previous films","rating":7,"date":"4 October 2017","review":"Friday 13th 1-3 I considered to be generic camp slashers which didn't live up to the iconic legacy that the franchise has built up. This 4th part however was an improvement and I actually quite enjoyed it.<br><br>This time with a couple of familiar faces in Crispin Glover and child star legend Corey Feldman the movie actually had a bit of a storyline which the previous ones didn't. Thin storyline absolutely but a storyline all the same.<br><br>I didn't entirely understand the logic of the movies finale but everything else was well enough done and though the film pales in comparison to the same years Nightmare On Elm Street it's still a decent slasher feature.<br><br>The Good: <br><br>Vastly improved death scenes <br><br>Actually has a story <br><br>The Bad:<br><br>Still pretty naff in places <br><br>Weak ending <br><br>Things I Learnt From This Movie: <br><br>If a rubber dinghy gets run through with a machete it'll continue to float because physics <br><br>Harpoon gun up the bum is a hell of a way to go","user":"Platypuschow","rank":[11,12]}]