[{"title":"MAD!","rating":10,"date":"30 December 2002","review":"This movie is awesome, it's another one that takes my breathe away every time I see it! The action just flows, Sammo has never looked fitter, even as a kid he wasn't this slim! Yuen Biao shows why at one time no one could touch him in the acrobatic action. Again, I'm a little biased with this film as the first time I saw it was my first experience of Hong Kong action on the Big Screen (happy days at the Scala, Kings Cross, Thank you Rick Baker et al). From the very start, when the late, great Lam Ching Ying (RIP, he went too early) scales the Flag Pole to the final slow zoom out hillside shot this film will hold you to your seat (unless you hate action). It's an action film fan treat all the way. SEE THIS MOVIE NOW! (preferably in subtitled form as some humour gets lost in translation!!)","user":"JinxsterJones","rank":[14,16]},{"title":"Hong Kong version of the Dirty Dozen, courtesy of Sammo Hung.","rating":10,"date":"19 February 2005","review":"Eastern Condors (1986) is an awesome movie from Hong Kong Cinema legend Sammo Hung. Hung, along with his crew of usual actors remake the classic Dirty Dozen along with Full Metal Jacket. The end results is one of the best action movies ever made. From the beginning until the end, this action packed film doesn't disappoint it's intended audience and will make converts out of the non-believers.<br><br>A group of Chinese-American soldiers are given a second chance at redemption. If they complete this dangerous assignment they'll receive a full pardon and compensation money. They have to take out a cache of weapons left behind by the U.S. Army in Viet-Nam. Can this bunch destroy the weapons depot and avoid detection from the local Vietnamese military?<br><br>Lam Ching-Ying is appointed by the government to lead the rag tag soldiers into combat. Sammo Hung is second in command. Yuen Biao is a local Vietnamese resident who joins the soldiers, Yuen Wah co-stars as the ruthless Vietnamese officer who purses the soldiers to no end. Joyce Godenzi also co-stars as the leader of a small unit of freedom fighters.<br><br>Like I said before, this is a no nonsense action packed film from beginning to end. The fight scenes are amazing and the direction from Sammo Hung is pretty solid. If you enjoy action films by all means grab this one immediately.<br><br>Highest recommendation possible.","user":"Captain_Couth","rank":[9,11]},{"title":"Total action classic and one of Sammo's best","rating":9,"date":"25 November 2013","review":"Eastern Condors has few equals in the action genre. Directed and starring Sammo Hung, Sammo turns the action to eleven in this hybrid of modern action and kung fu. Also appearing is Yuen Biao and Yuen Wah as the ever reliable villain. E.C. is Hong Kong's answer to The Dirty Dozen where a group of Chinese/American criminals go on a suicide mission to destroy a missile ammunition dump left behind by Marines in Vietnam. The tone is lighter than John Woo's Bullet In The Head, but is taken serious enough to care about the characters, move along the story and sell the abundant and insane action scenes. There is enough bonebreaking martial arts, crazy stunts, as well as a barrage of machine gunfire and explosions to please the most jaded of action fans. Overall, Eastern Condors more than delivers and I always enjoy re watching this action classic.","user":"dworldeater","rank":[4,4]}]