[{"title":"Maybe not great, but still a very good gangster film","rating":9,"date":"9 February 2004","review":"It took me a while before I really appreciated this film. Despite its flaws, this is probably the most serious, accurate, and restrained treatment on the subject you're ever going to get without watching a straight-out documentary. What you have is sort of a \"docudrama\" on the infamous St. Valentine's Massacre, and the events leading up to it.<br><br>\nNot that the film ST. VALENTINE'S DAY MASSACRE takes itself too seriously. It doesn't, but all of the over-the-top acting merely enhances the product. There are still some inaccuracies but the story adheres so closely to the actual facts that these discrepancies are easily forgiven. The violence shown might have been considered sensational in 1967, and this was most probably the intent, but it's pretty tame by today's standards. And if it falls short of being a great film, it's a near miss rather than one by a mile.<br><br>In this dramatization of the final showdown between the South Side and North Side gangs for control of Chicago's underworld in 1929, Jason Robards takes center stage as Al Capone. He might have been much older and looked nothing like the real Capone but then so what. As they say, you want an interpretation and not an impersonation. His histrionic performance, with all of its eye-rolling and exaggeration, strikes just the right note and does its part to help keep things moving throughout. This was an actor who knew what he was doing, and exactly how he should play it in this instance.<br><br>But it takes a while for Capone to show up, finally seen casually arriving in a limousine on his way to a board meeting with his underlings. The first hood to show up on screen is played (some could say overplayed) by George Segal as Pete Gusenberg, a member of the rival gang, who proceeds to intimidate a bar-owner. Actually, Segal gives a rather convincing performance as a very smug, arrogant thug who enjoys pushing people around, and acting like he's one bad dude, with guns and a gang to back him up.<br><br>\nA very effective technique employed throughout the film, provided by narrator Paul Frees, is the frequent voiceover commentary on various characters. Information is given, such as that the individual was born on this or that date, at whatever place, something about his background, and his place in the particular gang, etc. (often including his time of death as well). Not only does this provide an easily-understood guide for who's who, but it helps to get the viewer involved with these characters however unsympathetic or unsavory they might be.<br><br>In brief but well-played roles, on the Capone side, there's Paul Richards as Charlie Fischetti, Joseph Turkel as Jake Guzik, and Harold Stone as Frank Nitti, with a more conspicuous role played by Clint Richie as Jack McGurn, who gets put in charge of organizing the title massacre. That particularly bloody episode was designed to rid Capone of his archenemy and chief rival, George \"Bugs\" Moran, capably played by tough-talking Ralph Meeker. Moran was the head of the North Side gang, and in flashback scenes we're shown what befell Moran's two predecessors, Dion O'Bannion (played by John Agar) and Hymie Weiss (played by Reed Hadley).<br><br>The rest of the cast is made up of many fine actors, some familiar and others less so. Among the unlucky seven who have an appointment up against a certain garage wall, besides Segal's Pete Gusenberg, included are David Canary as Pete's brother Frank, Kurt Krueger as Moran's top lieutenant, Milton Frome as the gang's accountant, Joseph Campanella as a low-level employee, Bruce Dern as a mechanic, and Mickey Deems as a hanger-on. Not to be overlooked is the always excellent Frank Silvera as Nick Sorello, a not completely innocent pawn used in trying to set up Moran.<br><br>Almost every actor with a speaking role gets at least one good scene and a chance to shine, from the major actors right on down to several of the minor supporting players. An attempt is made to show some of the camaraderie and interaction among the members of each gang. The careful planning of the \"hit\" is laid out, including an amusing scene where two gunmen, posing as musicians, are renting a room from a wary landlady.<br><br>\nSuch details add to the plot and the characterizations, with keen attention being paid to recreating a 1920s atmosphere, and don't forget all of the various gunplay and assorted mayhem along the way, leading up to the fateful massacre. They even throw in a completely superfluous fight between Gusenberg (Segal) and his girlfriend over a fur coat. Since it's only a brief rest from the action, and we get to rest our eyes on Jean Hale, then what's the harm. Enjoy this trip back in time to gangland Chicago.","user":"grstmc","rank":[40,46]},{"title":"Realistic and mostly accurate","rating":8,"date":"21 February 2006","review":"\"The Saint Valentine's Day Massacre\" is a very good gangster movie, released five years before the all-time great \"The Godfather\". It's pretty accurate in its chronology, according to the books and documentaries I've seen about the incident, only a couple of dramatic licenses taken. The film unfolds like a documentary, showing the dynamics of the rival gangs and their blood feud. Opening with the killers leaving the garage and then the neighbors discovery of the massacre, it proceeds to detail the buildup to the crime. The victims are introduced, along with the killers and planners. Lots of good actors are in this, veterans of both the big and little screen. Jason Robards has been slammed for his over-the-top portrayal of Al Capone, but everything I've seen about Scarface shows that he was over-the-top himself. George Segal is especially good as a Moran gang member, Peter Gusenberg. Ralph Meeker is a tough , barrel chested Bugs Moran. Both gangs are filled with familiar, competent actors. Jean Hale has a nicely done cameo as a classic \"gun Moll\", Myrtle, Pete's squeeze. Even Jack Nicholson shows up as a Tommy gunner! The climactic massacre is chillingly accurate using forensic evidence to show how the victims fell and their final positions. All-in-all, a really good movie and record of one of the most famous and shocking events in American criminal history. 8 of 10.","user":"waynec50","rank":[24,28]},{"title":"Corman's masterpiece.......ludicrously underrated.","rating":10,"date":"17 April 2005","review":"Despite an lengthy and variously successful career in sci-fi and horror movies, it is this movie that I personally feel is the crowning glory of Roger Corman's career. It is also, I feel, one of the greatest and most underrated gangster movies of all time. It should definitely be held in the same high regard as movies like 'Goodfellas', 'Once Upon A Time In America' and, dare one even suggest, 'The Godfather'.<br><br>Everything about this movie is superb. The lush, opulent, colour-saturated widescreen cinematography; the fantastic acting; the meticulous attention to period detail that rivals that of 'Once Upon....America'. Also, the authoritative voice-over that runs the entire length of the movie pre-dates 'Goodfellas' by some 20-odd years.<br><br>At first one might think that Jason Robards is woefully miscast as Al Capone, but this is not so. He gives Capone an edgy, lean and utterly menacing persona. The rest of the cast reads like a Who's-who of exploitation cinema; Ralph Meeker(excellent as Bugs Morant), Dick Bakalyan, Bruce Dern, Alex Rocco and John Agar. Throw in a couple of cameos from Corman regulars Dick Miller and Jack Nicholson, and this really is a cast to die for...quite literally.<br><br>If there is a problem with the movie, it's that with the subject being so viciously evil, and knowing that EVERY character and event is real, the movie has a bit of a sour tone, and can be a bit of a downbeat experience to some people. That said, I suppose the purpose of the movie is to show EXACTLY what happened, and to humanise the victims, rather than treat them as some statistics in the annals of crime. Like all the great gangster movies, this doesn't glamourise the gangster life, but makes us glad that we are not a part of that dangerous world.","user":"Poison-River","rank":[43,55]}]