[{"title":"Offensively Awful - How Did This Get Made?","rating":1,"date":"28 February 2012","review":"Without question the worst movie I've ever seen, and not even in a \"so bad it's good\" kind of way. It's ninety minutes of sheer torture, starring a hideous cast of makeup nightmares; indisputable evidence of the lengths a commercial property can stretch for the almighty dollar. Like most children of the eighties, I had a healthy collection of GPK stickers in my closet growing up. The gross-out humor and macabre illustrations were a big selling point, but beneath all that was a creative core and a wild amount of versatility. Every card was completely different. The one-note comedy of their film translation, though, is like opening a pack filled with duplicates. I counted six jokes with a visual punchline of \"and then he peed his pants.\" That's not an exaggeration, and it's not the only example of the flick's careless comedic redundancy. Combine that with an appalling song and dance number (seriously), a horribly out-of-place romantic subplot (starring a pre-pubescent boy and a girl well into her twenties, no less) and a gang of foils cut clumsily from recycled cardboard. It's genuinely amazing this ever saw the light of day.","user":"drqshadow-reviews","rank":[40,46]},{"title":"Give me back my lost hour & a half","rating":1,"date":"5 November 2008","review":"This movie is terrible!! One of the fascinating things about the cast is that the two main characters 'Dodger' and 'Tangerine' happen to look at least 8yrs apart, but are in fact only 12mths apart. <br><br>The 'Garbage Pail Kids' themselves have awful costumes that are very poorly designed and really badly operated. The puppeteers need to be shot!! <br><br>I decided to find this movie and watch it because I hadn't seen it since it first come out, and I was sure I enjoyed it as a kid- What was wrong with me!!! <br><br>Save yourself a disappointing hour and a half....","user":"jdjuice","rank":[54,64]},{"title":"Tangerine, Juice, and Fashion!","rating":1,"date":"29 August 2005","review":"What do those things have to do with the Garbage Pail Kids? Heck if I know, but they are the basis for the whole plot. This is one of those movies that will never go away, because you pick it up thinking it is going to be funnier, grosser, and just better than it is, but I'm here to tell you its awful. You won't trust me. It is too allurring to not watch it for yourself, but you'll regret it. Mackenzie Astin cries frequently, is a foot shorter than his love interest, wins over a girl named Tangerine by designing Michael Jackson jackets, and distracts a bully by twirling a basketball on his finger, which should all have me rolling on the floor laughing hysterically, but instead I just stare aghast at the TV wondering if it would be better if the whites of the Kids' eyes maybe be white instead of dingy yellow. The GPK are so awkward, innocent, and happy, as they sing songs about team work, that you feel guilty laughing at them. Isn't there supposed to be violence, and maybe lewdness beyond the average PG potty humor? The character Valerie Vomit doesn't even vomit until the very end of the movie, but Windy and Nat sure do fart and pee a lot. Anyone have any ideas about why they came from a garbage-pail-rocket in space, yet they now reside in a magician's antique shop? Me neither.","user":"ksmacy-2","rank":[27,31]}]