[{"title":"worth seeing, not for children at all. Really fun.","rating":14,"date":"14 December 2001","review":"\"The Black Cauldron\" certainly doesn't fall into the genre of animated Disney family favorite, but instead feels much like the more grim and complicated fantasy films that were made in the eighties. Does it stack up to such films as \"Return To Oz\" and \"The Dark Crystal\"? Well, although not as complex as the aformentioned, this film is not without its charm.<br><br>The story of Taran, the pig-keeper's journey from gawky boy to gawky boy-hero apparently works better as told through the course of five books, and indeed it is the plot that feels put together, with a lot cut out of it for it's slim 1:20 running time.  Also suffering because of the short time is any character development, or a reason why the charcter of Dallben (an old minstrel) are in the film at all. However, this film still has a lot going for it.<br><br>The film has a wonderful pacing to it with some fantastic action scenes. It is adventurous and fun. An engaing film for any fantasy fan. What really makes the film though is it's terrifying and dastardly villain, The Horned King. He is basically a Skeletor knock off with absolutely no sense of humor. He looks like he stepped right out of an Iron Maden album cover, and that is a monumental good thing. The true threat felt by the presence of this decidedly un-Disney character keeps the tension of the film high.<br><br>It is this contrast, between the unconventionally ghoulish villans (definatly enspirered by Bakshi's animated adaptation of \"Lord of the Rings\") and the stock Disney characters makes the audience care more-so for the cutesy characters than usual. This is especially true for the cutsey character of Gurgi, who is much more tollerable than almost all other Disney sidekicks and especially more tollerable than a certain J*r J*r B*nks that we have all been over exposed to lately.<br><br>So I would recommend \"The Black Cauldron\", it's a fun and well animated adventure film. Compleatly scary and strange for Disney to make, but still very very good for other reasons nonetheless.","user":"PlanNine","rank":[58,67]},{"title":"Very underrated!","rating":8,"date":"6 October 2011","review":"I get tired of hearing people say that this is one of the worst Disney films ever. This film is energetic and action packed.<br><br>Simply because the movie is on the bleak side it has gotten unjust criticism. Sure Disney was not at a high point during this time but this movie was better than many others made during the 80's. Oliver and Company is good and I like it more than this but that's because I have more memories from it than BC. The Great Mouse Detective was alright but not anywhere as remotely good as these two films.<br><br>I haven't seen The Black Cauldron many times but it is a good Disney film. People who have a problem with the darkness of the film let me put it this way, \"Don't watch it and don't show it to your young children!\" If you think they can handle it later on than go ahead but don't knock the movie just because it's not what you think Disney should be.<br><br>The Black Cauldron is geared more towards a male audience but I am sure some girls may enjoy it as well.<br><br>If you haven't seen The Black Cauldron and your a big Disney fan at least give it a shot.","user":"ravsten428","rank":[19,20]},{"title":"A Disney Departure","rating":7,"date":"24 June 2004","review":"\"The Black Cauldron\" is not a typical Disney animated feature.  For one thing, it's not a G-rated musical.  In fact, it was the first-ever Disney feature to receive a PG rating.  The story comes from the works of Lloyd Alexander, in the spirit of J.R.R. Tolkien.  In it, Taran, a young pig-keeper must protect Henwen, a prophetic pig who can divine the whereabouts of a powerful weapon known as the Black Cauldron.  The demonic Horned King is after this bastion of black magic to create an invincible army of the undead.  This movie boasts impressive art shot in 70mm widescreen format, art which includes the contributions of a young Tim Burton.  Sadly, this feature did poorly in theaters, possibly being too frightening, or going over the heads of Disney's usual target audience. Just the same, \"The Black Cauldron\" deserves a good look!","user":"EmperorNortonII","rank":[61,73]}]