[{"title":"Masterpiece! The greatest Vampire flick ever made!!!!","rating":10,"date":"8 November 2015","review":"The Lost Boys (1987) is one of the best and the greatest vampire flick's ever made! A true Schumacher masterpiece and a classic horror film! I love The Lost Boys so much, it is one of the best true horror movies ever made from the 80's! I always loved this movie since I was a child and the vampires in here are awesome! It encompasses everything that was so silly and cheesy and fun about the 80's. The hair, the clothes, the music, the attitude - it seemed like nobody ever took themselves too seriously in that time. Hell, look at Tim Capello's cameo in the movie, for Christ's sake! Super oiled-up buff sax-playing dude in tight purple spandex? Only in the 80's!<br><br>The story is about Michael (Jason Patric) and his brother Sam (Corey Haim) who move together with their mother to stay with their grandfather in Santa Carla, California. One day Michael meets a girl and falls for her to know later that she is with a gang of guys who are vampires. They give him wine mixed with blood and Michael drinks it without knowing what it contains. Things change for Michael and he finds out the truth. He tries his best to resist the urge of becoming a vampire and fights it with the help of his brother Sam. This vampire movie is the epitome of excellent humor/horror. Just when you are sitting on the edge of your seat getting ready for the next scary scene you get a joke or a snide remark. As you are relaxed by the humor, you get hit with a nail bitter of a scary scene. The soundtrack is one of the best I've ever heard; some of my favorite music came from this soundtrack. <br><br>One of my favorite movies that I ever love a true classic, I think for once Joel Schumacher did a great job as the director, He screwed up Batman &amp; Robin (1997) but he made this movie right! This film is probably the best vampire movie I have ever seen, one of my favorites and the soundtrack was awesome loved Cry Little Sister and all of the tracks. The cast all around was very solid too I think probably the best cast for a vampire movie yet. I miss the 80's classic films, like one of them was Fright Night (1985) this movie is released 2.years later and it is another Vampire movie and right behind him. Gosh I want more Vampire flicks from the 80's like this one is. The Lost Boys is like Twilight of it's late 80's day. The difference between the two is that Lost Boys is a rock-n-roll vampire flick mixed with some goofy humor to make it the cult classic is has become ever since it came and went from theaters to VHS.<br><br>In this film are famous stars like are Jason Patric, Corey Haim, Kiefer Sutherland as Jack Bauer from 24 (2001) TV show, one of my all time favorite TV shows. Corey Feldman and of course Alex Winter he played in Death Wish 3, Bill &amp; Ted's Excellent Adventure and it's sequel Bill &amp; Ted's Bogus Journey gosh I miss those movies. Why can't they make movies like are this ones today? The Lost Boys, Fright Night, Death Wish 3, Bill &amp; Ted's Excellent Adventure, Bill &amp; Ted's Bogus Journey are classic movies where are they now?<br><br>Sleep all day. Party all night. Never grow old. Never die. It's fun to be a vampire. When a single mother and her two sons move to the sleepy seaside California town of Santa Clara, they discover much more than they anticipated in this visually stunning blend of hip humor, horror and rock 'n' roll about the most compelling group of contemporary vampires ever to put fang to vein. That is actually the basic plot of the film! <br><br>The Lost Boys is a 1987 American horror comedy film starring Jason Patric, Corey Haim, Kiefer Sutherland, Jami Gertz, Corey Feldman, Dianne Wiest, Edward Herrmann, Alex Winter, Jamison Newlander, and Barnard Hughes. <br><br>Anyway I am giving this film a 10/10 because the film deserves it and it doesn't deserve to be bashed and hated from people! I love this film to death I love it!!!","user":"ivo-cobra8","rank":[59,66]},{"title":"\"We trashed the one that looks like Twisted Sister!\"","rating":6,"date":"6 September 2006","review":"Haha, that line makes me laugh every time, just for how old school 80s it is. Not to mention the vampire that the kids just \"trashed\" didn't really look like Twisted Sister as he did more of a generic 80s pop metal dude. Middle school life in the late 80s (junior high back then) had some movies that were almost universally thought of as \"cool\". Some of these were Predator, Coming to America, Top Gun (yeah I said Top Gun), Big, and of course The Lost Boys. TLB was so popular with kids, I remember knowing the details of the plot before I had ever seen the movie.<br><br>Two kids named Sam (Corey Haim) and Michael (Jason Patric) move to Santa Carla, CA with their mother in hopes of a new life. Sam is looking to just have some fun and find a cable hook up for MTV, while his older brother Michael gets involved with some teenage vampire punk kids. Michael is slowly being recruited into the vampire clique that hangs around the boardwalk, while Sam desperately tries to turn him back to a normal human with the help of the overzealous Frog Brothers (Corey Feldman and some other guy).<br><br>Slick, stylish and shot like an 80s music video, this movie was a lot of fun. A few of the 1987 fashions here are enough to make this movie illegal in a some countries, but the hip feel of the film keeps it from being too dated. Well, in my opinion anyway, some kid today might think different. Afterall this movie is nearly 20 years old. Typing that just made me feel very, very old. Anyway the cinematography is absolutely gorgeous, director Joel Schumacher especially knows how to shoot night scenes. This film was both a horror and a comedy at the same time, though I'm not sure which I preferred. Any movie that features both Corey Haim and Corey Feldman is going to be one that you can't take very seriously. If you don't know who these two guys are, better you never find out. Just watch the movie. Keep an ear out for INXS, Run DMC and The Doors.","user":"gah015","rank":[23,25]},{"title":"A Excellent, Stylish 80's Flick","rating":10,"date":"16 March 2005","review":"The Lost Boys is one of the movies that I think epitomizes the 1980's. It has a genuine 80's look and feel, as well as an awesome soundtrack and some fantastic performances by 80's legends like Corey Feldman.<br><br>This movie really draws you into it and makes you feel like you're right there in Santa Carla. The music fits the film perfectly. Nothing would have worked better. The setting is perfect. If you were a vampire and you were never going to die, where else would you want to spend your time? The amusement park, the abandoned cave with all that great stuff in it, and the railroad tracks (trust me, you'll understand after you see it) are absolutely incredible. The way Joel Schumacher uses certain POV shots and the eerie fog only add to the mood and atmosphere of the movie.<br><br>The gore and special effects are great! Since this is an 80's movie, there is no CGI thankfully, so everything you see is really real. The make-up of the vampires is excellent with their piercing eyes and long fangs. The gore doesn't really show itself until the end, though there is a very bloody (but quick) campfire attack in the middle. Once we do get to the blood and guts, it's great! There's a melting vampire in holy water, an exploding vampire, two excellent impalings, and more where that came from.<br><br>Finally, the acting is great. We have a very good cast, especially Kiefer Sutherland, who puts everyone else to shame. Jason Patric is a little dry, but he's great in his role. Max and Lucy have good chemistry, as well as Star and Michael. The Frog Brothers are classic and are responsible for most of the humor. Superb performances by all!<br><br>The Bottom Line: <br><br>A true 80's flick, with great performances, awesome special effects, a rocking soundtrack, and Corey Feldman!!!","user":"MovieManiacX","rank":[66,78]}]