[{"title":"the start of the end for serious Elvis movies","rating":9,"date":"29 December 2004","review":"While this is one of Elvis' greatest and fun movies it is a great shame that it was so successful, as it ruined the promise of a wonderful movie career for the King. The scenery and songs are unmatched and it is a fairly decent script, even after some sour comments from Angela Lansbury. Ms. Lansbury has constantly degraded this movie but she made a wonderful appearance as Elvis's mother, and I am sure gave her new fans. This movie was also responsible along with Hawaii Five-O as giving tourism to the Islands a big boost, but have the Hawaiian Tourist Bureau ever mentioned this. 40 years on it is still a treat to watch,and still surpasses some of today's so called \"hot movies\".Due to the popularity of Blue Hawaii El's management told him this was the way to go.Such a shame.","user":"serpico_usa","rank":[18,20]},{"title":"Can't Help Falling In Love With Hawaii","rating":8,"date":"4 September 2005","review":"Blue Hawaii, the title song of this film, was originally from the score of another Paramount film Waikiki Wedding which starred Bing Crosby in 1937. Bing sold a few records of that one, albeit they were 78s back then, and Elvis nicely revives it and sells a few more. <br><br>Crosby's film was made to take advantage of a whole lot of publicity he received for a trip to Hawaii. But Paramount as they usually did with his films back they made them on the cheap and Hawaii for Waikiki Wedding was recreated on the back lot.<br><br>Bing must have been a little jealous and who could have blamed him when Paramount did this film completely on location in Hawaii for the King. And Elvis got to go back to Hawaii for another film in Paradise, Hawaiian Style. <br><br>Elvis got a whole lot of musical numbers here including the title tune which he sings over the opening credits. He does a rockabilly version of the French song Alouette and with different lyrics, the Mexican love ballad, La Paloma. And he borrows a hit from Andy Williams when he reprises the Hawaiian Wedding Song. <br><br>Of course no film set in Hawaii is complete without Aloha Oe. But the big song from this film is one of Presley's greatest Can't Help Falling In Love With You. He sings it during a scene for a birthday party for Joan Blackman's grandmother. It's sort of done in a throwaway manner like the producer's didn't think it would be the big number in the film. <br><br>It might surprise Presley fans that this blockbuster hit was also recorded by another RCA Victor artist named Perry Como for one of his albums. Perry does a nice job with it, but it ain't a patch on the King's version.<br><br>Elvis is a rich young kid who'd like very much to get out from under Mom and Dad and prove himself. He's even done a hitch in the army, but that doesn't help. Parents are played by Roland Winters and Angela Lansbury.<br><br>Angela Lansbury recounted a story where she and her husband had dinner with Colonel Tom Parker and Elvis when they were casting Blue Hawaii. She said Elvis was a nice, polite young man who barely said three words during the dinner. The talk was all from Colonel Tom who was making all kinds of offers to the future Jessica Fletcher to be in this film. <br><br>Angela's career was somewhat in a dry spell, she hadn't made The Manchurian Candidate yet or appeared on Broadway in Mame. So she was quite willing to appear.<br><br>I gained some insight into how Colonel Parker handled Elvis with that story. If you look at the cast and even the behind the camera credits of his films, you'll see them populated with a whole lot of Hollywood veterans. I'll bet there were many such dinners during Elvis's film career.<br><br>To be sure Presley was certainly the Colonel's meal ticket. But I would have to say that he made every effort to see that Elvis and his films were given the best possible production values. I think that's why the King had a long sustained film career until public tastes change which they inevitably do. Also musicals, even Elvis's became too cost prohibitive to produce any more.<br><br>Blue Hawaii marks the height of Presley's singing and film career. The Beatles hadn't come on the scene yet, the King was still ruling the roost on the record charts and his films were grossing big box office. <br><br>And unless your Bing Crosby and feel a twinge of jealousy that his Hawaii film was done on the cheap, you'll like Blue Hawaii very much. It's nice entertainment from a great entertainer.","user":"bkoganbing","rank":[28,35]},{"title":"Pineapples, Peaches and Pearls!","rating":8,"date":"9 April 2001","review":"The ultimate Elvis Presley musical of the 1960's-and the biggest box office success of his entire Hollywood career. 'Blue Hawaii' is the one that certainly hit the highs with it's blend of comedy, romance, music, scenery and a bevvy of beauties! <br><br>This film laid down the blueprint for the majority of Elvis' other 60's musicals that each and every Company, writer, producer and director, tried to recapture and remake time and again. But, artistically, it never quite happened. <br><br>The water was tested with Presley's first post-army movie, the critically acclaimed 'G.I. Blues', the year before, that introduced us to the new Elvis look and feel. The family audience were captured by Tom Parker's crafty, but clever, plans to make his boy appeal to a much wider spectrum of tastes and trends. And, 'Blue Hawaii' established firmly which route 'The King's' film career path was going to take.<br><br>It is an absolute must-see for a number of things including the fine direction of Norman Taurog and the beautiful Hawaiian paradise that unfolds like a travelogue. But, most importantly we are treated to a more mature Elvis Presley who handles his character's script with notable impressive comic timing when feeding off the intimidating characterisation by Angela Lansbury who plays his domineering mother.<br><br>Elvis seemed to gain a lot of enthusiasm and incentive by working with a fine supporting cast e.g. 'Jailhouse Rock', 'King Creole', 'Flaming Star', 'Wild In The Country', and 'Blue Hawaii' is no exception to the rule. The immediate screen chemistry between himself and his beautiful co-star, Joan Blackman, portraying the couple in love, is quite in evidence here and they both play off each other amicably. Although, rumour had it, it was a different ball game off camera.<br><br>An Elvis movie wouldn't be an Elvis movie if he didn't chant his way through a number of songs and with 'Blue Hawaii' this culminated in a total of fourteen that made up a soundtrack that was to become one of his biggest selling albums ever. These songs blended the local islands traditional themes('Aloha-oe', 'Ku-u-i-po', 'Island of Love'), with silly production tunes('Ito Eats' and 'Almost Always True') and a taste of the new movie-style rock 'n' roll numbers ('Rock-A-Hula Baby' and 'Slicin' Sand') through to the beautiful ballads that Elvis' remarkably crafted operatic voice of this time, handles with consummate skill and ease ('Blue Hawaii', 'No More' and 'Can't Help Falling In Love'). The film's finale is a cinematic classic and beautifully filmed with Elvis once again in tremendous form with those golden vocal chords-Wonderful! <br><br>This film was made at the start of a different era of the Rock music phenomenon, and afterall it was Hollywood, so not all of the Hawaiian flavoured ditties will suite everyone's taste. But, it just went to prove no matter what kind of song Elvis sang and released it would still boost sales to the point of gold record certified! <br><br>Elvis' performance as homecoming G.I. turned 'beach bum', Chad Gates, is flawless in this movie and obviously shows us that he has a flair for this kind of comedy setting. The film itself when viewed today is still as fresh and feel-good as it ever was which is more than can be stated of the much later so-called sequel-'Paradise Hawaiian Style' and other such Presley vehicles as 'Girl Happy', 'Tickle Me', 'Harum Scarum', 'Easy Come, Easy Go', 'Double Trouble' and 'Clambake'. All of which try to recreate the 'Blue Hawaii' formula albeit in a bad way with Elvis displaying his acting and singing talents in a mediocre sort of way.<br><br>But, finally, for all it's class and high points, 'Blue Hawaii', in the long run, was certainly the 'Kiss of Death' for 'The King', and his acting ability and enthusiasm for the big screen would never be portrayed as consistently ever again.","user":"CosmicDwellings","rank":[25,33]}]