[{"title":"One of Jack Nicholson's most underrated performances, plus Harvey Keitel AND Warren Oates. Why is this movie so obscure?!","rating":3,"date":"3 September 2003","review":"Jack Nicholson's transition from brilliant character actor to self-parodic superstar happened sometime in the 1980s. 'The Border' is closer to his best 1970s work ('Five Easy Pieces', 'The Last Detail', 'The King Of Marvin Gardens', 'One Flew Over The Cuckoo's Nest') than to most of his subsequent output. Two of his best performances in recent years have been in movies directed by Sean Penn ('The Crossing Guard' and 'The Pledge'), and 'The Border' reminds me a lot of those. I wonder if Penn is a fan? The director Tony Richardson made his name with British \"kitchen sink\" dramas and he brings to this Peckinpah-esque material an empathy for \"little people\" rarely seen in American movies of the 1980s and '90s. Nicholson gives a superb performance, one of his very best. The two women in his life are played by Valerie Perrine and Elpidia Carrillo. The former is best remembered for her appearance in 'Superman' but has acting chops she has rarely been asked to use (see also 'Lenny' alongside Dustin Hoffman). The latter is best known for appearing in the Arnie action classic 'Predator'. Both of them are surprisingly good in this movie. Harvey Keitel is even better. This is one of his \"lost\" movies - see also 'Fingers', 'Deathwatch' and 'Copkiller' - and seeing him act alongside Nicholson is a real treat. Add to that one of the final roles by the legendary Warren Oates, who had co-starred with Nicholson fifteen years earlier in Monte Hellman's cult western 'The Shooting', and 'The Border' is essential viewing for film buffs. I think the movie has a few flaws but they are easily overlooked, and repeated viewings reveal its true worth. 'The Border' is a real sleeper, and recommended to fans of intelligent, character based drama.","user":"Infofreak","rank":[60,66]},{"title":"Overlooked Classic; Simple Jack; Great Support","rating":11,"date":"11 September 2003","review":"This film has been making the TV rounds lately, and that inspired us to go rent this overlooked classic and enjoy it once again.  It always stands up, it never lets us down, and it is unjustly overlooked. And Ry Cooder's score is a definite plus.<br><br>This is an unabashedly simple movie, much to its credit.  And that simplicity includes Jack.  Almost all of the critics point out that this is Jack at his \"UnJackest\".  Only one true \"Jack\" moment, and that is when he dumps the grill into that awful, tacky poolette and exclaims, \"Soup's on!\". And even that moment is appropriate to the situation, hilarious, and much needed comic relief.<br><br>'The Border' has every chance to drown in cliche, but to Tony Richardson's credit, it never does.  The characters could so easily have become good guy/bad guy caricatures, but to the credit of an amazing supporting cast, they never do.<br><br>And OH what a supporting cast!  Harvey Keitel is terrific, especially when he is trying to reign in his bimbo, drunken, horndog wife.  Cat can handle the meanest border scum, but is a whipped puppy with Ms. Thang.  Which leads to the superb performances of both Shannon Wilcox and Valerie Perrine as the Boobsey Twin Airheads from Hell.  Check out their rendition of their high school cheerleading chant.  Also loved Warren Oates as the crooked Border Patrol Chief, particularly the scene where he explains to the sleazy drop point bad guy (one character dangerously close to cliche) that their truck of \"wets\" got caught by a couple of honest border guards and \"Goddamit, I ain't got no control over that!  That's just gonna happen sometimes.\"<br><br>But for me, the supporting performance at the soul of this film is Elpidia Carrillo's heart-wrenching, moving portrayal of Maria.  All she is asked to do is symbolize everything pure, noble, and long-suffering, to be the Mexican Madonna.  And to do it with about 5 lines of dialogue in the entire film, and that is in Spanish.  Oh, and she's about 18 years old and this is her first American film.  And guess what?  She's simply amazing, conveying more in a single expression than most actresses could in 10 pages of dialogue.  Of course it helps to be born with one of the most expressive, open faces in the universe, and boy does she know how to use it. (Carrillo had a similar role, even named Maria, in Oliver Stone's 'Salvador' a couple of years later, and was equally as good.  She was also outstanding as Jimmy Smits' wife in 'My Family'.  She finally got her just acclaim a couple of years ago in Ken Louche's 'Bread and Roses', winning an ALMA and even having the critics talking Oscar, and for the lead in the Mexican historical epic 'The Other Conquest').<br><br>The scene that will always stick in my mind has Charley going to the sad hovel occupied by Maria and her brother to give them the money to pay a coyote to bring them across.  Maria is confused, wondering why he would help them.  Then she thinks she knows, and with a whole world of sad resignation on her young shoulders, without a word, begins to undress.  The Jack/Charley that responds, telling her gently that she owes him nothing, that he just wants to to feel good about something, sometime, is so simple, so sweet, and so heart-felt that it may be one of Jack's finest, most authentic screen moments.  Never mind that she doesn't understand a word; they connect.  A simple but deeply moving scene; it connects.<br><br>Go rent this simple straightforward film with its fine acting and directing. In its simple way, it is a powerful, unforgettable classic.","user":"MMcGuane","rank":[43,48]},{"title":"I can't afford a f*cking dream house!","rating":7,"date":"10 May 2009","review":"There are two things about this movie that make it a must-watch: Jack Nicholson in one of his best performances, and the issue of immigration.<br><br>Nicholson is a border guard who tries to resist the money available but his crazy wife (Valerie Perrine) just spends, spends, and spends like he was a Rockefeller. He finally joins with his neighbor and partner (Harvey Keitel) and runs some Mexicans across the border.<br><br>Charlie (Nicholson) still has some morals and that causes problems for his partner. He is also taken with Maria (Elpidia Carrillo), and that causes problems for their Mexican contact, so he sets him up to control him.<br><br>However, he can't control Charlie, and now even the boss (Warren Oates) is mad at him.<br><br>Tony Richardson's film has a lot of elements of Sam Peckinpah. Exciting to the end.<br><br>Music by the great Ry Cooder.","user":"lastliberal","rank":[13,13]}]