[{"title":"Why all the irony?","rating":6,"date":"15 August 2002","review":"How come there are so many negative reviews about this one? It actually holds up better than many other sci-fi films of that period (wasn't \"Teenagers From Outer Space\" also made in 1959?), and if it's clunky at times, its clunkiness is part of its innocent charm. The effects and the matte drawings may not be perfect, but they're sure colorful and entertaining, and the movie's restrained approach (at least more restrained that the title indicates) is most welcome. The presence of a woman scientist is also worth noting; although her treatment by the ship's captain is often sexist, ultimately she proves to be quite intelligent and competent. (**1/2)","user":"gridoon","rank":[46,53]},{"title":"A Fun B-Movie","rating":18,"date":"18 March 2003","review":"This is definitely one movie I grew up watching when I was a kid.  The acting may be bad and the science may be convoluted, but it is still a fun ride.  You know you are going to have a good B movie when Les Tremayne, who was in so many B's during the 60's, is one of the stars.  Also, did you ever notice that the mail crew members were in wing tips?  At least they flew in space in style.  Also, the character of Dr. Ryan is supposed to have earned respect with her degree, but she is constantly referred to as the girl, but then again, this was the early sixties and what good b-flick doesn't have a female scientist that is all business until she's in peril and then she becomes the typical damsel in distress.  This film isn't great, but it definitely is fun.","user":"Sargebri","rank":[26,32]},{"title":"This movie has it all...","rating":8,"date":"8 September 1999","review":"...no kidding!  <br><br>Take every hackneyed gimmick you've ever seen in bad science fiction movies, add in bad acting, cornball dialogue, extraordinarily amateurish special effects, silly 'Martians', and add a garish crimson filter for your 'Martian landscape' shots, and you have a monster of a movie like this one turned out to be.<br><br>On the other hand, the monster ameba with the rotating eyeball was fun to watch, as was the gigantic rat-bat-spider creature.<br><br>This was made in those grand old days before 'political correctness' was so common; the Astronauts waste no time in wasting the local flora and fauna whenever they get the chance.  Hey, why conduct a serious scientific expedition when you can romp around roasting the locals?<br><br>All its faults aside (and there are many of them), this is a fun movie to watch, particularly if you enjoy screaming in delight at all the bizarre events depicted on the screen.<br><br>Go ahead and rent this one, just make sure no one sees you with the evidence.","user":"JSPrine","rank":[25,31]}]