[{"title":"Vagabond Crusader","rating":7,"date":"1 May 2004","review":"This curious film is one of the James Cagney films I like the best. For a Cagney film it's slow. I think Cagney was nostalgic for the period in time when he was growing up and Johnny Come Lately captures that slower pace of life people enjoyed before World War I.<br><br>Cagney plays Tom Richards who was a newspaperman before the life of the open road suddenly appealed to him. We first meet him, seedy and unshaven, sitting on a bench in the town square reading the Pickwick Papers. The town is in the grip of Boss Daugherty played by Edward McNamara. Daugherty has whittled whatever opposition he faced down to Vinnie McLeod who is a widow and owns a badly in debt town newspaper. Daugherty got the mortgage and he's about to close in the best tradition of 19th century villainy. Vinnie meets Richards and brings him to her home. One of her charitable traditions is to give passing hobos a decent meal and Cagney gets one and in turn learns about the town politics. By the end of the film all's right and Cagney moves on, having changed a whole number of lives in the process.<br><br>Vinnie McLeod is played by Grace George, a prominent stage actress who makes her one and only movie here. She's very good and other supporting players who acquit themselves well are Hattie McDaniel, Marjorie Lord, Robert Barrat and most of all Marjorie Main playing Gashouse Mary.<br><br>This film was obviously a labor of love for James Cagney and it shows.","user":"bkoganbing","rank":[16,16]},{"title":"Even the press can't stop the irrepressible Jimmy Cagney.","rating":8,"date":"5 June 2009","review":"Tom Richards is an ex newspaper reporter who decided to quit the rat race and live life on the road in a vagabond existence. Breezing into town one day with only two dollars and a copy of his beloved Pickwick Papers to his name, Tom happens upon dear old newspaper owner Vinnie McLeod. Miss McLeod has a soft spot for tramps and urges Tom to get himself off the streets before he is arrested, but although he promises he will, he is soon rounded up and hauled before the court. Where Vinnie, upon learning of his reporting experience puts up the bond so Tom can keep out of jail and work for her at the Shield &amp; Banner paper. It's here that Tom learns of corruption within the town and promptly sets about using the press medium to out the dirt and free the town of its bad elements.<br><br>When one hears the name James Cagney, it immediately conjures up images of gangsters and Yankee Doodle Dandy like ebullience. Yet as big a star as he was, Cagney still has films in his cannon that are not only unseen and forgotten, but also that showcase the other side of his acting coin. One such film is Johnny Come Lately. Adapted from the novel \"McLeod's Folly\" by the highly thought of Louis Bromfield (Winner of 1927 Pulitzer Prize for his novel, Early Autumn) the film sees Cagney relying on his reined in ability instead of blunderbuss histrionics. There are of course a couple of sequences where his character is called on to pack a punch {naturally when the piece is about corruption and less than stellar townsfolk} but by and large it's a sweet and affecting turn that really rewards those who have invested time with it.<br><br>It's not just about Jimmy tho. Grace George as Vinne is the films emotional axis, her interplay with Cagney has a tenderness that really gives the story some added weight. Boosting proceedings is the always delightful Hattie McDaniel, whilst Wizard Of Oz fans will no doubt be chuckling away at Margaret Hamilton's performance here. Which when one knows Cagney calls her \"the dragon lady next door\", well one can guess what Margaret is doing with the character. But standing out amongst the strong female cast is Marjorie Main as Gashouse Mary McGovern, a delightful turn that harks to a sort of Mae West homage. When she slinkily turns to Tom and says \"if only I was thirty years younger\" you just know she would have eaten him for breakfast! The score from Leigh Harline is easy on the ears, and William K. Howard's direction is smooth and at one with the pace of the story. This really is one that needs to be rediscovered by more classic cinema fans, not only for catching Cagney acting against type, but also because it has a feel good factor that could brighten the day of many. 8/10","user":"hitchcockthelegend","rank":[11,11]},{"title":"A Fine Film From A Forgotten Literary Master","rating":7,"date":"20 July 2005","review":"JOHNNY COME LATELY is an example of an underrated work that makes a good, atypical film. The Jimmy Cagney that we think of is the anti-hero of THE PUBLIC ENEMY or WHITE HEAT, who we fear but feel sorry for. He also is recalled for his exciting performances in YANKEE DOODLE DANDY and 13 RUE MADELEINE. He was a human dynamo. Watch how he effortlessly goes into the dance and song in FOOTLIGHT PARADE. But here he is a reporter who is tramping around the country (reading Pickwick Papers) who gets into trouble in a corrupt town, but is helped by the owner of a newspaper (Grace George, an old friend of Cagney's, in her only movie role). Together they take on the local machine, with assistance from George Cleveland and Marjorie Main among others. That Edward McNamara finally admits defeat is actually due to him not being the real villain in the film (his police chief, an ex-convict, is the real villain). Cagney does have one or two obligatory fight sequences, but he displays a gentleness, especially when dealing with Ms George, that is very unusual and sweet.<br><br>JOHNNY COME LATELY was a novel by Louis Bromfeld. A few years ago Public Television did an \"American Masters\" episode on Bromfeld, who was (at one time in the early 1930s) considered the equal to Hemingway and Faulkner and Fitzgerald as a novelist. He is best recalled today for the novel, THE RAINS CAME, made into a classic early starring film for Tyrone Power and Myrna Loy. But his best written novel is supposed to be THE FARM, wherein he discussed the day to day running of a farm, and it's importance to the country. Ironically it was the subject of farms and agriculture that ended his brilliant writing career - he spent his savings trying to make a model farm for helping American farmers learn the latest techniques in agriculture. In the end he had to lose his farm as well (it was a brilliant idea, but he couldn't afford to keep it up). Bromfeld's writing can be sampled in JOHNNY COME LATELY, where he concentrates well on the characters in the story. Look at the scene where Cagney goes to a political power who likes ketchup in everything - Cagney plays up to this weakness, with odd but successful results.","user":"theowinthrop","rank":[13,14]}]