[{"title":"Still Unique Even After 45 Years","rating":9,"date":"31 October 2005","review":"Here's a movie that's gone from cult classic to just plain classic. For me, it's one of the few \"cult classics\" I saw when it was released and then first shown on television. I loved it then, and I love it now.<br><br>Forget the musical re-make made in the 1980s. It couldn't hold a candle to the original.<br><br>\"Original\" is what this is, too. and nowadays, it's great to have it on DVD in which the audio is clear and the picture pretty sharp.<br><br>I have always particularly enjoyed the many humorous lines delivered by Mel Welles, who plays the flower shop owner. He is the real comedian of the cast, although the plant does quite well as do the two leads played by Jonathan Haze and Jackie Joseph. The latter two are a little more subtle in their comedy. <br><br>All the characters in here are totally whacked, from Haze's hypochondriac mother to Dick Miller's flower-eating character to the Jewish mother who always has a dead relative to moan about and to the dentist and his patient. The latter, of course, is Jack Nicholson, making his movie debut and looking about 16 years old.<br><br>In the end, though, what one remembers most is the plant demanding, over and over, to \"Feeeeeed me!!\" <br><br>For that, the plant and the film never fail to make me laugh.","user":"ccthemovieman-1","rank":[60,65]},{"title":"Charming little movie!","rating":7,"date":"7 October 2003","review":"This charming little B-movie tells the story of Seymour (Jonathon Haze), a good hearted yet rather slow boy, who works at a flower shop owned by Gravis Mushnick (Mel Welles). During his spare time Seymour develops a new type of plant, which he names Audrey Junior after a woman he likes (Jackie Joseph). Unfortunately this particular plant feeds off human blood and when Seymour can no longer feed it on his blood, the plant itself forces him to look elsewhere for food.<br><br>This delightful horror-comedy was remarkably shot in just two days and was originally intended as a sequel to director Roger Corman's Bucket of Blood' (1959). However, The Little Shop of Horrors' stands out in its own right as a charming and inventive low-budget horror movie. Throughout the movie we meet a whole variety of weird and wonderful characters including a man who eats plants (played by Dick Miller who would also work with Jackie Joseph in Gremlins' (1984)), a sadistic dentist, a masochistic dental patient (an early performance from Jack Nicholson) and a woman who can't go a day without a family member passing on. Despite (or maybe because) of the overall absurdity of the movie, The Little Shop of Horrors' manages to be strangely captivating yet portray an air of darkness in the right places.<br><br>Roger Corman directed this movie very well considering his resources and complimented the fairly tight screenplay written by Charles Griffith. The special effects were not of that high a standard but, considering the budget and shooting time one, can hardly have anything negative to say about that. The appearance of the plant as it grows throughout the movie may not be that great but overall it takes nothing away from the viewers enjoyment. Perhaps a little bit more could have been done to represent the plants movement more realistically but, even so, this is just a minor flaw of an otherwise great film. The performance from the three main stars was delightful. Though the acting was hammed up in places the movie never lost its comical charm and some slightly dramatic performances towards the end helped create an unsuspected eeriness in the dying moments.<br><br>Surprisingly The Little Shop of Horrors' was virtually ignored on its initial release but eventually attained a cult status due to continuous TV play. For those of you who doubt its classic status The Little Shop of Horrors' has now spawned a Broadway musical, a high-budget musical remake and even a Saturday morning children's TV programme. Short (around 68mins) but very entertaining, I recommend this to fans of quirky horror comedies and general horror fans alike! The movie features good direction, a well written story, interesting and likeable characters and some excellent one-liners. My rating for The Little Shop of Horrors' 8/10.","user":"Snake-666","rank":[39,42]},{"title":"A surprisingly funny piece of b-movie entertainment from Corman","rating":25,"date":"25 July 2005","review":"Mushnick's is a small florists in skid row  a dead end part of town that everyone knows about but nobody wants to know about. Business is not great, in fact it is awful  nobody wants to buy flowers when they can't be sure where their next meal is coming from. However the cleaning boy has nurtured a strange new plant up from seed and it seems to be getting interest. When he discovers it needs a few drops of blood to make it grow Seymour is the toast of the town with his employer very grateful for the increased revenue the visitors bring. However as it grows it begins to need more than a few drops and soon he is heading down a terrible, dark road.<br><br>Like many viewers I suspect, I came to this film after seeing the musical remake; as such I assumed that this would be a straight film in the b-movie genre that Corman is famous for. However I was taken by how amusing this film was because really this is as much a horror comedy as the musical is. From Seymour's alcoholic mother to the cop so hard that even the death of his son is met with a shrug, the whole film is full of darkly comic touches that drew some nice laughs from me. This comic approach helps the film because really it is a silly plot and the fact that the script was tongue-in-cheek meant it was easier to swallow, if you pardon the choice of words. As a horror it doesn't really work but it does have a slocky property that Corman films tend to have  not high quality but low budget, b-movie fun.<br><br>The cast match the material and all buy into the joke, watching them also shows that the cast in the musical are really pretty much just impersonate the actors here. Haze is enjoyably geeky and convinces throughout. Welles is funny and plays up to his ethnic caricature well. Corman regular Miller hasn't really got much to do but his face is always a ruggedly familiar and welcome sight. Joseph is not great but her performance suits the b-movie genre  likewise Campo and Warford (who are very funny as Dragnet style cops). Nicholson is pretty funny and was a curious find in a small cameo.<br><br>Overall this is not a great film but it is a great b-movie horror. Never taking itself seriously means that it can be darkly funny and take the audience along for the ride. To me it is just as funny as the musical even it is a different type of humour and it is worth checking out.","user":"bob the moo","rank":[21,22]}]