[{"title":"A Masterpiece of Americana","rating":10,"date":"3 June 2005","review":"This picture is easy to rave about. I don't know how many times I've seen it, but 'Chicken' never fails to work its magic. A thesis could be written on its gentle lampooning of small town America, the travails of the 'little guy', and the character studies which show the human comedy which surrounds us every day of our lives. Pretty much every scene is a classic of comedy, from the malfunctioning elevator operator to the repeated motifs of 'Atta boy, Luther/Carlyle/Judge' and 'And they used Bon Ami!' It's also a treasure trove of fine performances, from Burt Mustin to Jesslyn Fax, not to mention Don K., of course. Reta Shaw, James Millhollin, Harry Hickox, Hope Summers, Philip \"Phil\" Ober, Harry Hines, Eddie Quillan, Herbie \"I'm almost up to my Jell-o\" Faye, Charles Lane, and the great Al Checco, what could be better? Everything is genuine, from wise-apple Skip Homier's matching with (former Playboy model) Joan \"Above Average\" Staley to Luther's accurate but frenzied punching of the transmission buttons in the center of the steering wheel of his 1958 Edsel. Vic Mizzy's score is incredible, and his crazed organ toccata will burn itself into your memory even more than his trademark electric guitar accents. Everything is well-composed in Techniscope. This picture, along with the rest of the Knotts Universal contract (climaxing in the very odd but hilarious 'The Love God?'), plus 'Angel in My Pocket', and even 'Cold Turkey' form an amazing comic vision of Americana, created by brilliant minds who knew how to capture it without resorting to cheap shots or vulgarity. 'Chicken' is a great comedy, a classic, and its greatness is found in its humbleness.","user":"Gooper","rank":[58,66]},{"title":"Attaboy Luther!","rating":9,"date":"5 December 2003","review":"The first film Don Knotts made after leaving Mayberry to sign a multi-film contract with Universal, I first saw \"The Ghost and Mr. Chicken\" as a tiny tot when it played in support of \"Munsters, Go Home\" at the drive-in, and it was so funny I forgot all about the severe sunburn I had acquired at the beach earlier in the day. And now, 37 years later, it's still hilarious. An adult, especially a college graduate who majored in English, isn't supposed to admit that \"The Ghost and Mr. Chicken\" is one of his favorite films, at least not without embarrassment at his lack of \"sophistication,\" but I admit it with pride. Knotts may not have had a film career on a par with Laurel and Hardy, but he's their equal in my book and this is his best film. It even manages to be genuinely spooky at times (that organ music-yikes!). This is a comedy classic, and a family film in the best sense of the word.","user":"bwaynef","rank":[47,53]},{"title":"Great fun for kids and family...","rating":10,"date":"14 December 2003","review":"This is a fun family comedy, that doesn't have the syrupy \"message\" nonsense you find in such movies today. This film hinges on Don Knotts and his trademark physical comedy, which he delivers with ease. I loved his movies as a kid, and my kids love them too. <br><br>It is amazing how much Knotts is willing to make himself look completely ridiculous to make you laugh. One such scene happens when he is courting his girlfriend on the porch of his boarding house. He starts to chop his hands in the air, she asks what he is doing, he replies \"Oh that's karate, I've been studying it through the mail for years\". Then he puffs up his chest and boasts, \"My whole body's a weapon\". You almost can't watch it, but my seven and nine-year-old sons make me rewind it over and over, laughing their heads off each time.<br><br>Introduce your kids to this, and other silly movies starring Don Knotts. They'll enjoy them, and it will give them a little insight into your world as a child.","user":"Bladerunner•","rank":[44,50]}]