[{"title":"A magnificent film.","rating":9,"date":"21 December 2001","review":"The director and star of BORN FREE re-team to tell the story of Tag, a fox reared with a fox-hound.  From the book THE BALLAD OF THE BELSTONE FOX by David Rook and later remade as the animated Disney film \"The Fox and the Hound.\"  A magnificent family film that ultimately brings up questions about the ethics of fox-hunts, mixes the fun of Benji with the drama of Old Yeller.","user":"SanDiego","rank":[14,15]},{"title":"The Belstone Fox","rating":7,"date":"31 January 2006","review":"Good to see Eric Porter, a very underrated actor, in the role as a gamekeeper, who puts his head in the noose, when he rears a tame fox. A 1970's film which reminded me of my country days, before things because a bit too sophisticated. Good film for a quiet hour or two. A very young-looking Dennis Waterman as a hunt assistant, before his break into the big time with John Thaw. One of these films hat you don't think-sounds very interesting, but when you sit down and get into it, you just need to see it to the ens. Jeremy Kemp as a rather worn out English country gentleman,is a pleasure to watch.I would recommend the film to anybody, I don't know how I miss it first time round.","user":"stupat","rank":[12,13]},{"title":"Great Film.","rating":8,"date":"13 August 2012","review":"I really enjoyed this movie, although it was a little slow in places.<br><br>It documents well the undeniable cruelty and arrogance of the British hunting community without showing too much gore.<br><br>I couldn't help thinking during one particular scene, as I'm sure many people who have respect for British wildlife will, it's a shame about the hounds, I wish it was the huntsmen lined up on those railway tracks.<br><br>I hope that this film will continue to be watched by future generations and that it may help children to love nature and understand why torturing and butchering native wildlife or any animals for pleasure is wrong and further encourage them to condemn and shame those involved in this cruel 'sport'.","user":"andrew_cousins","rank":[8,10]}]