[{"title":"Quayle Makes It Personal","rating":7,"date":"20 May 2009","review":"You've got to have some set on you when you look to tangle with Tarzan on his turf. But one of the best villains ever to appear in a Tarzan film, Anthony Quayle does just that it in Tarzan's Greatest Adventure.<br><br>Gordon Scott plays the eternal jungle man in this Tarzan epic, the rights of which were taken over by Paramount from MGM and the late RKO studio where most of the films were done. Tarzan's dealing with Anthony Quayle and three henchman and a moll in Niall McGinniss, Al Mulock, Sean Connery and Scilla Gabel. These people have it in their mind to rob a diamond mine and kill a bunch of native villagers who get in their way. That brings Tarzan to action.<br><br>Along the way with dealing with Quayle and company Tarzan rescues female pilot Sara Shane whose plane crashed in a jungle river. Shane spouts some relatively hip dialog for Tarzan who does not speak in Johnny Weissmuller grunts, but with a concise English that befits Lord Greystoke. <br><br>Quayle has to deal with plenty of dissension in his ranks, but he's the cause of it. His associates want to go in, do the job, and get out as soon as possible. But Quayle has a score to settle with Tarzan who caught him and put him in jail.<br><br>Anthony Quayle appeared in many classic films, including a turn at Falstaff on the BBC's Shakespeare play series. But this film is the one I remember him best for. He is positively obsessed with evening the score with Tarzan, he puts the whole operation and his companions in jeopardy. In fact he's fashioned a wire noose for Tarzan to use on him should they meet.<br><br>Of course they do and the fight scene between Scott and Quayle is one of the most thrilling done on the silver screen and not just in the Tarzan series.<br><br>Sean Connery has a role as one of the henchmen, he doesn't get to do a whole lot, but he's got star quality and it's very apparent when he's on screen as a really dumb thug of a crook.<br><br>Still it's Anthony Quayle and his white whale like obsession with Tarzan that makes Tarzan's Greatest Adventure one of the better ones from the series.","user":"bkoganbing","rank":[16,16]},{"title":"Goodbye, \"Me, Tarzan\"...","rating":6,"date":"6 January 2004","review":"When producer Sy Weintraub took over the reins of the \"Tarzan\" franchise, in 1958, he set as his goal the dream of Edgar Rice Burroughs and countless fans of the Jungle Lord over the years; a return to the character as originally envisioned in Burroughs' novels. An intelligent, articulate 'defender of the jungle' gifted with nearly superhuman abilities, John Greystoke, aka Tarzan, had the savagery to survive in a primeval environment, but could also function comfortably in the world of men. MGM had thought the concept too far-fetched, and had turned Tarzan (as personified by Johnny Weissmuller) into a monosyllabic savage, only 'humanized' by the love of British society girl Jane Parker (Maureen O'Sullivan). When the formula proved successful, the Ape Man was 'locked' into the characterization, much to the chagrin of Burroughs, and when RKO took over the series, in 1943, no effort was made to change the formula. Weismuller eventually aged out of the role, but successor Lex Barker, despite credentials that would have made 'smartening' Tarzan logical (he was an Ivy Leaguer with a pedigree nearly as impressive as Greystoke), was forced to carry on the \"Me, Tarzan\" tradition through four more films.<br><br>\nWhen Barker became fed up with being stereotyped, and passed the Tarzan loincloth to ex-lifeguard Gordon Scott, in 1955, the powerfully-muscled Scott carried on the duties of role adequately, but the series had degenerated into low-budget formula pictures, only notable for an occasional future star in an early role (Vera Miles appeared in TARZAN'S HIDDEN JUNGLE, and would, in fact, marry Scott, after filming was completed).<br><br>After four mediocre Gordon Scott \"Me, Tarzan\" films, the time was ripe for change, and Weintraub was a man of vision, and terrific entrepreneurial skills. Not only would the actor speak full sentences in TARZAN'S GREATEST ADVENTURE, he'd be backed by a first-rate supporting cast, and the film would be the first \"Tarzan\" shot, in Technicolor, in Africa! With a large contingent of press on hand, the cast and crew arrived on location, and Gordon Scott proved himself the very personification of Tarzan, riding a zebra, wrestling a lion, and performing other tasks with grace and astonishing skill. It was an auspicious start to what would become a landmark \"Tarzan\" film.<br><br>The tale of a band of escaped British criminals killing innocents, and stealing dynamite for a robbery, the gang leader, Slade (Anthony Quayle) is a homicidal maniac that Tarzan had put in prison before, making the Ape Man's pursuit a 'personal' vendetta. Not even the presence of an alluring distraction (Sara Shane) would deter him on his quest, and the frequent close-ups of the scarred and cold-blooded Slade, and Tarzan, with a fixed, merciless grin across his face, give clear evidence of two predators, circling for a kill. As Tarzan whittles down the gang, the stage is set for a terrific, violent climactic fight that ranks as one of the best of the entire \"Tarzan\" series. When Tarzan beats his chest and gives the classic Ape yell at the conclusion of TARZAN'S GREATEST ADVENTURE, he's EARNED the right!<br><br>Featured in the cast is 29-year old Sean Connery, excellent as the brutal, but wise-cracking \"O'Bannion\", Slade's right-hand man, and he so impressed Weintraub and director John Guillermin that the pair actually asked him to become the next screen \"Tarzan\", after Gordon Scott's last contracted film, TARZAN THE MAGNIFICENT. Connery, thrilled, was prepared to accept the role, but a call back from another audition...to play a secret agent in an upcoming production called DR. NO, resulted in a contract, and he, regretfully, passed on Tarzan, and became James Bond, instead! Weintraub ended up replacing Gordon with his 41-year old TARZAN THE MAGNIFICENT co-star, Jock Mahoney, and the new, literate Tarzan would continue on into the sixties.<br><br>TARZAN'S GREATEST ADVENTURE may not be everyone's favorite Tarzan film, but in it's daring approach to both the character and the use of actual locations, it certainly deserves it's place as a classic of the series!","user":"cariart","rank":[34,40]},{"title":"We all die sooner or later. It's not a joke, but it's nothing to cry about.","rating":8,"date":"7 January 2013","review":"Tarzan's Greatest Adventure is directed by John Guillermin who also co- adapts the screenplay with Berne Giler from a story written by Les Crutchfield. Based on characters created by Edgar Rice Burroughs it stars Gordon Scott, Anthony Quayle, Sara Shane, Al Mulock, Sean Connery, Niall MacGinnis and Scilla Gabel. Music is by Douglas Gamley and cinematography by Ted Scaife.<br><br>When a native village is robbed of explosives and a couple of men are killed, it soon becomes apparent that the gang was led by a man called Slade. The mere mention of this name is of great interest to jungle man Tarzan (Scott), who promptly sets off in pursuit to settle an old score...<br><br>You can't reason with an idiot!<br><br>There's no Jane and Cheetah is barely in it, but this Tarzan \"adventure\" is all the more better for it. With Sy Weintraub producing, he was determined to steer Tarzan in a new cinematic direction, with a bit more mud, blood and literacy, Tarzan became as much for the adults as it was for the kids.<br><br>Actually the title, whilst true in the pantheon of Tarzan movies, still conjures up images of a kiddie friendly Tarzan, a more fitting title would have been Tarzan's Grudge! What unfolds in the story is a vengeful pursuit by Tarzan of a gang of diamond hunting crims led by a scarface Anthony Quayle. He uses his jungle whiles and hunting skills to pick them off if the opportunities arise, all the while accompanied by the foxy Angie (Shane) who literally dropped out of the sky and into the life of the loin cloth wearing one. Tarzan talks and isn't indestructible, but we still know there is savagery in the man, while on the boat up river the gang are an assortment of scallywags beginning to implode; which makes for rather good entertainment.<br><br>Film is infused with all the formulaic perils of jungle dramas (and comedies actually) past and present, reference crocodiles, spider, snake, quicksand, booby traps et al, but here it is definitely more fun and thrilling than annoying and cornball. Yes there is still some cheapness, with back screen projections, interwoven animal film footage and you really don't think Scott would be wrestling with a real life crocodile do you? But there's an edge to the narrative and it's great to see. Also helps to have a decent cast of actors on patrol as well, with Quayle leading the way as a broody bastardo. While Scott, looking in great shape and not unlike Kerwin Matthews, seems to be relishing the chance to play a Tarzan with grit and gumption.<br><br>The rope swings and famous yell are still here, but this is a much better and badder Tarzan and hooray to that. 7.5/10","user":"hitchcockthelegend","rank":[9,9]}]