[{"title":"Incredibly intense film","rating":23,"date":"23 October 2006","review":"AGUIRRE: THE WRATH OF GOD (Werner Herzog - West Germany 1972).<br><br>Herzog's daring and unconventional approach in film-making is something very few filmmakers can match. Due to the incredible hardships while filming on location in the Amazonian jungle, the myth surrounding AGUIRRE has almost outgrown the virtues of the film itself and over the years it has become an almost integral part when (re)viewing this film, even more so since Herzog's documentary MY BEST FIEND (1999) was released about his relationship with \"best enemy\" and star in many of his films, Klaus Kinski.<br><br>A mesmerizing exploration of human obsession based on the diaries of Gaspar de Varvajal, a monk who accompanied Gonzalez Pizarro (half-brother of the brutal conqueror of the Incas) and died during the expedition, the film chronicles Pizarro's 1560 Peruvian expedition in search of the legendary city of gold, El Dorado. When the expedition is faltering by the difficult terrain, Pizarro decides to send a small party ahead to determine if exploration should continue. Though Don Pedro de Ursua (Ruy Guerra) is put in charge, he is soon challenged by the ambitious fanatical Aguirre (Klaus Kinski), who against all odds wants the journey to continue, with catastrophic consequences. <br><br>One of the key elements in Herzog's work is the use of landscape and the natural surroundings. The Amazonian jungle is a key third dimension in the film and really is a green hell, threatening and unforgiven. There's no romanticism in Herzog's view of nature. The continuing sounds of the running water and the birds are just as important for the story and the despair of Aguirre's men as the ambient electronic soundtrack by the German ensemble Popol Vuh, the ultimate modern and very German pioneers in electronic music, mixing choral chants with electronic samples and organ music. To me it is simply astonishing Herzog decided to use their in a film about 16th century Spanish explorers shot on location in the Amazon and somehow it works wonderfully, a perfect blend of image and sound. Hard to identify a very important element of the \"natural soundtrack\": what's the name of the bird that produces this whistling shriek, that is heard almost continuously in the background and is one of the most recognizable sounds of Neo-tropical rain forests? A Quetzal? <br><br>Klaus Kinski's performance is a perfect match for Aguirre's descent into madness, eerily resemblant to Kinski's own Mad Kraut persona and well-published rampant behavior on the set and his misconduct in general actually. Watching the film for the first time with audio commentary by Herzog and he revealed many things I never heard before. One of the strangest anecdotes is not really about the film itself but is, well..truly one of the most bizarre things I ever heard. <br><br>Before the shooting started, Herzog and his crew were boarding for the plane that would bring them from Lima to Cuzco when the airplane had some technical problems. Since the airline company in question already had two or three serious accidents not long before, they decided to wait and take the next plane. Repaired or not, the plane left off anyway and crashed in the Amazonian jungle with the only survivor a young German woman, Juliane Koepcke. After weeks she finally reached a remote Indian village, malnourished, an almost fatal larval infection, close to death. Later Herzog would make a documentary about this, JULIANES STURZ IN DEN DSCHUNGEL (English title: Wings of Hope) (2000). Besides the already astonishing, many times near-fatal accidents and Kinski's impossible madman behavior, this film seemed doomed from the start, like an old curse from the Incas.<br><br>For those less familiar with Herzog's work, FITZCARRALDO (1982), also by Herzog and shot under equally horrendous conditions in the Peruvian jungle, would make a good companion piece. For Herzog's relationship with Kinski there is the interesting documentary MEIN LIEBSTER FEIND (My best fiend) (1999).<br><br>Camera Obscura --- 10/10","user":"Camera-Obscura","rank":[66,77]},{"title":"Brilliant, beautiful and desperately disturbing","rating":10,"date":"12 September 2005","review":"Werner Herzog and Klaus Kinski's masterful achievement - Aguirre: The Wrath of God (Aguirre, der Zorn Gottes) is a rich and powerful film set deep in the the South American rain forest. Ostensibly a piece of historical fiction based on fragmentary evidence concerning one of the many ill-fated attempts to find and conquer the mythic El Dorado (a city of gold rumored to be anywhere from southern Canada to Patagonia), Aguirre operates on so many levels and reflects so many aspects of its story that it is difficult to convey precisely what the film is really about. It is too fictionalized (yet plausible) to fit comfortably in the \"historical fiction\" shoebox; the dialog is as much a presentistic bit of reflexive thinking as it is fitting for the historical context of the film; and the setting is so breathtaking that without a plot and without the brilliant concept and fantastic acting, the film would still be breathtaking and painful.<br><br>The opening scene, which very slowly depicts a caravan of Spanish soldiers, African and South American Indian slaves, burros, horses, cannons, and provisions making their way down a steep mountain path surrounded by miles of rain forest, is breathtaking and ominous, and sets not just the tone, but the pace of the film. Many people will find the pace a little too slow to handle. After a few minutes of struggle, the nobleman leader of the expedition throws in, and appoints a small number of participants to go forward into the jungle. Of these, only Lope Del Aguirre, a career soldier with vast ruthless ambition, and Ursua, a more gentle nobleman, are really leadership material. As the party floats down-river on rafts, it rapidly becomes clear by whose will the party continues on, and who will emerge as its sole leader in the end.<br><br>Herzog develops some of his usual themes in this film, and does so with poignancy and cinematography nothing short of beauty. The film is about power, madness, religion, oppression, nature, and culture, but certainly does not stop there. This is film as high art. Brilliantly executed, multi-faceted, moving, and as ambiguous as real life so often is.<br><br>This is also one of the great actor Klaus Kinski's most profound and appealing roles. Though Kinski was later typecast in mad, or at least eccentric, roles, as Aguirre he is able to show his range very effectively - because the character varies from a cold, brooding, Machiavellian rationalism to an obsessive sociopathic suicidalism. The rest of the cast rises to the challenge and acts right at Kinski's level, making this film one of the best actors/production team collaborations I have ever seen.<br><br>This film is definitely not for everybody, it is a long, slow sip of delicious and yet bitter wine which the typical movie-goer will only appreciate when 'in the mood' for something which requires thought and energy to watch. It is also one of my favorite films of all time.","user":"mstomaso","rank":[146,180]},{"title":"Director Herzog is not a cheerleader for humans.","rating":31,"date":"31 August 2004","review":"\"Aguirre, the Wrath of God\":  Werner Herzog is one of my all-time favorite film makers, and this is one of my favorite films by him.  Actually taken from the diary of the priest who accompanied Pizarro's expedition in 1560, Herzog recreates the pretentious and self-deluded search for the \"Lost City of Gold - Eldorado\".  <br><br>Herzog likes true stories...ones that are bizarre in their own right, but with his direction and personal vision, they become profound (and never optimistic).  The camera work is always interesting (he single-handedly \"patented\" camera shots that don't sweep - they (\"you\") stare and stare - and stare - at a thing or person or place until it becomes abstract, intense, beautiful, threatening, profound), the scoring is always appropriate yet never expected, and his casting, often using the unique talents of the late Klaus Kinski, guarantee nothing less than an intense experience...even in a film like \"Aguirre\", which SLOWLY claws and slogs it's way along each and every slippery, dangerous, foreign mile of jungle. <br><br>\nIt is clear Herzog 'focuses' on the ridiculously high beliefs humans create for and hold of themselves - that they could actually \"own\" anything, \"conquer\" anything, outwit that which they do not understand, and by sheer Will cause anything they deem important, to exist.  Herzog is NOT a cheerleader for the history of humans, but he is a ponderer... and we are fortunate he does it on film.","user":"futures-1","rank":[100,123]}]