[{"title":"A Hidden Classic worthy of Cult Status","rating":10,"date":"29 December 2001","review":"I've now seen Ken Russell's adaptation of Bram Stoker's story about half a dozen times, each at different points in my life.  This is one of those few movies that seems to age very well and get better with each viewing.  Never a big fan of Russell, his over the top visual style seems right at home in this sometimes campy, sometimes scary, always entertaining horror film. But what makes this film stand far above others in its genre is the fact that it is in actuality a wicked black comedy.  Every time I see it i pick up on something new that is in the background of a scene or some piece of dialogue I previously overlooked and I burst out laughing.  The film features probably the single best line of any movie ever made, delivered with dead-pan foppishness by a not-yet famous Hugh Grant.  \"I believe we probably have another reptile on the premises.\"  Watch it and you'll understand why it's so funny.  It's all about context.  While some may find many flaws in this production, I recommend just going with the flow and trusting Russel and his cast, who all also seem to be in on the joke.  Amanda Donohoe as the evil serpentine priestess and Stratford Johns as Hugh Grant's butler are particularly on target with every line delivered.  I'm going out on a limb and giving this a 10/10.  In actuality it probably deserves and 8/10 at best.  But it is one of my personal faves and seems to age like a fine wine.","user":"WriterDave","rank":[88,98]},{"title":"That song sticks in your head for a while.","rating":8,"date":"26 March 2017","review":"'Dr. Who' actor Peter Capaldi plays Angus Flint, an archaeology student who unearths a strange skull from the grounds of a bed &amp; breakfast, where a convent had existed once upon a time. Meanwhile, the seductively sexy young Lady Sylvia Marsh (Amanda Donohoe) returns to her neighboring home, and more weird things are soon happening. It turns out, there is a local legend in the area, of a nobleman who'd vanquished a hideous reptilian beast - not literally a \"worm\" - centuries ago. Also mixed up in the plot are that noblemans' descendant, James D'Ampton (Hugh Grant), and lovely sisters Mary (Sammi Davis) and Eve (Catherine Oxenberg).<br><br>The director is Ken Russell of such classics as \"The Devils\", and he also produced and adapted the novel by \"Dracula\" creator Bram Stoker. So we know going in to expect a fair amount of outrageousness. Fortunately, this film never does get out of control, but it combines some sober drama with some very campy and sometimes hilarious horror. Clearly, it's not meant to be taken all that seriously, especially when we consider the crudely done fantasy sequences envisioned by the characters and the audience. (People who are easily offended will undoubtedly be put off by some of this imagery.) The makeup is amusing, but what's really a hoot is the beast itself, Dionin. Excellent location shooting adds atmosphere.<br><br>The actors, commendably, maintain serious expressions. Although he's reputed to refuse to talk about this film, Grant does a good, droll job. Capaldi is a decent hero who, at one point, attempts to attract a reptilian presence by putting on a kilt and playing the bagpipes. Oxenberg and Davis look appropriately scared, Stratford Johns is a solid presence as the butler Peters, and Donohoe, often dressed in very sexy outfits, does appear to be having some real fun as the villainess.<br><br>A truly frightening film this is not, but it's quite entertaining just the same.<br><br>Eight out of 10.","user":"Hey_Sweden","rank":[13,13]},{"title":"Hilarious campy trash full of nudge, nudge, wink, wink smutty humor.","rating":8,"date":"8 May 2003","review":"I'm not going to strain my brain trying to work out just what Ken Russell was trying to achieve with 'The Lair Of The White Worm', but he ended up with a semi-classic slice of campy, sleazy trash that is full of nudge, nudge, wink, wink smutty humor. There's absolutely no way anyone could take this one seriously! I haven't read Bram Stoker's novel so I don't know how much the movie has to do with it, but Russell takes EVERY opportunity for to show a phallic symbol or a puerile gag, and that, added to the tongue in cheek performances from the cast (especially Peter Capaldi, Hugh Grant and the delicious Amanda Donohoe), makes this one of the silliest and most entertaining movies you'll ever see. Donohoe is just brilliant, the monster is cheesy, the blatant gags will make you roll your eyes and groan, and there are a few extraordinary Russell touches in the very brief, quasi-psychedelic \"visions\" experienced by a few of the characters. 'The Lair Of The White Worm' is certainly not for everybody, but there's nothing else quite like it, not even in Russell's very strange ouevre, and if you \"get it\" it's a complete hoot!","user":"Infofreak","rank":[36,41]}]