[{"title":"June and Humphrey - fun to watch","rating":8,"date":"3 January 2009","review":"The black and white photography, camera angles and editing of Battle Circus are top rate adding verisimilitude to an unusual story about medics during the Korean War.<br><br>The dialog between Bogie and June is hard-boiled and cheesy and quite wonderful. It is entertaining to see a big-hearted 1950's female character (Allyson) deflecting an in-your-face, unapologetic wolf (Bogart) without need of feminist presumption, sexual harassment law and political correctness cops.<br><br>With their distinct, defining and appealing faces and voices, both leads make the film's romance seem some what logical within the logic of 1950's Hollywood. It sure is fun watching them.<br><br>And so too is a terrific Keenan Wynn and the mechanics and team work required to set up MASH units in a war zone. In the film, the tented hospitals were set up, taken down and hauled off and set up again by men and women who were clearly experienced in the service.<br><br>The surgery tents and medical sequences in Battle Circus are sanitized compared to what one sees on television these days and what was depicted in the TV series M.A.S.H! Back then, the entertainment world respected the privacy of someone's innards particularly when their guts were spilling out of a body ripped by shrapnel.","user":"bukumi","rank":[18,20]},{"title":"A quirky and realistic slice of Korea, with Bogie!","rating":7,"date":"6 January 2012","review":"\"Battle Circus\" is interesting to compare to the TV series M*A*S*H. On TV, the camp of the medicos was a little too clean, and the doctors, especially Hawkeye, were always a little too ready with a joke. The one-liners never stopped at the 4077th, and there were few characters, especially in the last few years, who were not ever-ready to spew out endless dreary puns galore. Battle Circus is interesting in that it shows, I imagine, a more sober and realistic view of life in a MASH unit.<br><br>Because they are located near the ever shifting front of the Korean conflict, the MASH must constantly move with it. This brings out the greatest strength of this film: a large number of scenes in this movie are dedicated to showing the teamwork and bee-hive like energy of the grunts of the unit, taking tents down, putting tents up, moving the hospital here, then to there, often through or frighteningly near enemy fire, all the while dedicated to keeping their patients alive. The many minutes of film spent on these thankless and glory-less activities increases our appreciation of the realities of the soldiers' daily routine.<br><br>Here, there are few luxuries (unlike on the TV MASH, where many of the characters seem to have as many possessions as the Howells did on Gilligan's Island). Conditions in the personal tents of the characters are especially Spartan. Bogie's only possession seems to be a bottle of Scotch. When there is no time to bring everything with them, the soldiers burn whatever they must leave behind. Again, the starkness of existence suggests to this viewer a wonder that not all of the MASH members didn't go insane on a regular basis.<br><br>Now I am not a June Allyson fan, and while the romance between Bogie and her is not all that interesting or convincing, it is not a complete waste of film either. I don't believe I have ever seen Humphrey Bogart smile and laugh and be so un-pessimistic in a film before, and this is quite entertaining (Bogie even falls in the mud, losing his dignity, and laughs about it with June Allyson! Yikes!). There is no such thing as useless celluloid when Bogie is on screen. However, these episodes of light-hearted Bogie are surrounded by plenty of periods of brooding and cynical Bogie, so he is not completely out of character.<br><br>Robert Keith's colonel with the high-pitched voice complements Bogie's doctor very nicely in their scenes together. Keenan Wynn is also a terrific surprise; I usually find his raspy voice and abrasive characters unpleasant, but here he plays perhaps the most likable character (a can-do sergeant) in the whole film. His affection for a wounded Korean boy has the potential to be hokey, but he pulls it off very nicely.<br><br>One more MASH comparison. Bogie's character, like Hawkeye Pierce, is a woman-chaser and a man who wants no more authority than necessary, as well as a first rate surgeon. But unlike Hawkeye, who is afraid of guns, Humphrey Bogart is as willing to pick up a rifle and fire at the enemy as he is top pick up a scalpel. A real man's man.<br><br>Don't expect Gone With the Wind, and you will find this a quite interesting and quirky little war film.","user":"audiemurph","rank":[8,10]},{"title":"A MASH before M*A*S*H*","rating":5,"date":"15 October 2011","review":"This is an interesting movie. It's not the best war movie you'll ever see; it's not the most exciting movie you'll ever see and it's not one of Humphrey Bogart's best movies by a long shot. But it's still very interesting in its own way. I was intrigued by it at first because it's the story of a MASH unit in the Korean War - long before MASH the TV series or MASH the movie or MASH the book. To be honest, I really hadn't been aware that a story that focused specifically on a MASH unit had been done before that. I have to say that I enjoyed this much more than I enjoyed \"MASH\" the movie. This seemed to take a far more serious approach to the subject, and it seemed to stay on topic far better. It makes many of the same points that author Richard Hooker would make in his 1968 book (and that would be the inspiration for the later movie and TV series of the same name) - the pointlessness of war, the heroics of the medical teams and the need for those involved to just find a way - any way - through, whether that meant alcohol or sex (or, I suppose, anything else.) It's different, though, in that it portrays a much more positive picture of the military.<br><br>Bogart played Major Webb, second in command of MASH 8666. He's a bit of a lonely figure with a past that doesn't really get explored much, but he's obviously a superb doctor. Into his life comes Lt. Ruth McGara (June Allyson) and they develop an interesting relationship that both sometimes fight against, that sometimes neither takes very seriously and that seems to eventually develop into something real. There wasn't really much passion (or chemistry) between them, but the relationship seemed believable to me in the circumstances, where such relationships probably come and go pretty quickly depending on who gets transferred where and when. It's a cautious relationship understandably, and so perhaps the emotional connection that sometimes seems lacking actually works. It's that relationship that's the plot device that moves this forward.<br><br>Interspersed are vignettes of war. The hospital comes under fire on occasion, it's constantly on the move to keep up with wherever the front happens to be, there's some reflection on the impact of the war on Korean civilians, and the most exciting scene of the movie is probably the North Korean prisoner who manages to smuggle a grenade into the hospital. It's not an exciting, action-packed war movie. It seems to simply give a look at the life of those serving in a MASH unit, and it seems to be one of the many \"tribute\" sort of movies that were made in the era. Although casualties are certainly present throughout, it's also not at all graphic in its depictions, and (even understanding the greater sensitivities the industry at the time had to such things) I found it ridiculous that Webb could perform chest surgery on a young Korean boy which included an open heart massage and yet apparently not get a spot of blood on him while doing it!<br><br>It's not great. I would call it interesting, mostly for its look at a MASH unit before M*A*S*H*. (5/10)","user":"sddavis63","rank":[6,7]}]