[{"title":"One of the most intelligent comedies ever made","rating":10,"date":"16 December 2013","review":"Personally, I believe this to be one of the most intelligent comedies ever made. It might not appear that way at first because the film does have its share of simple slapstick and \"naughty\" moments, but generally, the topics the Pythons tackle here are very serious - albeit dealt with in a way that makes this a true contender for the funniest film of all time. <br><br>A firework of hilarious sketches, timeless quotes and clever comments on the human condition, this film was deemed too dangerous for the masses and therefore, until recently, banned in several countries (normally, this only used to happen to the so called \"Video Nasties\").<br><br>This film never once makes fun of Jesus (Christ) - but it DOES take the mickey out of blind, fanatic followers of any political movement or religion.<br><br>An outstanding achievement and endlessly re-watchable. <br><br>My vote: 10 out of 10<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[157,170]},{"title":"I Think God Has A Sense Of Humor, Don't You?","rating":8,"date":"1 April 2002","review":"And in the 1979th year of Our Lord, God took in a screening of Monty Python's \"Life Of Brian,\" and thought it was funny. <br><br>He did NOT think the film was blasphemous or offensive in any way. Yea, God did admire it's incredibly clever pokes at religion and at religious fanatics, for God Himself knew the virtue of being able to laugh at one's self. He also knew before He even walked into the theater that the title character, Brian, was NOT Jesus Christ, but merely a man who was born at the same time as Christ---right next door, in fact---and became mistaken for a messiah. God settled into His seat, with popcorn in one hand and diet soda in another, and had a rollicking good time.<br><br>He recommended \"Life Of Brian\" to His Son, Jesus, who went to see it the following week. He, too, thought it was a hilarious film, and immediately sang the praises of the Monty Python troupe---John Cleese, Graham Chapman, Eric Idle, Terry Jones, Terry Gilliam &amp; Michael Palin---for creating such a wonderful spoof. And He recommended the film to His friends. Have an open mind, He told them, and have fun. <br><br>But God and His Son were quite puzzled why so many people in the Bible Belt community were so upset by \"Life Of Brian\"---especially the ones who hadn't even bothered to SEE the frigging film for fear of being damned for all time. And They both shook their heads in dismay. It's only a movie, They thought, and a very funny, harmless one at that. Get a life!<br><br>But God gave Monty Python's \"Life Of Brian\" the power to overcome such ridiculous adversity, and today, well over two decades later, the film is rightfully regarded as a comedy classic, and one of the Python's finest works. It's *still* not a film for everybody, but does it have to be? If you're in tune with the Python's style of zany comedy, you'll enjoy \"Life Of Brian.\"<br><br>And praise be to Saint George Harrison, late of The Beatles, for lending the Pythons a hand in making this wonderful movie. :-)","user":"Gazzer-2","rank":[354,465]},{"title":"Stunningly funny","rating":10,"date":"11 February 2002","review":"One of my fave films of all time, this film has so many laugh-out-loud jokes and ridiculous thought processes that it would probably be unfair to pick out just a few. Tough - I'm going to: John Cleese as the legionnary Latin teacher rebuking Brian not for daring to use graffiti on the Roman fort but for using the wrong tense, Michael Palin trying to find his place in life as an ex-leper, Terry Jones as Brian's mother trying to protect him from myrrh - let's face it, we've all wondered what myrrh is ! The bit that always makes me laugh without fail is something that isn't always noticed - when Michael Palin is having a go at the guards; \"Do you find it risible when I say the name of my friend Biggus Diccus ?\" if you look carefully you'll see that Palin is trying really hard not to laugh.<br><br>Puerile, silly but also very very clever. This film doesn't criticise religion or Jesus in any way ( what was wrong with the people who tried to ban it ? ) - it's just asking what it could have been like in a society that was expecting the Messiah to show up at any moment, and covering it in a massive coating of comedy.<br><br>This film is an absolute classic - 10 out of 10.","user":"ptpenry","rank":[198,265]}]