[{"title":"Love for a Vampire....","rating":8,"date":"1 January 2001","review":"'Lust for a vampire' is the second film in the Karnstein Trilogy based on the novels by Sheridan le Fanu. The sequel to 'Vampire lovers' starring Ingrid Pitt, and prequel to 'Twins of Evil' starring playboy playmate twins Mary &amp; Madeline smith, 'Lust for a vampire' was hindered in its production from the off set. Legendary Hammer director Terrence Fisher was forced to pull out and Peter Cushing was replaced by Ralph Bates in the lead role. Yutte Stensgaard plays the truly beautiful Mircalla, a lesbian vampire who is torn between her love for her teacher and her lust for blood. This film has a very cosy atmosphere very traditional of hammers work around the late sixties early seventies. The sets are reasonable and although highly criticised for her performance, Yutte does her job well.<br><br>I could go on for pages but as an overview I would HIGHLY recommend this film even if it does dabble in as much romance as horror.","user":"meonksman","rank":[24,25]},{"title":"\"Flawed but offers the modern viewer some fun.\"","rating":14,"date":"14 December 2004","review":"In 1830 a renowned occult novelist called Richard Le' Strange (Johnson)is taken on to teach English at an exclusive finishing school for young girls in Styria. He falls in love with one of his pupils, the beautiful Mircalla (Stensgaard), but gradually discovers that she may well be the reincarnation of the evil vampire Carmilla Karnstein. Meanwhile in the village that neighbors the school, the locals are living in the grip of fear because it is forty years to the day since the vampiric Karnstein family reincarnated themselves in search of blood and village girls have been going missing.<br><br>Hammer's adaptation of Sheridan Le' Fanu's THE VAMPIRE LOVERS (1970) had been successful enough to warrant a sequel, therefore Tudor Gates who had scripted the former was duly approached to script the next one. The result was a rather unsavoury brew of vampirism and lesbianism and veteran Hammer producer-writer Jimmy Sangster who was responsible for such Hammer classics as THE CURSE OF FRANKENSTEIN, Dracula and THE NANNY was brought in to direct. It was his second outing behind the camera having made his directorial debut in 1970 with Hammer's spoof THE HORROR OF FRANKENSTEIN. This went out on a double bill with Roy Ward Baker's SCARS OF Dracula and only did average business. Whereas Sangster had enjoyed the experience of directing the Frankenstein spoof, he apparently hated LUST FOR A VAMPIRE along with his star Ralph Bates. He and Bates were apparently horrified at the preview screening when they discovered a cheesy pop song had been inserted called STRANGE LOVE sung by an unknown Tracy over the love scene between Johnson and Stensgaard. <br><br>Viewed today, LUST FOR A VAMPIRE certainly has it's flaws, for a start there is the inept casting of BBC Radio One disc-jockey Mike Raven as Count Karnstein. His voice was dubbed to make him sound like Christopher Lee and in the reincarnation sequence, a close up of Lee's bloodshot eyes from Dracula HAS RISEN FROM THE GRAVE was used instead of making Raven wear the red tinted contacts and doing a close up on him. Raven also appeared in Amicus's Jekyll and Hyde film I MONSTER (1971). The film also lacks a convincing hero, Johnson's Richard Le' Strange is little more than a boozy womaniser who is content to chase after a schoolgirl and the basic premise is somewhat crude. The film also shares sets with SCARS OF Dracula, Hammer fanatics will no doubt recognise the somewhat impoverished looking castle set from that picture. Yet there is still some fun to be had here, Bates gives a strong performance as the schoolmaster who lusts after Carmilla and wishes to sell his soul to the devil and Sangster stages the shock scenes with some style, especially the scene in the ruined castle where Carmilla is brought back to life.<br><br>LUST FOR A VAMPIRE wasn't all that successful, but Hammer managed to squeeze in a third outing for the Karnstein's, TWINS OF EVIL, which is in it's own right a better film by far.","user":"jamesraeburn2003","rank":[25,27]},{"title":"Adding a little to jamesraeburn2003's","rating":12,"date":"12 May 2005","review":"I've just seen this film yesterday and jamesraeburn2003's opinion reflected much of my impressions. However I would like to add few of my comments.<br><br>First off, despite the silliness of Strange Love song, I found it to be creepy and was really right in the mood for the making love sequence. Don't get me wrong, they don't need to insert a song in there but I never felt that it harmed the film in any way.<br><br>Next, Suzanna Leigh as Janet Playfair was great in her role. Her brash personality really steal the show (especially in the headmistress scene) whenever Steensgard is not around.<br><br>Steensgard on the other hand did not \"suck\" as many people believed and even if her voice was dubbed (she was Danish in origin), she didn't have much line to say other than \"I can't\", \"I love you\" and those sort of sentences. It was her non-verbal performances that became the highlight. The scenes where she walks, moves, and stares took a great effort that made her memorable, second only to Christopher Lee.<br><br>The only objection I have is the finale during the castle fire where Mircalla tried to prevent Lestrange from saving her. As she did so, Karnstein mentally influenced her to attack Lestrange. Lestrange threw her away and as she tried to attack again, she's killed by the falling block. That was my complaint because she died not as a woman who loved Lestrange (which she really did) but as a monster who wanted to kill him (outside her own will). I sympathized with her a lot and in her final scenes, they should have shown Mircalla crying to Jonathan as a last goodbye, confirming her love to him.<br><br>My only other wish was to see more of Yutte Steensgard in other Hammer films but she quit soon after and moved to America because she was felt \"unappreciated\" by the industry. I do hope she made a good living whatever she's doing now.<br><br>Okay that's it for my comment. This comes from a sentimental man who loved watching horror movies and tries to find a meaning behind every film. And Lust for a Vampire would make a great film to me provided that they extended the ending.","user":"ruspandy","rank":[11,11]}]