[{"title":"A Worthy (Though Flawed) and Much-Underrated Effort","rating":7,"date":"19 September 2005","review":"Given that trimming Tolstoy's WAR AND PEACE down to the length of one feature film (even at three-and-a-half hours) is probably a fool's errand to begin with, this 1956 version deserves more respect than it's generally gotten -- though the comments here indicate that the film may actually be gaining the respect that critics and film historians have so long denied it.<br><br>The movie does suffer from two undeniable shortcomings. First is the atrocious sound recording that has blighted virtually every Italian movie ever made. As some of the comments have noted, movies shot at Rome's Cinecitta had their sound post-dubbed rather than recorded on the set. But actually, this practice was then (and remains) very common. The sound in Italian movies stands out simply because they were so bad at it. The brutal truth is, even the greatest masterpieces of Fellini, De Sica, Rosselini, etc. are less than they might have been because Italian sound technology was so slipshod. And so it is with WAR AND PEACE: it's hard to suspend disbelief when soldiers struggling across a river sound like someone dropping quarters into a toilet.<br><br>The other shortcoming is the appalling miscasting of Henry Fonda as Pierre Bezhukov. It's the worst performance of his career, and he looks and sounds about as Russian as a slice of pumpkin pie. One commenter here said Alec Guinness should have played Pierre. It's an intriguing suggestion, and of course Sir Alec was always good. Even better, I think, would have been Peter Ustinov. In 1956 he was Pierre to the very life.<br><br>But the rest of the casting is genuinely inspired. Oskar Homolka as Gen. Kutuzov, Barry Jones as Count Rostov, Jeremy Brett as Nikolai, Herbert Lom as Napoleon -- all could hardly be improved upon. And Audrey Hepburn was simply born to play Natasha. And Mel Ferrer as Prince Andrei ... well, he did have his faults as an actor (to say the least!), but at least he looked the part.<br><br>Beyond that, the movie has lavish production values, impressive battle scenes, and one truly great and powerful sequence, the French Army's disastrous retreat from Russia, that takes up much of the last hour.<br><br>There's no substitute, of course, for reading the novel (I've read it three times myself). But this 1956 movie makes a worthy introduction, and even helps to keep Tolstoy's complex plot straight when you do get around to reading it.","user":"luannjim","rank":[41,48]},{"title":"Vidor's unjustly over-looked version of Tolstoy's novel","rating":8,"date":"9 April 2008","review":"Perhaps the best you can say for Vidor's long, (200 minutes), but surprisingly compact version of Tolstoy's novel is that it is no disgrace despite being 'internationalized' for mass consumption. (It's got an Italian producer, was filmed in Italy, an American director and a large cast from all over the place, leading in some cases to some very unconvincing dubbing). But it's also largely intelligent, well enough acted, particularly by Audrey Hepburn who is an enchanting Natasha, and visually splendid. No less than eight writers worked on the script which fails conspicuously to translate Tolstoy's 'grand ideas' into anything other than Readers-Digest form but then even Bondarchuk's even longer Russian version didn't quite manage the leap from page to screen. You may be forgiven, then, for thinking you are watching nothing more than a grandiose soap-opera even if it's a cut above run-of-the-mill historical 'soap-operas'. But in an age when three-hour-plus epics were ten-a-penny it didn't catch on and come Oscar time it was largely over-looked. (The even bigger but vastly inferior \"Around the World in 80 Days\" took Best Picture while \"War and Peace\" failed to snag a nomination in that category). But it is worth seeing if only for Hepburn's under-rated performance and for Henry Fonda, too old and miscast as Pierre, but bringing his liberal gravitas to the part, all the same.","user":"MOscarbradley","rank":[18,20]},{"title":"King Vidor's masterful version is simplified and stagey, but still beautifully done.","rating":3,"date":"3 December 2002","review":"This film version of Tolstoy's novel nicely captures the essence of his story.  The VistaVision, Technicolor photography by Jack Cardiff give the the set pieces the look of a classic painting.  Nino Rota's lavish score perfectly compliments the visuals.  The casting is superb; and even though Fonda is physically wrong in the critical role of Pierre, his dignified persona makes up for it.  Hepburn, as ever, is radiant as Natasha, and hits her marks perfectly.  Anita Ekberg's superstructure alone brings Helene to life; Ferrer, Homolka and Mills are all, likewise, wonderful in this.  The largely underappreciated Herbert Lom is absolutely brilliant as Napoleon. Practically speaking, this is a notable film adaptation of an enormous literary work, inspite of any comparisons one would care to make between the book and the movie.","user":"TheVid","rank":[27,33]}]