[{"title":"~A Child's Fantasy, an Adult's Memory~","rating":10,"date":"8 August 2010","review":"Today when I was at my house alone, looking through my DVDs, trying to figure out which movie I should see for entertainment. I saw E.T and I hadn't seen it for nearly 3-4 years ago. I seen the film ever since I was 4 years old, so I wondering if I would still enjoy it when I'm an adult. As I was watching the film, I had this rush of nostalgia running through me, I was remembering the times when I was a kid with my family. The film didn't at all feel to childish to me, I was actually having a lot of fun, like I used to when I was a kid. This film has not aged at all since 30 years ago. This film is a truly timeless film, and will always be remembered. This is one of the best Steven Spielberg films. (And that is no easy task) A Timeless Classic 10/10","user":"Loving_Silence","rank":[154,183]},{"title":"The Classic Of Family Classics","rating":19,"date":"19 February 2015","review":"The classic of family classics, 'E.T.' is a wonderful and heartfelt portrait of childhood exploring the friendship between Elliot, a young boy living in California, and an extra-terrestrial who gets accidentally left behind by his spaceship. From the multiple viewings during my childhood to the nostalgic sense of warmth I get from watching it nowadays, there is no way I can fault this science fiction masterpiece. One of Spielberg's greatest films, 'E.T.' is a compassionate and emotionally-driven tale packed with clever storytelling, bold direction and state-of-the-art visual effects.. oh and it also features one of the most iconic images in cinema history. A remarkable adventure that acts as both a touching family drama and an exciting sci-fi flick, and one that needs to be seen by all.","user":"CalRhys","rank":[54,63]},{"title":"Still Blows Me Away to this Day","rating":7,"date":"7 May 2004","review":"E.T. is one of my all time favorite movies. This movie blew me out of my seat as a kid, and still kills me every time I watch it. Only four or five movies have made me cry, much less sob uncontrollably. When I returned from seeing E.T. for the first time, I couldn't talk for the rest of the day. I laid in my bed and cried for about five hours.<br><br>The movie still makes tears well up in my eyes and gives me a lump in my throat. I still find it profoundly moving. It's heart-breakingly sad, yet phenomenally uplifting at the same time. I had no idea a movie could be so powerful when I saw this in the movies for the first time when I was eleven.<br><br>What I think makes E.T. so powerful for me now is the heart-wrenching way it has of making me long to be a kid again. I refuse to ever completely grow up, and my memories are my own, but man does this movie make me wish I was eleven again, when riding my bike was a pleasure, Matchbox cars were the greatest thing in the world, Halloween was a night of mystery and creepy fun I looked forward to all year, going to the movies was an adventure, and looking up at the stars could be a mind-blowing experience.<br><br>E.T. keeps those feeling alive for me. So do a lot of other things, but E.T. is the champ. As much as my cynical adult side may want to slap Steven Spielberg around sometimes, I would happily give him a hug for his timeless gift to the world, E.T. THE EXTRA TERRESTRIAL.","user":"squeezebox","rank":[155,207]}]