[{"title":"A Spot-On Courtroom Drama","rating":9,"date":"17 December 2005","review":"Anatomy of an excellent movie:<br><br>Begin with an extremely tight and well written script, from the novel by the same name. While reportedly the story is based on a real-life case it is nevertheless a timeless story, almost biblical, presenting age-old questions of human conflicts and human dilemmas. <br><br>Add to that a sensational cast, starting of course with the leads, Jimmy Stewart, George C. Scott, Lee Remick, and Ben Gazarra, but also the rest of the cast, filled as it is with numerous accomplished and veteran stage actors and radio performers from days of yore. Character parts played by actors Arthur O'Connell, Eve Arden, Ken Lynch, Joseph Kearns, and Howard McNear. Someone paid careful attention to the casting for this film.<br><br>Perhaps the most masterful stroke as far as casting goes was the casting Joseph Welch as the judge. Welch was an experienced and renowned lawyer in real life. Welch turns in a very good and a very believable performance.<br><br>With the collision of those elements, a great script and a great cast, adding Otto Preminger as director, an overseer who knew exactly what to do with it all, you then have a very fine film.<br><br>More than any other movie or play, including modern day presentations like the television series Law &amp; Order, this 1959 movie, Anatomy of a Murder, even though it is now 46 years old, is by far the most realistic and technically accurate courtroom drama ever produced. The conduct of the trial, the examination of the witnesses, the colloquy and bantering back and forth between the lawyers and between the lawyers and the judge, is spot-on. Every bit of it. Every question from the lawyers, every objection, every ruling by the judge, every admonishment from the judge, and the testimony of the witnesses, every bit of it, is realistic and believable, lines that were accurately written with care, and then flawlessly delivered.<br><br>Beyond the technical accuracies of the legal proceedings, some other aspects of the overall story were also spot on. The ambiguous ambivalence of lawyers, their motivations, their ethics, their relative honesty. Nothing is all black or all white. Shades of gray abound. Legal cases as sport. Being a \"good lawyer\" means pushing the envelope too far, bending the rules until you're told to stop. Not for justice. No, not that. To win. That's why. To win. Then sanctimoniously telling themselves that the system really works better this way. The movie accurately captures the fact that real-life legal cases are very often comprised of upside down Alice in Wonderland features. Innocent people are guilty, and guilty people are innocent. Good is bad, and bad is good. Everything is relative. Some call it cynicism. Others, cynically, call it realism. Anatomy of a Murder captures all of these and more.<br><br>I've read the criticism that Lee Remick was not believable, that as an actress she failed at nailing the portrayal of how a true rape victim would appear and behave, and that her character, Laura Manion, just didn't seem to have the proper affect nor strike the right emotional chord of a woman who had been raped. All I can say is that such criticism misses a humongous part of the point. It is almost mind-boggling that there are viewers out there who, after viewing this film, somehow managed to miss it. Let me clear it up: we the viewers WERE SUPPOSED to have serious doubts about whether Laura Manion had actually been raped. The question of whether she was really raped or not is central to the plot and story line. That's why Lee Remick played the part the way she did. And then, in turn, it was part of the story for the Jimmy Stewart character, Paul Biegler, to recognize this problem, and the problem that it presented to his defense. He worried that the jury would see it and would also doubt that she had been raped, and so that's why he propped her up in court, dressed up all prim and proper, with a hat over her voluptuously cascading hair, and with horned-rim glasses. So, yes, Lee Remick nailed it. Bull's eye.<br><br>Speaking of Lee Remick, some say that this was the movie that put Lee Remick on the map. She was stunningly beautiful here, at the ripe young age of 24. Even though the film is in black and white, her red hair, blue eyes, and porcelain skin still manage to jump right off the screen and out at you. Has any other actress ever played the role of the beautiful and sexy lady looking to get laid any better than Lee Remick? It was a woman she reprised several times in her career, sometimes with greater subtlety and understatement than others. This was her first rendition of it, and it may have been the best.<br><br>Anatomy of a Murder is a very complex movie, with multitudes of layers and texturing, where much is deftly explored, but precious little is resolved. It's a movie that leaves you thinking and wondering. I highly recommend it.","user":"tightspotkilo","rank":[118,139]},{"title":"Intense, Dramatic, Well Crafted Suspense...","rating":6,"date":"6 August 1999","review":"Well filmed, beautifully acted, and painstakingly directed, this film deserves the highest praise.<br><br>James Stewart brings his customary stammering, quirky charm to a role that could have easily become overwhelmingly serious.  Lee Remick is seen establishing her early image as the somehow fragile, undeniably seductive pawn (see also \"A Face in The Crowd\"), while Gazzara wavers intensely somewhere between heartless murderer and protective husband.  The supporting cast is strong, creating a human backdrop for the senior players, keeping the story in the real world,  effectively preventing this from becoming an exercise in legal theory.<br><br>This film is noteworthy for a myriad of reasons, but most specifically because it addresses the still controversial issue of acquaintance rape, and presents us with a victim of questionable morals.  At the same time our murder victim is seen as a monster, then a friend and father. There really are no heroes here, no noble defenders, no pristine heroines, no completely innocent bystanders...both sides take their turns pointing fingers, each claiming that the other only got what they deserved.<br><br>We are forced to re-evaluate our thoughts on what constitutes justifiable homicide--the unwritten law that Manion speaks of in the film versus the law as written that Biegler must now interpret.  This manipulation of intended meaning sets a somewhat tragic precedent evident in the legal system we work within today.<br><br>This film is highly entertaining, and excellent for discussion. Watch it with some of your more philosophical friends.","user":"Cari-8","rank":[102,129]},{"title":"Gray Anatomy","rating":9,"date":"15 July 2001","review":"Anatomy Of a Murder is probably Otto Preminger's best film. It's certainly my favorite. Adapted from a novel by Robert Traver, it tells the story of a lawyer in northern Michigan and his defense of a particularly surly and violent murderer. As is always the case with Preminger, scenes are filmed mostly with all the characters present in the frame. There is no cross-cutting to speak of, which is to say the drama plays out with the assorted characters confronting one another, or at any rate with one another, and the effect is one of surprising warmth and good feeling in the movie's cosier scenes, which for once enhance rather than detract from the drama. I would have been quite happy to have spent much more time in lawyer Biegler's house and study, with its books, old furniture and broken typewriter, but alas this is a murder case so one has to get down to businss.<br><br>The question of whether the defendant, an army officer, was temporarily insane, is in fact insane, or is merely putting on a good show, is never fully resolved. The lawyer is by no means perfect. He's a little lazy, though he gets over it. One senses he's cheap. He enjoys his shabby genteel bachelor's life and isn't always responsive to the needs of his secretary, who would like to get paid more regularly. In the end he proves far more dedicated and brilliant than we might have first imagined him to be, but the fly in the buttermilk is that the better he gets the more complicated the case becomes, and the more ambiguous everything gets the more he finds out about his client and the man he killed. In this respect the movie is a masterpiece of ambiguity. Beautifully shot on location in black and white, it is more gray than anything else. Morally gray. No one is quite what he appears to be at first. And people change; or rather we learn more about them. The bartender at the resort where his boss was killed at first comes off as a jerk; in time he comes to seem more of a jerk. Then he seems maybe not so bad after all; and then he's a jerk once more, but a jerk we understand. The lawyer's assistant, an on-again, off-again recovering alcoholic, is also a mixed bag. He is dogged but sloppy, and always (or so it appears) on the verge of breakdown. Or at least this is how Arthur O'Connell plays him. The prosecuting attorney is a dolt, but he is aided by a legal bigwig the state has brought in, but this hotshot is no match for the cunning country lawyer. The defendant's wife, who 'started the whole thing' is gorgeous, sexy and provocative. She makes a play for her husband's lawyer, but he doesn't bite. One wonders about her. And one wonders about the marriage she and her hot-tempered spouse really have, and whether it will last.<br><br>This is a very sophisticated and adult movie for 1959, or for that matter today. The location filming greatly enhances the mood, chilly and very upper midwestern. Yet indoors one feels different, and the tone is often playful. The actors are superb. James Stewart is gritty, lovable, homespun, physically slow and mentally quick; and for all the familiarity there is about his screen persona, out of character, that is, in character he manages continually to surprise and delight. He was a true actor. Ben Gazzara is very Method actorish, which suits him well in his role as the volatile military man. Lee Remick is stunning as his wife, and one can well imagine a man killing for her, many times over. She is also a good actress. George C. Scott plays the state's bulldog prosecutor well, though he's an acquired taste at best. His hamminess contrasts with Stewart's folksy naturalism in interesting ways not ungermane to the plot, but he is out-acted and outclassed by the old pro he is presumably upstaging in this film.","user":"telegonus","rank":[70,87]}]