[{"title":"A page out of order","rating":15,"date":"15 October 2011","review":"This is actually one of the titles of the film, a page out of order. It perfectly reflects the film itself, a narrative fractured, demented, cast in and out of a feverish mind, but ultimately incomplete to us, and the various misconceptions it has spawned in trying to evaluate as though it was the whole thing.<br><br>I was increasingly suspicious of this while watching, that I was basically confronted with an incomplete film and so a film impenetrable not wholly by design but only because the keys have been lost to us, or are not attached to the film we are watching and we have to apprehend elsewhere. Doing a little research afterwards only confirmed my doubts. So a little context: <br><br>-the film is not the tip of the iceberg of an advanced cinema whose main body is lamentably lost to us; it was saved exactly because it was an exception, a low-budget oddity the filmmaker himself re-discovered in his garden shed. The majority of silent Japanese cinema - whose final traces were eclipsed in the aftermath of WWII - were generic studio reworkings of popular material.<br><br>-it is not the product of an 'isolated cinematic environment free of influence', rather a studied attempt to recreate what the French avant-garde was pioneering at the time; so yes, the superimpositions, the haze of motions and details, the rapid-fire montage, all of them tools in the attempt to offer us a glimpse of the fractured, elusive reality of the mind, available tools at the time that Kinugasa knew from other films.<br><br>-so even though the idea of a janitor coming to work in a mental hospital may carry hues of Caligari, the film itself is from the line of what in France was called impressionism; the films of Epstein, L'Herbier, Gance. <br><br>-most importantly, even though the closest parable I can think of is Menilmontant, another French film from the same year that in place of story tried to paint with only images a state of mind from inside the mirror, that film was directly structured around images. It was intended to be seen as we have it. Watching Page it becomes increasingly obvious that a story deeply pertains to what we see; as was customary in Japan at the time, that story was meant to be narrated to the audience by a benshi, a narrator supplied by each theater. We may cobble together a view of that story from other sources, but the intended effect is lost to us. <br><br>-there is still the problem that in the version we have approximately one third of the film is missing. Most of it in the end from what I can tell, where the girl is supposed to marry her fiancé (which echoes and wonderfully annotates the scene where the janitor imagines himself reunited with his wife.<br><br>Oh, what we have of the film is more than fine, it's actually one of the most captivating visions of the mind in disarray from the time. But it was just not meant to be seen as merely a tone poem. The dreamy flow is clearly flowing somewhere. What we have instead is only what was salvaged from it but at the same time near complete enough, making barely enough sense to stand on its own, that we may be inclined to accept as the full vision.<br><br>We can still accept this itself as a fragment of madness and interpret from where our imagination takes us. That is fine, I encourage this.<br><br>Rumors have been circulating about a new restored version, hopefully one that - next to a better print - somehow includes the narration, preferably by a benshi, or intertitles at the very least. Until then, no rating from me.","user":"chaos-rampant","rank":[41,44]},{"title":"A FORGOTTEN MASTERPIECE","rating":10,"date":"3 December 2001","review":"An old man works as a janitor in a mental hospital to be close to his wife who is a patient there and to try to get her out.<br><br>This is surely one of the most forgotten masterpieces of the silent era and an oddity in the history of Japanese cinema. Long thought lost, a print was found in the 70s and a music soundtrack added to it, which fits perfectly with the images. It might have been influenced by cabinet of doctor Caligary (director Kinugasa claimed he never saw the German film). However it surpasses it in style and in its more convincing (and chilly) portray of the inner mental state of the inmates in the asylum. To achieve this, the film makes use of every single film technique available at the time: multiple exposures and out of focus subjective point of view, tilted camera angles, fast and slow motion, expressionist lighting and superimpositions among others. It is also a very complicated film to follow, as it has not got intertitles.<br><br>The film opens with a montage of shots of rain hitting the windows of the hospital, wind shaking trees and of thunder. The unsettling weather metaphors the mental condition of the patients and introduces one of the them: a former dancer. The combination of sounds produced by rain, wind and thunder serves as the music that incites the dancer to get into a frantic, almost hypnotic dance. In another sequence involving the same patient engaged in another frenzied dance, she is being watched by other inmates. Multiple exposures of the dancer represent the patients' point of view and their confused \"view\" of the world.<br><br>These are just two examples from this amazing film trying to represent the patients' subconscious and view of the \"sane\" world.<br><br>In three words A MUST SEE.","user":"quinolas","rank":[45,52]},{"title":"Should be viewed by any film enthusiast","rating":25,"date":"25 September 2012","review":"Very few Japanese films exist from the silent period. In fact, statistics show that only 1% of around 7,000 productions are represented in the a catalogue of the silent cycle. Director Teinosuke Kinugasa's Kurutta Ippeji (also known as A Page of Madness) was thought lost (and perhaps forgotten) until he himself discovered a print in a warehouse in 1971. He diligently produced a new music soundtrack and re-released it. This is the first example of a silent film from Japan, and have to say that the world should be thankful that Kinugasa discovered this avant- garde little master work.<br><br>The film was produced with an avant garde group of artists, known as Shinkankak-ha (School of New Perceptions), an experimental art movement that rejected naturalism, or realism, and was highly influenced by European art movements such as Expressionism, Dada, and Cubism, and evidently uses the techniques found in Soviet Montage, particularly Sergei Eisenstein - fundamentally, as this project deals with madness, it would be easy to draw parallels with Robert Weine's seminal horror film Das Cabinet des Dr. Caligari (1920). What the art trope bring to this extreme nightmare are those exaggerated, pointed and alarmist movements like the expressionist acting styles being used in European film and stage work - but happens to find its own stylistic flourishes, and colloquial \"voice\" (for want of a better word).<br><br>Kurutta ippeji's simplistic story focuses on a man (Masuo Inoue) whom has taken a job as a janitor in an asylum, so that he may be close to his wife (Yoshie Nakagawa), who has been condemned. His aim is to aid in her escape from the dogmatic institution. However, when the break-out is orchestrated, her madness has enveloped her, and she is unwilling to leave with her husband. The couples daughter (Ayako Iijima) visits the asylum to advise her mother of her engagement, which leads to a maelstrom of fantastically abstract flashbacks, giving light to the reasons the mother is condemned.<br><br>The films style is so incredibly complex and technically brilliant. In the opening sequence, the jarring compositions (both beautiful and haunting), superimposition's, and quick montage editing, creates an assault on the senses that is difficult to break away from - torrential rain falls the scenery in shots of the asylum, expressionist compositions of wind-battered tree branches clashing with windows, and the sight of a woman riddled in madness. The use of superimposition becomes greater as the film moves into crescendo, and these layers portray climatically the merger of madness and modernity. Do we witness the ghosts that haunt the corridors of the asylum? Or are these the devastating spectre's of modernity, and the destruction of tradition? An ironic speculation perhaps, considering the mechanics of cinema production and exhibition.<br><br>To a modern audience, silent cinema is often a difficult watch. This film is of particular note for this argument. Kurutta ippeji has no title cards describing dialogue, or internal action, which makes it difficult to follow at times. But as with all 1920's Japanese cinema, the films were always accompanied by narration - a storyteller known colloquially as a benshi. But this small infraction does not hamper an incredibly dazzling piece of early experimental cinema, and one that should be viewed by any film enthusiast, at least for posterity - if not for a formative education on the stylistic diversity of film as art.<br><br>www.the-wrath-of-blog.blogspot.com","user":"tomgillespie2002","rank":[17,20]}]