[{"title":"Before there was \"Freddy VS Jason\"...","rating":7,"date":"20 April 2004","review":"Godzilla escapes from an ice berg and King Kong is found on an island that has lots of kick ass berries on it which the natives grind into a juice for Kong to drink. After throwing boulders at a giant octopus and drinking the juice, Kong falls asleep and the local Japanese TV guys \"ape nap\" him and bring him back to Japan so their boss can exploit the big monkey for all he's worth. But en route, the Japanese government order the TV guys to send Kong back his home island because they've got enough problems with Godzilla as it is, they don't need a giant monkey on the rampage as well. Kong escapes and this leads to the inevitable clash of titans as Godzilla battles Kong for the right to demolish Tokyo.<br><br>The original Kong from the 1933 film was only 50 feet tall while Godzilla is 400 feet tall, so they had to make Kong a lot bigger for this film and in order to make the odds more even for him they endowed him with the ability to draw strength from lightning bolts. The King Kong suit is hopelessly phony to look at though.<br><br>The American version is a travesty that serves merely as filler until the big finale, with a reporter who really makes you long for Raymond Burr's reporter man Steve Martin. Whether or not the Japanese version ever becomes available in America remains to be seen, but hey, see whatever version you can get just to see Kong ram a ridiculously huge tree down Godzilla's throat!","user":"DarthBill","rank":[25,26]},{"title":"A fun monster-rumble","rating":7,"date":"7 August 2004","review":"Director Ishiro Honda, who first brought The Big G to the screen in the brilliant 1954 film GOJIRA (re-edited in the US as Godzilla King of the Monsters) decided to scrap the heavy messages and themes of the original film when he made King Kong vs. Godzilla, however he does appeared to have had a great deal of fun making this goofy rubber monster classic. Godzilla breaks out of an iceberg he was imprisoned in and heads to knock down Tokyo. Meanwhile, a pharmaceutical company discovers King Kong on an island full of Japanese actors in blackface playing the natives (!) and the flamboyant CEO decides to bring Kong to Japan as a publicity stunt. The government decides to pit the two titans against each other on the top of Mount Fuji in the climatic scene of the movie. Much of this film is film is intentionally goofy, particularly the island scenes. The screenwriters decided that electricity makes King Kong stronger, but it weakens Godzilla (to make sure it would be a fair fight). Honda also put in several homages (parodies) to the original 1933 King Kong. The final battle on Mount Fuji is similar to watching WWF wrestling, except better, because they're wearing monster suits. If you want a film with epic romance and sweeping drama, you should watch Gone With the Wind, but if you're in the mood for campy monsteriffic fun like only the Japanese can do, watch this.","user":"Brave Sir Robin","rank":[18,19]},{"title":"Monster-battling fun.","rating":7,"date":"3 August 2006","review":"Having never seen the Japanese version, I can't say whether the US version is better or worse. But I can say that this is a jolly monster-battling romp. King Kong is intoxicated by some kind of berry which grows on his island, is brought back to Japan by ruthless businessmen who intend to make money out of him. But they reckoned without Godzilla, who returns to fight the great ape. Alright, so the film completely ignores the storyline of the original King Kong film, and the special effects (apart from the land-stalking octopus, which looks really good for its time) are pretty tatty. But come on. If you're a fan of these kinds of films, you'll be hooked until the final showdown.","user":"StormSworder","rank":[11,11]}]