[{"title":"film student's action picture","rating":9,"date":"7 February 2006","review":"There are many disappointing action pictures out there – this is not one of them. The genius of the film is there is no wasted motion. The picture starts right with the plot – no introduction or character development. The characters are allowed to develop as the plot moves along.<br><br>Which brings us to pacing – the pacing in this picture is excellent. It moves right along and never stops, never slows, never goes too fast. This is the strongest element of its success.<br><br>Another strength is its economy of motion. Many action pictures bore us with unneeded car chase scenes, shoot-em-ups, explosions and other mayhems that are used as filler when true creativity comes up short. This film needs none of that. Only that which is necessary is shown. Only that which needs speaking is spoken. This film is deftly written and crafted with great economy and this underpins the excellent pacing. It moves right along because there is no wasted motion as there is in most other action pictures.<br><br>This does not mean there is no action, there is fabulous action, but only such action as is necessary to move the plot along. There is no action simply to occupy time until the requisite 90 minutes are up.<br><br>The directing is equally economical. No fancy shots, shaky cameras, or special effects – just good, straight forward directing.<br><br>I doubt this picture could be made today for the above reasons. The script readers would reject it for 'lack of development'; 'not enough action'; 'no romantic interest'; and all the other brainless formulas script readers dole out. The producers would demand 'more action' and 'camera work' from the directors. And, of course, a romantic interest (in some state of undress) would have to be shoe horned in.<br><br>Film students should study this picture. From it they will learn that brevity is a virtue and mindless formulas are just that - mindless.","user":"greenforest56","rank":[160,181]},{"title":"\"Pelham 1-2-3 is in motion\"","rating":9,"date":"28 May 2007","review":"One of my favorite films from the seventies is The Taking of Pelham One, Two Three because it's so New York. Of course the film was shot entirely on location in The Big Apple including the interiors which helped greatly. But more than that, the characters have all the New York flavor about them with one exception.<br><br>The cat of course is led by Walter Matthau who plays a Transit Police Lieutenant. His character is a kind of combination of Archie Bunker and Detective Lennie Briscoe from Law and Order, in many ways not terribly admirable. He's also a transit cop and at that time the Transit Police were a separate entity. They were merged into the regular NYPD during the Giuliani administration. <br><br>There's no real glory in the Transit Police, these guys were mostly charged with dealing with drunks and kids with loud boom boxes. If a homicide ever occurred the NYPD quickly took it over as they would in most situations. But this ongoing crisis on a train on the Lexington Avenue Local occurs on his watch and it's career make or break case that Matthau is very aware of. And he proves fully capable during the crisis.<br><br>The crisis is four men, Robert Shaw, Earl Hindman, Hector Elizondo, and Martin Balsam mount a carefully planned assault on a subway train out of Pelham Bay station in the Bronx in mid-Manhattan and hold it and the passengers for ransom for a million dollars. The outsider to New York is Robert Shaw in one of his best roles, a former British army officer and mercenary. During the course of the robbery they kill a station supervisor played by roly poly Tom Pedi, one very quintessential New Yorker and their coldblooded villainy is established.<br><br>In fact the whole cast is a microcosm of the ethnic strains of New York City which makes the film so enjoyable, especially to one who lived there, the first 49 years of his life. Even the mayor is portrayed as a weak, fumbling nonentity and back then our mayor was one Abraham D. Beame who was just that, probably one of the worst mayors the city ever had. Tony Roberts has a very good role as the tough as nails Deputy Mayor concerned about both his boss's political career and resolving the crisis.<br><br>The Taking of Pelham One Two Three once the hijack is done is suspense filled and doesn't let up for a moment. I can't give the ending away, but the final shot of Walter Matthau's face as the end title music starts and the credits begin to roll is priceless.","user":"bkoganbing","rank":[50,55]},{"title":"The best heist film of all time!!!","rating":10,"date":"14 April 2001","review":"A group of heavily armed men, all wearing the same disguises board a subway train underneath the streets of New York. They quickly take over the train and hold seventeen passengers hostage. They look and talk like professionals. They use codenames. Their ransom demand is One Million Dollars. Are these just maniacs without a plan? And if they do have a plan, how are they all going to escape alive while the world watches?<br><br>Right away, this film grabs you and doesn't let go. Every character plays their role remakably and memorably. Enough suspense to keep you chewing your nails until they are stubs...and most of all, a realistic and engrossing storyline. You will literally be on the edge of your seat, wondering where the next plot twist will take you.<br><br>You can easily see where Quentin Tarantino borrowed ideas from this movie to make Reservoir Dogs...and in my opinion, this film makes Reservior Dogs look like a second rate film. Its truly a shame most people aren't familiar with this movie and it doesn't have the allure or big star power to draw in new fans seeking out a great film to watch<br><br>If you happen to run across The Taking Of Pelham One Two Three though, do not pass it up! This is honestly the best heist movie I've ever seen. 10 out of 10 Rating.","user":"Antiknown","rank":[63,72]}]