[{"title":"One of my all time favorites","rating":10,"date":"6 February 1999","review":"The fact that Norma Shearer and Joan Crawford would consent to appear in a movie together is amazing. Shearer in 1939 was the queen of MGM, being the widow of studio production chief Irving Thalberg, and had her choice of material and co-stars. Crawford, although a power in her own right, didn't have Shearer's pull and complained bitterly about it. Crawford agreed to take the somewhat supporting, albeit juicy, role because she needed an A picture after a string of flops. So she had to suck it up to work with Shearer.<br><br>The two stars had only one scene alone together, and there were no reported problems, except one. Director George Cukor sent Crawford home early when she caused a distraction by loudly clicking her knitting needles off camera as Shearer tried to do her close-ups.<br><br>Crawford was proved right in taking the movie, it's one of her most memorable and, finally for once, villainous roles. As Crystal Allen, the scheming shopgirl who is out to sleep her way to a Park Avenue penthouse, she was ideally cast. It was her life.<br><br>Rosalind Russell, previously not known as a comedienne, surprised everyone with her rapid-fire sarcastic delivery. She would continue to perfect the biting style for 20 years until she reached the pinnacle with Auntie Mame. Roz gives the strongest performance of the film as the viciously catty Sylvia Fowler, and I don't think Shearer or Crawford knew what hit them.<br><br>As for the long-suffering, hair-clutching, heavy-sighing Norma Shearer, even she was able to make the difficult role of noble Mary Haines memorable. One of her best moments is when she raises her nails and growls \"I've had two years to grow claws, Mother, and they're Jungle Red!,\" and then goes to take her husband back from Crawford. Unfortunately, Shearer has a few Silent Screen moments that look out of place, such as collapsing and weeping at her mother's knee. But she makes the character warm and likable and we root for her to win.<br><br>There are many gems in the supporting cast. Most spectacular is Mary Boland as the heavy-drinking, high-living Countess De Lave. \"L'amour L'amour\" she wails as she's about to divorce her fourth studly husband -- for trying to kill her.<br><br>Paulette Goddard, the most beautiful member of the cast, is the best I've seen her, as the streetwise Miriam Aarons. Like Crawford, she plays a role she understands, the chorus girl who snags a millionaire. But unlike Crystal, Miriam has a heart -- and Goddard is great at doling out straight-shooting advice and rolling out put-downs under her breath.<br><br>Marjorie Main gives a preview of the persona she would later use as Ma Kettle. It was the first time she was able to step out and create the character, and she used it the rest of her career. I never tired of her raucous horse laugh.<br><br>I hope Hollywood has the good sense not to update this classic with another misguided remake. It is a priceless diamond in a golden setting.","user":"Andrew_Eskridge","rank":[114,122]},{"title":"Best of the Best!","rating":10,"date":"4 November 1999","review":"This, by far, is the greatest classic bitch film of all time. It can never be equaled.  They tried, but failed, when trying to remake it a musical with a less than glamorous casting of the roles made famous by the all-star female cast of the original written by Clare Boothe Luce.  George Cukor, the director, had his hands full with the likes of these dames of fame.  Each, in their own right, could steal a scene if left up to them, and they tried.  But Cukor, held tight to the reins and kept them all in line. The beginning credits were cleverly done with each star being represented by an animal.  Norma Shearer, the doe; the delicious Joan Crawford, a tiger; Roz Russell a cat; Paulette Goddard, a fox; Marjorie Main, a mule; Joan Fontaine, a lamb.<br><br>My favorite scenes were the fight scene with Goddard and Russell, bath scene with Crawford, and last scene when all THE WOMEN go at it at the ball.  With wonderful, crisp dialogue, beautiful costumes designed by Adrian and a stellar cast, you can see the sparks fly in this all-time classic comedy of 1939.","user":"guil12","rank":[63,69]},{"title":"A Legendary Comedy Available On DVD","rating":10,"date":"22 April 2005","review":"The female of the species goes jungle red in tooth and claw in this brilliant screen adaptation of Claire Boothe Luce's famous Broadway play--a wickedly funny portrait of 1930s society women whose lives revolve around beauty treatments, luncheons, fashion shows, and each other's men. Socialite Mary Haines is the envy of her set: rich, beautiful, and happily married... but when her husband steps out on her with a gold-digging perfume counter sales clerk, Mary's so-called friends dish enough dirt to make divorce inevitable whether Mary wants it or not.<br><br>The script is wickedly, mercilessly funny, fast paced, razor sharp and filled with such memorable invective that you'll be quoting it for weeks and months afterward: \"He says he'd like to do Sylvia's nails right down to the wrist with a buzz-saw;\" \"Why that old gasoline truck, she's sixty if she's a minute;\" \"Gimme a bromide--and put some gin in it!\" And the all-female cast, which includes every one from Cora Witherspoon to Butterfly McQueen to Hedda Hopper, plays it with tremendous spark.<br><br>This was the last significant starring role for Norma Shearer, one of MGM's greatest stars of the 1930s, and she acquits herself very well as the much-wronged Mary Haines. But the real winners are the members of the supporting cast. Joan Crawford is truly astonishing as Crystal Allen, the shop girl who leads Mary's husband astray, and Rosalind Russell gives an outrageously funny performance as the back-biting gossip whose nasty comments precipitate Mary's divorce. Indeed, it is hard to do anything except rave about the entire the cast, which includes such diverse performers as Marjorie Main, Paulette Goddard, Joan Fontaine, and Lucille Watson. Even the smallest bit parts score with one-liners that have the impact of a slap in the face, and director George Cukor does an incredible job of keeping everything and every one in sharp focus.<br><br>Perhaps one of the most interesting things about THE WOMEN is the way in which director Cukor ties the behavior of its characters to their social status. Possessed of absolute leisure and considerable wealth, their energies are inevitably directed into competition for the ultimate status symbol: a successful man. Cukor allows us to sympathize with Mary (Shearer) and laugh at Sylvia (Russell), but he also requires us to pity them--and indirectly encourages grudging admiration for the devious Crystal (Crawford) and the savvy Miriam (Goddard), characters who are considerably more self-reliant. Consequently, not only does THE WOMEN paint a poisonously funny portrait of women as a sex, it takes a hatchet to the society that has shaped their characters as well.<br><br>Unfortunately, this landmark comedy has not received the full benefit of what DVD offers. Although the print is crisp, the film has not been restored, and the extras are spurious and hardly do the film justice; while I would recommend the DVD simply because you're likely to wear out a VHS, the DVD has no great advantage over the VHS release. But whether you have it on VHS or DVD, this is one title that you must have in your collection: you'll watch it again and again. A must-have! Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[45,50]}]