[{"title":"She looks like an angel, talks like an angel","rating":8,"date":"7 November 2011","review":"I've been searching and waiting to see \"Julie Darling\" for quite a very long time, and now that I finally watched, I'm both pleased and upset. Pleased because it's one of the most intense and disturbing 80's thrillers I've seen in a very long time, and upset because it undeservedly became obscure and forgotten amidst the overflow of inferior slasher pictures in that same decade. \"Julie Darling\" can more or less be categorized as a so-called Bad Seed effort, or – in other words – (horror) movies dealing with evil, psychopathic and murderous children. But this awesome little gem qualifies as a lot more than just that as well. It's a psychological \"family\" drama with a thoroughly uncanny atmosphere, numerous controversial undertones and a handful of very efficient shock moments. Julie Wilding is a cherubic and well- educated adolescent girl with a rather unhealthy affection for her daddy. Her mother notices Julie's rivalry and possessive behavior and wants to send her to a boarding school. But then her mother gets raped and killed by the grocery delivery boy, and even though Julie witnesses the whole thing from atop of the stairs, she doesn't move a muscle. Just when Julie thinks to have her daddy all for herself, he reveals that he's been having a secret affair for many years and wants to raise a new family with the lovely Susan and her little son. Rather than to get her own hands dirty, Julie tracks down her mother's murderer and blackmails him into doing the same with her new step family. She even joyously adds the words \"Oh, and you can rape her all you want\". If Sigmund Freud would have ever written a movie script, the result would look a lot like \"Julie Darling\". The film is literally stuffed with psychosexual references and disputatious elements, like incestuous, intercourse with minors and matricide. In spite of its obscure status, \"Julie Darling\" features quite a few famous (in the cult/horror business, at least) names. Writer/director Paul Nicolas was also responsible for the greatest Women in Prison exploitation flick ever made, namely \"Chained Heat\" released that same wondrous year 1983. Anthony Franciosa, known from Dario Argento's giallo classic \"Tenebre\" is excellent as the unsuspecting (?) father and many horror fanatics will be super enthusiast to see Sybil Danning stars as the lovely stepmom. The one true diva of the film, however, is young Isabelle Mejias as Julie. I always thought that Patty McCormack (\"The Bad Seed\" 1956) was the most devilish child star, but she's a church choir girl in comparison to Isabelle Mejias. She depicts a truly frightening, cold-hearted and malignant teenage psycho.","user":"Coventry","rank":[8,9]},{"title":"Surprisingly, this is pretty good","rating":13,"date":"13 June 2007","review":"This movie is marketed as a Sybil Danning vehicle even though the erstwhile German-American sex symbol is really only in the last half of the movie, and the really memorable performance is by the unknown Isabella Mejia as a disturbed teenage girl whose infatuation with her father (Antonio Franciosa from \"Tenebra\")leads her to allow an intruder to rape and murder her own mother. She then blackmails the same guy into trying to do the same to her new stepmother (Sybil Danning). The disturbed girl at one point even locks her young step-brother in an old fridge in the middle of a junkyard.<br><br>I saw this film almost back-to-back with another, much more terrible Sybil Danning-starrer \"They're Playing with Fire\". But while that film was a horrid hybrid of a dumb 80's teen sex comedy and an idiotic 90's erotic thriller (featuring Sybil in the sack with the annoying kid from \"Private Lessons\", and the once great Andrew Prine flushing his career right down the toilet), this film does the burgeoning erotic thriller genre proud (or as proud as you can do that crappy genre). It has a real, if not necessarily highly believable, plot and pretty decent acting. Other reviewers have compared it to \"The Bad Seed\", but it is actually better than that stagey, melodramatic flick (which ends with the villain literally being struck down by lightning). I'd put it somewhere between that one and a truly deserving classic like \"Pretty Poison\" (with Tuesday Weld and Anthony Perkins).<br><br>This movie is certainly no classic, but it doesn't really deserve its current obscure status either. It's probably Danning's best (American)movie. Those who watch it just to see her take her clothes off for the zillionth time won't be disappointed of course, but I think they'll also be pleasantly surprised with the rest of the movie.","user":"lazarillo","rank":[16,21]},{"title":"Long overlooked bratsploitation gem.","rating":1,"date":"1 July 2007","review":"Isabelle Mejias, an under-recognized talent who deserved better material than she received during her brief acting tenure, performs strongly as Julie, a socially disunited young lady with a ravenous Electra complex. Julie harbors malicious and dangerous resentments toward anyone she feels is competing for her father's affections, or who might create a rift within her delusional fantasy world. Hapless potential-victims-to-be are her new step-brother and step-mom(Sybil Danning, upstaged once again by her extremely well-ventilated 36-C juggage).\nIt's a minor B gem with a brisk pace, mounting suspense, and some pretty grim deaths...JULIE, DARLING was not a boxoffice success, and received a rather limited VHS release. This is a better quality picture than its relative obscurity might suggest, and ripe on the vine for rediscovery.\n6/10","user":"EyeAskance","rank":[13,17]}]