[{"title":"It hits you with both fists!","rating":23,"date":"23 August 2001","review":"This is perhaps one of the most masochistic films ever made. You are taken into the personal world of two British families in Sheffield (site of a major NATO installation), who have children that are about to be married. Thousands of miles away, World War 3 slowly starts, and the ultimate horror happens. Thermonuclear war breaks out. The world, literally, grinds to a halt, in one of the most scientifically accurate depictions of nuclear war since \"War Game, The\" (1965). Unlike the US film \"Day After, The\" (1983) (TV), the film gives detailed information as to what is happening on a scientific basis. You are shown how a worst-case scenario can happen, and what the effects are, as you follow the surviving members of the two families through the aftermath. The scenes of death, destruction and disease are so realistic, I had to shower after seeing this film for the first time. But what is most disturbing is that the film includes the long-term effects of global thermonuclear war, going into weeks, months, years, even decades. The film ends thirteen years after the nuclear attack, and the final frames of the film will burn into you like no other film ever will. There can be no question that this film MUST be re-released in the USA on DVD, so that it's message will be heard and felt.","user":"Baroque","rank":[158,170]},{"title":"Absolutely terrifying, utterly disturbing. (Spoilers)","rating":9,"date":"9 September 2005","review":"Having just purchased this on DVD I was eager to watch it after waiting years to see it after it was unofficially banned from ever being shown on the BBC again. I was four when it was first shown and my parents switched it off, too frightened to watch it themselves never mind let me see it.<br><br>I have to say it is absolutely terrifying and utterly terrifying in the extreme. This could have actually happened! I was impressed by the way the film conveyed what it would be like if thousands of megatons of atomic bomb was dropped on the U.K. Normal life comes to an abrupt stop. One minute people are shopping in their local supermarket, going to the pub and wallpapering their new flat and suddenly they are plunged into Hell. Civilisation is blown back into the stone age.<br><br>The most scary part was the way the authorities were shown unable to cope with the scale of the attack (perhaps why the BBC never aired it again). We always think that it could never be that bad because someone would come to our rescue, someone would maintain control. But no, the bombs / missiles keep raining down and down prompting one traumatised emergency committee member to scream, \"not another one!\" They just did not expect so devastation and are completely helpless. Later soldiers shoot people for food, people wish for death and the emergency committee, those meant to be running things, die in the supposed protective bunker, trapped by rubble.<br><br>Ten years later, nothing is back to normal. What young people there are behave like wild animals, raping and fighting and speaking in a bizarre caveman manner.<br><br>Since the Cold War ended people have stopped being frightened of nuclear weapons. Everybody in every country should watch this film and realise that if there ever was a nuclear war, still possible with growing tensions between a superpower and its rivals, those left alive would wish they had been caught in the blasts and killed outright.<br><br>I don't recommend this for sensitive viewers.","user":"charlieboy80","rank":[89,95]},{"title":"Once again...","rating":26,"date":"26 June 2000","review":"I think it would be useless to repeat all that the other users have said about \"Threads\" since I cannot do better but agree with everything. This has to be THE most graphic representation of nuclear war. And I used to think \"The Day After\" was disturbing.<br><br>I was able to cope to the whole movie, but let's say it wasn't easy at all. I can still hear in my head the yells of the panicked citizens as the mushroom cloud rises in the distance when it hits Crewe... or see the bottles of milk... or the corpse (which bears a striking resemblance with E.T.!) burning in the firestorm... or see survivors keeping as gold what is taken nowadays as granted: supermarket plastic bags... and what they put inside is simply disgusting.<br><br>When I found out my local video store had a copy of this film, I rushed to get it, as I was impatient to see this movie I have heard so much about. The impatience to see the movie was rewarded by nothing more than a really bad aftertaste of radioactive fallout.<br><br>I liked the movie not for the quality of the actors, but for the overall realistic representation of the holocaust and for the great job done with a small budget. I give a thumbs up to that.","user":"airodyssey","rank":[89,95]}]