[{"title":"Late 70's Toho Tokusatsu Swan Song...","rating":5,"date":"20 April 2006","review":"By the late 70's Toho had seen the handwriting on the wall, after Godzilla's first retirement. This was seemingly their last big SPFX film until they got into the mid-80's when times improved. STAR WARS was playing big in the US in 1977 and it had yet to reach Japanese shores until Xmas time. (Toho had recently had the ball dropped on them with NESSIE which was to be a $5M Hammer/Toho production, that fell to pieces when investors pulled out-Toho had already spent money making a monster they were so sure it was going forward.) SO, two rival studios Toei and Toho decided to do their own space opera stories ahead of that. Toei's was MESSAGE FROM SPACE and Toho made THE WAR IN SPACE with a much hyped campaign claiming it was the most expensive film they'd made in years. The plot essentially is: aliens annex Venus and use it as a base to attack earth in globe shaped ships. So it is up to the space battleship Goten and it's crew to go to Venus and defeat the aliens. Because of budget,much of the destruction on earth is footage from THE LAST WAR and BATTLE IN OUTER SPACE, inserted over footage of the flying, firing globes. However we never feel the sense of all-out war as everything seems to be normal in far-future Japan-which has people in leisure suits and typical 70's office buildings. The aging, hardened commander of the Goten takes his ship, daughter and crew to Venus. Here is where Toho's FX dept shines with an excellent miniature surface of Venus, complete with cloud chamber effects work. The Gohten itself is a re-worked version of The Atragon(it was said that in fact the very model of that was pulled out of storage and re-tooled to save money) and the story feels like that film(ATRAGON) mixed with a loose re-work of BATTLE IN OUTER SPACE. The aliens have ornate ships and wear wild costumes-as always in a Japanese film. The ships look more fantastical than functional like huge sea going ships, boats with oars. There is even a Chewbacca-lookalike but he has a pair of horns, I assume to make him look \"evil\" unlike his US counterpart. At one point the commander's daughter is kidnapped and taken prisoner by the aliens-and put in the charge of the evil Chewbacca. All the costumes are a rather outlandish and brilliant affair. You never know what someone will appear wearing! For example-the aliens remove the daughter's yellow space uniform and force her, hands bound,to wear a rather racey leather bondage outfit and it is up to the hero to rescue her. All the costumes are a outlandish and brilliant affair, as with many of Jun Fukuda's Godzilla films, he really brightens up the color palette on everything.The spacesuits however are particularly nicely done and have arealistic \"2001\" feel to them.<br><br>There is a strange rock/disco/electronic music score to the film but then I think that was keeping with the times. Even the opening credits with the fog machine in overdrive and the disco music just speak everything 1977. A fun film, however be aware of the Japanese sensibility to it, and that it is what it is.","user":"zillabob","rank":[23,28]},{"title":"Wakusei daisenso: Best of the trilogy, but that's not saying much","rating":3,"date":"4 October 2018","review":"In 1957 we got The Mysterians, Tohos attempt at cashing in on the sci-fi movie popularity that was overwhelming the west. Two years later they made a sequel by the name of Battle in Outer Space and I was still left unimpressed.<br><br>I found myself wishing Toho had stuck with their dark broody movies and never dipped their feet into sci-fi. However if they hadn't we'd not have Godzilla, say I suppose something came out of it.<br><br>Almost 20yrs later Toho made the third and final part of the trilogy and it's the best of the bunch. But that's not saying much, it's still pretty damn bad.<br><br>It tells the story of a goverment with one single hope against the alien menace, an experimental ship! But the aliens are doing everything in their power to make sure it's never completed. Will our heroes overcome or will mankind fall?<br><br>Well, The War in Space is one of the cheesiest movies I've ever seen. From the script to the overwhelmingly cheddar score, it makes the original Star Trek look positively serious and Oscar worthy.<br><br>Best of the bunch, but still cringe inducing stuff.<br><br>The Good:<br><br>Yûko Asano <br><br>The Bad:<br><br>Music badly doesn't fit in places<br><br>Cheesy script<br><br>Things I Learnt From This Movie:<br><br>Straws make great cannons<br><br>Space minotaurs are a thing","user":"Platypuschow","rank":[12,14]},{"title":"Toho sci-fi trash.","rating":4,"date":"26 August 2007","review":"In 1977, 20th Century Fox gave us Star Wars; Japanese studio Toho, on the other hand, presented The War in Space. Star Wars spawned umpteen sequels, made George Lucas impossibly rich, and became a phenomenon that is as popular today as it was 30 years ago; The War in Space didn't.<br><br>But Jun Fukuda's epic sci-fi effort doesn't fail because of its crap effects, awful design and ridiculous plot (these elements actually make the film just about bearable); it fails due to it's dreary beginning, dreadful pacing and complete lack of excitement.<br><br>The film starts with an attack on Earth by an alien fleet that has its base on Venus. After several notable landmarks are destroyed (in a scene that reminded me of Independence Day, but made without the benefits of computers and a decent budget), we meet the heroes of the piece: Professor Takigawa (Ryo Ikebe), his babelicious daughter (Yûko Asano), and her two suitors Miyoshi (Kensaku Morita) and Morrei (Hiroshi Miyauchi).<br><br>These guys, along with a small, dedicated (and seemingly expendable) crew, head for Venus in their fresh-off-the-forecourt battleship, The Gohten, and proceed to kick extraterrestrial butt.<br><br>Sounds like fun, doesn't it? Well, sometimes it is, but.....<br><br>...the film takes a long time to get going, with lots of talking where there should've been action (not that the action is much cop: badly choreographed laser shoot-outs and tedious space battles are the order of the day) and a pointless romantic sub-plot also gets in the way of the good stuff.<br><br>And by 'the good stuff', I mean the awful spaceships (that resemble galleons and submarines), the poorly conceived aliens (the main baddies have painted green faces and wear particularly daft outfits, whilst a huge hairy wookie-style monster has big yellow horns and brandishes an axe), the inventive weapons (The Gohten is equipped with huge lasers, that look like the bullet chamber from a giant revolver, and a flying drill/über-bomb), and, of course, the great scene in which June is kidnapped, and forced to wear a saucy leather outfit!","user":"BA_Harrison","rank":[13,24]}]