[{"title":"\"Don't dream it, be it!\"","rating":10,"date":"18 October 1998","review":"As an 18 y/o stranded in a small, bible belt town in the sticks of Missouri, I would drive 120 miles every two weeks to St. Louis to the Varsity Theater to see The Rocky Horror Picture Show during the early 80's.  For me, it was a chance to live, to breathe free, as anything went; there was no need to conform to any narrow minded conventions, as I felt I had to  survive at home.  The first time I witnessed Tim Curry flinging open his cape, proudly proclaiming \"I'm just a sweet transvestite, from Transsexual Transylvania,\" I knew I'd found a place to be myself.  Even now, some 18 years later, that sight still gives me a thrill.  Sure, the plot is ridiculous (on second thought, it had more to offer than 80 percent of the crap coming out of Hollywood then and now) and it is loaded with technical flaws.  Still, I consider it the greatest film of all time. How many films draw a crowd of regulars weekly, create a sense of community, especially for people who, more than likely, felt as if they were not a part of any community, as I felt?  Over the years, I've seen the film 64 times, and when I'm 80 I plan on getting up on my arthritic legs and doing the \"Time Warp.\"","user":"nick-96","rank":[55,59]},{"title":"Morals: Why I love this film","rating":25,"date":"25 August 2007","review":"I admit I'm too lazy to read through all the reviews here and see if I'm the only one who loves this classic not only for its music, its cast and costumes, or its insane collection of cinematic references. Just in case I'm the only one, I post this comment to perhaps give you a new view to this wonderful film.<br><br>Under all its noise and gaudiness, I think the RHPS is profound, touching and tragic.<br><br>A German critic (sympathetic to the film) called it \"utterly immoral\". This is ridiculous, as the RHPS is one of the most deeply moral films of all times.<br><br>Why do Brad and Janet let themselves so easily be seduced by Frank N'Furter? Because they never spent a thought on the rules they want to live by. They think, you don't have sex before marriage because that's just the way how decent people should live. Obviously no one has told them that there could be a real understandable REASON for living this way. They have no clue. Trying to live by a moral without understanding the foundation of this moral must lead to tragedy.<br><br>Frank N'Furter is a fascinating figure, one of the most memorable villains in cinematic history. There can be no doubt that what he does, to Brad, to Janet, to Rocky, to Eddie, is not only rude, but evil. Not before the \"Floor Show\" at the end we get a glimpse at the human core in this monster. There he sings about how he wanted to be dressed like Fay Wray when he saw her in \"King Kong\". I suspect that he not only wanted to be dressed like her, he wanted to BE her -- a longing that could not be fulfilled. Wearing women's clothes tragically didn't made him an angelic figure like Fay Wray, it made him a freak. And it seems to me that all he wanted in the first place was to be loved and be accepted for what he was. When he sings \"I'm going home\" and imagines an audience, this audience doesn't consist of weirdos like the Transsylvanians who are present when Frank is introduced into the film. Instead they are ordinary old people who friendly applaud his performance. Frank makes you think about how unfulfillable desires can torture people and make them outsiders. I don't think Frank wanted to be an outsider.<br><br>For me, the most beautiful scene is when they sing \"Don't dream it, be it\" in the pool. The other four people in the pool are dressed like Frank; there are no boundaries any more, no distinction between the sexes, no gravity. This is pure bliss, the single truly utopian moment of the RHPS. Makes you want to believe that it could really be possible to be in love with the whole world, caress and be caressed back, without jealousy and pain, beyond time and space, beyond good and evil. Not even Dr. Scott can resist (great performance in his monologue, magnificent actor!).<br><br>But is this more than a dream? Could it be real? The scene could go on for ever, I wish it would, but it is short and is abruptly ended by Frank himself when he jumps out of the water and starts singing \"Wild and untamed thing\". Why? Doesn't he trust his own utopia? Earlier in the film, we have seen how Janet imagines different people replacing the face of her lover, Rocky, during her orgasm. This is basically the same utopia, but here the way it is presented doesn't make it look very tempting, but bizarre and disturbing. I suspect this scene is closer to our reality outside of the cinema, outside of our dreams: When you love with your body but not with your soul all you can hope for is a moment of frantic pleasure, but no real fulfillment.<br><br>The ending of the RHPS cannot be mistaken in its moral. Brad and Janet spell it out when they sing the sad last song \"Super Heroes\". What is left for them from the big party? Nothing but pain and disillusion. They have not been loved, they have been used, and now they are scarred for life. This is not a happy ending.<br><br>The epilogue by the narrator is very pessimistic. But are we really \"insects\", crawling on this earth, without hope, without meaning? I don't think so. We could decide to live a different life. A life without deliberately or thoughtlessly hurting other people. Respecting and accepting other people for what they are. Living not by an empty moral, but by a real one, with love and compassion.","user":"kleiner_fuchs","rank":[30,33]},{"title":"The Mother of All Cult Films","rating":10,"date":"14 September 2005","review":"Or I should say, the Sweet Transvestite of all cult films!<br><br>To those who haven't seen Rocky Horror, don't bother reading reviews about it. It won't mean anything. Don't rent it on DVD which it recently came out on. It also won't mean anything, because it's missing the thing that gave it and the stage play that preceded it life... the audience. By definition, a cult film is meant to be seen by a group. Preferably, a large one. <br><br>I saw Rocky Horror 20-something years ago, and wound up playing \"Brad\" with the players next to the stage. Something I would normally never do. Why? The show's energy sucked me in. More accurately, the audience's energy sucked me in. <br><br>The show, with a revved-up audience, is almost like a dialogue between the movie and the people watching it. It celebrates sex, hedonism, even while playing out the danger, violence, and tragedy it can result in. It allows the audience of mostly young kids to exude and rejoice in their sexuality, whatever it is. And without ever taking their clothes off. I think that is the real appeal of the show. There's a joyousness, and a strange innocence, in throwing raunchy comments at the screen, watching the live performers on-stage act out the scenes in racy costumes, and sharing the energy anonymously in the dark with strangers. <br><br>The live show with the original actors must have been electrifying. Plays always have more energy than films because of the immediacy of the live actors, and the energy must have been even more intense. I'll always regret not having the chance to have seen it. <br><br>The movie itself has been described too many times for me to give a synopsis. I will however say that it is really a collage of feelings, ranging from fear, trepidation, excitement, lust, joyous sexual fulfillment, more lust, tragedy, and a strange sadness at the end. Basically, all the emotions that make life worth living, in an hour and a half. However, the visceral enjoyment of this film, and the emotions it brings, will only be experienced with a large, highly energized audience. If you get a chance, and if you can get your reserved ego out of the way, go to a midnight showing in your area when you know there's going to be a big showing. Don't go expecting a logical, coherent storyline. Its about experience, not narrative. You'll get an experience that you've been missing your whole life. At the end, there is a message here, hidden under all the seemingly blissful hedonism. It takes a long time for it to become clear, however.<br><br>I wonder if O'Brian, its creator, was clever enough to have put it there all along? <br><br>By the way, there is no nudity or actual sex in the entire movie. For a movie with its reputation, that's pretty amazing. Compared to the slasher/gore fests passing themselves off as film these days, the movie is strangely quaint and innocent. But then, that's what true enjoyment of sensuality should be. <br><br>For a cult film, 10 out of 10 stars. It doesn't get any better than this as cult films go.","user":"mercuryix-1","rank":[138,176]}]