[{"title":"Tasteless, juvenile and very funny","rating":8,"date":"5 February 2001","review":"A bunch of skits spoofing TV shows, commercials, movies, previews etc etc. There's also a long dead on target spoof of \"Enter the Dragon\" called \"A Fistful of Yen\".  The film is very 70s--some of the references won't make any sense to anyone born after 1977.  Also much of the humor is exceptionally crude and there's a huge overabundance of gratuitious female nudity and fairly graphic sex.  This film wouldn't be made today and would easily have gotten an NC-17 rating if it had.  Still, the film is often hilarious--I laughed myself silly at some of the crudest humor possible. So, it's worth seeing, but if you're easily offended do NOT see it!  Also where else can you see Bill Bixby, George Lazenby, Donald Sutherland and Henry Gibson in a film with the coming attractions of \"Catholic High School Girls in Trouble\"?","user":"preppy-3","rank":[54,63]},{"title":"You have our gratitude.","rating":10,"date":"12 May 2006","review":"This movie was like the Holy Grail of DVDs for me; I couldn't find it for the longest time. Finally I just picked it up off E-Bay (which I should have done from the start, of course) and watched it for the first time in years last night.<br><br>In terms of laughs per minute, this one is a strong contender for funniest movie of all time. Written by Zucker Abraham and Zucker, directed by John Landis, and produced by Samuel L Bronkowitz (just kidding), \"The Kentucky Fried Movie\" is really nothing more than a collection of skits, barely connected by the convention that they're all things you might see on TV (or at the movies). But, oh, the skits. Let's just say that no single episode of \"Saturday Night Live\" was ever this funny.<br><br>Best of the bunch is the movie's centerpiece, \"A Fistful of Yen\", a dead-on parody of kung fu action movies a la \"Enter The Dragon\". In this bit, the longest in the film, a Bruce Lee type named Loo has to infiltrate a mountain fortress run by the villainous Dr. Klahn, who is building an army of extraordinary magnitude. The martial arts scenes are hilarious; it may be the most staged-looking fighting of all time. Beginning with Loo training other fighters (\"What was that? This is not a chawade. We need total concen-TWAY-tion,\" he yells at one student) and ending with Loo finally going home (in a completely out-of-left-field ending having nothing to do with the previous action but seeming somehow fitting anyway), the slapstick jokes come fast and furious, even parodying \"The Dating Game\" at one point. This is a direct precursor to ZAZ's later movies like \"Airplane!\" and \"The Naked Gun\".<br><br>Then there's the incredible \"Catholic High School Girls in Trouble\", which aims to parody 70s porno flicks (\"More shocking than 'Behind the Green Door'... Never before has the beauty of the sexual act been so crassly exploited!\" the announcer screams.) To get an idea of the kind of humor seen here, picture a hot chick approaching a loser and saying in a breathy voice \"Show me your nuts!\" and the guy proceeding to start acting like a total loon. In \"United Appeal for the Dead\" Henry Gibson speaks at great length about death, the number one killer in the United States, and what his group can do to help a loved one who has died lead a normal life. \"That's Armageddon\" features George Lazenby and parodies every Irwin Allen disaster flick made. A young man and woman discover the pleasures of sex through an instructional record in \"Sex Record\", and \"Courtroom\" is a hilarious parody of courtroom melodramas featuring Wally (the real Tony Dow) and the Beav (Jerry Zucker mugging it up in place of Jerry Mathers) as observers. The movie begins and ends with two news-themed skits, \"AM Today\" and the racy \"Eyewitness News\", in which the newscasters watch a couple with the TV on having sex. And there's much more.<br><br>\"The Kentucky Fried Movie\" is not for all tastes; I've known people who have watched it and just said \"This is stupid.\" It is, indeed, stupid, but within the confines of the genre, it's one of the best. You'll laugh at the stupid jokes and stupid puns and stupid lines and stupid stunts all the way through if you like this sort of thing. The movie is very clever in how it packs the laughs.","user":"the-jerk","rank":[28,32]},{"title":"A tasteless comedy of extraordinary magnitude!!","rating":9,"date":"18 December 2006","review":"\"Kentucky Fried Movie\" is tasteless, unsophisticated, and decidedly sophomoric... and one of the most hilarious films ever made! A string of politically incorrect segments made by the creators of \"Airplane!\" and \"The Naked Gun\", \"KFM\" is an \"R\"-rated romp that today, nearly 30 years after its release, would be too shocking to even warrant the dreaded \"NC-17\" rating. Forget those unfunny amateurs Broken Lizard or the overrated Farrelly Brothers. We're talking naked breasts, oral sex, racial slurs, violence... and yet each segment leaves you delirious from not only laughter but disbelief at the fact that the Zuckers actually go away with all this. I've discovered that it really takes a certain kind of innocence to make a movie like \"KFM\", a naive belief that people will simply laugh at the crude spectacle of it all. Segments include a wholesome couple listening to a 1950s style \"how-to\" record on foreplay (wait till you see what the record comes equipped with), a thrill seeker whose trademark stunt is going to a crowd of black men and yelling out the N-word (how bold is this scene? No one has dared imitate it since), and a political debate between two analysts that ends with one of them cheerfully telling the other to \"blow it out your a**\" and giving them the finger. The highlight is the mini-movie within the movie, \"A Fistful of Yen\". A parody of all the Bruce Lee films, its hero, Loo, fights the evil Klahn, a one-armed criminal mastermind with a fondness for the phrase \"extraordinary magnitude\". It also pokes fun at the endless fights from the Lee films, as well as the characters' fractured English (little trivia, the actors really were Asian and spoke poor English in real life, so it wasn't intentional on their parts) The twist ending of \"Yen\" is one of the goofiest things you ever saw in your life. Despite the often offensive humor of \"KFM\", it's not a mean film by any means. No one is really safe from the wacky chaos it inflicts, and it's just hilarious. In our time of hand-wringing political correctness, \"KFM\" offers a cathartic experience of laughing out loud at our fears, prejudices, and, yes, stupidity. This is indeed a finger-lickin' good comedy.","user":"lauraeileen894","rank":[35,43]}]