[{"title":"\"Oh Well, They're Only Men\"","rating":7,"date":"19 August 2008","review":"The Scalphunters was the first of two films Sydney Pollack directed with Burt Lancaster. In fact according to a recent biography of Lancaster, Burt was literally trying Pollack out on this western before giving him an opportunity to direct the very expensive Castle Keep for him the following year. Personally I think The Scalphunters is a far better film.<br><br>It's a rollicking good mixture of comedy with some very serious themes involved. It's also the last time Lancaster did any really athletic roles as he was 55 when making The Scalphunters. We all bow to old age at some point.<br><br>Sydney Pollack actually started his association with Burt Lancaster on the set of The Young Savages where he was an acting coach to some of the street kids who were playing gang members. It was his first introduction into motion pictures, he had previously directed and acted in a number of television productions.<br><br>Burt is fur trapper Joe Bass who gets an offer from the Kiowa Indians he can't refuse. They'll relieve him of his year's trappings in beaver pelts and he'll get an educated house slave in Ossie Davis. Davis seems born to be a slave, he escapes it from the south, then he's captured by the Comanches who then trade him to the Kiowas and then he's forced on Lancaster. <br><br>Lancaster is planning to get his pelts back, but a murderous gang of Scalphunters beat him to it and massacre almost the whole band and take Lancaster's furs along with horses and scalps that bring a good bounty. Burt's Joe Bass is not exactly a boy scout, but this crowd truly nauseates him.<br><br>The Scalphunters are headed by Telly Savalas and his cigar smoking refugee from a bordello of a woman, Shelley Winters. Winters has the best performance in the film, this is her third film with Lancaster with whom she had a self documented fling back in the day. Later on Davis gets captured by The Scalphunters and he has to use his wits to survive among them. But they're going to Mexico where slavery has been abolished.<br><br>The laughs are mixed in with some serious racial issues all around. Lancaster can't quite accept Davis as an equal, Davis is perfectly willing to go along with The Scalphunters and their genocidal war on the Indians if he'll obtain his freedom through them. And Savalas and his crowd are as mean a bunch as you'll ever see in a film, yet some of the funniest bits in the film involve Winters and Savalas.<br><br>The Scalphunters is a really funny western that if you think about it teaches some good lessons we could all use.","user":"bkoganbing","rank":[21,22]},{"title":"Pollack directed the film with a sense of humor unexpected in the genre","rating":7,"date":"21 May 2007","review":"\"The Scalphunters\" opens with an illiterate frontier fur trapper named Joe Bass (Burt Lancaster) refusing to trade his furs, with the Kiowa Indians, for a runaway field slave But at the end, he is forced at gunpoint to do that and Bass finds himself, in one moment, the owner of Joseph Lee (Ossie Davis), an escapee from Louisiana, formerly of the Comanche tribe, until stolen by the Kiowas <br><br>Lee, an Africanslave by employment, black by colorresults one of the highest educated families in Louisiana, who can read and write Lee's intention was to circle south, as far as Mexico, because the Mexicans have a law against the slavery trade <br><br>Bass' immediate plan was to catch up with the Kiowas and get back his pack horse and furs But his plan soon failed when a band of scalphunters led by a dangerous double-crosser, Jim Howie (Telly Savalas) attack the poor Indians killing almost all of them and taking, by the way, Bass' property Bass a man who moves mountains to get what he wants stampedes their wagons and makes the scalphunters' horses dangerous to ride <br><br>The sweetest, and in some ways the funniest moments come out when Bass talks to his horse In one scene, he gets so excited, and turns back to his stallion saying: \"By god, you have got an idea!\" <br><br>Telly Savalas makes Kojak a charmer, but in Pollack's film he is a psychopathic bounty hunter who slaughters a dozen Indians <br><br>Kate (Shelley Winters)a cigar-puffing doxy qualified to do things to any manis sick about her lover's wagon She complains that she lives like a squaw Kate's dream was to live like a lady in a fancy house with servants Winters delivers the best line of the whole movie when she exclaimed at the end of the film: \"What the hell? They're all men.\"<br><br>Ossie Davis comes out with a real sense of humor In one scene he explains to Kate the benefits of the common cactus, known to the Comanches as Maguey He makes her believe that this plant was used in the ancient times by the Queen of Sheba to restore the natural oils to her beautiful blond hair <br><br>It was nice to see Nick Cravat in a modest role as one of Savalas' men As you remember, Cravat was ideally cast as Lancaster's sidekick, Piccolo, in the flamboyant \"The Flame and the Arrow\" in 1950, a spoof of the Robin Hood genre, set against the castle battlements and banquets halls of medieval Lombardy","user":"Nazi_Fighter_David","rank":[27,33]},{"title":"Sydney Pollick and Burt Lancaster together. Overlooked gold!","rating":3,"date":"3 August 1999","review":"In the late 1960's and the early 1970's the United States was deeply embroiled in Viet Nam with all it's ramifications.  It was so far from \"the best of times\" that it was difficult to laugh at much.  Also this was the period where the Western film fell out of style.  It was unfortunate timing for several excellent movies, \"The Scalphunters\" among them.  If this movie were released tomorrow it would become an unqualified hit.<br><br>Burt Lancaster is at his cynical best, poking fun at everything the Hollywood Western and Burt Lancaster ever imagined themselves to be. Ossie Davis performs the nearly impossible task of playing a highly intelligent black slave on the lam without loosing perspective on the comic genius of the script.  Tully Savallas plays the odious (And we suspect odorous) oaf with style and dignity (if that's possible) and Shelley Winters does the same for his female counterpart.  And the Indians, the long-suffering, patient, bemused Indians dutifully dying and then returning to fight again just as often as the miraculous movie 6-shooters can get off 20 rounds or so.<br><br>In command of all this chaos is the unmistakably sure and steady hand of Sidny Pollick with his comic genius to rely on and a smart, literate script to form the framework.  Perhaps this movie should be titled \"'The Crimson Pirate' meets 'Toostie'\".<br><br>If you've got a sense of humor and are able to suspend you disbelief for a couple of hours or so, \"The Scalphunters\" will give you a good evenings entertainment.  If you enjoy it, try \"There was a Crooked Man\" with Henry Fonda and Kurt Douglas.","user":"H.J.","rank":[24,29]}]