[{"title":"Evil Angel' is a fitting tribute to the Chamberlain's and the death of baby Azaria.","rating":16,"date":"16 January 2003","review":"If there is any Australian that I feel sorrier for, it would have to be Lindy Chamberlain. Her compelling story is one of the more famous court cases in Australian history. Also known as A cry in the dark', Evil Angel' shows how divided the Australian public really were towards this case and how the media can manipulate a story, by favouring just one side of a story that they believe is the whole truth. When I hear the cry The dingo's got my baby', it brings back memories from along time ago.<br><br>During a camping trip, an infant disappears from her family's tent. When the child's mother spies a dingo nearby, authorities launch a frantic search, but all they find is a torn, bloodied garment. The press, distressed by the mother's seeming \"lack of emotion\", and suspicious of her religious beliefs, begin to accuse her of murdering the baby. The sentiment against her begins to grow, and soon the whole continent is talking about the case. Despite the lack of evidence, the woman is imprisoned; although investigators eventually re-examine her story, the damage is done: the innocent mother's relationship with her husband has been irreparably destroyed. This is the documentary style film adaptation of the true story of Lindy and Michael Chamberlain.<br><br>This film has some truly amazing performance in it. Meryl Streep is a wonderful actress, but in this film she does so much that you just have to like. She really becomes Lindy' and embodies what she actually went through. I remember reading that Streep had to have speaking classes, so she could sound Australian', which she does very well. But it is her persona I like the most. Streep performance as Chamberlain is so flawless, as she shows no emotion when she is going in and out of court, which is what the real Lindy Chamberlain did. It is understandable that the general public would think that Lindy is guilty of murder, which is again testament to Streep's masterful performance. However in court Lindy is visibly upset, when she has to recall the night a dingo took her baby.<br><br>The other performance which is most noteworthy is that of Sam Neill. While Neill has gone on to do many big performances in Hollywood blockbusters such as Jurassic Park' and the Aussie favourite The Dish', this is one film I continue to remember him from. I like how we see that Michael is visibly distressed by the whole court case scenario, with him stumbling through the interrogation when he is on the stand. It is also most taxing on the couple's personal life, with Michael the first one to crack.<br><br>Yet there are some famous Australian cameos from many actors in Evil Angel'. Look at these for names; Maurie Fields, Charles Bud' Tingwell, John Howard, Frankie J. Holden, Mark Little, Mark Mitchell, Glenn Robbins and Kym Gyngell. All of them are well known personalities in Australian TV, and it is of great significance to this story to have such great fame among the cast of this film.<br><br>Director/Screenwriter of Evil Angel' Fred Schepisi does justice to this story in many ways. Firstly, Schepisi and co screenwriter Robert Caswell stuck very close to the story written by John Bryson. Then Schepisi directs this film in quite a unique way. He points the story in many ways, showing the Chamberlain's in one shot, then to the media, then to the general public. This amount of change gives the film great variety, which is good. If it was fixated with just the Chamberlains, this movie could have had major problems. <br><br>I also like the many shots of Australia that this film shows off. Having this tragedy take place in the Northern territory, certainly gave that state and its famous attraction Ayers Rock (Uluru) some sort reputation, as this film does too. Yet there are some excellent shots in Alice Springs, Darwin and in the Chamberlain's home-town (for some time) of Mt. Isa in Queensland. This is good work of cinematographer Ian Baker. <br><br>So with all those factors taken into consideration, this film looks deep into what it must be like to go through the loss of a baby child, taken by a wild animal. It also a fascinating insight into what the media can do to turn a story and how merciless people can be towards someone that in all possibility could be innocent'. Although it is 22 years since this horrible event has happened, I realise that Chamberlain's lives were, and probably never will be the same again. Michael and Lindy had to go through the most painful of divorces, and their children had to go grow up with a large amount of innuendo attached to their lives. I am thankful that Lindy Chamberlain was released from prison, after serving three and a half years of a life imprisonment sentence for a crime which she did not commit.<br><br>\nCMRS gives Evil Angel': 4 (Very Good Film)","user":"Old Joe","rank":[33,36]},{"title":"Excellent look at 'justice' and the media","rating":9,"date":"25 August 1999","review":"Some movies seem to be made before we are ready for them.  As I watched this film, made in 1988, in 1999, I thought I was watching the O.J. Simpson debacle (although I have very different opinions about the innocence of the individuals in each situation).<br><br>The Australian news media, if this movie is to be believed, devoured the case of a possible infanticide and truth was left as an afterthought.  It was scary to see the scenes of invasive, swarming media hordes, ridiculous accounts of half-truths and lies and debates over the supposed merits of the case by persons at all levels of society.<br><br>Equally appalling is the media's depiction as indifferent and uncomprehending of the technical information in the case.  I do wish more was made of the issue of religious prejudice in the case (the accused are Seven-Day Adventists).<br><br>Today these circuses have become common but that makes the lesson only more important.<br><br>Streep is excellent as usual, and this is the best I've ever seen Sam Neill. The Aussie accents get a bit thick at times but not incomprehensible.","user":"Cincy","rank":[22,25]},{"title":"I don't think a lot of people realise how important innocence is to innocent people.","rating":9,"date":"23 October 2015","review":"I am a Meryl Streep fan. I feel she is so versatile. This is just another character where she shows her versatility. I don't think the role of Lindy Chamberlain was an easy one, nor Michael Chamberlain for that matter. Meryl Streep and Sam Neil both did an INCREDIBLE job playing those roles.<br><br>This is a very sad story. I couldn't even imagine having to going through what Lindy had to go through after losing a baby. As if losing the baby wasn't enough. This movie shows the power of media. As soon as people start talking the whole story escalates. Everything went out of control. I find it so sad how everyone has to jump on the bandwagon, and this mom went to jail because of it. I know that with certain murder trials I have had quite a strong opinions of what I believe is true. So I guess this is exactly the same thing, part of our human nature.<br><br>I found the beginning of the movie a bit slow, but from the time Azaria was taken, I couldn't take my eye away from the screen. I was too emotionally involved. I found how they kept showing snippets of the general public to be very effective. It was interesting to see how everyone has their opinion, in the beginning silly things like the name Azaria means sacrifice in the wilderness, and eventually it all turns into a hate for Lindy. People celebrated when she got convicted. <br><br>This is a really sad, but great movie. The movie left me with a lot of things to think about, about human nature, media etc etc. Most definitely a tearjerker, but I think one of those are good every now and then. Knowing that this is based on a true story just makes it that much sadder...","user":"kellywid","rank":[6,6]}]