[{"title":"Hidelle and Jerk?","rating":8,"date":"2 June 2005","review":"On the Nutty Professor DVD extras, Jerry Lewis says that he had been \"enthralled with Jekyll and Hyde\" since he was a kid. So it's only logical that he'd long to create this \"Jekyll and Hyde comedy/musical\". Oddly, The Nutty Professor tends to be read as only a comedy, in the modern colloquial sense of that genre term, as \"a film that's supposed to make you laugh\", but there's much more to it than that, and more intended than that. Which is probably a good thing, because even though I didn't laugh out loud very frequently while watching The Nutty Professor, I did enjoy it quite a bit, despite the flaws.<br><br>Lewis--who also directs--plays Professor Julius Kelp, a bizarrely nerdy-but-stupid chemistry professor. He has a knack for conducting dangerous, unauthorized experiments in the presence of students. At the beginning of the film, he blows up his classroom yet again. On a later day, a football student who was denied permission to leave class early for football practice responds by stuffing Kelp into a shelf. Beautiful student Stella Purdy (Stella Stevens) feels sorry for Kelp and helps him unstuff himself. Stevens skillfully has the slightest gleam in her eye while doing this so that we can tell that Purdy has an attraction to the strange-looking professor.<br><br>Spurred on by the incident--with both the physical abuse and the physical attraction as motivators, Kelp decides to give himself a make over. He first tries his luck at the local gym. When that doesn't work out so well he puts his chemistry knowledge to use and hits upon a potion that produces a Jekyll &amp; Hyde transformation. The Nutty Professor has Kelp trying to balance the two personalities, with the expected calamitous but humorous results.<br><br>Although Lewis' Hyde character, \"Buddy Love\", is often said to be a skewering of his early comedy partner and pal Dean Martin, Lewis claims this wasn't the case. Both the nerd and the debonair but sublimely obnoxious hipster were supposedly amalgamations of different people Lewis had encountered over the years. Still, the similarities to Martin are difficult to deny; perhaps the character was partially a subconscious parody of Martin.<br><br>In any event, Love is entertaining to watch--he's something like a glossy trainwreck. Or maybe like a suave Satan in a silk suit. Lewis makes both characters complex in their differences from their respective stereotypes. Kelp is the stereotypical \"absent-minded professor\", only the absent-minded professor is usually a wiz at his academic subject. Lewis paints Kelp as primarily a wiz at being a slightly sympathetic dork, where his cockeyed chemistry successes are more accidental. Love is the stereotypical overbearing but attractive-to-the-women brute, yet Lewis is quick to imbue him with an odd combination of pathos and flair, so that Love ends up being both more fragile and more talented/intelligent.<br><br>Some of the material employing both characters is quite funny, but Lewis dwells on humor no more than a whole gamut of modes and emotions, from fairly serious horror material during the slightly overlong initial Jekyll/Hyde transformation to poignantly sad, touching scenes showing the crack in the Love armor. To an extent, the Jekyll/Hyde theme permeates the film in its shifting tones.<br><br>One of those modes that works surprisingly well is the musical material. Lewis hired the superb Les Brown and other great jazz musicians to provide songs. Les Brown's \"Band of Renown\" even makes an on screen appearance, performing a couple songs at a college dance. Lewis isn't the greatest singer, but he does a passable job with an alluring rendition of \"That Old Black Magic\". There's also a great version of \"Stella by Starlight\" in the background of a couple scenes.<br><br>The performances are quite good. Both Stevens and Del Moore, as Dr. Hamius R. Warfield, the college dean, easily hold their own next to Lewis, who does a remarkable job with the transformations. He's helped a lot by W. Wallace Kelley's cinematography. Kelley had a more than respectable, varied background, including camera experience on a couple Alfred Hitchcock films--To Catch A Thief (1955) and Vertigo (1958)--and Cecil B. DeMille's The Ten Commandments (1956). Kelley uses very subtle angle changes to make Kelp seem small and insignificant (aided by Lewis' physical contortions) while making Love seem like a big, macho guy.<br><br>The production design is also gorgeous. Lewis directs his crew to fill the film with bold, unusual color combinations--most overtly in the rainbow-colored paints on the lab floor during the first Jekyll/Hyde transformation, the nice overlaying of purples and reds in The Purple Pit club, and the great, unusual coordinations of Love's suits.<br><br>Whether you find The Nutty Professor hilarious or not, it has certainly been influential. Lewis considers this his best film. The American Film Institute placed The Nutty Professor at number ninety-nine on its list of the \"100 Funniest American Films\" (\"100 Years/100 Laughs\"). Both Adam Sandler and Jim Carrey have obviously been influenced by this film, as they have been by Lewis in general. And Andy Kaufman's disparate characters Latka Gravas (from 1978-1983's \"Taxi\") and Tony Clifton (a regular part of his live act) are direct parallels to Kelp and Love, even if Kaufman had other influences for those characters, as well.<br><br>The Nutty Professor is also a \"message\" film. The dual \"morals\" of the story, in addition to the less conspicuous subtexts dealing with personal identity, are to not be afraid to be your true self and to accept others for their true selves--to look deeper than the surface level.<br><br>Given such wide-ranging moods and aims, it's probably best to watch the film without genre expectations. That's not likely to make those averse to Lewis' shtick enjoy it any more, but for everyone else, The Nutty Professor is worth a look. It will surprise you with its diversity.","user":"BrandtSponseller","rank":[55,61]},{"title":"\"The Satanic Glow of Buddy Love's Lounge Suits\"","rating":10,"date":"13 August 2001","review":"One of the most depressing symptoms of the phenomenon of \"dumbing down\" is the drastically diminished time-frame of people's imagination and empathy, which function well enough microscopically and telescopically (at a range of, say, two or three hundred years, or the day before yesterday), but which cannot make the small leap back thirty or forty years. It is surely on such grounds that Jerry Lewis's masterpiece, \"The Nutty Professor\", might be dismissed as \"dated\" or be found \"unfunny\". Ever since I saw this movie as a child back in the late 60s it has haunted my imagination, and taken on a mythic existence that floats free of its actual content and context. On recently viewing it again on a borrowed videocassette I was startled by the internal organisation of the movie, by its pacing, and by the fact that Kelp's odious alter-ego, Buddy Love, who dominates the movie conceptually, is actually on screen for so little of its longish running-time. Since childhood I had cherished Buddy Love for his wit, glamour and self-assurance, which contrast so strongly (and therapeutically) with the painful gaucheness of Julius Kelp. Only now, as a mature adult, do I fully appreciate just how fundamentally unlikeable he is.<br><br>It is interesting to note that his allure works better at a distance: idolised by the hipster habitues of the Purple Pit, he is viewed with deep suspicion by Stella Purdy, even as he fascinates and intrigues her. \"The Nutty Professor\" is as firmly located in its milieu (the United States of the early 60s) as \"War And Peace\" is in its (Tsarist Russia at the time of the Napoleonic Wars); therefore, talk of \"datedness\" is beside the point. As an exact picture of life in 2001 the film is hopeless, but as a myth or parable, with Kelp, Buddy Love, Stella, et al., as archetypes, its power is undiminished. Jerry Lewis has never been happy playing it straight, and Buddy Love is as extreme and grotesque in his way as the hapless Kelp. He is also by no means entirely free of Kelp's flaws; his clumsiness during the slow dance with Stella shows how aspects of Kelp's personality continue to permeate his, and point to the incompleteness and volatility of the metamorphosis. Even his name, opportunistically extemporised for Stella's benefit, contains a deep irony, since, in spite of his superficial popularity and supreme sexual confidence, he is essentially friendless and incapable of deep feeling. If kindly Kelp is crippled by involuted intelligence, the sybaritic, self-seeking Buddy Love is stunted by affectlessness. (I am puzzled by the IMDb reviewer who found him insufficiently monstrous.)<br><br>Buddy Love's glittering lounge suits emit a satanic glow, and Jennifer, the caged mynah-bird, is a kind of familiar to Kelp, whose Faustian alchemy effects his painfully achieved and all-too-brief transformations into this eerie nightclub singer who generally only appears after nightfall (his one diurnal appearance being a spectacularly successful bid to persuade the otherwise pompous college Principal to sanction his headlining performance at the Senior Prom). In view of their acrimonious split it is tempting to view the Buddy Love persona as an acerbic commentary on Lewis's erstwhile partner Dean Martin, but the character also contains generous helpings of Frank Sinatra, and is perhaps best seen as a broad swipe at the Rat Pack. The wider message of the film is that kindness and intelligence (which Kelp already possesses) are far more important than the kind of shallow and flashy qualities that invest Buddy Love with his powerful but limited appeal (the rapid wearing-off of Kelp's formula, whose ingestion is attended by such agonising side-effects, shows that such a persona is literally unsustainable for any length of time).<br><br>Kelp's final speech at the Prom, when his appearance as Buddy Love has been cut catastrophically short, is indeed \"heart-wrenching\", but as both a summing-up of the main themes of the movie and a token of Kelp's increased self-knowledge, it is indispensable. This brilliant and disturbing film uses comedy as a vehicle to explore serious questions about the nature of identity. The Kelp who wins Stella's love is a better-integrated personality than either his earlier self or the grotesque alter-ego of Buddy Love, but a note of mild cynicism (defusing any hint of sentimentality in Kelp's Prom speech) is sounded when Stella pockets two phials of the formula put on sale by Kelp's formerly timid father (to whom he had entrusted it). (He had also entrusted it, of course, to his domineering mother, but it is perhaps significant to observe that the formula presumably only works with men.)","user":"hernebay","rank":[36,42]},{"title":"No Classic, but Lewis' Best","rating":2,"date":"2 July 2006","review":"I think that people can be divided into two groups: those that love Jerry Lewis movies, and those that hate them. There doesn't seem to be any middle ground.<br><br>Having said that, I am a confirmed hater of Jerry Lewis films. I find them sophomoric and excruciatingly bad, and each one has the same basic plot: Jerry Lewis' character is introduced, then he proceeds to stumble through the rest of the movie.<br><br>I'll make an exception for this film; it is the one winner out of all of Lewis' losers. The plot has been described in detail here, but it's basically the Jekyll-Hyde plot placed in a college circa 1963, where nerdy chemistry professor Jerry yearns for the love of one of his students (Stella Stevens). Lewis' transformation from Dr. Kelp to ultracool lounge lizard Buddy Love manages to be both campy and fascinating.<br><br>Great cinematography and good acting, plus a warm message and the luscious Stella Stevens make for a fine movie experience. As far as I am concerned, you can throw away all of Lewis' other movies and keep this one...it's a winner.","user":"mrb1980","rank":[7,7]}]