[{"title":"secrets and lies, Ozu style","rating":10,"date":"5 December 2011","review":"A fairly dark story for Ozu, but you know what? I think that shows Ozu can do just a little different than what everyone expects of him. The ingredients of this stuff isn't just melodrama, it's soap opera - disappointed father, absentee mother, an abortion, and a closed off young woman who doesn't know what to do with herself, certainly not around the deadbeat man in her life. But it's how Ozu goes about - I felt deeply for this family since it builds from a place that just feels real - and awkward in its reality. I think in many of Ozu's films the kind of nice-ness people have to one another (I don't know if this is just in Japan or just elsewhere) is a cover for what they really think and feel.<br><br>A lot of what is in the early parts of Ozu films are mundane, just pleasantries, making tea, talking some minor gossip or 'how was your day' stuff. But then it goes into some areas that are much darker, or just can't be seen by the surface of the rituals of Japanese familial ties and relations. And in this film Ozu really made it a point that this family is torn by secrets and lies, and it's so under the surface that it becomes palpable. And there's a noirish quality here that works interestingly, as the sister Akika stews away with her secret in a bar, and doesn't even know the bigger secret about her birthright (and a tinny song Ozu plays often in the film, even in the most tragic scenes, adds a whole other level of the familiar but sadness).<br><br>I was touched by Tokyo Twilight, and it wasn't a sudden effect - it came over me gradually, like an old friend coming by and then finding out through a long and staggering conversation what hard times there have been. It's tragedy in full dimensions","user":"Quinoa1984","rank":[30,30]},{"title":"Another masterpiece by Ozu","rating":10,"date":"30 May 2011","review":"This is my fifth Ozu film. And as I watch more of his movies my respect for his genius keeps on growing. He is more avant-garde than any other film maker I have seen.<br><br>While others use wars as backdrop to create a more touching drama, wars just find a small reference in his films even if his characters have lived through them. While other use death as a dramatic pivot for the whole movie, Ozu skips it altogether. People do die in his films, but they do it off screen. There are no famous last dialogs about life or last moments.<br><br>But despite these things or maybe because of these things, his movies are more poignant and touching than any other I have seen. I don't really cry while watching his movies. Instead they leave me in a strange tranquil state of mind, wistfully smiling.<br><br>Another thing to note is that while his movies reveal more about Japanese culture than any other movies I have seen, at the same time they are very universal.<br><br>If you haven't seen any movie by Yasujiro Ozu, I recommend starting with Tokyo Story or Good Morning. This one seems much longer as it takes some time to start and is devoid of humor. This is not meant as a criticism, Tokyo Twilight is still an amazing experience. But I think an average viewer should start with something else.","user":"princebansal1982","rank":[36,37]},{"title":"Ozu's darkest hour, a masterpiece","rating":13,"date":"13 December 2003","review":"A deeply, uncharacteristically dark film, even among other \"dark\" Ozu films (i.e. A HEN IN THE WIND, EARLY SPRING) that may require a theatrical setting for the viewer to be fully absorbed in the strange, dark textures of the world Ozu presents. I myself was pretty alienated for the first 1/2 hour or so until the wintry chill of the mise-en-scene (brilliantly suggested in the slightly hunched-over postures of the characters) found its way into me instead of keeping me at arm's length. And from there this story builds in unwavering intensity as it follows a family on a slow slide into dissolution: a passive, judgmental patriarch (played by Chisyu Ryu, subverting his gently accepting persona in a way that is shocking), his elder daughter, a divorcee with a single child (Setsuko Hara, playing brilliantly against type -- who'd have thought the sweetest lady in '50s Japan had such an evil scowl?), and his younger daughter (Ineko Arima, a revelation), secretly pregnant and searching for her boyfriend, get a major shakeup when their absent mother, who the father had told them was long dead, re-enters their lives. Ozu's vision of post-war Japan and how the sins of one generation get passed on to the next, illustrated brilliantly by a series of parallels drawn sensitively between characters, manages to be both compassionate and scathing -- even a seemingly cop-out happy denouement is embedded with a poison pill. A masterpiece, without question, one that throws all of Ozu's depictions of modern society in a beautifully devastating new light.","user":"alsolikelife","rank":[74,83]}]