[{"title":"Memorable","rating":8,"date":"30 September 2004","review":"The film sticks tenaciously in the memory, in a way that slick studio productions often fail to do.<br><br>Visually, a fair bit of the film is a pastiche of German propaganda newsreels, or borrows from that library of pictures. This augments the feeling of realism and makes it an even bigger shock to see German troops marching through London, or relaxing off-duty, taking in the sights and admiring the women. No studio film would dare to take such an approach. And where did they find so much genuine-looking equipment? No studio film-researcher would ever be that scrupulous about accuracy.<br><br>The sound-recording is dreadful and it would benefit from one of those clever clean-up jobs that are available these days. But what is said, and how it's said, are unforgettable. The wrong-headed justifications of Fascism that pepper this film sound like real people's words and they're spoken by what clearly are real people, who are taking a little time off from their real jobs to appear in the film. For instance, the fat, middle-aged, bureaucratic bully who voices many of the arguments has to have been in real life a school teacher or a bank manager: he looks and sounds the part in a way that studio actors working from a polished script could never manage.<br><br>The ending is forced, but only because you feel that the film would be endless without a forced ending. Although a lot of things take place that are genuinely shocking (I won't list them as I'd have to announce spoilers), the point of the film isn't to relate a narrative that has a defined beginning, middle and end. The point is to make you feel that this is all real and make you wonder what your response would have been if the Nazis had started running your country.","user":"alan-morton","rank":[24,24]},{"title":"Awesome pseudo-documentary footage","rating":9,"date":"30 August 1999","review":"Ignore Leonard Maltin's comments - he's clearly missed the point of the film. The \"Brits\" don't keep a stiff upper lip, and the cooperation between them and the Nazis is shocking. The documentary footage of Nazi soldiers parading around London etc appears ever so real. The awesome photography makes up for the weak plot and main character. A must-see.<br><br>The Battle of Algiers is another such film which mixes documentary with drama.","user":"Mark-343","rank":[22,22]},{"title":"What Would You Do?","rating":9,"date":"5 September 1999","review":"This film was shown recently as part of the Channel 4 War Weekend. I found it to be well made, and contained some very powerful images, of the German forces in occupation.<br><br>My only reservation is that I found it difficult to track the passage of time within the film.<br><br>The film deals with a woman, who is relocated to London, following Partisan activity at her home village. She becomes a Collaborator, not particularly from choice, but from circumstance. She is faced with a simple choice: work for the state, or don't eat. The film presents the Partisans as terrorists, whose methods differ little from the Nazis, although their objectives are purer. The film certainly made me think more about the life of the civilian in occupied territory. You could become a partisan, and  act as a terrorist, or work for the forces of occupation, either directly, or indirectly. Or you could starve.<br><br>Well, what would you do?","user":"Facade","rank":[18,19]}]