[{"title":"What great memories!","rating":8,"date":"13 December 1999","review":"Well I just discovered IMDb from my twin sister, Carol.  Carol and I played the \"Fat Identical Twin\" in Midnight Madness.  We didn't have to prepare much for the fat part, that came with us, and well and the rest was natural. ;)   It was our first major film role and we had a blast making it.  We were 21 at the time and lived about an hour and half from The Disney Studio in Burbank and the Hollywood, California area.  We grew up in front of the TV and probably some of the first generation of latch-key-kids.  Twenty years later, we still have lots of fun and are still 'heavy' or what ever is politically correct these days.  We don't pursue acting any more but have been know to 'come back' when the right opportunity arrives.  Carol is a Chiropractor in our home town of Southern California and I am in the Information Technology field in Georgia.<br><br>I maybe bias, but I thought the film was cute, clean and fun.  We knew it wasn't a master piece or an Oscar nominee, however, it was and still is a movie the whole family can watch and have fun together.  It's nice not to have to worry if your young children can watch a video without having to fast forward certain parts.  And no one was more exited when it was released on video as Carol and I were.  Carol found it at Kmart for $6.99!  Now that's an inexpensive way to capture one's memories and share it with others.<br><br>Sincerely, Betsy Lynn and Carol Gwynn; The Thompson Twins","user":"peace2us","rank":[56,63]},{"title":"A Classic Guilty Pleasure","rating":10,"date":"19 May 2002","review":"They don't make movies like this anymore  though some may say that's a good thing.  Although this was amongst the first of Disney's PG rated films, it has more of the feel of the G films their studio turned out in the70s (i.e. \"Freaky Friday,\" \"The World's Greatest Athlete\") than the PG films that came out in the early 80s (i.e. \"Watcher in the Woods,\" \"Tron,\" \"Something Wicked This Way Comes\"). Because of Disney's backing, \"Midnight Madness\" obviously had a large budget.  A huge cast and a ton of diverse locations go to show that.  But zaniness, a madcap scavenger hunt, and spectacular visual style weren't enough to save the film from being an enormous flop...  A failure at the box office, most of us were introduced to the film on HBO in the early 80s, back in the days when the same films would be shown 29 times a week (Oh, wait  they still do that!).  Essentially HBO did for this film what CBS did for \"The Wizard of Oz\"  they created an enormous cult audience for a sugary-sweet mega-flop....<br><br>The biggest problem that makes this a \"bad\" film is that there's too many characters and very few of them are fleshed out  Eddie Deezen's \"squad\" don't even have names!  The blue team, although they're the villains, are the most endearing and have the most work put into their characters (with the exception of the girl, who can't act &amp; doesn't have enough to do). Harold, perfectly played to the hilt by Stephen Furst, is really the only one whose character is fully realized in the film.  The other standout character is goof-off Melio, played with tons of charm by now-director Andy Tennant.  Although then-Dr. Pepper spokesman David Naughton was supposed to be the star, his character often comes off obnoxious, particularly when pitted against his brother Adam, Michael J. Fox.  While everyone has favorite characters, I don't think anyone who loves the movie could disagree that Furst and Fox are the only two characters that you really learn anything about.<br><br>Despite the film's many flaws and bad actors (most of whom fell off the face of the earth after this movie) it still works because the actors appeared to be having fun -- and fun on the set equals fun on the screen.  Come on, what college jock doesn't dream of floating around in a beer vat and what zoftig girl doesn't dream of stealing the show at the local discotech... er... I guess it would be at a rave nowadays...  Campy, squeaky-clean fun for anyone who was young in the 70s &amp; 80s, it's only fitting that this has finally gotten the massive video release that it deserves.  But where the hell's the widescreen DVD release with the commentary, trailer and the full version of the song that plays in the disco?","user":"TelevisionJunkie","rank":[18,19]},{"title":"Midnight Madness . . . is gonna get to you!","rating":7,"date":"27 July 2004","review":"Somewhere in the dark recesses of my brain cells a song plays in my head. I can't forget it no matter how hard I try. It's MIDNIGHT MADNESS and it's gonna get to you! Wish i could find a copy of this on a 45rpm record. Five disparate teams head out one night in L.A. for a scavenger hunt for clues instead of physical objects. An unkempt game-master with two gorgeous assistants is the mastermind of all this insanity that's about to be unleashed on L.A. All the teams are stereotypes (this movie being from 1980, before political correctness screwed everything up): the \"good guys\", the \"nerds\" led by Eddie Deezen, the dumb beer-loving \"jocks\", the \"we-don't-need-a-man-type ladies\", especially the redhead. The giggling twins are a scream, too. And finally, the \"bad guys\" with Stephen Furst as the leader. Furst is hilarious as the overweight slob Harold, whose attempt to use a computer to decipher the various clues leads to a gooey mess. Movies like this aren't made anymore. These days, movies have to have an \"edginess\" to them with some dark characters and other nonsense. Go back to the days when the \"good guys\" led by David Naughton were still good and not hopelessly conflicted. So dump all serious pretensions and go back to 1980. It's MIDNIGHT MADNESS . . .","user":"InvasionofPALs","rank":[9,9]}]