[{"title":"A decent Stalker Movie","rating":7,"date":"25 December 2011","review":"I first saw this movie when it first came out and I was still in the Army. I enjoyed it then, probably because of Morgan Fairchild but recently saw it again and decided to comment on it, especially after I read some peoples negative reviews.<br><br>This movie in my opinion delivers with its plot. There is no doubt that Morgan is being stalked and there is no doubt that the stalker has every intention of getting to Morgan. I thought Morgan Fairchild was very good in this movie, especially when you consider that she was a lot more of an inexperienced actress at the time this movie was made. Andrew Stevens was very good as the stalker and the rest of the cast was fine.<br><br>You could certainly remake this movie with a bigger budget and get a very good movie. This movie is not a classic but its certainly a watchable movie. Watching this movie you will get into the plot and you will be wondering what the stalker is going to do next.","user":"jameswilliams784","rank":[14,16]},{"title":"A stimulating and thought-provoking performance by Morgan Fairchild","rating":15,"date":"15 January 2007","review":"Some people may snicker at this film, but back in the heady days of 1982 we just weren't as sophisticated about the celebrity stalker phenomenon as we are today. We didn't have to be, it was a more gracious and civilized time to live and, I might add, a golden era for television.<br><br>But dark days were just around the corner and those of us in the public eye owe the lovely Ms. Fairchild quite a debt for her eye-opening work on this film. I myself found it particularly enlightening when she demonstrated the dangers of being stalked while showering, swimming nude or taking a bubble bath while stroking one's silky thighs.<br><br>I'd also like to say that though some philistines may have nominated Colleen Camp for a Golden Raspberry award, I thought she was fantastic in her role, though we could have seen more of her.","user":"perpwalk","rank":[12,14]},{"title":"Campy Formula Movie. Lots of unintentional laughs.","rating":29,"date":"29 December 1998","review":"This has always been one of my favorite \"B-Movies\" that was made with home video and cable in mind (Even though it was a theatrical release, back in the days B-Movies got theatrical runs)  Jamie (Morgan Fairchild), a beautiful anchor-woman is the target of a stalker (Andrew Stevens)  That's about it for the plot.  The film has some truly decent moments.  I like the scene where Stevens apologizes for his initial stalkings to a receptive Jamie (He even gives her flowers!).  Of course, the signature scene is Stevens spying on Morgan Fairchild taking a bath.  The scene works for the movie, and of course, the idea of a nude Morgan Fairchild walking about is one of the key reasons why this film was made.  But for the most part, this film is dizzlingly hokey.  There is a lot of unintentional humor here.  My favorite bit is when Jamie reads the news off the teleprompter, and all of the sudden, the text in the teleprompter becomes a nasty note from Andrew Stevens.  She accidently reads the first few lines of the nasty, naughty note in the same tone of voice she uses to read the news.  She realizes what she has done, and comes close to giving a Homer Simpson \"Dohhh!\"","user":"boris-26","rank":[12,15]}]