[{"title":"A nightmarish journey by multi-coloured lantern lights...","rating":10,"date":"28 June 2007","review":"Derided and ridiculed as just another 80's slice em' and dice em' gore-fest, this film has been criminally overlooked and underrated for over twenty years. What the vast majority have seemed to miss is the subtlety and richness of a beautifully lensed film which provides one of the most chilling atmospheres to a mainstream horror movie.<br><br>Anthony Perkins showcases just how adept he is both in front of and behind the camera in his directorial debut, and it is a crying shame that we didn't get to enjoy any further nightmarish visions. Re-watch this work of genius and see for yourselves. <br><br>10/10","user":"markbeynon","rank":[51,57]},{"title":"Possible Spoilers","rating":8,"date":"3 July 2005","review":"The other negative reviews seem a bit harsh to me. Anyone who enjoyed the first sequel or Anthony Perkins' performance in either of the first two films will have fun watching the third installment. Not many films compare to the Hitchcock original and the sequels to PSYCHO are no exception. But anytime Anthony Perkins takes the screen as the matricidal Bates we the audience are going to be in for a treat.<br><br>Slasher enthusiasts and Norman Bates fans can rejoice as Perkins brings our favorite motel owner into the 80's. While there isn't quite enough gore for PSYCHO 3 to be considered a true slasher film, Perkins, as director, makes a bold choice to bring Norman and his terrible habits into the 80's while maintaining the charming weirdness in character and setting of the original and even its first sequel. The three films definitely feel like they take place in the same world and the returning characters (or relatives of deceased former characters) help keep the story arc flowing with a consistent feel.<br><br>The plot this time revolves around a nun, Maureen Coyle, who gives up her vows to God and finds herself hitching a ride with sleazy musician Duane Duke, played by the always entertaining Jeff Fahey. We all know which motel they're going to end up at and it isn't long before Norman meets Maureen in the diner and notices her initials, the same as Marion Crane's, on her suitcase. It's psycho love at first sight.<br><br>Meanwhile, Duke gets a job working at The Bates Motel front desk despite Norman's obvious disliking of the greasy loner. Add to the mix a bunch of rowdy football fans and what you'll eventually get is the largest body count in a PSYCHO film yet and since.<br><br>The gore, although minimal, is effective and a severed hand gag will have you laughing even though your stomach is turning. I'll never look at ice cubes the same way. Perkins also takes a stab at a shower-scene-type killing within a phone booth. It's creepy and violent like the shower sequence but, admittedly, loses some of its edge in the day and age of cellphones.<br><br>Filled with religious and sexual metaphors and ripe with sardonic humor and dark sarcasm, PSYCHO 3 is just plain fun to watch. Anyone in love with Perkins' betrayal as the truly loony Norman Bates needs to give the movie another chance. To say it doesn't hold up to the original is moot since so few films (in any genre) hold up to Hitchcock's masterpiece. Try to forget its untouchable origins and enjoy the flick for what it is a better than average 80's horror movie featuring the overwhelming presence of one of film history's greatest on screen icons, played by the only man who could and ever should, Anthony Perkins.","user":"kane-3","rank":[26,28]},{"title":"Good with a moment of genius","rating":28,"date":"28 October 2005","review":"Psycho 3 opens well enough with an incident to forever change the life of a distressed Maureen Coyle, and then ruins the moment with an unnecessary, not to mention unwanted, voice-over narration. Fortunately, the narration is isolated to the beginning of the film.<br><br>Maureen is one of a number of characters destined to find the Bates motel, and the film begins slowly drifting into a sequel formula where typical victims (that reminded me of F13 fodder) come into Norman's path to be slaughtered.<br><br>But nevermind that. Psycho 3 still understands the strength of this series lay in its unmasked killer, Norman Bates. And one of the more fascinating aspects of the film surrounds Norman and Maureen who has the same initials of that unfortunate girl from twenty years ago, Marion Crane. \"Cabin one?!\" an unnerved Norman says to his motel clerk, horrified that the circumstances today are reflecting those surrounding Marion from so long ago. And we, the viewers, note that the film is somewhat mirroring the structure of the original film - how Marion met her fate so early.<br><br>Now the suspense comes from Norman's knowledge of his crimes, and knowledge of his compulsions, his sincere desire to prevent a repeat outing with the knife, and the audience knows Mother, whom doesn't like young girls in her motel, is up at the house. It's fascinating to watch how fear in Norman soul as the fates seem to unfold leading Maureen to the same end as Marion as she turns the water on and gets into the tub.<br><br>SPOILER - And the moment of genius comes as \"mother\" snaps the shower curtain back to find Maureen in a bathtub of red water. And, ironically, the intended murder becomes a rescue from suicide. Then our disturbed, psychotic, Norman Bates becomes both a hero and guide to the suicidal girl, which needless to say, shakes Norman's world. As they talk in the hospital (later to share intimate moments in the motel) we see the sorrow in Norman, as he wishes for atonement by saving this girl, and that he genuinely cares for her. It places this recluse in a strange new territory, a territory that inspires him to try to fight his inner demons, to protect Maureen, and to fight against mother's compulsions to kill. END SPOILER.<br><br>I never cease to be amazed at how sympathetic Norman Bates is even after knowing full well that he is a killer, even after seeing him murder, especially in this film when he's fighting so hard against what he is. We fear him, and yet pity him.<br><br>As the film gears up for its climax, we watch as Duane has stumbled upon Norman's secret and attempts to blackmail him. And we're appalled that a perfectly sane (yet malicious) man would try to take advantage of another man who makes an honest struggles to stay himself. Norman is the killer, and yet Duane is the villain. I found myself leaning forward in my chair, hoping Duane would get more than he bargained for. I'd of been the little devil on Norman's shoulder saying, \"Kill him. This one's justified.\" The tributes to the original, for the most part, did not draw attention to themselves as Psycho 2's did (thank you, Anthony Perkins.) I appreciated the return to the taxidermy aspect of Bates' character, the presence of candy corn that he was always munching on, Norman's reaction to discovering a body (identical to Psycho), and the smile at the end of the film that appropriately mirrored Hitchcock's ending.<br><br>Although the narrative gets clumsy in places, I appreciated Psycho 3 for its faithful continuation of the Psycho series. Most of all though, in a genre that's content to regurgitate the killer's history and theories why he kills in more and more boring detail and call it a \"plot\", Psycho 2 and 3 gives Norman some genuinely new and original scenarios. In the Psycho sequels, we can see Norman grow and evolve, and feel the satisfaction that a new chapter had, indeed, been written.<br><br>Then again, Psycho is perhaps the only slasher franchises that can continue to evolve because Norman Bates is a fully-developed, fascinatingly complex, and highly sympathetic character. He is the most mesmerizing killer to grace the silver screen in cinema history.<br><br>Needless to say, neither Psycho 2 nor Psycho 3 will escape from the original's shadow. Even with the drop in craftsmanship, I was content with another stay at the Bates motel. What can I say? Norman is that much fun to hang around.","user":"jaywolfenstien","rank":[24,27]}]