[{"title":"Perhaps the 30th-best Vietnam war-movie in the world..","rating":8,"date":"3 June 2008","review":"Although I haven't seen every Vietnam war-movie in the world yet, this does rank a bit above average, based on pure entertainment-value alone. <br><br>I was fortunate enough to find this non-classic movie on a fairly cheap Scandinavian DVD-release, and immediately had to buy it (based on other good experiences with movies starring William Katt, Wayne Crawford and Reb Brown), and when I finally decided to see it - after three years of sitting on the shelf - I wasn't disappointed one bit. <br><br>The story is somewhat as follows: When the American soldiers went home from Viet Nam (that's how they spell it) in 1969, not everyone got out in time. The highly skilled soldier Steve Shepard aka \"White Ghost\" (William Katt) has lived out in the jungle for 15 years, and has even made a nice tree-house for himself and his Asian girlfriend Thi (Rosalind Chao), who is pregnant with his child. After all this time, the Americans discover that he's still out there, and decide to send out a team of mercenaries to finally rescue him and learn what he knows from his stay in the jungle for all those years - he had gathered a large amount of dead American soldier's dog-tags, and now their families will finally know what happened to their missing relatives. <br><br>But something goes wrong, and the commanding officer Major Cross (Reb Brown) unfortunately sends off a team led by a grudge-holding scumbag, Captain Walker (Wayne Crawford), who doesn't intend to get Shepard back alive. Now it is up to Cross to get him out of there himself, and up to Shepard to both keep himself and his girlfriend alive, not only from the evil gang of mercenaries, but also from the equally evil Vietnamese soldiers who are right on their tails.<br><br>Now, this movie is really fantastic, it keeps your interest from the very first frame, and has enough interesting ideas and scenes to never let up. The violence isn't as extreme like the other reviewers suggested, but sufficient to keep both action- and gore-hounds satisfied. Lots of shooting, explosions, and even a car-chase in the jungle is always nice! <br><br>Bonus: One of the bad guys look eerily like Jesse Ventura (as he did in \"Predator\"), pretty sure his name's Karl Johnson, but not 100% certain. Also, there were many cool boobie-traps in the jungle, just like in \"First Blood\".<br><br>Recommended only for those who either enjoy all sorts of Vietnam war-movies, or just for those who like extreme action-scenes.. which, actually becomes quite humorous, especially when watching it with friends.","user":"KnatLouie","rank":[6,8]},{"title":"On DVD after all","rating":4,"date":"4 June 2004","review":"Well, Alexander, this movie has been released on DVD after all. But it is hard to understand why.<br><br>It's very violent, but entertaining in some bizarre kind of way. The main character hardly says anything, but runs around in the jungle, like the white ghost he is, and kills people. On the whole there are a lot of running people in the movie: the \"ghost\", mercenaries, the vietnamese soldiers and it's hard sometimes to know who's who.<br><br>No similarities in other respects, the movie ends with a scene quite similar to that scene in \"Platoon\" where Sgt. Elias gets killed and the guys sit in the helicopter watching and trying to help.","user":"muckedick","rank":[3,4]},{"title":"Not bad action fare with some ghost- I mean some ghastly violence","rating":7,"date":"24 February 2016","review":"Although the worrying start will have you saying \"What the?\", this Vietnam yarn (nothing more) quickly redeems itself, and becomes an involving film, where ex vet Katt, below par, is still in Vietnam, where he's so often shacks up with girlfriend Chao. It's now 1987, and an elite team of mercenaries, are ordered by the Pentagon to find and eliminate Katt, where a few complications, arise. The Commander of this squad really has a hard on for Katt, who wouldn't mind seeing his arch enemy squeal before he dies. He's reasons mirror that in the same scenario of back story, done in Heated Vengeance. One of the Commander's squad (Hewitt) who's very much against it, sides with Katt, where our wrong cast lead must take on the elite force and Charlie who come out like ants. They have kidnapped Chao, and for Katt, his work is definitely cut out for him, where it becomes quite of a heavy mission itself. White Ghost has some gutsy moments, among explosions, close calls, and a little love making. The near mine trip scene is tense. It's start has Katt, just roaming through Vietnam, with the ever present Charlie about, his long curly hair, just gleamimg in the daylight, although he's just stepped off the make up truck, though I wouldn't really joke about that. He doesn't say much, but is just sheer wrong for the part, who like me, will have you thinking that, all the way through. That's just the vibe, you'll get. But Katt went pretty much out of action, after The Greatest American Hero, so he pretty much needed the work, discounting Baby and House. On the whole WG isn't a bad Nam' actioner at all, with good plotting, but too an admirable lead up/finale, when an old Vet buddy, goes into save him. The one major fallback here, sadly is Katt. By the way, White Ghost is a term for a Vet who disappeared off the radar, believed to be dead, or not, where in Katt's case, he's pretty much alive.","user":"videorama-759-859391","rank":[1,1]}]