[{"title":"PAPER MOON refuses to cry.","rating":14,"date":"14 September 2003","review":"PAPER MOON is one of those films which refuses to age or become dated, because, as director Peter Bogdanovich claims, it was dated when it was released.  It has the look and presence of a film from the Golden Thirties with the panache and style that could only come from the Golden Seventies. That extraordinary decade when the Old Hollywood Studio Machine was being rapidly replaced by the rise of the Artist Filmmaker, who were young, eager and just out of film school.  A wonderful period of flux when anything could and did happen.  A seminal period in filmmaking where new artists were making important new films, which would change Hollywood forever. PAPER MOON is outwardly a period road picture set in the mid 30s, about a traveling man named Moze Pray (Ryan O'Neil) who will play any angle if it means a couple of extra dollars in his pocket.  As the story opens he agrees to escort the daughter of a now deceased lover to her Aunt in Missouri. Slick Moze quickly meets his match in the half pint tough little Addie Loggins (Ryan's real life daughter Tatum in her first role).  No sentimental tear jerker here, this is a great story which refuses to go down the obvious road of a father reunited with his lost little girl; we aren't even sure it's really his daughter.  Little Addie is tough as nails at every turn and a whole lot more savvy than Moze could ever be.  At turn after turn she will outsmart and outmaneuver Moze in a way which is a sheer delight to watch. Tatum O'Neil gives an Oscar caliber performance as little Addie, but why she was given a Best Supporting Actress award and not nominated for the Best Actress category, one can only wonder.  Madeline Kahn (What's Up Doc, Blazing Saddles), in her second film ever also delivers the goods as Miss Trixie Delight who meets up with the pair and sees her own angle. Everyone is playing some angle in this film and we get to enjoy every minute of it.<br><br>Shot completely on locations in Kansas and Missouri PAPER MOON sparkles with a richness only capable in black and white.  Cinematographer Lazlo Kovacs is a great camera artist and never better than PAPER MOON where he uses black and white, deep focus and those great long takes to its best advantage. To the untrained eye it will just appear very sharp, but look closely at each frame and notice that everything is in tack sharp focus from the closest object to far in the distance.  This deep focus is very difficult to achieve correctly, especially in the night shots, but Kovacs does it so well it is seamless.  Watch for the train station sequence where even the children playing in the background are razor sharp.  This is a look that can only be achieved using black and white to its fullest potential.  New filmmakers take notice.  This is how it's supposed to be done. All this cinematic brilliance would be wasted were it not for the wonderful direction of Bogdanovich. In this his third film, he proves that he is a consummate filmmaker who knows how to move the actors and camera in perfect concert.  His craftsmanship of each scene is unmistakable as he brings a fresh and very new approach using Hollywood tricks which are decades old. A lesser director might have used process shots and sets to tell the story, but not Bogdanovich.  He shot the entire film in real locations to give it the look and feel of a real thirties road picture.  You can almost smell the wide plains and feel the dust as it comes up to slap you in the face. Notice too how he never resorts to sentimentality to move the story along, it is told razor sharp and without tears.  This, never more apparent than the final sequence where he pays off the film in grand style.<br><br>There is only one thing about this film which still baffles me.  Why in the night time hotel sequence toward the end of the film were electric lights everywhere but inside the hotel lobby, which was lit entirely with kerosine lamps? Was it to give the look and feel of the period, or did the real location use them? Small point, but interesting. If, like myself, the last time you saw PAPER MOON was when it was released in 1973, see it again on DVD and be delighted all over again.  The DVD transfer is marvelous and only serves to heighten its visual appeal.  If you have only seen PAPER MOON on broadcast TV, do yourself a favor and see the new DVD for a pleasant surprise.  Without the obligatory broadcast TV commercials, pan and scan and dialogue cuts this will appear like a new film seen the way it was supposed to be seen.  And if you have NEVER seen PAPER MOON and harbor some prejudice against black and white films, please see this film.  Any preconceived notions against this format will quickly dissolve as it takes you along for a rich ride with Addie and Moze in the only format it could - glorious black and white.","user":"ethor@inreach.com","rank":[80,89]},{"title":"A terrific film on all levels","rating":10,"date":"8 February 2002","review":"Paper Moon has to be one of the finest pieces of American cinema to grace the 70's. Bogdanovich's direction bares a strong resemblance to The Last Picture Show, but overall this film is much more satisfying and enjoyable. The Black and White photography gives the film a nostalgic beauty that perfectly complements the Depression-era it attempts to recreate. Also notable is the charming Jazz-based score, with a wonderful opening title track, reinforcing the film's charm. As good as the story, direction and music are however, the true stars of the film are the O'Neal twosome. Both bring forth their best performances of their careers, and share a chemistry on screen that only a father and daughter could. Ryan O'Neal brings forth a subtle charm as the wise-talking, but inept hustler Moses Pray. Tatum however, even upstages her father with what has to be the best youth performance in history. She is funny and moving when need be, and always charming, eliciting laughs many times based solely on her malleable facial expressions. Her show-stopping five minute shot, no matter how long it took to film, proves just how fully Tatum was able to embody little Addie Pray. The movie is always entertaining, with never a dull spot, with a strong supporting performance by Madeline Kahn to help keep things rolling during the middle. This is a true classic that should be seen by people of all ages, I can't recommend it enough!","user":"grolt","rank":[75,84]},{"title":"best father-daughter movie ever made","rating":9,"date":"29 December 2002","review":"Paper Moon is one hell of a movie. I saw this film as a 10 year old in 1973 and loved it then as I do now at 39. Set in Depression era Kansas, it is story of the relationship between Addie, a smart talking 7 year old, and Moses, a bible selling con man who might be her father. The on screen chemistry between Ryan and Tatum O'Neal is fantastic. Madeline Kahn is great as a side show floosey they pick up along the way and she almost steals the show! Filmed in Kansas and Missouri, director Peter Bogdonavich used local people in cameo roles which adds to the authentic feel of the film. Also to the director's credit, this film may be one the best to portray 1930's America. All in all, Paper Moon is full of great characters and a fine story line. On a personal note, I saw this film with my 90 year old grandmother and she laughed throughout the film and said it was one the best films she ever saw. That's not a bad recomendation coming from someone born in 1883!","user":"keithmanies","rank":[53,62]}]