[{"title":"After a Half-Century, Still a Joy!","rating":8,"date":"8 August 2003","review":"THE THING FROM ANOTHER WORLD...the title conjures up lurid images from the countless 'B' SciFi flicks of the 50s, but as many SF, Howard Hawks, and Classic Cinema fans can attest, this is no sleazy schlockfest, but one of the most entertaining and exciting films ever made, by one of Hollywood's greatest directors.<br><br>Yes, the credits list Christian Nyby as director, but Howard Hawks was on the set nearly every day, each scene has elements of style unique to Hawks, alone, and even the cast members, when interviewed, have said Hawks ran the entire show. Perhaps, as Science Fiction films were not highly regarded in the early 50s, he felt his reputation might suffer if he acknowledged his contribution; perhaps he thought it might help Nyby's credentials if he were given credit for this masterfully crafted tale. Who knows? But rest assured...this IS a Howard Hawks film! <br><br>The story, based on John Campbell's short story, 'Who Goes There?', is a nifty, claustrophobic tale of a group of soldiers and scientists in the Arctic, discovering a giant 'flying saucer' under the ice. When the ship blows up during the excavation, the 'pilot', a huge green chlorophyll-based humanoid (played by a young James Arness), is recovered, frozen in a block of ice. Bringing the ice-encased figure back to the base, it is then accidentally thawed out...and all Hell brakes loose!<br><br>While the cast lacks big-name stars, each actor is wonderful, delivering wryly funny Hawks' dialogue at a breakneck pace. The military commander, Capt. Hendry (Kenneth Tobey), is a no-nonsense boss, respected and lovingly chided by his men, led by Dewey Martin, who constantly try to 'set him up' with a pretty scientist he had 'struck out' with, on leave in Anchorage (Margaret Sheridan). She is now at the base, assisting brilliant yet blissfully naive Dr. Arthur Carrington (Robert Cornthwaite), who, naturally, assumes 'the Thing' is only homicidal because he is misunderstood! As the truly frightening potential of the creature reveals itself, it becomes a race against time to destroy it, before it kills everyone, leaves the base, and reproduces countless seedlings of itself to conquer the world!<br><br>The FX are low-budget, but very effective, as is the extensive use of light and shadow, sound effects, and an eerie Dimitri Tiomkin score. Unlike the benevolent 'visitors' of THE DAY THE EARTH STOOD STILL, this alien doesn't warn of total annihilation as the final option, should we carry our nuclear weapons into space; it's ONLY agenda is to kill!<br><br>This is a truly amazing film, one that has aged little, and is every bit as enjoyable today as when it was released.<br><br>As the tag line to the film warns us, \"Look to the sky...\"","user":"cariart","rank":[88,94]},{"title":"Keep Watching the Skies!","rating":10,"date":"27 October 2002","review":"One of the best science fiction pictures from the fifties, and one that helped define the genre, The Thing holds up remarkably well today. There's still considerable debate over whether producer Howard Hawks actually directed the film or credited director(and former editor) Christian Nyby. It's a Hawks production either way, and one of his best. The story of an alien invasion near the arctic circle, it builds slowly, relying heavily on the excellent, slangy dialogue of Charles Lederer, and the casual, jokey relationships between the various characters. This is lean, solid, old-fashioned moviemaking. There's not a wasted moment in this one. Hollywood in the studio era was especially good with stories of isolation, and this one's about as isolated as it gets. The monster is rarely seen, as we catch him only in horrifying glimpses, as the characters in the movie do. There's a standard brains versus brawn subtext in the film, but it's not emphasized to the movie's detriment. That the cast consists mostly of relative unknowns give the picture an almost documentary feeling at times, as if one were watching an actual event. Dimitri Tiomkin's spooky score helps spur the action on. This is a fine piece of commercial film-making, with everyone doing his job, and no \"star turns\". Nobody gets the upper hand here, not the actors, director, writer, cinematographer or alien. Everything comes together in the end. This is a perfect movie of its kind.","user":"telegonus","rank":[74,82]},{"title":"Will Mankind Prevail? Or will we all become produce?","rating":8,"date":"8 December 2003","review":"This fast paced thriller set in an Arctic research outpost has the familiar elements for the 1950's sci-fi movie: a hideous monster unleashed upon mankind, the U.S. military trying to cope with it, and the ever present scientist who wants a chance to glean the \"wonders of the Universe\" from said creature, all at the same time.<br><br>Howard Hawks' adaptation of John Campbell Jr.'s short story, \"Wh o Goes There?\" may not be completely faithful, but nonetheless, the suspenseful plot about an Arctic research team's discovery of a recently landed spaceship embedded in the ice, and more importantly, it's lone occupant is still gripping today.<br><br>When this frozen alien carcass is accidentally thawed out back inside the research station, all hell breaks loose. As soon as the Air Force contingent(led by Kenneth Tobey) realizes that their visitor from space is bent on \"feeding\" on the human residents there, a \"cat and mouse\" situation is set up.The Thing is first repelled out into the Arctic blizzard, giving the lead scientist (Robert Cornthwaite) enough time to  theorize that it's a highly evolved vegetable from outer space, and therefore, MUST be advanced enough to impart the answers to all man's questions if given a chance to communicate.<br><br>Therein lies a major conflict between the Air Force personnel and this scientist... the military sees The Thing as a threat, and the scientist sees The Thing as a fountain of knowledge in disguise. Some disguise! James Arness plays the E.T. visitor which appears at key moments through the film as a menacing humanoid with unusual claw-like hands, and though it is inferred that it is vegetable rather than animal, you're left to your imagination as to what exactly the creature is composed of. The brief encounters with the Thing as it returns from the unseen depths of the storm to feed on human blood is heralded with the ominous ticking of the crew's Geiger counter. Tension mounts as it draws nearer and nearer to the vulnerable wooden buildings of the outpost.<br><br>Once it has been revealed that Science wants to \"protect\" the Thing (as the Dr. Carrington has planted seedlings from the Thing's tissue remains into their greenhouse lab for an eerie result of reproduction), the military binds together with a plot to destroy It.<br><br>Although lacking in modern sophistication and effects, this film allows the viewer to be marooned with the hapless research and Air Force crew to face an Unknown, a common enemy... a theme so highly epitomized by the McCarthy era of anti-Communism that engulfed the nation at that time. I say this will always be a classic unto itself, and though not in any way comparable to John Carpenter's 1982 re-make in terms of gore, horror and psychological perspective, it still carries its own due to the snappy script and sense of foreboding.","user":"bonepilot","rank":[47,51]}]