[{"title":"I Liked It!","rating":19,"date":"19 November 2001","review":"While definitely not as much a first-rate production as Hammer's first Mummy, Curse of the Mummy's Tomb has some great camerawork, nice supporting performances, and an intriguing mummy plot.  Archaeologists financed by an American P. T. Barnum type find a lost tomb and open it despite the curse that says whosoever is present at its opening should die.  Hammer production values prevail with lush costumes and sets.  George Pastell(from the original) is back as yet another Egyptian naysayer out to prove that the British had no right to take and break the sacred nature of treasure and memory of forgotten kings.  Michael Ripper, Jack Gwillim, and Fred Clark excel in their supporting roles, clearly out-performing the rather tiresome and boring leads of Terence Morgan, Ronald Howard, and Jeanne Roland.  Clark gives an impressive performance(as well as very affable one) as the American out to turn his mummy find into carnival magic, taking the show to the \"American Heartland\" for a dime a peep.  The story is not the fastest paced story around, but once the mummy's casket gets opened....people die. Definitely worth a look for the mummy fan.","user":"BaronBl00d","rank":[21,24]},{"title":"The Curse of the Mummy's Tomb: Watchable stuff","rating":5,"date":"17 May 2018","review":"Hammer movies have always been a tad hokey and that's forgivable, some sloppy writing however isn't.<br><br>This is the second Hammer Horror movie from \"The Mummy\" franchise and this time the star power has taken quite a dip. No longer did they have the presence of Christopher Lee and Peter Cushing and that really showed.<br><br>It tells the story of a rich American who plans on making the opening of a mummy's sarcophagus a tourist event in order to make money but oddly enough things don't go quite as planned.<br><br>The film looks great, the performances though spotty are mostly passable and the Hammer Horror brand of musical score is present. It's all very colour by numbers stuff, but that's okay.<br><br>Sadly the writing is inconsistent, some is poor and some is baffling especially when it comes to character development.<br><br>Passable stuff but again this underlines why though I appreciate Hammer Horror I've never exactly been blown away by it.<br><br>The Good:<br><br>Looks great<br><br>The Bad:<br><br>The absence of the likes of Cushing/Lee is very damaging<br><br>The bulletproof bandages have returned!<br><br>Mummy actually looks worse<br><br>No character consistency<br><br>Awful cover art<br><br>Things I Learnt From This Movie:<br><br>Belly dancing is sexy or awkward, never anything inbetween","user":"Platypuschow","rank":[13,14]},{"title":"Not a masterpiece, but still underrated","rating":6,"date":"27 May 2007","review":"Curse of the mummy's tomb certainly is not a best effort from Hammer studios, as many of their true classics outshine it without any serious effort. However, it is not as much a disaster as many comments here in IMDb suggest. The movie doesn't have any Hammer's big stars in the cast, the story doesn't bring anything new into the mummy myth, and at few times the going gets unintentionally hilarious in the film. But on the other hand, the characters are acted quite solidly, even if the performances don't truly shine. Comical reliefs are mostly done with certain style, especially by Fred Clark as a P.T. Barnum replica, and the plot has few interesting twists. We even have here few scenes of surprisingly graphic of it's time, if a bit unrealistic screen violence, if that's your cup of tea. Slow pace and low action rate of the film works more for than against the movie, at least in my books, and the whole package is short enough, so the story can carry it all through till the end.<br><br>All in all, if you're a fan of old horror films, give it a go, whether you're a fan of Hammer studios works or not. At least this one certainly beats the stuffing out of it's follow-up, Mummy's shroud, which in my opinion truly deserves any public stoning it gets.<br><br>This is my truth - what is yours?","user":"The_True_Meller","rank":[19,22]}]