[{"title":"Great Hope Classic","rating":9,"date":"28 February 2002","review":"Hope's films always spun on his zany sense of humor.  In this, a redo of a Damon Runyon story (see Little Miss Marker), Hope is at his best.  I noted with interest the comments of one reviewer who bristling with politically correct indignation, accuses Hope of everything from Sexism to nearly murder.  True, they were not as tuned into the careful not to offend anyone scene we are now but most of this stuff is pretty mild.  Besides, being a senior citizen myself, I was hardly offended.  The list of wonderful studio character actors in this film is delightful.  Fred Clarke who was at his best as a villain or sleeze ball gives a delightful show as a gangster. And, then there's Marilyn Maxwell:  her singing of \"Silver Bells,\" gave us a new Christmas carol that is sung every holiday season.  I'm sorry that some of our other reviewers were piqued by this film.  I think it has held up well and I still delight at Hope's antics.  I guess that dates me.  I was in junior high when I saw this film.  I loved it then and love it now.","user":"artzau","rank":[32,34]},{"title":"Simply lovely con artist caper delivering mirth for the yuletide season.","rating":10,"date":"4 March 2008","review":"The Lemon Drop Kid is directed by Sidney Lanfield (Frank Tashlin uncredited) and based on the short story of the same name written by Damon Runyon (Edmund Beloin adapting). It stars Bob Hope, Marilyn Maxwell, Lloyd Nolan, Jane Darwell, Andrea King &amp; Fred Clark.<br><br>It's perhaps a bit unfair to call it purely a Christmas movie? But watching it during the festive holiday season itself more than doubles the impact of the viewing. Bob Hope is The Lemon Drop Kid, a scam artist who during one of his cons at the race track finds himself in debt to a gangster for $10,000. If he doesn't find the money by Christmas day then he's going to be done for in a very grizzly way. We then follow the intrepid Hope on his various escapades to get the money; no mater how morally corrupt it be! A charity scam in the name of an old peoples home brings about much mirth and frivolity, and as the film twists as much as Hope does in his energetic scenes, it leave us with a delightful feel good seasonal offering. The lead cast are fine, with Hope in his element with the material to hand, while Marilyn Maxwell is perfect foil for Hope in the lead female role that calls for gusto and sentiment to be layered equally. While the final cherry on this lovely yuletide cake comes with the Hope/Maxwell rendition of \"Silver Bells\" that underpins the Christmas flavour of the piece.<br><br>It's unlikely to impress hardcore Runyon followers, and those that don't buy into Hope's form of comedy are probably best to avoid it. But for many folk, myself included, The Lemon Drop Kid is a 10/10 film, particularly at the Crimble season.","user":"hitchcockthelegend","rank":[22,23]},{"title":"I have loved this movie for years.","rating":8,"date":"16 December 1999","review":"I saw this movie when I was only about five years old and I've loved it since.  It epitomizes the typical good hearted man in a bad situation who undergoes a character transformation worthy of old Scrooge himself.  Bob Hope plays a grifter who tries to play both sides of a scam.  All of this is infused with just the right amount of holiday fun and Christmas Carols (and even a few cracks at Bing) to make it a real holiday classic.  I would recommend it for any age and any family.","user":"MrJodie-2","rank":[16,18]}]