[{"title":"Mystery Extraordinaire","rating":9,"date":"26 August 2007","review":"Set in a French boarding school for boys, \"Les Diaboliques\" tells the story of two teachers, Christina (played by Vera Clouzot), and Nicole (played by Simone Signoret), who conspire to kill the sadistic headmaster, a man who also happens to be Christina's abusive husband.<br><br>Like most murder mysteries, the story is highly improbable; nevertheless, the film is still hugely entertaining, thanks in part to plot twists and turns that even Agatha Christie would admire, and to the film's B&amp;W lighting, that renders a noirish, sinister atmosphere.<br><br>The first half is interesting and tightly plotted. But the real strength of the film's underlying premise begins at the mid-point plot turn. The second half is riveting, because the tight plot begins to ooze with mystery and suspense. It builds to a final ten minutes that are as frightening as almost any ending in film history; dark interiors, shadows, ominous light at the end of a long hallway, a general absence of sound, a gloved hand, a scream, and an unexpected image. It's the very definition of spine-tingling suspense.<br><br>There is a clue to help solve the story's mystery in the film's first ten minutes; but like any good mystery, that clue is very subtle. All the film's acting is excellent, even down to the children actors. And, Simone Signoret is as wonderful here as she is in all of her other movies.<br><br>English subtitles require a little more work for viewers who cannot understand the French dialogue; yet, the story, the acting, and the cinematography should more than offset this minor irritation. Background music occurs only during the film's title sequence and closing credits; this general absence of music thus enhances suspense.<br><br>Although not strictly speaking a whodunit, \"Les Diaboliques\" is a classic murder mystery that has earned a well-deserved reputation for setting the standard for cinematic suspense. The story is riveting, and the film is technically well made. More recent films have tried to copy it; but this is the original.","user":"Lechuguilla","rank":[51,59]},{"title":"Watch this film alone......and be afraid.","rating":10,"date":"6 July 2003","review":"Are you alone? good. Have you turned off the lights? good.Is there a storm brewing in that dark foreboding sky?Excellent. Do you like brilliant black and white movies? Wonderful.Now, sit back and enjoy the best of the best. This is quite simply the best psychological thriller ever made.Often imitated but never bettered. If you have a problem with subtitled films then don't worry because you will understand this film without reading them. If you want slash and gore, go elsewhere.If you want sophisticated entertainment,you've come to the right place.Georges Cluzot's finest work is a thing of beauty as is his wife Vera, who stars opposite Simone Signoret as the schoolmaster's wife.From the very start it is very clear that all is not as it seems. But why? and who? What is the terrible secret of the swimming pool and later on, the bathtub? As the tension builds to an unbearable climax, we sit and hide behind our hands, peering through the gaps in our fingers.Oh my God!! it can't be!.....it is! Do not confuse this movie with the disgraceful remake starring Sharon Stone. All copies of that disaster should be burned. Watch this movie if you are a serious film buff. Rent something else if you have the attention span of a goldfish.Brilliant. 10/10","user":"terraplane","rank":[173,223]},{"title":"Hold your breath suspense","rating":10,"date":"18 December 1998","review":"Les Diaboliques is one of the tightest, pure suspense movies I have ever seen.  The story starts out slowly, but as it moves on, peculiar things start to happen.    This movie keeps you guessing in such a way, you are riveted to your seat, hoping for a quick resolution to the suspense.  Yet, as the story unfolds, the suspense deepens.  The final scene of the movie had me sitting back holding my breath.<br><br>This movie does not offer cheap, pop out and scare you tactics. Rather, it makes the viewer expect things to happen that don't.  You wait on the edge of your seat for the quick jump out and scare you event to take place, but instead, it sneaks up from behind you.  What an effect!<br><br>Les Diaboliques is a classic film that delivers the complete suspense package.  It's not surprising that many suspense movies of the modern era have tried to copy the plot.  This movie is well worth renting in a video store, if you can find it.","user":"mantone","rank":[99,128]}]