[{"title":"Interesting plot, average entertainment, with an excellent Hackman performance.","rating":5,"date":"8 November 2004","review":"I'm a huge Gene Hackman fan and I remembered seeing this film many years ago and thinking it was quite cool, and when I saw the title in the paper again, I thought I would find out how right I was.<br><br>Well Hackman is once again excellent. He has such a natural and believable way about him in his roles that I find it hard not to be drawn into his character. He's definitely one of those actors who always plays himself, but it doesn't matter as his ability and style just carry it off without a thought. A truly great actor in my mind.<br><br>Matt Dillon is also very good, although his younger trademark look of startled deer is ever present.<br><br>The plot itself is a good one, in that Hackman plays Dillons father, a boring and very dull man with an equally dull job, in his sons eyes anyway. What quickly transpires is that he is not the speed limit sticking man that his son first thought, he is actually a ex CIA agent.<br><br>This change is done very well, with a short set piece in an airport. With the smallest of physical changes, Hackman flips from average father to confident and action ready agent. You can see it in his manner, and it shows his excellent capability as an actor.<br><br>The rest of the movie reveals the story as father and son are pulled deeper and deeper into his life, revealing the true extent of his agent activities. His son quickly realises that this is not the father he knew, and quickly grows from off-handedness to total rejection and then to acceptance again.<br><br>It is an interesting movie, and the plot is quite good with some interesting action sequences. Where it fails are some of the other actors and the hectic pace of the movie, it seems as though either in filming or editing that crucial parts of the movie have been missed or removed.<br><br>Big shame, but it is still good to watch for a Sunday afternoon movie. I think this may kick off my &lt;i&gt;watch every Gene Hackman movie&lt;/i&gt; campaign.","user":"Rich B","rank":[27,33]},{"title":"Dear old Dad? MY dear old Dad?!","rating":16,"date":"16 July 2004","review":"The performances of Matt Dillon and Gene Hackman brought this film right over the top for me.<br><br>Dillon's character grows from being an obnoxious teenager, who sees Dad as an un-hip set of car keys with a hand attached to them, through the astonishing realization that Dad just may be \"James Bond\".<br><br>And Gene Hackman brings his blazing talent to the table, unfolding from a middle-aged, pokey, conservative, 35-mile-an-hour, aw-shucks businessman into a multilingual, multitalented super-spook.<br><br>The two interact perfectly!  As they face dangers and intrigue together in a wild ride across the globe to save Mom, it is a delight to see them discover and appreciate the depths of each others' characters and become friends and partners.<br><br>\"Saving Mom\", was almost irrelevant!","user":"Oldsport57","rank":[15,18]},{"title":"One of my all-time faves","rating":10,"date":"8 December 2006","review":"I can't add too much that hasn't already been said. A 1985 film, the plot should be familiar to anyone with or without basic cable by now. Where this film shines is in the relationships between the characters and the quality of the acting. Mind you, the plot and action aren't shabby, either, despite some comments here to the contrary.<br><br>Perhaps this is merely middle-age fantasy - how many middle aged dads (or moms) haven't had the fantasy of showing their sullen kids how cool they once were and could be again if necessary? I was fortunate not to have any sullen kids (or grandkids), but I've been in this guy's place and I recognized the looks on both faces. (OK, I was never a spy or anything so overtly cool, but I did have my moments.) The point is that there come inevitable times in the relationships between kids and parents when the kids suddenly realize that the old folks may have actually been cool before the kids even knew what cool was all about, and that's the heart of this film.<br><br>Contrary to some comments, the plot is quite coherent with only a few holes which I won't elaborate. Some of the carping about plot points I've read here must have come from people lacking in either imagination or comprehension. The action is credible both in its pacing and execution. Not Arthur Penn's best film, but this is as much of an actor's film as a director's film.<br><br>The acting is uniformly good, but Hackman holds the center of the film. If he weren't completely believable, the whole effort would fall apart. Matt Dillon gives a very good performance as Hackman's son/foil, but isn't in the same league. The usually reliable Josef Sommer gives a surprisingly weak performance - OK, but not up to his usual work. The late Herbert Berghof (husband of Uta Hagen and co-founder with her of the eponymously named HB acting studio) gives a master class in his portrayal of a truly sympathetic, tortured soul - not much screen time, but a real gem. Another standout is Viktoriya Fyodorova, who offers some of the films most poignant scenes as Hackman's love-who-might-have-been, who devotes herself to helping him and his son find his kidnapped wife.<br><br>Highly recommended, but it won't really resonate with the kids...","user":"rbsjrx","rank":[19,24]}]