[{"title":"Care in the Community - Italian Style","rating":7,"date":"27 September 2004","review":"Not many directors would choose the end of their career to head off in an entirely new direction, but that is very much what Fellini does here. This was his first film based on a novel (Ermanno Cavazzoni's \"Il poema dei lunatici\") and quite a radical departure in terms of style.<br><br>In a move which apparently alienated many of his traditional audience, the film-world is almost entirely the one experienced by the central characters, Ivo Salvini and to a lesser extent Gonnella. This subjectivity of approach was of course used in \"8 1/2\" but in a less extreme and clearly autobiographical way. Here, Fellini makes the brave decision to keep contextualisation and explanation to a minimum, leaving the unwary viewer flailing about in search of a foothold. As Ivo's state of mind drifts between lucidity and hallucination, we seldom know what is 'real' and what is imagined, even down to the words spoken by other characters.<br><br>\"Felliniesque\" themes such as the love/fear of women, religious superstition and motifs like madonna statues and mountains of pasta are revisited from this rather skewed perspective, but the film overall has a dislocated feel which is far away from the likes of Roma or Amacord.<br><br>Interestingly, Benigni is asked to act here, rather than doing his usual schtick, and does well as a Chaplinesque figure who occasionally reminds one of Guilietta Masina.<br><br>This is certainly not what you might call classic Fellini (he confessed to a crisis of confidence writing it) but there is much to enjoy and to wonder at in this last work. The man himself regarded it as the \"orphan\" of his films and hoped it would come to be better regarded.<br><br>Devotees of Terry Gilliam will note the original of the waltz scene lifted for the following year's \"Fisher King\".","user":"Krustallos","rank":[43,47]},{"title":"Visual poetry","rating":10,"date":"2 July 2007","review":"This is one of Fellini's best movies, and one of the most underrated pictures of all time. This masterpiece includes all the main themes of Fellini's career. It doesn't follow a \"prose style\", but a \"lyric style\". It's like a visual poem. In fact this film narrates the journey of Ivo Salvini (Roberto Benigni) through dreams and memories, which actually belong to the great director. As a matter of fact Salvini, alter ego of Fellini, says: \"I love to remember, maybe more than living\". The protagonist wanders in the countryside, asking himself about life, and meets Gonnella (Paolo Villaggio), who feels himself oppressed by the giant and factitious society, made of useless appearance. The noisy square is the symbol of a chaotic society (circensian, as Fellini would say), where the individuality is dead, superseded by an alienated mass. This crowd is insensitive to the voice of inner being, to the voice of the moon. In this film the noise contrasts with the silence, the loud public square contrasts with the noiseless countryside, which helps along subjectivity. The omnipresent television clashes with the moments of poetry, like the scenes of Benigni reciting poems of the Italian romantic poet Giacomo Leopardi. Poetry wins over the modern society, which doesn't listen the voice of inner being, deafened by the noise of the Machine. Poetry is like a flight, like a dance, like music (the waltz scene in the disco is wonderful). At the end only the most misunderstood people can catch the moon, that glow of infinite. Nobody can explain what happens. Maybe it's not necessary to explain. It's enough to keep silence and listen. Benigni and Villaggio are two great actors, the soundtrack by Nicola Piovani is impressive and touching, the set design by Dante Ferretti has a beautiful imagery, and the direction of the master is outstanding as usual. All that enables us to listen for a moment the voice of the moon.","user":"rockisforever","rank":[27,29]},{"title":"Fellini's last film not quite vintage but still striking.","rating":7,"date":"13 September 2003","review":"It is a pity that Fellini's last film is not better known as it represents something of a return to form after a series of disappointments. .Fellini's visual imagination is still intact but some of the wonderful precision of imagery is no longer present. Perhaps by the end of his career too many of his old collaborators had died or retired. The best part is the first half hour seen entirely from the perspective of the insane central characters. Their obsession with the moon provides the alibi for many evocative night shots, (I've often thought that one thing that distinguishes great film makers is how they film the night), as well as the spectacular climactic sequence when they imagine that they have trapped the moon. Elsewhere there is typical Fellini fun with the crowning of 'Miss Flower' complete with an outsize King and Queen of the Gnocci and a final shower of flower on all the contestants. 'La voce della Luna' shares much of 'Ginger and Fred's' distaste for the contemporary world summed up in a sequence in which a disco rave is interrupted by a Strauss waltz. This is far more poetic and unexpected than anything in the predictable 'Ginger and Fred'. Those worried by the narrative incoherence of Fellini can bury their boring heads in a screen writing manual. Perhaps the current international popularity of Roberto Benigni, little known outside Italy when the fim was made may yet allow this flawed but haunting film to gain the audience it deserves.","user":"jrglaves-smith","rank":[23,25]}]