[{"title":"Another Cassavetes Gem!","rating":10,"date":"23 May 2002","review":"I suppose one might consider this 'minor' Cassavetes, given the fact that this is a very conventional story about jazz musicians and a woman who has been misused by men all her life.  The production values also seem a little lower than some of his other films.  But I can't help but feel astonished over how Cassavetes can make a meal out of just a few crumbs.  Actually, he had more than a few crumbs.  He had an excellent cast, headed by two extremely talented and wayward (!) actors.  I'm in awe of how amazing Stella Stevens was, given the quality of the rest of her career.  She certainly took a bad turn somewhere, but perhaps like her character in this film, no one ever took her seriously in the first place.  A real shame!  I saw Bobby Darin give an excellent performance in a film called PRESSURE POINT from around the same period as this film, so he has only confirmed my belief that he could have been a leading actor of his generation.  But Cassavetes could probably even make me a good actress, so certainly he qualifies for a good deal of the credit here.  This is just a small, human film with dignity and intelligence told with Cassavetes' usual panache for intensity.   I can't remember how long it's been since I've cared about any screen characters so strongly.  It was probably the last time I caught one of Cassavetes' other films!","user":"juniperjenn99","rank":[23,25]},{"title":"Another Oft-Misunderstood Cassavetes Film","rating":8,"date":"18 August 2008","review":"John Cassavetes creates an eternally unique drama with his chronicle of an idealistic jazz musician played by crooner Bobby Darin, and his relationship among his fellow band members and his object of affection, a beautiful would-be singer who comes between him and his band members, played by Stella Stevens in an honest, humanly extreme performance clearly directed by Cassavetes and cementing an argument that she could have held her own as a star.<br><br>Darin, as Cassavetes surely intended, brings a realistic contribution to his character from his life in the world of the era's music scene, as a dogmatically philosophical band leader who takes tremendous pride in seeing a profound, transcendental beauty in a mellow, instrumental school of jazz that he, with the exasperated tolerance of his fellow players, finds ideal to play to empty parks to communicate with nature and birds when he isn't playing gigs at old people's homes and orphanages. What is irrelevant in this film is how we feel about the music he feels most personally in tune with (no pun intended) in comparison to the commercially accessible music that would welcome him into a successful career. Like all Cassavetes films, Too Late Blues is about a character whose proclivities are beyond us, and what keeps it from being subjective or affected is that the rest of the characters share our feelings.<br><br>The key to our understanding and relating ardently to Darin's character is his unrelenting obstinacy, which becomes Bobby Darin uncannily, borne by the pride that absorbs all of his perceptions into what is of use only to him. As this dooming characteristic rears its head, an internal conflict between his true passions and what will gain him the recognition that deep down he wants more than anything else, we come to dislike him and find ourselves on the side of his band members and his girl Stevens.<br><br>Full of far-seeing insight and relentless individuality, it is not well-recognized film, which in itself is a testament to the artistic truth it presents. This is in some sense a shame though, because it is really a moving film in spite of all the expectations accompanied by an audience's perception of a music film. There are many great scenes where we simply hang out with the band in their regular hang-out spot with an entertaining bar owner, or we indulge in their impulsive diversions, or we react in unusual ways and we must step out of our regiments and make an endeavor out of looking further.","user":"jzappa","rank":[18,20]},{"title":"Desperately deserving of a decent DVD release","rating":7,"date":"10 May 2006","review":"This is a very good jazz film, bringing the whole era to life, thanks to some superb acting by Bobby Darin (thank you thank you Montgomery Clift for backing out at the last minute) and the stunning Stella Stevens (why was she not a major star?). It certainly is not \"the best jazz film ever\" as some critics have said - \"Round Midnight\" and \"Bird\" are infinitely better films. But it's a quirky one, nonetheless. Darin plays jazz pianist and bandleader Ghost Wakefield (was that not also a make of aeroplane?), who is highly idealistic and loves a mellow, instrumental type of jazz. He falls for floozy Jess Polanski (Stevens) and ends up having to decide whether to continue to play on bandstands to empty parks (save for the birds), and old people's homes and orphanages, or compromise his type of jazz and play instead a more commercial type blues. He clearly makes the wrong decision. The hardest thing about this film for me was that I actually prefer the blues-type jazz he was shunning, as will probably most of the audience of this film, but that is irrelevant to our enjoyment of this film: \"Too Late Blues\" is a film about a stubborn man who is always \"too late\", because of his abject stubbornness. But there's more to his character than that: he cuts a rather pathetic and therefore lifelike character throughout, but ultimately his stubbornness is so infuriating that we cannot help but sympathise with the other bandmembers, and Jess, more than with the hero (Ghost). Is this a failure in this film? Perhaps it is. Which is why I cannot agree that it is the best jazz film ever. It is certainly a good one, though; although there could certainly have been a little more music in it. And certainly more of Stella Stevens's singing - if indeed that is her voice (\"Girls! Girls! Girls!\" is normally credited with being the first film in which Stella Stevens sings, which was the following year....) \"Too Late Blues\" deserves a decent DVD release ASAP - perhaps with a Stella Stevens commentary. Hope you're reading this, Paramount!","user":"Tristan!-2","rank":[12,13]}]