[{"title":"More entertaining than it had any right to be","rating":7,"date":"9 November 2008","review":"So I was sick all weekend, bedridden with the flu and flipping through cable when I stumbled upon the Encore Western Channel, which I watched for hour after hour. For some reason, they were playing a triple-shot of Burt Reynolds westerns: Navajo Joe, The Man who Loved Cat Dancing and Sam Whiskey.<br><br>Now I grew up in the Eighties so I missed most of Reynolds movies; last year I hunted down and watched many for which he is best known: Smokey and the Bandit (rip-roaring hilarity), Stroker Ace (yuck), Cannonball Run (meh) and Hooper (my all-time favorite, ridiculously entertaining). I thought I had seen all there was to see from ol' Burt, but Sam Whiskey pleasantly surprised me.<br><br>This isn't really a western, it's more like a heist movie set on the frontier. I think the reason some of the other reviewers were disappointed by this one was that they were looking for stagecoach robberies, breakneck horseback riding and wide frontier vistas. While there is some of that, for the most part this film revolves around a \"reverse-heist;\" In this case, Burt and his team played by Ossie Davis(very funny and amiable as a blacksmith) and Clint Walker (imposing hulk of a man who's gentle on the inside) are trying to return some gold to the US mint. They work out a suitably ingenious and ludicrous scheme (the cornerstone for every caper flick) and work it out.<br><br>While the proceedings are executed largely for laughs there are surprising amounts of edge-of-your-seat suspense as various curveballs are thrown our heroes' way. I have to admit I laughed out loud probably five times, which was incredible considering how miserable I felt and how much my sore throat hurt WHEN I LAUGHED. But I forgive the movie for this! I like the overall good-natured and almost lackadaisic nature of the pacing. The film keeps moving and is engaging, but by no means is it in any hurry.<br><br>So I would recommend this one to all Burt Reynolds fans, all caper movie fans and generally anyone who is willing to give a 40-year-old easygoing movie a chance.<br><br>And as an interesting side-note: As if I didn't already realize that I'd watched westerns all weekend -- I thought that actor Clint Walker looked vaguely familiar but couldn't quite place him. They I looked him up on IMDb...he played the icy bad guy in a Charles Bronson western I'd watched earlier in the weekend, \"The White Buffalo.\" I hadn't placed him because it was such a polar opposite role for him. So in his career he's pulled a heist on the Denver Mint with Burt Reynolds and got into a gunfight with Charles Bronson on the frontier. Not too shabby.","user":"Webslinger48","rank":[12,12]},{"title":"Whiskey and Gin, Whiskey and Gin.","rating":7,"date":"13 August 2013","review":"Sam Whiskey is directed by Arnold Laven and written by William W. Norton. It stars Burt Reynolds, Ossie Davis, Clint Walker and Angie Dickinson. Music is by Herschel Burke Gilbert and cinematography by Robert C. Moreno. <br><br>Widow Laura Breckenridge (Dickinson) offers Sam Whiskey (Reynolds) a $20,000 reward for the return of some gold that her late husband had stolen from the Denver mint. However, she doesn't want the gold for herself, she wants Sam to put it back into the mint before it's found to be stolen and soils her family name! <br><br>Maybe it's because I consider myself a Reynolds fan that I found this to be a whole bunch of fun? That I appear to be at odds with critical consensus about Sam Whiskey's worth as entertainment? <br><br>Stolen money burns a hole in your pocket. <br><br>Sam Whiskey knows exactly what it's doing, it mixes the caper movie with a Western setting and lets the principal players have fun with it. The quadruple lead players bounce off of each other with considerable charming results, the set-up is suitably daft, a reverse robbery if you like, and there's no shortage of suspense and action. In fact the various twists that arise as Reynolds, Davis and Walker go about their mission of goodwill for the sultry Dickinson, are well implemented into the plot. The De Luxe colour photography is most pleasing, though the absence of scenic panoramas is sorely felt, and the music score is complementary to the tone of the story. <br><br>True, the direction is hardly inspiring, the quirky nature of the whole thing narrows down the number of film fans it might appeal to and the idea is indeed thin. Yet for Reynolds fans it should be sought out, to see him at the end of the 60s before \"his\" time would come in the 70s. Watch him perform with a comedic glint in his eye, see Dickinson smoulder and raise temperatures, Walker play at odds with his macho persona, and Davis having fun being the tough boy of the group. Enjoy the cheekiness (Re: ludicrousness) of the caper, the early diving technique on show or sample the verbal amusement that comes from the stars. I just know I had a big enough grin on my face come the end to make this a strong 7/10 rating. Non Reynolds fans should probably knock a point off that rating, though.","user":"hitchcockthelegend","rank":[9,9]},{"title":"One of the funniest western comedies ever made","rating":7,"date":"20 November 2004","review":"It's no mystery that Burt Reynolds is one of the most underestimated actors of our time. In this particular film, he gave us one of his best comedy-stilish acting (\"no-one noticed it\", he said) which makes this movie working. Burt's acting would be enough to make it watchable, but also Ossie Davis and Clint Walker fit well in their roles.<br><br>For me the remarkable of this movie is a) the way it is directed and edited (it ain't dull for one second), although there are some silly situations (e.g. Burt firing with a machine gun to save his friends killing all his enemies without hitting his friends...), but hey, it's a comedy and it's not the story which is most interesting. It's the mood of the film and the way characters are portrayed. It contains a lot of fine jokes and dialogue (\"I'm not riding this long way to bury your bird\") and chemistry between Burt and Angie Dickinson is amazing. Also the more serious parts of the film (stealing the gold out of the fort) are working well.<br><br>Also, there are some things which seem to be rare in a film: The fact that no-one of the \"thieves\" have intentions killing his buddies to keep the gold for himself. No, they even break in to return it back to the government! It's hardly believable, but it is that fact that make the film and these characters charming.<br><br>I give it a 7 of 10","user":"wolvus","rank":[24,29]}]