[{"title":"Cheech and Chong's third film: Nice Dreams.","rating":7,"date":"17 August 2005","review":"Nice Dreams (1981) was the second sequel to UP IN SMOKE. The lovable burned out slackers are selling \"ice cream\". But there nothing more than a front for there drug dealing (pot what else?). Sargent Stedanko is back from UP IN SMOKE. He's no longer the same straight laced cop. Stedanko has turned into the very element he's been trying to catch. The duo is stashing away some smoke for a rainy day. They want to pull off one big score so they could retire in the \"tropics\". Unfortunately, Sargent Stedanko and his motley crew of narcs want to bust them and lock 'em up forever. Can Cheech and Chong \"retire\" in luxury? Will Stedanko finally bust them? What will happen to the duo when they stray away from their favorite drug and experiment with others? How does the good doctor Timothy Leary fit into the picture? Watch NICE DREAMS and you'll find out!!<br><br>Another funny film from the team of Cheech and Chong. I find it to be hilarious. Not a classic by any means. Just a funny movie that stars everyone's favorite stoners.<br><br>Recommended.","user":"Captain_Couth","rank":[11,13]},{"title":"Hey, man, have some ice creams that give you nice dreams","rating":9,"date":"25 June 2005","review":"Cheech and Chong's first movie, Up in Smoke (1978), was the most successful and it set the scene for the five other films which were to follow. Nice Dreams (1981) is movie number three. <br><br>Nice Dreams is a very good film for laid-back old hippies like me who enjoy romanticising the 70s. Gone are the flower-power days of the 60s and life seems to have degenerated into sex and drugs and rock 'n' roll, and this movie has its fair share of each.<br><br>My favourite scene is at the Chinese restaurant where Chong is mistaken for Jerry Garcia of the Grateful Dead. And then there is a welcome cameo appearance from the enigmatic LSD guru Dr Timothy Leary. <br><br>One of my favourite supporting roles is the police sergeant who has the tongue of a lizard and believes \"the only way to catch a doper is for you yourself to become a smoker.\" <br><br>The quirky soundtrack and slapstick comedy helps to keep the movie moving along nicely...<br><br>Even though Cheech and Chong sold millions of records in the 70s and had a major success with Up in Smoke, I would not call Nice Dreams a mainstream movie. I would suggest it is a movie with a cult following although I've never seen it on any \"cult film\" lists.<br><br>If you like this movie you may also like \"Fear and Loathing in Las Vegas\" and \"Withnail and I\".","user":"johnfos","rank":[9,11]},{"title":"More high times from Cheech and Chong","rating":7,"date":"21 April 2005","review":"\"Nice Dreams\" has Cheech and Chong cruising around selling their unique 'ice cream'. Realizing they have made a ton of money, they go about trying to figure out what to do with their newfound wealth.<br><br>Along the way they encounter a crazy music agent who thinks Chong is Jerry Garcia, a coked-out Pee Wee Herman, Cheech's ex-love interest Donna and her old man Animal, who just happens to hate Mexicans.<br><br>On par \"Cheech And Chongs Next Movie\", \"Nice Dreams\" has some genuinely funny moments, such as Cheech getting stuck on top of the glass elevator naked, and when Cheech is locked away in the nut house. (Timothy Leary has a cameo as a drug-dispensing doctor.) <br><br>Wasted in this film was Stacy Keach as Sgt. Stedanko. He was awesome in \"Up In Smoke\", but has little to do here but smoke pot and turn into a lizard. Yes you read that right.<br><br>In my opinion, after \"Up In Smoke\", C&amp;C never managed to hit the same level of success. Overall a fun movie, but not up to the level of previous efforts.<br><br>Rating: 7 out of 10","user":"gibbog","rank":[6,7]}]