[{"title":"Excellent Film Honors Women's Hearts and Lives","rating":10,"date":"27 November 2006","review":"Look. I *love* \"Now Voyager.\" I don't love it as a guilty pleasure, or as camp, or as an example of film-making from the Golden Age of Hollywood. I don't love it as a soap opera or as example of the long lost genre, the theatrical-release, big budget, \"woman's picture.\" I love \"Now Voyager\" as a movie. \"Now Voyager\"'s quality could stand comparison with any great film out there.<br><br>Plot: Charlotte Vale (Bette Davis), the psychologically abused child of a sadistic iceberg of a wealthy, Boston Brahmin mother (Gladys Cooper), thanks to the intervention of a compassionate sister-in-law (Ilka Chase) is packed off to a posh asylum, where Dr. Jaquith (Claude Rains) restores her to well being.<br><br>Charlotte loses weight, loses her glasses, and receives tutoring in how to dress and carry herself. Superficially quite the glamor puss, she goes on a cruise and charms Jerry Durrance (Paul Henreid) an unhappily married architect.<br><br>Circumstance intervenes and Jerry and Charlotte enjoy a brief affair. As time goes on, they make some heart-wrenching decisions about how to handle their adulterous love; along the way, Charlotte forms an important bond with Tina, Jerry's daughter, whose mother does not love her.<br><br>The screen is full of women's bodies, women's voices, women's choices, and women's lives. There are old women, middle aged women, and young women. There are good and bad women in every class. For example, while Tina is the sweet but unattractive and lost young woman, Bonita Granville, as June Vale, is a pretty, blonde, young b----. The scenes in which June, without censure from any quarter, uses her youth and prettiness to torment her pathetic spinster aunt are terrific, honest, and cruel.<br><br>The plot is built around the issues of which women's lives are built: their relationships with their mothers, or mother figures, both good and evil; how the world treats women based on how women look; women's competitions with, and support of, other women; what women do to survive economically and emotionally.<br><br>The scenes between Charlotte and Tina are stunning in their sensuality. Tina, the daughter-surrogate, and Charlotte, the mother-figure, cling to each other in bed at night, and while sleeping under the stars on a camping trip; Tina sobs tears that wet her face; Charlotte strokes Tina's hair, and Tina clings to Charlotte's bosom.<br><br>The simple message here is how incredibly important parenting is in the lives of both children and mothers, and how a person who has suffered -- Charlotte -- can often be a better person than those who have had it easier -- Mrs. Vale and June, and how having been handed a life that denies you love doesn't make it impossible for you to go out and find love on your own, to create your own family.<br><br>Mrs. Vale is one of the most naked depictions of a child abusing mother ever committed to the screen. No, there are no graphic scenes of abuse, but the film never lets you believe that this woman is anything but a nightmare who damaged her child for life while the world let her get away with it because of her money.<br><br>Again, the abuse is not graphic, but it is made certain. In one brilliant scene, Charlotte has returned to her mother's house after being out in the world and, for the first time in her life, experiencing some affection, joy, and confidence.<br><br>Charlotte speaks in her new voice, a voice of self possession. But she is trying to be nice to her mother, and her voice quavers a bit, without losing its ground.<br><br>Charlotte is out of camera range; we hear her, but do not see her. Her mother's back is to the camera. She is motionless -- except for her bejeweled, claw-like hand, which taps rhythmically against a carved bed post. One thinks of a cat waiting to pounce. One realizes that all that is going through Mrs. Vale's head is, \"How do I destroy her this time?\" That motion alone renders the scene both chilling and telling.<br><br>Charlotte's love affair with Jerry Durrance is equally complex. This is no \"soap opera\" as some reviews here dismiss it as. Viewers are so caught up with Jerry's (Henreid's) trick of lighting two cigarettes at once that they miss the depth, power, and complexity of this relationship.<br><br>\"Now Voyager\" gives us a terribly convincing portrait of two people who really love each other, and whose love is apparently doomed. Jerry is a superficially charming, nice guy whose unhappy marriage has given him reason to see beneath the surfaces of life; he's no rocket scientist, though, so he's not as smart as he could be. He is attracted to a superficially glamorous woman whose secret past as an ugly duckling and abused child gives her a hidden side. For both, society demands that they present a pleasant facade, but pain has caused them to develop in ways that many people never do. Their love is real.<br><br>Jerry is deep enough to be attracted, but not deep enough to realize, as soon as he might, how much his acting on his attraction could potentially devastate Charlotte, a woman whose hold on her life is tenuous, at best.<br><br>Whether their love can ever be realized, or whether it would continue to grow outside of the confines of an adulterous affair begun on a cruise ship and consummated after the most outlandish interventions of fate on a mountain road, is a question viewers can still debate to this day. What is clear is that this love is real, and its stakes are terribly high. Charlotte's whole life hangs in the balance here, no less so than a Scorcese hero's life hangs in the balance given how he handles his weapon.<br><br>Claude Rains is solid as Charlotte's best hope at the beginning, and, perhaps, also at the end of the movie..","user":"Danusha_Goska","rank":[65,70]},{"title":"Ugly duckling turns into a swan","rating":10,"date":"14 March 2004","review":"At the height of WWII, Hollywood produced a lot of excellent melodramas. These were the vehicles the studios created for its stars of that era. It was either a Joan Crawford picture, or a Barbara Stanwyck, or a Bette Davis one, since their presence, bigger than life, was the only reason to bring these stories to the big screen.<br><br>Take this one, for instance, under the direction of Irving Rapper. It had all the right elements, yet it was chaste enough to pass the censor. Undoubtedly, this movie owes a lot to the fantastic score by the talented Max Steiner who was a genius. Mr. Steiner's music plays the haunting melodies with such flair, we feel we are listening to a great symphonic work.<br><br>The story, by today's standards wouldn't raise an eyebrow. At the time it came out, it was a different thing. After all, Jerry was a married man with a daughter and a situation that had no easy solution then. That makes Charlotte Vale suffer after she found her soul mate aboard the ship that served to free herself from a despotic mother.<br><br>Bette Davis plays Charlotte to perfection. Her scenes with Paul Hendried lighting the two cigarettes is something to cherish by film fans. The chemistry that Bette Davis shared with her leading men was no small accomplishment. She was an actress that knew how to pull the heart strings of the general public. She had such a charisma and power to lose herself in all those strong women she played through the years. The transformation of the plain Charlotte to the smart woman, who embarks on a tour to begin a new life, is something out of a fairy tale, but Ms. Davis pulls it with great panache.<br><br>The rest of the cast was excellent. Claude Rains, Gladys Cooper, Bonita Granville, Ilka Chase! They only come once in a lifetime. No one in present day Hollywood comes near to that. It was perfection.","user":"jotix100","rank":[88,104]},{"title":"Now, Voyager -An Excellent Expedition","rating":10,"date":"5 January 2005","review":"After seeing this great film, I realized that not every mother wants the best for her children.<br><br>Gladys Cooper gave a brilliant performance as the outrageously domineering mother. Her best supporting actress nomination was well deserved. It's a pity she lost the coveted award to Teresa Wright, the tragic daughter-in-law in \"Mrs. Miniver.\" Obviously, Oscar voters could not bring themselves to vote for such a wicked mother that Cooper portrayed. (The following year Cooper gave another brilliant performance as the wretched nun in \"Song of Bernadette.\" She lost the Oscar because who would vote for a vicious nun?)<br><br>No words are adequate to describe the outstanding Bette Davis performance in this film. Sorry, Greer Garson, Bette deserved this Oscar as she did so many. Her change from a hopelessly-drawn spinster to a ravishing beauty with all its torment can never be forgotten. <br><br>Thank you Claude Rains for your excellent portrayal of the psychiatrist.","user":"edwagreen","rank":[85,101]}]