[{"title":"There are those who see ...","rating":24,"date":"24 June 2003","review":"Okay, so I am not supposed to say anything about other user's comments, but I should mention that reading those comments is what lead me to write this...I don't know if this is an enjoyable movie experience, but it is nonetheless a triumph of cinema.<br><br>This film has very little to do with sex. It also has very little to do with the tango, and we might want to add it has little to do with Paris. Someone once told me this movie is about an American businessman. Out of curiosity, are all American's traveling in Europe businessmen? I think not. First of all, he was a boxer, a bongo player, he married a wealthy woman, but nowhere did I see this man as working for some corporation. This man had little money, and he didn't need a 'serious' career.<br><br>This film is about abuse; a parable about the overly masculine father who sexually abuses his own son; a child abused by his alcoholic parents; a widower who is abused by his animalistic but deadly honest wife. This movie is about a religious zealot for a mother-in-law in constant denial who shows more interest in her daughter's corpse than in her life. This movie is about an idealistic no-longer teenager who perhaps finds true love the only time in her life, but pays a terrible price. It is as though she has bitten from the forbidden fruit and found that love is an illusion.<br><br>To say Brando is superb misses the point. I simply know no other actor that could have pulled this off. His facial expressions are uncanny. It is a most fitting bookend to Street Car Named Desire. One simply cannot deny the final elevator scene. But unlike Streetcar, Brando portrays a vivid understanding of the sensitivity towards women and towards human existence that few men are capable of grasping, and few women could probably appreciate. Brando is himself. But Brando is himself because he understands his character, not because he plays himself.<br><br>This movie is an existential parody of the nature of society. It is a bitter reflection of human frailty and vanity. It is a tragedy of a man who has actually found a way to transcend his own suffering, who has somehow managed to cut through the illusions that all of us carry day-to-day. But with that knowledge, he finds himself utterly alone (as so many users here seem testament.)","user":"hadleya","rank":[253,332]},{"title":"Brando's most personal film","rating":26,"date":"26 January 2000","review":"Widely denounced as obscene upon its release and unjustifiably notorious for two of its scenes, Bernardo Bertolucci's 'Last Tango in Paris' is a savage story of lust and sexual debasement.<br><br> Marlon Brando delivers a ferocious performance as Paul, a middle-aged American expatriate tormented by his wife, Rosa's recent suicide, her infidelities and his failure to understand their relationship. In meeting a 20 year old girl, Jeanne, played by Maria Schneider, in an empty apartment, Paul hopes to form a relationship purely on his own terms and at his own pace, i.e. one he can understand fully. He insists on a new form of relationship, so basic that even their names were kept secret from each other, where she submitted to his every desire, where he could punish himself and relieve his despair and anger towards his wife by punishing Jeanne. Paul's only other interest is in Marcel (Massimo Girotti), Rosa's lover, for whom he has a curious respect and maybe a desire to obtain through him a better understanding of his own wife.<br><br> Despite his overpowering talent, Marlon Brando has often shown poor judgement in his choice of projects and has frequently trudged through films with no apparent effort or interest. In 'Last Tango in Paris' he gives everything and produces a performance of unrivalled force. Unfortunately the obvious improvisation in the film prevents the character of Paul from staying within check as he gradually becomes too much like Marlon Brando in the second half of the film. Nonetheless, when Brando is off-screen the film becomes hollow in comparison and is replaced by Jeanne's relationship with her fiance, an annoyingly pretentious TV director (Jean-Pierre Leaud).<br><br> This is a truly unique film and Bertolucci successfully highlights the romance in an affair that is fundamentally destructive. Brando's performance is remarkably powerful and intense, eclipsing every other player and dominating the entire film.","user":"DC1977","rank":[103,142]},{"title":"Bertolucci's film shocked many of those who had seen it...","rating":9,"date":"23 September 2005","review":"It was, in short, a film about sex and the way that human beings use sex as a refuge, a release, and a weapon The frank dialog, the nudity, and the simulated sex were not gratuitously employed but were integral to the theme of the film, and if the picture was not totally successful, it was certainly unforgettable <br><br>Marlon Brando appears as a middle-aged Americanbut not the kind of American in Paris glorified by either George Gershwin or Ernest Hemingway... This is a man tormented by inner conflict... Brando's Paul between self-hatred over his wife's suicide and his feelings for Maria Schneider's Jeanne, she between her adoring documentary filmmaker fiancé (based wittily on Godard) and the taboo-breaking Paul...<br><br>The stark, empty flat that is the lovers' retreat from conventional society, and the cold, windy pavement where Paul screams his loathing for the world against the din of a passing trainconnects us with the mood of the film... <br><br>Eager to escape the oppressive walls of his dark life, Paul embarks on a very complete sexual experience with a willing young woman in which there is no history spoken, no promises of future liaisons, no ties of any kind with the outside... <br><br>The two lovers know nothing of each other, not even their names... Their affair is purely physical, and the barren apartment becomes, as Bertolucci intended, a world of debauchery on which is explored a catalog of behavior that seems more childish than kinky...<br><br>Jeanne is a child-woman... She asks what she should call Paul, and they proceed to give themselves names brought only out of grunts, growls and screeches... Paul's cruelty is not justified and perhaps this is what attracts the modish girl... Some scenes emotionally are so provocative that you experience a wide range of feelings... Paul never asks Jeanne a direct question, but is constantly framing her for his next experiment, besides he assaults her, humiliates her and pushes her over the edge... There is one great moment for the heroine when she refuses Paul's power play and is equally unimpressed by his new declarations of love... She insists: 'It's over!' <br><br>The film is beautifully shot... The cinematography is unique, somber, shadowy and painterly... It presents despair, and the music reinforce the despairing mood... The movie is also intensely erotic, intensely realistic, immensely disturbing... The extreme frankness makes faintly uncomfortable viewing, not only because of its sexual material but because of its exploration of our inner nature with true perspective... Hopefully, younger viewers can turn their minds back to a time when sex was mysterious and beautiful; dangerous and daring; not just easy and transitory... Sex nearly always implies intimacy, but doesn't always provide it... <br><br>'Last Tango in Paris' is one of the great explorations of cinema's visual possibilities Bertolucci camera's movements throughout the film characterize the rights steps of the tango which the two main characters execute at the climax of the film... We feel swept away by the beauty of the tango despite the tragic quality of the acts and events it escorts... The film does prove Bertolucci to be a true filmmaker capable of the audacity of Jean-Luc Godard and the distinctive style of Ingmar Bergman...","user":"Nazi_Fighter_David","rank":[94,132]}]