[{"title":"\"Long live the new flesh!\"","rating":2,"date":"2 October 2001","review":"Videodrome is truly a surreal experience. I do not want to include too much information as that would spoil the film for \"virgin\" viewers. If you are familiar with Cronenberg's work, you may have an inkling of what you're in for. Videodrome can drive one to the brink of madness, and then tell you you've been there for an hour and a half. From scene to scene you can't tell what's real and what is in James Wood's imagination. It's utter insanity, but it's great at the same time. This film is a good companion piece with Cronenberg's Existenze. When you can wrap the audience up in your movie, you have accomplished something few have. And David Cronenberg seems to do that time and again. Cronenberg is not for the faint of heart, definitely.","user":"Backlash007","rank":[80,94]},{"title":"Careful, it bites.","rating":28,"date":"28 May 2001","review":"I love this movie!  When I first saw it in 1983, I had no idea what it was about. Back then, we didn't have words like \"virtual reality\" and \"cyberspace,\" at least not in every day usage but the concepts were beginning to filter in due the popularity of video games.<br><br>But what we didn't know then, and what we couldn't have guessed were the dangers in even the concept of a \"virtual reality.\"  Once one starts down that line of reasoning nothing can ever be taken for granted.  What Philip K. Dick warned us about in the 1960's was brought to the screen in the 1980's by David Cronenberg.<br><br>When television prophet, Dr. Brian Oblivion, opines \"television is reality. And reality is less then television\" he is heralding in our current age where the line between fantasy and reality is almost fails to exist.<br><br>Videodrome is the story of war for the mind.  On the one side, representing control is Barry Convex, who wishes to shape the world by controlling what people see.  Convex is a glasses salesmen who essentially tells us he is the Devil in using the words of Lorenzo de Medici, \"love comes in at the eye\" and \"the eye is the window to the soul\" as his formula for control: First you tempt with the forbidden fruit, then, when your victim has bitten, you take their soul.  This is done via the organ of the eye because the mind will take as fact whatever the eye shows it.  This is why it is so essential today for the faculty of critical thinking to become damaged via such institutions as the public school system and television.<br><br>Unfortunately, the opposing side does not seem to offer freedom, but some other sort of control.  A kind of confusing, chaotic and recursive control. Dr. Brian Oblivion, the inventor and first victim of Videodrome is murdered by Convex prior to the movie, and now exists only in the virtual world of video tape.  For 1983, this was the best way to convey the virtual world, as only kids played video games and most computers barely did 64K of memory. The bad thing about using videotape to represent the virtual world was that tape does not convey the fluidity of the convention.<br><br>But I digress, for Oblivion, freedom seems to be some sort of unending recursive loop, the kind you get when you hold two mirrors in front of each other. The Oblivion side does seem to be trying to help, at least, as the Doctor's daughter, Bianca Oblivion runs the Cathode Ray Mission, that tries to \"patch\" the indigent back into society by serving them a generous supply of orange juice along with their TV.<br><br>One of the reasons it is difficult to tell who the good guys are, or even if there are any good guys, is that the story is told through the eyes of Max Renn and Max is cynical little man, played expertly by James Woods, whose only concern is taking his porn cable channel to the next level and maybe getting Nicki Brand into bed. Max allows himself to become a pawn in this war and by the end of the movie it becomes clear that Max has left his humanity behind.<br><br>Sex and violence form the back drop of the movie, especially perverted sex. At least twice, Max is offered \"nice\" sex to show on his cable channel and both times he turns it down.  The importance of perverted sex and perverted violence as a plot point is that it opens certain neural receptors in the nervous system that allows the videodrome signal to get in. The bad guys in the movie, Convex and Renn's video pirate, Harlen, both moralize against this perverted sex and use it as a hook to get Max \"infected\" with the videodrome signal.  \"Why would anybody watch such a thing\" one of the bad guys preaches to Max. This was particularly effective when I first saw the movie at the age of eighteen.  I wondered if the videodrome signal was encoded in the movie.<br><br>I believe Videodrome will go down in history as the first of virtual reality movies and is still one of the best.  It not only predicted the chaos of our current time, but also the lone nut assassin epidemic that happens with increasing frequency, but as the model for Dr. Oblivion, Marshall McLuhan, said:  ESP is old hat when effect precedes cause.<br><br>Videodrome remains one of the best offerings from Cronenberg but is not for everyone.","user":"douglasp","rank":[59,69]},{"title":"Long live the new flesh!","rating":10,"date":"4 August 2006","review":"David Cronenberg has turned out a lot of films that range from the bizarre to the slightly less bizarre to the stupefying. I used to think that his update of The Fly was his masterwork, as it certainly is an improvement over the original in every sense of the word. Videodrome, however, is entirely his idea, and what an idea it is. Filmed at a time when VHS and Betamax were still at war for market share, and television was still beholden to some standard of public service, it is hard to imagine what the public of 1983 made of Videodrome. Twenty-three years on, it looks so prophetic that it is truly a wonder Sony or Toshiba are not employing Cronenberg to attempt to anticipate consumer reaction to their consumer format ideas. Shot in a Lynchian shoot-first, work-out-story-later manner, it is testament to Cronenberg's skills as a storyteller that the 'drome works as well as it does. It is also testament to the film's accuracy that in this era of so-called reality television, nobody in a remake-crazed system is trying to remake Videodrome.<br><br>Of course, in a film with a theme as speculative as Videodrome, one needs to have a reliable performer. Just like you cannot portray someone going mad with fear a la The Fly if your actor is not up to snuff, one cannot portray a weird conspiracy without an actor of James Woods' calibre. Everything that occurs on the screen from about thirty minutes in is utterly unbelievable, but we buy it because James is so good at selling it to us. His disbelief graduating into terror graduating into acceptance is the rock upon which Videodrome rests, and the respect he gained from me in my recent viewing of Once Upon A Time In America went through the atmosphere during Videodrome. So many films are made with a singular star as its entire focus. Sylvester Stallone made a few, but Woods demonstrates he is more than up to the challenge here. The James Woods of the 1980s and the James Woods post 1990 are really two different people, or so one might think after seeing a film from both groups.<br><br>The support cast are mostly adequate, with Deborah Harry demonstrating she could have been an actor. Not that she does anything particularly brilliant here, but she also manages to keep her part of the illusion solid. Sonja Smits helps twist the plot beyond its already unrecognisable shape as the daughter of one of the conspirators in the Videodrome experiment. While these two are secondary to Woods, they also add so much to the story that its hard to imagine the film without them. The world was changing in ways none could have imagined at the time, and as Harry's musical career was left in the cold as a result, her image in this film is iconic of an era. Jack Creley is puzzling as a guru tied into the conspiracy who appears only in video. To cut a long story short, Woods is a pinball, while Harry, Smits, and Creley are the bumpers off which he bounces. In that task, they do a brilliant job, and they are far from the only ones. Videodrome contains a literal cavalcade of actors one wishes they could see more of, just based on their moments here.<br><br>The summary in a previous comment says it best: \"I don't think I could provide spoilers if I wanted to\". I could tell you everything that happens in Videodrome, and it still will not even slightly prepare you for the utter bizarreness to be beheld. The imagery is both disgusting and strangely compelling, the story is beyond odd, and the references to the \"new flesh\" that pop up like skin cancer cells in the final reels are a mantra that will haunt the viewer long after the film is over. The constant images of videotapes and televisions flexing out to either imitate organic material or swallow the hero whole. It is the ultimate contradiction, that I can find this film so utterly compelling yet so utterly repulsive. There is an unofficial motto among defense lawyers: \"if you cannot convince them, confuse them\". Videodrome, thanks to its surreal imagery and story that could only be inspired by divergent thought, is both convincing and confusing. Such is the ultimate achievement in storytelling.<br><br>Fortunately, the question of whether one can separate their perception of reality from the fantasy they see depicted on a video source has been answered already. It isn't really even a question that needs asking here, as it has long been answered by film. No, Videodrome is about something more, although exactly what that is could be anything David Cronenberg desires. I chose to see it as an example of one man getting so wrapped up in his ideas or fantasies that they utterly distort his reality, an idea subtly hinted at when one character describes his hallucinations causing him a brain tumour rather than the other way around. The new flesh is the idea that drives a given machine, always mutating and altering itself. However you choose to interpret the story of Videodrome, I think the consensus we can all come to is that it is just plain odd. Most of us will never really see the things shown in Videodrome if we take a mix of heroin, crack, and LSD then wash it down with drain cleaner.<br><br>It is mostly for these reasons that I gave Videodrome a ten out of ten. You have not stretched your imagination far enough if you are completely repulsed by its imagery. Do yourself a favour and see it now. Long live the new flesh.","user":"mentalcritic","rank":[102,123]}]