[{"title":"Spielberg's Forgotten First Film","rating":9,"date":"6 June 2008","review":"After the success of Duel (which was really a TV movie) Sugarland Express (Spielberg's first feature film) flopped at the box office, though it received a reasonably warm critical response. In fact this is a great little movie for all kinds of reasons.<br><br>If you're interested in Spielberg as a director this is fascinating as it begins to lay out most of the themes that have driven his work ever since - family (especially divided and dysfunctional families), childhood, parenthood, outsiders, America and Americana etc. It's also a really interesting piece in terms of his developing style. This is the first Hollywood film in which panaflex cameras were used allowing Spielberg to produce fantastically elaborate and fluid shots even in the confines of a car (see the superb 360 pan fixed on Ben Johnson's car when he first talks to the Poplins)- a kind of cinematography that has become a hall mark of Spielberg's, as have the rising crane shots and extended tracking shots that pepper the film. Spielberg skies and \"God Light\" (his term for shafts of light in mist/at night) also feature heavily.<br><br>It's also a really interesting if somewhat unrecognised influence on films like Thelma and Louise which seems to lift its basic structure and characters right out of this film. The way Ben Johnson's Captain Tanner equates to Harvey Keitel's police officer in Ridley Scott's film seems particularly close.<br><br>Fantastic performances all round too. Johnson, Horne and Atherton (a much under-used actor who has been largely wasted since, playing roles like the self serving journalist in the Die Hard films)particularly shine.<br><br>It's also very funny, sad and engaging from beginning to end. Can't recommend this one enough - especially if you're a Spielberg fan.","user":"joshbaileynch","rank":[49,54]},{"title":"Boy, did this get great press in 1974","rating":8,"date":"9 October 1999","review":"Critics at the time were impressed by this new director, Steven Spielberg, who had previously directed Dennis Weaver in that spooky TV movie \"Duel\", but they were really impressed with Goldie Hawn, still mainly known as the blonde nitwit from \"Laugh-In\". She had been quite respectable in \"Butterflies Are Free\" in 1972, but she turned in a beautifully nuanced performance in this one.<br><br>I would certainly argue with any notion that this film is \"underrated\". It's always been well regarded, even back in the days when Spielberg was known as the clever kid who made \"Jaws\". That doesn't mean it has ever been easy to see.<br><br>Now, with the passage of time, \"Sugarland Express\" looks even better than it did in the 1970's. One still has no trouble at all getting caught up in the quixotic mission of these characters.","user":"Varlaam","rank":[50,61]},{"title":"Early Spielberg is just as fun as any Spielberg","rating":8,"date":"8 August 2011","review":"There's something so incredibly fascinating about watching the humble beginnings of a director as renowned as Stephen Spielberg. The Sugarland Express is one of his earliest films and it is not of the calibre of films like Jaws, Close Encounters of the Third Kind, and the Indiana Jones franchise, but it still remarkably entertaining. It tells the story of two lovers who go on a mad run from the law in order to kidnap their son from his foster parents. Lou-Jean, played by Goldie Hawn, breaks her husband, Clovis, out of jail in order to do so and this sparks mad paranoia in the two. The run from the law doesn't occur until the two kidnap a policeman and his vehicle, forcing him to drive them to Sugarland, Texas in order to find their baby boy. This is a wild, exciting, often hilarious film, and to top it all off it's based on a true story.<br><br>I think what defines this film more than anything is the distinct new Spielberg smell. It has all of the things we recognize from the bigger Spielberg films, just on a much smaller scale. The dialogue flows so naturally and fits right in with the action and camera work of the film. There are lots of familiar camera techniques in the film, especially the fluid camera movement that goes on within the confines of the police vehicle, where a lot of the film takes place. Nothing is as grand and widespread as Spielberg's classics, but anyone who respects the genius can respect this film for what it is because, like it or not, this is where it all began.<br><br>But not only is The Sugarland Express a fascinating look into how Spielberg got his start, it is also just an incredibly fun film. Goldie Hawn plays the border line psychopath mother perfectly. She wants nothing more than to see her baby boy again, and she won't let anything stop her. The film hits both ends of the spectrum very nicely. A lot of it is very comedic, ranging from cleverly hilarious to downright goofy at times. Yet there are also moments of sincere dramatic tension. Through all of the offbeat wackiness, the film never forgets the situation it is dealing with. Despite everything, it is still two convicts running from the law, a subject that the characters must handle with care. And the film brings this to light very well, as it is very gripping at moments, and almost touching at others.<br><br>The Sugarland Express isn't much more than a very exciting adventure story with some enticing moments of drama thrown in, but you have to love it for that. It doesn't try to be much more and it pulls off everything it wants to deliver with a lot of talented finesse and grace. This is not a film to miss. It's only mistake was coming right before Jaws, a masterpiece that overshadowed it greatly, hence why we know that name, but few of us have heard of the pleasant little gem that is The Sugarland Express.","user":"KnightsofNi11","rank":[16,20]}]