[{"title":"So potent, I remember it well after 43 years","rating":7,"date":"4 December 2014","review":"We actually saw this on original release in 1971 in the old downtown Tucson theater. We walked a few blocks home to the delightfully serene ex-mortuary we rented during our college years and were compelled to discuss it for hours. Such was the emotional pull. After seeing Max in a few more intriguing films as this, he became my favorite actor for many years. He really knew how to pick clever roles. Like Jack Nicholson! Or, Michael Caine for a British actor. Along with the compelling interplay between him and old pro Trevor Howard, it makes this movie a must see for fans of the off-beat. His character, as the dark plot evolved, begged the question: \"Is he crazy-or genius?\" Definitely, an underrated and under-viewed film for many years.","user":"thedesertraven","rank":[24,25]},{"title":"Excellent lost 70's chiller - HIGHLY RCOMMENDED","rating":9,"date":"19 March 2006","review":"I remember catching 'The Night Visitor' on UK late night TV in the late 70's. At that time I'd not heard of it but was hooked from the outset. Many of the haunting images stayed with me and recently I got all nostalgic and started searching for either video or DVD releases of several lost gems from the early 70's, amongst them 'And Soon The Darkness', 'I Start Counting' and of course 'The Night Visitor'. Success!!! as all titles were available on DVD (some are deleted from obscure labels but all frequently pop up on Ebay for reasonable amounts). Strangely, having caught up with several long forgotten film or TV shows from my childhood, most have been disappointing, however 'The Night Visitor' retains it's menacing, almost surreal air and Max Von Sydow carries the film with great support from Trevor Howard (who seems to be setting the tone for his later appearance in 1973's 'The Offence') and I even recalled Arthur Hewlett as the prison guard with the gnome-like features. All in all a MUST for any Von Sydow fan and any lover of quirky psychological thrillers, low on budget but high on plot and intrigue.","user":"GarethG","rank":[32,35]},{"title":"Chilly tale of axe murder and madness","rating":6,"date":"13 October 2015","review":"I guess that if Ingmar Bergman had ever made an out-and-out horror film, THE NIGHT VISITOR is what it would have looked like. This obscure USA/Sweden co-production brings together two of Bergman's favourite actors (Max Von Sydow and Liv Ullman) in a tale of madness, desperation, revenge, and sinister murder. It's quite a vicious film even though the on-screen violence is limited and the viewer never sees much of what's actually taking place.<br><br>The film's chilly, snowbound northern setting (Jutland) is as much a character as the cast themselves, and the story certainly has a unique feel to it: slow, stately, very much like an art-house film, but with dark revenge/thriller plotting. I liked it; there's style to spare, and some ingenious situations as we see Von Sydow's character putting the impossible into action.<br><br>The film is also notable for an exemplary cast. Aside from the Swedish luminaries, we get a real old timer as the detective (Trevor Howard) alongside popular Swedish actor Per Oscarsson, and supporting roles for two Hammer star Brits, Rupert Davies and Andrew Keir. THE NIGHT VISITOR certainly isn't for all tastes, but it's an odd film indeed: quiet and yet spellbinding at the same time.","user":"Leofwine_draca","rank":[16,17]}]