[{"title":"The director","rating":7,"date":"19 March 2010","review":"Los Angeles is a city where one can find, almost at every turn, a director, a starlet, a producer, or a cinematographer if one happen to be in the right places. Nick Chapman, a young man from Ohio, is trying his hand at directing. We meet him as he is going to an award ceremony at an event where the best new short film directors are competing for a prize and a chance to make it in the business. Nick is not prepared for what happens after his film becomes the talk of the town.<br><br>Nick Chapman is in a relationship with Susan, an architect just starting her career. His good friend is Emmet Sumner, a cinematographer struggling to make it in the industry. Nick is being courted to sign in with different people so he can go to his next project. He has written a screenplay for a film that he wants to direct. Never, in his wildest dreams, he never imagined the strange world he is getting into, and the weird people he will have to deal with while getting his picture produced! For starters, Nick's agent, Neil Sussman, whom we meet during a luncheon at one of those trendy restaurants, is a creature from another planet.<br><br>The next person Nick gets involved with is Allen Habel, a producer that sees potential in Chapman. As Nick pitches the film, Allen is already changing the way he feels will attract viewers, which has nothing to do with the original concept. Allen wants to set the picture on a beach, not in a cabin in the woods, while it is snowing, as Nick has conceived it. To make matters worse, Allen invites the young man to a party at his house that turns out to be a disaster as Nick gets to meet the film capital's fauna and flora, and ends up losing Susan.<br><br>Nick gets dazzled at first, but when Allen Habel's business goes bad, he is left on his own. Added to all that, he doesn't have any money, so he has to look for any kind of job in order to survive. All his big shot friends drop him like a hot potato. No one will take his calls. Nick having broke with Susan and having betrayed Emmet, finds himself alone in the middle of all that phony world, until he meets a rock band and he makes a video of a song that becomes a hit. It is at this point Nick gets his creative powers back and as we leave him, he is directing his picture the way he wanted.<br><br>Christopher Guest, a witty genius in his own right, directed this movie, his first full length film. \"The Big Picture\" shows a great talented director that knows well that strange world of glitter and heartaches that is Hollywood. Christopher Guest has been involved in the movie industry for most of his life and it shows.<br><br>Kevin Bacon is an asset in any picture where he appears. His take on Nick Chapman is dead on. Mr. Bacon is an excellent actor, as he shows here. It is unfortunate Martin Short, who steals every scene he is in didn't get credit for being in the film. His agent must be a composite on the many characters the director, and him, must have met, at one time, or another.<br><br>Christopher Guest has a group of actors that are featured in his films. Michael McKean and Mr. Guest have a long history of collaboration. The late J.T. Walsh gives one of his best performances as Allen Habel. The rest of the ensemble cast is also notable, Teri Hatcher, Fran Dresher, and a goofy Jennifer Jason Leigh, among others.<br><br>Never having seen this film, we were lucky to catch it recently and it was worth the wait.","user":"jotix100","rank":[9,9]},{"title":"Under-rated film of the 80's","rating":8,"date":"10 July 2010","review":"This is an under-rated late 80's film that captures the changing entertainment scene of that decade, with much humor and irony. <br><br>While the usual \"Hollywood is phony\" theme exists here, that story is always interesting, and it really scores when it reminds us of how success can be gained and lost quickly. <br><br>Martin Short is the uncredited star here, with a couple of hilarious scenes, the best one at the outdoor patio restaurant where he praises Bacon without knowing any of his work. All in all, a nice movie about movies, with some special surprise locations for movie buffs!<br><br>The late J.T. Walsh offers a subtle performance here, with one of my favorite (perhaps a somewhat spoiler line, but nothing to do with the plot)...Bacon: \"I'm from Ohio\", with Walsh's comeback, \"my first wife is from Illinois\", as in everything outside of LA is one place. Perfect deadpan humor.","user":"pwalkerfm","rank":[11,12]},{"title":"funny, slightly uneven \"insider movie\"","rating":7,"date":"6 September 1999","review":"This movie has some slow moments, and I found the idea that Kevin Bacon's character, an aspiring directory, would leave his girlfriend (played by Emily Longstreth) for a bimbo-actress (played by Teri Hatcher and one of the film's weakest characters) pretty unconvincing. In general, I found the bimbo-actress subplot poorly done, and this was the slowest part of the movie. The other characters were done well, with an outstanding cameo by Martin Short as the aspiring director's agent -- the three scenes with Short would make the movie worthwhile by themselves in my opinion. J. T. Walsh was very good as well, as the fatuous studio head, and the gag at the end where the young director's career is revived was very enjoyable.<br><br>It's not as good as \"The Player\" or \"Get Shorty\", but if you like movies about making movies, you will probably like this one.","user":"hbs","rank":[22,27]}]