[{"title":"Exquisite Lubitsch's work","rating":10,"date":"11 January 2001","review":"\"Heaven Can Wait\" lies among Ernst Lubitsch's best movies, and that's largely enough to ensure that it is a masterpiece.<br><br>It is the exquisite story of the women-devoted life of a never-repenting Casanova, from childhood through old age, death, and even after-death. We find Lubitsch's trade-mark elegant sense of humor, perfect timing, sharp intelligence. There is also a rather deep, though cheerful, representation of common, typical sides (faults, to say better) of a male character: shallow sentiments, selfish approach to a woman's true love, childish refuse to accept years passing.<br><br>The stars Don Ameche, Gene Tierney, Charles Coburn make a superb work. However, a main credit of the film is the cast of incredibly nice actors (willingly?) gathered by the director. The Devil himself (Laird Cregar) is likeable, with his perfect manners and friendly approach! We are unable to dislike even those shrewish old rich women, who pop out along the movie. It's impossible to give the deserved credit to all those wonderfully talented supporting actors. Let me mention the delightful butler Jasper (Clarence Muse), with his role of ambassador between Mr. and Mrs. Strabel.<br><br>\nTo be personal, I'm very fond of \"Heaven Can Wait\", since it was my first encounter with Gene Tierney. When she appeared on the screen I couldn't believe my eyes: \"Who, who, who is this girl? I'm dreaming or what? Does this girl actually exist?\" Honestly, I felt dizzy for the remainder of the movie.<br><br>Only after repeated views of \"Heaven Can Wait\" I was able to distract my eyes from Gene, and fully appreciate the great merits of this magnificent, highly-recommended Lubitsch's masterpiece.","user":"pzanardo","rank":[65,81]},{"title":"Birthdays","rating":8,"date":"21 May 2005","review":"Ernst Lubitsch was a man destined to take the play in which this film is based to the screen. The results are amazing. This 1943 movie continues to charm audiences after all these years. Credit must go to the great Lubitsch who shows his light touch on this delightful comedy.<br><br>Since the film is based on the play \"Birthday\", by Leslie Bush-Fedeke, the main idea behind the action is to present us Henry Van Cleve as he ages. The film opens as Henry is descending a long flight of stairs. He is an old man now. Henry meets an elegant man at the desk who will decide whether he will go down to hell, or to heaven. The story then goes back in flashbacks to show us what this Henry was really like while he lived.<br><br>Henry Van Cleve is part of a wealthy family from New York. When the film opens Henry is celebrating his 10th birthday. This involves being introduced to a French governess who will transform the boy for life. Then we see Henry as he is going to celebrate his 25th birthday. This is a most important date for him because he meets and falls in love with the lovely Martha Strabel, a beauty from Kansas, that is his idiotic cousin's fiancée. Needless to say, the handsome Henry falls in love with her and they elope.<br><br>Life has a way to get in the way of Henry as we see how he is handed tragedy when he loses his lovely Martha when she becomes sick. Ultimately, Henry himself, a mere mortal, dies after a long life that has been spent alone, living dedicated to his own son.<br><br>\"Heaven can Wait\" is a lovely film. Much credit has to go to its stars, Don Ameche and Gene Tierney, who make an excellent couple. They were at the top of their careers and guided by Mr. Lubitsch, their romance, while sweet, it's not sugary. Ms. Tierney's beauty adorns this film and Mr. Ameche is seen at his suavest self.<br><br>The supporting cast was a director's dream come true: Charles Coburn, Marjorie Main, Eugene Palette, Spring Byington, Louis Calhern, Laird Cregar, among others, give the film the elegance that Mr. Lubitsch used so well to enhance the movie.<br><br>A classic that will live forever!","user":"jotix100","rank":[33,41]},{"title":"Lubitsch comedy masterpiece","rating":10,"date":"16 August 2000","review":"Do NOT confuse this comedic gem with Warren Beatty's 1977 film of the same name -- that was actually a remake of a different 40's classic, \"Here Comes Mr. Jordan.\"  But, this is much better, and even more imaginative.  Ameche is brilliant, versatile, and amazingly handsome as the protagonist.  Laird Creagar is excellent as Lord Satan, and Allyn Joslyn and Eugene Palette head a great supporting cast.  One of the wittiest comedies ever made.  Don't miss it.","user":"oh madeline","rank":[54,71]}]