[{"title":"Dream-like giallo like no other","rating":28,"date":"28 October 2001","review":"By 1974 the giallo genre was running out of steam and the films were getting more complicated, more violent and altogether weirder in an attempt to keep viewers coming. Director Umberto Lenzi made two that year, this one and the equally absurd Eyeball, leaving one to hope that Lenzi was putting the audience on and not the stark raving lunatic the films give the impression he was. Whereas Eyeball is a more conventional giallo, with a hooded killer picking off a variety of unwitting victims, Spasmo is more of a \"Gaslight\"-inspired venture. Someone may be trying to drive the irrepressible Robert Hoffman mad, but he needs little help, and the last fifteen minutes contain the strangest twists I've yet seen in a giallo. Those looking for a stylish thriller will be disappointed by the plant-the-camera-and-shoot direction, and don't expect anything like a plot that's worth following or characters with any relation to human beings. What makes it worth seeing is the genuinely dream-like story, linear yet impossible to follow, and the way each sequence transition requires a twisted justification by the viewer to accept that Yes, maybe it is possible that someone would do this. Here and there a haunting Morricone score comes in, sad and lovely as the one in \"My Dear Killer,\" and there are inexplicable scenes of an unseen man stabbing female dolls, his identity revealed only at the very end in one the finale's many left-field twists. The only giallo remotely comparable to this one is Death Laid An Egg, and at least that had the excuse of being from the 1960's and (I assume) the use of mind-altering chemicals by its creators. I can't imagine what state of mind the filmmakers of this mini-classic were in while making it, but you'd be hard-pressed to find another film like it.","user":"Wheatpenny","rank":[21,29]},{"title":"Brothers in harm.","rating":25,"date":"25 January 2007","review":"We feel the Argento influence all along the viewing,but \"spasmo\" in spite of a low budget and mediocre actors -with the eventual exception of Ivan Rassimov- is a good thriller,absorbing ,nay original: I dare you to guess what the hero is really up to.When he appears he seems to be a handsome young man ,sure of himself and of his charm but little by little,cracks appear in the mirror.The character's evolution is anything but predictable.There's<br><br>also his brother who is widely talked about,but who only appears after one hour.The traditional flashbacks are replaced by a home-made movie where Lenzi films the looks -sometimes we do not know whose look it is anymore:Christian?Fritz?.And the last picture is really scary ,without any blood at that.Some of its scenes predate \"fight club\" and the industrial landscape with its sinister factory gives goose flesh.<br><br>Perhaps in the first minutes ,you may feel like giving up.Don't.It's a film which grows on you.","user":"dbdumonteil","rank":[4,4]},{"title":"Trippy giallo by Lynch ... I mean, Lenzi!","rating":7,"date":"22 March 2010","review":"Umberto Lenzi's \"Spasmo\" is a very weird little film, even by gialli standards. It's a strange combination of Jean Rollin (the middle part in particular feels like something straight out of a Rollin film, in particular \"Fascination\") and David Lynch, so much so that one can argue how director Umberto Lenzi might be something of a poor man's Lynch. Nonetheless, it works, even if it takes itself way too seriously, often getting surrealism mixed up with cheesiness. The dialog is awfully goofy, and the script jumps all over the place. This might've been Lenzi's intention, and here, he shows that he is actually a pretty competent director, creating genuine suspense as well as some of the most haunting imagery in a genre film. Ennio Morricone's equally dreamy soundtrack perfectly matches the disorienting set pieces and it's perverse sexuality, and it's quite possibly it's highlight alongside the gorgeous cast of women. For those reasons alone, it might not be everyone's cup of tea, also considering how it's pretty tame compared to the works of Fulci, Argento or even Bava, but I love this kind of bizarre cinema, and I don't think the lack of extreme violence and nudity hurt the film at all. So overall, a 7/10 for me - a flawed but throughly entertaining and somewhat obscure piece of Italian horror.","user":"matheusmarchetti","rank":[11,15]}]