[{"title":"Smell the Glove!","rating":10,"date":"5 November 2002","review":"The humor of \"This is Spinal Tap\" has a special time-release formula.  I didn't find myself rolling on the floor laughing the first time I saw this but as the day went on my friends and I couldn't stop recalling the dialogue.  This movie is a legend.  <br><br>   \"See Spinal Tap\" should be written in the dictionary next to satire. Lately satire has come to mean a simple mockery of pop-culture instead of \"human vice or folly attacked through irony, derision or wit\".  Movies like \"Scary Movie\" claim to be parodies or satire without even trying to be witty.  They just imitate something as opposed to commenting on it.  True satire takes a bit more work by the writers and will make you laugh much harder.<br><br>   Spinal Tap gives you the absurdity of the rock and roll world, yet still respects the music.  I understood this when I saw a clip of the movie for the first time at the Rock and Roll Hall of Fame.  It was the scene with amps that go to \"11\".  I couldn't stop thinking about that scene until I finally saw the movie.  Every aspect of the music world is lampooned; arrogance, absurdity, backstage crybabies, has-beenism, volume, even the Beatles.  This movie is quoted like the Simpsons, which isn't always good but certainly proof of legendary movie.  It's dry, deadpan humor and it may take a day to sink in but this movie is hilarious.","user":"freenachos","rank":[80,89]},{"title":"Still the funniest rock'n'roll movie ever, and one of the best DVDs on the market.","rating":9,"date":"9 October 2002","review":"'This Is Spinal Tap' has been part of my life for so many years that it's hard to remember a time when I hadn't seen it. Having recently bought it on DVD and rewatched it for the nth time I was once again struck and just how clever and amusing this movie is. Christopher Guest and friends are not only very talented comedians with an amazing ability to improvise, but they know their music, and this is the real strength of the movie. Even though I have almost memorized every scene and joke it's STILL funny to me no matter how many times I watch it. Not only is the movie itself a classic, but the DVD is one of the best buys around with plenty of extras, deleted scenes, many as good as those chosen, and best of all a hilarious commentary by Tufnel, St Hubbins and Smalls which is even funnier than the movie itself. In fact it's the most entertaining DVD commentary track I've heard to date. This movie is a comedy classic, and easily the sharpest rock'n'roll parody ever made. If you haven't seen it before you're in for a treat! Absolutely essential viewing for all rock'n'roll fans, metal or otherwise!","user":"Infofreak","rank":[130,150]},{"title":"Band On The Run","rating":9,"date":"13 January 2004","review":"The gritty, unpretty reality of rock music is on display in director Marty DiBergi's unsparing rockumentary \"This Is Spinal Tap,\" which chronicles the British metal band's tour through the United States in the latter part of 1982.<br><br>Cold sores, drugs, late-night debauchery, and the brutal snubbing of a Sinatra-loving chauffeur are just some of the antics on display, in what could be the most penetrating and uncensored examination of the rock n' roll lifestyle since \"Gimme Shelter.\" Whereas that movie features one grainy, out-of-focus killing, this film actually shows the band's drummer spontaneously combusting on stage! And apparently this was the second time that happened (or maybe I'm thinking of the drummer they lost to an unexplained gardening accident, I'm a little unclear.)<br><br>DiBergi hasn't made a movie since \"Spinal Tap,\" which is a shame. No chance he'll make a sequel though. In the 2000-issue DVD, band members Nigel Tufnel, David St. Hubbins, and Derek Smalls make clear that they feel betrayed by DiBergi's work, calling it \"a hatchet job\" and hinting that his jealousy about not being the sixth band member caused him to show only the band's bad side. For example, we see in the movie Spinal Tap backstage at Cleveland's legendary Xanadu Star Theater wandering fruitlessly through a warren of back corridors trying to find their way onto the stage. Nine times out of ten the band found their way on stage without problem, as they point out on the commentary track, but DiBergi has to show the one time they don't.<br><br>Murphy's Law seems to predominate elsewhere, too, like when Nigel's back gives out in the middle of a blistering solo, or Derek is trapped in a giant peapod prop for an entire song. Viewers of a particularly cruel disposition may even find some cause for amusement when a misunderstanding in Austin, Texas leads to the band performing their legendary number \"Stonehenge\" in front of a model of the ancient monument that barely comes up to the drummer's kit. Maybe they could have gotten away with it if they didn't let the dwarfs come onstage and dance alongside it, but the result, as St. Hubbins notes, is almost \"a comedy number, and I didn't bloody appreciate being part of the comedy.\"<br><br>The band struggles on, and perceptive viewers may detect a slight note of friction between Tufnel and Jeanine, St. Hubbins's girlfriend, for example when Tufnel throws his guitar down on stage, stares at Jeanine accusingly for a minute, and then quits the band. Misogynists will say Jeanine is the kind of rock wife that 'puts the yoke in Yoko,' but they shallowly ignore her tambourine-playing, or her fearless use of red satin as a pant fabric.<br><br>Admittedly, Jeanine is less on point as a manager, as an early gig under her control at an amusement park finds them billed under their opening act. 'If I told them once, I told them a thousand times,' she muses. 'Put the band's name first, puppet show after.'<br><br>But the band soldiers on, and by the end, you will be glad you stuck around, too, rough as it is to see the harshness on screen. It's the kind of documentary that demands periods of quiet reflection to take it all in, to register the pain, sweat, and unpleasant odors behind the entertainment we too often take for granted on the radio.<br><br>Sadly, the film doesn't feature a complete version of Spinal Tap standards 'Hell Hole' or the big-in-Japan 'Sex Farm.' We do get a full-throated version of the classic 'Big Bottom,' a power ballad which examines the seat of female beauty with a wry Steely Dan-type lyrical subtlety: 'Big Bottom/Big Bottom/Talk about mud flaps/My girl's got 'em.'<br><br>Why don't they make songs like that any more? I give this film a 9 out of 10, but with the DVD commentary, you gotta boost that to 11. Rock on, Tap!","user":"slokes","rank":[115,146]}]