[{"title":"Natural Born Vampires","rating":9,"date":"23 August 2004","review":"Caleb, a young cowboy out for a night of fun, meets Mae, a beautiful and mysterious young girl with whom he becomes instantly besotted. Mae is a strange young woman who runs off at the first sign of daylight...but not before biting Caleb on the throat. As the sun rises higher and Caleb finds himself suddenly sick and getting steadily worse, a van load of drifters stop and all but kidnap him within sight of his father and younger sister. In the van is Mae and her \"family\" - a group of outlaw vampires who are not too thrilled with the addition of Caleb to their group. Led by 300+ year old Jesse, his woman Diamondback and the brutal Severen, the vampires reluctantly show Caleb the ropes as they drift across the Midwest. But Caleb's father and sister are looking for him, and soon Caleb will have to choose between his old family and his new one.<br><br>This is a stunningly innovative and brutally bloody vampire film which never once uses the word \"vampire.\" The dirty, cruel, white trash bloodsuckers could be anyone on the run from the law. This is almost more of a crime spree/road story a la \"Natural Born Killers\" than a horror movie, and this is exactly what makes it so effective. Stand out scenes include a slaughter at a honky tonk and a shootout at a hotel in the daylight hours. The characters are all well-drawn and complex and the stark scenery throughout - filled with dust and desert and not much else - just adds to the overwhelming sense of isolation, emptiness and death. The murders are incredibly sadistic and gruesome and should please gore fans. The ending - though it disappointed many - is simplistic and surprisingly upbeat, just adding to the grim fairy tale mood of the story. 9 on a scale of 10 for this powerful, desolate vampire tale.","user":"Gafke","rank":[58,70]},{"title":"and they didn't even say the 'V' word!","rating":10,"date":"14 January 2006","review":"One of the best modern vampire flicks around is this stylish, funny, and all around adventurous cult classic.<br><br>Young cowboy is literally bitten by a beautiful stranger and ends up joining a band of blood-suckers who roam the American heartland.<br><br>Although Near Dark is often over-shadowed by the ultra-hip vampire movie The Lost Boys (1987), Near Dark is a far more juicier treat for horror fans. Eric Red, who also wrote The Hitcher (1986), gives us a seemingly old-fashioned tale of struggle between human nature and savage lust with a nicely spun sense of modernism. Not to mention plenty of touches of dark humor. It's a story that does well with avoiding the obvious clichés of the vampire genre. Director Kathryn Bigelow gives this film terrific style, not only adding scenic beauty but sharply creating plenty of intense action sequences. Near Dark also packs some great makeup FX and occasional gore. The entire sequence in the bar has became a favorite among many. Adding even more to the film is the beautiful music score by Tangerine Dream.<br><br>The cast is quite good. Adrian Pasdar is believable as our formerly-human hero. Lance Henriksen is genuine in his role as the leader of the vamp' band. However it's young Bill Paxton who does most of the scene stealing (and the comic relief) as a scary, yet cheeky vampire thug.<br><br>A modern vamp classic that delivers on all levels, Near Dark firmly remains a favorite of the genre and one of the most entertaining horror films of the 80's.<br><br>**** out of ****","user":"Nightman85","rank":[71,90]},{"title":"\"We keep odd hours.\"","rating":15,"date":"15 September 2003","review":"Near Dark is the definitive vampire road movie.  It's the most realistic and non-traditional portrayal of vampires in my mind.  They're cruising the country...you know, just bored.  And wouldn't they be bored?  I mean if you live forever, wouldn't you run out of things to do?  They spend their time getting in and out of trouble.  And that's all they do.  I love it.  The cast (Aliens anyone?) is top-notch.  Adrien Pasdar is as underrated as they come.  He plays our likable hero who gets involved with our gang of vamps by accident.  Lance Henriksen, Bill Paxton, Jenette Goldstein (all from Aliens), Jenny Wright, and Joshua Miller are all perfectly cast as the nocturnal family.  Miller, oddly enough, is Jason Patric's half brother and Near Dark was released just a few weeks after The Lost Boys.  Henrikson is appropriately evil and Paxton's Severen character is highly quotable and memorable.  Tim Thomerson and James Le Gros also put in an appearances. Eric Red's script is every bit as cool as his earlier road movie, The Hitcher.  Kathryn Bigelow will go down in my book as having directed the best vampire flick that I can think of. <br><br>Note for genre buffs: The word vampire is never used in the film.","user":"Backlash007","rank":[77,102]}]