[{"title":"Glorious, demented, insane, has to be seen to be believed. Humankind's greatest achievement?","rating":9,"date":"9 December 2008","review":"Did director Tobe Hooper, writers Dan O'Bannon (\"Alien\", \"Return of the Living Dead\") and Don Jakoby (\"Blue Thunder\"), in addition to some uncredited writers who presumably did rewrites of the original script, or any of the cast actually think they were making a good movie during the production of \"Lifeforce\"? The movie gets progressively wackier, more disturbingly bizarre, hilarious, over-the-top, and greater by the minute. When you think that the movie couldn't possibly become more demented, that it was already as nutty as anything could possibly be it outdoes itself. I really don't know if this was at any point supposed to be tongue-in-cheek, if anybody involved thought it was genuinely creepy or effective, or if they were just too distracted by Mathilda May's exquisite breasts and rear end to care, but the end result is quite simply one of the greatest films ever made.<br><br>Here are some reasons why \"Lifeforce\" is perhaps humankind's greatest achievement to date (and probably impossible to surpass): <br><br><ul><li>Mathilda May is nude for the entirety of the film, and she is \"the most overwhelmingly feminine presence\" you will ever see. Yes, that is a quote from the film. </li></ul><br><br><ul><li>Steve Railsback gives one of the most gloriously, hilariously over-the-top performances in the history of film.</li></ul><br><br><ul><li>It is, to quote a fellow IMDb member, 'the greatest naked space vampire zombies from Halley's Comet running amok in London end-of-the-world movie ever made'. Yes, that is actually the plot. </li></ul><br><br><ul><li>Frank Finlay, Peter Firth, and Patrick Stewart embarrass themselves.</li></ul><br><br><ul><li>Special effects and design that are actually good, adding to the suggestion that someone somewhere actually took this thing seriously, which is quite a disturbing thought.</li></ul><br><br><ul><li>Unbelievably stilted delivery of some of the finest dialogue known to man, examples of which include:</li></ul><br><br>\"She looks perfect. I've been in space six months and she looks perfect to me.\"<br><br>\"\"Don't worry, a naked woman is not going to get out of this complex.\"<br><br>\"Despite appearances this woman is a masochist, an extreme masochist.\"<br><br>\"He too needs feeding.\"<br><br>\"She's totally alien to this planet and our life form... and totally dangerous.\"<br><br>\"I'm Colonel Cane.\" \"From the SAS?\"<br><br>\"It was two hours ago that the guard was attacked. I wouldn't be at all surprised if we're seeing a pattern here.\"<br><br>\"Colonel, take it from the beginning. Assume we know nothing... which is understating the matter.\"<br><br>Colonel Cane looks at a shriveled corpse, then asks: \"and this was murder, you say? \"<br><br>\"Lifeforce\" is not merely another 'so bad it's good' movie. It is not an example of a film made by individuals with ambition far beyond their reach. No, it is quite simply THE most audacious, spectacular, hilarious, absurd, insane, riotous, crazy, deliriously demented science fiction film of all time. I cannot fully articulate why it is deserving of being one spot ahead of Samuel Fuller's \"Pickup on South Street\" on my list of favorite films, but I do know that it is. \"Lifeforce\" elevates craziness to an art form. Quite possibly the most entertaining film known to man, and perhaps our greatest achievement as a species.","user":"ametaphysicalshark","rank":[167,183]},{"title":"A force to be reckoned with","rating":9,"date":"3 December 2002","review":"The Cannon Group has always seemed like the movie studio equivalent of the engine that tried and tried to climb that mountain, but unlike it's children's book counterpart, never seemed to reach the top.<br><br>\"Lifeforce\" is the exception.<br><br>In fact as space-vampire-movies go, this is the best, which of course on the subject of space-vampires... isn't saying much. But \"Lifeforce\" really is a memorable ride.<br><br>From the director of \"The Texas Chainsaw Massacre\" and \"Poltergeist\" comes this massive apocalyptic science-fiction and horror epic. It's \"2001\" and \"Dawn of the Dead\" all rolled into one juicy little egg-roll of a movie, spiced with the beautiful naked body of Mathilda May (if she's smart she would start mathildamay.com and sell signed \"Lifeforce\"-pictures, and make a fortune of perverts like me). It's scripted by none other than Dan O'Bannon (Alien, Return of the Living Dead, Total Recall) and the cast is great. Frank Finlay looks like Peter Cushing's second cousin just escaped from a Hammer Horror movie, and it's always nice to see Michael Gothard (God rest his soul) who played creepy Emile Locque in \"For Your Eyes Only\". Steve Railsback is good as always, and Peter Firth perfectly fits the part of the SAS-colonel who must save the day (he always reminds me of the 1980's 'Doctor Who' Colin Baker :)<br><br>The 25 million dollar budget looks like 50 million dollars, the f/x are first-rate but best of all: a rousing score by Henry Mancini! His \"Lifeforce\"-theme should deservedly rank with the all-time great sci-fi-themes. It's almost hard to fathom that the composer of \"Breakfast at Tiffany's\" and \"The Pink Panther\"-movies, so known for his romantic music, should actually be able to produce such a bombastic score. It's like he kept it all in for 30 years and then suddenly decided to blow it all off on the soundtrack of this movie, and nobody needs to clean up after him - it's that brilliant!<br><br>When history is to be counted, this is one of the movies the Cannon Group will be remembered for, together with \"Bloodsport\", \"52 Pick-Up\", \"Hanoi Hilton\" and \"Missing in Action\" (come on, Chuck ruled as Braddock). And it only took 60 or so movies to create five good ones :)","user":"Renaldo Matlin","rank":[80,96]},{"title":"A movie that truly does have to be seen to be believed.","rating":8,"date":"14 November 2000","review":"** and 1/2 stars out of **** Lifeforce is one of the strangest films I've ever seen, so ridiculous, yet at the time it's strangely compelling and never the least bit dull.  Whether it's due to the nonstop nudity, the large amount of violence and action, it all comes together to make an entertaining 2 hours of cinema.<br><br>The spaceshuttle Churchill has been sent to investigate Halley's Comet when they detect something hiding inside the coma of the giant rock.  A small team, led by Colonel Carlsen (Steve Railsback), has been sent to search the area.  What they discover includes hundreds of frozen bat-like creatures and three nude and seemingly unconscious humanoid beings inside strange crystalline containers, two male and one female (Mathilda May).  They decide to take all three back with them, which results in a catastrophe.<br><br>When London receives no response from the crew, another crew is sent to find out what's going on.  When they dock with the Churchill, they find the remains of the crew, all dessicated beyond recognition.  The humanoids are still in perfect condition, and they take them back to London.<br><br>After various tests, the scientists still don't know what these beings really are.  Then, late one night, a security guard in the compound feels compelled to enter the room the female is being held.  He touches her shoulder, and she awakens, stands up, and smiles at him in a seductive and wicked manner.  She approaches him, and begins to kiss him, when it becomes clear that she's actually taking his lifeforce, sucking him of all of his energy (the effect is slightly cheesy).<br><br>She escapes from the compound and begins to leave a trail behind.  Another man, Colonel Caine (Peter Firth), is brought in to track her down.  Then the men discover that there is a pattern to the lifeforce process.  The corpse of the security guard awakens in 2 hours, and takes the lifeforce of a doctor.  It seems in every 2 hours, this process is repeated by a victim. With the help of the Churchill's sole survivor, Carlsen, they attempt to track the girl down before it's too late.<br><br>Lifeforce is pretty good late night entertainment.  It has all the elements one could look for in such a movie, loads of nudity, blood/gore, and plenty of special effects.  This is certainly better than a similarly plotted film, Species, thanks in large part to a more riveting finale.<br><br>The performances range from decent to terrible.  Faring the worst is easily Steve Railsback, who overacts to no end.  Much better are Peter Firth, who comes through and convincingly, and the gorgeous Mathilda May (she's as beautiful as French actresses Sophie Marceau and Emmanuelle Seigner).  May does go through virtually the whole role without wearing clothing, and there were reports that it was hard on her while filming, so the fact that she is able to go through every scene without fidgeting and looking uncomfortable is impressive.  There are times when she can be quite creepy, being simply seductive.  Most of the film manages to work because of her.","user":"jiangliqings","rank":[98,119]}]