[{"title":"An awesome premise, but it's not developed enough","rating":6,"date":"18 March 2005","review":"The underlying idea in \"Pet Sematary\" seems to be that when people are brought back from the dead, they have all their brains, but no souls. Definitely a cool idea, but for some reason it is never expanded, explained, or even mentioned. Theology aside, even the science of what's going on is unclear. How come Timmy, when raised from the dead, staggers around like your run-of-the-mill zombie, while little Gage actually seems smarter and suddenly knows how to operate a telephone? It's all very sloppily done. In fact, the only explanation at all for why the cemetery does what it does is that the ground is \"sour.\" Sorry, but that doesn't really cut it for me. If the movie had focused more on the mystery of the cemetery, it would have been a fantastic thriller. Unfortunately, it ditches the interesting stuff, and instead turns into a \"Tales of the Crypt\" episode about a crazy toddler with a knife.<br><br>Of course, there's still a lot to like about this movie. If it's main intention is to scare you, it certainly does it's job. The scene with Zelda is one of the scariest things I've ever seen, and the death of Gage is very upsetting and hard to watch. The mysterious Judd is arguably one of the coolest movie characters of all time (and to be honest, I was so upset when he died, I completely lost interest in the rest). And while at first it seems a bit odd for a zombie with half his head missing to be the comic relief, somehow it works. But even though it has its good parts, not nearly enough attention is given to the intriguing premise, and it ultimately turns into a cheesy spook story. Too bad, because it could have been a lot more.","user":"Chromium_5","rank":[74,89]},{"title":"Sometimes, \"READ\" Is Better...","rating":7,"date":"5 December 2008","review":"Making a book into a movie by following the story page-by-page is NEVER a good idea. When people read the book, they automatically start making their own \"mental movie\" of who the characters look like, the places they exist in, how the situations progress. And everybody's mind's-eye opus is different, which is why when the 'REAL' movie finally comes out, you're always going to have a ticked-off segment of the movie-going audience who are disappointed that it just doesn't measure up.<br><br>All a screenwriter and a director can hope to accomplish is whatever their own vision of the movie is, and hope that it comes as close as possible to what their audience is expecting to see.<br><br>There is no better case for this situation than the movies based on the novels of Stephen King. When filmmakers capture at least the essence of his stories, the results can be breathtaking and truly terrifying (CARRIE, 'SALEM'S LOT, THE DEAD ZONE), or they can be what fans consider to be a gawd-awful mess (Kubrick's version of THE SHINING; the miniseries for IT and THE TOMMYKNOCKERS). <br><br>Although it's not even close to being the perfect King adaptation, PET SEMATARY has so many moments of just skin-and-bone-deep unease that seemed to have bled onto the screen directly from the book, that you can pretty much forgive its shortcomings. For that, we have music video-turned-film director Mary Lambert to thank, (she also directed SIESTA, not exactly a horror movie, but another freaky-as-hell must-see you should put on your list), working from a screenplay by the 'Man-ster' Himself, and probably one of his better ones.<br><br>Since the majority of you know the story, I won't put you to sleep with too many of the details. Dr. Louis Creed (Dale Midkiff) has moved his family out to the perfect house in the country. Well, almost perfect, except for two nasty little details: the dangerously busy stretch of interstate highway out in front, and the large pet cemetery in the woods out back. Since Louis is a veterinarian and has a young toddler for a son...well, even if you haven't read the book, do the frickin' math. It IS a King story, after all, so no mystery where this is headed. <br><br>It's not so much the destination that counts here, but the spooky stops along the way. Certain scenes that are so familiar from the book are brought to shivery, scream-inducing life here: Rachel Creed's (STAR TREK'S Denise Crosby) horrific memory of her terminally ill, crippled sister; Louis's encounters with the mortally injured jogger Victor Pascow (Brad Greenquist), both before and after his death; the trip into the \"other\" cemetery beyond the pet cemetery. And that third act...if it doesn't give you a few nightmares, maybe you should check your pulse.<br><br>Good performances by all here, especially the late Fred Gwynne as the well-intentioned neighbor, Jud Crandall, who gets the best line in the story that sums it all up: \"Sometimes, dead is better.\"<br><br>About the only problem with the movie version is the casting of Louis's son, Gage (Miko Hughes). Knowing that it would be damn near impossible to get the kind of performance needed from a kid that age to seal the deal on this, Lambert and crew still did the best they could, and unfortunately, Hughes at the time was just too damn CUTE to \"sell\" his intended role as an evil, demon-possessed zombie. This takes you out of the movie whenever he shows up, though the scenes where he's featured are still masterfully staged, (especially Gwynne's death scene.)<br><br>Other than that, everything else is still about as good as it gets. CARRIE still holds the title for best King adaptation as far as I'm concerned; but SEMATARY is right up there in the Top Five.<br><br>Still, will anything adapted for the screen based on a King book be as terrifying as reading the story? Not BLOODY likely...for now.","user":"cchase","rank":[26,32]},{"title":"The better version.","rating":8,"date":"22 August 2019","review":"It's older, and maybe stylistically a bit dated, but it's the better version of the two, imo.<br><br>First, it doesn't mess with the story, which is great because you don't need to mess with the story. The book is good. Aside from the obvious (no spoilers) character switch, it was structurally better. Like the book, it's not a scary-right-off-the-bat horror story, like a slasher movie would be, kill scene at the top. Rather, it's structured more like a campfire story. It starts pretty normal and then, piece-by-piece, the horror builds. This is not very common for horror these days, but I don't think it is non-existant. More experimental films have been using it - Midsomer or Hereditary, for example, or Aronofsky movies. Wish either of those filmmakers would have tackled the remake, gone Kubrick and pushed King \"artfully\" as opposed to \"pop,\" but I digress. King said this was the first the he really wrote which disturbed him due to the major 180-degree plot point mid-way, and this movie has a strong sense of that devastation. The best horror is often about family.<br><br>Second, the cast is better in this version, probably more due to the directing than the actual actors. Mary Lambert let the actors tell the story, Kevin Kolsch, like they do these days, told the story with camera work, editing, and modern horror tropes - the unnecessary masks and the juxtaposition of \"cute innocence\" (ballet dancing) with \"evil,\" for example. Jason Clarke and John Lithgow didn't get to flex. Dale Midkiff was a BABE and we had enough time with him to see the progression of his character. Fred Gwynne is unbeatable. And Denise Crosby, who bravely chose an often unflattering portrayal of Rachel, is hard to forget. The Zelda stuff, although less developed than the new, overdeveloped stuff in the new film, is just scarier. Her hardness early on really works against her crumbling development later - it's a hard choice for an actress' popularity but better storytelling. (Denise Crosby is an interesting actress - I think only one season in Next Generation? And still unforgettable. She makes an impact in whatever she's in, but again I digress.)<br><br>As an English teacher, I'd say read the book! Then watch the movies and choose your favorite version, and let us know what you think! Happy watching!","user":"tpkrause1","rank":[7,7]}]