[{"title":"A Gentle, Contemplative Classic","rating":16,"date":"16 November 2004","review":"There aren't many classics that are as deceptively simple as \"L'Atalante\". Its gentle, contemplative tone - punctuated by occasional stretches of Michel Simon's antics - conceals a carefully made film with some worthwhile themes that go beyond the story itself. The lavish praises that it sometimes receives have perhaps created unrealistic expectations, which is unfortunate, because it is a fine, though understated, classic.<br><br>Jean and Juliette, the two main characters, both have strengths and weaknesses that make them believable. Jean is responsible and disciplined, while Juliette is easygoing and gregarious (which makes her the easiest of the two to appreciate and to sympathize with). But Jean's rigidity and his occasional impatience, in combination with Juliette's naiveté and her occasional impulsiveness, make for difficulties in their relationship.<br><br>If they seem boring when compared to the couples in many other movie romances, it is precisely this that makes the film worthwhile. It focuses closely on two ordinary people, without distracting frills or forced social commentary. Most of us are not all that interesting to others, and our lives and problems are usually important only to us. It is part of Jean Vigo's achievement that he takes two such commonplace characters and makes them worth caring about, and by implication he tells us that we are all worth caring about, even if we and our lives may not matter much to others.<br><br>By keeping most of the action on board the boat, Vigo not only creates an atmosphere, but also forces the attention onto the characters. Simon's rather exaggerated character is used both to vary the pacing when appropriate, and to respond to the traits and actions of Jean and Juliette. The photography and the score are also used to round out the picture.<br><br>It may be true that the film is sometimes over-praised, but in large part that is simply an over-reaction to the unfortunate lack of attention that this kind of classic must so often endure. In an era when so many very weak recent movies have received regular television airings, special edition DVD's with all kinds of pointless \"extras\", and undeserved critical acclaim, it's all too obvious that movies requiring more effort to appreciate are too often ignored entirely.<br><br>Many recent romance movies have tried to use lavish production values, disaster or crisis settings, trendy techniques such as \"non-linear\" story-telling, and other such devices to cover up a lack of substance. Movies as different as \"Titanic\" and \"The English Patient\" (just to name two of many possible examples) use such methods in an attempt to pass off a romantic couple as heroic or admirable, when the characters in actuality are usually self-absorbed, vapid, and truly less worth caring about than Vigo's Jean and Juliette are.<br><br>Jean and Juliette, like most of us, know that they are not important in the grand scheme of things, and they are probably rather well aware of their own weaknesses. They are neither saints nor sinners, neither victims nor heroes, they are just human, and therefore worth caring about. \"L'Atalante\" itself is not \"the greatest movie ever made\", especially since there is no such thing anyway, but it is a thoughtful and carefully crafted classic that stays with you well after you have seen it.","user":"Snow Leopard","rank":[70,80]},{"title":"Learning curve","rating":5,"date":"7 April 2009","review":"L'Atalante is frequently cited as one of the greatest movies ever made. This judgement clearly baffles many people. Having just viewed the fully-restored 1991 version on DVD, I confess to being one of them.<br><br>The print now looks great, with good detail and only the occasional scratch, so we can finally appreciate the exquisite cinematography. Scenes that were trimmed or deleted by distributors and censors have now been restored, along with the original music track. Apparently, this version is as close to Vigo's original cut as will ever be possible.<br><br>This statement needs qualification. Vigo fell ill shortly after shooting and L'Atalante was cut by an editor with only minimal involvement by him. Moreover, it is still only a rough cut. It was originally planned to do some further tightening.<br><br>L'Atalante undoubtedly has its merits. Vigo used the trite story as a framework from which to hang a number of notably good scenes which often veer off in unexpected directions. It has a loose, lyrical quality that evokes poetry rather than prose.<br><br>Unusually for early Sound movies, much of it was shot on location, but I am not sure how much. The interiors look cramped enough to have been shot on an actual barge and this would account for the tight close-ups, awkward camera angles and strange compositions (in one scene both protagonists go briefly out of shot, leaving an empty screen), but there are also indications that these scenes were shot on studio sets (e.g., the shot from inside Jules's cupboard).<br><br>In both subject and treatment, L'Atalante looks and feels quite different to other films of its time and its quirkiness can be a refreshing change from the predictability of most other movies. However, much of that quirkiness is simply incompetence. Vigo had a great visual sense and the movie often looks ravishing, but in most other respects his grasp of movie technique was still somewhat weak.<br><br>Cinematically, he was still rooted in the Silent era. Dialogue is little more than background sound and rarely adds much to the visuals. Most of it was improvised by the actors (never a good idea). The soporific pacing that alienates many modern viewers was simply the characteristic pacing of Silent films.<br><br>At the micro level, the cutting is often very amateurish. Vigo doesn't know when to enter or leave scenes. Shots are assembled out of sequence, so that visual information is only given after it is needed. Sometimes, it is not given at all: for example, we only know about the near-collision with another barge through the dialogue, not the visuals. Individual shots don't cut together properly (e.g., the sequence of Juliette discovering that the barge has gone). Often, we simply don't know where we are until half-way through a scene. We cut to Juliette in Jules's Aladdin's cave of a cabin without any preparation (she has shown no curiosity about how he lives) and don't even know where we are until he turns up to tell us.<br><br>Individually, these examples could be dismissed as mere quibbles but they occur in almost every scene.<br><br>At a macro level, the movie has a weak dramatic structure: it alternately gallops and crawls. Marginal scenes run on far too long (the gramophone scene, the checkers game, the bar scene with the peddler, and so on) while essential scenes are truncated or missing altogether.<br><br>It doesn't even tell its simple story very effectively. Scenes don't flow naturally from one to another, so story jerks forward in fits and starts. The evolving relationship between Jean and Juliette (and her growing frustration with life on the barge) is actually quite poorly documented. Jean's decision to abandon Juliette in Paris is under-motivated. We see almost nothing of how she survives there. We see Jean's distracted manner after her loss, but not the neglect of duty that alarms the barge owners and puts the crew's livelihood at risk. The recovery of Juliette is simply miraculous. One second, Jules is in Le Havre, the next he wandering aimlessly around Paris. He hears music coming from a record shop and - Hey Presto!<br><br>At the end, the characters are nearly as opaque as at the beginning.<br><br>For all the excellence of the cinematography and the originality of individual scenes, Vigo's 'let's make it up as we go' approach means that L'Atalante is little more than a glorified home movie. It is so choppy that it feels like he shot a three-hour movie and lost half the reels, so he had to do the best he could with what was left.<br><br>In the Thirties, L'Atalante sank without trace, but it was rediscovered after the War by the French directors of the 'New Wave'. They were becoming increasingly frustrated with the stodgy movies of their time and soon found ways to slash through the plodding story-telling conventions of established movie-makers. I can understand why they saw Vigo as a pioneer and came to laud L'Atalante as a precursor of everything they were trying to do.<br><br>Nonetheless, you have to master the rules before you can throw away the rule book. In 1933, Vigo was still learning how to make movies. If he had been able to supervise the editing of L'Atalante it might have been a somewhat more accomplished picture: but then again it might not. Zero de Conduite suggests he was still on a steep learning curve.<br><br>Vigo had a unique sensibility and was a singular voice in the cinema. If he had lived long enough to make a few more pictures he might well have given us a really good movie. Then, even his most delirious advocates might see L'Atalante for what I believe it to be: not a fully-achieved work in its own right, but a fascinating, still very flawed, practice piece.","user":"keith-moyes","rank":[33,40]},{"title":"'L'Atalante' is one of the pioneering gems of cinema.","rating":5,"date":"5 January 2004","review":"'L'Atalante' is such a lovely film from director, Jean Vigo, a man whose career would have been marvelous to behold had he not died so young.  This was his last film and there are stories that he directed many of the scenes while deathly ill.  This movie is a genuine masterpiece and is a must-see for anyone who truly loves the art of film.  'L'Atalante' is one of the pioneering gems of cinema.<br><br>It is a simple story about the first few days of marriage aboard a barge traveling the canals of France.  Dita Parlo plays Juliette, a haunting beauty and a dreamer who longs for adventure and excitement.  Her husband, Jean, is a realist who doesn't mind the rugged life aboard his ship.  She tries to domesticate her husband, showing him the wonders of laundry and neatness.  He is so used to the bachelor life that he doesn't even see the need to change the sheets when one of the many cats on board has kittens in their bed.<br><br>Juliette struggles with her new life and longs to visit Paris so she can explore and shop and dance and eat.  She wants a more elegant and romantic life.  Barge life gets more complicated due to the oafish first mate, Jules, who lurches around in a perpetual stupor and acts obnoxiously at the drop of a hat, all the while being rather charming and interesting.<br><br>When the barge finally reaches Paris, the couple plans a trip to shore.  But the plan gets waylaid by Jules who isn't around to guard the boat during their absence.  After a confrontation, Juliette leaves to explore her Parisian dream without Jean.  And when Jules finally returns, Jean decides to abandon his wife and sets a course down the river.<br><br>A plot summary doesn't really do the film justice.  Vigo employs gorgeously original camera angles and a poetic method of storytelling that makes this film impossible to forget.  It has racy and subtle humor.  It deals with sexuality unlike any other film of the era.  It has a fantasy sequence whose power has rarely been rivaled, even in today's special effects bonanza. 'L'Atalante' is way ahead of its time.  Watching this film is like peering through a time portal to the beginning of modern filmmaking.  'Citizen Kane' is often cited as the most influential film ever made... but 'L'Atalante' was 'Citizen Kane' before 'Citizen Kane'.  It is no wonder that it still appears on many lists of the greatest of all time.<br><br>I find it amazing that the film, shot 70 years ago, in soft light and occasionally blurred focus, still manages to evoke truly powerful emotions and tangible sensations.  Vigo's shots are cold, foggy, cramped, dirty, awkward and hard.  But he slips a few truly sublime poetic moments in there to lift our hearts.  When Jean regrets his decision to abandon Juliette he jumps into the river.  The underwater sequence is an ethereal and magical moment in cinema.  Their resulting journeys back to one another is romantic and altogether truthful.  The film encapsulates the awkward and difficult early days of marriage and the journey to the days beyond, where 'real' love starts to grow.","user":"tccandler","rank":[15,19]}]