[{"title":"It's a wavelength thing","rating":3,"date":"3 April 2000","review":"It IS a wavelength thing.  Terry Gilliam's films are ALL Terry Gilliam films.  They all have that certain something, some kind of feeling about them that makes them instantly recognizable.  The same can be said of the Coen brothers.  Unfortunately, movies that are that personal and unique do not work for everybody.  For the people that just can't get into Gilliam films, I hope there's another filmmaker that inspires childlike wonderment in you.  Because it's a great feeling. Time Bandits is magic.  I've seen it many times (over 10) and each time, I find something new about it.  It's a fine example of a movie that works for children and adults alike.  When I saw it for the first time at age 8, I enjoyed the fantasy,  adventure, and basic good vs. evil story.  As I got older I started appreciating the social commentary on consumerism, the Python-esque humor, and just how imaginative and skillfully done the movie is.  After watching it again yesterday, I'm having trouble deciding which is the better movie; Brazil or Time Bandits.","user":"65535","rank":[121,139]},{"title":"Masterful fantasy, in the purest form","rating":9,"date":"27 July 2000","review":"Finding Terry Gilliam's \"Time Bandits\" in the bargain bin at the local movie store was too good a deal for me to pass up, and I'm so glad I didn't!  This movie is probably one of the greatest modern-day fantasies I've seen, due primarily to the amazing vision of Gilliam.  I was disappointed with it on my first viewing years ago, expecting a rehash of Monty Python material, but yesterday watching it I just couldn't stop grinning.  This movie knows its sources, and sends them up right.<br><br>For starters, I love how Gilliam handled the boy 'hero' in \"Bandits\".  He's not anyone spectacular, aside from an active imagination (over and above his banal parents), and he really doesn't contribute much to the story-it simply passes him by.  Most of the other characters don't like him that much even. (the \"stinking Kevin\" line just makes me howl!) He's also not that cute, which is a rarity with child actors and which sinks most films with them. Plus, the danger of the story doesn't stop at him, as shown by the rather sobering finale.  No 'It's all a dream' type cop-out here.  Having studied the form of the fantasy as explained by Tolkien myself, Gilliam obviously understands how it works.<br><br>Of course, because it works, \"Time Bandits\" is just plain fun.  The plot's out of nowhere-just kind of trips along through time and space and stranger things.  Napoleon as a height-obsessed drunkard?  Robin Hood as the aloof, unlikely leader of a band of violent, too-merry men?  Agamemnon as the ideal father figure?  It's all here, plus the technocratic, pyromaniac \"Evil\" vs. the Supreme Being.  Ah, you always knew He was an staid Englishman in a pinstripe suit, didn't you?  (\"Dead?  No excuse for laying off work.\")<br><br>Perhaps it's not Gilliam's masterpiece, as \"Brazil\" could be argued for that...though one could also argue \"Time Bandits\" gives a bleaker perspective through the contrast of the fun and whimsy.  If our reality is depressing now, and Kevin's was, is the fulfillment of our fantasies any better?  Perhaps Randall said it best himself - \"Heroes, bah!  What do they know about an honest day's work?\"  :-)","user":"constructionbob","rank":[94,112]},{"title":"God's \"employees\" off for a bit of white collar crime.","rating":28,"date":"28 June 1999","review":"A terrific little fantasy that, not surprisingly, has flavors of Monty Python.  My children and I first saw it in the early '80s on a night ferry from Harwich to Zeebrugge.  I've seen it a few times since, and marvel at the creativity that went into the film.  God's \"employees\" trying to use a map of the universe to track down treasure is the theme; running around through time trying to find the treasure is the game.  The cameos by Cleese, Connery and the rest are some amusing highlights, but the Time Bandits themselves really make the story.  The climactic scenes with the Evil Genius made me think more than a little of the Sorcerer's Apprentice.<br><br>I think it is a well done bit of fantasy for older children and adults; it helps to know a bit of history going into it.  I wouldn't let my six-year old granddaughter see it -- at least not yet -- but she and her sister probably will love the adventure in a few years.","user":"JerryP-2","rank":[38,45]}]