[{"title":"Great 80s Fun","rating":8,"date":"4 December 2006","review":"Okay, now what isn't there to like about a movie that stars Carl Weathers, Craig T. Nelson, a young Sharon Stone (scrumptious), Bill Duke, Vanity (good googly moogly) and tons of other recognizable 80s actors? Nothing! This movie rules. In the words of my roommate, \"you come for Carl Weathers and you stay for Craig T Nelson.\" Carl Weathers is great as straight ahead copper Action Jackson, but Craig T Nelson steals the show here as the evil Mr. Delaplane. He is such a twisted jerk that being the richest man in Detroit and having a young Sharon Stone as his wife isn't enough, he needs to shoot Vanity full of heroin, too. (Side note: Vanity was extremely strung out on crack cocaine at this time, read Motley Crue's book: \"The Dirt\" for more info.) The action and laughs are nonstop. If you love dumb 80s big budget action, this is a must see. 8/10.","user":"reverendtom","rank":[11,11]},{"title":"So bad it's good! Classic 80's nonsense!","rating":6,"date":"24 September 2008","review":"There isn't much to say about this movie. It's so stereo-type 80's it's unreal! Carl Weathers (Rocky, Predator) plays Jericho 'Action' Jackson. Im just gonna leave it there because his name is just too damn awesome! This is full of explosions, fulls of fist fights, full of awful acting and one-liners and amazingly, has a half decent cast of big name 80's action stars like Bill Duke and Sonny Landham (both of whom appeared in Predator with Weathers and Arnold Schwarzenegger), and Robert Davy (Die Hard, Raw Deal, Predator 2). But the story is basically about Jackson, who has been demoted to a desk cop and hates it, and has to keep his old 'Action Jackson' rebellious days behind him if he want's to be promoted again. When he is trailing a sadistic businessman who is murdering all his union competition so he can take the head job, then you know his 'Action Jackson' gun-ho days are going to return to save the day! It really is fun, I recommend it completely.","user":"bazthegreatone","rank":[16,18]},{"title":"Brilliant in its cheesiness.","rating":7,"date":"24 August 2013","review":"While it is a pretty standard genre flick in some respects (maverick hero, psychotic and ambitious bad guy, beautiful women, angry boss, lots of explosions, etc.), \"Action Jackson\" maintains an irresistibly silly, tongue in cheek style. It's often so damn silly that it's hilarious. Just witness our hero's attempts to take down a cab driving goon. It begins with a good \"grabber\" opening, and continues to deliver enough mayhem to keep the action junkie consistently amused.<br><br>In his first starring vehicle, Carl Weathers once again shows off effortless charisma and his incredibly chiseled body. He's a natural for a role like this, playing the title character, a detective who's been saddled with a desk job for two years but who gets caught up in the schemes of Peter Dellaplane (a wonderfully hammy Craig T. Nelson), an auto tycoon with political ambitions and a murderous nature. Action Jackson figures that the way to get to Dellaplane is through his women: either his young second wife Patrice (Sharon Stone) or his foxy mistress Sydney (singer / actress Vanity).<br><br>The film comes up with a couple of one liners, some better than others. \"So? He had a spare!\" You know it's not meant to be taken seriously when Action Jackson actually drives a car through his quarry's house - and that's just one major example. The clichés are there, too: we have the kind of \"Talking Villain\" who feels the obligation to tell the good guy his entire evil plan - wrongly assuming, of course, that his nemesis is toast. Craig R. Baxley, a longtime stunt specialist in a career dating back to the early 70s, makes his theatrical directing debut here, and he would follow it up with such other delights as \"I Come In Peace\" (a.k.a. \"Dark Angel\") and \"Stone Cold\". So the movie is naturally full of great stunt work.<br><br>One awesome aspect to this movie is playing Spot the Familiar Face. And lots of them turn up - Thomas F. Wilson, Bill Duke, Robert Davi, Jack Thibeau, Roger Aaron Brown, Mary Ellen Trainor, Ed O'Ross, Bob Minor, Dennis Hayden, Brian Libby, Al Leong, De'voreaux White, Jim Haynie, Nicholas Worth, Chino 'Fats' Williams, Charles Meshack, Miguel A. Nunez Jr., Branscombe Richmond, and Sonny Landham. Now THAT'S an impressive cast!<br><br>Add to that a very 80s pop soundtrack (Vanity herself performs two tunes), a score by Herbie Hancock and Michael Kamen, a fairly high body count, and a lively finish, and you've got the ingredients for a damn fine 96 minutes of entertainment.<br><br>Seven out of 10.","user":"Hey_Sweden","rank":[7,7]}]