[{"title":"Widening the Screen, for the Battle of New Orleans","rating":5,"date":"8 April 2006","review":"This was the last film that Cecil B. DeMille had anything to do with. He originally planned to direct this remake of his 1938 film The Buccaneer, but ill health prevented him from doing so. So apart from a brief prologue and a production credit saying the film was presented by him, DeMille left the producing to good friend Henry Wilcoxon and the directing to his son-in-law Anthony Quinn.<br><br>This version has the added attractions of great technicolor photography and Paramount's new wide screen Vistavision process. I saw in the theater when I was 11 years old and it is quite an eyeful. <br><br>Yul Brynner makes as dashing a Jean Lafitte as Fredric March did in the 1938 film. Charlton Heston repeats his Andrew Jackson role from The President's Lady which he made earlier in the Fifties. Heston though was not satisfied because he realized that he was made up to look like the Andrew Jackson we know from the double sawbuck when he was in the White House. At New Orleans he was a bit younger. But like Moses and the circus boss from The Greatest Show on Earth, you follow him to Hades and back.<br><br>The best role in the film for me though was Charles Boyer as Dominic You, Lafitte's cynical second in command. A former artillery officer in Napoleon's army, he left there and took up piracy out of disillusionment with how the French Revolution turned out. Boyer has some good and wise lines in his counsel to Lafitte even if he's drunk while delivering some of them.<br><br>After The Ten Commandments, DeMille had plans to make a film about Sir Robert Baden-Powell, the founder of the Boy Scouts and was in negotiations with David Niven to play Baden-Powell. He got sidetracked with this film and then he died in early 1959. Of course the Boy Scout film never did get made by anyone.<br><br>Although DeMille eliminated one element of the plot from 1938 the traitorous Senator played by Ian Keith the rest of the film is pretty much the same. This is hardly the real story of Jean Lafitte. When not on the action, the film does drag in spots. Maybe that's why Anthony Quinn never directed another film.<br><br>This version of The Buccaneer had one additional thing going for it. Country singer Johnny Horton had a mega hit record of The Battle of New Orleans at the same time the film came out. Both must have fed off each other in profit making. I well remember you couldn't go a day without hearing The Battle of New Orleans playing some time on the radio.<br><br>It's not history, it's DeMille at his gaudiest.","user":"bkoganbing","rank":[28,30]},{"title":"Exciting, Satisfying, Large-Scale Adventure; Most Colorful","rating":7,"date":"19 July 2005","review":"This interesting feature has a very fine story-line, rather colorful characters and a very steady pace. it also incorporates a plot device from \"Reap the Wild Wind\", and since Cecil B. Deille directed that and his son-in-law Anbthony Quinn directed this film from his preparations, that can hardly be a coincidence. it works in both cases, I must report. The unusual set-up tells the viewer that Barataria, an island ruled by Jean Lafitte is built upon piracy, but during the war of 1812, and before, he has always refrained from bothering United States' vessels. Now General Andrew Jackson has been charged with defending nearby New Orleans with only 12,000 men against 60,000 British Imperial redcoats and 60 ships. Lafitte's men want him to side with the stronger force; he wants freedom and pardons for his men before ceding such a strategic landing spot to the U.S. forces. There are other factors at work in the story-line; pirate Bonnie Brown and her father want to attack U.S. ships and do so in defiance of Lafitte's orders, leaving a boy alive without knowing they have missed an eyewitness. When his testimony finally comes out, Jackson cannot grant what Lafitte asks; but Lafitte supports him anyway and in the fog, the pirates and Jackson rout the British and he sails away to whatever destiny awaits a man who had genius and statesmanship but not fortune. The cast of this colorful and physically-lovely film are skilled indeed. Yul Brynner has one of his best roles as the pirate king, Inger Stevens is beautiful; as the girl he loves, Charles Boyer has many good lines as his adviser, powerful Lorne Greene is a rival, E.G. Marshall the Governor, and Claire Bloom is charismatic as Bonnie Brown. Others in the cast include Ted de Corsia, Douglass Dumbrille, George Mathews, Henry Hull as Jackson's adviser, Bruce Gordon, Onslow Stevens, Robert F. Simon, Henry Brandon, Fran Jeffries, and Leslie Bradley, among others. The music by Elmer Bernstein is very memorable, and the 1938 script remade here had only to be freshened a bit. The shiny cinematography was the work of veteran Loyal Griggs, the set decoration was supplied by Albert Nozaki, Hal Pereira and Walter Tyler, with set decoration by Sam Comer and Roy Moyer and costumes by Edith Head, John Jensen and Ralph Jester. Nellie Manley did the elaborate hairstyles and Wally Westmore the difficult makeup. The film contains quite a bit of good adventure-level dialogue and a very strong climactic battle scene. Charlton Heston, as as Andrew Jackson, prepared to play the part of an elder general and then discovered the man was young at the time of the battle; but he is often effective, grey-haired or not, especially in his exchanges with Henry Hull as Mr. Peavey. This is an exciting and well-mounted entertainment, which looks exactly as if C.B. DeMille had completed his production; it is a beautiful and nearly a very-fine motion picture.","user":"silverscreen888","rank":[21,24]},{"title":"A president who actually saved New Orleans","rating":7,"date":"16 April 2006","review":"I always enjoyed watching this when it came on television during prime-time every year in the 60's. It's a typical Hollywood history epic, dramatized, stylized and full of inaccuracies but so what, it's an entertaining movie and a good looking film. Cecil B. DeMille at the end of his life is the executive producer of this remake of his 1938 film. His son-in-law actor Anthony Quinn who had the supporting role of Beluche in the '38 film is the director in his directorial debut and swan song as he had never directed a film before and never would again. DeMille assembled a crew who had recently worked on his 10 Commandments to help Quinn pull it off including longtime DeMille associate producer/actor Henry Wilcoxon overseeing the project. Also from the 10 Commandments are screenwriter Jesse Lasky, cinematographer Loyalk Griggs, assistant director Francisco Day, 2nd unit director Arthur Rosson, art directors Walter Tyler and Hal Pereira, set directors Sam Comer and Ray Moyer, costume designers Edith Head, John Jensen and Ralph Lester who as a costume design team received The Buccaneer's only Oscar nomination. A great cast here from team DeMille headed up by Yul Brynner as pirate Jean Lafitte and Charleton Heston as future President General Andrew Jackson. Also in the cast are Charles Boyer, E.G. Marshall, Lorne Greene, Claire Bloom and Inger Stevens. At just over two hours it drags in some spots but makes up for it with some excellent battle scenes. I would give it a 7.5 out of 10.","user":"johno-21","rank":[19,25]}]