[{"title":"I Have Never Forgotten This Movie!","rating":12,"date":"12 November 2001","review":"I still remember the first time I saw this movie. It was a sneak preview with Steven Spielberg's occasionally funny comedy \"1941.\" I still remember filling out my preview card rating Tatum O'Neal and Matt Dillon as \"Very Good\" but rating Kristy McNichol as \"Excellent.\" At the time, I thought I would see the movie once and forget about it. I have seen the movie many, many times and I have never forgotten it. The late Gene Siskel said in his TV review of the movie that it was really two movies, a broad \"Animal House\" type comedy with food fights and condom jokes (which it is) and a very good coming of age story (which it is). When Matt Dillon was recently on the Bravo series \"Inside the Actor's Studio,\" Dillon heard so many students say they liked this film, he actually said they ought to do a sequel. I hope they don't. I think he was really surprised to hear people praise this movie twenty years later. Some films stay with you and this is one of them. Interesting to see Cynthia Nixon on the HBO series \"Sex And The City\" after doing this project.","user":"subcityii","rank":[36,40]},{"title":"Should be shown in junior high schools - I wish it had been in mine","rating":10,"date":"23 February 2005","review":"This film impressed me so much back then that I not only made all my friends and family see it, but I drove all the way to Georgia to see where it was filmed.<br><br>It's not just about sex - it's about the two ways you can look at sex when approaching puberty. The wrong way - the Ferris Whitney way - is to romanticize it like Romeo and Juliette. The other wrong way -- Angel's way and the way I saw it at the time -- is to see it as something scary, invasive, animalistic, and biological which is approaching to seize you, engulf you, and reprogram you into a mindless reproduction-machine.<br><br>Of the eight characters, only Angel discovers the truth: \"God, it was so... PERSONAL, like you could see right through me\". Sex turns out not to be storybook romance OR a tyrannical usurping of your body by the Forces of Evolution, but something very, very, very, very real, immediate... and YOU.<br><br>In the boathouse, Angel discovers that sex is not something scary she is forced to be, but something wonderful she was always meant to be.<br><br>In the words of the novel, \"All the fear and uncertainty melted away as they kissed. Soon she didn't know who was touching whom, only that it was wonderful, and right, and fine. And the moon stared impenetrably through the window\".<br><br>Notice how \"before\", she's withdrawn, sarcastic, and hostile; and \"after\", she's relaxed and kind of at one with the world, like she's a part of it, instead of a stranger in it.<br><br>In the very last scene, she hugs her mom -- something she NEVER would have done before -- saying \"What's this crap about sex being nothing? You've been hanging around creeps!\" This resonated very, very strongly with me at that age; I wanted that to happen to ME. And I don't mean getting laid.<br><br>The movie was supposedly filmed in Madison, Georgia,at Hard Labor Creek state park. I was wondering if any evidence that a movie had been made would even still exist after two years. The first thing I came upon was a big sign over the road: \"Camp Little Wolf\". My God! All the sets and props were intact... and abandoned.<br><br>Alone, I explored. I walked on the dock and sat on the swing. When night came, I slept in Cabin A, in the bed that Angel did. The next day, I jumped into the lake, hoping that this baptism would somehow cause the same ...transformation which happened to her: the transformation from child to adult.<br><br>And finally, before leaving, I sat for hours in the boathouse, on the spot where \"it\" happened, just thinking.<br><br>Did I like the film, \"Little Darlings\"? Yeah.<br><br>Yeah, I did.","user":"davetocus","rank":[73,88]},{"title":"Must see","rating":9,"date":"19 February 2006","review":"Wonderful funny teenage coming-of-age flick! A must see for viewers from 12 to 92! It's endearing and the acting is quite good for the age group of the cast. Matt Dillon's performance is stellar and he melts the hearts of all the women in the audience. Kristy McNichol and Tatum Oneal have a believable rivalry that ends in a moment that captures the true essence of teenage friendships. It's a great movie for parents to watch with their about to be teenage daughters, the sons may find it too cheesy. But give it a try. It's a classic flick that will hang around for many, many years to come. The scene where the girls go on a hunt for condoms is priceless! It's definitely a knee slapper. The next scene stealer would be gentle Sunshine who proves that even hippie tree hugging types have their limits. Go on out and pick up a copy. Rent it. You won't be sorry you did.","user":"dana_dreamer","rank":[15,17]}]