[{"title":"The First 'Ealing' Comedy","rating":7,"date":"14 March 2007","review":"Generally reckoned to be the first 'Ealing' comedy,a fondly-regarded series of gentle,humorous satires of British life in the late 1940's-early 1950's,this is actually more of a rowdy,fast-paced crime caper than what gradually developed to the above familiar style of this famous film studio.However,it is none the worse for that,with an amusing script and speedy direction by Ealing veterans TEB Clarke and Charles Crichton,and efficient performances by a mostly teenage cast.Looking from a 21st Century viewpoint,it is an astonishing fact how UK teens dressed (in dull tweed suits) and behaved (no guns,knives or bad language) in the pre-rock n' roll era;in this more cynical day and age,it would be the adults stopping the kids committing crime rather than vice versa.This actually helps the film in giving it a quaint period charm which will never be recaptured,as is the well-photographed scenes of war-torn London.Alastair Sim is billed first but the real leading man is inimitable cockney actor Harry Fowler,while the usually genial Jack Warner (a little uncomfortably) is the main adult protagonist,a ruthless villain;Sim is enjoyably buffoonish as a cartoonist,but his is basically a minor character and little seen despite his top billing. The highlight is the final battle between the criminal gang and London street urchins who seem to swarm over their prey like soldier ants.The sequence is funny,exhilarating,thrilling and even spectacular.<br><br>HUE AND CRY isn't the best Ealing comedy,and not necessarily the most typical,but despite dated elements is still largely very enjoyable and pleasantly nostalgic for older film-goers. <br><br>RATING:7 and a half out of 10.","user":"BJJManchester","rank":[19,19]},{"title":"Great, Little-known British Post-war Comedy Drama, with Noir Overtones","rating":7,"date":"7 December 2004","review":"Caution: Ending briefly described.<br><br>A young teenager and his pals discover that a gang leader is using a \"boy's magazine\" (called a comic, but seemingly more of a pulp-fiction text magazine) to tell his gang what jobs to pull. At the expense of logic, this allows for a nice scene at the beginning where a boy is reading a story and the events he's reading about are simultaneously happening around him. This is billed as a comedy, and there are many amusing scenes. Sim, in a small part, is delightful as the innocent, swishy, eccentric writer of the magazine stories. And there fine comic touches, such as, when they stop to look in a store window while trailing someone, the seamstress inside sticks out her tongue. But, unexpectedly, it's as a noir film that this shines. Many scenes are filmed on-location in war-torn London. At one point the kids descend into the sewers to avoid arrest, and when it seems that they can't get out, one becomes hysterical. The lobby of Sim's building is a complete noir set. The finale, with the boy entering darkness to follow the villain, and their cat-and-mouse fight on the open floors of a bombed building is noir in every aspect; the setting, the action, the lighting, the whole style of filming. The fight is violent, and ends with the boy jumping from the floor above onto the villain's stomach, killing him. It's a brutal death for a man whose crime is handling hot furs, and who the boy had no \"personal\" reason to kill. These noir aspects are the most striking part of the film, and it might have been even better if they had been even stronger. As it is, this Ealing film is still one of the best British films of the immediate post-war period.","user":"bensonj","rank":[26,27]},{"title":"Cockney kids rout a gang of criminals.","rating":9,"date":"9 June 2000","review":"This was the first of the Ealing comedies and after fifty years it is still entertaining.The only thing that hasn't stood the test of time is the overacting of Alistair Sim as a writer of boy's adventure stories. The kids in the film are wonderfully natural.<br><br>Pictorially it is an interesting look at a London still suffering from the war. Most of the film was shot on location and the kids playgrounds were the bomb damaged buildings. During the climatic scenes there are some magnificent shots, taken from above, where it appears as though every kid in London is rushing through the streets to help capture the criminals.<br><br>Oddly enough, although very different, the movie had somewhat the same scenic look as THE THIRD MAN. Both were set in bomb damaged cities and in HUE AND CRY there is even  a scene where the kids escape through the sewers of London, predating Harry Lime's famous scene in the sewers of Vienna.<br><br>North Americans may find the accents rather a deterrent but I think the film is well worth the effort.","user":"Cajun-4","rank":[26,28]}]