[{"title":"The Five Faces of Mangano","rating":18,"date":"18 October 2004","review":"Mangano, the wife of famed producer Dino de Laurentiis, gets a royal showcase here, portraying five different women in five short films, each directed by a noted Italian director. In the first (and lengthiest) one, she is a beleaguered movie star who hides away in the large ski chalet of an acquaintance and is promptly pursued by the men and nearly deconstructed by the women. This film has some interesting camera placement and some intriguing aspects, but isn't particularly revelatory or surprising. One ridiculous scene has her talking into a telephone in which her husband is screaming incoherently nonstop into the other end. An impossibly young and attractive Berger has a small role as a servant. Also, viewers could possibly die from the secondhand smoke emitted from the performers! Next Mangano plays a well-dressed woman whose car is stopped at the site of an accident. She picks up an injured man and speeds through the city waving a white handkerchief, but passes various first aid stations and hospitals along the way. The man mutters unintelligibly while he ponders why she is doing this. In the third short film, she is a green-haired deaf-mute who becomes the wife of a lonely widower who has been searching the country for a bride (and a step-mother for his son.) This is by far the most unusual of the stories and is told with much bizarre imagery, whimsy and surrealism. This will make it hard to take for some people, but it has value as an exercise in oddity and metaphor. Next up, Mangano plays a fiery Sicilian woman who has been wronged. When she expresses her shame to her father, it kicks off a whole chain of assassinations. Finally, she is a bored and unappreciated housewife married to Eastwood (of all people!) who complains to him about the mundane existence they share all the while fantasizing about what their life was once like and could be again with a little imagination. This one probably holds the most interest of the five because of the presence of a boyishly young Eastwood (who is quite game for the various shenanigans in the piece) and the myriad of striking costume and hairstyle changes that occur on Mangano throughout. It is a must-see for fans of the over-the-top \"What a Way to Go!\"-esque clothes of the time. Why didn't anyone ever make this lady a Bond villainess? One section has her being courted by a gaggle of sexy comic book characters like Flash Gordon and Batman. All but the last film suffer from the dreaded English dubbing, but some amount of entertainment value manages to come through. The title sequence is unusual and interesting. This melange of stories will not appeal to everyone, but most viewers will at least get a slight kick out of the last one if only for the sight of pup Eastwood and the way-out clothes in the fantasy sequences.","user":"Poseidon-3","rank":[12,13]},{"title":"surreal, absurdist, very Italian, very 60's","rating":10,"date":"18 December 2000","review":"Surreal, absurdist (kind of), very Italian, very 60s. You should definitely see this movie if you like a) 60's clothes, b) 60's movie sets, c) weird movies, d) Silvana Mangano, and e) obscure Clint Eastwood titles (yes, he's in it, too), among other things.","user":"pacificpubs","rank":[20,27]},{"title":"One of the Weirdest and Most Surreal Anthologies I've Seen.","rating":15,"date":"15 October 2007","review":"*** out of ****<br><br>This is basically a collection of five short films all about women and the roles that people feel that they play in society. It gives us different interpretations of women and how people feel around them. <br><br>The first story is about a famous actress who hides away from the public at a ski resort, before discovering that she's pregnant. But when she calls her husband, he is not at all supportive of her desire to have children. It starts out slow, but it becomes pretty haunting to watch after a while.<br><br>The second story gives us a woman who has an injured man in her car who is supposed to drive him to the hospital, but instead drives by several of them before going to where she wants to go. The man doesn't appear to be hurt too badly. Perhaps this is supposed to be a comment on how a woman supports a man in times of need? <br><br>The third story is an indescribably weird and chaotic satire of a father and son who look for a woman to be the father's wife and his son's mother. They come upon a woman who is deaf and are able to get something going with her before the story gets even weirder. This film actually really made me feel weird and left my mind broken in a million directions, but i couldn't stop watching it no matter how much i tired.<br><br>The forth is a story about a man who murders several people because of a woman. This one isn't really funny at all and is actually pretty depressing when you really get right down to it.<br><br>The fifth story has Clint Eastwood in it as the uninteresting husband of a woman who escapes into an imaginary world where she gets sweet revenge on him for being so boring.<br><br>My favorite story is the third, simply because it is so strange and unlike anything that it must be seen to be believed. Overall, i enjoyed it and found it to be very entertaining and interesting. It's creepy and weird if you aren't prepared. Check it out.<br><br>contains adult content and some violence.","user":"tonymurphylee","rank":[10,13]}]