[{"title":"Powell and Pressburger's potboiler","rating":5,"date":"3 March 2007","review":"'Gone to Earth', in its original form (not as revised and reordered under the helm of Reuben Mamoulian), is a powerful realisation in shimmering Technicolor of both Mary Webb's novel and the savage pull of the forces of nature.<br><br>Hazel (Jennifer Jones, imported from Hollywood, as you would expect from Selznick's involvement in this film), is an innocent, an animal lover with a head full of fantasy, fairies, and spells. Her father (played beautifully by Esmond Knight), plays the harp while she sings in strange, ethereal tones.<br><br>Enter the sacred and the profane in the forms of Cyril Cusack as the minister (understated as ever), and David Farrar as the lusty Squire (in his third appearance in P&amp;P films, and in some ways the character is a close cousin to Black Narcissus's Mr Dean). Hazel is desired by them both, but in very different ways, and her naiveté and innocence may well prove to be her undoing.<br><br>Against the backdrop of country fairs, fox hunts, flowers trodden into the mud, fairgrounds, parish councils, and disapproving parents (Sybil Thorndike, memorable as the parson's mother), this film proves to be a gem.<br><br>There's a couple of nice roles for Hugh Griffith and George Cole as well. And Jones, despite a sometimes dodgy accent, always seemed to look half her age and inhabits the Shropshire hills perfectly as the ill-fated Hazel, in close company with her pet fox.<br><br>In many ways. 'Gone to Earth' is as much a potboiler as any Catherine Cookson, but it has enough to keep you watching.","user":"didi-5","rank":[20,20]},{"title":"Something of a mess!","rating":5,"date":"7 March 2007","review":"David O Selznick presents a textbook example of how not to edit a film; this is the hacked, reordered, and partly re-shot version of Powell and Pressburger's 'Gone to Earth'.<br><br>Clumsy cuts with scenes chopped, flagging the obvious with signs and the like, additional scenes (not without interest, but not really needed), a more dramatic ending (I preferred the original), more close-ups of Ms Jones, a superfluous narration, and that's just for starters.<br><br>I saw 'Gone to Earth', the full and original version of this, first; and can't help finding 'The Wild Heart' a little disappointing in comparison.<br><br>It is good to see both versions but give me the original any time. 'The Wild Heart' feels like something which was almost done for a joke, by a film production student!","user":"didi-5","rank":[15,15]},{"title":"The Archers hit the bullseye","rating":10,"date":"16 April 2002","review":"I saw this glorious film when it first appeared.  The following week I tracked it down to a small London cinema where they screened single films continuously several times a day without supporting features.  I hadn't intended seeing it more than once on this occasion but I can recall being so mesmerised that I watched the programme through three times.  Clearly I was out of step with the climate of critical opinion.  The reviewers had slated it and the audience around me was distinctly hostile.  There was a lot of fidgeting and derisory  shouts.  Quite a few walked out.  Behaviour was often bad in British cinemas in the 'fifties particularly if viewers got bored.  The manager called the police in during a screening I attended a few years later of \"The Trouble WIth Harry\" and I can even remember screaming at the usherettes to stop talking when I first saw \"A Face in the Crowd\".  I had to wait many years before I heard good things being said about \"Gone to Earth\".  It was in 1988 when someone introduced a  showing of it on British television most enthusiastically.  Whatever one thinks about the relative merits of Powell and Pressburger's films  (I am clearly in a minority in thinking this their finest) there is no doubt that they are now appreciated in a way they never were when they first appeared.  But if passion for what is still considered one of their minor works may seem rather over the top, let me say but one thing;  where else in the whole of cinema is there a more haunting and magical evocation of English landscape!  Christopher Challis, a brilliant cinematographer, is  the real star of the film.  Undoubtedly (and this is perhaps at the core of its original problems) style matters more than content.  The plot is little more than Victorian melodrama - lecherous squire deflowers simple country girl who has married local vicar - and the dialogue is curiously stilted.  However this hardly matters in a work cinematically choreographed with such brilliance.  The final foxhunting sequence, where the film's many strands are brought together, is visually and aurally one of the most spellbinding in all cinema.  The huntsman's cry of \"Gone to earth!\" at the very end has haunted me for well over half a lifetime.","user":"jandesimpson","rank":[39,44]}]