[{"title":"Interesting theory in Nomads","rating":10,"date":"9 September 2006","review":"And the theory is, as spelled out by Chelsea Quinn Yarbro in her book of the same name, that there are earthbound, malevolent spirits who bring madness to any human that makes camp with them. That people don't realize that a percentage of what they see or hear is not.....there! Most people are luckier, they don't look so closely. But Pierce Brosnan's character, being the inquisitive person he is, has looked.......too closely. Now, these nomadic beings, who are attracted to places of calamity, have taken an interest in Brosnan and he is warned by someone, who may or may not be one of 'them'. Warned to leave, change his job and move away. It's all very interesting to watch. And afterward, you can't stop thinking about it. Yes, it contains flavors from the 80's but it is still thought provoking. Read the book too!","user":"sunznc","rank":[41,50]},{"title":"One of the better film examples of Urban Fantasy I've seen","rating":30,"date":"30 September 2001","review":"Truly coming from the genre of Urban Fantasy, this film belongs with stories such as Alan Dean Foster's \"Into the Out of\" or some of Charles de Lint's more horrific tellings.<br><br> An anthropologist returns to the city after years of travelling and investigating, only to find that the spirits of the places he travelled have become aware of his probing eye, and have come looking in return.  A balancing by the Manitou, as it were.  The film has a heavy, oppressive mood to it, but leaves the watcher to figure out a great deal of the content for themselves.<br><br> Coming from the same director as \"Die Hard\" and \"The 13th Warrior\", this is a rather surprisingly subtle film, and quite delightful in it's execution. Highly recommended, if you can find it.","user":"vtaltos77","rank":[45,57]},{"title":"One of the most unique horrors out there","rating":8,"date":"10 June 2017","review":"John McTiernan's Nomads is one of the best, and most unconventional horror flicks that you've never seen. Nestled so far back into the 80's that it stands as the mile marker for Pierce Brosnan's first on screen leading role, it's a beautifully tense, atmospherically crafted fright flick that's been lost to the hazy aeons of time. Unique in it's ambiguity, this is a film bereft of bells, whistles, gore effects or even obviously spooky apparitions, relying solely on mood to impart illusory menace that's never shoved in your face of spoon fed. Brosnan plays a French (hon hon) archaeologist who begins to suspect he's being followed by a group of unruly urban punks which, upon further introspection, could possibly be the malevolent spirits of a now extinct tribe he discovered years ago. It's a vague, very weird concept, but it just somehow works, the presence of these grimy streetwalkers inciting palpable fear at the thought that they're not what they seem at all. Opposites are at work here; by showing nothing, the filmmakers tell us and make us feel everything that is unseen, daring us to imagine what these mysterious beings might actually be, unsettling us further by having them appear in such benign (relatively speaking) form. It'll frustrate many, but those tuned into the film's eerie frequency will get the same chill down their spine that Brosnan perpetually walks around with, harassed no end by these meanies. The actors for these things are all especially chosen as well, each coached beautifully by McTiernan to act just normal enough to blend into the derelict fringes of an urban environment, while giving their demeanour an unnerving esoteric aspect, until they seem like a cross between mute versions of the Near Dark gypsy vampire clan and spectral coyotes. Brilliant concoction of subtle horror, clammy tension and gorgeously layered atmosphere.","user":"NateWatchesCoolMovies","rank":[11,12]}]