[{"title":"great but often misunderstood film","rating":10,"date":"25 May 2000","review":"Many people who saw The Graduate on its original release, including critics like Roger Ebert, have misinterpreted the main point of the film.  Ben Braddock is NOT a hero that is supposed to glorify the rebellion of the 60s generation.   The viewer is NOT supposed to stand up and cheer after the final scene.  Ben is supposed to represent the confused state of a college graduate stuck in between youth and adulthood.   As best depicted by the scene where he holds the hotel door open for both the elderly group and the younger group, he feels alienated from both generations.  He does not want to hear the loud music of the car next to him at the drive-thru, nor is he interested in `plastics' or the materialistic pleasures of his parents.<br><br>He has no idea what he wants out of life, and only thinks that marrying Elaine will be the solution to this problem.  As the last shot depicts (which may be the best final shot in film history), Ben only seems to be happy for a few seconds after he and Elaine get onto the bus with no money, no prospects, and no certain future.  In fact, Nichols cleverly uses Paul Simon's Sound of Silence, and drowns out much of the background sound to show that Ben's is in the same position at the end of the film as he is at the beginning.  He has not found what he really wants to get out of life and is as confused as ever.   This scenario is not dated nor is it only appropriate for the 60s, it can apply to anyone who is lost or has no idea what to do with his or her lives.<br><br>Nichols' brilliant direction reinforces the complex exploration of confusion and uncertainty.  The flow of shots after he first sleeps with Mrs. Robinson is incredible, as is his use of the swimming pool to enforce his entrapment. He effortlessly switches in and out of focus at different depths of each shot to emphasize certain characters and dialogue.  It goes without saying that the performances by Hoffman and Bancroft are first-rate.  Add Paul Simon's haunting Sound of Silence, Scarborough Fair, and the instrumentals of what would become Mrs. Robinson, and you have songs and images that downright haunting.  As a recent college graduate who was not even born in the 60s, I can say that this film has not dated, and is deserving of its #7 ranking by the American Film Institute.","user":"mjs3p","rank":[116,121]},{"title":"A Bridge Over Troubled Waters","rating":10,"date":"5 March 2005","review":"The Graduate (1967/Mike Nichols) <br><br>If ever a song were more appropriate for a film, besides 'All Along the Watchtower' for \"Apocalypse Now\", it is 'The Sounds of Silence' preformed by Simon &amp; Garfunkel in Mike Nichol's \"The Graduate\". The song, nearly word for word, describes the inner turmoil that the characters of \"The Graduate\" face. They are lost and confused, stuck on the bridge of life, two crossing into adulthood, and one into old age. And that's just one way to look at it. <br><br>\"The Graduate\" is one of the best films I have ever had the pleasure to witness, and I only wish I were alive when it was first released. Dustin Hoffman, in his first major film role, plays Benjamin Braddock: the epitome of the confused and isolated young adult male. He sits in his room and does nothing. He lies around in his parent's pool for hours on end. Ben, who has just graduated from college, is home for the summer. Then, after an awkward sexual encounter with a friend of his parents named Mrs. Robinson, a one night stand turns into a summer romance. But betrayal soon follows as Benjamin falls for Mrs. Robinson's daughter, Elaine. <br><br>Nichol's directorial genius (he won an Oscar for the film) really shows in the opening party sequence celebrating Ben's arrival home. There is a close-up of Ben's face as he stumbles his way through the event, listening to advice and shaking hands with the faceless (much like his future) masses. The camera moves in such a way that a feeling of claustrophobia comes over the viewer. They are overcome by what is going on around them, much like Benjamin is at this crossroads in his life. Another example is when Ben first arrives at the fateful hotel where he meets Mrs. Robinson for sex. He walks around the lobby, suspicious that the desk clerk is on to him, and then he attempts to walk into a room. Only a large group of the elderly walks out, and Benjamin stands there holding the door for them. Then he proceeds inside, only to be passed by a group of high school students. This image once again reinforces the crossroads that Ben is at in his life. <br><br>After finally viewing this classic, I realized that many of my favorite directors to emerge from the 90's (mainly Wes Anderson) were greatly influenced by this film. What's more interesting is that \"The Graduate\" was a landmark film for American cinema and the decade in which it was released, sharing the same themes that Benjamin experiences throughout the film. Most of American cinema was very conventional up until the 60's. Nothing extremely scandalous was shown in a film, and many serious topics were not widely addressed through cinemayet. \"The Graduate\" is the perfect mix of old and new. It's the 'bridge' that separates the standard American films from the more experimental ones that would emerge all throughout the 1970's. <br><br>The same can be said for the decade of the 1960's. America lost its innocence the day Kennedy was assassinated on November 22, 1963. For the next five years, the country went through a spiral of events that led to the sexual revolution of the late 1960's. And \"The Graduate\" separates the white picket fences of the 50's and early 60's from the Rock and Roll and drugs of the late 1960's and early 70's. It's a crossroads in the middle of the most turbulent time in American history. In one of the films most ironic images, a tired and lonesome Benjamin slumps on a bench on the Berkley campus (an important place for the sexual revolution) under an American flag blowing in the wind. The flag still waves, but Benjamin is beat. He represents the fall and eventual metamorphosis of the American dream. <br><br>But aside from all its serious themes and deeper meanings, \"The Graduate\" is a comedy at its heart. It contains one of the funniest and most exciting climaxes in cinema. And the final image is a knockout. It shows Benjamin and Elaine sitting at the end of a bus filled with elders, looking ahead blankly, at the road and at their future. Then the bus drives off in the distance. They do not know where their future is headed, or where the bus is even going. It was the same circumstance for America in 1967. The film closes with the same song it opened with: \"The Sounds of Silence\".","user":"Kurtz9791","rank":[257,306]},{"title":"I have one word for you : PLASTICS","rating":10,"date":"7 April 2006","review":"What a ride....This is a perfect example of what art can generate if one puts soul and wit into it. Firstly, I find human emotions and life issues depicted in a bitter-comic manner to be a charming combination.Love,sex,insecurity,family relationships,shyness,deception are treated with great humor and witty dialog in this movie.Long and elaborated shots,incredible story-telling creativity (like 1-st person camera views,long still frames,distance frames),video-clip like sequences (beautifully sustained by Simon and Garfunkel's heart-warming poetry and sad irony).There is enough creative film work in The Graduate to suffice for 10 movies.The dialog is excellent and the acting pure genius.And, oh...the time frame...the sixties...don't get me started.The 2000's are like an insurance seminar compared to that... No need to praise this movie anymore, it speaks for itself.It is not,however,a movie for the masses.This is no Ben-Hur type of flick,with spectacular imagery and epic storyline.It is an epic of the inner soul.It requires a bit of meditation, it is only entertaining if you get in touch with your inner self and not expect to watch the screen and BE entertained. Despite its comic appearance,I always felt that it touched a sensitive somehow sad chord in me.It's kinda like:\"Haha very funny, but I felt those type of emotions and they didn't seem funny then.\"It's also so easy to laugh at other people's feelings,torments and emotions, but when you realize that you are also part of that old human comedy and drama, your laughing becomes more restrained.More mature.I always connected with this movie, and with Mike Nichols.Too bad they don't make'em like this anymore.We live in an era where people like John Woo and Michael Bay are starting to dictate what we will be watching more and more.What a shame....","user":"dixxjamm","rank":[173,206]}]