[{"title":"THIS IS NOT BAD ACTING!! Please remember this...","rating":8,"date":"23 December 2000","review":"After reading all the critiques and reviews, there's just one thing that all of you have to remember: THE ACTORS WERE SUPPOSED TO BE PORTRAYING TEENS WITH THE SOCIAL MENTALITY OF 7 OR 8 YEAR OLDS.  Many critics were saying that the dialogue and the acting was bad, but in actuality, the acting is very good for what the plot called for.  Brooke Shields and Christopher Atkins were supposed to portray young adults who were 'cut off' from the rest of the world at a very young age.  That's why they were supposed to portray two people with the limited education, mentality, vocabulary and speech of 7 or 8 year olds.  It would really have been unrealistic if they had more developed dialogue, since they had nobody to further their speech skills on an island with only two people...who were still both mentally children!  That is why they show scenes where they sing very incomplete songs, refer to San Francisco as \"Sanfarisco\", and forget their daily prayers.<br><br>In light of all this, I think they did a very good job of acting and the writers did a very decent job of limiting the dialogue to the speech abilities of young children.<br><br>However, there are some unbelievable and unexplained scenes, such as the giving birth scene.  How do they cut the umbilical chord off?? And some other minor details should have been explained, but overall: A very beautiful and romantic story with a happy ending.<br><br>An 8 out of 10.","user":"djson1","rank":[181,208]},{"title":"NOT A CHILDREN'S MOVIE - FOR YOUNG ADULTS AND OLDER","rating":8,"date":"5 February 2002","review":"The Blue Lagoon (1980) is so very close to the book, Blue Lagoon: A Romance, written in 1907 by H. de Vere Stacpoole and published in January 1908.  The actual book is on the Internet and the dialog in the movie is faithful to the book.  <br><br>Some dismiss the movie as trivial.  However, consider this.  Brooke Christa Shields was 14 years old (born 1966) when she played Emmeline LeStrange. She had already appeared in 12 prior films.  Christopher Atkins was making his movie debut at the age of 18 years (born 1962) playing Emmeline's cousin, Richard LeStrange (referred in the book by the diminutive name, Dicky LeStrange).  In the book, Emmeline is 8 years old and Dicky is 8 years \"and a bit\" when the story starts.  <br><br>Emmeline's father died before she was born.  Two years later her mother died.  Her uncle and father's brother, Arthur LeStrange, (veteran actor William Daniels) took guardianship of Emmeline in Boston.  Mr. LeStrange purchased a small estate in Los Angeles and was in route by clipper ship to San Francisco around South America.  The ship, named Northcumberland, had departed from New Orleans bound for San Francisco.  Having rounded the Cape of South America and going off course during a calm, a fire breaks out in the hull of the ship. <br><br>The cook, Paddy Button, played expertly by veteran Australian actor Leo McKern took Emmeline and Dicky aboard a dinghy launch and attempted to row a safe distance away from the ship before it exploded from gunpowder stored on board.  Mr. LeStrange and ships' compliment were separated in the fog from Paddy, Emmeline, and Dicky after the ship blew up.  Mr. Button and the children drifted in the South Pacific Ocean for about three days and nights until they were brought by the tide to an island named in the book as Palm Tree Island somewhere in the ocean southeast of the Marquesas Islands.  In the movie we see a Boston newspaper with a date that appears to be 1893 floating in the water.  <br><br>The children and Paddy Button are saved and set up housekeeping as shipwrecked survivors.  For the first 45 minutes of the movie, child actors Elva Josephson and Glenn Kohan play Emmeline and Dicky.  Elva only acted in three movies and two TV appearances while Glenn appeared in this film only and acted no more.  However, they did a good job playing themselves as eight-year-olds.  On the island Paddy tries to be father and mother to the children.  He teaches them the basics of survival, gathering fresh water, harvesting bananas from trees, catching fresh ocean fish, capturing small rabbits, knot tying, hut building, making a signal fire, making a tree calendar to mark the days, and exploring the flora and fauna and caves of the island.  They had rescued a trunk of clothes that the children use as dress up and play items.  Also, there were three-dimension view photos of the day of adults in social activities.  These photos would be useful to educate Emmeline and Dicky in some social graces of civilized people. <br><br>\nEmmeline had found a keg of rum and a skeleton of another shipwrecked sailor when they first arrived on the island.  After two years on the island, Paddy, drinks himself to death.  It is curious that this small keg would have lasted for two years being the rummy that Paddy was as he tells the children that he has many children in ports around the world.  However, the children discover Paddy's dead body and conduct a burial ceremony as best as they could.  Don't look for this on the TBS \"edited for content\" version, as it's not there.  TBS spoils the movie by cutting out what they feel are \"sensitive\" parts of the movie, albeit, necessary for continuity of the story to retain its TV 14 rating.  <br><br>(This is not a children's movie.  This is a young adult's movie.  The rudimentary scenes are necessary to be faithful to the book!  If the rating ends up being \"R\", so be it.  Also, this is far from being a \"soft porn\" movie as some reviewers suggest.  This is a story about how people can survive in the late 1800s on a deserted South Pacific Island without the niceties of the then civilized western world.)<br><br>Enter teens Brooke Shields and Christopher Atkins at about the age of 14 years.  The story picks up as the children have entered into puberty. Brooke (Emmeline) begins to become aware of her changing body turning her into a woman and she experiences these changes alone and confused without another woman to help educate her.  Likewise, Chris (Dicky) is becoming a man and Brooke, although the same age in the story is more mature than Chris and is becoming sexually attracted to Chris' emerging manhood.  What was once child's play and tickle-touch between children, is now, sexually sensitive to young emerging teens.  Critics -- this is Nature at work!  The moviemakers did a wonderful job of portraying this on film. <br><br>\nOf course, they discover sex.  But, they do not know that it produces children.  Emmeline and Dicky marry each other in a ceremony they devise to show that they are \"civilized.\"  They begin to live together as husband and wife.  Ultimately, Emmeline becomes pregnant and finally is aware that there is something growing within her.  <br><br>Fast forward to the \"Bogeymen\" on the other side of the island.  A tribe of natives had, from time to time, come by boat to the other side of the island.  Here they had a stone idol and sacrificial alter.  At least six times during the film, even when Paddy was still alive, the survivors heard distant drumbeats.  Paddy knew the danger and passed a \"law\" warning the children never to go to the other side of the island.  After Paddy's death, Emmeline and Dicky do go to the other side and discover the idol.  Emmeline thinks it is God.  The edited version leaves out the night spying and confrontation of Dicky with a native.  Get the full version for this \"humane\" meeting of East meets West.  Oh, these are not African peoples. This is a South Pacific movie.  The natives are supposed to be \"Polynesians.\"<br><br>In the book, Emmeline has her child all alone on the floor of the forest while Dicky is returning from spying on the Natives.  In the movie, Dicky returns, \"in the nick of time,\" to witness the child's birth.  No matter. That's Hollywood's movie license.<br><br>Of course, Uncle Richard has continued to pursue finding his son and niece. The book explains how he comes to know where the children might be.  He hires a ship to search the area of the Palm Tree Island.  Ultimately, Emmeline, Dicky, and baby Paddy (now about 2 years old  -- in the book she names the boy child a girls name, Hannah because she likes the name) put out to sea in the dinghy that is still seaworthy after being shipwrecked for eight years and five months.  After losing their oars during a shark attack, the survivors, without food or water, drift in the ocean for three days before Uncle Richard discovers them.  The movie ends as faithful to the book ending.  The trio is rescued.  When the rescue boat rows out to intercept the dinghy, Mr. LeStrange asks, \"Are they dead?\"  The ship's crewman replies, \"No, they're asleep.\"<br><br>Beautiful Brooke and handsome Chris are not to be made fun of.   They acted remarkably well portraying children with limited education and vocabulary. The island scenery is beautifully photographed.  There is a wonderful special effect when Brooke baths in the ocean.  Get the video as TBS took a hatchet to these frames.  If you were living in that era and shipwrecked and survived, you would want your eight plus years on the island to be like Brooke and Chris spent in this film.  Get the video and enjoy.  It's an adult film for mature teens and older adults.","user":"larrysmile1","rank":[113,129]},{"title":"Critically underrated film that resonates with global audience","rating":8,"date":"18 February 2001","review":"I've never understood the critical slam this film has received. Then I saw the widescreen dvd version and understood; everyone has been watching it in pan and scan! The film is a visual poem. So much of the story telling is done through visual information. The impact of this is lost when the cinematography is altered. Remember that Nestor Almendros received an Academy Award nomination for his work on this film. The film has resonated with global audiences for so long for this very reason. I suggest people watch the dvd commentary with Randal Kleiser and Brooke Shields to get a better understanding of why this film is still such a popular one.<br><br>\nPeople attack the acting, but these are children left alone with no one to guide them into adult sophistication. Their interaction and reactions to situations are very consistent with this scenario. Yes, the birth scene is a little rushed, but do we really need to see the umbilical cord? Not all films need to be about gritty reality, ala \"Taxi Driver.\" No one asks to see the bloody guts of the smashed witch in \"The Wizard of Oz.\"<br><br>It is a beautiful, romantic film that speaks to millions of people. It seems that only the most skeptical cynics cannot embrace this film.","user":"Red66","rank":[162,192]}]