[{"title":"Deeply unsettling and emotionally draining","rating":8,"date":"25 June 2007","review":"During the Depression, many had nothing... and the few that did were almost equally as miserable. This movie displays a dance marathon, held for the entertainment of the latter, and the expense of the former. The contestants dance for daily meals and a place to sleep, and the weak hope of a prize, if they are the last couple standing. The rules are cruel, and whilst the many dancers fight to remain standing, the audience is served snacks and fast-food. The film shows how callous people can be, sometimes. The plot is magnificent, the story-telling excellent. Acting(Sarrazin can exude an extraordinary amount of emotion through his eyes), casting, editing(with extremely few slightly weak moments), pacing, direction, cinematography, lighting, music, production design, everything, it's all amazing. This is a very difficult film to watch(which is by no means to say that I regret doing so). It is not entertainment, nor is it something to escape one's everyday life with. It is brutal and uncompromising, a window into an era and an event, both of which show humanity at its worst. A masterpiece. I intend to look for other films by Pollack, there is no doubt about that... fortunately, my fiancée has told me that he has done lighter fare(I would prefer watching something less bleak than this for the next of his movies I view). This is a very important movie, particularly in today's world, where reality shows are all over TV. I recommend this to anyone certain that they can sit through it. 8/10","user":"TBJCSKCNRRQTreviews","rank":[35,37]},{"title":"A Grisly, Sickly Entertaining Film","rating":9,"date":"20 February 2007","review":"A brutally bleak screen adaptation of the pulpy Horace McCoy novella, about a Depression-era dance marathon where down-and-outers drive themselves to the brink of exhaustion to win the cash prize.<br><br>This film has become relevant again today in the age of reality T.V., where people tune in to watch strangers be humiliated, rejected and made fun of. Meanness and suffering sells today, and apparently it sold back then as well. The M.C. of the dance marathon, played wonderfully by Gig Young in one of his last (if not the last) film performances before the troubled actor murdered his wife and then killed himself, creates little narratives and dramas around each of the dancers, so that the audience can have their favorites to root for. Every once in a while, someone will show off a special talent, singing a song or hoofing a little dance number, and the audience will throw change at them, which the performer then frantically scrabbles up like a desperate pigeon. The cast of dancers is led by Jane Fonda, in a break-out role as Gloria, the jaded woman-of-the-world who's seen it all and doesn't want to see anymore; Susannah York, as a pretentious wannabe actress, who acts up a storm during a mesmerizing breakdown scene; Red Buttons, as an aging ex-serviceman who struggles to keep up with the young kids around him; and Bruce Dern and Bonnie Bedelia, as a sweet couple of country bumpkins who are desperate to win the cash for their unborn baby. And yes, that is Al Lewis (aka Grandpa Munster) lurking around in the background as one of the dance marathon officials.<br><br>Director Sydney Pollack vastly improves on the source material, making something much richer and deeper out of McCoy's lurid novella. He uses an edgy, jarring style that's suited perfectly to the material, and which he would never again display.<br><br>\"They Shoot Horses, Don't They?\" holds a sort of grisly fascination over its audience. Bleak as it is, it's also entertaining in a rather morbid way, making us feel like we're members of the audience watching this sick spectacle and making it that much harder for us to condemn the film audience without labeling ourselves as hypocrites.<br><br>Grade: A","user":"evanston_dad","rank":[71,79]},{"title":"A memorable, tragic story with roots in reality","rating":21,"date":"21 November 2002","review":"\"They Shoot Horses, Don't They?\" is such a fascinating film that it made worthwhile a little research into the dance marathon craze of the 1920s and early 1930s. According to the DVD extra, the set was modeled on the old Aragon Ballroom, built in the 1920s on the Lick Pier at Santa Monica, California. The once-elegant ballroom had grown seedy by the early 1950s, at which time it enjoyed a brief revival as the location of early Lawrence Welk show broadcasts. In the 1960s, the Aragon was again revamped under a different name as a short-lived rock concert venue - with appearances by Alice Cooper (is his pre-Cooper days) and Jim Morrison of the Doors. It was destroyed by fire shortly afterward.<br><br>Marathon dancing was, according to most historians, as brutal and exploitive as it is depicted in \"Horses.\" It was for that reason that this early 20th century variety of Roman coliseum culture was banned in much of the country by the late 1930s.<br><br>This movie uses fictitious characters to tell a story that appears to be remarkably accurate from a historical point of view. Jane Fonda's ultra-cynical, sharp-tongued character, Gloria, along with ruthless manager/promoter Rocky (played by Gig Young), contrast perfectly with the eerily-resigned and unpretentious Robert (Michael Serrazin). The casting and dialogue are brilliant. The visual effects are haunting.<br><br>\nThis film is not for everyone. But for those interested in the social pathology that allows human suffering to become a form of amusement, the malicious ill-treatment of the poor, or the harsh realities of the depression era, this is multifaceted cinema that can be watched again and again, each time yielding new subtleties. It is a morbidly fascinating character study that reflects a truly desperate time.<br><br>For those watching on DVD, it is advisable to see the short background feature before the movie in order to fully appreciate its context. The movie is unforgettable, a true classic.","user":"mufeedah","rank":[111,127]}]