[{"title":"More Than Just A 'Curiosity Piece'","rating":5,"date":"5 April 2006","review":"An historic film, billed as \"the first talkie,\" this was a surprise because many of the lines are not verbalized, only when Al Jolson sings or just before or just after his songs. Otherwise, most of it is still a silent film with the words shown on the screen as in the other silent films.<br><br>This is a powerful story with interesting characters and good songs, to boot. It was different to see Warner Oland as somebody else besides Charlie Chan. He played Jolson's father and I never would have recognized him had I not read the credits. Nor would I have recognized William Demarest. <br><br>Jolson, however, is the man who dominates the film. Some of this songs wound up being classics, ones played for years and years, such as \"Toot, Toot Toosie\" and \"Mammy.\"<br><br>Faced with a very tough decision on what to do with his life, Jolson's character does the right thing in the end, which was nice to see. Overall, it's entertaining.","user":"ccthemovieman-1","rank":[57,61]},{"title":"Four Angels, Poised","rating":10,"date":"10 February 2007","review":"There's not much to say about this other than even today, for this viewer, it is emotionally effective. Yes you know you are being manipulated. Yes, the acting conventions of the silent screen are comically exaggerated. Yes, it is shameless in setting up the ultimate choice. But this is so well structured that even today it escapes cliché. That's so remarkable, because big movies are almost always turned into clichés as bits of them are digested and continuously re-served to us as our visual grammar.<br><br>The love interest here is so unusual. He does fall in love with a pretty dancer, but tells her plainly that his career is more important than she is. She later doesn't become part of the choice  as would be the case in nearly every other script  instead she becomes part of the audience, presenting the dramatic quandary: the stage or God.<br><br>The presentation of religion is unique in my experience. Everyone here is a Jew, except the performers. They are the \"real\" and everyone else is \"pretend,\" performing. Though there are many opportunities to fall into obnoxious stereotypes, its avoided over and over. That's despite the dozens of examples they had before.<br><br>In fact, there's an amazing engineering of story here. As any viewer will know, this was the first talkie. It was new, and to emphasize its newness a story was created to emphasize the contrast between old and new.<br><br>This film is part silent, part \"talkie.\" It shows a struggle between the old (obviously obsolete) and the vital young. It also depicts in a rather subtle but effective way the \"old\" god, and the new: there's plenty of talk about the performance hall being a modern church. The music as well: we have the implication that it is not only the setting, the performer and the calling, but the music itself that is something new.<br><br>Along the way we get street scenes of the Jewish area of New York. These are genuine street scenes and are absolutely phenomenal: there isn't anything I know that compares. There was an attempt of sorts in \"The Pawnbroker,\" which by itself was strong. But nothing compared to this.<br><br>Ted's Evaluation -- 4 of 3: Every cineliterate person should experience this.","user":"tedg","rank":[65,72]},{"title":"\"Wait a minute, you ain't heard nothin' yet!\"","rating":3,"date":"3 June 2001","review":"George Jessel passed up a chance to star in this movie. he thought sound in film was too risky a venture to try and took a pass. Al Jolson went on to stardom and George became known as a toastmaster at Hollywood roasts. This is an excellent movie that certainly belongs on anyone's list of 100 best movies. The story has been ably told here, I won't repeat it. I do want to add a few observations, however. The movie is very sentimental, especially in it's portrayal of \"Mama\" and Jolson's devotion to her. Even when it first came out, writers were critical of this, which harked back to the days of broad stage melodramas. The use of the song Kol Nidre and the Jewish day of Atonement at the ending is significant in that forgiveness and reconciliation is what this movie's theme is all about. Recommended highly, many of the scenes are etched in the consciousness of movie-goers whether you have seen this movie or not. Jolson in blackface doing \"Mammy\" and \"Mother Of Mine\", singing \"Toot, Toot, Toosie Goodbye\". Seeing this film will bring back all these images and place them in their proper contexts. The minstrel type show or even blackface solos were still going strong in the 1920s. In the 1930s and even into the 1940s famous Hollywood actors such as Judy Garland and Mickey Rooney among many others would still be doing songs in blackface. This was no isolated case by a long shot. See it and see history. Also see it for what it is, a classic Hollywood story.","user":"Schlockmeister","rank":[38,42]}]