[{"title":"harmless fun and very touching","rating":10,"date":"11 November 2005","review":"Arthur 2 may just touch your heart. It touched mine. It's really a very sweet and charming film and it's unfortunate that it's so underrated. Arthur 2 made me smile, laugh, and shed more than a few happy tears. It's been said that the original Arthur didn't require a sequel, but it's a pleasure spending more time with the characters. 99% of the fantastic cast of the original returned for this one. It's especially wonderful to see more of Dudley Moore as Arthur. I love Arthur! There are plenty of funny, cute, and charming moments in Arthur 2. The moments with Hobson and Arthur at Christmastime are especially touching. I'm very happy that they made Arthur 2.","user":"lotsafun","rank":[42,49]},{"title":"A beautiful little film.","rating":8,"date":"21 June 2001","review":"This has got to be one of the most under-rated and under seen sequels in history. Arthur 2 is not as good as the film that preceeded it but it is NOT a bad film. Arthur 2 if anything gives us the film that Dudley Moore and Steve Gordon were trying to back in 1981. One of the main criticism's is that it gives out a bad message the alcoholism is good. The film does nothing of the sort, Arthur strives through out the film to change his drinking ways and succeeds in the final part of the film. The film itself is not as funny as Arthur was, but you hardly notice this because it tells a good dramatic story.<br><br>Bud Yorkin handles the direction excellently, and the movie contains a magical back drop of Christmas time New York. Dudley is again funny and like-able, just as he was in Arthur, allthough both the Actor and the Character have matured. Liza Minelli is again kookie as Linda, allthough she plays the role like the preceeding seven years took place within a week. Nothing changes with her performance and one is greatful. One really feels for Arthur and Linda, as they struggle with the fact of first not being able to have children, and secondly being destitute. Without spoiling the movie for those who have not seen it, there is a happy ending. Burt Bacharach's score is again heartbreaking and wonderful and the title song sung by Chris De Burgh is as good as the Chris Cross original. And finally Sir John Gielguid makes a heart breaking and beautifull return as an Obi Wan Kenobi like Hobson. A christams ghost if you will.<br><br>A Beatifull film. One ready for re-evaluation. Lets raise our glasses to Arthur and Linda.","user":"Dock-Ock","rank":[37,44]},{"title":"Maybe I'm crazy but I like it better that the first...","rating":10,"date":"14 November 2004","review":"Certain movies you see as a child and they stick with you, regardless of actual 'quality' per se. Such is the case with Arthur 2: On the Rocks. I'll be honest, I know it's not the best of movies, but darnit, it makes me laugh. It's almost surreal to watch the non-stop one-liners out of Dudley Moore. Even characters in the movie refuse to laugh at the jokes. I still find it funny! I tried to make friends watch it, they wouldn't bite. Perhaps it's an acquired taste. I have tried to watch the first Arthur and frankly I've found it dull and uninteresting. I can't honestly say I remember the ending of the first Arthur, but I can quote whole chunks of the sequel verbatim. I don't know what that says about me as a person, but there it is. Frankly, I think this is at worst an okay movie. I think too many people came into it with too high expectations leading to a ridiculously low overall rating. If you are around 8 years old, start watching the movie over and over again and quoting it with your sister to grow the proper appreciation. Otherwise I'm not sure if you will like this movie, but I say give it a shot.","user":"jss280","rank":[44,55]}]