[{"title":"Outstanding, Intelligent, Under-appreciated","rating":8,"date":"3 August 2001","review":"The end of the Cold War and the toppling of the Berlin Wall made this film outdated almost before it was released. Nevertheless, it remains one of the best conspiracy mystery/thrillers ever made. The plot is amazingly intricate, but by the finish everything is tied up neatly, with no loose ends, a rarity for this type of story.<br><br>Gene Hackman is at his no-nonsense best as Johnny Gallagher, a career military man caught up in a complex assassination scheme. As the events unfold, he becomes more and more personally involved, which serves to ratchet up the tension for the audience. His relationships with his ex-wife Eileen (Joanna Cassidy) and the 'package' of the title, a prisoner that Johnny is assigned to escort into the U.S. from Berlin (played by Tommy Lee Jones in top form), are what really elevate \"The Package\" into the first rank of suspense dramas. The scenes featuring Hackman and Jones together are wonderful examples of understatement, as the larger political conflict becomes a personal one. Dennis Franz (NYPD Blue) turns up in a great supporting role.<br><br>\"The Package\" maintains an entertaining balance between action movie excitement and character-driven drama. The political background may be out of date, but the fine acting and writing deliver a story that is still compelling.<br><br>EDIT by author, 08.30.2006 Note: I saw this film during its original theatrical run. Events at that time (late 80's) moved so rapidly, the political situation had changed significantly between the start of production and its release. It was meant to be occurring in the present, not designed as a period piece. That is what I mean by outdated, which in no way detracted from the film's quality, or my enjoyment of it.","user":"raymond_chandler","rank":[56,60]},{"title":"The conspiracy","rating":8,"date":"14 April 2005","review":"Andrew Davis shows with \"The Package\" his affinity to this type of thriller which was better realized in \"The Fugitive\", but as films of this genre go, it makes satisfying entertainment. As written by John Bishop, the film will not bore anyone, although the plot is at times so convoluted it loses our credibility.<br><br>\"The Package\" takes us from Berlin to Chicago. It involves corrupt officers within the higher ups in the armed forces who don't want to see any type of peace between the two super powers at the center of the story, the United States and the Soviet Union.<br><br>This film came out as the Berlin wall was falling. Of course, the Mr. Bishop couldn't have foreseen the future, but after watching the movie, it makes us think this could well have occurred because of the parties involved. The film also points into the subversive groups operating within our country which is an added confusion to the plot.<br><br>Gene Hackman is tremendously appealing as Johnny Gallagher, the man who is responsible for solving the puzzle. Tommy Lee Jones, is the paid assassin Thomas Boyette who, in true thriller fashion appears to be one step ahead of everyone else. Joanna Cassidy makes a good contribution as Eileen Gallagher. John Heard is an intense military man who wants to get rid of whoever comes in his path. Dennis Franz is seen as the kind Chicago detective that realizes the immensity of what is being planned.<br><br>\"The Package\" is a good entertainment under Andrew Davis' direction who gets solid performances from the talented team assembled for the movie.","user":"jotix100","rank":[31,34]},{"title":"Intriguing cold war movie with the timing a little off","rating":7,"date":"21 October 2007","review":"Tommy Lee Jones is \"The Package,\" a prisoner that Gene Hackman is returning to the United States from Germany in this 1989 film also starring Joanna Cassidy, Dennis Franz and John Heard. The United States and the Soviet Union are in the midst of delicate peace negotiations, but there are factions of the military who don't want to see it happen. Jones is Tommy Boyette, their hired assassin who, through an intricate plot, is supposed to kill the soviet premier. Boyette escapes via a mens room while the Hackman character, Johnny Gallagher, is returning him to the states. Gallagher starts investigating; it's not long before he's uncovered the plot.<br><br>This is a very good movie with some exciting sequences and lots of tension, as Gallagher finds himself and everyone around him in tremendous danger as he figures out what's going on. He has the help of his ex-wife (Joanna Cassidy) who is in the military, and a Chicago police officer, played by Dennis Franz.<br><br>The problem with this film is in its timing - it was released in August 1989 in the U.S., and in November of that year, the Berlin Wall came down, rendering the film dated -- and it had only been released in two countries by then. It's nevertheless a well-acted, well-directed film. Seen today, it holds up better as a story set in the past than it did a story set in a present that was changing dramatically.","user":"blanche-2","rank":[24,27]}]