[{"title":"Great family entertainment","rating":9,"date":"10 December 2016","review":"The 2nd of 3 episodes of The Wilderness Family. The first dealt with their adventures during their first summer in their Rocky Mountains homestead, after forsaking their L.A. life. The present episode was released 3 years later. The main actors are the same, except that teenage Heather Rattray replaced pre-teen Hollye Holmes as the daughter. The setting is the same, except it's fall and winter instead of summer. There are the expected joyous and terrifying experiences with various animals. Again, they have 2 bear cubs as pets, which look the same size as 3 years ago! They have a milk goat that their pet bears and raccoon play havoc with. A beaver gnaws a tree that almost falls on some. One night, a wolverine kills all their chickens. Eagles, a bobcat, cougar and innumerable deer are seen. Wolves threaten periodically and have at least 2 fights with the family dog, Crust(strange name!). There is a fight in the snow between a bull elk and a pack of wolves, before Skip(the father) shoots the elk for food.<br><br>The boy(Toby) and girl(Jenny) become lost in a blizzard, and dig out a \"snow cave\" to survive. Pat(the mother) becomes real sick with pneumonia, so Skip begins to walk out to fetch a doctor, since their radio broke. Meanwhile a mean wolf named Scarface attacks the cabin. In the confusion, the kerosene lamp is knocked to the floor and starts a fire, which miraculously is extinguished before much damage. On his trip, a small avalanche knocks Skip down, but he survives. The film ends with the beginning of spring. <br><br>Along with episodes 1 &amp; 3, this is great family entertainment, although small kids may be frightened by the fierce fights. I can't say that one episode is better than the others.<br><br>Some reviewers call Boomer, the periodic mountain man visitor, creepy. I didn't get that impression at all. He seemed like an experienced grandfather. ..Some reviewers complain there is essentially no plot. Well, there's enough interesting things going on without a complicated plot. The same is true of some raucous comedies and some musicals.<br><br>Skip seems like a superman, who can take care of every situation and never gets significantly hurt in his various falls and fights. He doesn't seem very emotional. In contrast, his wife Pat is often very depressed after a traumatic event, and sometimes cries.<br><br>The cinematography is simply breathtaking. with frequent closeups of faces, and great shots of the animals and fights, and the spectacular terrain.","user":"weezeralfalfa","rank":[3,3]},{"title":"The High-Crime Area of the City is Much Safer!","rating":2,"date":"12 April 2006","review":"I had to laugh at the review that gave this a one, but even more at the review which gave it a ten! I'll give it a two for its pure audacity!<br><br>Are there warm, tender \"family moments\"? Yes, enough to catch pneumonia, which mom does. Also, every single time someone is being rescued by someone else, which is required quite often. I simply can't believe that life in the wilderness would present you with so many nerve-jangling dangers. I'd move back to the city, and lock my door when that creepy Boomer shows up!<br><br>Regardless of the sudden horrifying dangers, like disease, fire, avalanches, bears, wolves, etc. the mood always seems to jump back to \"everything is fine\". Weeeeee! (By the way, would you like a pet bear? They are really CUTE!)<br><br>Also, no one is forcing members of a family to watch the telly or to \"not be together as a family\", so why \"escape\" from the city, when you can just live in a better part of the city (hopefully with better neighbors who say \"varmint\" a bit less often) and live the way you wish. With intelligence, a person should be able to live well in just about any environment, in my opinion (even if he really does prefer being chased by wolves on a daily basis). And have a look at that wacky underwear!<br><br>This movie continuously wavers between \"Aw, isn't that cute?\" to \"Oh-my-gosh-he's-going-to-DIE-what-an-idiot!\" Complete with a bit of embarrassing music here and there.<br><br>2/10!","user":"joebridge","rank":[10,17]},{"title":"\"Let's keep the record straight, Boomer -- wolves do not attack people.\"","rating":5,"date":"12 September 2016","review":"Wilderness Family sequel that continues the adventures of our beloved family of irresponsible hippies who forsook the city life to live in the mountains, befriending wild animals. It's pretty much more of the same as the last one, except here the little girl's age has been accelerated to make her a teen, despite only taking place six months after the last film. Robert Logan and Susan Damante-Shaw return, as does George \"Buck\" Flower as the creepy wandering mountain man friend of the family's. More corny music, this time with songs from Barry \"Greg Brady\" Williams. The natural scenery is, of course, the highlight and the best reason to watch this. They make living in the wilderness look so appealing I was tempted to try it myself, until I remembered how much I hate bugs and snakes and how much I enjoy indoor plumbing and food that doesn't bite me.","user":"utgard14","rank":[3,5]}]