[{"title":"Terrific novel but poorly directed film","rating":5,"date":"11 April 2012","review":"First of all, this poster for this movie is incredible. One of my all time favorites. This movie was really hard to find until recently (just came out on blu-ray April 2012) so years ago I found an old paperback of the Jack Finney novel and read it. Loved the story. Then, finally, I was able to see the movie ... disappointing. My biggest complaint is the direction: absolutely flaccid, dull and without any creativity. Not surprisingly the director, Jack Donohue, was a hack TV director almost his entire career and only directed a handful of movies - none of them good. And so Assault on a Queen feels soooo slow when it really should be fast paced and have high energy. The great Rod Serling wrote the script from a fun novel, so I'm not going to blame the writing. And the acting was fine too. The only other problem was the music: poorly used and sparse and never seemed appropriate for the scene. I suppose I can blame the director for this too since he'd be the one overseeing where it was used.<br><br>Anyway, worth watching for fans of 60s heist movies. I like it, but wish it were better.","user":"djb896328","rank":[13,15]},{"title":"German Technology?","rating":4,"date":"5 April 2019","review":"The former Navy military and friends Mark Brittain (Frank Sinatra) and Linc Langley (Errol John) are hired by the treasure hunters Vic Rossiter (Anthony Franciosa), Rosa Lucchesi (Virna Lisi) and Eric Lauffnauer (Alf Kjellin) to dive seeking a sank boat with a treasure. Mark finds a World War II German submarine instead and they decide to recover the submarine to heist the Queen Mary. The mechanic Tony Moreno (Richard Conte) joins the team and they use the submarine that is partially sailing to lure the Captain of the Queen Mary to steal the safe. Will their plan work?<br><br>\"Assault on a Queen\" is an adventure with a silly premise. The idea of recovering a submarine after twenty years sank in sea waters is stupid and practically impossible. Sailing an old submarine with a small unexperienced crew is also terrible. Last but not the least, the lack of chemistry between Frank Sinatra and Virna Lisi destroys any chance of a successful romantic pair. My vote is four.<br><br>Title (Brazil): \"Assalto a um Transatlântico\" (\"Assault on a Transatlantic\")","user":"claudio_carvalho","rank":[8,9]},{"title":"To Have and Have Not Meets The Gang That Couldn't Shoot Straight.","rating":4,"date":"6 June 2004","review":"Frank Sinatra just got tired of challenges in his movie parts during the mid sixties and this film is the perfect example of same. Sinatra is doing a pale imitation of Humphrey Bogart's character in To Have And Have Not and he's even got a drunken companion in Errol John, just like Bogey had Walter Brennan. In walks Lauren Bacall in the form of Virna Lisi into Sinatra's life. Only problem is she's already spoken for by Tony Franciosa.<br><br>Tony, Virna, and former U-Boat captain Alf Kjellin are hunting for sunken treasure and hire Sinatra as a diver. When he spots a sunken U-Boat the plans change. Oh, boy we're going to become pirates instead and we're going to rob the Queen Mary. Along the way the gang picks up Richard Conte who became a Sinatra hanger-on in the last years of his career. He's a mechanic who fixes up the boat, barely. <br><br>Well these geniuses with thousands of miles of open sea to do their crime, decide to rob the Queen in U.S. waters where the Coast Guard is operating. What happens to this bunch and their budding careers as pirates is the rest of the movie.<br><br>Sinatra just sails through this part on his hipster reputation and Virna Lisi is decorative. The acting honors go to Tony Franciosa who actually tries to do some serious acting in his part as charming sleazeball Victor Rossiter. <br><br>The script is by Rod Serling who should have stuck to the surreal world of The Twilight Zone. And Duke Ellington contributed an original jazz score. Around that time Sinatra and Ellington did an album together called Francis A. meets Edward K. Now that was good collaboration.<br><br>Old Blue Eyes should have stuck to the charter boat and diving in this film.","user":"bkoganbing","rank":[12,15]}]