[{"title":"It's people who should be blamed for the filth, not the river.","rating":8,"date":"7 March 2011","review":"House by the River is directed by Fritz Lang and adapted by Mel Dinelli from A.P. Herbert's novel The House on the River. It stars Louis Hayward, Jane Wyatt, Lee Bowman &amp; Dorothy Patrick. Music is by George Antheil and photography by Edward J. Cronjager.<br><br>Novelist Stephen Byrne (Hayward) makes a play for the house maid and unwittingly kills her when she repels his advances. Enlisting the help of his disabled brother, John (Bowman), to dispose of the body in the river, Stephen suddenly finds that the publicity surrounding the maid's disappearance has put him in vogue again. In fact he finds his muse sufficiently stoked enough to craft another novel. But as easy as Stephen finds it easy to have no conscience, the opposite is the case with John, and with the river refusing to hold its secrets, something is going to give.<br><br>Working out of Republic pictures, Lang refused to let the low budget production hamper his vision of a bleak Cain &amp; Abel like Gothic-noir-melodrama. He did, however, meet some resistance when requesting that the maid be played by a black woman, which was quickly shot down by nervous executives at the famed \"B\" movie studio. House by the River is far from being among the best of Lang's work, but the final product is still a triumph considering it's basically a three character piece set virtually in just two locations. It scores high on eerie atmosphere and finds Lang dealing in moral bankruptcy/responsibility and the eye for an eye mentality. Ushered into the narrative, too, is a Lang fave of people irked by loving someone they can't have. These themes allow the director to gloss over the simple script and dally in some truly arresting visuals.<br><br>Aided considerably by Cronjager's (Desert Fury/CanyonPassage) chiaroscuro photography, Lang's film is a lesson in how to maximise effect from limited sets. The actual house on the river, and that of the neighbour (resplendent with creepy scarecrow in garden), has a very disquiet feel to it, fronted by shimmering water that carries the dead carcass' of animals, it's a most haunting setting. And the eerie atmosphere continues inside the house, where shadows work their wonders and Antheil's music sticks rigidly (and rightly) to the creaky house formula. The cast don't pull up any trees, but they don't need to. Hayward is perhaps too animated for a study in snide villainy, but it works and he has a nice line in visual mocking. The rest fall in line for what is required, with the best of the bunch being Ann Shoemaker as nosey neighbour Mrs. Ambrose.<br><br>Once a hard to find film, House by the River is now easily accessible after gaining a DVD release (the print is fine, some age spotting and crackles, but completely watchable). It's a film that is easily recommended to Lang and Gothic house based movie purists. Driven by a despicable protagonist and cloaked in a creepy noirish vibe, it deserves to now gain a better and more appreciative audience. 7.5/10","user":"hitchcockthelegend","rank":[37,37]},{"title":"One of the Most Despicable Characters I Have Ever Seen","rating":9,"date":"10 January 2007","review":"The unsuccessful writer Stephen Byrne (Louis Hayward) tries to force his servant Emily Gaunt (Dorothy Patrick) sexually while his wife Marjorie Byrne (Jane Wyatt) is visiting a friend and accidentally strangles her. His crippled brother John Byrne (Lee Bowman) coincidently comes to his house in that moment, and Stephen asks him to help to get rid of the corpse and avoid an scandal, since his wife would be pregnant. The naive and good John helps his brother to dump the body in the river nearby his house. Stephen uses the disappearance of Emily to blame her and promote his book. When the body is found by the police, all the evidences points to John, and he becomes the prime suspect of the murder. <br><br>\"House by the River\" is a dark and tense movie with one of the most despicable characters I have ever seen. Louis Hayward is perfect in the role of a scum, capable of killing, defaming, lying, falsely accusing, and maintaining cold blood. Jane Wyatt and Lee Bowman complete the efficient trio of lead cast. Fritz Lang uses with mastery the shadows and lights in the black and white cinematography as usual. The story is very tense, but the conclusion is very abrupt and quite conventional, moralist and commercial. In my opinion, this excellent film deserved a darker and amoral ending to become another masterpiece of this outstanding director. My vote is nine.<br><br>Title (Brazil): \"Maldição\" (\"Curse\")","user":"claudio_carvalho","rank":[32,35]},{"title":"The Sociopath and the River","rating":8,"date":"29 March 2006","review":"Intense period thriller about a writer, Stephen Byrne (played by Louis Hayward), who lives in - yeah, you guessed it - a house by the river; with lovely yard and gazebo, yet oddly dark as the film opens with the sky clouded, shadows cast across scenery, haunting music, a dead animal floating by on the glistening water, and a black widow spider crawling over his writing. We meet the attractive, blonde servant girl, Emily, who Stephen clearly has a lustful eye on from the get-go. By the next scene, he tries to kiss her coming down the stairs after bathing in his tub, and, well, she screams and he \"accidentally\" strangles her. With his brother assisting him, they put her body in a big sack and sink her in the river, then follows the cover-up of the murder.<br><br>Well, this film is quite interesting, dark and suspenseful - there's a lot going on here. The print I saw looked strikingly full of sharp black and white contrast. The photography in this makes the film menacing with blackened rooms lit only by candle light casting dark, sharp shadows across the walls, some extreme camera angles up stairs and down halls, shots of faces seen only in mirrors, extreme close-ups, and sweat dripping on the face of a nervous murderer.","user":"movingpicturegal","rank":[15,17]}]