[{"title":"Good, grim, post-Quatermass horror/sci-fi","rating":30,"date":"30 January 2002","review":"The plot: In the remote Scottish Highlands, a living radioactive mass seethes out of the depths of the earth and kills everyone in its path as it seeks fresh radioactive energy. Luckily an American scientist is about the place and kicks the 'thing' back down from whence it came.<br><br>X the Unknown, while not having the innate intelligence of the Quatermass movies, is a good example of 1950's British pulp science-fiction cinema. While most of its American counterparts visited fantastic worlds inhabited by outlandish monsters and gorgeous 'space-babes', X the Unknown was a truly British effort: our monster was dollop of mud out of a hole in the ground doing a slow crawl around a dingy moor.<br><br>It's effective though. It has the same austere, grim intensity which made the Quatermass movies so memorable. The film also benefits from moody, high-contrast black and white photography, a typically acerbic score from James Bernard, and a good cast; Leo Mckern turns in a very good, naturalistic performance, much like his turn in The Day The Earth Caught Fire.<br><br>I first saw this movie when I was about six and the extraordinarily graphic scene depicting the monster 'devouring' a hospital doctor gave me a few... err....sleepless nights (there's a particularly ruthless zoom-in to the poor guys hand as it expands and melts!). Perhaps I should have stuck to Bugs Bunny.<br><br>Overall, a decent chiller, well directed by Leslie Norman (late father of the superb British film critic Barry Norman).<br><br>One last memory of a six year-old's first viewing of this picture: I remember sitting there stunned and horrified as the end credits rolled; I was not looking forward to a good nights sleep. The statutorily paternal BBC announcer came on and cracked the following nervous joke: \"Well, I'll never eat cheese on toast again\" (see the film and you'll know what he meant). I laughed with relief and my childhood was thus saved a terrible trauma! Thanks Uncle Beeb.","user":"Heathcliff","rank":[37,39]},{"title":"Another Great Hammer Outing","rating":6,"date":"6 June 2002","review":"Hammer Films was known mostly for its horror outings like the Dracula, Frankenstein and Mummy films. It did, however, score well in the science fiction department with such hits as the Quatermass series, \"The Lost Continent\" and this movie.<br><br>The film was originally pitches as a potential sequel in the Quatermass series until author Nigel Kneale objected. Thus, the scientist became Alan Royston (played by Dean Jagger of \"Twelve O'Clock High\" fame) who worked at a nuclear plant instead of a rocket base and the location was moved to Scotland to avoid comparisons to Quatermass.<br><br>Ironically, the film still kept the same black &amp; white photography, as well as the creepy string score.<br><br>The story involves radioactive mud (sounds silly unless you actually stayed awake during physical science class) that makes it way up to the surface of the earth every so often looking for new energy. Previous trips found nothing but fossil fuel. Now, however, nuclear energy is abundant. The race is on to not just figure out what is turning people into crispy critters, but how to stop something made of pure energy.<br><br>Dean Jagger as Royston is quite good and the exact opposite of Brian Donlevy's Quatermass. Leo McKern (of \"The Prisoner\") is on hand, as is the late British pop star and actor Anthony Newley as a soldier unfortunate enough to be on guard duty when X, the Unknown strikes.<br><br>The special effects are adequate, although British films still couldn't show explosions that didn't look like match heads flaring. The visual effects are really creepy, from radiation burns on a boy's chest to a doctor's face melting like wax to a security guard's body literally deflating like a balloon. The ending features a surprise, as well, leaving the viewer with the feeling that, although man appears to have triumphed again, something may still be amiss.<br><br>All in all, a good film, especially late on a Saturday night.","user":"pv71989","rank":[21,22]},{"title":"A Hammer Films Classic","rating":7,"date":"25 June 2004","review":"Often overlooked even by those who enjoy the sci-fi films of the fifties, \"X The Unknown\" is one of those sleepers that real afficionados will watch over and over.   Starring Dean Jagger, the cast also features a very young Anthony Newly as a British Army corporal.<br><br>There's not much that professional critics would find either amusing or compelling about this film, but when considered in its place as a landmark movie both for the sci-fi genre and for Hammer films, it shines somewhat brighter.<br><br>As has aready been mentioned, this film occupies a prominent role among those that feature a \"blob\" monster.  The special effects, incidentally, are not bad for the year (1956), and the concept of a radioactive blob is perhaps even more interesting than one that merely gobbles up people.<br><br>I understand that this was one of the early films produced by Hammer, as a step toward making more sci-fi entries.  I'm glad they took the chance. This film and those that followed it enriched the genre for all fans of 1950's and 1960's sci-fi films.","user":"vmwrites","rank":[19,20]}]