[{"title":"What we can learn from this film","rating":9,"date":"19 October 2005","review":"The real question that \"The Naked Gun\" poses is not why it's one of the funniest spoofs ever made, but why virtually no subsequent movie in this genre has been any good at all. I used to adore this sort of movie when I was a kid--\"Airplane,\" \"Top Secret,\" and the six-episode \"Police Squad\" show, which became the basis for the \"Naked Gun\" series, were among the funniest films I knew. When I first saw \"The Naked Gun\" in the theater when I was eleven, I was in uncontrollable laughter for the first few minutes. That was my standard of great humor at the time.<br><br>But the following decades gave us a variety of similar spoof films, some of which involved one or more of the Zucker-Abrams-Nielsen team, and none of these films were even remotely in the league of their predecessors. These included \"Hot Shots,\" \"Loaded Weapon 1,\" \"Jane Austen's Mafia,\" \"Spy Hard,\" \"Wrongfully Accused,\" and \"Scary Movie.\" These films would typically feature some funny stuff, but you'd walk away indifferently, wondering what the overall point was. Seeing a ponytailed Leslie Nielsen imitating John Travolta's dance sequence in \"Pulp Fiction\" is funny for a second, but there's nothing enduring about such humor. An entire movie filled with such scenes doesn't amount to much. What's the big deal about such jokes, anyway? There's nothing intrinsically funny about making references to other films, even if you do it in a silly way. At what point did the genre go wrong and become such a dreary, uninspired affair? Is it that I've just outgrown this sort of humor?<br><br>I have another theory. When I first watched \"The Naked Gun\" at age eleven, I had not seen many of the movies it was spoofing, such as the early James Bond pictures. I was vaguely familiar with some of the clichés it was making fun of, but many of the political and sexual jokes went right over my head. And the celebrity cameos meant nothing to me. So what was it about the film that appealed to me so much, that made me laugh till my sides hurt?<br><br>The answer is simple: it was the film's utter silliness. Think of the scene at the beginning when we discover that Ayatollah Khomeini secretly sports a mohawk underneath his turban. Or the opening credits where the police car goes on the sidewalk, inside buildings, on a roller coaster, and so on. None of this makes any sense, of course; it's just an exercise in pure absurdity. I loved \"The Naked Gun\" for pretty much the same reason I loved the Three Stooges or Bugs Bunny cartoons. Even as an adult, I appreciate unsubtle cartoon humor when it is handled effectively. As long as it makes me laugh, who cares that it's not \"sophisticated\"? For example, the scene where Lt. Drebin breaks into a building and tries to be as quiet as possible, but then inadvertently sets off a player piano, is masterfully filmed.<br><br>Thus, \"The Naked Gun\" is farce as much as it is satire. As I grew older, I would gain a greater appreciation for the one-liners, like \"You take a chance getting up in the morning, crossing the street or sticking your face in a fan.\" To be sure, many of these jokes are dumb. They're supposed to be. That's the whole point. What I understood even at age eleven was that the movie was essentially playing games with the audience. When Lt. Drebin looks in a drawer and says \"bingo,\" I knew immediately that the drawer would reveal a bingo board. I was used to this sort of humor, because I'd seen it in the earlier Zucker-Abrams films, where the jokes had a definite logic to them, and trying to predict them in advance was part of the fun. They have far more to do with audience anticipation than with trying to make us laugh at bad puns.<br><br>The modern spoof films have forgotten all this. They've forgotten that making a good spoof requires a measure of invention, even if much of the plot is ripped off from elsewhere. Car chases may not be original, but \"The Naked Gun\" is, as far as I know, the first film in which the chase is conducted by a student driver. This type of cleverness is largely absent from the modern spoofs, which assume that they have no reason to be creative when their ideas are based broadly on other films. They've forgotten that the most effective way to make fun of a cliché is by coming up with an ingenious twist. Even the characters in films like these matter, and Lt. Drebin is crafted in the grand tradition of other inept lawmen like Inspector Clousseau. This is what gives the film its own personal stamp that makes it more than an exercise in movie references.","user":"kylopod","rank":[164,178]},{"title":"In praise of Leslie Nielsen....","rating":10,"date":"6 October 1999","review":"The movie itself is funny.  \"The Naked Gun\" is without a doubt the best skewering of all cop movie cliches available in this day and age.  It works on every conceivable level and a few that haven't been conceived yet.<br><br>But what puts it over the top is Leslie Nielsen.<br><br>It's amazing: he was great in \"Airplane!\", another classic from the ZAZ team (Zucker, Abrahams, Zucker), and in the lamentably short TV series \"Police Squad!\".  But here, he spreads his wings and flies to new heights of insanity and delerium.  With jaw set square and tongue firmly in cheek, Neilsen makes the role of Lt. Frank Drebin all his own and the movie-going public's collective life is all the more enriched because of it.<br><br>He's aided and abetted by greats like Kennedy, Presley and Montalban (who knew?) and the movie even finds good moments for John Houseman and Reggie Jackson.  <br><br>As I said, the movie takes off and finds great things to do with police cars with a mind all their own and goes on from there to take on such cliches as car chases, illegal searches, the cleaning out of the desk, the trip to the police lab, shoot-outs, the lax housework of a single police detective, etc., etc., etc.....<br><br>And what other cop movie in the history of the world has a music video in the middle, courtesy of Herman's Hermits?<br><br>Just one.<br><br>Ten stars and a Dugout Dog for \"The Naked Gun\", the film that answers once and for all - can Leslie Nielsen do comedy?<br><br>I think you know the answer.","user":"Mister-6","rank":[78,89]},{"title":"Leslie Neilsen is a comedic genius.","rating":10,"date":"21 February 2006","review":"This is another movie from the creators of the ever hysterical Airplane. If you've seen Airplane, than you can expect the same kind of humor from this. This is one of those movies in which you can go crazy by trying to count the gags in the first ten minutes. Airplane did disaster films, this one does police dramas.<br><br>Frank Drebin (Leslie Neilsen) is a respected cop with gravel for a brain. He is part of a police force called Police Squad, who the security of Queen Elizabeth has just been handed to for her visit to Los Angeles. Frank bumbles through several hilarious scenarios in trying to foil an assassination attempt on her, and catch the attempted murderer of his best friend Nordberg (OJ Simpson). Meanwhile, he starts going out with the beautiful Jane Spencer (Priscilla Presley).<br><br>This movie goes from one hilarious situation to another, from commandeering a car that's being used for a drivers test, to trying to save a valuable pen from a fish tank. Leslie Neilsen's comedic timing is brilliant. His facial expressions during the slapstick sequences are priceless, as are his dead-seriousness of delivering one liners. Some of his quotes are so hilarious, that I have trouble figuring out how he could have possibly kept a straight face during filming. This is another classic in the same style as Airplane, which means hilarity. This gets a 9/10.<br><br>It is rated PG-13 for Crude and Sexual Humor, and for Some Language. Sex: 7/10 Violence: 4/10 Swearing: 4/10 Drugs: 5/10","user":"jaysilentbob37","rank":[50,56]}]