[{"title":"Nostalgic Early Sound Serial","rating":5,"date":"8 September 2004","review":"\"The Hurricane Express\" was one of three serials that John Wayne made for Nat Levine and Mascot Pictures after leaving Columbia Pictures following a run-in with mogul Harry Cohn over the affections of a young starlet.<br><br>The Mascot serials were always fast paced and full of action and this one is no exception. The story revolves around a mysterious character named \"The Wrecker\" who is bent on destroying the L &amp; R Railroad. He causes the wreck of the Hurricane Express in which engineer Jim Baker (J. Farrell MacDonald) is killed. His son Larry (Wayne), an airline pilot vows to avenge his father's death. And that's basically it.<br><br>Wayne goes through the rest of the serial trying to identify \"The Wrecker\" and bring him to justice. Is the villain Edwards (Tully Marshall), the General Manager of the railroad; Stevens (Conway Tearle) the railroad attorney; Walter Grey (Lloyd Whitlock) the head of the airline; Stratton (Edmund Breese) an escaped convict who claims to have been set up by the railroad; Jordan (Matthew Betz) an engineer who was fired and has vowed revenge or is it Carlson (Alan Bridge) a station agent?<br><br>Aiding Baker is the lovely Gloria Martin (Shirley Grey) who turns out to be Stratton's daughter. Appearing as \"The Wrecker's\" henchmen are Ernie Adams, Charlie King, Glenn Strange and Al Ferguson. Complicating matters is the fact that \"The Wrecker\" can impersonate anybody by donning a life like mask of that person. Never mind that he can also apparently assume their physical characteristics and clothing as well.<br><br>After 12 chapters, a number of false leads and red herrings \"The Wrecker\" turns out to be.......wait, no, no...Bam! Bam!..aaaargh!<br><br>John Wayne was quite young and very athletic at the time this serial was made and can be seen clearly performing many of his own stunts. The winsome Grey was also at Columbia at the same time as Wayne and even appeared in a picture or two with him. I wonder..hmmmm.<br><br>These old serials also provide a snapshot of the times. I particularly enjoyed seeing the old cars, trains and planes. A bit dated but a nevertheless enjoyable piece of nostalgia.","user":"bsmith5552","rank":[25,25]},{"title":"Great Classic Serial !! Recommend the Full Length Version.","rating":9,"date":"29 March 2007","review":"The full length version runs about 227 minutes. \"Gone With the Wind\",long known for its length, has a run time of about 222 minutes. To experience the full historic flavor of an old time serial, I suggest trying the full length version, but try it as it was originally viewed. (An episode at a time!) Lots of thrills, chills, and spills, and a mystery that can't be solved until the very last episode in which the murderer turns out to be XXXXX. Bit of trivia: The plane used in the movie is a Ford Tri-Motor. (Old Henry built about 200 of them, largely at the instigation of his son Edsel.)In some scenes, its identification has been painted over. In other scenes it can be read. The plane is model 5-AT-49 registration number NC-8411, built in 1929 and destroyed in a crash in the mountains of Columbia in 1939. The \"TAT\" (Transcontinental Air Transport) logo is visible on the plane. (The fore-runner of Howard Hughes' TWA.)All interior scenes were shot in a prop department mock up with increased height and width. Of especial note is the single throttle. The Ford Tri-Motor had three! Dean Jacksonville, FL (Where Shirley Gray died in obscurity.)","user":"dsbird","rank":[9,9]},{"title":"Worth watching the full version just for the cliffhanger cheats","rating":4,"date":"16 April 2006","review":"The heroine turns out to have jumped out of the car before it went over the cliff? OK, that's pretty standard. But why can we still see her (actually, a dummy representing her) in the car as it careens down the hillside? Even more fun are those chapters where they simply substitute new footage showing something completely different than we saw in the previous chapter. My favorite is the one at the end of Chapter 8/beginning of Chapter 9. They simply filmed two completely different events, showed one at the end of 8 and the other at the beginning of 9.<br><br>Also, I want one of those magic masks which not only perfectly simulate someone else's face, but also his voice, height, and build. I'll take the Young John Wayne model.<br><br>It's always fun to watch stuff like this (even though it may be the worst thing the Duke ever did) and try to imagine what contemporary audiences would have been thinking. Did any of them realize that this big stiff young guy would one day become not just the biggest star in Hollywood, but a cultural icon? I doubt it.","user":"counterrevolutionary","rank":[7,7]}]