[{"title":"A pearl in Pink Champagne","rating":12,"date":"12 February 2003","review":"This film has to be probably the best romantic film I've ever seen,  even above Gone With The Wind, but on the same level as The English  Patient (my favorite film of all time). I got intrigued by this film  back in high school when my sister dragged me to see Sleepless in  Seattle. I caught the references to this film that Meg Ryan made  throughout that film and thought that I'd like to rent this film  (Affair to Remember) to see what the commotion was about. Needless to  say, with the whole \"shipboard romance\" aspect of it, and the promise  to meet again in six months atop the Empire State Building of all  places, I quickly became hooked. The scene on the French Riviera with  Nickie's grandmother playing the piano, oh God is it beautiful! Cary  Grant is so debonair and suave and Deborah Kerr is so ravishing and  stunningly beautiful, that it always demands repeated viewing from me  (at least three times a year).   Seeing this film always makes me wonder if something like the kind of  relationship that Nickie had with Terry in the film would really be  possible. Would and could someone actually leave the person they were  engaged to to marry a complete and total stranger that they just met  days ago? I'd like to think that it could, but then I am nothing but a  hopeless romantic. The final scene always tears my heart out, no matter  how many times I've seen it, I'm always sobbing. Watching this film  around Valentine's Day (even if you are single) is always a treat. It  allows our fantasies to take flight so that we may think that we are  actually the one meeting our beloved atop the Empire State Building in  a thunderstorm.  Watch with a box of Kleenex nearby.  My rating: 4 stars","user":"JSanicki","rank":[52,64]},{"title":"Truly a film (and affair!) to remember!","rating":10,"date":"17 May 2001","review":"This is an absolutely beautiful flim, with two beautiful, shining stars. Deborah Kerr, always the epitome of British lady-like reserve... that dainty face and that curled red hair... always bringing a grace to the roles she plays (except for Karen Holmes in \"From Here To Eternity\"... but that's another story).  She's breathtakingly grand as Terry McKay, the class-act who falls in love with a playboy (Grant), though she is engaged to another. And Cary ... the most gorgeous person to EVER grace this earth!  He's absolutely marvelous as playboy Nickie Ferrante, who finds himself falling quickly in love with someone other than his fiancee.  I have never seen chemistry on screen like this!  Although the movie may be classified as \"sap\" or \"a love story\"... it's got it's funny moments (\"Do you think it will ever take the place of night baseball?\", \"Top of the mornin' to ya!\"--\"And the rest of the day to you!\").  But there are some scenes that just absolutely take your breath away... like when they are visiting Nickie's grandmother (in my opinion, the point that they realize their deep love for each other).  Also, when they meet their fiancees in New York and while Terry's hugging Ken, Nickie gently kisses his fingertips and places them on her glove, and then she holds her glove to her cheek.  Truly divine. However, the defining moment of this film (believe me, you better have some hankies handy!) is at the end... the look on Grant's face whenever he sees the portrait is PRICELESS.  And of course, Kerr's voice trembling at the words \"Darling, don't look at me like that.\"  I give this movie a definite 10.","user":"Sweet Charity","rank":[83,110]},{"title":"As Deep and Rich as It Is Stylish and Romantic","rating":9,"date":"13 July 2007","review":"\"An Affair to Remember\" is an almost perfect film. It is as deep and rich as it is stylish and romantic.<br><br>And if someone tells you it is just a soap opera -- that person would be very, very wrong.<br><br>Yes, the film has style to burn. Deborah Kerr was never more beautiful. Her skin looks like cream; her pert, pinched nose like a blossom. She's never been more appealing than she is here. The scene where she smiles from a boat at her fiancé on shore alone is worth the price of admission.<br><br>Cary Grant seems to sleep in tuxedos. He is a walking model of male perfection.<br><br>Less observant viewers come away from this movie thinking that nothing happened, that nothing was ever at stake, that nothing was risked or gained. How wrong they are.<br><br>Kerr's amazing dresses -- how about the one with the pumpkin colored ribbons woven through the front? -- Grant's suavity, and the south of France settings are not just there to pose for the camera.<br><br>All of the beauty of this film is there to do very hard work -- to tell a less than beautiful story.<br><br>And, no, this is not a movie where nothing happens. Something is happening in every scene -- you just have to be paying attention, and you just have to be mature enough, or have your antenna up high enough, to catch the subtle messages the film is sending, and to feel in your own solar plexus, the resonances of loves, dreams, and selves risked and gained, or lost.<br><br>Nicki and Terry are both gambling much here. They are wounded people in a world of high glamor; they speak in arch codes, even as their hearts are bleeding, or their breath is caught against the cage of dreams.<br><br>Grant's character, Nicki Ferrante, is a lazy gigolo. \"Gigolo\" is a pretty word for an ugly situation. Ferrante is a talented artist, but he knows that he can market something else he does -- seduce women -- far more easily, and for a higher price, than he can get for his paintings.<br><br>Kerr's character, Terry McKay, as she says, had to grow up very fast, and fight off a boss who -- well -- she faced some bad stuff in her life. When a steady, but less than thrilling, man offered to set her up, she, no fool, took the offer.<br><br>These are two beautiful people swanning through life over some very ugly circumstances. They have both sold their best selves for easy money.<br><br>And, then, completely by chance, on shipboard, they meet their soul mates. This meeting doesn't just present them with an opportunity for a one night stand. It demands that they face their own fears, and become their best selves.<br><br>I'm one of those cynical people who doesn't believe in love, never mind soul mates, but this movie carries it all off so well, it makes me believe.<br><br>Grant and Kerr begin with the lightest, and subtlest, of exchanges. they say things to each other -- example: \"I'd be surprised if you were surprised\" -- that, if you are not paying attention and that if you don't know a lot about life -- would just go over your head.<br><br>Slowly but surely their effervescent, and yet irresistible, attraction becomes truly heavy. The scene with Grandmere Janou (Cathleen Nesbit) is amazing for all it says, without actually saying anything.<br><br>I could see a naive film-goer taking in that scene and then asking, \"What was the point of that scene?\" You really have to have your eyes on the screen, and have a sensitivity to human interactions. Who is looking at whom; whose face is suddenly hidden and why; who is saying what without actually saying it; and why does the sound of that boat whistle bring tears -- you have to be willing to pay attention, and to have a sense of life and human relationships, and, yes, an openness to the possibility of there being a God to understand that scene.<br><br>Here you have a man and a woman who have, basically, sold themselves to the highest bidder, and who, at that point, are perilously close to cheating. What happens? Their love is blessed by the Virgin Mary. Heavy stuff.<br><br>\"We changed our course today.\" Truer words were never spoken.<br><br>I've got to hand it to Leo McCarey, who wrote and directed this film as well as the Academy Award winning \"Going My Way.\" He so wonderfully brings the best, and most complex, aspects of Catholicism to the screen here. Catholicism is associated with the romance languages -- French, Italian -- and it also is friendly to this kind of romance -- a romance where fallen beauties are blindsided by the kind of tortuous, redemptive, overwhelming, fated love that demands, and gets, everything, after which, you are never the same.<br><br>If you haven't seen the movie, or \"Sleepless in Seattle,\" I won't reveal the ending to you. I'll just say that merely thinking about the ending can make me cry such tears as, really, very few films I've ever seen can make me cry. These tears are their own species.","user":"Danusha_Goska","rank":[47,62]}]