[{"title":"The 1st Chinese Sword-fighting Classic and Box Office Champion","rating":9,"date":"10 August 2005","review":"This is the original of the 1992 remake of the same title(with a NEW) and 2nd of the \"INN\" trilogy by King Hu after Come Drink With Me. It was a major hit all over Chinese areas in South East Asia and discovered Shang Kuan Ling Feng(note the mistake by a previous comment)as the 2nd most popular Sword woman(the 1st was Cheng Pei Pei, and later 3rd Hsu Feng(Hsia Nu aka A Touch of Zen). All these 3 females stars are made popular by him and they are also the 3 most popular swords women in Chinese Cinema.<br><br>If there is any complaint by any viewer, it's the pace that many may find it a bit slow but isn't most highly regarded movies slow ?? The finale scene is the most climatic in a Chinese action that critc compared this film to \"Rio Bravo\" and \"The Wild Bunch\".<br><br>Beware of some mistakes in the original English subtitles mentioned by the director himself.<br><br>You can watch some scenes of it if you go to the movie Bu San(2003) aka Goodbye, Dragon Inn(here in IMDb and watch the trailer) which paid tribute to this movie.<br><br>The 90's remake is nothing better except for an additional character well acted by Maggie Cheung.","user":"chinesefan","rank":[19,21]},{"title":"A bloody dynastic struggle in ancient China comes to vivid life on the screen.","rating":10,"date":"17 November 2004","review":"I saw this during its initial run under the title \"Dragon Inn.\"<br><br>This is no ordinary swordplay movie. It is a visual treat of ancient Chinese costumes and weaponry. The traditional Chinese instruments used for the background music added an otherwordly flavor. I left the theatre wondering if the movie was truly historical. <br><br>The head of the Yu clan has been condemned to death by the evil prime minister who has usurped imperial power. A palace eunuch who managed to claw his way to power, he is also reputed to be China's greatest swordsman. He plots to eliminate the entire Yu family but is opposed by a master swordsman and swordswoman.<br><br>A memorable scene that has nothing to do with fighting is the dinner at Dragon Inn which introduced me to the Mongolian Fire Pot (shabu-shabu) style of eating. To the uninitiated, there is a fire pot in the middle of the table decked out with all sorts of raw food which you put into the boiling water of the firepot and eat them as they are cooked. The cooking water is sipped as soup.<br><br>I took my little sister to see it and from then on she got hooked on Chinese swordplay movies. She began reading up on ancient China and in college she majored in history and archaeology -- all because I took her to see Dragon Inn. <br><br>I am gratified to learn recently that the female supporting actress Feng Hsu moved on to become a producer-director herself with a number of critically acclaimed films to her credit. I look forward to seeing them soon.","user":"Deusvolt","rank":[19,26]},{"title":"Despite its age, one of the best martial art films of all time.","rating":1,"date":"1 April 2003","review":"I saw this film in the 60's, and have yet to find one to beat it.  'Hidden Dragon, Crouching Tiger' has to come in behind this masterpiece.  The use of new actors and actresses, the adoption of well-timed traditional Chinese music, e.g. to usher in the villain, the innovative action sequence in sword fights, all added to the brilliance of this film.<br><br>Yes, there are shortcomings.  Toward the end, and the climax, the anti-gravity leaps to the trees were overdone and unnecessary. Regardless, this film resembles the best of the traditional, addictive Chinese martial art novels that once consumed many hours of the armchair martial art addicts.","user":"ronchow","rank":[17,23]}]