[{"title":"A Kingly Feast for the Eyes and Ears","rating":10,"date":"7 December 2004","review":"\"Henry V\" marks Kenneth Branagh's greatest achievement to date. Branagh not only directs this rich and visually stunning film, he stars as the title character. The movie opens with Derek Jacobi (Branagh's Shakespearean mentor) in modern garb passionately delivering the prologue. Then we are taken into the dark, dank rooms of Henry's castle. The king makes his dramatic entrance, complete with a Darth Vader style cape. <br><br>The entire film is filled with grandeur and pomp, with any faults in the story line being attributable more to Shakespeare himself than Branagh. Henry V as I remember it from my college English class is a decidingly pro-British play (and film). There is little question that France should be conquered, and Henry speaks of his war against France as if it were France that attacked England. Indeed, Henry's famous \"St. Chrispin's day speech\" is so rousing, that it has been quoted often and inspired the name of the \"Band of Brothers\" miniseries about World War II. This is no surprise, since Shakespeare's prose is famously beautiful.<br><br>There is definitely a difference in the way that both sides of the conflict are presented. The French, at least in Branagh's movie are presented as arrogant (and somewhat effeminate), while on the side of the English, even children are filled with manly courage. Henry is presented as noble, fair, and merciful. True he threatens the mayor of one French town, telling him that if he does not surrender the town, the English will do terrible things to its residents, but does not carry out his threat. He also hangs the one English soldier who steals from a French church, refusing to show favoritism for him just because he was his friend. Apparently mercy towards your own countrymen was not a virtue that Henry saw particularly important.<br><br>The films greatest attribute is its soundtrack, particularly the use of music in the scene following the battle of Agincourt in which the warring parties collect their dead for burial.<br><br>All in all, a fascinating look inside the mind of a king.","user":"artemis_5","rank":[52,65]},{"title":"A Worthy Successor After 5 Decades","rating":30,"date":"30 December 2002","review":"Let's get one thing straight: It was Olivier who finally cracked the concrete heads of film producers open and proved that it was possible to put the bard of bards on screen without even an American audience falling asleep after 10 minutes. Sure, after all this time his Henry looks ancient, pretentious and artificial, but so will Blade Runner after 50 years, and still both mark a watershed after which none could be done like anything before. Odd comparisons? Maybe. But fitting.<br><br>Branagh's Henry finally set a tone worth to succeed the initial awesome blast unleashed by the most powerful actor for generations, and I'm sure Branagh would be the last to deny Olivier's version the place it deserves in British movie history. Times were ripe for another tone - but times before had needed Olivier as much as the following ages will need Branagh.<br><br>I'm an obsessive fan of both versions - both for entirely different reasons - and both merging perfectly what I love most about Shakespeare's eternal works.<br><br>Branagh's film is timeless - of this time - without ever being trendy. Olivier's is timeless - as well as of its time - as long as we keep an understanding of its time.<br><br>Olivier praised the eternal flame, the eternal smell, of Shakesperean theater, as always reaching far beyond the confinds of its subject - beyond the confinds of the wooden circle of 'The Globe'.<br><br>Branagh went right for the jugular, without ever loosing grip on what makes this play a play beyond its subject, and THE play about that subject.<br><br>Has anyone considered the vital difference between Branagh's and Olivier's versions? I doubt it. Where Olivier conjured up the intoxicating smell of fresh 15th century glue from the sets rising into the audience's noses, come here straight from the bear fights, whore houses, sermons of zealots and whatever had to flee London's stern moral walls of those times, Branagh cut right to the bone of any hardened 'modern' movie goer.<br><br>Behold: Derek Jacoby's prologue is a piece of speech which will forever haunt, enchant and cover me in goosebumps - firing me up to see what comes as well as see what Olivier as well as Branagh had done with the only play ever to merge humanity's lust as well as dread for the subject of war.<br><br>Of course, Olivier's version couldn't even dream of matching the intimate intensity of Branagh's. But how could it?<br><br>Ok, I won't further dwell on it, but for the last time, consider the father to fully understand the son.<br><br>Now, having shed the overpowering shadows of the past, Derek Jacoby steps into the dark of the expecting stage - striking a match...,<br><br>\"Oh, for the muse of fire...\" ... and off we are, lured into the torrent of the bard's unique and eternal magic.<br><br>I consider Henry V the best of Branagh's Shakespeare adaptations, even though I wouldn't want to be with any of the others on pain of death. This one's flawless, perfectly cast, perfectly executed and perfectly acted by Branagh himself.<br><br>From Burbage to Garrick to Keane to Inving to Olivier to Branagh... it is a glorious lineage to follow in love and admiration for the bard of Bard's ambassadors.<br><br><br><br>Schogger13","user":"schogger13","rank":[66,86]},{"title":"Tis a triumph at evr'y turn: Shakespeare and Branagh Move Thy Heart and Makest Ye Wishth that One Had English Blood Pure of Nobilitie","rating":10,"date":"6 September 2009","review":"According to William Shakespeare, on the morn of the Battle of Agincourt (1415), one of the final military confrontations during the 100-Years War between France and England, the English troops exhibit hesitancy and consternation toward this monumental of tasks at hand. They have been engaged in a long campaign on French soil having just trekked several hundred miles toward Calais to return to England. Kenneth Branagh as King Henry V suddenly appears among his soldiers and speaks the words that inspire his noble \"brethren\". Here is but an excerpt:<br><br>\"This day is called the Feast of Crispian: He that outlives this day, and comes safe home, Will stand a tip-toe when the day is named, And rouse him at the name of Crispian. He that shall live this day, and see old age, Will yearly on the vigil feast his neighbours, And say 'To-morrow is Saint Crispian:' Then will he strip his sleeve and show his scars. And say 'These wounds I had on Crispin's day.' Old men forget: yet all shall be forgot, But he'll remember with advantages What feats he did that day: then shall our names. These are words that would make any man fight for his brethren.\" (Act IV, Scene 3)<br><br>No one knows exactly when William Shakespeare wrote Henry V (aka The Cronicle History of Henry fift, The Life of Henry Fift) except that it was probably penned sometime between the late 1580's and 1590's. Aside from the historical liberties that permeate much of the drama, such as the king's executing anyone who would steal from local French communities (in reality Henry V's troops plundered much of the French countryside during their campaign), Henry V stands as one of Shakespeare's most moving and inspirational achievements. Certainly, the play is very much biased toward the English. While the English are colorful, emotional, and determined, the French are portrayed as conniving and dispassionate, except for the princess Kate. Shakespeare was not intending to teach a lesson in medieval history but rather arouse patriotism among his fellow countrymen. (Is it possible Henry V was written during the time of England's battle against the Spanish Armada in 1588?) <br><br>Kenneth Branagh has taken Shakespeare's overly patriotic play and forged a piece that combines the stunning visuals of Hollywood film-making with the high-culture of William Shakespeare into a movie of stunning magnitude that seems nearly incomparable, with the possible exception of Zeffirlli's \"Romeo and Juliet\". Hollywood films of this type have often been lopsided with great visuals but mediocre scripts. However, in this case, there is no better screenwriter than William Shakespeare. Added to the mix is an outstanding cast of Shakespearian actors who navigate through Shakespeare's blank verse as easily as if they were speaking modern dialogue instead of late 16th-century English. They speak the lines as if they are spontaneously being uttered rather than being remembered from a 400-year-old play. And to give a little bit of spice to the experience, Branagh incorporates a few flashback scenes from Shakespeare's Henry IV in which Prince Hal (not yet Henry V) commiserates with a band of drunkard cronies lead by none-other than one of Shakespeare's most popular characters, Sir John Falstaff.<br><br>This play, this noble play, which hast action, adventure and high arte, would be a fine and noble way to show those of young years the arte of Shakespeare. Seest thou this filme, this fine filme. And if thou seest not this filme, I will sadly be forced to come into thy companie and take ye to the theatre, tie ye up to a chair, and make ye watch these actors fine. Aye, ye willst later thank me, for never was there a moment dull.","user":"classicalsteve","rank":[19,22]}]