[{"title":"Just push the button marked BOOZE!","rating":30,"date":"30 January 2009","review":"What can I say? It's an epic adventure and comedy rolled into one! It's been my #1 all-time favorite film since childhood, which says a lot. I was surprised to find out how underrated it is. Critics always talk about how it stars so many famous comedians. The novelty overshadows the movie itself. Like I said, I saw this at a very young age, and didn't know who all these actors were. This is the movie that introduced me to them.<br><br>It also gets downplayed, being labeled as \"slapstick.\" But that's cutting it short. There's a lot of subtleness in there too. The performances are outstanding. I've never seen a movie that has so many memorable characters all in one. <br><br>Each of them go on their own adventure, inter-cutting along the way, as they each have to overcome their own obstacles and meet other characters on their journey. It's like several movies all intertwined together, and most of it happens in real time. The 2 1/2 hour run time feels appropriate and passes like nothing. Every second is entertaining, which is the greatest accomplishment for a motion picture to achieve.<br><br>The film resonates with me on a deeper level. All these characters met on the side of the road. They were just ordinary hard working people who had nothing in common, except for one dream. That unreachable fantasy. They all wanted the money so bad. They weren't happy with their lives. They wanted a change, and they would do anything to beat each other. They're overcome by greed which becomes their overlying problem. <br><br>Fantastic movie! Full of hilarious moments, and a great story!","user":"TheCinemassacre","rank":[85,98]},{"title":"Greatest comedy of all time, period.","rating":10,"date":"5 March 2005","review":"I never planned to write a review for this movie, until I took a stroll through the user comments, and was shocked at all the people who think it is.... God help us... overrated. No way. If anything, it is UNDERrated. I see people complaining about the endless shouting, the over the top slapstick, the brashness, the loudness, the length. I can only conclude that these people are a bunch of humorless dorks.<br><br>First of all, you can't just sit down to watch a three hour movie without knowing what you're in for. This is not your typical comedy--this is an EPIC comedy, the first of its kind, that inspired other such epics as \"Those Magnificent Men in their Flying Machines\" and \"The Great Race\" (which happens to be my favorite comedy--in fact, I'd like to say it's the better movie, but props go to this one for inventing the genre). And I can't speak for everyone else, but this movie leaves me laughing from start to finish.<br><br>Yes, it is very long, but it NEVER has a dull moment. Even if the amazing car stunts aren't particularly funny, you can't tell me they aren't wildly entertaining. I have yet to see an action movie with better car chases than these. And yes, the slapstick is ridiculously over the top, although I can't see how that's a problem (the gas station scene is one of the funniest in movie history, in my opinion). But underneath all the slapstick and shouting, holding the whole movie together, is that incredibly cynical message. It is a movie about kind, decent folks turning into law-breaking lunatics and ruining their lives for the sake of money. The subplot with Spencer Tracey realizing his entire life has been a waste, and then ruining what life he has left, is one of the most tragic story lines I have seen. But it's also pretty darn funny.<br><br>All the critics need to lighten up and see this for the absurd, delirious, hysterical farce it is.<br><br>10/10 stars.","user":"Chromium_5","rank":[302,366]},{"title":"More than the sum of its parts","rating":10,"date":"20 March 2001","review":"Often accused of being less than the sum of its parts, \"It's a Mad Mad Mad Mad World is one of the most precious gems in filmdom.  True, it's far from being the funniest movie ever.  Once, when Monty Python was putting a film together, they found that after fifty-odd minutes the audience stopped laughing.  Thinking it was the material, they recut it so the latter material came out first.  The audience still stopped laughing at fifty-odd minutes, even with what MP assumed the funnier materials backloaded.  The fact is, people can only laugh so long.<br><br>Even armed with the information that an audience cannot sustain laughter for three hours, \"Mad World\" is not overwhelmingly funny.  Though lots of dialogue is amusing and all the performances are outstanding, but the movie suffers from a common delusion of people outside comedy, as Stanley Kramer was, that the mere vision of cars crashing is somehow funny in itself. One is reminded of the spectacular sequence in \"1941\" when a ferris wheel breaks loose and rolls off a pier into the ocean.  The sequence itself is jaw-dropping and extremely well-done, and not funny for a moment.<br><br>The value in \"Mad World\" is its cast.  Most of the big names in comedy in the 1950s and 1960s made it into the cast (Ernie Kovaks, arguably the brightest of the lot, originally cast in the Sid Caesar role, unfortunately died not long before shooting started).  The casting of name comics in tiny roles doesn't do them justice:  Stan Freberg has nothing to do but watch Andy Devine talk on the telephone;  Doodles Weaver is an uncredited \"Man Outside Hardware Store\";  the Three Stooges merely show up to be recognized; even Jack Benny, in a miniscule role funny merely because he's in it, doesn't have an impact today because too few people remember who he was. Again, some milk their small roles for what they are worth, giving the movie an undercurrent of true humor beyond the principals:  Don Knotts, Carl Reiner, Jesse White, Paul Ford, Jim Backus.<br><br>\"Mad World\" is most valuable simply because it is a cross-section of comedy in its day.  Although he was talented in many ways, anyone unfamiliar with Phil Silvers will see him in a performance that was the epitome of what he was famous for.  Dick Shawn's manic wildness is captured forever in a way that is little seen in his few other films.  Terry-Thomas, whose brilliance was too often relegated to obscure British films rarely seen anymore, is a joy to watch and his British tilt provides a variation from Americans who learned their craft in the Catskills and Vaudeville.  Jonathan Winters, whom Robin Williams used as a prototype, was the most gifted ad-lib comic of his day and rarely showed up well when he was constrained by a script and a sustained character, but he brings off many of the best laughs in this film, and, with Arnold Stang and Marvin Kaplan the most memorable set piece in the movie.  Milton Berle and Micky Rooney both bring lifetimes of stage and screen work to the project, and their input was invaluable.<br><br>\nAll the principals (Berle, Caesar, Adams, Rooney, Hackett, Terry-Thomas, Shawn, Silvers, Winters, Anderson, Falk) are good.  Even the ones who seem to have been shorted of funny lines, like Edie Adams, and Eddie Anderson, nevertheless come off well.  Although they blend well together, there is a subtle fight between them for attention, to steal a scene with a facial expressions (watch Adams' face, for instance, when Caesar drags her away, in front of the \"Big W\", though you may have to put it on slow-motion) or a bit of business.  You can see each of them thinking, at all times.  Each gives an intelligent performance, having laboriously hammered out their timing and their business, and they're all thinking, with the clockwork brains the best comedians have.  They may not all be funny every minute, but every moment they know what they're doing, crafting better performances than many Oscar-winning serious actors have ever turned in.<br><br>Though the movie might be too bloated for the promised three hours' hilarious ride, with too much dependence on, \"Hey, there's Edward Everett Horton flicking a switch!\"  But anyone who loves comedy and its history needs -- deserves --  to see the best in the business of comedy in 1963 interacting with their schtick, especially if they don't mind sitting through -- occasionally mindless -- car chases and crashes.","user":"vox-sane","rank":[172,212]}]