[{"title":"One of cinema's finest achievements","rating":8,"date":"8 September 2004","review":"Odd Man Out is a terrific piece of cinema. It is set in Ireland and stars James Mason as Johnny McQueen; leader of an underground Irish organization that engage in a robbery that will enable the organisation to steal the funds it needs to continue it's activities. However, the heist goes sour. Events conspire against him, and Johnny ends up wounded and alone in the city of Belfast. The police then launch a huge manhunt to find the criminal and lead him to justice, and what follows is a desperate struggle by Johnny, and Johnny's friends, to get him to safety. Before the film starts, it claims that it is not about the state of Ireland at that time, but rather the effect that the state of the country has had on it's people; and that is exactly what the film does. The neutral people in the film are caught between whose side to be on; helping the police will keep them out of jail, and for some, make them feel like they are doing the right thing; but nobody wants to get on the wrong side of Johnny's \"organisation\", as that could also be detrimental to your survival. All of the characters in the film have some affiliation to the state, be it good for them or, more commonly, bad for them.<br><br>Odd Man Out is an adventure. It's an adventure about one man's struggle to get from point A to point B. Like all good adventure films, he meets people along the way; some that will help him, some that won't. It's exciting in this respect, but the film isn't only an adventure. As he did in his other masterpiece; The Third Man, Carol Reed succeeds in giving a thriller a great substance. That's one of things that's great about this film; on the surface, it's entertaining and therefore can be enjoyed by anyone, but if you take a look under it's skin, the film has depth also; which firmly places it in the \"film buff\" category of films. Odd Man Out clearly highlights the paranoia, values and fears of the era, and these are explored through the main character.<br><br>Odd Man Out is one of the best directed films that I've ever seen. Carol Reed is an excellent director, and one who is worthy of more acclaim. Here, he indulges in many tricks with the camera, including a terrific sequence that sees our hero see multiple images in a puddle of spilled beer. Reed pulls all of these tricks off, and none look out of place. Considering that this movie was made in 1947, it's a piece of technical wizardry. Reed also uses many different cinema styles at different times to further his story. The film is dramatic at certain points where the characters are interacting, but at the other end of the spectrum; it's very cinematic at certain times, most notably in the scenes that see Johnny being chased through the streets of Belfast. These scenes are extremely atmospheric and very aesthetically pleasing. Despite indulging in many different tricks and styles; the film is never gratuitous. Where another, lesser, director might have gone over the top; Reed doesn't, and it keeps the film very much on the level, which is to his, and this piece of art's credit.<br><br>Overall, Odd Man Out is a masterpiece that is on par with, if not better than The Third Man. It's a shame that it has seemingly been forgotten as this movie can surely take it's place among the best of all time. A glorious must see.","user":"The_Void","rank":[86,94]},{"title":"A Snowy Night In Belfast","rating":10,"date":"20 November 2001","review":"One of the most beautifully directed (Carol Reed) and photographed (Robert Krasker) films I have seen. The story revolves around the attempts of various citizens of Belfast to either aid, comfort or kill a wounded revolutionary gunman. A great deal has been written about this picture, concerning mostly its meaning, and I'm going to (heretically) skip over these issues and focus instead of why I think the film works so well as a piece of art rather than try to figure out what it's saying.<br><br>Essentially what Reed and Company have done is create a dark and gloomy urban landscape and made it seductive, even precious to us, by making us care about the people we meet there. Not that these are especially likable people. Many of them aren't, but they're presented fairly and, till near the end, without too much melodrama; and the way they're offered to us, which is to say their environments, vastly warmer and more enticing than the cold night streets the bleeding fugitive is staggering through, create a series of dramatic contrasts between the real world most of us have to move through, and the more imaginative, safer worlds of our homes, where we can retreat to, and imagine we are something else. The wounded Johnny McQueen can afford no such luxury on this bitter night, as each little warm nest offers, for a brief while, a ray of hope that this time he will come in from the cold for good, get warm, rest a little, have his wounds taken care of, and maybe even, if he gets really lucky, find himself a warm bed to sleep in. <br><br>Alas, this is not Johnny McQueen's night. Some of the people he encounters treat him decently enough for a while, till they figure out who he is, and then calculation sets in, and selfishness wins out in the end. The film is full of the kind of nocturnal yearnings anyone who has ever lived in a cold city feels as he walks the streets, whether to a pub or train station, home or restaurant, wondering what on earth he is doing out on a night such as this. One goes past this little rowhouse on a sidewalk, or that little walk-down cafe, and looks in the window, sees the people inside, and wishes one were there. Yet cold nights have their pleasures, and even rain has a beauty, as puddles reflect the light of streetlamps and rain-streaked windows make rooms that much more inviting.<br><br>Odd Man Out takes these moods, and the musings that accompany them, and raises everything to the max. Johnny isn't merely a man walking down a street, he's a hunted criminal. As we feel as he does, everything comes more intensely into focus than it would normally; as a phone booth can look like the most wonderful place in the world when the snow starts falling. The film makes us see and feel things as we seldom do in normal life, and the result is a kind of compulsive aestheticism that may well be accidental. Anything is or can be beautiful under the right circumstances, and all interior places are inviting when the temperature drops, one hasn't eaten in hours. I suspect that this wasn't the film-makers' intention, that they were hunting bigger game, looking for larger meanings, and the trappings of their picture were intended perhaps as incidental pleasures, or maybe not as pleasures at all. But it is precisely these things,--the visual tropes, not the philosophical and theological underpinnings--that I find most interesting and gratifying about the movie. In the end films have their own meaning, and this one makes me more attentive to the smaller things in life rather than the larger issues; to snow, rain, beer, to boots and overcoats, to the thin white blankets of snow that drape cities on winter nights.","user":"telegonus","rank":[44,47]},{"title":"A great film, largely overlooked","rating":15,"date":"15 June 1999","review":"\"Odd Man Out\" is far more than just a very good \"cops and robbers\" movie, although it can hold its own with most.  Beneath that is a deep psychological drama as Johnny McQueen, an IRA rebel, wounded in a holdup, is pursued by police, his own gang, and several unsavory characters.  McQueen becomes less of a man and more symbol to his hunters.  He is viewed as a martyr, meal ticket, and art project. Robert Newton is excellent in his role as a half-mad artist who wants to hold Johnny just long enough to paint the expression in the eyes of a dying man. Intensely suspenseful, set in the working-class neighborhoods and slums, the gray atmosphere compliments the plot perfectly.  One of James Mason's finest.","user":"iron-5","rank":[53,58]}]