[{"title":"The mystery of it all","rating":10,"date":"17 April 2004","review":"No computer generated images, small 1:33 ratio black and white screen and yet there is nothing in the world that comes close to the intimacy of this experience. Just look at Gary Cooper listening, trying to understand. Look at Jean Arthur falling in love. We have lost something very important along the way and it's not just innocence. How is it possible that nobody can get anywhere near this simple magic trick? They used to call Capra films \"Capracorn\" I wonder what they call Adam Sandler, Freddy Prinze Jr, and Jennifer Love Hewit comedies today? I want to jump into a time machine and go to those days, the days of Mr Deeds, Gary Cooper, Jean Arthur and Frank Capra.","user":"don_agu","rank":[109,130]},{"title":"Tuba player inherits fortune and becomes a Cinderella Man and gets pixiliated in Manhattan!","rating":9,"date":"3 August 2004","review":"One of Frank Capra's strengths as a film director was the great team he assembled. Not only did he have a great technical group behind him, but his casts combined talent that went from the major stars to the bit players.<br><br>In this fable, Mr. Capra gives an answer to those of us that always pondered: what would one do if one inherited a lot of money, or if one won the lottery (fat chance!) It must be terrifying to suddenly have a lot of wealth, in this case 20 million during the worst days of the Great Depression. Sometimes it's better to stay poor rather than have to deal with strangers that have designs on one's newly found wealth!<br><br>Gary Cooper has never been as charming as the tuba playing, country bumpkin whose life is changed dramatically when he has to go to Manhattan to claim his inheritance. His Longfellow Deeds gets to see first hand how the high society, his uncle belonged to, deals with this unsophisticated greeting card writing poet. <br><br>Jean Arthur was a natural comedienne. She is wonderful in this movie as the reporter who tricks Deeds into speaking with her and in the process falls in love with the man, the object of the ridicule she writes about.<br><br>\nLeonard Standing, one of the best character actors of the era, is equally effective as Cobb, the man who knows a thing or two about those society folks. George Bancroft was also good as MacWade.<br><br>The film has a pace that never lets the viewer down. In comparison with what passes today as film comedy, this is a masterpiece. It shows the genius of Frank Capra in charge of this group of people that make us treasure films like this one even if it's pure nonsense, which after all, was what the director was looking for to make us laugh.","user":"jotix100","rank":[47,56]},{"title":"\"The Sanest Man Whoever Walked Into This Courtroom\"","rating":10,"date":"6 August 2006","review":"Frank Capra knew that Gary Cooper was made for the part of Longfellow Deeds, he waited until Harry Cohn could get him from Paramount before making this film. It certainly is a once in a lifetime role and it got Gary Cooper his first nomination for Best Actor. He lost that year to Paul Muni for The Story of Louis Pasteur. But Capra won for Best Director that year.<br><br>Cooper, poet laureate of Mandrake Falls, inherits 20 million dollars from a rich uncle. He's not terribly impressed with that as he feels he's living just fine in Mandrake Falls. But he goes down to New York City to settle the estate and gets put up in grand style at his late uncle's mansion. <br><br>The executor of the estate, Douglass Dumbrille, is one smooth talking, white shoe bottom feeder. This is probably Dumbrille's best known classic villain, John Cedar. He wants Cooper's power of attorney real bad to cover up some dipping he's done. Cooper isn't giving it to him right away though.<br><br>In the meantime his inheritance has become news and local editor George Bancroft has dispatched sob sister reporter Jean Arthur to invade his inner sanctum. That's a common thread in the Capra populist trilogy, a woman sent to invade the inner sanctum of the hero and ends up falling for him. Jean Arthur did it again to James Stewart in Mr. Smith Goes to Washington and Cooper had it done to him again by Barbara Stanwyck in Meet John Doe.<br><br>After a whole lot of silly incidents which Arthur duly reports on, Cooper gets a real wake up call from one of what the current president then called a forgotten man. John Wray, a desperate farmer, tossed off his land and there were plenty of those in the twenties and thirties tells him off good and proper in a very powerful scene. Cooper, his own values questioned, decides to set up a fund to save the family farm as an institution. <br><br>Then he's called insane and Dumbrille takes as clients other heirs who want to contest the will. Which leads to Cooper's hearing in court to determine his sanity.<br><br>The values of Mr. Deeds are certainly eternal, honesty and decency don't and should never go out of style. Unfortunately the family farm is a thing of the past, there are less and less of them every year. It's agribusiness now so a faithful remake could never work today.<br><br>Yet the original still has a charm that cannot be denied, due to Frank Capra's vision and the way he got great performances out of the whole cast. One performance that shocked me was Raymond Walburn who usually plays avuncular, loquacious types. He plays the butler to Cooper's uncle and now to Cooper himself. To those who expect the usual Walburn we know and love, this is one different Walburn.<br><br>Even though Mr. Deeds Goes to Town is rooted firmly in the Thirties it should still be seen and studied today.","user":"bkoganbing","rank":[39,46]}]