[{"title":"Two Great Performances by Bette Davis!","rating":8,"date":"24 September 2006","review":"Many of the films of the 60s were boring as hell. It took a star like Bette Davis to bring the necessary fire to this double role as twins in \"Dead Ringer.\" In other hands, this might have been unworthy, but with Davis' magical screen presence, you can't take your eyes off her (both of her!) Even in small scenes, she's real and radiant (when Jim gives her the watch for her birthday). Andre Previn's score is superb. I loved the music after Edith storms out of Margaret's bedroom in the beginning of the film when she sees the portrait of her sister's dead husband and HER former lover, followed by that tender moment with the butler.<br><br>With the performances that got Oscar nominations during the '60s, some were pretty dull. Compared to them, Bette deserved a nod for best actress. Davis was wonderful in this. Her years of acting experience before the cameras was on full display in every scene...she was the consummate professional.<br><br>Did you notice Perry Blackwell at the organ? She also appeared in the Doris Day/Rock Hudson hit,\"Pillow Talk\" as the nightclub singer a few years prior. The drummer in this was married to Nancy Wilson!","user":"nneprevilo","rank":[25,27]},{"title":"\"Mirror, mirror, on the wall, who's the fairest twin of all?\"","rating":7,"date":"5 June 2005","review":"Nobody in film has yet portrayed evil bitch, and sometimes crazy evil bitch, as well and as often as the late great Bette Davis, as evidenced by such films as \"Of Human Bondage\", \"Whatever Happened To Baby Jane\", and \"The Nanny\", just to name a few that come immediately to mind. Capable of spitting out lines such as \"Ah'd luv tuh kiss yuh, but ah jus' washed mah hair\" (from \"Cabin In the Cotton\", 1932), \"Every time you kissed me, I had to wipe my mouth! Wipe my mouth!\" (from \"Of Human Bondage\", 1934) to \"But Blanche, yuh ahhh in that chair, yuh ahhhhhhh!\" (from \"Whatever Happened To Baby Jane\", 1962), Bette Davis made a lucrative living with her hip-swinging sashaying stride and her mannerisms that still make her a favorite of drag queens everywhere.<br><br>In \"Dead Ringer\", Bette was once again cast in the dual role of good sister/bad sister (Edith Phillips/Margaret DeLorca) similar to her dual roles in \"A Stolen Life\" (1946, with Glenn Ford). Paul Henreid, her co-star in \"Now Voyager\" - remember him in the classic scene that involved his lighting two cigarettes and handing Davis's character one of them - directs. \"Dead Ringer\"'s premise is simple: good sister impulsively tries to step into shoes of deceased bad sister in an ill-conceived move to improve her own quality of life, without thinking of the inherent consequences. In this case, as in the case of \"A Stolen Life\", Davis inherits the dead bad sister's myriad mix of self-imposed problems, but with worse consequences.<br><br>And as veteran filmgoers have realized for many years, the family dog always knows who's who.<br><br>Karl Malden, as Davis' earnest boyfriend (and cop) Sgt. Jim Hobbson is basically re-enacting his earnest boyfriend characterization from \"A Streetcar Named Desire\", and Peter Lawford, who was a real-life playboy and drunk, (in addition to allegedly acting as a bit of a pimp for the Kennedys, circa the Marilyn Monroe/John F. Kennedy/Robert Kennedy liasons era), plays Tony Collins...the drunken playboy boyfriend of the dead bad sister, Margaret DeLorca.<br><br>\"Dead Ringer\" was made in an era of more rudimentary special effects, so Davis's two characters interacting almost face-to-face in some scenes was quite innovative for the time, well-done (better than the obvious stand-in used for some scenes) and still holds up well.<br><br>Fun times ensue for all. Classic Bette melodrama.","user":"ClassicAndCampFilmReviews","rank":[44,50]},{"title":"Bette's Triumphant Return to Warner Bros!!!","rating":9,"date":"17 March 2011","review":"Bette Davis the greatest female star in the history of Warner Bros returned to the studio to make this excellent film. ( Bette's great comeback hit, 'Whatever Happened to Baby Jane' was filmed at the old Producers Studio aka Raleigh Studios on Melrose but was released by WB).<br><br>Jack Warner gave Bette Davis carte Blancha on this film after Bette's great hit in 'Whatever Happened to Baby Jane'. I liked 'Dear Ringer' a lot and Bette Davis has a field day playing both parts. Karl Malden is very professionally as always. WB contract Star Phil Carey has a small role.<br><br>Paul Henried so memorable a co star of Bette's directs 'Dead Ringer' in crisp fashion and the cinematography in gorgeous black and white is first rate. I miss the B@W movies!<br><br>Read that Lana Turner was offered this movie first but turned it down. Not sure if that is true or just another one of the many Bette-related stories that circulate. In any event, glad Bette Davis got the part. Fine drama. <br><br>Paramount and Sony Columbia name Buildings after Film People who have made great contributions to those studio lots, Paramount has buildings named after Hal Wallis, Lucille Ball, Mae West, Marlene Dietirich, et al and Sony Columbia has buildings or stages named after Kim Novak, William Holden, Rita Hayworth, Frank Capra et al, and I wish Warner Bros would name a building on its fabled movie lot after WB's greatest female star Bette Davis.","user":"williwaw","rank":[11,11]}]