[{"title":"THE 80's comedy","rating":9,"date":"15 October 2003","review":"Weird Science is the best 80's comedy that was ever made. I'm saying it. Ghostbusters, Summer Rental, The Great Outdoors, Strange Brew, Gung Ho, Mr. Mom, all of these movies have their place, but none of them can match Weird Science for laughs or pure....eightiesness. Yes eightiesness is a quality. It's a corny, dated quality but one that is tangible and valued by my fellow eighties loving brethren to this day. Come back with me if you will to a time when Anthony Michael Hall was still fielding calls and Kelly LeBrock was French for sexy.<br><br>Weird Science has everything that an eighties comedy needs: A least one hot girl, a few actors who are no longer working or who do anything that will come along, plenty of dashing eighties threads, a corny as hell eighties soundtrack,(and Oingo Boingo is as corny and eighties as they get), and plenty of cheap funny jokes. <br><br>Undoubtedly the best thing about Weird Science is Bill Paxton, who plays Wyatt's older brother Chet. Chet is the worst big brother ever to grace a movie screen and is a role model for all big brothers everywhere, me included. Chet delights in extorting money and valuables from Wyatt in exchange for his silence about Wyatt's activities. The best part in the movie is when Chet gets turned into the toad thing or whatever it is. Man I love that part. <br><br>The rest of the cast does a good job of being their stock characters. Kelly LeBrock does a good job of being hot. Robert Downey Jr. shows none of the signs of future drug addiction. The film is unremarkable in the fact that it isn't anything groundbreaking or special. It's just a funny movie. And an eighties classic. <br><br>Bottom Line: If you grew up in the eighties and you never saw Weird Science then you must atone for your crimes by going out and buying it right now. Then send me an email telling me how grateful you are that I put you on the path to rightousness and eighties correctness.","user":"chvylvr80","rank":[101,122]},{"title":"Funky Teen Sci-Fi (spoilers)","rating":7,"date":"8 August 2004","review":"80s! I'm living in the 80s! If you love 80s teen movies, then Weird Science ought to be in your catalogue. It is one of director John Hughes most memorable, and one of the 80s most original.<br><br>Written in two days, this is a teen science fiction film, the story of two teenage loners, Wyatt (the always grimacing Ilan-Mitchell Smith) and Gary (Anthony Michael Hall before he went deadpan) and their weird way of discovering girls. A variation on Frankenstein, the teenagers create a beautiful woman (the super cool Kelly LeBrock) using their computer and some clever hacking skills (of course, it's exaggerated). Their creation is Lisa, the chic English accent woman who brings a little life to the subtle Illinois suburb. As the antithesis of both Wyatt and Gary's personalities, she's going to show these boys a little adventure, get them to loosen up, and for crying out loud, gain some self-esteem.<br><br>Because Lisa is a lady with some supernatural power like freezing grandparents in time, erasing the memory of a bad first impression with Gary's parents, turning Wyatt's obnoxious military school brother Chet (Bill Paxton in his funniest, most arrogant role yet) into a giant pus maggot, or even having a gang of mutant bikers storming a house party. And Lisa's greatest gift to the boys: showing them true love by helping them along to meet the two girls they've been after all along, their high school classmates, Deb and Hilly, who are unfortunately hung up on the dweeb bullies, Max (Robert Russler) and Ian (Robert Downey, Jr.). So essentially, it deals with many aspects of teen angst (but more like just teen self-esteem or self-consciousness issues) within one story. Parents, class status (done subtly here as opposed to Some Kind of Wonderful or Pretty in Pink), relationships, etc. It works well, and is done quite humorously.<br><br>One of my favorite scenes is when the trio (Lisa, Gary, and Wyatt) go to the night club looking pretty out of place (they're not only the only white people there, but probably the only ones under thirty). Once Anthony Michael Hall's character, Gary, gets drunk and starts with his slang, it's hilarious. Reminds me a little of Adventures in Babysitting when the gang drops in on the club and they're not allowed to leave until they sing. So eventually, they loosen up and have a little fun.<br><br>It's a wonderful movie with a classic John Hughes comic touch (says the mutant biker to Gary and Wyatt after they threaten to kill them if they don't leave, \"Please don't tell anyone about this. I'd hate to lose my teaching job.). Plus, it's got a great soundtrack, featuring Killing Joke, Lords of the New Church, and Oingo Boingo doing the title song. The music video for it was fantastic, and not only features clips from the movie, but Kelly LeBrock herself in Oingo Boingo's own rendition of creating the woman via technology. <br><br>Although not one of John Hughes' best (I think Sixteen Candles is still his greatest), it is certainly one of his most memorable and one that I will love no matter how old I get. So have yourself a lazy Saturday, pop in the movie, and enjoy.","user":"vertigo_14","rank":[42,49]},{"title":"Essential Viewing for the 80s generation","rating":10,"date":"27 December 1998","review":"Weird Science is the product of the prolific '80s' writer/director John Hughes (who later went on to create films such as 'Home Alone'). This man single-handedly crafted movies about teenagers for teenagers, without ever becoming patronising or authoritative. Weird Science epitomises the 80s with its fast cars, shoulder pads and big hair. To be honest, Weird Science is synonymous with that decade and reflects most if not all, of its hopes and aspirations (computers in every home, robotic servants etc.). Looking back on it now it's incredibly dated, however and more importantly, the film is still as entertaining today as it was over ten years ago!<br><br>Anyone who grew up in the 80s and is beginning to reminisce will instantly relate to the exploits of the two lead characters Gary (Anthony Michael Hall) and Wyatt (Ilan Mitchell-Smith), as they use their computer and associated paraphernalia to create a beautiful girlfriend (Kelly LeBrock). Although not Hughes' best work, this was reserved (in my opinion) for the later 'Ferris Beuller's Day Off' which was far more appealing to a wider audience - Weird Science will always be a 'Geeky' 80s classic. The film was so popular it spawned it's own TV series - ten years later!<br><br>Unless you lived through that decade the film won't touch you in quite the same way. You needed to have been in awe of Tron, to have worn stone washed jeans and to have owned at least two pairs of illuminous [odd] socks, to really appreciate the naivety of the main characters as they place their faith in computers and 'modern' technology.<br><br>Today to a younger - more clued up audience, Weird Science could get lost amongst so many other 80s flicks with inferior technology and  visual special FX to today's CGI standards. However there is something quintessentially 80s, something oh so Duran Duran about Weird Science that separates it from even the best of today's films. It's that central 'Hughes' element with its visual nuances and audible gags that makes this a timeless classic, watchable again and again.<br><br>If you know what 'ghetto blaster' is definitely watch this film, if you were born after 1984 take everything with a pinch of salt and pay attention - you might learn something.","user":"grid212","rank":[75,95]}]