[{"title":"Time has been kind....","rating":8,"date":"21 September 2007","review":"Where to begin?? Well, going against the grain, I actually enjoy this film a great deal and have watched it several times. Not because it's a great film by any means, but just because there is something hugely enjoyable about it. It starts off well with the closing sequence of a film that was never made but which could, at a stretch, be perceived as related to 'Taste the Blood of Dracula'. The Count and Van Helsing are caught in a death struggle atop a horse drawn coach hurtling through Hyde Park. We know that the Count ended up in England during Taste the Blood so it seems fitting that he has somehow been revived, headed for London, and come to the attention of his arch nemesis Van Helsing. Indeed, I would have liked to have seen the movie that I imagine this sequence to have come from. A disciple of the Count gathers up some of his remains and artifacts, proceeding to bury them just outside the walls of the graveyard where Van Helsing has just been interred. Their fate is sealed; somehow they will meet again!!!<br><br>OK, so it's pretty much down hill from there, but it's not an irreversible slope; there are still some decent moments to come. I find it quite interesting that Dracula remains in the old church, caught in a kind of time warp, almost oblivious to the strange new world outside. Also caught in a time warp are the group of young people on whom the majority of the story focuses; they seem already anachronistic in 1972, some of their references seeming around ten years out of date. Nonetheless they serve their purpose, which is slightly more evident in the recent DVD release that includes several scenes missing from other versions.<br><br>As usual the finished product differs from the original outline. For example there were plans to reveal that Dracula is, in fact, the Devil. An unfilmed piece of dialogue involved Dracula explaining his status to Johnny Alucard; 'I was always here Always since the dawn of time. Since the rebel angels descended into hell. Since darkness followed light I am Dracula, Lord of Darkness, Master of the Walking Dead! I am the Curse, the Apollyon, Angel of the Destroying Furies! I am the Apocalypse!'. Interesting because this film is often decried in comparison to those being produced in America within the next couple of years, most notably 'The Exorcist'. Yet here were Hammer thinking of bringing Old Nick into the mix in 1972! Such lines were apparently dropped at Christopher Lee's insistence due to the extent to which they removed the character from Stoker's original concept, but aspects of this speech, or at least certain implications, are evident in the concluding stages of 'The Satanic Rites of Dracula'. The vampire had been pretty successfully integrated into modern times by American film makers, the most notable examples being 'Count Yorga, Vampire', the excellent 1972 TV movie 'The Night Stalker' (pilot for the old TV show) and a couple of years later the much maligned, but actually pretty good, 'Blacula'. But unlike these films, Hammer were agents of change in a different way; moving from Victorian Gothic romances to which movie goers had become accustomed over the past 14 years to an environment in which the loss of the Gothic could result in the loss of the audience, consequently the ruined and neglected St. Bartolph's church successfully represents the death of the old and its imminent demolition suggests that there's no going back, which, indeed, for Hammer, there really was not.<br><br>There is much to enjoy in this film; Lee and Cushing are, of course excellent, and some of the supporting players acquit themselves well. But now, I guess, one of its most appealing features is the sense of nostalgia it induces it just seems like simple, harmless fun now.","user":"futes2-1","rank":[15,15]},{"title":"\"Weird, man. Way out. I mean, spooks, hobgoblins, black magic. All that sort of stuff.\"","rating":7,"date":"9 October 2005","review":"In 1872, Dracula was finally put to rest by Professor Van Helsing. One hundred years later, a group of young people thinks it might be good for a few laughs to perform a Black Mass. Unknown to them, a member of their group is a decedent of one of Dracula's disciples who has been waiting for this opportunity to bring Dracula back from the dead. Alive in modern day London, Dracula now seeks revenge against the Van Helsing family and plans to get that revenge by making Jessica Van Helsing one of his kind.<br><br>Take a look around the internet and you'll notice that on almost every list of favorite Hammer vampire films, Dracula A.D. 1972 is at or near the bottom. I don't get it. I actually had a bit of fun with this one. The scenes of the Black Mass were sufficiently creepy, much of the hip 70s music and vibe were infectious, Stephanie Beacham made a great heroine as Jessica Van Helsing, Christopher Neame was perfectly cast as Dracula's disciple Johnny Alucard, and the final showdown between Christopher Lee and Peter Cushing is one of the better match-ups they had in these roles. I enjoyed it so much that I have no problem placing Dracula A.D. 1972 among my three favorite of Hammer's Dracula films.<br><br>It just goes to prove that while recommendations on the internet can be useful, taking a chance on a movie with a less than stellar reputation can sometimes payoff.","user":"bensonmum2","rank":[23,25]},{"title":"Tell Us About The Blood, Johnny!","rating":1,"date":"1 February 2004","review":"I don't understand why people constantly put-down this movie (and its sequel Satanic Rites Of Dracula) They're both great fun and much more enjoyable than the stodgy Taste The Blood Of Dracula (in fact Satanic in my opinion is the best of the whole Hammer Dracula cycle in my opinion!)<br><br>I've noticed lots of people pointing to the 7O's factor as feeling very dated- (well, what else were people supposed to be playing in 1972- 90's techno music?) I quite enjoyed Stoneground's little performance and to knock the soundtrack by Michael Vickers is unfair as it is constantly enjoyable and funky to listen to. Add the ever-reliable Peter Cushing and a Christopher Lee who DOESN'T look like he's going through the motions (even if he had doubts about doing the movie) and a well-off-the-wall- but enjoyable nevertheless performance by Christopher Neame as Johnny Alucard and you get a lovely slice of 70's horror nostalgia! And I'm sorry anybody with a spirit of fun about them has got to love a movie with lines like \"Tell us about the blood, Johnny!\" By the way I noticed a previous reviewer was confused by the beginning of the movie and whether Christopher Neame was a descendant of the character in the 1880 prologue- well of course he was! I thought that was made clear.... (by the way, interesting note of trivia, Mr Neame claims that when he was bit by Christopher Lee in the movie he did indeed become a full-fledged initiated vampire- he even lists it on his CV as a proud fact! See the Flesh and Blood Hammer Documentary for the full story.....)","user":"crockettuk","rank":[29,34]}]