[{"title":"The Ultimate Kid's-Fantasy-Come-True!","rating":1,"date":"1 December 2001","review":"Watch this one with child-like eyes and you'll have a great time. Tobor ('robot' spelled backwards) is the invention of an elderly scientific genius who develops a robot to serve as the pilot for dangerous space flights in place of human astronauts. The inventor's grandson (Billy Chapin) befriends the robot during the development of its complex brain and artificial personality. Commie spies kidnap the inventor and the boy, attempting to get their hands on the valuable robot.<br><br>Tobor is incapable of speech, which gives the robot an interesting quality of mystery and strangeness. But he does have the ability to sense human thoughts and emotions. In other words, he can tell when someone is up to no good!<br><br>In the climax, Tobor has to break out of his own lab to rescue the boy from the evil commies who kidnapped the youth to gain control of the robot. Although Tobor is less agile that a human being, he moves around much better than Robby or Gort -- which comes in handy when Tobor has to lift the back end of the bad guy's car and prevent them from escaping!<br><br>Tobor's physical design is pretty impressive. Although it doesn't have the aesthetic appeal of Robby or Gort, he is solidly constructed and a pleasure to watch in action. The movie includes a scene in which the inventor opens up Tobor's chest to show his interior to a group of reporters at a press conferences when Tobor is presented to the public. Obviously the reason for the scene is show the audience that this is no mere suit with a man inside. It's a real robot!<br><br>It's a nice little touch in a movie designed to inspire younger viewers . . . and to entertain older ones.<br><br>'Tobor the Great' is a terrific kid's-fantasy-come-true story. Admitttedly, the direction by Lee Sholem is decidedly unskilled, and young Chapin is a mediocre actor at best (he's no Michel Ray of 'The Space Children', I'm sorry to say), but Charles Drake ('It Came from Outer Space') holds his own as the boy's father. William Shallert ('The Monolith Monsters' and several other 1950s classics) plays one of the reporters in the scene mentioned earlier.<br><br>A prerecorded tape was available a few years ago, but you'll have trouble finding it now. If a DVD comes out, it's worth the money if you have a soft spot in your heart for the sincere and unique efforts the 1950s sci-fi films.","user":"Bruce_Cook","rank":[23,27]},{"title":"Wow...talk about a tough audience!","rating":7,"date":"27 November 2009","review":"I'm sure surprised to see that this film only has an overall IMDb score of 4.7--talk about a tough audience! Sure, by today's standards the film might seem dated or even quaint, but in its day it was a dandy little sci-fi yarn--and is still pretty entertaining today.<br><br>The film is about a really cool elderly scientist. His home is an amazing compound complete with traps and high-tech gadgets and he is working on a robot (named 'TOBOR' in his hidden basement lab--a place even Batman would be proud to own). Charles Drake is a younger scientist of like mind who comes to work with him on TOBOR. The idea is to have a robot that can be controlled from Earth and used to safely explore space. Unfortunately, the evil Commies (though they are never explicitly called 'Communists' in the film) want the plans for TOBOR and will do anything to get it--anything.<br><br>The film was obviously meant to appeal to children as well, with young Billy Chapin playing the scientist's precocious grandson--a kid who is as smart as many adult scientists. But I never found the kid as annoying or cloying as precocious kids in some movies. Oh, and by the way, Billy is Lauren Chapin's real-life brother. Fans of \"Father Knows Best\" may remember her as the youngest in the family, 'Kitten'.<br><br>Overall, highly entertaining and fun despite some limitations imposed by a lower budget. Yes, the Earth does NOT revolve the wrong direction in space nor is it surrounded by space clouds! And, the stars look fake because they are all the same brightness. But, even with these minor problems, the film is well worth seeing and is among the better sci-fi films of the day. Clever and cool.","user":"MartinHafer","rank":[16,18]},{"title":"Saw this as a child. Remembered it, Loved it.","rating":10,"date":"12 April 2004","review":"I was a little girl when this came out. I saw it in the theater and was spellbound. I only saw it once, but remembered it all my life. I just bought it and could not be happier. It is very much for children, but I will always hold it dear. I think the plot is fun. The robot is great and the people are funny, but all in all this is a film I would take any one to see, big or small. It just makes you feel good to watch it. I wish that there were more movies made this wholesome. The title is wonderful too. Robot spelled backwards. You just can't lose with a movie like this. I would give it a big thumbs up!!!!","user":"klmontana2","rank":[20,26]}]