[{"title":"THEY DON'T MAKE THEM LIKE THIS ANYMORE!","rating":10,"date":"1 June 2004","review":"This movie is a treat from start to finish. Fantastic writing is the main reason why, and terrific character actors at every turn. Not quite as bawdy, but reminiscent of Blazing Saddles in its depiction of the Wild West - I mean, one of the funniest characters is BlackJack, George Segal's loyal steed. <br><br>Highly recommended for laughing out loud - a real gem - can't wait for the DVD.<br><br>Don't be afraid to show it to the kid's either, just a bit of language to manage, but otherwise, funny for almost all ages. Wish Segal and Hawn had done more work together - a great team!<br><br>Enjoy!!","user":"pmf-3","rank":[20,23]},{"title":"A Romp!","rating":9,"date":"22 March 2005","review":"Although the music may be a little dated now, I believe any fun-minded viewer will find this offering to be a thoroughly enjoyable romp. <br><br>George Segal and Goldie Hawn are at their best and deliver one delightful comic situation after another, much like, and in my opinion, better than, Mel Gibson and Jodie Foster in the also enjoyable but more recent \"Maverick.\" I wouldn't be surprised if Mel and Jodie, not to mention the \"Maverick\" producers, wisely drew on this film for inspiration as the chemistry is interchangeable between the two movies. <br><br>One of many moments not to be forgotten is in the excellent turn of Conrad Janis as the blissfully unaware mark or the sidesplitting pig-Latin (pig-German?) argument Hawn and Segal develop in his presence. <br><br>I would very much like to see this film again and so will you.","user":"Iroffman","rank":[16,19]},{"title":"Lip-licking & plum-touching...","rating":8,"date":"21 January 2001","review":"This western comedy gets off to a smashing start: Goldie Hawn, dressed like a lascivious German barmaid, singing in a San Francisco saloon full of rowdies. It's a Marlene Dietrich bit that out-Dietrich's Madeline Kahn from \"Blazing Saddles\". Thin plot has a card-sharp in the Old West trying to keep vicious sidewinders from stealing his stolen loot; a dancehall girl gets there first. This is one of those comedies from the 1970s best described as 'bawdy', with some memorable moments: Hawn, pretending to be the Duchess of Swansbury, singing for a drooling Mormon; she and George Segal talking gibberish-French in a stagecoach; the couple floating down a river to the vocals of Bobby Vinton, and later getting tied to stakes in the sweltering desert. Sloppy, yet ingratiating film gets by solely on charisma and energy. It didn't find a sizable audience in theaters, though I would suspect Hawn-buffs will enjoy it on DVD. Raffish Segal also charming, and working effortlessly with his co-star. ***1/2 from ****","user":"moonspinner55","rank":[15,19]}]