[{"title":"Grim, but not entirely hopeless","rating":10,"date":"24 January 2003","review":"Middle Ages: Antonius Blok, a Swedish knight, returns from the Crusades only to find his country dying of the plague, religious fundamentalists taking over and Death himself wanting him to come along. Antonius challenges Death to a game of chess and is meanwhile driven to desperation because of the absence of God. This description sounds like a very serious, philosophical and dour film, and actually it is serious, philosophical and dour; but there is also a little warmth, hope and humor, maybe not for Antonius, but for the viewer.<br><br>When Blok and Death interrupt their game of chess (due to the plague, Death is very busy), he meets two actors, Jof and Mia, with their little son, the most human characters of the film, and I don't think it's a coincidence that there names sound very much like Joseph and Mary. These people may be a little dim, but they are good at heart and you can see the happiness in Antonius' eyes when he is together with them for the first time.<br><br>\nBut the main aspect of Ingmar Bergman's arguably best film are Antonius Blok's grim encounters, as the young girl about to be burnt at the stake, as a scapegoat for the plague. And the haunting image of a huge crowd of flagellants interrupting a play of Jof and Mia and trying to convince the crowd thery are doomed; hardly any other film is that direct in asking controversial and essential questions about God, religion and mankind as The Seventh Seal.<br><br>Another reason for the impact this almost 50-year-old film has still today is the acting: Max von Sydow's face always seems to reflect what Antonius Blok is thinking, Nils Poppe's performance as the naive actor and caring father is priceless and Bengt Ekerot's Death became a part of film history and survived all its spoofs (the best one being in Woody Allen's tremendously funny \"Love and Death\"). But the best performance is done by Gunnar Björnstrand as Antonios Blok's misogynist squire, dryly commenting all their encounters even in the face of death.<br><br>The Seventh Seal is not subtle in raising it's questions, that's for sure. But it makes you think about these questions nevertheless. It's disturbing and grim most of the time, but at the end it gives you the hope that it might become better.","user":"RWiggum","rank":[260,297]},{"title":"Ingmar Bergman questions the meaning of life, death, faith, and the existence of God in this masterpiece of world cinema...","rating":10,"date":"1 January 2005","review":"Antonius Block - \"Who are you?\" Death - \"I am Death.\" Antonius Block - \"Have you come for me?\" Death - \"I have long walked by your side.\" Antonius Block - \"So I have noticed.\"<br><br>The Seventh Seal, considered by some to be Ingmar Bergman's greatest achievement, is the desperate prayer of a sensitive, introspective, and insightful young man confused by the horrors of the world around him. Ingmar Bergman's films are often very deep, full of symbolism, philosophy, spirituality, emotion, and thought. The Seventh Seal is classic Bergman. Expressing his fear of life with no meaning, death with no understanding, and faith with no validity, Ingmar Bergman takes us deep into the well of his mind.<br><br>As the Black Plague ravages the world, a Antonius Block and his squire, Jons (Max Von Sydow and Gunnar Bjornstrand, respectively), return from fighting in the Crusades. They find their homeland devastated by the plague, their countrymen mad with fear, and their cause lost. Antonius Block is confronted by Death (Bengt Ekerot). Block challenges Death to a game of chess to provide him time to seek answers to the questions that plague his mind as Death has plagued his country. Death accepts, knowing that Block cannot escape his fate, and the two begin their game. As the story continues, Block and Jons meet with several testaments to the agony that the Black Death has brought upon their land. They find a young girl who is to be burned at the stake for having been with the Devil. They find madness in the eyes of all they meet, as everyone is convinced that God is angry and is punishing the world with the plague. They also find a small group of travelling actors, who appear to be the only souls to have remained sane in the midst of all of the death and fear. Block and Jons move across the countryside in the hopes of finding safety in Block's castle, but Death is always around the corner, biding his time.<br><br>Brilliantly conceived, and stunningly executed, Bergman's vision is brought to the screen through Gunnar Fischer's powerful cinematography creating images that will likely remain with you for the rest of your life. Strong performances from everyone involved bring humanity to the film. Max Von Sydow's brave and conflicted Antonius Block matching wits with Bengt Ekerot's sinister, omnipotent Death is a microcosm of the forces at work in this breath-taking interpretation of the mortal struggle.<br><br>A masterpiece!","user":"ACitizenCalledKane","rank":[220,257]},{"title":"A masterpiece","rating":26,"date":"26 May 2003","review":"In the magnificent 1957 classic The Seventh Seal by Ingmar Bergman, Antonius Block (Max Von Sydow), a knight returning home from the Crusades with his squire Jöns (Gunnar Bjönstrand) meets Death (Benkt Ekerot) on a lonely beach and challenges him to a game of chess. If he wins, he lives. While the game goes on, he gets a reprieve. It is the 14th century and suffering and pain abound. Penitents flog themselves, seminarians rob the dead, people go mad from fear, and witches are burned at the stake. It is the time of the Black Plague and Death has his hands full. As in the Greek legend of Kronos and medieval folklore, Bergman depicts Death as the Grim Reaper, a man clothed from head to foot in a black habit and hood. In The Seventh Seal, however, Death is not frightening or sinister, just an old man performing his job with a wry detachment.<br><br>The film opens and closes with the passage from Revelation from which it takes its title: `When he broke open the seventh seal, there was silence in heaven for about half an hour' (Rev 8:1). Bergman's message, however, is more about the silence of God on earth than in heaven. Block is tormented by the fact that God will not outwardly reveal himself. He says to a priest during confession, `I want God to stretch out his hand to me, reveal himself and speak to me. But he remains silent, I call out to Him in the dark but no one seems to be there\". But Block still senses the God within him and is tormented. \"Why can't I kill God within me?\" he asks. \"Why does he live on inside me, mocking and tormenting me till I have no rest, even though I curse him and try to tear him from my heart' Block asks Death if he knows anything but he knows nothing. He even asks a woman being taken to the stake if he can see the Devil so that he can ask him about God but all she says is to look into her eyes. <br><br>The Seventh Seal is not all heavy \"significance\", however. It has a good story with believable characters, wonderful performances, lots of comic relief and moves easily from drama to comedy as in the great Shakespearean plays. We meet an actor named Jof (Nils Poppe), his wife Mia (Bibi Andersson), and their infant son Mikael. Block looks with envy on the simple love of this family for their child. Both Jof and Block see visions of the spiritual world but Jof's visions are life affirming whereas Block sees only reflections of darkness. The film has unforgettable images such as a hawk floating in a cloudless sky, two horses standing in the surf, Jof's vision of the Virgin Mary caring for her child, and a frightening procession of plague-infected flagellants. <br><br>Perhaps too melodramatic for modern viewers (it has been parodied), The Seventh Seal still touches a universal longing deep within us. Some view the film as a complete denial of God, but it seems that God does show his face -- only Block and his squire cannot see it. It is there in the wild strawberries, the fun of watching a troupe of players perform, the innocence of the little boy, the eyes of the young lovers, and the haunting visions of Jof. The film ends on a note of affirmation including one of the most memorable scenes in the history of cinema, the Danse Macabre, the Totentanz -- a string of silhouetted figures dancing in a line with arms outstretched as they are about to enter the unknown. In the magnificence of his vision and the timeless beauty of his art, Bergman has answered the question about God's existence simply in the act of posing it.","user":"howard.schumann","rank":[198,231]}]