[{"title":"Well... at least it LOOKS good.","rating":30,"date":"30 March 2004","review":"Probably the best thing that I can say about this film is that it was, near as I can recall, the thing that first got me interested in Zeppelin history when I was about 9 years old.  That's been over a quarter of a century now, and the old \"armchair Zep historian\" trip is still a favorite hobby of mine.<br><br>It would be really easy for me to go into Ubergeek mode and nitpick every little thing about this flick (I'll try my best to spare you folks that and save it for when I've knocked back a few with a couple of my Zep buddies) but when it comes right down to it, this movie could be a lot worse.<br><br>I mean yes, it has a lot of flaws, not the least of which is its reliance on a fictionalized version of a sabotage theory which itself is perhaps one of the most elaborate, ethically-suspect works of fiction presently connected with Zeppelin history.  The story goes that a young crew member named Erich Spehl (renamed \"Karl Boerth\" in the movie, apparently for legal reasons) fell in with the anti-Nazi resistance via a mysterious older woman he was dating at the time of the disaster, and the two of them cooked up a plan whereby he would sabotage the ship at its mooring mast at Lakehurst, in full view of the American press, so as to get international publicity for the resistance movement.  The Hindenburg was late in landing, the timer on the bomb malfunctioned, (neither of the two authors who originally flogged this theory in their books ever really worked out that little detail of how the bomb went off as the ship landed) and the ship burned, killing Spehl in the process.<br><br>As I said, this theory is definitely hogwash, and I've come to suspect that those who originally concocted it and passed it off as historical fact probably knew it was hogwash too.  But, this is the sort of plot that sells books and puts asses in theatre seats, so this is what Wise and his screenwriters decided to go with. They didn't invent the theory, they merely optioned a book (\"The Hindenburg\" by Michael Mooney) which was a retelling of the original Spehl theory (which appeared in A. A. Hoehling's \"Who Destroyed The Hindenburg?\")<br><br>Purely as a 1970s disaster film, this one isn't bad.  It's got all the bases covered: lavish sets and costumes; big-name stars portraying a cast of characters from various walks of life, complete with various interconnecting personal dramas designed to heighten the pathos of \"I wonder who gets it in the end?\" for the audience; and a special-effects laden disastrous climax.<br><br>\nAs far as the execution of the whole thing goes, it's definitely a mixed bag.  The script could have used a good bit of work before they shot it, but then that also seems to be par for the course with most 1970s disaster flicks.  A lot of the dialogue is fairly stilted, and some of the lines are just terrible.  Perhaps the one that bugs me the most is when Ritter (the Luftwaffe colonel in charge of security) finally gets Boerth (the saboteur) to tell him where the bomb is, Boerth replies with the meaningless phrase \"Repair Patch 4\" and Ritter, who apparently had never set foot on a Zeppelin before the beginning of the flight, conveniently runs straight to where the bomb is hidden... under a tiny in-flight repair patch on the side of Gas Cell #4 (which itself was 10-15 stories tall).  That the big \"Aha!\" moment when Ritter finally learns where the bomb is hidden is garbled by lazy, sloppy writing like this always makes me cringe when I watch this movie, and unfortunately that's fairly indicative of the level of screenwriting throughout the film.<br><br>Various characters are renamed versions of actual passengers and crew from the last flight, some are amalgams of a couple different actual people, some even retain the same names as the people on whom they're based... and others are simply invented for the sake of the movie.   Colonel Franz Ritter (George C. Scott) is based upon a Luftwaffe colonel named Fritz Erdmann who was aboard the last flight to observe long-range navigational practices used by the Hindenburg's crew (and who was erroneously presented in at least one \"historical\" Hindenburg book as having been assigned to the flight to watch for saboteurs); crewman Karl Boerth (William Atherton), of course, is based on the \"sabotage theory\" version of crewman Erich Spehl;  the Countess (Anne Bancroft) seems to be very loosely based on a passenger by the name of Margaret Mather; Gestapo snitch Martin Vogel (Roy Thinnes) was basically invented as an obstacle for Ritter to have to deal with; the Breslau family was based on the real-life Doehner family; crewman Ludecke (Peter Canon) seems to be something of a loose amalgam of a couple of real-life Nazi-connected crew members who flew on the Hindenburg, but basically he was invented as a flunkie for Vogel.<br><br>And on and on and on.<br><br>A few things about the film do work for me.  First, I think that George C. Scott was one of those actors who could lend even the worst film a bit of dramatic weight, and in this movie he actually takes what was written as a fairly one-dimensional character and breathes some real life into it.  As a Luftwaffe pilot who is ill at ease with the increasing excesses of the Nazi regime, Scott creates a rather human, sympathetic character.  His scenes with Anne Bancroft are some of the few which actually seem to work in this movie.<br><br>I also quite like David Shire's music score.  Most of the musical pieces in the film are variations on the Main Title Theme, though there are a few distinct separate themes (notably the romantic piece played during the scenes between Ritter and the Countess, the piece played while the crewmen repair the ripped fabric on the fin, and what I always think of as the \"Gestapo\" theme, which seems to be used when the film cuts back to Germany for scenes such as the one where Boerth's girlfriend is arrested in Frankfurt).  And then there's the odd little vaudeville tune performed by Reed Channing and Joe Spah at the concert Channing holds for the passengers and crew.  It's certainly consistent with what an American might have thought of and known about the Nazis in 1937 (concentration camps, for example, were already in use for political dissidents and \"intellectuals\" by '37) but it still feels kind of like the producers just said \"We want a show tune in here... write us something!\"  By and large, though, the music in this film is quite good.  I only wish it were available on CD.<br><br>Finally, and most importantly, the set design in this film, particularly the full-size recreation of various parts of the interior of the Hindenburg, is absolutely amazing.  If you want to see what it looked like to walk around inside the Hindenburg, watch this movie.  There are a few minor inconsistencies with the actual design of the ship (a pair of ladders which led down into the lower fin of the actual ship was changed in the film into a long set of stairs running up inside the leading edge of the fin, I assume for dramatic purposes) but for the most part Wise's set designers used the original designs of the ship and recreated them, right down to the rivets in some places.  The only thing that they apparently got wrong unintentionally is the dark blue/green color of the girders in the interior of the ship. They seem to have gotten this from pieces of girder salvaged from the actual Hindenburg wreck, and what they recreated was the scorched color of the original bright turquoise blue lacquer which coated the girders of the actual ship. ;^)<br><br>But most everything else is spot-on.  I've stood in the control car recreation, which has been restored and is now on proud display out at Lakehurst, and from having seen photos of virtually every part of the real Hindenburg control car I can say that the set designers really nailed this, again right down to the rivets on the elevator and rudder wheels.  The passenger decks are pretty much identical to the real ones, the layout of the lower keel is frighteningly accurate... a modern-day movie about the Hindenburg would have to essentially re-build the same sets if they wanted to be accurate.  For this alone, I like to throw my DVD of \"The Hindenburg\" in the player a couple times a year.<br><br>Again, not a great movie overall, and the sabotage theory the screenwriters use is based on a load of dreck dreamed up under rather questionable circumstances a decade or so before the film was made, and which implicates a young man who unfortunately died in the fire and was not around to defend himself (nor did he have any close family to do it for him at the time the story first emerged). It may make for an interesting movie plot, but it didn't happen that way at all.  (I also don't buy the \"exploding paint\" theory that's been run up the flagpole over the past several years, as it simply requires too much cherry-picking of eyewitness testimony and photographic evidence to work... but that's a whole 'nother story.)<br><br>\nNot a terrible film overall, due to the painstakingly accurate set design, but not that great a film either.  I'm a bit biased, obviously, but I always find myself wishing that they'd spent even half as much energy on writing a good script for this thing as they spent recreating the interior of the ship.  It could have been something a lot more special than just another disaster flick if they'd put the effort into the story. But as 1970s disaster movies go, this is probably one of the best. It's certainly worth a watch.","user":"Rumi68","rank":[66,78]},{"title":"The Tragedy In Lakehurst","rating":8,"date":"31 October 2009","review":"If a film about The Hindenburg had to be made it certainly would have been made in the decade of the disaster film, the Seventies. But this film labored under a unique handicap that none of the other disaster films of the decade had.<br><br>Unlike the sinking of the Titanic or the blowing up of Mount Krakatoa and certainly not like any of the potential but fictional disaster events that were film subjects, The Hindenburg was recorded on sight with newsreel cameras and on radio with Herbert Morrison's never to be forgotten broadcast. A lot of people now still remember it, let alone back in 1975.<br><br>What Robert Wise did and maybe more successfully than any other director was make full use of the famous newsreel footage and carefully edited it into his film, with slow motion techniques into the personal attempts by the cast to try and escape the holocaust. The Hindenburg received Oscar nominations for sound, cinematography, and art&amp;set design with a special award for special effects. Yet no nomination for editing which the main plus this film has going for it.<br><br>Of course we don't know what ever really happened to the Hindenburg and the film takes account of all the theories put forth. It also uses the real names of the people who were passengers, crew, and officials of the Third Reich. The Nazi government had a big stake in the dirigible fleet they had built, they were as much propaganda value for them as Max Schmeling in boxing and Gottfried Von Cramm in tennis.<br><br>Of course had they had access to helium to float the big guys this might never have happened. But the USA had a near total monopoly on the world's helium and was not selling it to Hitler. Hence they used the lighter, but flammable hydrogen with the result of the tragedy.<br><br>George C. Scott and Anne Bancroft head the cast as a Luftwaffe official and a worldly old world countess traveling to the USA to visit her deaf mute daughter going to school for same in Boston. The Nazis didn't believe in helping those they considered defectives, another lovable quality about them.<br><br>The Hindenburg is a sobering and near factual account of what happened in Lakehurst, New Jersey that afternoon. It's one of the best of the Seventies disaster films and should not be missed.","user":"bkoganbing","rank":[28,33]},{"title":"Absorbing but slow-moving disaster film could have been so much better...","rating":5,"date":"29 August 2006","review":"Even the presence of someone like GEORGE C. SCOTT can't save THE HINDENBERG from being a less than extraordinary recreation of the famous tragedy at Lakehurst, N.J. when the German dirigible fueled by hydrogen caught fire during its landing during a lightning storm.<br><br>The most compelling footage comes toward the end of the film, when the craft is about to land and we know the unthinkable is about to happen. The special effects (designed by Alfred Whitlock) are especially strong here and combined with actual black and white footage of the event, it is mind boggling to watch. Ironically, the craft was so close to landing, with men on the ground already holding onto the landing ropes to secure the craft for its safe approach.<br><br>Unfortunately, the script Robert Wise directs is sub-par as far as interest in the characters. I'd be tempted to call it \"Grand Hotel in the Sky\" but there's not even enough soap-opera element to the cast of passengers that make any of them memorable, including ANNE BANCROFT, as a Countess, GIG YOUNG and BURGESS MEREDITH.<br><br>The plot is mostly fiction about a crew member causing a bomb to explode and ignite the huge aircraft, not really substantiated by the known facts although it makes for a compelling story. Historically correct or not, it's a film worth seeing but don't expect a disaster film comparable to THE TOWERING INFERNO or TITANIC.<br><br>What's really fascinating is seeing what the inside of the dirigible is like for passenger travel, truly elegant and comfortable...a reminder of the sort of elegance that greeted those aboard the TITANIC.","user":"Doylenf","rank":[17,22]}]