[{"title":"A tight, tense, no-frills thriller","rating":8,"date":"27 April 2001","review":"Plunder Road is an object lesson in what can be done with a low-budget and a stripped-down script.  The opening moments, at night under a hard rain, are disorienting, swift, and all but silent.  A gang of highwaymen has plotted to rob a train of its gold-bullion cargo.  Successful, its members split off onto three separate routes to what they hope will be prosperous freedom. The movie follows them dispassionately as they individually reckon with their fates.  This is a marvel of action and economy -- one of the most enjoyable offerings from late in the cycle of film noir.","user":"bmacv","rank":[36,39]},{"title":"The machine rages against us","rating":7,"date":"9 March 2004","review":"Being primarily a visual medium, one of the things film does best is illustrate the mechanics of complex items. I refer not only to the machinations of the caper plot so well achieved here, but also to big machines themselves -- trains, trucks, assembly lines. Many a great director has used the relentless workings of machines as a metaphor for inescapable fate -- think especially of Fritz Lang and the openings of Human Desire and Clash by Night.<br><br>The stars of Plunder Road are the machines themselves -- the overburdened trucks inching their way to freedom, the massive crane and huffing sabotaged train in the rain-pelted robbery scene, the bubbling cauldron at the foundry contributing to the ingenious escape plan, etc. The human characters are sketched briefly, with impressionistic strokes, but it's the mute mechanical accomplices that drive the plot and stick in the mind. This is best illustrated by the cleverly-inserted visit of a smog inspector, and again in the cruelly ironic downfall of the protagonists, who are at the mercy of their guileless vehicles.","user":"goblinhairedguy","rank":[27,29]},{"title":"An Odd-But-Interesting Film Noir","rating":8,"date":"2 December 2005","review":"This is another of those \"Poverty Row\" film noirs, a crime movie made on a low budget but yet decently acted and certainly entertaining.<br><br>Gene Raymond and Elisha Cook Jr. are known actors to classic film buffs but the rest of the cast may not be too familiar. There is no one star in this film anyway but all give good performances, particularly Raymond, the most interesting member of the gang.<br><br>The weak link of the film, at least to me, was the ending...but I give it points for originality. Overall, the story was a simple one, but oddly told. I say that because the important things that happened in the film (the arrests of the criminals, for one thing) would be glossed over quickly while minor things would be detailed longer than necessary. Despite that, the film was interesting thanks to good dialog, realism on the part of the characters and the short running time (73 minutes). Hope to see it on DVD some day.","user":"ccthemovieman-1","rank":[29,32]}]