[{"title":"Well...","rating":10,"date":"12 February 1999","review":"I like it. Let me explain, I like Gene Kelly and I like Judy Garland so I like this movie. It's a little weak on the plot, but there are a lot of good reasons to see it. For example- this was Judy Garland's last film with M-G-M. It has Get Happy in it, which is now included on practically all of Judy's 'best of' CDs. It's great to hear, but watching the number is marvelous. This was the year just before one of Kelly's major achievements, An American in Paris, and it's nice to see the difference in his billing, character, etc. Also, there's the romantic number 'You Wonderful You', which bears a resemblance to 'You Were Meant For Me' in Singin' in the Rain with the stage lights and stuff. It's obvious that Gene Kelly picked up some things he liked and carried them with him. That's why I like this movie. Yes, it's cute and breezy, but sometimes you just want a Garland/Kelly musical!<br><br>P.S. And who could blame you?  ; )","user":"Ash-65","rank":[27,29]},{"title":"A Friendly Star in Judy Garland.","rating":14,"date":"14 January 2005","review":"Some moments of this otherwise B-level film are quite astonishing, like Gene Kelly's solo dance with the newspaper or the conversation between Gloria De Haven and Eddie Bracken which gently reveals their affection for each other. But the film, more or less, belongs to Judy Garland- she of the frequently strained health and nerves, who nevertheless made it all look very easy. That said, this is a good one, albeit a corny one. The hillbilly number done with Kelly, Phil Silvers, and the chorus is a bit much, but the film does show off Garland's talent for low-key, witty comedy. And \"Get Happy\" aside, the 'Portland Fancy' square dance which seamlessly turns into a swing duet with Garland and Kelly is probably the most enjoyable moment of the whole film. (Considering Garland's strength was singing, her dancing was quite impressive.) And my favorite Garland solo is the moonlit ballad \"Friendly Star,\" done almost all in closeup, with the star's beautiful dark eyes on the brink of tears through the whole number. It's a pleasant swan song for her MGM era, but thankfully, her greatest musical (A Star Is Born) was still yet to come.","user":"movibuf1962","rank":[21,24]},{"title":"\"When You Work For Mother Nature, You Get Paid By Father Time\"","rating":7,"date":"17 August 2008","review":"Summer Stock was the third and last pairing of Gene Kelly and Judy Garland by MGM. It's sad to think that there were no others because of Judy's personal problems. She would have a breakdown and would not be before the cameras again until four year later with A Star Is Born.<br><br>Judy barely got through Summer Stock. She had been replaced in Annie Get Your Gun by Betty Hutton and had not started Royal Wedding yet, but was also replaced there by Jane Powell. It was Gene Kelly's patience with her that got her through this film. Interesting also because Kelly was not known as the world's most patient man when working.<br><br>It was worth it because Summer Stock contains some of Judy's best musical moments. Most of the score was written by Harry Warren and Mack Gordon, but someone was inspired at MGM to give Judy Get Happy by Harold Arlen and Ted Koehler. That is half of the team that wrote Over the Rainbow for her. Get Happy became another song identified with Judy Garland the rest of her life and into her legend.<br><br>But a favorite of mine is Howdy Neighbor. I do so love how that number is staged with Judy riding on a tractor through the fields and on the road near her farm. Catch her at the very end of the song and you can visibly see her breathing heavy. She was obviously under a strain doing this number and in fact the whole film.<br><br>Kelly doesn't do too bad either with a song that became identified with him, You Wonderful You. I still remember him singing it to Miss Piggy when guesting on the Muppets.<br><br>Summer Stock is another variation on a backstage romance and the discovery of hidden talent. Judy's sister Gloria DeHaven invites the cast and crew of her show to stay at their farm in Connecticut. But Judy's not happy with it. Of course Kelly charms her and discovers along the way who has the real talent in the family.<br><br>The film holds up well today and the talent of Judy Garland and Gene Kelly is absolutely eternal.","user":"bkoganbing","rank":[20,23]}]