[{"title":"Moore's last decent Bond very underrated and unappreciated good 007 flick","rating":9,"date":"12 November 2017","review":"A View to a Kill (1985) is guilty pleasure of mine. I don't think it is a terrible movie like mostly people are saying. I love this film always did and it is one of my favorite Bond films. This is the last Roger Moore movie he did before he was passing on Timothy Dalton. It is very underrated and I know that Roger Moore him self has stated that A View to a Kill is his at least favorite James Bond film because Christopher Walken was machine gunning everyone. I have enjoyed the film it was fast paced, entertaining and it had action. I know it does have flaws and mistakes like every movie does. I have enjoyed action and Roger Moore was good in his performance. He did 100% off him and he is acting was decent it wasn't so much goofy or terrible in my opinion.<br><br>A View to a Kill is the 14th entry in the official James Bond series and the final film to star Roger Moore in the role of Agent 007. The 1985 installment follows Bond as he investigates a possible plot to destroy California's Silicon Valley. The film's cast includes Christopher Walken, Grace Jones, Tanya Roberts and Dolph Lundgren, who made his acting debut. <br><br>I will say I have simply enjoy this flick more then I did The Man With The Golden Gun, Octopussy, From Russia With Love, Skyfall, Spectre, Quantum of Solace, The World Is Not Enough, Die Another Day and of course the worst Bond ever On Her Majesty's Secret Service.<br><br>The cast: Tanya Roberts as Stacey Sutton was in my opinion good Bond girl. I have read so many negative comments about her performance. Because she was screaming, she was way too young for Roger Moore she looked like his daughter etc. I disagree she was good and I have enjoyed her performance.<br><br>Grace Jones as May Day was another bad girl just like Famke Janssen in GoldenEye. Grace Jones was good as May Day Zorin's lover and chief henchwoman I thought she was really good at her performance.<br><br>Christopher Walken was good as Max Zorin: a psychopathic industrialist he was really a good bad guy and I have enjoyed his performance. He did his job good and convincing and it was good in his good effort.<br><br>This was really the only movie that was filmed in the USA in which they used Golden Gate Bridge in San Francisco. The movie really had a lot of action scenes. The car chases in San Francisco with fire truck the cops are chasing Bond and he with Stacey is fleeing trough the bridge. I love the mining scene in which May Day (Grace Jones) slide down Bond and they bring the larger bomb that would destroy the lock. They put the bomb on a handcar and push it out of the mine along a railroad line. May Day stays on the car to hold the faulty brake lever, sacrificing her own life as the bomb explodes.<br><br>Great stunt on Eiffel Tower in which May Day jumps off the Eiffel Tower really great stunt scene. Great car scene in which Bond is chasing May Day with a stolen car. I know it was a stuntman and Roger Moore did not drive the car. In Stacey's house the fight with Bond and Zorin's henchman that wasn't Roger Moore fighting them that was his stuntman and it was funny, I thought the stuntman did a good job. But Tanya Roberts did her own stunts and she was good.<br><br>I liked the opening scene in which Bond use a flare gun and shots down the helicopter that was cool. I really enjoy the song A View to a Kill from Duran Duran. I have enjoy the horse riding that was really joy able to me in which Bond races with the horse on the race track with Zorin and Zorin's henchman has set booby traps for Bond and Zorin's men get caught instead. I like Bond with a shotgun Remington and he has a rock salt in it. Pretty cool the first time we see Bond with the shotgun and rock salt.<br><br>I did not thought that Roger Moore was that old or was that horrible, no he was really good at acting. I am sorry just my opinion. I like the burning elevator in the building in which Bond escapes and saves Stacey I love that sequence.<br><br>I miss those kind of movies: like Rambo, Superman and James Bond 007 Roger Moore I miss movie like this? Why can't we get movies like this one back. Again I did not thought Tanya Roberts was horrible or Roger Moore is too old and Tanya Roberts is his daughter. This movie to me is unappreciated and I wasn't bored with it! <br><br>9/10 better the Octopussy in my opinion it was good in my opinion. I have seen this movie so many times and I have always enjoyed it I always had fun with it.","user":"ivo-cobra8","rank":[117,130]},{"title":"Moore was a likable hero who softened the menace saving the world seven times with charm, intelligence, and great dialog","rating":7,"date":"7 August 2005","review":"\"A View to a Kill\" is a true remake of \"Goldfinger.\" Let's start with the villain and his scheme The villain, Max Zorin (Christopher Walken), is a true and exact copy of Auric Goldfinger He owns a stud farm, and wins horse races by cheating... He is the European outsider who plans to wipe out a massive American resource, thus increasing the value of his own stockpiled wealthHis lust for power are greater than his loyalty to a lover <br><br>Disco diva Grace Jones took the role of May Day, Zorin's natural born killer May Day's leap off the top of the Eiffel Tower is a fine moment in best Bond traditionThis statuesque Jamaican womanwith sharp-cut hair to enhance her profileis cast as a horse-taming, Kickboxing American who, according to Q, 'must take a lot of vitamins.' Nevertheless, at the film's climax, she retained a few shreds of humanity<br><br>The film opens on an icy Siberian shore, where Bond recovers a microchip from the body of 003, driving back a party of Russian militiamen in his flight back to a British submarine disguised as an ice floe and controlled by blonde compatriot Kimberley Jones (Mary Stavin). The location chosen is both arresting and well-photographed enough to distinguish itself <br><br>Bond is alerted to Zorin's intentions while investigating how the Russians have managed to duplicate a secret microchip resistant to damage caused by the magnetic pulse of a nuclear explosion The technology has been leaked to the KGB following Zorin's purchase of the research company that developed the chip <br><br>Tanya Robertswho had joined the cast of television detective series Charlie's Ange1s in 1980is cast for the role of Stacey Sutton, the beautiful blond geologist and heiress who results a vital assistance to 007 in unraveling the details of Zorin's scheme to detonate a bomb in one of his mines and create a cataclysmic earthquake <br><br>\"A View to a Kill\" represents the farewell of Lois Maxwell who appeared as Miss Moneypenny for over 20 years of loyal secretarial service, and a unique claim to have featured in every Bond film The motion picture also concludes Roger Moore's activities for over a decade in Bond adventuresIn all his Bond's movies, Moore was a likable hero who softened the menace saving the world seven times with charm, intelligence, and great dialog However action sequences lost their deadly flavor and took on a madcap flavor In battles with characters such as J. W. Pepper, Nick Nack, Jaws, and May Day, it was hard to keep too straight a faceand Bond didn't","user":"Nazi_Fighter_David","rank":[42,51]},{"title":"Roger keeps the British end up one last time","rating":9,"date":"4 June 2012","review":"Days before the rogue Bond movie 'Never Say Never Again' - which starred Sean Connery - opened in London at the end of 1983, Cubby Broccoli managed to pull off a champion spoiler. He announced that Roger Moore - who had declared his retirement from the role earlier that year with 'Octopussy' - had signed for a seventh movie, provisionally titled 'From A View To A Kill'. In other words, it didn't matter whether or not 'Again' was a hit, because Moore was still going to be around in the future. Loosely based on Ian Fleming's short story ( which appeared in the 'For Your Eyes Only' collection ) 'A View To A Kill' appeared two years later, again directed by John Glen. Critics who had claimed the 56-year old star too old for the role had to eat their words - in fact, he looks in better condition than Connery did in 'Again'. The plot by Michael G.Wilson and Richard Maibaum has Bond investigating the nefarious activities of millionaire 'Maz Zorin' ( Christopher Walken ). When I saw this originally, I chuckled. \"They've remade 'Goldfinger!\", I thought. \"Only with microchips instead of gold bullion!\". The two films are similarly structured. Instead of cheating at cards, Zorin is fixing horse races with the aid of steroids and micro-chips. Whereas Goldfinger wanted to increase the value of his gold by blowing up Fort Knox, Zorin wants to increase the value of his micro-chips by triggering an earthquake along the San Andreas Fault, California, thus destroying Silicon Valley.<br><br>'Kill' is a long way from 'Goldfinger' in terms of quality, of course, but it is much better than 'Again'. The equivalent 'Oddjob' is the enigmatic 'May Day', played with gusto by singer Grace Jones. Strangely, she never gets to fight Bond, which is a pity as the posters gave the impression such a skirmish was going to the movie's highlight. The action scenes start with an impressive Siberian skiing sequence ( marred only by the use of the Beach Boys' 'California Girls' ), and go on to include May Day jumping off the Eiffel Tower, Bond losing half his car in a chase, Bond and 'Stacy Sutton' ( Tanya Roberts of 'Charlie's Angels' ) trapped in a burning lift shaft, a chase involving a runaway fire engine in San Francisco, and Bond and May Day in a flooding mine, culminating in a climax involving an airship and the Golden Gate bridge. One of the film's pleasures is seeing Moore alongside Patrick Macnee of 'The Avengers', cast as 'Sir Godfrey Tibbett', Bond's sidekick. There is an amusing scene with Bond posing as a rich man and Tibbett as his chauffeur. It is a pity Tibbett was written out so soon. More of him and less of Fiona Fullerton's arch Russian agent - 'Pola Ivanova' - would have helped the movie no end. Moore was reputedly uncomfortable with some of the more violent aspects, such as Zorin machine-gunning to death his own men. <br><br>With its lively 'Duran Duran' theme song, 'A View To A Kill' was another big hit when it opened in the summer of 1985. Though it was not formally announced at the time, it was obvious that Moore was not coming back. Ditto Lois Maxwell as 'Miss Moneypenny'. His tenure as 007 - seven films across twelve years - marks him as the longest serving incumbent in the role. He might not have pleased humourless Ian Fleming fans, but there is no denying that he was massively popular with the general public. His successor, Timothy Dalton, was closer to the original Fleming character but the public chose not to endorse him. It was not until the arrival of Pierce Brosnan in 1995 that Moore was successfully replaced. The look of pleasure Moore put on the faces of cinema-goers world-wide took a long time to fade.","user":"ShadeGrenade","rank":[16,18]}]