[{"title":"intense and gritty street brawler flick","rating":7,"date":"24 August 2005","review":"If you liked playing Double Dragon on your Nintendo, you will love this movie! It's about the kind of blokes you'd have in the video game but now it's just about as psycho crazy and atmospheric as Abel Ferrara's Driller Killer. A street-brawler kid quits his gang to live with his girl, but off course it's not that easy to turn his back on the gang.. It's a very simple plot, but it has a certain style and intensity that make up for that lack of complexity. The style, to compare, is a bit between Driller Killer and Richard Kern's short films (The Hardcore Collection). A sometimes psychotic montage with lots of stylish and semi-shocking images and great action scenes with intense gore and a haunting musical score. Or maybe it was just really good weed. Who knows..","user":"sjogro","rank":[8,8]},{"title":"Inspirational white trash masterpiece!!!!!","rating":10,"date":"16 February 2005","review":"This film could change your life. A friend introduced me to this movie a couple weeks ago, and not a conscious hour has gone by that I have not thought of it. If this seems remotely like your type of film (low-budget action gore) then you MUST see this. It immediately became one of my all time favorites. The cover does not do it justice. Think 'Mad Max' meets 'Polyester' meets 'Cannibal Apocalypse'... and you're sort of on the right track. Really, it's like nothing you've ever seen. I have never reviewed any films on IMDb before, with this movie I felt I had no other choice but to shout it's praises to anyone who will listen. It deserves to be legendary. Prepare to have your mind blown away.","user":"youngvagabond","rank":[11,12]},{"title":"Van Bebber is out of control","rating":21,"date":"21 January 2000","review":"Jim Van Bebber seems to be a man with absolutely no impulse control...and thank god for it. Moving with the brash logic of a couple of 12 year old boys playing army in the backyard, Deadbeat at Dawn is curious and compelling, trashy and brilliant. You want cult? You want guilty pleasure? You want guys getting throwing stars lodged in their heads? This movie has it all and then some. At first glance, you may dismiss this as cheapjack filmmaking (the thing looks like a drive-in movie), but trying to shut it off is near impossible. You will be sucked in; you will be fascinated. And if Van Bebber isn't a guy who deserves a shot at the brass ring with a real budget and a real crew, I honestly don't know who is. Not only does he shoot action sequences with some of the most urgent and alive camera work I've seen in awhile, he also does his own stunts--some of it crazy Jackie Chan level stuff. Watching him get dragged around by a car at the end of the flick, I just sat there wondering how this guy didn't end up in a hospital or worse.","user":"wytshark","rank":[11,12]}]