[{"title":"A pleasure for fans of Alice Pearce, Paul Lynde, Edward Andrews, et al","rating":8,"date":"27 January 2003","review":"This fast and wild James Bond spoof is not the usual Doris Day bedroom comedy of the 60s. It's different in that it has a bevy of talented comic actors in supporting roles, who all have their moments to shine.<br><br>Paul Lynde in drag is sublime. He looks spectacular in a red bouffant wig and aqua satin gown, and looks even more glamorous than Doris. They have a \"powder room\" scene together that is hilarious slapstick.<br><br>Alice Pearce recreates her Gladys Kravitz-type character from \"Bewitched\" and is wonderful as usual. It's her last movie role, unfortunately, as she died too young.<br><br>A young Dom DeLuise has a couple of funny scenes that he does mostly in pantomime. Dick Martin shows up with good reaction takes, and the great character actor Edward Andrews is in fine blustering form.<br><br>The stars, Doris and Rod Taylor, are quite appealing, although looking a bit too mature for their fluffy romance.","user":"Andrew_Eskridge","rank":[39,41]},{"title":"frothy '60s comedy","rating":6,"date":"14 August 2005","review":"What a warm, wonderful actress Doris Day is, what a knockout, what a screen presence. And just think, at the age of 42 (ancient by Hollywood standards in 1966) she was playing a desirable woman lusted after by several men. Glass Bottom Boat is a very '60s comedy in look and subject matter - the space age and spies. Taylor has invented a gizmo and when there's a leak from his project team, suspicion falls on Day, who works for the company and calls someone named Vladimir several times a day. Vladimir, however, is her dog, and she's calling him so he'll run around while the phone is ringing and get some exercise.<br><br>The film is loaded with space-age gadgets. Taylor's computerized, motorized kitchen is great, complete with a floor-cleaning robot - wonder if the inventors of today's robot vacuum saw this movie. He also pilots his boat via a remote - but as he points out during a scene where the boat runs amok with Day inside, that needs further work.<br><br>There's lots of slapstick and comedy support from Dom Deluise, Dick Martin, and Paul Lynde. Lynde, by the way, looked great in drag, and has some great delivery in his scenes. Some of the scenes, especially those of Deluise, had an improv feel. The late Eric Fleming, Clint Eastwood's boss on \"Rawhide,\" plays a CIA man. This was his last film; he drowned shortly afterwards. Rod Taylor, who, by the way, is younger than Doris Day, is effective as Day's romantic interest. Of note, radio personality Arthur Godfrey plays Day's father. There's also an appearance by Robert Vaughan as an homage to his \"Man from UNCLE\" character.<br><br>Frothy fun, and Doris Day is always a delight.","user":"blanche-2","rank":[36,39]},{"title":"Lots of fun, and Doris Day, too!","rating":10,"date":"9 January 1999","review":"I've always loved this film; it's one of Doris' best and has a great opening song and sequence.  Doris plays a widow who works at NASA.  Rod Taylor plays a physicist who falls in love with her, and tries to get her to fall in love with him.  Arthur Godfrey plays Doris' father, who runs a glass-bottom boat in Catalina.  Some of the idiots at NASA decide that Doris is a spy, and there's lots of chases and red herrings as Paul Lynde (a security guard), Dick Martin (Rod's business partner), and Edward Andrews (playing a General), all try to unmask her.  Doris decides to beat them at their own game when she overhears a phone conversation, and outspy's everyone.  Paul Lynde gets to dress in a blue satin formal, and Rod finds Dick Martin and Edward Andrews in bed together! The whole thing is a real hoot, and you'll love those late 60's fashions and hairdo's.<br><br>It's all a lot of harmless fun, and look quick for Robert Vaughn during the party scene!","user":"Marta","rank":[51,58]}]