[{"title":"Great movie!!","rating":10,"date":"8 August 2001","review":"After reading several of the user comments on this movie, it is clear that many people missed quite a bit.  Those \"funny one-liners\" (and there are plenty!) are much more than that: they tell us volumes about the characters. This movie certainly does not spell anything out to the viewer (except, perhaps, the obvious), so you must be able to find the meaning behind the words.  If you listen to what the characters are saying, then you can understand their past relationships, their present feelings, which friends have stayed close, etc.  Remember, these are old friends: the script is very realistic so the characters are not going to explain every line to one another.  I believe to truly enjoy this movie you need to pay close attention to all of the details and understand a bit about the attitudes and ideals of the two eras the movie depicts.<br><br>Wonderful, intelligent movie!","user":"kal1","rank":[94,111]},{"title":"One of the best ever","rating":12,"date":"12 December 2000","review":"While channel surfing, saw this movie again tonight, for about the 35th time. What makes this movie great is not the story - hell, there is no story really - but the making of the movie itself. It is the single best combination of acting, film editing, sound track, dialogue, and every other thing that goes into a movie, ever put together. No special effects, no car chases, no suspense, no anything that usaually passes for entertainment. Just excellent film making. Even tonight, I saw yet one more background detail I never noticed before. You have to watch this movie multiple times to appreciate it. Nearly everything that happens early in the movie relates to something that occurs later on. The transitions and foreshadowing, the character relationships, the very words themselves all fit together like no other film ever made. I truly believe that this is a film that should be studied as an example of pure movie making, no less than Citizen Kane. To rate this movie as a 10 is to underrate it. Of course, that is just my opinion.","user":"rick45","rank":[71,87]},{"title":"The Mourning of the Hippie and The Birth of the Yuppie","rating":27,"date":"27 November 2004","review":"In 1983 the Yuppie era was its rise: people became more and more focused and obsessed with being successful and making money. These are the same people who once protested in the 1960s and were once against conformity and dreamed sweet ideals of they wanted in life. The Big Chill is a film that mourns the hippie era and it is also the beginnings and the rise of the yuppie era. The film tells the story of a group of college friends from the late sixties who are reunited at the funeral of a best friend named Alex (the role of the stiff was Kevin Costner until his scenes were taken out of the film) who committed suicide. The friends had all lost touch on and off in the years with the exception of Alex. They have all found their successes in life: Sarah (played by Glenn Close) is a doctor and she once had an affair with Alex. Harold (Kevin Kline) is a businessman and married to Sarah and very secure with the direction his life took. Michael (Jeff Goldblum) is a journalist and investing on starting a nightclub. Sam (Tom Berenger) is a popular TV star in a Magnum PI-ish television show and has always been attracted to Karen (JoBeth Williams) who had once aspired to become a writer until she married a rich man and settled as a country club housewife. Then there is Nick (William Hurt) a former Vietnam vet who chose to become a drug dealer rather than pursue his doctorate in psychology. Meg (Mary Kay Place) is a successful lawyer who has decided that she wants to have a baby. And finally entering their circle is Alex's spaced out and naive-like girlfriend Chloe (Meg Tilly). All meet in the wake of his dead and they all spend the weekend together evaluating their lives and why their dear friend Alex died. We begin to know each of the characters through subtle scenes and dialogue without flashbacks or even any explanations. We begin to see why Alex died and it was not because he lost touch with his friends and because he was lonely, but because of the direction that his life took. It turns out that Alex was brilliant and was offered a fellowship to study as a physicists in a prestigious institution but chose to become a social worker. Each of his friends begin to questions the choices they had made and begin to wonder if they made the right choice. Excellent writing and terrific performances from the actors. Touching, funny, sad, and poignant film Lawrence Kasdan style.","user":"bondgirl6781","rank":[57,70]}]