[{"title":"A Curio For The Converted","rating":8,"date":"8 August 2000","review":"Ray Charles gets top-billing as himself in this Paul Henreid (Casablanca) directed slice of swinging 60s London cheesecake. The film opens with the first of many very staged-looking live song performances - Ray doesn't break sweat throughout - and moves 'seamlessly' into a school classroom for sightless children, where Ray plays call-and-response with the kiddies on \"Hit The Road Jack\". He strikes up a relationship with a small blind boy, and plans for the child to see a top eye specialist in Paris. Through the boy's smothering mum, Ray meets her gruff, overly-casual musician lover, played by Tom Bell, who accepts an invitation to be the American performer's arranger on a European tour including on the itinerary - you guessed - Paris.<br><br>While the movie tackles blindness head-on, and has a certain grim charm where it might have gone for sentimentality, it's still little more than a vehicle for Ray Charles - and staged or not, you can't complain - Ray belts out his hits with gusto. The scene with the blind children recalls Sam Fuller's \"Naked Kiss\", specifically the way Fuller staged the crippled kids' Bluebird\" song, and is almost as weirdly haunting in its way. But the little lad himself delivers his lines so mechanically - Ray Charles is \"as blind as a bat\", he observes drily, before being admonished by mother - that you can't help laughing out loud at choice moments.<br><br>Not only do they not make them like this anymore, they didn't even back then - this was just one that slipped through the net while Ray Charles star was still somewhat in the ascendancy. Quite bizarre.","user":"Mr Looey","rank":[22,23]},{"title":"Only for Ray Charles fans","rating":3,"date":"5 March 2017","review":"This is an example of the musicals of the 60s where pop stars or musicians were featured who weren't really actors so the story has to be fitted around their talents.In this instance the main aspect of Ray Charles featured,apart from his music,is his blindness.A desire to help a blind boy have an operation which might restore his sight.Unfortunately the boy is played by Piers Bishop,in a flat monotone voice.Rather like a speak your weight machine.This becomes extremely grating on the ear.A good part of the film is occupied by Ray Charles in concert.So if you are a fan of his you can ignore the tripe that passes for a story.If you don't it's probably better to fast forward the whole film.","user":"malcolmgsw","rank":[3,4]},{"title":"Family drama with some great tunes","rating":5,"date":"3 March 2017","review":"BALLAD IN BLUE is a star vehicle for famous musician Ray Charles, here playing himself in a story in which he becomes involved in the life of a put-upon blind boy in desperate need of an eye operation to restore his sight. This American production was filmed in Ireland by an American company with financial issues but looks reasonably good for its era.<br><br>It's a family drama with added music and it's safe to say that with a musician of Charles's calibre, the musical segments are great and very toe-tapping. The rest of the story isn't bad ever, showing how persistence and spirit can overcome adversity. Like a lot of mid-20th century movies, the backdrop alone is of interest, but child actor Piers Bishop deserves kudos for his deeply convincing turn as the blind child; he was equally good in the tense thriller TOMORROW AT TEN made the previous year.","user":"Leofwine_draca","rank":[1,2]}]