[{"title":"I saw it with my own eyes!","rating":9,"date":"5 June 2005","review":"This fabulous work was years and years ahead of its time when it was made in 1950, being a work of art that engages the eyes and the ears, but most essentially, the brain. The film is both aesthetically beautiful, using amazing camera techniques, extensive periods of silence and a very limited cast to deliver the action, and the story is typically Japanese...ostensibly amazingly simple, but complex to the point of sending you cross-eyed!<br><br>The basic tale is this: a woman and her husband, a Samurai, are travelling through a forest when they meet a bandit. The bandit has sex with the woman and the Samurai ends up dead. That's it. This tale is related to us through the woodcutter and a monk who saw the protagonists give their evidence to the police (the dead Samurai through a medium), but unfortunately the three tales conflict with one another. Each confessor says that they killed the Samurai, and then we hear from the woodcutter who in fact witnessed the event, who gives us a version of events that borrows from each individual account, and is still less credible!<br><br>The conclusion presented by Kurosawa seems to be firstly that individuals see things from different perspectives, but secondly, and most importantly, that there is no objective truth. There is no answer as to what took place in the forest, and Kurosawa offers us no way of knowing what went on. Each story is as credible as the other, and so no conclusion about guilt can be reached. We even have to think at the end that as the whole thing is reported to us by the woodcutter and priest, was there any truth in anything we heard at all?<br><br>This film leads to an especially tricky conclusion for a movie-goer! Your eyes are supposed to show you objective truth, but they don't. The camera is supposed not to lie, but it does. I feel that the simple message is that subjectivity lies at the heart of life, and this subjectivity needs to be recognised before any attempt is made to understand events.","user":"mungo39","rank":[122,145]},{"title":"What did we just see?","rating":10,"date":"10 February 2002","review":"'People forget the unpleasant things.  They only remember what they want to remember.'<br><br>In Rashomon the editing tells ½ of the story.  It may feel experimental or unconventional, but Kurosawa perfects the concept second by second, directing and editing.  This film didn't need a big budget to come perfectly to the point.  It's a simple tale, but not a superficial tale.  Different points of view and selective memories ('It's true! I saw it!') don't only make the woods unsafe, but are one of the most universal topics of humanity. 'We humans are weak creatures. That's why we lie, even to ourselves' says it all actually: it's about what people want to hear and when they start being interested at all, apart from wishful thinking.  Selfish excuses vs trust in other people.<br><br>Rashomon gets masterful when in one instant there is literally a different point of view: the camera takes another position to shoot the same sequence, thereby forcing the audience to reconsider what they just saw.  That is the sort of storytelling that the supposed masters of cinema in our time yet have to equal, or try to copy when they fail.  Admitted 'Memento' (2000, Nolan) is a truly great one.  Still not THAT universal.  'Pulp Fiction' (1994) didn't come close,  'La Commare Secca' (1962) also didn't.  'Ghost dog: the way of the samurai' (1999) touched another border of the concept, or does it?<br><br>The use of (non-original) music in my opinion reveals a certain interest for western influence, not only in Rashomon, but also in Kurosawa's forthcoming films, and is probably why his films were so influential on western filmmakers too.<br><br>The cinematography is dynamic and changes scene by scene to emphasize exactly what is going on.  The shadows of leaves and branches, captured by cinematographer Kazuo Miyagawa, make you really feel 'in the woods', while the actors (Toshirô Mifune, Takashi Shimura) convince the remaining part of the audience (which adds up to 100% breathless viewers).  It may be after days that you first realize you saw an important film.  After weeks you realize that you must see it again to comprehend (despite it's only 85 min), and ironically that is just one of the crucial points that Kurosawa made. 10/10","user":"rogierr","rank":[207,254]},{"title":"To what extent does subjectivity affect perception?","rating":9,"date":"9 September 2007","review":"\"Rashomon\" tells a very simple tale in a very complicated manner, presenting four 'versions' of the truth, each from a party either witness to or involved in the incident depicted. It is not the film's intent to have you piece together a puzzle since that would be impossible based on how drastically the four tales differ. We know that lies don't enter the equation since the participating persons all claim to be guilty. \"Rashomon\" is not about choosing a version of the incident you believe is true; it is about human perspective and how it shapes what we see. Even if we truly believe what we have seen is true, is it really? <br><br>The film opens when a priest and woodcutter are encountered by a man who engages in a conversation about crime with them and subsequently learns that a samurai has been killed in the woods and his wife raped by a bandit. These two details are the basic, practically undisputed facts which make up the foundation of the four versions of the story we hear: the bandit's, the woman's, her husband's (through a medium), and the woodcutter's (the only presumably objective account, which still does not make sense in relation to the others). In many ways the best thing about \"Rashomon\" is that it never reveals what actually happens (or if any of the four accounts is in fact true), and although we are not meant to solve the mystery (the idea here is that there is no objective truth since humans are too selfish and dishonest to view anything without bias) the story structure is still brilliant and adds a lot of ambiance to the film. The narrative flow is strong and the method seems fresh and inventive today despite countless imitations (including one inexplicably popular one- \"The Usual Suspects\").<br><br>\"Rashomon\" is very much a visual film. It would be reduced to unimportant and insignificant fare without the cinematography, which captures the mood and feel of the jungle perfectly, as does the score. The film achieves an epic feel very rare for films filmed in fullscreen, especially during the battle between the bandit and the samurai during the last telling of the story. Kurosawa was also wise enough to choose a location for the film that would accurately capture the eerie, slightly disturbing mood of the story. Just picture the events taking place anywhere other than a jungle.<br><br>\"Rashomon\" is not without its (minor) flaws, however. While theatrical acting (Kurosawa was fascinated with silent film) worked perfectly with films like \"Seven Samurai\" and \"Throne of Blood\", it does nothing but take away from the realism of this oft claustrophobic human drama. Yes, Mifune (Tajomaru, the bandit) does provide an interesting spin on his character for each telling, and Takashi Shumura (the woodcutter) seems as honest and real as any character could possibly be, but nearly all of that effect is lost every time Machiko Kyo appears on screen. It is hard to take her seriously and during moments when I should have been close to tears I was much closer to laughter. I'm not sure how much blame I would place on her as Kurosawa probably asked her to act exactly as she does. While discussing actors I have to (unconventionally) note Fumiko Honma as the medium, who brings a wonderfully eerie air to the film during its greatest scenes.<br><br>I don't think \"Rashomon\" is Kurosawa's best or most important film, but it is still a masterful piece of cinema which is absolutely essential for any film lover. It's extraordinary how much Kurosawa accomplished at such an early stage in his career and without the benefit of the lavish budgets he was allotted for later projects. The film's main question is also still relevant and confusing today: is what we think we see really the truth, and to what extent does subjectivity affect perception? <br><br>4.5/5","user":"ametaphysicalshark","rank":[60,73]}]