[{"title":"The sixth and final film (so far) from Cheech & Chong.","rating":7,"date":"17 August 2005","review":"Cheech &amp; Chong's The Corsican Brothers (1984) was a re-telling of the famous Alexandre Dumas classic novel. Cheech and Chong new that they had to market their comedy towards a different audience. There hard core fan base wasn't enough to make themselves profitable. Not only did they change their style of humor, they toned it down dramatically. Sadly, no one wanted to see a period piece starring Cheech and Chong. The movie is not horrible but it's not a laugh riot. Not wanting to end the partnership, the duo made another comedy album and a video that went along with it called GET OUT OF MY ROOM. The video was a tad under an hour and it featured the classic comedy song BORN IN EAST L.A. which would become Cheech's stepping stone towards mainstream acceptance.<br><br>Recommended for Cheech and Chong fans. Others will want to stay away from it.","user":"Captain_Couth","rank":[7,8]},{"title":"not laugh-out-loud funny, but laughs accumulate","rating":30,"date":"30 January 2004","review":"I thoroughly enjoyed this. It is one of those movies where you won't get a lot of direct laughs, but the general level of ludicrousness accumulates over time and had me giggling a lot by about 20 minutes in. The whole idea of these two in this period piece, not to mention Chong's bizarre intensity and seriousness throughout... I don't know, it got me. I also liked that in place of the drugs (which were there, just not as directly), the general smuttiness was cranked way up... well, that appeals to me, especially from these two, but I have a soft spot for lecherous perverts. I'm glad it's in my collection!<br><br>--- Check out website devoted to bad and cheesy movies: www.cinemademerde.com","user":"iago-6","rank":[6,7]},{"title":"This movie is great!!!","rating":9,"date":"9 July 2004","review":"I just can't believe that I will ever disagree with another persons review of a movie more than the previous persons review of The Corsican Brothers. This movie is so hilarious that I own it, and have had the pleasure of watching it dozens of times. In their last good movie together, Cheech and Chong depart from the usual drug humor, and will have you rolling (pun intended!) with laughter! Set during the French Revolution, The Corsican Brothers is a laugh fest form beginning to end, and is a movie that I have and will continue to recommend to everyone that enjoys a good laugh. Anyone that could write a review stating \"I didn't even smile once\" had to have not understood some of the humor. Please watch this movie. You won't be disappointed.","user":"PudgeFan","rank":[9,12]}]