[{"title":"Solid, Tension-Filled Crime Drama","rating":29,"date":"29 August 2005","review":"This is a solid and sometimes memorable crime drama, filled with tension, and featuring some pretty good performances from the cast. The noir atmosphere works well, and the story, while perhaps far-fetched at a couple of points, is quite involved and grabs your attention from the beginning.<br><br>Lizabeth Scott gets one of her best roles, as a hard-hearted woman who seizes her opportunity to play the male characters against each other so that she can get what she wants. Scott is slightly lacking in the glamour that would make her a really memorable femme fatale, but she has plenty of strength, and her voice works well for the character. Dan Duryea gives one of his many fine noir performances, taking good advantage of his many opportunities with his shady character. Arthur Kennedy and Kristine Miller are both sympathetic as the more innocent of the main characters. Don DeFore's character sometimes seems a little out of place, but he is often crucial in advancing the plot.<br><br>The story starts with an unlikely coincidence, with a bag of money that gets tossed into the wrong car. But from there, most of the story developments follow naturally, and the tension is built up rather well as things get more complicated. It's an entertaining movie that has most of the things that fans of film-noir and crime drama would want to see.","user":"Snow Leopard","rank":[37,39]},{"title":"Lizabeth Scott tries her luck as unregenerate femme fatale in hard-boiled noir","rating":8,"date":"22 May 2003","review":"Lizabeth Scott did her best remembered work in film noir (more than half of her only 21 screen credits fall within the noir cycle), and became one of its iconic faces.  Rarely, however, was she called upon to play the fully-fledged femme fatale, and there's probably a reason for this: She couldn't bring off duplicity.  <br><br>Her smile had no shadings into wry, or ironic, or smirky; it had but one setting  a fresh, guileless grin that lit up like a Christmas tree.  F. Scott Fitzgerald (in his sad screenwriting days) observed of Joan Crawford that you couldn't give her a simple stage direction like `telling a lie' because then she'd give an impersonation of Benedict Arnold betraying West Point to the British.  But Scott can't manage even that, which results in confusingly mixed signals when her characters are motivated by malice, like Coral Chandler in Dead Reckoning: Her smile keeps convincing us that she's on the up-and-up.<br><br>Her damn smile keeps switching on in Too Late For Tears, even though there's no doubt that she's one hard, cold case.  She and husband Arthur Kennedy are bickering one night en route to a party in the Hollywood Hills when suddenly a suitcase crammed with cash lands in their roadster.  He wants to turn it over to the police, but she persuades him to think it over, so they check the valise at Union Station.  When she starts buying clothes and furs against the checked capital, it's clear she has no intention of surrendering the windfall; we learn that her background was `white-collar poor, middle-class poor,' and that she'd made a previous marriage solely for money.<br><br>Strange men start ringing her doorbell.  First Dan Duryea shows up, a blackmailer for whom the payoff was intended.  He slaps her around playfully (`What do they call you  besides stupid,' she taunts him.  `Stupid will do  if you don't bruise easily,' he purrs back).  Quickly Scott maneuvers Duryea into helping him murder Kennedy but still won't tell him where the money's stashed.  Though wary, he falls for her, starts hitting the bottle, and grows careless.  Meanwhile, Kennedy's sister (Kristine Miller)  harbors suspicions about his mysterious disappearance.  When the next caller (Don DeFore) shows up, claiming to be an old Air Corps buddy of Kennedy's, she makes an alliance with him to find out what's really going on.  And the claim ticket for the money keeps changing hands....<br><br>The plot is none too simple, and in consequence director Byron Haskin spends a lot of time trying to keep it clear rather than addressing some questions about character and logic that inevitably arise.  Why did the avaricious, manipulative Scott marry Kennedy in the first (or second) place?  Why does the sister live so conveniently close?  How did Duryea, and for that matter DeFore, find Scott so easily?  But few thriller plots are so tightly constructed that they survive rigorous analysis.  Too Late For Tears passes muster as hard-boiled, late-40s noir and as one of Scott's hardest, strongest performances, inappropriate smile and all.","user":"bmacv","rank":[51,60]},{"title":"Femme Fatale Favorite","rating":7,"date":"15 April 2007","review":"Byron Haskin of Arsenic and Old Lace and War of the Worlds fame teamed up with Roy Huggins to create this solid film noir entry. Huggins writing is superb for the genre - neither pretentious nor overly manic. The pace is brisk but not painfully so. And the film is very well conceived, well directed, well edited and very well acted.<br><br>The remarkable Lizabeth Scott (Jane Palmer), married to a young Arthur Kennedy (Alan Palmer), is the focus of our attention. The coupled are driving to a friend's house when a car flashes them and its occupant tosses a leather bag with 60,000 dollars into their car and drives off. Jane wants to keep it, Alan wants to turn it in. Soon, this windfall becomes a mixed blessing, as it reveals a rather frightening side of Jane's personality. The plot intertwines noir twists and turns and incessant mystery and, frequently, winds up in unanticipated places.<br><br>Lizabeth Scott is PERFECT, and really MAKES this film as much as the intriguing story and successful directing. Don Defore also turns in a notable performance as does Kristine Miller. Dan Duryea was nicely cast in his role as the heavy, but his performance here was just a sliver below his usual par.<br><br>This is very nice bit of noir cinema and will satisfy most noir fans, as well as modern crime drama aficionados. Recommended!","user":"mstomaso","rank":[38,44]}]