[{"title":"\"YOU'RE GOING THE WRONG WAY!!!!!!\"","rating":9,"date":"18 November 2001","review":"I'm not sure who is responsible for bringing Steve Martin and John Candy together,but they are a genius in my book,and they were brought together with just the right material.This comedy from John Hughes is without question his best work as a director. I look at this film as a modern day Laurel and Hardy romp,which, incredibly was not included in the AFI's Top 100 comedies.It will cause you tears,both from laughter and it's touching ending.It is about two very different ways of life,clashing in the beginning, but slowly coming together from the realization they we are all human,despite our differences.It is becoming a tradition at the Williams household to view this movie every Thanksgiving.It is a must see,must own film. Thumbs up.","user":"SmileysWorld","rank":[177,188]},{"title":"John Hughes best adult comedy","rating":10,"date":"29 December 1999","review":"John Candy was a comic genius. He really was. Never was his talent on display better than it was in this film. John Hughes and John Candy went on to develop what I can only surmise was quite the friendship because Candy appeared in many Hughes films either as the star ( this one, Uncle Buck, Great Outdoors ) or with a cameo ( Home Alone, Vacation and a few others that I can't think of right now, but check the IMDb and you'll see that he did ). But of all the films that Candy did, including Stripes, I don't think he has ever been as good and as funny as he was in here. If there was any justice in the Academy ( and we all know that is an oxymoron, Academy and justice ) then Candy would have at least been nominated for best actor in 1987. I think Douglas won that year for Wall Street and he deserved to but Candy was brilliant in this film. It was a shame to see his career cut short because even in his bad films he was good. This is his best and most complete role. He will be missed but at least we have great roles like this to remember him by.<br><br>Planes.... is a film about one man trying to get home for the American Thanksgiving. He is Neil Page and he is played with perfect smugness by Steve Martin. He is a work-a-holic and his lifestyle is that of many John Hughes family men that live in suburbia Chicago. He lives in a huge house, much like the one in Home Alone and Weird Science, and his family is a beautiful one that consists of a lovely wife and three kids. But he is never home and for all of his success professionally, it is the kind of family that although is together now, it may not survive the fast approaching 90's if Neil Page continues his ways.<br><br>John Candy plays Dell Griffith. He is a jolly man, much like Santa Clause but without the beard and the old age. This is a man that carries a giant trunk around with him and is a constant chatter box. He is the kind of man that you know is good at sales, but on a lower level. He is too much of a slob to really be a corporate sales guy. Of course this Laurel and Hardy pair cross paths and from here on out Neil's simple task of getting home to his family for Thanksgiving is going to be a journey from hell.<br><br>First of all he loses his cab in New York rush hour to Candy who unwittingly steals it from him, then he is bumped from first class and ends up sitting next to Candy on the plane. Then they are delayed because of weather problems and what do you know, they end up spending the night together in not only the same hotel, not only the same room but the same bed. This presents all sorts of comic possibilities and Hughes doesn't miss one of them. His comic timing and development of the two characters is brilliant. Some of the best scenes are when the two are bantering and Candy is verbally assaulted by Martin. Martin goes off and says that he is annoying to listen to and then he says this: \" You know I could sit through an insurance seminar and still look happy and the others would say how do you do it? And I would say, because I can take anything, I've been with Dell Griffith, and they'd say, \" I know what you mean. Whooooo, shower curtain guy! \" And as funny as that scene is, Hughes goes for more than the quick payoff of laughter. He then reminds you that this isn't just a comedy but a film with many layers and substance to it. Because the next scene has Candy delivering a monologue that almost makes you embarrassed for laughing at what Martin said.<br><br>But truth be told, first and foremost, this is a funny, funny film. And if anyone has scene it, they will tell you about the airport scene where Page has lost his rental car and he comes back and does what we have all dreamed of doing ourselves, he goes ballistic on the person behind the desk, who subsequently is Grace, from Ferris Bueller's Day Off. She must have been fired by Ed Rooney and now rents cars at airports for a living. She plays a desk clerk that has decided to take the Thanksgiving holiday a little sooner that she is supposed to. Martin comes in and she starts by saying, \"Can I help you?\" Martin replies, \"You can start by wiping that f***ing dumbass smile off your rosy f@**ing cheeks. \" From there he goes into an F-Word filled tirade about how her company left him in the middle of f***ing nowhere with f****ing keys to a f***ing car that isn't f***ing there. It is one of the funniest moments that I have seen in any film because you don't expect it from a Hughes film.<br><br>Planes... is a heart warming film about family, friendship and good will towards men. It is also a wickedly funny movie and it will stand the test of time and I think in 30 or 40 years from now, it may be looked upon as Hughes best film. Candy and Martin are wonderful in here and it is really a treat to watch them work together.<br><br>10 out of 10","user":"baumer","rank":[133,146]},{"title":"Arguably the best comedy of the 1980s","rating":10,"date":"2 June 2004","review":"The greatness and pure genius of \"Planes, Trains and Automobiles\" is that, while it is uproariously hilarious, it also reveals great hurt and truth - unlike any comedy I have ever seen before or since. <br><br>Scenes such as those in the Bravewood Inn are classics. The argument between Neal and Del is the turning point in the film, and it is the first time that the audience realizes that they are in for more than they thought they were. There are certain elements of tenderness, heart, agony, conflict, and heartfelt emotion in \"Planes, Trains and Automobiles\" that make it transcend the genre. <br><br>Steve Martin and John Candy don't just act; they embody themselves so deeply in their characters that it almost sets a standard for how comedic pairings should be. Line them up next to Chris Farley and David Spade and the differences are astronomical. Watching Steve Martin is like acting a comedian at the top of his game. Just watch his reactions. The facial reaction from Steve in response to Del's comeback in the Bravewood Inn is perfect; we understand what Neal is going through, and Steve Martin lets us know this by placing himself in a recognizable area. We also understand Del, and that is really the key to this movie: Being able to identify with both characters almost equally. How often can you say that about buddy pictures? I don't ever feel much sympathy for Chris Farley, if that means anything.<br><br>John Candy remains one of the most underrated and underwritten film comedians of all time. Offered constant mediocre scripts during the eighties and early nineties, all the way up until his death in 1994, he could make the material something more, something watchable. I recently viewed \"Funny Farm,\" a painfully unfunny film to sit through. I imagined what John Candy could have done with Chevy Chase's role, and I found myself laughing. Why? Because John Candy can make anything watchable. Just how many times would you watch \"Summer Rental\" or \"The Great Outdoors\" if the lead actor was Jim Carrey?<br><br>There's some important content in this film, but it is never overpowered by laughs, nor vice versa. They go hand-in-hand. I come back to the Bravewood Inn argument scene. After the hilarious, ongoing insults Neal throws at Del, Del responds and says, \"You wanna hurt me? Go right ahead if it makes you feel any better. I'm an easy target. Yeah, you're right, I talk too much. But I also listen too much. I could be a cold-hearted cynical like you, but I don't like to hurt people's feelings. So you go right on and think what you like about me. But I'm not changing. I - I like me. My wife likes me. My customers like me. 'Cause I'm the real deal. Whatcha see is whatcha get.\" It's creepy how much dramatic, emotional and truthful subtext sneaks into this film, and yet it only makes it all the better for it. \"Planes, Trains and Automobiles\" is my favorite Comedy, yes I know that I have said it before. But, it is a serious comedy that has both heart and is hilarious at the same time. Entertainment at it's best. And isn't that what movies are all about? <br><br>5/5 stars.","user":"MovieAddict2016","rank":[171,199]}]