[{"title":"Curtis looks terrific as Houdini, the showman and the self-promoter...","rating":7,"date":"29 April 2000","review":"By the early 1900s, the extraordinary Houdini earned an international reputation for his theatrical tricks and daring feats of extrication from shackles, ropes, handcuffs, and Scotland Yard's jails...<br><br>The film depicts Houdini's memorable escape from any pair of handcuffs produced by the audience; the outdoor exhibition, when he allows himself to be hanged upside down from his ankles, suspended from the roof of a high building, in a strait jacket; and, the dramatic act, when he accepts to be shackled with irons and placed in a box that is locked, roped, and submerged in frozen waters... <br><br>The film also exposes Houdini's campaign against mind readers, fraudulent mediums and others who claim supernatural powers... Houdini shows a passionate talent for escapology and the film did much to create the 'Water Torture Cell' illusion... <br><br>With his pretty-boy looks, Tony Curtis handles the title role with passionate skill... His energetic performance, as the talented and motivated magician, is very good... <br><br>With good period atmosphere, but with more attention to romance than to interesting detail, the film is quite enjoyable and colorful...<br><br>Janet Leigh does a great job as Houdini's faithful wife...","user":"Nazi_Fighter_David","rank":[25,26]},{"title":"Who cares if it isn't accurate, it sure is fun!!","rating":17,"date":"17 October 2004","review":"If it wasn't for the movies and the books on Harry Houdini's life he would fall into a category of un-interesting performers who only could do one thing perform<br><br>He lived in a time where his talents were in great demand and despite the fact that this film is not accurate it is lovingly presented by Paramount a **Color Film** in a time where Black and White films were still commonplace, Tony Curtis and Janet Leigh at the peak of their building careers and George Marshall a veteran director of close to 120 films<br><br>They knew what they were doing when the movie partially fictionalized Houdini's life possibly because he was a one note person, a magician, an escape artist, a performer<br><br>The movie is excellent!! and that is all that matters, if I am not mistaken almost every remake has fictionalized his life in one way or another, this movie is a true gem!!","user":"MCETXCEM","rank":[20,23]},{"title":"Curtis Gives Another Good Performance","rating":8,"date":"7 October 2006","review":"Tony Curtis is almost always good in whomever he plays, and he was fascinating in here as the famous magician \"Harry Houdini.\" Curtis had a number of good roles in his prime. Speaking of \"prime,\" Janet Leigh didn't look too bad in her prime, either: a very pretty lady.<br><br>I don't know how accurate this biography was, but I do know that this movie should have been longer. I usually say the opposite about films, but in this case, I would like to have seen more details about his life and death. His failure to communicate with dead - Houdini's misguided belief - wasn't discussed much.<br><br>I guess there were a couple of more modern-day films on Houdini, but they must not have been anything much since I never heard about them. Too bad, because a good re-make of this movie might be something to see.","user":"ccthemovieman-1","rank":[19,23]}]