[{"title":"Fantastic performances salvage a standard whodunnit","rating":9,"date":"18 January 2005","review":"I've been annoyed at most of the bad reviews I read of this movie, because none of them understand what it's all about. It's true; the script is not actually that great. What makes it great is how everything is delivered. The cast is fantastic in playing each part as a cliché, even when the lines are far from it. Curry plays the role with so much ham that it's understood why the script is like this. This is a play, not a movie. I can understand not being in the mood for this film. But I can't understand not appreciating these fantastic performances. Another person pointed out that this film needs to be seen in widescreen. This is correct-the movie reaches another level of greatness by seeing it in proper aspect-ratio. And I've never seen Colleen Camp looking this fantastic.","user":"jdollak","rank":[170,201]},{"title":"A hectic murdermysterycomedy with a pace like none other.","rating":10,"date":"13 December 2004","review":"This is easily Tim Curry's best role (yes, even better than Frank from RHPS). He is dry and quick to a level that I have never seen topped, and with an all star cast to support him, this is easily my favorite pun filled, fast paced comedy. The beginning of the story begins slow and exponentially increases til the very end. The speed at which the actors are delivering their lines is staggering at some points, and goes to the technical grace of the actors like Christopher Lloyd and Leslie Ann Warren. Also, the late great Madeline Kahn produces a hilarious Ms. White who shall be remembered as her second greatest role (under Young Frankenstein). I cannot say enough about this movie, the script and its wonderful actors.","user":"ryanj3","rank":[136,164]},{"title":"The popular board game comes alive in this hilarious comedy!","rating":10,"date":"10 October 2004","review":"Clue\" (the movie), features just about every great comedy actor of the day. From Leslie Ann Warren to Michael McKean to Eileen Brennan to Howard Hessman to the priceless Tim Curry, they're all here! -- If you are familiar with the board game, just picture a film version of the search for \"whodunit\". This laugh-a-minute fun fest is loaded with outrageous, silly slapstick, superbly acted out by the great cast.<br><br>You'll be amazed at how many of the lines and gags get stuck in your head. I'll never be able to forget the flustered looks of Mrs. Peacock, the wit and charm of Wadsworth or the subtle facial expressions of Mrs. White. The picture in this WIDE SCREEN VERSION is the best yet of this film since it's initial release.<br><br>The soundtrack is kept in it's original mono, still I'd greatly enjoy hearing a stero or, even better, a surround sound version in the future. Now you have the option of really not knowing who did it until the final scenes play bringing surprise into the untold repeat viewings that are sure to occur.","user":"mdm-11","rank":[74,93]}]