[{"title":"Welles' images match the beauty of Shakespeare's language","rating":10,"date":"3 January 2006","review":"Considerable controversy has surrounded the 1992 restoration and re-release of Orson Welles' \"Othello.\" First, the film was wrongly labelled a \"lost classic\" - not technically true, as Welles aficionados will realize. More seriously, the restoration crew (under the aegis of Welles' daughter, Beatrice Welles) re-synced the dialogue and re-recorded the musical score - an abomination to Welles purists. While it would have been preferable to adhere to Welles' vision for the film, such an endeavor becomes extremely difficult when no written record of Welles' intent exists (as it did with his famous 26-page memo to Universal regarding \"Touch of Evil\"). So it's true that the restored version lacks a degree of authenticity, but what are the alternatives? Grainy, scratched, poorly synced public domain prints (c.f. \"Mr Arkadin\" and \"The Trial\")? Or, worse, no available copy at all (c.f. \"Chimes at Midnight\")? <br><br>Anyway, on to the film. \"Othello's\" existence helps disprove the charges of profligacy and \"fear of completion\" that plagued Welles' career after \"Citizen Kane.\" Shot over four years in Morocco and Italy, and financed largely by Welles himself, \"Othello\" manages to avoid a low-budget look, thanks largely to virtuoso editing that masks the incongruities of time and space. Welles' powers of invention are on full display here, most obviously in the famous Turkish bath scene (an improvised set necessitated by a lack of costumes). Set designer Alexandre Trauner's astute choice of Moroccan and Venetian locations instantly establishes a geographic authenticity; Welles initially exploits them for all their stark beauty before retreating into noirish interiors, underscoring Othello's descent into darkness.<br><br>Aside from Michael Macliammoir's chilling Method performance as Iago, the acting in Welles' \"Othello\" has been criticized as too restrained and modulated for Shakespearean tragedy. Such criticism is largely unwarranted, for this \"Othello\" is as much for the eyes as the ears: Welles' bold framing and expressionistic camera angles free the play from its theatrical moorings (pun intended), undermining the need for stage elocution. Indeed, the camera is the true star of this film, as Welles generates images that match the grandeur and eloquence of Shakespeare's language.","user":"EddieK","rank":[15,16]},{"title":"Great film, but not \"lost\"","rating":30,"date":"30 March 2003","review":"I will not go into the film as many already have said how it is a great work of art despite its \"troubled\" filming history.<br><br>This film is now advertised and available as a \"restored\" dvd of a \"lost\" Welles film.  But DO NOT be deceived. Whereas the 1998 cut of Touch of Evil was \"restored\" using a Welles memo as guidelines, Othello was restored by presuming many things. First, dialogue was put in sync and unintelligible diaglogue was \"voiced over.\" And second, the original score was redone, but not exactly as the original. You could almost say a new score was used in the \"restored\" film. The original cut was Welles' 1952 European version which has only ever been availible as a (OOP) 1995 Criterion LaserDisc. As Welles' daughter owns the rights to Othello, that's the 1992 \"restored\" version which she also helped on, it is the only one currently availible for purchase in the US (as she receives no money for the 1995 CR laserdisc, she forced Criterion to stop making it.)<br><br>While many casual fans will not notice or care about the little changes, don't be deceived into thinking this is \"Orson's intended version.\" Also DO NOT be deceived into thinking this is a lost film. It was only lost in the sense that it had no distribution until the early 90's.","user":"colwood","rank":[40,48]},{"title":"One of the great Shakespeare films.","rating":12,"date":"12 September 1999","review":"I must be one of the few who saw this film (more than once!) before it vanished in the 60's.  I saw it on TV in the last 50's, and later brought it to the small college where I was teaching 63-65.  Though heavily cut and more than a little rearranged, it is one of the very finest of Shakespeare films. Performances are generally excellent and unified in style and diction.  Welles, or course, is magnificent.  Anyone who thinks he was never anything but a self-parodying ham has not seen this film.  One could wish than MacLiammoir had had more overt FUN as Iago, who does what he does, in part at least, in an attempt to stimulate himself out of his blunted affect. The film also has some of the finest black-and-white cinematography of all time, and uses architecture in a unique and effective way.","user":"lime-3","rank":[20,23]}]