[{"title":"better than you've heard","rating":7,"date":"19 March 2004","review":"I almost never agree with Trekkies! They usually pan \"Star Trek III\" and label it a disappointing follow-up to the classic \"Wrath of Khan.\" But I just don't see anything wrong here. The Klingons are delightfully over-the-top villains, the effects and spaceship models are great (arguably the best in the series), and the theft of the Enterprise is a wonderful sequence loaded with humor and tension. DeForest Kelley gets some great material as the \"possessed\" McCoy, and Shatner's performance - slightly more understated than in the last film - is again rock solid.<br><br>So what's the problem? I suppose this movie has difficulties standing on its own; it relies heavily on knowledge of \"Khan.\" But, such issues inevitably crop up when you're dealing with a long-running series of interconnected movies, and they don't matter much in terms of raw entertainment value. Some fans complain that nothing really happens in this film - it's just about getting Spock back and nothing else - but the death of David and the destruction of the Enterprise load it up with more than enough dramatic punch for me. <br><br>And, can you possibly imagine Picard stealing the Enterprise to go on a rescue mission? I can't. This movie's storyline captures exactly what makes the original crew so warm, funny, and rebellious...and so it's a good Trek movie, despite what the fans will tell you.","user":"dr_foreman","rank":[91,128]},{"title":"A solid and good yet predictable sequel that does not disappoint","rating":9,"date":"28 September 2017","review":"One of the better written and directed Star Trek (early) movies. The actors (especially \"Scotty and Bones\") look quite long-in-the-tooth. So many full head wigs, probably sold at a \"fire sale\" to Pat Sajak of Wheel Of Fortune. Just a comment about Vulcan men in \"season\". There must be more to it than the intense rubbing of fingertips. The ILM models are good but some of the scenes look over-processed and a bit fake. Christopher Lloyd makes a pretty good \"Klingon\" and his snarly alligator-dog is a hoot! The new \"Vulcans\" prove that it's all in the ear make-up as female \"Saavik\" can truly be played by anyone, so it appears. A rather fast-moving story with pretty good scenery and somewhat convincing set decoration. The \"puppet worms\" on the planet look truly disgusting. The Genesis Planet doesn't look quite as hokey as most Star Trek \"worlds\" do. I expected Kirk's son would die as both the other hostages were needed for the movie to continue. Star Trek (usually) only kills off extraneous female aliens. As usual, typically over-tight costumes on female personnel. Saavik was needed to help transport young Spock's \"body shell\" home to Vulcan. A good satisfying film although quite a predictable ending. A nice Star Trek adventure from beginning to end.","user":"mike48128","rank":[9,12]},{"title":"Underappreciated Star Trek film","rating":8,"date":"4 February 2003","review":"I believe Star Trek III is an underappreciated film in part because it is not accessible to a general audience. It is a pure science fiction film. In my opinion it is the one odd numbered film in the series that isn't victimized by 'the curse' of uneven numeration. I enjoyed the film because of the exciting action and fight sequences, the nostalgia, and the developed characterization of characters I am already so familiar with. I also found the film to be surprisingly spiritual and revelatory, a rarity for a sequel in a commercial film franchise. Anyone with close friends will be touched by Kirk's loyalty and sacrifice for Spock. Highly recommended, 8/10.","user":"perfectbond","rank":[40,70]}]