[{"title":"6/10","rating":6,"date":"21 May 2000","review":"I own this movie. Well, I own most of Arnold's movies. But I've only watched this one 3 or 4 times over the last decade. It's not a great movie although I think I enjoy it a little bit more with each viewing. The flick does have its moments. I like the interplay between Max and Brenner. And Arnold plays a very cool Mafia-like guy. The ending -- if you could even call it that -- is terrible. Did the script say, \"Insert ending here\"? Nevertheless, I liked the action even if it was corny at times. And the style of the movie grows on you with each viewing. I give it a 6/10 for been slightly more enjoyable than average.","user":"MyOpinionIsFact","rank":[30,35]},{"title":"It is the audience that gets a raw deal from this troubled production","rating":5,"date":"13 August 2015","review":"In Arnold's best period of his film career, it is unquestionable that Raw Deal is his worst film from that era. Sandwiched between two of his best action movies, Commando and Predator. Raw Deal is real weak by comparison. The film is a mess and it seemed that those involved with the production could not agree on what they were making. Also, it would appear that funds were too low for anyone's vision to get on screen. The editing and music for this movie is really poorly done. This film is definitely lacking in a consistent tone or focus. The action scenes seem out of place as well. Raw Deal was probably meant to be a low budget police thriller. Any way you slice it, this film is not a cohesive piece of work and is filled with plot holes. Arnold, at this point in his career had massive physicality and charisma. However, he was lacking in acting skills and was horrendous in the more dramatic scenes here. The supporting cast was pretty good for the most part. Even though this is not Arnie's highest quality production, it still remains fairly entertaining. There is quite a bit of funny stuff here(some intentional and some not). Also, there is plenty of Arnold one liners with one of my favorites, \"You should not drink and bake\". While Raw Deal is not a well made movie, it is not totally unwatchable and is still quite amusing and outrageous.","user":"dworldeater","rank":[24,28]},{"title":"hilarious","rating":7,"date":"16 December 2001","review":"Arnold at his peak as a one-man wrecking crew as he demolishes a crime family single-handed. It reminds me of the Stallone film where Rambo takes on Russia in Afghanistan. This film has good acting though, and the ever-evil Robert Davi at his slimy best. The shoot-out at the gravel pit with \"Satisfaction\" playing is a classic. And don't forget the classic line :\"You should not drink and bake\"!","user":"al_phillips2000","rank":[38,48]}]