[{"title":"A review of a ten star film","rating":19,"date":"19 August 2000","review":"A list of best films-you-didn't see from the seventies and eighties could not be complete without a host of John Cassavetes films: THE KILLING OF A CHINESE BOOKIE (1976 - given thumbs down on release, lauded as a classic now), and LOVE STREAMS (1984) are just two overlooked gems. Likewise, the only reason you can make for anybody not seeing MIKEY AND NICKY (Cassavetes starred, but didn't write/direct) is that nobody heard of it.<br><br>I assume you have one of two reasons for reading this review. Either (a) you love the film and are looking for like-minded opinion; or (b) you stumbled upon it accidentally, in which case I shall put it as simple as possible: you gotta see it.<br><br>Mikey (John Cassavetes) sits in a shoebox hotel room, a price now on his head, scared stiff. In desperation he calls his gangster childhood pal Nicky (Peter Falk) to help him get out of town.<br><br>A synopsis doesn't cover the density of the film. Two fragile male egos rebound off each other as the leads recall just why they love and hate each other so much. I cannot think of a better casting move than coupling Cassavetes and Falk. Good friends in real life, and frequent collaborators, they bring an intimacy to the film rarely seen elsewhere.<br><br>Within the first half-hour it dawns on the audience that engrossing as the story is, the outcome is not the most important aspect. Director Elaine May draws strength from the honesty of the characters. Her handling is at once compassionate and even-handed. The result: the characters are likeable for all their flaws.<br><br>It resonates more and more every time you watch it, enough for me personally to consider it will be a major influence on anything I might have the chance to film in the future.<br><br>The passing of Cassavetes was heartbreaking, the casual neglect of his output just as much so. If you don't know much about the man who took Scorsese under his wing, take the time today to investigate. Elaine May went on to make ISHTAR. Sadly, she hasn't directed since.<br><br>MIKEY AND NICKY is one of the greatest American films ever made.","user":"stephen niz","rank":[40,56]},{"title":"Brilliant 70's Mobsters!","rating":10,"date":"22 July 2004","review":"This totally underrated classic (in my Top 10 of all time) directed by Elaine May a few years before it's release is unbelievably gritty and a sad comment on the \"American Dream\" even for small-time mobsters.  John Cassavetes was never better as Nick, a paranoid, intelligent, and street-wise guy.  Peter Falk is equally impressive as his friend Mike who has problems of his own.  This was probably the best Cassavetes-like film that he DIDN'T direct, but very similar to his style.<br><br>A 10 out of 10.  Best performance = John Cassavetes.  a one-night (dusk to dawn) film that will grab you and never let go.  Ned Beatty has an amusing supporting role, along with Sanford Meisner &amp; William Hickey (well-known acting teachers).  This movie never had a chance at the box office, but is now highly regarded in all circles.  Don't miss it!","user":"shepardjessica","rank":[25,37]},{"title":"Elaine May makes a Cassavetes film","rating":9,"date":"29 August 2006","review":"Viewers familiar with John Cassavetes' directing style will see his influence in this film, but Elaine May wrote and directed it. It is an engaging, highly unusual drama about two childhood pals mixed up with the mob. Don't expect Martin Scorsese or Francis Coppola glitz here---this movie is different. There is a real, uncinematic edge to it. It almost plays like a documentary, or a \"reality movie.\" And the actors--Falk and Cassevetes were good friends and frequently worked together--allow for unique male-bonding (and a dissection of the male sex) that rarely occurs in modern film (another characteristic of a Cassavetes-directed film). Women are basically throwaway characters in many of his films, and that is the case here. This movie will either be an endurance test for audiences, or a fascinating experience. It was the latter for me.","user":"drosse67","rank":[16,23]}]