[{"title":"There is always someone or something worthwhile. We just have to look hard enough.","rating":7,"date":"9 December 2011","review":"Posse from Hell is directed by Herbert Coleman and adapted to screenplay by Clair Huffaker from his own novel of the same name. It stars Audie Murphy, John Saxon, Zohra Lampert, Rodolfo Acosta, Royal Dano, Robert Keith and Vic Morrow. Out of Universal-International, it's an Eastman Color production with cinematography by Clifford Stine and music supervised by Joseph Gershenson.<br><br>1880 and four escapees from death row ride into the small town of Paradise intent on causing mayhem. After robbing the bank and killing innocent men in the saloon, the men escape out of Paradise, taking with them a female hostage. A posse is formed, to be led by the slain Marshal's friend, ex-gunfighter Banner Cole, but good men are hard to find and Cole senses he would be better off on his own. But although many will die from this point on, from such adversity can heroes and friendships be born....<br><br>A little under seen and under appreciated is Posse from Hell. Hardly a deep psychological Western that strips bare the characters out on the trail, but certainly a picture high on action, blood and gutsy bravado. The title is a little misleading because the posse assembled is practically a roll call of stereotypes: gunman turned good, tenderfoot, man of different race ostracised, vengeful brother, pretty gal emotionally damaged, ex-army guy, wanna be kid gunslinger, and on it goes. Yet there is grim textures in the narrative (rape/revenge/cold blooded murder) and Gershenson scores it with horror movie strains. Even the blood red titles that open the picture look like something from a Hammer Horror production, clearly Coleman, Huffaker and co were aiming for a hellish wild west while cheekily having their posse formed out of a town called Paradise! A place where not all the citizens are stand up folk.<br><br>For Murphy fans this rounds out as real good value, he gets to do a number of great scenes like pouncing on a rattlesnake and diving through a window, while there's plenty of gun play moments for him to get his teeth into. But it also represents a good characterisation performance from him as Banner Cole, a man rough around the edges but definitely beating a humanist heart underneath the tough exterior. Around Murphy is a group of solid pros and up and coming stars, there's the odd iffy performance (Frank Overton) and overacting (Paul Carr), but nothing that overtly hurts the film. Main problem with it is that the villains remain elusive to us as characters, galling because we have been teased greatly in the opening section where we were introduced to some delicious villainy from Morrow as the leader Crip and Lee Van Cleef as Leo. More Morrow as a reprehensible bastard was definitely needed!<br><br>Major plus point is the use of Lone Pine, Alabama Hills, for the exteriors. A wonderfully rugged, yet beautiful part of the world, where the weird rock and boulder formations envelope the characters as a reminder that it's tough out here in the west. It's an area that Budd Boetticher and Randy Scott used to great effect for their superb Ranown Westerns. It's a shame that Boetticher never worked with Murphy more, for I feel sure he really could have gotten another 25% out of him, especially around the early 60s period. Still, Posse from Hell is a very enjoyable Audie Murphy picture, a bit more violent than most of his other Westerns, it's one that if you can forgive the odd creak here and there? And not expect some posse containing Satan's offspring? Then entertained you shall be. 7/10","user":"hitchcockthelegend","rank":[13,13]},{"title":"Murphy at his best","rating":7,"date":"27 August 2008","review":"I've long been a fan of Audie Murphy and event his lesser movies are better than most of the drivel that comes out of Hollywood today.<br><br>This is a good movie on its merits and not just as a vehicle for Murphy. It works well on all levels - story, acting, and directing. What I most enjoyed is the fact each actor is given screen time to rise above the stereotypes and create a memorable character - even if they only have a few lines.<br><br>The two I remember most are the young banker Seymour Kern (John Saxon) and the Mexican cowboy Johnny Caddo (Rudolph Acosta). Saxon in particular does well showing true, believable growth; he isn't just there as a foil/sidekick for Murphy to play off of but as a genuine character treated as equally important to the storyline. Acosta, usually a villain in the movies, plays an equally important role as a Spanish cowboy who joins simply because \"it's the right thing to do\".","user":"junkof9-1","rank":[18,19]},{"title":"One motley posse","rating":8,"date":"24 July 2014","review":"Posse From Hell is my second favorite Audie Murphy western, his best being No Name On The Bullet. It's Audie who is leading the men who make up the Posse From Hell, he's a deputy tracking down the killer of the marshal and another citizen from his town of Paradise.<br><br>Four prize specimens scheduled to hang escape from territorial prison and come upon the town and terrorize it, taking with them as hostage and sex toy Zohra Lampert. The leader of the four is Vic Morrow who packs a deadly shotgun. Morrow is absolutely riveting in his evil, this may very well be his career role.<br><br>In fact Posse From Hell has many good supporting parts, Robert Keith plays a vain Civil War soldier looking to recapture some of his former prestige or acquire some he never had. John Saxon also stands out as a bank clerk who's from the east who joins the posse to see if he has the right stuff. Rudolfo Acosta who usually plays bad guys plays an Indian who joins the posse as a tracker and takes a lot of guff from the more self righteous whites. <br><br>Seeing how deadly Morrow is with a shotgun this is an image that will disturb you and stay with you a long time. <br><br>A nice cast of familiar players help Audie Murphy make this one of his best westerns. An absolute must for his fans.","user":"bkoganbing","rank":[8,8]}]