[{"title":"Outstanding Hammer film","rating":31,"date":"31 January 2003","review":"Of all the many films in the longstanding Hammer Frankenstein series, after \"The Curse of Frankenstein,\" I like this one the best.  It has a classic, almost mythic, structure of the lover who sacrifices himself to preserve the virtue of his beloved and a good deal of existential discussion about human nature.  But beyond the heavy academics of its plot, Peter Cushing is truly great here.  He's completely sympathetic, intelligent, and witty as a man struggling outside society's version of morality.  Some people criticize Terence Fisher as a director who--apart from \"Dracula\" and \"The Devil Rides Out\"--had a static and slow-paced directorial style.  They're completely wrong.  Fisher was a master of the medium, a genius of composition whose films demonstrate so much intelligence.  I miss the 1960's, Fisher, and Hammer Films.","user":"cfisanick","rank":[31,34]},{"title":"A Terrific Fisher Hammer","rating":10,"date":"22 March 2005","review":"There's more going on in this little Hammer than meets the eye. The script reaches for something beyond the usual Frankenstein story, and Terence Fisher accommodates with keenly focused, at times inspired, direction. Start thinking about what is inferred when the soul of a boy, the son of a murderer, is transfered to the body of a crippled, deformed girl. The resulting action does not follow a clear and easy \"good verses evil\" scenario. Within the confines of a Hammer movie's melodrama, Fisher, a classical stylist and at times a superb artist, often created magic. This is one of those times. The performances are all equally compelling. Cushing gives the Baron more texture here than in any of the other films, I think. Thorley Walters is a good foil, and his befuddled affection and respect for the Baron makes some of this really rather touching. Arther Grant's photography has never been better. I urge viewers to watch the film with an open mine. This is not the usual horror film; it's more a fantasy, a fairy tale.","user":"nfaust1","rank":[27,31]},{"title":"Hammer Created Horror-Gold","rating":9,"date":"5 June 2007","review":"The fourth film of Hammer's awesome Frankenstein series, legendary director Terence Fisher's \"Frankenstein Created Woman\" of 1967 is another creepy and excellent Hammer gem, and my personal favorite film in the series. Movies like this are reason enough to admire both Fisher as Hammer's most important director and leading man Peter Cushing as one of the greatest Horror icons in the history of motion pictures. Once again, Cushing stars as the ingenious and very unorthodox scientist Baron Victor Frankenstein, exceedingly dedicated to the acquisition of corpses for his eerie obsession of resurrecting the dead by means of rather macabre methods... <br><br>I will not give any parts of the plot away, but I can assure that Hammer fans will not be disappointed by this one. Mad science, disfigurement, body snatching, resurrection, insanity and an adequate amount of blood, suspense and eeriness, as well as some very humorous scenes, \"Frankenstein Created Woman\" has it all. The movie provides the typical eerie Hammer-style score and photography, and therefore maintains the creepy and great atmosphere Hammer-fans love to see. Peter Cushing's performance as the macabre Baron is excellent as always, and beautiful Susan Denberg was a great choice for the female lead. Thorley Walters furthermore fits very well in his role of Frankenstein's colleague in (mad) science, Doctor Herz. \"Frankenstein Created Woman\" is a brilliant Horror-gem that comes with my highest possible recommendations. Along with the dark and gruesome \"Frankenstein and the Monster from Hell\", this is my personal favorite of Hammer's Frankenstein series, and it also ranks among my Top 10 out of all Hammer films. This is pure Gothic Horror gold that no Horror fan could possibly afford to miss!","user":"Witchfinder-General-666","rank":[15,18]}]