[{"title":"The best of Van Damme my favorite martial arts classic film of all time","rating":10,"date":"12 March 2018","review":"Kickboxer (1989) is one of the best martial arts films that Jean-Claude Van Damme ever made. I am a huge fan of Van Damme, I absolutely love this film to death! It is a cult classic film that Jean-Claude Van Damme made in to a star. Hard Target is Jean-Claude Van Damme's favorite number 1 film of mine this is my second favorite film of his. Bloodsport and Kickboxer are Van Damme's best films of the 80's he ever did. Since he edited Bloodsport himself and Cyborg flopped, Van Damme went and make this film that even today it is one of his best films of his career.<br><br>After an US Champion Eric Sloane (Dennis Alexio who was a kickboxing champion in real life) and his brother Kurt Sloane (Jean-Claude Van Damme) travel to Thailand, Bangkok to fight the Thailand Champion Tong Po (Michel Qissi). In the ring the fight is different than in America in a Muay Thai style and Eric get's hurt and paralyzed for life by Tong Po. Van Damme is angrier and vows for revenge, so he meets this guy Vietnam vet retired Winston Taylor (Haskell V. Anderson III) who helps Van Damme on his mission. With the help of the Thai master Xian Chow (Dennis Chan) who becomes his teacher, trains him and getting him ready for the fight of his life. <br><br>What can I say I love this movie to death, this movie kicks ass. It is great choreographed, it has no wires, just real action. Real fights they were all choreographed from Jean-Claude Van Damme him self. I love that the location was shot in Thailand and not in America. The director Mark DiSalle did a wonderful job directing this beautiful movie. David Worth was good by helping co directing it. Music was made from Paul Hertzog who made the music montage for Bloodsport. Trough inter film we se Van Damme training I love that, I love how Van Damme trains in the Stone City. The whole training montage was inspired from The Karate Kid and Rocky IV. Kickboxer defines my childhood I grew up watching Van Damme as a kid and Kickboxer is still my favorite film. Tong Po (Michel Qissi) is one of the best bad guys of all time. <br><br>On the end of the film we se the last fight with Kurt and Tong Po in the \"ancient way\", with a broken glass which it is a beautiful well choreographed. I love how Van Damme kick's and defats with martial arts Tong Po one of the best fights in the movie I ever seen. Van Damme dances while been drunk and kicks Freddy Li's fighters to the ground. Van Damme kicks a fighter in a tournament and deafets him in a kickbox match. I love the songs played in the film: Never Surrender, Fight for Love and Streets of Siam by Stan Bush. This movie spawned 4 sequels and 2 reboot films but no one of those films come near this movie. Don The Dragon Wilson can suck Van Damme's dick for challenging him Don your movies suck. Steven Seagal get your fat ass out of Van Damme way because Van Damme would have kicked your face with his technique to the ground on the dirt. <br><br>10 out of 10 Kickboxer is my all time favorite Jean-Claude Van Damme martial arts film and kicks ass, it is a cult classic film of all time. I love the cast, the direction I love everything about this film. I love this film to death.","user":"ivo-cobra8","rank":[87,111]},{"title":"Revenge of the 80's: Jean-Claude Van Damme, Superstar.","rating":7,"date":"11 October 2004","review":"Kickboxer (1989) was another in a long line of star vehicles for the \"Muscles from Brussels\". In this picture J.C.V.D. plays the younger brother of a unbeaten American kick boxer who lusts for some real competition. So he decides to go to the home of Muay Thai kick boxing, Thailand. There he realizes that he doesn't know squat about the true art of kick boxing. He learns a painful lesson. His younger brother decides to learn Muay Thai and avenge his brother's honor.<br><br>Not a bad movie. Entertaining and a good time waster. But for some reason the producers decided to franchise out this series. The rest of the films are a mixed bag at best. The more they made the least interesting they became until the final results were unwatchable. As always with these films the first film is usually the best of the bunch. Jean-Claude plays his character with a thick euro-accent (I forgot how they explained it). He's physically impressive so it's kind of hard to swallow his naiveté about fighting and what not. Or well. Fun for all.<br><br>Recommended.","user":"Captain_Couth","rank":[31,37]},{"title":"pretty good movie","rating":7,"date":"30 December 2004","review":"this is the one of my favorite van dam movies. I think that it is also one of his best films. We watch his character train throughout the movie for a fight at the end. The martial arts throughout are very well done. This is one of those films you can watch every time it is on TV. If you like martial arts movies you will probably enjoy this one. The movie though is all about the final fight. Like many other films of its type. All in all van dam is great and if you want to see a film based on the martial arts that doesn't have Druce Lee or Jackie Chan or Jet Li in it then this movie is one for you. The story is pretty simple but the fight scenes are worth it so go for it. 7 out of 10.","user":"joliet-jake","rank":[37,46]}]