[{"title":"A Timeless Film From a Terrible Time and Place","rating":7,"date":"12 September 2000","review":"\"Under the Bridges\", made in the last year of the Third Reich, proves that artistic genius can flourish even under the most difficult circumstances. The film completely transcends its time and presents a simple love story, the themes of which are universal.  Through both his settings and his actors, Kautner achieves a naturalism which has seldom been equaled.  That he managed to do this in 1944-45 Germany is almost unbelievable.  A fortunate and unexpected treasure from a most unfortunate time.","user":"gvb0907","rank":[14,14]},{"title":"Fate Draws a Pat-Hand","rating":20,"date":"20 December 2003","review":"Hendrik and Willi are co-owners of a cargo barge on the German River Havel. Goods are sent along the river's lifeline to the major ports of Germany. Rotterdam to Berlin and back again.  Life is good on the river as far as it goes yet something is missing.  Quick jump-offs in the towns along the way become habit.  Loneliness can be baggage that we all pack unwittingly. Hendrik played by Carl Raddaz, realizes that real life is going by without them.  Especially absent is the company of true female companionship.  The river becomes a willing partner to the player who wishes to tempt fate for the rewards of life.<br><br>Fate draws a 'pat hand' when late one evening, from the moored barge, a pretty, young women is observed on a bridge ahead.  Her lone lamp-lit silhouette showing against the background of night.   Appearing distraught, she is crying.  The men whisper she might end it all with one last step off the bridge and into cold eternity.  Suddenly, she drops something into the black depths below, but by this time our bargemen are there, under the bridge, in their small dingy to retrieve the article.  They observe the girl much closer.  What to do?<br><br>For fate, in it's seeming randomness, allows a new chapter to unfold in three people's lives in post-war Germany.   Their meeting becomes a driving gamble of need, and hope.  The reward of human companionship, acceptance and the search for true happiness becomes a riddle these players must unravel only to discover that everyone are amateurs in this pageant. What are the mysterious steps required to win the battle over an almost predestined lonely future?<br><br>Director Helmut (The Devil's General) Kutner's allegorical tale is a canvas of light and shadow.  Mixing pre-war German Industrial high-contrast themes with a kind of pre-natal Cinema Verite he presumes life's outward evidence of happiness is salted with an inner, lonely core which cannot be purged until the lessons of hope are proffered and dangled to the whole world to judge these volunteer competitors.  Win or lose?  Is the game worth the reward?  You 'betcha!","user":"ramblin-jack","rank":[19,20]},{"title":"A small miracle","rating":21,"date":"21 November 1999","review":"This film was made in the last months of WWII. Because of the allied bombers flying over the set on their way to Berlin and because of the destruction of many locations shooting often had to be stopped and was resumed later when the alarm was over.<br><br>And yet \"Unter den Brücken\" became the most beautiful love-story in german cinema (apart from Ophüls' \"Liebelei\" of course) without any trace of propaganda. The acting of Hannelore Schroth is wonderfully natural even today and the cinematography reminds me of Jean Vigo's \"L'Atalante\" and Charles Laughton's \"The Night Of The Hunter\". This movie stands out as a real miracle and as a singular event in UFA history.","user":"ChWasser","rank":[16,17]}]