[{"title":"A wispy breeze hints at an impending storm","rating":7,"date":"15 April 2003","review":"Bergman's adaptation of Leck Fischer's play behaves like a stage play that has been slightly adapted for the screen.  It is essentially a chamber melodrama and it makes little use of the cinema's expanded scope.  The film is watchable and the cast is competent.  Almost everything about it is competent.  It was Bergman's first go at directing a film. He was 27/28 years old at the time.<br><br>Bergman is clearly influenced by Ibsen - I say \"is\", because the old master (nearly 85 years old now) is still at it on the stage - I have the privilege to hold tickets to see his adaptation of Ibsen's Ghosts in London May 2003 - can't wait.  Kris is clearly influenced by Ibsen, but while the piece has borrowed Ibsen's mastery of structure and development, Kris lacks depth.  If Ibsen is grand opera, Kris is operetta.  Bergman had not yet acquired the skill to turn a minor play into a major film.<br><br>There is the odd hint of greatness to come, in particular the railway scene between Jack and Ingeborg.  There is also the odd interesting camera angle. But some of the cutting is amateurish and the music is ghastly.<br><br>If the weatherman tells you that there is going to be a tremendous storm, you do not need to be a genius to recognise that the wispy breeze is a prelude to that storm.  In the absence of that weather forecast, you could be forgiven for not recognising the breeze as an early hint at the big one. So it is with this film.  Because we know it is Bergman, we see hints of greatness to come. Otherwise this would seem like an (admittedly above average) ordinary 1940's film.<br><br>Bergman aficionados will enjoy it, but it should be quite a way down the list for people who want to start discovering the greatness of Bergman's work.","user":"ian_harris","rank":[29,33]},{"title":"Solid, Unspectacular from the Swedish Master","rating":6,"date":"17 February 2006","review":"Though this film only hints at the psychological explorations Bergman will make into his future characters, it does, in some ways, predict the care and thoroughness to come in future masterpieces like \"Wild Strawberries\" and \"The Seventh Seal\". The themes of human desire for change, lost innocence, intense longing, and other existential themes are apparent at the surface, but do not reach the intense depths with which we can analyze the main characters from the films I just mentioned.<br><br>I found the character Jack, Jenny's boyfriend/lover to be the most interesting and think he is worthy of a more detailed analysis. Though we later learn that his words are completely contrived (he says the same thing to all women) we see that he has a talent of making women sympathize with him, and he possesses a special ability to say what women want to hear, thus revealing his unique understanding of the female psyche. He is something of a broke down Don Juan, if you will, but he is also the most deeply passionate and complex character in the film. Perhaps it would be easy to write his character off as a wolf who preys on women, but I think he reveals more about human desire and an intense longing for life that plays out in his lust for women and his joy in wooing them. Jack does not know where to direct his passions, and the pure, young and innocent Nelly is simply one of his targets in his misappropriated releases. Despite his selfishness and apparent callousness, he is eventually unveiled as a horribly tragic and lost figure, a man incapable of reconciling his passions with reality.<br><br>If you have not seen this film, there is no reason to enthusiastically run out and buy or rent a copy, but the simple fact that this is his directorial debut should hold enough curiosity for any Ingmar Bergman fan, or burgeoning fan, one of European cinema's great masters.","user":"thenewbohemian","rank":[18,20]},{"title":"My brief review of the film","rating":20,"date":"20 September 2005","review":"For a directional debut, this is very solid stuff, not only skillfully directed but also set to a brilliant original music score. I would however identify one weakness with Bergman's directing here: it is very much tailored to the script, with dialogue or narration almost all the time, and this leads to it being too talkative, with limited breaks in which one can stop and admire the way that the story is being told. The film is in this sense very different to the style that Bergman would later adopt, and although perhaps somewhat weak, Bergman's skills do shine through. There are well-framed shots, an effective stream-of-consciousness sequence, great camera angles and excellent camera movement. The inclusion of some more non-dialogue bits possibly would have improved this film, but there is little else to complain about, with quite a good story behind the material too.","user":"sol-","rank":[18,21]}]