[{"title":"Beautiful Western!","rating":8,"date":"24 June 2009","review":"THE LAST WAGON is one of those splendid unforgettable Cinemascope/Colour westerns Fox was so good at producing in the fifties. \"Garden Of Evil\", \"Broken Lance\", \"The Tall Men\",\"Warlock\" and \"The Bravados\" etc. were all part of \"Fox's Fifties Cinemascope Western Cycle\" but THE LAST WAGON stands out in front as being arguably the most beautiful looking among them! Directed by the stalwart yet somewhat underrated Delmer Daves whose movies always had a certain glossy and radiant look to them. Particularly striking about his films was the rich location photography i.e. \"Broken Arrow\", \"Jubal\", \"The Hanging Tree\", \"Susan Slade\", \"Spencer's Mountain\" etc. THE LAST WAGON is no exception with the beautiful Arizona locations looking even more spectacular than usual.<br><br>Lionel Newman's strident Indian theme over the titles immediately sets the tone for the adventure that is to follow. Richard Widmark - sporting the colourful name of Comanche Todd - plays a wrongly accused outlaw guiding a group of teenagers across hostile Indian country after their folks have been massacred by Apaches. Widmark is terrific in the part, bringing to his role a palpable authenticity and hard bitten realism. It is one of his great he-man outdoor action roles and not unlike the part he played the same year in \"Run For The Sun\" (itself a splendid reworking of \"The Most Dangerous Game\"). The supporting cast are excellent. George Mathews as the unsavoury and brutish sheriff, Douglas Kennedy as the upright Wagonmaster, the beautiful Susan Kohner (whatever happened to?),as his half breed daughter, Stephenie Griffin as her bigoted sister, Ray Stricklyn, the ill-fated Nick Adams and Tommy Rettig as the young brother of the film's leading lady the lovely Felicia Farr. Trivia fans will no doubt remember the ill-fated Rettig played Widmark's eight year old son in Kazan's brilliant \"Panic In The Streets\" six years earlier. Also in the cast is a young James Drury as a cavalry officer in one of his early Pre \"Virginian\" roles.<br><br>The DVD looks gorgeous! With glowing colour, well defined sharp as a button images and the Cinemascope camera of Wilfrid Cline taking full advantage of those eye-catching backdrops (the incredible red rock locations at Sedona, Arizona). And not forgetting the wonderful score by Lionel Newman which is probably the best thing this younger brother of the great Alfred Newman ever did. Extras include a good trailer and a couple of photo galleries. A must for the collection of every western and every Widmark fan.<br><br>Typical line from Widmark - referring to the Nick Adams character.... \"We've got six bullets and that idiot uses up three of them on a stinkin' rattler you could kill with a stick\". Great Stuff!","user":"jpdoherty","rank":[28,30]},{"title":"Beautifully filmed though little known","rating":9,"date":"22 July 2007","review":"If you watch this film with care, you will see that every shot has been perfectly crafted. The deep blue skies and reddish rock colour go perfectly with the steely blue eyes and yellowish skin of Richard Widmark. Even the colour of his tunic blends in with the rest. The cameraman here must have been a real genius as every shot is perfect.Great attention seems to have been paid to the color of the sky, the position of the sun and even the shots in \"contre-jour\" come out perfectly - in short, a real FEAST for the eyes. This film has only recently been made available on DVD in the USA and is of course absent from Europe, though we have plenty of other, and many inferior quality Westerns available on DVD....this should have been one of the first to come out...but this was not to be the case. Plot-wise the film is quite enthralling, and it's interesting to note the change in attitude of the people with time towards Widmark, from suspicion and hate towards gratitude and love by the end. The other actors give reasonable performances but of course in this film, Widmark steals the show, just as he did in \"No Way Out\". The scenes with the Indians, smoke signals etc are awesome and very colourful. Also the soundtrack is very good, I even thought it was Dimitri Tiomkin who had composed it, but I was wrong. When I saw the film initially, I was fearing some ghastly sad ending, thinking that Widmark would inevitably come a cropper, but fortunately, love rules OK and all turns out right ! Phew ! This is a film that every true Western-lover should have on the shelves of his/her DVDthèque.","user":"nicholas.rhodes","rank":[17,18]},{"title":"A fine western adventure","rating":7,"date":"15 August 2003","review":"This story chronicles the trials of a fugitive half-breed and the survivors of an Indian attack on a wagon train. Richard Widmark is the tough, steely hero who aims to guide the survivors to safety through the desert and clear his name in a murder case. The plot is basically one of survival and redemption and the picture fleshes out Widmark's character in dramatic fashion, first as an abused prisoner, then as a trail savvy outsider who must bring to safety folks who dislike him because of his reputation. The film has fine action scenes but tends to dwell on the attitudes of the young whites who resent being dependent on Widmark, yet realize they need him to pull them out of harm's way. Felicia Farr is good as the woman who falls for Widmark in spite of his troubled past, as are Susan Kohner and Stephanie Griffin, the latter as a high-strung lass with a quick temper. Nick Adams and Tommy Rettig do fine in their roles and round out the survival party. The cinematography and music are top notch.","user":"NewEnglandPat","rank":[22,24]}]