[{"title":"hot rods from heck","rating":26,"date":"26 October 2004","review":"We first saw this little opus on cable, and rushed out to get a blank tape right away. The first major film for Tony Danza, Michelle Pfieffer, and Robert Wuhl, \"The Hollywood Knights\" is funny, gross, bawdy, and nostalgic all at the same time. Is it a rip-off of \"American Graffiti\"? Um, yeah, but it's still a very funny film in its own right. Is it gross and lewd in spots? Well. . .yeah, but we can think of more egregious examples, like \"Porky's\". Does it deserve an \"R\" rating? Not when you consider some of the other dreck that's been put in the can. Undoubtedly the most memorable scene is Newbomb's rendition of \"Volare'\" in the school gym; a masterpiece of lowbrow humor, but funnier than. . .well, you can fill in the blank. Bottom line: a small-budget gem, if you can take it. If you're easily offended, lighten up. After all, there's LOTS worse out there!","user":"march9hare","rank":[12,13]},{"title":"Halloween hilarity in LA in 1965","rating":9,"date":"14 November 2001","review":"If you're looking for a fun way to spend an hour and a half, plug this movie in, kick back and be prepared to laugh yourself silly. This film basically has no plot save for the fact that Tubby's Drive-in is shutting down and the Hollywood Knights converge there for one last hurrah. Most of their hijinks take place elsewhere however, but Tubby's is their hangout. The movie is a series of comedy sketches rather than a straightforward progression. The cast plays their roles to the hilt led by the frenetic stylings of Robert Wuhl (Newbomb). Also outstanding are Stuart Pankin as Dudley (the much-maligned honor student), and Gailard Sartain and Sandy Helberg as Officers Bimbeau and Clark.   One point I notice in other reviews and which I have to agree wholeheartedly with is that the subplots featuring Tony Danza/Michelle Pfeiffer and Jimmy Shine/Vietnam both contrive to slow the film down. This can be excused though, thanks to such gems as Newbomb's rendition of Volare, the one-armed violinist and the catered reception. Bottom line: it's a lewd and crude laugh-riot!!!","user":"stretchrunner","rank":[17,20]},{"title":"Leave your brains at the door and laugh","rating":8,"date":"18 June 2009","review":"Folks, this is not a movie to be judged or rated by ordinary or serious standards as you would \"I Am Legend\" or \"Gone With The Wind.\" Admittedly, this is a typical early 1980s (set in the 1960s) teen trash and laugh fests crudely mixed together from \"Animal House\" and \"American Graffiti.\" No real plot, a thousand different things happen at once to group of wild teenagers (played by numerous soon-to-be's) who pull crazy pranks on Halloween Night 1965.<br><br>However, if you are not of the overly-sensitive politically correct crowd or watching this with (very) young children, this film is FUNNY! The gaseus rendition of \"Volare\", wild catch-phrases (his pants fit him like a glove, Lawrence, Lawrence of Arabia, et. al) and senseless raunch makes this ideal for firing up the DVD player while your buddies are over for beer and pizza. Don't expect to find the meaning of life in this one.","user":"Damonfordham","rank":[9,10]}]