[{"title":"Melancholic, Bitter and Depressive Reality of an Era","rating":8,"date":"9 December 2007","review":"In the 50's, in a rainy night in Germany, the sports reporter Robert Krohn (Hilmar Thate) offers his umbrella to the former successful UFA actress Veronika Voss (Rosel Zech) but he does not recognizes her. Later she calls him inviting for a drink, and he finds an unstable and decadent actress living in her past success. In a mixed sensation of love, empathy and curiosity, Robert has an affair with Veronika, and discloses a dangerous gang leaded by Dr. Marianne Katz (Annemarie Düringer) that addicts wealthy patients in morphine to get their fortune when they die.<br><br>\"Die Sehnsucht der Veronika Voss\" is a melancholic, bitter and depressive tale based on the reality of an era, and the association with \"Sunset Boulevard\" is immediate. The story is based on the last years of the German actress Sybille Schmitz (1909-1955), who died due to an overdose of sleeping pills. The performance of Rosel Zech is impressive, showing the glamour of a former star in the Nazi period and the depression of an addicted woman in the 50's. Hilmar Thate is also perfect in the role of a simple innocent man that faces a greedy world of pain and death. The magnificent cinematography in black and white, using perfectly light and shadows, is homage to the Golden Age of Hollywood. My vote is eight.<br><br>Title (Brazil): \"O Desespero de Veronika Voss\" (\"The Despair of Veronika Voss\")","user":"claudio_carvalho","rank":[21,23]},{"title":"Third film in Fassbinder's trilogy","rating":8,"date":"18 November 2003","review":"This is the third and last film in the trilogy that included \"Marriage of Maria Braun\" and \"Lola\". This also turned out to be one of the last films Rainer Werner Fassbinder made before his sudden suicide in 1982. Story takes place in 1955 where a former German movie star named Veronika Voss (Rosel Zech) is now a morphine addict and she gets her shots from a doctor who specializes in hooking wealthy clients on morphine to the point where they sign over their homes and belongings to pay for their shots. Veronika use to be a star in the 40's for the state run UFA studios that made Nazi approved dramas. Now ten years after the war and unable to further her acting career Veronika is dependent on Dr. Marianne Katz who lets her stay in a backroom of her office. One rainy night Veronika runs into Robert Krohn (Hilmar Thate) who is a simple sportswriter for a newspaper and he offers her his umbrella. She is taken in by his kindness and the next day she calls him for drinks. Robert lives with his girlfriend Henriette (Cornelia Froboess) and she is curious about what will happen between them. Robert gets involved with Veronika and learns of her addiction and he seems to think that he can help her. He meets her ex-husband Max Rehbein (Armin Mueller-Stahl) and he warns him that there is nothing he can do. Robert learns of Dr. Katz and what she has been doing but he cannot prove to the authorities of her intent. <br><br>This film was shot in black and white and its Fassbinder's homage to old films like \"Sunset Boulevard\" but the black and white cinematography actually resembles the look of the films that the UFA Studios made in the 30's and 40's. The film for the most part is very dark looking except for the scenes in the office of Dr. Katz. All the decor in this place is very shiny and white and I think Fassbinder wanted this area to appear dreamlike or heavenly and its in stark contrast to the very dark tone of the outside world. The character Robert wants to try and save Veronika but its to no avail and Fassbinder wanted him to symbolize how people wanted to change and save others through their own selfish reasons. Not that they necessarily want to do harm but for their own sake of humanity. Fassbinder was a die hard cynic and he portrays Roberts efforts to save Veronika and expose Dr. Katz as pathetic and futile. This simple everyman was in way over his head and its a jab by Fassbinder to the common man who tries to stand up to corruption. The story is loosely based on a real German actress named Sybille Schmitz. This film is not in the same league as \"Marriage of Maria Braun\" and even though Zech is pretty good she doesn't give the commanding performance that Hanna Schygulla did. This is still a very interesting film to watch and all three films in this trilogy should be viewed. Fassbinder has once again directed a visually striking film and gives the viewer another look at a character that has sold their soul in the war.","user":"rosscinema","rank":[16,18]},{"title":"Memories are made of this","rating":25,"date":"25 May 2005","review":"Like many other Fassbinder films \"Die Sehnsucht der Veronika Voss\" tells about a decline and is very depressing. It is a visually stunning film that shows how much Fassbinder admired the classical Hollywood cinema and especially the films of Douglas Sirk. Like the films of his idol this film is stylish and artificial to an extreme extent which creates quite a distance between itself and the audience. Probably an even greater distance, since the style and the artificiality are used more consciously here, even as a instrument of alienation. So it is more fascinating than touching or even moving and might leave one even cold. Nevertheless the story is intriguing and it really tells something about the post war society in West Germany, so the film is interesting and even fascinating to watch. The scene where Rosel Zech as Veronika sings \"Memories Are Made Of This\" is very haunting, a gem.","user":"dkbs","rank":[11,12]}]