[{"title":"A decent \"killer kid\" film.","rating":6,"date":"19 October 2013","review":"The makers of this decent horror drama do get high marks for good intentions here. Their film does score to a degree by focusing on the human element, as the devastating effects of tragedy hit a young country dwelling couple. This couple, Alan (Malcolm Stoddard), and Kate (beautiful Cyd Hayman), already have four children of their own. They meet a mysterious, pregnant stranger (played by Angela Pleasence, the daughter of Donald P.) who gives birth in their home and promptly disappears. They keep her baby as one of their own, but their own children start dying under mysterious circumstances, starting with their infant. Alan comes to believe that the new kid, Bonnie (played at different ages by Wilhelmina Green and Joanne Boorman), is responsible, but Kate just can't accept that this adorable moppet could possibly be a danger.<br><br>This may be too slow and quiet to suit some horror fans expecting something more along the lines of \"The Omen\". It really does stress its dramatic elements more than anything, shying away from anything such as graphic violence. It does have a suitably eerie mood, beginning with the effectively enigmatic performance by Ms. Pleasence. The rest of the cast, including Patrick Barr as the sympathetic Dr. Collins, does fine work. Location shooting is good and atmosphere is strong but the music by Roger Webb is a little overbearing. The script is by Olaf Pooley, based on a novel by Bernard Taylor, and the film is dialogue heavy, with producer / director Gabrielle Beaumont (making her feature debut here) never rushing through the story. The ending fails to be completely satisfactory; in fact, it's kind of abrupt, but overall those genre fans who prefer subtlety may find it to their liking.<br><br>Six out of 10.","user":"Hey_Sweden","rank":[12,14]},{"title":"Why was adoption not an option?","rating":5,"date":"30 September 2009","review":"British Horror rocks, and that's all there is to it. British Horror certainly isn't the goriest I've come across. Maybe not the most action-packed, or the scariest, but at least some would agree that there is just something about British Horror.The Godsend is as shamefully underrated as anything I've seen from over there. This movie may be no Psychomania, and it sure ain't the masterpiece Vampyres is, but this is a good movie, nonetheless. A chillin' little British family (with far too many kids) comes across a stranded pregnant woman, who, you can tell is no good.. The unsuspecting couple lets their creepy, new friend stay over for a while, or at least long enough for her the have the kid and fly the coop before anyone notices. A problem easily solved, right? Wrong, the wife figures they don't have enough kids, already, oh, what's one more? At this point, any sensible B-Horror fan might wonder why the less-emotional man of the family doesn't just step in and at least suggest they give the little girl up for adoption, considering the other countless mouths to feed.. But if it had gone down like that, who would kill all their real kids? Not much of a Horror movie there. I take it, the pregnant woman from earlier, makes a habit of dropping off her demonic (?) offspring into the laps of unsuspecting families, although, hopefully, not all her victims are stupid enough to keep the kid. Could be wrong, but I don't think this is available on DVD yet, oh well, an old Vestron tape is good enough for me. Apparently, some compare The Godsend to The Omen. In my opinion, it's more like The Bad Seed, which, just so you know, is far superior to both The Godsend and The Omen. If you don't expect an action-packed, thrill-ride, or any type of a masterpiece, and are in the mood for some low-key, retro Horror, that doesn't require your absolute, undivided attention, you just might not hate The Godsend. Recommended to fans of British Horror, and especially killer kid flicks. 7/10","user":"Tromafreak","rank":[17,21]},{"title":"Scary","rating":8,"date":"29 January 2007","review":"I saw this movie about 3 years after it came out, and actually enjoyed it. It moves a bit slow for American viewers, and yes, it is terrifying, especially if you have children. The next few months of my life were made frightening by my 4 year old (at the time). It seems her dad let her watch the movie and she followed me around the house saying \"mummy? mummy? I love you, mummy...\" in the exact tone and accent as the evil child character. So, if you're into twisted, suspense, and totally scary, this movie is for you. If your into action (ex. XXX), this one is too slow for you. Just don't let the kids watch it. Oh, yeah...it's NOT a happy ending.","user":"severedepress","rank":[10,12]}]