[{"title":"THE ADVENTURES OF GERARD (Jerzy Skolimowski, 1970) ***","rating":7,"date":"7 June 2006","review":"I was pleasantly surprised by this one: Leonard Maltin rates it a BOMB but I found it great fun, if uneven. Skolimowski's first English-language film was actually shot in Cinecitta' and, in fact, features many Italians in the cast (all of whom struggle with the literary - and very English - nature of Sir Arthur Conan Doyle's original!).<br><br>There's still plenty of amusing detail to savor - the subject matter of the Napoleonic Wars is treated as farce most of the time and, in fact, there's quite a bit of slapstick involved (to which Skolimowski's technique is happy to oblige via numerous camera tricks, pretty much the sole link here to his early Polish films) - and, accordingly, all the performances are broadly delineated: Peter McEnery is a pompous yet likable ne'er-do-well hero; Eli Wallach is a buffoonish (and gay) Napoleon; while Jack Hawkins has a whale of a time (which, alas, happened very seldom in the films he made following the tragic loss of his voice) as the flustered leader of a bandit rabble who have adopted novel means of torture and execution, and are even dressed in Klan-type garb! <br><br>Apart from asides to the audience, McEnery also engages in a constantly interrupted duel with British officer Mark Burns - with whom he also spars for the affections of beautiful and fiery Spanish countess Claudia Cardinale. John Neville is the Duke of Wellington in his last film for almost 20 years (when he achieved some latter-day notoriety, in another tongue-in-cheek fantasia no less, with the title role of Terry Gilliam's THE ADVENTURES OF BARON MUNCHAUSEN [1988]). Riz Ortolani contributes a suitably jaunty, yet frequently rousing, score.<br><br>Unfortunately, some of the film's visual impact was inevitably lost in the pan-and-scan version I watched (taped off Cable TV); originally shot in Panavision, I wouldn't mind owning this in its proper Aspect Ratio on DVD...","user":"Bunuel1976","rank":[13,15]},{"title":"\"Two boots in one go!! I must have him for my butler!\"","rating":7,"date":"23 January 2007","review":"I've only seen half this film on late-night TV so I can't be sure if it's really good or not. The bit I did see was charming. McEnery is fabulous as the Conan-Doyle hero, Cardinale is as lovely as ever and Eli Wallach hams beautifully.<br><br>There's lots of running about deserty parts of Spain and amusing asides to the camera by Gerard, including the perfect way to get your boots off.<br><br>There are also very weirdly filmed (and plain weird) sequences that put this film far above other silly 1960s \"romp films\" (is that a genre?). The best example is a stunning slow-mo bit where a bandit with his head popping up in the middle of table is killed William Tell fashion by his preposterously debonair chief.<br><br>I'd love to see the rest but it hasn't got a DVD release (I don't think it even had a VHS release) and is very rarely screened on telly. Like at lot of Euro-productions, it's uneven, often badly dubbed and was probably panned at the time, with most people involved having forgotten about it (or trying to forget about it). Perhaps it's a great \"undiscovered\" comedy film. It's at least worthy of a bit more attention.<br><br>And what happened to Peter McEnery? He was great in this and as Mr Sloane. The results on this site show he's been condemned to TV mini-series for 25 years.","user":"nick-401","rank":[5,5]},{"title":"Frolic and Merriment","rating":8,"date":"17 March 2006","review":"The Adventures of Gerard is a somewhat silly romp set during the Napoleonic era featuring that career-went-nowhere semi-sexy Brit Peter McEnery. McEnery is exceptionally handsome in a rakish kind of way -- in this movie, he always looks slightly unclean, like a 1970s porn star, sporting as he does the cheesiest of mustaches. But he keeps a twinkle in his eye, and his physical comedy is well-polished. He has a really nice body from the waist up, but the skinniness of his legs is reinforced by the military uniforms he wears in this movie, which are extraordinarily high-waisted.<br><br>McEnery as Gerard plays some kind of messenger, a low-ranking French officer ferrying missives among the regiments of the French army occupying Spain. Hilarity ensues, mostly involving Claudia Cardinale as a sexy Spanish lass doing her best Sophia Loren imitation, with pouty lips and unkempt tresses. At one point, she is (thinly) disguised as a boy, but McEnery sees through her disguise (how could he not?!) and proceeds to seduce her (how could he?!). See what I mean about hilarity ensuing? Spain itself looks like the Old West as envisioned by Sergio Leone. And the movie will win no Oscars for Sound Effects Editing. I swear you can visualize the sound guys clapping coconuts together in the booth, timing their clangings to the fourfold footfalls of the equine cast.<br><br>This is a fun film. With its tongue-and-cheek dialog (\"The Emperor himself approved my mustache!\"), none-too-subtle sex humor, vigorous visual gags, hairbreadth escapes and coincidences, broad stereotypes (the English and their tea! and there is a whole fox-hunting sequence), and the time-honored technique of directly addressing the camera (which is a technique I like, when done well, which it is here), it is a genuine hoot. And McEnery has a subtlety about him. He can do a lot with a twist of his mustache or a raised eyebrow. He does sexy-stupid really well. Look for that all-purpose ethnic Eli Wallach as Napoleon.","user":"UncleCliffy","rank":[7,10]}]