[{"title":"'Son of Foster Brooks'","rating":10,"date":"14 April 2002","review":"Quite simply the funniest and shiniest film-comedy of all time... it's certainly on my personal top-ten list.  This one also gets a solid ten on the voting scale.  Millionaire heir, Arthur Bach (Moore), is a middle-aged 'child' who refuses to take the mature path in life and avoids all requisite responsibilities.  He also refuses to leave the bottle.  One day he and his personal butler, Hobson (Gielgud), go shopping at Bergdorf Goodman's and run into petty larcenist, Linda (Minnelli).  Arthur and Linda's chemistry adds electricity to the rest of the film.  There are hilarious set pieces aplenty.  In one such scene, Arthur (drunk  throughout most of the story) knocks on the wrong apartment door and receives ear shattering threats from a human 'siren' (\"My husband has a gun!!!!).  Performances by everyone involved should be duly noted: Geraldine Fitzgerald plays Arthur's loving-yet-ruthless grandmother, Sir John Gielgud almost steals the entire show with his acidic droll-isms (He took home the Oscar for this one), and Christopher Cross provides the Main Theme song (Oscar winner \"Best That You Can Do\").  It's a shame the late Dudley Moore passed away last month (March 2002).","user":"sampleman411-1","rank":[51,63]},{"title":"The laughs never get old.","rating":10,"date":"23 February 2002","review":"From the beginning of this movie it seems apparent that the role of Arthur was meant to be played by a much younger actor.  By the end, it's clear that nobody other than Dudley Moore could have done it so well.  Looking back, one remembers the sappy Christopher Cross theme song (does anyone remember Christopher Cross?) and oh-so-80's clothing and sets with an unavoidable nostalgia.  But the triumvirate of Moore as Arthur, Liza Minnelli as Linda, and Sir Johnny G as the butler Hobson, dripping with sarcasm and at the pinnacle of his considerable talent, make this more than a throw-away farce.<br><br>All the best lines belong to Gielgud, and the Academy Award was hardly adequate for such a legendary performance.  Moore's lovable drunk would wear thin in later years, but here it is a fresh and delightful tour de force in the most politically incorrect way.  Liza is flawless, but one hates to see her in a non-musical role, for fear of squandering such an immense talent. But the chemistry, the synergy between these legends is palpable. <br><br>\nThe laughs never get old.  It is, however, a tragedy that the DVD is not available in cinematic aspect.","user":"budmassey","rank":[33,41]},{"title":"Still a Charmer a Quarter Century Later Especially for the Well-Missed Talents of Moore and Gielgud","rating":7,"date":"1 August 2006","review":"This 1981 comedy still sparkles thanks to the combined efforts of writer/director Steve Gordon and stars Dudley Moore and John Gielgud. Sadly, Gordon, only in his early forties, died soon after completing this, his only feature film. It's an especially unfortunate loss since he shows a truly deft hand at character-driven farce that makes the whole film irresistible. It plays almost like a 1930's-style screwball comedy revamped for contemporary tastes. The plot centers on Arthur Bach, a drunken, diminutive millionaire playboy who is at risk of losing his $750 million inheritance if he doesn't marry the dowdy and boring Susan Johnson, an heiress handpicked by his old-money father and dotty grandmother. Of course, he doesn't love her and by chance, runs into Linda Marolla, a working-class waitress (and of course, aspiring actress) after she pilfers a Bergdorf Goodman tie for her father.<br><br>The standard complications ensue but in a most endearing way with loads of alcohol-fueled slapstick executed with classic élan by Moore. That he makes such a spoiled character likable is a credit not only to his comic talents but to Gielgud's feisty, acidic turn as Hobson, Arthur's devoted but reality-grounded valet. It's the type of role he could play in his sleep, but Gielgud makes Hobson such a truly memorable character that his fate in the film brings a welcome injection of poignancy in the proceedings. In probably her most likable film role, Liza Minnelli hands the picture to her male co-stars by toning down her usual razzle-dazzle personality and making Linda quite genuine in motivation.<br><br>A pre-\"LA Law\" Jill Eikenberry plays Susan just at the right passive-aggressive note, while Barney Martin (Jerry's dad on \"Seinfeld\") steals all his scenes as Linda's slovenly father Ralph. The one fly in the ointment is veteran actress Geraldine Fitzgerald, who overdoes the eccentricities of the grandmother. And I have to admit that I still can't stand the very dated, overplayed Christopher Cross song that inevitably won the Oscar for that year's best song. Unfortunately, the 1997 DVD, certainly in need of remastering, has no extras worth noting except some photos and production notes.","user":"EUyeshima","rank":[24,30]}]