[{"title":"Flawed science, but a fun movie...","rating":10,"date":"10 November 2004","review":"Yes, let's put this to bed right away. The scientific premise is flawed. We now know that the crust of the Earth is not a solid shell, but riddled through with many cracks. Not only are these not harmful, they are an essential component and feature of a geologically active world. It is how the Earth renews itself, builds land, and promotes life. There is little mankind can do in the way of \"cracking\" the Earth that the Earth has not done itself, many times over, in much greater magnitude. But, that said, this is still a fun movie.<br><br>The pace of action and buildup to the spectacular climax is first-rate. I found myself just waiting for the next disaster to make itself manifest, be it an earthquake, volcano, tsunami, or all three. The underlying message is still sound: mankind should use caution in tinkering with the forces of nature. A time-worn premise, to be sure, but no less valid today. We as a species are young and have much to learn, by being aware of the hidden forces of nature and the unintended consequences of good-intentioned tinkering.<br><br>The cast is quite good. Sci-fi stalwart Dana Andrews is the featured player, of course, but the other actors do some good work. For it's time, the special effects are well-done. Like any well-paced disaster film, as the action races to a climax, we find ourselves pulling for the \"good\" guys against, hey, wait a minute, there are no \"bad guys\", just the unleashed forces of nature, knowing no good or evil, just following their natural course. It's a fun twist and makes you think.<br><br>Overall, it's hard not to recommend \"Crack in the World\" for a fun couple of hours' escapism and entertainment. Just suspend the disbelief a bit and go along for the ride.","user":"joseph t","rank":[34,35]},{"title":"Science is a bit dated, but a fun movie nonetheless.","rating":9,"date":"9 December 2001","review":"Interesting story about a dying scientist who plans to tap the geothermal energy beneath the Earth's crust, with dire consequences. Andrews, Scott and Moore, as well as Alexander Knox, all give excellent performances. Special effects are superb and very believable. I remember seeing this on TV when I was a kid, and it scared me to DEATH. Seeing it again as an adult, it is not quite as scary, but is still fast-paced and entertaining. Sadly, it is not available on video to my knowledge. Perhaps someone at Paramount will read this and take the hint.<br><br>While the science is now dated, thanks to the discovery of plate tectonics (the Earth's crust is divided into may separate \"plates\", and therefore already has many \"cracks\"), the story is still entertaining. The interaction between Dr Sorenson (Andrews), an aging scientist trying for one last victory; his young wife Maggie (Scott), a scientist in her own right; and Dr Rampion (Moore), the project's geologist and an old flame of Maggie's to boot; works very well, even if it is a bit formulaic.<br><br>All in all it is a fun movie, and definitely worth the time to see it if you can. Paramount would do well to re-release it on video and especially widescreen DVD. How about it, guys?","user":"tuttt","rank":[22,23]},{"title":"Worth a view","rating":13,"date":"13 October 2001","review":"This film falls into one of my favourite categories, that is to say the category \" Man Tampers With Nature \". Shot in Technicolor with superb picture quality, it is a feast for the eyes ( Why can't they get the same Technicolor quality in today's films ?? ) The sci-fi films of the 50s and 60s are feasts for the eyes and visual gems ( excuse the tautology ! )The story of this one is fairly limited, but the special effects are wonderful and realistic. I put the film on a par with others such as \"Invaders from Mars\", \"Incredible Shrinking Man\" etc. Obviously, the may be scientific inaccuracies, and science has advanced since 1965 but there again, this is an entertaining film and not a technically correct documentary.","user":"nicholas.rhodes","rank":[19,20]}]