[{"title":"An epic short film?","rating":9,"date":"9 October 2001","review":"If you've read the book, this film version comes as a surprise - how does it manage to make so little of so much? Or is it so much of so little? Döblin co-authored the screenplay, which compresses his sprawling novel into a breathless eighty-eight minutes. Of course, much is sacrificed, but the skeleton plot still compares favourably to that of many modern movies. Technically, too, this flick has aged magnificently - considering this is one of the first German films with sound, what we see and hear is a lot smoother than I'd expected. The cinematography is astonishing by the standards of the decades that followed: there's an opening sequence of our hero (played by Heinrich George, a huge bear of an actor) just out of jail, dizzied by the speed of a tram and the chaos of the surrounding traffic, which is almost as vertiginous as \"Vertigo\". Reminds one that 1931 was the year of Fritz Lang's \"M\". Was film a more experimental art form then than it is now? It was also fascinating to see how modern the Berlin of seventy years ago still looks: true, the men have moustaches, and there are horses on the streets, and there isn't a single phone call in the plot, and the actors don't look like models, at least not all of them, thank goodness; but the villains could be straight from Hollywood, as could the fast cars, the glossy ads all over the buildings, the bars, the knee-length skirts and short bobs, and above all the sheer tempo of city life. It was a hugely enjoyable experience and gave me a better idea of the times my grandparents grew up in.","user":"anagram14","rank":[41,47]},{"title":"On DVD, the Criterion Berlin Alexanderplatz set, disc 7","rating":7,"date":"10 December 2007","review":"Located on disc 7, the extras disc, of the new Criterion Berlin Alexanderplatz set. This is well worth seeing if you've just gotten your way through the 15.5 hour version. There's also a 23 minute long lecture on the original Alfred Döblin novel and its adaptations over the years that is a must-see, as it helps put it all into perspective. If not for the inevitable spoilers, I'd almost recommend watching that extra before you attempt either the film or the series. This original film, adapted with the help of the novelist, is apparently quite different from the novel, to which the Fassbinder series sticks pretty closely. The character of Franz Biberkopf is much more likable here. He's still kind of dumb, but he's not strictly to blame for the ills that befall him and those around him. This was because the star of the film, Heinrich George (Metropolis), probably didn't want to be depicted as an unthinking jerk. It's amazing that the writers are able to whittle the enormous plot into an 83 minute film, and for the most part, I was enjoying it. It's just when the character of Mieze is introduced that it begins to fall apart. She just shows up too fast, and doesn't have time to win the audience's affection. She almost feels like an afterthought here. I did think Maria Bard was very good as Cilly (who is a composite of all of Biberkopf's girlfriends up to Mieze, including Eva).","user":"zetes","rank":[8,9]},{"title":"Berlinalia","rating":10,"date":"30 September 2008","review":"anagramm14 from Switzerland writes: \"and there isn't a single phone call in the plot\".  Well, actually there is a phone call, when Henschke, the bar keep, calls Cilly, who has gone uptown to the West, to inform her that Franz is back from the hospital.<br><br>However, there is another observation to be made. Throughout the film You see  among the advertisements in general  beer advertisement for only one Berlin brewery: Berliner Kindl. It is remarkable in so far, as another brewery, Schultheiss, at that time one of the largest brewing companies worldwide, and located in Berlin, is completely absent from the images, which cannot possibly have happened by chance. Even today You cannot walk the street of Berlin for more than five minutes without passing a Schultheiss-sign. <br><br>Another Berlin film of the same year (1931) which features extensive footage of the contemporary Berlin, Emil und die Detektive (Emil and the Detectives), shows also only Berliner Kindl beer ads, a fact that leads me to the theory, that Berliner Kindl had effectively placed their logo in important films of the time and saw to it, that their number one competitor, Schultheiss, was not visible.","user":"prolaroid","rank":[4,4]}]