[{"title":"Truly great","rating":10,"date":"27 July 2006","review":"Originally saw this back in the early nineties as a part of Sci-Fi's Saturday Anime. To this day, through all of the anime films/series I've seen, this still reigns as the greatest. No anime fan will be disappointed with this film, even those who aren't fans of the genre should enjoy this flick. It is sad that this film didn't get very much exposure in the States, as it easily could have been subject to awards. A great example of a film students interperetive dream; Trying to develop a correlation between all of the shorts (outside of their all contain robots), pulling some greater meaning from the movie. Yea, it's one of those types of movie, that appears to be on a higher philosophical level than just your average entertainment.","user":"atariteenager31","rank":[13,13]},{"title":"Anime as it ought to be","rating":10,"date":"18 February 2004","review":"This remains one of the best Anime feature films I've ever seen, and, in a stroke of great luck, was also the first Anime feature film I ever saw. While a little (well, a lot) on the artsy side at times, Robot Carnival is a great example of the reckless imagination and superb craftsmanship that Japanese animation at its best is known for. Unfortunately, it's also an example of a kind of film that is becoming very rare in the anime world today. Robot Carnival mops the floor with the ever spreading hordes of Dating Game adaptations/Merchandizing tie-ins that are never the less dominating the industry. Robot Carnival ought to be one of the most well known Anime in the world, not the obscure relic of hardcore geeks that it seems in danger of becoming. If you see a copy of this, buy it on the spot and see what animated film making ought to be.","user":"blitzkrieg1701","rank":[13,13]},{"title":"I rented this movie by accident a decade ago but one short is UNFORGETTABLE","rating":4,"date":"4 July 2007","review":"I wasn't a die-hard anime fan back then as an 18-year old young man, but I happened upon this movie on VHS at an independent video shop after moving from another state. It was placed semi-obscurely at the bottom rack of the animation section but the strange cover artwork case of the VHS edition made an impression on me.<br><br>So I rented the videocassette to pop it into the VCR. I was mildly impressed with all of the 'weird' shorts except one short that is so lyrical and surreal it moved me like no anime ever did (except for Spirited Away years later which I admit to having seen 7 times in theatres). That short is called, if I remember correctly, \"Cloud\".<br><br>Independent video shop have since 'closed' (sold its business to a competitor) a few years later and I never had a chance to see the movie again since it's out of print.<br><br>Cloud segment is one of the most haunting films (short or feature-length) I've ever seen. Even though I remember *nothing* about the movie, I still recall the Cloud segment.<br><br>It's an unforgettable experience witnessing the aesthetically mind-bending short sitting in the darkened living room in the basement on the sunny afternoon day.<br><br>The black &amp; white animation...background...strange but haunting ending. I barely remember what the story is about (must be silent) but I understood what it *is* about -- loneliness and requiem for love.<br><br>I think it must be seen on the large screen to experience the full effect of emotional tranquility. One of the best examples of surrealist &amp; moving cinema on the meditation of loneliness and love as conveyed by sublime emotional transcendence, animated or not, and one that stamps indelibly in the memory base of the human brain when the viewer is still youthful as a child or adolescent.<br><br>Cloud short is an incredibly transcendent work of art in cinema that make for an utterly unforgettable visual experience. One that have the honor of magnificent art among the grandest 2-D dimension paintings of the 17th century Naples and Golden Age of Dutch Art in conveying profound emotions through the magic of artistic motion picture in silence.","user":"Michael Kenmore","rank":[9,9]}]