[{"title":"Not your daddy's Chuck Norris movie!","rating":6,"date":"25 February 2008","review":"Yes, I know that Chuck Norris is predictable. He hardly ever says \n anything and he just kicks butt. We that is true for this movie also, \n but there are some extras that make this an unusual movie for Norris.\n \n First, Sheriff Chuck has a girlfriend, Toni Kalem, and they spend as \n much time as possible in bed giving us a great view of her ample chest. \n Now, that is not typical Norris behavior! When Norris visits a biker \n bar, we get to see some of his typical style as he cleans the place \n out. You knew that was going to happen, but, before he does, his \n Deputy, Stephen \"Flounder\" Furst (Animal House) gets an eyeful from one \n of the biker chicks, Lillette Zoe Raley, in her only movie. What a \n shame! We also see some action from the other biker mommas (Linda Tatum \n and Kathleen Lee) before Norris arrives. I've never seen so much action \n in a Norris film.\n \n All of this is just titillation as the real story is the mad scientist \n and his partner (Steven Keats and William Finley) develop a serum that \n resuscitates a dead man and causes his wounds to heal immediately, \n Bullets, falls from second stories, cars, fire - nothing stops this \n guy. Well, you know who will eventually stop him, or does he? This is \n the only film in which I have seen Ron Silver in a humane role. He was \n the third doctor who tried to stop his boss. I actually was starting to \n like him, but, fortunately, he gets killed off before that happens. \n That was close! If you want Norris action with a little sci-fi \n craziness, then this is the flick.","user":"lastliberal","rank":[17,19]},{"title":"Appreciation where it is due","rating":7,"date":"15 March 2006","review":"This movie is pretty much how everyone describes it (a B-grade flick), but there is one worthy element that I feel most people have missed. Brian Libby's character creation was nothing short of brilliant. During the first half of the movie this might not be so noticeable, but towards the end, and especially during the final fight sequence, his movements and mannerisms are highly original and unique. The director would have told him to play the part of a man that has become almost zombie-like, and who has the ability to recover quickly and suddenly, and then left the rest up to the imagination of Brian. Well Brian certainly rose to the occasion, and his work in that last portion of the movie alone should have earned him an award. So yeah, the movie overall might be B-grade stuff, but Brian Libby deserves credit and recognition where it is due, and it is worth while seeing the film just for what he brings to the screen in that last half. I'll add an extra few points out of respect to Brian Libby, and give the film 7/10.","user":"go_titans","rank":[19,23]},{"title":"Better than most of the slashers from that time","rating":9,"date":"6 March 2004","review":"I remember watching \"Silent Rage\" along time ago when I was very young, and I could barely sit through the whole film because of the suspense. I would get up and walk into another room, then come back to check out what was going on. It was quite intense for a young kid. I can certainly sit through the whole thing now, without trouble, but the movie is still suspenseful. And, like my one line summary says, this movie creates and maintains suspense better than a lot of the slasher movies that were being made back the the early '80s.<br><br>This isn't a well known movie, but it's really one of Norris' best that he's been in. 8/10","user":"cwillis_m","rank":[31,40]}]