[{"title":"Minor Classic","rating":7,"date":"7 July 2003","review":"The most surprising things about this minor classic from the mid 80's are that it was director Christopher Morahan's first film since 1969, and Cleese's character is based on a real-life headmaster! John Cleese based the character on the head of his daughter's school, and I can tell you the real life head is just as delightfully nutty as Stimpson.<br><br>Time obsessed Mr Stimpton, head of an ordinary British state school finds himself chairman of the Headmasters Conference and has to get to Norwich to address their meeting. Everything goes wrong on the way, despite Stimpson's meticulous planning, and due to his obsessive nature he gets more and more frayed at the edges as things go wrong.<br><br>There are some great observations on human nature in a film which moves quick enough to keep you laughing but not so quick that you miss anything.<br><br>\nNot perhaps Cleese's very best work, but a minor classic nevertheless. Generally under-rated as most have already said. Chris Morahan went onto continue his film directors career with the excellent thriller \"Paper Tiger\" in 1990, among others.","user":"a_gulliver","rank":[23,23]},{"title":"One of the most under-rated comedies of all time","rating":8,"date":"17 February 2004","review":"John Cleese was at his harried best in this little gem of a movie. Certainly one of the most under-rated films in this genre of all time. Intelligent, (maybe too clever and too British for the Americans at the time of release) extremely funny and a film one can watch over and over without it becoming stale. Cleese's timing is superb and as for his wife and daughter.. an absolute pleasure to observe!","user":"andyh-9","rank":[30,31]},{"title":"Right! Left? Right! No, left!","rating":9,"date":"16 February 2004","review":"A scrupulously punctual headmaster in an English comprehensive school sets off for the Headmaster's Conference to deliver a keynote speech.  One little slip sees him boarding the wrong train, which leads to a chain of consequences conspiring to keep him from his goal.  This is one of the finest farces I've ever seen brought to the screen, written naturally enough by theatre farce-meister Michael Frayn.  The frenetic energy of John Cleese in his prime really lifts this above the norm, as he hitches a ride with a student, bumps into and kidnaps an ex-girlfriend and winds up naked in a monastery.  The climactic scenes at the HMC amount to perhaps the finest pay-off seen in farce.  This is, indeed, a historic moment.","user":"R_O_U_S","rank":[36,38]}]