[{"title":"Should be required viewing for anyone who coaches","rating":8,"date":"10 May 2003","review":"\"Bad News for the Athletics!\"  This movie should be required viewing for parents and coaches of any sport at any level.  It reminds me of what is wrong about youth sports, but at the same time what makes youth sports great.  There are many lessons to be learned from this movie.  It is sad, but many parents and coaches continue to make the game about themselves and not about the children playing.  Bad News Bears shows just how ridiculous that type of attitude regarding youth sports is.<br><br>Bad News Bears is the original kids/sports movie without the Disney cliches. There isn't a clear cut bad guy, each coach (Buttermaker and Turner) have there faults and motivation.  It is also refreshing that the movie does not have the typical Hollywood ending, but instead one that is fitting for the team sponsored by Chico's Bail Bonds.<br><br>\nBad News Bears is also a great reminder of life in the late 1970s, the uniforms, clothes, cars, etc.  Finally, it is an entertaining movie, especially for anyone who has played little league baseball (or any youth sport).  It makes me laughs every time I watch it.","user":"bmsopata","rank":[47,49]},{"title":"Reminder of a freer time...","rating":10,"date":"5 May 2005","review":"I was really impressed with how well this movie has \"aged.\" Walter Natthau plays that role of the alcoholic wash-out to perfection, and Tatum O'Neal portrays the struggle of a young girl trying to enter adolescence without losing her sense of \"self\" with delicacy and skill. It's a good story,with quite a bit serious to say about human nature and the understandings and misunderstandings between generations; it makes me mad that it never received the attention it deserved because it's \"just\" about kids. On a sadder note, I also couldn't help being impressed with how far this culture has regressed since 1976. The children's use of even mild profanity would never be permitted now in a \"family film,\" and the wonderful scene at the end would certainly send the Thought Police running for their placards and boycotts. It's worth watching this film again just to remind ourselves that only 30 years ago children still enjoyed some autonomous space in which to grow, and the iron doors of the Nanny State had not yet completely swung closed upon them.","user":"shneur","rank":[69,81]},{"title":"My Childhood!","rating":20,"date":"20 July 2005","review":"\"The Bad News Bears\" came out in 1976, the summer that I started playing little league. I know I am not breaking any new ground when I say that this film is a classic, but hopefully I can educate some of the younger viewers and posters as to how realistic this film is, in some ways.<br><br>First of all, I believe that anyone who has ever played organized youth sports has had a Tanner Boyle, Timmy Lupus and a Kelly Leek on their teams. This is just how it is, and for better or worse, it is one of the galvanizing factors that make youth leagues etch themselves indelibly into the memories of all those who have participated in them.<br><br>Second of all, kids curse. I don't know who the \"nay-sayers\" out there are, but they should look back into their own memories and try to figure out just when they learned to use the F-word. If you didn't learn it from your parents, you learned it from other kids. Granted, not all of us knew exactly what the words meant at that age, but we still used them. It was a small measure of rebellion at the age of seven.<br><br>When Tanner Boyle makes the comment that the team is filled with \"niggers, spics, Jews and now a broad,\" it would be a crass, hateful comment if it had come from an adult. Yet, as a youth, Tanner gets a laugh because we all know that he doesn't really mean it, he is just repeating what he has heard at home -- not to condone what might have been said over the Boyle dinner table. The proof of this is obvious when Tanner \"takes on the seventh grade,\" and makes a valiant attempt to preserve Timmy Lupus' honor before he gets thrown into a garbage can. Regardless of Tanner's racist remarks about the team, and his shunning of Lupus, \"Lupus, why don't you sit over there? (abbr.)\" he is willing to fight for those same people.<br><br>Third, (sorry for the digression), that's what parents are like. It is a truth that goes down through the ages: when it comes to their children, all adults are a-holes. When it comes time to see their children strive to excel at something, they become the obnoxious, bullying, chest-beating sh**s they have warned their children not to be. For the most part it is an extension to the children for what the parents' couldn't be in the first place, e.g. a good shortstop.<br><br>And Fourth: Losing. There is something about those pinstripes and even the moniker \"Yankees\" that make some of us want to do violent things to a couch. Mind you, I am not a native southerner, nor am I a Red Sox fan. I am just a man who can see the fact that pinstripes and the word \"Yankees\" symbolizes a corporate juggernaut that tries to annihilate the concept of fair play. For the Bears to ultilmately lose to the \"Yankees\" is just. They got beat. Perhaps it is an irony that this movie came out one year after the last choppers left Saigon, that defeat was in the air, so to speak. <br><br>There was still a message to this movie. A message that I have carried throughout my adult life. A message that Churchill had during the Blitz, and Giuliani had in the post 9/11 rubble. Once again, a line from Tanner Boyle: \"Hey Yankees, you can take your trophy and shove it up your ass. Just wait until next year!\"","user":"jbr1039","rank":[28,31]}]