[{"title":"Feminist problems?","rating":26,"date":"26 May 2008","review":"I have noticed that several posters have commented on the \"anti-feminist\" aspects of this movie. I think they have missed the point in this particular movie. The whole point is that history is capricious - anything can happen. Even an admittedly-not-too-bright-with-no-ambitions-above-wife-and-mother woman can suddenly be caught up in world affairs and be loved by two of the great men of her time. And that's basically what happened, historically. Desiree had no ambition or desire to be what she became - a queen, and the founder of a dynasty that still exists today. Hence, her dialog. Feminist criticisms are beside the point.","user":"aernest","rank":[13,13]},{"title":"At least a point of departure for a study of a great French leader...","rating":7,"date":"18 August 2000","review":"Henry Koster directed many films with considerable charm and flair... His attempts at drama were for the most part less successful but always visually pleasant... He was nominated for an Academy Award for directing \"The Bishop's Wife\" in 1947... His reputation as a skilled artist led to his assignment as director of the first film in CinemaScope, \"The Robe.\" <br><br>Koster does manage to keep the dynamism of \"Désirée\" and is excellent on both the technical level as on the screen acting... The film won Oscar Nominations for Best Art Direction-Set Decoration, Color &amp; Best Costume Design... <br><br>His high moment of the film was 'The Coronation Ceremony' where after the blessing of the crowns Napoleon seizes the crown from the Pope Pius VII and crowns first himself, then Josephine (Merle Oberon), Napoleon's first wife... (This petite brunette looked particularly ravishing as the empress). <br><br>Marlon Brando proved his versatility playing the great French soldier-statesman, a man insatiably ambitious, exceptionally intelligent, prompt to make decisions... Brando's performance is cool, calculating, compulsive, using a calm, measured English accent, providing the role its wise temperature of the most celebrated personage in the history of France &amp; Europe...<br><br>British actor Michael Rennie plays the revolutionary general Jean-Baptiste Bernadotte with a noticed antipathy for his rival... Bernadotte shifts his allegiances, forming alliances with Russia, Great Britain &amp; Prussia, contributing in the defeat of Napoleon at the Battle of Leipzig...<br><br>Jean Simmons - lovely as ever with her delicate beauty - gives the story fluid charm of a seventeen-year-old girl to a self-confident woman... We see her running through the streets of Marseilles, growing up in the outcome of the French Revolution, recording her daily written account of events, witnessing Napoleon's arrest...<br><br>Rescued from the threat of a jump into the Seine, Désirée rejects Napoleon's advances, and marries Count Bernadotte, now a Marshall of France...<br><br>Désirée was a romantic figure involved with two opposite characters: one as Emperor of France with an eternal search for wars and glory, and a king, uncertain sometimes about his capacities, with the necessity of a beloved queen besides him...<br><br>If not viewed as a history lesson, this fictionalized biopic is good entertainment and at least a point of departure for a study of a great French leader...","user":"Nazi_Fighter_David","rank":[39,46]},{"title":"Outstanding Performance by Major Actors","rating":9,"date":"14 March 2007","review":"Marlon Brando proved his stature as one of the greatest movie actors over and over again - from \"A Streetcar Named Desire\" through \"On the Water Front\" all the way to \"The Godfather.\" In the light of his marvelous performance as Napoleon I. in \"Desiree,\" it seems surprising that this movie doesn't quite get the same attention as those others he starred in. \"Desiree\" seems even more underrated when you take into account the great acting of Jean Simmons (Desiree Clary), Merle Oberon (Josephine Beauharnais), and Michael Rennie (Jean-Baptiste Bernadotte). All four main actors deliver powerful performances giving the viewer a real sense of the powerful personalities they embody.<br><br>The story is that of Napoleon, however, seen through the eyes of his first fiancée, Desiree Clary, daughter of a wealthy Marseilles merchant, whom Napoleon leaves to wed Josephine Beauharnais. The Beauharnais's political connections facilitate the military leader's rise to political power, but Napoleon dumps her for Marie Luise of Austria when it turns out that Josephine is unable to bear children.<br><br>Meanwhile, Desiree marries Jean-Baptiste Bernadotte, one of Napoleons most distinguished generals. Thus, Desiree remains in Napoleon's orbit, and the Emperor repeatedly distinguishes her amongst the ladies of his court, making it clear that his love for her never fully died out. When the Swedish parliament offers her throne to her husband, Desiree follows Bernadotte to his new country. But since she's unable to adapt to the stiff protocol of the Swedish court, Desiree returns to France, just in time to see Napoleon make the tragic mistake of leading the \"grande armee\" to Russia.<br><br>Marlon Brando masterfully conveys the image of a charismatic leader who believes himself chosen by destiny to fulfill a task of truly historic proportions. In every scene, Brando's Napoleon commands attention and obedience by way of natural authority. From the moment he enters the Clarys' family parlor and seizes control of the evening conversation all the way through his bitter discussions with Bernadotte about the latter's acceptance of the Swedish crown to his acknowledgment of defeat after the Battle of Waterloo  Brando shows us a dignified, determined, and at times dangerous leader.<br><br>Just one - hilariously funny - example: There is a scene in which the court is rehearsing for the 1804 coronation of Napoleon and Josephine in Notre Dame with the future Emperor not present. Napoleon's sisters refuse to carry Josephine's train and bicker about their brother's not bestowing enough honors and titles upon them. All of a sudden, Brando's voice is heard \"May I be of help in this difficult and strategic operation?\", and the entire court bows down in deference. As Marlon Brando walks through the ranks of the lickspittles, everything seems in perfect order. He IS the Emperor in the same way that he just IS the godfather. And it's that natural authority that Brando conveys throughout the film.<br><br>Simmons's Desiree on the other hand is charming. The character is not designed to have the same powerful screen presence  though it lends itself to the movie's title  but nonetheless Desiree is an interesting character in that she exhibits human growth. The character starts as a naïve, flirtatious teenager infatuated by the \"bovarisme\" of romantic novels; she's just as overjoyed at commanding the attention of a general as she's heartbroken on finding out that Napoleon is going to marry Josephine. She then moves on to becoming the traditional mother figure as she has a son with Bernadotte; a desirable woman willing and able to bear responsibility, but without any greater intellectual ambition. And she finally reaches a stage of intellectual maturity which enables her to convince the Emperor in a grand, though highly fictionalized scene that it is better to surrender to the allied forces than to shed more blood in a futile attempt to save the bits and pieces of his shattered empire after the Battle of Waterloo. It is this development that is mirrored in Simmons's performance at all stages.<br><br>Oberon and Rennie as Josephine and Bernadotte are congenial counterparts  though their characters have considerably less screen time and are of lesser importance to the plot. Particularly Oberon's air of desolation in the scene in which she speaks with Desiree about Napoleon's decision to marry Marie Louise is impressive. So, too, are the aforesaid discussions between Bernadotte and Napoleon. Brando's Napoleon commands the scene here too, but there is an authentic sense that Rennie's Bernadotte is doggedly refusing to give in to his former commander's demands.<br><br>\"Desiree\" is an underrated movie, especially given the comparatively low IMDb-rating, which remains mysterious to me. The performance of Brando is outstanding; those of Simmons, Oberon, and Rennie are remarkable as well. It goes without saying that the costumes are lavish and the cinematography impressive. A top movie in the genre of historic drama.","user":"walchonvonsentze","rank":[18,20]}]