[{"title":"Almost as good as Tati's best films; very underrated!","rating":9,"date":"31 July 2002","review":"Tati's final theatrical film, which is often considered his greatest failure, is in actuality nearly as good as his masterpieces. In this film, Tati stars for the fourth and final time as M. Hulot. This time he has a job as an automobile designer, and it is his job to get his company's new Camping Car to Amsterdam for a big auto show. Accompanying him is a driver, François, and a public relations worker, Maria (played marvelously by Maria Kimberly, who reminds us of the great lead actress roles played by Nathalie Pascaud and Barbara Denneck in M. Hulot's Holiday and Playtime respectively). Maria drives around in a little yellow convertible with her little fur-ball dog. Its fast and maneuverable. It can go pretty much anywhere it wants. Unfortunately, François and M. Hulot are driving a large truck. They often get into trouble when they're trying to follow Maria's car. Every problem that can happen does. Many observations are made about how people act when they're in their cars on the highway (it's a non-stop traffic jam from Paris to Amsterdam). The jokes in Traffic are always hilarious. The first fifteen or twenty minutes are somewhat dry of them, which is mainly why I don't rank this one up there with M. Hulot's Holiday, Mon Oncle, and Playtime (it's about even with Jour de fête). But when it gets going, it never stops. And it's beautiful, too, just as all of his other films. The final sequence is sublime, and the final shot will stay with me forever. 9/10.","user":"zetes","rank":[31,35]},{"title":"A Piece of Cinema History","rating":8,"date":"21 May 2002","review":"Whilst not Tati's best by any stretch of the imagination the genius of the man still shines through. Having lived in France for a while I see more humour in this film, particularly in the comedic observation, than before. The French may be fanatical about cinema and may well have produced some of the world's greatest film makers but out and out comedy probably ranks well down in terms of output. Maybe it's something to do with the French sense of humour (whatever that may be). Unlike British, and to a lesser extent US comedy, self-parody is not a French strength. It could be something to do with their history and education but the culture, so strong in literature and the arts seems not to demean itself with pure laughter. Most cinema fans would probably be hard put to list 10 French comedies - other than perhaps drama with the occasional comic undertones. Les Visiteurs (the original not the recent re-make) is probably one of the better examples but here again there's little or no self-mocking.<br><br>So it was left to Tati to mine the seam - and how well he mined it. Here he takes the smallest of French (dare I say Parisian) mannerisms and extends them into lengthy scenes of beautifully observed comedy. Whether it's the windscreen wipers in tune with the occupants or the nose-picking drivers, he asks the French to at least smile, if not laugh out loud, at themselves.<br><br>\nYes, the film does move at rather a slow pace and there are times when the comic observation sags, but the sight of dear old M Hulot in his mackintosh, loping along with pipe jutting from his mouth will ever remain one of cinema's delights.","user":"davidholmesfr","rank":[26,30]},{"title":"Leave your expectations behind and let this movie win you","rating":8,"date":"11 January 2003","review":"I didn't know what to expect when I went to see this movie many years ago. I was delightfully surprised.  This is a very funny movie, but it is subtle in it's kookie-ness.<br><br>Two men have developed a new camping van and have set out to take it to an outdoors show.  This should be an ordinary trip full of coffee, donuts and long boring stretches of road.  But no, this does not take place in America; it starts in Paris and the goal is Amsterdam. Much can happen along such a route, and in this case, just about everything does.<br><br>Will they make it there before the show has ended?  Will their dreams of being successful come to pass? These are the driving questions of this movie. They seem rather uninteresting goals, don't they? Nevertheless, these characters will likely win you over and have you rooting for them as they make their bumbling stab at entrepreneurship. Or, just as likely, you may find yourself enjoying every obstacle that steps in their way, as I did.<br><br>Much is unexpected in this movie and that's what makes it fun!  Share this one with your friends and they will thank you.<br><br>Note:  this is a comedy, there's not much gore or street fights, shoot-outs or bombs taking out city blocks, so be forewarned, this movie with not shake your subwoofer.<br><br>Although not a spy movie, it somewhat reminds me of the original \"Tall Blonde Man with One Black Shoe\": another wonderful French comedy.","user":"hensroad","rank":[16,18]}]