[{"title":"The Cinema of Abel Ferrara","rating":9,"date":"17 January 2005","review":"Ms. 45 (1981) was an interesting view on the revenge flicks that were popular during the mid 70's to the early 80's. Abel Ferrara and his co-conspirator Nicholas St. John follow the life of a mute dress worker (Zoe Lund) who snaps one day after being raped twice. She kills her last attacker and keeps his gun. After seeing the grim world around her and the loss of her mental faculties, she decides to do a hunting.<br><br>A strange but highly enjoyable film that takes exploitation films to a whole new level. The gritty direction by Abel Ferrara and the smart writing from Nicholas St. John elevate this movie above most of the trash that was produced during this time period. The star, Zoe Lund posses some unearthly beauty and she has that certain stuff to make the material work. Not many other actresses could have pulled this off but she some how manages to.<br><br>If you can find an uncut version of this movie I advise you to go out and get it. This is one of the best vigilante movies you'll ever watch. I have to highly recommend this film. It's Abel Ferrara doing what he does best. Street level film making!","user":"Captain_Couth","rank":[43,55]},{"title":"Worthy of its cult status","rating":9,"date":"16 December 2008","review":"Shy and mousy mute garment district worker Thana (a remarkably assured and nuanced performance by the lovely Zoe Tamerlis) gets raped twice in one day. After killing her second assailant with an iron, Thana takes possession of the man's .45 caliber gun and starts hitting the mean streets of New York on a mission to blow away every last sleazy no-count guy who crosses her lethal path. Director Abel Ferrara (who also has a chilling cameo as the first rapist) and screenwriter Nicholas St. John take the familiar vigilante premise and completely turn it on its ear by cleverly undermining basic exploitation audience expectations: the rape scenes aren't that graphic, there's no nudity to speak of, and all the men featured in this film are hateful and disgusting jerks who regularly prey on women in one way or another (Thana's victims include a street gang, a slimy fashion photographer, an abusive pimp, and even a rich Arab who cruises for babes to pick up in his limo). Moreover, this inspired cross between \"Repulsion\" and \"Death Wish\" reaches a stunning bloodbath climax at a Halloween costume party which Thana attends dressed as a nun. Tamerlis as Thana makes for a fascinatingly complex figure: While she nonchalantly offs numerous predatory dudes, she can't bring herself to kill her landlady's pesky dog. In an interesting touch, the initially plain and passive Thana becomes more increasingly alluring and aggressive throughout the course of the narrative. Edith Sherman as Thana's annoying and eccentric landlady Ms. Sherman gives one of the single most gloriously oddball performances ever committed to celluloid. Albert Sinkys contributes a deliciously smarmy turn as Thana's odious creep boss Albert and Jack Thibeau has a startling bit as a dejected fellow Thana picks up in a bar. James Lemmo's slick, gleaming cinematography gives the picture an attractive glossy look. Joe Delia's moody, jazzy score likewise does the funky trick (the piercing saxophone is especially gnarly). Done with tremendous crackling verve and an arresting sense of dazzling style, this highly impressive piece of ultra-kinetic low-budget indie film-making certainly lives up to its sizable cult reputation.","user":"Woodyanders","rank":[18,22]},{"title":"THE best exploitation movie of the 1980s!","rating":1,"date":"1 September 2003","review":"The 1970s were THE decade for American exploitation movies with the likes of Roger Corman, Jack Hill, and Larry Cohen Jr creating some of the most entertaining trash ever made. For the most part the 1980s were a big let down in this department. Porkys-like sex comedies and awful buddy action movies and the like generally failed to reach the heights of the glory days of A.I.P. There were a few exceptions ('Chained Heat', 'Maniac' and 'The Exterminator' immediately spring to mind), and 'Ms.45 ' (a.k.a. 'Angel Of Vengeance') is in my mind THE single best exploitation movie of the decade. Abel Ferrara, who later made brilliant movies like 'Bad Lieutenant' and 'The Funeral', had previously made a porno movie and the infamous \"video nasty\" 'The Driller Killer' before this, which could well be the best rape revenge movie ever made. Ferrara's genius touch was the casting of the late Zoe Tamerlis. She is stunningly beautiful and her face is very expressive. Making her character mute makes the movie an unforgettable experience. It's really difficult trying to \"sell\" this stunning movie to someone. You'll either love it or you just won't \"get it\". I think it works very well as a post-'Death Wish' vigilante movie, but just as 'The Driller Killer' is more than \"just\" a slasher, this movie has a lot more to it, and that is almost completely down to Zoe Tamerlis. 'Ms. 45' might be b-grade trash to many, but it is uncompromised, something you very rarely see these days. I think it stands alongside 'Repo Man', 'Videodrome', 'Blue Velvet', 'The Evil Dead', 'The Ninth Configuration', 'Raising Arizona' and 'The King Of Comedy' as one of the most extraordinary movies released in a decade dominated by mediocre popcorn movies forced on viewers by Spielberg, Lucas, Hughes, Bruckheimer and Simpson.","user":"Infofreak","rank":[48,66]}]