[{"title":"snapshot of a time past","rating":7,"date":"31 December 2002","review":"Maybe it's just because of my love for history, but I really enjoyed this movie.  I can understand why some may not, since it has a sort of anti-ending and very little actual 'plot.'  The film is simply the portrayal of daily life for a London family--a collection of character subplots, basically.  <br><br>It doesn't sound like much, but the film's strength is its characters. Besides the main little boy, there's the overzealous father, the sexually-liberated teenage sister, a hilarious grandpa, a gang of far-from-innocent little boys, and others.<br><br>Overall, watching this movie is like stepping back in time and sneaking a peek into everyday life.","user":"the_other_kinsey_institute","rank":[53,58]},{"title":"Through the eyes of a child","rating":10,"date":"10 January 2001","review":"Undoubtably one of the best movies about \"the home front\" of WWII, Hope and Glory effectively recalls the child's perspective of living amidst the rubble of the Blitz.  The film's strength, in my view, is how people tried their best to maintain their normal lives and customs as their world crumbled around them, both literally and figuratively.<br><br>The young man playing the central character does a fine job of bringing Boorman's childhood to life.  The natural ability of children to adjust to change (but not without consequences) is brilliantly depicted.  The \"gang\" sequences were not only funny but also felt remarkably true, especially the collection of plundered booty and scrap war material.  It's just the type of mischief you'd expect from letting the boys run wild through this type of damage.<br><br>Sarah Miles and Sammi Davis are excellent as the mother and older sister to the central character; their interaction shows the damage war does to relationships and moral values.  The highlight for me was the grandfather, however.  The gentleman stole every scene in which he appears.  The final scenes of the movie show his delight in his grandson in such a novel and moving way that it became almost the film's highlight.<br><br>I worked with a man who lived in London during the war, when he would have been the same age as the boy in this story.  He told me that he considered this movie the best one he'd ever seen on World War II and recommended that I watch it.  I've never regretted it.  Thanks, Jack.","user":"Captain Ed","rank":[52,57]},{"title":"A Funny, poignant, truthful, and enjoyable child's-eye view of London during The Blitz.","rating":9,"date":"4 July 2002","review":"Since I first saw it, 15 years ago, a little film in a little theater, I have regarded John Boorman's recollections of life as a grade-schooler during \"The Blitz\" as astonishing.  Over the years I've used the movie to bring to life the very points that Anna Freud makes in her diaries of the \"War Nurseries\" she ran in Hampstead.  While the movie is always entertaining, it nevertheless shows the effects on kids and families of life at home during a war: the separations, the losses, the physical damage, the inflammation of aggressive impulses in normal kids, the loosening of parental control over adolescents, the dropping of the curtains we use to keep kids from seeing more than they ought to. The film is wonderfully English, with customary attention to period detail, and a great collection of eccentric and memorable secondary characters. You've just got to see the geography lesson, featuring a middle-aged martinet school-marm who whacks away at a world map, using her pointer to punctuate her lesson on the vastness of England's pre-war empire.  I have seen this movie on video, and can say that it translates well to the small screen. In fact it was created for British TV.  See it. You'll laugh. You'll cry. And don't tell anyone--You'll learn something, too.","user":"Cecil-B","rank":[33,38]}]