[{"title":"very British, very arch, very enjoyable","rating":7,"date":"14 April 2000","review":"This delightful film's script is a descendant of the sort of archly witty portrayals of British upper-class life that came from the pens of Somerset Maugham and Noel Coward (one of whose songs serves as musical lead-in, and at least one of whose tunes [\"Mad About the Boy\" - listen for it] serves as background music to comment on the action). The atmosphere of this sort of comedy may be a bit foreign to American tastes (the whole topic of infidelity is discussed in such a civilized and gentlemanly fashion among the parties- Stiff Upper Lip and all that -  where Americans would be screaming at each other and going for weaponry) but as a devotee of British drama I enjoyed the movie hugely. It's a stellar cast - everyone shines, right down to Moray Watson in the small but delicious part of the befuddled butler Sellers. Jean Simmons is especially enjoyable in her out-of-character portrayal as the  outspokenly vampish Hattie. Despite opinions below to the contrary, the incomparable Cary Grant fills the part of this down-at-the-heels English Lord like old brandy fills a crystal decanter. The sumptuous setting of the baronial manor and the high production values make the film beautiful to look at, to boot. (The fact that the unfortunate Lord is forced to open his manor to paying visitors to support his lifestyle is based on the historical truth of the confiscatory tax policies imposed on the British hereditary gentry by post-WWII Labor governments; everyone is entitled to their own opinions on these policies, but be assured the film makes no political comment). <br><br>It does stretch the imagination a tad that Victor could treat the whole issue of his wife's infidelity - going on right in front of his nose - in such a dispassionate manner, but that is a characteristic of this genre. Further, Grant manages to convince us that, beneath his outer imperturability, his wife's disloyalty has pained him deeply and he could not stand to lose her. <br><br>This is a not-well-known film whose appeal might be a bit specialized, but I think it's a minor gem. And I could not omit mentioning the charming opening credits with their bevy of delightfully cavorting babies.","user":"rupie","rank":[32,35]},{"title":"Cast Sparkles","rating":8,"date":"1 December 2002","review":"Drawing room comedies seem to be a thing of the past.  Their demise was apparently one reason Cary Grant decided to thin down his late career: his kind of parts just weren't being written anymore. <br><br>By the time this film version of a stage hit came out in 1960, the genre had just about run its course. <br><br>How fortunate to have four full-fledged stars take on the leading roles. What is Robert Mitchum doing in an English castle, interacting with \"upper class royalty\"?  <br><br>For one thing, he plays a Texas millionaire--an impressive entree most places.  Then, the rest of the cast are all transported Brits, so long established in America as to be de facto Americans. They can still deliver their clipped English lines, thought, with great flair.<br><br>(\"So, now you're a millionare, and I'm growing mushrooms . . . oh well, that's the way the world wags.\")<br><br>Deborah Kerr is bright and vulnerable, Jean Simmons, pert and sophisticated, Robert Mitchum, cool and crafty, and Cary Grant urbane and witty.   It's fun to see this quartet trading double entendres and quaint quips. <br><br>\nStanley Donnen does his best with a stagy script, relying on his experienced cast to carry off the humor and action. It succeeds nicely, and its downright fun to follow their stylish jousts.<br><br>Tea, brandy, or champagne?","user":"harry-76","rank":[30,33]},{"title":"Bad title, good movie","rating":8,"date":"20 June 2004","review":"Although I'm a film buff, I was unaware of the existence this delightful,sophisticated comedy until I saw it recently on TV in Buenos Aires, of all places. Grant, Kerr and Simmons are splendid, as usual, and Mitchum is, well, Mitchum and that's good enough for me. The plot offers the conceit of Mitchum taking Kerr away from Grant, her fusty husband, because Mitch is hot and Grant's not, a rather daring concept for 1960. Grant, of course, has a trick or two up his sleeve and alls well that ends well. The witty dialogue and snappy direction (Stanley Donen) puts to shame the witless, charmless crap churned out by Hollywood hacks for the past 25","user":"gilgeoIII","rank":[29,34]}]