[{"title":"Christopher Lee smiling tenderly?!?","rating":8,"date":"18 February 2007","review":"Very nice and quite original adaptation of this often (ab)used material. This is probably the only version where Hyde is actually more handsome, social and sexy - even in a sort of school-boyish way to begin with - than Jekyll, who is a total wet blanket. There is indeed one of the sexiest performances by Christopher Lee in the film. I'm very happy he isn't in the lead role - I suggest he would have been directed to be his usual grim and menacing self again. Instead of that we get a smiling, easy-going Lee, dripping with wicked charm and sexuality. There aren't many available films to see him still under 40, so if you are a fan of his, I suggest you check this one out. Sure, it tends to be a bit melodramatic, but fortunately everyone around the poor, misunderstood Jekyll is so delightfully evil - his double-crossing wife, and double double-crossing friend - that the dramatic outbursts are nicely suppressed. Also, you get a very intimate close up at the holiest of holies of a scantily dressed snake charmer, and we get the \"b\"-word loud and clear - rather nice for 1960. Nice sets, nice Victorian frolics, very good looking cast, and generally a more fun version of the book than we usually get. I only have a strange looking pan and scan bootleg version of this film, which obviously was shot in widescreen. Typical vibrant colours of the period, good score and expert direction plus mostly proper British accent from everyone in the cast. I'm very glad I stumbled upon this film, and should I ever see a legitimate widescreen version released, I'd snatch it without a second thought. I'm rich, you see.","user":"mart-45","rank":[37,40]},{"title":"Truly original and underrated take on the classic story","rating":7,"date":"16 May 2009","review":"In the 1870's London, the middle-aged Dr. Henry Jekyll lives a reclusive life with his young wife Kitty. Jekyll has given up lecturing in Universities and dedicates his time for charity works and his personal research in his private lab. He completely neglects his wife Kitty, who has started an affair with Jekyll's friend Paul Allen, who also spends Jekyll's money on his gambling debts. One night, Jekyll tests a drug he has invented to separate the good and evil in man, on himself. As a result he becomes young and handsome Edward Hyde, who soon begins his mission of not only to destroy Kitty and Paul, but Jekyll as well. <br><br>Terence Fisher's film \"The Two Faces of Dr. Jekyll\" is one of the most original and underrated adaptations of Robert Louis Stevenson's classic \"The Strange Case of Dr. Jekyll and Mr. Hyde\". Since the three most well known movie versions of Jekyll &amp; Hyde before this (1920 silent film with John Barrymore, 1931 classic with Frederic March and 1941 remake with Spencer Tracy) all repeated similar plot pattern, the Hammer Films wanted to give something different. <br><br>Like with Hammer's other adaptations of classic horror stories, the film only keeps the essential backbone of the original story and changes all else. Unlike in the three previous movies where Jekyll was presented as a young handsome and likable man and Hyde as evil looking ugly monster, here Jekyll is middle-aged bearded and very cold and harsh towards others. Hyde on the other hand is smooth, handsome player who gets everyone to like him like that. However, he is no less evil then other versions of Hyde. This time Hyde doesn't use Jekyll as a hiding place to escape to, but he puts the blame of his crimes on Jekyll. Nasty piece of work. <br><br>The film has been much underrated because it doesn't have the same kind of Hammer horror feel to it. But Fisher and others are not even trying to make this same kind of shocking horror film as their previous works \"The Curse of Frankenstein\", \"Horror of Dracula\" and \"The Mummy\" are. Instead Fisher and screenwriter Wolf Mankowitz are telling a tragedy of how one man's quest for knowledge ultimately destroys everything and everyone around him. The makers are more interested in showing the duality of Victorian era, where people were respectable during the day and transformed during the night. Jekyll in the movie is just the only one who does it literally. <br><br>The role of Jekyll/Hyde was originally meant for Christopher Lee, but not wanting to be type casted as the monster, since he had already played Frankenstein's creature, Count Dracula and the Mummy, Lee was casted as Paul Allen instead. Obviously glad to play different kind of part, Lee delivers one of his best Hammer performances as the suave and unreliable gambler. Lee played Jekyll and Hyde later in a movie called \"I, Monster\" from 1971, which follows Stevenson's book more faithfully than this one. <br><br>In the role of Jekyll/Hyde, Paul Massie is really underrated. Sure, I could name half a dozen other actors who have played the part better. But Massie is one of the few actors, along with Frederic March and Jack Palance, who managed to make both Henry Jekyll and Edward Hyde interesting characters. Most actors I've found are rather boring when playing Jekyll, only coming to life when changing to Hyde. In the role of Jekyll's cheating wife Kitty, Dawn Addams is not just a candy to the eyes, she really fits the part perfectly and is one of the few Hammer leading ladies with some other talent than just their looks. In minor roles you can see Norma Marla and her very erotic snake dance, as well as young Oliver Reed in one of his earliest movie roles. <br><br>All in all, \"The Two Faces of Dr. Jekyll\" is a forgotten gem, an enjoyable film from Hammer's highlight era, as long as you keep open mind and not expect gallons of blood.","user":"kriitikko","rank":[21,24]},{"title":"A good Hammer Studios film.","rating":8,"date":"9 September 1999","review":"A good Hammer Film.  The plot is  keeping with in the Jekyll-Hyde story. Christopher Lee is in it, and so is sexy Dawn Adams.  The snake dancer in the night club  is one of the best I have ever watched!  I was watching a documentary on the history of Hammer Films, and one of the producers said this film was not well recieved, for a B- Horror Movie I strongley dissagree.","user":"davey-30","rank":[23,30]}]