[{"title":"The glorious return of juvenile delinquency!","rating":6,"date":"4 June 2009","review":"\"Porky's II: The Next Day\" was a weak and frustratingly tame movie that couldn't hold a candle to the wayward original; which I personally consider to be a classic in its own specific league. One of the – admittedly many – reasons of failure was the absence of the titular redneck character who was more or less profiled as the teen protagonists' arch enemy in the first film. Porky Wallace (glorious role of the late Chuck Mitchell) was a fat and sleazy night club owner from a neighboring county who humiliated and deceived the oversexed high school teenagers and prevented them from getting laid in his club. This led to fantastically comical and vulgar situations, but the first sequel skipped all this in favor of politically correct humor and ethically valuable morals. Well, just like the producers of \"Halloween\" found out after the disastrous third installment  every franchise also partly relies on a solid villainous character. The input of Porky's character in this third and final movie isn't exactly tremendous, but it definitely helps. The jokes and absurd situations are also a lot funnier again (albeit not nearly as funny as in the original) because they all revolve on raging hormones, bizarre sexual fetishes, embarrassing encounters and plain juvenile delinquency! Few weeks before graduating high school (about time, as they all appear to be in their mid-twenties), the cheerful posse has the chance of realizing their biggest dream: winning the state championship in basketball. They face a big – literally – obstacle when it turns out their beloved coach has unsettled debts with Porky, who now owns a luxurious casino boat. The only way out is for the team to lose the finale and have Porky cash in the betting money, but their mind is too strongly set on winning This is good old-fashioned and textbook 80's comedy, meaning relaxing and utterly brainless. Ideal stuff to re-watch after all these years and revive the spirit of 80's trash.","user":"Coventry","rank":[7,7]},{"title":"Wraps it up","rating":5,"date":"27 May 2009","review":"The last part of the epic \"Porky's\"-trilogy is undeniably the weakest, mainly because it feels so straight to video. The production often seems lazy and cheap, and the director didn't exactly work overtime ever. Basketball has never looked this lackluster. The screenwriter tries his best to copy the style of the original, but the way things are directed makes the raunch look nasty rather than funny. The scene with Tommy and Balbricker, presumably one of the most hilarious scenes in the movie, just kinda made me ashamed for watching this. Has it come to this, I wondered, as Balbricker attempted to pull down his underwear for minutes straight. The only redeeming factor left are the actors, that surprisingly still look like they want to be there. Pee Wee is always entertaining, even if he doesn't get to do much. It's still Pee Wee. I also appreciate that Porky is back for the occasion, even though his evil plan makes little sense. And why is he telling people about it? That's just asking to be stopped. Either way, this is not too bad for a second sequel, but it's just so clearly not by the original makers.","user":"Sandcooler","rank":[3,3]},{"title":"It lacks...","rating":26,"date":"26 May 2003","review":"Seeing as how Bob Clark didn't participate in this movie, it doesn't surprise me that the final movie in the Porky's trilogy lacked the energy that made the first two so funny. The events leading up to the revenge just seemed so unnecessary. Ultimately, this so-called revenge seemed more like another attempt to make Porky's life miserable. This was an inglorious way to end the series which (when it first started) was the first important teen movie of the 80s before we were subjected to the legacy of John Hughes and the Brat Pack.","user":"Zalman666","rank":[8,11]}]