[{"title":"Channey Jr.'s first appearance as the gauzed menace!","rating":6,"date":"6 December 1998","review":"Fun, typical Universal\"B\".. In what must've amounted to a cost-cutting measure, over 10 min. of the film's 60 min. running time, is made up of scenes from 1940's The Mummy's Hand\"!! This flick would mark Chaney's first of 3 appearances as Kharis. Look for Glenn Strange[Frankenstein's Monster from '44-'48]in an unbilled \"bit\" as a farmer calming a horse, during the Mummy's first attack sequence.","user":"dangie","rank":[20,21]},{"title":"The Mummy's Tomb: Passable sequel","rating":5,"date":"15 May 2018","review":"The Mummy's Tomb is the 2nd part of the original \"The Mummy\" franchise following on from The Mummy's Hand (1940).<br><br>It's set 30 years after the events of the first film and the mummy has returned under new guidance, this time to kill off all surviving members of the Banning family who were responsible for foiling the evil plans in the first movie.<br><br>This time there is no comedy, the entire tone of the movie is considerably darker!<br><br>For this reason it doesn't have the same charm as the first movie but it makes up for this with better cinematography and continues the story perfectly.<br><br>It does suffer all the tropes of movies of this era (And there are many) but it could have been considerably worse. For fans of classic horror cinema this is a watchable continuation of the franchise.<br><br>The Good:<br><br>Looks better than the first part<br><br>Follows on very well<br><br>The Bad:<br><br>Remaking scenes from the earlier film is a tad silly<br><br>Very cliched<br><br>Things I Learnt From This Movie:<br><br>Mummys are excellent climbers<br><br>If in doubt, cry witch!<br><br>Playing dead works against Mummys","user":"Platypuschow","rank":[12,12]},{"title":"a slight step down in quality but still wonderful fun","rating":7,"date":"30 March 2006","review":"Okay, so this is pretty familiar stuff once again--you know, mad Egyptian cult leader and his resurrection of a mummy to exact revenge on those who have desecrated ancient tombs. About the only big differences here are having Lon Chaney, Jr. play the mummy for the first time and the action is moved to America (despite this making little sense). While this is far from the best mummy film, it is good old fashioned fun and I enjoy this much more than the overly special effects enhanced mummy films of the last decade because of the fun factor. The campiness and the whole ambiance are just so wonderful--and they remind you that the term \"B-movie\" isn't such a bad thing. Watch it and let yourself go--and have FUN!","user":"MartinHafer","rank":[31,37]}]