[{"title":"Davis & Merrill Duo Star in their Own Home","rating":10,"date":"26 January 2008","review":"It's fascinating to watch the wife and husband duo go at each other playing anything but a loving married couple. What makes this, of all of Bette Davis' movies rich is that the set is her own home; and, what a place it is. Not a palace, but a very British type of country home.<br><br>Davis' &amp; Merrill's acting is superb; the plot is thick; the script worthy of Davis' fantastic articulation &amp; conveyance of attitudes contrary enough to part the Red Sea.<br><br>Everyone's got their favorite Bette Davis film, if they're a fan of the US classics from Warner Bros.. Mine is this \"Poison...,\" because it's the 4th time the dynamic duo act together but the first time they both have leading roles; it's filmed in their own home which reveals so much about Davis' tastes &amp; I could feel her comfort with the set; the mystery.crime.drama is unsettling; and to the end, I watched wondering how Davis would get out of the ugly situation in which Merrill's held her.<br><br>There's something very different about this movie because Davis put on the production herself outside of a domineering studio. Considering the year &amp; women's social inferiority in the workplace, even in Hollywood, it's remarkable that Davis pulled \"Poison...\" off so well.","user":"mdg55","rank":[46,55]},{"title":"Recommend for tight structure","rating":7,"date":"5 February 2006","review":"I appreciate this terse movie's smart script, staging, and tight editing, especially upon second viewing. Of course the nosy neighbor veterinarian serves mainly as a plot vehicle, but the role is well acted. Gary Merrill's George Bates seems lacking some refinement of expression. He plays it like an open book, and makes Bates a totally sympathetic character. The story hinges on the power plays between Bates and devious Janet as, chained together by their crimes, they struggle for the upper hand via her scheming and his brute force. Their tortured relationship could have a plausible chance for success, given the plot circumstances, but the secretary's fiancé Larry is in the way, creating a tension that draws the characters to the unhappy climax. Davis is in good form, and this is an entertaining film. <br><br>Since there is a finite number of Bette Davis films available for viewing in 2006, one has to value each for what it is. Although \"Poison\" may not be in her top 10, Davis is the master, and it is infinitely preferable to experience it than not.","user":"Builders","rank":[30,35]},{"title":"Bette in \"Eve\" mode; great setting; fun movie!","rating":21,"date":"21 September 2004","review":"Okay, it's not an Oscar-winner, but this movie is a lot of fun, especially if you're a Bette Davis fan. The setting, a spooky, isolated British mansion, is strongly portrayed; by the end, you really feel like you've spent time some time within the oak-paneled walls. Bette looks just like she did in \"All About Eve\" -- same hairstyle and similar wardrobe, so it's easy to imagine that this could have been a Margo Channing movie. And of course her costar is Garry Merrill, with whom she also starred in \"Eve.\" This was adapted from a stage play, so I think it's interesting to pay attention to the structure and limited changes of location, which are an indicator of its stage pedigree. This one shows up on TCM once in a while; sit back and enjoy.","user":"CraigHamrick","rank":[23,27]}]