[{"title":"Monsieur Hulot's transition into the modern world","rating":7,"date":"7 January 2007","review":"The issue of viewing a film in the right format has seldom been more pressing than with this film. Although I've only seen it on DVD, it shows immediately that it's best seen in the original 70mm format on the biggest screen possible, because of the numerous subtle sight gags on screen, that go largely unnoticed when watching it on a regular TV-set. A treatment equally essential for films like \"2001: A Space Odyssey\" or \"Lawrence of Arabia\". Unless living in London, Paris, New York, or a few other places, chances of seeing this in the proper way in the foreseeable future are slim for most of us, so one has to cope with whatever is available.<br><br>At the time, \"Play Time\" was the most expensive French film ever made. Tati built an enormous set outside Paris, that included an airline terminal, city streets, high rise buildings and traffic circles, that was soon dubbed \"Tativille\". Three years in the making, experiencing numerous setbacks and financial difficulties and combined with Tati's perfectionist way of filming, the project could only have been saved - financially that is - if the film was an enormous success. It wasn't and \"Play Time\" bankrupted Tati, forcing him to sell the rights of all his films for little more than a fee. <br><br>Tati shot the entire film in medium-long and long shots, not one close-up. The result is a bewildering pastiche of people on their daily do-abouts in modern Paris (the old Paris, like the Eiffel Tower, is only seen through reflections in the glass facades) amidst flickering neon signs, voices through intercoms, buzzers, and through all this, Monsieur Hulot tries to find his way while stumbling across the urban frenzy surrounding him. The film is virtually dialog-free, and mainly serves as background noise. When watching a film by Tati, you expect Monsieur Hulot. Well, he is present in almost every frame, but he is nothing close to a real character, which is probably one of the reasons audiences didn't connect with the film. On an another level, the sight and sound gags abound. It's not particularly funny in a laugh-out-loud sense, but each viewing seems to reveal a new unseen joke or small detail, a funny sign or a person in the background, not seen before. Most of the gags only work because they are part of a carefully orchestrated ensemble. At the core, the kind of humor is the same as in \"Les vacances de Monsieur Hulot\" or \"Mon Oncle\", but here, the jokes are more subtle. It's an enormous canvas where there's so much going on, it's fascinating to look at, but can be a bit tiring after a while. However, the long party scene at the restaurant, when the crowds befall in a collective euphoria, is priceless. <br><br>I think for most people, it's all a little too much upon first viewing and in many ways it remains a bit of a folly, a director gone mad in making a film no audience was ripe for at the time, and perhaps never will be. Assesing this film by some of the more conventional qualities one can look for in a film is not a very useful approach in case of this film. Tati certainly made something completely unique. If anything, a work of art that poses more than a few challenges.<br><br>Camera Obscura --- 9/10","user":"Camera-Obscura","rank":[83,91]},{"title":"In the tradition of silent comedy","rating":9,"date":"2 September 2004","review":"This is the first Tati film I've seen, but I've heard quite a lot about him. I saw the 70mm reprint with high expectations and was not disappointed.<br><br>This is a movie that leads the viewer where it feels like going. It has it's own rhythm and path. Just as circumstance beyond Mr. Hulot's control takes him wherever he may go, the camera seems to follow the same kind of path. The viewer doesn't know where it's going, and the viewer doesn't know where exactly it wants to go. The great thing about this movie is that it doesn't follow Mr. Hulot exclusively. The camera behaves the same way without needing to follow Mr. Hulot. He moves where he goes, the tour group moves where they go, and the camera moves where it may go. The world around them and the viewer dicates it in the most unconscious kind of way.<br><br>The first part of the movie is a satire on the inhuman world we've built around us. Mr. Hulot tries to navigate it, but the world won't sit still. Everything moves around without him and he can't find anything. Just like he is moved around, so is the object of his desire, whatever it may be at the moment. But Mr. Hulot doesn't mind, he goes along with it and enjoys it all the way, just like the viewer.<br><br>In another Tati movie, Mr. Hulot's Vacation, there is a scene where he's resting on a beach, and his drink floats away with a wave and floats back just as he reaches for it. That's how this movie is. Everything might not exactly go as people hope or plan, but it goes it's own way. Not everything goes as planned, but Mr. Hulot accepts it and so does the viewer. Rather than fight the world around him and force it to do what it wants, he takes joy in looking around and enjoying the ride, and what makes the movie so great is that so does the viewer. You might not know where things are going, but they do what they will and you enjoy watching things unfold.","user":"diversitycommittee","rank":[48,59]},{"title":"It's Tati's World. We're just living in it.","rating":10,"date":"23 November 1998","review":"I comment 2 years after seeing \"Playtime\" at the Art Institute of Chicago, an event in which the film was presented in its original 70mm format for the first time since its debut. Over the years it had been cropped and recropped for standard prints and video leaving little of the original magic, which is the sheer SCOPE of this visual marvel.<br><br>Absolutely amazing sells \"Play\" short. The picture was so clear and the sequences so thrilling that I dare say this is Tati's Masterpiece. Apparently, he created an entire 1/5th scale city outside Paris and shot over the course of three years to get this honey in the can, and man-o-man, does it show.<br><br>This is the kind of film that reminds a viewer just how standardized modern cinematic narrative has become. Tati exists in an alternate plane of recorded consciousness; I walked out of \"Play\" as if hallucinating, having fully entered his perspective and adopted his suggestions as my own.<br><br>This is a film in balance with the nature of cinema itself; if Frank Lloyd Wright was a director, Tati would be his disciple: Tati's cinematic interpretations are in natural proportion to the distinctive elements of film. Visual dominance, sound hyperbarically in support of the image rhythm, help me I'm hallucinating again-thanks Jaques...<br><br>Don't miss this one, but don't see it in any other format than a special 70mm screening. Somebody put a screening together!!!","user":"UltraMagic","rank":[65,83]}]