[{"title":"Shocking Red December","rating":10,"date":"13 October 2007","review":"The Italian title of this Nicolas Roeg's classic is \"A Venetian Shocking Red December\" yep. I had seen this film dubbed into Italian, years ago. I was taken by the look and the atmosphere I remember being unnerved but I was appalled by the acting, specially Julie Christie's - one of my favorites of all time. Yesterday I saw the film again in its original English version. My goodness, what a difference! The film is even more frightening that I remembered. The atmosphere is asphyxiating. You can actually smell the rotting stench of the most beautiful city in the world. The ending leaves you breathless and the acting, well, listening to the actors real voices is another experience altogether. The pain and sudden burst of hope in Julie Christie is moving, very moving and very unsettling. Sutherland, as usual, is magnificent. The film, other than a solid cult status, remains virtually unknown by the public at large. \"Don't Look Now\" is a buried treasure that is bound to be re discovered and to all my countrymen, a piece of advise: avoid dubbed movies at all cost.","user":"primodanielelori","rank":[133,176]},{"title":"A Venice Of Horrors","rating":10,"date":"4 May 2017","review":"When a great artist, and a great artist is what Nicolas Roeg is, tells us a tale of horrors, the results are, usually, unique, overwhelming, unforgettable. \"Don't Look Now\" redefines the genre. I was paralyzed by fear and totally involved in the bizarre predicament of the protagonists. Donald Sutherland and Julie Christie are remarkable. A married couple enveloped in the unspeakable sadness provoked by the loss of their young daughter. Then, in Venice, among the rot, the beauty and the darkness, a ray of light. But this is not the kind of light that lets you see, no, this light is terrifying because it will persuade you to follow it. I've seen the film 9 hours ago and it's still with me...I can smell the stench of the most beautiful city in the world and I close my eyes, hoping that it's just a dream. \"Don't Look Now\" is a masterpiece.","user":"mrharrypaulson","rank":[53,68]},{"title":"Chilling and mysterious","rating":9,"date":"4 January 2005","review":"There are two types of horror films, really. There are popcorn horror films, good for a cheap in-the-moment thrill at best, and there are serious horror films, movies that linger in the mind and in the bones. I have just watched Nicolas Roeg's 'Don't Look Now' and my spine is frozen. It's 4am, I'm alone, and I have a heightened awareness of sounds and sights I usually don't notice.<br><br>Here is a movie that's both resolved and unresolved, ultimately growing more ambiguous as it progresses and becomes more complex. After it is over and has become a complete(d) work to the eye of the viewer, the lasting impression is that of mystery. Too many films in this genre bark up the wrong tree, working to explain all of the events that unfold. By explaining nothing, by being almost abstract, questions and images will haunt the viewer indefinitely. It is what it is, and while this movie can be watched over and over, and the events that occur can be anticipated, they will forever remain an enigma. This is true cinema, purely visual and aural, without the helpful but ultimately self-defeating aid of a proxy observer; the viewer is the direct observer, and there's no filter through which the events and images develop any sort of tidy rationality.<br><br>Donald Sutherland's performance here is sober, adult, the grief of his character palpable. And in the face of this grief is a force that runs through the movie like a dark current, evoking the eternal and spookily ethereal and subterranean; less an eternity of the heavens than the eternity of a crypt. Venice is not merely the ideal location for this story, but the necessary location; it could not take place anywhere else. The unquestionable, and indeed imposing, Gothic majesty of the churches, whose interior height dwarfs their human occupants with the spiritual dread of the ancient, overlooks the canals of Venice like the wicked-faced stone gargoyles Sutherland finds himself physically embracing, while the canals that run through the city are literally the ghost of this couple's personal tragedy. Living in Venice, in light of the details surrounding their loss, seems almost a perverse choice, perhaps a masochistic one; they could be punishing themselves for their daughter's drowning by living in a flooded city.<br><br>It's not that Sutherland's character is a rational man in an irrational environment, but rather a rational man in an environment whose own secret code, which one may trust makes perfect sense to itself (like a tree in the forest that will only fall if no one is around to hear), is inaccessible and inexplicable to him, baring itself only in fragments in a way he chooses to ignore, just as you might ignore a spectral voice in the dead of night, dismissing it as a product of your imagination.<br><br>The movie's notorious love scene is jarringly explicit, yet rather than erotic, it is profoundly sad, and takes on a deeper (even creepy) resonance after the film ends. That the scene is intercut with scenes of Sutherland and Julie Christie dressing prevents the two from ever being completely naked and united; this editing choice changes the dimensions of the love scene in a way that I've never seen attempted elsewhere. At other points, Roeg inserts moments and images that carry sinister implications, none of which are ever concretely substantiated and only leave the viewer with more questions.<br><br>The film drifts along at a wandering pace. The final twenty minutes are among the most atmospheric and suspenseful twenty minutes in any film, culminating in a montage that is absolutely chilling.<br><br>'The Blair Witch Project,' made over two decades later and probably influenced by this, has similar aspirations, but finally has only a fraction of the emotional gravity.","user":"MichaelCarmichaelsCar","rank":[167,241]}]