[{"title":"Honeymoon in Hungary","rating":9,"date":"14 August 2001","review":"\"The Black Cat\" (Universal, 1934), directed by Edgar G. Ulmer, marks the first scream, or should I say, screen teaming of Boris (\"Frankenstein\") Karloff, billed in the credits only as KARLOFF, and Bela (\"Dracula\") Lugosi.<br><br>Suggested on the immortal story by Edgar Allan Poe, the plot, compliments of screenwriter Paul Ruric, set in Hungary, gets right down to business with Doctor Vitus Werdegast (Bela Lugosi) returning home by train after serving 15 long years in a military prison. He finds himself sharing a compartment with mystery writer Peter Allison (David Manners) and his wife, Joan (Jacqueline Wells), on their honeymoon. Vitus introduces himself to the Allisons, talks about himself and of his mission to visit a \"very old friend.\" The couple later accompany Werdegast on a bus to their destination, which meets with an accident during a rainstorm, killing the driver. Vitus accompanies Peter by taking the injured Joan through the rain and winds until they reach the home of Hjalmar Poelzig (KARLOFF), an architect of his futuristic mansion. As Vitus treats the unconscious Joan, Hjalmar, who makes his grand entrance, immediately takes notice on the young girl with intentions that are not too honorable. As the story progresses, the viewer learns that Vitus had been betrayed by Hjalmar during the World War and left to die at a military prison, and for this, Vitus, who survived those long dark years, returns to seek revenge, but first must learn what has happened to his wife and daughter. Peter and Joan become house guests in the home of Poelzig, unaware that they are his prisoners, with Poelzig, who holds Black Masses in a devil's cult ceremony, intending on using Joan as his next subject and hold Peter in a dungeon below. Besides trying to learn the whereabouts of his wife and daughter, Vitus tries to set Joan free by playing a game of chess, or a \"game of death,\" with Hjalmar. Tension builds up to a very suspenseful climax not to be missed.<br><br>What does this have to do with a black cat? Well, Vitus fears cats and finds himself being confronted with one in two separate scenes, compliments of Hjalmar, who has cats roaming about. Karloff and Lugosi are evenly matched here, and as bitter enemies, they must present themselves in a \"gentlemanly manner\" whenever confronted by the young guest or guests. Also presented in the cast are Lucille Lund as Karen Poelzig; the evil looking Harry Cording as Thalmar, Hjalmar's servant; and John Carradine as one of the members of the cult during the Black Mass sequence.<br><br>Although produced in Hollywood, \"The Black Cat\" looks very much like a European production with futuristic sets which features a digital clock, etc. Karloff, dressed in black garments with a feline haircut, is very creepy, especially using gestures with his evil eyes (which do everything but glow in the dark!); Lugosi, in a rare sympathetic role, is actually the stronger character, giving one of his best performances in his career, next to \"Dracula\" (1931). Fortunately, \"The Black Cat\" was released shortly before the Production Code took effect, otherwise the horror drama, with many scenes quite questionable then and now, would never have reached the theaters unless severely edited to a point of confusion. Chances are the movie itself was edited prior to release, but at 66 minutes, it's tight and fast-paced, never a dull moment. A big plus in this production is the underscoring montage of classical compositions by various composers, lavish sets and the teaming of two horror greats, Karloff and Lugosi.<br><br>Aside from Fright Nights on commercial television back in the 1960s and 70s, \"The Black Cat\" formerly played on the Sci-Fi Channel in the 1990s, and later on American Movie Classics from 2000 to 2001. To date, \"The Black Cat\" can be seen on Turner Classic Movies where it premiered on January 24, 2003, becoming one of this cable channel's most revived horror films. Probably by request. \"The Black Cat\" is also available on video cassette either as part of the double feature along with \"The Raven\" (1935), another Karloff and Lugosi thriller, or as a solo package. A gem for fans of this genre. (***)","user":"lugonian","rank":[35,35]},{"title":"More Enjoyable Than It Has Any Business Being","rating":14,"date":"14 July 2004","review":"Other commentaries will fill you in on the nearly-incomprehensible plot (if that's possible) but, as has been pointed out, you don't watch a film like this for plot.<br><br>Despite the story inconsistencies and implausibilities, everything here just seems to \"jell:\" the fabulous sets, elegant photography, evocative music (drawing heavily from Schubert, among others) and the downright creepy atmosphere woven from the themes of jealousy, lust, revenge, murder, sadism.....all sounds delightfully sick, doesn't it? Truly, it's nowhere near as threatening as it sounds; indeed, if Astaire and Rogers had ever made a spooky thriller, it might have looked and felt something like this one. THE BLACK CAT possesses a lyrical, rhythmic quality, upon which we drift through a sleek, ultra-modern nightmare world.<br><br>One of the reasons it all works is its ability to pull us into a sort of parallel universe which, though it looks more or less like reality as we know it, glides along on a barely-concealed undercurrent - an \"atmosphere of death,\" as Lugosi's character puts it - where things happen that \"could never actually happen\" (an inside reference for those who know the film).<br><br>There are some wonderful set-pieces, such as Karloff's tour through a most unusual basement mausoleum/museum memorializing all of his dearly departed earlier \"wives.\" And of course, Boris and Bela deliver, with their restrained but full-bodied performances. Karloff conveys menace just entering a room, and Lugosi has an all-too-rare opportunity to display some tenderness; notice the single tear that rolls down his face as he learns - and sees - what became of the wife that Karloff stole from him years before. <br><br>A very stylized - and stylish - film which grants us the unusual treat of seeing Lugosi play a (more or less) \"good guy,\" and the unique one of hearing him pronounce the word \"baloney,\" as only he could.","user":"Doghouse-6","rank":[53,55]},{"title":"Karloff & Lugosi together for the first time","rating":10,"date":"10 August 2002","review":"THE BLACK CAT (1934) Starring Boris Karloff, Bela Lugosi, David Manners, Julie Bishop Directed by Edgar Ulmer<br><br>The first film to feature both Boris Karloff and Bela Lugosi, THE BLACK CAT was, and remains, innovative and strange.  The opening credits claim the film was \"suggested by\" the Edgar Alan Poe story, but other than the title there is absolutely no connection.<br><br>Lugosi gets to play a good guy for a change and he handles it very well. In fact, I might venture to say that the role of Dr. Vitus Werdegast is Lugosi's finest performance, perhaps because it is so much of a departure from the role of Dracula.  Karloff plays Hjalmar Poelzig, a Satanic architect with a really freaky hairdo.  David Manners and Julie Bishop portray the Allisons, an American couple honeymooning in Hungary (doesn't everyone?).<br><br>The real star of this film, though, is the house.  What an incredible set! The house, designed and built by Poelzig on the ruins of a WWI fort where thousands of soldiers are entombed, is an architectural marvel, even by today's standards.  All glass and steel, the house consists of sharp angles that cast long, expressionistic shadows, which gives the film its extremely creepy atmosphere.<br><br>Werdegast (Lugosi) meets the Allisons on a train and later shares a cab with them.  As they drive through a storm, he explains that he is going to visit an old friend after having spent 15 years as a prisoner of war.  Not far from his friend's house the cab crashes, killing the driver and injuring Mrs. Allison.  They carry her to Werdegast's friend's house.  The friend, of course, is Poelzig (Karloff) and it soon becomes obvious that the term \"friend\" is applied very loosely.  In fact, the men have become enemies due to the fact that Poelzig betrayed Werdegast during the war, which led to his long imprisonment.  In the basement, Poelzig reunites Werdegast with his wife, now dead and whom Poelzig had married himself while Werdegast was in prison.  The freaky architect has been keeping her preserved in some sort of suspended animation type thing.  When Werdegast demands to know his daughter's whereabouts, Poelzig tells him that she, too, has died.<br><br>What follows is a bizarre tale of two men who are opposite sides of the coin.  They engage in a chess match (literally and figuratively) with the soul of the injured Mrs. Allison up for grabs.  THE BLACK CAT is incredibly creepy and has some real suspenseful moments.  It also has some very disturbing scenes, especially for a film made in 1934.  The scene of Karloff reciting the black mass in Latin is especially ominous.  One cannot, however, help noticing some gaping holes in the plot.  Dr. Werdegast is supposed to be Hungary's leading doctors, and yet he has just been released from 15 years of imprisonment.  Huh?  Also, there is a cruel scene where Lugosi's character kills a black cat (he has a phobia) and nobody seems to think anything about it...even though it appears to have been a pet in the household.  These minor points do not take away from the overall viewing experience, though.  THE BLACK CAT still looks great after all these years and it still has the ability to make you shudder.","user":"cdauten","rank":[39,41]}]