[{"title":"Atmospheric and Exciting","rating":9,"date":"3 June 2005","review":"Good film that combines action and psychology and film noir. Edward G. Robinson stars as Larson, the cruel captain of the Ghost, a ship no one wants to sail on. John Garfield and Ida Lupino are people running away from their pasts, and Alexander Knox is an unlucky writer. These three people end up on the Ghost through coincidence. Also onboard are Gene Lockhart as a boozy doctor and Barry Fitzgerald as a psychotic cook. All 5 stars are great in this neat little film that bears little resemblance to the Jack London novel, but who cares. Beautifully filmed with lots of fog and terrific closeups. Garfield and Lupino make a great couple and match each other angst for angst. Knox is best remembered for his starring role in Wilson but is very effective here as well. Robinson seemingly could play any role. He must stand as the most underrated actor of the 30s and 40s. Never Oscar nominated, Robinson nevertheless had a career that spanned decades and never gave a bad performance. The Sea Wolf is a definite nominee for anyone's \"must see\" list.","user":"drednm","rank":[58,61]},{"title":"Better to reign in Hell, than serve in Heaven","rating":9,"date":"7 February 2006","review":"Jack London's novels usually dealt with the interrelationship between man and nature. Herbert Spencer had corrupted and popularized the theories of Charles Darwin as \"the survival of the fittest,\" something Darwin never wrote and wouldn't have believed anyway. In London's best works Spencer's jargon is not promoted but rather utilized to discredit the doctrine which was being bastardized by the robber barons in the pre-Great Depression world of big business to justify their millions of largely untaxed loot. Not surprisingly London was a socialist. Power hungry, egotistical humans are depicted as animals whose characteristics they share. Wolf Larsen is not unlike a wolf who stalks his prey to devour it one piece at a time.<br><br>Though there are significant differences between the novel and the movie, \"The Sea Wolf\" remains true to form. London would have undoubtedly approved of the film version of perhaps his best work. Wolf Larsen who identifies with the master poet John Milton not just because Milton went blind in a similar way that Larsen was going blind but also because Satan in the serpent as described by Milton in \"Paradise Lost\" believes many notions that Larsen believes. That he underlines the famous passage, \"Better to reign in Hell, than serve in Heaven\" is indicative of how Larsen views himself. <br><br>The consummate actor Edward G. Robinson, who could play any role as if he were that particular character, breathes life into this very complex personality. Obviously Larsen has a conscience and is not totally corrupt and evil. During the famous, telling scene when Dr. Louis \"Louie\" J. Prescott played to perfection by Gene Lockhart is kicked down the stairs by Larsen just after the sea wolf has told the crew not to pick on him anymore, the viewer can tell by the look in Larsen's eyes and the expression on his face that he has a degree of remorse for what happens next. Satan in the serpent would not possess any remorse. The true embodiment of evil is the Igor-type creature everyone calls Cooky (Barry Fitzgerald, playing against type and giving perhaps the best performance of his career). Full of hate, insidiously mocking his crew mates and anyone else with whom he makes contact, this vile little man shows no redeeming qualities whatsoever. In some ways Larsen is actually jealous of Cooky for being more iniquitous than himself, hence why Larsen turns on him.<br><br>A major weakness is the somewhat frivolous romance between George Leach (John Garfield) and Ruth Brewster (Ida Lupino). Both fugitives, it is quite understandable how the two are attracted to each other but that the two would become so close so soon is highly unlikely. Garfield and the multi-talented Lupino were two of the best Thespians of their generation so expect standout performances by each. <br><br>A somewhat wild card in the acting department is Alexander Knox as the sensitive writer Humphrey Van Weyden. Later Knox would receive accolades playing President Woodrow Wilson. He does so well in this film the viewer wonders what would have happened had Knox not become overly identified as Wilson to the extent that he never again got a suitable role for his talents. London obviously split his personality when he wrote himself into \"The Sea Wolf.\" His literary side is represented by Humphrey, his adventurous romantic side by Leach.","user":"krorie","rank":[34,36]},{"title":"The best version of this old chestnut, despite plot changes.","rating":9,"date":"9 February 2003","review":"Jack London's novel \"The Sea Wolf\" is one of those old chestnuts that seemingly won't go away.  It has served as an subject for movies almost since they began being made, including Italian and Russian versions.  This 1941 Warner version remains the definitive screen adaptation, however, in spite of numerous alterations to the plot of the original novel.<br><br>In the book, Wolf Larson is a giant Norwegian sea captain who rules his ship by virtue of his strength and brutality.  He is the embodiment of the old joke which runs:  \"Yea though I walk through the valley of the shadow of death I shall fear no evil, because I am the meanest, toughest son of a b--- in the valley!\"  One would ordinarily think that the five foot six inches tall Edward G. Robinson would be a poor choice to play such a character. However, Robinson is a good enough actor, and a forceful enough screen personality, to carry it off.<br><br>John Garfield is equally perfect as a chip-on-the-shoulder working class seaman who dares to oppose Larson.  He's a perfect foil for Robinson, and it's great fun watching the two of them snarl at each other like a couple of wild dogs.  <br><br>Ida Lupino and Alexander Knox do some of their best work as the two castaways rescued by Larson's vessel.  Lupino plays a female ex-convict trying to conceal her past, and Knox is an effete writer whom Larson decides to educate in what he considers the ways of the real world.<br><br>Gene Lockhart and Barry Fitzgerald are equally good in supporting roles as the ship's drunken and degraded doctor, and the thoroughly corrupt cook.  It is particularly refreshing to see Fitzgerald play a really unpleasant character for a change, and one can only wonder why he didn't get more parts like this.  In The Sea Wolf, Fitzgerald plays an individual so slimy that one almost expects to see him leave a trail behind him, like a slug.<br><br>Director Michael Curtiz managed to impart a dank and foggy atmosphere to The Sea Wolf that seems to suit the story perfectly, and that feeling is enhanced by Erich Korngold's moody score.  The first view of the schooner \"Ghost\", looming out of the fog like a real ghost, is particularly memorable. <br><br>Granted, the ending differs radically from that of the book.  This film's ending seems rather more satisfying than London's was, however.  London was virtually forced to end the novel the way he did because it is presented in narrative form and the writer, Van Wyden, is the one actually telling the story.  Warner Brothers could change the ending because, as a movie, the story was no longer restricted to Van Wyden's point of view.","user":"robertguttman","rank":[30,32]}]