[{"title":"An Underrated Gem","rating":17,"date":"17 May 2000","review":"A truly wonderful underappreciated gem from the tail-end of the \"disaster\" films of the 1970s, that was also Charlton Heston's last film as an action lead.   What really makes \"Gray Lady Down\" a terrific film is that unlike the disaster films of the 90s (and some of the bad ones of the 70s), there is an air of believability to the whole thing.   We don't see anything extremely outlandish, and we don't see incredible death-defying feats by the leads who then improbably survive such endeavors.  Instead, we get a sense of how the real Navy might respond to a crisis like this and the end result proves to be quite gripping.<br><br>The cast is great, including Heston as the downed sub's captain, Stacy Keach (minus his usual hairpiece-a rarity) as the squadron commander, and surprisingly David Carradine who after all those years of \"Kung Fu\" shows that he can handle a different kind of role credibly.   Christopher Reeve has a bit part as an officer, and this helped bring him to the attention of the Salkinds when they were looking for candidates for \"Superman.\"  Fine score by Jerry Fielding too.","user":"Eric-62-2","rank":[34,38]},{"title":"Memories of the Thresher","rating":7,"date":"28 December 2007","review":"Gray Lady Down is one of the better Seventies disaster films and it's also one of the better films that Charlton Heston did in the later part of his career starting in the Seventies. Heston like so many other of the stars of the studio era was finding fewer and fewer decent film properties to do. This was one of his better choices.<br><br>Heston plays the skipper of a nuclear powered submarine which goes down in a collision. Things get further complicated when the 'gray lady' is buried partially in an undersea mudslide, blocking the escape hatch.<br><br>The Naval Rescue service is on the job however, but this will prove a difficult task.<br><br>The film is divided evenly between Heston and his crew as Heston tries to keep morale up that the survivors will be rescued and on the surface rescue vessel where a conflict between two captains hampers the rescue effort. Stacy Keach is the captain of the rescue vessel and his conflict is with Keith Carradine also of captain's rank who's developed a special undersea two man vessel that can scoop the dirt off the gray lady. <br><br>Special mention should go to Ronny Cox who is Heston's number two and also not really getting along with him, but who steps up to the plate in a most heroic fashion.<br><br>In 1978 when Gray Lady Down came out there were still memories of the submarine U.S.S. Thresher which went down in 1963 with all hands lost in one of the U.S. Navy's worst disasters at sea. A lot of what you see in this film was developed because of that tragedy.<br><br>Gray Lady Down is a no nonsense sea rescue film with the impossible situations that characterized a lot of the films of this type kept out of the story. It's one of the best and yet most unsung of the disaster films of the decade. Should be seen more often. Charlton Heston and the rest of the cast do a fine job on this film.","user":"bkoganbing","rank":[21,23]},{"title":"Good disaster movie with spectacular special effects as well as magnificent acting from Heston and Keach","rating":6,"date":"25 September 2010","review":"Nice underwater drama film based on a real-life incident about pitting man and machine . It deals with an US Navy atomic submarine (commanded by Charlton Heston on his final voyage and as second in command Ronnie Cox) that has accidentally collided with Norway freighter and goes down into deep . The movie concerns upon an American sub , the complications originated for a nuclear scape and fight against time . But the submarine, and its crew, are ill prepared for the challenges they will face . A two-man rescue operation by means of an experimental driving craft (captained by David Carradine and Ned Beatty) try to find the victims , as many sailors will have to sacrifice themselves to save life of crew members. And a greatest ship based in San Diego California with an expert crew of ¨Submarine Rescue Unity¨ heads the sinking location.<br><br>Runtime film is overlong , the flick is slow moving and a little boring , though a bit monotonous is quite interesting. Tense and exciting at times and climatic ending , but lot of minutes are superfluous ,it has half hour of excess, however the movie is enough agreeable.<br><br>The yarn is interesting and based on real deeds as submarine U.S.S. Thresher that sank in 1963 in one of the worst catastrophes at sea. There are suspense ,thriller and action, though the scenario is mostly developed into submarines.<br><br>Charlton Heston's performance as commandant is excellent, he hands perfectly the role , Heston has gotten the best character along with David Carradine as valiant skipper . Ronny Cox's acting as the contender official is first rate. Facing off between two commanders is top-notch . And large support cast as Stephen McHattie, Dorian Harewood, Charles Cioffi, Rosemary Forsyth and look for Christopher Reeve and Michael O'Keefe .<br><br>David Greene direction is fine and cinematography is atmospheric and colorful . Jerry Fielding music is spectacular and adjusted to film.<br><br>The movie will appeal to disaster genre enthusiasts and action lovers . Rating : 6,5 , better than average .","user":"ma-cortes","rank":[15,17]}]