[{"title":"Earth No More?","rating":8,"date":"8 November 2004","review":"Astronomers discover two planets coming Earth's way that will destroy our planet. Time is needed to do the unthinkable: create a rocket ship that will fly 40 or so people to one of the planets passing by to keep the legacy of mankind alive. This is an innovative, thought-provoking science fiction film. Little action is in the movie. It could have focused on the despair and panic people would have endured with such news, but instead the film, deftly directed by Rudolph Mate, focuses on the group of scientists and people involved trying desperately to fight against their greatest enemy - time. Calendars have pages ripped off showing the urgency. Sure, the science and logic in some of the physics of the ship are a bit ludicrous, but everything is presented in a very believable manner. Acting leads Richard Derr and Barbara Rush do workmanlike jobs while supporting players Larry Keating, Hayden Rourke, John Hoyt and Frank Cady(Sam Drucker from Green Acres) really give the film some life. Most importantly the film has you thinking about its premise well after having seen it. What would our world do with such news? How would we determine who would go? What would they find once they got there? Many scenes in the film stand out: the flooded vision of New York City with skyscraper tips jutting out of the water and the last scene of a group of space pilgrims landing on a new home for humankind surveying their new world with wide-eyed optimism, hope, and fascination. This is a sci-fi gem; one not to be missed.","user":"BaronBl00d","rank":[47,48]},{"title":"Money to burn!!!!","rating":8,"date":"1 March 2002","review":"This movie rocks!<br><br>Okay, I know it's dated.  know what??  I Don't care!  This kind of movie making would put half the people in Hollywood out of work today.  Maybe that's not such a bad thing.  They did it right in the early days.  They had their priorities right:<br><br>Story first<br><br>Then characters<br><br>Then Special effects<br><br>Seems simple, doesn't it?  How come they can't get it right today? (with few exceptions, of course).  Nope, today it's Special effects, stars, then story.... in fact, even the stories aren't original!!!<br><br>This sums up why I like this movie so much and many like it from the same era.  They're exciting, fun, and captivating.  The kind of movie that leaves you thinking, dreaming, having nightmares, all in the name of fun.  You're left dreaming of what it would be like,  how you'd react, what you'd do. You'd sit and ponder about a new life on a new planet.  And not once would the level of special effects tarnish your view of this gem.<br><br>\nWhen was the last time you felt that way coming out of a modern movie?  My guess is a lonnnnnng time.  There are very few exceptions today.  The special effects in movies like \"Worlds\" was icing on the cake... BUT IT WAS THE CAKE THAT MATTERED!  Today,  it's all icing and the cake can't support it (crappy icing, in fact!!)<br><br>Eat your cake and have it too!  Watch \"When Worlds Collide\"!","user":"Ruddfactor","rank":[99,106]},{"title":"Good Despite its Flaws","rating":20,"date":"20 February 2004","review":"When I was younger, this was one science fiction film that definitely made an impression on me. This was one of those where I actually was scared that one day my world would come to an end. However, as I got older I realized that this was just a movie, but still it is one of the best genre films of its era. Sure, it has its flaws (especially the painted background at the end), but still it is a film that was a product of its time and it will always be one of my favorites.","user":"Sargebri","rank":[34,35]}]