[{"title":"If you know the facts, you will see how enjoyable this film is...","rating":24,"date":"24 April 2002","review":"Title: SUPERGIRL Rating (Theatrical Version): *1/2 (out of 5) Rating (International Version): ***1/2 (out of 5) Rating (Extended Director's Cut): **** (out of 5)<br><br>There have been many films that, when originally released, have been spit on and throughly trashed by the critics and audience; some of these films have developed into cult classics.  However, I have never seen a film that has had the first characteristic and then eventually go beyond all expectations, raising a few eyebrows and almost completely overcome all the negativity that had been thrown at it in the past. SUPERGIRL is the first film that I have given ever that respect to and it's a real shame that it wasn't released the way it should have been. Personally, I'm a huge fan of the first two SUPERMAN films, and yet I really don't like comics in general.  However, the original SUPERMAN film released in 1978, was respected by those who don't even care for superhero and comic book movies and it, to an extent, had started a phenomenon in terms of bringing more superheroes and comic book characters to the screen. When SUPERMAN III was released in 1983, however, it had practically ruined the concept and the audience had retreated back into their normal lives when Christopher Reeve, wisely, retired from the role.  One year later, SUPERGIRL was released by the same producers (Alexander and Ilya Salkind) and trashed almost twice as much as SUPERMAN III was.  Needless to say, when I saw it on television in the early 90's, I trashed it to and thought it was worse than SUPERMAN III, as well as PART IV, and looked at it nothing more than ridiculous and amateurish.  In 2000, however, my opinion of SUPERGIRL was completely changed. Being an avid DVD collector (and a particular fan of audio commentaries), I decided to give SUPERGIRL a second chance for curiosity's sake and, as a result, this movie actually made me realize not to never judge a film again for just for what it shows and presents.  The DVD version (by Anchor Bay) has two versions of the film...and neither one is the original 105 min. version!  They contain the international version (which runs 124 min.) and a never-before-seen Director's Cut that ran a whopping 138 min!  The latter version contained scenes that have not only never been released before, but have only recently surfaced in a London vault with the warning \"Do Not Use.\"  For the very first time, director Jeannot Szwarc has released his complete vision of the film, complete with a genuinely surprising audio commentary which touches base on his intentions before and during the making of the film from the very beginning. The facts (you can call them SPOILERS if you want) are simply these:<br><br>1.  Christopher Reeve was going to be in it and be a mentor of sorts to Supergirl in one scene where she arrives on Earth, as well as be in another scene when Supergirl eventually saves him upon losing all his powers.  Due to the failure of the third SUPERMAN movie, however, Reeve completely bowed out of the role due to his blaming of the Salkinds' for how they screwed up the entire franchise by making the third film campy and put more empahsis on comedy, which simply didn't work. Ironically, that's exactly how many critics and audiences in 1984 thought that SUPERGIRL was awful.<br><br>2.  Director Jeannot Szwarc reveals that, from the beginning, that he wanted SUPERGIRL to stand on its own and be nothing more (or less) that what it was; in other words, he made it so it would pretend to be nothing else than itself.  He had to contend with many revisions of the script by David Odell, for not only production reasons, but for studio reasons: Warner Bros declined to release it (again due to the failure of S. III) and it was then picked up by then-unknown Tri-Star pictures, who had chopped up the film to where, when it was released in the U.S., had a lot of incoherency and confusing development (in both plot and characters), and thus all but completely trashed Szwarc's vision and intentions.<br><br>3. The result made SUPERGIRL virtually ignored by the U.S. audience, failing miserably at the box office and with every major critic promoting it as garbage; my favorite critic, Leonard Maltin called it \"a superdrag: dull, long, and heavy-handed.\"  All the well-repected actors in it were condemned as being \"wasted\" and \"laughable\"; this is especially true of Faye Dunaway, as the villianess bent on obtaining world dominition.  As for its status today, hardly anyone remembers it, and a few people I've talked to maintain it doesn't even exist!  That all changed with the 2000 DVD release by Anchor Bay, which I had viewed only recently.<br><br>I truly believe that when people watch either the International or Director's Cut, that they will agree with me that it would have been much better---and maybe even a success---if released that way in 1984. Presented in a digitally mastered version by THX, the film matures on almost every level, beginning with Jerry Goldsmith's score being nothing short of sensationsal, giving the film what John Williams gave to the original SUPERMAN, but what's different is that Goldsmith's actually complements the heroine's qualities by being lyrical and high-spirited.  Then there is Alan Hume's gorgeous cinematography, which reaches its zenith in a wonderful sequence where Supergirl does an \"aerial ballet\" when she discovers her powers; it supports the idea that her character is innocent and in utter awe with her discovery (may I also state that this sequence was cut entirely when first released). Finally, because of the director's commentary, my original opinions of the performances have been erased; he states that his cast chose to be in the film primarily because it was a change-of-pace for them and all they wanted was, as the director wanted as well, just to \"have fun.\"  That, combined with the additional footage bringing the full character development back into focus, the film goes beyond all expectations. The key to enjoying this film, bear in mind, is to not take it too seriously (which many critics tend to do when reviewing a movie).  Despite all the praise I've given to this new version, the film still does have flaws, particularly in the writing department, though you do come to realize that is not necessarily the fault of the screenwriter when considering the sequence of events that lead to the film being made.  I encourage anyone to take a chance to check this film out because it really is very enjoyable and a lot of fun; beware of the old video release and TV versions, however! E-mail me if you want to express your agreements (or disagreements) with me.","user":"eve6kicksass","rank":[80,99]},{"title":"\"I am Kara of ARGO city, daughter of Alura and Zor-El, and I don't scare easily.\"","rating":2,"date":"2 June 2003","review":"I am  surprised at the high percentage of very low votes for this movie, SUPERGIRL. While it is by no means a great movie, it IS a good film which makes a comic book story come to life. Helen Slater was only 19 when she played Supergirl and it is hard to imagine a better choice. She is pretty and innocent, but has a fine figure and very athletic legs, very believable as Superman's cousin, come to Earth to return the omegahedron to her society, while Superman is on self-imposed exile. For a 1984 film the production values are very high, not one wire is shown in the scenes where Supergirl flies, unlike Superman IV which is very poor in comparison. And, except for the drawn-out ending, is paced very nicely. I have the director's cut, which is 2 hours and 13 minutes of film, and another 5 or 6 minutes of credits.<br><br>Faye Dunnaway is also excellent as the archrival, evil sorceress. To me that is the best type of role for her. The DVD has a remarkably good video transfer and is an altogther fun movie, for fans of the Super series of comic book characters. <br><br>And, at 1:45 into the film, several newly-introduced Honda Sabre motorcycles were escorting Dunnaway's car.","user":"TxMike","rank":[90,116]},{"title":"A gentle tale worth watching with a relaxed mind.","rating":7,"date":"14 December 2006","review":"Watching Supergirl this week for the first time since childhood I see it with fresh eyes and a newfound appreciation of the movie. Supergirl must be considered separate and unrelated to the Superman movie foursome or it will fall short. There is not supposed to be a comparison. The Superman movies are action epics, Supergirl is the story of strength growing out of innocence.<br><br>Watching Supergirl now with an understanding of focus that I did not have when younger, I truly enjoy it. Helen Slater, Peter O'Tool, Peter Cook and Maureen Teefy all put in superb performances. Mia Farrow tends to overact the part of Selena, but then the character believes herself larger than life. Brenda Vaccaro could use a little more self assertion, but does alright. Marc McClure is of course an undeniably talented actor, though his part in this film is minor. I am forced to scream at the screen however; Why the hell do you wear a camera if you aren't going to use it when a major news piece flies into your lap?<br><br>I remember being dismissive of Supergirl when I was younger; due in part to the use of magic which has no part in the Superman films, but mainly I suspect due to the ludicrous man-eating excavator scene. This scene remains the major absurdity of the movie. Supposed to be terrifying it comes off as a rather poor imitation of the hundred Volkswagens from Herbie Rides Again. It isn't scary, its stupid.<br><br>Apart from that scene, Supergirl is good gentle viewing and a nice counterpoint to Superman.<br><br>It is hard to describe my exact feelings, but I do feel that standing on its own Supergirl should be considered a success and I deeply regret never having a chance to watch the sequels that were never made.","user":"dwtaxi","rank":[27,32]}]