[{"title":"Although Not a Classic, Still A Good Movie.","rating":6,"date":"3 April 2007","review":"I have always been surprised about the negative reviews concerning this movie. While I can accept that it's not a classic film by any means, Oh God! Book II still has some funny one-liners and a chemistry between the characters that works. George Burns and Louanne did a fine job together. They are really what the movie is about.<br><br>The story involves Tracey Richard's (Louanne) who's father is involved in advertising. She is approached by God (Burns) who asks her to assist, along with her friends and classmates, to help spread the message that \"God should be in people's thoughts more often.\" While the scenario is predictable, her friends accept the idea, the adults in the movie all think she is crazy after telling them about her visits with \"The Almighty.\" This leads to such things as Tracy getting expelled from school and an insanity hearing where God shows up to help save the day, and prove to the adults that who Tracy communicated with was not imaginary.<br><br>I think the critics that bash this film as some sort of religious propaganda take the movie too seriously. This is more of a relax and enjoy the simple chemistry between the immensely talented George Burns and the more intelligent than the adults realize in the movie, Louanne. I believe they had a great time making this film together! One could argue that Tracy's parents, (David Birney and Suzanne Pleshette) exist in superficial roles. However, the focus is strong enough for Burns and Louanne to carry the movie by themselves, and in the opinion of this reviewer, it seems to work. For whatever reason, I am drawn back to watch this film when I see it is on, so it can't be ALL BAD.<br><br>There are also some edited scenes that I saw once on the broadcast TV versions that aren't available on premium cable and AFAIK the same applies to this footage missing on VHS/DVD releases as well. I do not recall seeing the original theatrical release back in 1980 when it first came out. But here are the edited scenes: 1.) When Tracy is looking for \"God\" he gives her an ice cream cone in a park. There is another scene where Tracy sees an ice-cream vendor in the park who looks like \"God.\" She runs to him and yells out, \"God!\" The vendor turns around and says, \"Hi Sweetie, what flavor?\" Tracy apologizes to the man and dejectedly walks away. We know that this scene was originally included in the movie because it is mentioned by the psychiatrist Dr. Newall when he is talking to her parents AND by Tracy herself at her insanity hearing. But this scene apparently no longer exists. (At lest not in premium cable and presumably DVD/VHS copies of the film.) 2.) There is another deleted scene with Tracy and \"God\" talking about meeting together to work on the campaign slogan. She says, \"Let's do what my Dad does, have a business lunch.\" This is also indirectly referenced when Tracy's father tells her that if he were going to \"sell the high qualities of a person, he would take that person to lunch.\" The McDonald's scene with Tracy and God remains in all prints to my knowledge, but the conversation with God and she about \"having a business lunch.\" also no longer seems to exist.<br><br>My guess is that these were scenes added for broadcast TV viewing and it would be interesting to see them again. If you have a commercial TV version of this movie, watch for them! It's funny how I can't recall hardly a thing about the first Oh God! movie with John Denver. But, I can't forget this sequel! Listen to Burns' comments about how life can't be created with just one side to it. It is VERY MOVING! The ending is also surprisingly touching.","user":"jbartelone","rank":[8,8]},{"title":"A movie with a message for the heart and soul","rating":10,"date":"7 June 2008","review":"Most movies that use the \"God\" word in them have either been epics like \"Moses\" or movies where God is not taken serious. In Oh God, Book II George Burns plays the kind of God who comes down to our level to figure out a way to get the human race to take notice of their creator. George Burns character is perfect in the movie as he enlists the assistance of Louanne, a doting, charming young girl who accepts God's appearance on the scene with surprise at first, then with curiosity and finally enthusiasm as he asks her for her assistance in getting more folks to stand up and take notice of \"God\". The plot is simple as one would expect, but the simplistic faith of Louanne, despite her growing predicaments adds more than cute charm to this fun movie, it stirs the heart and soul of anyone who watches with the same innocent faith of the lead child character of Louanne. The moral is simple, the characters mesh well and the end result is a reminder of what we are all here for.","user":"runforlife77","rank":[9,10]},{"title":"Not as funny as Book I but definitely deeper.","rating":6,"date":"29 September 2004","review":"Definitely not as funny as Book I but at least it dares to delve into the deeper problems of theodicy. The question which the little girl asks \"God\" (George Burns) in a key scene: \"why bad things happen\" should be in a FAQ portion of a theology syllabus. His answer, while ultimately unsatisfying, deserves attention. He said that in creating things, he never got the knack of not creating the opposite. You know: light vs. dark, joy - sadness, etc. It is an ancient question that has exercised the greatest Doctors of the Church, among them St. Augustine who argued that evil per se does not exist. Called the privatio boni argument, Augustine's contention is that what we perceive as evil is simply the lack of a particular aspect of good. For example, sickness is an evil because of the lack of health of the body. Naturalistic philosophies such as Taoism argue in the same vein - that evil is the result of not being in harmony with nature, with the Yin and Yang, seemingly contending forces or aspects of reality but which could not exist without the other. One would wish that \"God\" could explain further but alas! it is just silly old George Burns and his ridiculous cigar.","user":"Deusvolt","rank":[8,9]}]