[{"title":"One sequence is gorgeous in its silence.","rating":22,"date":"22 October 2002","review":"There are many shimmering moments in Bandwagon: Fred Astaire (playing a role close to his own life story; he was 53 at the time), the acidic wit of Oscar Levant ('that'll keep 'em laughing!!') tempered by the sunny Nanette Fabray and musical numbers including \"Shine on Your Shoes,\" \"I Guess I'll Have To Change My Plan,\" and a clever novelty trio called \"Triplets.\" But the musical sequence that stands out the most is the one which has no vocal, no dialog, and gently advances the movie's plot of whether or not oil-and-water dancers Astaire and Cyd Charisse can actually perform together (when he thinks she's too tall and she thinks he's too old). Against a Central Park twilight, the film shows its heroes enjoy a hushed walk through a park (only an instrumental refrain of 'High and Low' is heard), after which they step into an empty courtyard (he in a pastel linen suit and spectator shoes, she in a flared white dress and ballet flats; a necessity to keep her from being taller than him on film) and into the pas-de-deux of \"Dancing In The Dark.\" It's an exquisite sequence, which at times resembles courtship, foreplay, and ultimately a romantic climax- all done in dance. It ends, just as smoothly as it began, with the two leads spinning up a short flight of stairs and mounting a hansom cab, without a single hair out of place. Now THAT's entertainment.","user":"movibuf1962","rank":[39,39]},{"title":"Now *this* is entertainment!","rating":8,"date":"10 October 2002","review":"THE BAND WAGON tells the story of faded movie star Tony Hunter (Fred Astaire) as he attempts to restart his stage career with the help of his two pals Lester (Oscar Levant) and Lily (Nanette Fabray) Marton. The Martons have written Tony a surefire hit... or so they think, until they fall under the charms of writer/director/producer/actor du jour, Jeffrey Cordova (Jack Buchanan) and their lighthearted musical comedy is turned into some kind of freaky Faustian opera. Jeffrey also ropes the famous French ballet-dancer Gabrielle Gerard (Cyd Charisse) and her choreographer boyfriend Paul Byrd (James Mitchell) into the production, but Tony and Gabrielle start off with each other on the wrong foot--almost literally so, since Tony is primarily a hoofer feeling his age, and Gabrielle a ballet star in her prime. They don't seem to match at all, from age to temperament, right down to dancing style. When Tony and Gabrielle finally come to an understanding, however, it's evident their musical is headed for a critical drubbing, and their hint of a romantic relationship thrown into doubt by Paul's annoyance that Gaby doesn't want to leave the show with him. The rest of the film works at resolving this double impasse.<br><br>It's probably hard to avoid comparing this film to SINGIN' IN THE RAIN, since they were made just a year apart and were both written by Betty Comden and Adolph Green. Moreover, the themes are even vaguely similar--THE BAND WAGON is a gentle, sharp satire on theatrical goings-on; SINGIN' IN THE RAIN a wicked parody of Hollywood and movie-making. Both films list Cyd Charisse as one of the characters; both films have a ballet section towards the end of the film. And of course, both films star (separately, unfortunately) the two greatest dancing talents of any and every Hollywood generation--Fred Astaire (TBW) and Gene Kelly (SITR). So certainly, comparisons are rife... the films seem to *beg* one to make them! Personally, the chips fall on the side of SITR for me: it's got a tighter story line, it's less talky, the chemistry between the leads is impeccable, and the songs and dances are simply wonderful.<br><br>That is, however, an entirely personal preference. There are people--there are in fact several other IMDB reviewers--who prefer THE BAND WAGON, and with good reason. Entirely on its own merits and not in comparison to SITR (as it should be judged), this film is exactly what it sets out to be: a cracking two hours worth of sheer entertainment. It's cleverly written, while the songs and dances are charming and some even mind-blowing. Vincente Minelli does an excellent job of directing; he is, after all, justly known as the master of musical films. Astaire couldn't be bad if he tried, and he's quite ably supported by his cast of Charisse, Levant, Fabray and Buchanan. The numbers range from the heartbreakingly romantic and simple (Charisse and Astaire falling in love to 'Dancing In The Dark'); through to the clever and amusing (most of the brief numbers attributed to 'The Band Wagon', the play within the movie, but most especially the 'Triplets' number with Astaire, Fabray and Buchanan); on to the rousing and hilarious (Astaire's German accent midway through 'I Love Louisa); and finally to those that are simply stunning in their sheer technical mastery (without a doubt the 'Girl Hunt' ballet). And of course, that's forgetting to mention the song that best sums up the entire spirit of THE BAND WAGON: 'That's Entertainment!'. Joyously performed by Astaire, Fabray, Buchanan and Levant (and in a finale reprisal also featuring Charisse), you really get the feeling that *this* is what Hollywood, and more specifically, the MGM musical, is about. And at the game of entertainment, THE BAND WAGON succeeds handsomely. <br><br>I think the only problem I have with THE BAND WAGON is that it just doesn't come together as perfectly and as seamlessly as I'd like. There are moments when my attention drifts, and the acting is frequently uneven. (An exception would be Fabray, who simply radiates exuberance with her big voice and great moves in relatively little screen time.) I've said that Astaire couldn't be bad if he tried. True, he *isn't* bad... just a little listless, it seems to me, particularly in the first half of the film. His dancing, however, is faultless as usual, just as you'd expect from Astaire. And he definitely seems to warm up considerably in the second half of the film. It's rather a shame that there's a spark missing from Charisse's performance as well--as a dancer she is visually *and* emotionally arresting, but she's quite frankly not as much an actress as she is a dancer. (She had the same problem in BRIGADOON, and she didn't have to act in SINGIN' IN THE RAIN except through her dancing.) Most of the time her performance is passable, reaching 'good' and occasionally 'great' at the most naturalistic parts--for example, when she's laughing or pretending to smoke with Tony. Astaire and Charisse are fantastic in their two main numbers together though--'Dancing In The Dark' is one of the best, simplest and most romantic film dances I've ever seen, and 'Girl Hunt' is so inventive and perfectly executed that you can't help thinking these two dancers really *do* match somehow.<br><br>Simply put, you just couldn't go wrong with THE BAND WAGON. You'll laugh, you'll marvel, you'll sing along... but most of all, you'll be well-entertained. And if *that's* the point the film is trying to make... point surely very well-taken! 8/10","user":"gaityr","rank":[25,25]},{"title":"Fred and Cyd dance in the dark - perfection!","rating":6,"date":"6 July 2003","review":"Perhaps the finest hour of Fred Astaire and Cyd Charisse together (although Silk Stockings comes a close second); the 'Dancing in the Dark' sequence says it all about both this film, and the two impeccably classy stars.<br><br>There are, of course, other highlights - Oscar Levant and Nanette Fabray's acidic writers; Jack Buchanan's overblown producer; Fred's dance with the shoeshine boy, Le Roy Daniels; anything featuring Cyd Charisse - and those wonderful musical numbers, ranging from the anthem 'That's Entertainment' to the hilarious 'Triplets'.<br><br>'The Band Wagon' sends up the old film staple plot \"putting on a show\" and does it brilliantly, thanks to the crackling Comden/Green script.  One of MGM's best musical efforts, hugely enjoyable.","user":"didi-5","rank":[46,48]}]