[{"title":"The blonde and bubbly Sandra Dee at her most appealing!","rating":26,"date":"26 September 2000","review":"All right, so it's not a masterpiece of moviemaking, but the film is still widely shown today and adored by most of those who see it. The slight, but very perceptive story concerns a plucky teenage girl nick-named Gidget(contractions of the words Girl and Midget) who mostly just wants to have fun in the sun. There's nothing wrong with that. But she's getting to that certain age where she's beginning to have deeper feelings, especially about the opposite sex. She begins to fall for a more \"mature\" surf bum(Cliff Robertson), but then finally settles for Moon-doggie(James Darren) who is closer to her own age. Some people might dismiss GIDGET as standard studio corn, but I beg to differ! It's not your typical sixties teen beach movie about surfing, sand, and sex. GIDGET actually has a story to tell. Maybe I'm being slightly sentimental, but to me GIDGET is a beautiful coming-of-age story that can still teach the teenagers of today a valuable lesson about first love. For those of you who didn't already know it, GIDGET was played by the beautiful young Sandra Dee who was a hot item in her day. Dee was seventeen and at her liveliest when she made this film. I would also say she was at her most appealing. She's on the screen for most of the film's 95minutes, and she's an absolute joy to watch for the film's entire running. Needless to say, I thought Dee was irresistably charming in this film. It's easy to see why she was so popular and such an idol to teenage girls in the sixties. She's blonde, beautiful, spirited, and has a terrific personality. It's a pity she doesn't make more films today. Having seen most of her films, I must say that in addition to being a pretty face, she is also a good actress. I could watch her for hours and hours. I may only be a simple 21-year-old boy from cincinnati, but I really enjoy and appreciate older films like this. They're fun and teach a lesson without being too preachy. If you're at the local video store one night and want something that's not too complex and  is just good, clean fun, then GIDGET is highly recommended!!!!! And yes, this is the film that spawned the equally popular hit TV series starring another fresh and exciting talent, Sally Field.","user":"verna55","rank":[30,31]},{"title":"What It Meant to Her at 15 in the Theater in 1959","rating":29,"date":"29 November 2005","review":"My grandmother, Mary, was 15 years old when she first saw the first Gidget (1959) movie with Sandra Dee and James Darren, in The New Bell Theatre in Bellflower California. She and her best friend Eunice saw a movie about growing up, discovering boys, and learning lessons. Francie is a 16 year old girl, blonde and pretty, but very young in appearance. She is recruited by her female Francie to begin a \"man-hunt\" on the beach where they live in sunny California, and Francie reluctantly follows. As they sit on the beach, Francie's friends try to lure the muscular tanned college men over, while the guys are referring to them as jailbait, and Francie urges the girls to join her swimming. It is not that she has no interest in boys, but as Francie told her mother, \"when they start smoothing and pawing, UH doesn't it make you sick too mama?!\" Mama assures her that she just needs to find the right man. So the search begins.<br><br>As we watched the movie, my grandmother pointed out things she had thought as a young adolescent girl, and also things that she thought of now that had been difficult to put into words at a young age. \"That blue of the ocean, oh, even as a young girl, from then on it meant sexuality to me,\" my grandma confides, as she looks to see that no one else heard her. As Francie breaks away from her friends, she begins to find her self more and more, in the middle of a group of about eight very attractive, muscular, and tanned men, all older than she is, teaching her how to ride those big blue waves. The guys call her Gidget, a cross between Girl and Midget, which is a barrier to Francie in the beginning, because it shows that the guys only see her as a little girl. <br><br>My grandmother explained as we watched this film together, that this movie was what \"made me look at those things in a different way. I had more interest in boys at the end of the movie!\" It was the first teenage love story she had ever seen, and she seemed to almost regress to a teenager as we watched the movie together. \"Oh, James Darren is such a hunk!\" and \"I had such a crush on him...\"and \"what cute clothes she wears!\" She commented that after this movie she made it a point to make her wardrobe similar to Sandra Dee's. \"Those shirts with the hood like you wear today, they were popular back then too.\" She went on to say that when girls wanted to get clothes like Gidget's, they shopped at Judy's, and that it was \"the absolute place! And I got to shop there!\" I could hear her begin to revert to the phrases she used as a teenager as she got excited about the fashions of her childhood.<br><br>Before the movie began, my Grandma thought about what she remembered most clearly about the movie. \"I remember the dress she wore, and what color it was. It sticks in my mind to this day.\" During the scene where Gidget gets dressed to go to the luau, my grandmother interrupts the movie to tell me something else. \"There's the dress! I don't even like orange, in fact, I hate the color orange...but that's a very special dress to me.\" <br><br>This movie was filmed in vibrant color and shot on the beach in Malibu. This alone drew many young people to the film. It was about discovering sex and growing up, and teenagers of the fifties were very interested. This movie was memorable to my grandma and to her friends of the fifties because of a combination longing to be on a beach surfing with hunky surf bums and the excitement for the beginning of love stories made especially for teens. Sandra Dee was the perfect teenage girl in the eyes of the youth in the fifties, because she was pretty, sweet, innocent, and smart, yet she still had the sense of adventure, rebellion, and need for sex in which the kids of the fifties were becoming more and more interested.","user":"Plyncie","rank":[58,64]},{"title":"Much More Relevant that the Television Series","rating":7,"date":"30 November 2006","review":"The reputation of the original \"Gidget\" (1959) has eroded over the years thanks to two weak sequels and a truly dreadful television series. So if you have never seen the original don't dismiss it based on the extremely shallow content of the Gidget stuff that came later. While not a good double-feature match for \"Rebel Without a Cause\", it is dark and serious enough to still have some relevance<br><br>While presenting a rather tame portrait of California's surf and beatnik counterculture, it fits solidly with the better coming-of-age/generational revolution stuff of the 1950's and 60's. <br><br>Sixteen year-old Francis Lawrence (Sandra Dee at her most innocent) is the film's title character; girl plus midget equals Gidget. Dee managed to avoid the other two features and the television series but not fatal type casting. She would become more associated with \"Tammy\" than any other character. Although soon to be a teen idol, looking at her films it is probably difficult for today's audiences to understand her appeal. She was a talented actress with an especially good performance in \"The Young and the Innocent\" but was never able to transcend the teen idol stigma. <br><br>Francis and her more mature and boy hungry friends (watch for \"Batgirl's\" Yvonne Craig) start their summer vacation trolling the beach for excitement. Francis doesn't really like boys but she can see that they will inevitably become a big factor in her life. Rescued by a boy named Moondoggie (James Darren who was never much of an actor but would also develop into quite a teen idol), Francis is introduced to the surf culture (watch for \"Billy Jack's\" Tom Laughlin). She is both attracted and repelled by the hedonist freedom and the inherent hypocrisy of the culture's preoccupation with money. In no sense is she the ditzy Gidget later portrayed on television by Sally Fields.<br><br>There is a pervasive sexual undertone to the film with the possible loss of Gidget's virginity a unifying theme. But she is essentially a child, and the three main male characters are each protective of her in their own way. Along with Moondoggie are her clueless father (Arthur O'Connell) and The Big Kahuna (Cliff Robertson).<br><br>Robertson is a combat veteran (Korea) who has basically dropped out and is living in a shack on the beach. Robertson does a good job in a challenging rol, as The Big Kahuna alternates between the seriousness he would soon bring to his portrayal of Jack Kennedy in \"PT-109\" and the manic qualities of a Dick Shawn character. <br><br>Ultimately some irony is introduced as \"Moondoggie\" turns out to be Jeffrey Mathews, the clean-cut boy Mr. Lawrence has been trying all summer to persuade his daughter to date. Their summer at the beach is just a transitional point on the road to a ranch house in Sherman Oaks.<br><br>Then again, what do I know? I'm only a child.","user":"aimless-46","rank":[13,13]}]