[{"title":"Fred, you didn't tell me Ginger had a sister?","rating":9,"date":"25 April 2006","review":"Musically speaking Irving Berlin gave Fred Astaire and Ginger Rogers another pluperfect musical after Top Hat if that was possible. Although in this case like that Jerome Kern confection Roberta that they were in, Follow the Fleet retained Randolph Scott with another singer, this time Harriet Hilliard.<br><br>Randolph Scott is a career Navy CPO and Fred Astaire is an ex-vaudevillian who enlisted in the Navy to forget Ginger Rogers his former partner. But now the two are on shore leave. Fred and Ginger take up right where they left off, and Randy accidentally meets Ginger's dowdy sister Harriet who blossoms into a real beauty. But Randy's a typical love 'em and leave 'em sailor. <br><br>Again Irving Berlin wrote a hit filled score with him tightly supervising the production. Ginger gets to do some really outstanding vocalizing with Let Yourself Go which she and Fred later dance to. But the real hit of the show is Let's Face the Music and Dance which is a number done at a Navy show. Sung first by Astaire and later danced to by the pair, Let's Face the Music and Dance is one of the great romantic numbers ever written for the screen. Their dancing on this one is absolute magic.<br><br>I'm sure that when I mention Harriet Hilliard a few younger people might ask who that was. But they will know immediately when I mention her in conjunction with her famous husband Ozzie Nelson. That's right Ozzie and Harriet. It's something of a mystery to me why Harriet stopped singing when she just became David and Ricky's mom on television. Then again she didn't even keep her own name. <br><br>Neither Ozzie or Harriet sang on television. Ozzie was a pale imitation of Rudy Vallee as a singer, but Harriet could really carry a tune. She sings Get Thee Behind Me Satan and The Moon and I Are Here, But Where Are You, both with real feeling and class. I recommend you see Follow the Fleet if for no other reason than to hear a dimension of Harriet Hilliard incredibly forgotten today.","user":"bkoganbing","rank":[21,21]},{"title":"Facing the music.","rating":25,"date":"25 October 2004","review":"This film is nice because there are two love stories-- something of a plot departure, and the second couple (Randolph Scott and Harriet Hilliard Nelson) are given the bulk of the dramatics, which allow our stars to be looser, more comical. Astaire chews the gum a little too severely, but he was anxious to make a departure from his customary tuxedoed playboy. Rogers is much more at ease in the role of struggling dancer-singer, and plays well opposite sister Hilliard. (The history is that Ms. Hilliard had to darken her naturally blond hair to distinguish her from Ms. Rogers. But wouldn't they better resemble sisters if they were both blonds?) The Irving Berlin numbers are quite good, ranging from light and airy (\"Let Yourself Go,\" \"I'd Rather Lead A Band\") to elegant (\"Let's Face The Music And Dance\"). This final number is the film's bewitching finale, performed on a lovely Art-Deco rooftop and illustrates Astaire's penchant for full-frame, single-take dancing. It is, in a nutshell, singularly gorgeous. The trivia history goes that Rogers' metallic thread gown had weights in the sleeves and hem to make the skirt wind and unwind; the dress was unintentionally difficult to perform in because its flared sleeves hit Astaire across the face IN THE FIRST TAKE- and after many re-shoots trying to cover it up, they ended up printing that first take (we have to assume that was apparently the best performance of the dance, but you can see the sleeves brush across Astaire's face). It loses one-half point from me, because Randolph Scott says 'bebby' once too often.","user":"movibuf1962","rank":[14,14]},{"title":"Guaranteed Charmer from Astaire & Rogers","rating":8,"date":"11 August 2005","review":"1936 was the most prolific year for Astaire and Rogers. Their second film for RKO that year is the third film in this collection  Mark Sandrich's 'Follow The Fleet.' This time out Astaire is painfully uncomfortable as Bake Baker, a seaman on leave who just happens to stumble into the seedy waterfront café where Sherry Martin (Rogers) is warbling romantic sweet nothings in everyone's ear. Yep, you guessed it  they're hot for each other once again. Only this time Sherry's spinster sister, Connie (Harriet Hillard) threatens the whole fine romance by falling for Bake's robust seafaring buddy, Bilge Smith (Randolph Scott); a sort of use 'em up and toss 'em out kind of guy, thus forcing Sherry to reconsider her opinion of all sailors in general. Irving Berlin lends immeasurable class to the proceedings with his classic, classy score, including standards 'Let Yourself Go', 'I'm Putting All My Eggs in One Basket' and 'Let's Face the Music and Dance;' the latter a divinely inspired skit about suicide that turns into another immediately recognizable and thoroughly sublime pas deux for Fred and Ginger. <br><br>The transfer on 'Follow The Fleet' is a tad weaker. The gray scale remains nicely balanced but now it's a tad thick looking with not nearly as much tonal variation as the previous titles. Grain is still present. So are age related artifacts. Once you've settled into to the slightly dense and sometimes more softly focused image quality, the overall impression is more than acceptable for a film of this vintage. The audio is Mono but very nicely balanced. Extras include a featurette, theatrical trailer and short subject, but oddly  no audio commentary. Considering the importance of this film in the overall canon of Astaire/Rogers this is an uncharacteristic oversight from Warner Home Video.","user":"movieman-200","rank":[10,10]}]