[{"title":"Unfairly lambasted espionage thriller.","rating":6,"date":"19 May 2005","review":"Don Siegel will always be remembered as the man who gave us Invasion Of The Bodysnatchers and Dirty Harry, as well as being the mentor of Clint Eastwood when he was just starting out in the acting business. Here he tackles very atypical material with a low-key British spy thriller based on the book Seven Days To A Killing by Clive Eggleton. Although this is not really Siegel's kind of thing, he manages to coax sound performances from an impressive cast, and gets across a certain degree of excitement. From time to time the suspense slackens a little, but on the whole this is an engaging enough potboiler.<br><br>Major John Tarrant (Michael Caine) is a secret agent who is distraught to learn that his son has been kidnapped by a gang who want a batch of diamonds for his safe return. Tarrant's boss Cedric Harper (Donald Pleasance) has never got on well with Tarrant, and even goes so far as to suggest that maybe the kidnapping is an elaborate double-cross hatched by Tarrant himself in order to get hold of the diamonds. Supported by his wife Alex (Janet Suzman), Tarrant steals the diamonds needed for his son's safety, and attempts to elude his own colleagues plus the police long enough to secure the return of the young boy.<br><br>Critical opinion at the time seemed to be of the view that The Black Windmill was a bad film. Generous critics were kind enough to call it average. Perhaps everyone still had Siegel's extraordinarily good Dirty Harry fresh in their memories and were unable to accept that he couldn't always make films of that standard. The Black Windmill, while stilted and a touch dry in parts, is certainly not a full-scale dud. It has interesting plot twists, good acting (always good to see John Vernon in any of his '70s villainous roles), intriguing character clashes, and a nice sense of genre. I'd rather have a low-key thriller like this than one of the modern spectacular-but-empty popcorn actioners. Try not to be influenced by the negative buzz.... give The Black Windmill a try. It's no classic, but it's better than you might expect.","user":"barnabyrudge","rank":[39,42]},{"title":"SIEGEL CONSTRUCTS SOMETHING SPECIAL.","rating":9,"date":"10 November 2004","review":"For this work, scenes of \"action\", a Don Siegel specialty, are less significant than those that generate characterization and plot, functioning to release tension rather than keep it at bay, although the director's customary taut pacing and stoniness are here, within a twisty story largely faithful to its source, a Clive Egleton novel: \"Seven Days to a Killing\", strongly scripted by Leigh Vance to further define the character-focused film. A cleverly fresh storyline involves a kidnapping, the victim being son of MI-5 operative John Tarrant (Michael Caine), with a ransom demand for greater than one half million pounds worth of uncut diamonds that are resting within a Defence Ministry safe, as an unknown traitorous official has informed the abductors, with subsequent dual scenario devices of Tarrant's struggle to retrieve his son held by illicit arms syndicate villains, along with Ministry efforts to culpably link Tarrant with the conspiracy. The film benefits from attention to continuity, no loose ends rupturing one's concentration, with heed to detail perhaps its primary strength, yet telling contributions come from many, including players Caine, who adds a needed element of engagement to his Harry Palmer persona, Delphine Seyrig giving a splendidly nuanced performance as companion of the principal evildoer (played with effectual guile by John Vernon), and Donald Pleasence earning the acting laurels here as a dispassionate MI-5 security chief, along with Clive Revill, Joss Ackland, and ever intense Janet Suzman.<br><br>Siegel's hand is apparent in the spare deployment of music, with scoring and silence each appropriately employed; palette and filter for well-composed cinematography and montage (shooting is in London, Paris and the Sussex countryside); a symbolic use of clothing colours; and accomplished post-production efforts, all increasing the worth of a piece undervalued by some reviewers, indeed by Caine himself, unfortunate in the event as the film is one of Siegel's finest, his skill with improvisation mating well with capable workmanship.","user":"rsoonsa","rank":[31,41]},{"title":"One of Caine's best thrillers","rating":8,"date":"6 July 2006","review":"In 1965, Caine created the role of Harry Palmer in the Ipcress File. It was good enough to spawn two follow-ups: Funeral in Berlin and the Billion Dollar Brain. By 1974, the movie-going public was used to seeing him in the role of a secret agent. Here he gets in trouble, and although you know that by the end of the film he will emerge victorious, or will he? I'm not telling. But the excruciating fun is in trying to figure our what will happen next. Filmed in Europe, Black Windmill\" is directed by Don Siegel. Clint Eastwood credits Don for his success as a director, and, of course, Siegel also directed some of Clint's best movies. The pacing is even throughout and builds to a suspenseful climax. Let it not be overlooked that Donald Pleasence in a supporting role is at his usual best. The human chameleon that adapts beautifully to whatever role is given him. John Vernon is especially menacing. To me, seeing old movies a second or third time is like visiting with old friends. Everybody has their own \"Casablanca\" and \"Shawshank Redemption.\" If you haven't seen this one yet, please do. It will become one of your \"old friends\" which I'm sure you will visit again and again.","user":"mdlee","rank":[26,34]}]