[{"title":"magical and moving","rating":10,"date":"2 May 2004","review":"This holds a special place in my heart, and I still consider it to be absolutely one of the very greatest films ever made for adults. The work of a mature artist, it resonates with Buddhist practice, and is a profoundly moving tale of the suffering of the human condition, the violence of war, the possibilities of art uplifting the spirit, the possibilities of redemption of character. The closing scene is one of such deeply-felt compassion and understanding that it is almost frightening; it prefigures in a way the stunning and more personal close of the subsequent Mizoguchi film \"Sansho the Baliff\".<br><br>On a lighter level, it is an amusingly sly allegory of the actual history of Japan for the 20 or so years prior to 1953, where in the end the women, embittered (or dead) as a result of their men's quixotic quest for military glory or war-profiteering, entreat them to give up their misguided and destructive dreams, settle down, and get back to their real responsibilities.<br><br>Which they did.<br><br>Originally available on LaserDisc.","user":"notmicro","rank":[75,83]},{"title":"Songs and tales","rating":9,"date":"1 March 2006","review":"The movie starts out pretty uncomfortably, two peasants in 16th century Japan who dream of richness and glory so blindly, they can't even hear the pretty straight-forward protests of their loving wives who try to convince them that their happiness is fine at home. When one, a pottery smith, makes a small bundle selling his wares, they decide to make a much larger batch together and become rich.<br><br>Forced out of their homes by an approaching war and uncertain where to go, they take their wares to a thriving market place, where the second peasant's ambition to be a samurai divides them and causes all four characters, the two peasants and their wives, to be separated, all fending for themselves amongst the war and various classes differently.<br><br>At this point the film reverses itself and instead of being a pretty skin-deep, tragic bud of greed, it blooms into a beautiful and haunting tale of obsession and illusion. The two main stories of the peasants and their wives are opposite only in their imaged realism, where one peasant falls completely under the curse of an enchanting ghost and the other lies and steals his way to fame, only both of them are eventually knocked down from their own hubris and forced to finally awaken to what their wives have said all along.<br><br>It's quite exquisite, this movie, with its long takes and its lack of the usual constructs that make up messages of obsession and greed. Once it gets beyond the small, uncomfortable, claustrophobic world of the peasant's home, it becomes audaciously challenging and mysterious, so that the same small home becomes amazingly wonderful and comforting. The very essence of the movie is breathed into the emotions of the audience in very subtle ways, making a very unforgettable cinematic experience.<br><br>--PolarisDiB","user":"Polaris_DiB","rank":[38,42]},{"title":"A Film of Stunning Beauty and Emotional Depth","rating":10,"date":"8 January 2006","review":"Having read much about this film, I thought I knew what to expect when I finally had the chance to see it. I was wrong; no amount of writing can convey the richness and impact of the images and the overall flow of the film-- which is why this commentary will be brief. Suffice it to say that I recommend this film wholeheartedly to anyone looking for cinematic poetry (though not, probably, to those who, misled by its being set during the Japanese Civil Wars, expect an action film).<br><br>Perhaps the most striking thing about the film is the camera-work; on a first viewing one is scarcely aware of it much of the time, but the camera is in constant motion, emblematic of the restlessness which pervades not only the era and the central characters but, by implication, all of human life (in this regard, it's a very Buddhist film). This movement is never gratuitous; when the scene demands little or no movement the camera stays still. Notice, though, how often the camera's movement enhances the emotional impact of the scene, especially in the famous panning shot (not, as occasionally described, a 360 degree shot) of the reunion near the end. Along with this is Mizoguchi's penchant for long takes, which seduce the viewer into the rhythm of the film without calling attention to themselves or to his cleverness as a director.<br><br>But these are technical comments which may or may not be helpful in focussing a viewer's attention; what really matters is the film itself as a whole. It is truly beautiful, and powerful in the unexpected way of great poetry. Technique and emotion, simplicity of means and complexity of effects, walk hand-in-hand here, and the result is remarkable in a way which film rarely attains.","user":"lwalsh","rank":[45,51]}]