[{"title":"A Good Film Carried by Robert Duvall's Oscar-Winning Performance","rating":2,"date":"2 October 2000","review":"\"Tender Mercies\" is a strong character study about a washed-up country singer (Robert Duvall, in his Oscar-winning role) who finds the will to live and makes the most of his life.  After spending a drunken night at a small motel in Texas, he meets the woman (Tess Harper) who can change his life for the better.  She owns the motel and after allowing Duvall to stay for a while by doing odd jobs, she marries him and he starts his transformation. Duvall still has songs to sing, but his heart is just not in it any more. His ex-wife has become a singing star, partly by using the songs that Duvall wrote himself.  She has also kept their daughter away from him because she was afraid he might do something in a drunken rage.  Duvall comes to terms with everything and shows that he is a changed man.  He meets his now-grown daughter (Ellen Barkin) and realizes that everything that has happened has occurred for the right reason.  However, tragedy will strike and Duvall will have to show how great a person he really is.  \"Tender Mercies\" is a film that works due to quiet performances, subtle direction, and a smart screenplay.  The film runs a crisp 89 minutes, but never feels rushed. Robert Duvall finally got the chance to showcase his acting ability and he does not disappoint.  His performance is the greatest attribute here, but this does not mean that everything else is not impressive.  4.5 out of 5 stars.","user":"tfrizzell","rank":[42,45]},{"title":"Duvall at his Finest !!","rating":9,"date":"15 May 2006","review":"This moving and thought-provoking film is a timeless classic of redemption and perseverance.Robert Duvall totally captures the pain, heartache, despair and ultimate survival of a once beloved entertainer.The film is an emotional tour-de-force for all the main characters, as they deal with forgiveness, doubt, loss of faith and memories of what might have been .......<br><br>The direction, screenplay, music and cinematography are all top-notch and add to the realistic feel of the film.<br><br>In a career that has seen a number of great performances, this quiet, unassuming Duvall film will leave you inspired as well as thoughtful. In this film , we see our own lives reflected in this small town saga. Maybe that is why I found the movie so deeply entertaining. It appeals to the lost dreams and missed opportunities in our own lives.","user":"revdrcac","rank":[33,35]},{"title":"Magic","rating":10,"date":"6 March 1999","review":"This movie demonstrates what happens when the rare, magical perfect combination clicks together. Duvall, Beresford and Foote blended their talents marvelously and managed to fool the critics by producing a film that is absolutely one of the best ever. Its draw at the box office and on video may have surprised the critics, but is understood by those who place a high value on well-written and well-acted drama. I have nearly worn out my VHS copy from multiple viewings but I have never worn out the experience. The film is uplifting because it is all about unhoped hope finding fulfillment.<br><br>The movie combines tragedy and pathos with love, warmth and redemption in a manner that rarely occurs in a Hollywood production. To top it off, it does it so that there is not a phoney or contrived moment in the picture. Excellent and somewhat surprising supporting performances came from newcomer Tess Harper (discovered for this film by Duvall and Beresford) Ellen Barkin and Betty Buckley.  Brimley (impossible to dislike in any role) is perfect as Buckley's manager.<br><br>One of the best scenes in the movie occurs when the young band drops over to \"just say howdy\" to the ex-singer. Harper is guarded and protective at first, but the pure hearts and openly embarrassed intent of the young men quickly win her and the viewer over. It is a touching and beautiful scene. It reminds you that there is still decency and humility among American youth (maybe we should all visit east Texas once in a while, although you can easily find it in most parts of rural USA).<br><br>No action flik this. The best word I know to describe Tender Mercies is \"heartwarming.\" If you have not yet watched it, by all means do yourself a favor: beg, borrow, rent or steal a copy without delay. You'll never think of Duvall or Texas or country music the same again.","user":"JP-54","rank":[53,58]}]