[{"title":"The Shocking Facts Within The House Of 1000 Dolls!","rating":6,"date":"23 July 2006","review":"This Spanish/British/German co-production was on AIP's back-burner for quite a while. Eventually, Vincent Price did the film as part of his contractual obligations to the company. Producer/Director Harry Allan Towers specialized in sleazy European thrillers and this one is no exception. When a vacationing couple (George Nader and Anne Smyrner) in Tangiers run into an old friend there, they discover that he is searching for his missing girlfriend (Maria Rohm, Tower's real-life wife) who has been kidnapped by an international gang of white slavers. Nader investigates but before he can come up with anything, his friend is murdered. Meanwhile, nightclub magician Price and his mentalist partner (Martha Hyer), continue their nefarious activities--they hypnotize and kidnap young women for the 'White Slavers', and spirit them to the \"House of 1000 Dolls.\" Yep, that's the plot outline folks, at least in the American cut of the film. Price and Ms. Hyer (who had just married producer Hal Wallis) shared a great interest in art, and in their spare time, they visited local museums together. Years later, when asked about this film, Price had this to say: \"What she (Ms. Hyer) and I didn't know was, at the same time, they were making a 'dirty' version of the film. Every day we had off, they'd make a 'dirty version'. We went visiting on the set one day, and there was everyone naked! and they weren't even the same girls!\" This explains why the American print of the film runs 78 minutes and the one seen in Europe is various lengths, from 90 to 98 minutes. Thanks to some atmospheric photography,an attractive musical score by Charles Camilleri and good performances from Price, Hyer and Nader, the film is watchable, and the girls are beautiful. This movie played most places with another Towers/Nader potboiler, \"The Million Eyes Of Su- Muru\" which isn't even as entertaining as this one.","user":"phillindholm","rank":[21,23]},{"title":"HOUSE OF A THOUSAND DOLLS (Jeremy Summers, 1967) **1/2","rating":6,"date":"15 May 2011","review":"To begin with, this was yet another \"Movies 4 Men\" screening hampered by the usual garbled sound problems! It is also an example of a maligned Vincent Price film (Leonard Maltin says he \"walks through it in a daze\"!) which is actually not too bad. That said, the actor was not well served by \"Euro-Cult\" (this is a Spanish-German production, despite the British involvement of the writer-producer and director), as can also be gleaned from his sole Mario Bava collaboration DR. GOLDFOOT AND THE GIRL BOMBS (1966)! <br><br>Price and co-star Martha Hyer are a couple engaged in a magic act (called Manderville, so that he is later mockingly dubbed \"Mandrake\"!) who are involved in the trafficking of women for the purposes of prostitution (they purposefully choose lonely girls to make them disappear both on stage and in real life but, of course, they are bound to slip sometime...because otherwise there would be no film!). Considering the subject matter and Towers' resume', this is remarkably chaste; in any case, the very first victim we see here (being transported in a coffin!) is none other than Maria Rohm aka Mrs. Towers. Her boyfriend sets on her trail, which leads him to Tangier, where he seeks the help of criminal pathologist George Nader (the hero inevitably played by an ageing Hollywood presence). Hindering their progress is local photographer Herbert Fux, while the proper Police investigation is carried out by Wolfgang Kieling (who had just been a villain, served with a memorable death scene, in Alfred Hitchcock's TORN CURTAIN {1966}).<br><br>Typically, the identity of the organization's head is a mystery to all; hence, the ultimate revelation proves quite a surprise...and, though it then transpires that Price was not as villainous as had been inferred, he still gets a melodramatic demise. By the way, I was surprised to notice the Maltese name of Charles Camilleri as the film's composer; actually, I had already heard his (only other film) work on Jess Franco's THE CASTLE OF FU MANCHU (1968) and, interestingly enough, he died a couple of years back right in my home-town!","user":"Bunuel1976","rank":[6,7]},{"title":"Let this my verdict be, baby...","rating":19,"date":"19 June 2005","review":"For bargain-basement Bond and a not-unpleasant 90 minutes, you could do a lot worse than \"Dolls.\" It was made right on the cusp between naughty and not-so-naughty exploitation. Nobody drops a bra, but, junior, you can tell the industry is just a step away from barin' the babes and bustin' loose those free-love vibes.<br><br>Plot is pretty standard: We've got a married couple getting ensnared by a white-slavery racket in Tangiers (location filming, by the way). It's got old pros Vincent Price and Martha Hyer in on the intrigue, and George Nader shaking off Rock Hudson long enough to fly over the pond and put this one away.<br><br>Mostly, it's all about beautiful babes swingin' their way through the swingin' '60s - and some of the most sluggish, haphazard and least- exciting fistfights you'll see in a long time. Maybe this is the key: It's a Spanish-German co-production. So... in Europe, the women are gorgeous but the stuntmen move like they're encased in slowly hardening lucite. Lotta hollering, too. <br><br>It's one of those odd movies that may leave you thinking: They need a dab more violence here. And less hollering.<br><br>And that closing song: EEEeeeee-Yowwww!!!","user":"SanFernandoCurt","rank":[12,17]}]