[{"title":"Frosty gets puppet-animated. Rudolph gets tricked. Children get confused.","rating":7,"date":"7 July 2003","review":"I guess the highlight of this feature film is that we finally get to see Frosty the Snowman in Rankin/Bass's trademark stop-motion puppet-animation process, Animagic! Now, don't get me wrong, the original TV specials \"Frosty the Snowman\" and the sequel \"Frosty's Winter Wonderland\" were great but I think we all wish that they were done in puppet-animation like Rudolph, Jack Frost and Santa Claus. Unfortunately, that may be one of the only highlights of this film.<br><br>At a running time of over 95 minutes, there is very little to keep the story rolling. There is also an over abundance of non-sensical plot twists and flashbacks that even I found confusing, let alone the children this movie was targeted for. And unless your child is a fan of showtunes (and c'mon what child isn't?), then the songs which appear every few minutes will most likely bore them.<br><br>The plot concerns the evil King Winterbolt who was put into a long deep sleep by the magical Lady Boreal. Upon awakening, he finds there is a new king of the North Pole named Santa Claus, and decides to make him get lost in a blizzard courtesy of his snow-breathing dragons so that he may once again rule the North Pole with his evil ways. The only problem is Rudolph's nose, which he decides must be extinguished for his plans to be carried out. In one of the many flashback sequences we learn that Rudolph's shiny red nose which came from the magic of Lady Boreal, will go out if it is ever used for bad purposes, even once.<br><br>King Winterbolt decides to offer Frosty and his family magic emulets that will allow them to visit the great 4th of July Circus by the Sea without melting, but only until the \"Final Fireworks Fade on the Fourth\". Santa Claus agrees to pick them all up when the fireworks end and whisk them back to the North Pole before the Frosty and his wife and two children are turned into puddles of water.<br><br>But, Winterbolt's snow breathing dragons whisk up a storm to keep Santa and Mrs. Claus from reaching the circus in time. Meanwhile, Winterbolt gets some help from a mean-spirited reindeer named Scratcher, and the two decide to use their sneaky ways to blackmail Rudolph into using his nose for bad.<br><br>\nIf this seems confusing, imagine actually watching this film or better yet, imagine a child watching this film! Like many of R/B's later efforts, this one is rooted more in the magic and mystical style of \"Life and Adventures of Santa Claus\" than the fairytale-ish style of \"Rudolph the Red-Nosed Reindeer\".<br><br>There are some crazy songs which I found very amusing, like \"Don't Let The Parade Pass You By\" which is sung by Ethel Merman in her crazy style. There are also some special guest stars including Jack Frost from \"Jack Frost\" and Big Ben the whale from \"Rudolph's Shiny New Year\". In fact, there are a lot of nice touches and this film with the three biggest stars of Christmas could have been really good, if only the writing were better, some of the songs were scrapped and the running time was shortened.<br><br>\nIf you are a fan of Rankin/Bass's work, you will not want to miss this one although you most likely will have trouble getting your kids to sit through the whole thing with you.","user":"josephbrando","rank":[13,13]},{"title":"A tad long, but nice to see some old friends...","rating":29,"date":"29 October 2002","review":"Okay, I'm a big fan of all that is Rankin/Bass, so I'm a little biased in enjoying this film.  I got to watch this film on a cold winter day, huddled up in some blankets and reconnect with some old TV X-mas friends from winter's past.  First of all it was nice to see Frosty and his clan finally made into clay-mation form.  The Frosty cartoons are great, but clay-mation makes it more original and unique.  Plus all the guest appearances by Big Ben, Jack Frost, Santa and Mrs. Claus from previous Rankin/Bass specials. Sure it is a long (over an hour and a half), but you do find the true origin of Rudolph's shiny nose!","user":"barlowman9","rank":[5,5]},{"title":"This is confusing","rating":19,"date":"19 November 2004","review":"May I ask you how old is Rudolph? Is he supposed to be an adult or a kid because I think Rudolph has to be the strangest character with a mysterious age. This story changes from one topic to the other. First we see that Rudolph's nose goes out,then Winterbolt's story, the origin of Rudolph, and all the way back to Rudolph's nose. They also have Christmas topics and July topics at the same time. Another thing, why are Frosty and his family the same size as smurfs because Frosty's short comparing to some other characters.<br><br>If Winterbolt wants children to love him better than Santa, then why couldn't he kidnap Rudolph and force him to guide him instead of trying to extinguish his nose. It would be easier for Winterbolt's plan to succeed in his goal. That should of been something Winterbolt tried to do. Winterbolt's Genie of the Ice Sceptor seems to be smarter than he is because he comes up with all the ideas and not him. I think Winterbolt's nothing without the Genie of the Ice Sceptor. When Rudolph defeated the snow dragons that Christmas Eve, Winterbolt did nothing to stop him.<br><br>My favorite part of the movie is Scratcher because he's funny and he's deformed. Won't people find it strange seeing a talking reindeer, live snowmen, and a warlock with snakes for a sleigh team because I do. I love this movie but some of the things make no sense or switching one plot to the other.<br><br>.......7/10..........","user":"POPADLJM","rank":[10,13]}]