[{"title":"Classic Horror","rating":3,"date":"3 February 1999","review":"Romero is sublime. His ability to take a small budget and turn it into a stratosphericly giant film is unparalleled. This is one of the best apocalypse films ever (along with the rest of the trilogy). The zombies represent a slow moving enemy. It is easy to escape them. You have only to fear your own mistakes. On these the zombies will capitalize. One of the best aspects of this film is the lead character. Romero has always presented intelligent non-stereotypical black characters in his films. This film was made in 1968 while civil rights tensions were high, and the most \"in control\" character in the whole movie is a black man. If you can get past a couple of cheesy supporting performances, this is one of the best horror films ever.","user":"codmon","rank":[147,166]},{"title":"Low budget, creepy and unique - legendary for a reason","rating":9,"date":"15 May 2005","review":"This landmark 1968 horror-shocker is a great example of what can be done with a limited budget, a simple idea, and some dedicated and talented participants. Very nicely shot, mostly well acted, NOTLD grabs your attention from the very beginning to the very end - and what a classic end it is.<br><br>The story begins with Barbara (Judith O'Dea) and her brother visiting the grave of a friend of their mother, and takes off almost immediately, as they are attacked by a horde of cannibalistic zombies. Narrowly escaping, but losing her emotional balance in the process, Barbara escapes to a house a bit farther down the road where she meets Ben (Duane Jones), the hero of the film. They discover a family with a sick little girl and a young couple in the basement of the house and they all get to work barricading themselves in and preparing weapons and other defenses. The rest of the story concerns the group dynamics between these survivors as the dead close in on their refuge, the story of what is going on in the rest of the USA - revealed through TV reportage and radio broadcasts, and sheer survival. The human side of this film is an interesting and accurate character study concerning what happens to people whose very lives are threatened.<br><br>The horror of this film is, unlike a lot of its recent descendants, less a matter of blood and gore than a matter of the real active horror of realistically depicted scenes of murder, death and cannibalism. Though the black and white footage involving blood and gore is certainly effective, there may not be quite enough of it for today's average horror fan. The photographic techniques of this film are innovative and powerful - showing just enough of the sheer hideousness of the film's basic concepts to disturb viewers, but not enough to allow them to detach from the film's protagonists.<br><br>I strongly recommend this film to anybody interested in the art of film making, and to those who enjoy the horror genre, though it is hard to imagine any serious horror fan who hasn't already seen this.","user":"mstomaso","rank":[152,175]},{"title":"\"Yeah, they're dead, they're all messed up\"","rating":9,"date":"26 October 2002","review":"I don't think George Romaro ever had in his mind the masterpiece he created when he made Night of the Living Dead, one of the greatest horror movies of all time and gave birth to the zombie genre. The monster that is the zombie has been a little experimented with before with the film \"White Zombie\" but never like the dark depths that George took it too. To think that this film almost never would have made it to the public since George threw it in the trunk of his car thinking nobody would ever buy it, low and behold not only did the film sell but has one of greatest group of fans to follow it. Such a degrading film for it's time with naked, scarred up, chewed up zombies eating human flesh, there was no film like Night of the Living Dead. The metaphor that we are guaranteed 2 things in life: birth and death, the slow inevitable death that is walking towards you as if you are looking at your future self is just horrific. George was way ahead of his time and that's why Night of the Living Dead still gives me nightmares to this day.<br><br>Barbra and Johnny drive to rural Pennsylvania to visit their father's grave. When Barbra is afraid Johnny teasingly frightens; whereupon they are attacked by a zombie. Johnny tries to rescue his sister, but is then presumably killed when the man shoves him head first onto a tombstone. Barbra flees, with the killer in pursuit; eventually she ran off to an empty farmhouse where she discovers the half-eaten corpse. Running out of the house, she notices a man named Ben arrives in a pickup truck, drags Barbra back into the house, and barricades the doors and windows. Meanwhile, hiding in the cellar are a married couple, Harry and Helen Cooper, their daughter Karen, and teenage couple Tom and Judy. Harry asks everyone to hide in the cellar, but Ben deems it a \"deathtrap\" and remains upstairs. As they fight through the night for their lives, they try to escape to a safe house but the zombies outside have pulled up the table with the salt and pepper and are a bit hungry for some human flesh.<br><br>George casted a black lead, which was so unheard of at the time, I'm sure he never looked at the color but what a groundbreaking moment. He's the smart man who knows how to fight and even hit a white woman, what risks George took with this movie. The film is by no means perfectly made, but you have to understand that this was a low budget film made by a group of friends, however, when you think compared to today's low budget films that have no story with it, it's all about the gore, Night of the Living Dead broke that mold. I have a little tradition every year on Halloween, I have to watch this movie because it is one of the best horror movies of all time. How could you not still get the chills when little Karen turns into a zombie and goes after her mother with a shovel, her mother screaming \"Baby!\" and falls crying and screaming as her daughter just continues stabbing her to death, God, what a horrific scene! Taking a chance with a depressing ending, not to spoil too much as I feel that I already have but I envy anyone who sees this film for the first time because I like to see their reactions to this movie. A groundbreaking film, a horrifying story and a cast and crew that gave all effort, Night of the Living Dead is a terrific scary movie not to be missed.<br><br>9/10","user":"Smells_Like_Cheese","rank":[51,56]}]