[{"title":"Dr. Suess + Chuck Jones equals to a classic cartoon.","rating":13,"date":"13 November 2005","review":"This has been a favorite Holiday cartoon since I was a kid.<br><br>Not only is it based off of a Dr. Suess book, the whole cartoon is done with Chuck Jones' Style.<br><br>Plus Boris Karloff is the voice of the grinch, and the Grinch song is sang by the guy who originally did Tony the Tiger.<br><br>The story involves this town of Whoville with citizens known as Whos. They love Christmas a lot. But the Grinch who lived high on a mountain top did not. He hates Christmas and the Whos so much he plans to steal it from the Whos. By dressing up as Santa Claus and rob every thing the Whos own.<br><br>Has the stuff you'd find in an average Chuck Jones cartoon. Including the style of the characters, Wille Coyoate like gizmos and Gadgets, and plenty of comedic elements.<br><br>The story to it is perfect. It's very memorable and enjoyable to see again and again.<br><br>It's highly recommend to Dr. Suess, Chuck Jones, Animation, and Holiday Fans.<br><br>It's a great Holiday Toon.","user":"emasterslake","rank":[23,25]},{"title":"A Christmas classic","rating":10,"date":"9 February 2004","review":"How the Grinch Stole Christmas! is the ultimate Christmas tale of greed, bitterness, but the ultimate moral of good and kindness of people. Dr. Suess wrote this fine tale that is read and watched on TV each year during the Christmas season. I think the reason why people love this cartoon so much besides good memories is that fact that we all need a good smile during the holiday season, and How the Grinch Stole Christmas is guaranteed to do that. The story is just so heart warming and also it's very cute and funny. The story has a memorable narration by Boris Karloff, also who sung the nasty grinch song. The story is so much fun to watch how one grinch could take Christmas so bitterly.<br><br>Each year down in Whoville, the who's are just getting ready for Christmas, it's always a joy each year to do so. They get presents, make a mighty delicious feast, and sing and dance with each other. But not everyone is so happy, there is a grinch that lives above them and doesn't want to celebrate Christmas one year. Maybe because his heart was just too small that he couldn't have a passion like the who's. But he's gonna steal Christmas along with his puppy, Max. But when he realizes that maybe Christmas might just mean a little bit more, he may have a change of heart.<br><br>How the Grinch Stole Christmas! is a must see film for the Christmas season. It's always a joy to watch each year and brings back happy memories of watching it with my family. The Grinch and Max are two of the most memorable characters since Santa Clause, this is such a touching story of how Christmas could be a little bit more than just gifts and dinner, but what it truly is; being with your family and friends and making sure that you are grateful for everything you have. I love this film and I'm sure you will too, I would say rent it, but you'll see it on TNT this Christmas.<br><br>10/10","user":"Smells_Like_Cheese","rank":[56,66]},{"title":"The True, Original Classic!","rating":10,"date":"20 November 2001","review":"There is only one TRUE version of the GRINCH and this is it. Practically perfect, this little cartoon has all the heart andbite and sweetness of the classic book. Between Karloff's wonderful reading and Chuck Jones' spirited animation and direction, this is a Christmas masterpiece. I cant begin to hide my contempt for the mega-budgeted, bloated, all flash disaster that Ron Howard made recently. Hey, fine, go crazy, what worries me is that small kids will ONLY see the Jim Carrey's latex puppet mess andnot the original. PLEASE seek this out for your kids. It is beautiful.","user":"shark-43","rank":[31,35]}]