[{"title":"Cheesey 80's action brilliance!!!!!!!!!","rating":10,"date":"10 May 2002","review":"From the stilted dialogue, through the ridiculous storyline, the amazing disco sequence and a rousing finale the sheer spirit of this FUN FUN FUN movie shines through. Forget all the computer generated fights of today, this how it was and should be. Over the top, funny, satisfying and possible. They don't make 'em like this anymore, and more's the shame.","user":"bouncywolf","rank":[43,51]},{"title":"Classic","rating":8,"date":"21 June 2005","review":"Before watching the movie I had in my mind that this was just going to be another dodgy movie but with a bit of van damme thrown in. How wrong. This movie truly is a classic, the cheesy music, (especially the end credits) brilliant montage scenes and especially the fighting itself. This isn't your traditionally badly choreographed Van Dammeesque movie but a very well done job. The fight scenes a lengthy and extremely enjoyable, and everyone in the movie can kick and punch very well. The main character Kurt McKinney (Jason) turns up the style later in the movie by pulling off some unbelievable training exercises, such as his two-finger one handed push ups! OK - so the acting is very ropey - but who cares! If you're looking for an enjoyable evening in and a self motivational movie - this is the one!","user":"solomonkain","rank":[37,45]},{"title":"Magnificently Awful","rating":3,"date":"29 January 2012","review":"This is my absolute favourite BAD movie. I love it.<br><br>The plot is ludicrous, the acting atrocious and the score is straight out of a Z-grade '60's Western. Barack Obama looks more like Bruce Lee than Tai Chung Kim.<br><br>But it's the dialogue that makes this movie great.<br><br>Who can forget Van Damme's immortal line: \"So, it is you!\"?<br><br>To be fair, Van Damme looks great and speaks little and there are some good fight scenes if you can stick it out.<br><br>This movie is so bad that I own a copy and watch it at least once a year. Laugh out loud from beginning to end.<br><br>A must-see. Preferably with a few friends and a bunch of beers.","user":"stuart-mccormack","rank":[21,25]}]