[{"title":"Flawed though it is, I have a soft spot for this film for its intelligent, non-ironic journey into darkness.","rating":8,"date":"23 January 1999","review":"William Peter Blatty can really write. Prose and dialogue. No argument. But can he direct a movie? On the strength of 'Exorcist III,' yes he can. This isn't to say that the film doesn't have its problems. On the contrary, its biggest problem, the out-of-character 'crowd-pleasing' SFX climax stops it from being one of the greats. So why do I have a soft spot for this film? If, like me, you appreciate horror films that are both scary and made for grown-ups, 'Exorcist III' is refreshing and memorable for its intelligent, non-ironic journey into darkness and for its refusal (bar that ending) to dumb down for the kids. If 'Scream' is your idea of a great horror movie, this isn't one for you! The cast is not nearly young and attractive enough, there are nowhere near enough gags (though Blatty's dry, sardonic wit is happily in evidence) and the film has no pretensions at being an autopsy of the genre, therefore somehow lifting it above the films it purports to comment on. 'Exorcist III' is literary beyond 'Scream's' self-referential trivia-chasing (I would love to hear Detective Kinderman critiquing that movie!) Read 'Legion' and you'll have an idea of how good the film should have been. Flaws acknowledged and accepted, don't miss out on Brad Dourif's best performance since 'Cuckoo's Nest,' scene-stealing turns by Ed Flanders and Nancy Fish, or the superlative production design, photography and sound. More than anything else, it's the atmosphere of the film that stays with me. I can recall very few films that have a better sense of the power of stillness and silence. So much of the violence is communicated only in dialogue; your mind reluctantly does the rest.","user":"Milo Jerome","rank":[66,71]},{"title":"A Brainy Horror Movie... not for everyone","rating":10,"date":"1 May 2006","review":"Most people go to horror movies for the emotional thrill, the gore and/or the adrenaline high of having things pop out and yell \"boo!\" Make no mistake: you won't find much of that here. So if you're looking for a movie that will make you spill your popcorn, you might wanna move on.<br><br>But if you're looking for a true psychological thriller (psychological = appealing to the intellect, not the viscera), this will be one hell of a treat for you. The dialogue is fantastic. The acting is superb (Brad Dourif &amp; George C. Scott on the same screen. What could be better?). The philosophy is provocative. And the mood is as thick as it gets. Much of the movie is composed of a series of dialogues between two people in a dark room. If you liked the second half of APOCALYPSE NOW, you will enjoy this immensely.<br><br>I rank this movie as one of my all time English language faves with the likes of AMADEUS, 2001, Alfred Hitchcock's ROPE, PICTURE OF DORIAN GRAY, and CITIZEN KANE. I'm serious; it's that good. Unfortunately, it was marketed to the wrong audience, and that's why it received such low ratings. Let me repeat: this is not a spooky movie. It's actually a very intellectual story with a lot of big words, literary overtones and powerful acting, and it's one of the few movies which I consider superior to the book (but of course writer Blatty directed this, so I'd expect no less).<br><br>Now don't get me wrong; it's anything but dull. There is one scene in particular that will scare the living crap out of you! It's a long scene done with one still camera, no music, no sound, hardly any action... but egads it's probably the most suspenseful/frightening thing I've ever seen in any movie.<br><br>In the style of the classic thrillers, so much is left to the imagination of the viewer--and oh there is PLENTY of disturbing, shocking stuff to imagine. In one conversation you'll hear about a murder so vile that you'll never want to hear the word \"catheter\" again. And the beauty is that you never see a thing. If this subtle style appeals to you, then you certainly won't be disappointed.<br><br>10/10. And I don't give 10s very often.","user":"rooprect","rank":[121,138]},{"title":"Legion: Exorcist III","rating":7,"date":"26 October 2004","review":"Exorcist III (1990) was the follow up to the classic Exorcist. Despite the number three next to the title, this was the true sequel to the first film. Writer/ Director William Peter Blatty wanted to simply call the movie \"Legion\" like the name of his novel. But the producers wanted to cash in on the Exorcist name so he caved into pressure. In Europe it's called Legion: Exorcist III. This wasn't going to be the first or the last conflict Blatty would have with the producers. The novel was a straight forward mystery/ thriller. The producer wanted some gore and \"exorcism\" thrown into the mix. Blatty wanted to make an atmospheric horror film, the producers wanted a prototypical 80's horror film. The producers wanted Jason Miller and an exorcism! Who won out?<br><br>The film follows the friendship between Father Dyer and Detective Kinderman. Meanwhile a serial killer is running around Georgetown gruesomely murdering the city's residents. Kinderman is called into duty and is puzzled by the brutal slayings. That is until he follows the clues and they lead him to a very unlikely place. Kinderman's faith in man is tested as he continues on through out this bizarre and seemingly never ending case.<br><br>George C. Scott is excellent as Kinderman. he plays the role of the detective as if he was tailored made for the part. Ed Flanders co-stars as Father Dyer. Nicol Williamson has a guest star spot as a Father Merrin type priest (his scenes seemed to have been added during post production because they don't fit in with the rest of the movie). The ending felt rushed and it has \"post production\" stamped on it. Word has it that the film was indeed tampered with during the post production. I think so to because the book's ending was far different than what was put out on the silver screen.<br><br>Is the movie worth watching? Yes it is because it's a worthy follow up to the Exorcist. Even though it was fiddled around with during the final phase of production, scenes seem to have been added and the ever presence of the producers looking over the director's shoulder, it's still a great film. I'm probably one of the few people who are actually satisfied with the movie. I wished Blatty could have the original version of this film restored. I enjoyed the book and the movie as well.<br><br>Highly recommended!<br><br>A majority of people hate intellectual horror films. What's wrong with having to think once in a while?","user":"Captain_Couth","rank":[100,114]}]