[{"title":"A delightful spectacle of various jazz's classic gems","rating":6,"date":"3 February 2005","review":"The merits of this picture lay rather in the execution of the great jazz scores than the plot itself - lacking and predictable. Starting by a little chronicle about the jazz development from its African roots till its further evolving into New Orleans and Chicago style, the story approaches the career's flourish of a young trumpeter Cooper, who falls for a \"stride\" piano player during the Great War. The movie also portrays the prejudice of higher classes against jazz valued as a 'vulgar' genre. A movie that certainly will apply the classic jazz lovers, with locations in Basin street and, at the end, a very special featuring of the most hot jazz players of early 40's as Benny Goodman, Charlie Barnet, Gene Krupa, Harry James, Jack Jenny, Joe Venuti, and Alvino Rey, not forgetting the special appearance of Connie Boswell singing \"under a falling star\". As against another movies as \"Alfie\", \"anatomy of murder\" or \"Ball of fire\" which conciliate good scripts with good music (Sonnie Rollins, Duke Ellington and Roy Eldridge respectively),Syncopation, even unprovided of a consistent story, still is a delicious option in order to evoke one of the most fruitful music period in this century.","user":"EvelynGrasielaPetersen","rank":[15,18]},{"title":"Le jazz hot!","rating":10,"date":"15 July 2009","review":"I came away with a different slant on this film than the other reviews I've seen here, so let me just say that for 1942 this terrific little love note to jazz is remarkably progressive for its day. While it's true that the plot ultimately leads to the white jazz stars of the early '40s, it is true to the roots of jazz and even includes a scene where an adult black musician calls an adult white musician \"boy\" and it's clear who's teaching who. This movie is as passionate about hot jazz music as were the people who created it, and it shows.<br><br>Also, the plot is not as thin as many such films. It has the production values of an \"A\" picture, and its three stars were not exactly \"B\" list talent. It sometimes stretches credulity, but no more so than any other musical, and in fact even less so, considering that the music is an inherent part of the story.<br><br>Here's hoping TCM shows this again soon; I'd love to record and keep it, as I doubt an official DVD release is in the offing.","user":"abchulett","rank":[7,8]},{"title":"a Roman a G clef","rating":5,"date":"14 August 2008","review":"This movie was made just a few years after the publication of Young Man with a Horn, a fictionalized homage to pioneer jazz cornetist Bix Beiderbecke who had died in 1931 at the age of 28. The film story parallels Beiderbecke's career more closely, although still fictitiously, and with the bluebird of happiness making an improbable appearance in the last reel. At the beginning of the movie, you could be misled into thinking the story is going to be about Louis Armstrong, for his fictional equivalent is the first shown. But the plot takes us north and Louis is left behind in New Orleans to reappear only briefly years later for an odd non-depiction of the legendary all night jam session featuring Bix and Louis. By \"non-depiction\" I mean that none of the playing at the session is heard, just a shot of the musicians looking weary as the sun comes up. To my thinking, this was a missed opportunity as Louis was alive and well when the movie was made and could have provided a sound track, and the Bix character's playing was done by Bunny Berigan, who had played in bands with Bix, and who could have stood toe to toe with Armstrong in a jam session for some really exciting music.<br><br>Oh, I almost forgot. There is some sort of a plot involving a girl and her father. They quickly become totally irrelevant.<br><br>The listing of the famous swing musicians in the cast of characters is very misleading: they do not appear in the story at all, just in a tacked on musical number at the end.<br><br>To sum up: the movie is something of a formless mess. It will be of interest only to Jackie Cooper fans and Beiderbecke fans curious about another fictionalization of their hero's life.","user":"NewtonFigg","rank":[8,12]}]