[{"title":"Creepy and fascinating","rating":8,"date":"28 March 2004","review":"A woman and her aunt go to Scotland to locate her evasive fiancé. This is a much-maligned film because of its denouement, but up to that point, it's interesting, well-acted, eerie, and with fine set design (by William Cameron Menzies, developed for 3-D projection). Veronica Hurst is captivating and genteel, sort of a chic British Marilyn Monroe, still in love with Richard Carlson, who is hiding a family secret in his forbidding castle; there are even bats in the belfry! It moves leisurely until the final extraordinary set-piece, when Hurst and her aunt (Katherine Emery, also the narrator), sneak out of the castle in the night to venture into the maze (pre - \"The Shining\" - 1980) and find what they're looking for in its center. As a kid, I always remembered this sequence - there's nothing scarier (or claustrophobic) than not finding your way out of a 10-foot high maze of hedges. Naturally, the two women get separated, setting the stage for engrossing suspense with horrific music. The final result is mildly disappointing really, since Carlson's epilogue {a \"Psycho\" (1960) style postscript} makes some sense to all the goings-on, even provoking sympathy. Worth seeing.","user":"twanurit","rank":[31,32]},{"title":"Fine Fifties Fear","rating":7,"date":"30 July 2005","review":"I remember this film of old. It's a great, chilling, atmospheric horror picture about a man who moves into a Scottish castle, only to discover that there are strange goings-on in the corridors at night. And there are even stranger events taking place out back, in Hollywood's most familiar hedge maze. Yes, this is the maze you've seen in every feature-length film that ever involved a topiary puzzle, up to and including \"The Shining.\" But the punchline to this story is about the last thing you would guess. I certainly didn't see it coming. This is a fine example of how good and convincing a movie can be even when the premise is utterly loopy, bordering on laughable. I'd recommend it to anyone.","user":"eileenmchenry","rank":[30,32]},{"title":"If you didn't see this in 1953, you have NO idea","rating":7,"date":"25 January 2001","review":"Is this a good movie?  It's hard to say -- but in 1953, for many people, it was a remarkably effective movie, suspenseful, scary and then, amazingly, actually touching when \"the old gentleman\" meets his unhappy death at the end of the movie.<br><br>Yes, what lurks in the Maze turns out to be something of a surprise and, for a lot of people, a hilarious one.  But the basic idea (ontogeny recapitulates phylogeny) was a very real one at the time the book was written, and does have some basis in fact.  Not that it would ever result in what we see in the movie, of course.<br><br>But working on what must have been a very low budget, one of the greatest production designers -- and the person for whom the term \"production designer\" was invented -- creates a very eerie mood that was strangely compelling.  At times, of course, the movie is very silly, but it has its moments.","user":"Erewhon","rank":[20,22]}]