[{"title":"Marital Blitz","rating":8,"date":"4 September 2004","review":"Give Danny DeVito the right story and he clicks. He does it here.<br><br>What do a tornado, a hurricane, and an ex-wife have in common? They all get the house. Except when the husband's lawyer manages to dig up some rule that allows the husband to stay in the house as long as he and his wife lead separate lives.<br><br>The husband is Douglas, the wife is Turner, and the lawyer and mediator is DeVito. There's also a housekeeper and two not especially lovable children (thank heavens for small favors) but they're probably less important than the husband's dog and the wife's cat.<br><br>So how do two rich yuppies lead separate lives in their mansion? Simple. First they ignore and curse each other while passing on the stairs. \"Filthy slut,\" mutters Douglas. \"Bastard,\" murmurs Turner. Finally Douglas proudly shows DeVito a plan that he has worked out with Turner. It is a blueprint of the house, divided into red, green, and yellow sections. Douglas explains that the red sections belong to him, the green sections are hers, and the yellow rooms are neutral. \"I had a little trouble with the kitchen,\" he says, \"but we worked out alternative hours.\" DeVito is aghast.<br><br>\"This seems -- RATIONAL to you?\" Douglas: \"I'm gonna win this.\" DeVito: \"Oliver, nobody WINS anything here. There are only degrees of losing.\" And Douglas leans forward conspiratorially, grins insanely, and whispers: \"I got MORE SQUARE FOOTAGE.\"<br><br>It's Douglas's best performance, I think. He's not a simple outraged bourgeois, as in \"Fatal Attraction\" or \"Basic Flaw\" or whatever it was. And his character has more dimensions than his Gordon Gekko, and almost as good a name. The couple eat at opposite ends of a long empty table, like Charles Foster Kane and Emily. Douglas is waiting for an important phone call and is a bit anxious. He pays no attention to his wife sitting motionless and silently, staring at him. He stabs at the food on his plate and slices it viciously. And watch the half-demonic expressions that play across his face as he attacks and eats his food. The scene is an almost perfect embodiment of black comedy because, in context, it is outrageously funny -- but it could have been yanked straight out of a horror movie without changing a thing.<br><br>It's a fine script and DeVito does well by it. I guess it gets a little tiresome by the time they're chasing one another around the darkened half-ruined mansion, nailing boards over windows and unloosening nuts, and throwing plates. And when in the midst of their hatred, Turner serves the pleasantly surprised Douglas her superlative pate and then claims it was made of Benny's liver, I could have done without the quick shot of the living Benny in the bushes outside. But those are relatively small acnestes bracketed in a very funny movie.<br><br>There is a crazy logic to the story too. The couple begin by loving one another but are then separated by, well, THINGS. Douglas works very hard to make enough money so that his wife can find and furnish a perfect home for him. A little tritely, Turner discovers that she has grown not only to dislike the distracted Douglas but to hate him, so she wants her independence. Initially, the little frictions are minor. With a table full of dinner guests that Douglas is trying to impress, he asks Turner to explain how they happened to acquire the Baccarat wine glasses they're using. Nervously, she begins with a trip to Paris but so many dependent clauses intrude themselves that her narrative begins to resemble a 19th-century German sentence. So Douglas cuts her off: \"To make a long story short.....\", and wraps it up in two declaratives. (I can't emphasize too strongly how deftly DeVito handles this scene. Absolutely none of the irritation is spelled out except by the actors and the camera and editing, and yet we are left with a full understanding of the little disaster that's just taken place and the empty anger that follows.) The gathering enmity shows up in tiny ways. \"I just wanted to push you,\" Douglas says to his wife's back, trying to explain some rudeness. \"After all, everybody needs a little PUSH once in a while.\" (He picks up her cat and flings it aside.) And after his big dinner with his superiors, the couple are in bed and Douglas worries a little. \"I hope they didn't notice what a jerk I was.\" Turner: \"They never seem to.\" Douglas is so smug that the barb sails completely over his head. It's like Neal Simon, if Simon had become delicate. <br><br>The humor, if that's what it is, grows more physical and in some ways less funny. Douglas, drunk, urinates on some fish while Turner is giving HER big dinner for potential customers. In turn, while the assembled guests watch open-mouthed from the doorway, she revs up her two-million horsepower SUV with the big knobby tires and the 20 mm cannon on top and noisily smashes into his tiny classic Morgan convertible. Then she backs up and drives completely over it with Douglas inside. Douglas emerges shakily from the compressed car and says, sounding perfectly reasonable, \"Look, I don't want to create a scene. I mean, I live in this neighborhood too.\"<br><br>See this movie if you have a chance. I would recommend it even if it weren't so good, simply on the basis of the last scene between the Roses. They have fallen 30 feet on a chandelier and lie dying next to one another. With his last bit of energy, Douglas manages to move his hand lovingly on her shoulder. And just before she dies, without being able to look at what she's doing, Turner reaches slowly out, puts her hand over his, and flips it away.","user":"rmax304823","rank":[24,28]},{"title":"HE is HER victim","rating":9,"date":"16 October 2002","review":"A classic feature of Danny DeVito's (far too few) works as a director is that they are utterly evil. Cruel. Wicked. Merciless to their characters and merciless to the viewer. Although this is often combined with slight exaggeration, it is exactly what I love about them.<br><br>After seeing The War of the Roses the second time after having grown a little older, I still feel that particular satisfaction. But this time, there are a few more things I think about, a few more questions I ask myself. For instance: who is the bad guy in the film? Who is `to blame'? And although it's clear that the Roses both have extremely unmoveable and stubborn characters, which partly leads to the catastrophe, I came to the conclusion that Barbara is the driving force of the whole divorce story. She announces her wish to divorce upon grounds that are not quite convincing. Maybe people who do not like Michael Douglas can sympathize with her but her reasons are not fair. She invariably follows her instinct without paying any respect to other people. Kathleen Turner portrays her most believably in this insufferable phase.<br><br>Oliver Rose, on the other hand, is one of those people who are proud of doing everything in a perfectly correct manner. He is therefore very sensitive and easily confronted if one doesn't acknowledge his correct behavior. He then becomes completely helpless and unable to react properly. That makes him an ideal `victim' to Barbara's striking egoism.<br><br>\nI'm mentioning this only because it is a new aspect I found during second viewing, and I am sure it was also DeVito's intention to develop characters like this, so for him, the turbulent divorce story is not just a parable on how stupid people are in general. He of course reserved the best role in the film for himself  he is the wise man who tells the parable and who emerges victorious in the end.<br><br>The War of the Roses with its merciless cruelness remains one of my favourite comedies of all time.","user":"Mort-31","rank":[68,88]},{"title":"not your typical Hollywood yukfest","rating":8,"date":"2 June 1999","review":"Director Danny Devito and the writers are to be credited for following  this story's dark premise straight to its grim conclusion, and not  opting for a cop-out 'happy ending'. Maybe that accounts for the  movie's relatively low user rating. Whatever. Turner and Douglas are  superb here. I saw Douglas on the Carson show after the movie came out,  relating how, after a day's shoot, he and Turner would get together to  remind each other that they were still friends. Seeing the movie shows  why they had to do this. Note how the movie begins in the openness and  light of Nantucket in summer and gets progressively darker, ending in  the claustrophobic closeness of the nailed-up house. A classic black  comedy for grownups. Don't watch this one with your spouse unless you  are on really good terms.","user":"rupie","rank":[38,47]}]