[{"title":"Best underrated sci-fi action classic Van Damme martial arts movie!","rating":10,"date":"2 January 2016","review":"Cyborg (1989) is one of my favorite Van Damme underrated Post-Apocalyptic,Science Fiction Action movie from the late 80's. The film is Very fast-paced, under 90 min., cool post apocalyptic setting, very epic, they are great villains in here, Awesome ass kicking with the knife boots, Great score, Van Damme did a awesome job showing body language/presence, and I knew I wasn't the only one who thought Van Damme had a Badass walk. <br><br>Very underrated indeed. Jean-Claude Van Damme is still today, one of my favorite action stars, I absolutely love his movies from his golden years. I grew up watching Cyborg as a kid. The movie wasn't my favorite Van Damme movie. I did not watch this movie so many times on TV, like I have watched other his movie that I love. Watching countless today this flick, I fall in love with it and it become one of my favorite Van Damme movies.<br><br>In the barbaric, plague-ridden wasteland of the 21st century, a beautiful half-human cyborg carries information that can save civilization. But only the strength and cunning of a lone warrior (Jean-Claude Van Damme) can deliver her --and her vital data from the clutches of the unspeakable Flesh Prates. That is the main plot about this film, that it also involves revenge and the human character played by Van Damme, which his character has a heart! <br><br>I absolutely love Cyborg. Jean-Claude Van Damme did a solid job acting in this movie, which I thought was very brilliant and very fast paced. Sort of the movie reminds me on Mad Max 1 &amp; 2, which I absolutely love those movies and Conan the Barbarian (1982) with Arnold Schwarzenegger in the lead role. Because Fender kills Gibson's family and Gibson goes out for a revenge. He travels in the post apocalyptic world in which a plague known as the living death cripples civilization. When Gbson (Van Damme) was tied and was hanging from the mast watching into the sky, the similar scene was used in Conan the Barbarian, even Conan was looking for the people who killed his family. That is why Cyborg reminds me on these movies, they are my favorite. As a kid I still remember seeing the VHS cover in the store of Cyborg and I was impressed. I could watch this movie countless times. I hope I could get this movie on Blu-ray someday but, that will be really hard.<br><br>Considering its' low budget, it's an entertaining flick. Great fights, cool villain, great scenes (like the 'crucified scene')... I seriously love Van Damme's kicks with boot knife. I love when Van Damme yells FENDEEEERRR... The final fight between Gibson and Fender was absolutely epic. The similar scene was also in Universal Soldier. I think cyborg is a bad ass film from Cannon Group. It is a shame that they can't make any movies today anymore.<br><br>I can say something about the actors and the whole cast crew: Beside loving Van Damme in here: actress Deborah Richter as Nady Simmons, the girl who helps Van Damme, killing Fender (Vincent Klyn) and finding Pearl (Dayle Haddon) a female cyborg caring a cure, did a terrific job, she was very awesome gorgeous and very beautiful sexy. Haley Peterson as Haley the sister of murdered family by Fender, was extremely gorgeous and fast feisty sexy babe on the screen ever. Vincent Klyn as Fender the leader of pirates, was a real bad ass villain ever. I wish they would make movies like this today! About the sequels I don't care they all suck ass! Once I watch Cyborg 2 with Angelina Jolie and Elias Koteas and that movie sucked! Director Albert Pyun made a great job as the director. He directed terrific the angles of the picture.<br><br>Cyborg is a 1989 science fiction post apocalyptic film starring Jean-Claude Van Damme as a mercenary who while traveling the wasteland of what was the Eastern United States finds himself protecting a woman who could hold the key to restoring humanity. The film was directed by Albert Pyun. More action and high flying kicks, nothing new, except for a fun plot...to this day I still choose this movie over any other pointless movies that lead to nowhere. This movie get's a perfect 10 by me. I love this flick to death!","user":"ivo-cobra8","rank":[99,115]},{"title":"Hmmm.. I really liked this movie, the whole package was there!","rating":8,"date":"24 January 2006","review":"I usually destroy van damme movies in my reviews, but strangely enough this film by Albert Pyun is a classic and deserves recognition. I thought the costumes which people seem to call them were very well created and lots of thought went into every costume. I didn't see one single flaw in the production. I thought the freehanded and airbrushed visual of a deteriorating city at the opening credits was very creative and interesting.<br><br>There's something different about this films footage, I cant tell if its the kind of film they used but it seems very contrasty and almost has a grainy kind of look to it but very hard to explain. You'll recognize it as being unique when you see it. The chase scene where van damme fights 2 pirates in a swamp and then gets captured is phenomenal. The camera angles and shots were fantastic, and the crossbow crucifiction only makes it sweeter! haha Van damme hits his acting stride in this movie and really manages to convey the emotion in his revenge. Especially the part where he chops down the cross with his heel to escape his soon coming death.<br><br>The best asset in this movie is the well designed apocalypse city sets, and the 2 story abandoned building set complete with pillaging pirates. The music and whatever that cape brandishing maniac was saying was outright terrible but if your not a jerk you'll understand why this movie deserves an eight out of ten.","user":"saico13","rank":[44,57]},{"title":"A lot of fun, if you don't take it too seriously!","rating":7,"date":"23 January 2019","review":"I used to rent this movie all the time as a kid, as I've always enjoyed apocalyptic movies, and I still do. This movie is the classic \"hero's tale\". It has some great action sequences, gore and cinematography. It was also made on a shoestring budget by one of my favourite defunct film companies, Cannon!","user":"mrhowell-86699","rank":[6,6]}]