[{"title":"Powell and Pressburger at their finest","rating":9,"date":"14 February 2005","review":"This wonderfully charming film from the Powell and Pressburger team is probably their most underrated great work: the most recent \"Sight and Sound Critics Poll\" of British films didn't even include this gem in the top 100. If it means anything, \"Trainspotting\" was in the top 10.<br><br>What elevates the film beyond other light-hearted romances is chiefly the impeccable acting and tight screenplay by Emeric Pressburger, probably the greatest English screenwriter to have ever lived. This might be generic laudation to any film, but by no means is Wendy Hiller's performance generic. As the young gold-digger-type woman, Hiller is slightly bewildered at being sidetracked to the Scottish natives, but she is much more fluxed when she realizes she is falling for a common Scotsman, and not the rich lord she envisioned. So what is the reaction to this bafflement? A fierce sense of panic that is very honest in its depiction of desperation. It might be puzzling to the viewer why our heroine should seek royalty so vehemently, but because of Hiller's expert frenzied facial tics, we see her slowly realize her ridiculousness herself. In an age where critics desire constant plausibility and \"believability\" in romances, Pressburger reminds us that attraction is something that can largely be out of our control. Hiller's character, an obsessive control freak, is the perfect example of one who cannot comprehend this fact.<br><br>The perfect foil for Hiller's hysteria, of course, is Rover Livesey's soft-spoken Torquil Macneil. Before Ashton Kucher-like effete twigs came to dominate on-screen masculinity (or Vin Diesel-like muscle-studded goons on the other extreme), the quiet dignity and charisma of a man like Livesey could light up a screen without any histrionics or wrestling moves. Those still looking for romantic realism will recognize that like Hiller's character, Livesey is just as strong-willed, and more importantly, is a match in wits and a counterbalance in earnest, world-weary personality. Their mutual attraction is perfectly played out in the strangely electric silences as much as the dialogue.<br><br>But the performances enhance what is already a remarkable script. The very basic premise of the love story can be read by many other astute reviewers on this website who also see the merits of this film. Powell and Pressburger have always been smart enough to embed their love stories with some heavy ideas: in \"The Red Shoes,\" it was love vs. art; in \"I Know Where I'm Going!\" it is love vs. money. Sounds simple enough, but unlike other romances, these filmmakers can glean insights on the definition of poverty. While primitive (the one phone in town is at the post office) and poor (the staff in charge there can't break change for a pound), the villagers are portrayed affectionately with class, dignity, and culture, especially in a wonderful dance scene that seems to affectionately embody both a small community's close familiarity with one another, as well as the drunken festival spirit. Like Livesey's character says at one point in the film, \"They aren't poor, they just haven't got any money.\" It's a succinct but revealing statement about the human condition in a time where money did not necessarily determine one's social class because of many other admirable factors. Contrast this cultural milieu with a film like \"8 Mile,\" in which the characters are \"real\" if they are from the \"streets\" or living with trailer trash parents, and \"phony\" if they have an education from a private school, and you can see how our self-important attitudes are progressing.<br><br>Lastly, I must mention that this is one of the most exquisitely photographed black and white films I have ever seen, and the Criterion remastering does the film ample justice. I have been harping on the merits of the high-mindedness of Pressburger, but the appropriate plaudits must be dealt for Powell's emotionally expressive vistas that equal his achievements in \"The Edge of the World.\" From the craggy peaks of the highest cliffs or the frothy waves of every bank, the film's mystic sense of ambiance is drawn by a foggy mist that pervades most scenes. For once, grand scenery doesn't dwarf the characters; every picturesque shot either captures the characters in the beauty of the element, or is intended as a complement to the characters' emotions. It's a great film.","user":"TheHumbleCritic","rank":[107,114]},{"title":"One of a kind","rating":10,"date":"26 December 2000","review":"It's really \"It Happened One Night\" -- spoiled girl, on the way to wed  her rich fiance, is escorted by a younger man and falls in love with him -- but it's so much more. Powell's and Pressburger's imaginations are boundless. They create characters who are lovable eccentrics, but believable. They shift tone effortlessly from comedy to thriller to travelogue to romance and back again. They employ every resource of cinema, without being showy about it: watch the camera tricks in the first ten minutes alone. They fill the movie with diversions that have little to do with the plot but create a beautifully picaresque atmosphere. <br><br>I don't know of any other movie that is so inconsequential on the face of it, yet packs such an enormous emotional wallop. Ostensibly an assembly-line romantic comedy, it's really about spiritual growth, opening yourself to all sorts of new experiences and learning to see things from others' points of view. It's whimsical, but not thin. With its moody photography, wonderful musical score, and numerous coups de cinema, it lingers in your memory months after you've seen it. And the ending is one of the most satisfying in all the movies.<br><br>One minor complaint: Hiller is a tad too steely in the beginning, too crisp, too calculating-actress-playing-calculating-character. As she succumbs to the charms of her surroundings and her leading man, though, she's bewitching. And Livesey has one of the most beautiful speaking voices you'll ever hear. Their chemistry is terrific. And when he recites a Celtic poem ending in, \"you're the one for me,\" and looks right at her, it's quite sexy.<br><br>There's no other movie quite like it. And I defy anyone to see it on a date and not fall in love with his/her vis-a-vis.","user":"marcslope","rank":[91,98]},{"title":"One of my all time favourites","rating":9,"date":"23 September 2002","review":"I take this down once a year and watch it as it delights me on so many different levels.<br><br>I love the character portrayed by Wendy Hiller, an independent woman, confident of the direction of her life, the wealthy husband she has selected, the wedding just around the corner.<br><br>Then her plans start to unravel as an impoverished laird walks into her life and it is never the same again. Roger Livesey is wonderful in this also and the location shooting in Scotland, even though B &amp; W, is breathtaking. The music, particularly \"My Nut Brown Maiden\" is beautifully done along with the old ceilidh dancing.<br><br>Some wonderful bit parts also. Loved Petula Clark as an eccentric child. Trivia lovers: I had read that Roger and Wendy were not physically together throughout the making of this movie. In all of the shots of them together, body doubles and reaction shots were used. I have viewed it in the light of this knowledge and it could be true.<br><br>Also, for those of you from across the pond and of an older vintage, Roger Livesey played Doctor Dale for years in the BBC's \"Mrs. Dale's Diary\".<br><br>I gave it a 9 out of 10. Certain movies are just \"Satisfying\" and this is one of them.","user":"wisewebwoman","rank":[49,53]}]