[{"title":"Holidays are only complete with this movie","rating":31,"date":"31 December 2002","review":"My Christmas is filled with ritual, as I guess most people's are. Part of that ritual is National Lampoon's Christmas Vacation, about which I have nothing but good things to say. This should be part of your Holiday season too, because despite it not seeming like it all the way through, the film as a whole is just so thoroughly festive, cheery and good-hearted.<br><br>\nIt opens with a great set-piece, Clark taking his family out in the \"front-wheel drive sleigh\" to dig their Christmas tree out of the snow-covered ground. He's a desperate loser, but you have to love the guy, working his butt off to give his extended family the perfect Christmas. (That's the difference in this Vacation movie, by the way - the Griswolds don't go anywhere, their folks come to them).<br><br>So the shenanigans finding a tree set the pattern for a season of chaos, fighting in-laws, squirrels, stupid relatives, huge dogs, snooty neighbours and collapsing turkeys. And as if that wasn't stress enough for poor Clark, he's waiting for his Christmas bonus to come through to cover a cheque he's already written.<br><br>The script brims with festive jollity, enthusing the audience with Clark's excitement for the holidays. Stand out moments include the welcome (and hilarious) return of Randy Quaid as Cousin Eddie, the uber-hick sponger with a trailer-full of weirdo kids and rubber sheets, and Mae Questel's appearance as Aunt Bethany. She used to voice Betty Boo, and plays the crazy old woman to perfection.<br><br>See this movie. Get it on video. I normally watch it the first time on a miserable October Sunday, when I start to think properly about Christmas. Nothing can replace this movie as the one thing guaranteed to get me looking forward to late December. Fabulous stuff, and as festive for me as tinsel and carols. Cuddle up with this one.","user":"cmqp","rank":[163,191]},{"title":"I really can't imagine a better and funnier Christmas movie","rating":10,"date":"22 February 2014","review":"I think it's not necessary to write too much about this film.It's simply a masterpiece.In my opinion only Billy Wilder possibly-POSSIBLY-could have made an even better Christmas movie.For me that says a lot.<br><br>This is my second review.The first one was about \"Rambo II\" It's difficult to imagine something more contrasting than these two movies.<br><br>Whereas \"Rambo II\" represents (and shows) the bad,evil and disgusting things on earth,\"Christmas Vacation\" represents (and shows) the good,pleasant and beautiful ones.<br><br>For example the incredibly beautiful woman in the store.Chevy Chase's reaction is so funny!! And quite understandable as well.Who wouldn't have reacted similarly...<br><br>All characters-really ALL-in the movie are played excellently. Yes,also Audrey's.Juliette Lewis had to play the same character as,for example,Pamela Tiffin in \"one,two three\"-more or less a silly goose.<br><br>It's quite understandable If you don't like such characters-but-as in the case of \"one,two,three\"-why blame the actors for playing them convincingly? By the way,Griswold's yuppie neighbors also don't make a very pleasant impression- because (not although) they are played so well.<br><br>For me-and obviously for many others too-Christmas without \"Christmas Vacation\" cannot be a real Christmas.I would like to watch it more often than once a year,but I have the-unjustified,many may say-fear of liking this masterpiece somewhat less if I watch it \"too\" often.","user":"krautR-930-608582","rank":[37,41]},{"title":"Best Vaction/Christmas Movie","rating":10,"date":"14 November 2000","review":"Poor Clark Griswold, no matter how optimistic he is, his family vacations always seem to go severely wrong. First time around he went across America in a metallic pea Station Wagon and it ended in disaster. Then they went across Europe and met similar, albeit much less funny, results.<br><br>For those of you who are unfamiliar with the Griswolds, Clark is food additives expert who works for a company that doesn't appreciate him. He sets high standards for holiday events that no one can live up to and is notorious for dragging his grudging family along on every painstaking detail of every scheme. His wife Ellen (Beverly D'Angelo) is the voice of reason, who keeps the family rooted in reality and responds with frequent deadpan bewilderment to his constant disasters. The long-suffering kids, Russ and Audrey (Johnny Galecki and a very young Juliette Lewis) have turned into the living embodiment of pure cynicism, but there's no talking any sense into Clark Griswold. Ever! <br><br>But now Clark just wants to stay at home in the snowy Chicago suburbs for a 'fun, old-fashioned, family Christmas' and he's going to let nothing stop him. His enthusiasm for the holidays manages to infect the audience and you'll be rooting for him the whole way. He's an anti-Scrooge and if you're having a Christmas crisis then you need to watch this movie. Any disasters can be overcome.<br><br>But that's easier said than done. He didn't bargain on bickering family members (including the voice of Betty Boop, Mae Questel, as a senile old aunt), a house covered in non-working Christmas lights, a seriously over-cooked turkey, snotty Yuppie neighbors making fun of him or Cousin Eddie (Randy Quaid) and his hickabilly family turning up unannounced to sponge some Christmas cheer off him.<br><br>What stops it from being just another generic Christmas movie is a brilliant script by John Hughes packed full of hilarious set-pieces and perfect comic timing from Chevy Chase. He's a great actor but his appeal sadly declined in the 90s when he refused to evolve into more serious roles like Bill Murray did. Clark Griswold and Fletch are probably his most famous roles and this Vacation is definitely one you need to take.<br><br>It's hard to pick the best moments but Randy Quaid's sudden appearance will make you grin a mile wide, a cat wrapped up in a box (with Happy Birthday paper!) that meets an unfortunate end and 'an asshole in his bathrobe emptying a chemical toilet into the sewer' are just plain brilliant. But what gives Christmas Vacation something more that makes it so much more special that all the other Christmas movies is that wonderful theme song! It's absolutely brilliant! But that ain't the only great tune the film as to offer. There are also some classic songs by Ray Charles, Bing Crosby and Gene Autry.<br><br>Although not the best of the bunch (Harold Ramis' direction had an evil edge to the first film that made it just that little bit better), this film has become a Yuletide classic and must be watched every year. Since Christmas is full of annual traditions this film is definitely one you should add to the list. It would criminal to give it anything less that the highly coveted 10/10.","user":"CuriosityKilledShawn","rank":[112,136]}]