[{"title":"How terrible is wisdom...","rating":9,"date":"5 February 2005","review":"... when it brings no profit to the wise? On the surface, that seems to be the moral of \"Angel Heart.\" But look a little deeper -- the fact is, Harry Angel knew the truth all along, and here's the true moral:<br><br>\"However cleverly you sneak up on a mirror... your reflection always looks you straight in the eye.\"<br><br>Much of the meaning in this dark tale lies in the above line uttered by DeNiro's character, Louis Cyphre. We can pretend to lie to ourselves and bury our heads in the sand, but in the end we know. And it isn't the knowing that hurts us, but all the hiding and lying that went on before.<br><br>This film has been summed up many times before, so I won't do it again. It's also been said that the film was ahead of its time in 1987, and IMO this can't be emphasized enough. There's no doubt in my mind that it's been an influence on many a filmmaker and screenwriter. Among films of this type it's easier to follow than, say, \"Memento,\" but more befuddled and confusing than \"The Sixth Sense.\" You may or may not guess the ending, but if you're the type who's bothered by confusing movies -- simply read all the spoilers or the whole screenplay, THEN see the film! I guarantee you won't enjoy it any less for knowing.<br><br>Cinematography 10/10, screenplay 7/10, acting 9.5/10, overall I'd give it about a 9/10. If anything makes this movie great (and qualifies it as a classic) it's the cinematography and atmosphere. It really is richly and gorgeously shot, and atmospheric to the nth degree. Watch it on a slow day when you have time to savor these things and aren't overly anxious to figure it out or discover the resolution to the story.","user":"The_Core","rank":[179,197]},{"title":"Entertaining, thought-provoking/smart, well-acted and brilliantly photographed and directed -- what more could you ask for?","rating":9,"date":"2 September 2004","review":"Angel Heart is a winding psychological thriller that -- in 1987 -- was far ahead of its time. So far that audiences didn't `get it' and the film bombed at the box office. Only now are we beginning to see endings like this one surface in horror movies. Had Angel Heart been made a decade or so later, perhaps it would have succeeded.<br><br>As it is, the movie  which has a strong cult following and was recently re-released on a Special Edition DVD  is nothing short of mesmerizing. I wouldn't go so far as to call it great, or a `masterpiece,' but it is scary, disturbing, influential, thought-provoking, and a lot smarter and more atmospheric than 99% of the rip-off horror movies being made today.<br><br>It stars Mickey Rourke as Harry Angel, a private eye from Brooklyn in the 1950s who is hired by Louis Cyphere (Robert De Niro) to locate a mysterious singer named Johnny Favorite, who disappeared in the early 40s and hasn't been seen since.<br><br>Angel's journey takes him from the streets of New York to jazz clubs in Harlem and, finally, to the sweltering swamps of Louisiana. He meets a variety of characters, all of who have little to say about Favorite. All we seem to know is that he was a singer, entered the war, and was shot, had his face reconstructed, was taken out of hospital care, and apparently vanished from the face of the earth.<br><br>I guessed the twist of the movie about seven minutes in, as soon as Robert De Niro appeared on screen during an extended cameo. <br><br>But that's not to say that the movie won't affect you. Notorious when released for some controversial scenes (including a sequence involving Rourke and The Cosby Show's Lisa Bonet), the movie's moody atmosphere is its strongest element.<br><br>The acting, too, is very strong. This is Rourke's finest performance, as Harry Angel, a scumbag detective with nothing to lose. On the new DVD, Rourke claims he wasn't very interested in acting at the time, and as a result `just showed up' and `memorized the lines.' I find that hard to believe  Rourke's acting here is Oscar-worthy. His recent descent into self-loathing has caused his career to fall apart (he was never enthusiastic about acting and wanted to become a boxer instead); he shouldn't discredit his earlier work merely because he's upset with his life.<br><br>The role of Louis Cyphere (get it?) is also one of De Niro's most ambitious performances; he delves entirely into character and leaves a lasting impact on the viewer.<br><br>It was directed by (Sir) Alan Parker, the famous British filmmaker (of, among others, Midnight Express). Some say this is his finest film  wonderfully crafted, beautifully shot, masterfully edited  and I'd have to say that if it isn't his best, it certainly ranks somewhere at the top.","user":"MovieAddict2016","rank":[84,91]},{"title":"Matures with age and grows on audiences and film connoisseurs alike!","rating":8,"date":"7 December 2007","review":"I'm glad I caught this because what was seen by many as a poor film in 1987 can only be seen as great film in 2007. Angel Heart is one of those films that matures with age and grows on audiences and film connoisseurs alike. A psychological horror/thriller is one of the hardest genres for a director to prosper in but if you were to mix in spiritual and religious elements along with a heap of film noir, a touch of romance and a smidgen of jazz then you would set yourself a near impossible task, nevertheless it would be a task in which Alan Parker would succeed.<br><br>The direction of this film is masterful as Parker engages us through a meticulous atmosphere littered with mysterious allegories, gut rendering paranoia and an unmatched sense of place. This unmatched sense of place is a symptom of his stark imagery and sombre lighting which is played out through an amalgamation of film noir and the focal iconography of 50s and 60s French New Wave (the use of elevators, ceiling fans, staircases etc).<br><br>For many of these reasons and more Angel Heart is a very influential film and its inspirations can be seen in many of the psychological thrillers/horrors released in the past 20 years, it is thought provoking and at times a lot more disturbing than any of its genre equivalents. The multi-faceted love scene in the film is one such example, it plays very well as it is cleverly interspersed with a host demonic echelons which (given its style and narrative position) I believe to be unparallelled, even in contemporary cinema.<br><br>Overall Angel Heart is a very well paced and well acted film  although initially I felt that having Mickey Rourke in the lead role was a poor choice (based on his more recent work) but clearly he was at his acting best in his younger days almost Oscar-worthy, Robert De Niro is also on form as is the young Lisa Bonet  but these performances combined with everything else make Angel Heart a film that will stick with you, not as much as Midnight Express or Mississippi Burning (dir. Alan Parker), but enough to make you ponder why this film wasn't so successful upon its initial release and enough to curse why he didn't spend more time dabbling in the psychological/horror genre.","user":"luke-346","rank":[37,39]}]