[{"title":"Car Lover's Alert","rating":9,"date":"9 May 2009","review":"Last night I saw Woman's World: The plot concerns three hot shot salesmen who have been summoned to New York for consideration as the general manager of a fictional automobile company. They salesmen are asked to bring their wives along as the company president believes his executives need the proper kind of wife to be an effective senior manager. Much intrigue, drama, and hilarity ensue.<br><br>Ford motor company participated significantly in this movie. In addition to a large number of 1954 Ford products, the movie featured two Ford fiftieth anniversary concept cars from 1953: the X-100 and the XL-500<br><br>At the beginning of the movie, one couple is shown driving to New York in a Mercury Monterey.<br><br>The lead character played by Clifton Web is the president of 'Gifford Motors. Gifford Motors' cars all resemble Ford Motor Company cars. In one scene, the lobby of the Gifford building is shown with the X-100 and the XL-500 displayed. A Gifford manager is demonstrating the features of the X-100 to a member of the public. The Plexiglas roof panel is shown automatically sliding into position as the windows rise to prevent the interior from being damaged in case it rained while the car was left open. Apparently this was a big problem in the 50s as 'automatically closing in case of rain' was a feature of many concept cars including the Buick LeSabre.<br><br>Later, the three wives are given a tour of New York in the X-100 with street scenes of the car in front of the New York Public Library and the United Nations among other locations.<br><br>Throughout the movie, company executives come and go in a Lincoln sedan and a convertible.<br><br>In one scene the president take the three potential general managers to the 'proving grounds' where we see a variety of Fords whizzing around a banked oval at high speeds with appropriate sound effects.<br><br>Another scene shows a futuristic feature being demonstrated by three large-scale tabletop models of prototype cars: one model drives forward, stops, makes a whirring sound, and then moves sideways into a parking space between the other two models. Presumably it was lowering dolly wheels when it made the whirring sound. This was a 50s approach to solving the age-old parallel parking problem for which solutions are still being pursued today – see the latest Lexus automatic parallel parking feature. A boardroom scene also shows a tabletop model although it's not clear if it's different from the previous three. There is also a scene in the interior design department with many prototype seats of varying color and design.<br><br>In addition to being a great movie, it is a real treat for lovers of early 50s Ford products.","user":"nehresman","rank":[15,16]},{"title":"Highly flawed, yet entertaining","rating":7,"date":"23 January 2016","review":"From my perspective, this is a pretty good film with one huge and one small flaw. The huge flaw is making June Allyson's character a buffoon. The small flaw is the lovely Arlene Dahl, who just doesn't work out in this project.<br><br>The story is interesting. There's a major opening in the management of an auto company owned by Clifton Webb. Webb believes that in such a position, a wife's role is almost as important as her husband's role. So he invites 3 couples to New York City to try out for the position. The first couple is June Allyson and Cornel Wilde. The second is Fred MacMurray and Lauren Bacall. The third is Van Heflin and Arlene Dahl.<br><br>The most interesting couple is MacMurray and Bacall. They're having serious marriage problems. It's not that they don't love each other. It's that they have different goals. MacMurray isn't dealing well with the pressures of business, and Bacall thinks that the promotion will kill him. Will she stay or go? Will he turn down the opportunity or go for it? Then there's June Allyson and Cornel Wilde. He wants the job, but his wife wants \"small town\" life in Kansas City.<br><br>And third is Van Heflin and Arlene Dahl -- Texans. Dahl is overly ambitious, and seemingly more for herself than her very down to earth husband. Loving partner or slut? And then there's Clifton Webb, who is a clever owner of the company. Observing each of the couples carefully while playing things close to his chest.<br><br>As mentioned, June Allyson plays the down-to-earth housewife from the mid-west who doesn't feel she will fit in New York City. She doesn't plot to intentionally sabotage her husband, but she's like a hick bull in c china shop. The trouble is, it's overdone and would have been even more effective had it been more subtle. Cornel Wilde is very good as the husband, and it seems like a very different role for him, Van Heflin seems oblivious to his handicap -- his wife. But he learns, and in doing so it's a fairly strong performance (for an actor I don;t usually enjoy much). Arlene Dahl just seems all wrong for this role -- a totally unlikable character that is all to beautiful; and I say that usually having liked her as a second tier actress.<br><br>This is hardly Fred MacMurray's best role, but he does \"alright\" with it. Lauren Bacall shines in it as his wife.<br><br>Clifton Webb is excellent here, although his role is secondary here. But he is controlled and poised, just as the role calls for. Webb always had a way of stealing scenes, although here he doesn't. Nevertheless, it's a fine performance. His sister in the film is a sort of balance to him; Margaret Gillmore plays the role just right.<br><br>The success of the film turns on whether or not Webb chooses the \"right\" man/couple for the promotion. He does, although who that right person is will surprise some, although the groundwork for the decision is not laid until late in the film. Interesting turn of events.<br><br>Despite the flaws, a unusually interesting film of the type that 20th Century Fox was quite well known for in the 1950s.","user":"vincentlynch-moonoi","rank":[8,8]},{"title":"When CinemaScope was new...","rating":6,"date":"3 February 2010","review":"Watching how the actors are strategically placed on screen while performing their chores in WOMAN'S WORLD made me recall how seldom close-ups were used when CinemaScope was new. Instead, medium shots are used almost extensively so that the screen is filled by someone standing far left and the other far right. Occasionally the camera does move in a little closer for an over the shoulder shot, but it's obvious that CinemaScope was new and lensing a film in Wide Screen was not an easy matter.<br><br>The performances are all interesting, with LAUREN BACALL and ARLENE DAHL coming off best, while JUNE ALLYSON is forced to play a klutzy housewife with too many slip-ups to be tolerable. CLIFTON WEBB is the auto executive who wants to examine the wives of men he's considering for a top job at his auto plant. The men are well played by VAN HEFLIN, CORNEL WILDE and FRED MacMURRAY.<br><br>If you liked films like EXECUTIVE SUITE, all about climbing the corporate ladder, you'll enjoy this one--and furthermore it has sumptuous settings enhanced by color photography. Women will enjoy all the costumes and men will stay tuned to see which man Webb chooses for his open executive job.<br><br>Witty dialogue helps with Lauren Bacall handling her lines with the kind of skill she always brought to these kind of roles. Arlene Dahl shows a little more skill than usual as an actress with a strong confrontational scene with Webb.<br><br>Worth a look, but don't expect anything deep.","user":"Doylenf","rank":[15,17]}]