[{"title":"A classic of 80's","rating":10,"date":"11 October 2008","review":"I don't understand why this movie has such a low rating on IMDb (right now it's 6.1, that isn't so bad but this movie deserves more). It's a classic comedy which is still funny even after 20 years. It always elate me. Jokes are pretty simple and even innocent compared to nowadays movies but that's probably what's good about this film because it's funny to watch to whole family. You'll fall in love with a characters and this movie itself so much that every time you'll hear a theme of Police Academy it will make you smile. If you haven't watched it yet you definitely have to do it because they don't make this kind of movies anymore.","user":"kurciasbezdalas","rank":[60,68]},{"title":"Revenge of the 80's: The franchise film!","rating":8,"date":"9 January 2005","review":"Police Academy (1984) was the first of many films from this series. Since this was the 80's and this film was very successful there was only one alternative, milk the cash cow until it was dry. Like most of these films, the first one is the best and most creative of the bunch. The film follows a bunch of losers and outcasts who join the local police academy for various reasons. The main character is Mahoney (played by Steve Guttenberg) a man with a shady past who enrolls in the academy as an alternative punishment for a previous criminal act. He becomes the motley crew's leader and representative.<br><br>This movie made Guttenberg a star and it started a film series that would live on D.T.V. and make the producers a lot of money. It also gave people jobs and made others into minor stars. I found this movie to be very entertaining. If you're into juvenile humor and a bunch of cheap laughs, then I recommend this movie. Others need not apply. Followed by six sequels!!<br><br>Recommended for some laughs and low brow humor. Hey, it's one of the essentials.<br><br>xxx","user":"Captain_Couth","rank":[68,78]},{"title":"This shows that movies can be stupid and funny at the same time.","rating":10,"date":"29 September 2005","review":"Okay, so \"Police Academy\" is probably the ultimate manifestation of the word \"witless\". But it doesn't pretend to be anything other than what it is: nice, silly fun. The plot basically has a series of goof-off misfits enrolling in the police force and turning it topsy-turvy. Steve Guttenberg, as Cadet Carey Mahoney, may have to remember this as his peak in movies, and he does a pretty good job here.<br><br>Anyway, the movie is pretty much an excuse to be silly. And they do just that. With hilarious one-liners and one gag after another, you won't be disappointed. Of course, I advise you not to watch it if you're the type who only wants to see \"important\" movies.","user":"lee_eisenberg","rank":[53,64]}]