[{"title":"What more can you expect??","rating":6,"date":"30 October 2005","review":"The original Police Academy was stupidity maxed out but brought together with a weird outlandish cast that manages to stay with you and has such become a classic. Not too mention that it grossed over 100 million dollars so a sequel is a must do for Hollywood. Let's face it, there was enough characters and ideas in this franchise to do a sequel, or six sequels as the case turned out to be. Nonetheless it made sense after showing all the cadets make it to graduation that we would get to see them on the job.<br><br>Thus continues Police Academy: Their First Assignment. Most of the original cast returns...Steve Guttenberg as Carey Mahoney, Bubba Smith, David Graf, Michael Winslow, Bruce Mahler, Marion Ramsey, and even George Gaynes in a more cameo type role as Cmdt. Eric Lassard. Guttenberg's Mahoney seems toned down in this sequel which is unfortunate. He doesn't show a lot of the smart-ass, prank playing personality that made the original so great. Everyone else plays their roles similar to that of the original so the jokes when it comes to the characters haven't changed a lot...just perhaps more of them. Michael Winslow as the noise making Larvell Jones is used far more in this one than in the original. Also at the forefront is Eugene Tackleberry who is a great character and he's a lot of fun and a great hero to watch. Sadly the film is noticeably missing G.W. Bailey, who plays Mahoney's perfect adversary Lt. Thaddeus Harris. He's replaced by Art Metrano who plays Lt. Hauser, the wanna-be Captain who will stop at nothing to see the force fail so that he can take over. He's good and it's fun to watch him get pranked by Mahoney but he doesn't have the seriousness/comedic timing that G.W. Bailey had as Harris. The late Jerry Paris takes over on the directing helm and seems to keep the Police Academy recipe in full force. As mostly a TV Director but a seasoned actor Paris should know all about comedy. Also to keep things fresh that added some new faces to the cast. Bob 'Bobcat' Goldthwait stars as the leader of the gang that is ruining the neighborhood that the Academy cadets are trying to clean up. Granted the first few moments of Goldthwait played Zed or playing himself are funny. The voice and the nervous little tics are humorous but then they just aren't funny anymore. And he's far from believable as the leader of any gang. Tim Kazurinsky plays Sweetchuck, the innocent, scared little store owner being harassed by Zed and his goons. And Howard Hesseman as Captain Lassard, little brother of Eric Lassard. Hesseman is good as their leader but the story isn't strong enough so everyone kinda falters because of it.<br><br>Just like the first, Police Academy 2 is STUPID!! But that is exactly what Police Academy is and meant to be. It doesn't try to be anything but. All the characters are funny and have their own little quirks and it's a revisiting that was to be expected and done in an okay style. It's still even not as good as the original, but it is a sequel. The plot and story isn't quite as interesting as the original. Everything else is practically the same, and more of it!! There are still several silly little spots that you'll find yourself laughing out loud about. It's slapstick and still low budget and just fun. Rent this one with the original and you'll have a good laugh. Don't take it too seriously!! 6/10","user":"Robert_duder","rank":[6,6]},{"title":"Great Sequel To A Brilliant Comedy","rating":20,"date":"20 August 2002","review":"(POSSIBLE SPOILERS) Police Academy was phenomenal. Police Academy 2:Their First Assignment was just as phenomenal.<br><br>The rookies have graduated from the academy and are about to be thrown in at the deep end; a precinct is suffering a crimewave thanks to a disgusting gang of punks led by a punk called Zed who has a really weird voice.<br><br>The precinct Captain Pete Lassard asks his brother (Commandant Eric Lassard) if he can use the services of the recently graduated rookies. Everything seems fine but there is one problem-an ambitious Lieutenant called Mauser and his idiot sidekick Sergeant Procter attempt to damage the recruits reputation, the plan being that Captain Lassard is fired and Mauser takes on his job.<br><br>At first, the rookies do well in fighting the crime but things go wrong as Mauser becomes the new Captain and decides to go to war on the criminal gang.<br><br>The dialogue and the scenes are brilliant just like the first film. Great scenes include Tackleberry finding love, Mahoney swapping shampoo with superglue causing Mauser's hands to stick to his hair and the end battle in the abandoned zoo. Art Metrano and Lance Kinsey excel as Lieutenant Mauser and Sergeant Procter who try to discredit the rookies at every opportunity.<br><br>Police Academy 2 is a brilliant follow up to the best comedy film ever. Check it out.","user":"Big Movie Fan","rank":[6,6]},{"title":"Revenge of the 80's: The multiple sequels.","rating":7,"date":"9 January 2005","review":"Police Academy 2 (1985) was quickly rushed into production to capitalize upon the surprisingly successful first film. The recruits have finally graduated from the academy and are now assigned positions throughout the city. Crime is rampant and the people are afraid to leave their homes because of a local crime wave. A group of young punks (led by Bobcat Goldwait) have recently assaulted the chief of police (Howard Hesseman). With the city in turmoil and with his job being threatened by the Chief's right hand man, he turns to the new recruits to help clean up the city.<br><br>I hate it when they franchise a movie and tone down the raunchy humor and crude manners, elements that made the first one a success. The movie is funny but it's not as good as the first film. Sadly the creativity and humor of the Police Academy films goes down the eventual slippery slope. By the fifth film the series becomes very unwatchable and extremely redundant. Even though it's a step down from the first film, it's still entertaining.<br><br>Recommend<br><br>x","user":"Captain_Couth","rank":[18,24]}]