[{"title":"Vampire Western Comedy","rating":12,"date":"12 July 2004","review":"Once you see the vampires in sunscreen and sombreros, you will know exactly what kind of movie Anthony Hickox has made with his \"Sundown: The Vampire in Retreat\". Not only is it totally silly, but it's also pretty unique.<br><br>The plot of this vampire western comedy goes something like this: the powerful Count Mardulak (a quietly comic David Carradine) has founded a colony for reformed vampires in an old ghost town called Purgatory. The denizens of Purgatory fight the urge to kill and drink a milky-looking blood substitute (\"It isn't even the right color\", huffs one vamp). But it turns out that reform doesn't suit all the vampires that well, and things only get more tense when a few humans come to town.<br><br>B-movie lovers will likely be charmed by \"Sundown\", stop-motion bats and all. It certainly strays from horror cliche. Adding to the lighthearted festivities is Bruce Campbell as the artless but well-meaning Van Helsing. Overall, it's a kooky good time for movie fans of a particular mindset.","user":"sparklecat","rank":[13,16]},{"title":"Has a charm and power lacking in most contemporary vampire films","rating":9,"date":"18 November 1998","review":"Anthony Hickox skilfully blends a vampire story with a Western set in contemporary times, and plays it for laughs (but not for camp) allowing for more serious aspects to come through. Among these more serious aspects, which are treated that way, are an extramarital affair that has created serious resentment, and the condition of being a vampire.  When Robert Van Helsing (hysterically played by Bruce Campbell) arrives in Purgatory, Mort is already in jail for murder, and Jefferson is planning a revolt against living on synthesized blood.  Dressed as a pilgrim, he insists Count Mardulak is a traitor to his kind, while Mardulak counters that feeding on humans is so special to be in common with \"the tapeworm, the flea, the fungus, that's how special vampires are.\"  The twist ending shows who the real traitor to his kind is.  Inept Van Helsing spares beautiful diner waitress Sandy so that she'll lead him to Mardulak, and starts to fall in love with her.  Mardulak allows Sandy to bite him, and he wakes up with his cross burning his neck and screamin' at his lack of reflection!  The fact that Dave Harrison must work with the man who seduced his wife while they were married creates some serious tensions, and Shane develops wood-tipped bullets to fight against Mardulak's so-called traitors.  Deftly written, and lacking in the sadism of films like _From Dusk Till Dawn_, this film presents well developed, humorous characters, and everything seems to work, without ever turning camp.","user":"Kabumpo","rank":[16,22]},{"title":"Harmonious combination of classic genres","rating":8,"date":"11 March 2000","review":"This was a pleasant surprise - a charming vampire western that respects the genres (Western fans will love the classic John Ford-esque setting and epic soundtrack!) while maintaining both an action plotline and likeable, understandable characters. Bruce Campbell is hilarious as an over-the-top Van Helsing descendant (who goes thru a most unexpected change!), John Ireland is impressive as the rebel vampire leader and David Carradine is strong and dignified as the Count who keeps an ancient secret identity. Lots of human warmth and sympathy (Carradine's townful of Western vampires, drinking a synthetic blood substitute,  yearns to be free of human predation and to someday live on equal terms with mankind) distinguishes this from many other modern vampire flicks; the Count's reaction upon feeling forgiven by God is genuinely moving. Even your non-horror-fan friends will like this one.","user":"angelynx-2","rank":[13,19]}]