[{"title":"Was my favorite movie for years","rating":7,"date":"5 July 2002","review":"It was 1983 and I was 13. I watched Valley Girl on HBO one night when my parents were working. After it ended I wanted to talk with someone about it immediately. Turns out my best friend watched it too and it became our favorite movie. Every weekend after that we watched it until we could recite it. We woke her parents up late at night laughing hysterically. We began to worship the main character, Julie, played by the beautiful Deborah Foreman. I am not saying this is a great classic. Although it is for me personally. And I understand that the whole Valley Girl talk becomes annoying but that was the 80's. But deep down at the heart of the movie-it is a love story, and a familiar but good one. Girl meets boy and there are sparks from both sides, an instant connection. Julie's friends don't like him-he doesn't fit in, doesn't go to their school, doesn't have money. They like her better with her ex-boyfriend the football player even though he is a jerk. She makes the ultimate sacrifice-her own happiness for her friends' happiness. And she has these really cool supportive hippie parents. It is one of Nicholas Cage's first movies and his first starring role. One minute he is absolutely hilarious and the next incredibly touching and romantic. His friend Fred is pretty funny too. If you were a teenager in the 80's you will love this movie or at the very least it will bring back memories. It is no longer my favorite movie but it is still one of my favorites, probably in my top 10. I am eagerly awaiting it's release on DVD if they ever release it. You can go to Deborah Foreman's website to sign a petition to get it released on DVD and there are 2 soundtracks from the movie that are must haves if you like 80's music.","user":"rhondashane","rank":[35,38]},{"title":"Top of the heap of eighties teen films","rating":10,"date":"9 September 2001","review":"This gem captures early 80's life brilliantly. As a grad '83 boy<br><br>myself, I must say that Valley Girl (along with Fast Times at<br><br>Ridgemont High )stands out as the class of the teen sex film<br><br>genre. The characters are accurate representatives of the era; the<br><br>vapid mall chicks, pseudo punk rebels, preppy jocks are all<br><br>represented here.<br><br>I have seen this over ten times now. The music in the film was top<br><br>notch. Unfortunately, these tunes could were never as popular in<br><br>their era as those by arena cockrockers like Journey, Styx or<br><br>Loverboy. Before the soundtrack existed, I searched out records<br><br>and tapes (it was the 80's after all !) of Josie Cotton, Sparks,<br><br>Plimsouls and Modern English.<br><br>This movie deserves respect. It isn't just a good 80's teen flick. It is<br><br>a great film. Period.","user":"ddn32","rank":[33,36]},{"title":"Nicolas Cage's best role","rating":8,"date":"16 March 2003","review":"This movie is one of my all time favorite movies and is what made me a lifelong Nicolas Cage fan.  Back in the mid-80's I taped this movie (when VCR's were impossible to do this with!!) and would watch it over and over. Nicolas Cage is just brilliant here.  And, he looks wonderful and has no affecting \"acting-isms\" (see \"Peggy Sue Got Married\" to know what I mean about that!!).  I measure all his performances against this one.  He was so perfectly cast as the cool punk guy with the edgy friends.  The music was GREAT.  The Plimsouls!  The Psychodelic Furs!  Modern English!  Men At Work! Whenever I hear \"Melt With You\" I am taken back to the finale of this movie.  <br><br>What ever happened to his cute costar, Deborah Foreman?  And his hysterical friend, Cameron Dye?  Certainly took a different turn than Nicolas! Interestingly, the slutty friend (Elizabeth Daily) ended up being the voice of Tommy from the Rugrats (she is billed as E.G. Daily for that horrid show)!  Bizarre!<br><br>IF you want to take a great trip back to the 80's, watch this movie.  It is definitely a classic.  Like Totally!","user":"phils_phan","rank":[25,28]}]