[{"title":"Hollywood did not destroy this movie","rating":18,"date":"18 September 2000","review":"I saw this movie in the theater the week it opened way back when.  It was a very, very late showing, and there were approximately five other people in the theater.  Two walked out during the film.  As the film credits rolled, the two women sitting next to us said, \"My god!  That was the worst film I have ever seen!\"  My only thoughts were, \"They have not seen Starcrash!\"<br><br>Both my friend and I loved Hardware.  I introduced my SO to it this weekend, and he loved it.  I think what I like about it is that it's a small movie that manages to execute its space perfectly.  The universe of Hardware is dark, dirty, claustrophobic (without being small).  The narrative is pure dystopia, which fits very well with the droid gone wild theme.  The droid is so unrelenting, as is the dreariness of existence in this post apocalyptic space.  I like how tight the movie is.  I also like how clean the narrative is.  There isn't any extraneous fluff.<br><br>I think this movie will appeal to the slightly more sophisticated film lover.  It doesn't have big movie pretensions.  Hollywood did not destroy this movie.  The symbolism is far more subtle than in big productions.  The pacing is also different.  I loved the slow buildup.<br><br>This movie worked, but it's not an easy movie.  If you're willing to work a little with a movie that doesn't have the big movie facade of Terminator II or Independence Day, and you enjoy dystopic science fiction, I think you will like this one.","user":"jwolter","rank":[110,130]},{"title":"Undeserving of its bad reviews... fun film!","rating":20,"date":"20 February 2000","review":"After all the horrible things I heard about this movie, I wasn't expecting much when I found it for $3 in a pawn shop... and, after watching it a couple of times, I don't know what the hell people who say this is \"the worst movie in the world\" were smoking... because this is one of the best low-budget sci-fi flicks I have ever come across.<br><br>Though it is by no means a sublime piece of art, I find the fact that the plot concerns one woman and her boyfriend fighting off this robot in her apartment, with the collapsing world as a backdrop around them to be somewhat refreshing in an age of sci-fi films trying to be epic and ending up trite. Though clumsily written at times and with the robot looking almost ridiculous at points, we get a nicely shot, stylishly lit sci-fi thriller that takes place on a human scale and whose premise has enough depth, symbolism and irony to make it all worthwhile. Best film I have ever seen? Hardly. But the best deal I've had for $3 in a very, very long time.","user":"Piotr-9","rank":[68,83]},{"title":"The Richard Stanley show","rating":8,"date":"25 June 2005","review":"I must admit I am a huge fan of this under-estimated, enigmatic South African director.<br><br>Like his magnificent masterpiece, Dust Devil, Hardware deals with similar themes - the desert, the Old Testament, and sexual violence.<br><br>I first saw this movie many years ago when still basically a kid before I went to film school and certain sequences have stayed with me forever.<br><br>Watching it again in 2005 the movie seems a little dated or rather post-rock video in places, but when it was made in 1990, this was all cutting-edge stuff. I am not giving anything away by saying that the plot is in many ways a re-working of The Terminator or Alien, when Dylan McDermott gives his girlfriend Jill (played by Stacey Travis)what he thinks is a load of unusual scrap metal salvaged from the desert. She is an artist and welds these robot parts to a sculpture she is making...<br><br>This is an extremely visceral movie, laced with religious iconography (mark-13 often adopts crucifixion poses and in the shower scene at the end, appears to be in a prayer position) and boosted by an extremely eclectic and unusual cast. Motorhead singer Lemmy crops up playing a sort of ferryman, Iggy Pop plays DJ Angry Bob, and John Lynch is excellent as my favourite character from this film, Shades.<br><br>The narrative is essentially straight-forward but what makes this movie different and memorable is Stanley's vision. The mise-en-scene is bleached red (post-appocalypse), the use of montage is often extremely effective and nightmarish and I was frequently reminded when watching it of Renaissence paintings, just in glimpses here and there (hell, maybe that's just me..!) There is also some American comment in this movie; mark-13 is adorned with a stars-and-stripes, and the deadly toxin it employs is described as 'smelling like apple pie'. This of course is akin to Dust Devil, where the demon is simply called 'Texas' by Wendy.<br><br>So, to conclude, if you haven't seen this movie or heard of this director before I urge you to seek him out. Anyone with a love for avant-garde and challenging cinema (like me) should have heard of this guy (proper auteur by the way) and his thematically-consistent visions.<br><br>This is still a fine film but probably hasn't aged as well as it might have done - it's strength is that it is far more complex than it first appears to be.","user":"jbarnett76","rank":[61,80]}]