[{"title":"Brilliant and Evocative Blend of Music and the Cinematographic Art","rating":8,"date":"19 March 2005","review":"Jarman to a T: Brilliant, atmospheric, imagistic, eccentric, and sometimes homo-erotic. An incredible blend of one of the great 20th century musical works on (or rather against) war and the cinematographic art. <br><br>I've seen this film twice now. Some of the comments given by other reviewers seem to miss the point of the film- it is dark and sometimes jarring. Jarman uses historic footage, color and colorization as a technique to refocus the viewer's eyes and thoughts. Jarman is not interested in narrative so much as building a series of images that take the poem and music to a new place of understanding.<br><br>Perhaps this film is not for everyone- but then I would love to tie every politician to his or her chair and force its viewing.","user":"dcovec","rank":[28,31]},{"title":"Powerful, lyrical visual poem","rating":9,"date":"25 April 2002","review":"War Requiem is a vital film in Derek Jarman's filmography; seemingly handcuffed by a score with which he could not play around at all, Jarman could not work his sonic wizardry with his usual collaborator Simon Fisher Turner, or any others.  However, here Jarman fused many of his passions and obsessions into one of his most personal statements: working with favorite actors, especially the intense and beautiful Tilda Swinton; using the shimmering, glorious Super 8 of home and play; collaging and staging and digging up artifacts to reposition and reexamine them; and composing image and cuts like a composer working on a new symphony.  Dziga Vertov and Dovzhenko may have been working in this vein this decades ago, but if Jarman gives it a try today, the comparisons are to \"music video\"; naturally, no one is really paying attention if they're making comments like this.  The intent and effect of works such as War Requiem  (or The Last of England  and The Garden) are virtually an antithesis of the shallow, splashy, and seizure-ridden style and pace of MTV and company.  Jarman has advanced his uniquely cinematic aesthetic - somewhere between the work of a symphonic composer and a painter, working with light and celluloid instead of oils - in this work that treads a tightrope between narrative and poetic verse. So many sequences of this film are powerful and gutsy and utterly moving: the montage of war footage, building in rhythm and intensity with Britten's score; the tear-inducing shot of Tilda swaying to the music; the nurses playing \"Blind Man¹s Bluff\"; the smoke and flowers.  Derek crafted one of his most hearfelt, original, and spontaneously lyrical movies in War Requiem;  now it only needs a top-notch release on DVD.","user":"carlex","rank":[22,24]},{"title":"Purely Jarman","rating":6,"date":"20 April 2014","review":"Derek Jarman was the infant terrible of British cinema in the 1970s with his provocative films Jubilee and Sebastiane, the latter having a costume budget of £20!<br><br>In the 1980s thanks to funding from Channel Four Films he flourished by making low budget films of varying quality in rapid succession. By this time he was getting more accepted by critics and some elements of the public but by now he was also diagnosed as HIV+.<br><br>War Requiem was partly funded by the BBC, a collaboration of music of Benjamin Britten (War Requiem) with images of war and conflict. Some of the scenes are recreated and dramatised whereas other scenes have been obtained from the Imperial War Museum. There is also poetry of Wilfrid Owen who is depicted in this film by the actor Nathaniel Parker.<br><br>The film also has Tilda Swinton and Laurence Olivier in the opening scenes. In a sense looking at it now it is the passing of the torch from one acting generation to the next. This was Olivier's final film and it was with a future Oscar winner Swinton.<br><br>The film was to have no dialogue but once Olivier agreed to play the 'Old Soldier,' Jarman realised that he might as well give the legend some dialogue and he recites a poem by Wilfred Owen.<br><br>How successful the film is depends on your mileage as to whether you are a Jarman fan, like Opera or appreciate art-house cinema. The dramatised scenes are interesting but not wholly successful but they are beautifully lit and demonstrates what Jarman can do on a low budget. It helps that along with Swinton, Parker we have a young Sean Bean playing a German soldier.<br><br>However the inclusion of the old documentary footage is less successful as it just makes the film drag. You feel that you are just watching old film with music and some of it is not very interesting although Jarman did also include footage of modern wars as well such as Vietnam, Falklands and the Afghan war with Russia of the 1980s.<br><br>Still War Requiem is challenging, provocative, arty and displays the talents of a unique voice in British cinema.","user":"Prismark10","rank":[6,7]}]