[{"title":"A Good 'Noir' For The '60s","rating":9,"date":"12 August 2009","review":"This is very much like a late 1940s film noir, except it's filmed in the mid 1960s. It has that same edgy dialog and feel to it as private eye \"Lew Harper\" goes looking for a missing man. His character is based on Ross McDonald's best-selling P.I. \"Lew Archer.\"<br><br>In \"Harper,\" all the characters are suspicious and they vary from suave \"Allan Taggart\" (Robert Wagner) to the coquettish late teen \"Miranda Sampson\" (Pamela Tiffin) to a lawyer \"Albert Graves\" (Arthur Hill) who's infatuated with the hot teen and also carries a gun. Then there's the overweight has-been entertainer \"Fay Esterbrook\" (Shelly Winters), the druggie jazz singer \"Betty Fraley\" (Julie Harris), the New Age scam artist \"Claude\" (Strother Martin) and a bunch of gangsters and thugs who are the obvious targets. Of them all, I though Winters was the biggest hoot.<br><br>Along the way, Newman wins all the verbal bouts but loses the physical contests. He zings everyone with some great put-downs, but takes a physical beating a few times, too. He sports a nice shiner in the last half of the film.<br><br>This film will put you smack into the time period, when people danced \"The Frug\" and referred to cops as \"the fuzz.\" People were starting to wear Beatle-type haircuts, although you'd never find Newman giving in to that counterculture fad. In here, at least, he's old school, tough, relentless and suspicious of everyone......which, at it turns out, is as it should be.<br><br>The DVD is now part of the Paul Newman Collection and it's shown with a very sharp 2.35:1 ratio transfer, very much showing off Conrad Hall's cinematography. Johnny Mandel's music score adds to the \"coolness\" of this film, too.","user":"ccthemovieman-1","rank":[51,59]},{"title":"cool once and for all","rating":10,"date":"2 June 2007","review":"I first saw this film when it came out, at age 12, and chewed my gum like Paul Newman for the next 20 years.<br><br>What's remarkable about that is, I \"got\" the film at that time, recognized its depth (as well as its superficialities), loved it; and having seen the film several times over many years, the basic experience hasn't changed.<br><br>This is probably the most accessible \"hardboiled\" detective film ever made, yet it never panders - it depicts a rough world straight on, and doesn't particularly like - or condemn - any of its characters. Is it the classic that \"The Big Sleep\" is? No, because its world is smaller than that of Chandler/Faulkner/Hawks, even though it glitters more; and Smight is a solidly competent director but not an 'auteur' - which works in the film's favor: Smight just gets on with the job and tells his story, he doesn't stop for extra flourishes.<br><br>But, although all the acting in the film is top-quality, it is Newman's performance that carries the film over the top: witty, cynical, detached, yet with glimpses of passion and commitment, Newman uses Harper to define pre-hippie cool once and for all.<br><br>Historical note: although this is not \"The-Maltese-Falcon\" classic noir film, the detective film was believed to be a genre of the past (at best fodder for bad TV) when this came out. \"Harper\" kept alive what many thought a dead tradition. The reviewer who wrote that this film made the Elliot Gould \"Long Goodbye\" possible is right on the money; and when nine years later Jack Nicholson starred in Polanski's tribute to the genre - \"Chinatown\" - it was Newman's performance here that he is referencing, not Bogart. That makes this an important film, and one should give a second look to a film that influenced so many others.","user":"winner55","rank":[29,34]},{"title":"Good movie version of the book","rating":8,"date":"1 August 2005","review":"I just read \"The Moving Target\" by Ross Macdonald, the book upon which \"Harper\" is based. Given that the book was written in 1949 and \"Harper\" was contemporary (1966) when made, the movie follows the novel pretty darn close. Many of the scenes are done almost verbatim from the book. Harper is more acerbic than Macdonald's Lew Archer, and the novel, of course, fleshes out the characters and their motives a little better. But I think the movie stands up pretty well by itself. It has an outstanding supporting cast and, except for Pamela Tiffin, the acting is good, with high marks especially for Paul Newman and, in my opinion, Arthur Hill. The photography is gorgeous, and I can listen all night to any music by Johnny Mandel. All that and those great one-liners by Newman! I'd give it a 7 or 8 out of ten.","user":"dgcrow","rank":[65,88]}]