[{"title":"Forgotten Gem from the Great Val Guest","rating":7,"date":"8 May 2005","review":"Still recovering from serious head injuries sustained in a car crash, motor racing driver Alan Colby and his wife Denise go on holiday to the South of France. There, Alan is suddenly and unexpectedly struck with a compulsion to strangle his wife. Hearing about this, Dr. David Prade, a local psychiatrist, offers to help, but his offer is rejected by Alan and he and Denise return to London. The psychiatrist follows them there, convinced that sooner or later his services will be needed and that he should be close at hand. At first, all seems well with Alan, but then one morning he wakes from a long sleep to find that Denise has disappeared. Worse, all the evidence points to his having murdered her.<br><br>Beautifully filmed in black-and-white MegaScope by the great Gil Taylor and masterfully directed by Guest, who was always at his best working on suspense films, \"The Full Treatment\" is a minor classic.","user":"Gordon-M","rank":[31,34]},{"title":"Confusing and hard to believe, but entertaining...","rating":7,"date":"14 May 2011","review":"\"Stop Me Before I Kill\" is a rather entertaining but often flawed film. And, if you can look past its flaws, it will probably be worth your time. The film starts with a race car driver getting in a terrible accident. Months later, he comes out of a coma and appears to be recovering quite nicely. However, he's obviously suffering psychological after-effects--he's on edge, moody and sullen. What's worse, he then tries to strangle his wife--on several occasions! With the help of a psychiatrist and some dubious analytic psychiatry, the man tries to work out why he's got this homicidal urge. But, there are some BIG twists...<br><br>Despite an excellent ending that makes this all worth while, here are a few problems with the plot. First, although he has tried several times to kill his wife, she stays with him and doesn't contact the police. Duh! Then, you notice that the race car driver's wife goes from being Italian to being French--her accent and language are a bit malleable! Also, the real reason for all this homicidal behavior is too obvious--there are too many clues to this and the film doesn't give the viewer many other options to consider. Still, it works well enough despite all this, though it's hardly a classic.","user":"MartinHafer","rank":[15,17]},{"title":"A different Hammer movie, but will really try your patience","rating":28,"date":"28 May 2017","review":"\"Stop Me Before I Kill\" (a.k.a. \"The Full Treatment\") is the rare 1960s Hammer movie to not showcase a monster, or for that matter a truly horrific element. This fact probably explains a lot as to why the movie is obscure today, but I think the main reason for the movie being forgotten is that it's not all that good. It's not a terrible movie, let me make clear. Director Val Guest occasionally puts in some eye catching direction, and the movie is never boring. However, the movie gets VERY close to being labelled boring. At one hundred and seven minutes in length, the movie is much too padded out. The first two-thirds of the movie in no way had to be as long as they are here. Things do pick up slightly in the last half hour, but by then it's far too late, especially since you'll be able to guess the so-called \"surprise twists\" that happen near the very end long before they happen, including the fate of the villain (it's telegraphed in the first part of the movie!) What the movie ends up being is something only for very patient people who have never seen a thriller before in their life, and I trust you are not such a person.","user":"Wizard-8","rank":[5,5]}]