[{"title":"Intelligent, well-done sci-fi/horror","rating":10,"date":"20 February 2005","review":"Susan Harris (Julie Christie), wife of a scientist working in the field of advanced robotics, becomes a prisoner in her own home when super-computer Proteus IV, who also wants to spread its seed by impregnating Susan, takes charge of her life. I rented \"Demon Seed\" because I felt like watching something with a brain, and based on a lot of positive IMDb reviews, I was praying for a smart sci-if flick. My prayers were answered. <br><br>The acting in Demon Seed is fine. Robert Vaughn was creepy as hell as Proteus IV, both sinister and relaxed at the same time, in fact he does an even better job as an evil computer here than Douglas Rain did as HAL-9000 in 2001: A space Odyssey. <br><br>The film benefits greatly from an intelligent screenplay, penned by Robert Jaffe and Roger O. Hirson. The dialog is thought provoking and thankfully never really insults the audience's intelligence.<br><br>Helming the director's seat is Donald Cammell, who directs with a firm hand and injects a claustrophobic and uncomfortable atmosphere into the film, also managing to maintain the suspense scenes well. Interestingly, he apparently condones the film (assuming that calling the film a 'piece of sh*t' warrants that). <br><br>As others have pointed out there are some dated aspects to the production. The special effects were sparse but thoroughly unconvincing, the only exception being the mesmerizing computer screens that consist of ever-changing shapes and colors that are shown on Proteus's computer terminal. The film takes place in the 'distant' future1995, I believeyet it looks like it's right out of the 70's, no thanks to the cars, clothing, computers and hair styles that give away the films age. This is a small complaint but an annoying one, though it's easy to ignore once you get involved with the story line.<br><br>\"Demon Seed\" is an intelligent sci-fi film that's pretty rare but if you happen to see a copy of it, pick it up if you're in the mood for something smart.<br><br>7.5/10.","user":"willywants","rank":[52,61]},{"title":"One of the coolest","rating":27,"date":"27 February 2004","review":"This movie does seem to be older than 1977 when you see it, yet it is very nice. Nice enough to have searched for it on Imdb. The film depicts a rarely seen machine intelligence, one that has a conscience, a purpose and a cool calculating mind. One would expect that from a machine, but usually machines in movies are stupid, mean, vengeful, everything a computer should have no reason to be. The ending is also great, showing the stupidity inherent in extreme human emotion. A must see and a classic. Demon Seed could seem to many troubling as it forces you to think and ask questions many of us prefer to refuse to ask. The nature of humanity, moral and thought are all put into question by this movie. See it and answer those questions for yourself.","user":"siderite","rank":[30,34]},{"title":"Intelligent SF/horror movie.","rating":1,"date":"1 December 2001","review":"If you know anything about Donald Cammell's checkered career watching 'Demon Seed' can be quite a strange experience because you can't help but wonder what it might have been if Cammell was able to bring his original vision to the screen without studio interference. For those unfamiliar with his sad tale watch the astonishingly original 'Performance' that he wrote and co-directed with Nic Roeg, then try and see the documentary 'Donald Cammell: The Ultimate Performance' which fills in the gaps from that landmark to his untimely suicide in the 1990s. <br><br>Anyway, I can only comment on 'Demon Seed' as it is, and it's a very strong, intelligent and scary SF/horror movie. Recently activated super computer Proteus questions Alex Harris the scientist who created him (played by Fritz Weaver). He wants to know what the information he is gathering and problems he is being asked to be solved are REALLY all about. Not getting satisfactory answers he decides to rebel, and takes control of Harris' fully automated home, which is occupied by his estranged wife Susan (Julie Christie). <br><br>Almost immediately Susan and Proteus are at odds. Proteus won't accept non-cooperation with his plans, which include Susan's impregnation, and she becomes a terrorized prisoner of the \"evil\" (?) computer. What follows is a battle of wills and wits, which makes compulsive viewing. 'Demon Seed' may be dated in the FX department, what SF over twenty years old isn't, but it compensates with suspense, style and food for thought. Plus one of the best endings of any 1970s SF movie! Make sure you see this one.","user":"Infofreak","rank":[21,24]}]