[{"title":"Fun and Jive Mexican Style","rating":7,"date":"21 January 2006","review":"Relaxing nonsense with pretty girls and German Valdes (same as English name Herman?) who greatly resembles in appearance, dress, musical and acting style Cab Calloway. Quite a few sprightly musical numbers adorn this light tale of a musician on the bum falling into a lets-put-on-a-big-show scenario so familiar to USA audiences of the 40s and 50s.<br><br>Interesting take on \"the Tramp\" theme also used by Cantinflas in other Mexican movies. More comfortable than the usual \"rich boy slumming\" theme so common in films made above the border.<br><br>Rosita Quintana is a knockout, likewise the lady from Cuba who dances and sings half-naked. The lady from Cuba is backed by Black musicians (who are very cool), and there are some mild and amusingly racist but just barely derogatory jokes about where they're going to sleep.<br><br>Worth a spin. Very nice production values. I had taped it off TCM a few months ago.","user":"Sleepy-17","rank":[8,10]},{"title":"So many women, so little truth","rating":23,"date":"23 September 2011","review":"Tin Tan suffers some kind of amnesia (or does he?) after being hit in the head and talks to his reflection in the mirror, who he thinks is another ''him''. So, taking advantage of that condition, someone tells him he is a very rich artist manager. He gets a little confused at first, but remembering that he is not, pretends to play along to his convenience. <br><br>A bunch of beautiful women surround him and all want a chance to prove they are the ''next big star'' and he keeps promising them the moon... An Argentinian (Rosita Quintana), a Brazilian (Rosina Pagán), a Cuban (Amalia Aguilar), a Spaniard (Gloria Alonso) and a Mexican (Nelly Montiel) they all claim they are worth a try. Only Rosita Quintana knows whats really going on but is patiently waiting the right moment to make him confess the fake he is. Amalia Aguilar's numbers are fantastic!","user":"pv61","rank":[3,3]},{"title":"One of Tin Tán's most famous comedies","rating":8,"date":"25 October 2010","review":"Like other Mexican masters of humor (for example, Cantinflas), Germán Valdés created Tin Tán with a strong feeling of a unique personality and original language. He came from a family of comedians very famous in movies and TV (he is brother of Ramón Valdés and Manuel \"Loco\" Valdés). Tin Tán incarnated the figure of 1940s' pachuco, young Mexican American guys, with strong feelings for his roots (music, dancing) that returned to Mexico and find a country distant to them in customs and rhythm of life. \"Calabacitas tiernas\" was one of the first works in the vertiginous career of Valdés, so it is one of the most representative examples of what we will find in his later works: co-working with his brothers, beautiful women, a story around the show business, problems with the police, characteristic music and dancing, references to cinema, mentions of Mexican culture topics and identity confusions.","user":"chris-810-745673","rank":[3,3]}]