[{"title":"Danny Kaye movie \"On the Double\"","rating":10,"date":"5 December 2005","review":"I must have seen this movie on TV decades ago. It stars Danny Kaye, Dana Wynter and Margaret Rutherford. According to a comment I saw on this movie, it is not available on DVD. I searched on Amazon for it and couldn't find it there. This is one of the funniest movies I ever saw. Danny is doing his usual forged identity. And to add a twist to it, the person he is impersonating has a bad eye and wears a patch, but Danny's bad eye is the opposite eye and he has to wear a contact in his bad eye so he can cover his good eye. The scene where he drops his contact is priceless. Also, the scene when his aunt (Margaret Rutherford) shows up at a party still makes me laugh just thinking about it. Margaret gives an incredible performance, and Danny is at his funniest. I hope it comes on TV again.","user":"jonssondrx","rank":[10,10]},{"title":"Wish this one was available on video","rating":14,"date":"14 December 1998","review":"I've been a big Danny Kaye fan from an early age. I've seen all of his movies, minus one or two. But I will have to say with all honesty, that \"Double Time\" is without a doubt, one of his best works. I was lucky enough to catch this one on the AMC channel (American Movie Classics) and to this day is the funniest movie I have ever seen. I laughed until I couldn't even see the T.V. screen through the tears. But unfortunately, this one is not available on video, which I really don't understand because it was one of his later films. (1960's) I do wish someone, somehow would make ths happen.","user":"Buddy-11","rank":[13,14]},{"title":"Instinctively funny-man knows how to turn words into laughter.","rating":8,"date":"19 July 2006","review":"Danny Kaye has to be one of the greatest of the giggle creators of all time. With instinct that is uncanny, he can unleash a torrent of laughter on either side of the ocean. Using that amazing voice, and unique body language all of his own, Danny Kaye becomes whomever he desires to be, in any language. He knew how to create, without the need of crudity, and it remains a beautiful fashion, forty years after the fact. Seldom lacking that twinkle in his eye, anything could and usually did happen in his films, especially On the Double. It has always made me wonder how ofter might this have happened, for it is said that each of us has a direct mirror opposite wandering about on this planet. The list of possibilities is endless. Hopefully, each will have the same bad eye, so that the patch which covers it will be permitted to remain in place, and not confuse family members. Beware to all our beloved Aunts. This is one in the top 5 list I have for Danny Kaye, and it needs to be up and out there on VIDIO if not DVD.","user":"joshgrey13","rank":[7,7]}]