[{"title":"Audrey in couture","rating":8,"date":"13 April 2005","review":"William Wyler was at the end of his distinguished career when he undertook this project. The film with a screen play by Harry Kurnitz is a film that doesn't break any new grounds, but it's a favorite of a lot of fans, no doubt because of the luminous presence of Audrey Hepburn, a star of such charisma and elegance, unmatched by her peers.<br><br>Audrey Hepburn is seen in the film through the loving eyes of Mr. Wyler, a director who had worked with the star before. In fact, it was Mr. Wyler who was instrumental in directing Ms. Hepburn in \"Roman Holiday\", her big break in the American cinema. Audrey Hepburn is seen in the film at her best thanks to Givenchy, a designer that loved her, and whose clothes adorn the star and give the film a touch of chic.<br><br>Peter O'Toole makes an interesting partner for Ms. Hepburn. As Simon Dermott, Mr. O'Toole is the perfect match for his co-star. Both actors are seen at their most charismatic selves. They seem to be having the time of their lives working for Mr. Wyler and living it up in Paris!<br><br>The supporting cast is excellent. Hugh Griffith, Charles Boyer, Eli Wallach, Fernand Gravey and Marcel Dalio, and the rest grace the film with their distinguished presence and contribute to the general fun generated by this gentle caper.<br><br>Thanks to Mr. Wyler and its stars \"How to Steal a Million\" is a pleasure to watch.","user":"jotix100","rank":[71,78]},{"title":"A Filmic Bon Bon; a Trend-Setting, Light-Hearted Romp","rating":7,"date":"4 August 2005","review":"The trio of William Wyler directing, Audrey Hepburn as a charming French woman in need of help and Peter O'Toole as the dashing fellow who agrees to commit a crime for her seemed at first glance to many film aficionados to be potentially a fine partnership for making a winning comedy. \"How to Steal a Million\" in fact turned out to be atmospheric, very French, very sophisticated and a great deal of fun. The clever story and screenplay by George Bradshaw and Harry Kurnitz worked almost everywhere, I suggest. Some of the film's humor seems obvious to me--the use of rotund Gallic comedian Moustache borders upon parody at times; but this is a fundamentally light-hearted romp of a film from its flimsy but serviceable premise to its satisfying romantic conclusion. It is a comedy; and it turns upon O'Toole's ability to devise a means of stealing a well-guarded art object from a major French Museum, a physical feat which he proves to be quite capable of achieving. The reason he is asked by Hepburn to plan that robbery is that the lovely statue now on display is about to be examined and authenticated by experts--and her father created the work, as he has created so many others, his charming and adroit forgeries. There are several other currents at work in the plot as well; there is a U.S. buyer after the piece, Hepburn 's belief that her champion is a crook turns out to be an unfounded assumption, and he is falling in love with her as she is with him throughout the unfolding of actions and events. The production is expensive-looking but never \"heavy\" in feel to my way of thinking. Givenchy did Miss Hepburn's gowns, Charles Lang was the cinematographer, and the production design by Alexander Trauner and the bubbly music by John Williams both served the story very strongly. In the cast, O'Toole and Hepburn seem perfectly mismatched; she is a bit inconsistent, I believe not knowing how \"old\" to play her part; O'Toole is intelligent, and plays both a crook with a sense of humor and a romantic admirer of Miss Hepburn's very successfully. Her father who proudly but inadvertently loans the piece to the Museum and misses the clause relative to its being examined by experts is Hugh Griffith, who suggests as much as he blusters. His likability is the key to the plot, because if he were not talented and likable and worth saving, the viewers would not accept the story-line'e basic premise--much ado to save him. Eli Wallach is bright as usual as the obsessed would-be buyer; others in the cast include Charles Boyer, Fernand Gravey, Marcel Dallio, Jacques Mann, the aforementioned Moustache and Roger Treville. The film is often discussed as if it were a trifle, a cinematic glass of champagne and a delightful and only a bit-overlong comedy. the attitudes expressed miss the three points of the film...It is noir, since the police cannot be brought into the case; it is comedy, which means its tone of light-heartedness and clever dialogue is very often exactly right; and its sub-plot is adventure, a very daring and ingenious combination of psychology, physical paraphernalia and enjoyable suspense. It is well-liked by many, and as a writer, I am certainly one of its admirers..<br><br>_______________________","user":"silverscreen888","rank":[34,37]},{"title":"Bright, Sophisticated, Funny!","rating":10,"date":"15 May 2004","review":"This Movie was one of the best Audrey made - not an easy statement to make since she made so many great ones. \"How to steal a million\" is not as well known as her early works (Roman Holiday for example) or as well regarded as Breakfast at Tiffany's (Considered her Signature role), but it is far and away her best comedic work.The casting for the movie was very good. from the principals down to the supporting cast. Notice especially the casting of Hugh Griffith as Charles Bonnet in the role of Audrey's (Nicole's) errant but very endearing Papa, The interplay of those two Characters together with her scenes with Peter O'Toole as Simon Dermott (Society Burglar / Private Investigator / Love Interest) secured, to my mind at any rate, the movie's success. In addition, notice also the performances of Jacques Marin and Moustache as the museum security guards. Both of these turned in terrific work in supporting roles as did Charles Boyer in his (all too brief) appearance as the art Dealer DeSolnay. The sole weak point was I believe the casting of Eli Walach for the character of Davis Leland. Though his performance was adequate, he was not the best choice for this character (a role that was originally intended for George C. Scott). In Summary: The casting was wonderful, The characters were believable, Principals were excellent together and the dialog was bright,sophisticated and (did I mention?) FUNNY! Conclusion: This is one my favorite movies. I have watched it repeatedly over the years and it never fails to makes me laugh. So, If you like to laugh and especially if you're a fan of either Audrey or Peter then this movie is a \"must-have\". I rate it 10 out of 10.","user":"dwoolsey90-1","rank":[64,74]}]