[{"title":"Unusually comical","rating":6,"date":"20 January 2005","review":"A father fights for the right for his mutant child to live, the court grants that and his child plus another 4 are sent to an island to live.<br><br>It was Warners Brothers idea for a third It's Alive film, which would be shot back to back with Return to Salem's Lot. It was meant to be release straight to video with RTSL, but it got a limited theatrical release.<br><br>This film had a little bit more money than that of the 2 previous films, but this time around the film is an over the top black comedy compared to the bleak and serious tone of the first two films, which had subtle humour.<br><br>This film was far less effective in the horror and atmospheric department, but not the laughs and it's been more action packed than the previous films. Though it is a stupid and lightweight film, it was still quite fresh (with a different take on the Alive films) and enjoyable to watch that's if you're in the right frame of mood.<br><br>Cohan has a knack of casting the right people, with reasonable performances or you can call them hammy from Karen Black playing the mother to one of the babies and James Dixon (only one in all 3) as Detective Perkins and the standout performance and scene stealer would have to be Michael Moriarty as the father. He brings a strong central character that has a weird sense of humour and goes suddenly bananas with his lunatic behaviour when the film goes along.<br><br>Not only is the casting good, but also the script is full of wit and satirical comments (like the other 2 films) on American and Cuban relations, people's emotions, Aids and the media. The pace of the film is perfect and Daniel Pearl (The Texas chainsaw massacre) brings another element with his cinematography and lighting. The score is alright and the same for the atmosphere. The effects are pretty lame, with stop motion, puppets and people in rubber costumes. Too much of the creatures are shown, making it laughable (especially the grown-up versions of the babies), but that's what makes this fun viewing.<br><br>The film seems to lose itself and becomes incredibly stupid when the grown up mutant's decide to leave the island and head back to the mainland. Some of those scenes and its humour is totally cringe-worthy, but for what its worth It's nothing but over the top cheese, it's not great but otherwise quite amusing.<br><br>3/5","user":"lost-in-limbo","rank":[12,12]},{"title":"Michael Moriarty unleashed!","rating":6,"date":"27 November 2007","review":"Larry Cohen returns after nearly a decade to finish off his mutant baby trilogy with mixed results. Stephen Jarvis (Michael Moriarty) battles in court for the rights of the mutant baby he had with his wife Ellen (Karen Black). The sympathetic judge orders all of the babies to be placed on an island. 5 years later, a scientific team gets together to visit the island and check the progress. Naturally, Jarvis is brought along because of his ability to communicate with the mutants.<br><br>Cohen certainly has tons of ideas with this one. This is a court room drama, KING KONG adventure, and urban chase thriller all in one. Heck, he even throws in an out of nowhere tangent where Jarvis ends up in Cuba. I would say maybe 50% of the ideas work, with the island stuff (shot in beautiful Hawaii) being the highlight. Cohen is also betrayed by the FX for the grown mutants, which look like the babies on steroids. Moriarty also gives quite a performance as the sarcastic Jarvis. There is a great cast alongside Moriarty and Black including Gerrit Graham, Laurene Landon, and director Neal Israel. Also, Cohen regular James Dixon returns in his biggest role to date as Lt. Perkins, the only character to appear in all three films (outside of the killer kids).","user":"udar55","rank":[8,8]},{"title":"Not a Popular One, But My Favorite of the Three","rating":6,"date":"1 May 2007","review":"Stephen Jarvis is the father of the monster (where \"the monster\" is another bloodthirsty infant). He gets involved with a court case that ends up getting the infants sent to an isolated island. But once the judge who ordered the infants away dies, different parties want them back in the spotlight.<br><br>Many people, including my horror reviewing colleague Don Normann, really dislike this film. It is considered the weakest of the three, the least popular and I would suspect that most consider it the cheesiest. I really liked it -- this one, more than the other two, seemed to really hit on a variety of social commentaries. Writer and director Larry Cohen's strength is his social commentary. Actually, that's almost his only strength -- he has no budget, is poorly organized in his shooting schedules and writes much of his scripts on the fly (which is quite obvious).<br><br>Two of horror's icons appear here: Michael Moriarty (as Stephen Jarvis) and Karen Black (as Ellen Jarvis). Black is probably now best known to modern audiences from Rob Zombie's \"House of 1000 Corpses\". Moriarty, on the other hand, is a Cohen staple -- appearing in \"Q\" and \"Pick Me Up\", for example. And this happens to be one of Moriarty's better roles (he has a very unique way of delivering dialog which works here but is dreadfully awful in \"Pick Me Up\"). I found him to be a good lead, especially in the improvised segments (such as the singing scene).<br><br>There is a good commentary on disease (does an infected child mean an infected parent) and a really good jab at Cuban-American relations. I think Cuba's military obsession is played up a bit, but the part about them being human was a good one (and still relevant twenty years later). And the pharmaceutical company trying to destroy the infants so their drugs couldn't be blamed... very nice (and reminiscent of the Thalidomide scandal).<br><br>Lastly, once you've watched it, watch it again with audio commentary (if you get the chance). Cohen's explanations really add a new dimension to this picture, pointing out where Bob Kane's wife comes in (Kane invented Batman), how many of the parts are just Cohen's friends and how a rubber chicken ended up on a deserted island. His justification for a variety of aspects of this film really help you understand what he was trying to achieve and make you realize just how close he came to achieving it.<br><br>If you've seen the first two, you need to see this third one. Not only does it wrap up the story in a nice, neat little package, but I think it's grossly under-appreciated. Judge it for what it is -- a low-budget B-movie. With that in mind, I think you'll be hard-pressed to find another film of its kind.","user":"gavin6942","rank":[6,7]}]