[{"title":"A minor Murnau work, but remains essential viewing","rating":6,"date":"22 February 2008","review":"As I've discovered after relatively recent viewings of 'Nosferatu (1922),' 'The Last Laugh (1924)' and 'Faust (1926),' F.W. Murnau was one of the most exciting and influential European directors working during the 1920s. His contributions towards early German cinema are rivalled only by Fritz Lang, and his ability to use lighting and shadows to create atmosphere are almost unparalleled. 'Herr Tartüff / Tartuffe (1926)' was apparently forced upon Murnau by contractual obligations with Universum Film (UFA), and you suspect that perhaps his heart wasn't quite in it, but the end result nonetheless remains essential viewing, as are all the director's films. The story is based upon Molière's successful 1664 play, \"Tartuffe,\" which explored the notion of hypocrisy, particularly among self-proclaimed religious \"devotees.\" Murnau and screenwriter Carl Mayer stripped the story to its bare essentials, removing any extraneous supporting characters and creating a close-knit triangle  Herr Orgon, Frau Elmire and Tartüff  around which the story revolves. Murnau also added an interesting framing device, whereby the story of Tartuffe becomes a film-within-a-film that a young actor shows to his grandfather to warn of his housekeeper's evil intentions.<br><br>Interestingly, I found the story's prologue  of the old man and his scheming housekeeper  to be a more engrossing story than the film that the characters are later shown. The conniving old woman (Rosa Valetti), with a devilish grin like a Cheshire Cat, manages to convince her senile employer (Hermann Picha) that his grandson has dishonoured the family name by becoming an actor, and so she sets herself up to inherit his entire fortune. When the sincere young actor (André Mattoni) finds out about this betrayal, he plans an ingenious stratagem to outwit the malicious housekeeper and convince his grandfather of her evil. Murnau was obviously a great believer in the power of cinema, and so it's no surprise that the young man chooses the cinematic medium with which to reveal the ultimate truth about hypocrites. The film, by employing a few deceptively simple shots, immediately translates the inner motivations driving each character: the housekeeper, greedy and malevolent, kicks aside her master's slippers, whereas the kind, loving grandson delicately sets them back into place. Also notable is a moment during the narrative when the young actor turns to the camera and addresses the audience directly, one of the earliest instances I've seen of a character \"breaking the fourth wall.\"<br><br>The tale of Tartuffe himself is also worth watching for its technical accomplishments, even if the story itself seems somewhat generic and uninteresting. Most astounding is Murnau's exceptional use of lighting {assisted, of course, by cinematographer Karl Freund}, and, in many cases, entire rooms are seemingly being illuminated only by candlelight. This story concerns a happily-married woman, Frau Elmire (Lil Dagover), who is distraught to discover that her beloved husband, Herr Orgon (Werner Krauss), has become obsessed with Tartüff (the great Emil Jannings), a grotesque little man who speaks with divine importance and claims to be a Saint. However hard she tries, Elmire cannot convince Orgon that he has been duped by a religious fraud, so great is the cunning of Tartüffe's deception. In the film, Jannings predictably gives the finest performance, playing the unsavoury title character with a mixture of sly arrogance and lustful repugnance. Nevertheless, the role falls far short of the silent actor's greatest performances, which include Mephisto of 'Faust (1926)' and the hotel porter from 'The Last Laugh (1924).'","user":"ackstasis","rank":[12,12]},{"title":"Not his best, but still excellent by anyone else's standards.","rating":8,"date":"18 December 2005","review":"Personally I think the other reviewers have been way too hard on this film, and I certainly don't agree that it is \"extremely average\", \"throwaway\" or \"plain and forgettable\". OK - it's not his best by a long shot, but Murnau was such a talented directer/artist that even his weaker films urinate all over the films of most other directors. I thought that the 'film within a film' structure of it worked brilliantly. The cast were all excellent in their acting. The film is pretty great visually too (as one would expect from Murnau) - the 'outer' film is shot in a crisp, modernist style, with adventurous camera angles and no make up, while the central 'film within a film' section was filmed in a more classical, soft-focus style. The film was also quite risky for it's time in its depiction of sexuality, and corruption within the clergy, and several scenes were censored for American audiences.<br><br>The central theme of the film is hypocrisy, particularly with those who are overly pious, judgemental and puritanical. This is encapsulated in the words of Tartuffe when he admits: \"Who sins in secret - does not sin\". Murnau expertly exposes the true roots of fanatically pious behaviour - behind which lies its very opposite. This is very similar to what Freud termed 'reaction formation', whereby a character trait or impulse which one finds unbearable to oneself (the ego) is disguised and repressed by bringing a complete opposite tendency to the facade of ones personality - but this is always noticeable by its exaggeration. The Tartuffe character also indulges in another Freudian defence mechanism called 'projection', whereby one relieves the anxiety caused by an unwelcome trait by projecting it onto others.<br><br>It's important to mention that this film also works brilliantly as a satire, and at times I found myself laughing out loud at the grotesque character of Tartuffe. In one scene the obedient Emile is seen rocking Tartuffe as he yawns and lazes in a hammock like a selfish baby. Yet despite the ridiculing, there is always a deep humane concern underlying the film - as there is with all of Murnau's films.<br><br>So, like I said: this is not one of his best, but any Murnau film is worth seeing.","user":"OsbourneRuddock","rank":[9,9]},{"title":"TARTUFFE (F. W. Murnau, 1925) ***","rating":8,"date":"18 March 2006","review":"In 1992, an Italian TV channel showed a two-week late-night retrospective of Silent films, the bulk of which were expressionist classics. Unfortunately, I missed out on a couple of these and TARTUFFE was among them. More than a decade had to pass before I could watch it, by which time I had come to consider Murnau - despite the fact that only a small portion of his work has survived the ravages of time - as one of the undisputed masters of cinema.<br><br>For some reason, TARTUFFE has been little-seen over the years so that it never had much of a reputation (which may explain why I by-passed its sole TV showing to begin with!); having watched the film now, it clearly emerges as a masterwork from the golden age of German cinema and its place in Murnau's irreproachable canon (still impressive 75 years after the director's untimely death!) should not be overlooked.<br><br>Having watched OTHELLO (1922) - which also starred Emil Jannings and Werner Krauss - relatively recently, I couldn't help noticing that it offers an interesting role-reversal with Murnau's film for these two powerhouse actors; in fact, Jannings' larger-than-life performance here is played alongside an impressively restrained turn from Krauss (whom I had previously only seen essaying villainous characters). One of TARTUFFE's most interesting elements is its 'film-within-a-film' structure that looks back to THE CABINET OF DR. CALIGARI (1919; featuring Krauss's most famous role, interestingly enough) and forward to Hiroshi Teshigahara's THE FACE OF ANOTHER (1966) - which, coincidentally, I watched the very next day (my review of which is shortly to follow) without having prior knowledge of this! Criticized at the time for being a pointless flourish on the film-makers' part, I strongly feel that - with respect to TARTUFFE, at least - this device merely underlines the universality of the main theme being dealt with. I see, however, a third connection at play here, this time with Murnau's own NOSFERATU (1922): Tartuffe is presented as a different form of bloodsucker, one who is not undead but very much alive (or human, if you like), and just as dangerous - not to mention that much more common in our daily life than the vampire of myth and literature; besides, the fact that - as in NOSFERATU - here it is the devoted wife of the man under the influence of Moliere's symbolic figure of hypocrisy (\"From now on, all hypocrites shall be called 'Tartuffe'!\" reads a subtitle) who brings about his come-uppance, by 'sacrificing' herself, only helps reinforce this particular aspect.<br><br>Despite the film's relative brevity (explained in my notes for the accompanying documentary below), its intimate nature, and also the fact that Murnau was handed the project at short notice, his trademark stylistics of expressionistic lighting and acrobatic camera-work are well in evidence. Finally, I would like to say something about the English subtitles - displayed over the original German intertitles - for all three of \"Masters Of Cinema\"'s Silent releases (the others being, of course, SPIONE [1928] and ASPHALT [1929]): I admire Eureka/MoC's decision to preserve authenticity in every aspect of their DVDs, but the interweaving text (with the English translation appearing in too small a font) makes it a comparatively labored read overall! At this juncture, I truly regret missing out on the retrospective of Murnau's work shown a few years back at London's National Film Theatre - and I can only long for the time I will be able to watch the likes of JOURNEY INTO THE NIGHT (1921), THE HAUNTED CASTLE (1921; when I was in Hollywood I held in my hands a DVD-R of this film but, since it had been announced for DVD release by Image, I didn't rent it), THE BURNING SOIL (1922), PHANTOM (1922; the same comments for THE HAUNTED CASTLE apply here, its DVD release from Flicker Alley has been imminent for some time now!), THE GRAND DUKE'S FINANCES (1924) and CITY GIRL (1930). It's inconceivable how the work of such an important film-maker, so long as it is available, is kept mysteriously under wraps - thus denying film buffs everywhere the opportunity of enjoying it! <br><br>The 41-minute documentary, TARTUFFE: THE LOST FILM (2004; TV), is an essential watch for fans of Silent films and director F. W. Murnau: although TARTUFFE may not be among Murnau's greatest films, it is certainly one of his most personal as he identified himself with the young relative who is shunned from his inheritance because he has chosen the lowbrow way of the artist rather than a more lucrative profession. Besides, the documentary highlights the depressing state of most Silent films in existence today: while we should consider ourselves lucky that the U.S. theatrical version of TARTUFFE (from which the DVD transfer was made) is in such a good state, it is considerably shorter than the original German version. Fragments of the lost scenes shown in the documentary include a couple of key sequences which, as incomplete as they are in the film now, seem a little rushed. Although the quality is understandably inferior, one wonders why they weren't included in the main feature itself.","user":"Bunuel1976","rank":[10,11]}]