[{"title":"Classic","rating":8,"date":"25 July 2012","review":"It's pointless to review the Stooges movies by comparing them to the shorts. These are two very different artforms. The Stooges shorts are easy to like, the movies need a bit of willing suspension of adulthood.<br><br>I first saw Three Stooges in Orbit as a kid, and that's the way I'd suggest seeing it now. There are so many reasons I really love this film, but most of them won't make sense to a dried up adult.<br><br>Even in this computer-graphic age, there's so much here that a kid just has to enjoy. The flying submarine, for starters. What a concept - it both hearkens back to Jules Verne, and anticipates Terry Gilliam by several decades. The goofy aliens. As a kid I was scared of them, amused by them, and just transfixed by the alien-ness of them. The wacky rotoscope animation process the Stooges are working on. Could that really have worked?<br><br>The Stooges movies are very different from the shorts, in that they're actually about storytelling. But there's plenty of Stooge-mania along the way. The whole thing with the A-bomb in a dust storm is side-splitting. (\"Visibility, zero!\") The antics with a hole in the cellar wall, a pipe and a raygun. And others. But they're in support of a story.<br><br>I was always aware that these movie-length Stooges were very different from the ones I saw in the shorts. For one thing, Curly was gone. For another, they were a lot older. But they were still geniuses at what they did: creating a magical world of laughter and imagination.<br><br>To me, these creaky old low-budget films are cinema at its finest. They created a magical world for me when I was a kid. Decades later, they still play in my head.","user":"fung0","rank":[13,13]},{"title":"It's A Happy Memory For Alot of Baby Boomers","rating":9,"date":"9 December 2003","review":"Sure, I know this film is not a great comedy, or even a good one. But for alot of us aging boomers this film is a sweet memory. It recalls a more innocent time in movies, and an appreciation for the Stooges in their autumnal years. And what's wrong with dancing Martians?","user":"westegg","rank":[22,24]},{"title":"Monotonous or momentous?","rating":18,"date":"18 August 2005","review":"(Please note: \"The Three Stooges in Orbit\" has always been one of my favorite Stooge films since I was a teenager in the early 1990s, and it still is today. However, at the time I wrote the commentary below, I briefly began to have mixed feelings about the film. Anyhow, here is my commentary.)<br><br>I have read that \"The Three Stooges in Orbit,\" directed by the usually great Edward Bernds, is not one of the better feature films that the Stooges made. Indeed, the story is not well put-together; it might have just been an excuse to incorporate stock footage from the Stooges' unsuccessful TV pilot \"The Three Stooges Scrapbook\" into the first twenty or so minutes of \"Orbit.\" Adding to the flimsiness of sixties sci-fi production values are the appearances of the Martians; they are basically human bodies with hideously over-sized heads and embarrassingly unintelligible language. And the music score of Paul Dunlap, while somewhat interesting, may not be enough to enhance the picture. However, \"The Three Stooges in Orbit\" is still entertaining to watch, and the boys are greatly supported by their long-time pal Emil Sitka, who has a substantial role as the eccentric Prof. Danforth.<br><br>Here are some of my favorite highlights from \"Orbit\" (do not read on if you have not yet seen the picture). The model of the professor's tank/helicopter/submarine buzzes Curly-Joe while he takes a shower; he ends up dousing Moe, Larry, and the professor when they arrive to help him. The Stooges resemble Martians in their white costumes and makeup when the professor films them applying the latest dance craze for their faltering cartoon show. When Martians Ogg (George N. Neise) and Zogg (Rayford Barnes) hijack the professor's vehicle and traverse the sky while the Stooges hold on for dear life, Curly-Joe gets his head stuck in the ray gun that the Martians installed. While the Stooges help the professor fine-tune the vehicle before showing it to the Air Force brass, Larry accidentally squirts oil onto Curly-Joe's face; Joe, in turn, staggers onto the vehicle's controls, causing Moe to fearfully spin around on a helicopter blade. At a climactic moment, Moe figures out what the Martians are up to by reading the English subtitles off the screen; the boys then accidentally knock each other out in trying to knock out Ogg and Zogg. The Stooges make a total mess out of their demonstration of Prof. Danforth's vehicle for the Air Force. And finally, Curly-Joe proves he doesn't know how to work a hammer and chisel; Larry tries to help him, but he proves himself not much smarter.<br><br>So \"The Three Stooges in Orbit\" may not be the best feature film that the boys tackled. But I would like to believe that every film has its good points, and this film delivers at least a few laughs for the Stooge fan.","user":"slymusic","rank":[6,7]}]