[{"title":"A strange, strange film","rating":7,"date":"29 March 2014","review":"Night Moves is not a bad film. It's actually quite good. It is also off-beat and a just a little bit odd but not quirky. <br><br>It is not hard to figure out why a young girl has run away from home when we see her mother, a washed up, alcoholic living in the Hollywood Hills. What is odd is trying to figure out the relationship between her, her stepfather and his girlfriend in the Florida Keys where she has gone to live. It is hinted that the stepfather is not just a stepfather. <br><br>Even stranger is Jennifer Warren's odd, abrupt, salty behavior in the film and the the strange dialog written for her. At one point, Gene Hackman even tells her he is tired of her \"ping-pong talk\". Was that written for the benefit of the audience or did he improvise? I felt puzzled by much of her performance.<br><br>It is also painful, really painful to watch Gene Hackman's wife struggle with their relationship and her learning new things about her husband. <br><br>Yes, a strange, strange little film. The acting is almost too revealing. I can't quite wrap my brain around the whole thing. I think it will be appreciated by fans of films from the 70's.","user":"sunznc","rank":[12,12]},{"title":"Excellent Film Noir, Superbly acted and well directed","rating":8,"date":"10 September 1998","review":"Night Moves is an underrated Film Noir. Directed by Arthur Penn (Bonnie &amp; Clyde) it is an absolutely outstanding genre piece. Gene Hackman plays an L.A. gumshoe who is hired by a well to do ex-actress to find and bring home her runaway daughter (Melanie Griffith in her first role!). What seems to be routine detective work soon turns out to be a complicated case which finally ends in murder and mayhem. There are some remarkable stunt and underwater sequences, well photographed by Bruce Surtees (Director of Photography of many Clint Eastwood action movies). Not only Melanie Griffith but also another of today's stars, James Woods, gave his screen debut in this film. See it, it is worth the while!","user":"Kar-2","rank":[38,49]},{"title":"The masterpiece of 70s American anti-detective movies (possible spoilers)","rating":8,"date":"21 December 2000","review":"When you notice that a boat, on which the detective sees the crucial evidence, is hit and shot at, and finally 'solves' the crime, is called 'Point of View', you know you should have been watching harder.  'Night Moves' is the greatest of the 70s American anti-detective movies influenced by 'Vertigo', Antonioni and Bertolucci; films that used a genre all about solving the crime and re-ordering a ruptured social order, expelling the maleficent, and undermining it, to deconstruct the figure of the detective as arbiter of knowledge and order, suggesting that the world, or a human being, is not open to interpretation, ordering, patterning; that there are limits to reason.  Most American anti-detective films, however, are rather heavy-handed in their messages - 'The Parallax View' obscures itself in a dense murk, 'The Conversation' is full of European austerity and ellipsis.<br><br>'Night Moves', on the other hand, plays as a hard-boiled thriller, in the style of contemporaries like 'Chinatown' or 'Farewell My Lovely'.  We have a rich Chandlerian brew of flawed, basically decent dicks, femmes fatales, wastrel rich with their errant offspring, and a satisfyingly convoluted plot.  And 'Night Moves' can be enjoyed like this - Penn never makes deliberately 'arty' his material.  The film also functions as a complex psychological piece, about a once-successful, popular athletic man reduced to peeping on cheating wives (first his clients, then his own). <br><br>\nThis is linked on the one hand to the decline of America (Harry's success and decline framed by the assassination of the Kennedy brothers), and to the family: Harry himself haunted by his own mysterious relations with his father, his marriage being notably childless, his quarry being a highly sexed teenager who's run away from a promiscuous mother to a smuggling father.  The account of Harry's crumbling marriage and his personal regrets is as moving as his distaste or the paint-like qualities of Eric Rohmer is funny.  <br><br>But this generic realism, if you like, does not preclude more abstract elements such as the title, with its suggestions of chess, of a game where Harry isn't sure whether he's grandmaster or pawn, or to the playing out of the drama, where the most significant events, both in terms of the mystery and Harry's personal life take place at night, or the idea of the narrative as a dream.  For instance, what is the connection between Harry's wife's job as a vendor of antiques, and the central smuggling crime?  Is Harry transposing the failure of his domestic narrative onto his professional one, in the hope that by solving this he'll make good the first? <br><br>\nHarry is being led by dark forces (within himself) beyond his control.  The Florida Keys hideout of Delly's stepfather (where the first sequence has the time- and plot-suspending atmosphere of an enchanted realm) boasts a sign, '66', which suggest the famous route, one version of the American dream dashed in this film, or more sinister, diabolic, forces.<br><br>For me, this masterpiece is all these things, but mostly it is a critique of the gaze, the power to see and interpret that is the raison d'etre of the detective, from which he derives his power and status.  Harry's gaze is severely undermined throughout, by being misled, by personal blocks, by simply interpreting wrong.  When the solution is revealed, it is certainly not any of Harry's doing - it is brought to him with bloody murderousness. Throughout the movie, we see Harry looking at people or things through blinds, curtains, screens etc., his view impaired.  <br><br>But it's more than this.  In his wife's lover's house (is he blind?  I thought he was until near the end - see, need to look harder!), there are trompe l'oeil effects in the windows which seem to transform and distort the visual field we look through.  It's a small thing, but, like those little clues Nabokov scatters in his books, its reverberations and implications are potentially massive.  This is linked to the cinema (Harry is seen by others through a screen-like frame) that makes up the plot's supposed background (remember, Harry discovered his wife's infidelity coming out of a movie theatre).","user":"the red duchess","rank":[45,59]}]