[{"title":"Classic Slapstick","rating":9,"date":"9 May 2001","review":"The basic synopsis of Wheels on Meals is as follows:  Jackie Chan and Yuen Baio are two Chinese immigrants who run a mobile snack van business in Barcelona.  Sammo Hung, also a chinese immigrant living in Barcelona, works as a very badly dressed PI. Sammo is hired by a dubious looking gentleman in a bowler hat to track down a Spanish girl, who it just so happens is the daughter of Yuen Baios dad's girlfriend. This sets the scene for, amongst other things, a bizarre retro skateboarding sequence, a ludicrous car/van chase and a top class fight at the end.<br><br>For me, Wheels on Meals represents the ultimate combination of comedy kung fu and naive slapstick humor.  It's worth pointing out that this film isn't as good a Martial Arts flick as some of the earlier works that it's three main stars were involved in (Young Master, Magnificent Butcher, Prodigal Son, etc).  However, the main strength of Wheels on Wheels is it's ability to get new mileage out of some very old gags, and it also proves once and for all that unusual hats can be very funny.<br><br>I give it nine out of ten.","user":"rbclarke","rank":[16,17]},{"title":"Fun and excitement in Spain with the 3 Brothers","rating":7,"date":"8 September 2003","review":"I first heard of this when TNT was showing it after the TV premiere of Rumble In The Bronx. I couldn't make it through the first 10 minutes because of the bad dubbing and the mixing around of scenes (The very first scene was Jackie and Yuen skateboarding in Spain, rather than them waking up and getting into their morning routine). A couple of months ago, I got the Hong Kong DVD and loved it. <br><br>The movie is about Thomas (Chan) and David (Biao), two Chinese guys who run a successful food truck business in Spain. They get caught up in wannabe detective Moby's (Hung) case to find a Spanish heiress, and the fun goes from there. The chemistry is great between the three brothers, and Lola Forner is a great distraction. The writing is funny, and Sammo's direction is right on target. The fight scenes are great. If you want to watch vintage Jackie, watch this film as he can move quick. The much talked about fight between Chan and Benny \"The Jet\" Urquidez does not disappoint. Want a lesson in how to do a fight scene? Watch these two guys go at it (They would have a rematch a few years later in Dragons Forever). <br><br>For all of you fans of JC credit outtakes, there is none (JC didn't start using them until Police Story). But in a funny, action packed movie like this, you won't care. It is one of The 3 Brothers best, and it will leave you wanting more.","user":"MichaelMovieLoft","rank":[16,18]},{"title":"Great Jackie Film","rating":10,"date":"14 November 2004","review":"This movie contains the apparent 'best jackie chan fight' ever, which is why I bought it, I guess I expected too much. The last fight really is excellent, but didn't top Drunken Master, or 'Gorgeous' for my standards.<br><br>What really stunned me about the last scene was the excellent choreography, and Benny \"The Jet\"'s great skill. The actually thought this may be Jackie's best \"Movie\" even if the fight scene at the end was his 3rd best IMO. Sammo Hung is really quite a character, good acting skills and a unique look, not to mention he is a skilled Martial Artist. The plot, as simple as it is, leaves you quite entertained through-out the movie, and Lola Forner is great too. I only wish my DVD has better English subtitles!<br><br>10/10","user":"dsabverticus-1","rank":[16,19]}]