[{"title":"Man, I gotta own this movie.","rating":20,"date":"20 June 2001","review":"Okay here it goes.  This is my favorite 80s horror flick EVER.  This is the reason I am so obsessed with the genre.  This is where the fascination started.<br><br>Let me explain why:  Okay, here's this kid Eddie.  Eddie is your typical 80s headbanger (you know, Motley Crue, W.A.S.P, Anthrax....you get the idea) except Eddie has a brain.  Eddie(brilliantly portrayed by Marc Price) is the target for frequent bullying and public humiliation (see the locker room scene).  He has exactly two friends and his only consolation comes from his music.  His idol, Sammie Curr, happens to share the same hometown as Eddie and Eddie writes the guy (what seems to be) on a daily basis.  Well, Sammie dies dies in a hotel fire and Eddie is naturally devastated. So, he goes to see his D.J. buddy \"Nuke\" (played by none other than Gene Simmons).  Nuke sees how torn up the kid is over Sammy's death and gives him Sammie's last record which was never released.  Nuke also tries to explain to the kid (apparantly Nuke knew Sammie in high school) that his idol wasn't such a nice guy.  \"He was always angry.\" Of course, this means nothing to Eddie. He is totally infatuated with the guy and he believes that the two have some sort of connection.<br><br>More humiliation and more torment follow Eddie until he finally plays the record.  Upon playing the record backwards, he finds that he can communicate with Sammie's ghost. He also learns that Sammies is more than eager to help Eddie get revenge on the high school jocks who have made his life such a living hell. In a good way, Sammie gives Eddie the nerve to stick up for himself.  Eddie also learns that Sammie is bent on wreaking havoc on the town that refused him the right to play in his home town years ago.<br><br>You see, this all leads to Eddie having to make a choice:  Either turn on his idol OR save the town from mass destruction.<br><br>All in all, I give this cult classic a perfect 10.  It is totally entertaining and has a very clever script.  I especially liked all of the cameos.  Gene Simmons as \"Nuke\" was awesome, Ozzy himself was great as a reverand who despises rock music, and Charles Martin Smith (you know, \"Toad\" from American Graffiti\")  he's here too. He was also the director.<br><br>There are many reasons to see this movie.  The acting is good by the whole cast, there are some genuinely suspensful moments, there is some great humor, there is \"the dweeb getting revenge on the jock\" scenario, and the music kicks ass.  It is also a great flick for anyone who was into the whole \"80s metal\" movement of the time.  I whole heartedly recommend.  When is this coming to DVD anyway?","user":"billybrown41","rank":[31,34]},{"title":"The timing has to be right","rating":6,"date":"6 July 2003","review":"I noticed many of the comments on this movie came from people who saw it during the last five years and bought it out of a bargain bin of $5 or $6 DVDs. I saw it when it came out in 1986 and was quite entertained. I learned long ago when it comes to watching horror flicks, you can't take them seriously. In this case, it's simply a sign of the times. During the 1980s when the concern over music's lyrics was at it's peak and Tipper Gore was on her PMRC crusade, this movie fit perfectly.<br><br>Please don't judge it in the 21st century. That's why you haven't seen it in a bargain bin until now. It just doesn't fit anymore. I give it a 3.5 out of 5 for its entertainment value.","user":"ricaritatu","rank":[40,46]},{"title":"A True Metal Movie","rating":10,"date":"7 January 2002","review":"This film is the most cult movie on metal there is. Premise: A kid gets a hold of the final recording of his favorite artist Sammy Curr who recently dies in a hotel fire. He plays it backwards and summons him back from the dead to get revenge in the name of heavy metal on those b**tardly jocks who torment him. Any fan of true metal will enjoy this movie, and if you are a metal head being tormented by jocks, play a Sammy Curr album backwards.........no wait he is fictitious, well get a hold of this movie and watch it with your fist in the air, your head banging, and the volume at 11!","user":"Mondo-Cane","rank":[26,30]}]