[{"title":"A beautiful, haunting and complex film noir","rating":10,"date":"11 July 2005","review":"Rather than films like Citizen Kane (1941) and The Lady from Shanghai (1947), neither of which am I a big fan of, Touch of Evil evidences director/writer/star Orson Welles' capacity for cinematic genius. The story is engaging, suspenseful, tight and well paced; the cinematography is consistently beautiful, inventive and symbolic; the setting and overall tone of the film, including the performances, are captivating, yet slightly surreal and otherworldly; and there are many interesting subtexts. This all combines to create a complex artwork that will reward however far a viewer wishes to dig into the film.<br><br>Based on a novel by Whit Masterson, Badge of Evil, Touch of Evil is a battle between two policemen--Hank Quinlan (Orson Welles) and Ramon Miguel Vargas (Charlton Heston). Parallel to this is a kind of border battle between the United States, represented by Quinlan, and Mexico, represented by Vargas; the film is set in two border towns, frequently crossing over.<br><br>As Touch of Evil opens, we see a bomb being placed in the trunk of a car in Mexico. A construction company owner, Mr. Linnekar, gets in with his girlfriend. Vargas and his new wife, Susan (Janet Leigh), manage to walk along next to the car--they're all crossing the border into the United States. Shortly after crossing, the bomb goes off. This brings the gruff Quinlan into the picture. His investigation of the bombing brings him into Mexico for suspects. Meanwhile, Vargas and his wife are being threatened by Joe Grandi (Akim Tamiroff), a Mexican mob boss, and his underlings. Both Quinlan and Vargas are well respected in their countries, and both are used to getting what they want. But the bombing investigation ends up putting them at loggerheads, and Quinlan gradually turns out to have more than a \"touch of evil\".<br><br>As with many of his films, Orson Welles ended up having to battle the studio to realize his artistic vision. Usually, as here, the battle was unsuccessful for him. Despite his 58-page memo detailing various problems with Universal's non-director supervised reshoots (by Harry Keller) and re-edits, because they felt that Welles' final cut \"could use some improvement\", the film was released in a form that was not satisfactory to Welles. The fiasco has resulted in various versions of Touch of Evil appearing throughout the years. The 58-page memo was thought to have been lost, but a copy was discovered relatively recently in Charlton Heston's possession. The film was recut in 1998 based on Welles' memo. So make sure that you watch the 111-minute version first released by Universal on DVD in 2000.<br><br>The opening scene of Touch of Evil is famous, and rightfully so. Beginning with the timer being set on the bomb, then the bomb being placed in Linnekar's trunk before he gets into the car, we follow both the car and the relative ebb and flow of Vargases as they roughly walk alongside the car, all in one very long tracking shot that covers a lot of ground and features a lot of unusual angles. Welles stages the scene so that there are all kinds of complex background and foreground elements interacting with the car and our protagonist pedestrians. The suspense built up in this scene is incredible--you just know that bomb is going to go off, but you don't know just when, or who it is going to hurt. Compositionally, the scene is simply beautiful. The film is worth watching for this opening alone, but the whole of Touch of Evil features similar, meticulously planned artistry, filled with suspense.<br><br>Welles as an actor tends to have a very peculiar way of speaking that is full of affectations. Sometimes this can be a detriment to the film, as it was in The Lady from Shanghai. Here, though, the oddity works, and this despite the fact that, like Woody Allen, he seems to direct his whole cast to deliver their dialogue as if they were him. As a result, Touch of Evil has very peculiar, contrapuntal scenes where people frequently talk on top of one another, with odd phrasing. It works because of the particular kinds of personality conflicts that Welles set up in the script. These are people who frequently _would_ talk on top of each other and occasionally not pay attention to each other.<br><br>But that's not the only odd thing about the film. Welles managed to find locations that, shot in this highly stylized and cinematographically complex film-noir manner, seem almost otherworldly. Except for a couple expansive desert shots, Touch of Evil feels eerily claustrophobic, even though most locations aren't exactly enclosed. The various modes and settings are all perfect for their dramatic material, which is mostly dark and moody. One change that Universal made was the excision of a lot of comic relief material featuring the Grandi family. Universal was right to cut it, and wisely, Welles agreed.<br><br>The music in the film is also extremely effective but unusual. Most of it is incidental. Latin and rock 'n' roll emanates from radios, for example, and the climax intermittently has a repeating, contextually haunting theme from a pianola.<br><br>But of course the story is just as important. Although Welles stated hyperbolically at various points that he was trying to \"infuriate\" the audience with a somewhat inscrutable plot, and it's true that the plot isn't exactly given in a straightforward manner, once you figure out the gist, it's relatively simple but extremely captivating. At the same time, it is full of symbolism and subtexts, including commentary on justice systems and perhaps some irony about the popular conceptions of the U.S. versus Mexico (made more complex by the fact that Quinlan spends just as much time south of the border and Vargas seems to spend a lot of time north). But as for being annoyed, you're more likely to become infuriated with Quinlan, who becomes more and more deliciously despicable as the film unfolds.","user":"BrandtSponseller","rank":[131,162]},{"title":"Another touch of brilliance from Welles","rating":26,"date":"26 January 2005","review":"Considered by many to be the last \"classic\" noir film ever made, and perhaps the last masterwork from child prodigy Orson Welles, who looks about sixty in this film, despite his 42 years. In TOUCH OF EVIL the \"noirish\" dark streets and shadows are darker than ever, practically swallowing up the soft tones like a murky swamp. The action takes place in a nondescript U.S./Mexico border town where the worst that both sides has to offer is most in evidence. The famous opening scene (a 3 1/2-minute continuous shot) where we witness a time bomb being placed in the trunk of a Cadillac is masterful. The camera pulls in and out of the city scene as it follows the motion of the vehicle winding its way through streets littered with pedestrians, thus effectively creating a level of anxiety that could not be duplicated with multiple edits. After the inevitable explosion, the drama dives into a seedy world of corrupt police justice and malevolent decrepitude, which is filmed with such a stylish flair, it is almost weirdly humorous and playful! Mike Vargas, the good guy, is played by Charlton Heston and seems more than a wee bit miscast as a Mexican narcotics officer with his face darkened by makeup. When U.S. Police Captain Hank Quinlan (Orson Welles) first meets him he remarks, \"He doesn't look Mexican.\" Quinlan is the ultimate repugnant cop gone bad and Welles has the camera looking up into his nostrils most of the time making his character look even more monstrous. But Quinlan is also pitifully sad. A man who once had the instincts of a cat and the intelligence of a fox has been reduced to an insignificant mass of tissue, who's \"instinct\" is having a knack for finding evidence that he himself has planted. And while he may be revered by the local officials in law enforcement, he's acutely aware that he is a fraud and petrified that Vargas, has seen him naked.","user":"stephen-357","rank":[98,130]},{"title":"Spellbinding thriller","rating":10,"date":"8 November 1999","review":"There are only two ways to write a review that would truly do this film justice.  Either one would have to write an exceedingly long review, or a short, concise one.  I choose to do the latter.<br><br>When I first saw \"Touch of Evil,\" I was glued to the chair.  When I found out it was not Welles' definitive vision, I wondered how on earth it could have been made better.  And when I saw the re-released version, I wondered why the studio altered it.  The stunning black-and-white images, the intricate plot, and the powerful, engaging performances took a hold of my imagination.  At times, I imagined myself on the street with the characters, because the atmosphere was so thick I felt surrounded in it.<br><br>The actors all did an outstanding job, especially Leigh and Heston (who, although not thoroughly convincing as a Mexican, soared above his usual powerful, furious presence).  This is Welles' picture, however, and whenever the camera catches his obese figure, you are fully aware of the man as a director and an actor.  His powerful vision drives the film, from the single-cut opening sequence to the cat-and-mouse finale.<br><br>I suggest watching the 1998 restored version over the original theatrical release, but regardless of which version, \"Touch of Evil\" will have you stuck in your seat, questioning your views of morality until long after the last credit has rolled up the screen.","user":"Dr.Teeth","rank":[140,202]}]