[{"title":"Victor Mature as 007? Cubby Broccoli's feasibility study for the Bond franchise","rating":6,"date":"19 June 2004","review":"A law-and-order thriller focusing on the international narcotics trade, Interpol (aka Pickup Alley) harks back to such dire warnings as Port of New York and To The Ends of the Earth. It looks forward, too.  Courtesy of co-producer Albert (Cubby) Broccoli, who five years hence would issue the first film in the deathless 007 franchise, Dr. No, this British-made movie serves as a brief, black-and-white preview of the trans-global intrigues James Bond would soon be set to smashing. <br><br>\nThe surly secret agent here is drug-enforcement officer Victor Mature, and his motives are not merely professional: Not only is his `kid sister' hopelessly hooked to the needle, but in the pre-credits opening scene, a female colleague ends up strangled with her own scarf by heroin kingpin Trevor Howard, an arch and urbane adversary who flourishes a cigarette holder, like Charles Grey's Ernst Stavro Blofeld in Diamonds Are Forever. In pursuit, Mature jets from New York to London and thence to Lisbon, Rome, Athens, Naples and back to the States.<br><br>There's even an exotic Bondgirl (Anita Ekberg), shanghaied into working against her former boss, and an amusing local helpmate (Bonar Colleano) as an expatriate Yank peddling junk and souvenirs to tourists in the Eternal City.  He first pops up before an excursion into the Catacombs, where death proves to be not always ancient.  Similar set-pieces  chases across rooftops and up and down steep streets  enliven other ports of call.<br><br>But, like many of the Bond movies, Interpol comes at you in sections.  We cool down from one diversion in anticipation of the next.  But there's not much thought given to a determining plot-line or sustaining mood.  And the major characters aren't given much in the way of, well, character; to make matters worse, they're barely allowed to interact.  Most of what Interpol has to offer was already done earlier in the noir cycle (occasionally by Mature and even Howard), or would be done better in the splashier spectacles of the 1960s.  And let's face it: Apart from her frolic in the fountain in La Dolce Vita, Ekberg would never amount to much of a fixture in film history.","user":"bmacv","rank":[32,34]},{"title":"Reasonably entertaining crime movie.","rating":7,"date":"4 April 2008","review":"This is quite an entertaining &amp; energetic crime movie, which rattles along at a fairly brisk pace, but suffers somewhat from lack of character depth, and interaction between the characters. The leads all play their respective roles professionally and with a degree of panache, with the oily and sinister Trevor Howard particularly effective. Bonar Colleano also contributes a likable cameo as a fast-talking, quick-witted exiled American. In the central role, Victor Mature is dour and doesn't really get the opportunity to express more of his character's dual purpose of personal revenge and bringing an arch criminal to justice. Although there are many similar type films to this, I feel that it stands worthy comparison to many of them and is certainly deserving of release on DVD.","user":"ronevickers","rank":[16,17]},{"title":"Intercepting Interpol.","rating":8,"date":"11 November 2018","review":"Originally planning to view auteur Robert Siodmak's Nachts, wenn der Teufel kam today for the first time for the ICM poll of the best films of 1957, my attempt at a viewing got interrupted due to unexpectedly needing to go and sort some things out for friends. Getting home late at night, I grabbed a 1957 film which has been by the TV waiting to get viewed for years (!) and made a call to Interpol.<br><br>View on the film:<br><br>Made as the wheels on British \"genre\" cinema were starting to gain traction, the movie offers a glorious preview over what awaited, thanks to co- producer (with Irving Allen) Albert R. Broccoli making his mark, and director John Gilling bringing in future Hammer Horror stars André Morell and Yvonne Romain, an on the cusp of fame Anita Ekberg, and rounding it up with a cameo from Sid James. Closely working with future 007- Connery era cinematographer Ted Moore, director Gilling gives this globe-trotting Film Noir a slick sun-kissed atmosphere by glittering the locations with stylish low-lighting which gives off an \"exotic\" vibe, and also displays McNally's attempts to stop Sturgis capturing him in the light.<br><br>Displaying a sharp eye for stylisation which would later make his Hammer Horror films stand out, Gilling uses dissolves with a real precision in creating a disturbing impression of each murder, and up close and personal camera moves to give the punch-ups Sturgis' takes to locate McNally a frantic, rough and tumble edge. Knotting Sturgis's family into McNally's murderous underworld dealings, the screenplay by John Paxton keeps the pressure from McNally firm with stealth kills on any former associate who tries to help Sturgis out.<br><br>Putting her between both sides, Paxton builds up the Film Noir doubt by Sturgis attempting to gain the trust of courier Broger, in the hope that she will turn, and become a courier for McNally's arrest. Brushing off his gentlemen image, Trevor Howard gives a dastardly turn as hard man McNally, whose fists Howard slams against anyone who raises a disagreement. Crossing the globe to nab McNally,Victor Mature gives a very good performance as Sturgis, holding his nose to the grindstone Mature keeps Sturgis simmering with anger to get his revenge. Seductively performing a song number which hints at what was to come with 1958's Screaming Mimi, Anita Ekberg gives a fetching, sultry Femme Fatale twist as Broger, who Ekberg has become filled with nervousness over being caught between McNally and Interpol.","user":"morrison-dylan-fan","rank":[5,5]}]