[{"title":"An Under-appreciated Delight","rating":22,"date":"22 June 1999","review":"For many people, the fact that I love this movie will throw the integrity of everything else I write about into doubt.  \"Joe\" has unfairly become an industry joke, shorthand for the depths to which Tom Hanks sank before redeeming himself with Academy Awards.  This fate is horribly undeserved. \"Joe\" is an imaginative and gloriously life-affirming movie, a hysterically funny fantasy nearly on a par with the best of Terry Gilliam with a \"carpe diem\" moral that comes across with a lot more honesty and a lot less preachiness than some other movies I could mention.  Every Tom Hanks performance is virtually flawless and this one ranks near the top.  Meg Ryan's performances are warm and hilarious.  Usually it's men who play more than one role in a movie and then it's more often for ego's sake than art's. Ryan pulls off her multiple characters with remarkable grace.  More amazingly, it makes perfect sense for her to play three characters.  For the sake of argument, I am willing to concede that there are those who just aren't going to enjoy this movie's unique mixture of whimsy and genuine emotion.  But for me, it's a classic, easily one of my favorite movies of the decade.","user":"Mr. E-2","rank":[133,142]},{"title":"One of my all time favorites","rating":8,"date":"11 January 2005","review":"I am one of the few who saw this on the big screen TWICE when it opened. This is the movie I would take to the desert island, which miraculously has electricity a big screen and a DVD player. This is one of those rare films where every single character, no matter how minor, has a major impact on the hero and the plot. This film is also rare because the Lion's share of the funny and insightful dialogue belongs to the minor characters and not the protagonists. You have to love a movie where a luggage salesman is a major plot milestone. Ossie Davis is excellent as the wise Limo driver, Lloyd Bridges is hilarious, Tom Hanks is of course everyman, and Meg Ryan, in one of her funniest roles, is actually \"every woman\". \"You know, the first time I saw you I thought that I had seen you before.\" A witty hero is commonplace and witty cast is truly memorable.<br><br>The movie is probably too allegorical for most tastes, but this is a great tale about a character afraid of life, afraid of that next step, who finds his courage and puts his foot forward again. <br><br>All in all this is one of the best kinds of movies, Funny and Hopeful.","user":"5860backup","rank":[115,124]},{"title":"Quirky is not a dirty word...","rating":9,"date":"18 March 2001","review":"...yet this eccentric comedy never quite found its niche with the public, and I don't know why. It's beautifully produced and written, wonderfully acted and endlessly weird (how many films can you say that about?). When sad-sack Tom Hanks decides to give up his life for a few days of luxury, we understand because his existence may be a lot like ours: glum office job with lime walls, dirty floors, unpleasant co-workers, bad coffee and fluorescent lights on the fritz. When he's out to sea, floating on his luggage, he sees shapes in the sky at night that light up his face; he may be in a precarious position, stranded on the ocean, but he's the happiest and most alive he's ever been. What a wonderful moment in a movie chock-full of smart, sneaky laugh lines and throwaway bits of business that stay with one, growing beloved in the memory. Screenwriter John Patrick Shanley, also making his directorial debut, has a fine sense of pacing and a keen eye for the absurd beauty in our midst. Only in the final reel does the construction of the plot stumble, however this is due to film studio interference. ***1/2 from ****","user":"moonspinner55","rank":[68,75]}]