[{"title":"Short and sweet.","rating":10,"date":"8 July 2004","review":"All the other elephants shun Dumbo for his gigantic ears, and his mother has been locked up for protecting him, so he's all alone in the world... until Timothy Q Mouse shows up.<br><br>A beautiful piece of work. At just 60 mins, it is short and sweet. But it also contains some of Disney's best visual poetry. Dumbo's not saying a single word means his entire character is created through the physical. The entire opening sequence, till the gossipy elephants start talking, plays out without words, and its like the best silent movies. Simply beautiful.<br><br>Mrs Jumbo rearing up and destroying the big top to protect Dumbo from taunting kids is an incredible scene. Dumbo's mother spends the movie imprisoned in a carriage labelled \"mad elephant\" - and surely one of the most beautiful, heartbreaking scenes i've ever seen plays out when Dumbo and his mother have contact only by touching trunks, through the bars in the window of her cell. A beautiful sequence begins: the beautiful song \"Baby Mine\" plays as she cradles him in her trunk, and when Dumbo leaves she can't see him, and she stretches her trunk as far as she can out the window to try and reach him, and... oh, its too much!<br><br>The pink elephants sequence is as close to trippy Disney ever got - and its brilliant. One of the best, most inventive sequences in animation history. Great song, too.<br><br>Some terrific songs: Look Out for Mr Stork, Casey Junior (the train song), Pink Elephants, When I see an elephant fly and Baby Mine.<br><br>10/10. Timothy Q Mouse is a great character, the animation is so concise and perfect, great songs, the message that if you believe you can overcome your handicaps you will so inspiring and beautiful, and the movie so short and sweet it will forever retain its appeal.","user":"Ben_Cheshire","rank":[82,85]},{"title":"A perfect film","rating":10,"date":"29 December 2003","review":"A perfect film.  The design is beautiful and deceptive in its simplicity. While it may lack the overstuffed quality of `Pinocchio' or the abstract one of `Fantasia,' the style of `Dumbo' is elegant, vivid, and occasionally grotesque in ways that recall not only classic circus posters but also Paul Cadmus paintings and vintage `New Yorker' cover art.  In fact, the entire production has a hint of nostalgia about it; for all its dark story elements, the film presents a rosy-hued portrait of old America (with Casey Junior cheerfully pulling his traveling circus through green open fields) that must have seemed very comforting as audiences prepared for the unforeseeable terrors of another World War.  (A `Dumbombers for Defense' poster in the film's epilogue is the one joking reference to an increasingly unsteady world situation.)  In the midst of this cozy landscape, we find a simple, tender story about acceptance and mother love, with the characters of both Dumbo and Mrs. Jumbo finding a wonderful eloquence in their muteness.  These performances are true triumphs of animation.  The other characters, both good and bad, are painted with broad, memorable strokes. It's become fashionable to look rather harshly upon the Jim Crow sequence and all its uncomfortable associations, and it can be difficult for a modern audience to watch it without cringing slightly.  But it should be pointed out that the crows are not only the film's cleverest characters (both in terms of thought and language), they are also the only ones except Timothy to show any sympathy whatsoever to the little elephant; after all, they are outsiders themselves.  The sequence is a play on a stereotype, that can't be denied, but I would argue that it is an attempt to revise that stereotype into something positive and sympathetic.  The songs and score are flawless, and the show-stopping, nightmarish pink elephant sequence keeps things from getting too artistically conservative--and, just like the rest of the film, it still thrills us no matter how many times we have seen it.  10 out of 10.","user":"kintopf432","rank":[80,88]},{"title":"Disney's endearing classic","rating":10,"date":"23 September 2000","review":"One of Disney's best known and loved films. About a baby elephant born in the tough world of the circus who is ridiculed and shut out because of his large ears. Comforted by his mother until she attacks a trainer and is penned up in a jaillike wagon, Dumbo eventually learns that he can fly and becomes a star. A great film that deals with discrimination, self esteem, the importance of family and friendship. Features a great score which it won an oscar for and a nomination for song, the beautiful \"Baby Mine\" . The pink elephants scene is a classic. Wonderfully done, arguably Disney's best on a scale of one to ten...10","user":"goya-4","rank":[27,30]}]