[{"title":"Joan Blondell and Melvyn Douglas At Their Funniest","rating":9,"date":"5 May 2007","review":"This movie masquerades as a murder mystery, but is actually a Battle of the Sexes screwball comedy of the first water.<br><br>Bill Reardon has been pressured by his unrelenting wife, Sally, to quit his job as a detective for the District Attorney's office and open his own private detective agency. After several months, he has no clients, and is broke. He finally admits defeat and goes back to working for the DA, intending to close the office the next day, and leaving his wife to manage it. At the last minute, though, a client, Mrs. Fraser, comes into the detective agency. Desperate for income, Sally masquerades as \"Operative 7\" and convinces Mrs. Fraser to give her the case.<br><br>The rest of the movie is the rivalry between Sally and Bill, each trying to top the other at solving the same case. The inexperienced Sally's methods are extremely unorthodox, to say the least, and usually end up backfiring on her as they lead her at full tilt on a merry chase through a web of gambling, blackmail and murder. Bill's methods are more traditional, and he has all the horsepower of the local police department at his disposal, but somehow he always ends up, involuntarily and much to his chagrin, following a trail that Sally has blazed earlier.<br><br>There is a sequel to this film, \"There's That Woman Again,\" this time with Virginia Bruce in the part of Sally.<br><br>Who could imagine any more urbane, sophisticated man of the world than Melvyn Douglas in \"Ninotchka?\" Here, as Bill Reardon, he is just as handsome, but ends up coming off as somewhat of a boob, rather easily manipulated by his wife's scheming machinations, and constantly at the end of his rope over them. This shows off his talent for comedy even better than his role in \"Ninotchka\" can.<br><br>Bumbling foil or not, he does end up being the one to solve the crime in the end, though.<br><br>Mary Astor is quite watchable as Mrs. Fraser, playing a hard-edged role of the type she is so good in, chilly and mysterious, but with aspects of a vulnerable victim at the same time.<br><br>Joan Blondell somehow manages to play the screwball heroine, Sally Reardon, without any of the cloying suffocation of Ida Lupino in \"Lone Wolf Spy Hunt\" or the stark frightfulness and outright psychosis of Katharine Hepburn in \"Bringing Up Baby.\" I could never understand what any man would see in either of the latter two. I would run as far as I could, as fast as I could, in the opposite direction from both of them. But Blondell retains an allure and a lovableness throughout all her antics, in spite of her headstrong, independent, disruptive ways. It is pretty easy to understand why Bill puts up with everything he does from her, and still wants her back after each debacle.<br><br>When Joan Blondell is funny, she is really quite excellent at it. And this is the best I've seen of her, rivaling \"Topper Returns,\" or perhaps even outdoing her performance there. (Although admittedly I have only seen a fraction of the 59 movies she made in the 1930s -- an average of 6 movies a year!) She is clearly the centerpiece of this comedy, and handles it masterfully, never dropping the ball, and leading the viewer around by the nose just as easily and continuously as she does her husband.<br><br>But the real incandescence of this film is the unexpected zingers that are delivered, usually off-hand, and usually as the wrap-up of a scene. They are always unexpected, very clever, and made me laugh out loud on many more than a couple of occasions. Watch closely for them all, as they are easy to miss. They are every bit as witty as anything in any of the Thin Man or Boston Blackie movies.<br><br>A very funny movie.<br><br>(One warning: those who are sensitive to any allusion to spousal physical abuse, however playful, will not enjoy this movie.)","user":"reader4","rank":[32,37]},{"title":"The wife of a detective takes a case of her own","rating":7,"date":"5 December 2009","review":"Joan Blondell and Melvyn Douglas are Bill and Sally Reardon in \"There's Always a Woman,\" a 1938 screwball comedy. Douglas is a former detective with the D.A.'s office who has opened his own office. However, there are no clients after a few months, so he returns to the D.A. Sally, his wife, is supposed to close the office, but when a Mrs. Fraser (Mary Astor) enters, Sally passes herself as a detective and gets the case - plus a retainer. It then becomes a competition between husband and wife to see which one will solve the case, which becomes more complicated, involving murder and blackmail.<br><br>It's hard not to love Joan Blondell is just about anything, and she's excellent in this. She and Douglas make a good team, though in the sequel, it's Virginia Bruce who steps into her role.<br><br>The script is witty, and the acting is excellent from all involved. This is no \"Thin Man\" - there were a few of these husband-wife detective movies that came out after the success of \"The Thin Man\" - in fact, one try at a series featuring Joel Sloane, a rare book dealer, and his wife, Garda, starred Melvyn Douglas in 1938. None quite measured up, but often these films were entertaining. \"There's Always a Woman\" is definitely a good one.","user":"blanche-2","rank":[13,14]},{"title":"Breezy screwball comedy/mystery should delight Blondell/Douglas fans...","rating":6,"date":"3 May 2007","review":"Despite thin comedy material, JOAN BLONDELL and MELVYN DOUGLAS give their all to the interplay between the detective husband and snoopy wife routine in this fast-moving comedy/mystery. Douglas is a detective badly in need of clients when MARY ASTOR pops into his office while he's away and tells her story to Blondell about keeping tabs on an unfaithful husband.<br><br>MARY ASTOR, JEROME COWAN and ROBERT PAIGE are the chief suspects when the man is killed, but the accent throughout is on comedy rather than solution of the crime. What matters is that the comedy is breezy and stylish in the Blondell/Douglas manner with both of them at the top of their form. Revelaton of the murderer comes as no big surprise.<br><br>Trivia note: RITA HAYWORTH has a fleeting moment as a secretary, unbilled in the credits. Blink and you may miss her one line and quick exit.","user":"Doylenf","rank":[20,23]}]