[{"title":"More like a louse about the house !","rating":7,"date":"12 October 2012","review":"You may feel you have seen this film before as it contains elements of Suspicion (the glass of milk), Notorious (the poisoning scenes) and Gaslight (the Victorian melodramatics) but it has its own merits, most of all the glorious setting - a villa in Naples. Repressed spinster Agnes (Australian-born Margaret Johnston) inherits along with her sister Ellen (Dulcie Gray) a villa in Naples from their uncle. Agnes is cheerless, uptight, domineering and a snob. The sisters go to the villa with the intention of selling it as they need the money but are soon seduced by the scenery, the sunshine and for Agnes by the shirtless, Lothario Salvatore (Irish actor Kieron Moore) who worked for their uncle as his manservant/handyman. Soon Agnes is casting off her black mourning attire and restyling her hair and is smitten enough to marry him, totally blind to the fact he is a womanizer, deceiver and a possible serial killer (Did he do away with both their uncle and the American benefactor who taught him English ??) Suddenly Agnes health starts to deteriorate especially after Sal starts encouraging her to drink daily egg flips made from seagull eggs (I feel sick already!). Is he poisoning her so he can get his hands on the land that once belonged to his family ? I loved the contrast between grim Victorian England and sunny, flowery Naples which also heralded the blossoming of the two sisters. Enjoyable and atmospheric but don't be fooled by the 'introducing Kieron Moore' in the credits as this wasn't his film debut just the first under his new name change from Kieran O'Hanrahan. Seems you really can't trust anyone.","user":"kmv4","rank":[19,19]},{"title":"Things do not go as expected","rating":7,"date":"21 September 2018","review":"Surprisingly enjoyable and certainly well made little UK picture filmed partly on location near Naples to great effect. The tale begins fairly mundanely and it seems we are in for some light melodrama as two uptight English sisters possibly vie for the attention of some rich landowner. Turns out they are the landowners, the property is in Italy and a good part of this is set out in the wonderful sunshine and vistas of the bay of Naples. Things do not go as expected and although we have wonderful, almost neorealist shots of happy peasants and the grape harvest, a darker side soon begins to emerge and this ends up being akin to Suspicion and Gaslight. Perhaps not quite as dark as those two films but this certainly has its moments and the cast perform very well under tight direction and beautiful photography.","user":"christopher-underwood","rank":[8,8]},{"title":"Suspiciously like Suspicion","rating":6,"date":"27 July 2019","review":"Some of the main plot points occur in this film,however there is rather more sex and Felix Aylmer refers to the sisters as virgins.Generally a very enjoyable film with Kieran Moore excelling.","user":"malcolmgsw","rank":[7,7]}]