[{"title":"Fulci's Best Non Horror Movie","rating":28,"date":"28 August 2000","review":"A terrificly executed period piece from the Godfather of Gore, Beatrice Cenci(1969) is a masterpiece of tragic beauty.  This movie is a contradiction to the accusation of Fulci as a misogynist from his later films.  Adrienne LaRussa does a nice job in conveying the almost gentle nature of the female protagonist.  George Wilson as the father does a good job in portraying someone truly evil.  Cries of death to the director were shouted in a theatre due to the film's anti-catholic nature.<br><br>The Catholic church is presented in the film with absolute disdain.  In fact, they are seen as greedy and hypocritical.  Beatrice Cenci(1969), along with The Witchfinder General(1968) are probably the best films dealing with the late middle ages.  The direction is nearly perfect, and the story is well done.  The film revolves around a labyrinth of flashbacks in the style of Reservoir Dogs(1992).  The main source of influence seems to been The play version of The Cenci by Artoud, Antonin as well as the five act play by Percelly Shelly.<br><br>There are two films that Beatrice Cenci(1969) compares with.  One film is Don't Torture A Duckling(1972) which also deals with Catholic repression. Another film is The Devil's Honey(1986) which deals deals with a woman's urge to be an independant woman.  Beatrice Cenci(1969) is not only overlooked by Fulci supporters but by Fulci distractors as well.  This movie shows that Fulci was capable of more ambigious and personal films then the many ones that he direct in his career(Its too bad as he had the talent that would have made him one of the best directors of his generation in Italy).","user":"eibon09","rank":[36,40]},{"title":"A simple soldier shouldn't be too suspicious.","rating":7,"date":"21 March 2010","review":"Those expecting a typical horror movie will be disappointed, as the horror depicted here is the Catholic Church's use of torture in the Middle Ages, and their greed. Fulci doesn't flinch from presenting the evil that was the church in that time.<br><br>Those who do not like period pieces may find this film dull, but Fulci does a great job producing a work that is both beautiful and interesting.<br><br>Adrienne Larussa was beautiful and did a very good job as the title character. Her father, played by Georges Wilson, was an evil man who kept her locked up. Wilson does a very good job portraying someone you really want to see die.<br><br>You have to love a strong determined woman. Even in the face of torture by the church, she remained strong.<br><br>Definitely not a movie for faithful Catholics.","user":"lastliberal","rank":[11,12]},{"title":"Flesh and blood","rating":10,"date":"10 July 2008","review":"I do not go much for Fulci's horror movies which remain very inferior,IMHO, to those of his Italian colleagues (Dario Argento and Mario Bava).But this one ,by keeping the horror sequences to the minimum (the tortures scenes do not last long fortunately),is eminently commendable.<br><br>The cast includes two French actors :one of them ,Georges Wilson ,a very earnest stage thespian ,and the father of Lambert Wilson,is very unexpected here ,and his part of the violent perverse noble who rejoices cause two of his sons are dead so he won't have to feed them anymore and who imprisons his daughter in a dungeon is quite impressive .The other French actor is Raymond Pellegrin in a supporting role.Adrienne Larusso is incredibly beautiful as Beatrice Cenci and Thomas Milian gives a restrained effective performance.<br><br>The plot is not easy to catch up with ,because the director blends present and past without the traditional codes .No transition most of the time.Besides ,there are many characters ,and many of them are underwritten (Beatrice's brother for instance)<br><br>It's a film of blood and fury,the monsters are everywhere :Francesco Cenci is terrifying but so is the Holy Office whose goal is to appropriate the Cenci's fortune.<br><br>Like this?try these....<br><br>Flesh and blood (Paul Verhoeven,1985)<br><br>The devils (Ken Russel,1970)<br><br>La monaca di Monza (ERIPRANDO Visconti,1968)","user":"dbdumonteil","rank":[7,14]}]