[{"title":"Joan Bennett highlights Max Opuls' nuanced, ironic film noir","rating":9,"date":"17 December 2001","review":"The sultry temptress of Fritz Lang's Scarlet Street and The Woman in the Window, Joan Bennett dons spectacles and a harried mien as a respectable mother in a California coastal town.  Family life is proving nettlesome, what with a husband traveling the globe on business, a teenage son drawn to inappropriate states of attire, and two live-ins, a father-in-law and a cook/housekeeper.  The nettle-in-chief, however, is her handful of a daughter (Geraldine Brooks).  Like her predecessor Veda Pierce, she fancies herself a worldly woman and has taken up with a penniless but pretentious lecher, who winds up dead.  Bennett's battle to cover up the death becomes the story's meat.  Into the mix ambles James Mason, wanting $5-grand for incriminating love letters.... Mason, with an Irish lilt, is the film's most intricately shaded character (and he gets top billing) but Bennett delivers a controlled, expert performance, possibly her finest. The star of The Reckless Moment, however, is the great Max Ophuls (though the directorial credit has it \"Opuls\").  Displaying evocative chiaroscuro -- Burnett Guffey was cinematographer -- and voluptuous slow takes, Ophuls creates a rich texture ranging from shabby seaside respectability to the grungy sidewalks of nearby Los Angeles.  This splendidly nuanced work has emerged as one of the standouts of the noir cycle, its ironies so understated that their oppressive weight isn't felt until long after the film has unspooled.","user":"bmacv","rank":[53,57]},{"title":"Top notch suspense melodrama with excellent cast.","rating":10,"date":"13 July 2001","review":"'The Reckless Moment' is Max Ophuls' excellent 1949 suspense melodrama, starring James Mason as a blackmailer who falls in love with his desperate victim (Joan Bennett).<br><br>Ophuls direction is superb, with the suspense mounting in every scene as housewife Bennett, mistakenly believing her daughter has killed a man, disposes the body and tries desperately to hide the girl's involvement from the police and her family.  Then Mason appears, demanding money for incriminating love letters he has which the daughter had written to the dead man.  The plot thickens from there, with Bennett trying to shield her family from scandal as the blackmailer begins to admire and then love the devoted housewife and mother.<br><br>James Mason is always excellent in sinister roles, and his performance here is one of his best, though his character's motivation isn't quite clear. By his own admission, he's a loser who's never done a decent thing in his life, so why he suddenly develops a conscience is never fully explained.<br><br>But who wouldn't fall in love with beautiful Joan Bennett, giving the performance of her career as the desperate mother who's commonplace life is suddenly turned upside down by crime and blackmail.   Ophuls, who the year before had guided Joan Fontaine through one of her greatest performances in 'Letter From an Unknown Woman,' drew from Bennett her most natural, believable performance.  She's never been better.<br><br>Highly recommended for the outstanding direction and two great stars in peak form.","user":"haroldg-2","rank":[48,53]},{"title":"Not a wasted frame","rating":9,"date":"20 July 2007","review":"Near perfect, this is a marvellous and magical non stop emotional thriller with the camera moving with such fluidity we can only stare in wonder. As the camera swirls, so does the middle class family of Joan Bennett. She is constantly keeping the plates in the air, cheering them along chiding them at dinner or suggesting changes of clothes. When trouble strikes it is she who has to confront the big bad world and visit the boat shed, the less salubrious parts of town and confront people and issues she never has before. All seems to depend upon her and James mason's character appears forcing financial worries on top of all else. Until he falls for her and begins to relent and finally even more. Not a wasted frame.","user":"christopher-underwood","rank":[29,33]}]