[{"title":"Masterful!","rating":10,"date":"17 October 2007","review":"Varning för jönssonligan.. if anyone from the USA would ask me what Swedish movie is the best, i'd say the Jonssonleague movies. All those movies are very special and each has a great amount of comedy! The first one is my personal favorite! I saw this movie when i was 3-4 years old.. and i LOVED IT! I have never stopped watching the movies because they never really get boring. Every scene in the movie have a bunch of comedy.<br><br>The music made by Ragnar Grippe is perfect, my favorite is the main theme and the intro music.<br><br>If you haven't seen it yet,... go check it out because this movie is absolutely fantastic!","user":"vato129","rank":[12,14]},{"title":"A good Swedish movie","rating":8,"date":"16 January 2006","review":"This is a good Swedish movie - though it is based on a Danish movie. But to put it into perspective we have to go back in film-history: In 1968 Erik Balling and Henning Bahs created the Danish Classic Olsen-Banden (which Varning för Jönssonligan is loosely based on). The movie became a very big success. It became such a big success, that the Norwegians copied the movie in 1969, and claimed it as their own creation - even though they had not created it, Erik Balling and Henning Bahs had come up with the story. But as always the Norwegians nationalism kicked in and took the honour - even though you can see on this wonderful site that Erik Balling and Henning Bahs have credit for coming up with the story, which the Norwegians tend to forget. The Danish original and propably also the Norwegian copy Olsen-banden became such a success that Sweden wanted a Olsen-banden of their own. The Swedes contacted Erik Balling and Henning Bahs and they came up with some stories for the Swedes - which from they could create Jönssonligan. But unlike the Norwegian copy of the Danish creation, the Swedes made Jönssonligan more different and more Swedish - which I like. In 1981 the first Jönssonliga-movie came: Varning för Jönssonligan. And that was good, and it was very different than the Danish one - though the Danes Erik Balling and Henning Bahs came up with the story. The Swedes managed to twist the movie-mythology in their own good way.<br><br>Like it.<br><br>8/10 - Nuff Said.","user":"loleralacartelort7890","rank":[5,7]},{"title":"Superb!","rating":10,"date":"11 January 2003","review":"A cult classic in Swedish movies. This is the first movie with the criminal league called Jönssonligan named after the \"leader\" Charles-Ingvar \"Sickan\" Jönsson. I have loved these movies the day the came. It blends clever burgler tricks with comedy. The funniest actor is of course Gösta Ekman. He's great as the little bit confused and clumsy but intelligent \"Sickan\" and he comes up the plans and his colleagues helps him. This is a true classic.","user":"Nero68","rank":[4,8]}]