[{"title":"A horror movie where the story is the best part. There's a first time for everything...","rating":6,"date":"2 July 2015","review":"Silent Night, Deadly Night tells the story of a boy whose parents were killed in front of him as a child, and it was by a man dressed as Santa Claus. Not only that, the man shot the kid's dad in the head and tried to rape his mother before slitting her throat while the boy watched. He hid so he escaped, but the memory remained, even throughout Catholic school where the Mother Superior was strict and violent, saying punishment is good and all naughty children should be punished. Naturally, this messed with the kid's head, so one day when he's finally all grown up, Christmas time comes along at his job and someone has to dress up as Santa Claus. Well, who better than the kid whose parents were killed by Santa to play dress up! He then embraces being Santa Claus, a judgmental fat man who kills naughty people, and that's when the bodies start piling up.<br><br>It's a truly dark story. The movie would have been much better had they focused more on the psychological aspect as opposed to it just boiling down to \"Santa is a killer. Now I'm Santa. Now I must kill!\" It felt like the whole setup was wasted for an anticlimactic, soulless killing spree. Sure, there are some good kills, and there are plenty of boobs in typical '80s B-horror affair, but it failed to make an impact on anything more than a surface level. It's an enjoyable movie, it's simply a matter of greater potential not being realized. <br><br>Now this is a horror movie, not an unintentional comedy like its infamous sequel, and it's admittedly effective as one. It's refreshing when a horror movie has an actual narrative you can follow. Worth a watch if you're a horror buff or just want to watch Santa kill topless women for an hour and a half.","user":"lnvicta","rank":[41,46]},{"title":"Silent Night, 80's Frights!","rating":6,"date":"19 November 2014","review":"A classic to many fans of horror and independent cinema, Silent Night Deadly Night definitely wins the award for having the most gorgeous, super nice, hunk of a killer ever on screen!<br><br>I mean, if this guy came at me with an axe, I wouldn't be running...<br><br>Robert Brian Wilson, who went on to star in many US soaps, just has you hooked as the beautiful, gentle killer with his W shaped smile that has such good reason to be the way he is, you can't help feel sorry for him.<br><br>Adding to the tragedy of what he witnessed as a young boy when a guy dressed as Santa killed his parents, comes an evil nun bitch who just makes his life worse, and to be honest, would do the same to anyone!<br><br>With great 80's flair and drama, the final cherry on top is when the store he works at has him dress as Santa for the Xmas period. Even as his worst nightmare, our hero is sweet enough not to upset his boss and gives it a shot.<br><br>Unfortunately from here on in, the rest of the community is in for a jolly time as our handsome killer Santa slays his way to mother superior to take revenge on the wicked penguin that taunted him!<br><br>A classic, yes. Perfect, no. But still highly enjoyable and well worth the watch for any true horror fan...","user":"Movie-Misfit","rank":[14,15]},{"title":"This film rules!","rating":10,"date":"4 April 2005","review":"I love this film. <br><br>At the end of my copy after the freaky nun looks at the camera it pauses and a voice says \"Stay tuned for more previews\" and then the little boy says \"naughty\" - a weird interruption that adds so much class. <br><br>A fun game also to play during this film is counting the unnecessary boob shots - there are many. One of my favourites is the girl who puts her cat right outside the front door wearing nothing but tiny shorts (the girl not the cat who is wearing a fabulous fur ensemble). A must see for all cheesy horror film fans. The rest of the series don't really have much to do with Christmas and SNDN2 seems to be made up mostly with flashbacks from this, the far superior film.","user":"Pigalina","rank":[44,67]}]