[{"title":"Reading Kingsley Amis's original novel is probably a better option","rating":4,"date":"31 March 2013","review":"The opening titles (in funky 1970 font) are accompanied by the Foundations singing the title song, the hook of which sounds a lot like \"Fly Me To The Moon\" (aka \"In Other Words\"). If this film were set when Kingsley Amis, the novelist, set it, and when \"Fly Me To The Moon\" had its first success (mid-1950s) it might work better. Transposing the action to the dog-end of the swinging 60s is an awkward fit for a story about a young woman who comes from the North of England to a dull Southern town, and is determined to cling to her virginity, rings slightly false, but that's not the only problem. It's a curiously lifeless mix of sketch-comedy turns and a soapy boy-meets-girl sequences which never quite gels. Oliver Reed seems to be on automatic, Sheila Hancock is wasted, Noel Harrison is creepy, but Hayley Mills, despite being slightly too old for the central role of the girl is such a positive force, that every time she's on screen she almost saves this plod. She is a brilliant actress and an inspirational human being - at least that's the vibe I get from her performance in this pale adaptation of a very funny novel.","user":"BOUF","rank":[13,17]},{"title":"Take A Movie Like This","rating":8,"date":"13 January 2009","review":"I read someplace that the Boulting Brothers' 1957 film of 'Lucky Jim' was originally to have starred Jonathan Miller ( it eventually was made with Ian Carmichael ). How true that is I do not know. It seems highly unlikely as Miller was virtually unknown until 'Beyond The Fringe' in 1960.<br><br>In 1970 the good doctor directed this - his only movie - an adaptation of another Kingsley Amis novel - 'Take A Girl Like You'. It stars Hayley Mills as the charmingly named 'Jenny Bunn', who moves to London to work as a teacher. She takes up lodgings with the Thompsons ( John Bird and Sheila Hancock ), an argumentative middle-aged couple. Alchoholic Mr.Thompson is the local Labour candidate, and expects Jenny to canvass for him.<br><br>No sooner has she moved in than Jenny meets Patrick ( Oliver Reed ), the boyfriend of her roommate. It is lust at first sight. He does not get very far though - she is a virgin, and intends staying that way until her wedding night. Another man would have given up on the spot, but Patrick embarks on a quest to get her into bed without actually marrying her...<br><br>As the book was written in the '50's, the story had to be updated, making Jenny's decision to remain chaste seem all the more bizarre, given the different moral climate of the era.<br><br>The late George Melly wrote the screenplay. Curiously enough, three years earlier, he wrote a movie called 'Smashing Time' which also began with a comely Northern lass ( two of them, in fact ) heading down South and finding it a sinful place. 'Take' is a different kettle of fish, free of the surreal comedy of that earlier picture. Miller's direction is functional rather than flash.<br><br>Reed gives a solid performance, virtually identical in fact to the one he gave in Michael Winner's 'The System'. Like 'Tinker', Patrick regards women as existing mainly for his amusement, arguing with Jenny that her attitudes to sex are outdated. Hayley Mills is suitably sexy as 'Jenny', though her decision to succumb at the end to the lures of Patrick's upper-class friend 'Julian' is a little hard to understand, especially as he seems an even bigger chauvinist. Noel Harrison ( son of Rex ) is excellent as 'Julian', whose life consists of drunken parties. He backs Thompson only because he wants him to cancel a project to build a new airport - one that would see his country home demolished. Unluckily for him, Thompson reneges on the promise ( politicians, eh? ). Lovely Aimi MacDonald is hilarious as dippy game-show hostess 'Wendy'. For me though the stand-out performance came from John Bird as the seedy 'Dick Thompson', a Labourite with more than a passing resemblance to Harold Wilson. Future 'Liver Bird' Nerys Hughes appears briefly as a teacher.<br><br>Patrick's pursuit of Jenny takes place against a background of country pubs, posh restaurants, and trendy flats. Surprisingly, they do not go anywhere near Carnaby Street. The film is nice to look at and there are some wonderfully funny moments, but the ending unfortunately spoils it.<br><br>In 2000, the B.B.C. remade the story, putting in all the things the film lacked, such as nudity and bad language.<br><br>Not a great movie then, but worth a look. For a true classic based on a Kingsley Amis book, check out 'Only Two Can Play' ( 1962 ) starring the great Peter Sellers.","user":"ShadeGrenade","rank":[13,17]},{"title":"Thoughts about the locations","rating":8,"date":"8 January 2009","review":"Haven't seen this movie since it came out in the 1970s until I bought the DVD recently. Despite what it says on here, the only recognisable location in Slough is the railway station. All the other main location shooting is in my old home town of Staines, Middlesex. The editing is cut about so the views don't appear in sequence - in the opening Jenny's cab turns right out of Thames Street and past the Angel Hotel, she's then seen inside the cab crossing Staines bridge (which would be left from Thames Street)and then arriving at her digs in Kingston Road (right from Thames Street). Oliver Reed lives over the old car showroom (Crimbles?)and later in the film there's a splendid sequence when he is stuck at Pooley Green level crossing in Egham. St.Peter's Church appears, too, along with Matthew Arnold School (as the 'Tech') and the Kingston Road Primary School. A great movie for locals who lived around Staines in the 1960s. And to think the gorgeous Miss Mills was in our town and I never knew!","user":"christopher-leigh","rank":[18,25]}]