[{"title":"Curious but entertaining","rating":9,"date":"9 December 2001","review":"I find it interesting that people can get so many different feelings and experiences from one movie, but then; this is exactly the type of movie that would cause such disparity. The question really is, are you watching the movie for entertainment, or to critique it?  There are wondrous scenes of erotic intimacy here (unfortunately not as fully developed as they could be) - and glimpses into just what two people \"in lust\" will allow themselves to be led into...  The sensuousness of the relationship is the key - not the believability of the surroundings or the rest of the 'plot'. Is it believable?  It certainly is conceivable... Liz (Kim Basinger) studying slides at work, so distracted by her thoughts of intimacy with a man she hardly knows that she can't keep her hands off herself... John so taken with her that he will spend exorbitantly for a gift - to give a woman he doesn't know - but feels that he must meet. The passion and need for these two lonely people that lets them open doors to their inner selves and allow another in BEFORE thinking of the consequences (there are ALWAYS consequences, in film and life; for opening \"those\" doors). Is it believable that they would win the fight with the street thugs? No. Is it believable that the adrenaline rush, the release of the flight impulse and fear, the closeness found in 'defeating a common enemy'; could possibly lead to the intensity of sexual closeness and climax in a semi-secluded spot (under falling water at that)? Yes. Are the other scenes believable? It's entertainment, not a psychology class... They are conceivable, certainly. Ever been really mad at your partner, and that anger leads to words then breaking dishes then apologies then hugging then closeness then sex? How about anger leading directly to sex? It can happen, and it does. It is not so much a rape as it is a purging of desire. The scene with Liz blindfolded, and the whore coming in to the room - you share the tenseness Liz feels. Will she be stimulated? Of course. Will she let John know it turns her on? He already knows it does. He wants HER to know that he knows it will.<br><br>This movie is a glimpse of what manipulators people are. The efforts made to manipulate another person into 'making them want what you want'. So much so, that it becomes their desire, not yours. So much so that the desire is to see if you can manipulate the other becomes more consuming than the original goal. Seeing if she WILL crawl across the floor becomes more important than seeing her actually doing so. And her feeling the depth of her self in what she will do - and finding she is doing it because SHE wants to, not because he wants it. Liz takes her pleasure from John, too.  What appears to be a \"rape in progress\" as John pushes Liz back on the table, ends with her crying because she was excited enough by it to climax. That is perhaps the 'real' rape; her discovery that even if she is initially violated, in her mind she realizes it arouses her enough to let it continue; and as it continues she finds herself clutching at her 'attacker'; and attaining orgasm. The rape as much of her mind as it is her body. It is her discovery of what she learns of herself. When she finally leaves the relationship, he finds he can't live without her. Who manipulated who?<br><br>This movie, dated as it is, is still fresh because it is enough like life to be real. No, we may not be that rich or that attractive or that selfish or that spoiled. But we also may wish at times that we were...","user":"thegypsyspirate","rank":[137,149]},{"title":"A Film About the Destructiveness of Sex Obsession","rating":8,"date":"16 May 2010","review":"I think most people don't understand this movie. This is not a love story, at least not in the conventional sense. \"9 1/2 weeks\" is about sexual desire and intimate sensuality run amok and becoming the monopolizing forces in a relationship, and the ultimate demise of that relationship as a result. Certainly the physical pleasures and sensuality of sex are aspects that make a relationship fulfilling and gratifying but they are not the only facets. A relationship purely based on sexual desire is doomed to failure. At first it seems like a game, but later on the intensity is too much for the relationship to withstand, largely because if love and caring are sacrificed for the sex, it will die.<br><br>You almost couldn't find more suitable casting than Mickey Roarke and Kim Bassinger. Roarke plays John, a sexually-driven finance executive who is not satisfied with winning over the woman he wants. He craves continual heightened sexual excitement from his \"lady friend\". And he uses subtle coercion to achieve his goals. For Elizabeth, played by Bassinger, John is the ideal lover. He makes her breakfast, buys her clothes, brushes her hair. He takes care of her in an interesting role reversal. But nothing is free. In return, John wants Elizabeth to be in his complete control and engage in sensuous sex games. And each game is more intense than the last.<br><br>At first the games seem innocent enough. He likes to blindfold her and play a touchy-feely game in which he introduces objects that she feels and/or tastes. But then the requests become more intense. He wants her to enact a strip-tease, to dress in a certain way without her consent, and to receive a spanking for being a \"nosey parker\". They have sex in the oddest of places, sometimes engaging in intimate contact in public. At first Elizabeth enjoys the attention and the excitement until she begins to lose the sense of herself as the relationship intensifies. And John eventually goes too far. <br><br>At one poignant moment in the film, Elizabeth speaks with an artist-recluse. Because her job is at an art gallery, she helps coordinate artists for exhibitions. When she finds him in a rural area, she asks him if he remembered that his exhibition is coming up. He replies that when he is hungry he remembers to eat and when he is tired he remembers to sleep. She has lost the simpler pleasures of life, and this old man reminds her of that. <br><br>Late in the film there is an interesting scene where Elizabeth's former boyfriend comes to the place she works--not to see her but he is now dating one of her co-workers. He's a plain man who does not have nearly the sexual allure of Roarke. But he seems kind and honest. Liz watches her co-worker and her former boyfriend leave and there is an expression on her face that speaks volumes: maybe she misjudged him after-all. For a moment, the two stare at each other from a distance, and you get the feeling that she was the one who left him. He is not the Mr Exciting that John is, but maybe he has other qualities that John could never have.<br><br>This is quite a stunning film, certainly not for all tastes, and some of the steamy sex scenes could be misinterpreted as being only for pornographic sake. What saves it are the incredible and absolutely believable performances by the two leads, Roarke and Bassinger which strangely complement one another. Roarke plays his character right on the money, always enigmatic, never raising his voice, but always mysterious. His character is always just outside of reach. He constantly smiles, even when he is noticeable disappointed. Basinger is a perfect complement as one of the few actresses left who can be vulnerable and elicit a willingness to be under control that you don't see in many female performances anymore. Despite what may appear to be pornography, there is a point to the film I think, and that is that constant sexual control and nurturing relationships mix like oil and water. In the end you wonder if it was all a game.","user":"classicalsteve","rank":[30,31]},{"title":"* * *1/2 out of 4.","rating":4,"date":"4 September 2002","review":"Two successful, but lonely yuppies embark on a sexual odessey for 9 and a 1/2 weeks. All people seem to talk about when it comes to this movie is about the sex scenes and the nudity in the film. This film is not about sex and nudity in my opinion. It is about control and power. I found this film to be intelligent and stylishly done and yes very erotic. Rourke and Basinger make a steamy couple and the ending and the events that unfolded in the film lingered with me long afterwards and left me thinking for a while. This is one film that actually seems to have gotten better with time.","user":"brandonsites1981","rank":[91,106]}]