[{"title":"A Comedy and a Nostalgia Trip","rating":8,"date":"3 April 2000","review":"I saw this film when it first came out; it got very bad reviews at the time and most of my friends hated it, but I loved it then and have been haunted by the theme song ever since.  For a while it was impossible to find any references to it--in fact, this is the first database where I have found the title or any information about it, though I have checked a number of commercial sites trying to find it on video.  I still remember it as a charming (somewhat sentimental) and very funny comedy of a type that the British film industry did very well at that time.  More recently their best work is more in a surreal or caricatural mode (such as _Cold Comfort Farm_, which is brilliant in its own way), but _The Full Monty_ caught some of the charm of the kind of comedies of everyday life that I think _Sparrows Can't Sing_ was one of.  Now I just wish I could see it again.","user":"tfdill","rank":[37,42]},{"title":"This is a Mockney - Free zone.....,the real life of Eastenders.","rating":8,"date":"30 April 2006","review":"Having loaned out their club to the company those naughty boys from Vallance Road did poke their noses around the sets whilst \"Sparrers can't Sing\" was in production but,like the celebrity gangsters of the 21st century,all they wanted was to be famous.A few quid changed hands and they ambled off,satisfied with the \"respect\" that had been shown.This was the old East End,a far cry from the emasculated P.C. neverland presented to us by the BBC's flagship soap.Not too many Mockneys in the cast either,young Londoners,bursting with energy and talent filled many of the major roles.Miss Barbara Windsor is outstanding as the female lead.What a tragedy it is that she has turned into a caricature of a caricature in the ensuing 43 years,for in SCS she was sharp,sexy and funny.She also sang the title song in a very pleasing voice,indeed she is still singing today,I recently heard some songs she recorded with Terry Seabrook on piano and very good they are too. Theatre Workshop veteran Miss Joan Littlewood was the brains behind SCS. Based at the Theatre Royal in nearby Stratford she believed in making drama accessible to people other than those who frequented West End plays. She had a spectacular success with \"Fings ain't wot they used to be\" and hoped to follow it up with SCS but failed to take into account the fact that the success of \"Fings\" was largely due to a clever and tuneful Lionel Bart score.The book,written by ex-crim Mr Frank Norman,has its wry moments,but Mr Bart's contribution was the greater. As more or less a straight play SCS could not compare to its predecessor.It was written by Mr Stephen Lewis,later to create the great \"Blakey\" in \"On the Buses\",who appears in a small part in the film. It is set on the shiny new estates where high rise mixed with prefab on the site of the old slums,long before the discovery of \"concrete cancer\" and \"tower block ennui\".It is sad to reflect that the Londoners' optimism with their brave new world was not destined to last. On it's release SCS was not seen as anything special and for some reason it rarely turns up on TV so it is not widely known except to moviegoers of a certain age.Made less than 20 years after the second world war it features a community rather than a \"community\".If the distinction either annoys or escapes you perhaps you had better give it a miss for these Eastenders live a very different life to the armchair cockneys of Albert Square.Miss Littlewood is not presenting the East End as she believed it should be,she is presenting it as it actually was.The occupants of her East end might not get New Labour's seal of approval, but they represent humanity with all its marvellous faults and virtues, not some milquetoast trawl through the pages of \"Spotlight\".","user":"ianlouisiana","rank":[27,31]},{"title":"non stop believable banter and jesting","rating":10,"date":"9 July 2009","review":"Derived from her own Stratford East stage show, this Joan Littlewood film apparently did no better than its non celluloid counterpart. Now it appears fresh, confident and so evocative but I have never seen it before and like many, I suppose, wouldn't have been the slightest bit interested at age 16 in 1963 with the Beatles and all that was to follow. Seen now, however, with all that location shooting and streets that are gone depicted so well. And what irony! The fabulous extended opening shows our hero/villain returning from sea to find his wife and cannot even find his house. Bulldozed slums, replaced by brand new 18 storey blocks of flats and even they bulldozed in turn in 2000. Back to the film and it is non stop believable banter and jesting. The film does not let up once and only in the final splendid sequence in the pub do we see a trace of the theatrical origins. For anyone who has ever visited or lived in London, absolutely essential. For every one else, well worth seeing to get just a glimpse of the old East End and just an inkling of what it really was once like when everybody seemed to know almost everyone else.","user":"christopher-underwood","rank":[27,32]}]