[{"title":"Political and provocative Bulldog Drummond film","rating":7,"date":"14 April 2008","review":"This was the sixth Bulldog Drummond film, the only one starring Ralph Richardson as Drummond, and the only one produced (1934) by British International Pictures of Elstree. It followed a few months after the release of 'Bulldog Drummond Strikes Back' starring Ronald Colman (a later film of that title was released in 1947 starring Ron Randell as Drummond). This is an extraordinarily interesting and distinctly different Bulldog Drummond film from the usual. In this film, Drummond is surrounded by his band of ex-soldiers whom he had commanded in the First World War, as in the Sapper novels. They form a group of vigilantes defending England against scoundrels, wear blackshirt uniforms, and call themselves The Black Clan. There seems to be a strong Oswald Mosley influence to this film. The Black Clan want to expose the machinations of greedy and unscrupulous arms manufacturers, who are trying to force Britain to re-arm. The film opens with an International Peace Conference, where the main speaker is afterwards murdered by the arms manufacturers. Those who wish Britain to re-arm are portrayed as murderous thugs who kill everyone who gets in their way. The Black Clan and Drummond kill several of them in fights. This is a very gritty story, and there is no light touch or comedy in it at all. Richardson plays Drummond as a serious and determined fighter for what he thinks of as justice, outside the law. The political assumptions of this film are unacceptable now, but in 1934 there must have been a big audience for these sentiments. Drummond in this film has been retired from investigating crimes for three years and is peacably married to Ann Todd, 25 years old and in one of her earliest films. After the Drummonds are drawn back into the world of intrigue by chance, she does very well at leaping out of a window, being scared without being utterly hysterical when she is about to be forcibly drowned in bathtub, and being a Drummondesque wife in general, though she has few scenes. The oily villain Carl Peterson is played by Francis L. Sullivan (who died at only 53) and his wife the villainess is played by Joyce Kennedy (who died in the War aged only 45); clearly in their case, crime did not pay. They are rather terrifyingly convincing in the film. This film might also be called The Return of Claude Allister, as he returns as Algy Longworth with his monocle, having skipped the second Ronald Colman Drummond film. In this film, Allister is not uselessly effete but is an active member of The Black Clan who straightens his monocle during a punchup with nonchalance. Walter Summers wrote and directed this film, his only Drummond film, and did very well at it, with the exception of his political message of disarmament, of course. Perhaps his retirement from films in 1940 had something to do with this. Richardson was as far from the jolly, jesting extroverts Ronald Colman and John Howard as can be imagined. He plays Drummond as someone who keeps his own counsel, pretends to be asleep in an armchair while eavesdropping, and cannily underplays even the most dramatic scenes. When he becomes upset at his wife being kidnapped by the villains, his anxiety is so under-played that running his fingers anxiously through his hair and looking distraught is as far as good manners will permit him to display his fears. He is the 'resolute, determined, steady-gaze' type who says little, pulls out his pistol, and gets on with the business of saving, - well, what is it he is saving exactly? He is 'saving' Appeasement. No wonder this film has never been commercially released. It is fascinating for Drummondonians (few of whom have seen it, of course) and is a good suspense film, but is so politically provocative in retrospect, that it appears to have been swept under the carpet because no one knows what to say about the fact that Drummond was no true British Bulldog here in the mode of Churchill, but was instead a Chamberlain. All his bravery and resourcefulness in this film are seen to have been in a cause which we now know threatened everything the character was supposed to believe in. This film thus falls into the '0ops!' category.","user":"robert-temple-1","rank":[13,18]},{"title":"Anti-War Propaganda...","rating":6,"date":"9 June 2018","review":"The most interesting thing about this movie is the eccentric turn of Ralph Richardson as Bulldog Drummond and Francis L. Sullivan as His nemesis Carl Peterson. Plus an early look at the young Ann Todd as Phyllis Drummond. The film reflects some of the crudity of British Film production outside of the films of Alexander Korda. Exhibiting the same level of competence as the 'Poverty Row' studios in Hollywood, like Mascot, Monogram or P.R.C, etc.<br><br>Drummond leads a group of armed x-officers (The Black Clan) on a crusade against what is a perceived a threat to World peace led by Mr. Peterson. It was a popular theory that the GREAT WAR (WWI) was caused or manipulated into by Arms Cartels. Peterson's character being based on Basil Zaharoff. A international arms dealer affiliated with VICKERS with a more then suspect past of corruption, shady dealings, possible murder and sabotage too obtain His ends. Make a lot of money at other People's expense.<br><br>Well our Hero's accomplish there goals and Peterson meets his deserved end. Is peace brought to the World, well no. Imperial Japan would initiated the fun with the start of the 2nd Sino-Japanese war in 1937. Nazi Germany and Soviet Russia would use the Spanish-Civil War as a testing ground and Italy would trash Ethiopia, wanting too create a new Roman Empire. Then in 1939 things really got going with a BANG, enter WWII! A reality far beyond what was imagined by THE RETURN OF BULLDOG DRUMMOND.","user":"xerses13","rank":[2,2]},{"title":"Politically non-conformist B adventure flick.","rating":9,"date":"2 January 2014","review":"Wonder why all of the other Drummond films are easily available and this one is scarce. No I don't. This one actually displays the political left in a SOMEWHAT unfavorable light (now think of it: would anyone complain if Nazis were displayed unfavorably - of course not - but the extreme left has murdered millions more and should be subject to the same level of scorn). Anyway the film is a take on Sapper's The Black Gang and actually is otherwise a typical Drummond entry. Think of it as the James Bond of its day. Richardson not the best Drummond but none were (are). Technically the bad guy is not a leftist and the movie lets the true hard leftists get away with just being dupes.<br><br>Enjoyable for its non-conformist politics. Entertaining B movie.","user":"dnrivers","rank":[9,16]}]