[{"title":"Underrated Hammer Gem","rating":8,"date":"18 April 2008","review":"I am an enthusiastic fan of the Hammer Studios, and my admiration for this brilliant Production Company gets greater with each film I see. The Hammer Studios are most famous for their films made in the late 50s and 60s, most prominently for the (awesome) \"Dracula\" and \"Frankenstein\" series. As far as I am considered, however, some of Hammer's films from the early 70s are just as brilliant as their older successes. One of their greatest and my personal favorite of their films, the brilliant \"Vampire Circus\" was made in 1972, for example, and the early 70s also brought a variety of other classics, such as \"Dr Jekyll &amp; Sister Hyde\" or \"Scars Of Dracula\", which is easily the nastiest entry to Hammer's Dracula series. \"Hands Of The Ripper\" of 1971 is yet another great Hammer production that is immensely atmospheric, genuinely creepy, well-acted and stunningly suspenseful, and an absolute must-see for every Horror-fan.<br><br>As a toddler, little Anna has to witness the murder of her mother by her own father - none other than the notorious serial killer Jack the Ripper himself. At the age of seventeen, Anna (Angharad Rees) lives at the house of an elderly lady, a phony medium who is perfectly willing to leave her 'granddaughter' to rich 'gentlemen' for money. After this 'grandmother' is brutally murdered, the rich doctor John Pritchard (Eric Porter), a humanist and follower of Siegmund Freud, decides to take custody of poor Anna, both out of sympathy and for research reasons...<br><br>\"Hands Of The Ripper\" is a vastly underrated Hammer gem that is ingenious in many aspects. The film is immensely creepy and scary, with a suspense level that is higher than in most Hammer flicks, and the murders are brutal and very bloody. The atmosphere is eerie and tense and, as usual for Hammer, the film is shot in great Gothic locations. The performances are great. Eric Porter delivers an excellent performance as Dr. Pritchard, and Angharad Rees deserves special praise for her outstanding performance in the role of Anna. All said, this is a shamefully underrated film. Creepy, stylish, excellently acted and stunningly suspenseful from the beginning to the end \"Hands Of The Ripper\" is a great gem from Hammer that no lover of Horror can afford to miss!","user":"Witchfinder-General-666","rank":[23,26]},{"title":"Interesting period Hammer production.","rating":7,"date":"25 February 2004","review":"Orphaned teenager Anna (innocent-looking Angharad Rees) is placed under the care of the awful Mrs. Golding (Dora Bryan), a fake medium who uses her in moneymaking schemes and pimps her out to customers, which leads to her murder. Anna is adopted by Dr. John Pritchard (Eric Porter), an early follower of Freudian philosophy, who tries to help Anna when it's revealed she's the daughter of Jack the Ripper with homicidal tendencies of her own after seeing dear old dad murder mum as a child. Dr. Pritchard is so obsessed with Anna and his research that he isn't above covering up the murders that follow.<br><br>The performances are first-rate, the turn-of-the-century London flavor is accurately captured, the murders are pretty bloody for the time and there's a great, subdued ending at the \"Gallery of Whispers.\" Fine period horror from Hammer Studios, originally shown on a double bill with TWINS OF EVIL.<br><br>Score: 7 out of 10","user":"capkronos","rank":[21,24]},{"title":"One of the most interesting Hammer movies.","rating":9,"date":"9 November 2002","review":"'Hands Of The Ripper' is one of the most interesting Hammer movies. An odd mixture of Edwardian costume drama, pop psychology and proto-slasher gore, which may not be 100% successful, but it does make for some fascinating viewing. Eric Porter (who some may remember from the 60s TV series 'The Forsyte Saga') is perfectly cast as the detached and driven Dr John Pritchard who unexpectedly encounters Jack The Ripper's daughter Anna (the lovely Angharad Rees). She has no idea of her background and is working for a fraudulent medium that Pritchard and his son visit. After Anna is implicated in a brutal and bloody murder he \"adopts\" her, and hopes to unlock her secrets using the new fangled theories of one Sigmund Freud. Can he help this confused and potentially lethal young woman before she kills again? I leave it up to you to find out. While I don't rate this one quite as highly as many, I thoroughly enjoyed it, and it is yet another example of just how most of Hammer's output has been largely underrated over the years.","user":"Infofreak","rank":[20,23]}]