[{"title":"Whispering, Loudly","rating":10,"date":"7 April 2007","review":"A riveting transposition from page to screen. The accomplices are two giants in both fields. Nabokov adapts his own infamous novel for the screen and Kubrick, no less, translates it into images in a way that makes it unique, unforgettable and transcendental without ever putting himself in front of the camera. A Kubrick film can't be recognized by its style. Kubrick never made two films alike but there is something that, unquestionable, makes them stand out. In \"Lolita\"'s case the mere idea of touching the controversial novel with its taboo subject at its very core seem like a provocation from the word go. Pornography for the thinking man in which the only explicit act is the intention written in the character's eyes. Nothing is excessive and nothing is pulled back. James Mason - villain or victim - is monumental, mo-nu-men-tal! The unspeakable truth never leaves his brow. He is the most civilized man trapped in the lowest echelon of his own psyche. So aware, that it is painful to watch. Shelley Winters goes for it, taking her Mrs Hayes for all its worth and dives into the void of a desperate housewife, craving for sex. It is one of the most entertaining, shattering human spectacles, I've ever seen. But unlike Mason, she's not aware of it. There is a horrible innocence attached to her sickness. Peter Sellers's character from hell, the torturer comes in three riveting characterizations and Sue Lyon's temptress, the child, is the devil incarnate in a performance that defies description. None of them were nominated for Oscars and the film was condemned by every moral group in America and beyond. As film experiences go, this is one of the most provocative, enthralling, disgusting, entertaining and satisfying I've ever been through. Yep, I really mean that.","user":"littlemartinarocena","rank":[204,247]},{"title":"A Masterwork of Translation","rating":8,"date":"8 March 1999","review":"A significant part of Stanley Kubrick's genius was his ability to translate a literary style into a visual one.  It is demonstrated nowhere more brilliantly than in LOLITA and A CLOCKWORK ORANGE.<br><br>LOLITA is perhaps the more stunning accomplishment, in that Nabokov's style is complex and multi-layered.  Yet Kubrick captures the effect of it in camera angles and movements, in timing and point of view.<br><br>The broadest layer of Nabokov's novel, the parable of the aging culture of Europe trying to revivify itself by debauching the seductive young culture of America, is really missing in the film.  But everything else is there, despite the fact that the film departs from the exact events of the novel.<br><br>Not to say that the film depends on the novel.  It stands by itself quite easily.  But it succeeds brilliantly in conveying the ideas and feelings that are the core of the novel, and it does so in completely cinematic terms.  If films are to be based on works of literature, this is the way to do it, and the way it is almost never done.","user":"metaphor-2","rank":[102,138]},{"title":"Lolita 55 years later","rating":10,"date":"4 December 2017","review":"I sat to watch Lolita for the third time. The first time I was too young to truly understand what I was seeing. Then I read the book a few years later and saw the film again. That time it left a mark. I detested James Mason's Humbert Humbert to such a degree that stopped me from accepting him in other roles other than utter villains. To see it now after two decades is a whole other story - All of a sudden James Mason's Humbert Humbert has become human, very human. Corrupt and haunted by the awareness of his own weakness. What a performance. Shelley Winters is superb, unafraid and bold bringing to life an embarrassing human spectacle. What a performance. Peter Sellers is chilling in all of his Quilty incarnations. Sue Lyon is sublime as the innocent torturer. Stanley Kubrick never made 2 films alike but I'm starting to suspect that as literary adaptations go, this is his finest.","user":"damian-fuller","rank":[65,87]}]