[{"title":"Silly, campy, amazing stunts, just bizarre","rating":2,"date":"2 August 2000","review":"This film would sit comfortably next to A Funny Thing Happened on the way to the Forum, The Great Train Robbery, every other Jackie Chan/Sammo flick, and then some.  It's not as funny as it could be (the dubbed version, that is), but aside from that I have no complaints.<br><br>There is no time to develop character traits (aside from a few cliches), but this is a slapstick so that shouldn't really be expected.  If you are familiar with the slapstick-martial arts genre, or if you simply love bizarre, zany movies, then I recommend it.  If you're looking for a substantial plot with lots of characterization, find something else to curl up on the couch to.<br><br>It is exactly what it proclaims to be, a madcap Kung Fu western.  But I doubt if you'll ever see a man jump without safety mats from a 4-story building (on fire, I might add) in any other film.  Wow.","user":"dubnut","rank":[10,10]},{"title":"Crazy Brilliant!","rating":10,"date":"30 December 2002","review":"It's a crazy movie, but awesome all the same. It's an incredibly visual story. The first time I saw it was a Cantonese version with no subtitles, but I still followed the whole story. The humour is also very visual and very funny! However, the stand out moment, ignoring the awesome battles running through the film, has to be Yuen Biao's flip from the top of a burning building. If you watch this film for no other reason, you have to see one of the greatest stunts ever committed to celluloid. Simple yet MAD! For fight fans there's the added bonus of seeing some of the all time greats of Far East Cinema battle it out on screen! SEE THIS MOVIE NOW!","user":"JinxsterJones","rank":[13,14]},{"title":"One of the funnies films!","rating":10,"date":"23 March 2008","review":"The \"Wealthy train\" aka \"Millionaire's express\" looks like an action film. But strangely each and every moment that in a normal action film would have been dramatic here turns into a farce. It has all necessary elements of a classical western, only things happen in China. The fighting stuff is really well done, only instead of tension it brings another occasion to smile. It is extremely rich in characters and situations. One could say overcharged. But most of these situations are illogical: I mean, if it were true, it would never happen, at least it would not happen this way... But it doesn't matter. Do not look for any logical explanations, the film is not about that. In fact it is a parody. And a good one. People who created this film gave a free course to imagination, and the audience is invited to do the same thing. It's like a game: recognize all moments which usually are presented so seriously in many action films (and are supposed to thrill us!) and see how ridiculous they often are. \"Wealthy train\" is one of those films that never becomes outdated. It will be appreciated by everyone who is able not to take himself too seriously. Watch it when you want to relax, cheer yourself up and just have fun!","user":"editajan","rank":[7,7]}]