[{"title":"Oranges and lemons...","rating":6,"date":"1 June 2008","review":"Owing little to either James Whale's 1932 chiller, or to J.B. Priestly's original source novel, \"Benighted\", THE OLD DARK HOUSE is a small, off-beat and pleasantly daffy scare-comedy, a change-of-pace for director William Castle. Filmed and set in England, Tom Poston stars as a hapless American who, on a visit to a curious roommate's even curiouser family home, is caught up in a murderous merry-go-round of mayhem, nursery rhymes, love and (very possibly) the end of the world (including an Ark!). British stalwarts Robert Morley, Joyce Grenfell, Mervyn Johns, and Peter Bull have a charming good time playing the various members of the Femm family, along with Janette Scott and an unforgettably slinky Fenella Fielding as romantic interests. None of the usual Castle gimmicks for this release--just a bit of eccentricity and a pleasant, creepy, multi-murder mystery, with a puzzle to solve, a couple of surprises, and some good solid chuckles.<br><br>A note to fans of Charles Addams--the film's poster and its main titles contain some choice Addams artwork.<br><br>An additional note: the film was shot in color, but released in a very faintly tinted black-and-white version. The color version of the film was only seen on subsequent television release.<br><br>This movie really does deserve a DVD release, not only for its place in the William Castle canon, but for the performances and the fun.","user":"Jweybrew","rank":[30,32]},{"title":"The Old Dark House ready for return to television?","rating":9,"date":"17 August 2005","review":"The Old Dark House does not provide the gore and R-rated material seen in today's horror movies but it does reflect a more simple time when comedy and horror could be matched while maintaining a family rating.<br><br>As a child I saw The Old Dark House over one hundred times, I remember being on the edge of my chair during the entire movie every single sitting.If only the local television stations would be able to air this movie, a new generation of viewers could enjoy, The Old Dark House. <br><br>The film may be the last of the \"old age\" comedies that were popular during that time. Tom Poston does a good job of not only showing fear but does so in comedy style to allow us, the viewers, to use our imagination. <br><br>While The Old Dark House may not live up to today's standards, it was a \"movie of the day\" in 1963.","user":"cutshall0","rank":[35,43]},{"title":"Not exactly good, but worth seeing...","rating":7,"date":"8 October 2005","review":"Hadn't expected the rigmarole I'd have to go through to snag this film on video, several years ago. I'd seen this two or three times as a child and reveled in the dark comedy of it. The plot is silly, but it's not nearly as important as the production itself.<br><br>The charming performances by the many delightful character actors are the highlights of \"The Old Dark House\" -- Robert Morely, Joyce Grenfell, Peter Bull. Who would ever think that Tom Poston would appear as the romantic (?!) hero of a movie, but there he is. And Oo, that Fenella Fielding! What a dish! <br><br>This film isn't for everyone, but I'll never forget it, and neither will you!","user":"silvrdal","rank":[15,18]}]