[{"title":"Goofy science fiction movie, but that is what they were trying to make.","rating":7,"date":"12 January 2004","review":"This movie clearly has a small budget, looks cheap, and isn't very serious. Fortunately, that is exactly what the film makers were going for.  I enjoy this one, though it is apparent by its score that most people don't.  I just find it funny and I love the cast which includes Ron Pearlman and even Angelica Houston.  Heck, John Carradine even has a small role in it, though his scene is absolutely pointless and adds nothing to the flick.  In fact it is a rather serious scene especially considering the rest of the movie. This one doesn't look great, kind of like Space Mutiny, but unlike Space Mutiny this one isn't trying to be serious so the effects can be forgiven. This one has a band of space pirates that go after, you guessed it, ice. They do this at the beginning and get immediately captured and this sets up the rest of the movie.  No work of art, but it is entertaining to me.","user":"Aaron1375","rank":[35,40]},{"title":"This movie is a hoot!","rating":8,"date":"2 March 2008","review":"This movie is generally underrated, which may be because people expected it to be something it's not. It's a comedy, a spoof, and an excellent one. It is not a serious sci-fi action adventure.<br><br>Who knew Robert Urich could be this funny? The scene where the captured ice pirates are being prepared for slave duty alone is worth the price of admission!<br><br>Then there's the robot that was purchased for an inexplicably good price. That particular scene is so dark that it may be necessary to play it back a couple of times to see what's going on.<br><br>You find a beautiful woman in suspended animation. What would you do?<br><br>The biggest shortcoming of this film is the ending, where there's a rather silly chase through a wormhole or some such. It doesn't really work, and since it's right at the end of the film may help explain why so many review the film so poorly.","user":"palmk","rank":[24,28]},{"title":"If you liked Mars Attacks! and Buckaroo Banzai ....","rating":9,"date":"31 December 2004","review":"This is the movie that killed Mary Crosby's career and nearly derailed Robert Urich's, Angelica Houston's and Ron Perlman's. It's one of those movies - like 1941 and Paint Your Wagon - that everyone knows is a total turkey, except for those who place what they see on the screen above what they read in the reviews. If you liked Mars Attacks! and Buckaroo Banzai, and laughed your ass off at Spaced Invaders and Killer Clowns from Outer Space, you'll love Ice Pirates.<br><br>The time is the distant future, where by far the most precious commodity in the galaxy is water. The idea that there were once ten planets whose surface was principally covered by water is considered a myth by most people, as is the story that the last surviving water planet was somehow removed to the unreachable center of the galaxy at the end of the galactic trade wars. The galaxy is ruled by your basic evil emperor (John Carradine) presiding over a trade oligarchy that controls all mining and sale of ice from asteroids and comets.<br><br>Robert Urich is Jason, leader of a band of ice pirates that includes Ron Perlman, John Matuzak and Michael D Roberts. Of course, the crew also prominently features the obligatory unbeatable master swordsman and latter-day samurai, but, in a blow for equality, the part is played to perfection by Angelica Houston. In the formulaic plot for outlaw space operas, our heroes attack an ice freighter, are captured, but escape with a princess (Mary Crosby) kidnapped by the evil emperor in tow. They rescue her, thread the perilous path to the center of the universe and the fabled tenth planet, and destroy the evil empire's stranglehold on the people.<br><br>Along the way, you are treated to some of film's oddest aliens, god-awful puns and excellent lampoons of space opera icons. It's full of bona fide toilet humor, from the pirates breaking through the hull of the ice freighter into a lavatory whose commode is occupied by a chickenman, to the standard reconditioning for outlaws and other deviants - castration by mechanical chompers, a lobotomy and a blond dye job, then sale as a soprano domestic slave.<br><br>Ice Pirates is the illegitimate child of Star Wars and Animal House. The jokes, both verbal and physical, range from the hackneyed to the truly brilliant - and most of both will have you rolling on the floor. It's a an hour-and-a-half of pure unadulterated fun. When I finally get the 6' x 8' screen for our light projector mounted, this will be one of the first movies we watch.","user":"clarkpark","rank":[50,64]}]