[{"title":"Plain hilarious","rating":2,"date":"2 April 2004","review":"One of the funniest movies ever made.  I remember watching it on video in the early '80s and expected something really bad (from the cover on the video cassette).  There was a movie released around the same time called GAS, which was awful, awful, awful.  I saw Used Cars after GAS and expected the worst.  And Used Cars is STILL as funny as ever.  Perhaps even funnier now (and interesting to note that Kurt Russell really displays great comic timing in this, and it is director Robert Zemeckis' only R-rated film). Zemeckis was one naughty school boy with this film, and those expecting something along the order of Forrest Gump, Back to the Future or Castaway will be in for a surprise! If you're a fan, get the DVD - the commentary with Russell and Zemeckis and screenwriter Bob Gale is priceless.  I think they were drinking a little when they did the commentary.  It is one of the most entertaining commentaries I have heard.<br><br>A classic in bad taste, in the best Mel Brooks and Farrelly Brothers fashion--and 50 bucks never killed anyone!","user":"Katz5","rank":[37,38]},{"title":"Hilarious Comedy With Some Once-in-a-Lifetime Scenes","rating":16,"date":"16 November 2004","review":"You've read the reviews and summations on other posts, but when you watch this gem, be sure to pay close attention to the scene where Rudy and the other 'salesmen' are ready to start selling on the morning after their football break-in commercial. The way Rudy goes from being \"Rudy O'hara\" to \"Rudy Garcia\" to \"Rudy Washington Carver\" is sheer script genius. And when Jeff uses his shotgun to blast away high prices, ending by saying \"We blew the s---out of that overpriced m-----F-----just like we blow the s---out of all high prices\", if you're not laughing you must be deaf and blind. There are many other great scenes too. I rate this film 9 out of 10 (only because of the slight letdown in the last 20 minutes).","user":"grandmast-1","rank":[20,20]},{"title":"you get a lot of millage out of this baby","rating":8,"date":"24 August 2005","review":"Kurt Russell is Rudy Russo a slimy, dishonest used car salesman working for Luke Fuchs (Jack Warden) who yearns to be in Congress, where the real payola is. When Luke dies from one of the schemes of his evil brother, Roy (Jack Warden again pulling double duty, who owns his own used car lot across the street) to get Luke's car lot, as his is going to be bulldozed to make room for a new offramp. It's up to Rudy to hide Luke's death from both Roy and Luke's daughter, Barbara (Deborah Harmon), whom Rudy is falling for despite himself. This movie is one of Robert Zemeckis's best films (right up there with the first \"Back to the Future\"), but whereas that's more or less a kid's fantasy, however great it might be. This is a true blue adult comedy that wears it's R rating on it's sleeve. And is all the more hilarious for it. Filled with a great many quotable lines, memorable scenes, and wonderfully zany characters, it's no wonder that I love it so much.<br><br>My Grade: B+ <br><br>DVD Extras: Commentary by Robert Zemeckis, Kurt Russell, and Bob Gale; Outtakes; TV spot; 8 Radio spots; Advertising Gallery; filmagraphies; and Trailers for \"So I Married an Axe Murderer\", \"Multiplicity\" and \"Groundhog Day\" <br><br>Eye Candy: Deborah Harmon and Cheryl Rixon each get topless","user":"movieman_kev","rank":[30,31]}]