[{"title":"The scarves of Isadora","rating":7,"date":"9 August 2008","review":"The bigger than life Isadora Duncan, a dancing legend, is the focus of this film. \"Isadora\", which came out in 1968, came and went without much fanfare. The opportunity to watch it again came when it was shown on a cable network recently. The main attraction is Vanessa Redgrave's take in the subject matter.<br><br>The biopic, directed by Karel Reisz, follows aspects of Ms. Duncan's life. One thing comes across: she was a woman ahead of her time! Her disregard for classical dance made her famous, although as shown in the film, one wonders what liberties the filmmakers took in Ms. Redgrave's renditions of works created by the famous artist.<br><br>Another thing that is clearly evident in the movie is the unhappy life of Isadora. She had no luck with anyone of her lovers. The most famous one was Paris Singer, the son of an American millionaire which ended tragically as their son and her daughter with another man drowned, something that weighed heavily on this tormented woman.<br><br>Vanessa Redgrave at the height of her beauty was magnificent in her interpretation of the troubled Isadora. Jason Robards is seen as Paris Singer, the American heir that fell in love with the dancer, but didn't seem to have much in common with her.","user":"jotix100","rank":[13,13]},{"title":"Isadora Dancin'","rating":6,"date":"6 March 2005","review":"ISADORA is one of those exquisitely produced big studio films of the late 60s that had a major release for 3 months and then vanished off the face of the earth forever. Some other titles this seemed to have happen to are; YOUNG WINSTON, NICHOLAS AND ALEXANDRA, MONTECARLO OR BUST (the other \"Great Race\" movie), STAR!, MAROONED, FINIANS RAINBOW, ON A CLEAR DAY, DARLING LILI....all presented in 70mm as souvenir ticket presentations in luxury cinemas of the time and then.....rarely revived or screened but also never forgotten, because so many people apparently saw them and remember them from this one major release. ISADORA may have been more financially successful than some mentioned above and it did have a huge impact on the beautiful Art Nouveau decor revival of the 60s (Art Deco ate the 70s..or vice versa). The look for the film was a sensation and the impact on teenage girls and their mothers was undeniable, all having a huge impact on free form ballet classes (nymphs and Grecian urns and veils) so hilariously satirized in THE BOYFRIEND in 1972. Vanessa Redgrave is synonymous with this role and one yearns for a cinema presentation of this extraordinary 20s icon now in 2005. I don't remember the film being overly criticized in 1968, it was a hit and respected for its tragic story and superb art direction. Several docos appeared on TV (one even being directed by Ken Russell) and there was quite a celebration of all things ISADORA and Vanessa in that year. But none since.","user":"ptb-8","rank":[20,23]},{"title":"Vanessa Redgrave triumphs as \"Isadora\"","rating":10,"date":"5 February 2011","review":"Why this excellent film is not available on DVD is beyond me. I just recently watched the film on an old VHS tape borrowed from the library. It was well worn and faded, but I was riveted by the amazing performance of Vanessa Redgrave as the famous dancer Isadora Duncan. I would love to see the original 168 minute film released (I viewed a cut version) in all it's intended glory. Ms. Redgrave was nominated in 1968 for her role in this film, but lost to Barbra Streisand and Katherine Hepburn. It was obviously a very strong category that year for best actress. However, this performance by Ms. Redgrave should be available to see today on Blu Ray. In my opinion, it is not to be missed. Film fans take note! If you have not seen this film, search it out. Check your local library for the VHS tape if you still have a VCR for it is well worth viewing the wonderful performance by the legendary Vanessa Redgrave.","user":"mfbruck1","rank":[8,8]}]