[{"title":"A+ A visionary masterpiece!!!","rating":10,"date":"25 January 2006","review":"The camera-work on this underrated beauty is breathtaking - one of the panning shots in the newsroom precedes Woody Allen's restaurant pan shot in Hannah and Her Sisters by over half a century! It is so organic, yet so breezy and alive. Don't miss the clever panning action with the gun sequence, and the mirrored room with the man getting off the elevator, which is also a throw-away gem. The actors are some of the finest character and bit players ever assembled on screen and the lightning dialog and clever editing is really quite modern in its speed and ingenuity.<br><br>I too am a devoted fan of His Girl Friday, but these are two very different films. Front Page is a masterpiece of old school ensemble character acting, and without it to break new ground, I don't believe His Girl Friday would have had nearly the breakneck pacing and out of the bottle genius that it is rightfully remembered for. The Front Page should take an esteemed place in film history for being the fertile breeding ground of screwball comedy in general and many of its masterpieces, including His Girl Friday, in particular. A must see for 1930's film buffs and screwball comedy fanatics!","user":"ytbufflo-1","rank":[32,33]},{"title":"Entertaining Version of the Story","rating":6,"date":"6 December 2002","review":"If it weren't for the even better Howard Hawks remake, \"The Front Page\" would probably be much more well-remembered today.  It's entertaining in its own right, with a slightly different feel from the remake, and it is better than most movies of its own era in at least a couple of important respects. While you can still tell at times that it is from the very early sound era, it does use sound and dialogue more smoothly and constructively (that is, rather than as a mere novelty) than do most early 30's movies.<br><br>Adolphe Menjou has the role of Walter Burns, and he is a good fit, giving the character just a slightly different turn from the way that Cary Grant would later play it.  The role of Hildy Johnson is somewhat bland in this one - it was the genius of Hawks in changing this role into a more worthy foil for Burns that made \"His Girl Friday\" so outstanding - but in compensation, some of the other reporters get more to do here.  The supporting cast has a number of good character actors, especially Edward Everett Horton as the fussy Bensinger, and it's good that they were given some worthwhile moments of their own.  Certainly the great remake deserves its own reputation, but this version deserves to be remembered as well.","user":"Snow Leopard","rank":[26,28]},{"title":"Way ahead of its time","rating":10,"date":"3 September 2005","review":"Way ahead of its time in both style and substance. The Front Page is a comic look at the underbelly of the newspaper business as well as a tough commentary on the times. In a press room outside the city jail, a group of newspaper reporters idly await the execution of a communist sympathizer accused of murder. Once the story heats up though, the press room becomes an absolute madhouse. The hilariously cynical script adapted from the play by Ben Hecht pulls no punches. Politics, the justice system, communist hysteria, love and marriage are all targets for the biting wit of the author. The script is complemented by a good ensemble cast. Pat O'Brien gives a good performance as Hildy Johnson, the star reporter for The Post, who is leaving his job for marriage. Adolphe Menjou steals the show, however, as Walter Burns, the conniving editor who will do anything to keep Johnson on the job. The rest of the news hounds are all expertly played, striking us as fun loving jokers one minute, but becoming downright violent the moment they smell a story. The movie also has a rare artistic style unequaled in most films. Though most of the movie takes place in the same location, the cinematography is done so well that we never feel we are watching a stage play. The cameras constantly move around the room, effectively putting us in the middle of the action. Pretty much everything about this film is done well. It is funny, edgy, artistic and thought provoking. Movies that can do all of that are few and far in between.","user":"km_dickson","rank":[36,40]}]