[{"title":"Classic Italian Gore from Fulci","rating":10,"date":"15 April 2006","review":"Now this is how a zombie film should be made! Whilst Lucio Fuci never had the creative genius of Dario Argento in Profondo Rosso, Tenebrae and Suspiria, he certainly knew how to make a good old fashioned zombie/gore movie. In Zombi 2 or Zombie Flesh Eaters (what a title!) as it was known in the UK, a ship drifts into New York with a very large, hungry zombie on board. This leads to two investigative journalists, including gore stalwart Ian McCulloch, with two holiday makers going to the Island of Matul. After meeting a shark wrestling zombie en route, they arrive at Matul where things are not going well. The hospital run by Dr. Menard has turned into a morgue where daily zombie killing has become the routine. Things go from bad to worse as the zombies grow in number and various dismemberment, eye gouging, jugular bites etc ensue. What makes this film so good are various factors. Apart from being one of the first gore films I ever saw, it has no social commentary or hidden meaning and does not try to be a comedy (although some may argue with this). It is a good, honest gore film. The special effects are nice and gruesome, with fantastic zombie make up, great zombie attacks and loads of maggots and worms. The crazy underwater battle between zombie and shark is totally original and not surprisingly has never been tried since. The infamous eye scene whilst a bit creaky still makes the viewer cringe. The acting and dubbing are dodgy but don't detract from the zombie mayhem, the music is great with calypso music to greet the heroes and throbbing effects to welcome the zombies. I cannot recommend this highly enough for good old fashioned zombie related thrills. Also look out for The Beyond and City of the Living Dead in a similar vein.","user":"zingbot","rank":[66,77]},{"title":"11 reasons why Zombi 2 is AMAZING (and has changed my life for the better...)","rating":10,"date":"25 October 2006","review":"#1 - Getting reception for New York City radio stations is easier than you'd think on the island of Matool. #2 - Molotov cocktails are easy to ignite, but the flames they produce rarely stay lit if you're throwing more than one at a time. #3 - Dr. Menard likes his booze and laying, fully clothed, in the sun (in that order.) #4 - If a shark with no teeth decides to get into a ridiculous scuffle with an underwater zombie, chances are it's going to end in a draw. #5 - NYC harbor patrol boats often fly French flags. #6 - The perfect remedy for having a busted ankle while being chased by legions of undead assailants is a good 'ole fashioned jungle makeout session. #7 - A dozen zombies shuffling into a door will (eventually and without any explanation) smash any barricade. #8 - Apparently, there are many different ways to scuba dive I've yet to try. #9 - Hospitals that look like churches are often well stocked in the ammo department (why not?) #10 - Splinters make eyeballs go \"ouch!\" #11 - The simple act of bribing a cabbie equals instant zombie adventure. <br><br>You can't account for personal taste, because it's all subjective, so I'm going to steer clear of any and all \"this movie is great and you suck if you don't like it and I'll kick you twice in the rear if you do and, um... your momma and your dog and here's 15 reasons why I love being a film student\" silliness that seems to be an IMDb staple. <br><br>What I will say is that this film is amazing. The zombies are great looking, the plot is ridiculous and full of holes, the music is stunning in its' elevator-esqueness, and Ian McCullough's combover is the stuff that dreams are made of. I read somewhere on IMDb that this film \"wouldn't gain any converts to the genre,\" but I strongly disagree. This film firmly cemented my lifelong love of all things horror and is, in my humble and worthless opinion, most likely the greatest film ever made - so take that \"Mom and Dad Save the World!\"","user":"huevosrancheros2","rank":[47,55]},{"title":"Nasty Videos or Nasty Governments?","rating":5,"date":"5 April 1999","review":"This was my first ever video nasty, originally viewed in the mid 80's, and for that reason it shall always have a special place in my heart. The first thing that struck me was that the budget must have been relatively high. Fulci was never a great one for narrative coherence (this is probably his most conventional film) and typically for the Italian films of the time this must have been pitched as a sequence of set-pieces (the shark battle, the fiery finale, and of course, the infamous eyeball scene). Unfortunately for the most part these are fairly flatly directed and fall short of their potential for tension. The earlier expository scenes are especially protracted, and throughout Fulci has a tendency to leave shots hanging well past their sell-by date. That said, the film is not completely artless, and whereas it lacks suspense, it does have a degree of atmosphere about it. After the political correctness of the 80's and the 'post-Modernist' knowingness of the 90's, Zombie Flesheaters, with its excessive gore and its leering nudity, its risible dubbed dialog and its a complete lack of humour, with its simplistic plotting and comic-book characterisation, is probably most interesting if viewed from the perspective that firstly, that there was ever a market for this sort of thing and secondly, that people thought that films like this needed suppressing. Yes it's true, they don't make them like this anymore!","user":"Jasper-12","rank":[55,75]}]