[{"title":"The one that took Jane Fonda from sex kitten to respected actress","rating":8,"date":"7 December 2014","review":"Fine gritty dramatic mystery that gets the pulse of NYC in the early 70's just right. It becomes another character in the film which only strengths the picture and adds a certain creeping menace to it. While the movie pivots on the disappearance of a man it's really a character study of alienation with the investigation a peg to hang the main action on. <br><br>Sutherland is fine as the inquiring detective John Klute but the film lives and dies on the character of Bree Daniels and Jane Fonda owns that part. <br><br>Bree wants the world to believe she's one tough hard customer but as the film progresses it becomes more and more obvious that the bravado is a front. She displays raw, honest emotion in all her scenes but particularly in her therapy sequences. She shows so many layers to the character, including flashes of humor that Bree comes across as a real woman. <br><br>Usually I try not to let appearance factor into my appraisal of a performance however that shag hairstyle is integral to the audience's acceptance of her as a tough call girl. Having moved forward and away from her initial image of the blonde cutie with her previous film, They Shoot Horses, Don't They?, she completely transforms herself in this. The soft blonde Jane Fonda of Barefoot in the Park or Barbarella of only a couple of years before would never be believable as Bree Daniels. The film was a major hit and she won her first Oscar for it. She was up against some excellent performances that year but she was the correct winner.<br><br>Expertly directed by Pakula in his usual observant style this is a classic of '70's cinema. Highly recommended.","user":"jjnxn-1","rank":[28,30]},{"title":"A fascinating study leading into the strange world of a complex call-girl","rating":8,"date":"21 April 2008","review":"\"Klute\" was a mixture of lone cop and private eye: a police officer who was hired privately to investigate somebody's disappearance The trail led him deep into the world of New York call-girls, pimps and drug addicts It was all shown, the vice, the degradation, but with intelligent compassion and honest humanity instead of the leer that so often sits on the face of the Seventies <br><br>Although barely more talkative than \"Dirty Harry,\" \"Klute\" emerged as a whole human being rather than as a robot programmed to shoot and hitAnd as a high class hooker Bree Daniel, Jane Fonda achieved a characterization that has never been surpassed in all the abundant literature of tarts with hearts <br><br>\"Klute\" was a modern, as honest and unflinching as any fanatic for realism could ask; yet it was never curious about sexuality, never needlessly violent, never brutal And for complete, entertaining suspense, it was up there with the great ones: an enormous tribute to the producer-director Alan J. Pakula","user":"Nazi_Fighter_David","rank":[55,68]},{"title":"Maybe The Film Should Have Been Called 'Bree'","rating":8,"date":"2 July 2009","review":"The question Klute ultimately asks is can a high priced call girl from Manhattan find happiness with a small town private detective from Tuscarora, Pennsylvania? Of course it asks more than that and probes the human psyche quite a bit.<br><br>Though the title role of John Klute the detective is played by Donald Sutherland, the central character is Jane Fonda the call girl. Which begs the question why the film wasn't called Bree. It was her performance as Bree Daniels that got Jane her first Academy Award for Best Actress. That and sympathy from Hollywood for being an avowed member in good standing on Richard Nixon's enemies list.<br><br>Despite Nixon and his trashing of the Constitution, I never liked the idea of Jane Fonda broadcasting from Hanoi while our soldiers were fighting in Vietnam. That was taking anti-war protest way too far. But forgetting the politics she gives quite a performance as the psychologically deep and troubled call girl who has a stalker on her hands.<br><br>Sutherland as Klute is hired to trace the disappearance of business executive Robert Milli from the main corporate employer in Tuscarora, Pennsylvania. Apparently Milli was leading a double life, on business trips he'd hire call girls and had a tendency to get rough while frolicking. There's a note found threatening one of them and of course it's Jane Fonda.<br><br>Fonda is an aspiring actress and model who does this to pay the bills. It's given her quite a cynical attitude on life. It takes a while, but Sutherland kind of grows on her and when he solves the disappearance, he proves to be her benefactor.<br><br>Other performance to note are Roy Scheider as her pimp, Rita Gam as the brothel madam and Charles Cioffi the CEO of the company who hires Sutherland to find the missing Milli. Still it's Fonda who dominates the proceedings.<br><br>I'm still hoping that Peter Fonda gets a role that will land him an Oscar so we have a father-daughter-son parlay of Oscar winners in one family. Klute as a film has stood the test of time and hasn't aged a bit. It could easily be done today with those awful Seventies fashions replaced by today's.","user":"bkoganbing","rank":[13,14]}]