[{"title":"Probably best viewed by Scots of a \"certain\" age!","rating":8,"date":"15 April 2006","review":"WARNING: My comments should be regarded as - a sad old sod's musings on a movie remembered fondly from his youth! I'm not going to dissect the movie scene by scene. I won't compare Forsyth's earlier works with his best known or \"finest\" moments. I'm not even going to discuss any particular aspect of the film! Not the setting, the story, the dialogue, not even the individual performances! I'm simply going to say that I remember watching this movie (with my family) on TV back in the early eighties and laughing so hard it actually hurt! I have no idea if it has aged well or not because I haven't seen it in over 20 years but I will say this in it's favour/defence, \"That Sinking Feeling\" gave Glasgow a voice and a character that's rarely been heard before nor since! Don't get me wrong, I'm not a Glaswegian so I have no personal axe to grind in that respect, I just feel that the human face of Glasgow (or Scotland for that matter) hasn't been depicted quite so sympathetically as in this movie. It seems to me that, when contemporary filmmakers try to present an \"honest\" depiction of the Glaswegian he tends to go for the \"gritty realism\" of the drunk or the druggie or the wife beating hard-man! That Sinking Feeling took a different tack and demonstrated the dry Scottish humour we all recognise (even more-so, we natives of Scotland) and perhaps that's why we seem to remember it so fondly. Anyway, if you can find a copy, watch it! Just don't expect any cool CG effects or Seinfeldesque banter, just good clean working class urban banality and the comedic observations you'd expect from a good clean working class director feeling his way!<br><br>Incidentally, sometime back in 1992/3 I met the redheaded actor (shamefully I can't recall his name right now) from \"That Sinking Feeling\" working in Stirling castle, conducting tours and the like! Not only does he star in one of my favourite productions, he is also an all round, really nice guy!<br><br>Bonus!","user":"Rocksterious","rank":[14,15]},{"title":"Dubbing is an insult.","rating":7,"date":"10 March 2007","review":"I actually love this film but perhaps thats because I grew up in Scotland in the 70's and it does have a lot of \"in\" jokes which foreign audiences could easily pass by. Sadly, this film was ruined by the completely hideous dubbing. It saddens me that the director allowed this to happen. I know that people say \"but we cant understand the accent\" well thats their fault, not the films. No one would have dreamed of dubbing Trainspotting so why ruin what is actually a charming and funny movie. Subtitles would have been insulting enough but at least you can turn them off. Yes, the editing is bad and the film quality is grainy but I think that represents the depressed times and the amateurish robbery plot. Perhaps I am over thinking that, maybe they were just being cheap. I don't care, I still love it. Do yourself a favour and watch the original.","user":"txswanie","rank":[17,19]},{"title":"Weirdly funny surreal comedy","rating":9,"date":"4 December 1999","review":"Full of (then) unknown actors TSF is a great big cuddly romp of a film.<br><br>\nThe idea of a bunch of bored teenagers ripping off the local sink factory is odd enough, but add in the black humour that Forsyth &amp; Co are so good at and your in for a real treat.<br><br>The comatose van driver by itself worth seeing, and the canal side chase is just too real to be anything but funny.<br><br>And for anyone who lived in Glasgow it's a great \"Oh I know where that is\" film.","user":"almagill","rank":[12,14]}]