[{"title":"Underrated followup to Harper in a different key","rating":7,"date":"18 November 2000","review":"Where Harper was jazzy, amped up for its day and often dark humored in its intrigue and violence, this sequel has more of a laid-back and ultimately melancholy tone.  The humor is still there, but the dysfunctional family theme that produced edgy laughs in the earlier film cuts deeper here.<br><br>Newman looks great and is as effortlessly effective as ever as he prowls Cajun Country, at the behest of onetime flame Joanne Woodward, in search of a blackmail source that quickly turns into much more.  Filmed all over South Louisiana, including a mansion shot here in Baton Rouge, it gets the local flavor down pretty well.<br><br>Dismissed as draggy even in its day, and certainly so in the age raised on the newspaper ad quote \"A Thrill Ride!!!\", it's a thoughtful, well acted addition to the private eye genre, with Melanie Griffith coming out the gate full force as a troublesome nymphet (an interesting predatory flip-side to the victimized variation seen later the same year in the superb Night Moves.)<br><br>Hopefully a widescreen DVD will one day soon afford its excellent Panavision photography to be seen for the first time in 25 years.","user":"fs3","rank":[24,26]},{"title":"Intriguing, carefully paced mystery.","rating":17,"date":"17 October 2002","review":"Ten years after Newman's success in \"Harper\" as the title private investigator, he reappeared in this follow-up.  While the caliber of the cast can't hold a candle to the stellar first film, the acting and mystery elements are excellent.  Woodward plays a wealthy Louisiana woman who once had a brief fling with Newman.  She hires him to find out who's blackmailing her about her extramarital dalliances.  Once he lands in the bayou, he is immersed in several confusing and complicated situations involving sex, real estate war and murder.  Newman is utterly appealing as the hard knock investigator, Woodward is cool and refined, Franciosa puts his method acting to good use and Hamilton puts an enjoyably quirky spin on a villainous role. Griffith effectively plays Woodward's sexually ripe daughter and Browne adds great authority in her brief appearance as Woodward's domineering mother-in-law.  The plot is extremely convoluted and risks losing all sense at times, but it all comes about in the end.  The actors succeed in making the audience want to see more of what they are all about.  The title refers to a climactic scene in which Newman and an exasperatingly upset cohort are trapped in an enclosed hydrotherapy room which is filled to the brim with water.  This affords a rare opportunity to see the relatively modest Newman trotting around in damp boxer shorts.  The film utilizes (perhaps overutilizes?) the song \"Killing Me Softly\" throughout.  The film is like a reunion of sorts for Newman.  Aside form his frequent collaborations with his wife Woodward, she and Franciosa had starred with him in \"The Long Hot Summer\", Hamilton had appeared in \"The Hustler\" and Jaeckel co-starred with him in \"Sometimes a Great Notion\".  Director Rosenberg has also directed Newman in \"WUSA\", \"Cool Hand Luke\" and \"Pocket Money\".  Years later, Griffith would appear with Newman in \"Nobody's Fool\".","user":"Poseidon-3","rank":[23,25]},{"title":"Intelligent thriller","rating":8,"date":"11 September 1999","review":"A mature, intelligent thriller, in which Newman recreates Lew Harper. It takes place around New Orleans and involves public corruption and an intricate web of deceit.<br><br>The style is fairly laid-back, though it doesn't actually lag - even though it sometimes seems it's about to. The characters are all sharply delineated and complex, and there is a lot of very good acting going on.<br><br>Thoroughly watchable, with some tension and suspense, but only sporadic action.","user":"Penfold-13","rank":[33,40]}]