[{"title":"Slick, understated and intelligent.","rating":8,"date":"14 August 2003","review":"Veteran small time crook Charley Varrick and his gang rob a small bank in the south west. Expecting modest takings, Charley is shocked to discover that the haul is $750,000. The catch is that the money belongs to the Mafia, who are soon on the trail of the robbers. Charley must devise a scheme to escape with his life, and hopefully the money as well.<br><br>   This is a very pleasing piece of work all round. Directed with customery efficiency and style by Don Siegel, it twists and turns, always keeping you interested. Its helped by good casting. The ever watchable Walter Matthau effortlessly slips into the role of Varrick, Joe Don Baker is quite chilling as the ruthless hitman with impeccable manners and John Vernon extracts some sympathy as the Banker/Mafia man trying to smooth everything over. Add some pleasant locations and an intelligent script and the result is a very satisfying, if different '70s crime thriller.<br><br>   As I watched this again last night on BBC1, I remembered that on its previous screening it was preceeded by an introduction by Mark Kermode. In it he commented on the fact that Matthau hated the film. After a second viewing I still can't imagine why.","user":"KEVMC","rank":[57,60]},{"title":"It doesn't get any better than this.","rating":10,"date":"23 July 2000","review":"Now that more and more people are reflecting on the great career of Walter Matthau it is surprising that very few critics have mentioned his top-notch performance in Charley Varrick (the best thing he has ever done). I got interested in this film when I discovered that it had an underground following with everyone from \"The Pretenders\" to several critics. I bought the film and became floored by how outstanding of a movie this is. In my opinion it is the most under appreciated movie ever made and the best movie to come out of the 70's (yes, even better than THE GODFATHER, DAYS OF HEAVEN, TAXI DRIVER and APOCALYPSE NOW). It is also one of the ten best movies I have ever seen. I have seen this movie over 20 times and it gets better every time I see it. It is surprising that I have learned more about how to make a great suspense/action film from this movie than any other which I have seen. The interesting thing about Charley Varrick is that you wonder why you are so taken in by the story. It's a relatively simple one. Yet, this is a story with a conclusion that leaves you stunned every time you see it and convinces you that this is a film that should be seen again and again (unlike some great movies that should be seen only once). I make it an effort to see Charley Varrick on a regular basis. The story starts out as follows: a group of bank robbers attempt to make a small killing and right when they think that they have succeeded . . . The story then allows the viewer to be consumed in a film of drum-tight professionalism with great action sequences, excellent performances, incredible dialogue, and possibly the greatest single screen villain of all time in the form of Joe Don Baker (I wouldn't have believed it until I saw it). I am convinced that in the near future Charley Varrick will be resurrected in the form of a remake (not that I am looking toward that day). But in context, Don Siegel's masterpiece is a film that stands by itself as one of the great under appreciated and undervalued movies of all time and is a film for everyone. It doesn't get any better than this.","user":"Preston-10","rank":[78,93]},{"title":"Are we really seeing what's going on or is Don Siegel throwing dust in our eyes?","rating":8,"date":"8 August 2001","review":"This quick-moving thriller demonstrates that cinematic amorality has been around a long time. Made in 1973, it allows crop-duster and bank-robber, Charley Varrick, played by Walter Matthau, to get away with a heap of stolen money, the theft of which has led to the death of about half a dozen people, including his wife. The movie is directed, in his usual snappy but artful way, by Don Siegel, who taught Clint Eastwood everything Clint knows about direction, but not necessarily everything Don knew. <br><br>The movie also demonstrates that in the days when movies spent less time on technical wizardry, they could spend more on character development. For example, on \"Molly\" (Joe Don Baker), a courteous but sadistic heavy from the deep South, who can beat a man to death without losing his cool or creasing his sharp suit. Other noteworthy character studies are Andy Robinson as Charley's sweaty, weasly accomplice; Sheree North as a two-timing photographer; John Vernon as Maynard Boyle, a suave but crooked bank owner; and Marjorie Bennett as a nosey trailer park resident. <br><br>\nThe plotline is supposed to be that Charley expects to get only a modest sum from the bank heist, and then has to get his thinking cap and skates on when he realises he's taken a pile of Mafia loot. But Siegel teases us, and it's never very clear just how much Charley knows and how far ahead he's thinking; perhaps there was an insider and Charley knew about the big money before the raid. Overall, can we believe what we're seeing, or is Siegel playing with us, like Bryan Singer in The Usual Suspects?<br><br>\nWhich leads to the third thing demonstrated by this and other Siegel movies - that current hotshots like Quintin Tarantino owe him a debt.<br><br>(Incidentally, those IMDb commenters who are offended by Charley bedding Boyle's secretary (Felicia Farr) because she is too young for him should check Ms Farr's DOB. Also, she was married to Jack Lemmon, Matthau's friend and film-partner, so the bedroom scene is something of an in-joke.)","user":"Geofbob","rank":[68,81]}]