[{"title":"Another great performance by Mary Astor","rating":10,"date":"14 December 2003","review":"If you get the chance to see this version of \"Holiday,\" take it! Ann Harding is fabulous in the part of Linda, a role later played by Katharine Hepburn in the better known 1938 version. But another pleasure of this version is Mary Astor's excellent portrayal of Julia. She takes a rather blah and unrewarding role and really makes something of it. Highly recommended!","user":"Lydcaro","rank":[26,28]},{"title":"The Radiant Beauty of Ann Harding","rating":9,"date":"6 August 2010","review":"Pathe acquired the screen rights to Philip Barry's sophisticated play \"Holiday\" for Ina Claire, who had a nine month contract with the studio, but the production of \"The Awful Truth\" took longer than anticipated and Ann Harding was handed the plum role of Linda Seton. \"Holiday\" was a huge hit and Ann received an Academy Award nomination (she lost to Marie Dressler). It also cemented her image as a shimmering, radiant beauty, always well bred but with distinctive views of life and love. Mary Astor recalled that Ann \"was one of the first stars who disregarded her status on the set, she wore little or no make up and would not put up with special treatment, special chairs etc\". She was a hard worker and not a phoney.<br><br>\"Life walked into the house today\" declares Linda Seton, when her sister, Julia (Mary Astor) introduces her fiancée Johnny Case (Robert Ames). The Setons are extremely wealthy (they have a lift that takes them to each floor in their mansion) and money is their God. Johnny is just a regular guy, who comes from humble beginnings and feels life is there to be lived. Linda agrees with his philosophy and wants Julia to grab her happiness. Their brother, Ned (Monroe Owsley) is a cynical alcoholic who has given up trying to assert his own personality and is now completely submerged by his father - almost. Even though on the surface, Julia is eager to fall in with Linda and Ned's plans, at heart she is like her father and secretly wants Johnny to buckle under and take a place at the family firm. <br><br>Linda wants to give Julia and Johnny a special party with just a few friends (Edward Everett Horton, Hedda Hopper), real people, not pretentious snobs, who will make it a fun evening. Next scene, a ball is in full swing and Linda is nowhere to be seen - she is defiantly throwing her small party in the nursery - the only room she has ever felt happy. By the movie's end Julia's grasping \"small\" nature is revealed - when Johnny rejects her father's offer of a job - Julia admits she doesn't love Johnny, his carefree attitude has turned her cold. It is up to Linda to rush to his side (he is sailing on the midnight boat) and give him the love and support he needs. She has a special message for Ned - \"I'm going to return you to life\" - and for the room in general - \"If he (Johnny) wants to sell peanuts - oh how I'll believe in those peanuts\"!!!<br><br>This is a wonderful, sparkling movie and Ann Harding is glorious in it. You forget how old the movie really is. Has Mary Astor ever given a bad performance - I think not and she is excellent as the unbending Julia. Monroe Owsley, whose forte was villains, the oilier the better gave a good performance as Ned. From the list of his movie credits big things were expected of Robert Ames, who played Johnny, but, unfortunately, he died of the D.Ts the following year.<br><br>Highly Recommended.","user":"kidboots","rank":[14,15]},{"title":"Probably could not be made the year before or the year after...","rating":8,"date":"3 January 2015","review":"... given its subject matter. This is not a precode at all. Rather it is the filmed version of a 1928 play that made perfect sense in the roaring 20's. This film could not be made before 1930 because sound films hadn't evolved to the point where dialogue and movement could be shown as they are here. It could not be made after 1930 for several years (It was filmed again in 1938) because depression era audiences would simply be befuddled at a young woman (Ann Harding as Linda) who is so unhappy and bored with her rich lifestyle while many in the audience would just want to know when they are going to eat again.<br><br>The story revolves around a rich young woman, Julia Seton (Mary Astor), who is returning home with her fiancé (Robert Ames as Johnny Case), whom she has known for only ten days. The Setons are terribly rich - I mean how many homes have elevators in 1930? - and they are divided into two groups. The stodgy business centric part of the family that runs things headed by patriarch Edward Seton (William Holden - no not THAT William Holden), and the unhappy Setons who seemed trapped on a merry go round from which they cannot get off. These are Julia's two siblings, Ned (Monroe Owsley) who drinks heavily to deal with the fact that he has no say in his own life, and Linda (Ann Harding), free in spirit but not in deed.<br><br>Johnny has a strange idea of how to live his life. He has been buying some stocks and as soon as he gets enough money together, he wants to go on \"holiday\". He wants the retirement part of his life to be when he is young, not just to have fun but to make sure that what he does for the rest of his life is what he really wants to do. Linda thinks this idea is grand, but fiancée Julia just thinks this is a goofy notion from which she can eventually distract him.<br><br>You'll notice that from the moment they arrive, Johnny seems to spend all of his time conversing with Linda and that Julia spends most of her time conversing with her \"bucks on the brain\" Dad. Complications ensue.<br><br>Ann Harding does have some dialogue and over the top moments that only someone as regal as she could pull off. Lots of actresses would have looked silly going on and on about how the playroom was the only place in the family mansion in which she was ever happy. Plus, she is making a BIG leap of faith in her final decision in the film. It is easy to see why Katharine Hepburn was cast to play Linda in the 1938 remake - they have very similar acting styles.<br><br>Let me also compliment Mary Astor's acting here. As both Johnny's fiancée and her father's daughter you are never quite sure where she is coming from up to the very end. <br><br>Edward Everett Hornton and Hedda Hopper have a small but crucial role as a couple who are friends of Linda and have a sense of humor that most of the stodgy Setons do not appreciate, but are needed to show that Linda does at least have some allies in her life. Highly recommended.","user":"AlsExGal","rank":[9,10]}]