[{"title":"Off-putting at first","rating":8,"date":"2 September 2009","review":"A movie about six people who are constantly shifting sexual alliances and expect each other to remain calm and polite about it all. This movie really irritated me for the first hour or so, in particular Lee Remick's self-absorbed and extreme flightiness, as well as Richard Attenborough's odious civility. But by the time it was over, I was won over by its offbeat approach and ultimately rather scathing critique of the seeming British need to retain manner and form despite the repulsive behaviour of one's peers. And for me, Claire Bloom steals the film as a morbid anthropologist who looks like she just stepped out of a Modigliani painting.","user":"A-No_1","rank":[6,6]},{"title":"La Rhonde with wit.","rating":10,"date":"3 January 2003","review":"This stylish sophisticated high comedy on sexual desire and the nature of love is highly recommended. Witty and charming, it boasts an outstanding cast of actors. Not your regular cup of tea, these three couples not only manage to swap mates a number of times between them; but manage to do it with such flair that you cannot help but enjoy the ride along the way.<br><br>It may not be everyone's taste, but if you are looking for something more than a run of the mill romantic comedy; this is for you. In some ways, it could be considered a version of \"Bridget Jones Diaries\" for people who have actually read Jane Austen and not just seen the adaptations. Murdoch was a powerhouse in her time, and this shows you why.","user":"maeander","rank":[16,21]},{"title":"for all its faults a severed head almost makes it","rating":6,"date":"11 January 2012","review":"As previous reviewers have noted, this is not a horror film, but a comedy based on an Iris Murdoch novel. Curiously, what should have been pitched at a farcical level comes across flat and the humor, such as it is, very British and very dry. Murdoch's novel itself reads as a near-farce, tongue in cheek, without a demand from the reader to suspend disbelief, but to go along for the ride. The portentousness of the \"severed head\" comment and the perverse exotic erotic goings on of Honor Klein (Claire Blooms in the film--and she does look like a Modigliani!)--all read like symbolic trappings intended to indicate some deeper meaning (it ain't there.) The film comes across restrained, if not nearly constipated, thanks mainly to Ian Holm's performance. His character, our triply-cuckolded protagonist, is frankly a quite unsympathetic character, really a nasty little man throughout. In fact, it is difficult to work up much feeling for any of these characters. Formally, this is just this side of a filmed stage play (scripters Priestly and Murdoch having adapted screenplay from a stage play), it plays like it, and makes it a mediocre film experience. Having said all that, there is something , or there are some things that keep it going on the DVD player: Lee Remick is actually trying to do farce, which is whatis called for, while Claire Bloom is intriguingly exotic and erotic(a creation of Murdoch's. If you're somewhat anglophilic, you'll probably enjoy this, trailing its clouds of \"swinging sixties London\" glory behind it, a kind of last gasp I suppose.","user":"philbrick44","rank":[6,7]}]