[{"title":"Some Delights for Elvis Fans","rating":14,"date":"14 November 2011","review":"This movie followed \"Harum Scarum\" and was a big step up simply because \"Harum Scarum\" was arguably Elvis's worst movie. This one is actually the closest thing that Elvis ever did to a typical Hollywood musical like \"Music Man.\" There's an interesting plot and some good energy that carries through the first half of the movie, but it limps along badly in the second half. I went to sleep and had to finish watching it the next morning.<br><br>The large amount of Broadway musical-type tunes simply doesn't fit Elvis' style very well. Only the title tune is really interesting and works very well. At the end, there is a gem called \"Please, Don't Stop Loving Me.\" It comes at about 80 minutes of the film's 87 minute run and I'm not sure that anybody except Elvis fans will last that long.<br><br>Apparently Donna Douglas and Elvis had deep philosophical conversations on Paramahansa Yogananda and the Christian religion during the breaks while shooting this movie. This shows as there is very little chemistry between them. Second lead, Nancy Kovack provides whatever sexual chemistry the film does have. One suspects that if Douglas and Kovack had changed roles, the film would have worked much better.<br><br>This doesn't fit into the category of Elvis' good movies, but it also doesn't fit into the category of his bad movies. Lets just say that it is an okay movie that only Elvis fans will find pleasurable.","user":"jayraskin1","rank":[7,7]},{"title":"Good fun for Elvis fans, Donna Douglas fans","rating":6,"date":"10 October 2002","review":"Romping, colorful Presley vehicle with plenty of songs and good comedy from Harry Morgan and Donna Douglas.  Johnny (Presley) is a riverboat gambler who becomes convinced that a redhead is his good luck charm -- problem is, Frankie (Douglas) is a blonde!  She goes after him with a gun, and the rest is in the song (a personal favorite of Elvis', I understand).  Edward Small's production clearly outclasses the Sam Katzman drek Presley would soon be floundering in.  Some fairly elaborate musical numbers well-executed, quality photography and decent directing.  DVD is a good one, buy it Elvis fans.","user":"funkyfry","rank":[15,18]},{"title":"FRANKIE AND JOHNNY (Frederick De Cordova, 1966) **1/2","rating":6,"date":"25 August 2007","review":"This is an oddity in Elvis’ filmography: a quaint but pleasing musical comedy based on the popular song which had already inspired a similarly-titled film from 1936 starring Helen Morgan – apart from being featured in the Mae West vehicle SHE DONE HIM WRONG (1933) and, again, as recently as Robert Altman’s A PRAIRIE HOME COMPANION (2006).<br><br>The star isn’t entirely comfortable amid the 1890s riverboat setting, what with a few of his musical performances (and especially his hairdo) coming off as inextricably modern. Still, the plot – thin as it is – emerges to be quite engaging (what with its backdrop of fortune-telling, gambling parlors, variety acts and costume parties and involving mistaken identities, misunderstandings, an attempted murder and a bar-room brawl)! The cast presents three notable female roles: Donna Douglas (as Frankie), Nancy Kovack as Elvis’ red-headed lucky charm and the flame of his jealous boss, and Sue Ane Langdon as a ditzy “blonde” – who, along with Presley’s long-suffering sidekick Harry Morgan, turns out to be the most likable character as well as the purveyor of the film’s comic relief.<br><br>Elvis’ best ‘new’ number is “Hard Luck”; apart from the title tune, he also gets to sing the standard “When The Saints Go Marching In” (while dressed in full military regalia)! The film is short enough at 87 mins. not to overstay its welcome, but the rather low-key presentation also prevents it from being anything more than unassuming entertainment. I wouldn’t classify it among the top-flight Presley vehicles, therefore, but it’s certainly superior to some of the bigger-budgeted (yet simple-minded) fluff he made over at MGM – this being a production from independent producer Edward Small released through United Artists.","user":"Bunuel1976","rank":[12,14]}]