[{"title":"Easy to take in the right frame of mind","rating":6,"date":"29 November 2008","review":"A western, shot in Spain, with a twist: Jim Brown and Fred Williamson, folks not normally associated with Euro-made westerns, take it upon themselves to deliver a large payroll to a ranch in Sonora, Mexico, after the ranch owner (Dana Andrews) dies while on the road. Everybody who hears of this -- and I mean everybody -- goes after them. This includes the local sheriff (Barry Sullivan), an army of drifters and gunhands, and bounty hunter Lee Van Cleef, who recognizes Brown as a wanted man from years before. Brown is given minimal dialog, which is a good thing as he is not exactly an actor. Williamson fares better as a breezy card sharp in fancy duds, who carries most of the dialog for the two of them. Not bad. The music, clearly derived from THE MAGNIFICENT SEVEN, is better than the movie.","user":"ctomvelu-1","rank":[16,17]},{"title":"Three Plus Lee should have equaled more.","rating":4,"date":"18 November 2000","review":"Coming near the end of the spaghetti western cycle, this one should have worked out better.  While some of the action scenes are good, others fail with a thud, and none of the solid stars are given any material to distinguish themselves.<br><br>Overall, Jim Brown fared a bit better in westerns than Williamson, who made a few more; this was Kelly's sole venture into the genre.  And with Van Cleef around, one wishes that one of the better directors (Leone, Sollima) who guided his top efforts was on hand to spark this one.  A disappointment; couldn't be a total loss with that cast, but they deserve better.","user":"fs3","rank":[16,18]},{"title":"With this cast, it can't miss (completely).","rating":7,"date":"15 December 2002","review":"This predictable and formulaic Western will not blow you away with its brilliance, but it IS fun, carried along almost entirely by the strong presences of its top stars. Only Jim Kelly and his karate moves feel out of place. And it also must be mentioned that the big moment that you all (?) have been waiting for, a fight between Jim Brown and Fred Williamson, does arrive in this film....but the scene is terribly unrealistic-looking. (**1/2)","user":"gridoon","rank":[12,13]}]