[{"title":"Early Kurosawa is very enjoyable","rating":10,"date":"10 September 2004","review":"I have watched this several times and enjoyed each viewing. It's a very early Kurosawa, apparently done on a shoestring of a budget. However, we can already see Kurosawa's talents in pacing and setting up shots. Kenichi Enomoto as the porter appears out of place at first with his over the top mannerisms and broad comedy, but he fits into the story and breaks up the slower pace of some of the scenes. For Kurosawa and samurai fans, I think this will be more than just a curiosity. This has an early appearance of Masayuki Mori (the murdered husband in Roshomon) and a fairly early appearance of Takashi Shimura (leader of the seven samurai). I recommend this for the usual suspects.","user":"gkbazalo","rank":[28,30]},{"title":"WARNING - SPOILER!! Of interest to those who study samurai or Japanese history","rating":29,"date":"29 August 2004","review":"Kurosawa re-tells a famous incident which occurred in Japanese history around 1185 A.D. (I can't remember the exact date), Yoritomo and Yoshitsune were brothers who fought a common enemy, but after the enemy's defeat, Yoritomo turned on Yoshitsune and sought his death, creating a dragnet by setting up barriers and search parties all over Japan. Yoshitsune fled with a small band of loyal followers, including Benkei, a famous warrior monk. With much hardship, they made their way along hidden forest paths hoping to seek refuge with an ally, disguised as monks (Yoshitsune is eventually disguised as a porter). But they come upon a barrier guarded by Yoritomo's men, who have orders to execute suspect monks (three unlucky 'suspect monks' have already been executed at this barrier the day before), as the word is out that Yoshitsune is traveling in such disguise. Recounting a famous incident in samurai lore, when Yoshitsune (as a porter) comes under suspicion from an observant barrier attendee, Benkei immediately intervenes and tries to protect his lord from unmasking by beating Yoshitsune half to death with his famous rod and shouting \"You always cause us trouble!\", they are allowed to pass the barrier as it is inconceivable that any retainer would ever lay a hand on his lord, such an act would certainly be grounds for instant death. So of course, the porter couldn't be a lord, he must be just a regular porter. Over the objections of the barrier attendee, Togashi waves them through with safe passage. Apparently one of the ironic things about the entire story is that everyone in Japan knows that Yoshitsune passes this barrier only to be hunted down two years afterward and forced to commit suicide, while Benkei ends up much like El Cid, protecting his lord. It is said that in their dramatic last days, he rushed into the castle and shouted \"All is lost!\" and Yoshitsune asked Benkei to give him time to slay his wife and child and commit suicide. So Benkei agreed and went back outside to fight his losing battle and fend off the enemy as long as he could. His reputation was so fearsome that the enemy shot him full of arrows and he still stood ferociously, after a time the enemy approached him in trepidation and touched him, whereupon he toppled over and they discovered that he had been dead for awhile. So, like a scarecrow, he had guarded his lord and discharged his duties posthumously. I read somewhere that Togashi, the man who let him pass the barrier, knew exactly who he was, but was so much in sympathy after seeing what straits Benkei was driven to to protect his master, that Togashi let them pass anyway, possibly inferring that he would be required to commit suicide later, for letting them slip through his fingers. If so, this could explain why Togashi later sends sake to the group, it could be that when it is presented to the monks, Benkei also understands that Togashi knowingly let them pass and will be required to kill himself. He is in essence sharing a symbolic farewell drink, therefore he does drink to the dregs and appreciate the chance at life which was granted to them through Togashi's own self-sacrifice, so he sincerely drinks to Togashi. However, I must say that Susumu Fujita (as Togashi) looks so very sincere during all of this that I have a hard time believing that he indeed knew of the subterfuge, perhaps the sake was sent as a token of admiration and a kind gesture only. Like a lot of Kurosawa scenes, a great deal seems to be left to the viewer's interpretation. The story is famous culturally also because it is immortalized in a Kabuki play, The Subscription List, much of the treatment in this film appears to follow the Kabuki rendering of events (I have never seen the Kabuki play, but I read the synopsis, and it appears to have the same story-line. Costumes appear to be very similar, looks like mountain yamabushi, possibly Shugendo sect). The addition of the humorous comic is one difference, I don't know why Kurosawa put him in there, but one can get a sense of what appealed to Japanese people in 1945 as it is said that he was a well-known comedian. OK, end of spoiler. <br><br>p.s., don't watch a cheap Hong Kong knock-off of this video, get an original. The cheap Hong Kong version has awful sub-titles. <br><br>p.p.s. The real Benkei is said to be buried on the grounds of Chuson-ji temple.","user":"Dancing_Bear","rank":[21,22]},{"title":"Samurai film with no sword fights","rating":10,"date":"4 September 2005","review":"The story of Benkei (the faithful retainer) and his lord Yohitsune is an old one, familiar to Japanese audiences from both the Kabuki and Noh theaters. The musical score reflects these sources. The most stylized scenes (inspired by the very refined Noh theater) are accompanied by the high-pitched whistlings and drum taps of Noh. The more athletic scenes have Kabuki inspired music, and the scenes where Kurosawa departs from Japanese tradition have Western music. What Kurosawa adds to the story is a lowlife character (a porter) played by Japan's most famous comedian. The porter serves as audience and a kind of Greek chorus, reacting to and commenting on the action. As a result, we see the story through the eyes of a common man.<br><br>Kurosawa used the same device (with variations) in many other films: the two peasants in The Hidden Fortress (which was a very similar story done with a much bigger budget); the Mifune character (a peasant pretending to be a samurai) in The Seven Samurai; the woodcutter in Rashomon; the inn keeper who gives shelter to the wandering samurai in Yojimbo; and (in one memorable scene) the captured soldier in Sanjuro. Not only does this device provide comic relief; it also puts the heroic deeds of the main characters in perspective, and connects them (with some irony) to the real world of everyday life.<br><br>The climax of Kurosawa's 1945 film is the confrontation between Benkei and Togashi (the samurai in charge of the border station). The conflict is psychological rather than physical, with Benkei acting the part of a Buddhist monk, and Togashi testing him on Buddhist doctrine. There is little doubt that Togashi knows who Benkei and his companions really are, but Togashi lets them go because Benkei wins the contest. Togashi can find no flaw in Benkei's performance.","user":"donelan-1","rank":[12,12]}]