[{"title":"\"That western in the snow\"","rating":8,"date":"16 September 1999","review":"\"That western in the snow\" - was my brother's response when he heard that I'd finally tracked down a copy of THE GREAT SILENCE, a.k.a. THE BIG SILENCE (I first saw it 10 years ago on BBC2's 'Moviedrome').<br><br>If you like Sergio Leone's films (such as THE GOOD THE BAD AND THE UGLY and A FISTFUL OF DOLLARS) then you'll probably enjoy this film by Sergio Corbucci.  Violence, shooting, cussing, strange costumes, haunting music, trademark camera angles and the Italian style go to make up one of the best (lost)westerns I've ever seen.<br><br>These films aren't to everyone's taste, but THE GREAT SILENCE is worth watching just to hear the main theme tune which is a fantastic work of latterday composition - it sounds daft but I nearly cry when I hear it sometimes.  By turns the score is dream-like, stylish, menacing, bizarre and even ridiculous (twanging sitar-like sounds).  This is my favourite piece of Ennio Morricone's music.<br><br>As I said before the main reference points for this film are those of Sergio Leone, except for the snow-laden setting and the distinct lack of humour( THE GOOD THE BAD AND THE UGLY still makes me laugh, despite countless watching).  Having said that this film has a distinctly original atmosphere of it's own, brought out in the brilliant and shocking ending. the director went to great lengths to preserve his radical finale (particularly unpopular with the producer) - there is a version of the film with a cop-out ending.<br><br>In short then, this is a great movie despite all the shortcomings of the particular genre( I'm not saying anything)- I once read that the term \"Spaghetti Western\" was a derisory one used by American film critics - but I can't think of any American westerns as enjoyable as some of these Italian films.","user":"jools B","rank":[68,76]},{"title":"The silence before the gunshot","rating":10,"date":"4 April 2007","review":"Twenty five years before Clint Eastwood made his departure from the western genre with his violent, cynical epic \"Unforgiven\", Sergio Corbucci had already treated us with one of the most dark and unforgiving tales of vengeance violence and that has ever graced the western screen. A forgotten classic that deserves recognition \"The Great Silence\" is Corbucci's definitive movie, powerful to the point of sadness. It can and it will shock it's viewer, with it's unforgiving nature, and themes.<br><br>Set around the snowy landscapes of Utah, \"The Great Silence\" stars Jean-Louis Trintignant as Silence, a mute gunfighter assisting a group outlaws for and a woman trying to avenge her dead husband. They are faced against a group of bounty hunters, led by Loco (Klaus Kinsky) a ruthless and merciless man who values only the money he gains from the killing.<br><br>Corbucci utilizes the snow-filled landscape to the maximum, creating a hauntingly chilling atmosphere that sticks with you from the beginning to the end and most likely, long after you've watched the film. The opening shot demonstrates perfectly the technique employed by Corbucci, with a long shot of Silence as he rides thru the desert of snow, there are no other environmental elements, just him riding calmly forwards accompanied only by a chilling tune from Morricone. This entire moment creates a image so strong so hypnotizing that I found myself re-watching it again and again. It is these moments that make \"The Great Silence\" great, experiencing the silence before the gunshot and the silence after it, the moments of reckoning, the moments that decide the fates of human beings. I emphasize on \"human beings\" because the characters here are not only likable but believable and they very much feel like real people, the kind you might like or despise or love or hate. It's not about Silence's skills as a gunfighter, but the human aspect bellow, that is what makes him feel real. None of this would have succeed had it not been for the brilliant acting of the entire cast. Trintignant and Kinsky make the biggest impression though, adding layers of depth to their respective characters without even uttering a word, just their facial expressions, the way the move, the confidence with which they act it is simply brilliant.<br><br>Commenting on the final scene would be a downright shame to those who haven't seen the movie just yet. But it is one of the most memorable, no not only memorable it is one of the greatest endings ever shot, with one of the best uses of slow-motion I have ever seen. Slow-motion that captures the darkest, saddest moment, the one thing no one would expect to happen in a western. This further helps to strengthen the major anti-violence theme as the credits begin to roll and the viewer is left to cope with the unexpected finale.<br><br>Ennio Morricone serves one of his best scores. I would easily rank this amongst \"The Good, The Bad and The Ugly\" in terms of quality. But it is by no means similar to it. No. We are not soothed by the comfortable music heard in his collaborations with Leone. This score is, haunting and sad, like the movie itself it has an emotional effect on the viewer.<br><br>\"The Great Silence\" is as every bit as good as any of Leone's films. But is also as every bit as different from them. A uniquely dark voyage into the brutal reality of human nature, concealed as a western. Sergio Corbucci died in 1990, his movies weren't remembered by many, but those that did will never forget \"The Great Silence\".","user":"K_Todorov","rank":[56,62]},{"title":"They died with their coats on","rating":30,"date":"30 July 1998","review":"In a traditional Western one instantly knows who the good and who the bad guys are, and - of course - we also know who will triumph at the end (the good guys, of course).  In a typical Italian Western we still know instantly who's going to win at the end, just the distinction between good guys and bad guys is rather blurred. Il Grande Silenzio is not a typical Italian Western.  We know instantly that e.g. Klaus Kinski is one of the bad guys (frankly, we know that before the film starts but that's beside the point), but the final outcome is much less predictable, and if you tried to predict it the actual ending may come as a huge shock.<br><br>The title of the film is ambiguous, both referring to the grandiosity of the character played by Jean-Louis Trintignant (called 'silence' since he's mute) and the silence of the winter landscape in which the film is set and the silence of the death.<br><br>Yes, the silence of death: the German title of the film ('Leichen pflastern seinen Weg', translation: 'his path is paved with corpses') is also ambiguous, since 'his' could equally apply to both main characters. However, the violence is never gratuitous, it is bleak: most of the victims have faces and a story behind them. Il Grande Silenzio is surprisingly little known but highly regarded amongst genre lovers (including me).  As in so many Italian Western, Ennio Morricone's score is a great asset, perfectly assessing and supporting the general mood.  This is easily one of the five finest Italian Western ever made, and I'd feel hard pressed to name more than 2 of the others.","user":"SMK-3","rank":[57,66]}]