[{"title":"Both uplifting and disheartening, sometimes both at once","rating":10,"date":"14 January 2005","review":"I went into this film with the knowledge that it had been the second film in history to win the 'top five' Oscars (for Best Picture, Best actor, Best actress, Best director and best screenplay) and has been praised as \"one of Jack Nicholson's finest roles\" and \"one of the classics of the 70's\". Naturally, after hearing all this, I had high expectations for One Flew over the Cuckoo's Nest. But nonetheless, I was surprised at how easily the film surpassed my expectations and easily led me to understand how it merited all that praise.<br><br>Based on the novel by Ken Kesey, the story follows Randle Patrick McMurphy (Jack Nicholson), who, in an attempt to get out of spending more time in prison, pleads insanity for his crime, and is therefore sentenced to time in a mental institution. This was McMurphy's intention, as he believes the conditions in a \"crazy house\" will be significantly easier to contend with than another harsh stay in prison. However, he quickly finds out that surviving the institution with it's desolate patients (including Christopher Lloyd, Danny DeVito, Vincent Schiavelli and an absolutely brilliant Brad Dourif as the stuttering Billy Bibbit) and the monstrously repressive Nurse Ratchet (Louise Fletcher, in a career defining role) is considerably harder than he imagined. McMurphy plays pranks, horseplay, and is generally defiant to the rules of the institution in an attempt to raise spirits. His constant optimism and reckless defiance to the out of date rules in the institution can be very uplifting, and often quite funny as well, but much of the movie can be very depressing - the generally decrepit state of the institution is a consistently (and intentionally) bleak background to a superb story with a truly bittersweet ending.<br><br>Jack Nicholson is at his best here, head and shoulders above other excellent performances such as in 'Chinatown' or 'As Good as it Gets'. McMurphy is an apparently unquenchable optimist, refusing to succumb to the defeated spirit of all the other patients. His livewire antics, inspiring the patients are generally uplifting, and when his indomitable spirit is finally broken, we really feel for him and his fellow patients. Nicholson conveys the essence of McMurphy to perfection, demonstrating his excellent understanding and interpretation of the character. When McMurphy announces that he is going to lift a huge stone fountain and hurl it through the window to escape, the other patients are so caught up in his intoxicating spirit of freedom that they honestly believe he can do it, despite the fact it would be impossible for a man much stronger than him. When McMurphy finally discovers that despite his best efforts, he cannot lift the fountain, he is so openly crushed that we can't help but feel for him. Beneath the frequent profanities and livewire antics, there are real human emotions, which come across as truly touching.<br><br>What can be said about One Flew over the Cuckoo's Nest which hasn't already been said? It has an excellent storyline, top notch acting, painfully bleak visuals, perfectly setting the tone for the movie, and alternates between being truly uplifting to devastatingly depressing. It features perhaps the most memorable film ending ever, next to a man on his horse riding off into the sunset, and leaves the viewer beaten down by the conflicting emotions, unaware what to think of the picture next to reveling in it's glorious entirety. It's hard to produce a final outcome any better than this.<br><br>-10/10","user":"pyrocitor","rank":[510,559]},{"title":"Touching and moving, a great cinematic experience","rating":10,"date":"3 July 2004","review":"Jack Nicholson is a great actor. No, not a great actor, a spectacular actor. This is a film from fairly early in his career, as well as it is for several other actors in this film, who later have had long, great careers too, including Danny DeVito, Christopher Lloyd and Brad Dourif. The film has some unforgettable moments... who could forget Louise Fletcher's icy stare, Jack Nicholson's smart-aleck remarks or Will Sampson's impressive, almost entirely silent performance? The film portrays the horrible truth about how patients were treated in mental institutions back then, and tells the story of someone who desperately wanted to break out, to rebel, to change things, for himself and for the others. I was compelled by this film, from the very first frame. I never took my eyes off it, and I will definitely be thinking about this film for a while. I thought it was great the way one of the very first frames depicted the institution as something far more similar to a prison than a hospital. Milos Forman did a great job of making that contrast very powerful to the viewer. The film is very moving and a truly beautiful cinematic experience. Every single actor gives a stellar performance, every single character is perfectly written, every single line, every single frame is absolutely perfect. I wouldn't change a thing in this film. It has a great pace, you never lose interest, but it never seems to be rushing to get through it, either. It's simply perfect. I have not read the original book, but if I ever come across it, I might check it out. I have only seen this film once, but I will definitely watch it many times in years to come. I recommend this amazing piece of great cinema to anyone who has at least a slight interest in the drama genre, or any fan of any of the actors, as they are all in their absolute prime in this film. 10/10","user":"TBJCSKCNRRQTreviews","rank":[359,413]},{"title":"A great order vs. chaos tale that everyone can relate to","rating":10,"date":"18 June 2005","review":"Based on the amazing novel by Ken Kesey, Randall Patrick McMurphy is an antisocial and dangerous man no different than a petty criminal, placed in a mental ward to have his behavior studied. He makes friends with lunatics and starts his own circle of admiration within the hospital, much to the dismay of Nurse Ratched, the central authority figure in the story and one of the greatest movie villains ever.<br><br>The movie exists to show not only how corrupt and poorly-constructed society's approach to the \"mentally unstable\" is, but it creates characters that we have all met in life and shows how the McMurphy-like figure that we all wish we had fights for freedom of choice and basic human rights. In addition to the movie's great spirit, the acting is fantastic. Jack Nicholson is at his best and Danny DeVito can be seen in his very first acting role ( which he absolutely triumphs in ). And of course, there's the unforgettable Chief Bromden. The directing by Milos Forman is very well-done, as the camera-work is excellent and follows the pace of the movie perfectly in how it is used. What really impressed me was the editing, especially as far as the use of audio goes: some parts just made me go \"...wow.\"<br><br>My only complaint is that I believe the movie could've been slightly more effective if it were based more closely on the novel at certain points, but the modified point of view of the film does make a great point; anyone who has ever hated their job, been accused of something, had some person so self-righteous and convinced of their own authority and dependency on order get in your way, or attended the American public school system at any point in their life should be able to identify with this movie.","user":"b1lskirnir","rank":[203,240]}]