[{"title":"Somewhat unpromising but effective mixing of WW2 spy fare with an intense romantic thriller works superbly","rating":22,"date":"22 February 2006","review":"Eye of the Needle is an oddly structured but nonetheless extremely effective film which in many ways is quite old fashioned in tone and feel,with the addition of a little 'modern'sex and violence. For almost the first half,the film is a fairly conventional but quite gripping spy thriller,as a German agent causes havoc in World War 2 England. There are few surprises,but Donald Sutherland is mesmerising to watch {even if his accent wavers} and the plot at least sounds almost plausible. The keen eyed,however,may spot mistakes in the period detail.<br><br>Then Sutherland is washed up on a Scottish island inhabited by a crippled man and his frustrated wife,and the film changes into an incredibly tense mixture of romance and thrills. Sutherland and Nelligan's affair may be basically sexual,but there is real chemistry between them and a real sense of desperation,of two lonely people throwing themselves together. The last half hour is real edge-of-the-seat stuff,perhaps almost bordering on psycho-thriller,but it really works.<br><br>Throughout the film Sutherland remains the villain and does do some nasty things,but it's a measure of his performance that occasionally we do come close to sympathising with him. Acting-wise though the film really belongs to Nelligan,a tragically underused and beautiful actress who has to go through the motions of loneliness and frustration,than lust,then fear,and eventually heroism,and does so superbly.<br><br>Aided tremendously by the last ever score from the legendary film composer Miklos Rozsa,who provides a moving love theme and some especially thrilling music for the last section of the film,Eye of the Needle perhaps shouldn't really work as well at it does,but that's a measure of it's quality.","user":"DrLenera","rank":[29,32]},{"title":"A Surprisingly Good Wartime Thriller","rating":7,"date":"23 May 1999","review":"This film about a German agent trying to escape from Britain might seem to offer limited scope for interest, but Sutherland's menacing performance and the events on the island turn it into something approaching a study in psychopathy, laden with uncertainty and fear. The vulnerability of Lucy (Kate Nelligan, a sensitive and intelligent but definitely pre-feminist woman helps to give the film an added poignancy. Sutherland's performance is such that we are always fascinated by the damaged and ruthless character he portrays. Those who dislike war films may find themselves surprised by this film.","user":"Paul-250","rank":[41,48]},{"title":"Tight, kinetic suspenser","rating":1,"date":"1 January 2005","review":"Donald Sutherland is superb as \"The Needle\", a Nazi spy pursued by the British government during World War II. Circumstances land him on Storm Island, a small, wind-swept patch of land off the English coast. There he falls in love with the sensual Kate Nelligan, the unhappy, lonely wife of a crippled war vet.<br><br>The late Richard Marquand's second feature film is a gripping, suspenseful wartime drama about doomed love. The blazing glow of this film is enhanced by sizzling yet subtle scenes of lovemaking and a stunning Miklos Rosza score.<br><br>The island vistas are breathtaking and Alan Hulme's pictures are rich and moody.","user":"fertilecelluloid","rank":[38,45]}]