[{"title":"Many good ideas, entertaining results","rating":10,"date":"10 May 2001","review":"Larry Cohen has not been known for coherence in his pictures. As a writer, he is often excellent with creative twists and turns for every story. As a director, he is often sloppy and mostly leaves you disappointed, thinking that a great opportunity has been lost. In his movies major characters disappear without explaination and whole chunks of plot often seem to be missing. All the while you are thinking \"what a shame on such a good story!\". To my surprise, I found that \"Ambulance\" actually is held together quite neatly. No chop-chop editing this time. The plot runs amok here and there, but not damagingly so. It is amusing and suspenseful with spunky performances by Gallagher and Roberts and a really good one by Red Buttons. Some effort have been put into the action sequences and interiors. This movie, unlike many other Cohen-directed, actually looks like it had a budget. The pace never flags and even if the ending is no great shakes, it's satisfying. Nice score too.","user":"jangu","rank":[30,31]},{"title":"\"Where have I seen this face before\".","rating":7,"date":"22 January 2011","review":"I hadn't seen \"The Ambulance\" for quite awhile, but I had a good time re-visiting it and this was one of the first works I had seen of filmmaker Larry Cohen. It might not be one of Cohen's highly regarded pieces, but \"The Ambulance\" is a fun, gripping slice of paranoia with an injection of black humour. The concept is audaciously ludicrous and Eric Roberts' ham-fisted lead performance is full of energy (and lets not forget that hypnotic mullet when in motion), along with James Earl Jones small, but cynically meaty role as a rundown detective on the edge. Moving at a fast, uniformed tempo, Cohen's boldly tight direction never lets up (where he knows how to shoot on location for maximum effect) and his writing manages to stay one step ahead as you get pulled along for the dangerous ride with its engineered thrills. There always seems to be some sort of threat at every turn for Robert's character and this keeps it excitingly intense, if daftly over-the-top with comedic results. Especially its cheesy climax in a night club with some berserk ambulance driving and of course its irony-laced revelation that you won't see coming. Roberts' character sure didn't. The plot takes on a modern approach to its mad doctor formula, staying quite dark and full of mystery in the chase/or race to uncover the truth while also trying to convince people of the threat. Roberts' plays Josh Baker a comic book artist who one day goes about asking out the women of his dreams (a stunning Janine Turner) who he sees everyday out on the streets of New York. An incident sees her collapsing with Josh by her side and then a mysterious vintage ambulance appears and whisks her off. So he goes to one hospital after another with no such luck. He thinks there might just be more to it, as he uncovers and now he's running for his life with no one believing him there's a phantom ambulance kidnapping people. Eric Braeden is suitably clinical as \"the doctor\" that's behind the kidnappings and Megan Gallagher offers good support as a police officer we can trust. Red Buttons is enjoyably snappy and Cohen regular James Dixon shows up too.","user":"lost-in-limbo","rank":[9,9]},{"title":"Ambulance chaser","rating":8,"date":"8 May 2007","review":"\"The ambulance\" is perhaps not what people call a great movie.But it's sure much fun to watch!Its black humor is priceless.All the male actors overplay,Eric Roberts ,James Earl Jones and Eric Braeden camp it up and give the viewer the feeling of watching a cartoon (Roberts' escape from the ambulance) or reading a comic strip :anyway ,Roberts makes comic books (\"They are not what they used to be \"says cop Jones ).The director knows only one tempo:accelerated and ,for lack of subtlety ,there's never a dull moment.And the villain (Braeden) does believe he works for the greater good of humanity !And anyway won't his patient be in perfect health when he dies?","user":"dbdumonteil","rank":[11,12]}]