[{"title":"Gilbert and Sullivan still have a strong and legitimate appeal","rating":8,"date":"16 January 2005","review":"History records that Gilbert and Sullivan were personally often at odds when producing their great comic operettas - no doubt that, if they are still monitoring this, they are surprised to find both their humour and their music - despite its limitations in both time and location - still has a great appeal to audiences throughout much of the world. The music of course is timeless, but music too evolves and many people today have no appreciation of the types of lyrics which G &amp; S exploited so shamelessly. Perhaps the remarkable thing is the wide and continuing appeal of so many of their works. This film is a movie version of a 100th anniversary Broadway stage production of this operetta in New York. A review of previous comments show, not unexpectedly, that it has been adored by numerous G. &amp; S. fans; but that its appeal to those who are not in this category is much more limited. They also make it clear that this is a very fine production; and it would be a serious omission if I did not re-emphasise it is almost a classical example of the way in which a major stage production should be presented on film, both to retain the best of the original production and to as fully as possible exploit the more fluid form of presentation that is possible on the screen.<br><br>To your reviewer who reports fears about wearing out her taped version, I would recommend doing what I have done and converting this to a VCD disk that she can play, almost for ever, on her DVD player. It is, I believe, a great film; and my wife and I have also viewed it repeatedly whenever we have been a little \"blue\", we never fail to feel cheered up afterwards. However we recognise that most members of the contemporary generation would not respond in this way, and that our appreciation will not even be understood by them. We remain thankful that minority tastes can still be satisfied without infringing on the perogatives of the majority, and that in the process of doing so the film will be seen by many who initially have little sympathy with the production, but who find that - as with so many of us in the older generation - they have come to appreciate both its music and its humour.","user":"bbhlthph","rank":[19,19]},{"title":"An absolute gem!!","rating":3,"date":"3 July 2000","review":"I am a true G &amp; S Aficionado but this surprised and delighted me.  The cast are brilliant but Kevin Kline has the edge.  Agile, in great voice, lots of humour and quick, funny bits in his performance (blink and you miss them). His dancing and acrobatics are superb.  The police also had me howling with laughter along with their police dogs and the major general romping through the fields with the pirates singing UNDERWATER  in the babbling brook has to be a classic.  This scene has to be seen to be believed.  Bravo, cast !! This should have had a lot more publicity.  I would adore seeing it in the large theatre, at least we had \"Topsy Turvy\" this year. This Pirate is fun for all ages.","user":"wisewebwoman","rank":[17,17]},{"title":"Worthy staging of G&S's best operetta","rating":11,"date":"11 January 2004","review":"I recently had the task, for a organization's class, to assemble various performances of the Gilbert &amp; Sullivan operetta \"The Pirates of Penzance\". This has always been my favorite G&amp;S work, and I have heard many live performances, plus I have played the Pirate King in a revue type staging of the work. <br><br>I recall seeing the Kevin Kline version many years ago, and did not recall the details. Obtaining a copy to view for my project, I was very impressed with the wit and overall quality of the performances. There are a few small issues, such as the fudging of Linda Ronstadt's and Rex Smith's vocal parts (It is clear, whenever Smith sings, that lots of electronic enhancement is being used to bring his voice into the same universe with the other more capable singers, but still he has right delivery and it works well; for Ronstadt, she does very well, but for \"Poor Wandering One\" her part has been transposed down a bit, probably so that she can manage the highest notes), and the overdubbing of a couple other performer's singing by better singers, but overall the dancing and singing is as good as any I have seen.<br><br>The staging is deliberately campy, somewhere between traditional stagecraft and a movie set, and it adds extra charm to the proceedings. There has been some carping about Angela Lansbury's singing, but what she does is in line with the requirements of the role, and is in fact typical of other performances of Ruth's character (I recall the director, during casting of the performance I was in, saying of Ruth, \"we don't need a GOOD singer, only a FUNNY singer).<br><br>A quick review of the offerings of Pirates on Amazon reveals that the only DVD version of this cast is taken from an outdoor staging in New York (and without Lansbury). It is one of the mysteries of DVD releases that the film version does not exist on on DVD; it certainly one of the best.","user":"backseat-2","rank":[22,23]}]