[{"title":"The God of the Mountain in his third at-bat","rating":6,"date":"7 May 2007","review":"Not the second, but actually the THIRD movie in the series. This is an exciting and tense study of courage and self-sacrifice as four little boys embark on a long and forbidding voyage over Majin's Mountain to find the missing men from their village and rescue them from an evil and brutal samurai overlord with dreams of conquest. There's no way in heaven or earth that this movie would have been made the same if it was done by Hollywood - it's much too brutal and realistic in showing the fates of various sympathetic characters. Of course, you still get to see Majin awaken from his slumber and bring death and destruction to those who desecrate his mountain or persecute his people. Another beautiful print, with the same excellent cinematography, acting and miniatures as the other two Majin movies with the bonus of yet another Akira Ifukube score. Just pop that corn, plop down on the couch, and have fun watching Majin stomp evildoers.","user":"El_Rey_De_Movies","rank":[4,5]},{"title":"Daimajin of the lake saves the day.","rating":30,"date":"30 August 1999","review":"The sleeping Daimajin has moved to an island home and the people under his protection live happily at lakeside.  When evil warlords decide its time to subjugate these peaceful neighboring domains they go right for their leaders with some sneaky assassins and a surprise attack.  As a demoralizing move they blow up the stone god in his island home.  What a bad move that turns out to be.  Not the best of the three Daimajins.  It's much less beautifully filmed and the story isn't so great.  I liked \"Return of Daimajin\" best because the kids are cute and the cinematographer had the eye of a naturalist.","user":"junguur","rank":[5,11]},{"title":"Daimajin fights in the snow","rating":4,"date":"28 April 2011","review":"This is the third and the final installment of Daimajin trilogy. The three stories are not connected in their plots.<br><br>Daimajin is a 50ft tall stone talisman with a spirit of deity residing within. It turns mobile when the innocent people are oppressed to battle evil.<br><br>Four kids embark on a journey to rescue their father who is enslaved by an evil warlord in a place called Hell's Valley. On their way they pass the mountain where Daimajin resides. Daimajin sends a hawk to accompany the kids and to protect them, but when things goes badly for the kids, Daimajin turns his fierce face to the evil warlord.<br><br>The four kids are unusually resourceful, and gets around where even adults would find it a challenging situation, surviving in mountainous wilderness, and in a snow storm. <br><br>Daimajin awakes this time in a snow storm, and rest is a bad day for the evil warlord and his soldiers.<br><br>The production isn't as good as the previous Daimajin movie as the movie relies heavily on the acting ability of the four very young actors. They put in a surprisingly good performance, but they're no Jody Foster in \"Taxi Driver\". The caliber of other actors aren't as high as well. Special effects are just as good, and it's one of the best '60s suitmation movie. It's better in my opinion than the Gamera series done by the same studio around the same time. Not a masterpiece in any way, but a movie that still holds its own after nearly half a century.<br><br>Recent TV mini-series \"Daimajin Kanon\" is a direct homage to this series with Daimajin being done in CG instead of suitmation.","user":"ebiros2","rank":[4,9]}]