[{"title":"\" Maybe It IS Hell ... \"","rating":24,"date":"24 November 1999","review":"It is 1964 and the Cold War is raging.  If the US military's Strategic Command spots any unidentified object in the skies, American nuclear bombers are ordered to a series of 'Fail-Safe' points.  Unless they receive the stand-down command, the aircraft will head for target cities in the Soviet Union.  Once beyond the Fail-Safe Point, and locked onto their targets, the bombers cannot be recalled.  Crews are trained to disregard all signals, whether they be commands or entreaties, and continue on their mission. After all, any plea to turn back may be soviet subterfuge.  This perverse logic of nuclear warfare, as one pilot puts it, \"eliminates the personal factor\".<br><br>The film conjectures what might happen if the system buckles.  Suppose a technical mishap allows a bomber group to stray beyond Fail-Safe.  Would the soviets accept the anguished apologies of an American president?  Or would they regard it as a treacherous trick?  Should human beings place everything they hold dear at the mercy of electronic systems?  What if the rationale of nuclear strategy parts company with human logic?<br><br>Made less than two years after the Cuba Missile Crisis, \"Fail-Safe\" is clearly very heavily affected by that trauma and what it revealed to us all. We see a decent American President in the bizarre context of a nuclear showdown.  Cut off from the society he knows and understands, the president is locked deep in some claustrophobic bunker, his only real human contact being the 'enemy' soviet premier.  The American is wise and morally sound, and equal to the emergency.  His Russian counterpart is emotional and unpredictable, but rises above his indoctrination to attain real dignity when the chips are down.  Another of the Cold War insanities is played out - these two foes will spend the last hours of life on Planet Earth locked together psychologically, far from their loved ones.<br><br>Henry Fonda is first-class as the president.  He brings authority and dignity to the part, exuding Ivy League self-assurance.  Larry Hagman plays Buck, the translator from Russian into English, who spends the crisis in the bunker at the president's side.  A moment's thought would convince any intelligent viewer that huge liberties are being taken with the truth.  In reality, the president would have a team of advisers around him throughout (as indeed Kennedy did during October 1962).  There would be phalanxes of interpreters listening in, to insure against even the tiniest mistranslation, and whole companies of psychologists to gauge every nuance of the Russian leader's mood.  However, for clarity and dramatic power, the film has the president relying solely on the nervous young Buck. Simultaneous translation is a good dramatic device, because it avoids the distraction of subtitles or the absurdity of a Russian leader speaking fluent English.<br><br>Walter Matthau, against type, plays a heartless nuclear expert. Professor Groeteschieler advises the Pentagon top brass on nuclear strategy. He is a ruthless cynic who represents the Barry Goldwater end of the spectrum, and Matthau acts the part consummately well.<br><br>Sidney Lumet is one of the great directors, and his stylistic signature is apparent all through this fine film.  From the very start, our peace of mind is stripped from us.  We see a bull dying in the bullring, and the film's title is flashed up almost subliminally.  These broken, discordant images  place us immediately in a world of troubled dreams where no comfort is to be had.  The American pilots look more like robots than men, in their heavy facemasks which amplify their breathing - or is it fear which creates that rasping edge to their inhalations?  When the order to proceed beyond Fail-Safe flashes up in the cockpit, the pilots look at it in motionless silence, their very stillness conveying the tragedy in all its emotional power.<br><br>In \"Twelve Angry Men\" Lumet cast Henry Fonda as the voice of America's liberal conscience beset by the darker forces of the human psyche.  Part at least of that film's artistic success is attributable to Lumet's skilful use of lenses in order to flatten the image and intensify the claustrophobia of the jury room.  Here, the director employs similar visual techniques to heighten the dramatic experience.   With his director of photography, Gerald Hirschfield, he employs chiaroscuro lighting and extreme close-up to amplify the tension of the final minutes, and even shoots Fonda through a fish-eye lens to impart a sense of psychological dislocation.<br><br>By a process that is itself logical, nuclear confrontation brings us to insane conclusions.  Once both sides comprehend what is happening, they co-operate fully, sharing military secrets, as the humans unite against their mortal enemy, The Bomb.  General Bogan (Frank Overton), America's Cold Warrior, is distraught when the Russian missiles fail to destroy American aircraft.  Finally, we have the absurdity of an American bomber circling over New York, preparing to destroy five million American lives at the president's command.  Life must go on, so plans are drawn up to rescue not people, but the commercial records of American companies from the debris of the metropolis.<br><br>Colonel Black (Dan O'Herlihy) is the keeper of the liberal flame.  By a cruel irony, he becomes Death itself, and his tragedy is the tragedy of progressive thought.  The 'hotline', established post-Cuba, is used very effectively in this film.  Shot in exaggerated perspective, the phoneset dwarfs the president, symbolising the way in which the technological behemoth has swamped human decency.  In a grimly powerful coup de cinema, the president hears his ambassador's phone melting and knows that the worst has happened.  \"No human being did wrong,\" says the Russian premier, as disaster darkens the earth.  The American leader counters with, \"We let our machines get out of hand.\"  And there, in a nutshell, is the moral of the film.","user":"stryker-5","rank":[120,136]},{"title":"Despite its limitations, A Thought-provoking Cold War drama","rating":10,"date":"28 November 2005","review":"I mentioned in another comment about a series of movies made during the mid-1960's, that I call 'political noir'.<br><br>These films are easy to spot, in that there were made in B&amp;W, dealt with a American institutional crisis and seemed to always feature Henry Fonda somewhere in the cast.<br><br>On all three counts, this film fits that criteria.<br><br>Because this film came out around the time of \"Dr Strangelove\", it was somewhat overshadowed, and because of the nearly identical plots, there was even talk of plagiarism, even though this film was based on a novel by two Washington-based journalists with a remarkable insight of the workings of government and was directed by Sidney Lument, one of the cinema's great directors.<br><br>Also, unlike \"Dr Strangelove\", which seemed to receive major studio backing, money and the freedom offered by being produced in Great Britain where this satire was more appreciated, \"Fail-Safe\" was independently produced in New York on a limited budget, without official backing by the Defense Department, which explains all of the flaws complained of by many viewers and posters on this site.<br><br>Yet in spite of these limitations, Lument pulls off a major coup by presenting us with an authentic piece of Armeggeddon.<br><br>In a real-time view, we watch as a million-to-one technical fault 'orders' a wing of American bombers to attack Soviet Russia, and the Defense Department and the President are helpless in trying to stop it.<br><br>We are also witness to how our military operates, trying to plan military policy, and debating theory and possible results.<br><br>Such things are sensible and harmless as far as these things go, until 'the day comes' when reality displaces theory.<br><br>Walter Matthau, who is more well-known for his comic talents (\"The Odd Couple\", \"Grumpy Old Men\"), than being an accomplished dramatic actor, is shown at the height of his powers as Prof. Groteschelle; a defense policy wonk, whose obsession with defense preparedness and Marxist theory reaches the point of detachment from human emotion, as he blindly recommends that no action be taken and the bombers be allowed to complete their mission, resulting in 'final victory' over Communism.<br><br>This is in direct contradiction to General Black, a compassionate Air Force officer who is also an intellectual, who desperately urges that every means be made to stop the bombers before it is too late.<br><br>However, it turns out to be too late, at least on the American side.<br><br>We watch how technology becomes a hindrance, as much as the distrust between the two superpowers seems to be, as the President and the Soviet Premier desperately try to seek a solution to this disaster.<br><br>The tragedy about this is that someone thought they should remake this in 2000, which in a way is flattering but certainly could not come close to the original work.<br><br>But, this only proves that the subject of 'accidental war' is still a concern.<br><br>However, how can one do better than Henry Fonda ???","user":"pizzawarrior1956-1","rank":[63,71]},{"title":"How do you show your good will when your own bombers are about to mistakenly nuke Moscow?","rating":10,"date":"17 February 2000","review":"That's the biggest moral dilemma this movie puts in front of its characters. It falls to the President (ably played by Henry Fonda) to make the agonizing decision of how to handle the situation without causing a global thermonuclear war.<br><br>From the Soviet point of view, here's what happens.  The hot line in Moscow rings.  The premier picks it up to hear the American president explaining that three unstoppable bombers are on their way to obliterate Moscow.  Oh, but it was an accident.  We didn't mean to send them out, sorry.  And we can't call them back, because they're beyond their fail safe position (and thus are trained to maintain complete radio silence and ignore any communication they may receive), and we can't shoot them down because they're way out of our range.  Sorry.  Our bad.<br><br>The pacing of the movie moves from a calm, cool tone while various media figures are shown around the facility in charge of all the bombers.  Then it picks up a tiny bit as the facility detects a bogie over Hudson Bay.  And this is where the situation begins that eventually leads to the erroneous deployment of a nuclear strike against the Soviet Union.  Although it seems small at the time, this is the metaphorical horseshoe nail that loses the kingdom.  (\"For want of a nail....\")  From this point, the movie steadily increases the suspence as progressively more drastic measures are taken in the effort to stop these bombers, with the situation growing more desperate by the moment.  I started out firmly positioned on my seat, but by the end I had moved further and further forward towards the edge of my seat until eventually I couldn't even sit still.  Too much suspense.<br><br>There are quite a lot of technical errors in the film (for instance, due to the Air Force refusing to assist in the film, they had to resort to a fairly limited set of stock footage for the shots of aircraft, which are thus extremely inaccurate) but it remains a good movie.  If you can ignore the errors in set design and stock footage and concentrate instead on the dialog (which is where the action is anyway), watching people rise to the challenge or snap under the pressure, this is a movie you will never, ever forget.","user":"Calli-2","rank":[67,77]}]