[{"title":"Scorsese's Overlooked Masterpiece","rating":9,"date":"15 September 2003","review":"*SPOILER ALERT*<br><br>This small and oft-overlooked offering from Martin Scorsese (his 4th feature) ranks among his best and most interesting for a number of reasons  it's one of the only Scorsese films with a woman as the protagonist, and  in typical Scorsese fashion she's tough, if a bit conflicted (like most of his male protagonists)  and real, in other words. ALICE...also provides a another great glimpse of his very original style as it was developing  the continuum between MEAN STREETS, this film, and TAXI DRIVER in look, mood and performance is perfect, as the post new-wave grit and furious energy of MEAN STREETS is a bit more focused here. <br><br>Overall, ALICE... is a more subdued character study which  like life - swings from gripping to scary to funny to touching in the blink of an eye. Also notable as one of Scorsese's handful of non-New York stories (like LAST TEMPTATION, CASINO and KUNDUN), ALICE... follows Alice Hyatt (Ellen Burstyn, fresh out of THE EXORCIST and at her peak)  a California native, living in New Mexico with her truck driver husband. Suddenly widowed, Alice decides that she and Joey are going to take off, on what little cash they have left, for California, so she can pursue her long-dormant dream of becoming a singer. They make it as far as Arizona before Alice runs out of cash and has to stop to find work. After initially landing in Phoenix  Alice ends up living in a rent-by-the-week motel in Tuscon, working at Mel's, a trashy diner run by its' amusingly belligerent namesake Mel (Vic Tayback), and staffed by the wild-but-wise Flo (Diane Ladd, in another amazing performance) and psychologically unstable Vera (Valerie Curtin). Before long Alice begins to put down roots, and she takes up with David (Kris Kristofferson), a local rancher. <br><br>The lone potential flaw is the ending, which feels like a compromise - if after discovering her confidence and independence, Alice feels like she oughta ride off into the sunset of Monterrey, she also wants companionship, and has allowed this desire to lead her into questionable choices in men (witness one of Harvey Keitel's most unforgettable performances) because of it. So, if a somewhat conflicted ideology lingers through a film where tough mindedness and harsh reality (interrupted by the occasional bit of lifelike, randomlike humor) gives way to romance, then perhaps it simply is indicative of how cerebral ideologies sometimes will  or should  crumble in the face of human emotions and desires. <br><br>In any case this thoughtful tension at the heart of this beautifully acted, beautifully filmed tour-de-force gives ALICE... a rich, earthy energy that places it among the most thoughtful and multifaceted films (like TAXI DRIVER, RAGING BULL and also the underrated KUNDUN) that Scorsese has ever made.","user":"davidals","rank":[50,54]},{"title":"A movie of many memorable characters.","rating":9,"date":"12 September 2002","review":"This has to be one of Martin Scorses's most enjoyable films. The film follows Alice (Ellen Burstyn) on a journey back to happier times after a tragedy forces her to make important decisions about her life. Needing a job to raise cash for this journey takes her and her son (the remarkably cheeky Alfred Lutter) on a journey of self discovery. Having a small talent for singing she eventually secures a job as a singer in a bar but flees town after meeting psychopathic Harvey Keitel. Eventually working as a waitress in Mel's Diner she becomes involved with the strangely uncharismatic Kris Kristofferson and realises she has finally met someone who really cares for her. The performances make this a remarkable film, Burstyn &amp; Lutter are a great double act as mother and son, Harvey Keitel frighteningly plausible as a mentally unbalanced suitor and Jodie Foster sexually ambiguous as Lutters playmate. Diane Ladd excels as hard-bitten fellow waitress Flo and Jane Curtin and Billy Green Bush make an impact with barely half a dozen lines between them. Add to this a terrific musical score and inspiring cinematography and you have a timeless classic that is just crying out for a DVD release.","user":"Greensleeves","rank":[39,42]},{"title":"Priceless","rating":9,"date":"20 March 2004","review":"People forget that \"ALICE DOESN'T LIVE HERE ANYMORE\" is a Scorsese film. Look at it again and you'll see it is one hundred percent Scorsese. Totally focused on a female character. I read somewhere that Ellen Burstyn asked Scorsese \"How well do you know women\" and Scorsese replayed \"Not well at all, but I'm willing to learn\" The portrait of Alice adds something to film female characters that had never been present on the screen before. All those Joan Crawford fighting working class women seem like a joke compared to Ellen Burstyn's Alice. Jodie Foster steps into the screen with a funny, touching BANG. If you've never seen this film, hurry up! If you've seen it, see it again.","user":"marcosaguado","rank":[101,115]}]