[{"title":"A beautiful movie about the passage into middle age.","rating":5,"date":"5 October 2003","review":"I loved this film. It's not really for kids. To appreciate it fully I think you have to be older. It's about the last moment of youth on the edge of the passage into middle age. It's about getting a sense of who you and the people around you really are.<br><br>Romy Schneider is beautiful and seems to incarnate this quiet but strong woman. In a way this is a woman's picture. It concentrates mainly on the women. The men are weaker, on the whole, but not in the programmatic way of bad \"feminist\" films. In one scene the women are cooking together, getting into a serious argument, then somebody spills something and they suddenly unite in cleaning it up. That might be an emblem of the movie. Tough things happen, but life goes on.<br><br>One of the remarkable qualities of this film is the thick sense of reality it gives--of a world of co-workers and friends which you never fully encompass. You're seeing a slice of life, and you feel there's much more life extending out in all directions.<br><br>The direction is subtle, understated but beautiful compositions and a lovely way of starting with a shot and then moving to another without a cut. Many frames are filled with people, and a sense, again, of thick life surrounding this story. Either I missed it when it came out, or didn't get it and forgot, but this time it was a revelation to me.","user":"eyeseehot","rank":[28,30]},{"title":"Too Simple?","rating":7,"date":"21 October 1999","review":"Most French movies, and especially Claude Sautet's are very realistic, slow-paced, intelligent and \"simple\". Each one I have seen had great moments, as everyone encounters great moments in life. This may be too ordinary and plain. Though not boring at any time, at the end I could not think of any memorable scene, shot or dialogue, and thought it was missing something, although the title does suggest they didn't have much planned for the beautiful heroine. A story you may have had, heard, thought about- in French, on screen.","user":"Jonathan-18","rank":[11,17]},{"title":"Until death","rating":10,"date":"22 April 2007","review":"There is no doubt about Claude Sautet : He was a deep analyzer of souls...Having collaborated with this script - It goes without saying - he was like a surgeon grasping a medical knife and dissected the souls of all his characters. He tried to reveal what went \"inside\" his characters until saturation point in which there is not anything else to reveal... The highest point of this history is the deep demonstration of friendship that links Marie (Romy Schneider) and Jerôme (Roger Pigaut) who has to be dismissed of an enterprise due a re-structure in order that it becomes \"modern\". The film approaches a social aspect that says respect to us even so has been carried through in 1978: the summary cut of employees that are no \"more incoming-producing\". As if human being were objects that only exist to produce profits and not been born for the accomplishment of his aspirations! The spotless direction of Claude provided to Romy a César ( the \"Oscar\" of french cinema) who made frequent closes in order to caught the limpid look of the actress, as that if Marie wanted to analyze, however her interlocutor, however people who surrounds her, however definitive occasions in which are congregated all her friends... As if it treats - as indicates the heading of the film (A Simple History) I abstain to count it, only suggesting that everybody must see the film. In scale of 1 to 10, I vote: 10 (a masterpiece).","user":"shatguintruo","rank":[7,10]}]