[{"title":"Let's eat...","rating":6,"date":"22 June 2003","review":"(aka: EATEN ALIVE)<br><br>This is the second of three cannibal films directed by Lenzi (filmed in Sir Lanka) with CANNIBAL FEROX (1981) being the third.  To be honest with you, I saw both of these films one right after the other and I can truly say that they are both about the same.  One isn't any more gross or gory than the other, imo.<br><br>Film starts in Niagara Falls where a policeman is killed by an asian fellow blowing poison darts.  Then the movie cuts to NYC where the same guy kills two more people using poison darts before he is run over by a truck and killed.  It's all a part of an ecological cult that Janet Agren is investigating in regards to the disappearance of her sister.<br><br>Her search takes her to 'New Guinea' where she hires a Viet-Nam deserter (porn star R. Bolla) to guide her to the village where her sister was last seen.  On the way there, we get to watch snakes eating animals, natives gutting and skinning crocodiles and our two heroes being chased by cannibals.<br><br>They finally reach the village and meet the cult leader (Ivan Rassimov) who has absolute control over everybody.  He's an obvious copy of Jim Jones.<br><br>Gross food scenes include:<br><br>Cannibals eating native girl's arm and left breast.  Not bad...<br><br>Then we see three native guys screw another native girl in a ritualistic soft-porn scene.  One goes down on top of her, right after the other.<br><br>Janet Agren, naked, covered in gold paint getting a snake blood covered dildo inserted into her.  It doesn't actually show it, but it's implied by the pain shown on her face.<br><br>A native guy who has betrayed the cult, getting his dick cut off before he is gored to death with a stick.  Cool  !!<br><br>Another native girl and Algren's sister being eaten by cannibals after they escape from Rassimov's camp.  They are first disemboweled and then their organs are eaten before they are hacked and gored to death with spears. You know it's all fake because the bodies look like full-size rubber latex mannequins.  It's still a cool scene, anyway.<br><br>The Shriek DVD is taken from an excellent wide-screen print with a few film extras such as an interviews with Lenzi, Bolla and Rassimov.  Lenzi says that his next film, CANNIBAL FEROX did better at the box office, but he equates both of these films as being of the same quality.  So do I.<br><br>\nIn these politically-correct times, films like these wouldn't get made today.  It get's a 6 out of 10 for being interesting and un-PC misogynistic at the same time.","user":"macabro357","rank":[24,30]},{"title":"the most unintentionally hilarious of the genre","rating":5,"date":"18 March 2009","review":"This is not so much a film as it is a clip-show \"best of\" reel with about 60 minutes of original footage to fill in the gaps. Most of this film was shot in Sri Lanka with a few (quite obvious) sections shot in southern Italy and a few completely gratuitous New York scenes thrown in to try to pass the film off as American. Mel Ferrer makes a completely pointless cameo appearance as a professor who gets to interact with two porn actors playing cops (the poor guy!).<br><br>Lenzi is usually a great director, but he clearly was not on his A-game with this Cannibal turkey. Not one scene goes by without something completely laughable happening. I'll give you a few examples.<br><br>A) one scene showing Mel Ferrer entering a police station features his voice dubbed by another actor! Ferrer then can be heard with his actual voice moments later! B) Ferrer's audio is quite obviously recorded practically, while the other actors in the scene with him are dubbed. Jarringly obvious shift in quality.<br><br>C) shamelessly over-acting police-man saying \"WHAT?\".<br><br>D) a scene where a Sri Lankan (well this movie takes place in New Guinea though these people don't look it at all) allows an alligator to effortlessly chomp his dangling arm off. This scene gets double the embarrassment for actually being culled from another movie! E) when the actors \"interact\" with the Animal cruelty scenes, it's all just close-ups of them reacting intercut with shots from a different film with different filmstock.<br><br>F) When Kerman throws a spear at a native (haphazardly), it clumsily falls sideways into the dirt. The next shot shows a screaming native with a spear sticking out of his chest! G) One of the Sri Lankan helicopter pilots (who is dubbed, even) blows his line and they left it in! H) Kerman nonchalantly knocks Agren out with a punch so she doesn't see a gory evisceration.<br><br>I) whopping continuity error involving a character's body parts magically reattaching after they were eaten.<br><br>J) said scene includes a woman missing her right leg, with a native seen nearby eating a leg... but with a LEFT foot attached to it! Seriously! The list goes on and on. This film is so riotously daft, yet oddly competent in its staging and cinematography, that it's totally unique in the annals of film. The only other film coming close to the lunacy of this is Lenzi's NIGHTMARE CITY which was far more respectable.<br><br>This film, at least, is never boring and very accessible to those unfamiliar with bad Italian cinema. Personally I find it funnier than most intentional comedies, which is why it gets such a high rating from me. Whether Lenzi had this in mind or was seriously trying to make a good film is anyone's guess.","user":"Aylmer","rank":[9,10]},{"title":"A passable film for the cannibal connoisseur","rating":7,"date":"8 July 2000","review":"The film begins in Canada and New York, with an Asian hitman killing his victims by blowing poisoned darts at them. He is then run over by a truck and killed. The police find some film on him, and wouldn't you know, the film contains scenes of a cannibal ritual, which includes a woman named Sheila's(Janet Agren) missing sister. A professor tells Sheila that the ritual is from a tribe in New Guinea, so she travels there and finds Vietnam war veteran Mark Butler (cannibal film regular Robert Kerman) and pays him to find her sister. <br><br>The film then goes off into the usual cannibal film thing. The odd animal is killed, they find parts of bodies etc. It turns out that her missing sister is part of a religious community in the jungle lead by a character named Jonas. He brainwashes all his followers, and has strict rules, like no drinking of alcohol. The version I watched was sadly cut, and some gory scenes that were about to be shown then quickly jumped to another scene. The music deserves mention too, a catchy tune plays during the opening credits. The other music during the film is ok. It's not nearly as good as Cannibal Holocaust, or even Lenzi's other cannibal flick Ferox, but if you like cannibal films it's worth checking out.","user":"Afracious","rank":[12,15]}]