[{"title":"The rare charisma of Jean-Paul Belmondo","rating":10,"date":"19 December 2003","review":"This has to be, without a doubt, one of Jean-Paul Belmondo's finest hours on screen.<br><br>I can only guess that \"Le Professionnel\" is the kind of movie that helped inspire future action-directors like Luc Besson, the way it mixes raw violence with quirky charm and last but not least: some memorable, often cartoonish characters: Robert Hossein is creepy as hell as police captain Rosen, and Belmondo ignites the screen with charm and charisma, so much that the scene with the helicopter will just tear your heart out.<br><br>This French little gem has thrills, action and even a few laughs, it includes such showstoppers as a car-chase in front of the Eiffel Tower (!) and even a wild west style duel in broad daylight on the streets of Paris. To top it all of the soundtrack includes one of Ennio Morricone's most famous movie themes!<br><br>In short: highly recommended for fans of European action movies.","user":"Renaldo Matlin","rank":[62,68]},{"title":"Joss Beaumont : spying and clouts","rating":10,"date":"28 August 2005","review":"This is one of the best french action movie made in the 80's. This has nothing to do with a today's block buster from Hollywood, but the famous cues from Michel Audiard and the \"Chi Mai\" music from Ennio Morricone participate in creating an atmosphere that will keep you under suspense till the deadly end. There are some scenes that appear to be very old now (the one with the computer is quite comic today) and some others that you will remember for the text. To conclude : a tremendous script, Audiard's cues, Morricones's music, some handmade fights and a spectacular cars'pursuit in the most famous streets of Paris. And you still doesn't want to see this film ?","user":"wzzxo","rank":[41,47]},{"title":"Wonderful movie. You never get tired of watching it.","rating":10,"date":"4 March 2006","review":"For me this is the best work of Bel Mondo. The story its just perfect, Joss (main character) uses the orders that the service gave to him to kill president N'jala even after he became friend to to his government. They betrayed him and left him to die in prison. The character of commissaire Rosen it's a perfect one. I have seen this movie maybe 20 times and every time I find something new. The speech in the end between the minister and capitaine Valeras it's my preferite moment: Is this call under surveillance? Of course Mr. Minister. The duel between Rosen and Joss in the best picture of Paris I have ever seen is also great. But the truth is every moment and every word is perfect. You don't have to miss this movie.","user":"tmanushi","rank":[31,37]}]