[{"title":"Nice Timecapsule to the late '70s","rating":9,"date":"22 May 2002","review":"This is about the only \"disco\" movie that I have ever liked.  To me, it really captures the time &amp; spirit of the late '70s disco craze.  Everyone from Debra Winger and her co-worker looking for guys that don't wear polyester, to the great music of the Commodores and Donna Summer make this a nice slice of '70s nostalgia.  Everything '70s is represented in this movie: 8-tracks, platform shoes, bell-bottom pants, leisure suits, I think there is even a Ford Pinto in the parking lot of the disco.  I feel that this movie never got the recognition that it deserved.  It seemed to be drowned out by \"Saturday Night Fever\" and \"Can't Stop The Music\".  If you are looking for a movie that will bring back the feeling of the '70s, this one is a great choice.","user":"dgordon-1","rank":[38,41]},{"title":"Still a great movie","rating":9,"date":"9 June 2001","review":"OK, true, it's dated, and shows its age, and this movie is far from a classic.  What the hell?, see it anyway!!.   This movie took place at a long gone disco in Los Angeles (Osco's), a favorite hangout of mine back when I lived in L.A.   Even though the story is a bit far-fetched, its the DANCING, and MUSIC that brings this movie alive.<br><br>This is a fun movie, about a fun almost hedonistic period (remember, this was pre AIDS), when pretty much life was about just having a good time.<br><br>\nThe one thing I remember most about the disco period is this: There seemed to be very few lines that divided, the rich, poor, black, white, latin..you name it... we all went to the same clubs, and listened to the same music. This is something you'll see represented in this movie, this cast was about a group of people that in todays society, would hardly be seen on the same street.<br><br>The group I'd recommend seeing this film now? young people around 15 to 25, maybe give them a little more focus as to why their parents are so weird!!!","user":"trichenyc","rank":[19,20]},{"title":"Last Dance of the Disco Era","rating":5,"date":"3 May 2005","review":"THANK GOD IT'S Friday was released just as the disco craze crested, when anything and everything might happen during a night on the town, when sex was casual, and drink and drugs were still regarded in a lighthearted manner, and music wailed and blared with the likes of Gloria Gaynor and K.C. &amp; the Sunshine Band. Within a few years Disco would be publicly declared dead--but it still lives on in the recordings... and in Donna Summer's screen image of the Disco Diva, shimmering in the spotlight beneath the mirror ball with a hibiscus tucked into her hair as she belts out her megaton hit, \"Last Dance.\"<br><br>TGIF is best regarded as a cultural artifact, an attempt to show everything that was shiny about the Disco world without any reference to its down sides of sexually transmitted diseases, next-morning-hangovers, and serious drug addictions. The story is slight: a disco is hosting a big dance contest, and every one arrives at the door with personal ambitions. There is, of course, the singer who hopes to hit it big; two underage teen girls hot to be Disco Queens; a sweet young thing who hates polyester and is looking for Mr. Right in the wrong place; and a ladykiller looking to score his next victim. The film is most memorable for the look of the disco, which is the real star of the film, and the cast, which includes several performers on their way up: Jeff Goldblum as the lady killer; Deborah Winger as the anti-polyester good girl; and of all people a very, very young Terri Nunn, who would later score big as the front singer for the band Berlin.<br><br>There are all the usual running gags, and as a whole the film is only mildly entertaining. But then Donna Summer steps into the spotlight--and for a few moments everything that was magic about Disco lives and breathes again. For what it is--an incredibly light, mindless bit of tinsel--the film is well done, but it has an extremely limited appeal for a contemporary audience. Unless you were actually part of the disco scene and want to revisit old memories, you're better off catching it on the late-late show. But my oh my... wasn't Donna Summer something special!<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[32,37]}]