[{"title":"Action, Adventure, Drama......who could ask for anything more?","rating":10,"date":"28 May 2005","review":"Have you ever seen a movie you thought was great, but couldn't even remember its name a month later? This is one movie you will never forget.<br><br>I have heard it said that the true test of a movie, or any art form, is whether it accomplishes what it set out to do. Did it inform you, delight you, anger you, scare you, or make you laugh? Besides presenting a very entertaining and original storyline, this movie wants you to care about the environment. After seeing The Emerald Forest, I immediately called one of the major environmental organizations (I don't want to play favorites, but it's one of these: The Nature Conservancy, WWF, Greenpeace, The Sierra Club...) to set up automatic monthly contributions. I never expected a movie to have so great an impact on me, especially such a long lasting one. You would expect that, after time, my enthusiasm would diminish, especially since I have no interest in ever visiting the Amazon! None whatsoever. However, this movie really changed my perspective on the global environment as a whole.<br><br>The central character is Tomme (Charlie Boorman). While watching his father direct the construction of a huge dam, Tomme is quickly and silently taken away by a native Brazilian Indian tribe called the Invisibles. They don't see their actions as kidnapping. When they see the young boy, they figure he would be better off with them, rather than with the \"termite people\", the name they give to the white men who seem to devour all the trees.<br><br>Tomme's father spends the next 10 years trying to find him.<br><br>This is definitely a thought-provoking movie, but one that is not too heavy handed. It's one of the most entertaining movies I have ever seen, the type of movie you can watch over and over.<br><br>Update: Since I had not seen this movie for many years, I decided to see it again last night. I was totally blown away. It was even better than I remembered. Although my original 9-star rating is very high praise, I can't fathom how I could have enjoyed the movie more, so I raised my rating from 9 stars to 10 stars. Director John Boorman also directed Beyond Rangoon, and some other films that are amazingly good.<br><br>Charley Boorman's performance is simply brilliant. I can't imagine anyone better in the role of Tomme in The Emerald Forest. I am definitely going to start watching the other movies he has made.","user":"pachl","rank":[49,56]},{"title":"unforgettable","rating":10,"date":"7 March 2005","review":"I saw this movie years ago as a 13 year old and I can say without exaggeration that no other movie has had such a strong and lasting impact on me. While I was aware of the sacrilege going on in the Amazon, this opened my eyes to it like never before. Shortly after this I ran away from home with a friend, with the intention of going to Brazil, mobilising the Indians into a guerrilla band and killing the loggers. It took our families all of two days to track us down at a port city : )<br><br>But I never forgot the lesson this movie taught me and today I work for a conservation organisation. Some of the Indian quotes from the movie are truly tear jerkers. \"When we were young the end of the world(the limits of the forest) was very far away, but it gets closer and closer each day\" or something to that effect. As an idealistic kid I saw no flaw in this movie and cheered at the improbable climax where the rains destroy the dam and the captured Indian women throw away their cheap clothes and return to the forest. This movie is a must watch","user":"arjun-6","rank":[42,50]},{"title":"Excellent movie.","rating":10,"date":"17 April 2005","review":"I actually grew up near the city of Belem, shown in the beginning of the movie, and spent 18 years in the region. I also spent time in many of the Indian tribes in the area, including being \"adopted\" into one at the age of five. <br><br>The movie does a great job of showing many aspects of life in the jungle, including some of the lawlessness. The costumes are fairly authentic, and portrayal of many tribal customs is well done. The manhood ceremony is closely based on authentic ceremonies that happen in most tribes. <br><br>Altogether, about as good as you can expect from something that is not intended to be a documentary.","user":"brasilbob","rank":[53,66]}]