[{"title":"Adorable Saturday afternoon movie","rating":6,"date":"6 March 2005","review":"From John Cusack's earlier days, this film is a cute one that slipped through the cracks. It features a shaggy-haired John from his earlier, hapless romantic teen phase. Ben Stiller, as ever, plays a jerk. It's not a must-see, but a good one to pass the time with and just have a laugh at the strange things Cusack has to do in this movie--aside from getting wet and topless...<br><br>High points of the movie: watching him get stoned with a bunch of island natives, get drunk in an island bar and shanghaied into service on a boat, and then arrested and thrown into a local jail. The crazy pirate, played by Robert Loggia was excellent comedy relief as well.","user":"vestabrigit","rank":[9,9]},{"title":"Simple, fun, and harmless","rating":7,"date":"7 November 2002","review":"No the film won't win any oscars, but the tropical locations, John Cusack's talent, and gruffy Robert Loggia make this a very watchable film.  I have seen this movie dozens of times and never get tired of it.","user":"tbro71","rank":[10,11]},{"title":"Half of a really great film...","rating":7,"date":"27 May 1999","review":"...is better than a whole terrible one?  I dunno.  But I do know that this would-be entry into the John Cusack teen film canon (beginning with \"The Sure Thing\" and \"Better Off Dead\", proceeding through \"One Crazy Summer,\" ending with \"Say Anything\") is worth a look.  The first half is my favorite, probably partially having to do with the fact that for whatever reason, it's the half I saw more often when catching this on HBO back in high school. It concerns an average guy (does J. Cusack play anything else?) who desperately needs to track down the girlfriend he told he couldn't accompany to Jamaica and proceeds to try and do so for the duration of the film, after narrowly missing her at the airport.  What follows is a decreasingly funny/increasingly less inspired series of misadventures, but Cusack pulls most of it off, simply 'cause he's Cusack, the master of the slow-burn/hang-dog/sarcastic one-liner.  Far more memorable and compelling are the early scenes which put Cusack's Dan Bartlett through the paces. Less interesting is the 'drug running/pirate' subplot that develops halfway through in order to let Cusack's character be the hero.  But it does have some funny moments, plus a young Ben Stiller before he ever discovered the joys of Mary and baby batter.  Worth a look for Cusack- and 80's movie-philes, but all others probably need not apply.","user":"g-man-22","rank":[6,6]}]