[{"title":"A Funny Entertaining film!","rating":9,"date":"9 June 2004","review":"My family and I have always loved this movie and its sequel.<br><br>I was really young when it was being filmed here in Pennsylvania and remember seeing the big Christmas tree in front of the castle in the Winter just as you see it in the movie.<br><br>June Harding played a wonderful role in this movie as the clumsy, dim witted Rachel. Too bad that her career didn't go further because she had such good potential doing physical comedy. Hayley Mills was terrific as the rebellious Mary Clancy who always took chances and who always got caught. Harding and Mills together getting into all kinds of mischief was really funny. <br><br>We took a tour of the castle and its interior a few years back and it looks exactly the same now as it did in the movie and this movie is 38 years old!! The grounds of it have changed very little over the years and the movie served as a time capsule for it. It was formerly known as Lindenwold Castle and is now known as Mary's Home for Children. You can find more information about the castle on the internet.<br><br>In this movie the most believable character was played by Mary Wickes who is the epitome of a Catholic School nun. Those of you who attended Catholic school (againt their will or not) will know what I mean.<br><br>She was just too realistic and I got a kick out of her wearing those black high top sneakers! !! It was nice to see her reprising her \"Nun Role\" again in the \"Sister Act\" movies.<br><br>\"The trouble with angels\" is a funny entertaining movie good for the whole family.","user":"jsfmt99","rank":[47,49]},{"title":"\"The Devil's Agents\"","rating":9,"date":"5 December 2005","review":"\"The Trouble With Angels\" is truly a gem. Ostensibly a comedy about the efforts of two slightly disgruntled, high spirited teenage girls (Hayley Mills and June Harding) to turn a convent school upside down, it combines lighthearted pranks with dry humor, most of the latter supplied by the splendid Rosalind Russell. As the worldly and wise Mother Superior, Rosalind is both amused and unsettled at the stunts her two incorrigible charges pull. The supporting cast is well chosen, with Mary Wickes (\"Sister Act\") and Marge Redmond (\"The Flying Nun\") standing out among the faculty nuns. Despite the unexpected appearance of legendary stripper Gypsy Rose Lee, cast as (what else?) a teacher of interpretive dance, both nuns and students are believable. Mills sparkles in her role as devilish Mary Clancy, as does June Harding as Rachel Devery, her neophyte partner in crime. Aided tremendously by a truly beautiful score by the great Jerry Goldsmith, (which has the remarkable ability to blend in with the film AND stand alone as a pleasurable listening experience) and directed with a sure hand by actress/director Ida Lupino, \"The Trouble With Angels\" is both funny and moving, one of the best family films ever made. Strangely enough, reviews were decidedly mixed (when not downright negative) back when the movie was released in 1966. But it was a sizable hit, and spawned an agreeable sequel (\"Where Angels Go, Trouble Follows\") two years later. Today, it remains as fresh as ever, and head and shoulders above most of the contemporary family films which followed it.","user":"phillindholm","rank":[62,67]},{"title":"I love this movie","rating":1,"date":"1 October 1999","review":"I am a guy, and I love \"The Trouble with Angels\"!<br><br>Now I feel better, I've admitted it.  I remember seeing this as a kid and it made a great impression on me. The end is especially poignant and if you've never seen the movie, it can get to you.  Plus, any movie that has a character named \"Marvel Anne\" is worth a look!<br><br>Hayley Mills and Rosalind Russell were in better movies in their career, but none I like better than this one.","user":"Boyo-2","rank":[51,55]}]