[{"title":"Stylish gore","rating":10,"date":"14 August 2006","review":"I recently acquired Italian horror director Michele Soavis Cemetery Man which was released recently for the first time on DVD. I had seen it before, but somehow now it became one of my favorite horror films. It has a style, beauty and grace that many horror films seem to miss nowadays. So naturally I set my eyes on seeing all of Michele Soavis horror films. I had already seen two of them The Church and Cemetery Man, and The Sect isn't out on DVD so I decided to see his only other movie on DVD which is Stagefright. This was Michele Soavis directorial debut, so I didn't really know what to expect. A flawed film made by an at the time rookie? A promising film with glimpses of greatness here and there? <br><br>The story is about this group of actors that are putting up a play. They have very little time to practice some of the dance moves and songs so they are all under a lot of pressure. A psycho killer finds his way to the theater and locks everybody inside with absolutely no way out. Then he begins to systematically kill all the actors on the play in some really gruesome ways.<br><br>Well its no secret that Soavi was Argentos pupil and I think that out of all of Soavis horror films that I have seen Stagefright is the one in which this is most evident. There's the killers point of view, some strange and interesting camera angles and even an animal themed killer. But thats not a bad thing in my book because eventually Soavi found his own voice and style as evidenced by his last horror film Cemetery Man. Still, Stagefright has a great style and look. What I love the most about Soavis films is that they deal with all these horrible killings, yet the film has a class and a finesse about it that kind of elevates the sleaziness of the slasher genre to a high that it rarely reaches.<br><br>Don't get me wrong here, this movie may be artsy and classy, but its still very very much a slasher film. There's some truly brutal deaths here! After the movie sets up its premise the ball gets rolling really fast! Thats one of the things I liked the most about this movie it had a fast pace and wasn't boring in the least! Once the killer puts on that cool as hell Owls Head mask on his noggin things get really gory and interesting. From people being cut in half with chainsaws (great scene man!) to some cool decapitations this movie had me cheering for more! So slasher fans and fiends, you wont be disappointed! <br><br>Another excellent thing about this movie was that it wasn't an incoherent mess. I've seen a lot of Lucio Fulci films, a lot of Dario Argento films and a few other Italian directors and they all suffer from the same illness. They cant seem to bring together a story and tell it in a coherent understandable fashion. Not so with Soavis Stagefright. I was surprised at how smoothly the story flowed and I was surprised that I was actually understanding it without any extreme effort. In a sense I would say that Soavi took everything that Argento and Fulci did wrong and did it right. He learned from their mistakes and therefore he is a better filmmaker for it. He is the next step in the evolutionary ladder as far as Italian Horror goes. This might also be why Soavi is heralded as the savior of Italian Horror by many a horror connoisseurs.<br><br>So in conclusion, Stagefright is a solidly well directed slasher. One that showed promise for what is one of horrordoms best directors,even though his body of work is comprised of only four movies. I hope Soavi wakes up from that dream soon and delivers us with something as good or better then what he has already done. Soavi you the man! Rating: 5 out of 5","user":"spacemonkey_fg","rank":[24,29]},{"title":"One of the best 80's slashers","rating":7,"date":"4 July 2004","review":"Spoilers I'm not a big fan of the slasher sub-genre; there's too many samey films clogging up the genre and seeing a man with a knife hacking topless babes to bits can be a bit tiresome after a while, believe it or not. This one, however, is a cut above (no pun intended) the majority of other slashers.<br><br>Stagefright features an abundance of overly gory and creative death scenes. This, of course, is no bad thing. No bad thing at all. The film's first death scene sees the wardrobe assistant take a pick axe in the face, and that death scene alone beats any of the rather dull methods of death featured in other 80's slashers such as Friday the 13th and The Burning single handed; and it gets better than that...one actress is stabbed to death in front of her director and the rest of the cast; power drills, chainsaws, axes and fire also feature in the movie's vast weapon repertoire. On the subject of the chainsaw; it surely has to be the most under-utilised weapon in horror film history. The tool just cries out to be used to maul and saw up victims, and yet it hasn't had a great deal of screen time over the years considering it's potential. This movie, however, has a lovely chainsaw section which sees limbs get lopped, bodies carved up and an incredible death scene in which the victim has the lower half of her body removed while being rescued from falling down a trapdoor.<br><br>This film's main downfall according to some people will be it's characters, script and acting. The characters are paper thin, the script, at times, is badly written (although not throughout) and the acting is wooden to say the least. However, as one doesn't go into an 80's slasher movie expecting Oscar winning performances, Oscar winning scriptwriting and great characters; one can forgive these things. What this movie does have lots of though, is style and atmosphere. It's easy to see the influence that master director Dario Argento has had on his understudy Michele Soavi. Soavi, who would later go on to direct his masterpiece, \"Dellamorte Dellamore\", piles on the style in this movie. The style is very reminiscent of the sublime, 'Opera', actually, which also came out in the great year that was 1987. One scene in particular, involving the main character hiding out in the shower while one of her co-stars is killed in the next booth is very Opera-esque indeed. The creepy atmosphere in the movie comes mostly as a result of the claustrophobic setting, which is made more claustrophobic when you consider the fact that the characters are locked in with the madman. The creepy atmosphere comes into play again towards the end of the movie when the 'slasher trademark' victim has her final duel with the killer; Soavi is able to build up tension through a series of scenes, including one very suspenseful sequence in particular which the key to building is wrenched out of the stage floorboards in front of the killer. The suspense in the build up the killer's downfall is not wasted, as, unlike so many other films, Soavi is able to build the movie up to a satisfying and exciting conclusion.<br><br>Stagefright is an underrated gem, and more than deserves the praise that lesser entries in the slasher sub genre, such as Friday the 13th receive. A creepy exhibition of atmosphere and creative gore; Stagefright comes with the highest recommendation from me.","user":"The_Void","rank":[7,8]},{"title":"A very satisfying thriller, visually and aurally, worth multiple viewings!","rating":26,"date":"26 October 2003","review":"STAGEFRIGHT aka AQUARIUS is a very stylish chiller from Michele Soavi, whose critical reputation rests on this film and the later CEMETERY MAN.<br><br>\nCertainly the film is derivative, and fans of this subgenre will surely comment that they have seen it all before; however, Soavi, like his mentor Dario Argento, is astute when he chooses the likes of ENNIO MORRICONE; GOBLIN, and now SIMON BOSWELL to score his films.<br><br>Boswell's compositions together with the opening and end titles written by Stefano Mainetti propel the film along, and provide an aural edge to the onscreen visuals.  And if their contributions were not enough, the inspired, and uncredited use of Dmitri Shostakovich's 8th symphony, 3rd movement (\"allegro non troppo\"), reflects the imaginative touches that distinguish this film from many others.<br><br>The play/film within a film works quite well, especially as the cinema is acknowledged to be the art of illusion; indeed this conceit looks ahead to the two DEMONS films, set in a cinema, where the audience are overwhelmed with illusion become reality.<br><br>The acting is more than sufficient as the characters are written as types, and set up as victims, just as the heroine has a personality that sets her apart.  Her final scenes with the killer are very effective indeed; her fearfulness make her vulnerable, her vulnerability draws us to her, and in drawing us to her, we submit to the relentless onslaught the killer pursues.<br><br>This is a film where the viewer/audience surely knows the outcome, but the satisfaction comes from the execution - literally - of the route that the filmmaker takes.<br><br>I now have this film on a budget UK DVD which reveals little - I am playing it back on a 16:9 TV, and am very pleased with the quality of the sound (mono) and the visuals, plus some of the unusual, though rare basic extras.","user":"simonize-1","rank":[7,8]}]