[{"title":"The powerful Judy Davis","rating":8,"date":"4 February 2003","review":"There are very few performers today who can keep me captivated throughout an entire film just by their presence. One of those few is Judy Davis, who has built a successful career out of creating characters that are headstrong in attitude but very vulnerable at heart. She takes roles that most other performers would treat melodramatically and adds a fiery, deeply emotional intensity that pulls attention away from everything else on the screen.<br><br>Her skills are well displayed in \"High Tide,\" a film that matches her up a second time with director Gillian Armstrong, who gave Davis her first major success with \"My Brilliant Career.\" In that film, Davis played a young woman who was determined to make it in the world, despite the suffocation she felt from her community and upbringing. In \"High Tide,\" however, Davis' character, Lillie, is roughly the opposite: she gave up on any hope for her future when she was young, and, after giving birth to a child, runs from her responsibilities and takes up a life without direction or meaning. When she finally meets up with her daughter years later, the thought of taking care of her child is petrifying; she knows this is her chance to atone for her failures, but how can she be honest with her daughter and still gain her respect?<br><br>Gillian Armstrong's films usually relate stories about characters who desperately want to communicate with each other, but face obstacles set up by their own personal habits and addictions. \"Oscar and Lucinda,\" for instance, was about a man and a woman who desperately needed each other's love but were always blindsided by their craving for chance, represented by their gambling addictions. Here, we are immersed in the world of a family torn apart by the mother's inability to commit to a settled life and her struggles to redeem herself despite being fully convinced that it's too late to change for the better. This is not simply a film with a great performance at its center, but also a rare achievement: a fully convincing story of redemption.","user":"Oblomov_81","rank":[10,11]},{"title":"An Undeservedly Obscure Gem","rating":3,"date":"3 September 2001","review":"\"High Tide\" is one of the greatest movies most people haven't seen. If you just read a plot summary, the story may seem unbelievable. But thanks to writing, acting, directing and music scoring of the highest caliber, this film works on every level. According to director Gillian Armstrong, the role played by Judy Davis was originally written for a man.  But Armstrong's husband suggested rewriting it for a woman. Davis gives one of her best performances in \"High Tide,\" and that's saying something for such an accomplished actress. Physically she is a very mannered performer, reminiscent of such great actresses of the 1930s and '40s as Bette Davis and Katharine Hepburn.  But Davis is also incredibly subtle.  Just watch her face and you can see every thought process, every emotion. Davis' performance was helped tremendously by Gillian Armstrong, who is not afraid of lingering on a closeup way beyond when lesser directors would have cut away.  It's one of her greatest strengths as a director.  She allows a scene to play out. Nothing is rushed so everything unfolds naturally, helps add to the realism of \"High Tide.\"  (She does the same thing in \"The Last Days of Chez Nous,\" another of her best efforts.) This is a movie to be cherished.  It's an object lesson to mainstream Hollywood on how to turn what could have been a sappy, cliched movie into a moving work of art.","user":"gbtbag","rank":[12,15]},{"title":"What you've not seen, but longed for...","rating":10,"date":"9 October 2008","review":"There's a certain allure I've always found in discovering the great unknown film. These discoveries have nearly always been dramatic stories. In my experience, unknown sci-fi, action and horror are unknown for very, very good reasons. I found \"High Tide\" on video at a junk store, mixed in amongst countless dozens of tapes of varying quality. Of course, that's the only place I would find it, as it is still not on DVD.<br><br>While I was watching Judy Davis (as Lillie) throughout the course of this film, I was certain I was watching a great undiscovered performance. I had previously seen Davis in several small parts - and one starring role in \"A Passage to India\". But, although she was great in that film, \"High Tide\" is a different animal entirely. Judy Davis' performance is stunning, I cannot say enough good things about it. She shares an amazing on-screen relationship with young Claudia Karvan (as Ally), this film's other great actress. There's a lot of drama and quiet humanity they share together, the details of which I won't reveal here (see it for yourself!).<br><br>There's too much good in \"High Tide\" to cover in one review, but the film speaks well enough for itself. Laura Jones writes stunning dialogue, beautiful words for the mouths of real people. Gillian Armstrong directs her actors toward a growing, powerful honesty. She turns everyday things into powerful, human depictions. I felt so alive and changed by the story this film tells. It's a weightless and strong depiction of running and staying put. You're welcome to make a choice.","user":"BERSERKERpoetry","rank":[8,11]}]