[{"title":"Medieval accuracy, good Shakespeare","rating":10,"date":"31 December 2004","review":"A few years after this was released in the USA, I convinced my high school English teacher to take our class to see it. (In the days before videos &amp; vcr's, this involved renting a theater and print.) I was glad I did. It is certainly the most real and immediate filmed version of the play. The sets, costumes (or lack thereof), and casting all work to create an accurate depiction of \"nasty, brutal, and short\" 11th century life. And of course, there is the wonderful insight of Shakespeare's language to engage our modern sensibilities.<br><br>One can only thank Polanski for casting such relatively young actors as his leads. Kings lived and died young then, and had to be both excellent generals as well as administrators to succeed. Jon Finch is both athletic and impassioned enough to carry off the soldiering, and young and introspective enough to be moved by his wife both as a woman and co-conspirator. Of course Francesca Annis made a splash by doing the mad scene in the nude--but in medieval times, everyone slept in the nude, so it was certainly accurate to the times.<br><br>And as has been noted before, at least the castle keeps are cold, dark, and dirty. The communal sleeping arrangements, straw bedding, flaring smoky torches, seeping walls, and muddy yards all contribute to the historical accuracy of this production. The exterior of Bamburgh also works. And keeping with Shakespeare's light vs. dark metaphors, the mist, rain, and lowering skies combine to enhance the mood.<br><br>What happens in this \"Macbeth\" is as realistic as possible. So what happens offstage in the play, happens onstage in the film: the murders of Duncan, Banquo, Macduff's family. Murder is nasty and bloody and Polanski (having much experience of its results) makes sure we know it. Medieval Scotland was nasty and bloody as well, and if the film is accurate in depicting its setting, why not the action? And only Polanski has an ending that hints that violence and ambition didn't die with Macbeth's overthrow. All said, Polanski's film still has the most accurate medieval setting, engaging performance(s), and thrilling battles. <br><br>PS. For those interested in the real historical Macbeth, read Dorothy Dunnett's excellent biographical novel \"King Hereafter\". Dunnett is world renowned for her historical accuracy, and did much research to create not only a very plausible rendition, but a thoroughly interesting and entertaining story as well.","user":"gerlynga","rank":[74,80]},{"title":"One of the Best Versions of a Shakespeare Play That I Have Seen","rating":8,"date":"16 June 2008","review":"THE PLOT: Through ambition, greed, and the spurring of his wife a man rises to the ranks of King, but leaves murder, destruction, guilt, and a wide array of enemies in his wake.<br><br>THE POSITIVE: This is visually stunning from beginning to end. The photography of the Scottish landscape seems almost surreal. Although some may argue that the violence is excessive it is still well done and works in a nice lyrical fashion with the script. The gory special effects are very realistic and top anything that I have seen in any slasher movie especially the decapitation scene. The witches also come off as looking very frightening here. The scene in their coven where you see dozens of fully nude elderly women is grotesquely brilliant. This is one Shakespeare rendition that doesn't have any of the stiff staginess. The characters seem to be having real conversations and their lines are spoken in a much more natural way. Finch is absolutely perfect in the lead. The facial expressions that he show during Macbeth's different phases are fascinating and right on target. This would be a good version to show to teenagers and others who might not ordinarily be into Shakespeare. The action is well mounted and paced so anyone would be able to follow it even if they are not able to completely grasp the language.<br><br>THE NEGATIVE: Outside of a relentlessly bleak visual style that may be too much for some there really isn't anything negative about it.<br><br>THE LOWDOWN: This is the best film adaptation to Shakespeare's work that I have seen. It is exciting, graphic, realistic, visual, and captivating all at the same time even for those that may not be into Shakespeare.<br><br>THE RATING: 8 out of 10.","user":"rwint1611","rank":[31,34]},{"title":"certainly not a sunny story, but it's as darkly exhilarating and ominous as any Shakespeare adaptation can get","rating":10,"date":"27 August 2007","review":"To get the obvious out of the way- Roman Polanski directed Macbeth as the first film following the death of his wife, Sharon Tate, and unborn child at the hands of Charles Manson's gang. That factor in the film- not least of which in small details, like the first shot after the opening credits where a man finishing slaying someone looks just like Manson, beard and all- is undeniable, but it shouldn't be counted as the sole influence. Aside from the purging, as far as I can figure, Polanski was doing for himself by going all out in showing the frank and bloody depictions of violence and almost cleansing (as Lady Macbeth would do in madness) of blood on hands that could never come off, of the sort of psychological impact of violence and its aftermath, it was a bloody time in the world and in films. As Vietnam continued to go on, the best films of 1971- and Macbeth could be counted as one of them- were some of the most stylish and explicit in how they attacked systems of government, corruption, and bad-ass anti-heroes or outright villains (A Clockwork Orange and Dirty Harry come immediately to mind). It would practically be dishonest, in a sense, for Polanski not to show how grotesque the acts of murder that, for example, Macbeth's men do on MacDuff's family and servants, or the simple, sadistic carnage of Macbeth's final curtain call in the climax, considering the mood and controversies of the period.<br><br>Compared to some of the really radical films of the year, however, Macbeth's story is as old and cherished as children's fables. Yes, children, you all remember the story of ambitious young Macbeth, prodded on by the alleged prophecies of three weird witches, who murders the king by his own (and his wife's) accord, and soon goes mad as power grips him into overreaching his domain and believing himself to be invincible to all but a fleet of woods. Not really too much happiness in Shakespeare's work, and all the better, as it might be his masterpiece: a saga of the frailties of the human conscience and abstractions of consciousness, where the supernatural substitutes just as well for faith in some religious calling- and a questioning and doubt throughout- and what it does to those around the Mr &amp; Mrs who still can't cope deep down with killing a man in the dead of night. Yet even more incredible is that Polanski, as well as Kurosawa with Throne of Blood, enrich the material with the film adaptations, changing around some scenes, omitting some altogether, and offering brands of surrealism based on preferred styles.<br><br>While Kurosawa stuck to the Noh method for much of his film, Polanski's Macbeth is an atmospheric milestone as far as concrete production design can go (never once does it feel like they used a fake castle, or much of a fake set even), and all the grays and dark Earth colors, especially when Macbeth goes to the witches a second time, blend into something that matches the psychological conundrum of the king of Scotland and his desperate wife. But seeing Polanski take things further, with touches of the bizarre (the floating and illusionary dagger, the drops of blood in Lady's hands, and the spectacular scene of Macbeth seeing through the windows, shot in a hazy and pirouetting camera), and showing what was only alluded to in strange and exciting ways- the killing scene in the bedroom feels almost like the Psycho shower scene, missed stabs and the messy quality of it all, only from the guilty party's point of view. This, plus the attention to detail in storytelling, the nuanced and gleefully over-the-top dialog provided very close to the original text, and even hand-held camera-work right out of something in Repulsion, makes this a work of daring for Polanski, not simply in the realm of elaborate fights (though there is that) or blood-shed (a lot of that) or decapitations (one or two gushing ones).<br><br>Though not to forget as part of the success too, aside from the director's total control of mis-en-scene, are the actors. Jon Finch, who also appeared in Frenzy, is a tightly wound loose cannon, if that makes sense, whose voice-over narration sometimes blends in with talking to himself, and the look in his eyes sometimes tells all, or perhaps not, as case might be. Although Welles and Mifune have their fair share of great Macbeth points in other films, Finch proves himself as on their same level, if only for this one moment in his career. Also very noteworthy (albeit such a meaty part for any actress) is Francessa Annis as Lady Macbeth, and Terence Baylor as MacDuff, and Stephan Chase as Malcolm is a very good choice. And as usual Polanski populates his picture with effective faces, strange looks that seem very conventional and at the same time all apart of the visual and mood. I loved seeing the whole room of witches, most naked (thanks to Hugh Hefner mayhap), and it almost seeming as if a bare minimum of make-up was used.<br><br>Bottom line, if you're looking for a hallmark of the dark literary drama, or a disturbing tale of the madness of power, or just a classic Polanski film, it's all here.","user":"Quinoa1984","rank":[36,40]}]