[{"title":"Christmas with Sophie 2017","rating":10,"date":"26 December 2017","review":"I don't know why I didn't want to see Sophie's Choice, not for years. I knew about Meryl Streep's performance, Alan J Pakula. Kevin Kline and I also knew that I had to see it eventually. Well, Christmas 2017 brought the shattering story into my life and now forever in my subconscious. Extraordinary is the first word that comes to mind. Meryl Streep's performance is out of this world. Every detail in her creation is a sort of link to her heart and therefore to mine. \"Emil Dickens?\" Her eyes, asking the question to the awful librarian will stay with me forever. Meryl Streep as Sophie asked that question 35 years ago. Amazing! What a devastating treat. It will make me go back to see all of her films., specially \"A Cry In The Dark\", \"Plenty\", \"The Bridges Of Madison County\" \"Julia and Julia\" even \"Death Becomes Her\" and \"The Devil Wears Prada\" Thank you Meryl Streep, thank you very much.","user":"artoffilmorg","rank":[75,78]},{"title":"Meryl Streep raises the bar","rating":8,"date":"8 July 2006","review":"After enjoying Meryl Streep and Kevin Kline in the recent ensemble comedy \"A Prairie Home Companion,\" it was great to see their dramatic performances in \"Sophie's Choice,\" the movie that made them famous. Here, they play Sophie and Nathan, a volatile young couple living in a Brooklyn boardinghouse in the summer of 1947. Their story, and eventually the story of the Polish Sophie's time in a concentration camp during World War II, is presented through the eyes of Stingo (Peter MacNichol), their young Southern neighbor.<br><br>Though other characters appear, especially during the flashbacks, \"Sophie's Choice\" is largely a three-person drama that relies on subtle interactions. Meryl Streep can always be counted on to give a nuanced performance, but here, especially, she raises the bar. Speaking three languages (including a very realistic portrayal of how foreigners can hesitate and hunt for words when speaking English), going from a haggard Auschwitz inmate to a pretty \"blooming rose,\" consumed by guilt even during the madcap or romantic moments she shares with Nathan, she gives a brilliant performance of a very complex character. Her big scenes with Nazi officers are of course powerful, but I was equally struck by smaller moments: the heartbreaking little flashes of emotion that reveal Sophie's postwar wounds, or the extraordinary conversation she has with a Nazi's daughter.<br><br>Kline throws himself into the role of the \"fatally glamorous\" Nathan and also displays impressive range: he goes from charming to menacing. MacNichol is not up to these (admittedly high) standards. He can play the wide-eyed innocent, but he always seems somewhat thick-headed and lacking in passion. The movie would be more effective if Stingo seemed more truly changed by his experiences with Sophie and Nathan.<br><br>Despite Stingo's weakness as a character, I liked the unusual structure that reveals Sophie's story gradually, in flashbacks that draw closer and closer to the ultimate horror. The movie is nicely shot and some of the Brooklyn scenes look as though they actually could have come from a 1940s movie. But no director from the 1940s would have confronted the brutalities of the Holocaust so directly, and few actresses from any era could have given a performance like Streep's.","user":"marissas75","rank":[54,58]},{"title":"The definitive Meryl Streep","rating":8,"date":"2 March 2002","review":"Without a doubt, Meryl Streep delivers the Greatest Performance By An Actress EVER - period.<br><br>The performance is totally naked, where you can almost feel her sorrow come right out of the screen. For all of the heart wrenching scenes in this movie, you never once feel as though Streep is going over-the-top. That says alot for someone who spends just about half of the time in her scenes with a tear in her eye. Everything about her performance just seems so effortless and natural. This especially shows when she is speaking German flawlessly, or English with a very convincing Polish accent.<br><br>The fact that Kevin Kline and Peter MacNicol are not completely lost in this movie says alot for their performances. Kline himself delivers a great performance of a man suffering from delusions and bi-polar syndrome. It is one of his greatest performances as well. Peter MacNicol plays the role of a character who pales in comparison to the other characters. MacNicol has the somewhat undesirable task of having to play the character who carries the least amount of baggage. He therefore might be overlooked, when viewing at the movie as a whole. However, MacNicol does a great job with the character, not trying to make more out of it than it is supposed to be. His role is very important to this movie.<br><br>But the real story here is Streep. Her performance would be a stand out against any other performance in history. I honestly believe that. Streep just digs down deep here - delivering lines that just put a chill down your spine.","user":"MyDarkStar","rank":[120,134]}]