[{"title":"Story as good as the eye candy.","rating":15,"date":"15 December 1998","review":"Wicked City is one of my favorite anime movies of all time, and here's why: if this movie didn't have a solid plot, it'd be hentai. As it is, it's borderline hentai. But what makes it so radically different is that the adult content is weaved in with the plot - there's only one scene of sex that has no pertinence to the story. This movie was ingeniously done. Solid story, great eye candy.","user":"Kage-2","rank":[24,31]},{"title":"I was expecting a film more in the lines of Demon City, however very different.","rating":7,"date":"2 June 2009","review":"Other than having City in the titles there really is not all that comparable to the two films. I have to say I enjoyed that film more as it was action packed and had very nice visuals. This one though does get points for the excessive violence and nudity as that film was devoid of nudity and the violence never did get all that bad in that film. This movie has two agents from two different companies as it were assigned to protect this strange old man. The catch, well one agent is human, and the other is some sort of being from another dimension. One could probably call her a demon and all the other crazy people in the movie. The old man the two are assigned to protect provides the humor in the film as he is one horny old dude, and while the action is not quite as fast paced as Demon City what there is of it is usually violent and bloody. As I stated there is sex and nudity in this film, but it comes in really small scenes not really long enough to make much of an impact thus I would not really call this movie a Hentai film, which is usually an anime film that has so much sex in it, that it is almost a porn flick and this one certainly does not contain that much sex. The story needs a longer runtime to it as it kind of goes by to quickly with little explanation in areas that need more explaining as I am sure not still what the other people are supposed to be. However, it entertains in a fun way, just not as fun as Demon City.","user":"Aaron1375","rank":[5,5]},{"title":"Excellent anime & storyline!","rating":9,"date":"21 October 2005","review":"This was my 1st. full-length anime motion picture I have ever seen, &amp; ranks as one of my favorites! Taking place in the future, our hero, Taki who by day is an electrical salesman, &amp; by night, a \"Black Guard\", is asked by his superiors to guard without failure a known senior negotiator, Mr. Guiseppe Mayart &amp; to make sure he is at a treaty signing, &amp; will be working with a partner, a \"Black Guard\" from the \"Black World\"....a female named \"Makie\". Together, they experience various situations from other renegade members of the Black World that try to thwart the treaty signing. What Taki &amp; Makie don't know is that their pairing up from both worlds to protect Mr. Mayart has more that one objective, which makes sense later. What I liked about Wicked City is not just the storyline, but the anime itself. What I mean here is that this feature was \"hand done\" &amp; not by computer, which is why it looks different from other anime features. NOTE: Unless your kids are of age, this anime is by all means not for the young ones. Aside from the \"adult\" parts, Wicked City is Excellent anime entertainment, which I am sure you'll enjoy!<br><br>PS.: Happy Birthday, IMDb! &amp; May you have many more!","user":"fluna1030","rank":[10,12]}]