[{"title":"It silly. It is harmless. It is fun. And it is underrated","rating":7,"date":"24 November 2009","review":"Ernest Saves Christmas is a very underrated Christmas holiday flick. I will agree that it is very silly, and certainly not Oscar worthy. Don't expect a sophisticated plot, and a superlative script. Expect a harmless and fun Christmas comedy, that way you are in for a good time.<br><br>While very predictable in plotting and rather repetitive and slow in the middle half; especially in the first thirty minutes Ernest Saves Christmas does have its funny moments. And I must say the scene with the magic sleigh was uproariously funny. Amongst the humour, is an in general heart-warming story about Santa and his attempts to find a successor.<br><br>The camera-work may be a tad dated, but the music is very nice indeed. And I actually thought the acting is above decent, with the late (and talented) Jim Varney wonderfully spirited as Ernest and Douglas Seale is simply great as Santa. The opening credits with the collage of Christmas carols were a delight.<br><br>Ernest Saves Christmas is an above average seasonal comedy about the power of belief and the dignity of an individual. It is far from a masterpiece, but seriously I wasn't expecting it to be. I got exactly what I wanted, a fun film that while predictable and silly is lots of fun too. I do also think it is underrated; there are much worse movies out there, namely any of the Friedberg-Seltzer movies, Home Alone 4 and Superbabies:Baby Geniuses 2. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[19,20]},{"title":"A Holiday Classic (Laugh All You Want)","rating":10,"date":"9 December 2006","review":"Maybe \"Ernest Saves Christmas\" will never be one of the most well-respected holiday comedies ever made. Maybe it didn't win the Best Picture Academy Award. Maybe it isn't a four-star movie or even a very popular one, but it's still a Christmas must every year. Underneath the layers of \"Hee-Haw\"-level blue-collar humor so synonymous with Ernest is a Christmas movie with heart-- surprising for the classic character. In a funny way, it almost seems like a different take on \"Miracle on 34th Street\"-- the old man who knows he's Santa Claus and the cynical young girl who says it isn't so. \"Ernest Saves Christmas\" remains one of the ideal holiday comedies around, whether it was a serious movie or not.","user":"RiffRaffMcKinley","rank":[12,12]},{"title":"Jim Varney at his best!!!","rating":9,"date":"16 November 2001","review":"This, my personal favorite Ernest film, is arguably one of the funniest. And its holiday theme adds that extra something for a comedy franchise (like Christmas Vacation did for the National Lampoon films).  Basic story has Ernest literally save Christmas, with predictable but sometimes hilarious results.  If you ever thought Ernest's schtick was funny, you gotta see this.  And if you wanna laugh for the holidays, you can do a lot worse than this.","user":"formula44xxx","rank":[15,16]}]