[{"title":"Help, please release to DVD","rating":10,"date":"21 January 2005","review":"Extraordinarily funny and is one of the BEST romantic screwball comedies from the 1930's. This film is comparable and stands the test of time such as\"It Happened One Night\". Quirky characters and a delightful cast including Billie Burke and Constance Bennett. They don't make 'em like they used to is an appropriate phrase concerning this film. Listen closely as the quick-witted writing shines through. The name of the two dogs,\"Get off the rug\" and \"You too\", are as creativity at its best. The individuality of each character's quirkiness as they interact with one another with acceptance is fantastic. I first viewed this movie 20 plus years ago and have not forgotten its quality and humanity factor. Waiting for a DVD release date and hoping for the powers that be to produce this fabulous film in DVD format just cannot be too much to ask.","user":"vic7077","rank":[60,62]},{"title":"A Very Merry Movie","rating":10,"date":"26 May 2004","review":"A highly intelligent tramp' is hired to become chauffeur for an eccentric, wealthy family.<br><br>MERRILY WE LIVE is a prime example of a tremendously funny screwball comedy which has become undeservedly obscure with the passage of time. Bright &amp; breezy, with snappy dialogue and some wonderful performances, it is a complete delight. The production values are excellent and the film's free spirit is perfectly encapsulated by the opening shot in which the principal cast marches arm-in-arm along the estate's long driveway while the credits and title song role.<br><br>Suave, sophisticated and just a wee bit naughty, British Brian Aherne is the perfect match for crisply cool blonde Constance Bennett. Their growing attraction to each other, hidden behind a rivalry for intellectual dominance, is great fun to watch. This hobo' has much to teach the rich girl about life &amp; love.<br><br>A very fine supporting cast offers much to the film's enjoyment. In one of her best roles, dithering Billie Burke, as Miss Bennett's utterly out-of-touch mother, is a complete joy. Alan Mowbray plays the proper English butler who experiences frequent bouts of emotional distress. Ensconced in the kitchen, tough-talking Patsy Kelly is the family's cook with a strong yen to stir-up some romance with handsome Aherne.<br><br>Impressively agile Clarence Kolb is Miss Burke's grumpy husband. Tom Brown &amp; Bonita Granville are their two younger, spoiled children. Philip Reed plays a bullying society Lothario interested in Miss Bennett. Ann Dvorak is a senator's headstrong daughter who usually gets what she wants and what she wants now is Aherne.<br><br>Even the smaller character roles can be fun: watch for Sidney Bracey as a sour-faced temporary butler &amp; Willie Best as a very frightened country store janitor.","user":"Ron Oliver","rank":[53,58]},{"title":"pleasant surprise","rating":8,"date":"15 July 2007","review":"Considering the obscurity of this film, it's a big surprise to see how well made, visually rich and entertaining it is, despite, as others have noted, its unoriginal premise. The dialogue is frequently funny but not up to the standard of MY MAN GODFREY - too much of the eccentricity seems to be forced and a bit cutesy but the cast overcomes all. Clarence Kolb steals the film with his masterful slapstick but he's first rate whether playing stern-and- sober, falling-down drunk or warmly empathetic. Though Billie Burke was Oscar nominated as the ditzy society matron mother, her performance here is no better than it was the year before in TOPPER or five years before in DINNER AT EIGHT (now THAT was an award-worthy turn!). Perhaps because this particular role was as over-the-top ditzy as such roles get, Hollywood decided it was time to honor it. What a splendid cast: Constance Bennett in fine form; Brian Aherne at his best - called upon to be elegant, dashing and charming, he accomplishes all three. Cary Grant would have given the character more oomph, but Aherne's reserve works here. Then we have the inimitable Patsy Kelly as a kitchen maid, the underused Ann Dvorak as a predatory Senator's daughter who lusts after Aherne, Bonita Granville as a wild, irrepresible teenage daughter, and last but not least Alan Mobray as the snooty butler being undermined by one indignity after another; his double takes are hilarious. Near the beginning there is an accomplished scene in which Aherne's wheezing jalopy rolls for what seems like a mile down a mountainside until it's totalled: no editing tricks here. Being a Hal Roach film there are of course generous helpings of slapstick, but they're brilliantly staged and expertly carried out by actors who are also capable of delivering deft overall performances. Every actor has at least one extended scene of well staged physical comedy. The opening credits are fun and welcoming: the whole cast is walking through the gates of the property with arms linked, singing the swingy title song. So, even though the concept of this film is derivative, its execution is fresh and alive.","user":"mukava991","rank":[20,21]}]