[{"title":"Wilder and Wilder...","rating":5,"date":"5 March 1999","review":"Wilder's best loved comedy. It's nice to see him behind the camera also in this witty picture about a man enthralled by this model of beauty, played sumptuously by LeBrock, only to find that there's more to loving someone than just a great body. Wilder performs some of his finest screwball comedy and is given great support from Grodin, Ivey, Bologna and Gilda Radner. Stevie Wonder's song is also catchy and adds plenty of flavor to a fun romantic-comedy.","user":"Coxer99","rank":[22,26]},{"title":"Some stuff needs to mature...","rating":6,"date":"4 January 2006","review":"I first saw this movie about 18 years ago and found it below average. The main reason for viewing it was may admiration for Gene Wilder after the early Mel Brooks movies... Gene Wilders appearances in The Producers, Blazing Saddles, Young Frankenstein and, not to forget although not from Mel Brooks, Silver Streak are rightfully and indisputably regarded as masterpieces by now. Compared to these highlights, I actually found The Woman in Red slightly dull.<br><br>Watching it on Cable-TV yesterday, i.e. January 2006, I got a completely different impression. I don't know if the difference is just me being 20 years older and more tuned-in with the main character, but now I experienced a warm, enjoyable movie filled with a mild madness I found most appealing. The spirit of the early 80's is very evident, this is not a timeless movie. Nevertheless, I find it more up-to-date with human emotions and behavior than most contemporary attempts in the \"daily life comedy\" genre.<br><br>Finally, if you - just like me - was disappointed by this one twenty years ago, give another try!","user":"peopeomoxmox","rank":[31,39]},{"title":"Yo, what's with the lousy ratings?","rating":10,"date":"22 November 2000","review":"There's a lot of things going for this movie: 1) Great, great Stevie Wonder musical score; 2) Gene Wilder in real romantic distress, and 3) first class ensemble work involving Gilda Radner, Joseph Bologna, Judith Ivey, Charles Grodin and others. Each of four very close friends encounters extra-relationship entanglement, film centers on Wilder's infatuation with much younger model LeBrock. The real fun is in the interaction between and among Wilder's friends, a truly enjoyable experience. Lots of negative comments here on IMDb related to \"the original\" movie (which I haven't seen) - I think it's only fair to judge this one on its own merits. I could watch this movie 20 times, in fact, I HAVE watched this movie 20 times. With apologies to all the bashers I give it 10 out of 10.","user":"RNMorton","rank":[50,67]}]