[{"title":"\"This is the west, sir. When the legend becomes fact, print the legend\".","rating":10,"date":"2 August 2007","review":"\"This is the west, sir. When the legend becomes fact, print the legend\". - Maxwell Scott, The Man Who Shot Liberty Valance In John Ford's most mournful tale, the legendary director asks the question \"How did this present come to be? Just how did an inferior race of men whose only weapon was that of law and books defeat the old gunslingers of the great West? Just what exactly happened to the Western heroes portrayed by John Wayne when law and order came to town? How did the wilderness turn into a garden? In The Man Who Shot Liberty Valance, John Ford depicts a world where everyone has got everything they wanted, but nobody seems happy with it sound familiar to anyone? Senator Ransom Stoddard (James Stewart) arrives to Shinbone on a train with his wife Hallie (Vera Miles) to visit the funeral of an old friend named Tom Doniphon (John Wayne, remarkably the film opens where this iconic star is dead). The newspaper men have never heard of him, so why would such a powerful political figure visit the town to attend this funeral of a \"nobody\"? Through the use of a flashback, Stoddard tells us the tale of how he came to the town as a young lawyer but was immediately attacked by the psychotic villain Liberty Valance (terrifyingly played by Lee Marvin) who teaches him \"Western law\". The rest of the film tells the tale of how the man of books eventually defeated the race of the gunslinger and what sacrifices had to be made for that to happen.<br><br>In truth, The Man Who Shot Liberty Valance is more of a melodrama than a Western. Gone are the vibrant landscapes of Ford's landmark movie The Searchers six years earlier, which was so proudly promoted as being in VISTAVISION WIDESCREEN COLOR and instead the film has given way to a bleak, claustrophobic black and white tale, with so many enclosed sets and not one shot of Monument Valley.<br><br>There's a lack of a real bar scene, lack of shots of the landscape, lack of horses, lack of gunfights. It's a psychological Western, probably unlike anything ever filmed until maybe Clint Eastwood's Unforgiven.<br><br>Why is this movie so good then? In basic terms, it's about the sadness of progression and without giving way too much away the film tells a remarkable tale which truly does examine what Ford's view of the West as promoted in his earlier work truly meant. It's a tragic and pessimistic movie but it's a rewarding one, with huge replay value and one that leaves you with so many more questions than it does answers.<br><br>Do we prefer the legendary tale of our heroes or the truth? Are tales of people such as 'The Man With No Name' just more interesting than Wyatt Earp? Is living a lie as a successful guy better or worse than quietly dying as a hero? The Man Who Shot Liberty Valance is one of the most complex Westerns that has ever been put on film and is a remarkable film when you consider it was directed by a guy who made his living telling grandeur tales of the American West. Well acted, very well written and is one of the most rewarding Westerns for replay value in the history of the genre.<br><br>Matt Holmes <br><br>www.obsessedwithfilm.com","user":"mattyholmes2004","rank":[116,131]},{"title":"Wonderful and nostalgic western with two great heroes","rating":9,"date":"12 April 2006","review":"Westerns aren't normally my favourite so it has to be a good one, and this one starring two legends, James Stewart &amp; John Wayne, is surely one of the best. It ranks with me right behind High Noon.<br><br>It tells the tale of an aging Washington Senator, Ranse Stoddard, who returns to Shinbone, his (sometime) hometown in the West with his wife, Hallie, for the funeral of their friend, Tom Doniphon. While there he relates his story to a journalist, telling how he came to Shinbone as a young lawyer and met there both Tom &amp; Hallie (who was formerly Tom's sweetheart). He became famous as the man who shot the notorious bandit, Liberty Valence, which kick started his political career. <br><br>However, Stoddard realizes that this career is based on a lie, and he experiences his own guilt dealing with it. The shot that actually killed Valence came from another gun, not his own. The film emphatically makes the point that perception (or rumour reported as truth) and reality are not necessarily one and the same thing. The public has lauded Stoddard all these years for a heroic deed he didn't really do.<br><br>The movie has marvelous characters and a stellar cast portraying them. Both Ranse Stoddard and Tom Doniphon, though seemingly opposite, come across as sympathetic, honourable men with great personal integrity. This is a film with TWO heroes, protagonist &amp; antagonist to one another... though jointly opposing the villainous Valence. The legendary James Stewart, such a decent man himself, is perfect in the role of the noble lawyer &amp; Senator Ranse Stoddard, who is initially opposed to gun violence, advocating education and the rule of law. He is not too proud to don an apron and wash dishes to pay for his keep. That great Western hero, John Wayne, is forceful (as always) portraying the rough hewn Tom Doniphon. His philosophy is 'the gun is the law', and he has little respect for either book learning or law courts.<br><br>Lee Marvin is downright deliciously sullen &amp; evil as the whip wielding Liberty Valence. I love that restaurant steak scene, he's just so despicable the way he holds the terrified citizenry in his grip! Few villains elicit more outrage than his heinous acts against Dutton Peabody, the drunken editor of the Shinbone Star. Liberty Valence...what an absolutely fabulous name for this wretched snake! Can you imagine any other name in the movie title?<br><br>This film seems to take a nostalgic look at the decline of the Old West and its replacement with modern civilization. Tom Doniphon of course represents the rugged frontier West. He is actually dead throughout this movie, his character revealed only through the flashback retelling of the story. By contrast, Ranse Stoddard brings from the East law and literacy to this Western town. From the time he first comes to Shinbone as a young lawyer, he teaches its inhabitants to read &amp; write. <br><br>The conflict between the old frontier ways and the new educated society based on law &amp; order is clearly revealed in the love triangle here. Both Tom Doniphon and Ranse Stoddard court the lovely and quietly spirited Hallie (played by Vera Miles). The cactus rose symbolizes her early attraction to Tom and the Old West, the real rose her newfound romance with Ranse and his Eastern sophistication. Her courtship by Tom is eventually replaced by her marriage to Ranse, causing Tom's increased drinking and gradual decline. <br><br>Other characters include the drunken Doc Willoughby and the cowardly Marshall Link Appleyard, who shrinks away from dealing with Valence. The movie is a compelling metaphor for the decline of the Old West, has a gripping plot, and surely some of the best character depictions ever. All told, it's a wonderful movie for both fans of westerns and for those who are normally not.","user":"roghache","rank":[13,13]},{"title":"Honest, unpretentious and deeply moving...","rating":9,"date":"28 July 1999","review":"Nostalgic, sour and powerful, Ford's \"The Man Who Shot Liberty Valance\" is one of the most memorable of all his Westerns... It's triggered off, and that's the right phrase, as it turns out, by flashback... The old device works well in the hands of the master... In fact, John Ford couldn't have got the feeling he's after in any other way... <br><br>Ford seems to be mourning the Old West... It's a mixed feelingcomposed of pride, regret, and a sense of the inherent injustice of life, and certain forebodings about the future...<br><br>When a famous elderly Senator Ranse Stoddard (James Stewart), looking every inch the revered veteran political figure, gets off a train at a small Western town with his good lady (Vera Miles) you can tell by the way his eye roves for and rests on bits of time remembered that this is very much a sentimental journey He's come to pay his last respects to a friend of the long, long agoa small rancher in those days, played by John Wayne...<br><br>Dissolve into the distant storypresenting young tenderfoot lawyer Stewart, eagerly intent on bringing Eastern law-books to bear on the problems of the West His first taste of the West is a sound beating up, by a man called Liberty Valance (Lee Marvin) who is a gunman employed by powerful cattlemen who oppose statehood for the Territory...<br><br>Nor does Ranse find any real custom even among the law-abiding... He starts his career, in fact, as a kitchen hand in a café where he's been taken by Tom Doniphon (Wayne) following his nasty experience with Liberty... Ford is at his 'domestic' best in this café which is run by a Swedish pair (John Qualen and Jeannette Nolan) and where Ranse's wife-to-be is one of the employees... Stewart, wearing an apron contrasted with Wayne, pure frontiersman, is something to see in that kitchen... And there's always an edge to their meetings...<br><br>It isn't hard to guess that before long the waitress, Tom's girl, is going to fail for the injured tenderfoot who takes on her education... Ranse eventually hangs up his sign in the office of the local newspaper editor, Dutton Peabody, a typical 'character', played by Edmond O'Brien, and from then on it's the story of a territory growing up and seeking statehood, with Ranse Stoddard maturing, too, as the natural leader of 'civilized' law and order aspirations...<br><br>But none of it could have happened without the removal of Liberty Valance... Ranse confronts him and the bullets fly but the bullet that actually drops him comes from another Winchester in the shadows... Ranse goes to Washington on the strength of ridding the territory of Liberty Valance, but he knows that the shot was fired by another man <br><br>It's another film about the right man being in the right place at the right time in order to advance the course of Western civilization... Skillful, undoubtedly, but in this case the right man never gets his just desertsif he ever wanted them, because the Wayne character in his way is just as much a part of the Old West as Marvin...<br><br>Herein lies the bitter essence of the film... Wayne, at heart, is as contemptuous of what Stewart stands fortalk and conferences and thick legal tomes as the gunman is And through him you feel Ford saying that the hard men who had it the hardest on the frontier are soon forgotten, and some of the frontier's simple virtues have been buried with them<br><br>\"The Man Who Shot Liberty Valance\" is honest, unpretentious and deeply moving... In no other Ford Western does the audience feel so involved... The playing is brilliantfrom the smallest role to the beautifully interpreted ambivalent relationship of Wayne and Stewart...<br><br>Their acting style are quite different... Stewart had developed a standard repertoire of mannerisms that his public had come to cherish... Wayne's style was spare, clean and unadorned; he stood tall, very much himself... Certainly this film exemplifies a wonderful blending of three great talents, Ford's, Stewart's, and Wayne's, and their seamless mutual chemistry is one of the salient aspect of it...","user":"Nazi_Fighter_David","rank":[83,98]}]