[{"title":"Low budget '80s horror is pretty effective at what it does","rating":6,"date":"5 December 2016","review":"For a low-budget American possession flick with a no-name cast, WITCHBOARD is pretty good and a cut above the average teen genre fare of the '80s. This is due to the fact that instead of bombarding us with cheap gore effects (aside from a couple of clumsy ones), the film works at and actually succeeds in creating a spooky atmosphere of dread and foreboding. The storyline is an old and clichéd one (ever since THE EXORCIST really) yet is given a breath of fresh air by the young, talented cast and the involved direction of Kevin Tenney who works hard to keep things interesting, even if much of the film is slow-paced and lacking in incident.<br><br>The plot is very thin and seems stretched at an hour and a half. Basically, girl becomes possessed by evil spirit. Nobody believes it. People die. Friends investigate background of case. More people die. Good confronts evil in a violent battle. The end. You can guess the outcome from the start but WITCHBOARD works hard to keep things as unpredictable (as is possible for such a story) and twisty as can possibly be. The death scenes are done pretty unspectacularly on a low budget (unlike those in, say, SUPERSTITION), and consist of impalement, crushing, and a cheesy hatchet in the head. I'm grateful that the film doesn't have to rely on these to work.<br><br>Tawny Kitaen takes the lead role and has a gratuitous nude scene like most young horror actresses in '80s cheapies. Aside from her irritating hairstyle she isn't too bad and almost creates a believable transition from good into evil; she may be a Linda Blair imitator but let's face it, Linda Blair wasn't that great to begin with (however, the voice-over actress and special effects men WERE). Todd Allen is pretty good as the volatile, confused boyfriend who makes the hard change from sceptic to believer, while I also liked Stephen Nichols' performance as a stressed-out former boyfriend. The only other characters of the small cast are an irritating detective with a penchant for magic tricks and an irritating medium who thankfully dies quickly.<br><br>The climatic battle between good and evil is pretty suspenseful, although the whole project is nearly scuppered by a really bad back-projected scene of someone being pushed through a window. Pretty, yes, realistic, no. I liked WITCHBOARD for its atmosphere and change of pace, and the fact that it keeps the identity of the spirit hidden for much of the movie which adds a layer of mystery to the proceedings to give the film an extra boost. Two sequels followed in the early '90s; the first is a lesser rehash of this one which is good for a laugh, the second is by all accounts appalling.","user":"Leofwine_draca","rank":[13,13]},{"title":"Accentuates suspense over gore","rating":8,"date":"13 August 1999","review":"This is one of those movies that proves that you don't need a huge budget to make a quality horror film, or any film for that matter, but we are talking horror here.  I had read many years ago that this film was made for less than a million dollars and even in 1985 that is chump change.  But this film is so pure with it's suspence that you would think it was done by a major Hollywood studio with a ten million dollar budget.<br><br>When a witchboard is discovered it is at first played for fun.  But then it becomes an obsession and it takes over the life of the woman that talks to it.  A spirit named David is a little boy that may or may not be the spirit that is possessing the Witchboard and sometimes he is nice and other times he is down right nasty.  There is also a great horror villains name in this film, Mal Veder, almost sounds like Darth Vader's distant cousin doesn't it?<br><br>What Witchboard does so well is it pays attention to detail and it pays attention to what made some of the great horror movies did.  And what this manages to do is treat the camera like it is his best friend.  The camera lurks mysteriously behind it's actors and beside them and above them and everywhere else.  And what this does is it gives you the illusion that there is someone or something there, and that is the beauty of this film, you don't know if it really is someone or something there.  This is great homage to some of the greats like Carpenter and Hitchcock.<br><br>Witchboard is a great 80's horror film and I like it for the fact that it is much more concerned with atmosphere than stupid blood and guts and unneccesary gore.  90's horror should watch films like this and use the same techniques to scare us.  Blair Witch may have watched this but films like the Haunting and I Know.... and Idle Hands sure didn't.","user":"baumer","rank":[38,44]},{"title":"Very original and tasteful for an 80s horror film","rating":8,"date":"5 June 2017","review":"80s horror films are remembered fondly for being fun and over-the-top, but most were fairly unoriginal, gratuitous and campy. Witchboard is special because its not a sequel or a ripoff of anything, isn't made for horny teens or punk rock sadists and it has a genuine interest in the scary subject matter - the occult. Director/writer Kevin S. Tenney would explore demonic possession with more fun and splatter with \"Night of the Demons\" years later on a bigger budget, but Witchboard is a good preface as its more believable, emotional and mature. I wish it was more exciting at parts but this is an independent horror film with limited means. Anyway its a good contribution to the horror genre for its time and it holds up better than many others.","user":"quridley","rank":[15,17]}]