[{"title":"Good film with some problems.","rating":20,"date":"20 April 2003","review":"I love this film.  My father, a teacher for 37 years, loved this film.  It's not the greatest cinematic effort in the world, it's not even the best film about teaching (see \"The Blackboard Jungle\" or \"Goodbye Mr Chips\").  It is, however, a fine effort and an entertaining film.<br><br>There are some great comedic moments in this film: the school psychologist flipping out and squirting Ditto in the face with ink, Richard Mulligan as a mental patient who becomes a substitute history teacher, the theft of a teacher's desk, the whole \"Ditto\" character.  There are problems, however.<br><br>The chief problem in this film is the inability to strike a balance between comedy and drama.  The film tries to raise vital issue facing schools: funding, apathy amongst staff, lack of parental involvement, safety, administrators who worry more about image than the education of their students, teen angst, conformity vs. individuality.  Much of the comedy is used to highlight many of these issues, and some of it works quite well.  At other times, it devalues the issue at hand.<br><br>There are fine performances from Nick Nolte, Judd Hirsch, Morgan Freeman, Jobeth Williams, Crispin Glover, and Laura Dern.  Richard Mulligan and Royal Dano are hysterical.  Ralph Macchio is Ralph Macchio; not much depth, but some good moments.<br><br>I don't think this is an insult to teaching, as it tries to show different styles.  Nolte is the idealistic teacher who tries to reach his students and get them involved, but has lost his passion in an uncaring system.  Royal Dano, \"Ditto\", is a teacher who has removed any responsibility in actively teaching his students and just marks time until retirement.   Allen Garfield tries to teach his class, but doesn't seem to be able to reach them and is reduced to an object of ridicule amongst his students.  Richard Mulligan is a mental patient, who through an absurd set of circumstances, becomes a substitute history teacher.  He literally brings history to life, by dressing up as various figures of history, and acting out their achievements.  He uses different methods to engage his students and they respond.<br><br>In the end, this film is a mixed bag.  It tries to illuminate the struggles of education, offers some solutions, and entertains; but, its message gets a bit lost.  Still, it's definitely worth viewing.<br><br>Incidently, one reviewer remarked about the scene where Ditto is squirted with ink, saying he is using some kind of paper machine.  For you younger viewers out there, that is a ditto machine.  In the ancient days before photocopiers became standard, teachers had to prepare their tests and hand-outs on ditto machines. It was a kind of simple printing press.  Many were hand-cranked and required a lot of effort to churn out a stack of tests.  God help you if you had several pages to print.  The ink had a very distinct smell and was often the center of student jokes about getting high off of the tests.  Ah, those were the days!  Nowadays, the best students can hope for is getting a little toner on their hands from the copier, or a faded screen on their computer.  And we used to have to walk ten miles to school, through fifty feet of snow, uphill, both ways; and we liked it!","user":"grendelkhan","rank":[35,38]},{"title":"better than I remembered","rating":7,"date":"13 June 2010","review":"When I first saw this movie shortly after it came out I thought it was a little over-the-top, despite the many memorable comic moments. Having had a chance to see it again many years later on cable I find it has more depth than I had seen in it originally. It is definitely a critique of public education, but it does not set up any easy enemies. Everyone here is complicit in a failing system - the unions, the school board, the lawyers, parents, complacent teachers, go-along- to-get-along administrators, &amp;c &amp;c. It is also touching to see how many of these people are not bad people, but are just trying to make a flawed system work (in this respect I find Judd Hirsch, as the put-upon assistant principal, the hidden gem of the movie). Having seen it again after all these years I find it provocative and, surprisingly, touching, especially Nolte's final peroration. And the best part,after all these years, is still Richard Mulligan, as the certifiable lunatic who turns out to be the best teacher in the whole damn school (a brilliant touch on the part of the writers) !!!!!","user":"rupie","rank":[9,10]},{"title":"Well done","rating":10,"date":"26 May 1999","review":"The movie itself shows nothing really new, but the acting is pretty good and everyone is well cast. Especially Ralph Macchio, who gives a great performance as a troubled youth, and doesn't give one of those annoying ones like he did in THE KARATE KID III. Nick Nolte is also enjoyable as the teacher who doesn't want to follow the school's standard procedure. Too bad the movie didn't get the notice it deserved.","user":"MikeK-7","rank":[8,11]}]