[{"title":"Cold War Thriller","rating":9,"date":"5 February 2008","review":"Henri Decoin, a great unsung French director, was never better than when directing Danielle Darrieux and the proof lies in the nine top-class movies they made together both during and after their six-year marriage (six during, three after); indeed if one were seeking a new definition of 'civilized' you could do a lot worse than cite this working relationship. With a nice touch of irony Francois Donge (Jean Gabin) lying in a hospital bed after wife Elizabeth 'Bebe'(Danielle Darrieux) has slipped a little mercury where it will do the most good and forgiven her, instructs her to continue planning their tenth wedding anniversary, whereas in real life Decoin and Darrieux were celebrating the tenth anniversary of their divorce. At 34 Darrieux was at the height of her powers and as radiant as any actress on any screen in any world. The script requires her to progress from wide-eyed idealist to bruised maturity and she takes it in her stride. They could have saved a mint on the budget because Darrieux wears Balmain throughout and this is rank extravagance on an actress who can make a Woolworth's dress look like Balmain. In the cold war aspects of the relationship Gabin turns in a prototype of the relationship he would enjoy with Simone Signoret in Le Chat although that relationship lacked light relief. Everyone is on top of their game here, Decoin, Gabin, Darrieux and Gabrielle Dorziat who punctuates the action like a good fairy who's been nobbled. I can't praise this one too highly. A gem.","user":"writers_reign","rank":[16,16]},{"title":"Anatomy of a murder.","rating":12,"date":"12 December 2001","review":"Ambitious,not always successful,this Decoin film is adapted from George Simenon. It's a long flashback,mixing present and past with occasional gaps.The black and white cinematography is thoroughly mastered:Danielle Darrieux, all dressed in black(and beautiful), like a death angel, visits her dying husband with a pallid face in a white room.Another shot, before the end, shows a car disappearing in the darkest night.<br><br>Bebe Donge is a romantic woman, a \"Madame Bovary\",who believes in true love. She does not realize that, in the bourgeois world which she lives in, these values are no longer in use.Her husband (Gabin) is cynical and does not even try to hide his lovers.In 1951,for the bourgeoisie,divorce was unthinkable:the wedding ceremony, with great pomp meant, for these hypocrites, that what the lord joined together, the world must not undo. So Darrieux ,who was a charming young woman, becomes a murderer. There was nothing to suggest that such a disaster might happen .<br><br>Although not as good as \"non coupable\" with Michel Simon,\"la vérité sur Bébé Donge\" is eminently watchable and will reward you as much as, say, a Godard movie.Or surely more...","user":"dbdumonteil","rank":[16,20]},{"title":"a whydunnit rather than a whodunnit","rating":8,"date":"17 April 2019","review":"A wealthy businessman, member of the \"haute bourgeoisie\", becomes ill with what seems like food poisoning. As his condition deteriorates, he begins to suspect his wife from poisoning him deliberately. In between ever more atrocious bouts of delirium and pain he reflects on an uneven and ill-advised marriage...<br><br>\"Bébé Donge\", based on a book by Simenon, is both a thriller and a tragedy. It is an indictment of those humans who marry quickly and stupidly, without taking the time to study their prospective partner closely and to ask the fundamental questions : what do you expect from life, what do you expect from marriage, what do you expect from me ? Do you actually like me ? It is also an indictment of those fools who encourage that kind of behaviour, amidst many a cry of \"love will come later\" or \"you will have all the time in the world in which to get acquainted\".<br><br>While not a feminist tract, the movie also has some insightful things to say about the age-old double standard. (You know what I mean : a woman should be a timid virgin before marriage and, later on, a faithful wife, but a man - whatever his age or condition - can jump whatever moves him. And his wife shouldn't get all weird about it, because he's a good provider.)<br><br>A dark, sombre movie, but well worth a watch, with a Gabin and a Darrieux on fire.","user":"myriamlenys","rank":[3,3]}]