[{"title":"had to watch it twice","rating":9,"date":"19 January 1999","review":"I'm just starting out into the vast world of foreign film and having seen this film on many a video store shelf, and knowing that it was considered a sci-fi classic, I thought it would be a good way to spend an evening. Based on the case I was expecting something along the line of typical American sci-fi. Needless to say I was wrong.<br><br>I watched Solyaris twice in two days, because the first time I saw it I knew that I hadn't processed even a quarter of what I knew was there. I was taken completely aback. The second viewing was extremely rewarding.<br><br>It was unusual for me, raised as I was on the sledgehammer moralizing and we'll make our point so obvious that there's no way you can miss it because we have no respect for your intelligence way of American film. I'm a huge literature buff, and this was one of the very few films I've confronted that is thoughtful and has so many things to say yet does it in a literary or poetic fashion.<br><br>You will get out of this film what you bring to it. I've been to so many movies where the audience is not actually participating, it's being attacked. But true art is not domineering; it woos you.<br><br>So to sum up, I greatly appreciated Tarkovsky's unwillingness to manipulate the viewer. It showed that he had respect for me as a thinking soul, and it is this love and respect for humanity which makes this a truly great film.","user":"MrsRainbow","rank":[451,521]},{"title":"A dream-like examination of love and first contact","rating":11,"date":"11 March 2001","review":"Two truths drive this film: the inadequacy of human-kind to understand the Universe, and the inadequacy of human-kind to understand the human heart.<br><br>As such, using Lem's original idea, Tarkovsky successfully, explores these themes.<br><br>We are drawn in, through hauntingly beautiful imagery, to the internal struggles of Kris Kelvin as he attempts to understand feelings of love for his suicided wife, who has been mysteriously resurrected, presumably as an attempt by Solaris to communicate, or torture.<br><br>Of course Solaris is probably the most original alien ever concocted, (no phone-homes here) and as must be, utterly enigmatic and beyond communication.<br><br>Be warned, this film is very long, and sometimes slow, but for those who consider themselves science fiction addicts, it is a must view.<br><br>One of the top 5 sci-fi films of all time.","user":"sowr","rank":[199,232]},{"title":"\"Nobody loves poetry like a Russian!\"","rating":9,"date":"7 October 2005","review":"This line from Dr Zhivago says all you have to know about Tarkovsky. He was a thinker and a poet. An artist who's work was at once smart, engaging and aesthetically beautiful! Solaris is a world that materialized thoughts and absorbs creatures into its own consciousness. \"Solaris\" is an allegory on man's place in the universe, the twisted concept of reality, the meaning of love, grief and - ultimately - life. Psychiatrist Kris Kelvin goes to the station orbiting the planet-entity to assess whether the madness of it's occupants means all exploration should be discontinued. What he finds there are all the demons he has brought with him. You the viewer shall experience the same thing, for Solaris is an inviting and questioning but never manipulative film. What you'll get out of it depends on what you bring with you.<br><br>Solaris is often accused of being slow. This is a common misinterpretation: Solaris makes you anxious, and willingly so. Too many segments are like mirrors that invite your mind to venture off into many uncomfortable a place (the traffic scene comes to mind: an allegory for the space voyage but also for fading life and powerlessness). Solaris also makes you fear, with a sense that something isn't quite right and as with the best horror films, what you dread often isn't even on screen. Solaris makes you heart ache on several occasions as well. It makes you miss loved ones and it makes you feel homesick. every additional minute that separates you from the gorgeous opening shots of nature makes you long for Earth.<br><br>Solaris is many things but above all it is simply more than entertainment: it is a voyage for the senses, like a favorite song that binds countless disconnected feelings and thoughts. It is a poem.","user":"OttoVonB","rank":[170,203]}]