[{"title":"It is all in the mirror","rating":10,"date":"23 May 2004","review":"I just finished watching it. It's been several years since I saw it last time. I worried that I may not like it as much as I used to...<br><br>I should not have worried - I love it even more now if that is at all possible. I've seen it at different times of my life - first, as a college student many years ago in Moscow; I keep returning to it all my life.<br><br>When Tarkovsky's Zerkalo (The Mirror) was first released, it divided the audience completely. I remember how my friends were passionately discussing it. One girl was complaining that she did not understand anything; the movie was confusing for her, dark, disturbing, the children characters - sad, pale, poorly dressed. I remember her asking, \"Why did they show a boy in the opening scene that had an awful stutter, and they never showed that boy again? What did it mean when the dying man in bed was setting a bird free? How did he get the bird on the first place?\" Another friend of mine, a guy, tried to explain the things to her. He suggested that she thought about the times Zerkalo was showing, he tried to explain to her Tarkovsky's symbolism where the bird could be representing life and soul of the main character and the boy with the stutter could mean that it was most difficult for people to communicate and understand each other. <br><br>I only listened to their argument and did not participate because I had not seen the film yet. When it finally happened, Andrei Arsenievich Tarkovsky was presented at the screening and he talked to the audience before the show. I remember him repeating over and over that there were no tricks, no puzzles, and no tongue-in-cheeks in the film; that every symbol, image, dialog, and sound was there because they belonged there. He asked us if we had questions. Someone from the audience suggested that we saw the film first, and then, asked questions. Tarkovsky replied that from his experience, not many viewers would sit through the film and who ever would, usually leave in silence, not asking anything. And then he told us a story. After Zerkalo was completed, it was first shown to the group of the famous critics. After watching it, critics started to argue about it, trying to find the hidden meaning and make sense of what they just saw. It went on and on until the cleaning lady who came to the screening room and had been waiting for the end of discussion to do her job, asked them for how long they would stay? Someone said to her that they were discussing a very complicated film, and they needed time to understand it. Cleaning lady asked, \"What is that you do not understand in this film? I saw it also, and I understood everything.\" Critics were silenced for a moment, and then, one of them asked the woman to share her thoughts on Zerkalo. She answered, \"It is about a man who had caused too much pain to the ones whom he loved and who loved him. Now he is dying and he is trying to ask them for forgiveness but he does not know how.\" After the pause Tarkovsky said that he had nothing else to add about his film to what the cleaning lady had to say.<br><br>I never understood complains that Zerkalo is a very confusing, difficult, and dark film. No, it is clear and deep as a mirror. Tarkovsky said so himself, and I believe him. Every time you look at the mirror, it will show you new depth and reflections. Past, presence, future, memory, love, guilt, forgiveness, beauty, sadness, nostalgia, and sacrifice - the mirror reflects it all -just watch closely. This is the film about his family, his country, and his times. Childhood memory and the memory of the past generations glued together. The film is a look back in time and sad realization that children reflect destiny of fathers, as in a mirror. Destinies reflected one in another. <br><br>Zerkalo is not just good cinema, it is pure cinema. Like architecture is music in stone, Zerkalo is poetry on screen. <br><br>My verdict – The Best Film ever made, the top of my list (tie with Andrei Rublyov).","user":"Galina_movie_fan","rank":[526,550]},{"title":"Rules are there to be broken","rating":9,"date":"18 February 2005","review":"To many Mirror is possibly Tarkovsky's most inhibitive and uninviting work, be as it may not a story in the traditional sense but rather an assemblage of images, scenes, and thoughts which at first sight seem to have very little in common and just drift back and forth with no obvious literal explanation. It's only after repeated viewings and the realisation of what it actually was that Tarkovsky tried to achieve that it dawns that this is more than just a bunch of random scenes, but a timeless and highly important masterpiece which defies explanation. But I'll try anyway.<br><br>I personally hold Tarkovsky in very high esteem. There are many directors I would regard as good or very good (for instance Kubrick, Kieslowski, Ozu, or Miyazaki), but there are only two directors I regard as absolute geniuses: Akira Kurosawa and, yep, Andrei Tarkovsky. Interestingly this is for two solely different reasons - whereas I admire Kurosawa for the manner in which he managed to perfect the art of cinematic storytelling, Tarkovsky deserves praise for wanting to shake cinema out of its complacent acceptance that films should simply tell a story and little else. Mirror is further proof that Tarkovsky's body of work (which is limited in quantity - a mere eight films - but rich in scope) establishes that the Hollywood mode of narrative is not the only way in which film can create an emotional response from an audience. Of course Tarkovsky is not alone in having done so (Marker and Greenaway immediately spring to mind), but what distinguishes him from other \"art house\" directors is that he has managed to take this style of film making and drive it to a stage that can be described as almost perfect.<br><br>I personally interpret Mirror as a man's life flashing before his eyes before he dies; his relationship with his wife and mother (both played by the same person, in an ingenious move on Tarkovsky's behalf), his children, his friends, the history of his home land, his own childhood. However, Mirror is deliberately structured in such a way that it can, and will, be interpreted differently by different people depending on how they inscribe their own personal thoughts and feelings into the narrative. This is where Tarkovsky's genius comes to fore - to create a film which does not dictate to an audience how to feel by manipulating them via music or mise-en-scene, but to make it the other way around. In the case of Mirror, we, the audience, dictate the emotional response created by the images on screen and, that, ultimately is that makes it such a wonderful work and a true rarity. This is possibly another way the title of the film can be interpreted, in that it illustrates a wholly reflective style of cinema.<br><br>Those not accustomed to a slightly more disjunctive cinematic style are likely to dismiss Mirror as boring or dull because it may not necessarily correspond to their expectations of film. However, it is still something I would regard as required viewing for everyone since it shows that cinema can be beautiful without necessarily following the rules Hollywood has imposed on the rest of the film making community, and that ultimately rules are there to be broken. A masterpiece, no less.","user":"desh79","rank":[184,202]},{"title":"Tops","rating":26,"date":"26 March 2001","review":"It's not easy to make such judgments, but this is my favorite film. A personal choice, for sure, but what MIRROR achieves is the height of poetry and literature. Its final moment, if it works for you (and I can imagine it wouldn't for all), is a success of the \"method of indirection\" sought by poetry. Its effect is cumulative and devastating.<br><br>People often stress the difficulty of this film, but my only answer is to allow it to wash over you and allow it to have its effect. The first time I saw it, I was amazed, but a little baffled. The second time I cried. Each time since then I've teared up, if not actually wept. Its presentation, in its last shots, of the totality of the human experience, combined with the Bach's St John Passion, crushes me every time. And I'm not even Russian. Nor am I religious--this is the closest I get to religion. You just have to be human to understand MIRROR. This is the way of all Tarkovsky.","user":"the_monocle","rank":[145,160]}]