[{"title":"Vanna White and Linnea Quigley -- together at last!","rating":21,"date":"21 September 2002","review":"(** out of *****) Yet another school-related slasher -- this time a high school track team is the target of a psycho decked out in fencing garb who seems to be upset over the fact that a girl collapsed and died on the track a year ago.  Of course, everyone's a suspect, including the girl's odd, but tough, older sister, Anne (Patch Mackenzie), who's home from the Marines (or army, or whatever) to accept a post-humous award for her, and the hard-ass track coach (Christopher George), who most everyone blames for the girl's death.  There are some fairly creative murders (including a lethal football with a sword shoved through it), but it's difficult to tell who the main character is, because Mackenzie disappears from the movie for about twenty-five minutes! Meanwhile, we're treated to typical incompetent principals (Michael Pataki), typical lecherous music teachers, and typical jerk security guards.  There are a number of minor sub-plots that never get resolved and only work to slow the movie down.  Still, it was nice to see an entire stage performance from the rock band Felony (I've never heard of them either.)  The direction shows some attempts at style here and there -- it doesn't always work, but it never hurts to try, I guess.<br><br>HIGHLIGHT:  This is probably worth renting if only for the fact that it's probably the only time you'll ever see game show co-hostess Vanna White and B-movie scream queen Linnea Quigley sharing screen time (albeit, all too briefly) ... and their names even rhyme -- Doris and Dolores!  God help me, but I get a satisfying little kick out of things like that.","user":"BillyBC","rank":[16,20]},{"title":"Not your average 80s slasher pic...","rating":7,"date":"7 July 2001","review":"I'll start by saying that I am a huge fan of the slasher movies of the early 1980s; flicks such as \"Friday The 13th\", \"Final Exam\" and \"The House On Sorority Row\" hit the spot rather nicely.<br><br>\"Graduation Day\" was one of the first films in this category. Released in 1981, the plotline tells the story of a track-team star runner who drops down dead after a particularly taxing race. Despite the fact that no-one actually killed her (she fell victim to a blood clot), the blame for her death has rested with the track-team coach for the past six months... it appears he worked her too hard.<br><br>The runner left behind a loving boyfriend, a loving sister, a loving mother and a hate-filled stepfather. All of these are reunited on Graduation Day, when the sister is invited to receive a special award on behalf of the deceased star. However, the day before graduation -- and literally minutes after the sister appears on campus -- one of the track team is brutally murdered in the college grounds.<br><br>Her body is not discovered immediately, and so the usual pre-graduation celebrations are taking place. But, in between these parties and rehearsals, more of the track team are dispatched in truly original style. Still the bodies remain unfound.<br><br>So who is this killer? Is it the sister, jealous of the team who survived her younger kin? Could it be the boyfriend, who only true love was taken when an artery burst in her left leg? Has the coach cracked up, after losing his job and being widely blamed for her death? Or is someone else hiding a terrible secret?<br><br>\"Graduation Day\" is a wonderful movie; full of suspense, above average acting and some ingenious plot twists. Various sub-plots are added in an attempt to cloud your prediction of the killer's identity and the ending comes as somewhat of a shock (it did to me, anyway!). When you consider that this is one of the first \"campus slashers\", it is rather amazing.<br><br>Most movies have a few shortcomings, however, and \"GD\" is no different. I feel that too many 'false scares' were implemented by the director (the first two or three are genuinely scary, but they get rather tiring after this) and about half way through the film we get a five or ten minute 'drag' period which you feel like fast-forwarding through. On the whole, though, these are certainly not major failings and do not impair the film overall.<br><br>In summary, I would recommend \"Graduation Day\" to anyone fond of whodunit slashers like \"Final Exam\", \"Scream\", \"I Know..\" and \"Prom Night\". Fans of flat-out gore will likely be disappointed as gore is de-emphasised in the movie, but this is all the better IMHO. And whilst \"GD\" isn't going to win any Oscars, you could do a whole lot worse if you're looking for a fun, scary and clever horror movie.<br><br>8 out of 10, BuffyAngel","user":"buffyangel","rank":[13,17]},{"title":"\"They're Animals! I Swear, They Get Worse From Year To Year!\"...","rating":3,"date":"11 September 2018","review":"GRADUATION DAY starts off at a high school track and field competition, where a runner named Laura Ramstead (Ruth Ann Llorens), drops dead after winning a race. Soon thereafter, a mysterious figure is hunting down and killing the school athletes. At the same time, Laura's older sister, Ann (Patch Mackenzie) arrives in town for the titular event. Could there be some other reason for her return? As for other possible suspects, there's an entire school of red herrings to choose from. Especially, the explosive, overbearing coach Matthews (Christopher George- PIECES), who yells his lungs out at every opportunity. In fact, all of the adults in this movie are either leches, idiots, or lecherous idiots! The students aren't much better! They're as ridiculous as the means of their deaths, which include: death by sword, spikes, and football! Watch for Linnea Quigley (SILENT NIGHT DEADLY NIGHT, THE RETURN OF THE LIVING DEAD, NIGHT OF THE DEMONS) as Dolores, who instantly sheds her top, as in most of her projects. Also, look quick and you'll see Vanna White in designer jeans! WARNING: This movie contains intense \"roller boogie\" scenes, and 80's \"rock music\" being played! Don't worry though, because there's not one second of this movie that can be taken seriously! Nope, not at all. Co-stars Michael Pataki (GRAVE OF THE VAMPIRE) as the insufferable Principal Guglione...","user":"azathothpwiggins","rank":[4,4]}]