[{"title":"Louise Brooks Was a Star","rating":10,"date":"5 March 2005","review":"and this film proves it. Beggars of Life is a gritty tale set against some beautiful images in the way that Sunrise or Days of Heaven used visual imagery. There are some stunning scenes and great camera work. William Wellman directs. Brooks stars as a girl on the run with a man she meets (Richard Arlen). The picaresque tale takes them west as they try to get to Canada. They run into a hobo camp where Oklahoma Red (Wallace Beery) takes control of their destinies. Great performances by the stars. The camera work on the trains is great, and the stars do their own stunt work. Brooks was always a difficult star, and she paid the price by losing her Hollywood career. Too bad. This 1928 silent shows she had real talent. Although she gets 3rd billing, she is the center of this remarkably adult film about sin, love, lust, honor, and hope. Beery is good, but Arlen is wonderful in his \"big brother\" role. Roscoe Karns and Guinn Williams (familiar faces in 30s films) co-star. But Louise Brooks is the reason to see this, her best American film, especially if you've seen her German films with Pabst. A must!","user":"drednm","rank":[31,31]},{"title":"Phenomenal","rating":10,"date":"14 August 2002","review":"I wish for nothing more than a valid version of this great movie on DVD. It's been a while since I last saw it, but the impression has been a lasting one. True empathy lasts through the ages and there is a poignancy about 'Beggars of Life' that is phenomenal. All actors shine in career-defining roles, direction is sensible to minuscule moods, and the overall effect is overpowering. One of the best flicks to come out of Hollywood in those pre-talkie days. Can't wait to see it again.","user":"mik-19","rank":[19,20]},{"title":"Brooks stellar in \"Beggars of Life\"","rating":8,"date":"5 March 1999","review":"\"Beggars of Life\" is (and I hate to use this word) awesome. Louise Brooks takes command of this photoplay right away and makes it her own. Watch her act with her facial expressions in the scene inside the haystack. Brooks' acting is very subtle and is quite effective. She is in good company with Richard Arlen, always a fine actor, and Wallace Beery, whose portrayal of the complex Oklahoma Red is excellent. The all-male supporting cast is also of high quality. This is a first rate cinematic event with a first rate actress and supporting cast. It is something modern day film audiences should not miss.","user":"HAL-57","rank":[18,19]}]