[{"title":"Worth viewing, but it's not the film Franco intended","rating":4,"date":"4 February 2003","review":"'Marquis de Sade's 'Justine'' (1968) is easily Jess Franco's most accomplished film, esp. from a technical standpoint, backed by the biggest budget he would ever have.  Rich, brilliant colors, skin aplenty, a few perversities, and strange performances from Klaus Kinski, Jack Palance and Mercedes Mccambridge make for an entertaining but relatively tame Franco outing.  To boot, Jack Palance's performance ranks as possibly the most bizarre ever seen on film.  The dvd includes a revealing 20-minute 'making of' documentary featuring an extensive, contemporary interview with director Franco, and he doesn't hold back.  Franco states that Palance was sauced during the entire shoot, drinking red wine all day, each day, starting around 7a.m.<br><br>Kinski's role (as de Sade) was originally handed to Orson Welles, but once Welles read the script, he claimed that he simply could not play the part because it included scenes of erotica.  In reality, Welles would have had to do a scene with several totally naked women, and this may have made him uncomfortable and nervous.  Interestingly, the de Sade character has no lines, and Kinski's scenes are just a bunch of cutaways of him sitting/pacing in a prison cell, mentally tortured, trying to write 'Justine'.<br><br>Franco intended to create an explicitly nasty, masochistic film faithful to de Sade's writing; however, according to Franco, he was forced into a watered-down, `Snow-White-lost-in-the-woods' direction because of the producer's decision to cast Tyrone Power's daughter, Romina Power, in the title role.  `She was a passenger, wandering around,' Franco scoffed. `She was like a piece of furniture.  It was as if I was making Bambi 2'.  The role was intended for Rosemary Dexter, who appears in the film in a lesser role.<br><br>Franco's version of 'Justine' is not as grim or as depressing as Chris Boger's 'Cruel Passion' (1977), starring Koo Stark, but it's also not as nasty or as perverse.  Too bad for Franco fans.    --- david ross smith","user":"doktor d","rank":[36,38]},{"title":"Bad Taste Triumphant - Great Fun!","rating":14,"date":"14 October 2003","review":"Sorry to disappoint, but Justine is by no means the welter of non-stop gore and perversion you might expect from a confluence of Franco, de Sade and producer Harry Alan Towers. Adapted from the Marquis's sublimely immoral 'moral tale,' it plays for much of its length as a bawdy 18th century romp in the style of Tom Jones. Naturally, with the added joys of cut-rate production values and dodgy acting.<br><br>We only hit familiar Franco territory when our heroine (a bland Romina Power - yes, Tyrone's daughter) is ravished by a coven of depraved monks. Cue for lots of naked Eurotrash starlets, trussed up in chains. Gee, it's good to be home!<br><br>So Justine is not quite your typical Franco production. For a start, it has something approaching a budget. That means a lot of semi-big names (most of whom have seen better days) show up as 'guest stars.' Indeed, the film is best watched as a vast costume party, whose guests have been invited to Come-As-Your-Most-Embarrassing-Moment.<br><br>Hence we get Akim Tamiroff as a drunken pimp, Mercedes McCambridge as a lesbian brigand, Sylva Koscina as a cross-dressing noblewoman and Klaus Kinski as the Marquis de Sade himself. The grand prize must go to Jack Palance as Brother Antonin, spiritual leader of the above-mentioned depraved monks. His may be the most deranged performance in the annals of screen acting.<br><br>Weighed down by the baggage of an international tax-shelter epic, Justine never comes close to the dreamlike delirium of Succubus or Virgin Among the Living Dead or any of Franco's more extreme, smaller-scale works. Still, it's a lot of fun - in its utterly reprehensible way.<br><br>Franco himself even crops up as the ringmaster of a grotesque peepshow, where Justine is forced to appear after she survives any number of Fates-Worse-Than-Death. Now that's what I call typecasting!","user":"dwingrove","rank":[18,22]},{"title":"Very strange film but certainly not unwatchable","rating":5,"date":"22 March 2015","review":"Marquis De Sade: Justine is a long way from being unwatchable as there are a number of things that are good. It is however a very strange film and not a very easy one to rate.<br><br>Starting with what is good about Marquis De Sade: Justine, coming off best is the music score which is outstanding, if on occasions overpowering, very stirring and rich in sound and it fits the film very well. The film also looks good, the sets are simply gorgeous, the plentiful costumes are certainly attractive and a lot of care was clearly put into the cinematography which is beautiful. The crowd scenes are tense and rousing and while he sometimes overdoes with the fading in and out Jesse Franco does give some of his most competent directing ever, though it does feel very different for him. While I was not very impressed with the acting generally, the charming Maria Rohm makes the most out of her brief role and Mercedes Mccambridge is an absolute hoot.<br><br>Romina Power is very wooden in the lead role on the other hand, while Klaus Kinski is criminally underused and pretty much wasted, spending his entire screen looking remote, and Jack Palance is embarrassingly over-the-top and out of place. I like Palance but not here, he's not as bad as he was in Che! and Outlaw of Gor but this is one of his worst performances. While the film is undeniably fun there are too many times where the story is episodically disjointed and lethargically paced, sometimes not as cohesive as it could be. It also feels very tame and toned down by today's standards and not sleazy or sensual enough, the story is one where those qualities are necessary and it just felt bland and agreed too correct. The ending is very heavy-handed when you can actually hear the dialogue when it's not being drowned out the stilted way it's written and uninvolved line delivery from most makes it not really worth listening to.<br><br>In conclusion, not unwatchable but very strange and not easy to make of. 5/10 Bethany Cox","user":"TheLittleSongbird","rank":[6,6]}]