[{"title":"Fascinating but frustrating!","rating":14,"date":"14 August 2000","review":"Now, we shouldn't look to Rossen's film for actual history, EXCEPT as reflected in later romance and, indeed, the Alexander legend. The film does indeed egregiously telescope events and make a complete chronological, genealogical and motivational muddle of real historical events. Absolute realism is not the point of the film, however -- Hollywood is guilty of much simplistic remaking of history, but Rossen's film is much more personal and ambitious in grand design if not in little details -- the portrait of Alexander as a man, brilliantly realized on many levels by Richard Burton, is the real focus of the movie. What we have here is a portrait of the disintegration of the character of a promising, ambitious young man, intoxicated with power and the lies accompanying that, and the formative power that the strong personalities of his parents, Olympias and Philip, had over Alex's mind.<br><br>For this last reason, I find the first half of the film to be superbly done. His stimulating contact with Aristotle, the camaraderie between him and his companions, and especially his complex relationships with Olympias and Philip are brought out beautifully (if necessarily briefly), by Burton, in the film. (Most of this is derived from the late Greek biographer Plutarch's \"Life of Alexander\".) Burton plays the young Alexander beautifully, full of emotional ambiguities and hidden resentments. The murder of Attalus after the assassination of Philip is not only presented as the first of Alexander's blood crimes, but as a necessary consequent of his upbringing, as abetted and encouraged by his amazing, monstrous mother. The rest of his career is presented not only as a continuation (and surpassing!) of his father's ambitions, but as a fulfillment of Olympias' own expectations for her son. The psychological complexity here is exquisite, and appropriate.<br><br>\nThis fine beginning makes the rest of the film redundant and annoying. We, of course, expect a good exposition of Alex's adult achievements, but Rossen is frustrated at being tied to history here (mostly derived from the ancient historians Arrian and Diodorus), and we are treated to a perfunctory, lazy account of all of his victorious battles and conquests. (For instance, the battles of Ipsus and Gaugamela are conflated into one encounter, and the degeneration of Alex into a paranoid alcoholic is too broadly played.) The usual \"cast of thousands\" used in the battle scenes are not convincing, and we do not feel that the fates of nations and peoples hang in the balance. We are not granted any glimpse of Alex's genius at tactics and generalship. Darius is a mere cipher, not a convincing King and opponent. Only Peter Cushing as Memnon gives us a spark of convincing opposition to Alexander's tyranny, and he refreshingly reminds us that not all Greeks responded to Alex's call for a \"Panhellenic\" crusade against Persia. (In historical fact, more Greeks, in all probability, fought AGAINST Alexander than for him!) Memnon's death at the battle at the Granicus is also an unhistorical invention; he died of disease a year or so later, after leading the increasingly successful resistance to Alex in western Asia Minor. His wife Barsine was certainly a captive to Alexander, and probably bore him a son as well, but this fact is blown up far too much in the film. The real Alexander's emotional attachments were homosexual (to Bagoas, Hephaestion, Cleitus, et al.).<br><br>In short, the first half of the film is well realized and acute, while the second half is confused, hurried and unsatisfying. We understand much about Alex from the family drama in the first part; we understand little about him from the second. Rossen certainly had limitations in telling this story; if he had a larger budget and less (at the time) conventional restrictions on telling a story, then we would have had a different and better (and much longer!) movie. The golden age of the epic film may well be past, but I think that it can still be told. Consider this review as a challenge: this story can be told, well, and at length, with all the richness and complexity of the real, without sacrificing drama and immediate interest. This is certainly one of the most fascinating stories of recorded history, and it is a shame that Rossen was unable to complete what he had so brilliantly begun.","user":"markcapps","rank":[38,44]},{"title":"Too ambitious for a movie but fun for the Alexander fanatic!","rating":5,"date":"18 April 2001","review":"As long as you don't mind the historical inaccuracies, this movie may prove helpful for the Alexander fanatic (like myself).  After 1st seeing this film, I was horrified by the botch job that was done on the real Alexander story, but after forcing myself to sit through it a 2nd time I was able to lighten up a bit on the factual content, and just look for any great scenes that this film had to offer.  Particularly, is the scene where Alexander goes to Athen's and the background shows a beautifully recreated shiny white Erectheon. Later, Alexander walks through the Parthenon...a dream scene of ancient history buffs everywhere. Another good scene was right before the Battle at the River Granicus.  Here Alexander eyes his opponents on the opposite river bank, and comments on who will be the 1st to fall...Richard Burton did a great job in some scenes, but overall seemed to lack the charisma that exemplified Alexander. He has the look, but the British accent doesn't suit Alexander very well.  I could go on, but really, see it yourself, or better yet, read \"The Campaigns of Alexander\" by Arrian, it is much more than any movie could ever be on this enigmatic historical figure.","user":"chrinic27","rank":[20,23]},{"title":"A philosophical epic","rating":7,"date":"10 February 1999","review":"I have always been fascinated by the short and violent life of Alexander of Macedonia, which of course makes me biased in reviewing this film.  It has been said of this film that Robert Rossen, who produced, wrote and directed this film, was aiming for a masterpiece but failed honorably.  While this is true in a way, I still enjoyed it more than that. This movie is not fast in pace, and the direction is not perfect either, but it feels authentic.  I'm sure that not everything portrayed is true to history (does anyone really care?), but it is convincing, and the acting is solid.  Richard Burton is a very good Alexander, and he adds a lot of subtle edges to this enigmatic figure from history (just ignore the silly blond wig...)  All in all, Alexander the Great is a good film, perhaps too ambitious, and even though it is not very accessible to viewers not familiar with the territory, it is still quite dramatic, convincing and enjoyable if you like historical epics.  And even though the film doesn't ask you to care too much about the characters, it is still an interesting, intellectual, and high minded story you probably will not forget.  If you keep in mind that it is the events of history that are really on display here, and not so much the individual players, you may enjoy it as I did.","user":"Erik G.","rank":[34,42]}]