[{"title":"'Unstuck in Time' makes for interesting narrative","rating":8,"date":"16 August 2001","review":"I give this film a 7 out of 10.<br><br>It makes an eloquent statement about how traumatic moments in our life stay with us as if it just happened yesterday'.   What makes this film so appealing is how it depicts what would happen if you could jump around your entire life.  When the future influences the past,  it takes on a great significance.   Billy Pilgrim is a humdrum Optometrist who nevertheless has an exciting life,  surviving the bombing of Dresden in WW2,  living through a plane crash, and being transported to another planet.   Yet he maintains to be humble.   As we follow Billy's life,  the portrait of mediocre America is a touching contrast to the other moments that are frightening.   He knows how he will die,  and in the process becomes unafraid to live life to it's fullest.   The inhabitants of the planet Tralfamador (??) say it is best to concentrate on the good moments in your life,  and not so much on the bad. But they are still there,  and you cannot erase that moment of your life. In essence,  the true moral of this film is to accept all that has happened in your life.  For if you don't,  you deny the validity of your existence. When Billy finally writes about his adventures,  others have a chance to learn about the world and themselves that would've otherwise been denied.<br><br>\nTechnically,  the film uses the moments where Billy jumps in time as meaningful transitions.   It interweaves lessons learned from one part of his life and applies it to the present moment (whenever that is).   The film's real treasures are the supporting characters that surround Billy. It also vividly transports you to WW2,  a semi-autobiographical account of Kurt Vonnegut's real life experiences in Dresden.   The film is filled with anecdotes that present the film's other main theme,  that life is indeed ironic.<br><br>I was deeply touched by this film,  with it's ability to whisk you from scenes of horror to amusing Kodak moments'.     The music poignantly represents these transitions,  and helps to carry the film.    In the end, you can accept his death,  by having lived his life.","user":"kgprophet","rank":[57,66]},{"title":"Brilliantly Directed By George Roy Hill","rating":10,"date":"24 June 2002","review":"The realization of this glimpse into the mind's eye of a man unstuck in time is brilliant to behold.  Yes, the book is a brilliant work in its own right, and open to interpretation, as a truly complex work must be.  The movie is not the book.  It is Hill's interpretation of the book, and a brilliant and viable one it is.  <br><br>Hill won the best Director Oscar the next year with \"The Sting\".  He later filmed the similarly unfilmable \"World According To Garp\" and also did a brilliant job with it, partially by letting go of John Irving's more depressing side.  Other notable credits include Butch Cassidy... and The Great Waldo Pepper.  <br><br>Michael Sacks, in his first movie, and only starring role at the tender age of 24, is completely convincing and natural.  He is equally effective, compelling, and believable at the six distinct stages of Pilgrim's life memorialized herein.  If he weren't up to the six-in-one role, the film wouldn't work, but he is, and it does.  (I wonder why he has no other major credits, and ceased acting altogether in 1984.  If anyone knows, please e-mail me.)<br><br>Valerie Perrine is fine as Montana Wildhack.  The other characters are all played for maximum irony and effect, and the cast delivers beautifully, without exception.  Eugene Roche is the epitome of kindness as Edgar Derby, the yin, to Ron Liebman's yang, a twisted ball of anger named Paul Lazaro. John Dehner is brilliant as a war-hawk professor upset at the Vietnam protesters.  His character would be as appropriate amidst today's global conflagration as it was in 1966.  Lucille Benson, Kevin Conway, Sorrell Booke, Holly Near, Richard Schaal, and Perry King are the more familiar names in a uniformly excellent cast, including the German actors.<br><br>The musical score is also perfect, both in tone and substance.  Vonnegut is a master of superimposing satire over irony over futility.  The movie does a marvelous job of blending these contrasts and making its audience feel enriched.  The music underscores all of these contrasts.  The cinematography also is magnificent.<br><br>Searching desperately for something to say to show that the movie cannot be 100% perfect, the only thing I can come up with is that the pacing of the movie drags slightly when the soldiers leave the first camp for Dresdner until their new Kommandant gives his \"welcoming\" speech.  It might have played better with about three minutes cut from that sequence.  So what?<br><br>I recently saw Slaughterhouse Five for the fifth time in 27 years since I originally saw it at my college campus -- this time on DVD.  I never fail to catch something new, and I never fail to enjoy it all the more.<br><br>Given how many 70's movies have failed miserably to withstand the test of time, Slaughterhouse Five is a true treat to be savored.","user":"herbqedi","rank":[75,90]},{"title":"Pleasantly Surprised","rating":10,"date":"9 July 2004","review":"Like most of those who have posted before me, I am an avid Vonnegut fan and went into this movie with a guarded optimism that it would just be decent.<br><br>But George Roy Hill did an excellent job conveying the overall feel of the book -- the time jumping was flawless and I didn't find it hard to follow at all. The actor who played Billy Pilgrim captured Billy's passive, calm and vaguely anti-social demeanor. Lazarro, Montana and Billy's wife are also well played. <br><br>George Roy Hill had a knack for directing movies made from great books -- e.g., \"The World According to Garp\" -- and in the end, I was pleasantly surprised how well this movie turned out. <br><br>As far as the Vonnegut adaptations go (I know of four -- this one, \"Mother Night,\" \"Breakfast of Champions\" and the god-awful \"Slapstick\") this one is the best of the bunch. <br><br>I've always wanted to see a movie version of \"Sirens of Titan,\" but it'll probably never happen -- so \"Slaughterhouse Five\" is my only chance to \"see\" Trafalmadore. <br><br>Recommended to any true Vonnegut fans. Other people probably won't appreciate it.","user":"mmoore18","rank":[58,71]}]