[{"title":"Sweating It Out with Broderick Crawford","rating":8,"date":"25 August 2007","review":"Watch Crawford sweat this one out! Great fun with Broderick Crawford as managing editor of a \"Scandal Sheet\" newspaper, with John Derek and Donna Reed on staff as reporters. The film uses the technique of showing the murderer's identity as the crime is committed (it's editor Crawford); then we watch him squirm as the reporter hero (Derek) and heroine (Reed) try to identify the killer and cover the story. <br><br>Mr. Crawford must give the \"Lonely Heart Killer\" big coverage in his tabloid newspaper, or risk suspicion. When a possible witness turns up, things get complicated. Henry O'Neill is great as a washed-up old drunk who used to work for Crawford's newspaper. The film has a great style beautiful black and white photography directed by Phil Karlson. Recommended viewing! <br><br>******** Scandal Sheet (1952) Phil Karlson ~ Broderick Crawford, John Derek, Donna Reed","user":"wes-connors","rank":[26,26]},{"title":"Excellent Seldom seen Film Noir...","rating":8,"date":"25 August 2007","review":"Broderick Crawford stars in this exciting film noir from 1952..Fast paced &amp; keeps viewer in suspense till the end..Excellent cast, including Crawford, handsome John Derek, intelligent beautiful, Donna Reed.and Harry Morgan..However..ROSEMARY DeCAMP, is outstanding in her brief but important scenes.. This is unlike her other screen work..Rosemary ,for me, steals the show!.Worth seeing ..Thanks again to TCM for showing this today on Broderick Crawfords day a fine, underrated actor . I started watching @ 20 minutes after film began ( I don't usually do this)and I was \"hooked\" as I saw Rosemary DeCamps close up at rally for \"forlorn lovers\" DeCamp recognizes Crawford ,her former husband, who has now changed his name and persona.. I stopped everything and could not stop watching till the end I wont tell you what happens.I hope TCM shows again soon so I can view the scenes I missed at the beginning","user":"olddiscs","rank":[21,21]},{"title":"Solid suspense and well-paced","rating":8,"date":"2 November 1999","review":"Gripping storyline fueled by some heavy duty irony. Crawford plays a ruthless tabloid newspaper editor who has the tables turned on him when he commits a crime, then finds himself having to encourage his top reporter to get to the bottom of the story, in order to deflect suspicion. Top notch suspense as Crawford gambles that he can keep his cool and get away with it, even as the walls close in and the odds look worse and worse. The dialogue is typical Samuel Fuller, (he wrote the novel upon which the film was based) colorfully gritty but at times head-scratchingly obtuse. Crawford is at his no-nonsense, take no prisoners, mince-no-words best, and able support from a young John Derek and Donna Reed (smoking cigarettes and a little less squeaky clean than usual). Good stuff.","user":"abooboo-2","rank":[30,31]}]