[{"title":"Strange company caught in a searing, blinding tornado of emotions","rating":9,"date":"3 March 2017","review":"Transcribed from the trailer for \"The Petrified Forest\", filmed in the fall of 1935, and released early the following year.<br><br>[ Here's the news you have awaited-for a year and a half. Warner Bros. announce the re-uniting of The Stars Who Electrified The Screen World. The Girl Who Knows How To Use Her Charms – Bette Davis. And The Man Who Found Her Dangerous, but Irresistible – Leslie Howard. Co-starred in the sensational Broadway stage success \"The Petrified Forest\". ] <br><br>On the edge of the American desert lies a forest turned to stone, the Petrified Forest, grim, silent, mysterious. Here in a lonely desert tavern, faith draws together a strange company: Alan Squier (Leslie Howard), of Vagabond Adventure, running away from his past, Gabrielle Maple (Bette Davis), a beautiful girl, weary of the desert solitude, eager to escape with the first man who comes her way, Boze Hertzlinger (Dick Foran), an ex-football hero, down on his luck, Paul Chisholm (Paul Harvey), multimillionaire banker vacationing with his disillusioned young wife, Edith (Genevieve Tobin), Gramp Maple (Charley Grapewin), a sly old reprobate, and Duke Mantee (Humphrey Bogart), vicious leader of a notorious band of gunmen, hiding out after a gang massacre.<br><br>In a short space of 24 eventful hours, these characters live a lifetime of romance, adventure, terror and tragedy. It's one of the most unusual stories ever brought to the screen, \"The Petrified Forest\".<br><br>[ Gabrielle Maple: Wouldn't you like someone to be in love with you? Alan Squier: Yes, Gabrielle, I would like someone in love with me. Gabrielle Maple: Do you think I'm attractive? Alan Squier: There are better words than that for what you are. ]<br><br>\"The Petrified Forest\", where nature makes man Forget his conscience, and Strips woman of her pride.<br><br>[ Edith Chisholm: Do you mind if I speak up, my dear, perhaps I could tell you some things that Gabrielle Maple: What do you know about me? Edith Chisholm: I don't know about you, my dear, but I do know what it means to repress yourself, and starve yourself. ]<br><br>[ Duke Mantee: What were you saying? Jason Maple: I'm telling you for your own good, Mantee. They know where you were heading, they picked up your trail. They'll get you. Jackie: What's the matter with you, Duke? Do something! Duke Mantee: Shut up! Shut up! Give me time to think. Alan Squier: No, Duke, you want revenge, don't you? You want to go out of your way again, to get that blonde who snitched, Well don't do it, Duke. Jackie: She has snitched, come on, Duke! Duke Mantee: I told you to shut up! Alan Squier: You know they gonna get you, anyway. You're obsolete, Duke, like me. You've got to die. Well, then die for freedom. That's worth it. Don't give up your life for anything so cheap and unsatisfactory as revenge. ]<br><br>You'll find yourself Caught in a searing, blinding tornado of emotions in \"The Petrified Forest\".<br><br>Leslie Howard re-creates the role that thrilled Broadway. [ Alan Squier: Any woman's worth everything that any man has to give: anguish, ecstasy, faith, jealousy, love, hatred, life or death. ]<br><br>Bette Davis more tempting, more tantalizing, then ever. [ Gabrielle Maple: Sometimes I feel as if I was sparkling all over, and I wanna go out and do something absolutely crazy and marvellous. ]<br><br>Humphrey Bogart the most terrifying character since the Cagney of \"Public Enemy\". [ Duke Mantee: Just keep in mind that I and the boys is candidates for hangin'. And the first time any one of ya makes a wrong move, I'm gonna kill the whole lot of ya! ]<br><br>And Genevieve Tobin, Dick Foran.<br><br>\"The Petrified Forest\"<br><br>[ A New Triumph For The Screen's Greatest Dramatic Team. Brought to you by Warner Bros. the hit-after-hit studio. ]","user":"Davor_Blazevic_1959","rank":[54,60]},{"title":"The Petrified Forest (1936) ***1/2","rating":9,"date":"7 February 2005","review":"Here is one of the reasons I love old movies so much - intriguing writing, great acting, and interesting characters hold our attention throughout the movie without needing to resort to desperate all-out action, explosions, and computer effects.<br><br>Leslie Howard is a gentle intellectual roaming the Arizona desert who happens upon a quaint little cafe/gas station in the middle of nowhere, amidst sand and cactus. He immediately stirs the emotions of big-eyed waitress, Gabby (played by an adorably youthful Bette Davis), who holds a dream of going to France and finding herself in the world. But despite their quick and mutual adoration for one another there is impending tension hovering around their introduction, as news continually escalates about a killer named Duke Mantee (Humphrey Bogart) who's on the run and not far from the diner. Eventually, the infamous gangster shows up with some thugs and takes over the cafe, holding an array of wonderfully colorful characters hostage.<br><br>This was originally a play with Leslie Howard and Humphrey Bogart, and leading man Howard reportedly refused to do the picture without Bogie being in it. As a result, this is noteworthy also as Bogart's big breakout movie, and it would only be a few more years before he would hit super-stardom all on his own. Humphrey seems to put a lot into his gangster character, investing Duke with the necessary evil demeanor, yet also with a hint of heart and soul. Leslie Howard and Bette Davis make a wonderful pair, and both give fine performances; which makes the potentially talky twenty minute scene where they first get acquainted actually completely captivating. Charley Grapewin is delightful and funny as Davis' chattering grandpa. Dick Foran, playing a strapping and comical football star who pumps gas while always trying to woo Gabby, was very good in this film and it's probably the best work I've seen him do in movies, before he wound up as a \"B\" player for Universal. His character here is in complete contrast from the heroes and \"singing cowboys\" I've been used to seeing him play.<br><br>At first watch I wasn't completely satisfied with the ending (which I will not reveal) but after thinking about it I came to the decision that it really fit the story well after all, and is actually very poetic. ***1/2 out of ****","user":"JoeKarlosi","rank":[83,107]},{"title":"A Leslie Howard Classic","rating":9,"date":"2 November 1999","review":"Based on the stunningly emotion play of the same title Petrified Forest is the tale that Acting great Leslie Howard will always be remembered for.He is at the heart of this film as a disillusioned intellectual whose personality never survived the war. Bette Davis is also strong as the waitress who Howard shares his secrets with. Humphrey Bogart made an impressive screen debut repeating the role of Duke Mantee at Howard's insistence. Howard and Bogart played the roles on stage and it is a treasure to see these two actors performances preserved for posterity. Those on this page who have questioned Howard's portrayal of his role are obviously missing the entire emotional through line of his role. Howard was far ahead of his time, an extremely naturalistic actor in a Hollywood obsessed by type casting. Watch this film and be moved by the story. you won't regret it.","user":"peacham","rank":[59,76]}]