[{"title":"Once Bitten...Somewhat Smitten","rating":20,"date":"20 January 2002","review":"Although there are many reasons why this film is a far cry from excellence, Silver Bullet is, at the very least, very entertaining.  The film chronicles how a werewolf has been killing off various people in a small town.  A young boy in a wheelchair discovers who the werewolf is, and then must prepare with his sister and crazy, dead-beat uncle to meet the wolfman when the moon is full on a Halloween evening.  The film's plot really tests your suspension of disbelief, but the characters, the acting, and the direction are all done in a very likable style with a generous dose of humour.  Corey Haim plays the youth very nicely, as he rides up and down the streets in a souped-up wheelchair(?).  Gary Busey gives a fine performance as his uncle. The killings are fairly brutal, and the special effects are not too bad. The film is a lot of fun, and even though you will know who is the wolfman long before you should know....the film zips along with an energetic, entertaining pace.","user":"BaronBl00d","rank":[55,59]},{"title":"A fun horror film","rating":7,"date":"16 January 2004","review":"I'm not sure why, but it seems like the rating for Silver Bullet is somewhat low on IMDb in my opinion. Silver Bullet is a great horror movie by the master of scares Stephen King. I did read his novella \"Cycle of the werewolf\" which was OK, not my favorite book but had a very great idea. Silver Bullet took the idea and made it into a really terrifying story that was also a great update to the werewolf monster story. It made you think that what if there was someone in your town who was hiding a secret that they were a monster who could judge you and feel the need to just kill at their own will, and what if they knew that you knew what they were? It makes it a whole lot worse. Silver Bullet is a great movie to watch in the dark that I'm sure will give you goosebumps and make the hair on your arms stand up.<br><br>The good residents of Tarker's Mill are dense enough to ignore or explain away a series of violent deaths until a little boy is torn to pieces while flying his kite after dark. At that point, the men gang up and go into the fog-shrouded woods to hunt down whatever slasher is out there. The most they achieve is the sighting of one hairy arm and a few more sacrificial victims. But life goes on, and when the summer fireworks show is canceled because people have deduced it might be fatal to stay out after dark, the family's wheelchair-bound son Marty goes coasting off to the bridge to shoot his own fireworks. Needless to say, the hairy killer beast that is certain to be lurking there gets shot in the eyeball by one of Marty's rockets and is now an unhappy hairy killer beast.<br><br>The acting is decent enough, we have a baby Corey Haim who delivers a very strong performance as Marty. It's sad to think that with the success he had with Lucas, Silver Bullet and The Lost boys that he led the life he did, he could have been something great when you watch this performance. His relationship with Megan Follows who plays Jane his sister was so touching and very believable. We also have a young Gary Busey with those same teeth, lol, but he pulls in a decent performance as well playing the alcoholic uncle who is cool in his nephew's eyes but always lets everyone down. He's sick of doing that so really pulls through for his niece and nephew when they need him most. Everett McGill as the reverend/werewolf was chilling, you felt a certain sympathy for him at one point as you know he feels some guilt but then he turns very cocky trying to justify his killings and you hate him. He was a great choice for this despicable villain. I love Silver Bullet, it may be dated and the effects are not the greatest, but I think it's a great horror movie that still gives me chills.<br><br>7/10","user":"Smells_Like_Cheese","rank":[43,48]},{"title":"A fun, low-key horror","rating":8,"date":"19 October 2006","review":"Silver Bullet is my favorite of Steven King's horror adaptations (yes, I do like this better than The Shining) . King even penned the screenplay himself (from his short story 'The Cycle of the Werewolf'), but since he was also responsible for the awful Maximum Overdrive, that's no solid proof of quality. But it a damn cool movie.<br><br>What makes it so different and unique is that it's horror movie told from a child's perspective (though I admit that the retrospective narration seems out of place) and has a brother/sister dynamic that's quite cute and makes you really care for the characters.<br><br>Corey Haim plays Marty Coslaw, a young boy who is confined to a wheelchair for reasons unknown. His older sister Jane is forced to take care of him and throws tantrums whenever the mum and dad take Marty's side (which is always). But the chair doesn't stop Marty from being mischievous. Especially when his manic, reckless Uncle Red (a fat Gary Busey-absolutely brilliant, as always) builds him a motorized wheelchair/bike called the Silver Bullet.<br><br>There is killer in their small town who strikes every month when the moon is full. The townsfolk gradually become more and more weary as autumn rolls on and Marty takes a personal offence when his best friend is murdered, his best girl is run out of town and a fireworks display is cancelled. Then he witnesses what the killer really is. But who is going to believe a kid's story of a werewolf? Despite the red-herrings, it's easy to figure out who it is before the main revelation. But it's still a fun mystery.<br><br>Filmed with the little-used JDC-Scope process, Silver Bullet has brilliant cinematography by Armando Nannuzzi and a wonderful score by Jay Chattaway. There's not much horror to it, but I don't think it was ever the intention to dwell on the violence. Even though I would call this film suitable for kids (despite the 18/R-rating) it's still way better than the PG-13 junk we get these days.<br><br>The film is also notable for Everett McGill (so evil as the baddie in Under Siege 2), an under-rated and under-used actor in a typically eccentric role as a charismatic Reverend. Doesn't he look like a cross between Christopher Reeve and David Hasselhoff? <br><br>A perfect Halloween movie or any night with the curtains drawn and lights off.","user":"CuriosityKilledShawn","rank":[25,27]}]