[{"title":"Harlem at its most Hellish ...","rating":9,"date":"9 April 2009","review":"Unlike in most reviews there are to find on \"Across 110th Street\", I will try not to participate in the debate about whether or not the film classifies as a genuine Blaxploitation effort. I will, however, elaborate as much as I can on all the things that \"Across 110th\" does represent  and that is quite a lot! This is a bona fide gritty, vile, uncompromising and unceasingly violent action-thriller from the glorious early 70's. It's a hardcore-to-the-bone tale of corruptness and survival with solid acting performances and a tight screenplay, yet without pushy morality lessons or unnecessary sentimental interludes. \"Across 110th Street\" is arguably the best Blacks Vs Italians thriller ever made, and this intervened with a strong story about two completely unmatchable cops that are forced to work together results in an unimaginably powerful and unforgettable movie; albeit one that only can be enjoyed by people with strong stomachs and nerves of steel as the bloodshed is relentless and the level of suspense is unremitting. Petty thief Jim Harris and his two accomplices decide to steal a large sum of money from the Italian Mafiosi that are running the show in Harlem. The heist goes terribly wrong, though, and Harris kills no less than five gangsters and two police officers. The Italians send their most lethal psychopath to Harlem and the black gangster community organizes their own manhunt as well. Meanwhile the police force deals with internal racial issues. The aging and corrupt but veteran Captain Mattelli is forced to hand over the investigation to Lieutenant Pope, who's fresh out of university and still full of ideals. This is one of the grittiest and frighteningly realistic depictions of the crime-infested New York City district during the early 70's. There are hardly any amiable characters in the entire film, the ambiance is constantly on the verge of depressing and the downbeat ending comes a massive slap in the face. The racial tension between the \"main\" police officer characters is always present and noticeable, yet moral values and speeches are never shoved down the viewers' throats. The performances are incredible, particularly Anthony Franciosa as the crazed mafia killer and Paul Benjamin as the small thief turned murderer. But the utmost respect is for Anthony Quinn, for courageously illustrating a dismal and raw cop-character with his status in Hollywood. The soul soundtrack is amazing and the actual Harlem filming locations make the film all the more authentic. Barry Shear's direction is surefooted and tight, and I can't believe I haven't checked out some of his other work yet. I still have a copy of \"The Todd Killings\" lying around, so I hope it's as masterful as this film!","user":"Coventry","rank":[34,37]},{"title":"What's the frequency Kenneth?","rating":9,"date":"3 August 2008","review":"\"Across 110th Street\" was more than just a cliché (yet it was full of them), it was deep and developed (yet had a simplistic story about cops and criminals), it was gritty and honest (yet overly-so enough to make you gasp, not laugh), and it was pure, uncut, cinematic genius from beginning to the wildly unseen ending. There were plenty of pitfalls for \"Across 110th Street\" to fall into, but it continually saved itself by being genuine and dark throughout. While the editing, albeit pure 70s cinema, was completely tangent, the film itself demonstrated the raw force of truth, giving us a rare (yet fictional) story of the changing of the guard in Harlem, the truth of its streets, and the minds of its criminals. <br><br>Sounding like a scene right out of \"Dead Presidents\", our story begins with three African Americans stealing money from the mob, only to transform the simple robbery into a battleground, equipped with machine gun fire and plenty of cops caught in the line of fire. Needless to say, both sides  the Italian mob who currently has a strong hold on the crime in Harlem  as well as both the upcoming African American police Lieutenant (played by Yaphet Kotto) and the decaying corrupt Captain (played by Anthony Quinn)  are ready to do whatever it takes to bring these men to justice. Our plot device suddenly becomes a ticking clock, with our minds in constant question as to who is going to get to the finish line first. What keeps this cliché device from sounding stale is director Barry Shear's ability to take us through each of the three story lines with nobody eating from the sweet cake of victory at any given time. \"Across 110th Street\" is not a comfortable story. The characters are flawed, the imagery is sandpaper rough, and the language is honest. Shear has made this film during a time where corruption is used to represent the mindset of the community. Harlem is not shown in a productive light, but then neither is the police nor the mob. What makes \"Across 110th Street\" feel like a science experiment is that you see the decay of the community implode systematically. From the simple thugs who begin the robbery, to the Italian mob who is just as brutal but with better suits, all the way to the police who use the same tactics, but are protected (supposedly) by a badge, this film explores the explosion of corruption in a bold new way that eliminates cliché, yet builds on honesty.<br><br>Shear's ability to build the story into the camera's frame is only the stepping stone of this film. The unrelenting ending could only have occurred with the power of the actors in front of the camera. Their work is simple, at times one could even call it amateurish, but Quinn and Kotto do a phenomenal job of keeping the story, and their characters, grounded at all times. Their beats could have been tightened, but their flaws build upon the chaos of this story. Their facial expressions alone are worth their weight in gold, especially Quinn's ending glare. As Quinn and Kotto were our leads for this film, what stands out is how similar they are to their flawed mobsters and criminals. With our lead mobsters racism coupled with our medial issues of our criminals, we see a blend between them all. While they are all different characters, Shear brings them all together with small similarities. For someone jumping into the middle of this film, one would have trouble guessing who were the \"real\" bad guys, the guys with the guns or the guys with the badges. That is the next layer of \"Across 110th Street\" that could be used in any film studies class across the nation. Not just the visuals of a time filled with racial disgust, but also the fact that the racial divide wasn't in just black and white. Harlem owns the police, yet they are there to uphold the law  while perhaps not exactly like that in Harlem today  one can see this happening throughout the world in modern society.<br><br>Finally, one cannot end a review of \"Across 110th Street\" without mentioning the music  which was icing on the hypothetical cake. To me, the sounds captured the era, the chaos of the music coupled well with the violence happening on screen. The two blended perfectly together, giving us not just a taste of an explosive Harlem, but also the sounds that may have accompanied it. As a child of the 80s, I never was witness to this  so to see it (albeit in a form of fiction) only helped to heighten the awareness of this era in NYC.<br><br>Overall, \"Across 110th Street\" was a violent, loud, and turbulent film that was laced with clichés that were forgotten by the next scene. One could easily watch this film on late-night television and never quite see the power behind Shear's camera, or Quinn's acting ability (that final scene still haunts me), or the challenging music that accompanied our visuals, but watching it on a bright and sunny Saturday, the excellence of this film comes full force. The acting was at a perfect pitch for this film, the corruption that Shear demonstrates from across three spectrums adds a level of honesty to a film that could have easily been lost by another director. \"Across 110th Street\" reminded me of early Scorsese work, the raw grittiness of the city, a city that Shear loved (he filmed in Harlem), coupled with the powerful imagery took me to \"Mean Streets\" and \"Goodfellas\", but not \"The Departed\". This is a cannon of a film, one that should be watched and retained for the sheer honesty of the work, while it is fiction it holds a bit of truth to the turbulence of the world.<br><br>Grade: ***** out of *****","user":"film-critic","rank":[19,21]},{"title":"A gritty street-smart thriller shot on authentic Harlem locations","rating":8,"date":"18 February 2008","review":"110th Street in New York City is the dividing line between Central Park and Harlem. In the film Across 110th Street that line becomes apparent. The film opens with two white men arriving at a brownstone in Harlem. We learn that they are mob bag men sent to collect the week's gambling receipts from two black associates. Amidst their money counting there is a knock on the doortwo black men dressed in NYPD uniforms barge their way in,gun down the four men in the room and take the $300,000 they were counting. They then shoot their way past two real policemen with the help of their getaway driver. This opening scene sets the tone of the film and it is a grim tone at that. After the robbery-murders, the scene shifts to an apartment in Central Park where the mob boss informs his son-in-law and glorified errand-boy Nick D'Salvo (Anthony Franciosa) that he is in charge of exacting revenge against the men who ripped them off. Naturally,the mob is not the only organization interested in finding the killers. With two cops dead, the NYPD are keen on finding them as well. Captain Frank Matelli (Anthony Quinn) a veteran detective well-known in Harlem, is assigned to the case. He finds out in short order that in spite of his high rank, he is ordered to report to Lieutenant Pope (Yaphet Kotto) because of the racial politics involved. Matelli, who is a racist and not above roughing up a suspect, chafes at the order, but abides it. Pope tolerates Matelli because of Matelli's informers and friends on the force who can help solve the case. As the film plays out D'Salvo and Doc Johnson the black crime boss who runs Harlem for D'Salvo's father-in-law hunt down the three men responsible for the theft and murders. At the same time, Pope and Matelli are looking for the same three men and trying to get to them before D'Salvo does. Director Barry Shear makes the most of the authentic Harlem locations in which this film is shot. It is very interesting to look back on what Harlem looked like in 1972. Most of it was not very pretty or charming. Anthony Quinn (who was one of the executive producers) brings a certain gravitas to his role as the bitter, veteran police captain. Quinn was always a very expressive and naturalistic actor and he does not disappoint in this role. Yaphet Kotto also delivers an outstanding performance in his role as the progressive Lieutenant Pope. The scenes where he and Quinn lock horns are emotionally charged and quite good. Franciosa comes close to going over the top as the vengeful Nick D'Salvo but he never quite gets there. The film features a supporting cast of faces familiar to fans of the blaxploitation genrealthough this is not a blaxploitation film. Blaxploitation films such as Black Caesar, Shaft or Sweet Sweetback's Badass Song feature black protagonists who get to \"stick it to the man\" and be the hero. In Across 110th Street there are no heroes. No one is the \"good guy\". This is a violent and relentless film. But it is realistic, very well made and worth watching for fans of the crime genre.","user":"altmanfan","rank":[9,9]}]