[{"title":"1962/2018","rating":6,"date":"30 April 2018","review":"Doris Day and Cary Grant were my parents favorites as well as mine. To see That Touch Of Mink in 2018 is a bit of a cringing exercise. Two mega stars in their, let's say, mature years, specially Grant, behaving like adolescents it's a bit hard to take. Doris's character shares an apartment with Audrey Meadows - who I believe also needs some professional attention - they sleep in little twin beds. So bizarre to see. But and here is were the Doris Day mystery resides. I believed her unbelievable character, one hundred per cent. Doris Day was 39, Cary Grant 58 but everything I saw in Doris Days was true. That's why, I presume, this is a favorite comedy of the Coen brothers. My niece, who is 15, saw the film with me and her comment was that Cary Grant's and Gig Young's characters should be arrested. Yes, 2018 is not 1962 and films are socio-historical documents.","user":"pr-managmenthouse","rank":[22,27]},{"title":"The Only Doris Day - Cary Grant Film...and the Only One to Answer a Sports Trivia Question","rating":7,"date":"1 June 2006","review":"Question: Name the film where Art Passarella, famous baseball umpire, tosses out five celebrities from a game.<br><br>Answer: THAT TOUCH OF MINK. Passarella tosses out Mickey Mantle, Roger Maris, Yogi Berra, Cary Grant, and Doris Day from a game, because of some rule infraction caused by Day (who is in the dugout with the others during a game), and then for escalating reasons in which the three Yankees deny any infraction.<br><br>The reason Doris and Cary are in the dugout is that they are attending a Yankee Game (Cary has some stock in the Yankees - this film was in the period before George Steinbrenner took control of the baseball team.<br><br>Grant is a multi-millionaire whose limousine has damaged Days' clothing by spraying her when the car went through a puddle. He (at first) just wants to repair the damage but he slowly falls for her. But Day is acting like ... well like Day usually does; She is a NYC career woman, and does not want to be the victim of hanky-panky from any man. She is egged on in this by her closest friend, Audrey Meadows. Grant slowly uses his considerable economic muscles to get Day to agree to a trip to the Caribbean, but he finds having her there is not the same thing as getting to know her physically there.<br><br>This film is loaded with nice bits by the supporting players. One of the other reviews points out John Astin as an obnoxious suitor for Day, whom (at the end) she does willingly go out to a motel in New Jersey with, only to have him fail to score when Grant shows up. But also see this for Gig Young, as Grant's secretary, who finds that Grant's effortless economic and social success are undermining Young's delicate mental balance. See it too for Alan Hewitt, as Young's therapist, who finds that it really pays to have Young as a client (because of all the great stock market tips the naive secretary blabs to the Doctor). Their last moment on screen together is quite funny, when Young is gushing over the baby he is watching (actually Grant and Day's child) and Hewitt is momentarily left thinking that somehow Young and Grant had a baby together. Finally, the late John Fiedler has a good moment as a newlywed husband who concludes that a man's best friend is his mother.<br><br>An easy to take Day sex romp, I recommend it for the amusement it generates. The baseball trivia connection is also a reason (though a minor one) to watch the film at least once.","user":"theowinthrop","rank":[24,33]},{"title":"Cute movie","rating":8,"date":"3 June 2002","review":"Very cute movie. It was very enjoyable and put a smile on my face. It's obviously a bit dated, I doubt there are many young, independant working women that swoon over losing their virginity these days. I even doubt it was quite like that back in 1962. It's still very sweet and it would make a good date movie.<br><br>I should also mention the movie looks beautiful. Movies from this era tend to look great. The quality of production in movies seriously declined the closer Hollywood got to the 70's.","user":"watchitman","rank":[34,49]}]