[{"title":"The Werewolf as we know it...","rating":8,"date":"24 April 2006","review":"Universal Studios had an impressive list of successes in the horror genre starting in 1931 with Tod Browning's \"Dracula\". The myth of the werewolf, was firstly adapted in 1935 in \"Werewolf of London\", but the movie failed to get the public's attention in the same way as the \"Dracula\" and \"Frankenstein\" series of movies. However, the moon shined for the wolf in 1941, when a second attempt was done with a completely new story. \"The Wolf Man\" had a great reception and soon was considered among the finest of the Universal Studios' movies of that era and it is probably the last of the Classics as the horror movies of the 40s started to have lower budget and production values.<br><br>\"The Wolf Man\" is a classic tragedy where a man becomes a beast that must kill every time the full moon shines on the sky. Lon Chaney Jr. is Larry Talbot, who returns home to Wales after spending years in the U.S.. Not only he'll have to adapt to the life in countryside and improve his relationship with his father (Claude Rains); now he'll face the curse of the werewolf after been bitten by the gypsy Bela (Bela Lugosi).<br><br>I have always thought that the previous \"Werewolf of London\" was a vastly superior film in terms of acting, direction and even make-up; however, the film's plot is not captivating and in the end not very attractive. On the other hand, Curt Siodmack's script for \"The Wolf Man\" is a brilliant masterpiece of horror and fantasy. So perfect that it makes up for all the film's other flaws, as it has an unnatural charm that is simply mesmerizing.<br><br>Like a Greek tragedy, the saga of Larry Talbot and his curse works in so many levels that is no surprise that it is the film that not only type-casted Chaney, but also serve as basis for all the future werewolf films. Siodmack basically creates the Werewolf myths out of thin air and gives them form with masterful care. Who can forget Maleva's (Maria Ouspenskaya) words? The \"Wolf Man\" rhyme is now one of the most famous quotes in film history.<br><br>Claude Rains is superb as Sir John Talbot, and gives the role the dignity that requires. Probably Lon Chaney Jr. had a limited range as an actor, but he was the perfect Larry Talbot with his sad looks and overall tragic appearance. Against all odds, Chaney embodied the wolf man and made the part almost mythical. The rest of the cast was definitely not as convincing as those great actors; however, Maria Ouspenskaya and Bela Lugosi are terrific as the gypsies who will play an important part in Talbot's future.<br><br>Jack Pierce's make-up is definitely the other star in this movie. The legendary monster maker created a piece that is now considered legendary. The wolf man's make-up is more beast-like and primal than the subtle one that Henry Hull used in \"Werewolf of London\", but that is because both werewolves are very different between them. While Hull's character was the darkest side of his persona, Chaney's wolf man is a beast that posses his body, and Jack Pierce captured that essence with the limited technology of his time, creating an immortal masterpiece in make-up history.<br><br>\"The Wolf Man\" may not be a perfect film, but the captivating storyline and the mystique surrounding it definitely have earned this movie a huge reputation as one of the best of the Universal Studios films of the 30s-40s era. While there may be better werewolf movies out there, this one will always be remembered as THE definitive werewolf classic. 8/10","user":"jluis1984","rank":[25,25]},{"title":"Insert Clever Werewolf Joke Here","rating":16,"date":"16 September 2001","review":"It wasn't the first werewolf movie (that honor goes to `Werewolf of London'), but it was `The Wolf Man' that gives us most of the werewolf mythology we still cling to today.<br><br>As with most classics, `The Wolf Man' draws its power from a combination of elements.  First, there's Curt Siodmak's plausible and intelligent script. Siodmak said he was given a title, a star and a start date, and from there he consolidated and invented the werewolf myth into a cohesive, logical format.<br><br>Then there's the actors, a veritable who's who of 1930s-40s Universal horror.  Lon Chaney joins the pantheon on great horror actors on this one, playing the tormented Larry Talbot.  He manages to give Larry a tragic quality, a man trapped by a curse he doesn't understand or deserve.  Chaney also generates considerable chemistry with the luminous Evelyn Ankers, which is surprising considering the rumors that the two practically hated each other.  And then there's the always-excellent Claude Rains, who doesn't look very much like Lon Chaney's father, but still exudes quiet authority and authenticity.<br><br>Topping off the whole package is a healthy dollop of atmosphere: foggy forests, Gothic mansions and crypts, colorful Gypsy encampments.  Each bit of design enhances the sense of mystery and dread that surround Larry Talbot, and burns `The Wolf Man' into your memory.<br><br>I'll never walk a foggy forest at night again!","user":"Shield-3","rank":[65,69]},{"title":"Lon Chaney Jr's signature role is still one of his best performances. 'The Wolf Man' is an undisputed horror classic.","rating":18,"date":"18 February 2004","review":"Lon Chaney Jr lived under the shadow of his famous father, but in 'The Wolf Man' he helped create a horror icon that has lasted for over sixty years. Chaney had already shown that he could act in 'Of Mice And Men'(1939). In 'The Wolf Man' he gives another excellent performance, but this movie was both a blessing and a curse to his career I think. It forever labeled him a horror actor, and frankly he made a lot of lousy movies after this. Some good ones too, don't get me wrong, but too often he was given b-grade material to work with. Maybe his drinking problem had a lot to do with it, I don't know, but apart from a strong cameo in 'The Defiant Ones'(1958) and a great performance in Jack Hill's cult classic 'Spider Baby'(1964), he rarely was given a role as good as Larry Talbot in this movie. Chaney is surrounded by a very strong supporting cast including horror legends Claude Rains ('The Invisible Man') and Bela Lugosi (sadly only a cameo), Ralph Bellamy ('His Girl Friday'), and frequent costar Evelyn Ankers (she and Chaney made a great on screen couple but apparently hated each other off screen. Such is Hollywood!). Many people complain about the casting of Rains and Chaney as father and son. I agree it's totally unrealistic, but I don't think it hurts the movie at all. The lack of Lugosi is a bigger problem. There was more footage of him but unfortunately it wasn't used in the final cut. It's too bad as more scenes between Lugosi and Chaney would have been a treat. Of course they worked together a few times after this, but mostly in lesser movies. The real scene stealer in 'The Wolf Man' is Maria Ouspenskaya who plays the gypsy woman Maleva. She's just terrific, and gives the most memorable performance after Chaney. 'The Wolf Man' has had an enormous influence on just about every subsequent werewolf movie. Much of the lore seen on screen here isn't in fact traditional, as many people assume, but created by the talented Curt Siodmak ('Donovan's Brain') who subsequently wrote the horror classics 'I Walked With A Zombie'(1943), and 'The Beast With Five Fingers'(1946). 'The Wolf Man' is an undisputed horror classic, and just as entertaining and interesting as it ever was.","user":"Infofreak","rank":[54,57]}]