[{"title":"Spectacular cult classic of the Moonshine Wars of the 40s, 50s","rating":10,"date":"18 May 2003","review":"It's hard to describe the visceral jolt this film gives to anyone brought up in the South or to anyone who appreciates hot rods.<br><br>Unfortunately, my dad died shortly before this film came out or it would have been his favorite film. Raised in a poor sharecropper's family in Clay County, Kentucky, during the Depression, he and his brothers drove souped-up \"tankers\" running moon throughout Ky, Tenn and Virginia before and after they served in combat in WW2 and Korea. From their description of those rowdy days, THUNDER ROAD is as brutally accurate as can be.  Not only were the dreaded T-Men a major hazard, with their brutal tactics, but the various families that cooked the \"moon\" and distributed it often had blood feuds that were resurrected or exacerbated by their competition for the illegal whisky business. The longest running feud in US history, the century-long White-Baker Feud (also called the Clay County Wars) was resurrected due to the two clans' competition in tanking the moon throughout Appalachia.<br><br>Inherently a sad but realistic work, Mitchum's excellent performance and an honest, understated script give us a snapshot of an American way of life that few outside of the rural South could ever comprehend. The culture of individualism and freedom from Federal oppression is much less today, but still exists.  I believe the reason this film is such a huge cult film in the South is that it reminds us that not too long ago many of our ancestors were still willing to take on the tyrant face to face. We are, alas, just a pale copy of those who went before.<br><br>Truly one of the most under-appreciated films of the 50s, due in no small part to the overwhelmingly Yankee composition of the critics' circles.  They couldn't possibly understand the film.  It's a Southern thing.","user":"smokehill retrievers","rank":[84,97]},{"title":"Has a strange charm I can't put a finger to....","rating":14,"date":"14 February 2001","review":"THUNDER ROAD opens with a bang!  A bumper snatcher (Government car that rips back bumpers off the cars they chase) grabs the plate off the hot rod belonging to the most sought after moonshiner in the business, Lucas Doolin. Doolin is probably the coolest Robert Mitchum performance.  With his sleepy eyes, he slaps around the rival moonshiners, basically tells the ATF boys they'll never get him, tries to keep his younger brother (Played by Mitchum's 17 year old son, Jim.) away from the moon business.  The film has a real charm to it, basically because the film never sneers at the hillbilly culture it depicts. Reportingly, the drive in classic of the 1960's, and I can see why. Recommended viewing.","user":"boris-26","rank":[34,38]},{"title":"The film I love","rating":25,"date":"25 June 2004","review":"Filmed in 1957, and sent to theaters in 1958, it had the 'Rods' of the day. This was a film of youth, and wild rebels. In some ways, you had to be born then to understand it. I saw it for the first time at the Flying Cloud Drive-In. Siting in a 1951 Ford Custom with a full race flat head engine, and my best girl at my side. Three duces, Lakers, and overdrive trans. The car, not her. To this day I can close my eyes and hear the the high pitch voice singing the theme song. \"Let me tell the story, I can tell it well, 'bout the whipperwill that drove...\", well you know the song if you have seen the movie.<br><br>Imagine a drive-in filled with 'Rods'. On the screen you see a 50 Ford, with its lights out, driving down a dark country road. A 57 Chev pulls out from a hiding spot and gives chase. All heck lets loose, not on the screen, but in the drive-in. Fifty 'Rods' rev their 'Mills' with the Lakers open. Flames shoot from the pipes, and the noise pounds in your guts. Outside the drive-in 20 cops are waiting for the movie to end, and play time to start. Have this picture in your mind? That's the way it was back then. The movie showed a 50 Ford front clip on a 51 Ford. The inside view of the car shows a 51 dash. I spotted that when I first viewed the movie. The 57 Ford, that Bob drove later in the movie, had a 312 supercharged engine. I know that engine well. I had to get one after I saw the movie. Oh, and the car to go with it. Bootleging is not a southern exclusive. I grew up in a small town in Minnesota, and we had 'shiners, and 'runners here. Minnesota 13 was the 'shine of the Volstead Days. Sorry, I forgot what this is all about, and no, I will not say if I did any of that. All my friends knew the song by heart, and we would sing it all the time. Bad guys drove Chev (Feds) and the good guys (Runners) drove Fords.<br><br>Simple, plain, and all 1950's. Lots of bad acting. Lots of continuity errors. Lots of hot cars. Lots of great action shots. A great title song. Look, if you were not born then, you have to see what Grandpa and Grandma made out to when they were young. No Drive-ins are around today. My 2002 Thunderbird has computers that limit my speed. I still know all the words to the song. I can still close my eyes and hear the roar of the 'mills', and see the flames from the Lakers, today. I still wish it was 'way back then', and 20 cops were waiting to play. \"And when his engine roared, they called the highway Thunder Road\"","user":"kongrragnar","rank":[48,58]}]