[{"title":"Masculinity in 1976","rating":7,"date":"24 May 2006","review":"I saw this film in the cinema as a teenager when it came out. It was sold, I think, as a Hitchcock parody and I thought parodies were great. Gene Wilder was the star, that was one more reason for me to see it, as I had greatly enjoyed his performance in Mel Brooks' Young Frankenstein. Stuff like that attracted me much more than movies with Robert Redford or Charles Bronson who then were the big male heroes of the screen.<br><br>Now, a good 30 years later, I watched Silver Streak a second time. It is an unusual mixture of comedy, action thriller and disaster movie. Characters like the ones played by Wilder, Clayburgh or Pryor seem to have become extinct  in the movies, I mean. They just seem to be so ... ordinary and normal and also kind hearted. Everything about Silver Streak is so unpretentious, seeing it today that really was a kind of a revelation to me.<br><br>A lot of the movie deals with masculinity and the assertion of it. It all happens in a very relaxed manner. Nothing and nobody is taken too seriously, conquests are made without effort, failure is accepted with grace. In a strange way, this movie really represents a better, unattainable world. I doubt if someone like Gene Wilder wold make it as a movie star today  the public, it seems, needs the grimaces of Jim Carrey to be amused. Pity.<br><br>Come to think of it, in France they had a movie comedian who looked very similar to Wilder. His name was Pierre Richard and his fame reached its zenith at about the same time as Wilder's before fizzling out somewhere in the eighties, when the Stallones and Schwarzeneggers took over.<br><br>Silver Streak is an entertaining and  in a positive way - forgettable movie. It has a pleasant musical score by Henry Mancini, this great eclecticist of the 20th century. The older I'm getting the more I enjoy his music and respect his enormous body of work.","user":"manuel-pestalozzi","rank":[71,83]},{"title":"A Hitchcockian Thriller Played For Laughs","rating":8,"date":"30 September 2003","review":"\"Silver Streak\" was released the very same year the Master of Suspense, Sir Alfred Hitchcock, released his black-comedy swan song, \"Family Plot\". Though Hitch was in the very twilight of his long, illustrious career, his playful style was alive and well, and well appropriated, in Hollywood. The Master didn't make this movie - Canadian Arthur (\"Love Story\") Hiller did - but the unmistakable fingerprints and shop-hewn template of Hitchcock's \"North By Northwest\" (amongst other classics) are in great display thanks to writer Colin (\"Foul Play\") Higgins in the cheery, breezy action comedy, \"Silver Streak\".<br><br>\"Silver Streak\" is the first of four Gene Wilder &amp; Richard Pryor match-ups and certainly in retrospect, one of the best. Wilder is an ordinary Joe taking the titular Amtrak train across country. In the midst of his journey, he befriends and beds fellow passenger Jill (\"An Unmarried Woman\") Clayburgh, ends up witnessing a murder then is wrongly accused of the crime, and is thrown off the train many, many times in his pursuit to clear his name, save the girl from a mysterious villain and get to the other side of the country.<br><br>This is a very gentle but funny comedy that plays with the conventions of one of Hitch's favorite themes, the mistaken identity of everyday man in extraordinary circumstances. Wilder is wonderful, fitfully funny as usual and shines as both a romantic lead (!) and does his patented \"crazy\" guy when things start falling apart. Just watching Wilder's eyes as he exasperatedly tries to explain out the fantastic plot he's wrapped up in to unbelieving characters along the way is one of the film's funniest, simplest rewards.<br><br>The film's masterstroke, however, is the addition of Richard Pryor as a part-time thief. Pryor was in the midst of a very hot career in 1976, and although this film seems to restrain some of the imagination and language of his stage presence and TV specials, (this is a PG-rated movie, after all), he still creates an indelible extended 'cameo' that fuses film with a hip, perfectly cool counterbalance to Wilder's mania and confusion. When Pryor is on screen he not only steals the film, but also elevates this old-fashioned adventure-comedy concept to something otherwise original... and you can't take your eyes off the guy.<br><br>Filmed all across his native Canada (thanks IMDb for confirming this!), director Hiller pulls this fun little audience-pleasing gem along the rails to a bright and exciting climax. The supporting cast is loaded with wonderful character actors including Patrick MacGoohan, Ray (My Favorite Martian) Walston, Ned Beatty and Scatman Crothers amongst others. A very luxurious and memorable score by Henry Mancini is the capper to this sparkling comedy, perfect as a primer for, and a loving compendium of, many of the Hitchcock classics that wait for you to discover them on DVD, VHS or on the tube.","user":"britishdominion","rank":[50,60]},{"title":"This one has it all","rating":9,"date":"16 February 2003","review":"I first saw this movie in 1976 when I was all but about 13 years of age, with some friends in my home town (Dryden, Ontario) at the local \"Royal\" theatre, as it was known then. I just finished watching my VHS copy of it, which brings my total number of viewings up to 30-something...<br><br>Why do I like this film so much? It was the first movie I've seen that had it all: action, suspense, romance, a lot of laughs, but most of all - adventure. All of this helped manufacture a great storyline. In short, one of the most memorable movies I've ever seen, and I enjoy myself greatly with each repeated viewing. It made me a big fan of the Wilder/Pryor combination. It made me a huge fan of train travel. It made me a \"road movie\" fanatic.<br><br>A classic in my book. 9/10","user":"apauLLo","rank":[27,32]}]