[{"title":"An amazing work composed of parts of three films and several years in the making.","rating":7,"date":"25 January 1999","review":"One of the most underrated gonzo films of all times!  On the surface, this is an atmospheric, low-budget and sometimes confusing horror film.  But this amazing work is composed of three separate films and was several years in the making.<br><br>Roger Corman, noted producer/director, hired Jack Hill in 1964 to write and direct a horror film with the condition that he make liberal use of footage from \"Operation Titian\", a thriller Corman produced with Francis Ford Coppola (!) in Yugoslavia, but deemed unworthy of USA release.  Hill was given actor William Campbell, Titian's star, and hired Lori Saunders (still using her original name of Linda Saunders, and soon Petticoat Junction-bound).<br><br>However, Corman didn't like the resulting film about a murderous sculptor possessed by the spirit of his ancestor, who was killed by a beautiful witch.  So he shelved it for a year, bringing it out for director Stephanie Rothman to revise.  Rothman turned the possessed sculptor into a vampire, shot extensive new footage (using a few members of the supporting cast) and---bingo!---\"Blood Bath\" was out in the theaters at last, as the co-feature for \"Queen of Blood\" in 1966.<br><br>Despite its plentiful source materials, the finished film ran only 69 minutes. When it was prepared for TV release, Corman changed the title to \"Track of the Vampire\" (Rothman's title of choice) and added approximately 11 minutes of additional footage (some of it outtakes from Hill's and Rothman's shoots). Further complicating matters, Corman released the English-dubbed version of \"Operation Titian\" directly to TV at about the same time as \"Portrait In Terror\".<br><br>Amazingly, this complex mishmash works.  Atmospheric, intense and with some violent and original touches, \"Blood Bath\" is the most successful example of Roger Corman's eclectic approach to creativity. Its current placement in critical limbo is only because the film remains frustratingly difficult to find.  But it's worth the search.<br><br>A fascinating three-part article by Tim Lucas on the making of this film and its numerous versions provided details for these comments. It appeared in 1991 in \"Video Watchdog\" magazine, numbers 4, 5 &amp; 7.","user":"bella-6","rank":[30,30]},{"title":"A mad killer is stalking Bobbie Jo Bradley!","rating":22,"date":"22 January 2002","review":"This is complicated so pay attention. Roger Corman bought an unfinished film shot in Europe called OPERATION TITIAN concerning the hunt by both cops and crooks for a stolen Titian painting. Patrick Magee was the star. At the same time Jack Hill was shooting a movie in Venice, CA about an artist (biker film alumnus William Campbell) who kills his models and dips them in boiling wax (where have we heard THAT before?). By combining the footage, a trick he was to do many times in the 60's Corman created a film that essentially made no sense at all. Now that has never stopped our Roger so he brought in new director Stephanie Rothman who added an effect new to American movies, an oil dissolve, and shot even more footage to create a film about an artist who sometimes transforms into his remote ancestor who was falsely accused of witchcraft and burned at the stake only to return as a vengeance seeking vampire. Got all that? The stolen Titian painting was lost in the shuffle and Patrick Magee shows up only briefly as a jealous husband who gets dumped alive into the boiling wax.<br><br>Meanwhile watch for Corman regulars Jonathan Haze, Sid Haig and Carl Schanzer turn up as Beatniks (leftover characters from BUCKET OF BLOOD perhaps?) who hang out in a coffee house, argue about art and use the word \"quantum\" a little too frequently. Also in the cast is Lori Saunders (billed here as \"Linda\") who went on the play the airhead, would-be journalist Bobbie Jo Bradley on \"Petticoat Junction\". This time she plays a dancer who is in love with Campbell never suspecting what he does with his models. She has a lengthy (8 minutes by my stopwatch!) scene where she does an interpretive dance on the beach and models 3 bikinis, each one smaller than the one before it, during the film.<br><br>I do believe Joe Spinell saw this movie since the ending of his film MANIAC borrows liberally from the climax of BLOOD BATH.<br><br>PS: This was not Lori Saunders only encounter with a mad killer. She would be chased by an axe wielding psychopath in a Tor Johnson mask (!) in SO SAD ABOUT GLORIA (1972).","user":"reptilicus","rank":[18,18]},{"title":"I Shall Astound the World","rating":24,"date":"24 April 2003","review":"Hilarious trash of a movie from Jack Hill blends elements of witchcraft, vampirism, wax murders, and beatniks(?!).  Sid Haig, a Jack Hill regular and guest star in Quentin Tarantino's Jackie Brown, plays a beatnik.  Weird story is about an artist who lures young girls into his studio, turns into a vampire, and dunks them into hot wax, creating his new figures.<br><br>My favorite parts involve interpretive dance and the origin of quantum painting.  This film offers the rare opportunity for a vampire to stalk his victim in broad daylight ( probably a film flaw, and abeit a cute one ). Recommended for trash fiends.","user":"spoono01","rank":[15,16]}]