[{"title":"\"It is a work of genius.\"","rating":8,"date":"18 January 2001","review":"In a sense I was disappointed to find that I actually liked The Italian Job. For after decades of imitations and student new-lad pub bores crowbarring \"You're only supposed to blow the bloody doors off!\" into conversation, I was all prepared to hate it.<br><br>Yet The Italian Job is a good film. A very good film in fact. First-class direction, all pans and upshot angles, and slyly political, though its \"Cool Britannia\" ethos almost seems to parody devotees of the Union Jack. Anyone watching this film for reconfirmation of the Empire is mistaken, though the team's final downfall notably comes from the only non-Caucasian member.<br><br>The humour is self-conscious, but never so that it goes too far; it's always witty. Michael Caine is the archetype Michael Caine, all pointing finger and raised-voice declarations, the version mimics love to portray. Noël Coward is able support in a straightish role, though the wonderful Benny Hill parodies his own image, thus diluting his already fine (And misunderstood) ironic take on the sexual pervert.<br><br>Screen realism is not an issue here, with a Mafia cameo who are hardly Don Corleone. Women are also marginalised, with only Maggie Blye getting a largish role as Caine's girlfriend, Lorna. This is the same girlfriend who hires six women to help celebrate his release from prison, and refers to fellow womankind as \"birds\". Yet while the film is a \"boys only\" club, it's far from a testosterone-led car chase, as Coward's appearance should attest. And what makes the final climatic chase so rewarding is that it's carefully, and intelligently, set up. The film is metaphorical where you wouldn't expect it to be, and well-acted all round.<br><br>All of which leaves me struggling for a way to end this review. Hang on a minute, lads, I've got an idea -","user":"The_Movie_Cat","rank":[87,110]},{"title":"Just the job!","rating":1,"date":"1 May 2002","review":"Troy Kennedy Martin, its scriptwriter, has described the central significance of the mini cooper in Peter Collinson's cult heist movie. Perkily speeding through the streets of Turin, it represents the then New Britain: `laddish, self-confident and not taking itself too seriously'. The image of the weaving, dodging, red white and blue cars is the film's abiding one. Outside of their use in the prolonged escape scenes, and several splendid comic moments elsewhere, it remains entertaining, even if surprisingly slight.<br><br>Often seen as a quintessential sixties' movie, The Italian Job' is more precisely a definition (or one definition) of Britishness as an optimistic nation at the height of a chic decade. In this atmosphere, pulling a job  or a bird  is practically a national duty. Robbery is considered by Croker and Bridger as a means to `help with the country's balance of payments'. The ultra-patriotic Mr Bridger (a splendidly aristocratic Noel Coward, his cell walls pasted with pictures of royalty) sees the job as much a matter of national pride, a means to demonstrate the efficiency of the British system of work, than a route to amass loot. Characteristically Bridger is more interested in studying balance of payment statistics than examining escape routes for his operatives who appropriately enough travel to their work' on the Free Enterprise 1.<br><br>The reference to football is significant and parallels with the sport are deliberate. Most obviously, the robbery is planned for the time of an England-Italy match maximising confusion and even,(as Bridger suggests at one point), possible help from their compatriots. Croker's men at one point assume the identity of a van full of fans, while the impromptu beer celebration in the back of the coach, after ditching the minis, is the team's victory drink. It is clear that the Italians, whether the police or the Mafia, are as much their opponents as the national team playing in the stadium. Back in prison, upon news of the triumph by his team', Bridger descends the stairs, like a penal Alf Ramsey, acknowledging the chants of England!' by celebrating fans.<br><br>Caine's cockney player is very much the main character of the film (a role apparently  and amazingly  originally offered to Robert Redford). The actor, who had earlier played the soliliquising womaniser Alfie in the 1966 film of the same name, reprises some elements of that character's optimism and assumptiveness. In the present film he is less of cynical loner, studiously subservient to his criminal employer, though still on the look out for a good thing both professionally and sexually. Like his more famous compatriot, James Bond, he drives an Aston Martin although quickly reduced to a bicycle and then a mini. The Mafia's cliff-side warning dents some of his self assurance, presumably also shaken by the roughing up from Bridger's men (although interestingly the beating is never referred to again, and leaves no physical marks.) Away from his boss he remains very much his own man, although his loyalty is never in doubt: `From now on we work as a team. Which means you all listen to me.' Crocker is always in control, never sentimental, being content to pack his girlfriend off with the minimum of ceremony at the airport. Emotion will slowly filter through Caine's screen persona. His watching of Beckermann's footage early on, to explain the big idea, anticipates Jack Carter's less dispassionate viewing of celluloid in Hodges' gangster film two years later.<br><br>Before the long, final chase ensues, the gang's Aston and two Jags are ceremoniously wasted by the Mafia. While making a simple point about the threat and power of the Italian underworld, the removal of competing' vehicles also reaffirms the status of the remaining minis. Ironically if the film has a weakness, it lies in the mini's prominence, which reduces tension during the last part of the film. The stunts remain eye-catching today (the notable roof top jump being filmed on the roof of the Fiat factory), but very often one is aware of watching a demonstration of the vehicle's versatility rather than any dramatic bid for freedom. In one scene filmed, later deleted from the release print, the minis and their Italian pursuers performed gracefully together on an ice rink choreographed to a waltz, slowing the action even further. That such a scene was considered, and filmed, gives an indication of how taken the makers had been with the car, and with the *means* rather than the *process* of urgent escape.<br><br>Another less satisfactory element of the plot is the disappearing Mafia. Initially presented as a formidable, organised force (as in their synchronised appearance on the hill side for instance), the Italian hoods are sidelined as events unfold, criminal impotents. Their absence from the finale seems odd. With or without the Cosa Nostra's malign shadow, the existing conclusion of the film has excited much comment. With its famous shot of the coach balanced out over the precipice, the gold sliding towards its back end, and Croker's closing `I've got a great idea..', it is a literal cliff hanger. The original script tailed off with the escape, and another twist in the tail was clearly needed. After some debate a studio executive added the existing close, which could easily have appeared lame, but in the event proves a satisfying conclusion. By leaving the coach  and the viewer  hanging, the film has it both ways: the crooks get away with it and yet they don't; a group of white British lads triumph in their cool minis, only to have their plans derailed by a careless black driver of their coach. If the film has been about the state of Britishness' at the time then the uncertainty of its conclusion anticipates, perhaps, the doubts and strife of the ensuing decades.","user":"FilmFlaneur","rank":[34,41]},{"title":"A cultural masterpiece","rating":8,"date":"26 October 2004","review":"The Italian Job is one of the best-loved British classics ever made. Most people in my home country of Britain have seen the film many times (most of those times spent drinking tea and speaking like the queen, of course), but there's more than enough for audiences from other countries to like about this delightful thriller as well. As you almost certainly already know, The Italian Job stars Michael Caine as the criminal at the centre of the job, dubbed 'The Italian Job' (would you believe). Caine is iconic in this film; his voice and mannerisms are often imitated, and it is this film that is probably most responsible for that. The plot follows Charlie Croker (Caine), a freshly released crook that, with a tip off from a deceased friend, decides to steal £4 million from Italy. However, it's not an easy job and there are many risks involved, so the job must be astutely planned and flawlessly executed for it to work right - and it is there that the film really takes off.<br><br>The Italian Job is well remembered for two things, the first of which is the Mini's. This is the film that made Mini's cool, so as you might expect, there is a fair amount of stunt work involving the Mini, a lot of which is truly spectacular - these little cars can be seen driving up stairs, onto and across roofs, through shopping centres, flying over various chasms etc and it's all very exciting. The second thing that it is remembered for is, of course, the line - \"you were only supposed to blow the bloody doors off!\", which is one of the most quoted of all time. The film's impact on popular culture has been immense, and that line's impact in particular is legendary; people that don't know the film know that line, and I dare say that a lot of them quote it even. It's up there with 'I'll be back' or 'that' line from Dirty Harry. The film also highlights a lot of British culture, most notably the reaction to something going right. English patriotism is a little different to the American version - while in America, the whole country may be united under the stars and stripes, very apple pie-like; England is much more content to chant a little inside of a prison. I know which version I prefer.<br><br>I could waffle on all day about this film, but we've both got better things to do, I'm sure so I'll finish by commenting on the ending; which is, simply, sublime and a perfect way to end the film; funny, well executed and absolutely genius. Well played.","user":"The_Void","rank":[72,98]}]