[{"title":"The greatest bad-ass best action movie hands down my personal favorite number 1 movie of all time","rating":10,"date":"4 February 2018","review":"Die Hard (1988) the first action film is by far one of the greatest best action movies of all time from the 80's till this day hands down. It is my number 1 personal favorite action movie of all time, I love this movie to death! I love it so damn much and I have fun watching it so much. I have to talk about this movie: It is one man army fighting against a team of terrorists with automatic weapons and plastic explosives. Bruce Willis performance was excellent in this movie John McClane is his best role ever. It is my number 1 personal favorite action movie of all time, I love this movie to death! It's stay in my heart forever. To me it felt this film realistic and it makes you think that you are alone trapped in a building against bunch of terrorists what will you do? <br><br>This film has heart and soul. A lot of movies have try to do that premise since, but no movie has nail it like \"Die Hard.\" This is a modern day action film of the action genre. I watch this film as a teenager I even watch it with my mom it was ultimate thrill ride. I love everyone in here all the characters and the lead character. I love that McClane is alone he has no help, all telephones doesn't work he is barefoot with his gun and the only help has is from Sgt. Al Powell down there who didn't even see him at all but were both talking on a radio from cop to cop. I love that bond between those two lead heroes. I always love when McClane talks to himself whenever he was about to do something crazy. <br><br>It is going to be 30 years anniversary this summer 20th July. I love this film to death I am hugh fan of Die Hard films I love this film so damn much. I would really love to see this movie in a widescreen in a movie theater. It was directed by brilliant John McTiernan it is is based on a novel Roderick Thorp Nothing Lasts Forever. This is a masterpiece action film that started all action genre one man army types battling terrorists while trapped in a confined space. It was arguably the first one in the action genre. This movie has everything . It has intense Action, Drama, Thriller, twists, great dialogue, explosions, fights. Exploding building, great helicopter explosion action scenes. John McClane is one man against a whole team of terrorists. A cracking Action Thriller from beginning to end, Die Hard explodes with heart-stopping suspense! <br><br>It has great cast, great plot, great explosions, no shaky cam, doesn't deal with CGI, but real actions real practical effects. Great Direction from John McTiernan, great dialogues, great acting from everyone. Everyone does an excellent job. Bruce Willis is a bad ass action star as John McClane. It has a great bad-ass action hero who does impossible buy stopping the terrorists who were actually a real terrorists who try to steal the money in a vault 640.000.000$ in bearer bonds stored in the building's vault. <br><br>My favorite action sequences and the best part of Die Hard: McClane grabs the fire hose, ties it around his body jumps with the helicopter about to kill him. Then Gruber blows it a second after McLane jumps off the roof! It was an incredible explosion that totally takes out the helicopter. But McLane is falling down the side of the building and needs to get inside quickly this is the best scene in the movie my favorite. McClane climbs in the elevator shaft escapes Karl and his men trying to kill him. McClane shoots on the table with his gun killing Marco. (According to the director, the proximity of the gun to Willis' ear during this scene caused permanent hearing loss for Willis.) \nMcClane shot's Hans and Eddie \"Happy - Trails, Hans...\" Incredibly satisfying action in a brilliant action movie! McClane try to save Ellis when Ellis try to save him self. McClane was afraid of flying and he always carry gun because he was afraid someone would have hijack it. The fight between Karl and John was excellent and well choreographed. McClane drops C4 down the elevator shaft and destroys the entire floor where the terrorists are firing from, giving the cops a chance to retreat. I love The broken glass scene. He shoot's and kills two terrorists with his machine gun to escape Hans and Karl, John McClane is forced to sprint over broken glass while barefoot the best bad-ass scene in the movie my all time favorite. Three terrorists are shooting on McClane on the roof chasing him in which he escapes in the beginning of the movie awesome. Karl shoots in an elevator shaft in which McClane is hiding a real kick-ass scene I love this film to death! <br><br>I love the characters in this movie: John McClane a real action hero to me that does something that no one can he stops a team of terrorists. Hans Grubar the German mastermind he was ruthless and brilliant and he would do anything to steal the money even killing people and get what he want's. Alan Rickman's performance was excellent I love him to death in this movie. I really miss the actor he was the best villain of the whole world. The LAPD Supervisor (Diana James) I like that girl she was so good when McClane call's her for help, I love it. I love Sgt. Al Powell how he stand's up and defends McClane against his supervisor. Reginald VelJohnson does a brilliant performance as a great supporting hero in this movie. I love Deputy Police Chief Dwayne T. Robinson to death he is my favorite character in here. Paul Gleason was so good I love his performance - \"kick ass.\" I love how he tried everything to safe the hostages including SWAT team who were badly hurt. I like Richard Thornburg in this movie who is annoying reporter but I still like it. Bonnie Bedelia as Holly McClane's wife was great.<br><br>John McTiernan directed excellent this masterpiece Jeb Stuart and Steven E. de Souza wrote a script that it delivers. The helicopters in here were models in this movie delivered, to me the action scenes felt realistic. This movie has ton's of action and you never get bored with it. Michael Kamen made a music score and you never get bored with it. You'll see lots of heavy automatic and explosive weapons, and you'll see them used well. The film is violent, and bloody rated R with real blood squibs. <br><br>10/10 it is my favorite action film in the action genre I love this film to death it is my personal action favorite film. I miss movies like this I miss action movies like this one today I want them back. It is a shame we don't have movies like this today.","user":"ivo-cobra8","rank":[144,177]},{"title":"The Perfect Modern Action Film","rating":9,"date":"31 July 2001","review":"\"Die Hard\" is the prototype type for the modern action film.  Since it's also one of the best action films ever made, that happens to be a very good thing.  \"Die Hard\" is lean, mean, and doesn't contain a single second of wasted screen time. The direction, the action, the story, the acting . . . every aspect of this film comes close to big-budget action movie perfection. Since \"Die Hard\" was first released in 1988, it's difficult to think of a blockbuster action film that doesn't follow the basic structure and format of \"Die Hard\" . . . or, for that matter, is better than \"Die Hard\".<br><br>\n\"Die Hard\" is about John McClane (Bruce Willis, in one of his all-time best film performances), a basically good, honest New York cop with a penchant for annoying authority figures.   Traveling to Los Angeles in a last ditch attempt to patch things up with his estranged wife Holly (Bonnie Bedelia), John McClane suddenly finds himself involved in a hostage situation. Terrorists, led by the enigmatic Hans Gruber (Alan Rickman), have taken over the office building in which Holly is working, and with Gruber holding the upper hand over the LAPD and FBI forces in Los Angeles, it's up to John McClane to save the day . . . .<br><br>Kudos should be given to both director John McTiernan and screenwriters Jeb Stuart and Steven DeSouza -- the film is tight, electrifying, and clever, which is something few action films can ever claim.  The story isn't completely believable, but it's believable enough, and it manages to move along at a quick enough pace to where the most glaring plotholes can easily be glossed over.  There's also enough twists and wrinkles thrown into the story to keep the audience guessing as to what's going to happen next . . . and the surprises don't come out of left field, but are actually clever and well thought-out.  (The fact that McClane often relies on his brains instead of his bullets to get out of his predicaments is also a big plus.) Simply put, \"Die Hard\" is one of the smartest and savviest action screenplays ever written.  McTiernan holds up his end of the film admirably as well -- he uses the claustrophobic nature of the office building to great effect (particularly in any scene involving an elevator shaft), and he keeps the film rolling at a rollercoaster pace, building up the anticipation of the audience before unleashing the action.  A lot of recent action films just fly along at a mindless, breakneck pace, without ever allowing the story to breathe or the suspense to build . . . unlike those films, \"Die Hard\" knows how to maximize the impact of each and every scene, and that's why it stands out so clearly from them all.  With \"Die Hard\", John McTiernan puts on a perfect clinic as to how to pace an action movie.<br><br>As for the acting, it's darn near close to perfect.  Bruce Willis is awesome as John McClane.  As played by Willis, McClane's a smartass with a distinct disdain for being given orders . . . but McClane's also clever, and knows how to keep cool under pressure.  There's more to McClane than the stereotypical tough guy hero.  Fortunately, the role was given to Bruce Willis, who infuses McClane with the perfect mix of cocky arrogance and stone-cold heroism.  The fact that Willis plays McClane as a man often in disbelief of his own situation, and who struggles in his fight against bad guys instead of just killing bad guys with ease, like most stereotypical action heroes -- well, not only does it make the character much more believable, it's darn brilliant.  (The fact that Willis also knows how to deliver a deadpan one-liner better than anybody else in Hollywood makes the character all the better.)  There's only a handful of movies where both character and actor are a completely perfect match; Bruce Willis as John McClane is one such perfect match.<br><br>Also worthy of mention is Alan Rickman's performance as the villain Hans Gruber.  The Machiavellian Gruber would've been an easy villain to turn into little more than a scenery-chewing Bond villain . . . fortunately, Rickman doesn't travel the easy route.  Gruber, as played by Rickman, is cold and calculating, and actually acts smart, instead of merely claiming to be smart and then being thoroughly outwitted by the hero.  He always appears to have an ace hidden up his sleeve, and is so convincing at giving this impression, it's hard to tell throughout the film whether he or McClane truly have the upper hand.  Other actors probably could've played Gruber fairly well, but Rickman makes Gruber one of the all-time great villains.  As for the rest of the cast, they're all pretty good.  Bonnie Bedelia does a nice job as John's soon-to-be-ex-wife Holly -- she plays her with enough smarts and feistiness to break the usual \"damsel in distress\" mold.  It's also worth mentioning that Paul Gleason, who plays the obstinate police chief Robinson, pretty much sets up the modern action movie stereotype of the authority figure who refuses to heed the advice of the maverick hero.  The character is stupid to a fault, and he's wonderful because of it.<br><br>\"Die Hard\" is a terrific example of what happens when all the pieces of a film fall together perfectly.  There simply are no weak spots or dull moments in the film.  Is \"Die Hard\" one of the best overall movies ever made?  Probably not.  But it's undeniably one of the best action movies ever made, and it just might well be the perfect modern action film.  Grade: A","user":"MadReviewer","rank":[346,463]},{"title":"You'll \"Die Hard\" with this action-lover's action movie","rating":10,"date":"4 January 2005","review":"One could claim that 1988's \"Die Hard\" is one of the most influential action movies ever made because it basically revolutionized one of the most copied (but never matched, at least in terms of quality) formulas: a loner, by some unique twist of fate, battles it out with an \"x\" number of terrorists in an enclosed environment.<br><br>By the time that \"Die Hard\" was released, the action movies were most often dominated by the likes of Arnold Schwarzenegger, Sylvester Stallone, and Chuck Norris. Star Bruce Willis, whose only notable credits at the time were television's \"Moonlighting\" and 1987's \"Blind Date,\" which was released the year before, was the unlikeliest of them all.<br><br>Willis was a wild card - an unlikely choice for the role of our hero \"John McClane\" - since he didn't have any action credits on his resume' and let's face it: Bruce Willis just didn't have the bulging biceps required for a role like this. But that's the beauty of his performance in this movie: he's an everyday guy, caught in a not-so-everyday situation.<br><br>On Christmas, McClane's estranged wife Holly (Bonnie Bedelia) invites him from New York all the way out to Los Angeles to spend the holidays with the family. But it requires him to make a stop at the Nakatomi offices, which is having an after-hours Christmas party. Riding for the first time in a limo, he's introduced to the suave driver, Argyle (De'voreaux White), who gives him some pretty useful advice on trying to win over the wife.<br><br>At Nakatomi, things of course get off to a rough start for McClane, as he gets into an argument with the wife and is left to wallow in his misery. However, those problems are about to take a backseat to the real \"party\" - twelve terrorists, led by Hans Gruber (all-purpose bad guy Alan Rickman, perfectly cast) - seize control of the building and proceed to rob the Nakatomi building of its assets, most of which include negotiable bonds and other valuables. But they didn't count on the \"fly in the ointment\" (pain in the a**) to make things hell for these so-called party crashers.<br><br>Certainly one of the best known action movies ever, \"Die Hard\" did receive the scorn of critics upon its 1988 summer release, but the audiences sung a completely different tune.<br><br>The film was most often praised for the production, with the brand-new Fox Plaza office tower serving as the fictional Nakatomi building. It was also praised for the energetic and skillful direction of John McTiernan, whose most notable credit was the action-sci-fi thriller \"Predator,\" which was released the year before and starred Arnold Schwarzenegger.<br><br>Bruce Willis was the perfect actor for this performance, since he brings the wit and vulnerability to a role like this one. If Stallone or Schwarzenegger were in this movie, I'm sure the effect would have been a lot different.<br><br>Personally, I think \"Die Hard\" is one of the greatest action movies ever, up there close to my favorite action movie of all time, \"Raiders of the Lost Ark.\" Like Indiana Jones in that film, \"Die Hard\" had an Everyman cast in the role; McClane, like Indiana Jones, wasn't a larger-than-life musclebound grotesque: he was a real guy that you cared about, who got hurt, and had real feelings.<br><br>That's why I think both of these movies have sort of stood the test of time as becoming what they are best known for today: action classics, and they're here to stay, ladies and gentlemen.<br><br>10/10","user":"dee.reid","rank":[266,382]}]