[{"title":"Very thin sex comedy, dressed to entertain but with nowhere to go","rating":6,"date":"13 January 2009","review":"\"A New Kind of Love\" is a forgettable farce comedy teamed with Newman and Woodward  It's an unpretentious story: a simple, mannish woman foolish1y devotes herself to a career instead of doing what women are supposed to dohunt for husbands But she gives her beauty treatment, a new style and expensive clothes and she'll straighten out and find a man The new look is that after her marked change, the man mistakes her for a prostitute <br><br>Although she's humiliated, she encourages his misunderstanding, telling him sensational stories about herself until he falls in love with her! The implication: if satisfying a man's infantile sex fantasies is the only way to get him, it's better than being an ordinary professional woman <br><br>Joanne Woodward plays a fashion designer who, with blonde hair and showy makeup, actually looks more uninteresting than before <br><br>Newman plays a sportswriter whose athletics with blonds has kept him from winning the Pulitzer Prize He's an arrogant, alcoholic ill-bred man  As usual, he has some effective lecherous looks and self-disgusted expressions, but with all the charm and the grace","user":"Nazi_Fighter_David","rank":[15,17]},{"title":"A NEW KIND OF LOVE (Melville Shavelson, 1963) **1/2","rating":5,"date":"4 October 2008","review":"Writer/director Shavelson treads Billy Wilder territory with this Paris-set romantic comedy; nevertheless, he’s more successful penning witty dialogue (making him something of an underrated figure in this genre) than concocting funny situations (which, in spite – or because – of their satirical/fanciful bent come across as heavy-handed most of the time).<br><br>Still, it was refreshing to watch the Newmans letting their hair down (incidentally, the couple’s previous stint in the French capital – in Paris BLUES [1961], with which I actually preceded this viewing – had been of a more serious nature): Joanne Woodward, especially, demonstrated a lighter side which has rarely been exploited (and earned a Golden Globe nod in the process)…though she seemed much more at ease playing the tomboyish fashion designer than the tale-spinning high-class ‘broad’.<br><br>At 110 minutes, the film eventually wears thin – but the colorful scenery, a nice title tune (sung by Frank Sinatra, no less) and the supporting cast (including Thelma Ritter, George Tobias and Marvin Kaplan, not to mention a fun guest appearance by Maurice Chevalier as himself) ensure that a generally pleasant (albeit forgettable) time is had by all. For what it’s worth, looking up the film in a book my father has on Newman (written by Michael Kerbel), it’s stated that A NEW KIND OF LOVE was “Newman’s worst film” and his career nadir; while that might be too harsh a judgment, I have to say that I am quite fond of Newman’s previous and subsequent comic efforts – respectively Leo McCarey’s RALLY ‘ROUND THE FLAG, BOYS! (1958) and J. Lee Thompson’s star-studded WHAT A WAY TO GO! (1964) – both of which I’ve just acquired following the actor’s demise…","user":"Bunuel1976","rank":[5,5]},{"title":"An Old Kind of Schlock!","rating":21,"date":"21 May 2003","review":"When the credits for this one began to roll, accompanied by Frank Sinatra's jazzy update of the standard with the same name as this film's title (and which sounds like an arrangement by Sinatra's frequent and best collaborator, Nelson Riddle, who is, unaccountably, not listed in the credits), I thought I was in for a treat.  An attractive cast; top-notch professionals behind the camera; Errol Garner adding his matchless pedigree to the musical scoring; gowns by some of the most renowned Parisian couture houses;  plus the participation of several of that era's purveyors of upscale chic; and, finally, Joanne Woodward in a title sequence (designed by George Cukor's frequent visual consultant, Hoyningen-Huene, also listed as this film's color coordinator) surreptitiously snapping photos of the window displays of Manhattan's most expensive retailers.  Ah, but what a disappointment followed.<br><br>To start, the script is surprisingly and tastelessly lacking in wit; the promised Paris locations are, for the most part, studio recreations; Paramount, by the time of this production, was no longer using its high-quality 70mm VistaVision process for most of its \"A\"-list productions; and the stars, Joanne Woodward and Paul Newman, were never so thoroughly sabotaged by  ridiculous plotting,  rarely funny dialogue, and the rather listless direction of Melville Shavelson.  And Miss Woodward had also to endure some particularly unflattering hair styles by George Masters, including an ugly platinum wig she was required to wear in several key scenes.  (I mean, she can look great as a platinum blonde!  Just check out 1960's \"From the Terrace.\")<br><br>There are a (very) few positive attributes, though.  Eva Gabor lends a touch of much-needed glamor, as a character named Felicienne (Now there's a name that suits her!); Marvin Kaplan does his usually reliable shtick as the hero's sidekick/schlemiel; and Thelma Ritter, given pitifully little to do, survives this disaster with her fan base intact.  But then, toward the end of the proceedings, Maurice Chevalier is dragooned into a seemingly interminable reprise of the music hall hits with which he had long been associated, in a scene where a bevy of females go into paroxysms of ecstasy over his supposedly irresistible Gallic charm.  So it finally became apparent why, during the credits,  Lanvin and Scandinavian Airlines System, among others, preferred their part in these proceedings to be described as \"with the somewhat horrified participation of...\"  They must have been given a look at a rough cut of this mish-mash before the final release prints were readied.  Quel abomination!","user":"gregcouture","rank":[8,10]}]