[{"title":"Very creative death scenes, gory and funny - and absolutely beautifully acted by Vincent Price","rating":8,"date":"17 July 2014","review":"* Some mild spoilers ahead *<br><br>Vincent Price, the star of countless B-Movies from the fifties to the seventies, in his perhaps best role ever. This movie is wicked fun; a failed Shakespeare-actor brutally settles the score with all his critics - but they all meet their demise by having to \"act\" a part in the plays of the great bard. Very creative death scenes, gory and funny - and absolutely beautifully acted by Price and an ensemble of many greats of British cinema and theatre.<br><br>Funny enough, there are many parallels between Price's own career and his character's (maybe that's exactly why the director chose him for this part), for Price also failed to get the recognition he deserved until very late in his life and felt unfairly treated by critics. Although many of his films are now regarded as classics, for the most part of his life his films and his (indeed rather Shakespearian) approach to his roles was often ridiculed. Around the time of this film though, critics started to take Price seriously (probably out of fear, LOL).<br><br>But this film is also interesting for another reason: despite the obvious black comedy it looks almost like a blueprint for a certain category of horror films to come, and films like 'Seven' and 'Saw' owe perhaps a little debt to 'Theatre of Blood'. Highly recommended. 8 stars out of 10.<br><br>Favorite Films: http://www.imdb.com/list/ls054200841/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[40,45]},{"title":"A hilarious spoof....Vincent Price rules!","rating":8,"date":"6 October 2005","review":"Vincent Price is one of the best actors of all time, and this is a SUPERB film! Theatre of Blood follows much the same plot formula as Price's earlier success, The Abominable Dr Phibes, only this time instead of playing a deranged madman; Price plays a self-parody of himself. Edward Lionheart is an over the top version of Price in all but name, and it's clear that the great Vincent Price is the only man that could have lead this film. This macabre film depicts what, I'm sure, many actors would like to engage in; the brutal punishment of less than impressed critics. And these punishments aren't just brutal - Price murders his victims in the style of the Shakespeare plays that they lambasted, and the result is a high camp and very fun little horror comedy. The deaths are all violent, but also very playful and inventive. We see people being drowned in a vat of wine, waking up next to their dead husband, being electrocuted, eating their pets and more! And it's all done with such a big sly grin that the result is practically impossible not to go along with.<br><br>Being a British made film, Theatre of Blood utilises that great British style that the Hammer films did so well, and this massively adds to the fun camp element of the movie. We've got all sorts of things from everyone speaking in a thick London accents to the bumbling policed force that made The Abominable Dr Phibes so hilarious. The movie starts of ridiculously, with Price hamming it up to the max, and then it just continues to get more and more ridiculous; with the final two death scenes being beyond the stupidity of anything else Price ever did. Being a self-parody, the impact of this film increases ten fold if you've seen a lot of Price's other work. It's all good though, and despite being knowingly hammy; Price really shows his worth as an actor as he dons all sorts of different disguises. It's hard to mask the Vincent Price persona, but the great thespian manages it a few times in this film. Films of this nature; i.e. ones where a bunch of people get murdered in a certain way, tend to be quite monotonous; but thanks to the superior handling, this one is never dull. Far from it, in fact! Overall, Theatre of Blood, despite often being overlooked, is a great film and one of the best Price ever made. HIGHLY recommended!","user":"The_Void","rank":[19,23]},{"title":"A nasty and witty treat","rating":4,"date":"4 February 1999","review":"Vincent Price is at his extravagant best in this splendidly black comedy in which some complacent critics receive a cunning come-uppance from the dreadful actor who they drove to suicide. Some brilliantly staged imaginative deaths are the icing on the cake, making this a bit like a very camp \"Friday The 13th\". But who wouldn't rather watch Vincent at his best than boring old Jason ?","user":"Mike S.","rank":[13,15]}]