[{"title":"Krakatoa - just east of laughter","rating":7,"date":"3 January 2006","review":"A guilty pleasure. Krakatoa, East Of Java's principal claim to fame is its title, infamously and erroneously placing its subject on the wrong side of the island. Directed by Bernard Kowalski, whose rare non-TV credits include Attack Of The Giant Leeches (1959), and SSsssnake (1973), the film is probably his best, aided immensely as it is by some excellent widescreen cinematography, emphasised with convincing location shooting -facts rarely allowed for in usual criticisms of a film which was cut by almost 30 minutes for an American re-release. The special effects, largely achieved through miniatures and blue screen work, range from passable to excellent and even now, in this era of eye watering CGI, there's still a fascination is seeing how well such a catastrophe was portrayed. The production design, by the veteran Eugène Lourié no less, is worth a discussion on its own.<br><br>In the face of this impending volcanic disaster is a nicely mixed group and one would expect plenty of steamy drama to be played out beneath sweltering decks. But the main problem the narrative is that, despite some promising elements, the audience has little empathy with the main group. Despite the long running time of the film (130 minutes in the full version), they remain too fragmented, and dramatic interest is often discharged too rapidly. But that's part of the fun, seeing how various matters are padded and dragged out between tantalising hints of the eruption to come. How some potential for real drama, like the love-hate relationship between father and son balloonists, or the latent sexuality of the Japanese women etc, is left to die by a unfocused script. For every wooden scene between between Hanson and Laura , one would dearly love more about the convict Dauzig's personal demons or his relationship with his comrades in chains below decks for instance, the resentful tension of which threatens to be every bit as violent as the island they are sailing towards.<br><br>But there's some incidental fun to be had along the way: one thinks of Keith and Werle in their cabin early on for instance, where she serenades him with a song as unexpected as it is irrelevant. It's a shipboard relationship between a heavyweight has-been and a shop worn female recalling that between Ernest Borgnine and Shelly Winters in The Poseidon Adventure of three years later. Keith's addict-diver with the 'shot lungs' provides other of the film's whacked out highlights too, as when, high on his drug, he hallucinates and attacks one of the Japanese women. Eventually confined to a crate suspended over deck until he regains his senses, Connerly is a man who seems doomed from the moment we see him. A point-of-view shot through the wooden bars during his moment of trial, lensed as he swings helplessly back and forth, suggests a prison in which a condemned man finds himself. Such is typical of a film that has many such moments, those in which characters peer at a world fraught with challenge. Whether through eyepieces, between slats, out of portholes, from balloons and diving bells, down into holds packed full of convicts or steaming volcanic cauldrons, apprehensive observation and anticipation is the norm for those who ride the Batavia Queen. These moments aptly reflect back the concerns of an audience who, in this film more than others, have come principally to observe a promised spectacular.<br><br>Such a visual motif is one of the few unifying elements in the film, other than the overarching expectation of an eruption. The overwhelming episodic nature of events is obvious, but at least it has the merit of making the film fairly diverse in content and, even in its full length version, time passes quickly enough in Krakatoa. On top of this, the concluding explosions and fireworks from the island aside, Kowalski does manage one or two effective scenes, such as the scenes in the runaway balloon, the near-comedy of which reminds one of the balloon antics in Those Magnificent Men In Their Flying Machines (1965), or the eerie sound effects caused by the nascent eruption (although one piece of eruption footage, conspicuously recycled, is a distraction). The simulation of audio effects one of the few times that the film actually reflects the subtle indications of such a massive event realistically as, for the rest of the film, the volcano is stereotyped into the usual 'burning mountaintop' image, set in mostly clear air at that, with the phenomenon of falling blankets of ash entirely overlooked. For some reason too, Krakatoa's eruption brings on a storm at sea - a nice easy, extra, touch of drama to be sure, although quite why volcanism should affect the weather is uncertain. Tossed and buffeted, Hanson's ship is a place of refuge amongst the impending devastation and, after dropping off one or two of the travellers who decide to sit out the expected tsunami on shore - a mistake in this situation, as any alert audience immediately realises - it faces the momentous tide alone. Like a similar wave that topples the aforementioned SS Poseidon, the one that comes up here seems to break mysteriously as it approaches the ship, but the outcome is never really in doubt. On shore, the results are worse, but reasonably well done, Kowalski's images suggesting something of a biblical deluge in scenes, which even the film's doubters still find impressive.<br><br>In fact so much has been leading up to the grand finale, so many supporting stories established, that one wishes that Krakatoa would go on a little longer than it does, at least so that there was time to gauge the effect of such tumultuous effects on the key participants. Ultimately, what impresses most these days is the absence throughout of the earnestness that attends so many modern disaster movies. The result is a still enjoyable film, one both flawed and innocent at the same time.","user":"FilmFlaneur","rank":[33,38]},{"title":"Colorful catastrophe film with spellbinding and impressive cinematography","rating":6,"date":"23 July 2005","review":"Adventure/epic movie with a light and plain plot about a vessel weigh anchor from Singapur and with a motley and disparate crew (Diane Baker, Rossano Brazzi, Sal Mineo, Barbara Werle, among others) looking for a hidden treasure in a shipwrecked long time ago . The ship captain (Maximilian Schell) will have to confront rebels , deep-sea divers (Brian Keith), prisoner breakouts (J.D.Cannon) , mutiny , fire and facing specially the Krakatoa volcanic explosion (1883) , which proved to be the most spectacular natural disaster in history .<br><br>This jumbled picture was exhibited in big screen called Cinerama . This became one of the last features to use Todd-AO for principal photography . The film unites the Julio Verne's spirit with melodrama and the action footage is top-notch . There are varied procession of characters , typical shallow roles of catastrophic cinema that a few years later consecrates ¨ Airport ¨ (by George Seaton) , but is hampered by simple characterizations . Breathtaking , spectacular cinematography by Manuel Berenguer , outdoors have been shot in Islands Canarias (Spain) and scenarios are glimmer and glittering as when the ship cross through the cliffs while the volcano erupts . The climax is served by overwhelming special effects by Alex Weldon and the master Eugene Lorie (who had Oscar nomination) , it has main issue the volcano Krakatoa (in the map on the west , no east) and the historical eruption and continuing a demolishing seaquake , climaxed by volcanic explosion , tidal wave or tsunami . Krakatoa Island remained destroyed and died approximately 35.000 people in the catastrophe . The producers learned of the geographic error , Krakatoa was west of Java in the Sundra Strait , only after all of the advertising and publicity materials had been prepared. It was deemed too costly to re-do these materials, and possibly delay the release, for the sake of simple geographic accuracy . Frank De Vol musical score (Robert Aldrich's habitual musician) is good and evocative . Heavily cut after premiere , leaving tale more muddle than before . The motion picture was regularly directed by Bernard L.Kowalski . Rating : Passable and entertaining .","user":"ma-cortes","rank":[19,22]},{"title":"\"Krak'd\" all the way through...","rating":16,"date":"16 June 2004","review":"Though \"Airport\" and \"The Poseidon Adventure\" are most often credited with kicking off the 1970's disaster craze, this film clocked in just a tad earlier and certainly has its share of catastrophes (though nothing is more disastrous in it than the script!) Set in the late 1800's, Schell is the treasure-seeking captain of The Batavia Queen, a steamship bound for a sunken boat that promises to contain bags of huge, priceless pearls. Baker plays his love interest, a mentally troubled lady upon whose memory the entire mission rests. She is also seeking her lost son who her husband off-loaded somewhere before dying. Keith plays a Laudinum-addicted diver who is literally near his last breath. He's toting tacky would-be singer Werle (outfitted in a series of blonde wigs no doubt leftover from her many TV western appearances.) Also on board are father/son balloonists Brazzi and Mineo, bell diver Leyton and a quartet of Japanese female divers, famed for their breath-holding ability. Things get off to a rough start when a sailor falls to his death merely loading the diving bell onto the ship! Then a thoroughly inappropriate song (sounding like The Beach Boys) plays as the ship slips out of port. It gets worse from there as birds mass, fish die, the sky turns orange, smoke descends everywhere and chunks of lava rock are hurled at the boat (and this is before the climactic eruption of the title volcano which, as everyone knows by now, is WEST of Java, not east!) There's even a gaggle of prisoners placed on board to add to the troubles. In the meantime, a lot of dull, pointless dramatics play out amongst the \"Grand Motel\"-level cast. Baker frets, alternately wooden and over-the-top. Keith engages in drug-induced violence. Werle sings the planet's deadliest song while stripping off her horribly non-period, period costume. Mineo flirts with the oldest of the female divers. Schell wanders around with a nipple hanging out of his torn shirt. The bell and the balloon run into trouble. Nothing seems to go right for these hapless salvage-seekers and it only gets worse when Krakatoa decides to blow (and blow!) At this point, the volcano shoots like a Roman candle, filling the air with ash and creating a massive tidal wave that would make George Clooney and Mark Wahlberg jealous. If any of this sounds entertaining, it really isn't except for some of the special effects. The characters are never properly fleshed out and mostly don't share much discernible chemistry with each other. The screenplay couldn't be any more thoughtless and pointless, though there is one memorable line when lower class Werle barks at Brazzi, \"Labels are for jelly jars!\" That one would even do well in today's PC environment! The film was heavily edited after its initial release and what remains is so dull it's hard to imagine what was cut! The opening credits act as a sort of trailer for the film. Some audiences may want to let watching that suffice and skip the rest of the movie!","user":"Poseidon-3","rank":[28,34]}]