[{"title":"Early Brian de Palma; interesting curiosity","rating":6,"date":"26 June 2006","review":"This slight film is mostly going to be of interest to de Palma or Robert de Niro fans, but not many others. Shot in black and white, the tale of a man who plans to get married and has second thoughts, is peppered with more radical cinematography than the plot deserves: the speeded up walking and 'zany'/'madcap' car driving.<br><br>But the idea of a threesome of men talking through jump-cuts ended up being used to much better effect in de Palma's Greetings, which also starred a young de Niro again.<br><br>Also the film's strength or weakness - depending on your mood - is that much of it clearly was shot on film stock that had no sound, so the genius is that much of the film is 'silent' ie it only has accompanying music. This adds to the scenes when dialogue does kick into the film. Unfortunately, the insignificance of the improvised conversations hardly make you want to wait for the next such discourse.<br><br>Worth watching once, but don't spend too much on the ticket!","user":"graeme-93","rank":[13,13]},{"title":"I did not really get it","rating":5,"date":"20 September 2006","review":"This film is very slow paced and dated. I got this as I am a huge fan of Brian De Palma and must, simply must see everything he does and did. This film however is not very good. I would like to pawn it off on the fact that De Palma did not direct the whole thing and was just one third of the team but that would be a lazy cop out. This movie is slow because he and the others are new and inexperienced at film making. This was one of his first movies if not the first and you can tell he is a virgin as far as film-making goes. This movie does a few high points. Their is the typical fast forward motion that most De Palma films have in this but I think it was more to save film in this than to be artistic, but it was out of this that the fast forward shots for Carrie, Hi, Mom, and Greetings were born. Their is also a highly funny portion in this movie with an Arab ex boyfriend of the bride who comes to visit. I love this part of the movie the groom is trying to pass the bride off to the Arab so he can free himself from the shackles that will be marriage, but the Arab does not bite and gets the heck out. This movie is also good because it has early performances by Robert De Niro and William Finnley. They are great as the grooms guest and I love that they are in this. Watch this movie for De Palma's growth as a filmmaker but stay away if you are just an average movie goer.","user":"jed-estes","rank":[9,13]},{"title":"Disappointing farce","rating":5,"date":"21 August 2007","review":"I chose to watch the DVD because Robert De Niro was included in the cast. It turned out that he was a member of the supporting cast in a role of no great importance. It was however of historical interest to see him in one of his earliest roles.<br><br>Charles Pfluger played the role of Charlie a frustrated young man uncertain if he should fulfil his wedding commitments. Many a man has had an attack of the jitters just before marriage so he will have many sympathizers. The film is broken up into chapters each covering the events that lead up to the marriage ceremony. In the lead role Charles Pfluger outshone all the actors The film is a farcical comedy that uses accelerated motion to get laughs. The nonsensical behaviour of men overloading a car with luggage and falling out of the car as they do so was shear clowning and not particularly funny or clever. Speeding off and then returning to pick up luggage which had fallen off was pathetic.<br><br>I don't know what they were doing in the cutting room. There were some abrupt changes which suggested some of the frames had been omitted.<br><br>One thing is certain . The music dominated the film. It was deafening at times and drowned out the dialogue. This may have been intentional especially in the dinner scenes and party scenes in which everyone talks at once and nobody listens or replies. This is typical of all parties where drinks flow freely.<br><br>Many of the actors tried hard to become amusing characters by assuming annoying voices that were very false and did not ring true.<br><br>On the whole a disappointing comedy.","user":"raymond-15","rank":[8,13]}]