[{"title":"Superb action and serious Jackie!","rating":7,"date":"13 March 2005","review":"\"Police Story 2\" is a movie that mostly shows Jackie Chan's serious side. His performance is relatively mature and restrained, and he allows his character to be portrayed as not only brave, smart and determined, but flawed and selfish as well (his scene with Maggie Cheung after the fight in the playground is a key point). There is less slapstick and more plot than usual for a Chan movie; less emphasis on comedy and more on action. The action sequences are superb, and that deaf-mute guy with the incredible martial-arts skills is one of the most memorable villains Jackie ever had to face (literally: I had seen the film only once before in 1997 and I still remembered him clearly). (**1/2)","user":"gridoon","rank":[11,12]},{"title":"Not as good as the first.","rating":7,"date":"21 October 1999","review":"Police Story 1 was a masterpiece, Police Story 2 is good, its that simple. Its just not as good as the original, but how many sequels are?<br><br>The plot is simple, Mr.Ku is out for revenge and a series of bombs have been set off in Hong Kong, so its up to Jackie and his regulars to investigate. May played by Maggie Cheung is once again the damsel, who's in distress by the way.<br><br>The fights and stunts are up to form. The fight scene in the park is just magnificent. About a dozen henchman grasping various metal objects are after Jackie, who uses everything from climbing frames to see-saws to fend them all off.<br><br>What the film lacks is interesting dialogue, conversations are just boring and the Chinese jokes are untransaltable into English. Jackies character is depressed and all uptight, not as fun as in the original, but the guy did go through hell in the first movie, so I guess its understandable. The pace of film is also too erratic, one minute its a rollercoaster, the next minute its like watching a melodrama.<br><br>Anyway, the action is still top notch and this film paved the way for Police Story 3 SuperCop, which gained recognition in the U.S with a theatrical release.","user":"SkylessWing","rank":[10,12]},{"title":"One of Jackie's best ever made!","rating":9,"date":"18 September 2006","review":"After reading many reviews and most of the comments on IMDb.com I must say that some people don't have a clue what they are talking about. I mean if you give a review of a Jackie Chan movie you don't have to talk about the plot (even if it is a good one). Because most of the Jackie Chan movies are not about a plot, there is no message from Jackie for you to think about. At least this concerns the films he made before he was indoctrinated by motherland China. He is about the action, martial arts and dangerous stunts. The bigger the better. In short mind blowing spectacle. He tries to show you different skills and stunts in each movie he makes and he has been managing to do this for a very long time. Naturally old age has caught up with him. Although it has to be said that old Jackie can do more than any average person on this planet. So despite what you think of his political views he does deserve some credit. It is a real joy to watch him in action and furthermore he wants you to be entertained. So if you are giving a review of a Jackie Chan movie than talk about the action. Especially since this is where Police Story really shines at. This film contains the most memorable fighting scenes made by Jackie in his entire career. And that is saying something. In my opinion it is even better than Police Story 1 since it doesn't allow itself to be distracted by infantile comedy as much as in the first. But don't worry if you love the good old slapstick comedic bits. There are still plenty around. Even after so many years the action is amazing. It holds up like it has been made yesterday. It is far superior to his work in Hollywood (Rush Hour, Shanghai Noon)! I have been a fan of Jackie Chan fan since I can say Jackie Chan and I can be very critical about his work (especially his American movies). But Police Story 2 is an action movie that deserves praise simply because it his one of his best, a real classic!","user":"chrichtonsworld","rank":[18,25]}]