[{"title":"A tribute to the oppressed who dared to fight Nazi brutality...","rating":7,"date":"24 April 2004","review":"'Hangmen Also Die' takes as its story, the assassination of Reinhard Heydrich, a German Nazi official, head of the security police, chief deputy to the head of the Schutzstaffel, Heinrich Himmler, who organized mass exterminations of European Jews during the opening years of World War II... and also the subsequent retaliatory devastation of Lidice, a Czech mining village<br><br>With his usual skill, Lang weaves a tale of gripping suspense: the Gestapo's efforts to find the assassin; the workings of the Czech resistance fighters; and the traitor who is finally hoisted on his own petard<br><br>The film is an indictment of Nazi brutality and a tribute to the oppressed who dared to fight it","user":"Nazi_Fighter_David","rank":[36,41]},{"title":"A Devastating Blow Against the Nazi War Machine","rating":10,"date":"28 January 2006","review":"Made at the height of WWII not long after the events upon which it is based took place, \"Hangmen Also Die\" is a testament to the patriotic spirit of the Czechoslovakian people under the most dire conditions imaginable. After the Nazis have invaded and conquered the country, a brave resistance fighter assassinates the brutal leader of the German occupation forces, SS leader Reinhard Heydrich, who, like Klaus Barbie, was a ruthless butcher of the innocent. Heydrich subjugated the Czech people by murdering, torturing and enslaving hordes of non-combatant civilians. <br><br>Just before the Nazi tyrant is shot, he threatens to end a factory slowdown by the murder of hundreds of Czech workers. It is this threat that precipitates the assassination. The desperate killer of Heydrich, member of an underground Czech resistance group, narrowly escapes capture with the assistance of civilians who suffer the consequences immediately afterwards when many are taken hostage by the Nazis, with the threat of imminent death hanging over their heads if the assassin is not turned over to the Gestapo.<br><br>At the center of the tense drama is Nasha Novotny, flawlessly played by Anna Lee, as the daughter of a distinguished university professor and patriot, portrayed by character actor Walter Brennan. Nasha is instrumental in aiding Brian Donlevy (as Dr. Svoboda, the assassin with ice water in his veins) to escape his bloodthirsty Gestapo pursuers. But when Nasha's own father is picked up by the Gestapo, she is forced to question her loyalty to the resistance, begins to regard the man she has saved as a deadly threat to her family and nearly turns traitor to save her father's life. Expatriate German director Fritz Lang and his scenarists show great sympathy in portraying this all too human failing. In a few simple touches they go far beyond stereotype in showing how the recalcitrant patriot overcomes her strong personal misgivings to rejoin the heroic struggle against the Nazis.<br><br>\"Hangmen\" is not a movie for the mechanically minded. Its craft is the art of understatement. Many of the events dramatically most important to the story -- such as the assassination -- are not depicted or happen off-screen. Whole sections of the plot line are there only by inference. This is particularly true at the end of the film, when the entire conspiracy to frame up an enemy collaborator is only hinted at before it is sprung as a surprise upon the audience, as on the unwitting villain. How did the underground resistance fighters arrange to fabricate so deadly a case against a traitor? We can only guess, but may hardly object to the ironic way in which the informant meets his end.<br><br>Fritz Lang has a well known reputation as a leader of the noir school of film maker. Yet, in spite of its horrifying premise, the movie is neither bleak nor pessimistic but a straightforward affirmation of the struggle against tyranny. Unlike many of his less gifted followers, Lang is no mere stylist but is just as much concerned with the historic and moral significance of his story as the artful way in which he presents it. To those who might object that the Nazis are portrayed as stereotyped bad men, the answer is that the Nazis were precisely what the film shows them to be: ugly brutish travesties of human beings. And who would know that better than Fritz Lang and his excellent scenarist Bertolt Brecht? Both of them had lived in Germany under the Nazis and escaped to the United States to strike a devastating propaganda blow against the enemy.","user":"mbuchwal","rank":[38,45]},{"title":"Good anti-nazi propaganda, but not good history.","rating":7,"date":"17 March 2000","review":"One suspects this film registered better with viewers in 1943 than it does today. Despite being suggested by the actual assassination of Reichs Protector of Bohemia and Moravia Reinhard Heydrich, better known to the Czechs as \"The Hangman\" because of his excessive brutality in dealing with residents of the conquered regions, it is almost total fiction. Even so it is not bad as a rather involved drama and was very likely good anti-nazi propaganda.<br><br>Perhaps it is well to start with what actually did happen to Heydrich on May 29, 1942. Two young Czechs, Jan Kubis and Josef Ganchik, parachuted in from an RAF plane and managed to ambush \"the Hangman\" riding in his open Mercedes. Armed with both machine pistols and a bomb, the apparently did little harm by shooting, but did explode the bomb under the car. Heydrich's spleen was penetrated by bomb fragments and debris causing death several days later, possibly more by infection than anything else. The two Czechs evaded capture briefly, but witnesses under torture revealed their hiding place in a church and the SS killed them. In a massive retaliation, Hitler picked the village of Lidice, more or less at random, from among places known to harbor anti-German sentiment, and ordered its total annihilation. The people of Lidice had nothing whatever to do with the assassination, of course.<br><br>In HANGMEN ALSO DIE we have the story of a lone assassin, using an English made pistol, whose getaway taxi was forced to move by German soldiers, causing him to take refuge during the curfew at the home of a Czech professor. The professor's daughter, Mascha, had impulsively directed the German pursuit away from him. The German police suspect the girl, but release her in the hope she will lead them to the wanted man. They also round up many Czechs, including the girl's father, and begin shooting them as hostages. The girl at first intends to give information, hoping to save her father, but in the end is persuaded otherwise by the Czech resistance. A plan is concocted to bamboozle the SS and save the assassin and the girl, but what it is you will have to see for yourself. Be assured it is incredible.<br><br>As you see, this story has little to do with the historic assassination and its aftermath, beyond illustrating the SS brutality, but it does make a mildly entertaining wartime adventure with good propaganda value, largely because of the rather low key, intensely personal nature of the plot elements. Some of the characters are very real and believable, e.g. the Gestapo Inspector Gruber, the girl Mascha, and her father, all ably portrayed by Alexander Granach, Anna Lee, and Walter Brennan respectively. On the other hand, some characters are more like cardboard cut-outs and get wooden performances to suit. Brian Donlevy as Dr.Svoboda, the assassin, fits this category alas, as do a number of others. What realism there is seems likely to have been the contribution of Bertolt Brecht rather than John Wexley, who got the credit for the screenplay. One likes to think that Fritz Lang did the best he could with a mixed bag of acting talent, but this can hardly be said to be his best effort.<br><br>Just why Hollywood producers seem to prefer fiction to the facts when dealing with historical material is a major mystery to me. In 1943 the general facts of the assassination were known, if not all the details, and could have made just as dramatic a story as this fictional one. It is worth a watch, though, especially if you like Anna Lee.","user":"FISHCAKE","rank":[52,67]}]