[{"title":"Underestimated","rating":10,"date":"11 August 2004","review":"Well, I guess this is why movies are so personal to the viewer.<br><br>I've read some of the other comments here and have seen words like \"condescending\" and \"mediocre.\"<br><br>I couldn't disagree more.  \"Mississippi Burning\" is an intellectually challenging movie.  It demands that you immerse yourself in the worst of southern culture, whether you like it or not.<br><br>Based on a true story, the film takes place in 1964 (my birth year, incidentally) in a small town ugly and virulent with racism.  The good ol' boy sheriff and his stoolies ambush and in cold blood murder three civil rights workers.  The world's a-changing, but the power-brokers in this place refuse to let that happen.  They'll do anything to prevent blacks from taking their rightful place at the table - literally.<br><br>The FBI sends a couple of mismatched agents in to search for the three missing young men.  One agent (Hackman) is 'old school', sly, and knows his enemies a little too well.  The other (Dafoe) is a naive Kennedy fire-eater, ready to bring the full force of the FBI and military down upon this small town's head.  Although he is easy to underestimate at first, he grows into his role, showing astonishing decisiveness and strength.<br><br>The relationship between the town's blacks and whites is complicated and fraught with rules - spoken and unspoken.  It's a not-so-secret secret that the civil rights workers have been murdered.  Hackman and Dafoe just have to get the bodies and the evidence, that's all.  Fear and loathing prevent that from happening, until the wife of a deputy (the amazing Frances McDormand) throws herself on the fire and blows her slimy husband's alibi.<br><br>There is justice - of a sort - in the end.  It's not enough.  Real change crawls on it's belly in the south.<br><br>\"Mississippi Burning\" is a movie of operatic gestures.  The script is spongey with regional color and snappy, powerful dialogue.<br><br>Hackman and McDormand are simply magical.  They don't take or make a false step from the first frame to the last.  As she would go on to prove in later films, McDormand doesn't just 'play' a character - she IS that character. And Hackman is never more affecting that in this film.  One syllable from him is more subtle than an entire Shakespeare speech when delivered by a lesser actor.  Hackman is a national treasure.<br><br>IMO, Dafoe is a well-meaning revelation until circumstances forces him to cave into Hackman's just-get-it-done ways.  He comes to see that idealism must relent to pragmatism in extreme cases, although that knowledge repulses him.  He wants nothing more than to get out of the south and go home to a world he believes is cleaner and more simple.<br><br>The conclusion of \"Mississippi\" is more bitter than sweet.  The guilty are arrested and convicted, although their various punishments are a joke.  (R. Lee Ermey is the only one in the bunch who meets a just fate.)  McDormand is brutally beaten to within an inch of her life for betraying the status quo and doing the right thing.  Although she and Hackman have fallen in love, she refuses to leave with him because \"this\" - gesturing to the vandalized ruins of the house she was born in - \"is my home.\"<br><br>I know the history, and I know this movie inside and out.  And yet I still bawl like a baby every time I see it.  The power of this film and the fact that \"Mississippi\" is based on ACTUAL EVENTS never fails to get to me.<br><br>\"Mississippi Burning\" has a place in my 'Top 50 Dramas.'","user":"WindWoman3","rank":[75,83]},{"title":"The Best Film of 1988","rating":19,"date":"19 June 1999","review":"Great movies are ones that invoke a strong emotional response that lingers long after the movie is over. Mississippi Burning is that kind of film. You may love it, you  may hate it. You may think that it is an accurate depiction of the south in 1964, you may think its pure fiction. No matter what you will respond strongly.<br><br>Director Alan Parker has been down this road before with Midnight Express, another crushing, gut-wrenching tale based on a true story. In both cases, a great deal of liberty is taken with the facts, but that doesn't matter. Mississippi Burning is not a docudrama or an A &amp; E special, it is at its heart, a police drama, and a near perfect one at that.<br><br>It is criticized by some for its depiction of southerners of the time as a group of brain-dead racists with no moral fiber whatsoever. I don't believe that is the movie's intention, but it spends time showing this side of society to make us understand how hate breeds itself, and how it becomes a way of life and an accepted standard. As one character states, \"When we were seven years old, they told us that segregation was in the bible. You hear that long enough, you start to believe it\".<br><br>Mississippi Burning won a (well-deserved) Oscar for cinematography, but sat and watched Rain Main take home the majors. It was clearly the best film of 1988 and stands as one of the great works of American cinema of the 80's. Hackman and Dafoe are at their best, and Frances McDormand delivers a beautifully understated, powerful performance as the deputy's wife - a woman at war with her sense of right and wrong, struggling with fear and loyalty. Her character is the centerpiece of the movie.<br><br>This is not a preachy or melodramatic movie. You won't get a lecture on why racism is wrong. You will get an rich, engaging crime drama depicting a pivotal time in American History, and you will never forget it.<br><br>**** out of ****.","user":"DanB-4","rank":[108,127]},{"title":"It broke my heart","rating":9,"date":"31 December 2005","review":"Not saying this isn't an excellent film, it is just bluntly honest. I remember in English class in high school, we were learning about racism in the 60's, and how horrible it was. The worst part was that I am from a very racist town, unfortunately, and watching the beginning of the film terrified me because I felt like this world hadn't changed since I felt like I was living that film. Being one voice sometimes can either be helpful or get you into a lot of trouble.<br><br>I didn't want to see this film again because of the awful situations I saw or heard of. Now, I am out on my own, and I had the chance to see the movie once again, and felt that I could see it. It's a terrific and very powerful movie that can get anyone to cry unbearably. It's not just the actors, but Gene and William's characters, I wanted to be just like them, they were able to stand up even though the many times of being knocked down and caring so much just to try to in some way save that town.<br><br>I honestly feel that everyone should see this movie, it can change your life or make you look around and want to change things. I know this comment feels more like a lecture than a comment, but that's how much this movie got to me. I think we all can do something right in this world, it's just a matter or standing up. Even if this film isn't historically accurate, it's accurate enough to see how people treat other people. Hopefully, we will have a better future for generations to come.<br><br>9/10","user":"Smells_Like_Cheese","rank":[144,174]}]