[{"title":"A surprisingly modern documentary","rating":7,"date":"9 April 2001","review":"Pasolini filmed this documentary in 1963, looking for an account of sexual life in Italy at a turning point in history. He travels south and north, to towns and countryside, interviewing intellectuals, workers, farmers and kids. The result is a strikingly accurate portrait of diversities in the country, and of inhibitions and problems to talk about a \"natural\" thing. Between the notable people interviewed, Nobel prize poet Ungaretti, writers Moravia, Cederna, Fallaci, a whole professional football team, and more.<br><br>What stroke me more is the great journalistic pace of the documentary, the technique of intermixing different areas of the country, a very clever approach. A great work still \"modern\" nowadays.<br><br>Sadly amusing the part where Pasolini (an homosexual himself) asked common people an opinion about homosexuality receiving answers of total denigration.","user":"alessio","rank":[15,16]},{"title":"somewhat dated but still very insightful with strong questions and good answers","rating":8,"date":"1 December 2008","review":"Pier Paolo Pasolini always has a streak of the documentary filmmaker somewhere in his body of work, where he usually went for expressing his poetic viewpoint on the lower classes (i.e. Mamma Roma) and, later on, the dark fables and tawdry tales of Oedipus Rex and Arabian Nights. If Love Meetings, his only straight documentary feature, isn't completely impressive it may be because in the little moments when he tries for something poetic, oddly enough, like in the numbered transitions, it doesn't really work as well. Those little bits come off as dated 60s stuff. On the contrary though when Pasolini simply takes to the street with a 16mm and a microphone and asks people directly about sex and women's roles and homosexuality and fidelity and freedoms related to all of the above then it gets really interesting. In fact, for a movie relegated to Italian cities and countrysides, with sound-bytes from across the spectrum from college kids to professors (and author Alberto Moravia early on) to farmers in the fields, and done so on the fly and in classic cinema verite style, it doesn't usually feel very old fashioned.<br><br>Much of what's discussed and dug up by Pasolini (who reveals himself wonderfully here as a solid journalist, something I would have liked to have seen more of in his career after seeing this) can be relatable for today's youth, if only as a cohesive set of opinions and viewpoints and occasional factoids on standards set between men and women and privacy and liberation and so on. To be sure some of it is stuck in its time and place (practically all of the children asked \"Where do babies come from?\" say the stork, or something involving God or other). But a lot of it is so absorbing because of the generous flow of ideas- it's a wonderfully edited piece, as sometimes crudely constructed as it is, which is part of the point as a true independent production- and Pasolini's determination to get as much as he can at the heart or whatever at sexual relations and societal norms and what's changed over time in Italy and if there can be any more change in the future. It's probably the most obvious example from the director to screen in a sociology class. 8.5/10","user":"Quinoa1984","rank":[8,8]},{"title":"Good Interviews","rating":10,"date":"10 August 2008","review":"Comizi d'amore (1965) <br><br>*** (out of 4) <br><br>Pasolini travels around Italy throwing a mic into various ranges of people asking frank and honest questions about sexuality. Various topics ranging from homosexuality, prostitutes, divorce, sexual freedom and even asking kids where babies come from. The type of people range from college students to the rich and poor and to women who normally can't speak openly. I'm sure this film was more of a sensation when originally released but I think it holds up quite well today for several reasons. For one, it's interesting to look back over forty-years ago and see how young people at the times thought about sex but also how the older people back then looked back on the moral and religious rules of their youth. The film also holds up well today because things really haven't changed too much whenever you really break down the groups of people like Pasolini did. I'm not sure is there was a point to this documentary as it seems like the director simply wanted to know what the country felt on certain issues. There's a lot of humor to be found in the film but most of this comes from the answers the children give about where babies come from. The most interesting thing, knowing that the director was gay, is him asking people about homosexuality and the answers they give him. Most people reply with disgust and I kept wondering if the director would crack and say something but he never does. I think the film goes on a bit too long but it's an interesting look at sexuality on moral and religious aspects.","user":"Michael_Elliott","rank":[10,11]}]