[{"title":"A loving punch in the gut","rating":10,"date":"25 November 2017","review":"Gary Oldman plays real life British 60's sensation Joe Orton, the author of \"Entertaining Mr. Sloane\". His performance, for me, goes at the very core of a gallery of real life characters who run the gamut from A to Z and then some. From Sid Vicious to Ludwig Van Beethoven, from Lee Harvey Oswald to Joe Orton and in 2017 Winston Churchill - not to mention fictional literary characters like Count Dracula. With Joe Orton, Gary Oldman reaches some kind of mountain top. He finds innocence in this emotional and sexual misfit and he projects Orton's genius with a profound flawed humanity. His tragic lover is played by another extraordinary actor, Alfred Molina - I've just seen him in \"Feud\" playing Robert Aldrich with such virtuosity that I have developed a personal relationship with Aldrich as if I knew him personally. Oldman and Molina create something we've never seen before and Stephen Frears know exactly how to capture it. As if this wasn't enough, Vanessa Redgrave play's Orton's agent. Even if you've never heard of Joe Orton, do yourself a favor, venture into this dark and human universe.","user":"danielledecolombie","rank":[26,26]},{"title":"An intimate, carefully crafted biopic with uniformly superb performances.","rating":10,"date":"11 August 2004","review":"I don't usually enjoy biopics, but PRICK UP YOUR EARS is a glorious exception. Many biopics don't have strong narrative arcs (simply because people's lives generally don't), but this one does -- primarily because it focuses on the rapid deterioration of the relationship between playwright Joe Orton and failed novelist Kenneth Halliwell. With the obvious exception of the horrific conclusion, the issues faced by these two London writers will probably ring painfully true for many members of the audience. Who hasn't felt like Halliwell at some point -- or even Orton, dealing with a Halliwell-esquire partner? <br><br>This is where PRICK UP YOUR EARS succeeds while so many other biopics fail: while it does not shy away from the sensationalistic aspects of Orton's life, it never neglects the complex relationship beating at the center of the narrative. I can safely say it's one of the rare cases where I found myself relating on a human level to the biographical subjects, instead of dryly watching them from afar. <br><br>Director Stephen Frears deserves kudos for his warm, understated approach. It's almost hard to praise his directing because it's so unobtrusive; but this is exactly his strong point. He is confident in the story's inherent power, so he wisely gets out of the way and lets it unfold naturally.<br><br>And he is helped marvelously by the uniformly great performances; there simply isn't a wrong note struck by the cast. Even supporting roles, like those of Orton's sister and brother-in-law, feel like real human beings. Of course, the real standouts are Oldman, Molina and Redgrave.<br><br>Though his physical appearance isn't dramatically altered, Gary Oldman still seems unrecognizable compared to his previous work; this is how strongly he becomes Orton. His carefree swagger is by turns charming and infuriating. You understand why Halliwell is both entranced and insanely frustrated with him. He also looks a little bit like Dana Carvey - just by the by. <br><br>Molina is no less astonishing. Bald at 25, frustrated, neurotic, sexually incapable... the character is a hulking mass of awkwardness, but somehow he evokes tremendous sympathy. You alternately want to hug this guy and shake him silly. (The scene in which Orton is informed of his mother's death is heartbreaking - for both men's reactions.) <br><br>Meanwhile, Redgrave is a delight. Her line readings are exquisite and she gives the movie a crisp cleverness without crossing the line into self-indulgence.<br><br>For all the tragic and uncomfortable elements of Orton and Halliwell's relationship, the movie still features some hilarious scenes. The cheeky title, Orton and Halliwell's divergent accounts of their lifestyle together, the conversation with Brian Epstein, and Halliwell's \"we were having a conversation\" gave the movie a gleeful edge of naughtiness -- one the viewer suspects was strongly inspired by Orton's own approach to life and work.<br><br>In short, I highly recommend this movie. Though its description may seem sensationalistic -- a gay man brutally murders his successful young lover -- PRICK UP YOUR EARS triumphs as both a simple human drama and as a biography in which its subjects are made more intimate rather than more remote.","user":"bijin_chick","rank":[47,52]},{"title":"Fantastic- need I say more?","rating":10,"date":"13 December 2003","review":"One of Gary Oldman's first films and need I say, one of the best? Based on the biography by John Lahr, this film tells the true story of British playwright Joe Orton and his \"friend\" Kenneth Halliwell.<br><br>This film is sad because we all know the outcome of Joe and Kenneth right from the beginning. Interesting storyline, fantastic acting all round especially from Gary Oldman (Joe) and Alfred Molina (Kenneth) who both absorb into the characters with incredible style. <br><br>This film is a classic, especially if youre a Gary Oldman. This is another piece of evidence that Gary can not just act in a role, he can go into it. <br><br>\n5/5","user":"Bon_Jovi_chick","rank":[28,33]}]