[{"title":"One of the best (and most underrated) comedies of all time","rating":10,"date":"8 March 2005","review":"Before I review this film, I want to mention that I've seen it about ten times and have yet to stop laughing at any of the jokes. This is one of the best written and acted comedies that I've ever seen. The plot is airtight, and the jokes are perfectly timed and delivered. This is due in large part to the spectacular cast of the film. Jamie Lee Curtis, Johh Cleese, Michael Palin, and my personal favorite Kevin Kline as Otto the moronic ex-CIA agent who's too stupid to realize that he's stupid. The film centers around the four aforementioned actors who are involved in a bank robbery, and the conniving and backstabbing by each that takes place afterwards. A large portion of the comedic material in this film comes from the mixture, or more precisely clash, of British and American cultures. Kevin Kline's portrayal of Otto the red-blooded American with entirely too much ego and confidence is contrasted perfectly by John Cleese's reserved and in Otto's words \"sexually repressed\" English gentleman who is too scared to go out and live his life. Jamie Lee Curtis is also great as the title character who is determined to back-stab and cross anyone and everyone in order to get what she wants. Finally, there's Michael Palin as Ken the hit-man/animal lover/severe stutterer who must kill a key witness in order to protect his boss. If there are any funnier scenes than the ones where Ken must kill this witness, I haven't seen them. Palin is absolutely brilliant, easily one of the best comedic performances ever. The film is close to 2 hours long, but the plot is so clever and well structured that it's over before you know it. To me, that is one of the trademarks of a great film. You don't want this movie to end, and you're disappointed when it does. Do yourself a favor and watch A Fish Called Wanda and you will wonder why you haven't seen (or in many cases even heard of) this film before.","user":"Cpartak","rank":[160,188]},{"title":"The Funniest Movie Ever Made","rating":10,"date":"31 May 1999","review":"This is the only film I ever paid to see two days in a row. I missed too much of it the first time because of my own hysterical snorting laughter.<br><br>This is a work of comic genius. And, like any good film, the screenplay is at the heart of the belly laughs. Every character is given a detailed personality quirk or two, and then it is shamefully exploited for laugh after laugh. Note for example, John Cleese's speech to Jamie Lee Curtis about how awful it is to be British - the eternal fear of embarrassment. Moments later, he is caught buck naked in a marital tryst in some else's flat by the people to used to live in his own home. Also, the funny-offensive envelope is pushed to the limit when K-K-K-Ken (Michael Palin), the passionate animal lover inadvertently kills three innocent dogs in his attempt to murder an old woman who would otherwise be a prosecution witness. Now that's funny!<br><br>Cleese's character, Archie Leach (Carey Grant's real name) is a likable buffoon  of a lawyer, happy in his banal existence until he meets the sexy American, Wanda (Jamie Lee). I cannot even being to describe the plot beyond that point without doing it a grave disservice. It twists and dangles about in a world of double-cross and goldfish-eating for no other reason than to set up a joke.<br><br>You cannot speak of this film without mention of Kevin Kline as Otto, a role that won him a richly-deserved Oscar. Otto is the ex-CIA \"weapons man\" who makes it his business to read philosophy but would be more at home with Curious George. An obsessive, self-indulgent, painfully stupid, violent, deceitful, gullible  egomaniac, the character of Otto is amongst the best comedic performances ever delivered.<br><br>The film's funniest scene takes place at Leach's (Cleese) house. In a scene that rivals anything that has ever hit the screen for laughs, the film and its scripts looks deep enough into itself to even give Cleese's dry-as-toast wife a laugh or two. Then, later on, this scene proves to be the set up for even more jokes. A Fish Called Wanda is pure comedy and every scene either provides a laugh or sets one up - it graciously does not waste our time trying to be moral or turning into a formula car-chase flick.<br><br>My comments are choppy but so is this movie. If you see it and don't laugh, check your pulse. We have only been given a handful of good comedies in the last decade. A Fish Called Wanda is a treasure. **** out of ****.<br><br>NOTE: TBS and some other TV networks show this film with the \"offensive language\" edited out. It kills the movie - if you can't hack the language, pass this one over.","user":"DanB-4","rank":[122,149]},{"title":"The Kevin Kline Show!","rating":9,"date":"30 April 2005","review":"Brief and simple: this movie is terrific entertainment! With its uniquely eccentric characters and delightfully absurd storyline, 'A Fish Called Wanda\" unquestionably is one of the funniest films ever made. The exhilarating screenplay works on so many level (a diamond heist gone wrong, Brits vs. Americans, romantic comedy...) and the top-notch cast obviously had an excellent time doing this film-job. There's not a dull moment throughout the entire movie and every sequence contains at least two or three hilarious moments. The humor is very over-the-top at times but, what the hell, it remains a joy to behold. The cast is nearly perfect with John Cleese, Michael Palin and Jamie Lee Curtis at their absolute best. Still, there's one actor who deserves extra praise for his role here and that's Kevin Kline. His hyperactive, deranged and extravagant character Otto is one of the most brilliant roles in comedy cinema ever! His moves, grimaces and monologues will make you fall off your seat laughing. Kline won an Oscar for his role and, everybody who has seen \"A Fish Called Wanda\" will agree on the fact that this was a well-deserved price.","user":"Coventry","rank":[83,100]}]