[{"title":"the most remarkable unsettling film ever.","rating":10,"date":"24 October 2005","review":"If you get a chance to watch this movie, just do it! That's an order!!!<br><br>The leading couple is simply excellent. The natural setting, at first enchanting, becomes more and more frightening. The atmosphere couldn't get more gruesome. Only Australian films succeed in creating so much thrills. You'll never go to the beach the way you used to. Jaws made you terrified at the idea of getting wet, Long Weekend will convince you in staying comfortably at home on holidays. What is the fun of getting lost in nature like that, anyway?<br><br>The ecological message of the script, pretty obvious, never interferes with the suspense of the story. The main characters, evidently archetypes of the modern couple, are apparently doomed from the very beginning. However, the audience gets a weird masochistic pleasure in witnessing their nightmarish destiny. <br><br>Long Weekend is an unknown masterpiece that must be seen urgently. Please do!","user":"braniki","rank":[39,43]},{"title":"the most intelligent animal aggression film","rating":10,"date":"28 May 2002","review":"(Excuse the possible vocabulary or grammar mistakes, I am French)<br><br>The originality - and the force - of \"Long week-end\" is that it is an animal attack film... without animal attack. The two characters of the film commit a succession of little aggressions towards the Nature (with a great N), which will revenge herself, but never directly. Mentioning examples would reveal too much of the film. I will only say it is a real ambient movie, without action, but which distils a traumatic veiled anguish. The final is particularly perturbing and ironical. The term \"unknown masterpiece\" seems to be created for this film !","user":"lolo157","rank":[33,40]},{"title":"An all-time favorite","rating":2,"date":"2 February 2012","review":"A bickering couple decide to spend a long weekend at a secluded beach. Once there, the disrespect they show for their surroundings leads to nature taking it's revenge on them.<br><br>This is the epitome of Australian horror. Not only is it the best horror film to come from down under, but it's one of the best horror films, period. I first discovered this film back in the late 90's and was quite blown away by it. I love the nature strikes back sub-genre, but never had I found such films to be legitimately frightening. \"Long Weekend\", however, really got to me. I'm happy to say that it's still just as effective to this day.<br><br>The mood, the haunting score, the atmosphere of the beach and the overall sense of nature conspiring against the characters all makes for a remarkable amount of tension. I love this film for many of the same reasons that I love \"The Blair Witch Project\", though there are many differences between the two as well. What's more, the animals attacks never come off as fake. A scene where an eagle comes in search of it's egg is raw and eerie. There are no fake birds on wires or men in bear suits to be found here. Our two leads aren't very likable, but that doesn't keep the film from being an unsettling experience. You have to love the ending too, which brings things full circle.<br><br>A masterpiece of mood and tension, \"Long Weekend\" stands the test of time.","user":"Cujo108","rank":[26,31]}]