[{"title":"Definitely a cult classic horror action flick that it still holds up today.","rating":10,"date":"4 October 2015","review":"Maniac Cop is definitely a cult classic horror action flick from the 80's.In New York a man dressed as a police officer is killing innocent civilians. Jack Forrest is a cop and gets framed, the real killer is Matt Cordell, a cop who was sent to prison for brutality and ended up getting killed inside. Forrest, his piece on the side Theresa and detective Frank McCrea try to solve the case, before the maniac cop kills again.<br><br>Maniac Cop is a 1988 American action-slasher film directed by William Lustig and written by Larry Cohen. It stars Tom Atkins, Bruce Campbell, Laurene Landon, Richard Roundtree, William Smith, Robert Z'Dar, and Sheree North. Z'Dar plays the title character, a murderous ex-cop who returns from the dead, chased by his former co-workers. It was released on May 13, 1988, and grossed $671,382 from a budget of $1.1 million. Maniac Cop still is a cult film today.<br><br>I seriously love this action Horror film. Tom Atkins,Bruce Campbell, Laurene Landon did definitely the best acting job. Specially Robert Z'Dar who plays Maniac Cop, a murderous ex-cop who returns from the dead, chased by his former co-workers did a terrific job one of his best roles I have ever saw. I love the sequels but for me this one is the best in the series. <br><br>The acting in this film is pretty decent good for a 80's slasher horror flick. Jack Forrest is played by the legend Evil Dead trilogy Bruce Campbell. Campbell is one of the few actors that can make even the worst of films watchable, and makes any good film like this that much better. After the Evil Dead movies and Army of Darkness this is Campbell's best work. Genre legend Tom Atkins is perfectly cast as McCrea, Atkins starred in some of my very favorite 80's movies including The Fog, Escape From New York, Lethal Weapon and obviously this. He was also the main star of the underrated Halloween 3 Season Of The Witch, a film that would probably be quite well liked if they had left Halloween out of the title. He also played in another horror flick that I do like very much My Bloody Valentine 3D. Richard Roundtree who is better known as Shaft is good in a small role as commissioner Pike, Laurene Landon, William Smith and Sheree North give good support. Robert Z'Dar who looks like a real life Quagmire from Family Guy, is a huge man and is very effective as the supernatural Matt Cordell.<br><br>Maniac Cop is definitely William Lustig's and Bruce Campbell's best Action Horror fun flick from the 80's. I really miss the 80's because back than they had much better action horror slasher films. 10/10","user":"ivo-cobra8","rank":[39,42]},{"title":"Amazing blend of action and horror!","rating":9,"date":"1 June 2001","review":"When I saw this movie on the market I thought 'what the hell' and bought it. I was so surprised by this movie that now i'm on the search for the sequels. The storyline is good and the action with the horror is great. Watch out for 'Tango and Cash' big jawed baddie Robert Z'Dar and surprise cameos from Sam Raimi and Boxing champ JAKE LaMOTTA. There are loads of killings, plenty of low-budget action and another SURPRISE moment involving Tom Atkins. Don't miss this before you die or go blind. 9 out of 10.","user":"The Yeti","rank":[34,39]},{"title":"An 80s trash classic! One of my real guilty pleasures.","rating":17,"date":"17 October 2002","review":"'Maniac Cop' is the most enjoyable of William Lustig's movies for me. If I was being objective I'd have to admit that it's stupid trash, but I love it just the same, and never tire of watching it. The team of Lustig ('Maniac', 'Vigilante') as director and the legendary Larry Cohen ('Q', 'The Stuff') as writer really worked well here. Each sequel is slightly worse than the one before - though still entertaining enough - and their latter day attempt to start a similar franchise with the overlooked 'Uncle Sam' wasn't as successful, though that movie was a lot of fun for me. Facially challenged b-grade regular Robert Z'Dar ('Cherry 2000', 'Tango And Cash') \"stars\" as Matt Cordell the Maniac Cop, but the real drawing card here are cult favourites Tom Atkins ('The Fog', 'Escape From New York') and Bruce Campbell ('Evil Dead', 'Crimewave'), who are both always cool to watch. The supporting cast includes the legendary William Smith ('Run, Angel, Run', 'The Ultimate Warrior'), original Shaft Richard Roundtree, and Laurene Landon and Frank Pesce, both regulars of Lustig and/or Cohen. Lustig himself pops up in a cameo, as does his Uncle 'Raging Bull' Jake LaMotta, director pal Sam Raimi, and the ubiquitous 'Buck' Flower. I love 'Maniac Cop', an 80s trash classic that I enjoy every time I watch it. Highly recommended fun!","user":"Infofreak","rank":[31,38]}]