[{"title":"Better than its reputation suggests","rating":6,"date":"3 August 2005","review":"<ul><li>The movie begins with Dr. Frankenstein buying a corpse from a grave-robber to use in his experiments. His daughter's arrival puts a kink in his plans, but he forges on in his quest to create life. When his monster does come to life, it immediately attacks and kills the good Doctor. Tania (the daughter) is also a doctor and wants to carry-on with her father's experiments. So, while the original monster terrorizes the community, Tania hatches a plan to take the brain from Marshall, the lab assistant, and place it into the hunky (Did I just use that word?) body of a retarded servant. Will she succeed? </li></ul><br><br><ul><li>What's not to like about a Frankenstein movie where the basis of creating life is sex? Tania doesn't get all philosophical on us and start babbling about discovering the origins of life and the secrets of God. Sure, Tania wants to see her father's reputation restored by proving his theories, but she also wants to create the ultimate lover and isn't afraid to say so. It's as good a reason as any I've heard in a movie for creating a monster.</li></ul><br><br><ul><li>I've always thought that Lady Frankenstein was better than its reputation suggests. Oh, it's got problems, but I always have fun watching it. Lady Frankenstein comes across to me as an Italian Hammer-style film - rich, vibrant colors, nice Gothic touches, attention to details, and a lot of fake looking blood. The cast consists of a who's who of Euro regulars. Joseph Cotten, Rosalba Neri, Paul Muller, and even Mickey Hargitay give performances that are as good as most any other Italian horror film of the period. I also like the references to the old Universal film that can be found in Lady Frankenstein. For example, Dr. Frankenstein's line about man being God on earth takes Colin Clive's speech from the original Frankenstein to a whole new level.</li></ul>","user":"bensonmum2","rank":[15,15]},{"title":"She don't give a damn bout her bad reputation","rating":7,"date":"28 October 2005","review":"The FRANKENSTEIN saga gets an Italian sleaze upgrade in this fun and highly amusing trash epic that's nowhere near as bad as it's reputed to be. Top-billed Joseph Cotten doesn't have much screen time as weary Baron Frankenstein, but that's OK, his beautiful nympho daughter Tania (\"Sara Bay\"/Rosalba Neri) has just returned from med school eager to contribute to her father's experiments. After the baron's first lightning-born creation backfires in a big way (killing him and then escaping the castle to kill some grave-robbers and a few random naked women), Tania decides to redeem the family name (and make sure she is kept sexually satisfied!) by transferring the brain of her obedient, older doctor lover (Paul Muller) into the virile body of a hulking half-wit.<br><br>Despite the low-grade quality of much of this production, it's still highly entertaining, genuinely fun and is blessed with a fantastic performance by the great Rosalba Neri; an engaging, vicious, demanding, sexy femme fatale who is sick of everyone treating her like a little girl, gleefully attends a public hanging and uses both her brain and her body to manipulate everyone around her to get what she wants. Just as good in a more low-key kind of way is Paul Muller, who manages to actually be sympathetic amid all the sleaze and puts his heart into a role that really deserves much less. The cast includes former Mr. Universe (and Mr. Jayne Mansfield) Mickey Hargitay as a police captain and Euro horror regular Herbert Fux as a grave robber. It's also noteworthy as a precursor to ANDY WARHOL'S FRANKENSTEIN, mixing the gore, camp sensibilities and sex a year earlier.","user":"capkronos","rank":[13,13]},{"title":"Dude, I heard the Baron's daughter is like totally hot!","rating":6,"date":"16 October 2009","review":"Rosalba Neri is very hot indeed as the titular Lady Frankenstein though she is called Mrs. Marshall throughout the film. After her father's death, played by Joseph Cotton who must be wondering how the hell he's gone from Citizen Kane to cheap euro-horror, by the hands of the Baron's creation with a brain supplied by a man that eerily resembles Patrick Swayze circa Point Break, the nubile doctor Tania Frankenstein becomes determined to advance in her father's morbid work. It's a good thing too because I can't see Joe Cotton pulling off asphyxiation and orgasms quite like Ms. Neri can. The Baron's assistant Charles has long been enamored with Tania and wishes to woo her now that her old man is kaput. Tania loves his mind but can't quite picture jumping into the sack with the old horny bastard without a serious makeover. That is where village dolt Thomas steps in as the half-wit has been graced with good looks and brings the thunder into Tania's private lab if you catch my drift. Now, all Tania has to do is put Charles's brain into Thomas' body and voilà! instant marriage material. Too bad Mickey Hargitay as a persistent police captain keeps inquiring into what exactly her father's experiments entailed and why did he associate with graverobbers. Definitely one of the most amusing and downright bizarre endings I have ever seen. Who knew the sight of a mutilated corpse got her juices flowing?<br><br>I give this film a lot of credit by retelling the story of Frankenstein as apposed to the more faithful to the mythos Hammer films which is geared more for the hard-core euro-horror fans. Rosalba Neri is extremely engaging as the sexy doctor and commands your attention in every scene not just her nude ones. The supporting cast does a great job as well with a special salute to Herbert Fux as a slimy graverobber. My major complaint is that this film looks like it was edited with a samurai sword. Scenes appear for a second then disappear without any reason whatsoever. The version I saw was the 84 minute cut though I wonder what was excised from the film as most of the gore and plenty of nudity still remained. On a side note this is the third consecutive film in the \"Chilling Classics\" collection that features an adult woman sexually seducing a mentally challenged man/child. This is not a trend I would like to see continue thank you very much. Grab some popcorn and enjoy this guilty pleasure.","user":"Zeegrade","rank":[9,9]}]