[{"title":"Best cyborg-on-the-run-who-arm-wrestles-for-fun movie ever!","rating":8,"date":"15 October 2006","review":"Not only is this Italian flick a ripoff of THE TERMINATOR, but it predated the arm wrestling cinema classic OVER THE TOP. In an undisclosed future, cyborg Paco (David Steele) is sent to assassinate a blind environmentalist (whose slogan is \"You have no future!\"). But he doesn't finish the job when a bit of his human heart takes over. Paco heads to the Nevada desert to hide out and, while at a cheapo motel, becomes the region's champion arm wrestler. Because we all know arm wrestling is the sport of the future. I laughed out loud when they showed their wall of arm wrestling champs that included wrestlers Bruno Sammartino, Hillbilly Jim, Magnum TA and Dory Funk, Jr. Lead Greene looked so familiar but I couldn't place him. Checking here at the IMDb, he played the Dad in KINGPIN and the meathead in ELVIRA, MISTRESS OF THE DARK. So there is life after Sergio Martino movies. Janet Agren, John Saxon, George Eastman and Donald O'Brien show up for support and are all fine. Sadly, I also read here that Italian character actor Claudio Cassinelli, who plays Saxon's hired hit-man, was killed in a helicopter crash while filming that. I guess that is why Saxon's men off him quickly at the end and you just see him lying face down. That is really too bad.","user":"udar55","rank":[27,30]},{"title":"A Total Must-See for Fans of Bad Movies","rating":8,"date":"14 May 2016","review":"Oh, man. If you haven't seen HANDS OF STEEL, you are doing yourself a great disservice. This movie is amazing. You'll laugh. You'll scratch your head in confusion. You'll laugh some more. It's a science fiction/action film from director Sergio Martino, released in 1986. I'm assuming it was straight-to-video but I would totally pay to watch it on a big screen with an audience. This movie starts off nuts and only gets crazier from there. Our hero in this near future is Paco Queruak (Daniel Greene), a cybernetic assassin with a heart of gold. We meet him at the start of the film as he's about to complete an assignment; he's been ordered to murder an old, blind politician/environmentalist. Paco appears to complete his mission and goes on the run. Why go rogue? Because he had a change of heart and left the old man alive, and now Paco is the target of both the authorities and the organization who hired him. He leaves town, braving the acid rain (because it's the future and the environment, while appearing absolutely normal at a glance, has fallen on hard times) to hide out in the Arizona desert. He finds shelter with innkeeper Linda (Janet Agren) at her little highway outpost, a quiet place with the exception of the constant prostitute traffic and nightly truck driver arm-wrestling competitions. Paco seems hopeful to start a new, nonviolent life in the desert, but if the organization he betrayed doesn't get to him his new arm-wrestling nemesis Raul Morales (George Eastman) will.<br><br>HANDS OF STEEL has everything you could want: cyborgs, future stuff, strippers, violence, unintentional comedy, and loads of arm wrestling. Still not convinced you need to watch it? How about this: at one point, Paco karate chops the head off a snake. If you're not the least bit curious yet, you've got less humanity than Paco's forearms. Paco Queruak is an unsung hero of the action-packed '80s. HANDS OF STEEL is a faded jewel buried beneath a decade of low-budget genre films just waiting to be discovered. What are Paco's intentions? Who is this mysterious (and obviously well-funded) organization behind his enhancements and what did they have against the old, blind environmentalist? Why does Raul insist on tormenting a man who has proved he could twist him into a man-pretzel without breaking a sweat? Does anyone else think that one guy chasing Paco throughout the movie with the sunglasses looked like the butler from \"The Nanny\" with a beard? To the point of distraction? Prepare for none of these questions to be answered. They keep the premise simple. Paco was supposed to kill a man. He didn't. He's gone off the grid and the organization needs to kill him before the government gets ahold of him and realizes they've created a cybernetic assassin. Then Linda enters the picture and shows Paco friendship or love or something and gives him a reason to fight. Also arm wrestling. This movie has an obsession with arm wrestling.<br><br>You see, Linda's inn has competitions between the local truck drivers every night where they compete for who has the strongest forearms. The reigning champion is a beast named Anatolo Blanco but that doesn't stop Raul from running his mouth because he's second-best. He's loud, obnoxious, and a little too handsy with Linda for Paco's tastes. So there's some animosity between the two men right away and Raul, lacking the sense of self-preservation shared by everyone else in the bar, makes it his life mission to harass Paco. There is a fantastic sequence in the second half of the film where Raul organizes a trap that involves a bunch of locals, a car, a tape recorder, and feigned child endangerment to lure Paco out into the open. Dude, Raul is a drunken halfwit. Where did he find the competence to put this scheme together? Neither HANDS OF STEEL nor I know or care. You question every miraculous judgment call that leads to plot advancement and you'll miss out on all the fun. And a lot of the fun is in the details. I love how this movie is set in a near distant future where it's advanced nature manifests as a (single) futuristic car, a laser cannon, and a pair of cyborgs while literally everything else is so very '80s. I love how the baddies have shotguns that double as rocket launchers; seriously, you just shove the mini- rocket into the end of the barrel and pull the trigger (future magic!). I loved the fight between Paco and Suzie, the even cooler cyborg assassin disguised as a prostitute. I love Daniel Greene's wooden performance as Paco set against George Eastman's manic Raul.<br><br>But what I love most of all is that HANDS OF STEEL, like many Z-grade action films I've watched, set itself up for a sequel. At the very end right before the end credits roll, we get a final title card that warns us the movie served as the start of the cyborg era. That's right, Paco was only the first. And we'll never know how it went down from there. But at least we have HANDS OF STEEL, the tale of Paco Queruak and his battle against that jerk at the truck stop in which he karate chops the head off a snake.","user":"brando647","rank":[12,13]},{"title":"Goofy and low-budget, but likable (in a poverty row kind of way anyway)","rating":6,"date":"20 December 1998","review":"Sergio Martino's next futuristic film after his classic AFTER THE FALL OF NEW YORK, is unfortunately not apocalyptic, instead deciding to go more after the \"bleak future\" feel from BLADE RUNNER. Borrowing quite a bit from BLADE RUNNER and THE TERMINATOR, the movie stars Greene (a muscle-bound carbon copy of Mel Gibson for all practical purposes) as a cyborg who gets in a whole lot of trouble and has to find a way to get his old personality back. <br><br>The action scenes are wonderfully lame and cheaply done, the cast was outrageously tiny (and packed full of no-names in pivotal roles, many of whom aren't even credited), and the special effects often cheap and uninteresting. Poor production design, poor costumes, bad writing, but the general silly but meaning-to-be-serious atmosphere work well. This is thanks in large part to Claudio Simonetti's wonderfully cheesy downbeat synth score which has a way of staying with you long after seeing the film.<br><br>The colorful supporting cast of veteran Italian performers also nearly made up for these flaws. The late Claudio Cassinelli is great in his final role as a crazed bounty hunter, as is George Eastman as a vengeful Mexican arm wrestler. Donald O'Brian is sadly wasted in a nothing role as a mad scientist. Strangely enough, recognizable veteran stuntman Sergio Testori gets an unusually large part as John Saxon's top henchman (and even gets a couple lines in as well). Saxon is underused until the last act where he gets to run around with a laser gun bigger than he is!<br><br>Unfortunately large chunks of this film are rather dull and uneventful, and sure takes its time to get going. The last 20 minutes or so are pretty fast paced and feature some cool and out-of-place Sergio Stivalleti gore FX. A likable enough cheapo Italian cheapo action adventure, just very disappointing if you consider Martino's other work. Stay tuned for the ending freeze-frame and quote, which are thoroughly amusing.","user":"Aylmer","rank":[16,19]}]