[{"title":"The Day the Earth Caught Fire","rating":10,"date":"3 March 2004","review":"1961's \"The Day the Earth Caught Fire\" must be judged according to the parameters of classics as 1951's \"The Day the Earth Stood Still\", and not today's special effects mega productions in which the perspective of the disappearance of planet Earth is taken with cynic humor. The idea came to director Val Guest during the Cold War in 1954, and it is under that decade's spirit that the movie is better appreciated. I remember seeing it when it opened, and I've never forgotten that experience, specially its tinted sequence. Forty-three years later I am able to see it again, and it's still the same notable film, not the least affected by today's cinematic technology, because, in its core, Guest's motivation -the worry for the actions of mindless men who struggle to control the Earth- is still relevant. If it's not highly regarded today as \"The Day the Earth Stood Still\", I think it has to do with the fact that Universal sold it as a B movie in America (though not so by British Lion in the UK, where it was a huge success, and won the film industry's top prize for its screenplay) and because not too many critics paid attention to it and wrote positive reviews, establishing it as an important science-fiction movie since then. Although there are very few re-enacted disaster scenes and it relies upon footage of real catastrophes, the tension is handled effectively in the newspaper's office where most of the action takes place, with its overlapping dialogues and constant flow of new information; and in the development of the romantic story in the midst of violence and terror in the streets. Edward Judd, Janet Munro and Leo McKern contribute good performances to this fine movie, shot in wide-screen Dyaliscope.","user":"EdgarST","rank":[60,66]},{"title":"An all-time classic","rating":9,"date":"30 November 2000","review":"This has got to be one of the best sci-fi films ever made. Great plot, snappy and witty script, characters with real depth and histories, and a (debatably) great ending. What more could you ask for?<br><br>Although the plot is quite similar to that of 'When Worlds Collide', the realism of the characters and setting really lift the whole film far above its contemporaries. Its use of journalists to tell the story is similar to that of many of the classic works of literary science fiction (HG Wells' War Of The Worlds or John Wyndham's Kraken Wakes for example) and it follows a similar apocalyptic template as well.<br><br>The theme of mankind's actions causing havoc for the globe, which was originally a criticism of the cold war, is still very relevant today for quite different reasons. The parallel with global warming is obvious, and the graphic depiction of the effects of this are all the more disturbing because we see similar effects, on a smaller scale, around the world on a day to day basis. The film is shocking in its bleak vision of the havoc that mankind has brought upon himself.<br><br>Basically, this is the benchmark for all serious science-fiction, and makes a perfect partner for the other great of the cold war era, \"The Day the Earth Stood Still\".","user":"NymChimpsky","rank":[50,56]},{"title":"The Earth is doomed","rating":9,"date":"16 February 2005","review":"I have seen The Day the Earth Caught Fire several times and is one of the best sci-fi movies of the 1960's.<br><br>Reporters at the Daily Express in London make the startling discovery that the Earth has been knocked of its axis and is heading towards the sun. This has been caused by too much nuclear testing. As a result, freak and unusual weather conditions are happening round the world, including hotter than normal temperatures in the UK, cyclones, freak fog caused by the heat, blizzards and tornado's. The River Thames is drying up too and water is put on ration. To stop the Earth's journey towards the sun, the USA and Russia explode the biggest nuclear bombs to date and if it that doesn't work, Earth is certainly doomed... Through all of this, one of the reporters falls in love.<br><br>The scenes of the streets of London deserted, the fog and the dried up Thames are very eerie. This movie doesn't have much background music, but it isn't needed as the atmosphere is haunting enough.<br><br>The cast includes sci-fi regular Edward Judd (First Men In the Moon, Island Of Terror), Janet Munro (The Crawling Eye) as his love interest and Leo McKern (Rumpole Of the Bailey), Michael Goodliffe (A Night To Remember) and Bernard Braden. Look out for Michael Caine as a policeman towards the end. You certainly cannot mistake that voice.<br><br>This movie is a must see. Fantastic.<br><br>Rating: 4 and a half stars out of 5.","user":"chris_gaskin123","rank":[33,36]}]