[{"title":"Kept Me Awake.","rating":7,"date":"11 April 2004","review":"A 1953 Republic gem and a great noir find. This sort of small black and white drama was actually what finished off Republic as TV shows took up this sort of storyline and style, and the studio didn't adapt. Cop Gig Young and burlesque floozie Mala Powers go adulterous and the realism of the noir photography created on actual Chicago streets allow the viewer to be completely absorbed into their cheap backstreet world. This is such an interesting film, and the low budget actually works in its favour......like Monogram's startling DECOY of 1947. Chill Wills appears as a very special and strange character and I won't spoil who he is at all. A very clever and ultimately quite emotional film from a fascinating period in American Cop-dom: 1953...as LA CONFIDENTIAL proved for that city. Find this and relish it, and thank the crummy world of Republic for making it. As a bonus for all us noir-ees, the sensational Marie Windsor is here as well, by the narrowest of welcome margins.","user":"ptb-8","rank":[27,28]},{"title":"A satisfying, big-city movie  sort of a Grand Hotel or Dinner At Eight gone noir","rating":8,"date":"23 August 2004","review":"Contrary to the croonings of Liza Minnelli and Frank Sinatra, The City That Never Sleeps is not New York, New York but Chicago, Illinois.  At least it is in John H. Auer's 1953 movie of that name, sort of a noir-inflected Grand Hotel or Dinner At Eight, that opens and closes with floodlit vistas of the wedding-cake Wrigley Building.  Several characters' lives intersect in an urban crime drama that even offers a touch of the fanciful.<br><br>Gig Young, at the center, plays a cop who's dissatisfied with his job and with his marriage (his wife, Paula Raymond, makes more money than he does). Off hours, he hangs around a strip club called The Silver Frolics on Wabash Avenue to see, both on stage and backstage, headliner Mala Powers.  That relationship is a rocky as his marriage, and she's as unhappy with her lot as he with his (`Whaddaya want me to do? Crawl into a deep freeze?' she taunts him during yet another breakup).  Then Young heads to the precinct for the graveyard shift, riding in a prowl car with a new partner he's never met before (Chill Wills, who also plays the unseen `Voice of the City'). <br><br>\nDuring Young's nocturnal tour he meets up again and again with the various players in the plot.  There's rich, crooked lawyer Edward Arnold, who blackmails him into burglarizing some incriminating papers; his two-timing wife, Marie Windsor; former magician turned criminal William Talman; his own brother (Ron Hagerthy) who's now Talman's apprentice; his pop (Otto Hulett), a police veteran; and a `mechanical man' (Gregg Warren) who entertains passersby in the Silver Frolics' window.<br><br>Some of the ties among the characters are up front, others furtive, to be doled out as the plots thicken.  By the end (Poverty Row having learned the lessons MGM taught a couple of decades earlier in the titles cited above), there's tragedy and heartache, reappraisals and reconciliations.  There's even a character who vanishes as mysteriously as he materialized  a whiff of the supernatural which curiously fails to leave any influence on the way the stories unfold.<br><br>The City That Never Sleeps shows the right breadth for a big, urban story  from Arnold's moderne penthouse to Young's middle-class flat to the raffish alleys running off Wabash Avenue.  Director of photography John Russell (later to film Psycho) helps Auer out with some crafty touches (a telephone dial glowing from a flashlight shone upon it comes to mind).   It's not a haunting movie, but it's a satisfying one  a title that did Republic Pictures proud.","user":"bmacv","rank":[32,34]},{"title":"The Heroic Mechanical Man...","rating":8,"date":"10 May 2013","review":"...is but one of the many elements in this quirky film that makes it SO enjoyable. The plot is complex, but still masterfully laid out, the dialogue is clean and effective, and the imaginative direction, lighting, cinematography and editing clearly place \"City\" in the ranks of minor classics.<br><br>In fact, you are rarely aware that this was a low-budget Republic Studios pic. There's one scene near the end...the standard \"calling all cars\" scene in the police station, which could have been shot with a single guy at a microphone with a bare wall behind him; instead, we see a bee-hive of activity, with several radio cops reflected in a magical labyrinth of glass panes, with shadowy figures passing through the hallway in back of them. It's seemingly insignificant details such as this that keep \"City\" bristling with intense visuals and character interplay from beginning to end (yeah, the scene with William Talman breaking into Edward Arnold's office at night could have been edited down to about half its length, and the continually recurring stock footage of the police car's POV while racing past a bunch of 1940's parked cars is pretty comical).<br><br>Having a heavyweight actor like Arnold in a pivotal role lends acting \"gravitas\"; William Talman, an actor I've never really cared for, is superb---subtle, cunning, and ultimately maniacal. The confusion between John Kelly Sr. and Jr. as the tension builds is but one of the masterful plot devices, and the subplot of the Mechanical Man (Wally Cassell) and his dreams of an idyllic life with his lady love amidst the wonders of nature is positively brilliant, as is his change of heart and willingness to sacrifice himself for a noble cause. Cassell's physical skill is as impressive as the emotional sensitivity he brings to the role* And how about mother-in-law's offstage nagging of Gig Young? I found it subtly creepy, almost like mother's voice in PSYCHO.<br><br>On top of it all, we have the Chill Wills character; you must decide for yourself if it helps or harms the film; I took it as just another off-beat element in this imaginative story of a single night in Chicago. Who knows?--maybe the whole thing was a bad dream from which Gig Young wakes up at the end.<br><br>Only Mala Powers disappoints in her role; she was rather miscast as the tough, world-weary dame, though her more sensitive scenes are fine.<br><br>* NOTE - The December 22nd, 1960 episode of TV's June Allyson Show was entitled \"SILENT PANIC\", and featured HARPO MARX as a deaf-mute who works at Christmastime as a Mechanical Man in a department store window; he also happens to be the only eyewitness to a murder on the street. Sound familiar? Unfortunately, the hour-long show fails miserably to live up to its fascinating premise. But I wonder how many other films, radio shows, stories, etc have used this novel plot device over the years.","user":"lrrap","rank":[14,14]}]