[{"title":"Excellent Brit shocker. One of the best in the underrated Quatermass series.","rating":27,"date":"27 May 2003","review":"'Quatermass 2' is even better than the excellent 'The Quatermass Xperiment'. Like the first movie it was a remake of the original British TV production which I have sadly not seen (both are lost I think). Val Guest directs once again, Brian Donlevy reprises the role of the crusty Professor Quatermass, and this time Nigel Kneale was allowed to adapt his own original script, which probably explains why it improves on the first movie. Quatermass stumbles across a mysterious secret Government installation which is supposedly developing synthetic food, but is in fact something quite different and frightening. Donlevy isn't my favourite Quatermass but he is better here than in the first movie, and the supporting cast includes John Longden in the role originally played by Jack Warner, Bryan Forbes as Quatermass' assistant Marsh (another change of actor), comedian Sid James of 'Carry On' fame, and Hammer regular Michael Ripper. 'Quatermass 2' is a very entertaining and suspenseful thriller, which hasn't dated as half as much as you'd expect. It will particularly be interesting to fans of 'Invasion Of The Body Snatchers', which it shares certain themes with, and 'The X-Files', which many people, myself included, would argue owes this movie and the next in the series 'Quatermass and the Pit' a large debt. Nigel Kneale is one of the most underrated writers of SF and horror of our time (over 80 years old and still active!), and the Quatermass movies are his best known and enjoyable achievements. I highly recommend them all.","user":"Infofreak","rank":[31,31]},{"title":"DISTURBING CLASSIC OF 50\"s SCIENCE-FICTION","rating":27,"date":"27 January 2000","review":"This was one of the first of its kind;  a subtlety scary vision of a secret alien takeover.  X-FILES may owe a debt to this low-budget, but nevertheless effective film of the powers-that-be who are conspiring with the invaders, and one lone, determined scientist who accidentally uncovers the sinister plot.<br><br>QUATERMASS II (U.S. title: ENEMY FROM SPACE) was produced before INVASION OF THE BODY SNATCHERS, the film it is often compared to, due to their thematic similarities (loss of identity, social oppression, dangers of conformity, and blind allegiance to a greatly questionable, authoritarian power). However, it was released in the U.S. shortly after BODY SNATCHERS, probably making it look like a copycat to some.<br><br>Superb writer Nigel Kneale (excellent script, highly original for its time, derived from the earlier BBC serial) was known to strongly despise Brian Donleavy's gruff performance as the lead character.  Kneale did not like the fact that Donleavy presented the character as a cold, methodical misanthrope who treats his colleagues like expendable underlings.  He will probably want to boil me in oil for saying this, but I felt that presenting the lead character as morally ambivalent and ethically questionable jettisoned the standard 50's scientist/hero sterotype (for once he is not nice and charming).  It also added a further degree of tension to the well-plotted story.  In many ways, his alienated character is somewhat alien; perhaps that's the only true way to resist social pressures and conditioning.  The allegory here is strong.<br><br>As the story opens, Quatermass is driving one night on a remote country road.  He is furious that the stodgy Whitehall bureaucrats rejected his funding request for a proposed moon colonization project.  A speeding car nearly hits him head-on as it runs off the road.  The shaken passengers are a frightened woman and her boyfriend, who is in a crazed state, and has a strange black mark on his face.<br><br>Quatermass returns to his isolated lab, where radar reveals to his assistants that many small meteor particles (at least that's what they assume they are) have descended over a rural village known as Wynerton Flats.<br><br>Going out there with his colleague, Marsh, they first discover his moon project, fully constructed, and some small, mysterious rocks.  As Marsh examines one, it emits an eerie gas and pops in his face, leaving the weird black mark.  Strange soldiers arrive, behaving like aloof zombies, abduct Marsh, strong-arm Quatermass in the typical fascist tradition, and order him to leave.  (There may be one flaw here:  Why didn't the \"soldiers\" either abduct or kill Quatermass, instead of letting him go, so he can inform?)<br><br>Naturally the authorities all have tight lips about the secret activities at Wynerton Flats, but Quatermass manages to convince a few officials to go out there with him.  A government aid (with that strange black mark on his wrist) conducts a formal tour of the plant, where everything seems to be normal.  Not so.  The small group is indoctrinated by the zombies (who resemble Nazis), but Quatermass manages to escape.<br><br>(This scene truly exposes Donleavy's ruthless side:  He and a woman are taken into a large dome, but Quatermass flees, leaving the woman behind, without any concern for her fate.  Hell, he doesn't even abide by the old fifties hero tradition by risking his life to save the distressed damsel. In many ways Quatermass was an ahead-of-his-time anti-hero.  I always felt that this added a disquieting strength to the drama and the severity of the dire situation, but I guess that Kneale will still vehemently disagree).<br><br>I'll stop here, but don't worry, the worse is still to come.  The sense of growing unease and mounting terror (strong qualities of your finer British Science Fiction at that time) escalates.  Be patient, for it does carefully build into a total state of alarm, as Quatermass and the local angered citizens challenge the invaders (who have taken over most of the government and military officials) to a brutal showdown.  There is something highly menacing in those domes.<br><br>This impressive film is true Science Fiction at its best.  It thrills without pandering and is thoughtful to the point of disturbing.  You can't trust anyone.  Its social and political implications are definitely troubling.  This is not for your Lucas and Spielberg crowd, for we're not talking about commercial catering to eight-year-olds.  Val Guest directs in a cold, cynical Kubrickian manner, accentuating the high degree of paranoia, and the picture's black &amp; white photography conveys a bleak, creepy mood. (Sorry, no pretty pictures here). The intriguing story takes on true nightmarish proportions.<br><br>The few effects won't win any CGI awards (don't forget, computers weren't around then) but the briefly glimpsed monster (in the gothic Lovecraft tradition) is quite sickening.  After all, it can manipulate man's dirty politics, you can't get more reprehensible than that.<br><br>From the late sixties to the late eighties this film was unavailable to the public, and it was feared to be permanently lost, but it later was released on video and shown occasionally on the Science Fiction Channel.  Many notable Science Fiction and Horror authors (I believe that Harlan Ellison and Stephen King were among them) have championed this small, but remarkable early Hammer production.  This is the film that many others have \"borrowed from.\"  Just a polite way of saying RIPPED-OFF!<br><br>For those seeking an intelligent challenge, check it out.","user":"danr51","rank":[40,42]},{"title":"Boy! Do I Remember This One!","rating":9,"date":"28 June 2006","review":"I was never aware that this movie was anything other than a stand-alone feature. I'm not familiar with 'Quatermass' in any way whatsoever. But I saw a movie when I was a kid that was titled 'Enemy From Space' and I've never forgotten it. The scene where a man who has been covered in some black stuff shockingly, jarringly shrieks out and stumbles down the outside stairway of some huge, weird, vat-like structure frightened me enormously. I didn't know what the stuff was exactly, I just knew it was burning the man horribly and his utterly convincing screams drove it into my brain permanently.<br><br>I was pretty young when I saw it at my local 'B-Movies Only' neighborhood theater. I'm not sure how it was elsewhere, but in my hometown there was a movie house that got all the A-List pictures (Cary Grant, James Stewart, Liz Taylor, Disney) and another that made the most of the plentiful supply of small-budget monster movies that were released in the late fifties and very early sixties. Triple Features were often offered in these 'lesser' venues. The beauty of it was that both types of theater thrived in those cable-less, vcr-less days. But I digress.<br><br>So I see this movie and I'm only about 7 years old at the time and that night I couldn't sleep. And though I had sat through the entire thing, my mind was locked into that horrifying scene so completely that I did not really recall another word spoken in the film. It came around to the Biltmore a couple more times and, though terrified, I was irresistibly drawn to see it again, each time absorbing a little more of the content. The challenging storyline wasn't all that easy to grasp - a lot of it went over my young head.<br><br>It was a long time ago but I remember a meteorite falling through a roof, a road that went nowhere, a silent and sinister industrial area, a man who becomes suddenly very sick (in the pub I think) and has a white splotch on his face, severely serious soldiers who seem to be bad guys, a window through which an alien something-or-other is observed and, of course, the unfortunate man covered in burning black oil.<br><br>A truly eerie movie, as engrossing as it is chilling. I would very much like to see it again","user":"worldsofdarkblue","rank":[38,40]}]