[{"title":"lotsa fun","rating":11,"date":"11 October 2001","review":"I had to make a comment simply because most of those I've read have missed part of the point.<br><br>William Katt is an author dealing with a number of emotional challenges all at the same time. All these things start fraying at his psychological health; he's not coping well.<br><br>What's haunting him most of all is the guilt he feels over an incident while he was serving in Vietnam. His buddy is wounded, and requests that William kill him, but William runs \"for help\" and his buddy is captured, to suffer torture as a POW.<br><br>His ordeal at this time in his life that we watch through the movie is his final process of dealing with that guilt.<br><br>Along the way, we are treated to that unique genre of horror-comedy. And, make no mistake, it is both funny and frightening.<br><br>The difficult thing is the direction, which tries to suggest that what he sees (and what we, the audience see) is not what others see. These things are presented so as to fool him, and us, into thinking they are in fact \"real.\" By the time we get to the end, we see what the real deal is.<br><br>It's not perfect, but it was fun.","user":"MovieMusings","rank":[30,35]},{"title":"Underrated","rating":18,"date":"18 March 2005","review":"'House' stars William Katt as Roger Cobb, an accomplished novelist who moves into his creepy aunt's house after her suicide. In bits and pieces, the audience discovers that Roger once lived in the house, as well, along with the aunt, Roger's wife, and their now-missing son, Jimmy. Roger believes that Jimmy is trapped somewhere in this mysterious house, which just happens to be some sort of portal between past and present dimensions...I think? Anyway, the audience becomes involved, well, at least myself and the rest of my company became involved, and you start to feel for this poor guy who has really sorry luck...in all areas. Roger, our tattered hero, has the pretty neighbor Tanya, who likes to come and swim in his pool, and who ALWAYS catches him at the worst times. Then he has the nosy neighbor Harold, played by George Wendt, who might be out to exploit him or may just be generally concerned. I don't know. Then there is the neighborhood dog who likes to dig up Roger's \"saplings\"....<br><br>Overall, I find this to be a fairly underrated little horror movie. It's definitely one of Steve Miner's more innovative attempts, and the music, reminiscent of the F13 music and performed by the same man, Harry Manfredini, is thoroughly haunting. Also, most importantly, the acting is believable. Major points for that. None of this movie is hokey. It could have been...but it wasn't. 7/10 is my vote.","user":"boomcar61","rank":[42,52]},{"title":"Total Horror Fun.","rating":10,"date":"17 August 2004","review":"I watched 'House' back in 1987 when i was 11. I loved it!!! I found it scary and dark and mysterious and funny and i think i've added too many 'ands' to this review already.<br><br>This is about a horror writer (Roger Cobb) who is working on his next book about his experiences in the Vietnam War. His Aunt seemingly has committed suicide and has left the house to him in her will so Roger goes there to work in solitude and is bothered by ghosts and his next door neighbour. He also has to find his lost son who went missing in that house many moons ago.<br><br>This is excellent, it truly is. The title is simple but effective and unlike Amityville we see the nasty things that lurk in this house. The video cover is nice too, really eye catching. <br><br>Roger sets out on a mission to kick ass. Not just the evil ghosts within his house and beyond but his own personal demons. I love that scene where his ex wife turns into that fat monster thing and he blows her away and....well i don't want to spoil it for anybody but it's awesome. The eighties was by far the best for movies especially horror and sci-fi. We won't see movies like this ever again. GOD DAMN YOU Hollywood!!!!!!!!!!!!!!!!!<br><br>'House' is awesome straight from the spooky beginning (did i tell ya that this movie is well spooky?) to the twisty horrible shocking end. Go watch this magnificent film straightaway! Did i say that the comedy is kick ass? The comedy is kick ass! 10/10","user":"fibreoptic","rank":[71,92]}]