[{"title":"beautifully obscure, sometimes non-sensible, and a lot of B-movie biker fun","rating":7,"date":"31 August 2005","review":"Hell's Angels on Wheels, if you're into the biker genre, is not a second-rate vehicle for its promoters, the Hell's Angels (Sonny Barger, reportedly at the time, said it was the \"most accurate\" of the films on them). Going by the sort of Roger Corman standard (not just for biker movies but for his brand of 'fast-food' style films, not very good for you but it goes down fast), of a fight or some other form of action happening every 15 minutes or so, the film is hip in its period way, and isn't pretentious in the slightest. <br><br>Even with the name of Jack Nicholson's character, Poet, nothing near the intellectual and philosophical realm of Easy Rider comes close (though Nicholson's main scenes are some of the best in the film, more comparable to Five Easy Pieces than the Wild Angels). It's about a guy, Poet, who is a gas station attendant who decides randomly to go along with the Angels. Some of the standard plot stuff happens; the hero's girl flocking to someone 'else'; shenanigans in a small town; beefs with the 'pigs'. Leading along the way, in a sense almost in an unintentional training form for a later triumph, Laszlo Kovacs is the DP and he takes down these images usually in more of a documentary form as they ride around, and there is an added (if of course all in good, violent biker fun) intensity to the fight scenes. Along with Nicholson, his usual brooding, cool self, is Adam Rourke, turning in not a bad performance as the leader of the gang.<br><br>Is it trash? Sure. Is it worth watching once? Absolutely, at least if you're curious about/into the period and sub-genre (the music isn't very good, by the way, a sign of what was needed in Easy Rider). Does it give a little room for Nicholson to give a little of his great B-movie gusto? No doubt about it. And is the story paper thin? No doubt about it. Hell's Angels on Wheels is stupid, rollicking good drive-in style fun, with some technical flair and character actor hipness to cover the tracks of the many flaws.","user":"Quinoa1984","rank":[14,15]},{"title":"Exploitation flick contains all the elements...","rating":8,"date":"26 May 2004","review":"Although this film doesn't do much, it accomplishes everything that it set out to do.  It successfully exploits just about everything in order to fulfill its duties.  Sex, drugs, and violence are king here.  The plot is like the women in this film: loose.  There a lot going on but nothing much gets done to further a story.  However, a romance is at its center.  There are some scenes of bikers running amok set against hippy music that work well.  The acting was very good from the entire cast, not just Nicholson (who, as always, was superb).  I'm not going to give anything away, but the ending could have been better.  It was a little cheesy.  This is a pretty good biker exploitation flick although I would recommend Russ Meyer's Motorpsycho if you're in the mood for motorcycle chaos.","user":"Matthew-40","rank":[12,13]},{"title":"Sonny Barger's Recommendation As The Most Accurate Hell's Angels Movie.","rating":6,"date":"27 February 2005","review":"Hell's Angels On Wheels is the movie Hell's Angels president Sonny Barger recommends as the most true to life movie about the Hell's Angels in his autobiography, which is why I decided to rent it and see the movie for myself.<br><br>Buddy (Adam Roarke) is the Sonny Barger character of this movie and the leader of that particular chapter of Hell's Angels. The movie starts when Buddy and his crew are passing through a gas station when Poet (Jack Nicholson) gets fired from his job as a gas station attendant.<br><br>Eventually, Buddy takes a liking to Poet, after an altercation between Poet and another Angel over his broken headlight, and later when Poet backs Buddy up in a barroom brawl. Pretty soon, they vote Poet in as a prospect and he sees the way of life of the Hell's Angels. Buddy passes him his own woman and takes another from a club member. This seems strange to Poet at first, but he finally gets what is going on and decides he does not like it.<br><br>Plotwise, there is not much to this movie. It turns out to be mostly about the girl who gets passed between Buddy and Poet, named Shill (Sabrina Scharf). It is mostly just partying, bike riding and fighting, which I guess is what they are pointing out. Nicholson and Roarke did a great job acting and made the story better than if it would have been had they not been in it. As it is, I only give it about 5.5/10.","user":"FrancesTheWHORE","rank":[15,17]}]