[{"title":"Raw Beauty","rating":9,"date":"17 September 2002","review":"There is a great power in this movie. William S. Hart abandons his familiar cowboy gear to play the role of a Mountain Man guiding a wagon train across the west while trying to discover the truth about his young brother's murder. If the language veers between the poetic scene-setting titles, and the eye-dialect dialogue, there is great strength in Joseph August's photography and compositions.<br><br>More than that, in the context of the silent film, Hart is a great actor. A stage star, he understood that the camera catches the smallest movement of the eye, His gestures, while melodramatically overwrought, are never overly wide. He infuses the character with truth.<br><br>Perhaps this style of movie-making is a mystery to the modern movie-goer. When the shiphands sing 'Weep No More, My Lady', and the titles show the lyrics, they obviously have more importance than sound effects added by a Foley artist for artistic verisimilitude. Perhaps the melodramatic plots are as snicker-worthy as the sort of modern story in which villains commit murder for no discernible reason, but because they are crazed mass murderers, and the enforcers of the law catch them, not because it is their job, but because one of the victims is a relative and 'this time it's personal' ... but I don't think so.<br><br>Both sorts of story are mythic in structure, telling us the truths we want to hear. It may well be that the modern movie-goer will have no patience for Hart's movies in general and WAGON TRACKS in particular. If that is the case, alas, they are missing a fine story, beautifully told, with striking black and white photography. Their loss.","user":"boblipton","rank":[23,23]},{"title":"Mebbe, seegars n the dance of the Red Indians. Jokes apart, this is truly an epic desert western of the silent era with solid acting by William Hart.","rating":8,"date":"12 July 2019","review":"I saw this for the first time recently.\nThe film is about a caring desert guide Hamilton (William S. Hart) who has been hired to lead passengers across a dangerous desert.\nHamilton is awaiting a train which has the passengers n also his younger brother who is a doctor.\nUnknown to Hamilton, a crooked gambler has killed his younger brother on the train n made it look like an accident.\nThe gambler has convinced his sister that the accident happened due to her.\nHamilton guides the passengers including the murderer across the desert hoping to solve the murder of his brother.\nThe film has some top notch cinematography n acting, ther r no shootouts but a picture of a gun keeps popping up on the screen whenever ther is a talk about the murder.\nAlso the torture by the Red Indians is implied while they keep dancing around the fire the whole night.","user":"Fella_shibby","rank":[16,16]},{"title":"Which version is best? The original 78 minutes in my opinion!","rating":9,"date":"8 September 2014","review":"If you wish to view a complete, beautifully tinted print of this movie, your goal is Unknown Video. This original print runs 78 minutes, versus the Kodascope cutdown of 64 minutes. Superbly photographed on location by Joe August, and boasting a charismatic support cast headed by the lovely Jane Novak and also including none other than later movie director Lloyd Bacon as the villain, \"Wagon Tracks\" is not only stunningly directed on real locations by Lambert Hillyer, but superbly photographed by Joseph August. This expensively produced movie really grips the viewer from start to finish. It's a shame the complete 78 minutes version is no longer available and even worse that current prints are not tinted, as was the original movie and the Unknown Video DVD.","user":"JohnHowardReid","rank":[3,3]}]