[{"title":"Simply heartbreaking","rating":9,"date":"28 January 2007","review":"Unlike some other reviewers here, I did not find the acting stagy or over-the-top melodramatic. Then again, most of the movies I watch are from the 20s and 30s, so I am used to this style of acting.<br><br>I was surprised by this movie. It breaks your heart, then never lets up. There's no light comedy to offset the drama, and there's no happy ending.<br><br>John Barrymore was amazing. My favorite performances of his have for a long time been Dr Jekyll (1920) and Svengali (1931). I've seen many other films of his (including Counsellor at Law which many people claim to be one of his best performances), but after seeing Bill of Divorcement tonight, I think this might be my most favorite performance. Sure, it was hammy, but that doesn't make it bad. Barrymore emoted his heart out, and my heart did literally ache each time he expressed his own agony and pain on screen. I was shocked to find myself in tears over his character's pain.<br><br>Billie Burke was a wonderment as well. I know her best from her slightly comic roles, such as the supercilious wife in Dinner at Eight, or her various Mrs. Topper roles (and, yes, of course Glinda the Good Witch). I didn't know she had it in her to do dramatic stuff, but she had me in tears as well on more than one occasion. She really made me feel the agony and conflict she was in, being in love with Paul Cavanagh and yet feeling pity and obligation to Barrymore.<br><br>I found the writing and the direction to be superb. One particular scene was almost sublime in its pathos: Billie Burke sitting in a chair, John Barrymore on the floor with his arms wrapped around her, his head in her lap as he cries. He can't comprehend why she doesn't want him, he asks her didn't she vow to be with him through better and worse, through sickness and in health? He asked what he did that was wrong, other than to get sick? He reminds her of what a kind person she is, how he even noticed her once stepping around a \"green crawling thing\" so as to not harm the creature, and he wonders if she could show pity and compassion to the green crawling thing, then why couldn't she show the same kind of compassion to him? Three-hankie stuff for sure!","user":"Ursula_Two_Point_Seven_T","rank":[32,34]},{"title":"Barrymore, Hepburn & Burke, Oh My!","rating":10,"date":"8 April 2005","review":"A BILL OF DIVORCEMENT is only one of the problems to confront a man returning to his family after fifteen years in an insane asylum.<br><br>Although this George Cukor-directed soap opera is chiefly remembered now for Katharine Hepburn's film debut, its other strengths should not be overlooked. The film was primarily crafted to be a showcase for the histrionic talents of John Barrymore and he certainly does not disappoint his audience. Charging his way through the range of emotions from giddy elation to utter despair, Barrymore, left profile firmly planted towards the camera, gives a wonderful master class in ham acting. This is in no way to disparage his performance -- he makes leaping a bit beyond the bounds terrifically entertaining.<br><br>Hepburn is a sensation, of course, very fresh &amp; unspoilt, giving real urgency to the plight of a headstrong girl who must make a wretched decision during a domestic upheaval. The viewer cannot help but think of the many decades to come in which she would continue to delight moviegoers. The trouble is that Kate's excellence makes it somewhat easy to forget the film's real female lead. In a rare serious role, Miss Billie Burke gives a splendid portrayal of a good woman torn between duty to a man she no longer loves and the possibility of joy with the man she now adores. In the scene where Barrymore forces her to make a commitment to him, Burke's body language painfully communicates the agony of her breaking heart.<br><br>A fine supporting cast adds to the film's enjoyment: sensitive David Manners, one of the ablest young actors of the era, as Hepburn's loyal boyfriend; gentlemanly Paul Cavanagh as Burke's fiancé; waspish Elizabeth Patterson as Barrymore's strict sister; and elderly Henry Stephenson as the wise family doctor.<br><br>Movie mavens will have to look fast to spot the excellent young English actor, Bramwell Fletcher, unbilled as the fellow at the Christmas party who opens the windows for the carolers.","user":"Ron Oliver","rank":[33,38]},{"title":"Hepburn's first film","rating":7,"date":"30 January 2007","review":"When Hollywood was madly casting the ingénue in \"A Bill of Divorcement,\" they saw many, many tests of actresses but still weren't satisfied. Katharine Hepburn took a look at the test scene and realized immediately why no actress was acceptable - it was a terrible scene. So she did another one and won the role.<br><br>Let's just say that Hepburn started her amazing career with amazing good fortune. Her director was the excellent George Cukor, marking the beginning of their marvelous collaboration; and she had the great John Barrymore as a co-star.<br><br>The story concerns a man who comes home from an insane asylum only to discover that his daughter has grown up, his wife has divorced him, and she is about to marry someone else. He's as much in love with her as he has always been and can't bear the thought of her leaving him.<br><br>Based on a play by Clemence Dane, \"A Bill of Divorcement\" doesn't hold up today. It's very talky, done in a stagy manner, and melodramatic. Some of the performances are melodramatic as well - it was the beginning of talkies, and many of the actors had not yet adapted to the technique of acting on film, Billie Burke especially. My big quibble with the story is that, due to the times, it can't distinguish between \"insanity\" and emotional problems or chemical imbalances, which makes the Hepburn character's ultimate sacrifice seem unnecessary.<br><br>You can really see in this movie how Katharine Hepburn would have been so unusual to audiences with her angular, athletic body, high cheekbones and austere looks. She once said of Angela Lansbury, \"She was unusual in the wrong way, and I was unusual in the right way.\" It's certainly true. She's quite beautiful and interesting-looking. Ultimately she would tone down her acting. For a first film, she's wonderful.<br><br>The star is John Barrymore, who gives a timeless, heart-wrenching performance. What a wonderful actor and what a loss that his last film was made in 1941 and as early as 1938, he was playing his roles drunk.<br><br>Recommended definitely for Hepburn aficionados and to see the great John Barrymore being the magnificent actor he was capable of being.","user":"blanche-2","rank":[23,28]}]