[{"title":"A Great Quadrangle of Mischievous Witches.","rating":10,"date":"6 April 2005","review":"Before HARRY POTTER and DESPERATE HOUSEWIVES and after BELL, BOOK, AND CANDLE, THE WITCHES OF EASTWICK came out and charmed the pants off moviegoers including me who, when we saw the film in theatres, loved not only the fantasy element, but also the great interplay between the actors.<br><br>Loosely based on the John Updike novel of the same name, THE WITCHES OF EASTWICK concerns the shenanigans of three housewives, all close with each other, who live in a sleepy New England town and dream of having a man come to their lives. What they don't know is that their empathic desires materialize not a knight in shining armour, but... Jack Nicholson? Surely you jest. Cher, the first to meet him, loathes him -- her verbal assault is something that belongs in an Edward Albee play. But he matches her word for word and bests her. Susan Sarandon, playing completely clumsy and repressed, gets ravaged in a bombastic way that would make any woman go nuts. And Michelle Pfeiffer in her breakout role meets a tender man who wishes he could be a woman.<br><br>The key her is not the story: that the Devil has his own designs as Darryl van Horne and that he may have some eventual opposition from the town is predictable -- it's the way Nicholson embodies his role as van Horne. Pacino would do an over-the-top performance in THE DEVIL'S ADVOCATE years later; Nicholson prefers to change his demeanor with regards to the women he gets involved in, and his Devil is almost an overgrown boy who just wants to have fun and enjoy life. Seeing him sharing screen time with such different actresses is worth the entire movie -- he oozes chemistry with all of them, he makes you believe he's that charming and sweet or passionate and maybe irrepressibly vulgar, full of his own cat-like sensuality. He's having fun, but making it known it's also not a one-note performance.<br><br>Performances are what save this movie from its overblown ending and 80s production values: to watch Veronica Cartwright stealing her scenes, perfectly comfortable in playing these types of roles, go from concerned to completely mad, is a hoot. That she also may be a latent witch... is possible. Cher tackles her role like a total feminist and brings a lot of her own blunt self; Susan Sarandon does wonders to what in her own words was an underwritten part, and Michelle Pfeiffer glows.<br><br>Great fun, fantasy at its purest form, THE WITCHES OF EASTWICK makes you want to draw a 'D' in the sand and see what happens.","user":"nycritic","rank":[37,46]},{"title":"A Bewitching tale with something for everyone","rating":8,"date":"10 October 2006","review":"This is a genre blending film I found at Fry's Horror section for only  $2.49 retail. It can be described as a supernatural Battle of the Sexes  with horrific, comedic, and dramatic elements with a bizarre love  story/ orgy at the center of it. The 3 \"witches\" (Cher, Susan Sarandon,  and Michelle Pfeiffer) make a request for the perfect man who is  delivered to them in the form of Daryl Van Horne (Jack Nicholson) aka  the Devil.   According to Daryl, when a man is encountered by a strong woman, his  manhood goes limp. The woman is called a \"witch\" and set on fire. This  is used to make women scared of men and scared of themselves. Daryl's  attention allows the 3 women to embrace their sexuality, fertility,  passion, and ambition. Eventually, they realize they no longer need men  for anything, including Daryl. This culminates in the ultimate showdown  with man vs. women.  The SFX quality was good enough to win the BAFTA Award in 1987. The  music by John Williams earned him an Oscar and Grammy nomination.  Nicholson gives an incredibly over the top performance that was good  enough to win both the NY &amp; LA Critics Choice Awards.  There is a lot of back story to this as well. Bill Murray was  originally set to play Darryl and Cher and Sarandon switched roles once  they walked onto the set. The studio execs hassled the director so much  that Miller halted production. When they threatened to replace him with  another director, Nicholson said he would walk away from the  production. This ended the feuding.  Favorite Quote: Almost all the dialogue. Cher asks Nicholson's  character if he is married. To which he responds, \" I don't believe in  it. Good for the man, bad for the woman. She dies, she suffocates. Then  the Husband complains that he is f*cking a dead woman and he is the one  that killed her. Where is your Husband?\" Cher replies, \"Dead.\"  DVD Extras: Full Cast &amp; Crew Bios, a set design feature entitled \"  Conjuring Eastwick\", a \"Bewitching Look Back\" at the history, Awards,  Commentary, Interviews, and a Trailer (which indicates there are  deleted scenes missing from the DVD. There should also be the numerous  alternate endings they had shot).  Bottom Line: Bewitching tale (pun intended) with something for  everyone.  Rating: 8.5/10","user":"carlykristen","rank":[36,47]},{"title":"The songs Witchy Woman (women) meets Sympathy for the Devil, combined for a comic fantasy","rating":9,"date":"14 May 2003","review":"George Miller (Mad Max) creatively sets the stage for a story of three witches and one Lucifer, who are in regular human form, in a small, uptight New England town. Of course, for a tale like this one can try to suspend disbelief, and it has to be when dealing with the supernatural. Thankfully, Miller has great casting tastes- Cher, Sarandon, and Pfieffer are wonderful in their roles, each with an acute, potent sexuality that was at their peaks in the late 80's. And then there's Mr shark grin himself, Jack Nicholson, who gives another superb layer to the performance of the dark prince. There are other actors who have portrayed the man downstairs- Al Pacino in Devil's Advocate was the devil as lawyer, Billy Crystal was himself in the Woody/Dante sequence in Deconstructing Harry, even Elizabeth Hurley in Bedazzled. <br><br>But rarely have they had this much outright fun and charm with the role, enough to almost make me, a man in his 20s, charmed too. Maybe it's the eyebrows. Nicholson gives one of his best over-the-top performances as the \"horny-little devil\" Darryl, who comes into town during a storm and cooks up more than that for his avid female guests. Of course, he doesn't have control for long, when the girls find they have powers of their own. When the movie gets overly fantastic (which is a number of times) it gets a little hard to take, yet the acting is above par, and the special effects are a delight.","user":"Quinoa1984","rank":[34,48]}]