[{"title":"Fifth favorite James Bond 007 of mine action classic the best of Timothy Dalton flick","rating":10,"date":"19 November 2017","review":"This is simply the best action film. My fifth favorite James Bond 007 film in my top 10 Bond films. It has action and great performance from Timothy Dalton. The film has great dangerous stunts, real actions that is why I love this film to death! I enjoy this film so much even as a kid growing up I loved this film. I'm a hard-core James Bond fan. I make no apologies for believing that Timothy Dalton is the closest thing we've seen to IAN FLEMING's James Bond. Licence to Kill is one of the most underrated decent action films and I love it so much.<br><br>This movie is more about Die Hard action junkies like me. This movie has hard core action than espionage. I enjoy this film I still do even over those years. Sadly this is the last Timothy Dalton film and the last 80's film. After this one Timothy Dalton did not want to make another Bond film.<br><br>The movie is about one of the biggest heroine supplier in the USA in which Felix Letier (David Hedison) and James Bond 007 (Timothy Dalton) captures him, but with the inside man, the drug dealer escapes and kill's Leiter's wife and Felix throws in to the pit with shark in it. Now James Bond goes on a revenge spree and stopping the drug dealer supplying people with heroin. James Bond goes rogue and sets off to unleash vengeance on a drug lord who tortured his best friend, a C.I.A. Agent, and left him for dead and murdered his bride after he helped capture him.<br><br>Timothy Dalton was excellent as James Bond 007 really too bad he wasn't interested to play the role again. I enjoy his two movies The Living Daylights and this one Licence to Kill. Timothy Dalton is once again serious and on target should have been lightened up a bit. Audiences who spend two or more hours with Bond need to laugh once in a while. Thankfully, Q, awarded the biggest role of his film career (following a tip-off from an anxious Moneypenny), was on hand to provide some crucial comic relief.<br><br>Carey Lowell showed to be the best Bond girl in years. She was delightful as Pam Bouvier, a resourceful, beautiful CIA pilot and undercover operative who helps Bond at every turn. Her excellent introduction in the Barrelhead Bar is nothing but pure dynamite. She is sexy hot and beautiful irresistible Bond girl.<br><br>Talisa Soto is in here from Mortal Kombat as Lupe Lamora, Sanchez's girlfriend who has romantic feelings for Bond. She becomes the second Bond girl but Carey Lowell steals the show.<br><br>Robert Davi proved to be an excellent choice for the role of murderous South American drug lord Franz Sanchez. Surrounded by a private army that keeps potential assassins at arm's length, Sanchez was not an easy target.His main associates include corrupt seaman Anthony Zerbe, a drunken pervert and a sadist Benecio Del Toro.<br><br>Desmond Llewelyn as Q was excellent this was the only movie that was the longer run Desmond was. He was Bond's ally who supplies Bond with various gadgets and helps him in the field.<br><br>I love the music scores: Licence to Kill by Gladys Knight, Dirty Love by Tim Feehan and of course my favorite soundtrack If You Asked Me To by Patti LaBelle. This was the last Bond movie that was directed by great director John Glen.<br><br>This movie has ton's and ton's of action: in the opening scene we see Bond sliding from helicopter to capture the airplane that was really dangerous stunt excellent, executed and performed. Bond being on a bloody machine hanging up and Pam shoots Dario and Bond throws him in to the machine. I love the fights on the trucks that was awesome from the airplane Bond jumps on a truck takes It over and he fights those bad dudes awesome. I love the bar fight which is awesome. Actor Branscombe Richmond was in this movie from (Renagade) in which Bond knocks him out. Bond eludes the divers in the water and he skies with a harpoon on one of the seaplanes, stealing $5 million on the way. Bond goes from Miami Vice to The Punisher and he try's to Kill Sanchez by climbing the wall. Bond gets attacked and knocked out by two ninjas. Bond burns Sanchez with lighter that Felix and Della gave him as a wedding gift.<br><br>Licence to Kill is the 16th entry in the official James Bond film series. The 1989 sequel (which was the first not to bear the title of an Ian Fleming novel or short story) finds Bond on a personal mission to take down the drug lord responsible for an attack on his CIA friend Felix Leiter and his wife. Licence to Kill co-stars Carey Lowell, Robert Davi, Benicio del Toro, Talisa Soto, and Wayne Newton and was the final Bond film directed by John Glen and the final film to star Timothy Dalton as Agent 007. <br><br>Bond is such a bad-ass in this movie he kicks all the bad guys he is even more dangerous and crazy than Sean Connery. 10/10 it is my fifth favorite James Bond 007 film because it has insanely action, you have great explosions, real actions, no shaky cam. It is Timothy Dalton's second and last best film in his career he ever did.","user":"ivo-cobra8","rank":[101,113]},{"title":"A criminally underrated Bond picture","rating":22,"date":"22 November 2006","review":"Licence To Kill is one of the most underrated Bond movies since On Her Majesty's Secret Service. Slipping easily back into 007's shoes with style after his previous role as Bond, Timothy Dalton embodies the character. With a break away from the comic-book villains and fantastical locations, the filmmakers decide to focus instead on a very adult and contemporary story about drug smuggling and revenge. Michael G. Wilson and Richard Maibaum's story is engaging and exciting, with a steadfast confidence in their leading man. This is a Bond movie that took risks -- it was the first 15-rated Bond film in the UK -- and surely deserves kudos for doing so. Make no mistake; this is not a family Bond picture. Its themes require a more mature perspective than its predecessors, and the violence is certainly stronger than anything that had come before. Unfortunately, these factors seem to be what critics of Licence To Kill call 'faults'. But why is change so bad, I ask? Casino Royale is getting major appreciation from critics for its grittiness and its darker edge. So why not Licence To Kill? After all, this is the movie that started the current trend, with Dalton's mature portrayal of Bond paving the way for Pierce Brosnan and, without doubt, Daniel Craig. It always amazes me that people do not give Dalton more respect for what he did with the character. This guy started the ball rolling. And boy did he give it a hard push.<br><br>The characters in Licence To Kill are one of it's major plus points. James Bond is the most human we have seen him in 20 years, as Dalton brings a real sense emotional depth to the character; a tortured man full of hurt and pain and vengeance, his determined and stony face almost cracking with the burning hatred that is barely contained inside of him. We also get a strong female lead with Carey Lowell, whose portrayal of Pam Bouvier is at once intelligent, sexy, and funny. On the flip side of the coin, we have a genuinely terrifying villain in the shape of Robert Davi, playing his role deadly straight with not a hint of camp. It's a rare scenario where you feel Bond has met someone of equal competence. The Sanchez character is a frightening presence, and an early role from Benicio Del Toro is just as effective; his chilling grin a fear-inducing sight.<br><br>Technically speaking, John Glen's direction is taught and assured, with the pace never really letting up for the 130+ minutes running time, save at the very end of the movie where the spectacular truck chase sequence perhaps drags just a little. The brilliant Michael Kamen also supplies us with an elegant, sensual and brooding score that is a vital player unto itself, complimenting the visuals excellently.<br><br>In spite of these pluses, there are some minor quibbles. As I said before, the truck finale is perhaps a bit long, even though the stunt work is amazing, but it does slow the pace a bit. Talisa Soto is indeed beautiful as Sanchez' girlfriend but, bless her, she isn't exactly the most talented actress on the planet. She plays her part well enough, but the role isn't exactly Oscar-worthy, and it's not helped by the fact that the script tends to relegate her to the sidelines. Everett McGill's cigar-chomping Killifer is rather too pantomime for me - he just doesn't stand up to the characters of Sanchez or Anthony Zerbe's Krest but he doesn't stick around long so doesn't get in the way too much.<br><br>With a striking leading man in Bond's shoes, Licence To Kill deserves a lot more credit than it gets. This is the film that broke the mould, opening the doors to a more adult, violent Bond world that continued briefly with some of the Brosnan films and certainly with Daniel Craig's portrayal of the character. In Timothy Dalton we have a brilliant actor in the starring role who brought us a more human and believable Bond, yet it is Daniel Craig who is currently getting the credit for these exact traits. Don't get me wrong, his characterisation is superb. But Dalton is the one who started it off, and it is a shame that he only made the two films.<br><br>John Glen says that from all of the Bond movies that he directed, Licence To Kill is the one he is most proud of. And rightly so. Not only do we get a more fleshed-out character in Bond than previous outings, we get a more believable and mature storyline, with great characters and competent direction. Definitely one of the most underrated Bond movies, this engaging film is a great piece of entertainment, and one that I hope will gather praise with time. See it.<br><br>4 stars.","user":"gavsalkeld","rank":[143,171]},{"title":"Might not be the no.1 Bond movie, but Dalton is my favourite Bond","rating":9,"date":"16 November 2015","review":"The Bond film series has been with us since the early sixties and for a character to stand the test of time, there requires a certain reinvention and reinvigoration for it to maintain longevity. Opinions are subjective as we all know, so make of this what you will.<br><br>'Licence to Kill' is one of the top five best Bond movies of all time along with it's powerhouse theme song. Up until this particular picture, we were introduced to Sean Connery's unique suave, set against an array of exotic backdrops and a strong supporting cast. George Lazenby, although criticised for being boring, offered us some great action sequences in his short time as the British spy. A sophisticated edge that was overpowered by it's comical tone throughout his run, Roger Moore took the reins during the 70's and early 80's. Then in 1987, Welsh actor Timothy Dalton donned the role of 007.<br><br>With 'The Living Daylights' establishing Dalton as James Bond, we were given fair warning on the tonal shift. Given this was the 80's, where a number of films were heavily inclusive of hard 'R' violence - 'Licence to Kill' adapted and not only brought us a visceral Bond film, but as many film historians have cited, one of the, if not the closest portrayals of Ian's Flemming's character.<br><br>For those giving current Bond actor, Daniel Craig the credit (or hate in some cases) for a cold and stoic interpretation of the character, I suggest you watch the Timothy Dalton Bond films, because this is where it started.<br><br>In 'Licence to Kill', Bond is essentially a one many army taking on a South American cocaine czar. This is a James Bond that up until this point was never seen like this on screen before. His best friends are maimed, he's stripped of his rank, his government and as it relates to the title - his licence to kill is revoked. He is left with almost nothing aside from his skills and weapons expert, Q.<br><br>Dalton plays Bond as a wounded wolf with a sensitivity and vulnerability visible in his eyes and the way he emotes. As opposed to his predecessors, Dalton plays the character with an introspective approach, where you can feel the torment and tension bubbling inside. Even when he smiles, there is pain, reminding us of what he has endured as a human being.<br><br>Bond's antagonist is played by Robert Davi - another underrated performer known mostly for his roles as a villain. He plays a drug king with a code, where loyalty seems to matter more than the money. We are immediately set with these two huge characters on a road to collision; the dark angel's raid on the reaper that claimed the lives and elements that held Bond together.<br><br>The whole film is non-stop and that also reflects the carnage and violence. The climactic chase is one of the best with the inclusion of trucks, jeeps and a plane against a beautiful Mexican mountain view.<br><br>As a huge proponent for Timothy Dalton's Bond, I advise any fans of the series to watch or re- watch his incarnations. Hopefully an appreciation will come about for how truly great and underrated he was.","user":"gregoridanu","rank":[35,40]}]