[{"title":"Trashy creature feature cash in that's a whole lot of fun.","rating":7,"date":"16 September 2010","review":"Grizzly is directed by William Girdler, written by Harvey Flaxman &amp; David Sheldon and stars Christopher George, Andrew Prine &amp; Richard Jaeckel. Story sees a giant Grizzly Bear terrorise campers and hikers at a state park. The head park ranger sets about capturing and killing the beast but he's met with resistance from his superior and troubled by the number of glory hunting hunters who descend upon the park.<br><br>If you pardon the pun, Grizzly was a \"monster\" surprise hit of 1976. Made for a paltry $750,000, it went on to make over $39 million Worldwide. It may well be a \"Jaws\" coat tail hugging copycat (and it unashamedly is), but credit where credit is due, William Girdler &amp; David Sheldon spotted an opening in the market and got in there in a blaze of blood, grue and roaring ferocity. It was also one of the first of a number of \"Jaws\" knock offs, and while it's silly at times, and beset with bad acting, it is, however, one of the most popular and fun cult horrors of the 1970s. Filmed on location in Clayton, Georgia, Girdler's movie knows exactly what it's about. Keeping it relatively free of extraneous and expositional filler, Girdler knows (and so does the cast) that the bear is the star of the show - well more to the point, that the bear shredding and chomping down on humans is the star of the show. And so it goes, the humans - except for our hero protagonist (George) &amp; wise sage naturalist (Jaeckel) - are annoying and lining up to be either bear lunch or to be badly proved wrong. And what fun it is. It's the sort of film that scared us to death as kids, and now makes us smile as adults.<br><br>The film has proved popular enough over the years to warrant a double disc DVD release. A release that wouldn't be out of place for some critical Oscar winning darling I might add! Now available in a quite lovely anamorphic widescreen presentation (2.35:1), Girdler's (and cinematographer William Asman) shooting around Clayton is very pleasing on the eye. Sure some of the inexperience of the editing and lighting departments exists, and the budget restrictions are now even more evident (check out the blood), but Grizzly actually does look rather nice. The extra disc is chock full of goodies, with the \"Jaws With Claws\" featurette enjoyable and showing the makers to be very tongue in cheek about the whole thing. So, a must for B movie creature feature fans who don't mind a bit of camp on their cheese sandwich then. Those looking for an \"Alien\" or \"Gorilla's In The Midst\" obviously need not apply, so lets mark it as 6.5/10 for the film, and 7/10 for Shriek Show's smart 2 disc DVD package.","user":"hitchcockthelegend","rank":[15,16]},{"title":"Jaws in the woods","rating":6,"date":"8 April 2004","review":"Rip-off of \"Jaws\". A giant grizzly bear is (inexplicably) attacking humans in a forest. It's up to Christopher George and friends to track him down.<br><br>I saw this in a theatre when I was 14 and never forgot it. At the time it (sort of) scared me. The bear itself I thought looked kind of cuddly--even when it was growling and showing its fangs. The attacks were (for a PG movie) pretty bloody and had me actually cringing in my seat! The show stoppers were when a little boy is attacked (we don't actually SEE it, but we do see half his leg torn off) and when, with a swipe of its claw, the grizzly decapitates a horse! Silly...but effective! Also there's some really beautiful scenery here (if you see it letterboxed) and a really great score.<br><br>So, this is a good gross-out movie for kids--there is a lot of blood but you don't take it seriously. As for the rest of it--the acting and characterizations are strictly by the numbers but I thought George and Andrew Prine were lots of fun. Also the dialogue is terrible and I got a good laugh out of the guy who doesn't want close the park despite the fact that people are being killed! Talk about ripping off \"Jaws\"! Good example of a 1970s exploitation film.","user":"preppy-3","rank":[14,15]},{"title":"Good watchable movie, unless of course you expected \"Streetcar named Desire\"","rating":7,"date":"16 October 2003","review":"Unjustifiably criticized as a \"Jaws\" rip-off at the time of it's release \"Grizzly\" is a really good \"Monster on the loose\" movie. The film is about a 18 foot grizzly bear terrorizing campers in a national park with Christopher George, the Park Ranger, Andrew Prine, the Helicopter Pilot, and Richard Jaeckel, the Naturalist, teaming up together to bring the \"Big Bad Bear's\" rampage to an end. \"Grizzly\" has a storyline and flaming ending very similar to \"Jaws\". <br><br>There's really nothing that bad about the movie to criticize. It was made as a B-type Monster/Horror film and no one expected it to win any Academy Awards. It makes you wonder why most of it's critics put it down? Was it its lack of originality artistry and imagination? <br><br>There's a series of killings in a national park where it's found out that a giant grizzly is responsible for them. The manager of the park wants it all kept quite since the news and publicity would hurt the parks revenue and his promotion to a post in Washington D.C. <br><br>The film follows the usual \"Monster on the loose\" movie plot. Just when it looks like that there's no stopping the indestructible bruin, after killing some dozen people including one of the leading stars of the film. The bear is even more then a match for an armed helicopter which he brings down with one swat of his paw.The hero park ranger later, after when all seems lost, finds an ingenious way of bringing the bear down and the park is then opened for camping and hiking without anymore fear or danger of the killer bear. <br><br>That's a brief synopsis of the story and that's what most, if not all, of the people who went to see the movie expected. The acting by the top stars in the film George, Prine and Jaeckel was much better then you would expect from a B-Monster/Horror movie. I don't think people going to see \"Grizzly\" expected to see \"Streetcar Named Desire\". The photography was breathtaking at times with the script and music score was more then adequate for a B-Movie. Most of all the killer bear was truly frightening. In short, going to see \"Grizzly\" you not only got what you paid for but a lot more then you expected. <br><br>Like I said in the beginning of the article about \"Grizzly\" that it's most vocal critics were those who accused it of ripping-off \"Jaws\". With the rare exception of movies like \"Pi\" and \"Momento\" how many movies can we say are truly original? There were a lot of movies with a \"Jaws\" storyline for the writers and director of \"Jaws\" to learn or, as the critics of \"Grizzly\" would say, rip-off from. <br><br>And one last word: The biggest ripper-offer from \"Jaws\" was none other then \"Jaws\" itself. With three sequels over ten years and each one worse then the previous one and the last, \"Jaws IV\", being so bad and unwatchable that it wasn't even released in the theaters.","user":"sol-kay","rank":[23,29]}]