[{"title":"\"It's not the house. It's something in the house!\"","rating":6,"date":"2 October 2010","review":"A daft, but entertainingly modest low-budget late 70s haunted house variation with horror comic lashings (intentional or not) in what becomes a traditional battle between good vs. evil. Nothing surprises, as no cliché is left untouched, but director Gus Trikonis' able execution is quite well done for what it is. Some creepy or outrageous moments and there's a solid cast led by the ever-reliable Richard Crenna, as he plays a psychologist along with his wife (a doctor) buy an abandon mansion (which does have something of a gloomy past) to hopefully restore to use as a clinic. So some friends and students of his go there to help fix it up, but unknowingly to them a devastating satanic force is unleashed and they find themselves trapped inside trying to survive.<br><br>The raw atmospheric make-up emit's a dominating presence, from the grand vast secluded mansion to the eerily placed music score, imaginative camera placement and cue in the cackling evil laughter of the evil entity. It constructs an ominously nightmarish strangle-hold, as it grows claustrophobic but at the same time the whirlwind becomes a random schlock-fest with its climax being the tip of it. It's not as unnerving as it could have been and the ending it feebly done. The story dynamics are old-hat (a stormy night) and it's slow to get going with some plodding opening dialogues, but soon that's made way for impulsively staged deaths / encounters --- consisting of spirit manifestations, possessions, fires, self-mutilation and bodies being thrown about. When these strange occurrences transpire, it's even mentioned for no one to go anywhere on their own, but do they listen of course not. The dedicated cast also features lively performances by Andrew Prine, Joanna Pettet, Cassie Yates and a memorable sequence with Victor Buono.","user":"lost-in-limbo","rank":[16,17]},{"title":"Bell bottom horror!!!","rating":28,"date":"28 March 1999","review":"\"The Evil\" is a fun 70's horror movie.  Low budget, cool location, some attractive and familiar cast members, the comforting presence of Richard Crenna, a fabulous troll-like Buono cameo...all add up to a demonic good time if you're in the mood for it.  And check out those slacks on Andrew Prine--are those Angel's Flight pants you're wearing??  (Anybody remember those disco-era items?)","user":"darkcrash","rank":[13,14]},{"title":"Pretty Good Movie","rating":9,"date":"5 February 2007","review":"I remember seeing this movie as a child, and how it scared me! Well one day I was lucky to find the VHS at a garage sale. Last night I finally put it on to a DVD, where it will never ever wear out.<br><br>I think Richard Crenna did a great job in this film. I think the film itself was a bit before its time with some of the special effects. The look cheesy compared to todays standards, but for a movie coming out of the 80's it is remarkable.<br><br>I am really surprised at how little information is out there about this movie, It is one of those small classics that got lost, and I am sure glad that I still have it!","user":"jrasche2003","rank":[9,10]}]