[{"title":"Great 1980s teenager movie.","rating":10,"date":"19 September 2007","review":"I was a nearly a kid when this movie appeared on TV and I had an opportunity to watch it again a month ago.<br><br>What else to say except that all people which lived in '80s will adore this movie because it will remind them on times when life was simpler,when all people around the world respected each other much more and when young people could do anything they wanted with their lives. Skateboards however, survived,and maybe good feeling of '80s will repeat again! However,for todays kids this movie will probably be \"lame\" or even funny,which will only show us what have we made of world for this 20 years.<br><br>Well,in waiting of new \"peace era of '80s\" watch this and enjoy \"Trashin\"!","user":"Marko10","rank":[27,34]},{"title":"Thrashin","rating":10,"date":"15 November 2007","review":"THRASHIN' is The Movie! Everything is right in this '80 classic. There are greater movies. More profound movies. Movies of greater artistic vision or originality or political significance. There are other titles I would put above it on my list of the best films of all time. But when it comes right down to the movies we treasure the most, when we arelet us imagineconfiding the secrets of our heart to someone we think we may be able to trust, the conversation sooner or later comes around to the same nine words: \"Well what do you thrash?\" \"What do you got!\" Life shod be like Thrashin': not to complicated,with good friends,not so bad enemies,sweet girlfriend and YES a happy ending !!! My candidate for the best Hollywood '80. movie.Good race!!!","user":"GodLovesMoviesToo","rank":[11,13]},{"title":"Better than Gleaming the Cube!","rating":8,"date":"1 September 2005","review":"I think the previous comment was crazy.<br><br>Gleaming the cube is a horrible skate movie.<br><br>I know the screenplay of Thrashin wasn't any good but it was truer to skateboarding than Gleaming the Cube where a dude makes a skateboard out of steel plate! Thrashin had a ton of real skaters in it, they have the performance in the skateboarding night club by the Red Hot Chili Peppers, and lots of other cool tidbits.<br><br>The Daggers were obviously made up of Alva team skaters as one of Tony's classic designs was the Alva Dagger.<br><br>I know Thrashin isn't an Oscar nominee but I give them a lot more credit than Gleaming the Cube. Thrashin tried to be truer to their skateboarding roots. Gleaming was just a way to GLEEN money from the movie goers pockets.<br><br>As far as comparing it to Powell &amp; Peralta Bone's Brigade movies... those were skate videos and featured primarily skateboarding sequences. There weren't a lot of story lines or acting. Even The Search for Animal Chin only has a limited amount of story and is entirely focused on the skateboarding.","user":"fittsy","rank":[21,28]}]