[{"title":"I don't even know where to begin.","rating":1,"date":"25 July 2001","review":"I am going to start out by admitting that even though I think the original Teen Wolf is a pretty stupid movie, I actually like it quite a bit.  I don't know what it is about it that I like, but for the last couple of months I've found myself watching my copy of Teen Wolf about once a week.<br><br>I decided to purchase (you gotta OWN these titles, that's the fun of it.) a copy of Teen Wolf Too on eBay for $4.  The only other time I had seen this movie was when I was in 4th grade, which was over a decade ago.  I didn't remember much about it, save a couple of moments involving Chubby.<br><br>I just finished watching the movie for the first time in 11 years, and I can say with complete certainty that this is one of the worst movies I've seen in a LONG time.  In many ways, this is the *perfect* bad sequel...  The first film wasn't especially good or commercially successful, so it seems pointless to have even considered making another chapter in the Teen Wolf saga.  They also weren't able to get the big star of the first movie (Michael J. Fox) to come back, so they instead focused on his cousin, whose personality is almost exactly the same.  Even further, they decided to bring back a few of the characters from the first movie, only two of which are played by the same actors.  Stiles, who was corny but funny in Teen Wolf, has been replaced by an actor who isn't nearly as convincing or amusing. Coach Finstock, who was the only genuinely funny character in the first film, is now played by a man whose line delivery made me laugh exactly zero times throughout the course of the film.<br><br>These discrepancies aside, the plot of this film is crap.  It's basically exactly the same as the original, only even more sketchy.  Anyone who hasn't seen Teen Wolf will probably not be able to make sense of the plot, not that any of them would actually watch this ridiculous film in its entirety.<br><br>I could probably write a fairly long essay on the problems with this movie, but I'm limited to 1000 words here.  I would comment more on the many specific elements that make this movie stupid, but I don't want to waste more of anyone's time.  And since I'm trying to keep you from wasting your time, then I will recommend that you do not watch this movie.  Ever. Anyone who says that this movie is not that bad is wrong.","user":"ZacharyALL","rank":[27,30]},{"title":"Sweet Merciful God Why?","rating":24,"date":"24 February 2004","review":"After a lifetime of watching movies and searching for the greatest moment in cinematic history, I've finally found it.  Is it Orson Welles' breathless death-rattle of `. . . rosebud.' In Citizen Kane?  No.  How about Al Pacino giving Fredo the kiss of death in Godfather II?  Try again.  What about Peter Finch screaming into the Network camera `I'm mad as hell, and I'm not gonna take it ANYMORE!' . . . not even close.<br><br>Are you ready?  Here it is:  the greatest moment in contemporary motion picture history is . . . in Teen Wolf Too when Jason Bateman (as the Wolf) runs across the park, leaps through the air in slow motion, and comes down with a Frisbee in his mouth-all without losing that stupid hat he had on!<br><br>Oh, but this film is peppered with other fantastic gems.  Like the part where the Wolf and Chubby where cruising around in the University Corvette (what, your school didn't have one?) and they almost ran that guy on the bike over and the Wolf just kept laughing and laughing--good times; or what about when Chubby was in the ring and he bounced the smaller guy into the ropes, put his hand on his hip, twirled his fist and knocked the kid out; ew! ew! ew!  I know!  What about when the Wolf was singing `Do You Love Me!' Remember?  When he had that little suit on and he was strutting his choreographed stuff with the team of wannabe Solid Gold Dancers?  Box office dynamite!<br><br>I don't remember a huge portion of this film, because the part of my brain that controls my higher cognitive functions shut down somewhere between the part where Chubby farts and Stiles sits in the smell and the part where the science teacher walks away from Gomez Addams with a tail wagging from under her skirt.  Just thinking about it makes my lobes tingle and go numb.<br><br>If there was one thing worse than the moron who played Stiles in Teen Wolf, it has got to be the guy that played Stiles in Teen Wolf Too.  Oh my God that guy was horrible.  The only highlight of this movie was when Stiles gets punched-out in between rounds of the big climactic fight scene-I like it because I've convinced myself that it was an outtake and he REALLY got hit.  Take THAT Stuart Fratkin!  What was he thinking?  `Yeah, I landed a SWEET gig on Teen Wolf Too-I'm STILES!  Just the springboard my career needs!'  Yeah, look out DeNiro, here comes Stuart Fratkin.<br><br>My buddy Marc brought this movie over to my house and I'm not sure what to think.  This is the same friend that exposed me to Pumpkinhead 2.  The only thing I can figure is that he is one of many alien infiltrators sent to Earth to use bad movies to brainwash people into a zombie-like trance, making way for an alien take over.  To those in a similar circumstance, I say RESIST!  You're not taking my soul with Teen Wolf Too, Marc!  I'm on to you fella!","user":"bordentownfilms","rank":[49,61]},{"title":"Ouch","rating":2,"date":"16 August 2005","review":"It's a sad truth that there are a lot of bad werewolf movies out there. But there are a few that really stand out as being among the worst of the worst ... and \"Teen Wolf Too\" is undoubtedly one of them.<br><br>It follows pretty much the same plot as the first movie, which was itself a recycled formula. Todd Howard (cousin of Scott from the first movie), a hard-working science student, arrives in college wanting to work towards becoming a vet. But there's one snag -- he's there under a sports scholarship, and unless he performs well in the boxing tournament his place in the college is at stake. Thankfully, he finds himself succumbing to his cousin's lycanthropic curse and becomes a popular and agile werewolf. But in the process he, of course, forgets who his real friends are.<br><br>There are numerous recurring characters from the first movie, some of whom have inexplicably moved to this college. There are Scott's high school chums, Chubby and Stiles -- Stiles is this time played by Stuart Fratkin, who also appeared in an episode of the TV show \"Werewolf\" the same year (\"A Material Girl\"). Scott's dad also makes a few appearances, as well as the Scott's coach, who is also played by a different actor this time. But of course, none of this matters ... without Michael J Fox, this movie was pretty much doomed from the start. He was pretty much the only thing that saved \"Teen Wolf\" from being a flop.<br><br>The dialogue is unbearable, the directing is clumsy, and the acting in places is downright appalling. Since this is basically a remake of the first movie, there's absolutely no reason to watch it. Just watch the original, and forget about this one altogether. There's hardly anything good to say about it at all. And believe it or not, it still made money. In fact it's very surprising that we didn't see a \"Teen Wolf Three\" the next year. Thank heavens for small blessings ...","user":"Teknofobe70","rank":[20,23]}]