[{"title":"Barbara Harris is da bomb","rating":10,"date":"20 February 2006","review":"While the remake with Curtis and Lohan was good and Hollywood smooth with better production values (so what), the main difference is in the lead actors. I mean you know Jodie Foster can act circles around Lindsay Lohan (who couldn't) but the main difference is in the moms. Jaime Lee Curtis is a savvy pro who has her own take on the role but it's pretty flat in comparison. Barbara Harris I didn't remember from her small roles in Dirty Rotten Scoundrels and Peggy Sue Got Married but now that my memory has been jogged, she did a fine job. This movie, though, is her tour-de-force. What a fantastic performance. She is flawless and incredibly funny in this role. As fine a comedic turn as anyone has ever done; the nuances of voice, the facial expressions, the slapstick - all spot on.<br><br>Jodie Foster is no slouch either. Her teenage roles have showed maturity beyond her years and a thorough understanding of her roles. She shines in this one. The supporting cast is well chosen and they're all good too.<br><br>I can see why they remade it, though. Todays kids don't usually get into old movies so with a box office cinch like Lohan, why not? I like a lot of the 60's and 70's movies since that is my generation and subsequently have trouble enjoying the 30's and 40's movies. But a good movie is a good movie no matter when it was made.","user":"topcat-1","rank":[24,28]},{"title":"A Very Funny Disney Movie","rating":7,"date":"11 June 2012","review":"The teenager Annabel (Jodie Foster) has friction with her mother Mrs. Andrews (Barbara Harris) and her younger brother Ben. One Friday morning, the both wish to be the other for one day at the same time and their wishes come true and they swap bodies. Meanwhile, Mr. Andrews (John Astin), who is the PR of a company, is preparing a party to promote a real estate, and he counts on the support of his wife and daughter. Along the day, Annabel and Mrs. Andrews learn the problems of each other and understand the difficulties of the other. <br><br>The original \"Freaky Friday\" is a very funny Disney movie even thirty-six years after its release. Barbara Harris steals the film and together with the teenager Jodie Foster, they are responsible for hilarious situations. My vote is seven.<br><br>Title (Brazil): \"Se Eu Fosse a Minha Mãe\" (\"If I Were My Mother\")","user":"claudio_carvalho","rank":[10,11]},{"title":"very funny movie","rating":25,"date":"25 March 2006","review":"This movie, unlike the two so called remakes actually follows the book. My kids have all loved this movie and had no trouble at all relating to the incidents.Sure they have typing class instead of computer class but so what? So what if the Mom stays home and the Dad works. Many families do that today. The brother appears to be in half day kindergarten because he is picked up from school before lunch. Maybe Mom will go back to work next year. It may be a bit dated but that doesn't detract from the movie at all. <br><br>Unlike many modern movies the kids are not smart mouthed brats who get away with such behavior. There are no gross jokes or rude, stupid humor. <br><br>This is a fun movie for families, especially mothers and daughters to watch together. I would recommend this over the other two because it's how the author intended the story.","user":"laurajaykay","rank":[18,22]}]