[{"title":"Favored over the remake","rating":29,"date":"29 September 2003","review":"The large number of reviews tossing this in the trash bin as an overwrought 1960s period piece, or inferior when compared to the Pierce Brosnan/Rene Russo remake caused me to find the DVD and take another look.<br><br>\nThe problem with the 1967 film is that, unlike most films made today (including the remake), viewers need to think and connect the dots; and, there isn't always a \"right\" ending with all details neat and tidy. This is still a classic of the caper films, with McQueen giving the definitive performance of his absolute-cool image, and Dunaway as the Joan Crawford of the Virginia Slims generation.<br><br>The then-innovative parts of the film, including the multiple split screens and the repetition of the theme song with Noel Harrison look dated (and the split-screen is only effective on the big, big screens of the 1960s-era theaters), but the chess game is still the most-seductive bit of film where all the clothes stay on and nobody talks.<br><br>Listening to director Norman Jewison's commentary on the DVD is enlightening. The split screens were indeed a timely gimmick (Jewison and the producer saw the technique at Expo '67 in Montreal), and his explanation of the last scene in the cemetery gives a good insight as to how he aimed the film in general.","user":"eschwartzkopf","rank":[101,114]},{"title":"Tense, stylish, serious","rating":10,"date":"12 December 1999","review":"This is a film about games: the defining image, a game of chess; and then, as well, the intellectual game that robbery provides for Crown (McQueen), and the two games, professional and sexual, in which Vicki and Crown stalk each other.  For these players, games are very serious and the outcome of each uncertain.<br><br>The film is of its time, but works in ours, as well and better than the recent remake.  Those looking for a fast action \"heist\" movie will be disappointed: this film is about alienation and attraction, trust and betrayal, about working out what matters - all those eternal themes.  It will appeal to those content to focus on personal chemistry unpunctuated by regular gunfire.  None the less, the planning and execution of the bank robbery is cleverly done and provides sufficient impetus to drive the rest of the straightforward plot.  Crown's motivations, tedium and greed, are readily understandable; Vicki's are similar.  As people they are similar and evenly matched.  Vicki is stylish and beautiful and, using her sexuality as well as her intellect, she is Crown's equal or better - which is not true of the remake.  In the end, it is she who defines the outcome, but what it will be and why Vicki makes the choice she does are left unresolved.  So, too, we remain uncertain whether the possibility truly exists, that their alienation might be healed.<br><br>The focus is clearly on the couple.  Eddy Malone's role as the police detective does not extend beyond that of a Greek chorus, providing the conventional and moral reference against which the actions of the principals are to be judged.  Jack Weston's Erwin, a very worried getaway driver, simply contrasts the player of the game, Crown, with the instruments with which he plays it.<br><br>The performances of the entire cast are exemplary.  McQueen's clipped manner builds the tension and intensifies the effect of his weakening to Vicki's seductive moves during the chess game.  The role of Vicki is perfect for Dunaway, making no great demands on her to project herself, no extended dialogue, which she does not generally manage well; but the disposition of her body, her power of gesture, and her brief, pithy statements all work brilliantly.  Jack Weston produces an excellent cameo performance that pretty well had me perspiring as much as he was.  Malone plays a straight role straight, the way it should be.<br><br>The split screen title sequence and passages in the film work well; they do not distract, as this technique can, but are used to capture and compress moments of action that are significant but do not require extended treatment.  The Legrand soundtrack is brilliantly effective, including the long passages of real tension, without music.<br><br>This really is a great classic, a film that will endure, and those who have difficulty with it should see it again and allow themselves the time to be seduced by its low key perfection.","user":"snaunton","rank":[93,111]},{"title":"Unforgettable 60's cool","rating":10,"date":"2 July 2005","review":"This movie is for fans of the 60s era not just 60's movies. It is a vehicle for displaying McQueen's cool and Dunaway's style. Made and set in an age when only the hippest were members of the jet set. Besides the two stars, look for solid performances from a very young Yaphet Kotto and the always disgusting Jack Weston.<br><br>The film itself is well crafted, beautifully photographed and brilliantly directed, it also has a great score. Jewison makes use of the split screen effect, several places in the film. While not only visually interesting, it also captures something of the essence of the era. Few people today will realise the significance of the split screen effect, as they don't remember Montreal's Expo/67.<br><br>While essentially a cool heist flic, and one of the first, this film is much more. It is a subtle study of human behaviour and the basic characteristics of man and woman. McQueen is the bored rich playboy and Dunaway is the cool, yet seductive private eye, who is not above using her feminine charms to solve a case. From time to time, the film hints at Crown's inner crisis, he is constantly in need of distraction, to prevent himself from dwelling on the fact that his life is essentially empty and meaningless.<br><br>Throughout the film, McQueen and Dunaway play a cat and mouse game, both on the professional level and also on the sexual level. The sexual tension during the chess game for example is so palpable, you can't help but be drawn in, dwelling on every stroke of Dunaway's fingers and every twitch on McQueen's face.<br><br>Unlike the modern remake, which is vapid by comparison, this film forces the viewer to pay attention, or risk missing the whole point. The pace of the original is much slower than the remake, and so might not appeal to those raised on video games.<br><br>The ending of this film gives us some real insight into the true nature of the relationships between men and women.<br><br>Overall, this film is a modern masterpiece.","user":"UGLYBOB57","rank":[120,148]}]