[{"title":"Alive and richly done, with some great performances!","rating":8,"date":"9 October 2010","review":"Invasion of the Body Snatcher (1978)<br><br>The original 1950s version of this movie is such a favorite of mine, I hesitated to watch this one. But fear not. This is great, too. It's got the same theme, but very richly and creatively rendered, some superb photography, great night stuff, and most importantly, great acting by the key 3 or 4 people.<br><br>Director Philip Kaufman works sporadically as director and writer (he hit it big with \"Raiders of the Lost Ark\") and he clearly has a unique and somewhat fearless vision that remains rooted in Hollywood sensibilities. That is, this is no independent film, yet it's creative.<br><br>And it's scary. Between the development of fear over the actual biological invasion, and the old fashioned chase and hide sequences, this is a tense movie. But yet it's convincing, given the realistic, nuanced acting by the main couple, Donald Sutherland (as a Health Department official) and Brooke Adams (as a lab analyst in the same department). Of course, what happens isn't believable at all, somehow, but it's so close to feasible, and in fact so close to what we live with already (some people without feelings, out for themselves, part of a conspiracy, etc.), it isn't hard to pull it off.<br><br>Cinematographer Michael Chapman is about as good as it gets in the Hollywood vein, polished and with amazing, varied lighting (he also did \"Raging Bull,\" \"The Fugitive,\" and \"Taxi Driver,\" for starters). So this movie works on every level. The one thing it isn't, of course, is original, but as a remake, we have to take it for how it handles it, 1970s style. Impressive.","user":"secondtake","rank":[38,44]},{"title":"Filmed nightmare","rating":7,"date":"7 April 2000","review":"I first saw this film in a movie theater at midnight, as part of an October horror-movie festival.  I almost didn't go; I had always had this movie figured as another stupid Hollywood remake of a great film from the past, and thought they were probably only showing it instead of the original because of that weird, vague prejudice against black and white movies that still for some reason permeates this country, even though the novelty of color wore off about forty years ago.  But I figured what the hell, it wouldn't hurt to check it out, and when will I get a chance to see any of these movies in a theater again?  So I went, and was almost immediately sucked in by the mind-bending direction and the terrific acting.  But not only that; it was after midnight, remember, and I was getting sleepy, and I found myself in that kind of hypnotized, pseudo-dreaming state you can get into when you're watching a movie really late at night.  I was really into the movie, mind you, but it was like a dream, I wasn't wholly conscious. And just as I was at my most out-of-it, as I was almost technically asleep, the movie hit me with that last shot, you know the one I mean, and jolted me wide awake like a bucket of ice water.  It was just like waking up from a nightmare.   I thought I was gonna start crying.  I haven't been that freaked out by a movie since I was a little kid.  As the end credits rolled and the house lights came up, I heard some other people in the theater talking about what a stupid movie it was, man, was that a waste of money, I'm glad it was only three-fifty, and it was a really surreal moment; I've just had one of the most horrifying moments of my waking life, and they're talking about how silly it was (although, truthfully, they may have been a little shaken up themselves and just covering for it, I dunno).  A week or so later I was talking about it with my dad, who had seen it when it came out, and I mentioned the ending, and he did a dead-on mimic of the last shot, and I said \"God!  Don't do that!\"  I was STILL shaken up by this movie.<br><br>There aren't a lot of movies that even try to be frightening--most horror movies (and novels and so on) actually have other concerns:  being funny, or shocking, or gory, or surprising, or bizarre, or whatever--and even fewer actually pull it off, actually scare you.  Man, does this one pull it off.","user":"Mr. Book.","rank":[55,68]},{"title":"Excellent remake of the 1950s paranoid classic. ALMOST as good as the original.","rating":25,"date":"25 April 2003","review":"The original 'Invasion Of The Body Snatchers' is one of my favourite thrillers of all time, and a very hard movie to top. I'm always sceptical about remakes of classic horror and SF films, but this version by Philip Kaufman is much better than one would expect, and ALMOST as good as the original. I still think Don Siegel's version is the best because it really evokes small town life in middle America, and that makes the horror and suspense all the more effective. Kaufman transplants the setting to San Francisco and the big city location means it loses its sense of intimacy and community, and instead has more of an alienated urban feel to it. But it's still an excellent movie, and along with Cronenberg's 'The Fly' and Carpenter's 'The Thing' the most successful remake of a 1950s horror classic to date. What really helps this movie is the cast. Donald Sutherland, one of the 1970s most interesting and intelligent actors, is excellent in the main role, played by Kevin McCarthy in the first film. And the lovely Brooke Adams ('Days Of Heaven', 'The Dead Zone', 'The Unborn') is first rate as the main female lead, her role being much more substantial than Dan Wynter's in the original. I've had a major crush on Adams ever since I first saw this movie. She is beautiful but goofy and I really thought she was going to be a major star. The supporting cast is excellent, led by the wonderful Jeff Goldblum and 'Alien's Veronica Cartwright, and of course Leonard Nimoy, in his most memorable non-Trek role. Also keep an eye out for cameos by the star and director of the original version (Kevin McCarthy and Don 'Dirty Harry' Siegel), and a very brief but eerie one by Robert Duvall! 'Invasion Of The Body Snatchers' is a superb example of how to remake a horror classic, and is one of the creepiest and most nerve-wracking thrillers of the 1970s. I highly recommend it and the original 'Body Snatchers', they are two of the scariest movies ever made!","user":"Infofreak","rank":[58,74]}]