[{"title":"Perfect Movie-making","rating":10,"date":"28 February 2005","review":"An undisputed classic that chronicles every appalling moment of a drunken night in hell as middle-aged George and Martha tear each other, and their guest, to pieces.<br><br>Elizabeth Taylor proves categorically that she was a truly great actress. Her Oscar-winning performance as the psychologically tormented Martha is one of the greatest performances in the history of cinema. Taylor's imperceptible shifting from sadism to tenderness, from bullying condescension to exhausted vulnerability, is a masterclass in character building. Martha is a truly monstrous character, and yet Taylor is able to imbue her with sympathy, allowing you brief glimpses of the warm and lovable woman she could have been.<br><br>Richard Burton is equally magnificent as George; an ageing, failing college professor whose initial meekness gives way to a raging torment all of his own. His verbal sparring with Taylor, like two pit-bulls in the ring of an endless and bloody dogfight, has become legendary. Every word drips with malice and contempt, every sentence is designed to cut the deepest wound. At times, it becomes painful to watch, but like true train-wreck television, you cannot drag yourself away from the inevitably terrible conclusion.<br><br>Quite possibly, this is as close to perfect as movies can get; beautifully written dialogue, deeply complex characters, an evolving and suspenseful storyline, beautiful photography, and a wonderfully understated score by Alex North. Nominated for 13 Academy Awards in 1967, but lost out to A Man for All Seasons and Born Free to win only 5.<br><br>\"Who's Afraid of Virginia Woolf?\" \"I am.\"","user":"Rathko","rank":[150,186]},{"title":"Still powerful, harrowing view of the \"Anti-Ozzie and Harriet\"","rating":3,"date":"3 July 2000","review":"This is still an exceptional film from the 1960s. Though some of the epithets are obviously softening much stronger words, the language is frank and brutal, Martha's bludgeoning body-blows balanced by George's icepick thrusts. Edward Lehman's respectful screenplay gently opens up Edward Albee's one-set play while keeping a certain claustrophobic atmosphere. Mike Nichols' first directing effort is stunning in its lack of artifice; rarely do you feel that the director has done much more than turn on the camera and watch four actors, all at the top of their game, tear into their roles. George Segal's work in this movie is criminally underrated, but his reactive work as studly, ultimately disappointing Nick should be mandatory study by all young actors. Sandy Dennis' fluttery turn as mousy, wifey Honey is powerful also; a lot more is going on than you might think. Richard Burton is staggering as George (\"Georgie Porgie Put-upon Pie\"), and his performance demonstrates the magic that he could bring to a worthy role. Elizabeth Taylor's work here still astounds. The physical transformation she undertook to become aging harpy Martha is amazing enough, but her performance seems to channel a hurricane's force and fury. By turns hilarious, maddening and then, at the end, exhausted and defeated yet again, Taylor demonstrates acting, particularly film acting, at its best. The film is by no means easy or \"Hollywood\" in feel-- the audience is as exhausted as the characters at the end. But this was a bracing, necessary antidote to the impossible ideal of marriage usually portrayed in the movies. A towering film.","user":"rwalker-2","rank":[99,124]},{"title":"Distilled Human Viciousness","rating":10,"date":"4 June 2007","review":"Ailing couple George (Burton) and Martha (Taylor) invite a young couple over for a late-night drink - much to quiet and repressed George's annoyance - and what starts off as a twisted game by sultry Martha to annoy her husband and get her way with young stud Nick (George Segal) ends up in a horrific duel of wits.<br><br>Adapted from the play and boasting very few locations, \"Virginia Woolf\" is notable for many unsuspected reasons. Designed for the stage, the film makes the story uniquely cinematic and tense, amped up by stunning photography (in Black and White, a daring choice in 1966). The younger leads are superb, but Burton and Taylor still manage to walk away with film, giving stunning renditions of the world's most demented couple. They make the surreal dialogue hurt and touch in ways never thought possible.<br><br>Though there are countless reasons to recommend this jewel of a film, there are also reasons why one would wish to avoid it. This is the kind of film that makes you feel like having a showing (or a very concentrated drink) to wash away the grit and human evil and pain absorbed. You'll feel dirty, but in a way you'll also feel enlightened: that a small character film can carry more punch than any explosion-packed blockbuster out there is a thing of beauty indeed!","user":"OttoVonB","rank":[65,80]}]