[{"title":"Andrew V. McLaglen's Best Directed Western","rating":8,"date":"8 March 2006","review":"Andrew V. McLaglen (\"McLintock!\" \"The Way West,\" \"Shenandoah\") outdoes himself with a slight of a story, \"One More Train to Rob\". Clearly George Peppard's funniest and, perhaps, best performance as the \"good, bad guy train robber\" cheated by his friend, John Vernon (also a fine performance) out of his share and out of his woman, Diana Muldaur. Muldaur, as always, combines beauty, brains and class. However, here, she even manages to be funny and sexy. She and Peppard have great chemistry. The movie has some surprising twists and turns, and even a social conscience. The plight of immigrant Chinese during the 19th Century and the racial injustices shown them deliver a surprisingly effective subplot. \"One More Train to Rob\" is one of my favorite westerns, and I'm so happy it is finally showing on ENCORE WESTERN Channel. I give it an \"8\".","user":"Bob-45","rank":[16,18]},{"title":"Engaging lightweight Western","rating":7,"date":"3 November 2007","review":"The plot of this movie may seem familiar to Western devotees and so it should because it is essentially the same as that deployed by Brando in his sole directorial credit One Eyed Jacks ,namely an ex jailbird bent on revenge on a former associate ,now a man of wealth and substance ,who he feels has double crossed him .Where the movies part company is that Brando used the plot as the vehicle for a grim almost Jacobean revenge tragedy ,this movie takes a lighter ,friskier tone Peppard plays the wronged man ,one Harker Fleet ,who seeks to get back at his former associate in crime ,Timothy Nolan -well played by John Vernon.They are rivals for the favours of Diane Muldaur and also vie with each other in striving to rob an elderly Chinese man of his gold Andrew V McLaglen -who along with Burt Kennedy was virtually the only man directing Westerns on a regular basis in the USA during the seventies-keeps things moving briskly and the action is vigorous and well paced .Good performances and a tongue in cheek script help maintain interest and the result is a diverting second tier Western that many people will enjoy","user":"lorenellroy","rank":[10,11]},{"title":"Wonderfully Underrated Western!!!","rating":10,"date":"19 October 2004","review":"It is astonishing to me that, in the world of the modern Western, no one studio has been willing to give this movie a release on home video or DVD. Astonishing, and disappointing, for it truly is a jewel, and features some fine action sequences and performances.<br><br>In the film, George Peppard plays Harker Fleet, a dashing blonde haired Cowboy who was apparently served a stint in prison while his former comrade Timothy Nolan (played by John Vernon) got away both with their last big score, along with his woman (played by Diana Muldaur). Upon his release, Harker is determined to even the score, and sets about his task by aiding a local Chinese commune that is being preyed upon by Nolan and his henchmen.<br><br>One fantastic action sequences has Harker slipping out to a barn, knocking out a handsome henchman, tying him up, and using the same rope to pull himself up so that he can listen in to a meeting between Nolan and his associates. Another has Harker knocking around Nolan's chief henchman Jim Gant at a party, while the Chinese infiltrate Nolan's compound and recover a prisoner who was being held for ransom.<br><br>This was what classic Westerns were all about- men dealing with the bad guys not only with their guns, but also with their brains, and at times, with their fists. It is this intermingling of Harker's brains, braun, and skill with a six-shooter that makes this a very worthwhile film.<br><br>Notwithstanding what I felt was a very sloppy and annoying performance by Diana Muldaur (in the film she seems so obnoxious and stodgy that you expect she was in part responsible for betraying Harker in the first place), this is a fantastic film, and I give it very high praise!","user":"andell","rank":[15,20]}]