[{"title":"A Dream","rating":10,"date":"23 December 2000","review":"This movie is like an odd, but wonderful dream.  It takes place in a fantasy world, created by the talented duo, Frank Oz and Jim Henson.  Everything in this film is so meticulously done, that it still lives on to this day. Computer effects be damned.  This film has texture, and it is pleasing to watch. This movie, as you will see, was made for kids.  But really, it is a masterpiece in film-making.  True, good, story-telling.  Sure, kids will love it, but the film isn't really aimed at them like most kid movies are. It is complicated, eerie, beautiful, and intelligent... most of all, mystical. I reccomend this to anyone seriously interested in film, especially fantasy... not to be missed!","user":"winstonsmith_84","rank":[138,156]},{"title":"Still a great fantasy tale","rating":10,"date":"27 April 2002","review":"The Dark Crystal holds well against the test of time.  It has been only recently that movies that take place in a completely different fantasy world (\"The Lord of the Rings: Fellowship of the Ring\") have become more feasible. Still, the Dark Crystal stands as an excellent tale of good versus evil.<br><br>Jim Henson and crew spent much to much time creating this movie, and the depth of their effort shows.  However, some adults might find the story simplistic, and it is in the same manner that Labyrinth is.  However, like Labyrinth, Dark Crystal succeeds in taking you to another place and immersing you in another world.<br><br>If you are a viewer interested in fantasy worlds, Dark Crystal will please you well.  If you haven't seen it in years, get the DVD.  It has a wonderful \"making of\" section, deleted funeral scenes, and isolated musical score.","user":"davidbeoulve","rank":[74,87]},{"title":"The beginning of the new and improved Muppets; one of Henson-and-company's best","rating":10,"date":"15 September 2000","review":"This sprawling, part-homage-part-totally original fantasy brings us Jen, the last of a group of near extinct creatures who is the only one who can save all existence by bringing a crystal shard back into the balance of the dark crystal, in order to save the world from the evil Skekses. This is quite an enthralling film, and like with the other full-on Muppet films this works on different levels for kids and for adults. Kids may be both scared and enthralled by the scope and details, not to mention the graphic nature of the darker elements portrayed (as a kid I cringed a bit when the 'vital essence' scenes came up). And for adults there's a lot of great craftsmanship that goes into the story, which is with all of the effects and over-the-top creations very well told by directors Henson and Oz. Without the massive usage of CGI or the more controlled visuals from the past fifteen or so years, the mix of the production design (maybe some of the best ever in any fantasy film) and the inventiveness put into the set-pieces and character-creations, is a knockout even by today's standards. It's almost a shame looking back on how a film like this that employs so many people and such time is now spent clicking away on a computer to get it all done. As it is, the Dark Crystal is one of those few examples in post-modern cinema that it does seem something like a sci-fi novel come to life.","user":"Quinoa1984","rank":[98,121]}]