[{"title":"Wonderful, accidentally powerful special","rating":10,"date":"19 November 2006","review":"It's almost Christmas, and the Peanuts gang is eagerly anticipating it well, except good ol' Charlie Brown, who just doesn't feel quite right about the festivities this year. Oh, he likes presents and sending cards (even though he never receives them, as indicated by the echo in his mailbox) and all, but Charlie Brown can't quite get into the spirit. It's most likely the crass commercialism that's tainted the holiday, from little sister Sally's epic letter to Santa to the pink aluminum Christmas trees for sale. In a rare show of generosity, crabby Lucy tries to lift Charlie Brown's spirits by letting him direct the school's annual Christmas play, but the rest of the kids are too self-absorbed to cooperate. It will take a pitiful little Christmas tree and some help from the ever introspective Linus to restore Charlie Brown's love of the holidays.<br><br>A staple of Christmas since 1965, \"A Charlie Brown Christmas\" was the first animated \"Peanuts\" special, and easily the best. The animation is crude yet has a sweet charm to it. In a rarity in animated films, real children with no acting experience voiced the entire cast of characters (excluding Snoopy). The result is jarringly realistic, since some of the kids are mush mouthed and stumble over words like \"syndicate\". It introduced the legendary \"Linus &amp; Lucy\" tune (which would become the \"Peanuts\" theme song), provided by Vince Guaraldi. Handpicked by Charles M. Schulz himself, Guraldi was responsible for the \"Peanuts\" specials' uniquely sophisticated sound. The music manages to bring to mind both images of childhood innocence and smoky jazz clubs. <br><br>But amidst all the familiar antics (Snoopy's shameless mugging, Linus's blanket, Charlie Brown's melancholy), there is something truly powerful at the heart of \"A Charlie Brown Christmas\". In our confusing, politically correct climate, \"A Charlie Brown Christmas\" teaches us the true meaning of Christmas; none of that bland, \"family and friends\" garbage, but the honest to God meaning of Christmas. Without being preachy, histrionic, or self-indulgent, we learn that Christmas isn't about presents, shopping, or trees, but about a baby born in a humble stable who would grow up to die for our sins. In 1965 that was simply common knowledge, but it is so easily forgotten in the harried, materialistic New Millennium. It is keeping this message in mind that Charlie Brown and the rest of the Peanuts gang learn that Christmas should unite us, and spread the feeling of love and acceptance into a harsh world. <br><br>So for those of you who feel the way Charlie Brown felt in the beginning about Christmas, watch this special with a loved one. It is almost magic, the way it will restore your faith","user":"lauraeileen894","rank":[34,36]},{"title":"We still love you, Charlie Brown!","rating":9,"date":"20 December 2003","review":"I remember the first time that I saw this cartoon.  I was about 6 or 7 years old, and I was starting to get into the Peanuts comic strips as I was learning how to read.  From the first time I saw it, I knew there was something very different about this animated Christmas special that set it apart from others.  Maybe it was the fact that it actually gave the true meaning of Christmas by having Linus quote Luke 2:8-14.  Maybe it was able to capture charm and whit of the Peanuts comic strip by Charles Schulz. Maybe it was the jazzy background music by Vince Guaraldi.  Maybe it was all the above.  I'm gonna go with the last one.  To this day I still find this Christmas special to be a very touching one.","user":"jweatherford27","rank":[48,52]},{"title":"Completely Irresistible","rating":10,"date":"7 December 2004","review":"How can you not love it? I'm a 46-year-old Jewish agnostic, and this still makes me laugh and brings a tear to my eye after dozens of viewings; and I don't think it's just nostalgia. I think if you can't enjoy this, you might as well just pack it in. Christmas wouldn't be Christmas without this and the ORIGINAL Grinch. Too bad the follow-ups, with the exception of course of It's the Great Pumpkin Charlie Brown, have never matched its humor, charm and heart. Favorite funny line? Lucy complains about always getting toys and bikes and clothes. \"What do you want?\" Charlie Brown asks. \"REAL ESTATE!\" Favorite touching moment? The transformation of the scrawny tree into a beautiful one of course.","user":"stevecliff","rank":[56,63]}]