[{"title":"Yellow beard is worth a look.","rating":7,"date":"26 February 2006","review":"I watched this as a kid and it made an impression on me. So much so that I just had to watch it again last week. I was not as disappointed as I was with other movie repeats from my childhood(Popeye comes to mind). Sure things were a bit sketchy and straight up silly at times but it was a fun movie. And of course if you are a Cheech and Chong fan they have a small part too.It ranks up there in the top of my favorite swashbuckling pirate flicks (behind Pirates of the Caribbean) I think it is a classic. \"Stagger, Stagger, Crawl,Crawl\" will be forever ingrained in the movie quote cache of my brain!(right up there with \"Charlie don't surf!\")","user":"ccluff1974","rank":[19,21]},{"title":"Must see (in my opinion)","rating":27,"date":"27 February 2004","review":"You may not agree with me, but I absolutely loved this movie. How often can you see this many stars in a movie involving royalty being raped? When you put together Monty Python members (who are excellent), many American comedians, pansies with maps on their scalps, a dirty prisoner who likes jail better than his ex,  David Bowie as a human torture shark (with a 10 second cameo), Cheech and Chong, the father from Everybody Loves Raymond (and countless other CBS comedies), and many other amazing roles. I'm very sad to see that the only place you can get a hold of this tape except for waiting for 5 years for a request at Blockbuster (Yes, I requested it in 1995 and didn't receive the tape until 2002) or off of Amazon/E-Bay used (for no less than $35). Bascially, you can't beat Monty Python meets Cheech and Chong comedy.","user":"KeepinThe600sAlive","rank":[20,23]},{"title":"A nonsense pirate adventure!","rating":6,"date":"20 March 2008","review":"I'm a big fan of Monty Python, and as soon as I heard about this little known movie I wanted to check it out. It turns out that it was pretty entertaining! Although it's not nearly on the same level of genius as other MP movies, there are a lot of little funny details throughout the movie. <br><br>The thin plot revolves around everyone trying to get their hands on Yellowbeard's legendary treasure. Gags ensue. Oddly enough, it works. Graham Chapman is hilarious in his role as a blood-thirsty pirate and so is Eric Idle... But the true star of this film is Marty Feldman (Igor from Young Frankenstein). His character is similar to Igor's, but he steals every scene he's in. There's also a really funny cameo with David Bowie.<br><br>I certainly do not agree with John Cleese that this was the worst movie he's ever been in. He's been in a lot of movies much worse than this one, and actually, his character here is pretty interesting and even funny.<br><br>The plot is more or less of a Pirates of The Caribbean meets Monty Python, and it was interesting enough to keep me watching. I thought this was better than Jabberwocky and (although it is much sillier) it also reminded me a bit of Erik The Viking.<br><br>Cheech &amp; Chong are here and they are disappointing as Spaniards. Chong has a incredibly annoying lisp and his accent just doesn't work, let's say, as opposed to Michael Palin's hilarious performance in 'Life of Brian'. Cheech has an easier time since he's Hispanic, but their roles are simply unfunny, like much of their regular work. That's probably because wasn't any hemp in this movie (aside from the ones on Yellowbeard's hair!) Maybe they should have played stoned pirates or something like that.<br><br>I was really surprised that this movie didn't suck. Sure, it's not a work of art or a must-have for Monty Python / Cheech &amp; Chong fans. But chances are, if you're just expecting to have some mindless fun, this movie will do the trick. Just turn off your brain and enjoy. 6/10","user":"pmdawn","rank":[12,13]}]