[{"title":"Beast kicks ass!","rating":28,"date":"28 July 2003","review":"Just watched this movie a couple of hours ago! Sure, I loved The Hills Have Eyes, and I had heard how horrible this one was, but I bought it anyway for $3. And it's not THAT bad! Really! If you don't keep saying \"Gee, this movie is crap compared to the original\", I mean, it's not a great movie, but it's not unwatchable. Some things are pretty annoying and/or stupid... like...<br><br>*When the girl finally admits to being the ex-cannibal sister Ruby, and that it was Bobby's family that was in the incident, THEY DON'T CARE! GEE, I was hoping they would at least react! P***ED ME OFF! That ruined some of the movie for me... The characters just don'tttt care.<br><br>*The characters, most of them, P*** ME OFF also. All they do is walk around saying \"Yeahhh right, there's nothing to worry about, hahaha\". The 'there's nothing to worry about' attitude Gets old.<br><br>*Hardly anyone finds out when someone has been killed. That's part of the fun of horror movies, for the people to find out someones dead, go tell the others, and freak out!<br><br>*The ending was ridiculus. So, the guy came up with that ingenius plot? Wow... he must be next in line for the Pulitzer! Brilliant.<br><br>But, it is just a movie.... Keep telling yourself that....<br><br>That's about it, now, with all that said, there dosent seem to be any good things about it... Annoying... Sometimes stupid, but never really boring... Not the worst choice for a boring day. Plus, there's not as many flashbacks as some people would lead you to believe...<br><br>5/10","user":"Fire-WalkWithMe","rank":[6,6]},{"title":"It's unoriginal and sometimes cheesy, but it's still fun!","rating":7,"date":"17 April 2006","review":"THE HILLS HAVE EYES PART II (1985)<br><br>directed by: Wes Craven<br><br>starring: Tamara Stafford, Kevin Blair, Janus Blythe, and Michael Berryman<br><br>plot: Bobby (Robert Houston) and Ruby (Janus Blythe), now civilized and under the alias Rachel, run a motorcycle racing team and are preparing for a race in the desert. Bobby chickens out, leaving Ruby in charge. On the way, the group gets lost and must take a shortcut close to where the original horrors took place. They decide to stay for the night, which is a bad idea, because Ruby's brother Pluto (Michael Berryman) and uncle Reaper (John Bloom) roam the area, picking off the friends one by one. Soon, only a few survivors are left - including blind Cass (Tamara Stafford) and Ruby, and they must try to stay alive.<br><br>my thoughts: I've heard so many bad reviews about this film. I heard it was the worst sequel ever, and that it was mostly just a bunch of flashbacks from the original.<br><br>I finally got my hands on it and watched it with an open mind. I was not disappointed at all.<br><br>The flashbacks are only within the first 20 minutes. Bobby flashes back to his and Brenda's final battle with Jupiter, Ruby flashes back to helping Doug fight Mars and save the baby, and even the dog (Beast) flashes back to when he attacked the crap out of Pluto. Once the action begins, the flashbacks end. And the dog flash back did not bother me at all, I found it very cute.<br><br>The characters are your usual 80's teens. Some are annoying, but I did like a few - Cass (Tamara Stafford), Roy (Kevin Blair), and Hulk (John Laughlin) were very sympathetic. The others were either annoying or not interesting at all. The return of Ruby and Bobby was also a good idea. I loved watching Ruby seek redemption by saving the others, and Bobby has a small but smart part. It's nice to actually see a character that is smart and stays behind.<br><br>Michael Berryman returning as Pluto had it's pros and cons. I loved seeing his conflict with the dog Beast, but I also hated how in the original he was very menacing and creepy, here he is comic relief. At least The Reaper (John Bloom) was a big, strong, savage villain who didn't talk too much.<br><br>If you can ignore the unoriginality and the cheesiness of it all, then sit back and enjoy THE HILLS HAVE EYES PART II.","user":"BrianCTyler","rank":[23,30]},{"title":"\"...the hills still have eyes.\"","rating":15,"date":"15 September 2003","review":"The Hills Have Eyes Part II is Wes Craven's less than great follow-up to the brutal original.  The first film is damn near terrifying in parts.  This one is slightly goofy and unbelievable.  The flashbacks are my main problem with the film.  Everyone has flashbacks.  Every single character from the original has flashbacks, the freakin' dog even has flashbacks.  If you're watching The Hills Have Eyes Part II, you almost have to be a fan.  I think we're all familiar with the first one.  If you're not, then you shouldn't be viewing it.  Any reality or spontaneity is also gone.  You know who is going to die right away.  The cast is decent though.  Michael Berryman, Robert Houston, and Janus Blythe all return.  Kevin Blair from Friday the 13th Part 7 and Peter Frechette from The Kindred play moto-cros bikers while Nicholas Worth plays the voice of the Reaper.  And can anyone tell me where the Reaper was hiding in the first film?  If you didn't enjoy the first Hills Have Eyes, you aint gonna like this one. <br><br>Note for genre buffs: Kane Hodder is listed as a stuntman.","user":"Backlash007","rank":[14,17]}]