[{"title":"Unforgettable scenes plus San Francisco locations","rating":7,"date":"7 January 2004","review":"Woman on the Run has some wonderful scenes. Ann Sheridan plays a disenchanted wife whose husband was a witness to a gangland killing (while walking his little dog). Realising that he is in great danger the man goes into hiding (without the dog). Right from the beginning the noirish drama is mixed with hilarious humor. The police officers who come to the Sheridan character's house after the incident are cheeky and mean to the extreme. The woman who for some reason is treated like a suspect even has to open all her kitchen cupboards (I won't tell you what's in it, it's very telling and absolutely funny). Many aspects of the script do not stand up to logic. But, well, it is \"only a movie\" and therefore it does not matter at all  quite on the contrary in fact.<br><br>Alfred Hitchcock must have run this one in his screening room more than once. The finale in a funfair has a strong resemblance with the one in his Strangers on a Train, released one year later. It has an astonishingly well done nightly rollercoaster scene. Furthermore there is some very good location shooting on the streets of San Francisco. I can highly recommend this well fotographed and directed movie with good performances, especially by Ann Sheridan.","user":"manuel-pestalozzi","rank":[61,62]},{"title":"Excellent film noir with a hard-as-nails performance by Ann Sheridan","rating":9,"date":"23 July 2006","review":"WOMAN ON THE RUN is an infinitely better and more rewarding movie experience now than when it was released in 1950. Saw it back then when I was a child and the only thing I remembered was the terrifically-exciting roller coaster sequence. Seeing it again on DVD makes me appreciate everything about it, a film noir classic. To make such a no-nonsense, concise and plausible crime thriller with a sensational finale today certainly seems to be asking for the impossible. Ann Sheridan, of a certain age, never sexier and looking like a million dollars, dominates the screen, as usual. She can do anything, but overact. She's the real thing. Scenes in this movie bear comparison to Orson Welles' TOUCH OF EVIL and Alfred Hitchcock'S STRANGERS ON A TRAIN. This is a gem - hard-boiled, splendidly-acted, written and photographed.","user":"frankdistefano","rank":[55,57]},{"title":"Bit Off Every Nail......","rating":7,"date":"9 October 2001","review":"***SLIGHT SPOILERS*** I'm not prone to exaggeration and yes, I am an avid Ann Sheridan fan. Saying that, I thought this movie to be a real delight. It wasn't long and it kept my attention from beginning to end. Ms. Sheridan gives a memorable portrayal of the wife of a man that's hiding out because he's witnessed a murder and the murderer tried to take a shot a him. Ms. Sheridan is desperate to find her husband before the police and she teams with a reporter that claims he wants the scoop on the story and is willing to pay the couple that have been down on their luck. She and the reporter are close on the scent of her ailing husband, but not until the last few nerve wrecking moments does Ms. Sheridan discover that her side-kick/reporter is in fact the man that's looking to bump her husband off. There's a fabulous and memorable roller coaster scene. I highly recommend this film and most of Ann Sheridan's work.","user":"Keedee","rank":[25,25]}]