[{"title":"Wayne missed the point.","rating":29,"date":"29 September 2004","review":"Previous commenter Wayne missed the point... \"Red Dawn\" does not glorify violence and war. Far from it... the movie tries to show just how gruesome and de-humanizing an extended conflict like this can be. The occupying Soviet and Cuban/Nicaraguan soldiers are not portrayed as monsters. In fact, there are many moments when they are shown for exactly what they are... often young and frequently scared soldiers, doing the job they have been told to do. There are certain individual characters that are shown as ruthless killers, but they are generally the exception. The movie is less an action film, and more a cautionary tale of taking things too far and going over a precipice from which it is not easy to return. Neitzsche said \"Those that do battle with monsters should take care, lest monsters they become.\" The Wolverines start out as a band of scared kids running for their lives, and grow into guerilla fighters forced to fight for their freedom. Eventually, they take it too far, and start to lose their emotional connection to what they are doing. It's hard to say more without giving away some key points of the ending sequences, but suffice to say that the kids come perilously close to fulfilling Neitzsche's warning. Those that take this movie simply at face value will lose a lot of the potential impact, and will likely miss the messages contained therein.","user":"mjwalser","rank":[105,143]},{"title":"Ditto that !","rating":13,"date":"13 July 2006","review":"'Far Off Gone' is right on with that summary.<br><br>As a teen when this movie came out, us kids had grown up with Cold War news every night on TV. All these ICBMs being made, the 'Star Wars' defense initiative (SDI), even movies like 'War Games' contributed to a overall climate of concern about Russian/USA relations.<br><br>Then this movie hit theaters and us teens and younger adults felt we weren't so powerless after all. I can only speak for myself, but the opening scene was very sobering to a 18 year old kid who could relate to the dumbfounded kids in the classroom watching Soviet paratroopers hitting the schoolyard. I guess its one of those things where you had to be at the age and grown up in that era to really understand how the movie was received for its time.<br><br>The cast is chock full of stars in their younger years, and acting isn't bad either. Great movie and certainly worth watching at least once.","user":"b_m-1","rank":[78,110]},{"title":"It obviously touched a nerve","rating":7,"date":"29 September 2005","review":"Reading previous commentary, I'm amused by the violent reaction this movie still elicits. The ranting of previous reviewers indicates the movie touched a nerve. I have seen really, really bad movies and Red Dawn is certainly not as bad as the ratings it has received here.<br><br>As is so often the case, many previous reviewers are criticizing the film because its premise conflicts with their political philosophy. I wonder how they would have rated this film had the characters been teen-aged members of an all-black football team who become partisans fighting bigoted southern whites in a 1960s civil war that never occurred. Would they be so harsh if the movie were about a group of teenage Jewish soccer team members fighting the Nazis in World War II? they might not have rated it nine or 10 stars but I'd bet they would have given it more than one star. Given the current political climate, they might even receive it more warmly if the characters were Iraqi teenagers fighting Americans.<br><br>I understand the temptation to judge movies based on your own preferences rather than the movie's own merits. I recently watched Easy Rider for the first time and absolutely could have kicked myself for wasting the two hours or so it took the silly drivel to play out. Were I to rate it strictly on the way I felt about the movie -- the silly situations at the commune where 50 hippies are supposed to live all winter on about a half acre of wheat, about enough to produce a loaf of bread, the laborious acid dropping scene, the cartoonishly villainous red necks, the lame acting (other than Nicholson) -- I guess I'd have to give it about a one-star rating. But it was a beautifully filmed movie and it obviously spoke to people at that time. So a more valid assessment from my perspective would be that it's an anachronism that seems a bit silly today but obviously had merit in context.<br><br>I believe Red Dawn touched something in young people of the mid-80s in the same way Easy Rider touched young people in the late 60s. Sift through the silliness of both movies and you find something people were looking for. Prior to this movie, young people were told that if World War III came, they would either be swallowed by an irresistible communist onslaught or fried in a matter of seconds by a nuclear explosion. Red Dawn said to them, \"If the time comes, you will not be helpless. You will fight back and win.\" It was an entirely unique message at the time and one people were longing to hear. In fact, The United States was already fighting back and won it's greatest victory over its most formidable foe without direct armed conflict and bloodshed because of visionary and resolute political leadership.<br><br>From the time of its release until today, Red Dawn has been roundly criticized for the implausibility of the plot. It's quite true that the communist bloc was not capable of a successful invasion of the United States in 1984. But for those who failed to grasp this, Red Dawn was not a documentary. The prologue establishes the circumstances under which the invasion occurred and the action that proceeds from that premise is possible. Would communist troops shoot up a school? Their battle record indicates that if they saw it as or mistook it for a tactical objective, they most certainly would. Would they shoot civilians? Is there anybody out there so ignorant to suggest they wouldn't?<br><br>Good Points about Red Dawn: *The action sequences are well done and look realistic. For instance, there's a scene where a plane drops a bomb. You see the fireball first and then hear the sounds. That's a nice, realistic touch. *The actors handle their weapons properly *Beautiful photography *There's some good chemistry between some of the actors *The outcome is typical of what happens in partisan fighting. Partisans typically enjoy initial success because of surprise and knowledge of the terrain. But they usually eventually succumb to better-trained, better-equipped troops *I liked the musical score<br><br>Bad points about Red Dawn: *The communists are a tad too stupid for too long *The use of horses is a stretch. *Some of the teenage high-fiving and exuberance will make you groan *Some (but not all) of the dialog and acting is awfully stiff<br><br>In short, it's an action picture that will entertain people who like action pictures. It has a unique plot line that has now become an anachronism. At it takes a jab at one of Hollywood's scared cows, communism which is refreshing. Nobody should be ashamed of making it, acting in it or enjoying watching it.<br><br>Politically, the real question is not why Hollywood made a film like Red Dawn. It is rather, why did 50 years of totalitarian communist oppression spawn so few films critical of communism? Why are there seemingly scores of movies about McCarthyism and none about the Soviet gulag system? Schindler's List shows that Hollywood can make an incredible film, a film so compelling you can't take your eyes off of it, about something so horrible you can hardly bear to think about it. Stalin's body count exceeds Hitler's yet there is no Schindler's List for the Gulag. And that is something to be ashamed of.","user":"doveshooter","rank":[192,287]}]