[{"title":"Decent, but doesn't live up to the book","rating":9,"date":"9 February 2003","review":"I had just finished reading the original Roald Dahl novel (which I thought was brilliant), and at the video store I found the DVD of an animated version. Curious to see if it would be as good as the book, I checked it out.<br><br>I can't say I wasn't a little let down with it. The animation bothered me a little in some scenes (jerkiness, etc.), though in general it wasn't too bad (I really liked some of the backgrounds). And it could have done without the songs, which really got on my nerves. Thankfully there's only two, so it could have been worse.<br><br>I thought the BFG was very much in character, but the Queen and Sophie were a bit more interesting in the book. The evil Giants also had a lot more to them in the book, and were even more sinister, yet a bit funny too. That was lacking in the cartoon adaption.<br><br>All in all, not a terrible cartoon, just not very good. I very highly recommend the book, and once you've read it, you might want to check out this cartoon, but you may be let down (or you may not. No one has the same tastes). I just feel something's missing here.","user":"xxlittlekittenxx","rank":[22,27]},{"title":"80's animation breathes life into a Sunday morning","rating":10,"date":"13 November 2006","review":"This film is a real 80's delight. I rediscovered it while watching it with my kids. It's so much of it's time. There's an innocence in the animation and story. Nobody questions why a big creepy giant would want to hang around with a little girl. Which is is great!! The times we live in are so paranoid this film makes us remember why we all need a granddad figure of out own.<br><br>David Jason's performance as the BFG is remarkable. At first I didn't realise it was him. I think he gives it that extra something that really shines through.<br><br>The beginning was really Richard William's like, with the cloaked giant running through the streets. It makes me realise how good Cosgrove Hall could be. It would be fun to check out more of their stuff again. Especaily Danger Mouse.","user":"andyflight","rank":[10,11]},{"title":"The best film ever, when you're about 7!","rating":9,"date":"6 December 2003","review":"All I can say is that i used to love this film when I was little! I thought it was brill! Watching it a couple of months ago I spoiled it cos it's not that good when you're older. It's based on the book by Roald Dahl and the book is much better but I think you could say that about most films which are based on books! Worth watching if you're a small child (which I very much doubt you are)(he he), otherwise i'd read the book (whatever age you are!)","user":"vix62","rank":[17,22]}]