[{"title":"Ozu's Quietly Brilliant Masterpiece Deserves Your Attention","rating":10,"date":"12 December 2005","review":"I think this movie is amazing for reasons I was not expecting. I had heard of Yasujiro Ozu's \"Tokyo Story\" for several years but never had an opportunity to see it until Criterion resuscitated it as part of their DVD collection. Over fifty years old, this wondrous 1953 film resonates just as deeply today. Those outside Japan rarely get to see a Japanese film classic that doesn't involve samurai warriors in medieval battles. This one, however, is a subtly observed family drama set in post-WWII Japan, and it is the quietude and lack of pretense of Ozu's film-making style that makes this among the most moving of films.<br><br>The plot centers on Shukishi and Tomi, an elderly couple, who traverse the country from their southern fishing village of Onomichi to visit their adult children, daughter Shige and son Koichi, in Tokyo. Leading their own busy lives, the children realize their obligation to entertain them and pack them off to Atami, a nearby resort targeted to weekend revelers. Returning to Tokyo unexpectedly, Tomi visits their kindly daughter-in-law, Noriko, the widow of second son Shoji, while Shukishi gets drunk with some old companions. The old couple realizes they have become a burden to their children and decide to return to Onomichi. They also have a younger daughter Kyoko, a schoolteacher who lives with them, and younger son Keizo works for the train company in Osaka. By now the children, except for Kyoko and the dutiful Noriko, have given up on their parents, even when Tomi takes ill in Osaka on the way back home. From this seemingly convoluted, trivial-sounding storyline, fraught with soap opera possibilities, Ozu has fashioned a heartfelt and ultimately ironic film that focuses on the details in people's lives rather than a single dramatic situation.<br><br>What fascinates me about Ozu's idiosyncratic style is how he relies on insinuation to carry his story forward. In fact, some of the more critical events happen off-camera because Ozu's simple, penetrating observations of these characters' lives remain powerfully insightful without being contrived. Ozu scholar David Desser, who provides insightful commentary on the alternate audio track, explains this concept as \"narrative ellipses\", Ozu's singularly effective means of providing emotional continuity to a story without providing all the predictable detail in between. Ozu also positions his camera low throughout his film to replicate the perspective of someone sitting on a tatami mat. It adds significantly to the humanity he evokes. There are no melodramatic confrontations among the characters, no masochistic showboating, and the dialogue is deceptively casual, as even the most off-hand remark bears weight into the story. The film condemns no one and its sense of inevitability carries with it only certain resigned sadness. What amazes me most is how the ending is so cathartic because the characters feel so real to me, not because there are manipulative plot developments, even death, which force me to feel for them.<br><br>I just love the performances, as they have a neo-realism that makes them all the more affecting. Chishu Ryu and Chieko Higashiyama are wonderfully authentic as Shukishi and Tomi, perfectly conveying the resignation they feel about their lives and their children without slipping into cheap sentimentality. Higashiyama effortlessly displays the sunny demeanor of a grandmother, so when sadness does take over in her life, it becomes all the more haunting. In particular, she has a beautiful scene where Tomi looks forlornly at her grandchild wondering what he will be when he grows up and whether she will live to see what happens. Even more heartbreaking is the scene where Shukishi and Tomi sit in Ueno Park realizing their children have no time for them and are resigned to the fact that they need to find a place to sleep for the night. The closest the film has to a villain is Shige, portrayed fearlessly by Haruko Sugimura, who is able to show respect, pettiness and conniving in a realistically mercurial fashion. Watch her as she complains about the expensive cakes her husband bought for her parents (as she selfishly eats them herself) or how she finagles Koichi to co-finance the trip to Atami or how she shows her frustration when her parents come home early from the spa. So Yamamura (familiar to later Western audiences as Admiral Yamamoto in \"Tora! Tora! Tora!\") displays the right amount of indifference as Koichi, and Kyoko Kagawa has a few sharp lines toward the end of the film as the disappointed Kyoko.<br><br>But the best performance comes from the legendary Setsuko Hara, a luminous actress whose beauty and sensitivity remind me of Olivia de Havilland during the same era. As Noriko, she is breathtaking in showing her character's modesty, her unforced generosity in spite of her downscale status and her constant smile as a mask for her pain. She has a number of deeply affecting moments, for instance, when Noriko explains to Shukishi and Tomi how she misses her husband, even though it is implied he was a brutalizing alcoholic; or the touching goodbye to Kyoko; or her pained embarrassment over the high esteem that Shukishi holds for her kindness. Don't expect fireworks or any shocking moments, just a powerfully emotional film in spite of its seemingly modest approach. The two-disc DVD set has the commentary from Desser on the first disc, as well as the trailer. On the second disc, there are two excellent documentaries. One is a comprehensive 1983, two-hour feature focused on Ozu's life and career, and the second is a 40-minute tribute from several international movie directors.","user":"EUyeshima","rank":[159,175]},{"title":"Too subtle and yet too obvious","rating":24,"date":"24 October 2004","review":"This film is commonly called one of the masterpieces of international film. Indeed, a well-known \"intro to film\" textbook uses it as a case study in notable film-making. But, as more than one reviewer so far has pointed out, 'Tokyo Story' is slow, obscure, and sometimes seemingly sterile. Understanding how a great classic could be seemingly soulless requires some study - of Japanese culture, as others have pointed out, of film technique, and of ourselves. Fortunately, that understanding more than fully repays itself, as is true of any great piece of art.<br><br>I should begin by warning the first time viewer that the film is not in any familiar style. Other reviewers have mentioned the camera, the angles, the acting, the elision - I hardly need dwell on these. Those used to Hollywood films of almost any era will find 'Tokyo Story' odd and unsettling, just because the style is so different. And of course the culture is radically different. In this forum one can hardly even begin to discuss the way that Japanese fathers discuss their children amongst themselves, or the marriage culture of 1950s Japan. But I think the film is great even if one has no understanding of continuity editing, or post-war Japan, or a dozen other obscure topics. This is, after all, the central feature of great art: Even those of us who do not fully understand still realize, in some unspeakable way, that we are in the presence of something great.<br><br>The most common accusations leveled against this film, oddly, assert alternatively that it is a cold, soulless exercise in technique or, on the other hand, that it is a soap opera, with no real substance. I think neither of those is true. There can be no question that it is easily seen as cold. Nothing really happens, by modern standards. It is merely a family that comes and goes and lives and dies. Of course, to those who accuse it of being a soap opera, that death is the foremost evidence of its manipulative guilt. But, for those who have seen it, recall the mother's stroke, or where Keizo is told to look one last time - would a soap opera elide such a supremely emotional scenes?<br><br>No, 'Tokyo Story' is neither cold nor manipulative. Rather, it slowly brings you into a family that, while perhaps totally unlike your own, is at its base just the same. Then it allows those things to happen that must someday happen to all of us - growing up, moving away, and that unspeakable, inescapable end. It is not easy; it is not obvious; but it is not obscure, either. After it all, I can only tell you this: If you have lived long enough to know how it feels to leave your parents and only realize far too late, as it seems we all do, the value of what you have left behind, then 'Tokyo Story' will reward you perfectly. And these things - we all do these very things, so 'Tokyo Story' is universal, is Art.","user":"ghmcal","rank":[165,184]},{"title":"A cinema of tears","rating":10,"date":"8 April 2007","review":"I can vividly remember the first time i saw this movie - it was during a festival of Japanese movies in an art house cinema here in Dublin. I must admit to never having heard of Ozu before, i went out of boredom and casual curiosity. I was embarrassed at the end to find myself in tears. I quickly wiped them away in that subtle way guys do when they don't want anyone to know, and got out to leave. What struck me was that even as the credits were finishing, I was one of the first to go. As i walked up the aisle I realized that most of the nearly full cinema was still sitting quietly, without the usual post movie chatter - and more than half of the audience had tears pouring down their faces. I have never, ever witnessed that in a cinema.<br><br>Since then, i've watched it on DVD, and had to think a lot about why such a simple movie is so powerful, and so many people rate it as one of the greatest ever. And why i find myself agreeing with that rating, i truly think it is in the top 10 ever made - certainly the top 5 of any I've seen. But its hard at first to know why. It doesn't have the greatest script of any movie, there are few things in it that are truly original. The acting is great, but not the greatest ever seen, and the technical qualities are just average. I've come to the conclusion that the reason for its greatness is that it comes closest to pure art in cinema. By pure art, i mean art that in its simplicity but technical genius still reveals deep truths about our lives. When i think about Tokyo Story I don't find myself comparing it to other movies, instead I think of a Rembrandt self portrait, a Vermeer painting, or my favourite short story, 'The Dead' by James Joyce. It is simple, unadorned, and deeply wise. I realise in writing this I'm rapidly approaching pseuds corner, but this is my genuine conclusion (writing as someone who is shamefully uneducated in most of the arts).<br><br>Of course there have been many great movies about families, about growing old, about the nature of life.... but I think somehow Ozu achieved a sort of perfection with Tokyo Story. Thats why its the only movie I would give a '10' to.","user":"GyatsoLa","rank":[75,83]}]