[{"title":"An Unearthed Slasher","rating":5,"date":"22 August 2017","review":"Siblings Eric and Kay, her doctor husband David, her sister-in-law Brooke along with pilot Marsh become stranded on a rugged isle face off against a supernatural beast drawn to Kay who dreams of its killings.<br><br>The story and script were co-written by J. S. Cardone and Bill Ewing; Cardone eventually directed while Ewing produced. Cardone had been, what he called, \"the white token of the black film community\" writing for folks like Bill Cosby but was working in a liquor store to pay his bills. This was his first credited work on a feature film. Ewing had worked as an actor, and did cast coordination for \"Meteor\" (1979), but was also new to writing and producing films. Although today classified as a \"slasher\", the co-writers maintain they were really aiming for a psychological thriller with hints of Lovecraft.<br><br>The two were able to move from script to screen thanks to production manager Eric Weston (who horror fans may know as the director of 1981's \"Evilspeak\") and Lloyd Adams' International Picture Show Company (who then went bankrupt within the year). Outside of \"Slayer\", Adams may be best known as the producer of \"Grizzly\" (1976). This bankruptcy unfortunately caused any number of distribution problems, but the film did manage to find a life of its own.<br><br>For the appropriate setting, they chose Tybee Island, the easternmost part of Georgia known for its hurricanes and for being one of the few places an atomic bomb was dropped on American soil. Though storms do factor into the plot, as well as the island's relative isolation, the atomic bomb part is not mentioned. Perhaps an unfortunate missed opportunity? Not only were Cardone and Ewing new at the movie game, but this was DP Karen Grossman on her first feature film. She followed it up with \"Microwave Massacre\" (1983), as well as a couple of Cardone's films. The bulk of her credits are with the George Romero TV series \"Tales from the Darkside\" and its quasi-sequel \"Monsters\" Robert Short, the special effects man, had come out of Don Post's crew and had previously helped design the mask from \"Halloween\"; he can claim responsibility for the cool pitchfork scene, which is as good as any trick Tom Savini had pulled. Short went on to many, many huge projects, including \"Beetlejuice\".<br><br>Leading the cast is Sarah Kendall, who really sells the film with her wide eyes; she looks like a more terrified version of Sigourney Weaver, making her the perfect lead actress. She had apparently worked with one of the creators (probably Ewing) on a TV show, though this is unclear from her credits. Quite possibly, she had been on a few shows in smaller parts that were not well-documented at the time.<br><br>Ultimately, \"The Slayer\" is something of a mixed bag. Kendall is a strong leading lady, some of the gore effects are pretty good. And the concept of blurring the lines between dream and reality is incredibly clever. Although it is not likely this film was an influence, some of the ideas presented do predate similar ideas in the \"Nightmare on Elm Street\" films. What makes \"Slayer\" just alright rather than great, however, is the pacing. Far too much of the film is a slow burn and even at 86 minutes it feels long.<br><br>The film's early theatrical release saw it on Broadway with sections cut out and the color uncorrected, due in part to the bankruptcy noted above. Over the years the releases were degraded more and more, and fans who saw it on VHS probably saw it in its worst possible incarnation. This was until 2017, when Arrow Video saved the day. Despite these hiccups, director J. S. Cardone really went on to great things, directing movies with Cannon films, Empire Pictures and beyond.<br><br>The Arrow Video Blu-ray has an impressive 50-minute making of segment, with just about everyone attached to the film brought in. We also have a 13-minute feature on the locations, and a June 2017 Q&amp;A that took place on the island. Typically I would say the only thing missing is a commentary track, but the making-of does a fine job of replacing it and actually goes above and beyond by breaking down how some effects were done, something that could not be done with just audio. \"The Slayer\" may not be the greatest of all slasher films, but it does have an important place in history and fans ought to check it out.","user":"gavin6942","rank":[10,11]},{"title":"A Bit Slow But Worth the Time For True Genre Fans","rating":6,"date":"4 August 2006","review":"\"The Slayer\" is definitely a forgotten film from the early 80's. The title \"The Slayer\" is not really a great title as it gives false hope of this being another typical slasher film. And in ways... it is a slasher, but not at all typical.<br><br>The storyline starts with a couple (Kay and Eric) trying to go on vacation for the sake of the Kay. It seems that she is having horrible nightmares and they are affecting her life, as well as Eric's. They decide to bring her brother and his wife along for the trip. They fly to an isolated island where instantly Kay feels like she has dreamed of it before. The rest of the group ignore her and explore the island to find the house they are renting for vacation. It is when Kay decides to go to sleep when horrible things start to happen, and people start getting murdered.<br><br>The plot is slightly similar to that of Craven's \"A Nightmare on Elm St.\" but made before and not quite as unique. The movie is very slow but is very atmospheric also. At times it seems that the director didn't really know what he wanted to do, so he filled time with the vacationers wandering around the island looking for a missing friend. Those scenes seem to drag for quite sometime. Although, the music does help out a lot. It is a nice orchestrated soundtrack that adds depth to a depth-less movie. The gore in the movie is alright. There are a few moments that are thumbs up worthy but don't look for something like \"Friday the 13th\" here. One particular scene is great that involves a rowing ore.<br><br>If you are a true genre fan of the early 80's horror, this is definitely worth a look. Just try to keep focused on the movie because it can be a little difficult to watch at times. 6/10","user":"CMRKeyboadist","rank":[13,16]},{"title":"A decent, watchable horror movie","rating":6,"date":"15 December 2004","review":"Four young people vacation on a barren island. One of them, a female artist, has dreams that depict ghastly murders. Sure enough, the fun begins when her boyfriend is found dead, and others begin to die, too. Soon, she becomes awear that something in her nightmares is escaping threw her dreams...and it ain't Freddy Krueger! A decent, watchable horror movie. I wonder if Wes Craven got the idea from this film for \"A nightmare on elm street\"? (Hmm, it makes one wonder) The acting is generally pretty good, with the exception of Kay (Sarah Kendall) who overacted terribly. I've always liked the director, J.S. Cardone, He's capable of taking a generic plot and making it interesting and intelligent (See \"Shadowzone\" and \"Alien Hunter\", both were smart and enjoyable sci-fi movies that he scripted himself.) and he does well here with the creepy atmosphere he delivers. There's enough gore to satisfy, the pitchfork-threw-chest death scene being the best, but the gore is delivered just sparsely enough to make it effective. And the monster, once it finally shows up, looks really cool. I recommend \"The Slayer\" to horror fans, it's kind of different then the rest of the early 80's slashers, and one of the better ones at that. My rating for \"The Slayer\"6.5/10.","user":"willywants","rank":[13,16]}]