[{"title":"Very emotional","rating":9,"date":"8 July 2002","review":"This movie hits, it hits very hard. No one is let off easy in this film about an old man (played to perfection by Jack Lemmon) who has his wife do everything for him. BUt his wife has a heart attack and is put in the hospital. His son (Ted Danson) has to return home to take care of his father. What comes from there is an adventure that will warm you heart as fast as it will break it. Jack Lemmon is very believeable as the father that you will believe that he actually is 85 years old and Ten Danson has never been better in a film. This film devlves into hard topics such as divorce, marraige and family relationships and none of these subjects are delt with lightly and is sure to bring a tear to the eye of everyone whether you can realte to these characters or not.","user":"casey_choas66","rank":[25,27]},{"title":"this remains a powerful film","rating":9,"date":"9 November 2001","review":"I think this is Jack Lemmon's greatest performance and the supporting cast are incredible, including Ted Danson who always appears to me to be slightly frenetic in a grim kind of way. Here he is truly believable and his scenes with his own son tug at your heart they are so real. No Hollywood quickfix here for the relationship, the boy is simply closer to his grandfather than he is to his own father and nothing will change that fact.<br><br>What I liked most about the film  was that the theme in less worthy hands could have been made sloppily sentimental, but here it is totally restrained both in script and direction and it makes for a really meaningful movie. The characters remain real all the way through and the script does not transform them into wondrous saints by movie's end.<br><br>It is the wonderful understatement in it all that captivated me and made me weep at the end.  Jack is truly unforgettable and Olympia magnificent in her dryness and cynicism. I have seen it 3 times and each time relished another scene a little more.  This time around it was Jack dragging his wife around to meet the neighbours he was not even aware of before and her long suffering face at this new and reinvented Jack makes you laugh out loud. Bravo to all.  An 8 1/2 out of 10. And that scene where they dance, oh me oh my......who needs naked bodies writhing on a bed, this has sensuousness, love and intimacy in it, the real kind.  Oh for more of those scenes in movies!","user":"wisewebwoman","rank":[12,12]},{"title":"Solid Story-Telling.","rating":6,"date":"6 July 2002","review":"Genuine tear-jerker that has the elderly Olympia Dukakis falling ill and leaving husband Jack Lemmon in limbo. Dukakis has done all the work in the relationship and Lemmon is helpless, plain and simple. Son Ted Danson comes to the rescue though and Dukakis starts to recover slowly. However trouble looms as Lemmon will be diagnosed with cancer and go into an emotional tail-spin that could kill him. A sappy screenplay works to near perfection here and steady direction helps the film's cause as well. Watch for a young Ethan Hawke as Lemmon's grandson. Heart-wrenching and heart-warming at the same time. 4 stars out of 5.","user":"tfrizzell","rank":[12,13]}]