[{"title":"Very, very, very funny film","rating":8,"date":"20 November 2005","review":"This movie always cracks me up. I should note that I'm SO not a fan of Andrew \"Dice\" Clay, I think his stand-up shows suck, big time. But here, he's simply fantastic as Ford Fairlane, the Rock'n Roll Detective, who mostly gets paid in the form of gifts or memorabilia.<br><br>Dice's jokes here work perfectly each time, one quotable line after another (\"so many assholes, so few bullets\", \"you're a poet and didn't know it\", \"talking with Zuzu is like ************ with a cheese-grinder, slightly enjoyable but mostly painful\" to name a few). The film never takes itself seriously, yet somehow keeps it from ever going into slapstick territory.<br><br>Supporting actors do well also, Presly is always a stunner, Wayne Newton gives his best ever performance as Fairlane's nemesis and Ed O'Neill is a riot as a former disco singer turned detective. Robert Englund gives a rather amusing performance as a very inept crook who's ultimate fate is nothing short of hilarious.<br><br>Finnish director Harlin directs with a sure hand, everything in the technical department in tip top shape and it's very visually stylish at times. The Adventures of Ford Fairlane is definitely not for everyone, but it's not only for die hard Clay fans, since I sure as hell ain't one of them. But I think he's perfect here and the film is very funny and comes highly recommended by me.","user":"ODDBear","rank":[58,71]},{"title":"A Cast of Characters right out of a Vegas Act","rating":7,"date":"11 January 2002","review":"First of all, what a great movie. None stop laughs from one of the very few comedians who can sell out Madison Square Garden. Not only was Dice's performance \"Unbelievable\" the supporting cast held a lot of big named actors. Wayne Newton, Priscilla Presley, Lauren Holly, and the guy who played Freddy Kruger....yeah, what's his name? Anyway, this got a terrible review from the powers to be because it was considered Dice comedy. Still, you can't watch Ford Fairlane without laughing a few times.","user":"caspian1978","rank":[55,71]},{"title":"Classic!","rating":8,"date":"25 October 2005","review":"Sure there is crude humor, but it's *Dice Clay*. He is who he is. This actually seemed cleaned up a bit for him. Mr Rock and roll detective gets to investigate the death of Vince Neil. You throw in Precilla Presley, Gilbert Godfried, Ed O'Neill. That is a recipe for just funny. *Very funny*, lots of good one liners, very quotable. Then again, I evidently have the mental capacity of a dead hamster. ;) If for nothing else, it is a definite watcher for fashion don'ts. Yes we *really* did dress that way in the late 80's early 90's, it was very \"Rock and Roll\", we thought we were cool. Though now I can't imagine why... Excellent time-period comedy. It's a re-watcher.","user":"Sailorpooka2000","rank":[43,55]}]