[{"title":"Starts Off Good But Falls Apart","rating":13,"date":"13 February 2012","review":"Vigilante Force (1976) <br><br>** 1/2 (out of 4) <br><br>A small town comes under attack from a group of rednecks so a man (Jan-Michael Vincent) decides to talk the Sheriff into letting his Vietnam vet brother (Kris Kristofferson) and his four vet buddies clean things up. The plan starts off good at first but soon the five vets decide to do a few illegal things of their own. VIGILANTE FORCE starts off as a pretty good exploitation flick but it slowly begins to fall apart as the story for some reason switches directions. The beginning of the movie is the type of over-the-top actioneer that you'd expect to see from producer Gene Corman. The start of the movie features a greatest hits package of redneck damage, which includes bar fights, shootings, a stabbing and more violence all of it in drive-in camp fashion. Kristofferson arrives on the scene much like Sam Elliott would in the later cult classic ROAD HOUSE and the movie is still doing good at this part. The actor is very fun in the part and it's entertaining seeing him and his vet buddies walk around putting an end to the trouble. Where the screenplay really lost me was in the second half when they turn these fun guys into coldblooded killers. For the life of me I couldn't understand why they wanted to go this direction but my closest guess is that they wanted the brother versus brother showdown between the two stars. The eventual showdown really doesn't pay off and it also doesn't cool the bad taste left in your mouth from some of the actions that the Kristofferson character does. I won't give any spoilers but some of the murders just make you hate the guy, which completely goes against the feelings they build up early on. Kristofferson is very good in his part as is Vincent as his brother. The supporting cast includes Victoria Principal, Bernadette Peters, Charles Cyphers, Andrew Stevens and John Steadman who is best remembered for Wes Craven's THE HILLS HAVE EYES. As is, the film works good enough in its first half to make it worth viewing but one wishes they had kept up with the fun times instead of doing something different.","user":"Michael_Elliott","rank":[9,9]},{"title":"Trashy but moderately entertaining actioner.","rating":3,"date":"3 February 2003","review":"Vigilante Force is a trashy, energetic, empty-headed action picture which keeps you entertained without ever engaging your intellect. Kris Kristofferson gives a great, atypical performance as a seriously nasty bad guy and Jan Michael Vincent offers competent support as his good-guy brother.<br><br>The film sees Vincent getting fed up with the violent behaviour of certain rowdy townsfolk in his home town. He hires his brother, Kristofferson, and his Vietnam veteran buddies, to come into the town and clean up the trouble. They get the job done, but then things go sour. They become corrupt and take control of the town themselves, thus becoming just as bad as the thugs they were supposed to get rid of in the first place.<br><br>The violence is not gratuitous, but there's enough of it to keep blood-addicted viewers happy. The action is pretty good. The film goes through some slow patches and seems all at sea when the characters stop fighting and shooting and actually sit down to have a conversation. However, when the mayhem is on the screen, the film comes into its own and contains some explosive scenes. Vigilante Force is not great art... the dialogue is clunky and it has no subtext, no deeper meaning than the immediate violence and explosions, but of its kind it is certainly an enjoyable way to pass the time.","user":"barnabyrudge","rank":[13,17]},{"title":"Brutal balderdash...","rating":4,"date":"2 September 2007","review":"A Vietnam vet decides to take over a backwater town run amok, and anyone who steps in his path is eliminated (including women). Released to theaters just prior to \"A Star Is Born\", which turned his career around, this action-drama mishmash starring Kris Kristofferson is wildly off-kilter, thoughtless and mean-spirited. Filmed in Simi Valley, CA, the results are truly unseemly, with redneck clichés and mindless violence making up most of director George Armitage's script. Armitage has gathered a most curious '70s cast for his film, including Jan-Michael Vincent, Victoria Principal, Bernadette Peters, and, in a bit, Loni Anderson; however, the center of the whole thing is Kristofferson, who is gruff and rude throughout. It deserves points I suppose for being a completely unsympathetic drive-in thriller, but the bad vibes (and the ridiculous climax) coat the whole project like an ugly stain. *1/2 from ****","user":"moonspinner55","rank":[10,13]}]