[{"title":"Prophetic warning","rating":14,"date":"14 August 2000","review":"An excellent cast, a well-crafted script, and a talented director add up to one of the great films.<br><br>This movie captures the paranoia of the cold war and how that paranoia tested the strength and definition of a democracy. The importance of civilian control over the military is well illustrated in this chilling story of a plot by the Pentagon to overthrow the US President because the military disagrees with his disarmament policy.<br><br>Use of black &amp; white gives the film the look of a documentary, emphasizing the sense of realism for the story. If you have the chance, see this movie.","user":"mermatt","rank":[87,97]},{"title":"Can It Happen Here?","rating":10,"date":"16 December 2005","review":"Fredric March is the President of the United States. He has just gotten a nuclear disarmament treaty signed with the Soviet Union's leader, and it has (barely) been passed by the U.S. Senate. Both countries agree to get rid of their nuclear arsenals, and to end decades of potential nuclear catastrophe. But there are many who oppose this treaty, including Burt Lancaster, the greatest military hero of the day and head of the Joint Chief of Staff. He is in contact with several others regarding these fears, and they are planning a coup, to replace the President and his supporters and rip up this dangerous treaty. That is the background and story of \"Seven Days In May\", except that Lancaster's closest assistant, Kirk Douglas, is appalled at the scheme and tips off March and his associates (Martin Balsam, Edmond O'Brien, George Macready). We are also aware that there is certain information that can be gotten by the President that would tarnish Lancaster's American patriot and family man image - his love letters to his mistress (Ava Gardner). Also, as the film goes on, we are aware of the spread of the coup - how Edmund O'Brien is held imprisoned by mutinous soldiers. And how Balsam may have gotten a confession out of one of the weaker links in the scheme.<br><br>This film is interesting on so many levels. Not only does it include so many good performances in it, it is one of the most \"Oscar\" filled film casts one can think of - March, Lancaster, Douglas, Balsam, O'Brien, and even the uncredited John Houseman (as the weak-link Admiral Barnswell) all do well in the film. But what is most interesting to me is that the film was made when it was. Because it brings up the issue of whether a political coup can happen here or not.<br><br>The subject of a fascist or dictatorial government taking over America is not new. Jack London wrote of such in \"The Iron Heel\" at the turn of the 20th Century. Sinclair Lewis did the same in 1934 with \"It Can't Happen Here, turning real life demagogue Senator Huey Long into \"Senator Buzz Windrip\" who seizes power. Hollywood would have an unsettling faith (to us) in fascistic politics in \"Gabriel Over The White House\", \"This Day And Age\", and even Harold Lloyd's strange comedy The Cat's Paw\". That the Depression scared the people does not really reassure us today. But \"Seven Days In May was written in the 1960s. It does show how close to success such a plot may go.<br><br>SPOILERS AHEAD:<br><br>Basically, what saves the day for President Jordan Lyman's administration, and the treaty, is that the confession of one of General Scott's confederates is found. Lyman is unable to bring himself to be as underhanded towards the General as the latter deserves (he can't bring himself to use the love letters the General wrote his mistress to discredit the man). The deus ex machina of the confession saves the day, and causes the other leaders of the coup to save themselves, so that Scott is deserted and discredited as a traitor (when Jiggs, sarcastically asked if he knows who Judas was, tells Scott that he is Judas Scott realizes it's over). His collapse is completed as he hears over the radio of the resignations of his co-conspirators.<br><br>The interesting thing was that Knebel's novel pushed a different slant on Scott's final collapse. Lyman, in the novel, produces the confession to Scott, and they both hear of the resignations. Scott leaves the Oval Office aware that it is over, but thinking that he might (after he resigns) start a political campaign to replace Lyman in the White House in the next election. Instead, he is confronted by Senator Clark (O'Brien) and Secretary of the Treasury Todd (George Macready)outside the Oval Office. They remind Scott that if he intends to run for the Presidency rather than resigning, there is still the matter of the love letters. Clark tells him that while Lyman is too much the gentleman to use them, neither Clark nor Todd would hesitate the opportunity of smearing him as a moral hypocrite. Scott actually is more concerned about this - and actually tries to hide behind the theoretical skirts of his betrayed wife at this moment (\"You wouldn't want to hurt her\" - that sort of thing). Regretfully they wouldn't care.<br><br>In 1962, John Frankenheimer had done \"The Manchurian Candidate\", which also suggested a threat to American Democracy (although manipulated by foreign governments and their hidden agents). Then President John Kennedy was assassinated in 1963, and in modern times (sixty three years since the last successful Presidential murder) violence had shaken the government. So \"Seven Days In May\" was quite timely when it came out in 1964. It has lost none of it's timelessness since then.<br><br>Oddly enough, Fletcher Knebel wrote another political thriller that never did get made into a film. I'm not referring to \"Vanished\", which was made into a television movie in the 1970s. I am referring to \"A Night At Camp David\". In that novel, a popular American President invites his Vice President to spend a week-end in the Presidential retreat, and has a series of conversations about policy plans that reveal to the increasingly frightened Veep that his chief is an insane paranoid, who is planning moves that may lead to global disaster. The problem: Only the Veep has been informed of this - nobody else. How is the Veep to get the public to realize the danger, without people feeling the Veep is only spreading lies against a popular President in order to seize the Presidency himself? It is a fascinating plot, and I wonder why it was never filmed.","user":"theowinthrop","rank":[37,41]},{"title":"Seven Days in May Was Anything But Far-fetched","rating":9,"date":"12 January 2006","review":"The novel and the movie Seven Days in May were based on a very potential reality. See James Bamford's 2002 book, Body of Secrets, which is about the National Security Agency. General Edwin Walker, mentioned in another review, was only the least of what was going on in the higher echelons of the U.S. military near the end of the Eisenhower Administration and the beginning of the Kennedy-Johnson Administration.<br><br>At military bases, and even at the National War College in Washington, the most rabid preachings took place about the real threat of communism coming not from Russia or Cuba, but from high-ups in the domestic power structure, including the government. The entire Joint Chiefs of Staff (JCS), led by Chairman Lyman Lemnitzer, was very right wing and rabidly obsessed with the idea that American civilization could not endure unless Cuba was militarily conquered and occupied in the long-term. They repeatedly threw suggestions for this at Eisenhower, who never took the bit. When Ike left the Oval Office and Kennedy, who had never been a military higher-up, replaced him, Lemnitzer felt adrift and became very paranoid. There were all sorts of JCS contingency plans, never implemented, for creating an incident that could be blamed falsely on the Russians and/or the Cubans to justify an invasion - a sort of second sinking of the battleship Maine. The more far-fetched of these ideas included terrorism at home to be blamed on Cuba and an attack on a friendly Central American country that could be falsely blamed on Cuba, all without the President's approval. Lemnitzer, according to Bamford, had little use for the concept of civilian control of the military. In fact,enough of this atmosphere within the U.S. military was in the wind that there was a secret Congressional inquiry into the potential for a military takeover of the government, which was based on more than idle wonder. Senator Albert Gore of Tennessee (the father of the recent Vice President), a member of the investigating committee, called for Lemnitzer's firing. Kennedy did not fire him, but did not re-appoint him to a second term as Chairman, preferring the more rational Maxwell Taylor.<br><br>When the book came out, I stayed awake for 24 hours to finish it. I could not put it down. Mercifully, the film is shorter, but it is superbly acted and very well scripted. You won't be disappointed.","user":"msilbergeld-1","rank":[56,64]}]