[{"title":"The Weird Countess","rating":10,"date":"4 March 2007","review":"West German cinema discovered Edgar Wallace's novels in 1959. The films became sensationally popular and during the next twelve or so years some forty + films were brought to the screen, a number which makes other film serials such as James Bond grow pale with envy. In addition to that, another team began screening the novels of Wallace junior almost immediately. The results are often mixed, but especially the earliest \"original\" Wallace films are superbly atmospheric crime thrillers.<br><br>Both these serials are now released on DVD in Germany. Most of these de luxe editions (4 DVD sets) have only German soundtrack and subtitles, but this film has both optional English soundtrack and subtitles, so obviously it was deemed to be one of the best entries.<br><br>The Weird Countess can easily stand in line with the best film noir masterpieces. It builds a nightmarish mood up to the point when the viewer is sickened by not knowing what exactly is going on. It's structurally very well crafted and employs some very good actors - such as the legends of German cinema Marianne Hoppe and Lil Dagover, breathtakingly beautiful at 74. There's also the very young Klaus Kinski, giving a performance you wouldn't want to miss.<br><br>It might be somewhat weird to look at Germans acting to be English, but once you get accustomed, this is a highly enjoyable, spooky thriller. The story is quite complicated, so you may find yourself reflecting upon it when it ends quite suddenly, but don't worry, it all adds up.<br><br>WARNING: The less you know about these films in advance, the better. There's a short summary on the cover, which already says too much, and I feel very lucky I didn't read it before I began watching the film. Avoid any kind of compendiums.<br><br>If you yearn for more supernatural German 1960s sci-fi serial, you might want to check out Dr Mabuse films, also great fun.","user":"mart-45","rank":[9,9]},{"title":"Steadily paced and atmospheric Krimi flick","rating":7,"date":"6 July 2009","review":"The Strange Countess is one of the earlier German Edgar Wallace adaptations (or 'Krimi' films) and it's also one of the best. As always, the film takes place in the UK; although all the actors are German. The story itself is fairly strong and presents a good mystery that keeps the audience guessing and interested for the duration. However, the best thing about the film is undoubtedly the varied array of characters, which are all good in their own right and help to further the plot. The story itself focuses on Margaret Reedle; a secretary to a lawyer who is being tormented by phone calls. She has been offered another job with a Countess Moron, and has decided to take it. However, Scotland Yard has learned that somebody is out to kill the young girl and so have put their best man - Inspector Mike Dorn - in charge of keeping her safe. Around the same time, a Mary Pinder is being released from prison. She was put away twenty years earlier for poisoning, and seems to have some connection to the attempted murders.<br><br>The pacing of the film is very steady and it has to be said that there's not a great deal of real excitement in the film. However, the film works in spite of that as the story and characters are interesting enough in their own right. The mystery builds patiently throughout and small details are spoon-fed to the viewer. The bulk of the film takes place inside a sprawling and lavish mansion and this makes an excellent setting for the film and lays on a thick Gothic atmosphere. The murder attempts are good and include things such as bombing and poisoning - a near fall to the death from a balcony is the highlight in that respect. Most of the central cast will be familiar to anyone who is a fan of this sort of film as most of them appeared in other genre entries. As the plot nears the end, things get more and more complicated; and it has to be said that things get a little muddled by the end and the film loses its patient approach that served so well earlier on. Still, this is a very nice little mystery film and the climax is satisfying enough.","user":"The_Void","rank":[6,6]},{"title":"Familiar faces, old problems","rating":4,"date":"17 June 2016","review":"\"Die seltsame Gräfin\" or \"The Strange Countess\" is another Rialto movie about the Edgar Wallace novels. It is one of the earlier films and as such still in black-and-white. The many people who wrote and directed this film worked on other Wallace films too and like usual they run for 90 minutes approximately too. The cast also has several familiar names, such as Fuchsberger (in the lead again), Aren't and Klaus Kinski. And Lil Dagover, a huge star decades ago already, is on board here too playing one of the main characters. It will not come as a surprise to anybody that a big part of the story revolves her character with the script doing justice to one of Germany's biggest actresses in history, even if today her name is not that known anymore. However, the film does not do her justice as it never delivers a convincing crime story or really well-written character development. It is all a bit too absurd and over-the-top for my taste, especially the showy ending. Thumbs down and I do not recommend the watch.","user":"Horst_In_Translation","rank":[1,3]}]