[{"title":"A story of a mystical land in the far distant future.","rating":6,"date":"6 September 2007","review":"This is one of the most brilliant movies ever made. Though the film alters in tone quite often from dark and moody to light and whimsical, it's one of my all time favorite movies. It's Ralph Bakshi's first film aimed at children, but it's actually very intense, violent battle sequences, some mild adult language, suggestive material, and some dark themes that are more suited for older audiences. It's a story of Avatar and Blackwolf, two wizard brothers. Avatar rules the peaceful kingdom of Montagar with wisdom and magic, while the evil Blackwolf rules the dark land of Scortch with technology and war.<br><br>It's a great combination of science fiction and fantasy set years into a strange post apocalyptic future where broken tanks, guns, and Nazi propaganda are regarded as ancient artifacts. Wonderful supporting characters include Weehawk, a courageous and cynical elf, Elinore, a young fairy princess whom Avatar is in love with, and Necron 99, a robotic assassin who is turned into a good robot named Peace. This movie has a great deal of symbolism and is very thought provoking, it deals with the power of propaganda and the dangers of the over reliance on technology.<br><br>I was impressed by the surreal and creative animation, and I was mesmerized by the mystical and otherworldly music score. The film's climax is brilliant and fits the overall tone of the film. Treat yourself to a symbolic retro-future style film loaded with psychedelic animation, memorable characters, and a truly wonderful adventure that will transport you to a whole new world set ten million years into the distant future.","user":"desotowright","rank":[24,27]},{"title":"Surprisingly good","rating":10,"date":"26 October 2009","review":"I like Ralph's work. But was kind of unsure about Wizards. Many reviews said the story makes no sense and the film is amateurish. Okay, after watching the thing... let's make things clear:<br><br>1. The story DOES make sense. You just have to watch the film several times, very carefully.<br><br>2. The animation is quite good. For you all who likes perfection (are you sure you even know the meaning of the word?), in \"making of\" Ralph himself states he does not care about cleanliness, as long as a movie has soul.<br><br>3. About elves with Brooklyn accents. Have you ever seen an elf??? Do you know how they speak? Or do you think they come from Wales exclusively?<br><br>4. I said everything above. ^","user":"ManWithGoodTaste","rank":[17,21]},{"title":"Underrated","rating":10,"date":"23 June 2000","review":"Ah, Wizards.  Now this is a movie that newsgroups love to pick apart.  But look past it's cheapness and it's technical flaws, and you'll find an underrated gem of animation.  Although oddly structured (our protagonists don't set off on their quest until about half an hour into the movie) and weighed down with exposition, Wizards tells a good story, the art is excellent, and it has one of the coolest animated battles I've ever<br><br>seen... think Ralph Bakshi does Braveheart.","user":"Snow Dog-2","rank":[37,52]}]