[{"title":"Best Of The Worst","rating":12,"date":"12 July 2004","review":"Uninvited must surely rank as one of the baddest movies ever made. And in the same time it's also one of the most entertaining Horror/ Or-whatever-you-wanna-call-it-movie. Everything that can go wrong will go wrong. it simply has everything. A small orange cat which has a monster inside, very bad special effects (Small toy boats, handpuppets, badly coloured blood to name a few. And then there's of course the bad acting, very ridiculous storyline and so forth. Still it's entertainment value is just over the edge. So all in all this movie mixed with a bad hangover, some beers and good friends, it's an unforgettable experience. 5 out of 6 stars..","user":"Lockjaw80","rank":[23,26]},{"title":"Mutant Moggy Massacre!","rating":4,"date":"25 August 2000","review":"This film virtually evades falling into any type of horror genre you could think of: it's part sci-fi, part slasher, part comedy!!!<br><br>A fluffy house cat escapes from some random laboratory and is adopted by two bimbos who've been invited to cruise down to the Bahamas with mobster Alex Cord and take the cat with them for good luck. Said kitty has some kind of rat-bat thing living inside it that emerges when kitty gets pi***ed off and then shreds anyone who comes too close - including henchmen George Kennedy and Clu Gulager!<br><br>It's pretty funny stuff with a typical sequel-friendly ending (that was thankfully never taken up) and some really cheesy moments. Only for the voyeurs of crap cinema. I kinda liked it.","user":"Angelus-16","rank":[8,8]},{"title":"This cat coughs up more than just fur-balls.","rating":5,"date":"12 August 2017","review":"A really contrived set of circumstances leaves a group of fun-seeking Fort Lauderdale spring breakers stranded at sea on a luxury yacht with some desperate criminals and a mutated killer cat for company.<br><br>Uninvited is, to be completely honest, a total mess of a movie, with a ridiculous set-up, an incredibly unconvincing monster, and moments of utter tedium. On the flip side, it frequently enters 'so bad, it's good' territory, features a pair of extremely hot '80s babes (Clare Carey and Shari Shattuck, who spend most of their time in skimpy bikinis), and chucks in some reasonable gore (including some nifty 'erupting veins' bladder effects), making it one not to miss for fans of Z-grade trashy schlock.<br><br>Try not to laugh whenever the moth-eaten moggie hand puppet barfs up a rubber parasitic mutant twice its size!! Marvel as buff beauty Bobbie (Carey) performs an unenthusiastic aerobics routine!! And wonder in incredulity at how Oscar winner George Kennedy wound up appearing in such tacky crud.<br><br>4.5 out of 10, generously rounded up to 5 for Clu Gulager's goofy teeth and bottle glasses, and that really bad sinking model yacht at the end.","user":"BA_Harrison","rank":[5,5]}]