[{"title":"Oh ! the Horror! the Horror!","rating":6,"date":"20 February 2005","review":"Very cheaply made film by Director George Romero about a virus, known as Trixie, that has somehow leaked out in a small town in Western Pennsylvania. The military quickly comes, assesses the situation, and then implements martial law. This is a very thought-provoking film and has some clever dialog and direction here and there. The biggest problems arise with Romero's virtually absent budget. We have a cast of amateurs, some moved on to star in other films particularly by Romero. Richard Liberty as Frankenstein in Day of the Dead being the most noteworthy. Despite not having any star power, the cast for the most part does a decent job notwithstanding. But the settings, although very \"realistic,\" just don't create a real sense of fear for me or believability. I wonder what this film might have been with a budget double the size. If you can get past the minuscule budget, you will find an interesting film here. A film I think that has some real issues at hand even now. The things Romero does do well is create suspense based on the feelings of time being an enemy and make some scathing social commentary on the nature of war, science in war, and apocalyptic threads concerning the way rules are all thrown out when faced with doomsday.","user":"BaronBl00d","rank":[41,52]},{"title":"A terrific low budget paranoid thriller!","rating":16,"date":"16 January 2004","review":"Romero's zombie classics 'Night Of The Living Dead' and 'Dawn Of The Dead' are two of the best horror movies ever made, but they really cast a huge shadow over his career. Romero made two movies in between that are seriously overlooked, the fascinating character study of a vampire(?) 'Martin', and 'The Crazies', a paranoid thriller in a similar vein to the Dead movies. While not actually a zombie movie as such anyone who enjoys NOTLD or DOTD will find much to admire here. The budget is very low so the production values sometimes leave a bit to be desired and the acting is variable, but overall I think it's a terrific movie with some interesting echoes of both NOTLD and the Vietnam war. Will MacMillan (David) and Lane Carroll (Judy) aren't familiar to me, and neither is Lloyd Hollar who plays the Colonel in charge of the quarantine (he's very good), but cult fave Lynn Lowry ('Shivers') plays space case Kathy, her Dad (Richard Liberty) will be recognized by anybody who has seen 'Day Of The Dead', and David's 'Nam buddy Clank (Harold Wayne Jones) went on to appear in Romero's 'Knightriders'. And then there's the wonderful Richard France playing a similar character to the one he would memorably play in DOTD, an outraged scientist. 'The Crazies' pretty much flopped back in the 70s but looking at it now restored for DVD it's obviously one of Romero's best and a must for any horror buff. The commentary track by Romero and William 'Maniac' Lustig is also highly recommended as it offers lots of insights into the highs and lows of low budget film making.","user":"Infofreak","rank":[44,58]},{"title":"Unsettling in a very realistic way.","rating":8,"date":"10 January 2008","review":"After the success of his classic Night of the Living Dead (1968), horror master George Romero followed up with this low-budget thriller.<br><br>Airplane crashes outside of a small Pennsylvania town and unleashes a bio chemical substance that turns the locals into murderous psychotics. The government steps in, but only makes things worse... far worse.<br><br>George Romero's films have long been known for their violence, disturbing nature, and social commentary and this early film is no exception. The Crazies has exciting action wrapped all in a thought-provoking and unsettlingly believable story. There's plenty of moments of gore and a number of scenes that are quite horrific (burning preacher anyone?). Romero's direction is nicely done, providing tense atmosphere and using the rural locations of Pennyslvania well.<br><br>Cast-wise some of the performances of this film seem a bit forced, but the performers do manage to hold it together. Harold Wayne Jones, Will MacMillian, and Lloyd Hollar are the best stand-outs.<br><br>While The Crazies is often forgotten among the horror films of the 70's, it's a good film from a great director. A must for Romero fans.<br><br>*** out of ****","user":"Nightman85","rank":[20,26]}]