[{"title":"The Naughty Nineties (1945) ***1/2","rating":8,"date":"19 July 2005","review":"This is the film to see if you're fairly new to Abbott and Costello, or if you just want to see a whole bunch of their best routines strung together for merry fun and entertainment! It's an easy 76 minute ride on a cheerful riverboat as Bud plays a ham actor and Lou is his zany assistant. The boat's captain is none other than dear old Henry Travers, best known from IT'S A WONDERFUL LIFE. When the kind-hearted Captain Jack gets swindled by a trio of crooked card sharks, they gain three quarters' possession of his ship and try to turn it into a rigged gambling operation. It's then up to Abbott and Costello to help Jack get it back.<br><br>It's nice to see A&amp;C in a costume \"period picture\", and the setting on the traveling riverboat is perfect. Lois Collier makes a beautiful vixen, and Joe Sawyer (who starred with the comedy team in other films) makes the quintessential mean guy who keeps getting foiled by the boys. There are a few little songs, but this time they fit nicely into the air of the proceedings and are never overlong.<br><br>But best of all, THE NAUGHTY NINETIES packs more funny routines into its short running time than you can count: Lou tangles with a real bear thinking it's only Bud in costume; Costello mimics Joe Sawyer as a mirror while Sawyer tries to shave; Lou becomes a punching bag during Sawyer's violent nightmare; Costello keeps throwing back every fish he catches to snag an even bigger fish; and on and on they go. But two of the very best gags of all are incorporated into this film -- the first is a classic bit of business where Costello misinterprets stage directions from Abbott, as he tries to sing \"My Bonnie Lies Over the Ocean\", and the grand highlight is the famous \"Who's On First\" routine - complete and perfectly rendered in this outing. It was reportedly done in two takes because the crew could not keep from laughing. Listen closely and you can hear them trying not to break up. ***1/2 out of ****","user":"JoeKarlosi","rank":[8,8]},{"title":"\"This, I must tell.....to the General.\"","rating":10,"date":"12 July 2005","review":"What can I say about this movie? I introduced it to my cousin when we were both a bit younger and we were on vacation together. We were both in an Abbott and Costello craze at the time and, over the course of the trip, we probably watched that movie upwards of thirty times. It was great! Easily my favorite of their many films. The film consists of hilarious routine after hilarious routine which occur around a central plot. Three crooked gamblers cheat an honest Riverboat Captain out of 3/4 of his ship. It's up to Bud and Lou (a ham actor and his dimwitted assistant) to get it back. The routines keep on coming with the mirror routine, the catfish, Lou as the \"little Indian\", My Bonnie Lies Over the Ocean (Hilarious!!), 33 at the roulette table, bird shooting Lou, the out of control ending chase, and of course the full length \"Who's On First?\" just to name a few. The crew couldn't even contain their laughter during this routine. Listen for them chuckling! The many gags throughout don't hinder the plot of the movie, only enhance it. The music and classic atmosphere of \"Nineties\" also adds a great deal to the film and gives it that \"feel good\" vibe which makes it so special and easy to enjoy time and time again. This is the perfect film to introduce anyone to this great comedy team. The boys are in top form here, and I recommend this to A&amp;C fans, classic comedy fans, comedy fans, movie fans, music fans, and to people who just want to enjoy an evening of fun and laughs. Sit back and enjoy!","user":"cyran1031","rank":[13,15]},{"title":"Abbott and Costello on the Showboat","rating":8,"date":"3 February 2006","review":"It's not surprising that Abbott and Costello eventually got to do a movie on a showboat. Remember it was only 8 years earlier that Universal Studios did their classic version of Showboat and I'm sure that Carl Laemmle, Jr. wanted to take advantage of the set that was still there.<br><br>The Naughty Nineties in fact take whole characters from the Showboat plot. Henry Travers's character of Captain Sam is a total ripoff of Captain Andy and Alan Curtis and Lois Collier make a passable nonsinging Gaylord Ravenal and Magnolia Hawkes. Collier sings, but there are no classic duets like in Showboat. And Curtis's character is a riverboat gambler like Ravenal.<br><br>That being said the plot such as it is involves Rita Johnson and her two associates, Curtis and Joe Sawyer, gaining possession of Henry Travers's showboat with which they then set up some crooked gambling to make a quick profitable kill.<br><br>Abbott and Costello are part of the Showboat crew. Abbott is an actor in the Victorian tradition and Costello is as usual a lovable all around klutz that Travers must be keeping around for laughs.<br><br>If it's laughs Travers wants, he's made a sound investment because the boys do provide the public with plenty of that. The Naughty Nineties is famous as the film they did their classic Who's on First baseball routine. It had been done previously in their debut film, One Night in the Tropics, but in an abbreviated form.<br><br>Actually there is one routine involving poor Lou as he thinks he's eating a cat, I mean the feline type cat.<br><br>Joe Sawyer joins a list of otherwise serious actors like Douglass Dumbrille, Lionel Atwill, and Lon Chaney, Jr., who got in on the comedy with the boys. Sawyer does his own version of the famous Niagara Falls routine involving him sleepwalking and he looks like he's having a ball doing it. Sawyer makes a perfect foil for Bud and Lou's monkeyshines.<br><br>And I think the audience will enjoy it as much as Joe Sawyer.","user":"bkoganbing","rank":[6,6]}]