[{"title":"A Great Suspense in One of the Best Performances of Mary Steenburgen","rating":8,"date":"18 September 2010","review":"In New York, the unemployed actress Katie McGovern (Mary Steenburgen) is invited to an audition to replace the actress Julie Rose that had a nervous breakdown in the middle of a filmmaking. She gets the job and travels with Mr. Murray (Roddy McDowell) to a remote manor upstate to meet the producer Dr. Joseph Lewis (Jan Rubes) that prepares footage with a test to be sent to the director. She is lodged in the mansion but when Katie sees her driving license burning in the fireplace, she finds that all her documents and credit cards are missing from her wallet and the telephone line is actually cut off the wall. Sooner she finds that she was lured by the two men and is trapped in the house in a blackmail scheme. <br><br>\"Dead of Winter\" is a great suspense in one of the best performances of Mary Steenburgen in a triple role. Despite a couple of bad reviews, the theatrical and claustrophobic dark story of murder, greedy, blackmail and a stiletto is one of the best thrillers of the 80's. The few external locations are awesome and unfortunately the VHS does not highlight the cinematography. This is the fourth or fifth time that I watch this film and I still like it. My vote is eight.<br><br>Title (Brazil): \"Morte no Inferno\" (\"Death in the Hell\")","user":"claudio_carvalho","rank":[21,25]},{"title":"A Solid Little Thriller","rating":7,"date":"11 May 2011","review":"DEAD OF WINTER is a fine 1980s thriller with a solid, small cast. The plot centers on a naive actress, played well by Mary Steenburgen, who accepts a job on a rather hush-hush production. She is told that she is to replace a troubled actress who walked off set, however, she never quite makes the set. Instead, she is taken to an isolated mansion where eccentric millionaire Jan Rubes claims to be the film's producer. Mary does everything Rubes and his assistant, Roddy McDowell, ask of her because she views this as her big break.<br><br>But things aren't what they seem in the mansion. With a blizzard raging outside, Steenburegn is essentially trapped indoors with two men she hardly knows who may or may not be working on a movie. Mary makes a few shocking discoveries while she wastes time in the mansion, locating photographs of a dead woman that Rubes claims to be the actress she is to replace. Mary and the deceased actress bare a striking resemblance and as time rolls along, she feels that their machinations are devious and that her life is in danger.<br><br>STORY: $$$ (The story doesn't really offer anything new. There are a few moments when you'll ask why Mary's character does the things that she does, but all in all the script isn't too bad. The screenplay builds enough terror and offers jolts in the right places. Also, from the beginning of the film, we know Mary Steenburgen's character is desperate so her going along with the game seems justifiable).<br><br>ACTING: $$$$ (Mary Steenburgen essentially plays three roles in this film: the main character, the murdered actress and the murdered actress' sister. She does a fine job in all three roles and effectively turns off the naive aspiring actress role when she has to play the calculating sister of the dead thespian. Roddy McDowell is a treat as always in his role as Jan Rubes' sidekick and Rubes, confound to a wheelchair, is exceptional is his role of eccentric man of means. When he chases Mary up the stairs, walking for the first time in years, he'll give you the willies).<br><br>NUDITY: None","user":"BloodTheTelepathicDog","rank":[11,12]},{"title":"A wintry tale that is guaranteed to give you the shivers...","rating":6,"date":"10 October 2006","review":"Once upon a time (1945 to be exact) there was a B-film from Columbia called MY NAME IS JULIA ROSS starring Nina Foch, Dame May Witty and George Macready. It caused quite a stir even though it played the lower half of double bills and lasted a mere 65 minutes.<br><br>DEAD OF WINTER is rather transparent in borrowing from MY NAME IS JULIA ROSS (the heroine's name is Julie Rose, for example), and it has taken the original material, expanded it with some clever additional plot lines, taken the Cornwall atmosphere and transported it to wintry New England for a weather-beaten effect, and turned out a smart little thriller that will give you plenty of winter chills no matter what the temperature is outside.<br><br>It's another one of those tales where nothing is what it seems. A pretty young actress (MARY STEENBURGEN) is a down on her luck gal who accepts the offer of a film test from a producer (RODDY McDOWALL) who invites her to his secluded mansion where the test will take place. Sure, it's an unbelievable plot contrivance, but that's part of the fun. Nothing is to be taken too seriously from this point on.<br><br>When a series of rather unpleasant incidents take place, the woman realizes she is in a trap, but neither she nor the audience understands why she is there and what the purpose is of keeping her prisoner.<br><br>STEENBURGEN is excellent as the frightened woman (who should have had more common sense than accepting such an offer), and McDOWALL's polite cat-and-mouse game with her is fascinating as it unfolds. It's a creepy film, filled with authentically wintry atmosphere and it builds toward a surprising and violent climax.<br><br>Under Arthur Penn's direction, this expanded version of the B-film is every bit as cleverly plotted and written, no matter what some of the other commentators here have said. It's an atmospheric mystery that's guaranteed to give you some satisfying wintry chills--and then some.","user":"Doylenf","rank":[24,31]}]