[{"title":"Franju's Third Film","rating":6,"date":"23 May 2017","review":"When he learns his days are numbered, old count Hervé de Kéraudren decides to hide in a secret alcove and to die there, just to annoy his heirs. As a result of his body not being found the latter will have to wait for five years until they can inherit the count's money.<br><br>The actors, for the most part, are not big names and may not be recognizable to American audiences. Star Pierre Brasseur had previously appeared in Georges Franju's \"Eyes Without a Face\". His co-star, Pascale Audret, was less well-known in film, but happens to be the mother of Julie Dreyfus, who appeared in the Quentin Tarantino films \"Kill Bill\" and \"Inglourious Basterds\".<br><br>The marketing folks describe the plot as a delightfully playful romp through Agatha Christie territory, which is quite accurate with some nods to \"Ten Little Indians\", among others. Some critics have said it is a \"rehash\" of Christie, though this is not quite fair as the references are tongue-in-cheek. The script comes to us from the writing team of Pierre Boileau and Thomas Narcejac, of \"Les Diaboliques\" and \"Vertigo\" fame.<br><br>If you know Franju, you obviously know \"Eyes Without a Face\" and have probably seen \"Judex\". But this one might have escaped you. Indeed, reviews at the time were not favorable and it seems to have gone into obscurity. Current reviews do still warn that the characters are generally flat, and the film really earns its merits on the plot and direction rather than from any deeper message or connection. Perhaps due to Franju's posthumous reputation, \"Spotlight\" is viewed more favorably today than ever before (and rightly so).<br><br>The Arrow Video Blu-ray is a bit light on material, which is unfortunate because they really scooped up a great title here that would have been a nice fit for Criterion. But we do get a vintage production featurette from 1960, shot on location and including interviews with Georges Franju and actors Pascale Audret, Pierre Brasseur, Marianne Koch, Dany Saval and Jean-Louis Trintignant. An audio commentary or video essay would have been icing on the cake, but sometimes just having the cake is enough.","user":"gavin6942","rank":[9,11]},{"title":"Sound and light","rating":4,"date":"4 March 2006","review":"Georges Franju's best works remain his earlier ones:his shorts (\"le Sang des bêtes)and his two first efforts \"la Tête contre les Murs\" and \"Les Yeux sans Visage\" (the latter's influence was considerable ,notably on Amenabar's \"abre los ojos\"(and \" Vanilla Sky\", its mediocre remake ).<br><br>\"Pleins Feux sur l'Assassin\" is \"eyes without a face\"' s follow -up.As you do not change a winning team,Boileau-Narcejac (even if their names are not widely known,everyone knows \"Diabolique\" and \"Vertigo\" ,both in the IMDb top 250, which were initially their novels) who adapted Jean Redon's novel in Franju 's precedent effort,wrote here the screenplay which is an original and which was never released ,to my knowledge ,as a novel.<br><br>It's moderately successful: Boileau-Narcejac ,as they did in \"D'Entre les Morts\" (\"Vertigo\") ,tried to mix thriller and supernatural .PLus Agatha Christie's whodunit.<br><br>An aristocrat dies but his heirs do not know where his body is .(but the viewer does, for the first minutes -Pierre Brasseur's short silent part- shows the old man dying).And ,which is worse,they cannot inherit ,because the body must be found ,or they would have to wait several years.In order to maintain their relative's desirable property,they set a Son et Lumière show up,based on an old legend from the Middle Ages: two lovers were caught in the act by the woman's husband and tragically died.(something like the old folk song \"Matty Groves\")<br><br>But it seems that someone is slowly doing away with the heirs ,and the culprit might be one of them.And the legend of long ago could repeat itself.<br><br>It is entertaining but it's a far cry from \"les Yeux sans Visage\". Franju was not to reach such heights afterward:his remake of Feuillade's \"Judex\" had its moments and both \"Thomas L'Imposteur \"and \"Thérèse Desqueyroux\" were estimable works which owed a lot to thespian Emmanuelle Riva.<br><br>Franju could have become the French Roman Polanski.","user":"dbdumonteil","rank":[10,13]},{"title":"A decidedly minor affair","rating":6,"date":"13 January 2018","review":"Closer to Agatha Christie than to Boileau-Narcejac who wrote the original story and collaborated with Franju on the screenplay, \"Spotlight on a Murderer\" is a decidedly minor affair, entertaining for what it is but unlikely to set the cinematic world on fire. For starters, it's got a fairly ridiculous plot, (even Christie would have balked at this one); an old count, about to die, hides himself away in a secret room in his chateau so that his relatives won't find his body and will have to wait 5 years for their inheritance. Naturally the corpses soon start piling up. Poiret or Miss Marple would have sorted it out in no time.","user":"MOscarbradley","rank":[2,3]}]