[{"title":"A comedy, a romance, a satire, a jewel!","rating":10,"date":"20 January 2006","review":"Years ago I thought I was familiar with all of Billy Wilder's movies and as I thumbed through what might have been an old copy of Playboy, perhaps a Sex in the Cinema article, I came across a picture of a nude Juliet Mills and Jack Lemmon sitting on the rocks in an unknown Billy Wilder film, and was determined to one day see that film and much more of the Nanny from The Nanny and the Professor. VCRs were just coming on the market, so I had to wait a few years till Cinemax showed it in the early morning. I stayed up most of the night to satisfy my prurient interest and what I ended up with was a film I didn't want to end, a tune that played over and over again in my head for days, and one of my most favorite movies.<br><br>Yes, this movie is a comedy, sometimes a very black comedy, and sometimes a satire filled with irony. Yes, it's a romance, all about a wonderful romance that sparks up between two seemingly opposite people in the strangest of places at the strangest of times under the strangest of circumstances, the way romance quite often does. And at times there's sadness and pain to tug at your heart. It's all about discovering who you really are when you've lost your way in all life's confusion, and also about perhaps being better than your parents when you get older and more like them.<br><br>Lemmon is the consummate cad, Juliet Mills the most charming Englishwoman to grace a celluloid comedy, Clive Revill is perfect in his most Oscar-deserving role as the hotel manager Carlo Carlucci, the Italian cast members never fail to entertain, and the music is as catchy and memorable as any Bernstein or Tiomkin or Goldsmith score. The movie may be 2-1/2 hours long, but the time passes quickly as Lemmon and Mills rediscover love and youth and passion, and I always find myself wishing that I could see the two lovers returning a year later like their parents.<br><br>Billy Wilder may have given us dramatic gems like Stalag 17, Double Indemnity, The Lost Weekend, and Sunset Boulevard, given us comedic gems like Seven Year Itch and Some Like It Hot, and romantic gems like The Apartment and Irma La Douce, but it wasn't till the end of his career that he could take qualities from all of those and give them a magical, lyrical feel and atmosphere and come up with a jewel like Avanti!","user":"hondo551","rank":[74,78]},{"title":"A bittersweet masterpiece","rating":10,"date":"15 May 2007","review":"So much has been said about the plot of Avanti it seems pointless to go over the synopsis again- but I can say although I am a lover of Horror films, Thrillers and Westerns- it is Avanti that is my favourite film of all time.Avanti is gorgeous to look at and features a beautiful music score. How I wish I could obtain a soundtrack of this delightful score. The scene when Pamela Pigott ( Juliet Mills ) tours the city on a horse drawn carriage and later running from her new found admirers is beautiful with the music so perfect.Also when Pamela and Wendell ( Jack Lemmon ) have their evening meal together , it is again a beautiful music score. Jack Lemmon as the bombastic Wendell Armbruster is as always great. Juliet Mills as Pamela Pigott looks far too gorgeous to be ridiculed by Armbruster but she shines in her finest ever role. However for me the film is stolen completely by Clive Revill as the hotel manager- what a sublime performance. Watch his every movement, his every expression, his delivery of every line.It is a captivating performance, totally exquisite. Clive Revill is an actor sorely neglected by the film world.Billy Wilder's film is so very neglected and it's a pity as this is the perfect film. Watch the beautiful, poignant sequence at the mortuary as Pamela and Wendell view the bodies of their mother and father respectively. And again watch Clive Revill alongside Lemmon and Mills- acting with only movement, expression and not a word. The lighting in this scene is so wonderful, it is dark and depressing with the exception of a shaft of sunlight penetrating the smallest of windows. Wilder manages to wring excellent portrayals out of even the most minor of characters. Watch Avanti and savour the acting, the music and the scenery.","user":"zebulonguy","rank":[55,59]},{"title":"Come In! -- And Enjoy an Enchanting Romantic Comedy!","rating":10,"date":"4 October 2004","review":"Billy Wilder &amp; Jack Lemmon didn't go straight for the belly laughs in this departure from their usual all-out-crazy comedies. Fans of the masters will be pleasantly surprised by this delightful romantic comedy, which captivates the viewer from the very start. Mezmerizing backdrop music plays as though secretly staged by Cupid standing by to assure that lovebirds will find one another. Lemmon plays the son of a mega-wealthy American business man who had to drop everything to fly to Italy in order to claim the father's remains after a car accident. En route to his late father's \"final stop\", Lemmon runs in to a persistent young woman, who turns out to be the daughter of the woman with whom the father had had a lengthy affair, and who was found lovingly slung around his neck as they both died in said accident.<br><br>The situation seems rather awkward at first, but eventually Lemmon and the young woman begin following into the exact same steps their departed parents had done years earlier. The picture is completed by a brilliant supporting cast of hotel personnel and colorful locals. The performance of the multi-talented and ever-present-minded hotel manager was Oscar worthy.<br><br>Listening to the testimony of all people asked, Lemmon learns that his late father and his \"friend\" were viewed as Royalty, nothing less than figures from a fairy tale. The concluding scenes are the final touches to a most enchanting romantic comedy, one that has few rivals in its category. Billy Wilder has done it again. What he missed in big laughs, he made up in many magic moments and gentle pressures to your tear glands. One of the very best out there. Belissima!","user":"mdm-11","rank":[47,52]}]