[{"title":"Final Victory in Might or in Love? Unique, profound, unforgettable movie","rating":10,"date":"9 July 2006","review":"Father Gabriel: \"If might is right, then Love has no place in this world...\"<br><br>The movie by Roland Joffe was not popular in my country when it was released since such movies were censored by the communists. When, however, the situation changed in 1989, I remember that I saw THE MISSION for the first time on Polish TV in 1995 as a part of cinema's 100th anniversary celebration. The movie moved me so much that I have come back to it several times since then. Each time I see it, I find something new in the film. Therefore, I consider THE MISSION one of the very best films ever made, a film where history meets single individuals, where sadness is conquered by joy and disbelief and skepticism by profound thoughts on humanity.<br><br>The content of the film, though historical, applies perfectly to modern times. The universal struggle of two spirits, the one of might and the one of Love, has always been noticeable wherever and whenever people live. Let us look briefly at the gist of the content: the Jesuits build a mission in the core of a jungle in South America, they understand the heart of the Gospels: Love without looking for reward. Yet, the politics of the conquerors (Spaniards and the Portuguese) steps in and destroys the mission... However, not everything dies even though goodness seems to be conquered... This story, presented here in a condensed way but developed in the film is so powerful that it leads to reflections: what, in fact, reigns in our lives; why good people have to suffer, why we are forced to do what we hate, it is so effortless to destroy while to build requires so much strength, why the world turns our good deeds into evil, etc. This aspect is the pearl of the film and the feast for the soul even though such thoughts require some courage from an individual. I reflected on the fact if I am willing to support the weak or if I rather choose might which is my master I attempt at in my actions? It's strange but we will never get to know our personalities completely... And that is what the film also shows. Altamiro (Ray Mc Anally), for instance, is a person of different psychological states hard to evaluate.<br><br>The performances are exceptionally powerful which makes THE MISSION a very nice piece of film art. Jeremy Irons gives a very powerful performance as Father Gabriel expressing all values a good Christian should own: goodness, gentleness, patience, courage, and purity. He has this blink in his eyes that makes his portrayal particularly memorable. Robert De Niro... I would say frankly that this is his very best acting. People concentrate on different films when they hear of De Niro's performances, particularly in Michael Cimino's THE DEER HUNTER (1978) or in Martin Scorsese's CAPE FEAR (1991). Some of them skip THE MISSION. Yet his portrayal of Rodrigo Mendoza is a masterpiece in its own. This role is difficult to portray since Mendoza is a man of two contradictory spirits: from a slave trader to the devoted Jesuit. Nevertheless, De Niro does a marvelous job. One moment caught my attention from the first view of the film: Mendoza's death and this nostalgic look at Jesus in the Eucharist (even while writing about this moment a tear appears unintentionally in the eye). Ray McAnnally portrays Altamiro, a bishop who is forced to do what he actually does not intend to. He seems to be touched by the mission and in spite of that, he finally allows for slaughters. In the final shot, he expresses one thing powerfully: a face of a man whose conscience will forever suffer. \"Thus we have made the world...thus have I made it,\" which are his words said at the end by him clearly show what kind of person he was.<br><br>Another powerful aspect of the film is music. Ennio Morricone is famous for having written music to many films but here, in THE MISSION, he did something absolutely sublime. I bought a CD listening to music alone and it was an unforgettable experience for me. People who heard it and did not see the film asked me where I got such wonderful tunes. Indian rhythms combined with Christian spirituality and ecclesiastic chorus - UNFORGETTABLE! I promise you that having seen this film, you will never forget, among other things, these lovely tunes.<br><br>The filming locations, which obviously constitute an additional aspect in any film, add a thrill and authenticity to everything. It is hard to imagine other places in THE MISSION. The movie is shot mostly in the places where the historical events took place. We see the mighty Iguazu waterfalls, the jungle where Guarani Indians live, the city of Cartagena in Colombia as well as the hills of the Brazil-Argentinian border.<br><br>What more is there to say? I think that most readers will agree with me that THE MISSION is a masterpiece, a film that opens people to new horizons of understanding the profound thoughts that are there in our lives if we are willing to reflect on them or not. Speaking religiously, Christ has once died on the Cross but then all was conquered by Love.<br><br>The final scene gives an answer to Father Gabriel's thought that I entailed at the beginning. A silent sunny day in the jungle... we see a small group of Indian children who have survived the destruction. A little girl picks up a violin that she finds in the river and they begin to row a small boat towards the future... <br><br>Father Gabriel, you are right. It seems that Love perhaps has no place in this world and might may seem to be right but it is always Love that wins since \"the spirit of the dead will survive in the memory of the living.\"","user":"marcin_kukuczka","rank":[20,20]},{"title":"A revisit is long overdue","rating":12,"date":"12 June 2004","review":"After hearing a quick clip from the soundtrack recently I decided to have another look at 'The Mission' which I hadn't seen for more than ten years. Interesting viewing in these days when epics abound: Lord of the Rings, Gladiator, Troy etc.<br><br>The first thing that struck me was the intelligence of the script which often seems an afterthought in today's big budget jobs. Robert Bolt weaves an intriguing web of characters; mercenary, slavetrader, starcrossed lover, papal emissary and man of faith. The passion of Robert de Niro's Mendoza beautifully contrasts the quiet firm conviction of Jeremy Irons' Gabriel. And the moral dilemma facing the Catholic Church, whether to abandon influence abroad for the sake of power at home, is ably brought to life in the tortured mind of Ray McAnally's Altamirano. This man sent from Rome by the Pope himself has the power of life and death over the Guarani Indians and the Jesuit priests who have dedicated their lives to Christian service in the deepest regions of the South American rainforest.<br><br>The film isn't perfect by any means: I would have liked better representation of at least one Guarani character but the integrity of Joffe's direction and Chris Menges' spectacular camera-work make this one film you have to see. And there's that lovely soundtrack by Ennio Morricone.<br><br>We may be more sophisticated these days in terms of technology, sound engineering and special effects but the lesson from 'The Mission' for today's directors has to be: it's the story, stupid.","user":"lindalinda","rank":[84,92]},{"title":"Awe-inspiring to see on the big screen","rating":10,"date":"15 April 2009","review":"I had the good fortune to see The Mission on the big screen in 1986 when it was first released. I went into the theater knowing only the title, the two lead actors, and that it had something to do with South America. Two hours later I was a puddle of tears, both from the subject matter and from the knowledge that I had just witnessed a cinematic masterpiece. It is perhaps the most intelligently spiritual film I've ever seen. The cinematography is gorgeous throughout, the settings are stunning, the acting is top-notch across the board, the musical score is breathtaking, and the screenplay is brilliantly eloquent. Roland Joffé did a fantastic job directing The Killing Fields, but this one is even better. I just watched it again on DVD, and nearly 25 years later, the film has not aged or lost any of its power. Still one of the greatest and most underrated films of all time.","user":"gregorgeous","rank":[36,38]}]