[{"title":"One of the very best Sci-fi Family Movies of the 80's","rating":10,"date":"9 June 2004","review":"I had seen this movie on VHS back in the 80's and I now have children and just watched this movie with them on DVD. The film still has presence and the special effects are still quite good even considering they are now near 20 years old. Very impressive and my children are now complete fans of the movie. <br><br>If you have never seen this film, I would recommend it whole-heartedly for the entire family. If it has been sometime since you watched this film I would say check it out, well worth a return visit.<br><br>One thing I have to mention is the joy I was receiving just watching my children (ages 4 through 8) experience this movie for the first time. Even after all of the Hi-tech movies they have seen in recent years this movie was still able to capture their attention, hold it and entertain just as well as anything in recent memory (such as Spiderman, Hulk or even Spy Kids).<br><br>My children wanted to re-watch it immediately after it ended, it was that good in their (short attention span) minds.<br><br>5 out of 5 stars from me and mine. <br><br>**Although regarding the DVD transfer, it could have used some extra's, even a trailer from the original film, however there were none, simple menu access and set-up options only, enjoyable none-the-less.","user":"daddydow","rank":[76,85]},{"title":"Where did Disney come up with this?! It's (gasp) original!","rating":14,"date":"14 September 2003","review":"You know the drill: 12 year old David falls into a ravine in the woods and discovers when he wakes up that he's been missing for eight years.  He also discovers that he's hearing voices that seem to come from a mysterious craft housed in a NASA hangar.<br><br>My two cents worth: In a time when all the live action Disney movies seem to be a variant on \"I was normal but just discovered I am/have just been mistaken for royalty/merperson/rock star/leprechaun/etc., this movie from the 1980's is a real breath of fresh air.  <br><br>The scenario, waking up and discovering that everything except you has changed, and knowing you'll be somebody's idea of a guinea pig for the rest of your life, is instantly relatable and creepy, whether you're a kid or an adult.  The kid fainting, the change in the two brother's relationship due to the age flop, parents trying to protect their son, government trying to exploit the kid's knowledge, everyone's reactions to the situation are all logical and believable.  <br><br>And who hasn't wanted a chance to fly a saucer?  Having Max, the ship's pilot, be a robot was another stroke of brilliance.  So many movies have the aliens flying all the way here to come visit us face to face.  But if we send machines to other planets because it's cheaper than going ourselves, why wouldn't they?  And having him learn about Earth courtesy of a 12-year-old's TV polluted brain was hysterical.<br><br>The movie seems a little dated today; but it's forgivable because, like Back to the Future, it's set so specifically in a certain frame of time (you expect it to look and sound like 1986 because, hey, they keep telling you that's when it is.)<br><br>Recommendations: Back to the Future and Big are the two I can think of that are most along these lines.","user":"AllMT3","rank":[91,103]},{"title":"Fantastic!","rating":10,"date":"20 September 2004","review":"This film is to blame for my over active imagination. Saw it on TV when i was at school and watched it over and over ever since! Though the quality of the film was not something i would have noticed when i was that age, i did notice the amazing special effects (for that era of cinematographic effects).<br><br>The ship design (Steve Austin) is truly inspired (especially when in 'first class manouvre' mode!!) and stylistically has stood the test of time (it could quite easily pass off as futuristic in new films today. Maybe he should have done some more design work(?).<br><br>And my favourite character ... 'Al', the big guy at the service station ('Rusty' Pouch), best bit of acting ever!<br><br>The flight scenes and the concept of flying in a cool spaceship caught my young mind most of all. As i watched it time and time again, the many other factors proved to play a major part of the film. The music score for one is great and for me has become a critical part of the film (I love the 80's synth!)<br><br>All in all, this piece of cinema was very very well thought out, constructed, produced, acted, all fitting together in a film that many films could never achieve.<br><br>Go buy it on DVD!<br><br>E:)","user":"e_imdb-48","rank":[48,56]}]