[{"title":"Yes, it's high noon in space. And what's wrong with that?","rating":28,"date":"28 August 2001","review":"Sean Connery. A man's man, a woman's sex symbol. Good start! Now let's put him on a remote moon of Jupiter. So how many other films have Io as their center of action? Absolutely excellent in combining the effects that were available at the time with a darn good plot. Well overshadowed by the likes of Alien, this is late 70's/ early 80's sci-fi at it's best. No more is the future in space a Utopia, it is a grimy, nasty everyday world where people carry on their sordid business as they ever did. Except there is always a hero; a flawed hero, as is Connery. A personal crusade, a battle almost against the odds (but not unbelievably so, at all) and the true hallmark of a good sci-fi story: That is, the story would work just as well anywhere, any place, any time, as it does in space in the future. What more do you want (Just check out the shuttle landing)? Essential viewing!","user":"ProfessorPeach","rank":[96,108]},{"title":"under-estimated sci fi western,","rating":9,"date":"31 July 2006","review":"After leaving the James Bond franchise in 1971, Sean Connery gave a number of notable performances in films such as The Offense and The Man Who Would Be King but Outland is really the film that started him on the comeback trail that culminated with his Oscar acceptance speech 6 yrs later for The Untouchables. No one seems to recall this but at the time of Outland's release, no one had seen or heard from Connery for a few years and most of the reviews, while not kind to the film for a variety of reasons--chief among them being the fact that most movie critics (at least back then) harbored serious prejudice against sci fi--the main comment was \"It is good to see Sean Connery back in action again\".<br><br>This film has one of the best production designs ever.Phillip Harrison did a superb job. Obviously the look was copped from Alien--blue collar workers in space--but it works remarkably well. I was often reminded of OUTLAND during my seven year prison term; the housing was remarkably similar--as was the company. But I digress...<br><br>Nothing special about the plot-- it's routine cop show or western movie stuff--but who cares? Sean Connery gives a splendid performance and the whole film moves at a nice clip. Very enjoyable.","user":"raegan_butcher","rank":[119,137]},{"title":"Worth a look...a different take on sci-fi","rating":7,"date":"6 August 2004","review":"I remember wanting to see this when it came out in '81, on the heels of sci-fi classics such as 'Star Wars', 'Alien', and 'The Empire Strikes Back'. Of course because of its 'R' rating I could never see it until it came out on video. I found it offered a different take on sci-fi films as it had no involvement with sinister aliens, and the only alien world explored is the Jupiter moon.<br><br>***WARNING! POSSIBLE SPOILERS AHEAD!***<br><br>'Outland' is set on Io, one of Jupiter's moons, in a mining colony. Marshal W.T. O'Niel (Connery) is assigned to the moon colony. Shortly after he arrives he discovers that several miners have been committing suicide in bizarre and ugly ways, such as walking into zero-atmosphere minus a pressure suit. When he investigates he finds that the dead men have been taking an amphetamine-like drug. According to Dr. Lazarus (Frances Sternhagen) the drug enables the miners to go for days without sleep and work at extended intervals, thereby increasing the mine's productivity. When O'Niel follows the dealers' trail he discovers that it leads to the head of the mining operation. These men have no intention of letting O'Niel stop their dirty work, and now the marshal has to watch his back at every turn, as a hit contract is put out on his head. O'Niel also finds that his own men are willing to turn on him...<br><br>***END SPOILER ALERT***<br><br>Like someone else mentioned, the production design does not show space as a shiny, clean environment - space is 'dirty' here. The mining colony looks like a real operation, in a similar way to the way the Nostromo appeared in 'Alien'. Jerry Goldsmith's music also sounds much like the low, sinister tones of 'Alien' which he had written only 2 years before. While it lacks most of the spectacular effects of the 'Star Wars' trilogy it gives a believable sense of the awesome size of space. The story is not unlike a western set in outer space, only that the crime the marshal is trying to stop is drug-dealing as opposed to train or stagecoach robbery. Not a bad movie, not on the scale of 'Star Wars' or 'Alien' but definitely worth looking into.","user":"medic249a2","rank":[30,33]}]