[{"title":"McQueen's Last Stand","rating":4,"date":"4 July 2001","review":"McQueen's last film before his tragic and untimely death from cancer was this minor but enjoyable action comedy based on the exploits of real life bounty hunter Ralph \"Papa\" Thorson.  The small scale, episodic structure and a few plot contrivances sometimes make it feel like a glorified made-for-TV movie (TV veteran Buzz Kulik directed), but Steve is terrific in the role and he's aided by a large and colorful supporting cast.  Plenty of action, along with nice touches of warmth and humor make this more than passable entertainment, especially for fans of McQueen. ** 1/2 stars","user":"G-Man-25","rank":[25,26]},{"title":"Simple but good.","rating":8,"date":"18 April 2003","review":"This, of course, was McQueen's last role.  It is nothing grand, and for the most part there really is no plot, but it is still a rather good movie. This movie revolves around McQueen's character who is a bounty hunter.  This movie shows him go after various people and also shows his home life...which is a bit unique too.  He goes after super big rednecks, small time crooks, crazy guys who blow things up, and one rather dangerous individual.  Someone who he captured in the past also stalks him.  All in all it isn't the greatest movie, but it mixes action and humor well.  Even though McQueen was feeling the effects of his illness during the shooting of this one, he still does a great job.","user":"Aaron1375","rank":[30,32]},{"title":"Something for everybody","rating":11,"date":"11 March 2004","review":"Let me start out by saying I loved this movie! At first I was biased towards this movie, but that quickly changed. I think the director's intention was to make this movie for everbody. For those of you who like action movies it has a grueling scene involving a subway, a parking garage and a child being held at gun point. For those of you who like romance it has a sub-plot involving a woman who is facing pregnancy issues with her husband. For those who like horror movies there is a wonderful end scene that scares the daylights out of anybody breathing! For those who likes comedy there are a few punchlines mixed in plus a scene involving a cornfield a car and a tractor.<br><br>Steve McQueen gives off a great performance as a \"Dirty Harry\" type Bounty Hunter. I have never in fact seen a S. McQueen movie however, upon seeing it, I thought this guy was great. I was a little disappointed to find out that was Steve McQueen's final movie, he could have done a lot more.<br><br>\nThe rest of the cast gave out great performances as well, The actress playing Dotty was very beautiful and had so much presense, she did wonderful.<br><br>10/10 (And I am not always this nice)","user":"kylediede","rank":[15,15]}]