[{"title":"blood soaked western","rating":2,"date":"2 September 2003","review":"One of those \"lost\" films that only shows up on cable once in a while, THE HUNTING PARTY is a blood soaked western that is an obvious response to Sam Peckinpah's THE WILD BUNCH. Made in 1971 by Don Medford and starring a young Candice Bergen, a vicious Gene Hackman, and Oliver Reed with an American accent. This is certainly one of the most violent westerns ever made with slo-mo gunshot wounds and more agony and gore than most horror films. Nihilistic and extreme without hope or redemption. The soundtrack is excellent as well as the photography and editing. The Hunting Party will hopefully be rediscovered on home video soon, or else make sure you catch it on FLIX this month!","user":"lucio@rocketmail.com","rank":[40,44]},{"title":"A Sagebrush Variation On THE MOST DANGEROUS GAME, But Not Quite A Masterpiece","rating":7,"date":"27 August 2010","review":"When you go hunting with Brandt Ruger, you go first-class all the way. But when you steal his \"property\", you sign your own death warrant.<br><br>That is something that a notorious outlaw (Oliver Reed) and his gang have to learn in the worst way possible in THE HUNTING PARTY, a 1971 British/American western that, even by 21st century standards, is still incredibly violent. Reed kidnaps a local schoolteacher (Candice Bergen) in the (now faint) hope that he'll be taught how to read. When Bergen warns him about her husband, he tells her \"It don't matter whose wife you are.\" A fatal misjudgment on his part, for her husband Brandt Ruger (Gene Hackman) is not one to fool around with. While out on a hunting party with a few of his friends, the dictatorial and very abusive land baron learns of Bergen's kidnapping, and thus gets blood in his eyes. And rather than going after game, he and his boys instead go after Reed and his gang, picking them off one at a time with high-power rifles that can hit from a distance of 800 yards. The result is a sagebrush variation of THE MOST DANGEROUS GAME, done with some of the most brutally violent shootouts this side of THE WILD BUNCH and SOLDIER BLUE. And as he is a man driven by extreme jealousy (Bergen is his personal \"property\", whom he physically abuses on more than one occasion), the fact that Bergen is beginning to develop a rapport with Reed now gives him whatever license he feels he needs to kill her as well, though he drags it out for the sheer sadistic fun of it to a very cynical and blood-splattered conclusion.<br><br>There isn't too much doubt that THE HUNTING PARTY was made to take advantage of the \"market\" opened up by THE WILD BUNCH and its director Sam Peckinpah's choreography of violent action, as well the spaghetti westerns of Sergio Leone. The shootouts are extremely bloody, and they clearly mirror those of THE WILD BUNCH in the use of slow motion and quick cutting. Where THE HUNTING PARTY falls short, however, is in a crucial area that Peckinpah knew was vital to his film being successful: the action and plot must be character-driven and made to feel real to an audience. Veteran TV director Don Medford (who, among other things, directed the classic 1961 Twilight Zone episode \"Death's Head Revisited) and screenwriters Gilbert Ralston, William Norton, and Lou Morheim know how to do the Peckinpah-inspired gunfights, but they don't seem to have taken too much time to really delineate any complexities in the three main characters. Bergen is merely a damsel in distress, caught between two men who are basically bastards, one merely semi-controlling (Reed), the other a sadistic control freak of the highest order (Hackman). Absent the complex psychological and character-driven narrative that propelled THE WILD BUNCH to a controversial but well-deserved glory, THE HUNTING PARTY can so easily be tagged, as more than a few critics have done (albeit perhaps too zealously), as an extremely bloody sagebrush shooting gallery in which violence is staged for the sake of violence.<br><br>The film does succeed in giving us good performances from the three leads (notably Hackman, whose role is credibly sadistic to the highest degree); good cinematography done on location in Spain (as a stand-in for Texas); and supporting roles for L.Q. Jones (a member of Peckinpah's stock company); Simon Oakland; Mitchell Ryan; and William C. Watson. And one can't fault the long-distance shooting that occurs, or the way it so ingeniously borrows a great old-world story (THE MOST DANGEROUS GAME) and puts it into a WILD BUNCH-type western format. Had the filmmakers only paid a bit more attention to complex characters and motives here as Peckinpah had in his epic film, however, THE HUNTING PARTY might have been a bit more than a good, if incredibly and graphically violent, post-Peckinpah/Leone addition to a Western genre that was rapidly changing during the late 1960s and early 1970s.","user":"virek213","rank":[14,15]},{"title":"Strangely compelling, despite serious flaws","rating":27,"date":"27 May 2001","review":"I managed to get an uncut version of this rare western, and I thought it was very engaging. Now, I will freely admit that the screenplay is full of holes (like: How does the party know what Oliver Reed's character looks like? Why doesn't Hackman kill Reed when he has the chance? Why won't Reed admit defeat?) which definitely prevent this from becoming the epic, sweeping western it is obviously trying to be. (As well, most of the main characters are written poorly.)<br><br>Yet at the same time, I was immediately hooked and engaged until the end credits started. Though the movie has all of those above faults (and more), there is some really good stuff here. The locations... photography...production values... are all top-notch. And whoa, all of that violence! The bloddy shootouts and sniper attacks give Sam Peckinpah a real run for his money. People who don't like westerns probably won't like this movie, but western fans like myself will likely embrace it, flaws and all","user":"Wizard-8","rank":[34,41]}]