[{"title":"Clichés and wasted opportunities...","rating":4,"date":"24 June 2012","review":"Murders in the Rue Morgue (1971)<br><br>There are so many complex scenes, so many amazing sets and costumes, and lots of moving camera that implies intelligent filmmaking it's a miracle this film came out so wooden. And frankly boring. <br><br>Part of the problem is Jason Robards in the lead--another actor might have pulled off the drama and intrigue anyway. And the leading victim-female is almost terrible--Christine Kaufmann. But the director, Gordon Hessler, I think gets the worst of everyone, and all this apparent money and talent is squashed under bright even light and uninspired performances.<br><br>There are lots of horror film clichés that might be satisfying to some, including just the use of the theater as a set (somewhat like Phantom of the Opera). But some of the clichés are cheezy 1971 versions, like dreamy sequences with double exposures or slow motion, and strange sound effects of choral voices. <br><br>There were enough people who really liked this movie for the director to mades an official director's cut with eleven extra minutes. Well, why not? It's all voluntary, and I'd vote against it unless you are really into the themes here, the actors, or just have a lot of time free and here it is. It's no awful, it's just slow and clunky. And why did they film it with such shadlowless flat bright light? It's a horror film, for goodness sake.","user":"secondtake","rank":[17,20]},{"title":"Boring and Dull Movie with Terrible Screenplay and Wooden Performances","rating":4,"date":"30 August 2014","review":"In Paris, in the beginning of the Twentieth Century, Cesar Charron (Jason Robards) owns a theater at the Rue Morgue where he performs the play \"Murders in the Rue Morgue\" with his wife Madeleine Charron (Christine Kaufmann), who has dreadful nightmares.<br><br>When there are several murders by acid of people connected to Cesar, the prime suspect of Inspector Vidocq (Adolfo Celi) would be Cesar's former partner Rene Marot (Herbert Lom). But Marot murdered Madeleine's mother (Lilli Palmer) many years ago and committed suicide immediately after. <br><br>\"Murders in the Rue Morgue\" is a boring and dull movie with terrible screenplay and wooden performances. There are many clichés; rip-off of scenes and concepts from \"The Phantom of the Opera\" and \"Sherlock Holmes\" and Christine Kaufmann is awful in the lead role. There is one terrible dreamlike scene where Madeleine looks to her dress before jumping into the carriage. My vote is four.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[17,23]},{"title":"A bit of a bad dream.","rating":2,"date":"2 September 2004","review":"Not a straight remake of the classic Poe tale, more an odd mixture of `The Phantom Of The Opera' (Herbert Lom is effectively reprising his Hammer Phantom), `Theatre of Death' and Poe's familiar themes of premature burial, `Murders In The Rue Morgue' is an experiment which does not quite work.<br><br>Partly this is down to Chris Wicking's script, not best known for his narrative clarity, here he  reaches it a new low, with a script obscure in the extreme (at several points it seems to contradict itself).  He is not helped by Hessler's direction, the strengths showed in the earlier `Scream And Scream Again' seem to have disappeared, and replaced by sheer shoddiness (some of the murders are very badly staged).  A more imaginative director was needed to compensate for the script, especially in the case of the repetitive dream sequences which pepper the film.<br><br>By this time Vincent Price had jumped ship and was replaced by Jason Robards Jnr.  An odd choice, as aside from being too contemporary for this period setting, he is also, dare I say it, too good an actor for this material.  It really needed an actor, who like Price, had a strong sense of irony.  As a result Robards just looks flat.  Lom comes across much better, but again ham-fisted direction by Hessler sometimes makes him look absurd (the worst offender is when Lom follows Robards; it's staged so badly that a blind man would have noticed Lom).<br><br>It's a mess, but despite its many faults it is entertaining enough, the frustrating thing about it is that you get the feeling that given a better script and a more imaginative director (and Vincent Price instead of Robards) this movie could have been very good indeed.","user":"david-697","rank":[11,16]}]