[{"title":"A retelling of Daimajin with some interesting additions.","rating":7,"date":"4 March 1999","review":"Basically this is the \"Daimajin\" plot done with a few subtle differences. There are some interesting Christian motifs here; parting of the Red Sea, crucifixion... that I wasn't expecting being that Majin is a \"kami\". Visually it is very satisfying.  Misumi went on to direct the incredible \"Kozure Okami\" or \"Lone Wolf with Cub\" movies.  Daimajin has some interesting parallels with \"King Kong\".  It's always a woman who ultimately commands the Majin with her prayers and tears.","user":"freakus","rank":[9,10]},{"title":"Bad guys are in trouble now ! - Part 2","rating":5,"date":"28 April 2011","review":"This is the second installment of the Daimajin trilogy although the three stories are not connected.<br><br>Daimajin is a talismanic 50 ft stone statue embodied with the spirit of local god. It normally sits idle with a peaceful face, but when the people are oppressed, it wakes up and changes to fierce expression to protect the innocent.<br><br>The settings is in samurai era Japan. Country of Chigusa is invaded by the neighboring warlord of Mikoshiba. What the warlord of Mikoshiba doesn't know is that Chigusa is protected by Daimajin. He wreaks havoc on the people of Chigusa until - you guessed it - he pisses off the Daimajin !<br><br>Even seen as samurai movie, this movie has one of the best cinematography showing Daiei's experience in making samurai movies. Special effects are one of the best for '60s Japanese movie as well. Kojiro Hongo who was the star of '60s and '90s Gamera series also stars in this movie. Supporting casts are good too, and they deliver superb performance.<br><br>The movie is an interesting mixture of samurai and giant monster movie, but it works.<br><br>The recent TV mini-series \"Daimajin Kanon\" is a direct homage to this series and features the Daimajin in modern settings.","user":"ebiros2","rank":[5,5]},{"title":"Majin smashes more samurai and their evil warlord","rating":13,"date":"13 May 2000","review":"Not much different from the first film except that Majin now resides on the top of a mountain instead of the side. Great art direction, nature photography and overall excellent special effects elevated what is essentially the same story as the first film. Evil warlord enslaves and kills innocent townspeople and Majin rises up and kills all the samurai. The warlord even dies the same way as in the warlord in the first film. The middle of the film is beautifully photographed but really boring as the children travel over Majin's mountain to rescue their fathers from the warlord. Akira Ikufube's score is really good too but you can't help but notice it's almost an exact copy of his work for the Toho monster films at the same time.","user":"wh-3","rank":[6,10]}]