[{"title":"The England that is no more","rating":10,"date":"9 March 2005","review":"What a wonderful film this is, it takes you back to an England that is no more.The four leading stars compliment each other, with the beautiful Kay Kendall leading the way and Kenneth More having to put up with her dog as well. The great harmonica score enhances the film and sets the mood(reminds me of last of the summer wine music). I have lost count of the number of times i have seen this film but it is as enjoyable now as it was the first time i saw it. The plot is simple just two mates having a wager to see who will be the first to arrive in Brighton while taking part in the veteran car rally and their poor female partners having to suffer all the way. Pure enjoyment from start to finish. I know it is an old saying but it is true in this case....... they couldn't make them like this anymore.","user":"luffytoon","rank":[52,54]},{"title":"Car comedy that never runs out of gas !","rating":9,"date":"19 February 1999","review":"A chirpy British comedy following the fortunes of two overly-competitive friends who enter vintage cars in the famous London to Brighton rally. John Gregson stars as the dour lawyer Alan who, baited by his larger than life friend (Kenneth More), accepts a bet on who will return to London first.<br><br>Dinah Sheridan and Fay Kendal provide glamorous and dependable support, with Kendal sparkling as an upper class fashion model with an unexpected capacity for trumpet playing and heavy drinking. Much of the film is typical race and chase stuff, but avoids the usual potholes of over-engineered stunts and tricks. The characters are far more interesting than that!<br><br>A brilliant harmonica soundtrack by Larry Adler keeps the tempo and spirits high and the full colour production provides a ready backdrop of 1950's town and country scenes. Escapist entertainment from a period when British cinema boomed.","user":"Rob Fox","rank":[30,32]},{"title":"Whimsical, classic British cinema at its best","rating":10,"date":"17 January 2003","review":"I grew up with this enchanting film as it was one of my father's favourites - I can see why...<br><br>One of the enduring, and charming features of \"Genevieve\" is its love affair with the characters (the cars included). The relationships between all the principals are tested repeatedly throughout the film, but never in a threatening manner - typical of the British reserve.<br><br>Stand-out moments have to include Rosalind's trumpet solo in the club (\"I'll show them how to tray the plumpet!\"), the wonderful cameo by Joyce Grenfell as the hotel receptionist, Ambrose's raucous 'Woody Woodpecker'-style laugh and the heart-warming finale seeing Genevieve rolling off under her own magical steam towards the end.<br><br>The score by harmonica supremo Larry Adler does wonders to enhance the sentiment in the film, with the jostling waltz theme and the lyrical ballad interludes. The use of the countryside is great too, and here the colour film is saturated perfectly - although, I have seen it in black and white as well, so it is not essential colour-viewing.<br><br>The race back to London is memorable for the many pranks and down-right rude goings-on between the two men and their long-suffering partners. This is superb film comedy, and its gentle tone is suitable for all members of the family - the ridiculous size of Suzie the St. Bernard, the 'flask' incident (filmed by the BBC, of course) and the ringing of the clock tower bell are all wonderful highlights.<br><br>No wonder my Dad liked it so much... :o)","user":"jiholland111","rank":[37,42]}]