[{"title":"A taught Doomsday thriller.","rating":7,"date":"28 July 1999","review":"This is an enjoyable and nerve-wracking thriller of an inside robbery as a top secret Germ Warfare lab and the theft of enough deadly bacteria (The Satan Bug) to kill a city. In this case the madman is Richard Basehart (cross reference E.G. Marshall in a similar role), and look for an early Ed Asner as one of his thugs. Although a little drawn out at times, this is an effective movie worth seeing.","user":"Kirasjeri","rank":[19,20]},{"title":"a wonderful little picture","rating":9,"date":"6 June 2005","review":"This movie was a little film when it was released. No big stars but many familiar character actors in this simple movie about a maniac who has stolen a dangerous germ from a US government lab. The maniac is now threatening to release this pathogen and he must be found and stopped before all life on the planet is obliterated.<br><br>It's a simple enough plot but it is carried off so well. It's an intelligent movie that will appeal to someone who wants something different as well as a movie that doesn't insult your intelligence.<br><br>A somewhat similar and equally engaging film is The Andromeda Strain. Both are well worth your time.","user":"MartinHafer","rank":[42,48]},{"title":"Satan had a Virus - don't open that flask!","rating":7,"date":"1 April 2006","review":"You want Armageddon? An Apocalyptic threat? This gives you the unscientifically-pegged Satan Bug, a virus so lethal, it can kill everyone in California in a few hours, the U.S. in a week, and the world...oh, a couple of months. Towards the end of this movie, the one who makes this pronouncement takes a step back and admits it's unclear if this virus can actually be so effective (life tends to survive, as we all know), but let's not test it, shall we? I wonder if this film influenced Stephen King's \"The Stand\" (the novel and the mini-series). The chilling scenario first described manages to up the ante from the generally-regarded worst threat of nuclear annihilation. An atomic bomb, destructive as it is, is still limited to a certain area; this bug - you open the flask, it's all over, baby, for the entire planet. The allusions to the 'Pandora's Box' fable are quite obvious (similar to those in \"Kiss Me Deadly\" from 10 years earlier).<br><br>The threat surfaces at one of those government installations for biochemical warfare, in the middle of the desert - a barren, vast, empty landscape. There's no such thing as perfect security, but here they really bumbled it by letting two unpacked crates inside; to make a long story short, with the help of an insider, certain flasks are removed from the property. The government here also seems to have lapsed badly as far as background checks. There's an air of mystery to the story, since we don't know who the master villain is, and tension is ratcheted up on a regular basis when the bug may be released at certain points. I also like the use of the desert locations where much of this takes place; the very sparse layout of an occasional building lends an almost alien-like atmosphere to the terrain.<br><br>There are some contrivances to the story which make you shrug afterward. For example, the hero (Maharis) and two government agents (including Star Trek's Jimmy Doohan in a small non-speaking role) are captured at a key point; it's obvious they are to be killed by the villains. Instead of simply shooting them, as would be proper in the isolated location, the villains go through this elaborate method of using a flask of a deadly bug. But it's an exciting sequence and sets it up for the most intense moment of the film, when any or all of the 3 may die in the next few seconds from exposure. The main villain's motivations are also hard to buy into. He seems to be doing this as a protest against biochemical weapons, but is willing to wipe out cities to make his point. He's dismissed as a paranoid delusional, a maniac, at one point, but never comes across that way, as if he has an alternate plan. This storyline is similar to a James Bond adventure and most viewers will strain to keep track of all the character names. Later films with similar threats were \"The Andromeda Strain\", \"Warning Sign\" and \"Outbreak.\"","user":"Bogmeister","rank":[15,16]}]