[{"title":"Puberty Catalyst","rating":10,"date":"18 October 2005","review":"I researched this film a little and discovered a web site that claims it was actually an inside joke about the Post WWII Greenwich Village world of gays and lesbians. With the exception of Stewart and Novak, the warlocks and witches represented that alternative lifestyle. John Van Druten who wrote the stage play was apparently gay and very familiar with this Greenwich Village. I thought this was ironic because I first saw Bell, Book and Candle in the theater when I was in 5th or 6th grade just because my parents took me. It was hard to get me to a movie that didn't include horses, machine guns, or alien monsters and I planned on being bored. But, I remember the moment when Jimmy Stewart embraced Kim Novak on the top of the Flatiron building and flung his hat away while the camera followed it fluttering to the ground. As the glorious George Duning love theme soared, I suddenly got a sense of what it felt like to fall in love. The first stirrings of romantic/sexual love left me dazed as I left the theater. I am sure I'm not the only pre-adolescent boy who was seduced by Kim Novak's startling, direct gaze. It's ironic that a gay parable was able to jump-start heterosexual puberty in so many of us. I am in my late 50's now and re-watched the film yesterday evening and those same feelings stirred as I watched that hat touch down fifty years later . . .","user":"robert48-1","rank":[101,139]},{"title":"Bewitching Romantic Comedy -- Sunday Afternoon Delight!","rating":28,"date":"28 November 2004","review":"Kim Novac is wonderful as the 'good witch' falling in love with mortal James Stewart. The special treat with this film is that there is a complete 'underground society' (literally) of witches and warlocks, of whom we get to know Elsa Lanchester and Jack Lemon, both recommending Kim Novak quickly forget her romance with the mortal man.<br><br>This film is a visual feast with some tidbits of 1950s Jazz music in the score. Complete with black cat, spell-book and magic tricks. Who can blame Jimmy Stewart for falling for Kim Novak's spell? The International cast of supporting actors includes an authentic Parisian Night Club Act, as well as the ultra-eccentric Hermione Gingold (of Gigi/Moulin Rouge fame). Elsa Lancaster is an absolute delight as the intuition-plagued Auntie Queenie. Don't miss this bewitching piece of light entertainment!","user":"mdm-11","rank":[39,51]},{"title":"Charming","rating":28,"date":"28 March 2004","review":"Kim Novak, at the peak of her career, is lovely here, as beautiful (single) witch, Gillian Holroyd. New neighbor, Shep (James Stewart) moves in upstairs, and suddenly that \"ole black magic\" is brewing all over the place.<br><br>Based upon the popular 1950s stage play, this movie does have a bit of the stagy feel to it. Despite that, there is the good use of Technicolor, George Duning's pleasant score, and the great cast of comic actors. Ernie Kovaks looks a little out of place, but he does well. Jack Lemmon is great as Novak's warlock brother, Stewart is fine, Elsa Lanchester is good as well, and so is Hermione Gingold. The real star of the film, however, is Pyewacket, Novak's handsome seal-point Siamese cat. What ever happened to him?<br><br>Not exactly a knee-slapping comedy, but pleasant, lite and fluffy entertainment. Enjoyable, and a stark contrast to Novak and Stewart's earlier pairing (the same year) in Hitchcock's \"Vertigo\". Worth seeing.","user":"laffinsal","rank":[47,63]}]