[{"title":"I Don't See Anyone Givin You A Raise Down At Unemployment","rating":10,"date":"5 January 2006","review":"I am 31 so I was 3 when this movie came out. The first time I saw Saturday Night Fever was the \"Edited For Television\" version probably when I was 6 or 7 years old. At that point, it was about the music, the dance scenes and the clothes.<br><br>It wouldn't be until years later that I understood what a great story this is. It's a coming of age movie. It's a modern day tragedy. It's a love story.<br><br>The first thing that people think about when they hear Saturday Night Fever is disco and bell bottoms, but the story is timeless. Travolta plays Tony Manero, a loser in a nowhere job who only feels alive when he is on the dance floor at the local disco. There he is adored by his friends, by women and by strangers. There he is king. Everywhere else he is nobody. Even at home.<br><br>Tony becomes infatuated with a woman named Stephanie. On the surface Stephanie appears to be much better off than Tony. For the most part Stephanie is a big talker, but Tony is bothered by her observations.<br><br>\"Let me guess. You work all week long at some dead end job and then you go and blow it at all at 2001 (the disco) on the weekends. You're a cliché. You're no one, going nowhere.\" As much as Tony is upset by her words he can't argue with them. Soon Tony becomes frustrated with his \"station in life\" and tells Stephanie he wants out (of Brooklyn).<br><br>What makes Saturday Night Fever work so much for me is Tony is very typical of a lot of males who would rather have a good time and party now than build something toward the future. Bars are full of guys like Tony. Guys who are super stars in their local drinking establishments, but have no life outside of the night life.<br><br>And of course there's the superb dance scenes that most people remember Saturday Night Fever for. The soundtrack is also one of the best out there.<br><br>For whatever reason, Saturday Night Fever also has my favorite closing shot of all time. It's really nothing special, but I get choked up every time I see it.<br><br>Saturday Night Fever is also a snapshot of a period in recent American history. The movie took place in 1977. The country was a mess after the Vitenam war ended and before Reagan stormed Washington and once again instilled a sense of pride in Americans. There was no longer a war to protest, but the average American didn't have much faith in our country. I think Saturday Night Fever does an excellent job of capturing what was probably a common attitude among young adults during the late 70's. Live for the moment because the future is pretty bleak.","user":"Bandit1974","rank":[97,109]},{"title":"Beautifully Defines An Era On The Backdrop Of A Realistic Class Study and Dynamic Music","rating":8,"date":"20 March 2007","review":"Although it may seem dated and cheesy to some viewers today Saturday Night Fever remains one of the most underrated examples of '70s pop-culture. It is undoubtedly the quintessential dance flick and remains one of the most entertaining films of all-time. Yet, behind all the music and entertaining aura you are actually viewing a drama studying the American class system and young rebellion. Though at times it is slightly exaggerated, it still manages to capture a vast amount of authenticity and ultimately the sights and sounds of the time.<br><br>Saturday Night Fever follows self-proclaimed \"dance king\" Tony Manero (John Travolta) and his love of dancing and the trials and tribulations of his life in the Bronx. He soon meets an arrogant fellow dancer named Stephanie Mangano (Karen Lynn Gorney). Quickly becoming attracted and influenced by the women he starts questioning the way he lives his life.<br><br>The film is not always upbeat and at times can be depressing, particularly the scenes depicting peer-pressure. Although both have their differences, both are very alike and ultimately want to be something \"big\". There are also the elements of jealously, rivalry, religion, rebellion, respect and racism added into the film. This captures the realism of the time and with more accuracy and honesty than a lot of films. Just take a look at the brief scene where Tony is on the tube, this is an oddly poignant, effecting and compelling scene presenting Tony's confused emotions.<br><br>Saturday Night Fever still carries the vibe, rhythm and atmosphere it did back in '77. It remains one of the most influential films for both the film-world and pop-culture. Infamously holding some of the greatest dance sequences ever committed film; you can feel the energy, emotions, time and determination that were spent perfecting the dance scenes to the finest detail. The lighting is perfect at creating the \"disco world\", the set-piece of the 2001 Disco is one of the film's many iconic highlights.<br><br>John Travolta dedicates himself to his dancing and character, fitting the role with a graceful ease. The film goes into depth at studying characters too, it shows how desperate everyone is to fit in and be able to make an impressive image. The fantastic shots on character's feet show the \"strut\" in their walk, representing their desire to maintain their reputation of being \"cool\". All the characters want to be something, while a lot of them will never add up to anything due to their working-class backgrounds. There are a fair amount of American social-comments scattered throughout the film and retaining a surprising amount of intelligent value.<br><br>The gloriously groovy and funky soundtrack is possibly the film's finest element. The music accompanies the dance sequences with an amazing amount of memorably robust imagery. The use of The Bee Gees' music is wonderful to listen to and also for helping to create an ambiguous atmosphere of love, drugs and sex. The shooting techniques in the disco are magnificent for filming the dance scenes and fit perfectly alongside the other technical elements.<br><br>Saturday Night Fever is a far more professional film than one might expect, it has intelligence as well as entertainment, which is something that makes a more than just admirable achievement. It is a truly remarkable triumph and a film that deserves more appreciation than it gets.","user":"Det_McNulty","rank":[69,81]},{"title":"Living Vicariously Through the Weekends.","rating":23,"date":"23 June 2004","review":"An uneducated Brooklyn teen (John Travolta, in an Oscar-nominated role) lives in a dream world over the weekends as the king of a disco dance floor. Disillusioned, quietly upset with where his life is, Travolta finds solace by dancing in public to Bee Gee's music and finds love with his newest dance partner (Karen Lynn Gorney). The duo practice for an upcoming contest that could mean total success at last for Travolta and the opportunity to get discovered doing what he really loves. Travolta and his friends seem destined to go down a path of destruction though as a soap opera develops for all the key people found within. \"Saturday Night Fever\" is a total over-achiever as it could have fallen to exploitation tactics of the 1970s, but becomes one of those iconic films that still stands the test of time. Travolta is a revelation in arguably his greatest role. The other players are adequate and the screenplay is deceptively smarter than it appears on the surface. The movie also works as a time capsule to a part of contemporary American history where discos and bell-bottoms were all the rage. Still one of the finer films of the time period. 4.5 out of 5 stars.","user":"tfrizzell","rank":[42,48]}]