[{"title":"Kitchy but kind of cool","rating":7,"date":"27 March 2006","review":"I caught this on cable, and found it quite amusing. Not laugh out loud, but still rather good. Granted, it's no masterpiece, but I enjoyed it for what it was, a kitchy cool retro film from the 70's. I love watching bad 60's and 70's films for the music, the clothes, the decor...and this was the perfect film. How can you deny seeing London at the end of the swingin' 60's? And the Playboy element, the swinging party...I don't know. I took this film for what it was, and I would definitely watch it again....<br><br>Maybe the fact that I watched it as a morning double feature with Vincent Price's \"Scream and Scream Again\" helped me get into the mood for this...","user":"kittenmalibu","rank":[20,27]},{"title":"Not too bad.","rating":6,"date":"3 November 2002","review":"David Niven has a role that is clearly beneath his stature (in his first scene, he is reading a Playboy magazine), and Clive Donner's direction is almost embarrassingly crude (the dreadful copy I saw made it look even worse than it is, but it's crude nonetheless). Still, the movie has some unexpectedly clever lines (Dracula's assistant to his master: \"I cross my fingers, sir\" - Dracula's response: \"I'd rather you didn't\"), and (don't crucify me for this) I really found it more enjoyable than Polanski's overrated \"Fearless Vampire Killers\" - mainly because it has no pretensions of greatness.   (**)","user":"gridoon","rank":[23,34]},{"title":"A humorous film putting a Brit Twist on the Dracula Legend.","rating":9,"date":"13 July 2002","review":"Though it has been several years since I saw this film, I recall enough to wish I could find it on video..or better DVD.<br><br>I happen to like David Niven and found this film rather enjoyable.  I would expect that one would need to be able to grasp some of the subtle humor that a good number of Britcoms are known for to really enjoy some of the more funny bits.","user":"The_Pendragon","rank":[20,31]}]