[{"title":"An American Trilogy","rating":9,"date":"17 March 2000","review":"This movie is essentially the third in a trilogy of films that deals with the actual bombing of Japan by the Doolittle raid, very early in World War Two. The first is \"Destination Tokyo,\" a presentation about the submarine which went ashore to mark targets for the American raiders. The second is \"Thirty Seconds Over Tokyo,\" which is the story of the Doolittle raid, including the launching of the B-52's from the U.S.S. Hornet and the raid itself. \"The Purple Heart\" completes the cycle with the war trial of a captured American crew which took part in the attack.<br><br>One wonders how so many good things can be put into a movie which lasts only an hour and a half. There is a trial, action, good acting, few technical flaws, very precise and accurate dialogue, questions of honor and decency, patriotism on all sides, questions as to the role of the media, and the ever present suspense of the final resolution. Lewis Milestone deserves commendation for excellent direction,  as each scene is composed to blend well with the major ideas in the movie. There is little in the film which is distracting or ill-fitting. And the characters are portrayed with confidence and continuity. In fact, it is difficult to find any character, major of minor, American or Japanese, which is less than complete. It seems some award is in order for the total effort of making this movie.","user":"dexter-10","rank":[38,41]},{"title":"Contains the most moving patriotic speech ever in movies","rating":10,"date":"27 September 2002","review":"The story of the fate of a captured American bomber crew from the first air raid on Tokyo. Dana Andrews final speech (taken from a Portugese reporter's news story) to the court is the most moving ever made in a motion picture. Purple Heart produced such a strong emotional response that it was banned in many American cities as detrimental to the war effort.","user":"narmer71","rank":[29,31]},{"title":"What would you do in their shoes?","rating":8,"date":"9 November 1999","review":"This is a beautiful movie.  The story is about what happens to the captured crew of an American Army Air Corps bomber in Japan during WWII.<br><br>The performances of the actors are excellent and deeply felt (remember that it was filmed during the war).  Once you have watched the first 30 minutes, you must stay to learn their fate at the hands of the Japanese.","user":"Pat-159","rank":[28,31]}]