[{"title":"Lana Turner Deserved a Nomination","rating":9,"date":"6 September 2007","review":"Lana Turner, party gal supreme, was a fine actress whose personal life detracted from her fine on-camera work. \"The Bad and The Beautiful\" \"Peyton Place\" \"Imitation Of Life\" and this film \"Madame X\" are all examples of fine acting. Lana Turner after the Stopanato Murder was given a new lease on her career by Ross Hunter at Universal, and the result was \"Imitation of Life\" a huge success for Universal and Turner who had an ownership percentage in that hit. Hunter and Turner and Universal reprised in \"Portrait In Black\" and hit another great home run with a remake of \"Madame X\" also at Universal. Simply put Lana Turner is outstanding in this film and the last 30 minutes of Madame X has Lana Turner performing as only the best actresses could. Lana Turner should have been nominated, but I gather her party ways, the hangover of the Stompanto murder, etc..left a sour taste with some Academy voters. Fine support by Keir Dullea and terrific seeing Constance Bennett in the role of Lana's wicked Mother In Law. Ms Bennett died soon after filming. <br><br>This is a fine Film with Lana Turner robbed of a Nomination.","user":"AndersonWhitbeck","rank":[27,29]},{"title":"Lana's best performance!","rating":10,"date":"25 May 2012","review":"\"Madame X\" is one of the best movies I have ever seen. I would recommend it to every movie goer, not just Lana's fans. She manages to portray to perfection a very, very complex character, and she certainly deserved an Oscar. I liked in particular her scenes with another fine actor, John Van Dreelen, who shared with Lana some very nice, romantic moments. The actor actually said in an interview that his chemistry with Lana was as good on-screen as it was off-screen, and this does a lot of good to the film. I also bought the magnificent book \"Madame X\", by Michael Avallone, which was published in 1966. I recommend it to everyone, because it was adapted after the original screenplay of Jean Holloway. Thanks to the book, I managed to discover the scenes that were cut from the film, such as the scene where Holly is trying to get a job at an expensive French shop, and also a scene where Christian, the pianist (Van Dreelen), is giving her a hint that they should marry, because the whole press was discussing about them during his concert tour. So, in order to avoid gossip and scandal, he thought they ought to marry. This was his first proposal to her, while they were driving an automobile - and that is why in one of the sequences with them in the car, Lana's character seems preoccupied about something. The novel reveals that she was very much in love with this artist, who became her God or guardian angel, but whom she had to leave, so that neither he, nor her first husband (played by John Forsythe) would find out who and where she really is. A great book and a great film! I bought the original DVD from France and it was an excellent purchase. The music is also superb, and the soundtrack was released separately in 1967. I only wish there were kept more scenes from \"Madame X\", because the film is much too short to understand the complexity of the plot. Still, I highly recommend it, even if it is a very sad film, a real tear-jerker.","user":"monikgwtw","rank":[10,10]},{"title":"Lana Turner's finest screen moments...","rating":8,"date":"26 January 2000","review":"Holly Anderson (Lana Turner) is the young wife of a rich diplomat(John Forsythe).<br><br>Neglected by her husband, she is driven in boredom into the arms of Phil Benton, a playboy (Richardo Montalban).<br><br>When he is killed in a bad fall during one night of their encounter, she appeals to her matriarchal mother-in-law for help... But the aristocratic woman (Constance Bennett) who has always considered her an embarrassment to her family, convinces her the indiscretion will cost her husband his career and wreck their young son's life...<br><br>Over the years, she slowly drifts into a life of alcoholism and prostitution, sinking lower and lower until. in a Mexican hotel she meets Dan Sullivan (Burgess Meredith) a smooth-talking con-man, and agrees to join him in a blackmail scheme... <br><br>When she discovers too late that the intended victim is her husband, she shoots the ugly blackmailer and goes on trial for murder signing her confession as the mysterious Madame X... <br><br>Unaware of her true identity, the young lawyer assigned to defend her is her own son Clay Anderson Jr (Keir Dullea), now grown to manhood... <br><br>No one will be able to watch \"Madame X\" (filmed six times) without a strange feeling in the throat... So if you haven't cried so much in years, this is your opportunity to see the mother-love and self-sacrifice in specially in the famous courtroom scenes... She's truly very moving...<br><br>Constance Bennett, one of the most glamorous stars of the 1930s returned to the screen after a twelve-year absence... Sadly, the film was Bennett's last; she died shortly before it was released...","user":"Nazi_Fighter_David","rank":[37,45]}]