[{"title":"Funny, smart, and too close to home.","rating":24,"date":"24 July 2004","review":"I grew up near Decatur, Il, a city that was devastated in the late 70's and 80's by downsizing in the auto industry, the migration of jobs south of the border, and corruption in the giants of agribusiness.  The city's economy has never really recovered and has been on the frontlines of the labor battles of this country, while the national media has ignored it.  It bears a close parallel to Flint, Michigan, as depicted in \"Roger &amp; Me.<br><br>Moore goes back to his hometown and sees the effects of massive job loss, created by a company that cared more about executive stock options and bonuses, than the community it lived in.  We meet people who have lost their jobs, benefits, and homes as a result of short-sighted decisions.  With few alternatives that pay a living wage, the community spirals into decline.  We see the arrogance of wealth, via lavish parties, while the poor are evicted from their homes.  We watch as city leaders concoct one bizarre cosmetic scheme after another, without ever addressing the real roots of the economic problems of the city.<br><br>The film makes many valid points which still hold true and still occur.  You can find fault with Moore's \"ambush\"  approach and mockery of celebrities; but, Moore has usually made civil efforts to talk with these individuals, only to be ignored or driven off.  So, he resorts to grandstanding tactics which brings attention to the issues he is pursuing.  Also, the celebrities are so generally caught up in their own self importance, that they deserve the skewering they receive.<br><br>You can fault Moore's tactics and selective portrayal of an issue, but he does provoke discussion, which is usually his aim.  In this, he is following the great tradition of the muckrakers, like Upton Sinclair, who were able to stimulate argument on vital topics and effect positive change. Moore is a great filmmaker and thought-provoking figure.  Love him or hate him, he makes you focus on issues.  Too bad politicians and executives don't.","user":"grendelkhan","rank":[23,26]},{"title":"Michael Moore's Roger and Me on Special Edition DVD","rating":1,"date":"1 June 2004","review":"I am quite shocked that no one else has commented on this film. This is quite possibly one of the most important movies in the last 20 yrs. Michael Moore by putting his own passion and blood into the making of this movie, showing corporate greed at all levels from political to civil , got an Oscar for this film and he pretty much cemented himself as one of the bravest and strongest directors ever.<br><br>I don't even know where to start with the review. Shot on location in Flint Michigan, with real people including former corrupt President Ronald Reagan, this movie it as real as it gets.<br><br>It pretty much started the whole documentaries on exposing corporate greed and well the downhill and moral decline of America (also shown in \"The Big One\" and \"Bowling for Columbine\" (which won the Oscar for Michael Moore).<br><br>Before I get more into depth of the movie, I asked you to remember these image in your heads to show you how sad the situation in Flint Michigan both in 1989 and 2003 are:<br><br>In the movie while General Motors is showing profits of over a billion dollars,they disgusting laid off over 25,000 factory workers. I repeat General Motors was showing a profit, not a loss, yet they decided to lay of thousands of people basically giving them a death sentence.<br><br>Most factory workers didn't have the money to pay for their mortgage and were evicted,during one scene in the movie as many as 25 people in one day were evicted even on Christmas Eve.<br><br>To show the real disgusting situation. A poor and mentally disturbed woman by the name of Rhonda Britton is so desperate to get money for her kids that she tries to sell Rabbits as pets. When that doesn't work she ends literally killing these poor animals and selling them as meat!!!! Which includes skinning them alive!!! The real sad part is that there a million dollar GM hotel only a few yars from where this women is doing this acts to get any form of help for herself.<br><br>Basically Flint , Michigan as shown in the movie, from once a booming celestial center of action, is now a corrupt, poor , and crime infested city with no hope even amidst the lies of former Presidents Clinton, Bush, and Reagan's promise that they \"would change the situation\".<br><br>In fact Reagan as shown in the movie uses Flint basically as a campaign ploy to elect himself during the 1980's. It's disgusting.<br><br>Now the plot deals with General Motors and their disgusting actions of laying of well basically everyone who works for them in the factory. Even amidst Union groups like UAW , and booming profits, GM pulls the most disgusting acts reported in corporate history.<br><br>Undoubtedly other sick American companies like Exxon and Enron followed in GM's footsteps.<br><br>So Michael Moore seeing the situation that is happening, makes this movie as he puts it during the trailer \"I did this movie to raise the spirits of the workers\". Indeed he did, but more importantly he showed America and the world corporate greed up close and personal and the many people covering up the lie that all is well on GM.<br><br>For instance Anita Bryant, Bob Eubanks and Pat Boone are 3 disgusting American celebrities who basically are hired by GM to fool the town into thinking everythings nice at Flint Michigan.<br><br>They hire them for Carnivals, parades, tourism, nything. In Eubanks case as shown in the film, this self indulgent pig is promoting his newlywed game. Eubank is one of the first celebrities that Moore exposes. Eubanks at first seeing Moore doesn't think that Moore wont do much damage.<br><br>And thats the big mistake that everyone at Flint Michigan does as quoted in the commentary by Moore \"getting an interview with these people was easy...because they just took look one look at me and figured oh this isn't going anywhere\".<br><br>My God how wrong those people are. As stated in the first sentence where Eubanks shows his antisemetic joke, he obviously didn't think Moore's movie would have any impact. but furthermore, Eubanks is the typical example of every greedy American pig in the movie. He thinks because he has power he can treat and offend those who don't have power and those who aren't around to listen to his offensive remarks.<br><br>Again backed up by Moore's commentary \"This people thought they could be offensive ecause the groups that they were being offensive too weren't there.\" True cowardism and Moore's shows that too.<br><br>The movie moves on to show the Union groups attempt to gain their jobs back and get GM to turn the situation around but they fail. One of the reasons they failed is because the Union Managers themselves kept giving concessions to GM, meaningly they gave into GM demands without getting anything in return.... True stupidity.<br><br>The movie then shows us Moore's attempts to talk to and question the main man behind the GM scandal Roger Smith, the chairman and Ceo of Gm (this old greedy bastard is no longer the head of Gm).<br><br>Moore's attempts go awry at first, apparently Smith has goons stopping him and people like Ralph Nader from exposing the greedy Smith.<br><br>Eventually though using the fact that people underestimate him Moore does meet Smith (for 2 minutes basically) before Smith hightails it ouf there and Moore is removed from security from the Gm building at Chrismas no less!!! Where Smith aware of the unemployment, and crime wave hitting the city as a result of the layoffs still seeks to spew his lies and image of Gm into the media.<br><br>However by the end of the film. Moore wins, TV Channels and programs become aware of the situation going on and give Moore credit for exposing the situation.<br><br>\"Roger and Me\" was shown at over 200 Theaters in America. It won several awards at Cannes, gave Michael Moore instant credibility not just as a director but a man, an American, someone who stood up for the rights of others, stood up to the corruption and greed and his area and did something about it.","user":"MovieCriticMarvelfan","rank":[23,29]},{"title":"American Blue collar worker.","rating":13,"date":"13 May 2008","review":"The best documentary i have viewed. This is a powerful indictment of American Corporate greed and the results to the blue collar worker. Who pay the price by loosing there job with the only trade they knew how to do since joining the workforce. Yes, like the one user mentioned, Govt. has something to do with the way companies function with there laws, tax's, and tariffs. But you can't tell me that these rich companies with allot of political power in Govt. Can't just stand up and say, No. Your hurting our company with these laws. But why would they care. All Ceo's and upper management have there golden parachutes. You can say what you want about all of Moore's movies, but if they were really so full of crap like so many believe, Where are all the lawsuits. There's none, because for the most part he's telling the truth. People who hate Moore are the same, Well off Middle and or Upper class, with no worries. You won't find too many poor people or people who lost there only job they know how to do, calling Moore a fraud and bum. Because they know the truth of what greed does. The Gordon Gecko's of the world still exist. And thats a damn shame.","user":"pk-2","rank":[14,17]}]