[{"title":"Subversive schoolmaster for Nazi spies","rating":7,"date":"4 January 2016","review":"Loved this -- probably one of the funniest Will Hay films I've seen. I far prefer the pictures he made with Charles Hawtrey to the 'classic' teaming with Moore/Marriott, and an excellent supporting cast here includes Peter Ustinov and Frank Pettingell (of \"Gaslight\" fame).<br><br>I always find Hay funnier when he is being a pompous but resourceful twit rather than simply an arrogant incompetent, and here his schoolmaster character is put up against the Nazis and manages (with assistance) to rise to the occasion... aided by the fact that his opponents half the time are even bigger buffoons than he is. A sharp script relies heavily on verbal humour, with two outstanding scenes that riff on the absurdities of the English language. The invasion plan sequence in which Hay improvises strategy wildly in a cascade of puns while attempting to pick a German general's pocket deserves to be a classic of the genre (take them from the flanks in Lancs to keep the Paras all tied up in Notts... but don't get caught with your Panzers down in the Severn Tunnel).<br><br>There is also a clever yet natural-seeming series of gags making use of an asbestos suit, some of which you can see (and enjoy) coming in advance, some of which I didn't! The final reels of the film didn't work quite so well for me, chiefly because I couldn't help but be aware that with all those antics the plane wouldn't have lasted for a minute and had some trouble suspending my disbelief in the name of comedy -- it's always funnier when it's actually physically plausible, however far-fetched. (The ingenious tactic by which Hay contrives to prevent his friend Professor Hoffmann from drinking a glass of poison by triggering his \"Heil Hitler\" reflex precisely at the requisite moment, for example.) Up to that point I would have rated the film at a definite 8/10; I still rate it a solid seven.<br><br>The contrast between English and American propaganda films was never more marked; see also \"Night Train to Munich\", \"Pimpernel Smith\" and even \"The Lady Vanishes\" for Englishmen working against the Nazis who simply don't take themselves all that seriously.","user":"Igenlode Wordsmith","rank":[14,14]},{"title":"Hay's penultimate film","rating":6,"date":"16 October 2005","review":"This,Will Hay's penultimate film contains one of his most famous routines on film.A variation on his famous schoolmaster routine.In this he is a teacher in a school for spies teaching such notables as Peter Ustinov and Charles Hawtry how to cope with the intricacies of enunciation in the English language.There is a further scene near the end of the film which was full of puns based on Enlish place names.I was at a lecture given by Peter Ustinov many years ago at the NFT.when asked about Will Hay he said that he remembered him as having cups of tea on his own in a corner of the set.It is interesting that in films made by English comedians during the war,such as Hay ,George Formby and The Crazy Gang,the Nazis are always portrayed as buffoo0ns rather than evil.","user":"malcolmgsw","rank":[14,19]},{"title":"When comedy meets propaganda","rating":7,"date":"9 December 2018","review":"THE GOOSE STEPS OUT is another fine comedy from Will Hay, here repackaged as a propaganda movie for British viewers during WW2. This is just as funny as GOOD MORNING, BOYS, another favourite I watched recently. Hill plays a mild-mannered and bumbling schoolteacher (of course) who turns out to be the double of a Nazi spy. The spy is captured and Hay is sent to Nazi Germany in his place, where he's given the job of teaching raw Nazi recruits. The usual situation comedy plays out, alongside plenty of laughs at the expense of the Germans; the scene in which Hitler's portrait is sworn at has to be seen to be believed. The film's dramatic storyline means that there's suspense here along with the laughs, and the likes of Peter Ustinov and Charles Hawtrey prove perfect support.","user":"Leofwine_draca","rank":[3,3]}]