[{"title":"Connery Magnificent in Milius Masterpiece!","rating":9,"date":"9 August 2003","review":"'The Wind and the Lion' is, simply put, one of the greatest adventure films ever made, a classic that helped break the 'James Bond' stereotype for Sean Connery, solidified Brian Keith's reputation as one of America's finest character actors, and gave action-oriented director John Milius his most 'audience-friendly' success. It is a sweeping epic in the tradition of 'Lawrence of Arabia', without the earlier film's subtexts of megalomania and sexual ambiguity. Here, the personalities are clearly defined; they start off on opposing sides, but through the nobility of their characters, their unspoken codes of honor, and a sense of old-fashioned chivalry in a modern world of betrayal and greed, by the film's climax, they become allies against a greater evil. <br><br>\nSome critics attempted to link Theodore Roosevelt's world view in the film to the eventual U.S. debacle in Vietnam. That is unfair to both the film, and to Milius, who, if anything, admires and respects the 'big stick' idealism and machismo of our only true 'cowboy' President. (This respect led the director to film the excellent 'The Rough Riders', twenty-four years later, for TNT). Rest assured, 'The Wind and the Lion' is NOT a boring political treatise!<br><br>\nThe setting is Morocco in 1904, where an American woman (Candice Bergen, in perhaps her best screen performance), and her two children are kidnapped by 'the last of the Barbary Pirates' Sean Connery and his large band of followers, who are seeking restitution for a long political imprisonment by his family. In Washington, dynamic young President Teddy Roosevelt (brilliantly portrayed by Brian Keith) uses the incident to send in American marines, both to rescue the family, and influence the country's politics (much to the chagrin of Secretary of State John Huston!) Privately, Roosevelt admires the Arab's courage and honor, and wishes the two could face off in a duel to resolve matters.<br><br>\nAs her captivity continues, Bergen learns that the real villain is not Connery, who is truly the 'Chosen' leader of his people, but those who imprisoned him. The Americans discover this, too, as they see alliances being forged between the usurpers and greedy European powers, particularly Germany. Ultimately, this leads to a rip-roaring battle between the two forces, full of unforgettable images (Connery on horseback, at full gallop, snatching up a rifle offered by Bergen's son, is one of the great moments in film history!), as the film reaches a VERY satisfying conclusion.<br><br>\nThere are many wonderful aspects to this film, and Jerry Goldsmith's rousing score must be singled out; it is one of the finest of his long career, ranking with his soundtracks for 'Star Trek: The Motion Picture', and 'Patton'.<br><br>\n'The Wind and the Lion' is the kind of epic adventure \"they don't make anymore\". Happily, John Milius has proven that cliche wrong. This film is ABSOLUTELY essential in any Connery or action film collection. I HIGHLY recommend it!","user":"cariart","rank":[94,113]},{"title":"Another film where I almost can't seem to find enough nice things to say about it","rating":14,"date":"14 September 2003","review":"After reviewing others' comments I have to say that I agree with most of them, even to some degree with some of the seemingly disparaging ones. In that regard, however, I would have to say to those disappointed with the film because of the considerable liberties it takes with the historical facts that they should bear in mind that this film is clearly intended as a pure adventure story with only enough depth to get the audience emotionally involved (which may explain its undercurrent of political satire so suggestive of the immediate post-Vietnam era in which it was made and released), and could never have been intended as a theatrical representation of historical fact. I'm inclined to doubt you can do both successfully in the same film, at least not without losing a lot of the breezy, lighthearted simplicity that makes the adventure movie what it is in the first place. I think adventure movies deliberately ignore deeper issues raised by the events they treat that could be expected to lead to emotional conflict in the minds of the audience.  Thus, in the typical adventure movie there are well-defined good guys and bad guys and motivations and justifications are crystal-clear. On the other hand, real history is full of ambiguities and complexities which raise deeper issues and conflicting feelings in the audience's consciousness, leading to an essentially heavier, more deeply dramatic treatment. Thus, if the producer had tried to make the plot of this film completely accurate he would have wound up with more of a drama than an adventure film, and you would have had a completely different kind of movie all together. Consequently, criticizing this film for not dealing with the deeper issues behind the Morocco crisis of 1904 is like criticizing *Raiders of the Lost Ark* for not treating the evils of Nazism more seriously than it did.  *The Wind &amp; the Lion* is like *Raiders*, not *Schindler's List*.<br><br>\nMoreover, even apart from the numerous variances from actual history found in the plot (they even moved the date of the event several months to bring it closer to the presidential election), I have to wonder how accurately it portrays Berber culture or even Theodore Roosevelt (whose portrait hangs on the wall directly above my computer monitor while I write this and about and even by whom I have many books including a complete set of his papers, as edited), however entertaining and appealing they may appear in the film. Nevertheless, because of their interesting and sympathetic treatment, this remains one of my favorite movies.  So, if these matters still trouble you when you watch the movie, do what I find comes more or less automatically to me and try thinking of it as basically pure fiction and you should like it just fine.<br><br>Having said that, though, one of the best things about this film is that irrespective of what the writers or director did with it to make a lighthearted adventure story, other departments seemingly spared no pains in making it every bit as believable, if not actually accurate, as possible. First, I would bet money that the extras in the scene where the Marines land and storm the palace were real Unites States Marines specifically recruited for the part - note the haircuts, the prolonged double-timing in heavy uniforms, the fact that everybody stays in step, the shouted close-order drill commands, and just their general bearing or attitude (if you've ever spent time with Marines or seen one of their little public relations demonstrations at a Marine Corps base you'll know what I mean). Second, Steve Kanally got into his part in a serious way, portraying a practically flawless Marine Corps \"recruiting poster\" company commander - this is exactly the way the Marine Corps wants its people to come across when they are showing off for the public. Third, in the scene in the U.S. consul's office Steve Kanally historically accurately relates that he has \"two 'reinforced' rifle companies\" with which to seize the palace, and his statement is realized in deed when the Marines land on the wharf, as well as when they finally reach the palace, because you will see that not only are Marines present but also U.S. Navy sailors backing them up - i.e., two rifle companies reinforced with sailors from whatever ships that landed them.<br><br>\nSuch leads me to the detail that is my favorite because it is so subtle that it is hard to imagine much more than literally a handful of viewers among the thousands who would see this film ever being likely to appreciate it. In the book *American Naval History - An Illustrated Chronology* (published some years after the film was made) naval historian Jack Sweetman relates that in the actual event the Marines were landed from the cruiser USS BROOKLYN.  When you see the Marines landing in the film you will note a very antique-looking steamship looming prominently in the background. This is obviously a matte painting inserted using special effects techniques because probably the only ship still existing in the world that looks anything like that is a stationary floating museum, the cruiser USS OLYMPIA of Spanish-American War fame, and it would not be available unless the producer was willing to shoot that scene in downtown Philadelphia. More to the point, consideration of the depiction by anyone with a relevant photograph or two and basic sensitization to ship identification issues reveals that the ship pictured isn't the OLYMPIA. There are not many books easy to find these days that would help you identify the ship (I know of only two), but if you were to make the effort you would be rewarded with an unmistakable solution. The raised fo'c's'l', three very tall stacks, turret locations, and sweep of the stern unambiguously identify this vessel as just one ship and one ship only, and by now I shouldn't have to tell you its name, but of course it is the BROOKLYN. My hat's still off to the Art Department for taking that much trouble to get something so easy to disregard so right.<br><br>Anyway, this film which has just about everything this writer could want in an adventure movie: not only Theodore Roosevelt and a lot of Marines at their most virile kick-butt best, but expansive Americanism at its optimistic best (\"we have men who can do anything - we have men who can FLY\"), Sean Connery as a highly appealing charismatic leader (who at one point very plausibly takes out about ten scum-bucket thug types with aplomb John Wayne could envy), a long cavalry sequence with seemingly hundreds of riders culminating in a good old-fashioned saber charge, a \"kid\" angle (which reminds you how to look at this thing, if you ask me), a certain amount of witty repartee, healthy doses of chivalry throughout, a romantic aspect that is not wholly gratuitous, and not the least, a very feminine and attractive heroine with enough Yankee grit and determination to satisfy Katharine Hepburn.  Rent it, buy it, watch it!","user":"Gatorman9","rank":[57,69]},{"title":"brilliant","rating":10,"date":"16 August 2004","review":"A movie I've seen and enjoyed possibly more than any other movie. I first saw it as a kid and loved the drama and the great climactic battle. As I got older, I enjoyed it as much or more than before, but now due to all of the components that work together to make a true classic. The acting is great (especially Keith as T. Roosevelt), the cinematography spectacular, the script is full of gems, and the directing pulls it all together wonderfully. It's loosely based on an actual event, and it shows rush of Europe and a newly emergent America to carve up the 'Sick old Man' (the Ottoman Empire) as it collapses in a fashion unlike any other 'historical' movie I've seen. Humor, drama, action, love...it's got it all and deserves far more acclaim (much like 'The Great Waldo Pepper').","user":"sushifreak-1","rank":[45,62]}]