[{"title":"An overlooked treasure","rating":7,"date":"21 February 2005","review":"Never turning up on television, long out of print on video, and never released to DVD, HOUSE OF THE LONG SHADOWS has fallen prey to neglect in recent times. To a degree, this is understandable; taken purely on its own, HOUSE at first seems to emerge a bit disappointing today. The oft-cited problem is that the four horror stars seem painfully marginalized in order to make way for Desi Arnaz Jr. But, when seen in a larger context, HOUSE rises far above its humble origins and becomes something much greater than the sum of its parts. Much like James Whale's THE OLD DARK HOUSE - a film that shares much in common with HOUSE - it is a film that requires multiple viewings to fully appreciate.<br><br>Just as Universal's Dracula of 1931 inspired and influenced a cycle of horror films that would grow, mature, mutate, and ultimately flounder in various forms till the late Forties, so too did another horror zeitgeist bloom during the late Fifties, Sixties and Seventies. The British studio that had produced 1957's groundbreaking THE CURSE OF FRANKENSTEIN, Hammer Films, found great success in the genre over the next twenty years, not infrequently making use of Christopher \"Dracula\" Lee and Peter \"Frankenstein\" Cushing. Meanwhile, in Hollywood, American International found their superstar in Vincent Price, whom they headlined in a series of literate, atmospheric Edgar Allan Poe adaptations, beginning with THE FALL OF THE HOUSE OF USHER in 1960. Eventually, this series too would cross the Atlantic. The popularity (and profitability) of these scare shows insured a legion of second-rate cheapness from various entities, many of which utilized Shakespearian actor and erstwhile Universal horror veteran John Carradine, who crept his arthritic way through such low-budgeters as GALLERY OF HORRORS and BLOOD OF DRACULA'S CASTLE.<br><br>But, by 1982, this cycle of traditional horrors had seemingly come to a dead end. Hammer and AIP were no longer producing feature films, and most of the great horror stars of the time were now electing to either shoot for mainstream success or a semi-retirement save for the occasional film and television cameo appearance. As the Eighties dawned too, the genre was foregoing Gothic horror in favor of the summer camp bloodbath, the holiday massacre, and the dream-slaying slasher. In the midst of these gruesome developments however, director Pete Walker, not unfamiliar with bloody subject matter himself, decided to provide the old-fashioned approach one last go-around, and gather the very icons of that style to do it.<br><br>The plot is old humbug, another revitalization of Earl Derr Bigger's old standard Seven Keys to Baldpate, which had been filmed a number of times before. Jaded novelist Arnaz accepts a bet from his impish publisher (Richard Todd), which involves him spending 24 hours in an old Welsh mansion and writing a Bronte-like Gothic story. As the stormy night progresses, various dodgy characters turn up who, as it emerges, are all members of the benighted Grisbane family, gathered on this night to release a horrible secret in the attic. Before long, various unwary visitors - as well as the Grisbanes themselves - begin to be murdered in grisly ways by a mysterious psychopath. Many twists and turns later, the narrative works its way toward a lighthearted conclusion.<br><br>There had long been plans to unite the four horror superstars in one film, but scheduling conflicts had made it impossible. Finally, the opportunity arrived with this project, and all are well served by their roles here. Each is allowed to indulge in his particular acting persona. Price is flamboyant and theatrical, Lee imperious and sinister, Cushing genteel and sympathetic, Carradine sonorous and stentorian. Price in particular excels here, and this was his last real opportunity to shine in a full-fledged horror film. Though he would return to the genre two more times before his death in 1993, neither his embarrassing appearance as an expletive-spewing sorcerer in BLOODBATH IN THE HOUSE OF DEATH or his cantankerous turn hosting THE OFFSPRING can compare to his grandly overstated Lionel Grisbane. In particular, Lionel's pitched introduction at the doorway is unforgettable, a true highlight of horror cinema.<br><br>If there is a major regret here, it's that Cannon opted to re-cut the film for some theatrical showings - and that's the version released to VHS years ago. This move appears to have been done in order to play up the horror content and mute the comedy. Though I've never seen the original cut, it almost unquestionably would have been preferable. Both Price and Cushing seemed to feel so, and lamented the fact that many of the comic build-ups were left in, only to have the punch lines cut. The real loss was the original end credits sequences, in which each member of the cast steps out of character to take a final bow.<br><br>But, in the end, the shortcomings matter little. HOUSE stands as truly the last of its kind, and more than that, can be seen as the point of embarkation for a new style. Just as Universal provided the iconographic monsters of the Thirties and Forties with a peculiarly reverential send-off in ABBOTT AND COSTELLO MEET FRANKENSTEN, so too does HOUSE OF THE LONG SHADOWS allow its four veteran bogeymen of the Sixties and Seventies to gracefully bow out, in character and with their dignity intact. It's sublimely appropriate that the film should meld Eighties slasher/body-count horror themes (gruesomely accented ax murders, stabbings, acid baths, etc.) with the traditional Gothic approach these men specialized in; by taking part in those very situations themselves, Price, Lee, Cushing, and Carradine thereby \"pass the torch\" to the knife-wielding maniacs that would come to rule the genre in their place. Seen in this light, the film's faults seem to considerably melt away, and one realizes what a true, unique gem we have here. That is, a lighthearted but affectionate good-bye to twenty-five years of classic horror films executed with great deft and style.","user":"Sanguinaire","rank":[62,73]},{"title":"A unique film - just forget about its weaknesses!","rating":2,"date":"2 November 2001","review":"This is a horror film aficianado's dream - the only time that Peter Cushing, John Carradine, Christopher Lee and Vincent Price appeared in the same film and the same scenes together!<br><br>Forget about the ponderous build-up to the appearance of the stars and the lamentable arrogance of Desi Arnaz Jr. in a forgettable role (he can't hold a torch to the acting abilities of his famous co-stars!).  The cliched surroundings of a dark, haunted house can also be criticised; but this is the ideal platform for the horror greats on show to perform in a typically professional fashion.<br><br>Peter Cushing's drunken characterization is very well done and Vincent Price's grand dialogue is reeled off in an extremely believable way. Christopher Lee's role is also enjoyably wooden and in the mould that we have come to expect over the years!<br><br>The film is guilty of faulty pacing - the start is slow but the execution of murders later in the film comes relentlessly and with little subtlety in thought or execution.  However, the sole purpose of the film is to provide a horrific who-dunnit in an old-fashioned way with the top stars of the genre!<br><br>The ending also ensures that the viewer is never quite confident that the story's resolution has been provided.<br><br>Not a masterpiece by any means , but a fitting tribute to the stars in the horror field, who have entertained us so much in the past and will continue to do so in the future!","user":"The Welsh Raging Bull","rank":[29,33]},{"title":"The Force of Destiny","rating":6,"date":"6 June 2001","review":"This is the only film I can think of that has all four horror greats in the same film at the same time and in the same scenes.  Vincent Price, Peter Cushing, Christopher Lee, and John Carradine are the big four, and their presence alone makes seeing this film a must.  I don't think any other film had three of these men in the same film, same time, and same scenes(Scream and Scream Again has Lee, Cushing, and Price, but Cushing does not share screen time with either Lee or Price).  The men are all still great to see and brought a flood of nostalgia to me as they made their entrances into the film.  The film, however, is weak, and there really is no denying that.  I like the film because of the four boogeymen, but cannot say in good faith that it is a good film.  It is not.  The story concerns an author having a bet with his publisher to stay in a creepy place and produce a book in one evening for twenty thousand dollars.  It is a very worn plot, and to make matters worse, the scriptwriter butchers his way through the script trying to squeeze out anything that might have been thoughtful and original.  The male lead is none other that that master thespian Desi Arnaz Jr.  I know hearing his name makes you tingle with anticipation, but this man has no clue how to perform.  Plainly put, he is awful, and painful to watch as he delivers hackneyed dialogue with a smug manner.  He certainly canot hold his own with the reverent cast or even female character actress Shelia Keith who really shines in her small role.  Some of the dialogue is funny, some serious, but there are only four reasons to watch this film:  Price, Cushing, Lee, and Carradine.  They put in this film what little life this film has.  Of the four, watch for Vincent Price playing ever the ham!  He is superb.","user":"BaronBl00d","rank":[20,23]}]