[{"title":"Fine Hammer suspense","rating":23,"date":"23 April 2002","review":"This is another of the underrated and seldom seen suspense films that Hammer put out in the late 1950's, early 60's. It has sort of a Columbo flavor to it as we see the sinister Van Eyck very creatively murdering his wife in the opening scenes and spending the rest of the film attempting to convince a suspicious niece that he is innocent. It is a very atmospheric black and white film, a media which should be taken advantage of more even today as a tool to establish mood. Van Eyck is superb as the villain and the supporting cast is first rate. The Snorkel is not really a classic but is solid and holds up fairly well after almost half a century. Catch this one on cable or video when you can, you won't be disappointed.","user":"Tommy-5","rank":[34,35]},{"title":"Pure Genius","rating":8,"date":"16 March 2015","review":"Although the police have termed her mother's death by gas a suicide, a teenage girl (Mandy Miller) believes her step-father (Peter VanEyck) murdered her.<br><br>Hammer may be best known for their horror films, but they made some pretty fine thrillers and murder mysteries, too, as this film attests. Helmed by Guy Green (who made his name under David Lean) and written by Hammer's Jimmy Sangster, this is just pure genius beginning to end.<br><br>From the opening scene, we know how the killer does his work... but then we watch and see if his teenage stepdaughter can find out. Blaming someone for murder is one thing, but finding solid proof is something else entirely.","user":"gavin6942","rank":[13,13]},{"title":"Entertaining","rating":6,"date":"23 July 2013","review":"Minor but entertaining Hammer thriller, not quite reaching the heights of other entries in their \"psychological thrillers\" ouevre, but still effective.<br><br>The film starts right off with it's main murderer on screen committing his evil deed, clearly establishing his (and the film's) gimmick of the snorkel used as an accessory to murder. So from the very beginning we know this is not going to be a whodunnit. What we have here instead here is a \"who will find out\" plot. <br><br>Once the opening credits have finished, the main plot of the film starts with the daughter of the murder victim feeling almost positive that she knows who is responsible for the deed but at the same time, unable to prove it, as nobody has been able to work out how the act was committed, and therefore the killer has got away with it. The more agitated the daughter becomes, the more the killer starts to see her as a threat to his freedom, and so a cat and mouse game starts to build as both try to outwit each other.<br><br>This sounds complicated, and it is, but the roles in the film are quite well defined. The killer is a creepy but charismatic older man, able to convince everyone that he is actually mourning his dead wife, and the \"suspector\" is a teenage girl who everyone thinks is just over imaginative. I could almost imagine William Castle making this film! The acting is very good, and it's all very British and proper. There are plot twists and the climax is clever and worth waiting for, although as a whole the film has dated somewhat. Quite hard to see now, seemingly only available on the Sony 6 film box set DVD \"Icons of Suspense\", which is worth a purchase due to it having 5 other hard to see Hammer thrillers. So \"The Snorkel\" gets a thumbs up from me.","user":"adriangr","rank":[11,11]}]