[{"title":"This is one of the greatest exploitation movies ever!","rating":10,"date":"6 April 2006","review":"Extreme violence, graphic nudity, white slavery, a diabolical midget, forced ballet, imprisoned girls being caned on their bare arses; this movie has everything! How can this movie get such a low rating??? Any fan of John Water's \"Pink Flamingos\" or Troma movies such as \"Mother's Day\" or \"Toxic Avenger\" will find this movie to be a masterpiece! Yes, it is demented. Sure, it is in bad taste. Of course it is as sick as hell, but I love this movie. I have seen many movies that attempt to push the boundaries of decency, but this is the funniest one I have ever been privileged enough to view. Sure, you can get the nudity and violence in a film like Caligula or Ilsa, but this movie offers so much more. The humor is darker than a grizzly bears butt during new moon, but if you are as twisted as I am you will want to view this cinematic opus of insanity over and over again. I have watched it many times, and will watch it again many times in the future. When I have had a bad day, there is nothing like this farcical film about captive women being abused by a midget and a madman to cheer me up.","user":"dollpenguin","rank":[34,42]},{"title":"Unforgettable","rating":7,"date":"10 November 1998","review":"It's VERY hard to believe that it has already been four years since I first saw this film.  I vividly remember the non-stop tastelessness, the pathetic attempts at humour, the frequent gore, and of course, Ralphus, who is one of the most vile characters that I have ever seen in the movies.  Yet, having said all that, I liked this movie.  There are some scenes that are as funny as anything that you're ever likely to see...although in a SICK way.  It isn't for the squeamish or the easily offended, but if you can appreciate low-budget trash for what it is, then you'll probably find that this movie is well worth your time.","user":"Tito-8","rank":[34,44]},{"title":"In bad taste and proud of it!","rating":9,"date":"5 March 2003","review":"I bless the day that I purchased my DVD player and PC, for they have both allowed me to sample rare delights such as this. The BBFC have never taken too kindly to this kind of movie, thus leaving the british fans of exploitation and horror movies with little to write home about...until now!<br><br>For those of you wishing to open your minds, scour the web and grab yourself a sense of humour (albeit twisted), Bloodsucking Freaks is probably a good starting point.<br><br>Directed by Joel M. Reed and starring Seamus O'brien, The movie is set predominantly in a New York 'theatre of the macabre' Where the evil, yet witty, Sardu (O'brien) delights in torturing young (and often naked) women on stage with various medieval devices, for an audience that believe the proceedings to be nothing more than illusions. Off course, they are not!<br><br>The wafer thin storyline revolves around Sardu trying to pass off his 'work' as art, but a disagreable art critic who attends one of Sardu's shows says he 'has seen better' and refuses to review his Grand Guignal...so Sardu plots revenge!<br><br>What follows, is about 80 minutes of bad taste, poor acting, terrible special effects, nudity, violence and gore, all polished off in a nice campy 1970's fashion. Basically, everything I enjoy in a movie that cannot possibly be taken seriously!<br><br>Bloodsucking Freaks is pure trash...and I mean that in the nicest possible way! Watch for Sardu's killer line...\"her mouth would make an interesting urinal\"","user":"Bezzer35","rank":[24,30]}]