[{"title":"A truly wonderful international comedy","rating":8,"date":"29 July 2001","review":"I don't care what country you are from or what your sexuality is, La Cage Aux Folles is an endearing comedy the likes of which comes around perhaps once a decade.<br><br>Michael Serrault is the centerpiece of the film, as the star of the La Cage revue and the \"mother\" of the young man wishing to marry the daughter of an incredibly \"moral\" politico.  The toast scene had me rolling on the floor...Serrault's high-pitched nervous yelps punctuate the film's comedy.<br><br>One of the few cult films really deserving of that status, La Cage is not one to be missed.","user":"Vigilante-407","rank":[37,39]},{"title":"Makes the remake look like a bad joke (SPOILERS)","rating":10,"date":"31 January 2003","review":"It is impossible for me, having been exposed to The Birdcage first, to not compare the original and the remake. Almost from the word go I sensed a great disparity within the two films even though the remake ended up being and uninspired copy and paste writing job. The first thing that lends itself to creating a different tone is the music composed by Ennio Morricone. The music in the Birdcage by Mark Mothersbaugh and Jonathan Tunick is forgettable seeing as I've seen the remake three or four times and can't remember a single note while I've seen the original once and can still remember Morricone's score.<br><br>Ennio Morricone's gentle music takes us into a world that we shouldn't be afraid of. The key word to thinking about his music is sensitive. It exudes softness, tenderness which is aped by the action and the actors who are not ridiculous characterizations but with real people and real emotions. Due to the fact that all scenes include practically the same dialogue it is a huge complement to Ugo Tognazzi and Michel Serrault that they made their characters more three-dimensional and real than Robin Williams and Nathan Lane.<br><br>The American interpretation of this film is also vastly different than the French. Due to the fact that this film deals with homosexuality which is a topic that still is tinged with taboo here Americans have to turn the film into a farce of a farce. In other words the movie has to be ridiculously over the top to be accepted. The pathetic part of the remake is that it perpetuates stereotypes and while the stereotypes do exist (for how do stereotypes come into being?) by merely making them more human we can see beyond a stereotype to the person portrayed. A perfect example of this is the opening scene. They are the same in both films. Renato (Armand in the American version) tries to get Albin (Albert) onto the stage to perform his act. In the American version Nathan Lane makes his character seem like a whining melodramatic pain-in-the-you-know-what because of this the scene is very funny but emotionally superficial. In the French version practically the same dialogue is spoken but because of the way Michel Serrault delivers his lines and because of the more subdued expression he has on his face the words take on weight. They have meaning they come across as real concerns for the relationship as opposed to a paranoid delusion and an excuse not to go on stage. It made me believe the affair was a possibility all over again and made me forget about the son and his impending marriage.<br><br>The deception of the possibility that Renato is having an affair is aided by the son's appearance. In the American version he was clean-cut and Ivy League here the son in full 1970s look long hair included.<br><br>\nLa Cage aux folles in 1978, even in France, was a more progressive film depicting a gay relationship, a gay couple who had raised a son and how the couple still had to pretend in certain social situation while longing to be completely honest. By 1996 in the United States homosexuality was not such a hot topic of controversy yet a slapstick-esque context is the only way the mainstream will be able to accept gay characters. Dramas about homosexuals are sole dominion of the art houses.<br><br>This is a film that does something very difficult to do. It takes a situation that is rich with comedy and imbues it with humanity and warmth. Making this a layered comedy which is something rare regardless of the country the film is made in. Le Cage aux folles is a really fun film which takes a serious look at human relationships and society's perception of people's lifestyles without putting any one down or getting preachy. It's a lot of fun.","user":"ColeSear","rank":[26,27]},{"title":"C'Est magnifique! Terrific French farce transcends the language barrier in getting its laughs and message across.","rating":9,"date":"19 May 2001","review":"Already considered a mainstream cult classic, \"La Cage aux Folles\" ranks as one of the biggest crossover box-office hits ever to land on American soil. And for very good reason.   Italy's Ugo Tognazzi and Gallic Michel Serrault are the most inspiring and oddest couple to appear on screen since Jack Lemmon and Walter Matthau, and just as entertainingly colorful as Siegfried &amp; Roy!<br><br>Tognazzi essays the role of Renato, a suave, successful, over-the-hill cabaret owner whose nightly drag revues spotlight his long-time partner Albin (who goes by the stage name \"Zaza\"), a touchy, temperamental, hopelessly mincing diva who has got to be seen to be believed.  A neurotic wreck most of the time, Zaza (Serrault) is a full-time job for the exasperated Renato, needing constant coddling and stroking when it comes to \"her\" age (she's up there), figure (a deep fondness for chocolates hasn't helped), and affairs of the heart (they are celebrating their 20th year anniversary, but the invariably jealous Albin/Zaza is sure Renato is playing around while she's performing).  Getting the insecure Zaza on stage every night usually includes your usual number of psychoanalytical sessions, shoe-throwing tirades and prescription medicines.<br><br>The fun begins after Renato's son, Laurent, conceived during a temporary moment of heterosexual abandon (\"you should try everything once\"), informs his father of his plans to marry -- a girl!  The daughter of a staunch, right-wing bureaucrat whose political party is in the midst of a shocking moral scandal, Laurent is obligated to introduce her priggish parents (who think a big traditional wedding could restore the party's reputation) to his \"straight\" parents.  The fiancee has passed them off as a respected cultural attaché for the Italian embassy and a Catholic housewife/mother of six.<br><br>The resulting farcical set-up unleashes a barrage of priceless comic moments as the pair must not only refurnish their \"gay-ly\" luxorious apartment, which is right above the nightclub, but pass themselves off as heterosexuals.  The crème de la crème of all scenes takes place at a restaurant where the somewhat more virile Renato instructs Albin how to drink tea, butter toast, and walk butch á la John Wayne!  The dinner party segment too is absolutely crammed with riotous sight gags, especially the erotically-designed soup bowls and shoeless butler bits.<br><br>The cast is impeccable.  Serrault and Tognazzi are to be cherished for pulling off such an acting coup.  Under normal circumstances, these two roles could be hammy, forced and quite offensive.  But in the hands of this pair, they are not only funny, but credible and even touching.  Serrault, in particular, is a marvel, with every gesture, tone and vocal inflection coming from a real emotional center, while Tognazzi's  charming boulevardier provides the perfect \"straight\" man to Serrault's antics. Together, their \"I am what I am\" message really hits home.  You believe these two as a couple. You believe their longevity.  You believe their spats.  You believe their devotion.<br><br>Michel Galabru and Carmen Scarpitta are superb as the strict, moral-minded parents who slowly come to the horrifying realization that all is not right with their prospective son-in-law's family.  Benny Luke has some wonderfully outré moments as the gay couple's barefoot live-in \"French maid\" who dusts the house in skimpy hot pants and very little else.  Claire Maurier is effective as Laurent's estranged mother, who tries to get back in Laurent's good graces by agreeing to be part of the dinner party charade.  <br><br>\nTwo lesser sequels and an abominable American remake cannot tarnish the beauty of the original.  WARNING: When renting this video, make sure you rent the version with sub-titles, not the inferior English-dubbed version. Much of Michel Serrault's magic is in his voice.","user":"gbrumburgh","rank":[27,29]}]