[{"title":"Give your kids a lesson in true childhood: w/o the cellphone, Xbox, internet, psp, etc... ad nauseum","rating":10,"date":"12 October 2006","review":"Post VCR generations, find out why all your digital gadgets, the internet, and marketing based \"teen wanna-be-adult\" dramas have nothing to do with childhood bliss, friendships and lasting (non digital) memories.<br><br>Before I begin my comments, I want to say that my profession is in technology, and therefore, I can appreciate what modern technology has allowed us to accomplish. DVD copies of films from the 70's that can be viewed whenever you want is a prime example of this. However, I think modern parents/kids should remind themselves, and show their kids the joy of being a kid without the over-scheduling, \"over-marketing\" and \"over-connectedness\" that is, in my opinion ruining the childhood experience.<br><br>Like the other posts here, I too saw this film on HBO back in the late 70's when HBO programming didn't start until 2:30pm most days, and signed off by 2-3am depending on whether or not it was a weekday or weekend night. Remember the rolling loop of the day's scheduled programming with the jazzy Maynard Ferguson (and other instrumental only) soundtracks? Remember getting the monthly HBO guide and mapping out movies and dates to watch them, sometimes up to weeks in advance before they were scheduled to air? Oddly enough, in an analog world, as a kid back then, even without wearing a watch, kids were more aware of time and schedules, and planning, to watch TV!!! You couldn't just turn on the TV and watch cartoons at anytime, put a DVD or video tape in whenever. You had to plan to watch what you wanted, and most days, after playing and dinner and homework, you may have watched TV for only an hour or so. This is the reason why Kenny and Company is such a special film.<br><br>Kenny and Company, a true independent, ultra low-budget, \"B film\" as they were referred to back then, is a true time capsule of life as a suburban adolescent in the 70's. The sense of freedom, that feeling of every day being totally new, another day of adventure, of days lasting seemingly forever is luckily and magically captured here, for generations. So many scenes are just that; snapshots of not quite there youthful exuberance. Moments that you didn't think much of as they occurred, but somehow are ingrained in memory without exacting photos or audio or combined recording. The movie itself is not a recording, it is more of a window into these precious moments in Kenny and Company's lives. And what makes Kenny and Company so special is that it trusts that all of us share at least some version of the experiences in some way. Set in California, the backdrop manages not to envelop the the movie. This is a movie that most 70's kids in America could relate to, even taking in environmental/racial/economic differences. That's because the movie isn't about any of those things.<br><br>Kenny and Company instead focuses on the power of the \"semi-sort-of timelessness\" of being 11; a not quite self absorbed teen. It uses the power of very specific moments in pre-adolescence that influence that critical time in youth were the innocent cocoon is both unraveling yet very much still protecting it's larvae.<br><br>Without getting into a obtrusively descriptive plot summary, Kenny and Company is about three childhood friends and their adventures over a 4 day period including Haloween night. And in the those few days, the experiences they encounter are either comical, fearful, developmental and/or life altering, and often moments apart from each other. It is perfect in it's imperfection, with some moments a little cheesy, but isn't that par for the course at age 11?<br><br>It is a feel good movie, but not in the contemporary over produced post \"ET\", \"Goonies\",etc., Hollywood sense. It is much more genuine. In fact, after thirty years, it's safe to say that a movie of this type is truly special, simply because while it was basically shelved then before becoming a hit in Japan, a movie like this would never be made today. A sad statement of the film industry which would rather portray kids as smaller versions of sarcastic adults. And while I think for those of us who were fortunate enough to be of the same age group as the characters in the movie (now in our mid to late thirties to late forties) and also lucky enough to have seen this movie at the time, the connection/draw was simply magnetic. You knew it was authentic because you were right there, probably watching on some early autumn evening after school, Halloween nearing, after having walked home from school, after having spent some time at your best friends house playing outside around the neighborhood, trying to build something, or playing pranks or just exploring. Even from a cinematic perspective the movie shines; the warm California sunshine, the cool of Autumn evening, filmed in that classic 70's slight haze effect. <br><br>Kenny and Company is an exceedingly accurate portrayal of this period of time even for adults at the time. The adults are visible to the children; admired and despised alike, as parents, disciplinarians, and mentors. The gawking awe of the next to the next phase of development- the early twenty something is on display here. Even the sense of community, of knowing people in the neighborhood, even if only by name is true. Most of the movie's wonderfully unstructured self determining activity is completely absent for today's youth.<br><br>Over the years, I have been lucky enough to have stumbled across seeing this movie a handful of times on television on obscure stations since then. Until now, it hasn't been readily available. And each time I've viewed it, it still maintains that magical element that sadly may be gone forever. This is a movie for the ages in the sense that it can remind us of what childhood should be like. And just think, we looked pretty cool considering our parents picked out our clothes!!","user":"zengorah","rank":[26,28]},{"title":"A must see for 70's kids","rating":10,"date":"11 March 1999","review":"This film is a must see for anyone who was around 10-15 years old in 1976. Kenny and Co. doesn't miss a trick in depicting the life of a seventh-grader, his friends and enemies. Prank phone calls, over-sized school bullies, Halloween hijinks and fickle first loves, it's all here.<br><br>The director unknowingly created a time capsule of such realism that Kenny is more enjoyable now than it ever was when it was made. Best of all it doesn't try to ram some big morality trip down your throat. It just documents. And unlike in \"Stand by Me,\" the kids actually act like kids not philosophers. If there's any point at all to the story it's that the genius of kids is their unique ability to survive the banality and meanness of existence through a combination of devilish humor and harmless civil unrest.<br><br>I started breaking this film out at parties and now I get requests for it. Kenny and Co. is better the second and third times.","user":"colossus-4","rank":[19,21]},{"title":"Best kid movie, EVER!","rating":10,"date":"26 February 2005","review":"I remember seeing this movie on HBO in the 78-79 range. That's when HBO was on from 5 pm - 11 pm M-T and Friday and Saturday it stayed on till 3 am, showing the more adult movies in the wee hours.<br><br>This movie hit me directly between the eyes. I related directly with Kenny and his first love and the tension of telling her. Then the unforgettable 'should I or shouldn't I' hold her hand and the personal strength it took him to do it.<br><br>Not once during the movie did Kenny watch TV. He was always outside playing with Doug doing boy activities. I really connected with the movie when the went to get Sherman a birthday present. The department store was just that, a department store with a 4 aisle section for toys. Talk about memories.<br><br>I went on EBAY and did a search for the movie and found it available. For what its' worth, the guy I bought it from knows Raplh, the guy that played Big Doug in the movie. I now have the movie on VHS and have watched it twice in less than a week with my 8 year old son.<br><br>We laugh at the same parts of the movie every time. Some instances include Paco learning a new word, Sherman showing up at Kenny's for Trick or Treat, Doug popping Pudwell as the kids are running after Johnny and Kenny, Sherma reaching in the bag for 'candy'.<br><br>This movie really is a down to earth no frills kid movie. No underlying tones, just straight kid from a kids point of view. Kenny trying to understand death and what happens afterward when his dog Bob has to be put down. Dealing with a bully but not letting it control his everyday life.<br><br>I have to say, that I can remember seeing my first Playboy. When Sherman brings his old mans Playboy in the garage and hearing the boys talk about having baby's, they didn't have the slightest idea, and looking at today's kids. Today's kids are really losing out. Growing up too fast and missing out on what that movie portrays.<br><br>It is a great movie and it should be a must see for every Dad and 8-12 year old son. Tyler keeps asking to watch it with me. I'm figuring 3 times a month, making it something special and hopefully he'll get as much from it as I did.<br><br>Rent it, Buy it, but above all else SEE IT!!! Tom","user":"tjw0099","rank":[14,15]}]