[{"title":"Cronenberg Keeps Me Out of Canada","rating":5,"date":"5 September 2001","review":"Rabid or Rage ( do American's therefore not know what Rabid means ) begins and ends like Lawrence of Arabia: a motorcycle crash and a high body count. The similarity ends there.<br><br>Marilyn Chambers - the woman who occupies the dreams and fantasies of millions - seemingly recovers from this accident only to develop an appetite for blood.<br><br>Rabid is a modern, urban vampire film, and who better to direct it than Cronenberg.<br><br>In the hands of another, this film would be horrifically mediocre. The lonely country lane, the frozen body, the subway attack, the Santa shooting in the mall and the dark movie theatre - Cronenberg knows how to imbue a sense of emptiness and despair into each scene. The film is full of pathos and 70's paranoia. Fear of woman (especially such a sexual one - Eve and such like), fear of government and fear of those around us - Cronenberg feeds off such hysteria, just as Chambers feeds off her victims. The underarm worm is quite clearly a female penis.<br><br>I don't mean to make Rabid sound grand or profound. It isn't really. It's just Outbreak meets Vampire Circus. I do think, however, that Cronenberg always seeks to challenge Western values and boundaries by using hidden evils, distortions and deformed humanity.<br><br>Marilyn of course looks fantastic, and she is frequently topless. As an adolescent I was attracted and haunted by the idea of being attacked by such a woman. \"No, no, don't go, it's freezing cold - hold me.\" You know that if you do, death will shortly follow, but who could resist?","user":"hungadunga","rank":[28,30]},{"title":"Creepy early Cronenberg","rating":8,"date":"10 November 2007","review":"The second big-screen feature from Canadian horror genius David Cronenberg was this twisted well-done low budgeter.<br><br>Following a motorcycle wreck, a young woman receives skin grafts that cause her to have a murderous thrust for blood - which leads to a deadly plague.<br><br>Rabid is one nicely done little shocker. It has a clever storyline that's a unique take on the vampire/zombie genres. The makeup work is gruesomely good, the atmosphere cold and fitting, and the low-budget ambiguously well used to create a horror film that was a bit ahead of its time. In addition the cast isn't bad. Star Marylin Chambers, though better known as a porn actress, does a decent performance as the victim of the strange infection. Frank Moore is also good as Chambers' boyfriend who must save her before disaster strikes.<br><br>While granted that Rabid isn't as great as the films that Cronenberg would later unleash (The Brood, Videodrome, Dead Zone etc.) it is never the less a solid sophomore effort that well-foreshadowed the greatness Cronenberg would achieve in his later films.<br><br>*** out of ****","user":"Nightman85","rank":[19,20]},{"title":"David Cronenberg's second feature film!","rating":10,"date":"14 October 2004","review":"Rabid (1977) is a strange film about a parasitic virus that inhabit's the body of a young woman (Marilyn Chambers). She receives this strange mutation after a new experimental procedure is performed upon her after she and her boyfriend were involved in a motorcycle accident. The doctors at a plastic surgery clinic save her life but her body revolts and mutates against the new cellular structure. The staff at the clinic and it's patients must answer for trying to defy nature.<br><br>A very good film from David Cronenberg. He further explores the topic of man fighting mutations from within or trying to change human nature. it's a topic that he returns to from time to time. He started off from Shivers and continued it in Rabid, The Brood, Scanners and Videodrome. Like most of his earlier films, this one was shot in around around the province of Quebec. Partially funded by the Canadian government, this twisted low budget wonder is a must for cerebral horror fans and Cronenberg devotees. Rabid benefits from the director's trademark clinical and cold aura.<br><br>I have to highly recommend this flick. the one I saw clocked it at almost 92 minutes. I haven't seen this film in awhile. I watched it on a D.V.D. import from Canada. I don't know how long the U.S. release was but this version seemed to have a little more blood than the one I watched seven years ago on an old V.H.S. copy. The Canadian Disc had a feature length commentary by David Cronenberg, a twenty some odd minute interview and a few other extras. The movie was restored and in it's proper film format.<br><br>Highly recommended.","user":"Captain_Couth","rank":[31,36]}]