[{"title":"TOTAL cinema.","rating":15,"date":"15 March 2001","review":"One charge laid against the revered director Satyajit Ray was that, much like Kurosawa in Japan, his films weren't national or native enough, that they gave a Westerner's view of India, one moulded in Western forms, rather than something 'authentically' Indian.  Another, related charge, is that he betrayed his subject matter - poverty, nature, repression, obsession etc. - by the fussy perfectionism of his style; David Thomson tells the story of Francois Truffaut, himself survivor of an impoverished, disruptive background, walking out of the aristocratic Ray's 'Pather Panchali', 'wearied by so much perfection'.<br><br>I don't know what 'authentically Indian' means; I certainly don't know whether authenticity, so grimly linked to nationalism, is a desirable aim. I suppose an authentically Indian film would not be an exquisite miniature, but a huge, sprawling, unstable, visceral film, full of rupture, sensation, violence, exoticism, noise, incongruity; but these views may be as inauthentically Western as any other.  That said, 'The Cloud-Capped Star' seems to me to be a truer film than 'Pather', not necessarily as a representation of Indian experience, but of human experience, and certainly as a cinema experience, of which it is rare and overwhelming.<br><br>The irony is that the film is as replete with Western influences as Ray's. Director Ritwik Ghatak was a left-winger, and his film is a thrilling assault on mind and body, using many of the methods developed by Western leftists.  The film is unashamedly a melodrama - the harrowing tale of a beautiful, clever, promising young woman who is mentally and physically broken by the relentless fending of a family alternately selfish and feckless.  <br><br>Like the traditional melodrama , its primary appeal is emotional, as the heroine is battered by an inexorable series of crises, usually signalled by percussive frenzy in the music; characterisation is monochrome, the saintly goodness of the heroine contrasitng with the mean self-interest or cowardice of the rest.  <br><br>But this is melodrama filtered through those of Douglas Sirk, who took this despised form and gave it a critical dimension.  Not only does Ghatak use Sirkian devices - frames within frames, intrusive decor, 'unrealistic' lighting - but he takes the idea of the hysterical body to its limits - just as a character who must repress her emotions betrays them in physical pressures, so the repressions of character and narrative are displaced onto the form of the film, which is full of violent jump cuts, extreme clashes of composition, space and editing,  deliberate dis-integration of musical numbers, a radical use of lighting and sound (including bizarre sci-fi whinings), taken to an extreme unavailable to Sirk in Hollywood, giving the film a formal hysteria that is reminiscent of another Sirk admirer, Godard. Did Ghatak see the contemporary 'A Bout De souffle' as he made this film? (I can imagine a tyro cineaste getting the same life-changing excitement from 'Star' as I did from the Frenchman when I was young). <br><br>\nThe use of looming close-ups and rushes of blitzkrieg montage recall Eisenstein.  The story of a family and a society is reminiscent in its breadth of a Victorian novel, while the schematic, almost scientific analysis  of a victim placed in a very carefully observed social context reminds me of Zola.  The spiritual power of the heroine's decline is even more staggering than Bresson (although, it's always women, isn't it?).<br><br>And yet, for all these formal influences, there is a faith in character missing (deliberately) in these masters, a psychological acuity mirroring the political anger.  And if the film is beautiful, it is never complacently so: it is a beauty repeatedly violated, creating a new, modern beauty.  Why has this film never made Top Ten lists?","user":"the red duchess","rank":[48,54]},{"title":"A sprawling Bengali masterpiece","rating":10,"date":"1 March 2005","review":"The visionary Bengali filmmaker Ritwik Ghatak peers into the future, and sees nothing but disintegration - succeeding at multiple levels, CLOUD-CAPPED STAR humanizes this bleak vision, by locating the drama in a Bengali family, but everything occurring is something of a howl of outrage at what had become of his divided homeland.<br><br>The central figure in this sprawling melodrama (with some coincidental resemblances to European new wave and neo-realism) is Nita, the eldest daughter in a once-middle class, intellectual family, driven by partition into refugee status in the slums of Calcutta. Varied family members react in different opportunistic ways to their reduced status, and their need to survive, all of which takes an extreme toll on Nita, who ultimately becomes the family's sole breadwinner. The performances throughout are excellent - Supriya Choudhury as Nita is riveting, and Niranjan Roy is particularly strong as Sanat. <br><br>Throughout, Ghatak boils human nature and the survival instinct down to the most ruthless basics: this is a compelling and visionary film, but there is virtually no room for lofty ideals or sentimental altruism in the world created here - mourn what one must, and do what one must do to survive. Sentiment and ideals are - in this film - luxuries, and from the cruelty of such a truism, Ghatak has created one of cinema's great, vital tragedies.<br><br>Ghatak claimed few Western cinematic influences - like Jean-Luc Godard in France and Nagisa Oshima in Japan, his primary concerns were historical and political, and also technical - how to alter cinema to express those concerns in accessible language? For Ghatak the solution was found in using outdoor locations, natural sound, idiosyncratic editing, and a minimum of the flash seen in Bollywood or Hollywood - CLOUD-CAPPED STAR is bleak, absolutely gripping, tragic and infuriating. As drama, it would definitely rank as one of the more obscure global masterpieces out there (there has yet to be an official US release on VHS or DVD), rarely seen or commented upon. This is highly unfortunate - as a film of moral/social outrage, this rivals Bresson; its' overall feel for the everyday reminds one of Italian neo-realism; it's willingness to experiment boldly evokes Godard or Oshima; in it's concerns with the status of women (another of the many themes explored here), it evokes Naruse, Sirk or Mizoguchi.<br><br>Ghatak's own biography is one of great tragedy; one could possibly read the discretely enraged hopelessness of this film as an extension of his own, and see this as a drive that would have to produce at least one masterpiece (his later SUBARNA-REKHA is also very much worth a look), even as it brought him to a premature end. For all of its' bleakness, CLOUD-CAPPED STAR is absolutely compelling - any cinephile (or student of history) would do well to see it.","user":"davidals","rank":[24,26]},{"title":"Raw passion and compelling characters","rating":8,"date":"5 July 2004","review":"The independence of India in August 1947 resulted in the partition of Bengal, a trauma etched in the minds of the people whose lives were changed forever. Nowhere is this upheaval better portrayed than in the films of Bengali director Ritwik Ghatak. An active Marxist who began his career in the Communist People's Theater, Ghatak's films never achieved widespread popularity but he is now considered to be one of the top Indian directors of the last half of the 20th century. His best known film, The Cloud-Capped Star, the first in a trilogy examining the economic effects of partition, is a powerful story about a young Indian women who sacrifices her education and marriage in order to hold her family together. Ghatak's inspiration for the character was a woman he saw at a bus stop whose beaten down appearance struck him as being typical of Bengali refugees. <br><br>Neeta (Supriya Choudhury) is the youngest daughter of a refugee family from East Pakistan who lives in a middle class home near Calcutta. Neeta is a college student whose brother Shankar (Anil Chaterjee) is a layabout, an aspiring singer who lives off the family while practicing his art and dreaming of a career on the concert stage. Neeta believes in her brother and loves him deeply but has to constantly fend off the complaints of both parents about his laziness. Neeta also has an attractive sister Gita (Gita Ghatak) and a brother Mantu (Dwiju Bhawal) who is also a promising student.<br><br>\nWhen her father (Bijon Battacharya) has a serious accident, Neeta is forced to give up her studies and find a job and Mantu gives up school to work in a factory. The father is dismayed by a world that no longer has a place for poetry or idealism and falls into a state of hopelessness. Neeta is a good-hearted young woman, but one who fails to consider her own needs and puts off plans for marriage with Sanat (Niranjan Ray), an intellectual studying for a Phd. Sanat, unwilling to wait for her, becomes infatuated with Neeta's sister Gita and they marry to Neeta's dismay. Even though Shankar eventually finds success in Bombay, Neeta's strain in having to hold the family together leads to serious illness and the family's burdens only increase. <br><br>The Cloud-Capped Star is an angry film and often bleak, but sudden bursts of sitar music and joyous singing by Shankar lighten the tone. Although the film can be overly melodramatic and unevenly acted, it contains an overriding humanism that is reminiscent of Satyajit Ray and the neo-realist films of the 40s and 50s. Ghatak's raw passion and compelling characters make it easy to overlook its flaws and the result is a tribute to the human spirit and a deeper understanding of the tragedy that partition brought to India.","user":"howard.schumann","rank":[17,21]}]