[{"title":"An Underrated Classic","rating":10,"date":"15 February 2004","review":"Godzilla 1984 stands out as one of the best and most politically imbued Godzilla films ever made and deserves more credit for what it accomplished.  Godzilla<br><br>1984 single-handedly revitalized the Godzilla franchise into the machine it is today and ushered in a new concept for what the monster could be; gone are<br><br>the kiddie children and the super-robots, the monster melees and monster<br><br>dancing - here is a return to what Godzilla truly is: and unstoppable force of nature.  The original Japanese version is far superior to the butchered American cut and their political agenda is far more subtle than the American's tactless editing of the Russian nuclear launch sequence.  Fans would do well to view<br><br>the original as it retains the history and dignity of the first Godzilla film.","user":"Skaiton","rank":[20,21]},{"title":"unfairly maligned","rating":7,"date":"7 March 2004","review":"Godzilla returns in a (somewhat) serious vehicle with a (somewhat) big budget. Americans yawned or laughed this off the screen, for the most part, but if you dig Godzilla you should dig this, his most respectable film since the 1954 original.<br><br>Yes, it's not that fast paced. No, Godzilla doesn't fight with other creatures. So what? After about twenty lurid, cheap movies that involved Godzilla in mortal combat with rubberized foes, it was nice to see him get back to menacing basics here. <br><br>While the special effects are not quite up to the Hollywood standard, they're still entertaining and reasonably convincing. American critics who slammed the film's look were being just a tad intolerant - all foreign films tend to be cheaper than ours, so inferior effects are a given. My bottom line for judging SFX is not, \"are they realistic?\" but \"are they fun?\", and the shots of Godzilla laying waste to Tokyo are indeed fun.<br><br>Godzilla fans often complain about the film's overtly political concerns and somber mood, but I have to disagree with them; I like a bit of realism, a bit of credibility. I do think that there are several better, faster-paced Godzilla films (Godzilla vs. King Ghidorah, GMK), but this is still a standout entry in the series. <br><br>Who knows when we'll get another solo vehicle for the big G? The upcoming Godzilla: Final Wars will apparently feature a total of ten monsters. At least in this movie, Godzilla had the spotlight all to himself.","user":"dr_foreman","rank":[25,27]},{"title":"The Birds","rating":8,"date":"13 April 2004","review":"Picking up 30 odd years later and ignoring all the films that were made in between, Godzilla returns to trample Tokyo. The Tokyo natives think up all sorts of goofy plans to get rid of Godzilla, one which involves a highly advanced flying tank called Super-X, the other involving the use of birds to activate an often unused portion of Godzilla's brain that resembles a bird's to lead him out of Tokyo and into a volcano, where he remains until the sequel, \"Godzilla VS Biollante\".<br><br>The \"1985\" American version includes scenes of us damned Americans trying to figure out what do and features Raymond Burr reprising his Steve Martin character from the American version of the first film. However, his first name is never used on account of comedian Steve Martin's then hot popularity. This version also gives Russians a bad name because they made the Russian commander launch the missile before he died when in the original version he died heroically trying to stop the missile's launching but failed. The death of the tramp is also shown in the original version.<br><br>\nMaybe it's the lighting or lack there of, the smoke, or just the dated quality of my VHS tape, but this is a very dark and atmospheric monster on the rampage epic and one that I hold very close to my heart for reasons I can't quite explain. Special effects run the usual gamut from good to ridiculous, and the music is pretty good. Whether or not the original version will ever be released in America remains to be seen. I'd settle for just being able to see this one on DVD somewhere.","user":"DarthBill","rank":[17,18]}]