[{"title":"a drastically underrated movie","rating":7,"date":"20 November 2007","review":"People think Timothy Hutton didn't do any good movies after winning the Oscar for Ordinary People, but that's not true. Among other really good movies he's done are Q&amp;A, Taps, Falcon &amp; The Snowman, French Kiss, and Iceman, which is way better than you'd think it would be, considering the plot is so much like Encino Man. Scintists dig up a Neanderthal and thaw him out. Some want to study him, and one (Hutton, in a good performance) just wants to communicate with him. Most of the actors are good (Danny Glover has a small role) and the script isn't stupid. The Iceman comes off as a real person, not just a furry guy with a club. Like Quest For Fire, the guy is played as a primitive person, not just an ape.<br><br>The Iceman is played by John Lone (the bad guy in Year of the Dragon and the star of The Last Emperor), He almost unrecognizable under all the makeup, but his performance is right on the money, A lot of his acting is through body language, and its really good. He conveys many emotions with subtle and unsubtle movements. Again, this is underrated movie, and Mr. Lone should have gotten an Oscar of his own for his performance.","user":"Mutakk","rank":[33,38]},{"title":"Warming sci-fi","rating":7,"date":"11 May 2003","review":"Unusually intelligent sci-fi, about a group of polar researchers who discover a hibernating (and slightly too human-looking) Neanderthal. The scientists (predictably) just want to cut him up, but Tim Hutton plays the lone anthropologist who befriends him and teaches him how to sing along to Neil Young.  At times the film (pre-CGI) seems dated in appearance, but its strength is not to underestimate the difference between the Neanderthal's world and our own, nor his capacity to deal with it.  Good to see a sci-fi film that for once is more interested in substance than surface.","user":"paul2001sw-1","rank":[31,38]},{"title":"All but a case of massive generation gap","rating":8,"date":"22 November 2008","review":"Man has always been curious about his origins and since the days of Darwin much effort have been done in tracing back the evolution of mankind to the final link where we as animals became self conscious and began advancing rapidly in terms of how much we have modified our macro biosphere in such short span of our existence.<br><br>This movie is definitive in putting the viewers in a situation where we find that we have made it extremely difficult to see things in its simple state and rather complicate it with all our cynicism and rationality. Being modern humans we like to believe that as we have gained more cranial volumes, have become more intelligent but fail miserably in explaining and bridging the differences of a few thousand years. The sense that Shepherd starts to develop in spite of all his efforts that Charlie the caveman would never actually be able to adapt to this world is the realization that the film portrays.<br><br>We find that with all our modern methods and abilities Shepherd does starts communicating to Charlie though in a vague way but still the actual situation could never be properly conveyed to Charlie. It's a classic example of generation gap where the newer generation wants to learn but fails to explain itself to older generation and the older generation is just afraid of the change. Moreover the surgical team is so mechanical that they just want to cut him up for analysis. They don't even consider Charlie a human but a relic, a living fossil.<br><br>This film has taken much care in addressing the topic as it is quite believable movie for such an impossible plot. It could have turned out as a jerky and plastic movie if it was not treated well on scientific and performance aspects. I don't know how many people have watched this movie but I must say it is pretty engrossing. The portrayal of a confused, depressed and angry caveman in modern world by John lone is very convincing and touching as well. This can rank among some of the best sci-fi movies of its era.","user":"organicsocial","rank":[18,21]}]