[{"title":"Great.. Very Understated..","rating":5,"date":"5 October 2004","review":"I, for one really love this movie. It has all the elements of a classic movie. Great Actors, Love , Betrayal, And Redemption. When watching don't be over critical. This was produced in the 1950's and all movies of this time are a bit over acted and fanciful. Try to view it for what it is(not a biographical documentary about Sheila Graham and F. Scott Fitzgerald) but a sweeten Hollywood version of their story. Very enjoyable.. Gregory Peck is at his understated best!! Deborah Kerr is very believable as a woman who loves this man despite his problems. This movie is very understated. The scene where Scott hits Sheila and threatens her with the gun is well acted; the violence is not used to make the movie more watchable as it is now a days. It is a film the evokes many different emotions from the viewer. There are the highs of being in love and the lows of despair and fright. It encompasses all. A great film!!!!","user":"smile096","rank":[18,20]},{"title":"Misses the mark, but still worth seeing","rating":8,"date":"19 December 2003","review":"Firstly I will agree that this isn't the most riveting film ever made, but I will disagree with the reviewer who says that Peck is too handsome to make a believable alcoholic.  We know that Fitzgerald was handsome, intelligent and charming, three things which made Peck an excellent choice to play him on film.  Furthermore there is a pretty amazing scene where violence erupts between Peck and Kerr, it's truly believable, which heartbreakingly portrayed the depths to which Fitzgerald had sunk.  Obviously when the story is based on Sheilah Graham's recollections, it will be purely personal and she may have softened the truth or by the same account exaggerated it. The look of the picture is beautiful, especially the wardrobe for Kerr.  I say simply to get a look at two stars in their prime it's worth it to muddle through.  Kerr and Peck have a tangible chemistry.","user":"StoryisKey","rank":[21,24]},{"title":"Can You Imagine Dickens in Hollywood?","rating":8,"date":"30 October 2007","review":"Beloved Infidel is based on the memoirs of Hollywood columnist Sheilah Graham, specifically her three year affair with F. Scott Fitzgerald, who is still a legend in American literature, and a genuine legend in his own time.<br><br>That's the key to the film. Can you imagine in the previous century Charles Dickens whose works in the United Kingdom were also acclaimed in his time getting a contract and asked to turn out potboiler drama three or four times a year for the London stage? In the late 1930s F. Scott Fitzgerald was in Hollywood having to pay mounting bills for his wife Zelda's care and his daughter schooling and the way to quick cash was in Hollywood writing screenplays.<br><br>But the studios don't want genius, they want entertainment churned out quickly on a mass scale. That isn't how Fitzgerald operates. So he's fired and returns to the alcoholism that was his lifestyle during his literary hey day in the Roaring Twenties. <br><br>As Fitzgerald, Gregory Peck's one consolation in his final years is the love affair with Hollywood columnist Sheilah Graham. I have to disagree with the other reviewers who say this film is too rosy a portrayal. Remember this is Sheilah Graham's work this is based on and it's through her eyes we see Peck's disintegration. Deborah Kerr is once again a prim and proper Sheilah Graham whose slum background she's worked like a demon to overcome. <br><br>Peck and Kerr work well together, but as this is a Henry King film from 20th Century Fox, I wouldn't be surprised if the film might have been intended for Tyrone Power at one point. If it had been Power would have been well cast in the part of Fitzgerald.<br><br>This is also Henry King's next to last film and take a look at his film credits and the astonishing list of classic films that he did over 50 years in Hollywood. I guess as a followup to Beloved Infidel, King chose to do a film adaptation of F. Scott Fitzgerald's Tender is the Night. That one for some reason is never shown.<br><br>Beloved is a classic old fashioned romantic drama the kind that sadly is not being made any more.","user":"bkoganbing","rank":[17,20]}]