[{"title":"THE DEMONS (Jesus Franco, 1972) Edited U.S. Version: **; Director's Cut: **1/2","rating":16,"date":"16 October 2004","review":"Review of the edited U.S. Version<br><br>This is a Franco film I had been longing to watch for various reasons: its being a sequel of sorts to Franco's own THE BLOODY JUDGE (1970), as well as the fact that the film was probably made as a direct response to Ken Russell's THE DEVILS (1971)  not that, in retrospect, there is much similarity between the two!<br><br>Well, my first reaction to it was one of disappointment, in essence due to too much insistence on pointless sex scenes and too little real period flavor; I can understand that Franco had only a miniscule budget to work from and, of course, I've only watched the heavily-cut 79-minute English version (with superimposed Dutch and French subtitles, and pathetic framing to boot!)  so who knows if the full-length 116-minute version is a significantly better film (certainly a lot more coherent, I presume)? Actually, the comparisons made by Brad Stevens on the 'Mondo Erotico' website between all existing versions of this film (and, more importantly, describing just how many shots are missing from what I saw) is depressing indeed!<br><br>While I certainly find great faults with THE BLOODY JUDGE (about which I've expounded upon in my review on this Forum), and even if I do concede that THE DEMONS is a more personal take on the matter on Franco's part, I cannot say that I prefer it in any way; then again, I'm disadvantaged because I've only watched the former through Blue Underground's 'definitive' cut on a stunningly-restored SE DVD! To go back to my dissatisfaction with the film, i.e. the sex angle: a measure of just how gratuitous the nudity is, for example, is in the successive footage of Kathleen (played by Franco regular Anne Libert) and the Mother Superior masturbating (the latter aroused herself by having spied on the former!). I'm not against the concept behind the scene itself (as I presume it would be only too natural in such a repressive environment as that of a convent!), but simply the fact that we have to go through the exact same motions in such a short time; if Franco had only suggested that the Mother Superior was going to 'emulate' Kathleen, it would have had a far greater impact, in my opinion. Of course, later on, we need to watch Britt Nichols have a go at it as well (not that I regret it in the least, mind you)! Actually, the film definitely had potential, and I tend to agree with the following statement by Dave Wood, lifted from his 'Mondo Erotico' review of THE DEMONS: 'It's a shame Franco couldn't have made a stronger link between the archaic, sadistic practice of witch hunting with the enlightened period of scientific discovery.' (Instead, the film prefers to wallow in its own 'sensationalism' which is not like we've never seen it done before, and better too!) The music score too, while quite a good listen on its own, is totally inappropriate with the mood the film seems to be aiming at!<br><br>The cast does what it can with the material, though I'm sure they all knew what they were in for from the beginning (unlike Christopher Lee in THE BLOODY JUDGE, apparently):<br><br>· although Anne Libert (who bravely faces up to her countless torture scenes throughout the film) is the true protagonist here, I was more intrigued by the supernatural sub-plot (the introduction of the devil-figure is especially well done) involving her sister Britt Nichols' 'demonic' revenge on their tormentors (one of them Kathleen's own lover, hilariously called Renfield  Thomas Renfield?!) <br><br>· Karin Field as Lady De Winter is an appropriately authoritarian figure, but who counts intimate S&amp;M sessions and lesbian grapplings among her 'divertissements' (the latter scene which she shares with Britt Nichols, where Margaret openly laughs at Lady De Winter's seduction of her, as though winking at the audience and saying 'Here we go again!' is perhaps an unwitting commentary on the very 'concept' of the film and, in retrospect, Franco's general obsession with sex!); still, it's inconceivable  to say nothing of hysterically funny  that the aristocrat would recognize the disguised Margaret, as one of two novices she had sexually scrutinized back at the convent near the beginning of the film, not by her beautiful face but rather by her private parts (which she describes as 'a sight not easily forgotten', or words to that effect)! <br><br>· Howard Vernon is good as always as the 'star-gazer' who doubles as a political activist (and, unknowingly, also has a few skeletons of a different sort hanging around in his closet!) though, regrettably, he is too often relegated to the sidelines<br><br>· Cihangir Gaffari, aka John Foster, cuts a rather dashing, but undeniably mean-spirited, figure as Judge Jeffreys (more in tune with Franco's conception, I guess, than the solemn 'n' stiff Chris Lee) but, again, he is given relatively little to doand doesn't the director contradict himself here by allowing him to be present during some of the torture scenes; where is the great 'I never knew' line from THE BLOODY JUDGE, now?!<br><br>The 'kiss of death' given by Britt Nichols to each of the three persons responsible for her and Libert's mother's death and which turns them into skeletons is rather laughable, too  surely, Franco could have thought of a more 'realistic' way of dispatching his 'villains'?; at the very least, for it to be effective, we should have first seen them rotting awaybut I guess the budget didn't extend to taking care of the special effects! Though the film seems to be leading towards a tragic ending of sorts (Nichols 'forced' to kill her sister's lover and for this being 'turned in' by her own sibling), it never quite manages to move us in this way, partly due to the overall amateurishness (and anything-goes mood) of the production! I was also baffled by the film's final image (the re-appearance of the 'Bride of Satan to take 'possession' of the Anne Libert character), but then Francesco Cesari explained to me that it's likely the 'conversion' of the good and sweet Kathleen (think De Sade's Justine) to the 'philosophy' adopted by her sister Margaret (replacing Juliette in Sade) and, in that context, I must say that it makes a hell of a lot more sense!<br><br>At this stage, I'm not sure whether I'll go for X-Rated's upcoming SE DVD (that will include three different versions of the film, all of them longer than the one I saw)  a lot will depend on the price  but I'd certainly love to be able to re-evaluate it by watching THE DEMONS in its proper form<br><br>Review of the Director's Cut<br><br>Rather than formulate another full-blown review, somewhat belatedly here are a few points I jotted down after viewing the Director's Cut of LES DEMONS via X-Rated Kult's 2-DVD Set:<br><br>· Has resulted in a reassessment (of sorts) of the film, as this version is a considerable improvement on the disappointing and incoherent U.S. edit: the widescreen photography gave the film a really sumptuous look<br><br>· The soundtrack alternating between English and unsubtitled French (which obviously sounded far more natural) didn't bother me: in fact, I'll be watching it again somewhere down the line by way of the Extended Version<br><br>· Apart from the French-language sequences which are obviously new to me, I appreciated some of the extended scenes featured in the Director's Cut, notably Britt Nichols' rape by the demon (which is a lot more satisfyingly presented than in the shorter version) and the 'kiss of death' moments where I was glad to be proven wrong: in my review of the film I had written 'The 'kiss of death' given by Britt Nichols to each of the three persons responsible for her and Libert's mother's death and which turns them into skeletons is rather laughable, too  surely, Franco could have thought of a more 'realistic' way of dispatching his 'villains'?; at the very least, for it to be effective, we should have first seen them rotting awaybut I guess the budget didn't extend to taking care of the special effects!' and, lo and behold, now we get Karin Field dissolving into a skeleton and smoke coming out of Alberto Dalbes' hair, as a sign of gradual disintegration, prior to his own demise; as far as I could tell, however, Judge Jeffreys' death was the same as before<br><br>· But then I was happy to see other sequences go: Doris Thomas' overlong masturbation scene (again note my comments from the review: 'a measure of just how gratuitous the nudity is, for example, is in the successive footage of Kathleen [played by Franco regular Anne Libert] and the Mother Superior masturbating [the latter aroused herself by having spied on the former!]'); the silly S&amp;M session between Field and Dalbes; and the extended torture sequences  all of which had bothered me the first time around, so I'm pleased to learn that Franco had shared my feelings about them all along!<br><br>· Ultimately, I wouldn't consider the film to be one of his greater achievements, even in this guise  the film MAY look great but Franco's direction is as awkward as ever: note the scene where Karin Field orders Luis Barboo to kill the two guards, bribed by Howard Vernon, to allow Anne Libert to escape  they just stand there waiting for him to run them through with his sword!; or Jeffreys' death scene, already pointed out by someone else here  the 'audience' gives no reaction whatsoever to his supernatural demise but, then, when Britt Nichols puts a curse of them, they back away in terror!!<br><br>· The video transfer was pretty good but I was most distressed by the soundtrack of the English-language version: it contained numerous audio drop-outs which go on for several seconds, sometimes effecting the dialogue itself; can someone tell me if it's the same in all the various versions?<br><br>· Still, even if the film scores a few points over THE BLOODY JUDGE (1970)  especially by taking the viewpoint of the witches rather than that of the witch-hunter  I'm still inclined to prefer the latter (which I also re-evaluated somewhat because of it) by virtue of its more polished production, the cast and, of course, its remarkable if somewhat incongruous S&amp;M sequences","user":"Bunuel1976","rank":[16,22]},{"title":"Early 70's Nunsploitation at it's finest!","rating":8,"date":"11 September 2016","review":"If you know anything about Jess Franco films or the genre of Nunsploitation you should know what you're in for. Medieval period film, accusations of witchcraft, demonic possession, nuns going crazy in a convent. You know, weird stuff like that. Jess Franco was quick to cash in on the success and controversy of Ken Russel's The Devils and made his own Inquisition horror film The Devils (aka Les Demons) Franco style.<br><br>While being burned at the stake, an accused witch curses the principal witchfinder and his minions. While this happens very, very slowly members of the royalty and religious establishment are caused to suffer and they also take pleasure in a series of their own sexual desires, torture and demonic possession by the witch's daughter Margaret. How Margaret becomes bewitched will unfold as you watch the film. As you already know (assuming you've seen Franco films before) Jess made very slow paced often sexually delirious, hypnotic dreamlike films with amazing visuals and music scores as is with The Demons. His films are often loved or hated by the b-movie cult community. I happen to like Franco films very much from all decades of his film career. Especially his output during 68-75. The man was making feature films at a furious pace. Some good, many well... not so good and at the height of his creative powers. He also had more and more freedom as the 70's moved along as censorship loosened in Europe giving him more freedom to create his own genre of film making. Zooms, close ups of butts, vaginal pubic hair, statues and buildings. His music scores, sometimes often overshadow the movie itself and deserve proper vinyl release. The Demons is an essential and often overlooked film of the demonically possessed nun genre and just a fun Euro-cult movie to watch. Like I mentioned above, everything from the music score to the delirious and wild sex scenes is all classic Franco from his most creative output post Soledad Miranda period in this film. If you're looking for a masterpiece of cult cinema Jess Franco's The Demons isn't the one for you, but if you are a true sicko like me and are looking for some of the most wild, delirious, sexually depraved gems of underground cult film making this film will give you a run for your money. I often tell people Jess Franco was the Marquis de Sade of Cinema. Many of his films capture the depravity of the Marquis works in so many of his movies. I give this film an 8/10 because for a Franco film this is actually a very well made low-budget demonic nun sleaze fest.","user":"rmtaylor90","rank":[3,3]},{"title":"it is the sex scenes that predominate","rating":8,"date":"24 February 2010","review":"Despite a little over use of the zoom lens now and again and inexplicably repeated lines this is a pretty well made Jess Franco movie. The budget must have been decent because picture quality and cinematography above par with some excellent location shooting, inside and outside. Costumes are also good, he must have borrowed those from some other film, and there is some effort to keep the tale within known historical events. None of this is to say, however, that there aren't lashings of sex. There is some torture but not overly done, no it is the sex scenes that predominate and fairly erotic and varied they are too. Anne Libert does well in the lead and generously shares her body with most of the rest of the leads. Howard Vernon is set against type for once and I reckon acquitted himself better than when he is given reign to go jumping and over acting everywhere","user":"christopher-underwood","rank":[4,5]}]