[{"title":"Highly Underrated!","rating":8,"date":"11 January 2003","review":"CREATURES is a blast! It eschews the stop-motion dinosaurs of ONE MILLION YEARS BC and WHEN DINOSAURS RULED THE EARTH and concentrates on the struggles of primitive men in a bleak, prehistoric world. Despite the smirking ad campaign and much-ballyhooed adult rating, CREATURES spends far less time than its predecessors showcasing the anatomical blessings of its female cast members and places more emphasis on the brutality of early man's daily life. The girls are certainly an eyeful, but they are nowhere near as groomed or glamorous as Raquel Welch or Victoria Vetri.<br><br>\nThe film stands out in many ways. There is no opening narration and no dialogue to speak of. Instead of using the gibberish language of the earlier films, the \"Creatures\" say very little, grunting and gesturing to communicate with one another. The solid performances make this surprisingly effective. The movie also inverts the formula established by its predecessors, moving the requisite cataclysmic volcanic eruption to the beginning and letting the human drama dominate the climax. This unusual structure lends extra weight to the finale.<br><br>I went in wondering how grunting cavemen(even the curvy kind like Julie Ege!) could hold my attention for 90 minutes without dinosaurs to fight. To my joy, the film is actually quite entertaining. The birth, life and struggle of two brothers vying for leadership of the tribe has an almost Biblical quality, and director Chaffey gives us plenty of fighting and conflict with nature to keep the film moving. Though much of the story consists of the tribe traveling from one fight to another, I found myself caught up in their journey and never once got bored. I don't know any of Don Chaffey's other work, but ONE MILLION YEARS BC and CREATURES THE WORLD FORGOT have convinced me that the man knows how to tell a story.<br><br>Bottom line? It's a caveman movie. If that ain't your bag, you probably won't like it. But if you can watch the other two Hammer prehistoric movies without fast-forwarding to the dinosaur scenes, you'll probably find CREATURES THE WORLD FORGOT a very pleasant surprise!","user":"yolt13","rank":[42,49]},{"title":"Antelopes the World Forgot","rating":6,"date":"5 December 2008","review":"\"Creatures the World Forgot\" is the third and final entry in the Hammer caveman films. It differs from \"One Million Years BC\" and \"When Dinosaurs Ruled the Earth\" in that it is an attempt at realism. There are no dinosaurs in this movie. The setting is firmly grounded in North Africa. Some of the opening shots show rock paintings which appear to be from the Tassili area, circa 4,500 BC. <br><br>An attempt to portray a functioning caveman culture is presented. Gone are the bikinis and beach girls of the other two movies...well, almost. For the most part, the costumes seem fairly realistic. Don't get me wrong, there are plenty of pretty women to look at, and their costumes seem to fall away frequently. Gone also is the made up language of 'akeeta' and 'necro.' In this movie, its all about grunts and gestures, which work quite well. <br><br>Instead of dinosaurs, indigenous North African animals are present. We see oryx, wildebeest, warthog, brown hyena, crested porcupine, ostrich egg canteens, a couple of snakes and a scorpion. At first it might seem strange that no big cats or other top predators are included in the assortment. I think it's because the antelopes have killed off all the lions and leopards. Hey, this is one tough bunch of antelopes! They lurk deep in the brush and charge out at frightening speed to stab and gore and kill. They are truly vicious creatures. And is it just me, or was an oryx actually killed and skinned for the movie? <br><br>The plot is unnecessarily convoluted. Two tribes (dark hair and blond hair) meet and exchange brides. The woman from the blond tribe gives birth to twin boys (one blond, one dark). These two brothers hate each other and are constant rivals throughout the movie. At the same time, lightning strikes a tree and a woman gives birth to a girl. The tribe wants to kill this bit of bad luck, but the shaman woman takes her for her own. There is an interesting sub plot as this young girl grows up with a crush on the blond-guy, gets rejected, and finally accepts her destiny as the next shaman of the tribe. It is one of the coolest stories in this movie. After too many plot convolutions, the brothers end up fighting to the death over the blond-guy's leopard skin bikini mate in a scene involving a large snake and cliffs. The young shaman girl decides the outcome...<br><br>This movie has a more compelling story compared to \"When Dinosaurs Ruled the Earth,\" with less emphasis on bikini beach culture and more emphasis on caveman survival culture. As of this date, it is not available on DVD, which is a shame. I like this movie a lot and would buy it on DVD faster than you can say - \"killer antelope!\"","user":"retrorocketx","rank":[14,17]},{"title":"Most Realistic of the Caveman films","rating":8,"date":"10 March 2012","review":"Of all the caveman movies I have seen, this one is the best because it choose to present early man as realistic as it could. Rather than have dinosaurs, this movie features animals and creatures that were actually around when early man was. Don't get me wrong; I enjoy dinosaurs very much and had I seen this movie as a kid, I might have thought it was a horrible one. However, now that I am able to recognize good acting and filmmaking, I really loved this movie. It presents the story of early man as a bleak time, a struggle for survival where death was around every corner. No doubt, that was how it was for early man. There are a few beautiful women here, but you won't see as much of their figures as you did in say, \"1 Million Years B.C.\". None the less, if you are a fan of history or anthropology, \"The Creatures That Time Forgot\" is a great way to spend your time.","user":"bayardhiler","rank":[11,17]}]