[{"title":"A fellow with a suit like mine shouldn't go around kissing girls","rating":7,"date":"1 January 2014","review":"Good WW2 spy movie with the three leads and director from The Maltese Falcon. The plot is about Humphrey Bogart getting tangled up with baddie Sydney Greenstreet and love interest Mary Astor. Greenstreet's a Japanese sympathizer and is trying to recruit Bogie. Good luck with that, Gutman. Bogart is excellent playing a character he was totally at home playing: wisecracking tough guy ladies' man. Greenstreet is villainous as ever and perfect at it. Just as in Maltese Falcon, Mary Astor is playing a stunning beauty that makes heads turn. Just like in Maltese Falcon, she doesn't match the character description. Perhaps Huston had a bit of a crush. Otherwise I don't get her being cast in these types of parts at a time when the likes of Ingrid Bergman and Lana Turner were around. Still, despite that element of the casting being off, Astor does fine.<br><br>This movie has an interesting backstory. It was originally to be about a Japanese attack on Pearl Harbor but when that actually happened in real life, they changed it to Panama. They never changed the title, though, despite the movie taking place nowhere near the Pacific. Then John Huston got called to serve before filming was complete so Vincent Sherman had to step in. Oddly, it seems Huston was the only one who knew how the movie was supposed to end so Sherman had to make up the final fifteen minutes or so of the movie!","user":"utgard14","rank":[13,14]},{"title":"Impetuous, easy-going and very enjoyable spy picture","rating":7,"date":"21 April 2005","review":"Not only did \"Across the Pacific\" add some brightness to Bogart's rising stature as an actor, it more than justified the promise shown by director John Huston after his success with \"The Maltese Falcon.\"<br><br>The story begins on November 17, 1941. Lt. Rick Leland (Humphrey Bogart) is being cashiered from the Army at Governor's Island, New York The reasons are vague, but before five minutes have passed, Bogie is decked out in his familiar trenchcoat Leland tries to enlist in the Canadian army, but his disgrace is so widespread that they won't have him Wondering aloud if perhaps the Japanese will take him on, Leland buys a ticket on the 'Genoa Maru' bound for Yokohama via the Panama Canal On board the freighter, Leland meets Alberta Marlow (Mary Astor), who lies about her past, and Dr. Lorenz (Sydney Greenstreet), a sociologist with an undisguised affinity for all things Japanese<br><br>It's really not spoiling anything to reveal that Leland is engaged in counterespionage because neither Huston nor the screenwriters take the material very seriously For most of the film, they're more interested in the cutesy shipboard romance between Leland and Albertagetting seasick, drunk, sunburned<br><br>As a thriller, the film doesn't really get wound up until the third act, when it has a few fine moments, most memorably a long chase scene in a Spanish-language movie theater, and a conventional conclusion <br><br>Sydney Greenstreet was excellent as a jovial yet cunning Japanese sympathizer and Mary Astor played a doubtful role with the same mental adroitness she had displayed in \"The Maltese Falcon.\" <br><br>Bogart, of course, carried the story line here and it was a delight to watch his enigmatic character change from one of calculated indifference to that of relentless determination...","user":"Nazi_Fighter_David","rank":[30,36]},{"title":"A Strange Title Since It's Set In The Atlantic, But A Nice Spy Caper","rating":8,"date":"11 August 2003","review":"A good spy caper starring Humphrey Bogart as Rick Leland, a court-martialled US Army officer who finds himself in the middle of a nifty little bit of espionage work on board a Japanese freighter bound from Halifax to Yokohama via the Panama Canal just before the attack on Pearl Harbour. Surrounded by a rather suspicious group of characters, from his love interest Alberta Marlow (Mary Astor) to Dr. Lorenz (Sydney Greenstreet), Leland slowly uncovers a Japanese plot to attack the Canal Zone (presumably also on December 7) and sets himself to preventing it.<br><br>This was a good performance by Bogart, along with good performances from Astor and Greenstreet. (For those not entirely familiar with Canadian geography, by the way, the pun is that Alberta claims to be from Medicine Hat, which is a small city in Alberta - almost TOO cute!) There's a fair amount of tension throughout as we struggle along with Leland to figure out exactly what's going on, and a nice climax as Leland foils the Japanese plan (Bogey had to win!) <br><br>A couple of things I thought were worth noting, though. First of all, what's with the title? All the action in the movie takes place either on the Japanese freighter as it travels south down the ATLANTIC coast of North America or in the Panama Canal Zone (with some minor scenes in Halifax, where Leland is rejected by the Canadian Army, and in New York City, where he snoops for information.) The only Pacific connection to the movie is that the freighter was Japanese. And remember, of course, that this was made in 1942 (after Pearl Harbour.) The depiction of the Japanese isn't especially flattering (although I thought it was more a play on stereotypes than openly antagonistic), and the closing shot of the film is the wartime requisite showing off of American military strength.<br><br>All in all, though, I enjoyed this movie immensely, and would highly recommend it.<br><br>8/10","user":"sddavis63","rank":[33,41]}]