[{"title":"Tons of campy fun.","rating":8,"date":"3 February 2005","review":"Ah, finally a horror camp classic that deserves to be called a horror camp classic. Re-Animator is one of those fun horror movies that is so over the top that it is just a lot of fun to watch, kind of like the spectacular Evil Dead films, although not quite to that same level of skillful horror/comedy mix. Ironically enough, I think it should be a testament to the quality of the rest of the movie that it is able to work so well despite prominently featuring a soundtrack that is a naked rip-off of the Psycho soundtrack. It's amazing to me that Richard Bond, the music composer, didn't think anyone would notice him plagiarizing one of the most famous movie soundtracks in cinematic history, but luckily everyone else in the production was right on the mark.<br><br>Jeffrey Combs delivers a wonderfully crazy performance as Herbert West, the scientist in the movie who is determined that he has discovered a scientific method to beat death, and is desperate to try it out on a human being rather than small animals, on whom he has had remarkable success. He is playing a completely one-dimensional character, a genius scientist whose mental capacity is also tinged with madness, but which is counterbalanced by the fact that he may very well be desperate to try something potentially immoral but which could also potentially revolutionize medicine. Maybe his intentions are good after all, but for the purposes of the film, he just wants to get his hands on some fresh corpses, which is a great premise for a horror film.<br><br>The movie operates in its own world, like the Evil Dead films did. It takes place in the horror genre but wants to combine some elements of drama as well, as we have a real scientist who is truly brilliant. He is still in medical school, I believe, but is often smarter than his often-published professors, criticizing their work for being incorrect or even plagiarized. He's very quick to make enemies, I would think his line of work might be easier the less people he had watching him, so it's unfortunate that he was so good at making people not like him. Mere days after he rents out a room from a couple of other students, they find their cat dead in his refrigerator. I hate it when new roommates do that.<br><br>There is plenty of gratuitous nudity in the film, and while I appreciate nudity as much as the next guy, I don't like it when it drives a weak film, and that is certainly not the case here. There is a graphic and highly disturbing nude scene three quarters or so through the film that made me literally cringe and turn my head, not because of gore but by the sheer disturbing idea of it, it was awful. But the thing that I loved is that that scene fits in with the rest of this movie so well. It is all about too much gore and too much blood and too much nudity, but also lots of laughs. This is a perfect example of how much fun scary movies can be.","user":"Anonymous_Maxine","rank":[77,86]},{"title":"The Academy Award for best use of a headless corpse goes to...","rating":9,"date":"8 April 2004","review":"Most of the cheap or not so cheaply made horror films these days are nothing more than a tedious exercise in how to bump off as many teenagers in as many different ways as one can imagine in ninety minutes or less.  One need only watch recent films such as Wrong Turn or the remake of Texas Chainsaw Massacre to realize how far the horror genre has fallen.  Once John Carpenter made the first Halloween film, we have been subject to an endless series of copy cat films whose only purpose seems to be finding an imaginative way to slice and dice the local teenage population.  All of the Freddies, Jasons, and Michael Myers films combined don't come close to having an ounce of the entertainment and imagination of Producer Brian Yuzna and Director and Writer Stuart Gordon's Re-animator.<br><br>Professor Herbert West (Jeffrey Combs) is a scientist who has discovered a formula which brings the dead back to life by reanimating their tissue. After an experiment in Switzerland goes awry, he moves to Miskatonic University to continue his experiments.  One thing Professor West isn't and that is modest.  He even takes a few moments to ridicule a professor, Dr. Carl Hill (David Gale) when he disagrees with him about when death actually occurs.  He eventually rents a room from fellow student Dan Cain (Bruce Abbot).  Dan is dating Megan Halsey  (Barbara Crampton) who is the daughter of the college dean, Alan Halsey (Robert Sampson).  What Dan doesn't know is that the aforementioned Dr. Hill has a perverted eye on Megan also.  We know this because of the sleazy stares Dr. Hill eyeballs her with when ever she's around.  Think of Megan as being an overage Lolita and Dr. Hill as Humbert Humbert and you've got the idea.  All of this is not window dressing as it would be in some other films.  It all comes into play very nicely.  It goes without saying that sooner or later, Dr. West will be making good use of his reanimation formula, in ways only those with the most grotesque sense of humor can imagine.  To say any more than that would deny you of the true pleasures of this film.<br><br>How can a film that is so explicitly graphic and perverted in nature be fun? It's because every person involved in the making of Re-Animator was smart enough not to take it too seriously themselves.  Everything in this film is so wildly over the top, that you can't help but chuckle right along with them as they wink their eye at you.  There may be certain moments of the film that would normally sicken even the most hardcore horror film fanatic, but since Yuzna and Gordon never once let Re-animator sink into the tedious by the numbers game of other films of these nature, these same scenes become intentionally cartoonish and silly.<br><br>But more than anything, this film owes it's life to it's cast.  Jeffrey Combs as Herbert West should serve as the model for anyone wanting to make a film involving a mad or semi-mad scientist.  Given this kind of role, there is many an actor who would have been tempted to ham it up and alas in many horror films they do just that.  However, when Combs seems to imply that he is the smartest man on the planet and the rest of us are Neanderthal, we don't hate him for this implication at all.  He is so good at making us believe he is the smartest man since Einstein and we are all nothing but Cro-magnon man by comparison that we love him for it just the same.  He may be crazy, but he's a fun kind of crazy.<br><br>David Gale as the smarmy Dr. Hill, is a joy to watch also.  He has some of the most ridiculous scenes in the film yet somehow manages to keep a straight face through it all.  He gives new life to the old saying about not losing your head over a piece of tail.<br><br>Bruce Abbot as Dan Cain is the perfect contrast for West.  He is a straight arrow, is madly in love with Megan, yet somehow lets himself become involved in West's experiments.  Abbot also is smart enough to know that the center of this film is West, and never once overplays his role to try and overshadow him.  As for Barbara Crampton, she should have won some kind of award, just for the abuse the producers put her through as Megan.  Is there an award for most abuse of a female by the walking dead?<br><br>Re-animator was made on a budget of less than a million dollars which is truly remarkable. There isn't a film budget in the world though that can replace the imagination and daring rampant through out Re-Animator.  And when a horror film is that well done, and is something all the Freddies, and Jasons, And Michael Myers can only dream about, I have no choice but to give it my grade which for Re-Animator is an A.","user":"clydestuff","rank":[87,100]},{"title":"A true horror/gore classic","rating":10,"date":"3 May 2003","review":"Very loosely based on H.P. Lovecraft's story \"Herbert West: Re-Animator\"<br><br>Herbert West (Jeffrey Combs) is new at Misketonic University in the (fictional) town of Arkham MA.  He rooms with nice guy Dan (Bruce Abbott) but Dan's girlfriend Meg (Barbara Crampton) doesn't trust him.  And evil Dr. Hill (the late David Gale) hates him.  It seems West has a glowing green/yellow potion that brings the dead back to life...but they always come back in a foul mood.  But he hasn't tried it on humans...yet...<br><br>Boy, do I miss the 80s!  Back then they could make extremely gory, sick, violent, unrated films like this and get them to play at mainstream theatres.  I saw this opening night in Boston back in 1985--it was unrated and no one under 18 was allowed in the theatre.  The audience was quiet at first, but as the violence and gore escelated and the black humor kicked in, the audience came alive.  People were screaming, yelling, laughing...just about everything!  Especially during a sequence between Crampton and Gale which just went way over the boundaries of good taste.  It was just great! The movie is fun on its own, but with the right type of audience it really comes alive.<br><br>The film has extreme gore...probably the goriest movie of its decade.  It also has huge doses of black humor and the whole cast blessedly plays it straight...it they had winked at the camera once it would have destroyed the film.<br><br>The film also has a tight, well-written script (it runs 86 minutes), is well directed by Stuart Gordon and has a great cast--David Gale (sadly no longer with us) was fantastic as the evil Hill.  Jeffrey Combs plays West just perfect--we see his obsession with the potion but Combs never overplays it. Abbott is somewhat bland but plays a very good hero.  Crampton is just excellent as Meg--sexy, smart and very brave.  Also Robert Sampson adds strong support as Meg's father.<br><br>Basically a must-see for any horror fan.  Also a great score and I LOVE the ending!  Don't miss this one!<br><br>Try to see the Special Edition DVD--it shows deleted scenes that flesh out the story more.","user":"preppy-3","rank":[53,61]}]