[{"title":"Family First","rating":7,"date":"18 December 2006","review":"Those who have seen \"The Sons of Katie Elder\" and the much more recent \"Four Brothers\" may sense some surface resemblance to this forgotten holiday movie. An eccentric old heiress (Ann Harding) in trouble needs her long-lost sons to come to her rescue by Christmas Eve before her nephew Philip (Reginald Denny) takes control of her fortune. In this case, her three sons were adopted as infants and left as soon as they could make their own way in order not to sponge off a kindly lady who gave them everything.<br><br>We first meet Michael (George Brent), a spendthrift playboy whose debt puts him at Philip's mercy. Mario (George Raft) is an escaped con now running a night club in South America who falls into the clutches of an escaped Nazi. Jonathan (Randolph Scott) is a rodeo cowboy barely scraping by out west who has a strange experience at a baby mill. While on the surface each is a specific stereotype, as soon as they learn of their adoptive mother's predicament - she savvily holds a press conference - all priorities fall in line. A certain nobility despite their failings is a reaction that bonds them as a real family.<br><br>Brent is bland as usual playing bland comedy with Joan Blondell clinging on to spice things up. As expected, a slimmed down Raft gets some romance, some fighting and some tragedy. Scott has to deal with that kind of \"cowboy talk\" that only exists in movies, where everything is a ranch metaphor, but he's charming. Harding (actually younger than all of her \"sons\") stretches to play double her age, and comes across just fine. Denny is variously a rat and a skunk, but he gets his. Wonderful and very busy character actor John Litel is the FBI agent after Raft. Back in '40, he played an unfortunate truck driver in Raft's \"They Drive By Night\" and years later was coincidentally in \"The Sons of Katie Elder.\" \"Christmas Eve\" has no big emotional kick and little holiday sentimentality, but there is genuine family affection. It is not a special film, the story lines somehow both stereotypical and nonsensical. It can be stodgy and it's easy to see why it's little remembered. Clearly everyone in it was capable of better, yet there are satisfying moments.","user":"ROCKY-19","rank":[27,31]},{"title":"Great Christmas Film from 1947","rating":6,"date":"24 December 2007","review":"Enjoyed seeing this film which has a Christmas theme and concerns three adopted men who have gone in different places in the world after being adopted by their Aunt Matilda Reed, (Ann Harding). George Raft, (Mario Torio) had a background of serving time in prison and escaping into a foreign county. The second adopted son is George Brent,(Michael Brooks) who is a con-artist and the third son is Randolph Scott, (Johnny) who is an alcoholic and is a sort of burned out cowboy from the West. Their Aunt Matilda wants to locate these adopted sons and have them at her house on Christmas eve. The reason she wants to bring the family together is she is fearful her nephew is trying to cheat her out of her fortune, as she is very rich. This story goes into great detail about each of her sons which is very interesting with plenty of comedy, drama and even three babies get involved. Cute Film.","user":"whpratt1","rank":[20,23]},{"title":"A bit rickety now, but this three-part story of family ties still works...and George Brent's timing was never better","rating":7,"date":"27 January 2008","review":"What's a mother to do? If she's the seriously rich, eccentric but still shrewd Mathilda Reed, now in her late seventies or early eighties and living alone with servants in a huge mid-town Manhattan mansion, and her untrustworthy nephew attempts to gain control of her fortune by having her declared incompetent, the answer is simple. She'll call upon her three sons. The trouble is, she hasn't heard from the grown men in years. The three came to her as wards. She adopted them and raised them. But when they were grown, each decided to leave and make his own way. They didn't want to be a burden or to live off their mother's fortune. Mathilda Reed (Ann Harding) may be a wonderful old woman, but her sons are something else. <br><br>There's Michael (George Brent), a high-living ne'er-do-well who finances his expensive tastes by kiting checks and who hopes to marry a rich woman. His girlfriend, Ann (Joan Blondell), is starting to get impatient. <br><br>There's Jonathan (Randolph Scott), who went west and now is a broken down but charming rodeo rider who sometimes has to pawn his saddle. <br><br>And there's Mario (George Raft), a fugitive from the law who went to South America and prospered as a shady nightclub owner. He can't return to the States without the FBI picking him up. <br><br>Mathilda Reed is a fighter. She goes public with a press conference, hoping her sons, wherever they are, will hear about her need for them. She hires a private detective to try and locate them. They have to return by Christmas Eve to block Phillip's plans. <br><br>Will the three men make it? Will they even try? Well, of course they will. So we spend most of our time in three short stories. We watch how Michael, amusing and unreliable, gets himself under Phillip's thumb with those bad checks and then starts to get himself out. We watch how Jonathan, back in New York, finds himself involved in a phony adoption scam and winds up with three baby girls and a great-looking girlfriend. We also hear a lot of Hollywood home-on-the-range dialogue...all those \"heifers.\" We see Mario take on a Nazi fugitive, with fistfights and gunfights, before he leaves for New York with the FBI right behind him. And on Christmas Eve, with snow drifting down, with the mansion alight, with the tree gorgeously decorated and the Christmas punch made, Mathilda Reed, her nephew and the judge sit waiting. Sure enough, first Michael and Ann arrive. Then Jonathan and his three babies. And last comes Mario, with an FBI man right behind. We learn everything is going to turn out all right, even for Mario. The \"crime\" he left the States over was really committed by another. Phillip's scheme is dealt with and so is Phillip. Most importantly, we learn that the idea of family, played up with a little sentimentality and a sometimes serious but often amusing screenplay, can get the job done. <br><br>The movie is a little corny at times, especially with Ann Harding, younger than each of the actors playing her sons, doing the trembling and wise old lady bit. Her makeup would convince only the oldest residents of an assisted living center. Raft, Scott and Brent each do fine jobs. Raft, of course, is Raft, and his story is the most serious. Scott does a charming turn as the rodeo cowboy who winds up with an instant family. And George Brent, who was even better as a skilled farceur and light comedian than he was as an all-purpose leading man (watch him in 1947's Out of the Blue), is a joy to watch. All three were at turning points in their careers. This was Scott's last non-Western movie. Brent was fading fast as a star. Raft was starting to make a series of poor movies. Still, for me the movie works emotionally as the story of how three very different men drop whatever they're doing, for some at great risk, to return to help the woman who raised them and gave them the values that they have. When the three start to greet each other with pleasure in their mother's mansion on Christmas Eve, maybe it's just good acting but they look like they mean it.","user":"Terrell-4","rank":[16,19]}]