[{"title":"In defense of the film.","rating":21,"date":"21 October 2001","review":"I've read the negative reviews in here and am perplexed at the vitriol directed at this film.  \"Meteor\" is, admittedly, a flawed movie, but still one with many strengths that deserve attention.<br><br>Firstly, it was made in 1979, so the effects are not going to be as stellar as they were in the 80's and 90's.  And even then, some of those effects still hold up quite well to movies produced today.  The modeling work, especially of the orbiting Hercules and Peter the Great nuclear missile platforms, is extremely impressive.  The meteor itself is a big, ugly, and rather scary chunk of scarred rock, reminiscent of the Texas-sized shard in \"Armageddon\".  Yes, some of the effects DO look cheesy (the avalanche being the most frequently cited example), but others are quite striking.  At worst, \"Meteor\"'s effects are extremely uneven, but certainly not completely junkable.<br><br>Secondly, unlike \"Deep Impact\" and \"Armageddon\", the film focuses on the multitude of hurdles that have to be overcome in order to combat the threat. Personal, politicial, and scientific obstacles are given due screentime, which serves to advance the story rather than bogging it down.<br><br>Thirdly, \"Meteor\" is a far more globalized film, as it pulls together Russian, English, and even Chinese characters into the story.  The attempt to track the rock and derive a viable solution to knock it out of its Earth-based trajectory is not solely an American one, but instead a closely coordinated international effort.  Indeed, even the U.N. is (briefly) featured.<br><br>Fourthly, the film doesn't get mired in the 'human element' (as what happened in \"Deep Impact\" and \"Pearl Harbor\").  \"Meteor\" is non-tangential in that it STICKS TO THE STORY, which is the main interest of the viewer (at least, for me).  Yes, there is the attraction between Connery and Wood's characters, but it's generally unobtrusive and the screentime limited.<br><br>Fifth, Laurence Rosenthal's score is great!  Its boldness reminds me of Poledouris' legendary score for \"Conan:  The Barbarian\".  It effectively captures both the 'feel' of space and the direness and immediacy of the situations portrayed.<br><br>Finally, I emjoyed the acting.  Connery, Keith, Malden, and Fonda turn in sincere performances (especially Malden).  \"Meteor\" is an ensemble production in the tradition of Irwin Allen's best disaster productions.<br><br>Don't let the naysayers in here turn you off from this underrated gem.  If \"Deep Impact\" and \"Armageddon\" left you wanting, give \"Meteor\" a try. Sure, it may not be as polished as those two productions, but it has more going for it than you might think.","user":"fleggett","rank":[68,80]},{"title":"Sean Connery's All-Star Version of 'Armageddon'!","rating":7,"date":"16 November 2000","review":"With the hoopla surrounding the 1998 releases of 'Armageddon' and 'Deep Impact', many have forgotten that Hollywood had done a previous big screen version of the 'Asteroid on Collision Course with Earth' premise, the 1979 Samuel Z. Arkoff production of 'Meteor'. Panned when first released, the film is dated (Cold War tensions with the Soviet Union are a major plot device), and has some unintentionally campy moments, but is still GREAT fun, with a fabulous cast! <br><br>Sean Connery stars, as an American scientist who had left NASA when his designs for a 'asteroid-killer' space missile platform were turned into a weapon aimed at the Soviet Union. After a comet passing through the Asteroid Belt collides with a a city-sized chunk, releasing a five-mile large rock, and launching it towards Earth, he is drafted into leading the American team assigned to turn the platform around, and fire our missiles at the deadly visitor.<br><br>Unfortunately, the combined nuclear capacity of the U.S. space arsenal isn't great enough to deflect it from it's path, so an uneasy alliance with the Russians, who ALSO have illegal strategic missiles in space, is achieved. It then becomes a race against time, as pieces of the asteroid obliterate various parts of earth, to coordinate the two missile systems, and launch a strike at the huge rock.<br><br>The cast is first-rate; Natalie Wood (in one of her final roles) plays a Russian scientist/interpreter, who is romantically drawn towards Connery; Brian Keith nearly steals the picture as the gregarious Russian team leader; Karl Malden is warm and winning as Connery's best friend, and NASA liason; Martin Landau does a campy bit as a paranoid military liason; and Henry Fonda, looking haggard, appears in a small role as the President. Watch for Sybil Danning (before B-movie stardom), in a cameo, as a doomed Swiss skier!<br><br>The FX range from excellent (some of the space scenes), to hokey (the tidal wave in Hong Kong); among the film's pluses is a stirring, beautiful (if at times, overpowering) score by Laurence Rosenthal ('Fantasy Island').<br><br>Is 'Meteor' a classic? Certainly not! But it is no worse than the later asteroid films, and Sean Connery is ALWAYS a joy to watch! Take a chance on 'Meteor'...I like it, and I think you will, too!","user":"cariart","rank":[54,66]},{"title":"Perestroika Saves The World","rating":5,"date":"27 November 2006","review":"Meteor and When Time Ran Out marked the end of the decade of the disaster epic. I guess that Hollywood was just running out of ideas and that the formula of getting a bunch of big name players and put them in harm's way was wearing thin.<br><br>You can see that just about everybody here is bored, they all say the lines without any real conviction. Except for Martin Landau. As an Air Force General and Cold Warrior of the first order, he's extremely upset that the USA and the USSR have buried their differences to work on a real immediate problem. He resents Russians Brian Keith and Natalie Wood in the war room and Landau overacts outrageously.<br><br>A comet hurtling through the asteroid belt hit one of the big asteroids and sent one big chunk of rock and a whole bunch smaller ones as space calling cards speeding to Earth. That big guy if it hits spells the end of life on the planet. <br><br>Some criticism has been made that the special effects were a bit cheesy. By today's standards of course they were. So are some of those of the great Cecil B. DeMille. That's progress for you.<br><br>I'm not sure but this may have been the first time that Natalie Wood played someone of her own ancestry on film. Too bad she and Sean Connery as the NASA scientist didn't get to do something better before she passed away.<br><br>All the stars got a good pay day out of this though Sean Connery said there were some real scary moments with the cast trying to escape through the subway system with all the mud. A few times some people came close to really being buried in it for art's sake.<br><br>And this isn't a film to give your life for.","user":"bkoganbing","rank":[18,20]}]