[{"title":"A real surprise from Fulci","rating":7,"date":"22 June 2009","review":"I'm a fan of Fulci's work but until now had only ever seen the splatter movies from his mid- to-late career. On the basis of this, I will dig deeper and check out more of his earlier films.<br><br>This is a very strange Western, beautifully shot with a bizarre psychedelic score. Performances are good, theatrical and a little overblown (the dubbing never helps), but they fit well within this unusual morality play.<br><br>The film is loaded with symbolism, concerned with themes of birth, death and redemption. Fulci was an artful director when he wanted to be, but never concerned himself with linear plots. The story here is easier to follow, but takes an interesting turn towards the end when Stubby and Bunny find the town populated by men. Pacing up to this point was sharp, but here things did drag a little.<br><br>There are some well-handled action sequences, a little hard-boiled violence (but leagues away from the incredible sadism of something like 'New York Ripper') and some humorous touches, mainly provided by the character of Clem, the town drunk. The whole thing has an acid-fried feel that's a bit redolent of Jodorowsky.<br><br>Worthy of repeated viewings and further study. The conventions of the Western have provided a great canvas for many auteurs - Fulci makes the most of stock characters and visual cues, imbuing them with all the sub-text he wanted to get across.<br><br>I'll definitely check out 'Massacre Time' after this. Anyone who's been bored or insulted by the director's later stuff like 'Voices From Beyond' should watch this and see the full breadth of the grumpy old feller's ability.","user":"noahbbrown","rank":[15,16]},{"title":"Violent And Moving Western By Lucio Fulci","rating":7,"date":"28 May 2006","review":"Many people, among them even fans of Spaghetti Western, seem not to like \"The Four Of The Apocalypse\", but it is actually a good movie, even though untypical for the genre. Although the movie's violent reputation is maybe a little exaggerated, the uncut version of the movie has some very brutal scenes, there is a pretty gruesome torture scene, and there is a lot more blood when people are shot than in most Westerns, including Spaghetti Westerns.<br><br>The Movie takes place in Utah of 1873, where gambler Stubby Preston meets prostitute Bunny O'Neill, alcoholic Clem and a mentally ill guy named Bud in prison. After Stubby buys their way out of jail, the four head south to a city 200 miles away. They meet an obscure Mexican hunter called Chaco, who joins their group, but soon turns out to be a villainous and sadistic psychopath.<br><br>The acting is very good, specially Lynee Frederick's performance as the lovable and beautiful prostitute Bunny, who gives the brutal movie a little heart-warming touch and almost seems a little too innocent for a prostitute, and Tomas Milian who is truly diabolic as vicious Chaco.<br><br>The movie's biggest weakness is its score, which is not really bad throughout the whole movie, but in some parts of the movie the songs don't really fall in place with the scenes. Apart from that, the movie is very entertaining, certainly violent but in some scenes even heart-warming. A must-see for every fan of Lucio Fulci and every fan of Spaghetti Westerns, although quite untypical for the genre, since Fabio Testi's character Stubby Preston is not quite the typical anti-hero of the Italian Western.<br><br>A highly recommendable film, entertaining and gory, but in some parts also very moving. 7 out of 10.","user":"Witchfinder-General-666","rank":[16,19]},{"title":"Oh, that was bitter.","rating":8,"date":"16 May 2007","review":"Four lowly criminals that meet in jail; card shark Stubby, pregnant prostitute Bunny, a drunk Clem and the loony Bud manage to escape a vigilante slaughter of the town they were in and end up on a rugged journey in the open frontier. They soon encounter the Chaco, but after helping them out. He soon turns on them, with his sadistic habits coming through and they find themselves at the other end of it. After raping Bunny, Stubby's increasing feelings for her, makes him vow vengeance on Chaco.<br><br>Apocalyptic to-right! This cruel, sparse and bleakly nightmarish spaghetti western from Italian maestro Lucio Fulci is one uncompromising trek, where four unique individuals end up guiding us. The episodic screenplay pulls you along for one emotionally domineering and pain-filled excursion into the souls of four (very ordinary) characters longing to make something important from their lives, especially after what they've been through together. This destiny-bound aspect and redemption angle takes over the odd story, where these rag-tag characters are flung around in manipulative sense and realistically drawn up with rich, quirky and sullen details. It tries to be a passionate and diverse character story, and this makes it one interesting and downright original crack at the flooded sub-genre. I see mentioned a bit, Why's apocalypse in the title? I see this as a reference towards the characters' and their final outcomes. Hope just seems to fade off their faces, after one degrading, macabre and tragic situation after another in a reprehensibly desolate land that can easily break you and take away the things you hold close. Everything that was significant is stripped away, which leaves only one thing on mind for one character revenge. Tomas Milan's scummy character is the main tool of that torturous downfall. <br><br>Fulci is one never to shy away from something in your face, and this one has no boundaries to its depressing nature, relentless violence and unsparingly gritty landscape. His patiently accomplished and pastel direction can feel plodded, but he gracefully lenses it with gusto and the up-close and personal framing illustrates many moody sequences. He knows how to depict haunting images, rough landscape and brutal carnage to fit right in with the film's material and destination. Despite a pretty bumpy rhythm, Fulci keeps it tight and ominous for most part. The opening scenes set the appropriate tone of what's to come and even a slight sense of surrealism. It's technically, a good job. The open and breezy ballad folk soundtrack is a complete delight and gels into the presentation nicely. Performances from the main four are sensitively brought across with a compelling rapport. Fabio Testi's strong performance all round carriers the film. Lynne Frederick is beautifully touching. Michael J. Pollard's screwy town drunk amuses and Harry Baird is fine as the loony black slave. Competing with Testi's performance has got to be the memorably brooding performance of Tomas Milan. He chews up the scenery in what few sequences he does get, as the pitilessly striking bandit Chaco. <br><br>The sub-genre was coming to an end, and while Fulci's effort was very late to the fodder. He manages to craft Gothic-laced spaghetti western that has heart within its narrative and guts found in the visuals.","user":"lost-in-limbo","rank":[10,12]}]