[{"title":"A Christmas Special that REALLY Rocks","rating":2,"date":"2 December 2001","review":"I admit it!!!  I am one of those grown ups (a Generation Xer to be exact)who has never really fully grown up-at least not when it comes to watching Christmas Specials like this one. I have this on DVD now and plan to collect all the Rankin Bass Specials in addition to the Charlie Brown Holiday specials.<br><br>A Year Without a Santa Claus is just great.  You can't beat it in my opinion.  I agree with all the other comments that the Miser Brothers are the highlight of the special and should be mentioned whenever this special is marketed.  But unlike some of the other comments, I liked the ENTIRE story.  Another person who commented, Oldra, seems to hit the nail on the head about the song \"So You Don't Believe in Santa Claus\".  Call me silly, but my eyes get just a \"little wet\" whenever Ignatious's Father and Mr. \"Clouse\" start singing to him about the existence of Santa Claus.  Even though in real life, a man does not come down chimneys in a red suit to deliver presents, the symbolism of what Santa stands for what the song is trying to convey-and it does a very good job in my opinion!!! To quote the song, \"Just believe in Santa Claus, like you believe in Love, and just believe in Santa Claus, and everything he does\".  Happy Holidays and beyond!","user":"anitatanky","rank":[30,35]},{"title":"This is it - Heat Miser and Snow Miser!!","rating":12,"date":"12 December 1998","review":"Almost everyone who was a child in the US during the early to mid-70s seems to remember that Christmas special with Heat Miser and Snow Miser, but no one can remember the title, or much else about the show.  After finally tracking it down and watching it again after all these years, I can understand why.  The non-Miser Brothers parts don't hold up so well for this adult, at least.  I guess the thought of a sulky, depressed Santa isn't as dramatic as it seemed when I was five.  However, my brother and I greatly enjoyed the opportunity to sing along again with \"He's Mister Heat Miser, he's Mister Sun....\"<br><br>It's a mystery to me why the folks marketing the video give only a plot summary on the package with no mention of what kids find most memorable. This is also true of most the guides to holiday viewing in the entertainment magazines.  Hint to marketing people:  make sure you advertise this as the one with Heat Miser and Snow Miser in it, and everyone born between about '66 and '72 will be buying it for their kids, if not themselves.","user":"PodunkSkywalker","rank":[24,31]},{"title":"Love Them Misers","rating":7,"date":"8 December 2006","review":"I find this holiday made-for-T.V. movie to be one of the more charming of its kind, maybe because it's not as well known as \"Rudolph\" and \"Frosty\" and other holiday perennials.<br><br>In this one, Santa (voiced by Mickey Rooney, who also did Santa honors in \"Santa Claus Is Comin' to Town\") decides he's had enough of Christmas and those who don't appreciate him and cancels the holiday. Mrs. Claus (voiced by Shirley Booth) decides it's up to her to prove to Santa how much everyone still loves and admires him, so she sends off two elves on an around-the-world fact-finding mission to compile evidence of a belief in Santa and what he stands for. From there, the plot goes all over the place and nothing makes a whole lot of sense, but it's all harmless enough. The film's biggest selling point, of course, are the miser brothers, Heat and Snow, who each get a showstopping burlesque number complete with mini back up singers. I wish these two had been given a Christmas movie of their own.<br><br>Grade: A-","user":"evanston_dad","rank":[13,16]}]