[{"title":"Dreams Of \"Il Duce\"","rating":10,"date":"10 June 2006","review":"Maggie Smith is mesmerizing. She paints the blind monstrosity of Miss Jean Brodie in the most recognizable human tones. Robin William's character in \"Dead Poet Society\" is as irresponsible but doesn't go near as far as this repressed masterpiece of a creature. Her romantic slant towards \"Il Duce\" and what he represents is at the core of the simple complexity of the character. Maggie's mannerism, now a precious trade mark, belong to Miss Brodie, totally. Her arms, her chin, the turning of her face. Pamela Franlklin is also superb. What a powerful young actress -- Where is she now? -- and Celia Johnson's performance is the icing on the cake of this feast of a movie.","user":"mlambertint","rank":[95,100]},{"title":"Not just a one-woman show","rating":9,"date":"4 June 2005","review":"This movie is often billed as a 'one-woman show', a study of an extraordinary character, Miss Jean Brodie, played by an excellent actress. However, the movie is much more than that. It is a study of charisma and influence, of teachers and students, and presents a complex and fascinating coming-of-age story. This study takes place through the movie's double-focus on both Jean Brodie and her most precocious student, Sandy. Sandy is the strongest and most independent of Miss Brodie's students, and eventually she rebels and rejects her teaching completely. However, she is also truest to her teacher's expressed goals. Miss Brodie supposedly wants to teach 'her girls' to be like herself: powerful, independent individuals, free from the shackles of authority and group-think, beyond conventional sexual morality. In fact, she preys on the weakness and insecurity of her students, punishes independence and rewards slavish loyalty to her and to her personal plans and ideals. (The film's more subtle concern with fascism and authoritarianism echoes this theme: fascism elevates great individuals and praises their strength, just as it demands total obedience and slavishness from the rest.) Sandy, by recognizing and rejecting Miss Brodies's actions and plans, becomes her truest student: not only sexually adventurous, but bold, independent, and confrontational. The final scenes illustrate this beautifully. Miss Brodie has truly put \"an old head\" on Sandy's \"young shoulders\", and she truly is \"hers for life\"--though not in the way originally intended. In this way the movie presents a profound, sophisticated and realistic account of the way powerful individuals influence one another.","user":"zena8","rank":[106,115]},{"title":"The Spectacular Prime Of Miss Maggie Smith","rating":9,"date":"2 November 2017","review":"Maggie Smith was already a major star in her native England and 4 years before she had earned an Oscar nomination in the supporting category for her Desdemona in \"Othello\" with Laurence Olivier but her Jean Brodie arrived to revolutionize everything, specially her own career. She won an Oscar and her win was considered one of the great upsets in the Academy's history. Watching The Prime Of Miss Jean Brodie 48 years after its original release, told me that the Academy got it right then. Her performance is, quite simply, extraordinary. She's not playing a regular human being, no, she's playing a sort of benign monster, full of good intentions but, goodness, she's mad, mad as a hatter and from that point of view, she's truly dangerous. Maggie Smith goes for it, body and soul, Her confrontation of her superior, played magnificently by Celia Johnson, is of such power that I had to rewind immediately and see it again once, twice, three times. Superlative.","user":"pr-managmenthouse","rank":[29,30]}]