[{"title":"Melodrama and magic","rating":7,"date":"6 November 2008","review":"This is essentially a variation on House Of Wax ,in both the plot and the type of role played by the star of both movies ,Vincent Price.In both pictures he plays a talented artist who is sent toppling over the edge into insanity when his creations are usurped by other,less talented and less scrupulous people .In this movie he plays a designer of illusions for stage magicians who aspires to set out on a performing career himself only to be frustrated when another illusionist ,the Great Rinaldo (John Emery)insists that he honour his contract and give him first choice of any illusions he designs.Price is already ill disposed towards Rinaldi as his former wife is now a paramour of Rinaldi. He deploys his talents as an illusionist and as a brilliant mimic to avenge himself upon Rinaldi and others who thwart his plans for recognition as a performer and a designer.<br><br>Price is pretty much the whole show here and gives a well judged star turn as a wronged man whose predicament earns audience sympathy.The rest of the cast are competent if colourless and the weight of the whole venture falls on Price who carries the burden with ease .<br><br>Good solid B Movie melodrama , this is a crime movie rather than a horror picture and is enjoyable providing you don't expect a masterpiece .Shot in black and white it is low on gore and is best seen as melodrama and enjoyed for the presence of its star giving an idiosyncratic performance","user":"lorenellroy","rank":[15,16]},{"title":"Price's Best","rating":10,"date":"11 August 2001","review":"Even though it has one of the standard \"Revenge Price Plots,\" this film is my favorite of Vincent Price's work.  Gallico has that quality that is missing in so many horror film characters- likeability.  When you watch it, you feel for him, you feel his frustration, the injustices against him, and you cheer him on when he goes for vengeance, even though he frightens you a little with his original fury.  As the film goes on, his character becomes tragic.  He's committed his murder, but now he must kill to cover that up. And again to cover that one up.  And again... your stomach sinks with his soul as it goes down its spiral- like watching a beloved brother turn into a hood.  Even if the revenge story is of old, the plot devices themselves are original- Gallico uses his tricks to kill in more and more inventive ways. A shame this one isn't available for home veiwing.","user":"Orcini","rank":[22,25]},{"title":"Vincent Price turns to murder to protect his magic act...","rating":7,"date":"31 October 2010","review":"The only ingredient missing in this VINCENT PRICE tale of horror is Technicolor which might have provided even more interest in this murderous tale of a magician who kills in order to protect his inventive magic act.<br><br>First to go is a partner with whom he has a violent argument and is given the buzz saw treatment. Then, JOHN EMERY, a rival magician who is foolish enough to steal from Price and threatens to reveal what he knows about the death of Price's partner. Emery has a grand time matching his scene stealing tricks with Price.<br><br>Skillfully directed by John Brahm, a section of the film dealing with the bonfire is reminiscent of a similar moment from Brahm's HANGOVER SQUARE when Laird Cregar delivers the body of a woman to be consumed by fire.<br><br>Acting is uniformly excellent and the script moves at a fast pace under Brahm's direction. Once again, Vincent Price delivers a first-rate performance in a shuddery role. The suspenseful moments lead to an edge of your seat climax involving a crematorium device.","user":"Doylenf","rank":[6,6]}]