[{"title":"Excellent","rating":5,"date":"5 November 2002","review":"It's predictable. It's typical. It's very 80s. It's also very good. As was said before, the chemistry between the two stars is incredible. If you liked Beverly Hills Cop, you'll love this film (in fact, I just watched them both back to back, and enjoyed them both equally). It is non-stop one liners that drip with wit. As 80s cop movies go, this is among the best. There are tonnes of great scenes.","user":"wdeadder","rank":[26,28]},{"title":"Very funny movie with inspired teaming","rating":7,"date":"2 October 2007","review":"Very funny cop/buddy movie that owes a lot to the inspired teaming of Gregory Hines and Billy Crystal. The script may not be much, but it has enough in it to keep the audience interested, while director Peter Hyams keeps the action and, more importantly, the comedy, rolling at a good pace. For it is the comedy that makes this picture.<br><br>Hines and Crystal are in great form. They play off each other wonderfully, and their comic timing is perfect as they deliver some hilarious lines. Situation after situation will have you in stitches in this film. Writers Gary De Vore and Jimmy Huston certainly have a sharp sense of humour.<br><br>Tuesday, July 7, 1992 - Video","user":"gcd70","rank":[11,11]},{"title":"The original buddy-comedy action film","rating":9,"date":"9 May 2012","review":"\"Running Scared\" was released one year before \"Lethal Weapon\". Followed by \"Tango &amp; Cash\", \"Last Boy Scout\", and \"Showdown In Little Tokyo\". \"Running Scared\" seems to be a forgotten 80's classic. Not many people mention it when discussing great buddy-cop films. But they should.<br><br>The chemistry between Crystal and Hines is magical. Both actors bring a lot to the table and their comic timing is perfect. They make a great duo and it's a shame a sequel never followed. This film is ripe for rediscovery. Some great actors pop up in supporting roles as well. If you dig any of the buddy-cop movies that followed it, watch this film. Good action, good laughs, great movie.","user":"ManBehindTheMask63","rank":[16,17]}]