[{"title":"The best slasher sequel since the original film in A Nightmare on Elm Street film franchise!","rating":10,"date":"28 March 2016","review":"A Nightmare on Elm Street 4: The Dream Master (1988) It is one of my personal favorite horror movies with the original A Nightmare on Elm Street film, it is solid, decent, excellent horror slasher sequel in A Nightmare on Elm Street series franchise. I love this movie to death and my favorite heroine is Alice Johnson. This flick is Better than part 2,5,6 and the horrible awful remake that I hate to death! <br><br>We have a new heroine named Alice, which is awesome. Lisa Wilcox is a bad ass in this flick, wondering what happened to that actress. Lisa Wilcox did an excellent job as shy heroine Alice. Tuesday Knight blow my heart away she was the heart and the soul of this movie. She wrote performed the theme song Nightmare for this film. This film is actually my Renny Harlin's favorite movie alongside Cliffhanger, Die Hard 2 and Deep Blue Sea. Renny Harlin did a great job with direction and visuals of the film, I think it's actually some of the best directing work he did, and Lisa Wilcox's character Alice is probably to Freddy what Tommy Jarvis is to Jason, an enemy that he will always fight but he will always lose. This film has a lot of good soundtracks that I love. It has an excellent cast that I love. Wes Craven's a Nightmare on Elm Street will be my number 1 while this one will be my number 5. <br><br>Plot: Freddy Krueger returns once again to terrorize the dreams of the remaining Dream Warriors, as well as those of a young woman who may know the way to defeat him for good.<br><br>Before I start what I like about this movie, I love Wes Craven's original film A Nightmare on Elm Street (1984) which is my favorite best horror slasher film. My third favorite film of the series is Wes Craven's last movie New Nightmare (1994) which is my third favorite film in A Nightmare on Elm Street film franchise and I think is the third best film. <br><br>Things I Love in this movie: I like the music scores by John Easdale and Craig Safan, they are a lot of music tracks that are put in the film from the 80's. I love Tuesday Knight's song Nightmare she played it during opening credits. I love Tuesday Knight and Lisa Wilcox's acting performance both of the leads did an outstanding job as acting her characters. Lisa Wilcox was a bad ass in this film, her character as Alice Johnson was well written, she was decent and the only heroine that she never died in the film series. Tuesday Knight as Kristen Parker was decent and she was awesome, she was better than Patricia Arquette I love movies from the 80's action and horror films that I love, so this is pretty solid good movie, far way better than 5 and remake which I think they are the worst one I have ever saw. I like that this movie is fantasy and it has a good kills and Freddy is trying still to be scary. <br><br>Kristen Parker (Tuesday Knight) was actually a Dream Warrior she had a power to call her friends in her dreams, Alice Johnson (Lisa Wilcox) was a Dream Master and she gave her power to Freddy, of course Kristen was the last Elms Street child, but Freddy need it new ones to get the souls from the children to become more powerful than ever. I like the boiler room scene Kristen eventually finds herself in Freddy's boiler room. It is explained that Kristen is the last child from Elm Street, and Freddy needs her help to get more children. I like that is that explanation. I like the last fight between Alice and Freddy, Alice change her self in to an bad ass heroine she fight's Freddy defeats him with a mirror of his own image and she releases all souls of the children that Freddy took them away. I love that Alice saves Dan Jordan (Danny Hassle) from death. Brooke Theiss as Debbie Stevens was beautiful, gorgeous and hot I love her in this film. <br><br>Roland Kincaid (Ken Sagoes) and Joey Peterson (Rodney Eastman) both returned from previous installment The Dreams Warriors and they were both killed off in the beginning of the film which is stupid. I really don't like this, the characters who survived in previous installment been killed off. It feel's to me like Nancy's effort keeping them save was for nothing. That's the only problem I have with this film. <br><br>A Nightmare on Elm Street 4: The Dream Master is a 1988 American slasher horror film and the fourth film in the Nightmare on Elm Street series. The film was directed by Renny Harlin, stars Robert Englund, Lisa Wilcox and Danny Hassle.<br><br>Overral: I enjoy this film every time I see it and I have fun with it, goes very fast around it is fast paced and entertaining. 10/10 Bad Ass Seal Of Approval","user":"ivo-cobra8","rank":[93,110]},{"title":"This was the first Freddy I saw when I was a kid and will always be my favorite","rating":10,"date":"21 April 2007","review":"Its funny how I stumbled on to the Nightmare on Elm Street Serises. I was about 8 or 9 at the time. My father and I had a great relationship. He would take me to a movie every week. I was the envy of all the other kids because he didn't care if a movie was rated R or what. <br><br>So here I am looking to go to our Friday movie and my dad is looking in the paper asking me what I want to see. He asked me if I was ready for my first scary movie. I jumped for joy when he asked me that. At that time I hadn't really seen a true scary movie yet. Just the ones that where on during Halloween. <br><br>So off we went me and my dad. I remember how nervous I was because I didn't know what to expect. Here I am 9 years old in the movie line with all these teenagers grabbing there girlfriend waste and making scary faces trying to scare them. I just grabbed my fathers hand very tight and made my way in.<br><br>Wow! My first scary movie I thought to myself well here it goes. I remember asking my dad if Freddy was real about 10 times during the movie. I laughed, I cried, I screamed, I was in love with horror. <br><br>I Was Freddys number 1 fan after this movie. I bought all the older movies. I really liked number 1 and thought number 2 was really weird back then. <br><br>Anyways I love this movie for all the right reasons. There is a lot of gore. A lot of cheesy acting and just plain fun. I am not going to give anything away just go wacth it for yourself. You will love it.","user":"vwjettaluv32","rank":[24,28]},{"title":"They resurrected Freddy Krueger back to life to fight against the dream master my third favorite \"Elm Street\" movie","rating":10,"date":"1 February 2019","review":"I love this movie to death it is my third favorite \"Elm Street\" movie it is one of my personal favorite horror slaher film. The story is about Kristen, Joey and Kincaid return to the film from the previous film A Nightmare on Elm Street 3: Dream Warriors, expect Kristen is now played by Tuesday Knight instead Patricia Arquette. I heard the reason why Patricia Arquette wasn't in this film, was because she was pregnant at the time.<br><br>So the three soul survivors return to the film and they are no longer in asylum and they are living normal lives and they are attending high school. Kristen still feels that Freddy is still alive. Joey and Kincaid tell her, no he is not but Kincaid has this dream Freddy is resurrected. Dog pie fire on Freddy's grave and opens the grave and he is resurrected by that. Freddy kills Kristen, Joey and Kincaid. Once Kristen is dead Kristen gives her powers to this girl Alice (Lisa Wilcox). Alice has the power where she can call people by name or bring people in to her dream. Because Freddy killed the last Elm Street children which is Kristen, Joey and Kincaid. He can't kill anybody else, now that he is invading Alice dreams, he's trying to get her call people by name trying to bring her more victims and she doesn't do intentionally. She brings some of her friends in her dreams and he kills them. Every time he kills one of her friends she posses something that they have their ability's. He kills her brother and her brother was a martial artist. She posses that power her special skill and all the special skill they have, she makes her stronger, so that she can defat Freddy. On the end of the film it has Alice and Freddy battling each other in the church. Alice frees all the souls and saves her boyfriend from his death.<br><br>The movie it self is entertaining, it has really good visuals it was directed really well. Freddy looks really cool in this movie. His make up looks really cool in this film. It is the best make up job in this one. 3 and 4 his make up looks really good. The special effects are really good. It doesn't look like low budget film anymore, than previous 3 films were. The dream sequences they are still good sequences. It is still scary and Freddy is still creepy. When Rick (Andras Jones) dies and Alice (Lisa Wilcox) screams there is an explosion in a class room. In the opening sequence actress Tuesday Knight as Kristen Parker dreams that Freddy is back and it is still creepy dream sequence I love it!<br><br>I love this film to death I love Lisa Wilcox as Alice Johnson she was good horror heroine and the sole survivor she was never killed off even in the sequel I like that. I like the action sequences in the movie, the battle in the church between Alice and Freddy I love that end the finale. Renny Harlin did a good job directing the film. My favorite Renny Harlin is Cliffhanger withy Sylvester Stallone. He directed Die Hard 2, Deep Blue Sea, Long Kiss Goodnight and Mindhunters. Those movies I like a lot.<br><br>A Nightmare on Elm Street 4: The Dream Master (1988) is a decent sequel it is my third favorite \"Elm Street\" movie with the original slasher gory film A Nightmare on Elm Street (1984) I love it. The movie has a cool soundtracks: Don't Be Afraid Of Your Dreams by Go west I love that song I have it in my ring cell it is my favorite soundtrack. Anything, Anything by Dramarama, Back To The Wall by Divinyls, Are You Ready For Freddy? The Fat Boys and Robert Englund and of course Nightmare by Tuesday Knight the best song ever.","user":"NightmareOnElmStreetFan","rank":[8,8]}]