[{"title":"Plush Fluff","rating":7,"date":"12 June 2005","review":"This working girls go to hell soap is a time capsule candidate, courtesy of its immaculate physical production, 50s costuming (look at all those bows and pearls), creamy Johnny Mathis theme song and oh-so daring (for its time) sexual attitudes. Rona Jaffe's novel, on which the film was based, keeps on being republished, and just a few years ago Vanity Fair actually devoted an article to this delectable bon bon of a movie. Take a look at the new DVD transfer and you'll know why.<br><br>The three leads - Hope Lange, Diane Baker and Suzy Parker - echo the girls from \"How to Marry A Millonaire\" or Carrie Bradshaw and her friends from \"Sex and the City.\" \"Gentlewomen songsters off on a spree...\" Their romantic adventures and sexual entanglements are the stuff of paperback passion: empty caramel corn calories, devoid of nutrition, impossible to resist snacking on. Lange is genuinely touching in her neo-Grace Kelly way, Baker is properly dim and idealistic as a timid virgin who gets (gasp) knocked up by a (hiss) cad. It helps that the cad is played by Robert Evans, the throaty voiced, coke snorting film mogul who surely has lead many an innocent young lamb to the slaughter in his Beverly Hills bedroom.<br><br>Suzy Parker is fascinating in the first half of the film, all blithe self assurance and knowing remarks. She struts her stuff with the panache of the fashion icon she was in the 50s. Alas, she's not up to where the film sends her: into madness and obsession. But she exudes glamour and savior faire and her acting is at least adequate. One wonders why the critics loathed her, virtually driving her out of movies a few years later. Perhaps an aloof attitude on the part of a good looking woman is just too much to bear. It sank Ali McGraw's career a generation later, and, when you think of it, Ali McGraw and Suzy Parker were basically the same actress.<br><br>The film's only major flaw is a weak ending. It pretty much collapses into a romantic swoon at the end, rather than rising to a wham bang melodramatic finish, like the other famous soap opera from producer Jerry Wald, \"Peyton Place,\" which had Lana Turner weeping and gnashing her teeth during a rape trial. Here, Hope Lange wanders out onto the New York sidewalk, spots burly, eternally hung over (but now, of course, sober) Stephen Boyd and they simply walk off together...into the sunset, one presumes. Otherwise, this is pretty much the definition of a guilty pleasure.<br><br>Oh Yes...there's also Joan Crawford, breathing fire at all the young girls and smoking cigarettes while she hisses to her married lover over the phone. And the titles are done in hot pink, with ribbon lettering that recalls the department store ads of the late 50s. Don't miss!","user":"jaxla","rank":[45,48]},{"title":"Very enjoyable and well-produced \"trash\"","rating":7,"date":"12 October 2008","review":"This is a film that is far more enjoyable than its rating of 7 would suggest. In many ways, it's like a 50s version of VALLEY OF THE DOLLS--with much of the excesses and sleaziness of VALLEY polished up a bit for the audiences of 1959. Like this later film, both are about three young ladies who are on the fast-track to success--though this time it's in the publishing world instead of the entertainment industry (though one of the ladies in THE BEST OF EVERYTHING does have aspirations of Broadway).<br><br>The film begins with Hope Lange coming into the company for her first day of work. She's assigned to tough-as-nails boss, Joan Crawford, who is appearing in her first supporting role in decades. Despite how nasty Crawford seems, Lange is determined not to give in--to make it in this job. And, over time, she quickly moves up the ranks from secretary to editor. At the same time, her two new roommates also try to move up the ranks--one through the stage and one through a relationship with a rich playboy. Like VALLEY OF THE DOLLS, all of them have their ups and downs (mostly downs) but by the end of the film there is some hope that at least some of them will make it--battered and bruised, nevertheless.<br><br>In this film, men are mostly pigs. The only guy who seems decent is played by Stephen Boyd, so naturally Hope Lange neglects him for a ne'er do well ex-boyfriend. As for the guys played by veteran character actor Brian Ahern and the rest, they are sexist scum and eventually you understand how Crawford became so bitter and nasty.<br><br>This film has it all--adultery, premarital sex, abortion, etc. and is certainly NOT an artistic triumph. However, thanks to excellent production values and a juicy script, this one is a joy to watch. Just don't expect Shakespeare!!","user":"MartinHafer","rank":[14,14]},{"title":"What Is Best For Everyone?","rating":7,"date":"14 January 2007","review":"The Best of Everything is a high gloss large screen soap opera which follows the careers of four career women, Hope Lange, Suzy Parker, Diane Baker, and Martha Hyer at a New York publishing firm. What's the best for some women is not necessarily the best for all.<br><br>Presiding over this group of young fillies is wise old mare Joan Crawford who's been around the track a few times on screen and in real life. She looks right at home as the boss lady as well she should have at this point.<br><br>Around the time she was making The Best of Everything Joan Crawford became a widow when her fourth husband, Alfred Steele died. It was a particularly traumatic event for her, she woke up one morning and found him dead in bed next to her. She inherited all of his stock in Pepsi Cola where he was the board chairman and during the same period as The Best of Everything was being made, she wound up the queen bee at Pepsi Cola. Life does sometimes imitate art. So that authority as she barks out dictation and coffee orders to Hope Lange rings real true.<br><br>In fact all the women here with the exception of Lange are in for some rough sledding. It's rough for Lange too, but she literally makes the best of everything.<br><br>What a collection of stinkers the men are in this film. The best of them, Stephen Boyd, is a heavy drinker. The others Louis Jourdan, Robert Evans, and Brett Halsey, are as slimy a collection of rodents as ever gathered for one film.<br><br>I can't forget Brian Aherne either who's the fanny pinching head of this publishing firm. Half that office would have sexual harassment suits going today.<br><br>Some nice location shots of New York in the fifties make the film a real treat. Catch it by all means.","user":"bkoganbing","rank":[23,26]}]