[{"title":"You have to understand","rating":10,"date":"15 March 2012","review":"This movie was made as a spoof at a time when it was at about the same quality as what it was spoofing. On other review on this page says that the jokes and costumes are outdated and cheap. Well, maybe if you watch the current horror films. Personally, I prefer the old horror movies, from the black and white to the corny 70's gorror films. This film really does work, but you have to have a certain taste in film and comedy, so it isn't for everyone.<br><br>If you like Evil Dead, the original Friday the 13th, The Birds or those old, grainy horror films, I suggest that you at least watch it and see if you like it. You won't lose anything and you'll probably get a few laughs out of it. The worst thing about this movie, the one thing that drives me up the wall about it, is that it's usually very hard to find. It's not incredibly popular and it's rather old. Sometimes you can find it from a video retailer or one of those subscription/mail-in DVD dealers, but you're really basing it a bit on luck. As an overall, something to seriously check out, if you can find it. I hope you enjoy it.","user":"waltjrimmer","rank":[29,31]},{"title":"\"If you weren't immortal, you'd kill yourself!\"","rating":6,"date":"4 March 2017","review":"Real life couple Richard Benjamin and Paula Prentiss star in this crude and goofy horror parody from New World and producer Julie Corman (Roger C.s' wife). They play John and Mary, who inherit some property that turns out to be cursed. When their inquisitive son Billy (Kevin Brando) happens to open an all important book, he unleashes unspeakable evil on the house - and potentially the world. A non stop assortment of truly ridiculous monsters show up to terrorize John, Mary, Billy, and teen aged daughter Debbie (Kari Michaelsen).<br><br>Also along for the ride is top character actor Severn Darden, as an exterminator with the appropriate name of Van Helsing. Jeffrey Tambor, in his second feature film appearance, co- stars as a vampire named Waldemar. As always, these two guys prove to be very valuable. The movie really does hit its stride once Darden shows up. He has most of the best lines.<br><br>This is going to come off as much too tame and lame for some tastes, but clearly screenwriter / director Howard R. Cohen was going for a family audience. Some characters do die, but mostly off screen, and there isn't much gore to speak of - aside from a fairly nasty severed head. The creature costumes are hysterically dumb looking, and among those horror classics spoofed are \"Creature from the Black Lagoon\", \"Jaws\", and \"The Birds\". The finale is absolutely cartoonish, with sound effects accompanying all the face making that our adversaries are doing.<br><br>Benjamin and the oh so sexy Prentiss are a hoot as the parents, and are ably supported by Tambor, Darden, and others like Rosemary DeCamp, Stacy Keach Sr., and 70s exploitation starlet Roberta Collins.<br><br>It might be silly and infantile, but that's not always necessarily a bad thing, and this could appeal to any horror fan who saw it as a kid, or the young at heart.<br><br>Six out of 10.","user":"Hey_Sweden","rank":[8,8]},{"title":"I love this movie - for it's nastalgia of course!","rating":5,"date":"5 November 2003","review":"I was at my dad and step moms house, one day at like 7 or 8 years old. As usual I was flipping through there endless amount of video tapes. Well I came across Saturday the 14th...I love horrors, so I poped it in...thinking it would be a scary movie. Wrong...of course like the title suggests...it's going to be a comedy, and was. Well needless to say, everytime I would spend the night at dads house, it seems like I watched this movie. The charectors are kooky the monsters are silly and the family of the main charectors is hilarious to watch them bumble around the house dying off. Jeffery Tamboure (sp) is great in it...I liked his dark sarcastic attitude. And his wife is hilarious. BUT, on the other hand, in the 80's this movie would of been the bomb to a 7 year old. Today though, I seriously doubt it...with children spoiled of special effects. Thus I say, I love this movie for it's nastalgiac qualities...it brings back those priceless child hood 80's days that are long gone! Go rent it, see for yourself how wakcy this movie really is. Don't expect some horror, or block buster. It's only fun and slightly scary.","user":"ancienttowers","rank":[23,27]}]