[{"title":"Foxfire is one of my all time favorites.","rating":16,"date":"16 February 2002","review":"Originally I read Foxfire before I saw the movie.  When I was sixteen I read Anya Seton's novel Foxfire.  I enjoyed it immensely.  My mother told me that there was a movie based on the novel &amp; I began watching the listings in the TV Guide, searching for the listing for Foxfire.  When I finally got to see the movie I was greatly impressed.  I was terribly romantic, this movie's theme was a revelation to me of the pettiness of some people.  I always found bigotry &amp; prejudice to be very offensive.  The way that this was conveyed in the movie brought sympathy to both lead characters. Dartland, J. Chandler's role,was so over sensitized to prejudice &amp; his wife was so naive as to its existence, that the confrontation between the two, made the audience think.  There are many sides to ugliness in society &amp; this story embraced many of the facets of prejudice &amp; bigotry. Perhaps love does concur all, at least that, in my opinion, is the theme of this story.  I would rate this story as a two hanky classic.  Love this film!","user":"IamIsis414","rank":[16,17]},{"title":"Jane and Jeff - The kind of casting that kept U.-I. on the map!","rating":24,"date":"24 May 2003","review":"Universal-International was a busy little hive of audience-pleasing eye candy back in the Fifties and it probably employed more \"starlets\" and up-and-coming hunks in its stable of contractees than all of its major studio rivals combined.  Some of U.-I.'s output contained some very worthwhile elements amidst the Technicolored trappings.  This one offered some fairly well-considered insights on the marital tribulations encountered when two people from very dissimilar backgrounds and outlooks on life attempt to make of their marriage vows more than just a ritual they once pronounced when their union began.<br><br>Jane Russell seemed well paired with the tall and handsome Jeff Chandler and the locations look authentic enough for the story to hold one's interest. Celia Lovsky, always an actress who could win an audience's favor in the briefest of roles (and, alas, she was never allotted more than a few scenes in most of her films), scores once again in \"Foxfire.\"  This is one to watch for if you notice it scheduled on a late-night or early afternoon TV broadcast.","user":"gregcouture","rank":[16,18]},{"title":"\"You treat me like a squaw...but I won't walk twelve steps behind!\"","rating":6,"date":"6 August 2009","review":"Hot-blooded potboiler with facetious, flirtatious undermining has New York socialite Jane Russell vacationing at Arizona spa near Tucson; a flat tire brings her together with worldly half-breed Jeff Chandler (Apache on his mother's side, white on his professor father's). Their whirlwind marriage seems like a good idea at first, until Russell learns her engineer husband is beset with prejudice and Indian superstitions at the mine, that the tippling small town doctor wants her for his own, and the gossipy neighbors have their own version of a snobbish pecking order. Entertaining star-vehicle doesn't do much with Dan Duryea's role as the drunken doc (he keeps popping up unannounced, and the finale leaves his character stranded); however, Russell--with her incredulous witticisms--and strong, sexy Chandler are a good match (no big romantic sparks, though with lots of chemistry). The picture doesn't always add up on a logical level, yet emotionally it is intriguing. Handsome production (with rich color), unobtrusive direction, nice theme song co-written by Chandler and Henry Mancini. **1/2 from ****","user":"moonspinner55","rank":[5,5]}]