[{"title":"A fun sequel to watch","rating":17,"date":"17 November 2000","review":"\"Poltergeist II: The Other Side\" is a very interesting movie despite the fact that the plot was rather subpar.  My favorite movie of all time is the original \"Poltergeist,\" and this movie is a respectable sequel.  I like it because of the character Kane, for one, who gives the movie another ghostly dimension.  Julian Beck was wonderful in the film as Kane.  Also, the children remained good actors, especially the late Heather O'Rourke, who played Carol Anne.  This is another strong performance by the young actress, and would have gone on to be a wonderful adult actress later in life had she lived.  All in all, I give it a 7.5 out of 10.","user":"jeffplus3","rank":[25,32]},{"title":"They're Back","rating":6,"date":"16 September 2007","review":"While not as good as the first one this movie was interesting. It was well made and featured many of the same actors and actresses as well as a few new ones, who all turned out excellent performances.<br><br>The story line was solid and thought out. I particularly felt that Julian Beck's character Cane was a nice addition. He was chilling to watch on screen as a antagonist to the family. Will Sampson as Taylor was also an interesting character. R.I.P to both actors and to O'Rouke.<br><br>Overall a good film but one that can not possibly hold a candle to the original.<br><br>6 out of 10.","user":"nayruslove14","rank":[11,13]},{"title":"The dangers of drinking the worm in tequilla graphically displayed.","rating":5,"date":"2 February 2004","review":"This sequel was okay at the theater when I saw it, but it wasn't great. Kind of an average film that adds plot points that really are a bit weak. We find out in this one that it was not necessarily the fact the little community was sitting on an old cemetery that was the problem in the first one, but rather that the house was over some burial ground of a cult.  There is also this really old man that is a bit creepy wandering around looking for Carol Anne and the Freeling clan.  I just think they wanted to add a more physical enemy, someone you could focus on.  The family is now living with grandma, but strange stuff starts happening again.  For some reason they want Carol Anne.  An Indian guy comes to their aid and gives them advice and there are a series of happenings, but this one just isn't as good as the first one as it is very slow in places.  The ending was just plain lame and only makes this one worse than it is.  As not good as this is though, the next Poltergeist makes this one look a lot better.  Some good scenes here and there, but ultimately this one disappoints.  Though there is that memorable scene with the worm.","user":"Aaron1375","rank":[15,19]}]