[{"title":"May Have Saved Disney's Movie Franchise.","rating":3,"date":"3 July 2002","review":"Disney animated films had become somewhat second-rate by 1989 and it appeared that one of the great genres in the cinema was on life-support. But that all changed with \"The Little Mermaid\". The film is a cinematic classic that tells the story of a young mermaid princess who just wants to be human so she makes a deal with an evil sea witch to get her wish, but she loses her beautiful voice in the process and she must be kissed by her true love to get it back. A really great motion picture that has some really memorable songs in it. 5 stars out of 5.","user":"tfrizzell","rank":[84,92]},{"title":"This is my favourite movie of all time...","rating":10,"date":"17 December 1998","review":"I probably never would have seen this movie if my mother hadn't persuaded me to take my little brother to see it. I enjoyed it a lot the first time, but it was only when I saw it again a couple of years later on video I realised just how superb a movie it is. It's not a clever or complex movie, it's not the kind of film which works on an adult level as well as on a children's one. However, three aspects of it make it truly great:<br><br>1: The music. 'Under The Sea' richly deserved its Oscar, but 'Part Of Your World' deserved it even more.<br><br>2. The animation. Quite simply, it's absolutely gorgeous. The underwater scenes in particular take your breath away.<br><br>3. The Story. How can you resist a love story that touching?<br><br>I urge anyone with even a touch of sentimentality about them to set their predjudices aside and see this movie.","user":"BigAir","rank":[157,178]},{"title":"\"The Little Mermaid\" Surprised Me","rating":28,"date":"28 April 1999","review":"It has been ten years since \"The Little Mermaid\" was released.  Back when Disney originally released the film, I was both excited and apprehensive. Excited, because it is one of the best children's stories and one of my favorites.  Apprehensive, because I knew Disney would change the ending and give it a happy ending, which is understandable but still unfortunate. When I first saw it, I liked it much more than I thought I would, and after each repeated viewing, I have liked it more and more.  I am now convinced this is the second best American Animated film, after \"Beauty and the Beast\".  The music, story, writing, and animation are superb as others have stated, but the villainess, Ursula, is also a major factor in the success of the film. She is the best written and performed of all Disney villains.  She is purely evil but totally believable.  Pat Carroll, who I have often noticed but never really considered, did a fabulous job with Ursula's characterization. The music and songs are consistantly very good.  There is no deep thought to this one, but \"The Little Mermaid\" is artfully near-perfect entainment.","user":"JKearse","rank":[32,36]}]