[{"title":"Psychological terror distilled and made utterly palpable","rating":9,"date":"13 April 2010","review":"Gaslight (1944)<br><br>This is an uncharacteristic film for George Cukor, slipping sideways into Hitchcock turf for this period. Psychological suspense was never more focused, and less distracted, than you'll find in Gaslight however. You might find the plot too linear, to predictable overall, to be blown away, but in fact that's partly why the suspense works. As with great Hitchcock, you have a sense of where you going, and you want to stop it.<br><br>So we have Charles Boyer, smarmy, deceptive, and ultimately evil, leading his new wife down a path of mental anguish and, he hopes, madness. The wife is played with usual high stakes perfection by Ingrid Bergman (between her stunning roles in Casablanca and Spellbound). Cukor gets the most of her excesses, and her nuances. Boyer is more nuance, and is a perfect match. The movie is really about their back and forth, with Joseph Cotten making his appearance as a necessary line of safety and hope because we can't stand to see the woman go down without a fight.<br><br>Most of the film occurs in an old, lavishly decorated house, and the lights and camera-work are dreamy, dripping in rim light and shadow, in odd angles and closeups of their faces. It's quite an involving experience, and because you are limited to mostly these two characters, you get very intimate with them. Yes, the two maids are perfect, including a sassy Angela Lansbury in her first movie role. And the cop, too, is a classic bobby, handsome and cooperative.<br><br>The plot, alas, is the one weakness here. The man's obsession with gems is fair enough, but when we finally get to the attic, after many months of him being there searching for them, it's as if he's up there for the first time, opening drawers with cobwebs on them, scattering through drawers like a thief with five minutes and no more. It just undermines the whole premise of a man resolutely devoting his whole devious, murderous life to this one goal.<br><br>So forget the plot, exactly. It's a MacGuffin. The real movie is in the acting, the characters in their personal wringings out, and in how beautifully it is done.","user":"secondtake","rank":[28,30]},{"title":"Best Kept Secrets: Gaslight","rating":1,"date":"1 March 2007","review":"The first scene establishes the dreary tone of the film. It is nighttime in London and a murder goes unsolved. The magnificent Ingrid Bergman portrays Paula, the niece of the deceased woman. After living ten years trying to forget the past, Paula returns to her house in London at the suggestion of her new husband, Gregory (Charles Boyer). \"I've found peace in loving you,\" Paula says and decides with the help of her husband, she is ready to face the past. Fear is an essential element in the story. It seems the police cannot find a motive for the murder but when a new young assistant comes to Scotland Yard, he sees something that others did not notice or would not pursue. The murderer remains at large and his next potential victim has returned to the very house where the first murder was committed.<br><br>The cast's flawless talent makes the film absolutely unforgettable. Charles Boyer is exceedingly ominous as Paula's obsessive husband. As the high-strung wife, Ingrid Bergman gives an outstanding performance. She is startling and brilliant. Brian Cameron, played by Joseph Cotton, makes his appearance later in the film but is wonderful nonetheless. Watch for the emphasis on foreshadowing and the beautiful lighting achieved in Gaslight, as well as the particular attention to the many details that make it spectacular. George Cukor's fantastic direction of this intriguing and suspicious tale will keep you on the edge of your seat.","user":"philadelphiastorygirl","rank":[36,40]},{"title":"Them there eyes","rating":9,"date":"6 November 2001","review":"If you're looking for everything you've ever wanted to know about horror, mystery, depression, and suspense, go take a peek into Ingrid Bergman's eyes.<br><br>The actress -- who would soon become blacklisted after her marriage to Italian director Roberto Rossellini -- can convey every emotion and nuance of her character through her amazingly expressive eyes. Completely believable in George Cukor's Gaslight as a wife whose husband (Charles Boyer) is trying to make insane, Bergman can show you all her turmoil and emotional stress just by looking around.<br><br>The plot is simple, perhaps even arcane. A famous opera singer is murdered in London, leaving behind no motive, no clues, and Paula, the young niece who discovered the body. Paula is sent to Italy, where she, too, studies music, until she elopes with an older, dashing pianist (Boyer). He convinces her to move back to the exact same house where her aunt was murdered, where nothing has been changed in all those years. And, naturally, here is where the movie really begins.<br><br>Soon, her husband starts acting very strangely, and starts convincing her that she is very ill and unable to go out. Trapped in the house, alone with her husband, a somewhat-deaf cook, and a tart of a housekeeper, Paula soon starts to hear noises, see things, lose things, and even hide things. Or is she? Is she going mad? Or is her husband -- who she is supposed to love, honor, and obey -- making her mad?<br><br>The show is Bergman's to steal, and she does so with gusto, garnering an Oscar for her endeavor. With her performance, Bergman transforms the character of Paula Alquist from a weak, paranoid wimp of a wife into a woman struggling with her own identity and her role in marriage and society. Perhaps unintentionally, perhaps unwittingly, Bergman's Paula is a symbol and a superhero for all women trapped in an abusive marriage. Even today.<br><br>Granted, the story line is somewhat contrived, and one can't help but wonder how Paula never notices that her husband is completely evil BEFORE the marriage. Also, Joseph Cotten, as the Scotland Yard detective smitten with Paula's beauty, seems to come out of nowhere. Still, the acting prevails over the plot, and what better actor to come out of nowhere than Cotten? His charm and charisma make up for his character's two-dimensionality.<br><br>\nAlthough there are faults, Gaslight is an extraordinary film, generating its suspense not from an evil lurking in the shadows, but from the psychology of the mind itself. Perhaps one of the first \"pure\" psychological thrillers, Gaslight, just like Ingrid Bergman's eyes, contains the perfect blend of mystery, suspense, and beauty.","user":"srella","rank":[78,93]}]