[{"title":"Germany democracy is facing with a hard challenge","rating":10,"date":"21 December 2006","review":"This is a melancholic semi-documentary about the West Germany's traumatic autumn called as \"Deutschland Herbst\". The prominent businessman Hanns Martin Schleyer who was a member of the board of directors in Daimler Benz and leader in several employer and industry associations was kidnapped and killed by extreme-left RAF. He was formerly SS worked as an important deputy and adviser to Bernhard Adolf, one of the German economic leaders. Schleyer's uncompromising position towards workers made him a target in the West Germany.<br><br>The movie plays with different positionalities. Germany democracy is facing with a hard challenge after the WW2. If you do not know much about these events, you better read about it. The Businesman's chic funeral, his ex-SS experience and policies in the West Germany, RAF's actions are all putting you in a mixed feeling. Left and democracy are under pressure with a lack of hope. I felt like RAF was representation of this hopelessness. <br><br>It is a very simplistic semi-documentary but very successful. End of the movie was very moving with the song \"A Tu Salud\". I highly recommend you to see it. Despite you may not know much about Germany or the specific context, it has a lot of relevance to today's democracy and freedom problems.","user":"tereufuk","rank":[18,24]},{"title":"Political climate in 1970s Germany","rating":4,"date":"14 March 2016","review":"\"Deutschland im Herbst\" or \"Germany in Autumn\" is a 1978 film that is a mix of acting and documentary and focuses from start to finish on the current political climate in Germany. These may have been the toughest days since World War II for the country. Extreme left wing terrorism is a clear and present danger when Hanns Martin Schleyer gets murdered by RAF terrorists. This incident motivated some of Germany's most known and most successful filmmakers (such as Schlöndorff, Reitz, Kluge) to come together and make a 2-hour movie on the subject. In there, they elaborate on the current political climate in the FRG and take a closer look on the situation. The film starts with Rainer Werner Fassbinder's segment, in which he talks to his then-boyfriend and his mother about the issue and tries to have a successful discussion, especially with his mother. A very tense watch and performance by Fassbinder. Unfortunately I must say that the film got a lot worse after the first half hour when Fassbinder's segment was over and most of the other filmmakers had little to offer and nobody came close to Fassbinder. I am generally not the biggest fan of his works, but I always thought he was a good actor and in here it shows. He is really the only reason to watch this documentary and I wished the entire thing would have been made by him or would have been about his character in here. So yeah, overall this was a disappointing watch because, unless you have a huge subject in the matter, you will quickly lose interest and the film is simply not interesting enough for 2 hours. I personally recommend not to watch it or to switch it off after 30 minutes. Has not aged well at all.","user":"Horst_In_Translation","rank":[2,2]},{"title":"Fassbinder's Masterpiece","rating":11,"date":"11 February 2008","review":"Rainer Werner Fassbinder, possibly the greatest of all filmmakers, presents one of his major achievements to start off this topical omnibus. Portraying his own life as the stuff of cinema, Fassbinder gives us the rare film where players play themselves and the situations seem entirely believable. Featuring Fassbinder, his lover Armin Mier, and his Mother, all in uncompromising self-portrayals. This is Fassbinder's most radical and important work.<br><br>I must admit I have not yet made it to the later portions of Germany in Autumn, as I am so taken by Fassbinder's segment, which is the first after a short intro, that I have not been able to move on to the next without distraction. However, If you have any interest in Fassbinder, or Germany, or Cinema, I would highly recommend hunting down this rarely-seen treasure.","user":"jefftarts","rank":[12,28]}]