[{"title":"A silent film that you'll forget is silent.","rating":9,"date":"13 February 1999","review":"Long before Renoir or Welles experimented with depth of field, Sternberg was employing it in his silent films, and perhaps most beautifully in The Docks of New York.  The mise-en-scene is so incredible in this movie that many critics accuse the movie of being overly concerned with imagery, and less concerned with plot.  The plot is simple, yet it allows Sternberg to concentrate on what he appears to be most concerned with--developing character psychology.  One is reminded of the rich characters in Greed when watching this film, yet the sense of despair is underplayed in Docks creating a much more subtle film than Stroheim's.<br><br>Many critics claim that Docks shows a near-perfect mastery of silent technique.  Yet, the film remains somewhat obscure because it was released in 1928, when the novelty of the first \"talkies\" was overshadowing silent films such as Docks.  If you are at all interested in film history or just plain good films see The Docks of New York.","user":"Grapeape-2","rank":[45,45]},{"title":"Wonderful, engaging film","rating":10,"date":"10 June 2002","review":"I thoroughly enjoyed \"The Docks of New York.\" Betty Compson's portrayal of a disillusioned prostitute is riveting and clearly shows why she appeared in as many silent films as she did.  She truly was a great silent star.  She is good to look at and I found myself very much caring about what happened to her character.  It is no wonder her image appeared on so many postcards and photographs from the 1920s.  I think she was a bigger star during the silent era than most people today realize.<br><br>George Bancroft swaggers convincingly throughout.  His is a strong, no-nonsense presence.  Clyde Cook, known mostly for his many silent comedy films, is convincing as Bancroft's apprehensive and harried pal. Mitchell Lewis, as the third engineer who desires Compson, is appropriately menacing. Olga Baclanova, as his estranged wife, is also quite good.<br><br>The scenes in the boiler room of the ship well evoke the hazards and hardships of what must have been back-breaking labor.<br><br>The tavern scenes are raucous and animated and clearly depict the more tawdry aspects of such places.  The juxtaposition of this setting, with its boisterous, cynical patrons and the hopeful act of marriage that takes place there, is masterful.<br><br>Favorite scene:  On the morning after their \"marriage\" Compson offers to sew Bancroft's torn shirt pocket before he goes off to sea but can't see to thread the needle through her tears.  He threads the needle for her; she then kneels between his legs and sews the pocket.  The intimacy of this act, and the emotions it generates in both, is far more powerful than what we imagine took place in their bed the night before.<br><br>Great stuff!","user":"filmnutz","rank":[25,25]},{"title":"Another great silent from 1928","rating":9,"date":"11 August 2004","review":"One of the fascinating things about the movie to me was that, before he fetishized Dietrich, Sternberg's erotic sensibility seems broader. The opening scene of the men in the boiler room of a ship, wiping oil and coal dust from their gleaming skin, is one of the few times that he dwells on the male body that I can recall. And George Bancroft's swaggering, boisterous Bill is the most virile male I've seen in any of Sternberg's movies -- other than Bancroft as Bull Weed in UNDERWORLD from the year before. Of course, once Betty Compson splashes into the story, the camera loves her world-weary, wry beauty, and Sternberg constantly reminds us that she's naked under her clothing. As in his later, sound films, the settings are also sensual and full of complicated textures, reflections, and depth, with some great dockside shots in a foggy night.<br><br>The story itself is a fairly simple, but it has a warmth and genuine (or even sentimental) sympathy for love that is perhaps lost in the power struggles of Sternberg's Dietrich films. All four major characters are strongly drawn, rough-hewn, and well-played. Along with Bancroft and Compson, Olga Baclanova (of FREAKS fame) is also especially good as a sailor's bitter, abandoned wife. The dialogue in the intertitles is full of hard-boiled gems, as when the wedding ceremony is rendered, \"If any of you eggs know why these heels shouldn't get hitched, speak now or forever after hold your trap!\"<br><br>Kevin Brownlow says in THE PARADE'S GONE BY that THE DOCKS OF NEW YORK is Sternberg's finest film, and it may be so. I love the Dietrich films, and the bizarre SHANGHAI GESTURE, but DOCKS stands out for the sweet grittiness.","user":"rbyers","rank":[23,23]}]