[{"title":"Revisiting the Mob","rating":8,"date":"27 August 2009","review":"Time does extraordinary things. It's the ultimate judge. Time has granted \"Married To The Mob\" an extra doses of freshness. There aren't any dead moments or cheap shots. It's more of a delight now than it ever was. Michelle Pfeiffer creates a mafia widow that it's as far away from a caricature as anything she's ever done. A true original creation touching or hinting at the stereotype just to guide us through but her Angela is quite unique. The legendary Dean Stockwell presents us with a a mafia boss that it's just as menacingly real as he is hilarious. And Matthew Modine? Why did I think back then that he didn't have any chemistry with Pfeiffer? I was wrong. They are wonderful together. They reminded me, this time, to the Barbara Stanwyck, Fred MacMurray of \"Remember The Night\" I'm writing this comment now to entice you to visit or revisit this Jonathan Demme gem.","user":"littlemartinarocena","rank":[22,28]},{"title":"Great fun!","rating":8,"date":"23 July 2006","review":"Michelle Pfeiffer and Matthew Modine are a joy to watch in this screwball comedy. Alec Baldwin, who was an up and coming star when the film was made, is a hoot. Dean Stockwell, in a sendup of John Gotti, is hysterical. But Mercedes Ruehl, as the paranoid and over the top Connie steals the movie.<br><br>Jonathan Demme, previously known for wacky comedies like \"Something Wild\" and \"Melvin and Howard\"-proves once again that he is a genius. I was not surprised at all when he went on to win the Oscar for directing \"Silence of The Lambs.\" The performances he evokes from his actors in \"Married\" are inspired, and the audience is taken along for a wild and wooly ride.<br><br>One of the cutest, most endearing films of the 80's, it stands head and shoulders above many of the satires of its era.","user":"Snoopymichele","rank":[16,21]},{"title":"One of the funniest films I've ever seen!","rating":15,"date":"15 April 2002","review":"I had to write this review because the only user comments on file don't begin to do this film justice.   For one thing, Michelle Pfeiffer is TERRIFIC in this role -- she demonstrates a marvelous comedic style we don't often get to see.  (Maybe the other reviewer prefers her serious work, but I dispute the comment that Pfeiffer has \"matured\" beyond this role.  It's a comedy, for goodness' sake!)<br><br>And yes, Alec Baldwin is quite good, but it's Matthew Modine who steals the picture!  (He also has much more screen time.)  Mercedes Ruehl and Dean Stockwell (as Tony 'The Tiger' Russo) are absolutely delicious.  The plot is delightful, and sometimes manages to touch on some more somber issues, as all great comedies do.<br><br>In short, I've seen this hilarious film two or three times over the years, and thinking about it now makes me eager to watch it all over again!","user":"LMorland","rank":[19,27]}]