[{"title":"Enjoyable low-budget adventure flick with tons of nudity and gore.","rating":16,"date":"16 November 2006","review":"Rating: *** out of **** <br><br>They really don't make movies like this anymore, and by that I mean we don't see low-budget hybrid adventure/horror flicks with constant gratuitous sex and nudity anymore, making Emanuelle and the Last Cannibals a relic of a time when exploitation cinema was at the height of its popularity. Almost thirty years later, this particular flick rates among the most entertaining of its genre.<br><br>The film opens in a mental institute, where undercover report Emanuelle (70s sex icon and all-around hottie Laura Gemser) figures she has a lead for a big story on cannibals when a nurse is bitten by one of the patients. Following up an interview with the patient, Emanuelle forms an expedition to the Amazon, where she tags along with an anthropologist, a hunter and his sex-obsessed wife (ultra hottie Nieves Navarro), a nun, and a blonde chick (Monica Zanchi) who really seems to serve no purpose other than showing skin. For the majority of the journey, the most pressing concern is who's going to have sex with who, but they eventually cross paths with a tribe of cannibals who decide on making this particular band of travelers their next meal.<br><br>I suspect the one audience that will find themselves most disappointed in the film are horror fans expecting a wall-to-wall gorefest. Except for the last ten minutes, there's very little in the way of violence and even then the actual gore effects may prove a letdown. Rather, your enjoyment of the flick rests more on the scenery, the constant nudity, and a low-budget sense of adventure through the jungle. Maybe my standards have gotten lower, but it really was enough to make for an entertaining experience.<br><br>I admit to being a fan of jungle adventure flicks, if for no other reason than to enjoy the exotic sights and sounds. Emanuelle and the Last Cannibals isn't exactly Temple of Doom in this regard, but it does a sufficient job of using its jungle locations to maximum effect so far as possible for such a low-budget flick. Of course, when the setting is mixed with hot naked women, how can I resist?<br><br>As Emanuelle, Laura Gemser is a hottie who appears perfectly natural and comfortable with her body, which seems to be the defining trait of her character. Her best moments in the flick include a hot sex scene at a pier, in which despite being clothed we still get great looks at her breasts and bush, and the last ten minutes of the movie, where she strips totally nude to fool the the tribe into thinking she's their water goddess. This actually stands as one of the most creative excuses for nudity I've ever seen and ultimately serves as a great way to cap-off the flick.<br><br>The other women in this flick are Nieves Navarro and Monica Zanchi. Navarro is an incredibly hot redhead with a fantastic body. She gets in her most memorable moment with a very explicit masturbation scene where she shows us virtually every inch of her body. It's also worth noting she bears a strong resemblance to the gorgeous Rocki Roads. Zanchi pales considerably in comparison to Gemser and Navarro, but she has a fairly good-looking body and contributes to the nudity. Like Gemser, she also spends the last ten minutes of the movie without any clothes on. It is bothersome to note that her character may have gotten impregnated by the tribe but it's an issue never brought up by anyone else at the end.<br><br>As a horror flick, Emanuelle and the Last Cannibals is pretty much a resounding failure. While there is gore, the film is still otherwise lacking in suspense and action. But the addition of horror elements only serves to make this a very amusing cross-genre experience. If you're into low budget 70s exploitation cinema or just like to see hot naked women traipsing through the jungle, then this is almost undoubtedly a must see flick.","user":"Li-1","rank":[24,27]},{"title":"Impressive textbook trash","rating":7,"date":"22 October 2005","review":"The acting may be appalling, but it's difficult to tell for sure because this is dubbed -- badly. The direction, by high priest of sleaze Joe D'Amato, is adequate, but it's the unrelenting sex and violence that float this flick's boat.<br><br>A lot of \"classic\" exploitation is, in fact, incredible boring, slow moving, and beyond inept. This is not one of those. This delivers what audiences expect, and it takes the carnage several steps beyond the norm. We get nipples cut off and eaten, a vagina cut open and used as a hole to pull innards through, castration, close-to-hardcore sex, stabbings, beheadings and damn attractive women.<br><br>Laura Gemser is her usual stunning self as Emanuelle and is lovingly scrutinized in a couple of love scenes by D'Amato's leering camera.<br><br>Some of the photography is surprisingly atmospheric and the score is memorable and moody.<br><br>The director is often criticized for his output, but I'm happy to congratulate him for a body of work that is, if nothing else, unashamedly extreme and sleazy. Franco made many more boring stinkers than D'Amato and rarely made anything that wasn't awash with shoddy camera-work, nonsensical plotting and self-indulgent repetition. D'Amato, on the other hand, was a dedicated journeyman who gave audiences what they wanted. He wasn't a genius by any stretch and he was sloppy with his action direction, but he did contribute to an impressive oeuvre.<br><br>\"Emmanuelle and The Last Cannibals\" is textbook trash.","user":"fertilecelluloid","rank":[24,28]},{"title":"Just what I needed","rating":27,"date":"27 April 2003","review":"The sex in this one is really hot. In fact it's got the best female masturbation moment that I've ever seen. It's the extreme violence paired with the over the top soundtrack music that really blew me away. Also the cannibals going wild. I showed some friends and they had never watched anything like it. If only \"House of 1000 Corpses\" could be so crazy. We live in sensitive times and in a tame country. Thank goodness for the classic Italian cannibal movies.","user":"horrorbargainbin","rank":[21,26]}]