[{"title":"Strangely overlooked cerebral farce.","rating":22,"date":"22 August 2002","review":"That this 1988 movie contains 2 sympathetic, non-stereotypical gay characters says a lot about the movie makers. There seems to have been some real care taken over what could've ended up a cheaply made throwaway farce.<br><br>Lily Tomlin and Bette Midler are simply superb in their roles as separated twins and in my view out-do Jeremy Irons in that year's other twin movie `Dead Ringers' - and he was fantastic.<br><br>This film has been criticised for not delivering laughs where you would predict them based on the film's premise. But is that a fault? Big Business builds comedic tension early on and sustains it throughout by clever use of supporting characters and the subtle way that from their scenes with them we learn about the 4 leads.<br><br>The eternal dilemma of nature v nurture is portrayed in a fairly non-preachy way coupled with a similar approach to town v country. To do this in a farce containing 4 romances plus all the rest is a tall order for any moviemaker but this rich premise is cleverly negotiated by Jim Abrahams &amp; the writers with only a handful of misfires.<br><br>Now I'm not one for romances but the studly Fred Ward, who was unbelievably 46 years old at the time, as the whiter than white Roone Dimmick, manages an amazing feat - his meeting and courting of Lily Tomlin in the space of a few minutes is carried off quite plausibly by this accomplished and underrated actor and is a joy to behold.<br><br>10 out of 10 and a real shame that there is no more from these 2 writers.","user":"rugger-4","rank":[30,31]},{"title":"Terribly underrated","rating":8,"date":"2 April 2003","review":"Terribly underrated, this little comic jewel may rank with 'Clue' and 'Noises Off!' as one of the greatest film farces ever. Repeat viewings reveal an attention to detail one wouldn't expect from a big-budget comedy of this period, and most of the jokes work very well indeed. As others have pointed out, the film resists the temptation to stereotype its characters, and the script is wonderfully quotable. If the resolution seems a little silly, well, what did you expect? <br><br>As for the performances, I know Pauline Kael said this was Midler's movie, but for my money there's no question that Lily Tomlin's the star of the show, especially as country Rose. Her delivery of such simple lines as 'Boy, are you bossy' and 'I am gonna kick yer ass' are priceless. Highly recommended; it gets funnier every time. 8.5 out of 10.","user":"kintopf432","rank":[50,54]},{"title":"If you enjoy a good laugh...","rating":10,"date":"30 August 2001","review":"...watch this movie!<br><br>Two newborn sets of identical twins are mixed up at the hospital - one pair from a rich family from New York, the other pair from a poor family of farmers from a small town called Jupiter Hollow. Raised in very different society classes, 30 years later they're coincidentally about to cross paths, as they're all staying at the Plaza Hotel in New York..<br><br>This is probably the most amusing movie I've ever seen - lots of funny remarks, scenes and situations - and Bette Midler is playing the role as the hotheaded Sadie (well, the two Sadies..) sooo good! One of those movies you can watch again and again!","user":"weird.person.dk","rank":[16,16]}]