[{"title":"Holy S**t","rating":10,"date":"26 November 2000","review":"When I first read the synopsis for Psych-Out, I expected it to be incredibly stupid, but once I watched it I decided otherwise. This film provides a rare look into a time too offen reduced to nostalgic simplicities. A true time capsule, watch and see. NOTE: It is quite embarrassing when Nicholson is miming (on guitar) a bastardized version of Purple Haze, but the scene is enjoyable nonetheless. Great music by Strawberry Alarm Clock and The Seeds (both bands perform live in the film). The STP sequences are fun to watch. Another part is where Elwoood (Max Julian)fights a bunch of garbage gargoyles in a local dump, but since he ate a hit of acid, he sees them as knights and dragons. Bruce Dern plays a good role in this film as 'The Seeker' who is being looked for by his sister Jenny (Susan Strasberg). Dave (Dean Stockwell) is an acid freak and his role is equally effective. But the main treat is seeing Jack Nicholson (as Stoney) with long hair saying 'out of sight' and crashing around in a van with his psychedelic band, Mumblin' Jim. Although not for everyone, this film can be incredibly enjoyable.","user":"kakkarot","rank":[44,52]},{"title":"Wickedly good fun from the era of Flower Power","rating":6,"date":"21 November 1999","review":"It's a rock band - hippie gang trying to protect a deaf runaway girl while on the search for her missing brother, but instead, they're taking The Trip to nowhere. Director Rush, who gave pony-tailed Nicholson some star treatment in HELL'S ANGELS ON WHEELS, delivers this pretty good view of offbeat, sublime hysteria pertaining to the drug frenzy that popularized late 60s culture. One troubling factor, though: it was made to immoralize society as we once knew it. Just say \"wicked\", and you'll enjoy this cinematic acid trip that isn't half-bad. RATING: * * 1/2","user":"emm","rank":[16,18]},{"title":"Classic psychedelic trash!","rating":3,"date":"3 January 2002","review":"If you try and take 'Psych-Out' seriously you're making a big mistake. This is Haight-Ashbury presented  by Dick Clark after all! But as 60s camp it's great fun, and dare I say it worth watching more than \"real\" head movies from the period like 'Chappaqua' and Antonioni's 'Zabriskie Point'. This mightn't be what the 60s were really like, but after watching Mumblin' Jim and fans at the Ballroom, or the happiest funeral ever, music courtesy of garage Gods The Seeds, you'll wish that it was, and that you were there!<br><br>Jack Nicholson stars as Stoney, the leader of small time psych rock band Mumblin Jim'. His band mates include Adam Roarke ('Dirty Mary Crazy Larry') and Max Julien ('The Mack'). Deaf beauty Jenny (Susan Strasberg, 'The Trip') is a runaway looking for estranged brother Steve (Bruce Dern, 'Silent Running'), now known locally as \"The Seeker\". Dean Stockwell ('Paris, Texas') returned to the screen after a few years absence as tripped out oracle Dave (\"It's all just one big plastic hassle\", \"reality is a dangerous place\",etc.). Also look out for future directors Gary Marshall (an uptight cop) and Henry Jaglom (a classic zombie-hallucinating freak out scene!), and performances by Strawberry Alarm Clock. <br><br>A splendid time is guaranteed for all just as long as you stay away from the rednecks at the rubbish dump, avoid playing in the traffic on STP, and nobody doing the dirty dishes. Grooovy baby!","user":"Infofreak","rank":[29,37]}]