[{"title":"Comfort Film","rating":9,"date":"27 February 2018","review":"I don't know why, sometimes I think it may have to do with previous lives, otherwise why do I feel so comfortable within the discomforts of this English seaside hotel. But the fact is that, often, I want to put it on and sit at one of the tables myself. I believe that Terence Rattigan is the main reason. What a wonderful writer. Then, Gladys Cooper of course, how can such a perfidious mother be such a pleasure to watch? Maybe is that explosive combination of Rattigan/Cooper. Wendy Hiller in one of her few meaty roles in movies, she won an Oscar for it and every nuance, every look is worth pages and pages of exposition. Exquisite. Cathleen Nesbitt is a joy to behold. Deborah Kerr,\nDavid Niven who also won the Oscar for his sad impostor, Burt Lancaster and Rita Hayworth bring a dash of Hollywood to the grayness of Bournemouth. Okay, now, dinner is served. Don't let it get cold.","user":"martindonovanitaly","rank":[55,57]},{"title":"What a pity most of today's cinemagoers will never see this very moving film","rating":7,"date":"7 January 1999","review":"This is without doubt one of the best films I have ever seen. The fact that it all takes place in one small Bournemouth (England) hotel, no violence, no special effects, no thousands of extras, or vast expenditure says it all. Excellent performances from a star studded cast, especially David Niven. It is gripping from start to finish, but by modern standards in a gentle way. A movie possibly mainly for women, but as a man I can only say that I found it very moving. A film I will always watch whenever it comes around as it always will. A classic.","user":"yorky","rank":[111,121]},{"title":"Fascinating character studies at a seaside hotel...","rating":16,"date":"16 May 2002","review":"Deborah Kerr and David Niven give stunning performances in this interesting character study of residents of a British seaside hotel forced to examine their feelings and emotions through the revelation of a scandal involving a blustery phony Major Pollock (David Niven. His relationship with the repressed daughter (Deborah Kerr) of a domineering mother (Gladys Cooper) is just one of the interesting aspects of this filming of Terrence Rattigan's stage play.<br><br>Rita Hayworth and Burt Lancaster are excellent as ex-lovers forced to examine their pasts. Wendy Hill excels as the keeper of the hotel, herself involved in an affair with Lancaster. Rod Taylor and Audrey Dalton do well as the young lovers caught in the claustrophobic setting dominated by snooping elderly women.<br><br>A very worthwhile, sensitive study of people trying to spend quiet days at a resort--very disparate people leading separate lives who must cope with their differences. <br><br>Deborah Kerr gives a deeply felt, genuinely moving performance opposite Niven's blustery major and Cooper's exquisitely well-mannered but narrow-minded mother. Niven deserved his Oscar for his moments of quiet desperation and crumbling of character--but Kerr is equally fine and should have had Academy recognition for this role instead of just a nomination.<br><br>Wendy Hiller is especially impressive and surely deserved her Best Supporting Actress Oscar as the innkeeper who deals intelligently and sympathetically with the various crises facing her guests. She is a pleasure to watch as she struggles to keep her guests comfortable under trying circumstances.","user":"Doylenf","rank":[82,91]}]