[{"title":"A solid Western...","rating":8,"date":"19 November 1999","review":"Robert Middleton was a big brutish character actor... We have seen him in \"The Silver Chalice\" opposite Paul Newman, in \"Friendly Persuasion\" opposite Gary Cooper and in \"Love Me Tender\" with Elvis Presley...<br><br>In \"The Proud Ones\", he is at his best as the smooth-faced and smooth-spoken saloon owner who tries to have the lawman relieved of his job in order for the town to be wide open for wild business...<br><br>Middleton makes a considerable impression as Honest John Barrett, distinctive in his dishonesty and insincere manners... He is a thief ready for anything in order to control his lucrative interests, hiring cheap crooks like George Mathews (Dillon) who results a fraud according to his rules... We see him hiring dangerous gunmen willing to slay at any time like Chico (Rodolfo Acosta), who swears to the Marshal that he will kill him one day...<br><br>The film arouses profound suspicion that we are pushed to ask ourselves why a suspicious man like the Marshal had to shoot someone apparently unarmed from behind and can we justify his action?! ¿Is he, by any chance, a 'trigger-happy' murderer?<br><br>Jeffrey Hunter performs the mistaken cowboy involved in a sinful act to avenge his father's death with the wrong man... He never believes the rectitude of the Marshal who has a questionable past... Hunter accuses him of killing his father... 'It was either him or me', exclaims Ryan, 'but I never shot an unarmed man in my life.'<br><br>The climax of the film proves clearly and openly the whole truth to the tormented young man when he confronts Barrett in a showdown... The film wakes up our attention in its development when we discover that the proud Marshall is losing the power of seeing, a serious problem considered suicidal for a lawman who has powerful enemies...<br><br>With the lovely Virginia Mayo, the good jailer Brennan and the timid O'Connell, \"The Proud Ones\" is a solid Western, which remembers me a similar one, \"The Lonely Man\" with Jack Palance and Anthony Perkins...","user":"Nazi_Fighter_David","rank":[35,39]},{"title":"Powerful and Memorable; Indicting Dishonesty, Celebrating Courage","rating":8,"date":"15 June 2005","review":"\"The Proud Ones\" has an extremely fine script by Edmund H. North, veteran screenwriter; its plot vastly improves on the novel on which it was ostensibly based. Robert D. Webb's direction is taut, featuring dense images, helping his actors to achieve top-notch performances. Every element of this production works, from the art direction by classy Lyle Wheeler to the memorable theme song, the music by Lionel Newman, the sets, and the costumes by Travilla. Among the outstanding performances are those given by Robert Middleton as \"Honest John\", villain of the piece, George Matthews as his 'segundo', Whitner Bissell and others as townsmen and henchmen; the film is far-above-average in acting. This well-remembered dramatic western stars Robert Ryan, Virginia Mayo and young Jeffrey Hunter as a youth who is befriended by an aging marshal (who has been run out of a town poisoned by the lies of a delusive gambling joint owner). Hunter acquits himself well, as does Ryan, as the younger man tries to forgive the man he begins to admire, even after he has killed the boy's father in the line of duty. Virginia Mayo achieves considerable skill and charm as the woman who loves Ryan. The story's theme of honesty set against plausible pretense is unusual and difficult to carry off; the adjective \"proud\" has been forced to carry two contradictory meanings for years. Here it is used correctly in a secular sense to refer to men too honest to be bought off and too brave to be scared off, the sort of men who will fight when necessary, refusing to be intimidated. All-too-rare are films that celebrate objective minds, people who can be honestly wrong but act ethically when the chips are down. Whole genres are based on the betrayal of such commitments by people who argue they \"can't help being what they are\".As the beleaguered marshal in this story faces a town full of profiteers with the wrongness of their selling out to be opportunistic looters of unearned wealth during a boom, the film is raised to heights of thoughtfulness and of clearly-exampled good and bad behavior seldom found in the western genre. This is a very good and a very memorable achievement of cinema. Incidentally, it is physically beautiful to watch as well.","user":"silverscreen888","rank":[35,42]},{"title":"Good solid Western Action!","rating":8,"date":"19 September 2005","review":"The Proud Ones is just that: A Western about the proud men of the Old West starring Robert Ryan and Virginia Mayo and a host of other good performers. The plot is simple: A lawman is trying to keep peace in town when the trail drovers arrive. One of them, a young cowboy with two sixguns on his hips, has a grudge against the lawman because the lawman killed his father a few years earlier in another town. Ryan, playing the lawman, takes the youth under his wings and trains him. Eventually, he comes around. But that is not the main problem. Ryan, suffering a wound, is having trouble with his eye-sight and it's effecting his work. That will pose a great problem before the movie ends.<br><br>Robert Ryan has always been a great actor. He plays the tough, hard character in nearly every film and does it as though it were as natural for him as eating dinner. And he comes through in amazing style in this Western as the lawman.<br><br>It's a really good Western with some solid Western action and, for those who are Western fans, it is one well worth viewing over and over. For the mainline theme is: How much will a man/woman do in order to retain their honor and pride? It's a question each of us have to face in life and this movie offers some good feedback about the answer.<br><br>I strongly recommend the movie to all.","user":"Flaming_star_69","rank":[23,27]}]