[{"title":"A classic war-is-hell movie","rating":31,"date":"31 January 1999","review":"No, not the very wonderful TV series. The Robert Altman film with Donald Sutherland as Hawkeye, Elliott Gould as Trapper John, and Radar as Radar. This is a dark comedy, but it's a delight from beginning to end. And even more effectively than the TV show, the movie illustrates the complete insanity of war. (But even the movie doesn't depict Jesus on the cross hanging from a helicopter. For that you'll need to read the book.) Like most Altman films, this one is episodic. It's also gritty, grim, bloody, offensive, and charming. And Frank Burns (Robert Duvall) is not a character watered down and humanized for television. This is an example of a film so rich in detail (like Altman's \"Popeye,\" come to think of it) that it demands multiple viewings.","user":"Bill-308","rank":[66,91]},{"title":"Clearly an important part of film history, but the years haven't been kind to it (in my eyes)","rating":7,"date":"8 August 2010","review":"I should probably watch this again, since so many consider it a masterpiece. Maybe I was over-prepared (Hey, it took me a second viewing of 'Citizen Kane' to get my past pre-set expectations!). But while I could see why M*A*S*H was groundbreaking and important for a Hollywood film of it's day (lack of the usual clear narrative line, anti-war stance, overlapping, improvised dialogue, sexuality, bloody operating room scenes serving as ironic counterpart, etc), it felt pretty dated and unfocused. There are some very funny moments, but a lot of the ironies seem easy, and there's a lack of a true darker underpinnings and ideas, unlike, say, 'Dr. Strangelove'. <br><br>A lot of the humor is juvenile, cruel and silly. And while I get that's the point – nothing can be more deeply juvenile, cruel and silly than war, it got repetitive and heavy handed after a while. The performances are good, but beyond Robert Duvall, none of the characters have much in the way of dimensions. People stay exactly what we think they are from the moment we meet them. <br><br>Walter Chow makes a good argument on the web site 'Film Freak Central', that the sexism, homophobia, etc are the whole point. Altman is saying we're ALL beasts at heart, even if we act like we're bucking the system. It's an interesting idea, but I'm not sure I buy it's what Altman was intending.","user":"runamokprods","rank":[24,32]},{"title":"Outrageous, in-your-face black humor","rating":22,"date":"22 August 2007","review":"M*A*S*H is a groundbreaking film. Along with Catch 22, M*A*S*H had the audacity to ridicule two of the pillars of American society: war and religion. Whether you find this appalling, subversive, treasonous, outrageous or funny depends on your political and religious orientation. Surely the religious right will find the film blasphemous and the political right will find it treasonous. No matter what your point of view, M*A*S*H is certainly an in-your-face film.<br><br>The irony of the film is that for the time it was considered gruesomely bloody. Yet there are no battlefield scenes; all the blood is in the surgical unit. The CSI TV series shows more carnage than M*A*S*H, but M*A*S*H was filmed over 30 years ago.<br><br>M*A*S*H is loaded with bizarro characters. Donald Sutherland, Elliot Gould, Robert Duvall, Tom Skerrit, Loretta Swit, Radar are all insane in their own way. In \"M*A*S*H,\" everyone is cruel, playing mean practical jokes and the anti-heroes Donald Sutherland and Elliott Gould are just plain heartless. They absolutely torment Major \"Hot Lips\" Hoolihan and Robert Duvall. None of the characters in the film tries to be funny. There are no jokes. The humor just grows from the situation which is the grim reality of a mobile surgical unit whose doctors and nurses try their best to repair the horribly mutilated bodies from an insane war. Having worked in a hospital setting, outrageous and black humor is commonplace, especially in the ER, but in M*A*S*H it's taken to a new level.","user":"StanleyStrangelove","rank":[34,48]}]