[{"title":"In the Wake of the Nautilus, the U.S.S. Seaview","rating":7,"date":"10 May 2005","review":"I still remember seeing this film at movie theaters way back when I was a lad. Of course I didn't hear very much of it due to all the shrieks and squeals from the teenage girls in the audience over Frankie Avalon. That curiously enough didn't matter because Voyage to the Bottom of the Sea is a very visual film.<br><br>It might seem a little old hat today, but we've been through two more generations that have seen the United States Navy become an atomic fleet of submarines and surface carriers. It was only seven years earlier, in 1955 that the U.S.S. Nautilus was launched as our first atomic submarine. In homage to that wonderful visionary Jules Verne who foresaw atomic power one hundred years earlier the Navy named it after that famous undersea ship of Verne's great novel 20,000 Leagues Under the Sea. The nuclear submarine was a wondrous thing in 1961.<br><br>The idea of a nuclear power submarine was the brainchild of Admiral Hyman Rickover. Rickover was a tough minded s.o.b. who usually got whatever he wanted by any mean necessary including bullying. Hard to believe that the gentlemanly Walter Pigeon could play him, but he did and well as Admiral Harry Nelson, the ersatz Rickover. <br><br>What's happened here is that the Van Allen radiation belt that surrounds the Earth has caught fire and temperatures are climbing all over the world. The planet is doomed, but Walter Pigeon's got an idea to save it. Fire a missile and seed the belt with more radiation, kind of a nuclear backfire and the blaze will end.<br><br>A lot of people are telling him it won't work, but Pigeon brushes them all aside. The only two who have faith in him are his assistants played by Peter Lorre and Barbara Eden. But our intrepid admiral pushes through. <br><br>Of course the U.S.S. Seaview encounters all kinds of obstacles along the way, but that's the rest of the story.<br><br>The cast does very well for itself and young Frankie Avalon as a junior officer comes off rather nicely. Frankie sings over the title credits, but during the movie plays a trumpet. Avalon in fact was a trumpet virtuoso and a singing career was an afterthought. The fickle finger of fate.<br><br>Voyage to the Bottom of the Sea still a nice science fiction adventure even though it is dated.","user":"bkoganbing","rank":[34,37]},{"title":"smoke gets in your eyes","rating":6,"date":"6 April 2004","review":"Walter Pidgeon leads fellow iconoclasts aboard a giant, futuristic (for 1961) submarine in a desperate race to save the world from firey oblivion. Another reviewer once commented that there was plenty of action but precious little logic in this film, but so what?  If one views it as escapist nonsense, it's pretty enjoyable, even if the plot does get a little overheated (sorry, we couldn't resist) toward the end.  Van Allen belt catching fire?  Absurd.  Three thousand foot crush depth for a Thresher-class attack sub?  Ridiculous.  But again, so what?  The effects hold up pretty well, there's a solid cast including Peter Lorre (not his last film but clearly his days were numbered), Michael Ansara, and Frankie Avalon, who was thrown into the mix to attract a younger audience, and, of course, the giant octopus. The octopus scene was actually shot in reverse, since octopi are quite timid and this one could not be coaxed into attaching itself to the submarine for any usable length of time.  Seriously though, in spite of bad science and stupendous leaps of questionable logic, \"Voyage\" is a better than average vintage sci-fi flick.  Make a big bowl of popcorn and enjoy the ride!","user":"march9hare","rank":[27,29]},{"title":"Before Roddenberry's Star Trek, there was Allen's \"Voyage to the Bottom of the Sea\"","rating":17,"date":"17 March 2008","review":"A solid piece of science fiction that's fairly dated, \"Voyage to the Bottom of the Sea\" was a film from the old school of exposition film making. Half docu-drama and half science-fiction, Allen's production makes an effort to mix the world of tomorrow, as it was perceived in the late 50s and early 60s, with then contemporary drama. The result is somewhat stilted, and immature in a very innocent sort of way, but worth a look if you need some vintage sci-fi on your screen.<br><br>The exposition of what Irwin Allen felt \"the future\" of scientific defense in the realm of the world's oceans feels like a Disney documentary. The drama almost seems as an afterthought to the technology being depicted (which I'm sure isn't too far off the mark), and doesn't really ever click in.<br><br>An egalitarian para-military that is the crew of the USOS Seaview, was no doubt an inspiration for the Star Trek franchise as it was first conceived, as were probably the scientific functions of a government vessel manned by what is ostensibly a crew serving aboard a vessel whose role is part defensive and part scientific. It is in this capacity that the story takes shape, and challenges sub and crew as the fate of mankind hangs in the balance.<br><br>Scientific loopholes abound: Ice floats (the breakup of an iceberg would not produce sinking chinks of ice), radiation doesn't catch fire (the Van Allen belt is speculated to be a result of USAF atmospheric nuclear tests in the 1950s), the most advanced attack subs today can not dive beyond 1300 feet, active sonar is rarely used, etc. etc. etc. But, if you can get by all that, and forgive some of the earlier film making stylings in this film, then it's worth a look.<br><br>It's not classic vintage sci-fi in the conventional sense, but one clearly sees how it influenced generations of sci-fi films to come afterwards, as well as spawning the eventual TV series that evolved from this film.<br><br>Give it a chance, but don't expect too much. If you're a younger viewer reading this review, then you'll probably get somewhat impatient with it. Even so, try to keep in mind the kind of film it is, and the time in which it was made.","user":"Blueghost","rank":[24,27]}]