[{"title":"Fine late-career vehicle for an aging acting legend","rating":15,"date":"15 February 2003","review":"A year after looking silly starring in the Dirty Harry clone \"McQ,\" John Wayne gave the modern-day cop thriller another try to much better effect in \"Brannigan,\" a fine vehicle for the aging legend.  <br><br>Wayne plays Lt. James Brannigan, a Chicago police detective hot on the trail of mobster Ben Larkin.  When Larkin is located in London, England, Wayne is dispatched to pick him up and extradite him home to face criminal charges (extortion, prostitution, bribery, murder).  Upon arrival in London, he meets his pretty young escort Jenny (she's on loan from vice squad.), who takes him to meet Scotland Yard chief Sir Charles Swann (\"Gandhi\" director Richard Attenborough, in a terrific performance).  In the meantime, Larkin, who is under surveillance, is kidnapped, thwarting Brannigan's plans for a quick extradition and embarassing Swann, who has just berated Brannigan for losing Larkin in the first place and assuring him:  \"It can't happen here.\" To Swann's obvious displeasure, Brannigan decides to stick around and help Scotland Yard find Larkin, even though he and Swann have a prickly relationship at best and disapprove of each other's police methods--i.e. Brannigan is a conservative who carries a gun and believes in the use of force and Swann a liberal who doesn't believe in either.  Brannigan also spends a great deal of the film dodging a hit man whom Larkin hired prior to his kidnapping.<br><br>What follows is an amusing, and low-key, caper that is culminated by a well-choreographed chase through the streets of London, a hilarious bar brawl, and several attacks by the hit man, including one in which Jenny is almost killed.  Wayne is in fine form here, well-served by the change of locales and by his character who, unlike McQ, is closer to his own age and not as much of a Dirty Harry-clone.  The film is also marked by a much lighter tone than his previous outing, and unlike his uncomfortable pairing with \"McQ\"'s Eddie Albert, he and Attenborough make a memorable team and have several terrific scenes together.  A warning, however--compaired with today's myriad of over-the-top action films like \"XXX\" and every \"Lethal Weapon\" wannabe of the past fifteen years, \"Brannigan\" is pretty subdued and the action scenes will seem tame to today's thrill-seeking action audience. Unlike today's action dreck, the name-of-the-game in \"Brannigan\" is characterization and plot, as it was with most genre films of the '70's.<br><br>Also unlike today's action films, \"Brannigan\" has a memorable supporting cast, all of whom play characters who actually resemble real people.  As I said earlier, Attenborough is terrific as Wayne's sparring partner, and Judy Geeson is a worthy partner for Wayne, although as was also standard for the era, she's mostly around to scream \"Jim!\" every time Brannigan is in danger and to be protected by her new friend.  John Vernon (the dean in \"Animal House\") is a fine villain as Larkin, and Mel Ferrer scores points as Larkin's sleazy (and crooked) lawyer, who obviously knows more than he lets on.  Daniel Pilon adds menace as the mostly silent hit man Gorman.  And look fast for Lesley-Anne Down as a hoodlum's girlfriend.  <br><br>John Wayne only made two more films after \"Brannigan\"--\"Rooster Cogburn\" and \"The Shootist.\"  And while \"Brannigan\" will probably be regarded as one of the lesser efforts of his legendary career, it was, and remains, an amusing and entertaining two hours, and a rare chance to see Wayne in a contemporary setting.  It's a worthy effort.  *** (out of *****)","user":"jimu63","rank":[36,39]},{"title":"Pure entertainment","rating":10,"date":"26 March 2007","review":"From the time I saw Brannigan in the theaters as a kid, through a number of chances to watch it again over the years, it has been one of my favorite movies. I grew up with the crime dramas of the 1970s, had little patience for Westerns, and am sorry John Wayne had so little time left to make detective movies. His other police drama, McQ, was trying so hard to imitate other \"gritty\" characters and films, was so formulaic, artificial, confusing, dreary, stiff, heavy-handed, and cliché, that these elements crowded out Wayne. Not so Brannigan.<br><br>Wayne shined. He was natural and utterly comfortable and convincing in the role. He was likable, frank, good-natured, decent, down-to-earth, and tough -- \"so damn solid,\" as Geeson's character put it (to which he replied, \"Fat, you mean\") in a nice, genuine scene where Brannigan talked about wanting to catch the hood responsible for killing his rookie partner because it was his duty to protect the kid even though, no matter how \"nice a story\" it would make if the kid had been like a son to him, he had not even liked the \"smart-aleck\" kid. Wayne had terrific, commanding screen presence. He looked as fit and acted as vigorous as called for by the role. Suggestions in other reviews that he was \"too old\" or \"too fat\" are nonsense. The mature cast is a pleasant contrast to today's rampant superficiality.<br><br>All of the supporting actors -- Attenborough, Geeson, Ferrer, Vernon, Pilon -- were real professionals who similarly brought substance to their roles and played them smoothly and effectively. The characters were nicely sketched. For example, Attenborough's titled Scotland Yard official was not a caricatured fop or dandy; he was polished but also appreciated rough, direct action to get the job done, which created a nice grudging rapport between him and Brannigan. One review's dismissal of Pilon's hit-man as \"Inspector Clouseau\" is absurd; both the policeman and the hit-man were portrayed effectively in this movie, with the policeman actually outsmarting and outmaneuvering the hit-man in believable ways. The story had action, energy, purpose, and humor. The dialogue was smart, and the plot interesting, with some clever touches. The photography and music made it all the more enjoyable.<br><br>This is a fun, smart, well-paced, well-produced detective story with a good plot, well-drawn and well-cast characters, and good locations. The movie is excellent entertainment. As such, I could not recommend it more highly. Reviewers who apparently failed to watch the film on its own merits and have nothing to offer but pseudo-sophisticated, overly general, cheap-shot criticisms do not do it justice.","user":"mysteriesfan","rank":[30,34]},{"title":"Routine thriller with good supporting cast and locations","rating":27,"date":"27 March 2004","review":"'Brannigan' is a fairly routine thriller which doubles up as an advertising feature for American tourists wishing to visit London.  In both cases, it does the job pretty well.  What gives it a boost is the strong supporting cast headed by leading British 'luvvie', Richard \"Dickie\" Attenborough and the good use of London locations including Tower Bridge which is utilised in an above average car chase.  Also there is a large-scale brawl in a city pub ( in Leadenhall Market) which is a direct transfer from a saloon of one of the Duke's innumerable westerns.<br><br>Tough Chicago cop, Jim Brannigan, is sent to London to extradite notorious American gangster, Ben Larkin, but before he can collect him, Larkin is kidnapped and Brannigan spends the rest of his time chasing around London in search of his quarry. Whilst struggling to adapt to the British way of life and the restrained style of policing, he employs techniques not usually seen outside Chicago.  In the meantime, a contract has been put out on Brannigan's life by Larkin to prevent him from being extradited.<br><br>Though menouvring his way around London like a big vintage Cadillac, John Wayne lends his unique blend of charm and charisma and inevitably, he is given most of the best lines in what is a lively screenplay.  For instance, there is nothing he likes better than to smash down villains' front doors and bellow defiantly: \"Knock! Knock!\".  This is vintage John Wayne and there is no harm in this as he was very good at what he did and as a consequence he has a devoted following of movie fans around the world.<br><br>Richard Attenborough gives sterling support as the (on the surface)stuffy, upper-class Metroplitan Police Commander not afraid to get his hands dirty . Though with characters as different as chalk and cheese on and off the screen, there is clearly a good rapport between Wayne and Attenborough. There is continual conflict on screen about Brannigans retention and use of his handgun.  One of the best moments is when an increasingly hysterical Attenborough demands: \"I've asked you politely, now I'm asking you impolitely, HAND OVER THE GUN!\"<br><br>Of the rest of the cast, pretty Judy Geeson is good decoration though underused. Her main purpose appears to be to ferry Brannigan around London and to scream \"Look out, Jim!\" everytime the contract killer draws close. John Vernon as Larkin demonstrates why he was the 'heavy' of choice throughout the 1970's and Mel Ferrer is suitably slimy as his lawyer. James Booth, Brian Glover and Don Henderson are all good as London thugs.  Tony Robinson has a small comedic role as an innocent dupe of a dispatch rider thrown into the Thames by Brannigan long before he became Baldric in the long-running British tv series of Blackadder.  Look out too for an appearance by Tony Blair's father-in-law, Tony Booth, as a small time con given the 'good cop-bad cop' treatment.<br><br>Humorous, though a little bloody, 'Brannigan' is good entertainment and if you are a fan of the Duke, it is well worth adding the DVD to your collection.  My only gripe is that the movie was the inpsiration behind the god-awful 1980's tv seires, 'Dempsey and Makepeace'.  Forget this and you will enjoy it.","user":"chrisdl_heath","rank":[20,23]}]