[{"title":"Baraka \"lite\" (shorter, perhaps a good intro to this sort of film)","rating":7,"date":"20 August 2006","review":"In Greek mythology, Chronos is said to be the personification of time. Taking that into consideration, you might assume that this would be the longest of the films that Ron Fricke was involved with but actually the opposite is true. Chronos comes in at just under 45 minutes making it a short but sweet trip around some of the world's most beautiful man-made and geological structures.<br><br>For those looking for a longer trip as well as more to think about when the film is over, I highly recommend Powaqqatsi at 99 mins, Baraka at 96 mins, and Koyaanisqatsi at 87 mins - but you should probably skip Naqoyqatsi at 89 mins because its the weakest of the Qatsi trilogy. Whereas Naqoyqatsi's seizure inducing mechanical/digital messages drench the experience, Chronos is the exact opposite.<br><br>Chronos is sort of a Baraka \"lite\". This does not have the music of Philip Glass or the socio-political messages, but the beauty on display should make up for it. Additionally Fricke experiments with different exposures and filters (not seen in the other films) to create some striking effects. If you get the chance to see it, definitely take this one for a spin.<br><br>Fricke has a new film coming out soon (should be sometime this year) called Samsara which is a sequel to Baraka, and if that doesn't fill the gap you can check out Anima Mundi (by Reggio about animals), Microcosmos (about insects) and Atlantis (by Luc Besson) which is like a scuba dive.","user":"juubei-2","rank":[25,27]},{"title":"the most beautiful use of time-lapse photography","rating":19,"date":"19 April 1999","review":"This film is one of the most exquisite films I have ever seen.  It is comprised completely of time-lapse and aerial photography, and is a tremendous accomplishment.  Highly recommended for anyone interested in time-lapse photography, cinematography, or film making in general.","user":"cinematographer","rank":[31,35]},{"title":"Listen to the commentary...","rating":13,"date":"13 March 2006","review":"You have to listen to the commentary track on the special edition DVD to understand this movie. Many scenes were shot not only in time lapse but also with multiple exposures and multiple frame printing. Because of this we are able to view scenes which are not ordinarily recordable on film in places where artificial lighting is not permitted. This is as close as we will ever get to seeing these places without actually being there.<br><br>A supplementary featurette also explains the origins of the music and unique instruments which were used to record it.<br><br>Critics should bear in mind that this movie was shot in 1985 on a shoestring budget with a home made camera at a time when IMAX was in its infancy. As such it is a staggering achievement and a landmark movie in the history of cinematography.","user":"ntscuser","rank":[16,17]}]