[{"title":"Lincoln: \"From the log cabin to the White House\"","rating":7,"date":"7 September 2001","review":"ABRAHAM LINCOLN (United Artists, 1930), directed by movie pioneer D.W.\nGriffith, is an interesting antique, being Griffith's first of two\nventures in talking pictures.<br><br>This movie about an American president is more of Griffith's style, in spite that his technique in movie directing has become passé since the start of the roaring twenties. Handicapped by its slow pacing, Walter Huston gives a very fine performance in his title role, with Kay Hammond somewhat satisfactory\nas his wife and later first lady, Mary Todd Lincoln, along with Ian\nKeith adding fine support with his few scenes as John Wilkes Booth, a\ncrazed stage actor who puts an end to Lincoln's life on that tragic day\nof April 14, 1865. However, it is Una Merkel as Ann Rutledge, Lincoln's\ntrue love interest in the early portion of the story, whose performance\nweakens the film. This capable actress might have made a go with her\nrole if it weren't for some bad dialog she recites, such as responding\nto Lincoln following his proposal to her, \"Yes, Abe. You've got your\ngingerbread.\" Then there are Griffith screen veterans of the silent\nera, Henry B. Walthall as Colonel Marshall; Hobart Bosworth as General\nRobert E. Lee; and the great character actress, Lucille LaVerne, the\nspiteful old hag in ORPHANS OF THE STORM (1921) appearing in an opening\nscene as Mrs. Lincoln's midwife. Her raspy voice fits her personality\nto a \"T\".<br><br>With the screenplay by Stephen Vincent Benet, this epic biography with\nepisodic events opens with the birth of a great man, Abraham Lincoln,\non February 12, 1809. Moments later viewers find the infant now \"the\nugliest and smartest man in New Salem\" clerking at Denton Offut's\ngeneral store, his romance with young Ann Rutledge who later dies, and\nfunctioning as a young lawyer. After he meets Mary Todd at a society\nball, the scene shifts to Lincoln as a bridegroom having second\nthoughts about attending his own wedding. He eventually marries her.\nMove forward to the 1860 Lincoln-Douglas (E. Alyn Warren) debate,\nwhich, as seen on screen, is not much of a debate but just two\nparticipants delivering a few words of dialog each. Lincoln wins the\npresidency and is soon faced with his long battle with the Civil War\nand placing Colonel Ulysses S. Grant (Fred Warren) in charge to put an\nend to it. After the end of the war, 1865, Lincoln wins his second term\nelection, but doesn't live to fulfill it.<br><br>Originally released in theaters at 97 minutes, ABRAHAM LINCOLN in\nrecent years has become a public domain title distributed by various\nvideo companies, most presenting bad copies with shorter lengths, many\ncut down to about 84 minutes, some eliminating scenes with Lincoln\nheading over towards the cemetery during a thunder storm crying over\nAnn's grave; another involving Lincoln tender moments with his youngest\nson, Tad (Gordon Thorpe). After coming across these inferior copies in\nvideo stores, I've managed to locate an excellent and more accurate\nvideo copy in 1986, compliments of Blackhawk Video. Not only was the\nvideo print clear in both visuals and sound, it included restored\nevents eliminated from reissue copies, the ones that had played on Arts\nand Entertainment channel, Turner Classic Movies (where it made its\ndebut March 8, 2007) and many public television stations during the\nlate night hours. Reissue prints begin with a view of a log cabin and\nsound track of whistling winds superimposed with the title of February\n12, 1809. In the nearly restored 93 minute video copy, it begins with a\nfive minute prologue done in the silent film tradition showing slaves\nbeing shipped to the United States followed by other historic events\nand conversations amongst various politicians (one of them played by\nHenry Kolker), before shifting towards the event of Lincoln's birth in\na log cabin. There are other silent sequences interacted into the story\nlater on, as well as some off screen singing in the sound\ntrack not shown in the edited versions.<br><br>It's been said that ABRAHAM LINCOLN was a financial and critical\nsuccess upon release. By today's standards, it hasn't stood the test of\ntime. Future retelling on Lincoln's life, YOUNG MR. LINCOLN (1939) with\nHenry Fonda, and ABE LINCOLN IN ILLINOIS (1940), with Raymond Massey,\nare both excellent in their own way and continue to hold interest.\nHowever, Griffith's adaptation is the only one of the three mentioned\nto focus on the Civil War. Regardless of its handicaps, Griffith's\nfirst talkie on the life of Lincoln has some interesting moments, but\notherwise it's a rather dull affair. Worth viewing for history buffs,\nbut aside from Lincoln's frequent remark, \"The union must be\npreserved,\" don't expect an accurate history lesson out of this.\n(**1/2)","user":"lugonian","rank":[31,37]},{"title":"D.W. Griffith's last hurrah: a tribute to Abraham Lincoln","rating":8,"date":"9 October 1998","review":"This film was to be D.W. Griffith's big comeback production, and it did very well for \"the old master.\" In fact, it was chosen as number two of the Ten Best Pictures of 1930 by The Film Daily, just below \"All Quiet On The Western Front!\" Sadly, due to the horrible condition of the available prints of this film, no really fair analysis can be made today. As with so many early talkies, Abraham Lincoln is now a sickly shadow of what it was in 1930. To begin with, it's original running time is listed at approximately 96 minutes. The version presented on Laserdisc runs 83 minutes.The film shows signs of wear and duping. The soundtrack is horribly distorted and, in several scenes, seems to be missing totally, replaced by terrible music from a stock library. Even so, if one can look past these things and take the acting style in the context of its time, one can see that Griffith had not lost his flair and would have probably continued directing had the fates (and probably Hollywood) not conspired against him. There are wonderful cinematic moments, reminiscent of some of his earlier triumphs. This is a film that cries out for restoration but, alas, there is most likely little or nothing left to restore. UPDATE: In 2008, KINO International released a DVD version of Abraham Lincoln that is far more complete than the old Laserdisc I reviewed from in 1998. While some soundtrack from the Prologue is still missing, KINO has made up for it by adding subtitles for the missing dialogue. Also, the picture quality is far superior to anything else available. It is evident that much effort went into making this forgotten film much more watchable and available!","user":"Rambler","rank":[21,26]},{"title":"Griffith showed a new maturity for sound","rating":10,"date":"10 July 2004","review":"This being a presidential election year made me curious about this early talkie. I had seen it before but it's been a while and so I wanted to actually go through a diagnosis of the movie itself. So I dragged out an old A&amp;E VHS made copy. Griffith had tackled the Booth assassination of Lincoln before in the silent Birth of A Nation. Here he did it in sound and Ian Keith is great as John Wilkes Booth: \"S-I-C T-E-M-P-E-R T-Y-R-A-N-N-I-S... As he yells after he shoots Lincoln at Ford's theatre and jumps onto the stage. And Walter Huston is much more Lincolnesque than Henry Fonda would be ten years later. Also the scene where Lincoln &amp; U.S. Grant are conversating over cigars was kind of priceless. Una Merkel is compelling in an early film performance as Lincoln's first wife Ann Rutledge.<br><br>This was Griffith's first sound film and he shows a somewhat uneasiness with the new medium but what director didn't in 1930. Griffith faired better than most. If you can look past the oldness of the film you'll see that this is pretty much a straight forward &amp; accurate &amp; well made(by 1930 standards) telling of the events of Lincoln's life. The sort of way Masterpiece Theatre would later tell stories episodically over many hours decades later. Griffith shows an aptitude for shooting that had already happened in  the late silents of Hollywood. He makes quality use of the moving camera. Roving in and out of some scenes. The shot where the soldiers are fighting in trenches during the Civil War are similar to the same kind of shot Lewis Milestone did in All's Quiet On the Western Front which also came out in 1930. But even both of these films hark back to Griffith's own scene in Birth of A Nation where the South is battling the North and the Colonel jumps out of the trench to stoke a cannon. <br><br>This was not Griffith's first experiment with sound. He had shot some experimental dialogue scenes for his 1921 feature Dream Street. A short 1921 intro to Dream Street with Griffith talking up the film still exists as well as a 1930 sitdown interview with Huston promo-ing Abraham Lincoln. But Abraham Lincoln showed a 'newer' Griffith. Moving away from the static camera of which he was famous and adopting a more fluid style which was recently introduced by some German directors. Griffith even this late still liked old fashioned 19th century melodrama stories. Lincoln's life story is certainly a subject he could sink his teeth into. He had done bits and parts of Lincoln's life before particularly the Ford's Theatre scene in BoAN. Abraham Lincoln is Not necessarily a great film nor the best of 1930 but a very interesting foray into sound by a great film pioneer and like mentioned before a lot of the Lincoln life is covered quite surprisingly well.","user":"zpzjones","rank":[18,23]}]