[{"title":"An unfairly maligned Frankenstein flick from Hammer.","rating":8,"date":"9 June 2008","review":"By the 1970s, Hammer was struggling to find an audience still willing to cough up to see lavish Gothic productions; as a result, their output became increasingly targeted at the more profitable youth market. Having been exposed to more explicit teen horror films from the US, this particular demographic demanded that the studio adapt its format to suit. Graphic gore and nudity now had precedence over fog-shrouded graveyards and creepy castles.<br><br>In accordance with this new approach, The Horror of Frankenstein presents its viewers with a decidedly different take on Mary Shelley's classic: it's a sexier, nastier, gorier, and generally far more exploitative effort than any previous film in the series, and one which benefits greatly from a deliciously twisted script loaded with gallows humour.<br><br>This shake-up also called for a new leading man: out went Peter Cushing's well respected, but severely obsessive scientist, and in came Ralph Bates' more loathsome incarnation of Victor Frankensteina younger, mean-spirited, murderous, and cold-blooded individual. Bate's performance is practically perfect, convincingly portraying the utter contempt that his character feels for all mankindeven his closest friends and admirers.<br><br>Also rather memorable, albeit for completely different reasons, are the obligatory hammer babes: Kate O'Mara as Alys, the slutty housemaid who sees to the Baron's every needs (if you know what I mean), and Veronica Carlson as Elizabeth Heiss, the prettiest girl in the village and Victor's secret admirer. Both girls are absolutely stunning and possess quite impressive 'talents' (which, particularly in O'Mara's case, regularly threaten to spill completely out over the top of their costumes!).<br><br>Many Hammer aficionados seem to have a problem with The Horror of Frankenstein, unable to appreciate its wicked sense of humour. I however, think that it is an extremely fun flick, and a refreshing change to the usual Hammer style. The only gripe I do have with the film is that the monster itself (played by Dave 'Darth Vader' Prowse) is rather weak in its conception: with a little more time and effort spent on the creature make-up FX (the stitching looks like it was drawn on with marker pens), he wouldn't have been quite so laughable.<br><br>7.5 out of 10, rounded up to 8 for IMDb.","user":"BA_Harrison","rank":[19,22]},{"title":"First two thirds is surprisingly entertaining. After that...","rating":13,"date":"13 January 2004","review":"I'd heard nothing but bad things about 'Horror Of Frankenstein', but after watching it I was surprised at how entertaining it was (for the most part). The first two thirds are pretty damn good in my opinion. It's basically a remake of the first Hammer Frankenstein movie but with added humour, which in places reminded me of Stuart Gordon's 80s classic 'Re-Animator'. Ralph Bates, who was in a few Hammer movies during this period (like 'Lust For A Vampire', the disappointing sequel to 'The Vampire Lovers'), plays an intense young Frankenstein who isn't that far removed from Jeffrey Combs' Herbert West. Bates gives a strong performance and the supporting cast includes lovelies Kate O'Mara (the French governess in 'The Vampire Lovers') and Veronica Carlson, which certainly helps a lot, as well as Jon Finch ('Frenzy') and a great comic turn from Dennis Price ('Theatre Of Blood', 'Vampyros Lesbos') as an eccentric grave robber. So far so good, but unfortunately when we finally see Frankenstein's monster (played by David \"Darth Vader\" Prowse) it's very anticlimactic. Prowse's monster is the worst I've ever seen in any Frankenstein movie and things fall apart very quickly from then on. Oh well. Anyway, while this movie ultimately disappoints I think Bates and Price make it worth watching all the same, and O'Mara is extremely sexy as a saucy servant girl. But it must be said that 'The Horror Of Frankenstein' ties with 'Lust For A Vampire' and 'Dracula A.D. 1972' as the weakest Hammer movie I've seen to date.","user":"Infofreak","rank":[11,12]},{"title":"one person's junk is another person's treasure","rating":6,"date":"4 November 2003","review":"To clarify, it's really no treasure, but, neither do I agree with the consensus.  As of this writing, other comments are overwhelmingly negative. But I don't think that this flick is all that bad.  Sure - it's a temptation to compare it to other Hammer films and Frankenstein movies in general. But, because Peter Cushing and Boris Karloff aren't in it, THAT shouldn't be held against Horror of Frankenstein.  (They weren't in Citizen Kane, either, but THAT'S a pretty good pic.)  I'm guilty of too much comparing, myself, but, for some reason, I did not do it here.  Maybe that's why I rated it \"respectable\".  I'm satisfied with most aspects of this production, although, admittedly, the outset is a bit dialogue-heavy and action-starved. It takes a long, mundane time, but, through it all, we meet (among others), sociopathic med student, Victor Frankenstein; his straight-as-an-arrow classmate, Wilhelm; destitute-destined neighbor, Elizabeth; the buxom housekeeper (but lousy cook), Alys; the one-step-behind police lieutenant, Henry Becker; the good-at-what-he-does body and parts supplier and his widow; and, of course, the towering, impetuous monster.  It has an easy-to-follow story, with enough Hammer cleavage... urrr, diversions... to make it interesting.  This attempt is okay, in my book.","user":"KDWms","rank":[17,20]}]