[{"title":"Sexual decadence before the time of the guillotine","rating":9,"date":"5 August 2001","review":"I liked this better than Dangerous Liaisons which came out at about the same time. Of course Dangerous Liaisons was very good, and John Malkovich, who played Vicomte de Valmont, is an actor of power, and Glenn Close, who played the Marquise de Merteuil, is highly accomplished, but I preferred the charm of Colin Firth in this film to the brutality of Malkovich, and I thought Annette Bening was just delightful. She played Merteuil with exquisite timing and an ironic witchery and warmth that I shall not soon forget. I preferred her playful, sly wit to Close's cool cynicism.<br><br>The story comes from a novel by Choderlos de Laclos set in 18th century France that was made into a stage play by Christopher Hampton. It is a cynical satire on human sexuality as well as a very subtle examination of sexual hypocrisy and desire, a kind of oh so sophisticated laugh at bourgeois morality that would have delighted Voltaire and Moliere and greatly amused Shakespeare. It is a tale of elaborate lechery and revenge that backfires because it seems that anybody, even the most jagged rake can fall in love, and thereby become the victim. The central assumption here is the same as that of the Cavalier poets, namely that marriage kills love. As Merteuil says, \"You don't marry your lover.\"<br><br>Meg Tilly played Madame de Tourvel with subtlety and a riveting passion. One of the great sequences in the movie occurs after she has fallen madly in love with Valmont against her will. She stands outside his doorway in the rain for hours looking adoringly and forlornly up at his window. And then she is allowed to enter and receive a cool reception. Valmont says, \"Do you want me to lie to you?\" and she replies desperately, \"Yes,\" and then it is her passion that overwhelms him, leading to a beautifully ironic twist. Shortly afterward he sees Merteuil, who has become more like a sister than an ex-lover, and says, \"I feel awful.\" She replies, \"Are you surprised? (Pause) You are an awful man.\" Hanging his head he continues, \"Do you think a man can change?\" \"Yes. (Pause) For the worse.\"<br><br>This theme, that it is the beloved who has the power and that once you fall in love you lose all power, is repeated several times in the movie. Valmont pursues women, the harder to get the better, with a relentless and maniacal passion, but once he has them, he immediately loses interest. His making love absentmindedly to Cecile de Volanges (played with wide-eyed innocence and girlish charm by Fairuza Balk) was an incredible irony when we consider what she would cost Gercourt, played with his rather substantial nose in the air by Jeffrey Jones, whom you may recall as the pratfalling principal in Ferris Bueller's Day Off (1986).<br><br>There is some insidious philosophy here, some sardonic observations on human nature worth mentioning. One is that the man beloved of women gets most of the reproductive tries, and regardless of his rakishness, is still beloved. Another is that duplicity is the accepted, even required, standard of behavior in society, and that when it comes to sex, one must, perforce, always lie. <br><br>Milos Forman's direction was invisible and therefore a work of art. The incidental scenes and backdrops depicting the color, squalor and decadence of pre-revolutionary France added just the right amount of atmosphere. The costumes were stunning and much cleaner than they would have been in reality. The elegance and beauty of all the titled people merrily contrasted with the crude ugliness of the common people, rightly reflecting the effete snobbery of the aristocracy before the time of the guillotine.<br><br>(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)","user":"DeeNine-2","rank":[84,91]},{"title":"Annette Bening is fantastic","rating":22,"date":"22 September 2004","review":"Annette Bening has proved again what a versatile actress she is. She positively emanates cruelty and perverseness in this film, but she is the epitome of sweetness in \"American President\" and fragility in \"American Beauty.\" The pleasure her character takes in causing others' pain makes one easily imagine her reincarnated as a Gestapo torturer. Colin Firth is, as usual, handsome, charming, and believable. Fairuza Balk completely captures the confusion, excitement, and naiveté one would expect of a girl reentering the world after years in a convent. Meg Tilly shows a depth that I hadn't expected and Fabia Drake is wonderful as the hard-of-hearing, elderly, but wise, matron. The costumes and sets were exquisite and evoked the period completely. I highly recommend this for the performances and the ambiance.","user":"MinneapolisJane","rank":[35,41]},{"title":"better of the two by far","rating":8,"date":"4 October 2000","review":"I notice a bit of a war going on between partisans of this and \"Dangerous Liaisons\" (the Glenn Close/John Malkovich/Stephen Frears vehicle).  I'm not entirely sure why, but I find \"Valmont\" so much better.  I think it's because: A) Milos Forman is unquestionably a better director than Frears, especially when he can call on the photographic talents of a cinematographer like Miroslav Ondricek; B) \"Valmont\" takes the time to develop some of the relationships between characters on screen, while the other simply injects the viewers into preexisting relationships; C) Colin Firth and Annette Benning are quite simply sexier than Glenn Close and John Malkovich; \"Dangerous Liaisons\" is too intellectual, while \"Valmont\" works at the hormonal level too. D) Fairuza Balk is far more believable as a virgin than Uma Thurman (can anyone say differently?!?). I certainly acknowledge \"Dangerous Liaisons\" as a well-made, well-acted film, but in the end I find it nearly unwatchable compared to \"Valmont\", which I can (and have) enjoyed over and over.","user":"Andy Sandfoss","rank":[92,120]}]