[{"title":"Christie, Schlesinger and a milestone.","rating":10,"date":"6 July 2007","review":"\"Darling\", as it happens with most genuine works of art, it grows, it develops over the years and acquires a sort of clarity that, with the benefit of hindsight I will dare to call it, prophetic, as a social observation of its time. But what matters most is the film as a film. Brilliantly thought, written, directed, photographed and, of course, acted. Julie Christie became a symbol. She, clearly a very intelligent woman, surfed the waves of fame with an apparent detachment that I'm sure it's a sure sign of maturity and of a great respect for her profession and herself. If you think I love Julie Christie, you're right. But my love for her has to do with \"Darling\" and the age I was when I first saw it. The 60's were already in the past then but I saw them in the future, an immediate future.I can't imagine anyone, from any age, who loves film could be indifferent to this tale of isolation in a world moving fast towards an acceptable cult for celebrity. Not to be missed.","user":"littlemartinarocena","rank":[86,92]},{"title":"London in the '60s in all its glory","rating":9,"date":"16 February 2009","review":"Julie Christie is \"Darling\" in this 1965 film directed by John Schlesinger, and also starring Dirk Bogarde and Laurence Harvey. Schlesinger does a beautiful job of showing us '60s London as it was, and yet he managed to make a film that is just as timely now.<br><br>Julie Christie is model Diana Scott, a gorgeous, ambitious young woman who moves from man to man without attachment and with the intention of helping her career. She dumps her first husband and breaks up the marriage of a British journalist (Bogarde) and then moves on to a pleasure-seeking advertising executive (Harvey), and finally, marries an Italian prince. It's one of those lives that sounds great - she has beauty, money, men, glamour, travels in the circles of the beautiful people. But she has no emotional attachments, no love, and nothing that she has feels right or is anything she wants. All the external trappings of celebrity, but it's a shell.<br><br>A really terrific movie, and I have to agree with the posters whose comments I read that Julie Christie is perfection in every way. Bogarde and Harvey give her excellent support. As an aside, Christie's wardrobe is stunning.<br><br>None of the characters are very likable, except perhaps Bogarde, who in spite of leaving his wife and family does truly love Diana.<br><br>Despite the cold realities of Darling, we're even more obsessed with celebrity today, which makes the film even more interesting. But when you look at a photo, see someone in a magazine or on the screen, you're only dealing with a persona, not the flesh and blood individual. It's a fantasy. Darling shows the audience what's behind the fantasy - and it's not very pretty.","user":"blanche-2","rank":[33,34]},{"title":"Darling revisited","rating":10,"date":"8 July 2007","review":"To see this 60's landmark film is quite something. In many ways could be considered a period piece and at the same time it could have been conceived yesterday. Julie Christie's performance is the insurance \"Darling\" has to ensure its powerful sailing through the years into the forever ever. She is extraordinary! Schlesinger lets himself be guided by something other than his British restrain and fear of sentimentality here. He is tough and poetic telling us the story of Diana Scott (could had been Lady Diana Spencer to a T) with understanding and compassion but without trying to make her a sympathetic character. Julie Christie takes care of that in what, time will tell, in fact is already telling us, one of the best performances on film, ever.","user":"axlgarland","rank":[81,89]}]