[{"title":"Not just a Film, an Experience!!!","rating":10,"date":"24 April 2005","review":"How can the average person describe the Holy Mountain? They can't, It's one of those films that is so bizarre that one has to witness it at least 5 times to fully appreciate it. Alejandro Jodorowsky takes every form of religion and mysticism and puts it into symbolic imagery, that turns into a two hour mind trip. The film is not thrown together, each scene is so chock full of strange imagery, yet each image has a particular meaning. The plot concerns, the thief, who seems to be representational of Christ in modern times. The thief awakens in the desert, almost crucified by children, he is then rescued by an amputee dwarf. After him and the dwarf share a joint, they travel through different scene after scene of surreal images. In one scenario a police state has taken over downtown Mexico. Innocent people are massacred, and birds fly out of their bullet wounds. The conquest of Mexico is reenacted by frogs and iguanas. The Christ character gets drunk with Roman soldiers, and they make a mold of him to produce statues for profit. And this is all in the first twenty minutes. The occult science of alchemy is another factor of the film. The thief finally meets the alchemist, played by Jodorowsky himself, and the alchemist turns his excrement into gold. The black magic of alchemy involves the nine planets of the solar system. We are then introduced to 7 of the most powerful people in the world named after the planets of the solar system. Each person is corrupt and greedy involved in politics, war or mass marketing. Each person who has their own planet, and a weakness is willing to give up their money and be reborn as a Buddhist monk. In a way these people are alchemists also since they have the ability to turn worthless items such as weapons and cosmetics into riches. Since money is just paper, in a way the magic of alchemy in everyday life convinces us that the dollar bill is of value. Many aspects of life are just an illusion, just as in cinema. In the Holy Mountain Jodorowsky proves to be the master of illusion like a magician. Also his character, the Alchemist has the job of spiritual leader to lead all of the 9 people to the Holy Mountain including the Christ character and the women with the Kaballah tattoos. Also the film is indulgent at times in it's Frued like sexuality and nudity. It is both strange and intriguing, both hilarious and horrifying, and one of the weirdest films your most likely to see. Their is so much that happens in this film, that it's almost impossible to describe. People who are looking for deep meaning in films like Donnie Darko need to keep searching, the films of Alejandro Jodorowsky would be a good start. The Holy Mountain is not only a masterpiece, it's a spiritual journey, and it just might very well change the way you look at the world. Not everyone will like it, so sit back and watch with an open mind. The Holy Mountain is one of the most underrated and important films ever made. 10/10","user":"NateManD","rank":[228,276]},{"title":"Come prepared to chuckle","rating":18,"date":"18 June 2003","review":"If you liked \"The Wall\" (you know, the Pink Floyd movie), but thought it was a bit of a downer and suffered from the lack of a fat woman humping an excitable, legless, animatronic horse, this movie could be for you.<br><br>Despite what you may have heard, \"The Holy Mountain\" is more absurd than surreal, more funny than disturbing. Don't worry if your tarot cards are gathering dust and you can't remember the difference between wands and swords--such occult knowledge might help you achieve a few \"Oh I get that!\" moments during the middle of the film, but the heaps of blatant symbolism aren't really the point. In fact, it may just be that the point is: there is no point. When you see a fat man dressed as the Virgin Mary handing out crucifixes under a sign that says \"Christs For Sale\", you can rack your brain trying to figure out what kind of statement that makes about society--or you can laugh. When you witness \"The Government\" indoctrinating children with a hatred for the nation of Peru by printing up comic books called \"Captain Captain Against The Peruvian Monster\", you can lament the plight of innocents being manipulated for selfish ends--or you can laugh! This film bombards the viewer with outlandish images and juxtapositions like these in rapid fire throughout, so it's easy to get bogged down or confused or numb. The secret to appreciating it all is to come prepared to chuckle--some things you'll \"get\", some things you won't, but most everything is twisted and absurd and, in some way, funny. Now when you get to the end and Jodorowsky winks at you, you can wink right back.<br><br>Basically, if you can appreciate absurdity and profundity and the absurdity of profundity (not to mention enormous, colorful sets), you'll find a lot to like here.<br><br>PS: If you do like \"The Holy Mountain\", head down to your local comics shop (or browse over to your favorite book/graphic novel e-tailer) and pick up a couple of volumes of \"The Incal\" or \"The Metabarons\", both of which were also written by Jodorowsky. They're like this movie--every bit as garish and violent and thought-provoking and funny--but they have actual plots (epic space-opera plots, no less).","user":"abronaim","rank":[135,178]},{"title":"Dated, pretentious, astonishing","rating":28,"date":"28 June 2004","review":"I don't think this film can be \"reviewed\" in the normal sense of the word, only experienced as one would a painting or a piece of music. Having only seen it two nights ago, I'm not even sure I've fully processed it. In any case...<br><br>To begin, the images, the images. The first 20 minutes contain some of the most astonishing images I've seen, combining Christian iconography, Latin American history, futurism, mysticism, and political commentary. As if Fellini had a sinister twin working with his leftover film and props. As the film progresses I thought the set pieces became a little dated and, frankly, I experienced sensory overload. <br><br>I'm sure a lot of viewers would reject this film as pointless or indulgent. Yeah...so? I can't say I understood exactly what Jodoworsky was getting at (if anything), or if it would even make an impact on my view of the world. But if film is to be defined as image over everything else, then Jodoworsky is certainly some sort of master filmmaker. I'd rather watch something like this, filled with ideas (however pretentious), than a plot-driven movie with nothing more on its mind than wrapping up loose ends for the audience. <br><br>Now, off to rent Santa Sangre.","user":"jhb4731","rank":[132,184]}]