[{"title":"The Poitier/Curtis Jail-Break Classic","rating":2,"date":"2 October 2004","review":"Sidney Poitier continues to break race barriers with this formula jail-break drama. Teamed with Tony Curtis, the escaped prisoners encounter many situations, where their difference in color seems to matter more than the fact that both are fugitives from the law. Throughout the film, the viewer empathizes with the escapees, figuring that they always got a bum deal in life. A scene towards the end, where a single mother sees a chance to \"hook up\" with Curtis, shows how Curtis, although often disagreeing, even physically fighting with Poitier, still sees Poitier as an equal in their quest for freedom. Rather than \"sell out\" his friend, he would rather die trying to save him. The inevidable ending (remember that one of the rules in Old Hollywood was that the bad guys can never win)is quite moving.<br><br>Definitely among the established Hollywood Classics. Although many of the \"old ways\" have changed drastically since the late 50s, this film offers insight into a piece of Americana many people living today can still recall. An important piece of Film History, and highly recommended.","user":"mdm-11","rank":[46,51]},{"title":"Covers A Lot Of Ground","rating":8,"date":"9 October 2006","review":"This Stanley Kramer classic covers a lot of ground -- literally and figuratively. Tony Curtis and Sidney Poitier are white and black inmates who, while chained together at the wrist, escape their captors when their prison truck hits the ditch. Now Curtis is forced to put aside his prejudice and work with his new partner in getting the cuffs off and ensuring their newfound freedom lasts.<br><br>As its reputation suggests, THE DEFIANT ONES is first and foremost a study of racism. It has a deliberate unpleasantness about it as it brings to life the unsavory attitudes of the past. A young boy who stumbles across the convicts races to the arms of Curtis for fear Poitier will hurt him. A lonely farm wife who takes the men in has to be told that yes, Poitier deserves a meal, too. And as the men face hanging at the hands of some rednecks, Curtis appeals to them on the grounds a white man can't be lynched. Yet the film carries no tired, moralistic messages, instead allowing the racism on display to speak for itself.<br><br>THE DEFIANT ONES goes well beyond its central theme. It's an exciting adventure, along the lines of THE FUGITIVE, as our anti-heroes elude their captors and try to survive in the unforgiving wilderness. It's a story of raw human emotions at work and of overcoming adversity by putting our trust in others. And it's a story of loyalty and the capacity of the human heart to change. We come away with the sense that the people involved with this picture knew they were part of something truly special.<br><br>Though he was given second billing, Poitier easily steals the show with his dignified performance. He brilliantly conveys the tortured, yet still upbeat soul of a young black man who came of age in a time of unimaginable difficulty. He often doesn't have to speak to let us know the pain he has and will continue to endure. Poitier proves that critics aren't just being kind when they cite him as one of the great black actors of his or any other era (though as we see here, he is definitely no singer!).<br><br>THE DEFIANT ONES moves just a touch slow at times, particularly when the focus is placed on Curtis. But this is a movie as important as it is worth watching.","user":"ReelCheese","rank":[36,40]},{"title":"Cellmates and Soulmates","rating":8,"date":"8 August 2007","review":"There is this story going around that Robert Mitchum refused the part Tony Curtis eventually played because he did not want to work with a black man. The actual story is that Mitchum who did spend time on a southern chain gang said there was no way that back in the day a black and white man would have been chained together in the first place. In fact Stanley Kramer must have taken the critique in stride because sheriff Theodore Bikel has a line of explanation saying the warden had a sense of humor.<br><br>Though the film dates a bit, it's still quite dramatic even now. Tony Curtis and Sidney Poitier chained together have an unplanned jail break while being transported. Curtis has all the attitudes typical of his time and Poitier doesn't take nothing off anybody. Still joined at the hip as they are, they do need each other and find eventually there's more that unites than divides them.<br><br>Besides Theodore Bikel in a strange role for him as a laconic southern sheriff, look for good performances from Lon Chaney, Jr. who runs a turpentine work camp who saves Curtis and Poitier from a lynching and Cara Williams as a trampy white trash farm lady whose needs haven't been met for a while.<br><br>Tony Curtis in an incredible act of generosity insisted on equal billing for Sidney Poitier since due to the nature of the film, they are on screen together for most of it. That act of generosity may have cost him an Oscar for both he and Poitier were nominated for Best Actor, but lost to David Niven for Separate Tables. An act that rankles Tony Curtis to this day because at the drop of a hat he will insist Niven got 'his' Oscar.<br><br>Despite the sour grapes, The Defiant Ones though dated is still a good bit of cinema.","user":"bkoganbing","rank":[26,29]}]