[{"title":"One of the most achingly beautiful movies ever","rating":10,"date":"3 December 2002","review":"Somewhere in Time is a movie any sensitive person with a heart will love, I guarantee you. From the opening at the theater to the unbelievably moving final scene, I have never seen a film so passionately and yet so innocently depict the power of absolute, all-encompassing, unconditional love.<br><br>The story is so simple, yet therein lies the beauty. Richard Collier, a man with no love in what otherwise seems like a nice enough life, becomes enchanted at the sight of Elise McKenna's painting and with only the power of his heart travels back to her time. Once there, he looks for Elise, and finds her. Elise is confused and does not immediately respond because of her manager W.F. Robinson, but she quickly returns Richard's love. I will not say anymore, other than that the ending made me feel so warm and yet made me want to cry. You will be hard pressed to find a movie lighter on plot, and there are many questions left unanswered, but that's perfect because Somewhere in Time is very surreal, and dreamlike even. The emphasis is not on watching events, but on simply feeling love, and this is as close as anyone has ever come to making a movie out of pure emotion.<br><br>Jane Seymour looks radiant while on screen but this is Christopher Reeve's movie. Reeve, after amazing everyone with his talent, good looks, and charisma in one of the biggest blockbusters ever, could have become one of Hollywood's all-time great leading men. Instead, a series of horrible decisions about what roles to take and not take made it so that he had to do TV movies to pay the bills by the late 1980s. To this day, to 99% of the public he is the paralyzed Superman and nothing more. But this is the one movie that shows what should have been. He very convincingly depicts Richard first as goofy kid, then as empty older man, then as someone simply awestruck by love and determined to let nothing stop him from getting the breathtaking Elise. Then, in the final scenes, he portrays his anguish so remarkably it is wrenching to watch. <br><br>Also deserving of special mention is Christopher Plummer, who seems to be an extraordinary actor on the basis of the two films I've seen him in (the other is The Insider). A lesser actor would have made Robinson into a mustache-twirling villain, and brought the whole production down to the level of a soap opera. Plummer, however, with his nuanced performance, makes us hate Robinson, but also makes us his feel his pain. Through his subtle mannerisms, we see that Robinson himself deeply longs for Elise's love, but has probably never been loved and never will be loved by anybody. We thus realize how incredibly lucky Richard is. I personally saw Robinson as perhaps someone whose father never loved him and whose mother died when he was very young, and he has spent his whole life wanting to truly take care of someone like Elise but it is as if he has been rendered incapable. He is still contemptible for the things he does to Richard, but he is also a tragic figure, and the script has nothing to do with that-it's all Christopher Plummer.<br><br>John Barry's score is also among the most enchanting in movie history, in my opinion. I have never heard a score which so wonderfully conjured up feelings of timeless love. Jeannot Szwarc may not be a well known or otherwise accomplished director, but he does this one perfectly. This movie in the wrong hands could so easily come across as corny and trite, but instead it is such an absorbing masterpiece. Every element in this movie is just perfect, and it should be universally considered one of the greatest love stories of all time (if not the greatest, like I think it is).<br><br>As it is most people have never heard of it, but it is nice to know that a small devoted following gives it the recognition it deserves. I hope it continues to win people's hearts for generations to come.","user":"kanerazor","rank":[124,129]},{"title":"Touching Time-Travel Tale","rating":10,"date":"26 November 2005","review":"Being one who always seems to enjoy time-travel stories, it's no wonder I like this movie so much, but it isn't the interesting \"time\" angle that draws me in: it's also the fact that this is one of the most touching love stories I've ever seen. I'm not usually a big fan of romance stories, but this one has always moved me, maybe because, as another reviewer points out, it's from the man's point of view.<br><br>The film is a wonderful old-fashioned type of story with a really nice feel for the period (1912) and is simply a pleasant, leisurely-paced story I found comfortable. Would kids of today like this? No. Too slow for them. Too bad, because I found the movie moved pretty well. The 100 minutes went by quickly.<br><br>Christopher Reeve is the star of the film but personally I found Jane Seymour and Christopher Plummer far more entertaining. The theme song, \"Somewhere In Time,\" is one of the prettiest songs ever and that adds to the sad and frustrating romance angle of the story. The language also is quite tame. Yes, it's a bit \"sappy\" at times, but for sentimental people, this is a nice film to keep.<br><br>My only real complaint is I've never seen a sharp transfer put on a DVD yet. There have been two DVDs out and both have that grainy look to them. That's disappointing because this would really look nice with a clear picture. The film deserves better treatment.<br><br>NOTE: A Blu-Ray of this film was released in March of 2014 and finally does this great film justice!","user":"ccthemovieman-1","rank":[108,115]},{"title":"A Classic!!","rating":10,"date":"13 October 2005","review":"In 1984, this movie got a second life on cable after its initial release to theaters and subsequent bombing at the box office in 1980. We should all be thankful for cable! This is a classic film in every respect...well directed and acted.... but would it have had the same impact without John Berry's absolutely beautiful score? At any rate, it is a classic film and enjoys an enormous cult following as well as an annual gathering at the Hotel where many of the actors have come to participate. \"God bless you Chris Reeves, rest in peace\"","user":"dalancofer","rank":[51,53]}]