[{"title":"A Refreshing Take On The Hansel & Gretel Story","rating":29,"date":"29 December 2002","review":"Who Slew Auntie Roo is still one of the most cleverly constructed films of the 70s.<br><br>An interesting and fascinating take on the Hansel and Gretel story.<br><br>\nMrs. Forrest (Shelley Winters) is a rich widow who had been married to a successful British Magician. He died leaving her his fortune and creepy mansion called \"Forrest Grange\" Their little 7 year old daughter Katherine died after falling off a banister that she was sliding down.<br><br>The film opens with Auntie Roo as she is called by the orphans singing a lullabye to what appears to be a child in a cradle. Auntie Roo quietly steals out after we think the child is asleep. The camera slowly pans to the cradle only to reveal a rotted corpse of a child in a nightgown. This sets the scenario for the film.<br><br>Auntie Roo is obviously an eccentric. She has constant seances in an attempt to communicate with her dead daughter. Of course her psychic is in cahoots with the servants who stage the seances.<br><br>It is now time for Aunt Roo's annual Christmas Party where 10 lucky children from the local orphanage are selected to attend an overnight holiday party at Forrest Grange. Christopher and Katy Coombs, a brother and sister are not selected, but stow away in the back of the car. Auntie Roo sees a resemblance in Katy to her dead daughter Katherine...and of course the movie takes off from here. The children see Auntie Roo as the witch in Hansel and Gretel...and Forrest Grange is the Gingerbread House. I won't give away any more of the plot, but the psychological games between the children and Auntie Roo as their terror mounts makes for an extremely entertaining film.<br><br>Aside from Shelley Winter's bravura performance, there are also strong contributions from Sir Ralph Richardson as her psychic; Rosemary Crutchley as the director of the orphanage, Mark Lester (of Oliver fame) as Christopher. The art and set direction are marvelous along with excellent camera work and lighting.<br><br>This film makes for a different and offbeat Christmas movie or just a plain \"fun\" movie to watch anytime!","user":"mozmike","rank":[28,29]},{"title":"A Cult Classic","rating":10,"date":"22 August 1999","review":"A great horror movie to watch at Christmas time.  It has a creepy old mansion, great child actors.  The plot centers around the disappearance of a child years before and some orphans who just happen to end up at the same mansion years later.  Shelley Winters is great in this movie.  It's really got a classic old british feel to this movie.  Definitely a horror holiday classic, creepy, scary and fun to watch.","user":"Carrigon","rank":[24,25]},{"title":"Shelley Winters is fantastic in this Great British Classic!","rating":10,"date":"10 May 2005","review":"Probably Shelley Winters' greatest Movie - though I suspect many would disagree.<br><br>Many viewers delight in name-calling 'Aunt Roo' as 'nuts' 'crazy' 'evil' etc., but many fail to see the sad and pathetic side to this unfortunate character.<br><br>Aunt Roo (played marvellously by the wonderful Shelley Winters) is clearly traumatised by the tragic death of her only child. Left widowed in an isolated mansion to live all by herself, she is taken advantage of, and her 'damaged' mind from the trauma of her loss is cruelly and sadistically abused by her staff who pretend to be her dead daughter come back during false seances.<br><br>Many viewers ignore her staff who bleed her white. Despite showing loads of kindnesses to orphaned children, she is further still abused by two of the most ungrateful among them. Consequently, 'Aunt Roo' transforms from just being traumatised to mentally disturbed, and the tragic end to the movie ensues.<br><br>I guess this story just goes to prove how cruel society and people can be to traumatised people without trying to understand them, just because they are adults. If the roles of this film were reversed, everyone's sympathy would still lie with the children...<br><br>Shelley Winters' performance still brings tears to my eyes when she cries and yearns for her dead child, only to find out she's been made a fool of - enough to drive anyone insane!<br><br>A fabulous Movie, and a fabulous story. It's often likened to Hansel And Gretel, but I think it's far more complicated than that - poor 'Aunt Roo'!","user":"arrival","rank":[21,22]}]