[{"title":"\"We don't waste time on killers\"!","rating":6,"date":"5 April 2011","review":"Even after watching a few hundred Westerns, it always seems that something I haven't seen before manages to work it's way into a story. In this one, hero Johnny Mack Brown manages to talk a couple of sharp shooters with rifles into putting on dresses to help protect the Denton Stage coach from a band of outlaws. Not only that, but his sidekick Fuzzy Knight gets to wear one too! This all turned out to be a comical gimmick for the matinée fans back in the day, because the way Steve Hardin (JMB) had the stage rigged with iron panels, there's no way anyone could have seen who was inside, even though the bandit look-out reported just that to his cronies.<br><br>Oh well, these old B Westerns didn't have to make much sense, and even though the plot lines were reworked dozens of times, they're still fun to watch. Throw in some fancy shootin' and hard ridin', and you've got yourself a good time. As Hardin's trail pal Clem, Fuzzy contributes another comedic moment when he gets beaned by a bee hive and it gets stuck on his head. That would not be pretty.<br><br>Something else that was kind of cool was seeing two female leads who supported the cowboy hero; usually one would be a romantic interest and the other part of the villain team. Molly Denton (Nell O'Day) had a stake in the stage line with her father, while Nina Kincaid (Anne Nagel) came to Cottonwood to reunite with her long lost father. Kind of curious though, even though they hadn't seen each other since Nina was three years old, they recognized each other immediately.<br><br>It's hard to imagine how they could squeeze in as many as five songs into a picture coming in at right around an hour, but they did. Two were standards, 'Get Along Little Dogies' and 'Red River Valley' handled by a quartet called The Guardsmen, while Fuzzy added a couple as well - 'Don't Ever Be a Cowboy' and 'Too Darn Bashful'. Fuzzy actually sounded pretty good, which means my hearing's probably getting worse.","user":"classicsoncall","rank":[6,9]},{"title":"More Imagination than Usual","rating":29,"date":"29 May 2012","review":"The plot is formula, but more than the usual amount of imagination went into the storyline. As a former Front-Row kid, I've seen hundreds of these Saturday afternoon horse operas. But this is the first time I've seen a stagecoach turned into an armored car, courtesy of metal plates. So, the bad guys get a big surprise out of that western cliché, the stage hold- up, thanks to an imaginative screenplay.<br><br>Still, the bad guys could have triumphed had they broken a paramount taboo—they could have shot one of the stagecoach horses and ended the chase right there. But then thousands of us Front Row kids in 1942 would have stormed the screen and ripped it down. It's okay to shoot as many guys as needed, but shoot a horse and America's kids would come after you, no holds barred. Okay, I exaggerate, but not much. Nor was this taboo confined to kid westerns. Check out John Ford's epic A-western, Stagecoach (1939). There you'll see the same set-up—Indians chasing a stage, taking big casualties, but never once shooting a horse. Some things, it seems, are just too sacred to do, regardless of budget size.<br><br>I digress, but the taboo remains an interesting point, and on clear display in this 60-minutes. Anyway, the movie's a pleasant mix of action, song, and bad guy intrigue. Watch for hulking Glenn Strange, the bartender from the Gunsmoke TV series (1955-1975), as the chief henchman. I also like the actress Nell O'Day who has maybe the best name for a western belle that I've seen. Anyhow, this Johnny Mack Brown special remains an hour of old time fun for this now Front Row geezer.","user":"dougdoepke","rank":[3,5]},{"title":"Pleasant Universal B Western With A Solid Cast","rating":6,"date":"9 March 2020","review":"Johnny Mack Brown and Fuzzy Knight rescue the runaway stagecoach with Anne Nagel in it. It's just been held up by a gang led by Herbert Rawlinson, the town's banker who seems to,spend all his time playing poker. Miss Nagel is his stepdaughter, but she thinks he's her father. After she almost gets Brown and Knight almost hanged, and rescued by Nell O'Day, the gents go to work for her coach line.<br><br>It's an exercise in singing, Knight's clowning, Brown's stalwart heroism, and three, count 'em, three runaway stagecoach stunts, with some mighty good camerawork - I thought Brown did the actual stunt work on at least the first. There are no fancy fillips here, just one of the sharp little B westerns that Universal turned out under the direction of Ray Taylor, but for fans of the genre, it's a pleasant hour.","user":"boblipton","rank":[0,0]}]