[{"title":"Beautiful, Strange, Powerful, Haunting Masterpiece","rating":18,"date":"18 April 2004","review":"There are very few people worthy of the accolade of \"Genius\" but the late Russian film-maker Andrei Tarkovsky was definitely one of them.  In his film-making career he is responsible for some of the most beautiful images ever to be put on a cinema screen.<br><br>\"Nostalghia\" deals with a Russian poet who is in Italy to research the life of a Russian composer, who died there.  Accompanied only by his female, Italian, interpretor, who is attracted to him, the poet feels strong feelings of home-sickness for Russia and he strongly misses his wife and child who stayed behind.<br><br>This was Tarkovsky's first film made outside the Soviet Union (and his first in a language other than Russian), but it is still very obviously a Tarkovsky film, complete with many haunting images of water and fire.  in fact, instead of the beautiful, sun-drenched Italy we are used to seeing on film, here the country is grey, wet and shrouded in mist.  As usual in Tarkovsky's films there are many changes between colour footage and black-and-white (or sepia).  Here, the poet's memories of Russia are presented in monochrome.<br><br>As with all Tarkovsky films, \"Nostalghia\" demands a great deal from the viewer.  It is very slow moving and requires a great deal of patience and concentration.  Also, be warned that Tarkovsky did not see cinema as \"entertainment\" but as an art form.  I would advise anyone to make the effort and stick with it, though.  It is a great work of art.","user":"RobertF87","rank":[107,120]},{"title":"Faith...","rating":10,"date":"21 September 2001","review":"The nostalgia, in the film's title, isn't just the physical longing for something in the past, it's the spiritual longing that so many people strive for. This shouldn't surprise an student of Tarkovsky's work since no director, possibly with the exception of Ingmar Bergman, analyzed spirituality as Tarkovsky did.<br><br>NOSTALGHIA follows the trekking of a Russian traveling through Italy along with his beautiful interpreter. His purpose for being there does not come to the viewer easily. Most of the scenes in the movie are filled with a lot of silence, and even the action that does take place, is minimal. Eventually, we come to understand that he is there to find some cultural reinforcement for his Russian background. As the film progresses, we seem to take on the role of the main character in the story, as an observer to events. Throughout his travels he becomes a witness to religious processions, theological discussions, and the rituals of a God-fearing lunatic. The lunatic, played masterfully by Erland Josephson, is looked down upon by a lot of local citizens. Apparently, in the past, he locked his family in his house for a long time, anticipating the end of the World. The movie documents his effect on the Russian traveler, and the traveler's longing to recapture his spirituality.<br><br>A lot has been said of the ten-minute unbroken sequence where the lead protagonist attempts to carry a lighted candle from one end of a pool to the other. Some see it as utterly boring. Personally, I was fascinated. In it, we see how the protagonist finally attempts to do something in order to recapture his spirituality. For the entire length of the movie he has been an observer, now he is an active participant. To be fair, his action does take the form of a ritual, not the building of a church, or water immersion, but then again, so much of spirituality is ritual. Tarkovsky correctly identifies how it's the continuity that helps us get through life, knowing that some things will never change our strong religious convictions. That's when the protagonist finally comes to realize that action must take place. It's no coincidence that this scene takes place after a demonstration given by the Erland Josephson character. It's an amazing scene. In it he gives an intelligent speech about the desolation of art. It also imparts an important question to the viewer about those who truly make a difference in the world: the observers, or the \"insane\", who try to take positive action on the behalf of others.<br><br>No praise of any Tarkovsky film is complete without talking about the technical angle of his work. In NOSTALGHIA Tarkovsky is proven again to be a master of beauty, carving out beautiful images into the Italian landscape. Even the indoor scenes are beautiful. NOSTALGIA is further evidence of Tarkovsky's desire to elevate film as an art. He paints well...","user":"Preston-10","rank":[60,68]},{"title":"Really, as beautiful as a film can be. As beautiful as art gets.","rating":10,"date":"7 September 2001","review":"Words cannot describe Nostalghia, or, indeed, any Tarkovsky film. He is an artist who is completely unique - I can't think of any other auteur like him. I can't even think of any film that I've seen which tries to copy his style. It is inimitable. No one else is as patient. Tarkovsky's pans and zooms can take minutes. The penultimate sequence, where a man has to carry a candle for a certain distance without it going out, should be horribly boring. Any other director would have used a lot of cutting to produce suspense. Yet, with Tarkovsky's brilliant direction, without a single cut for nearly an entire reel, it becomes one of the most suspenseful and, yes, one of the very best scenes ever captured on film.<br><br>In fact, the direction's almost too good. This isn't minimalist like some of his previous films such as Solaris and Stalker. It is more like Andrei Rublev: not a second goes by that is not stuffed to the brim, almost flowing over, with brilliant and poetic images. In a way, although in a good way, this distracts the viewer. I was so bowled over by the images of Nostalghia that I had to watch it twice to understand it (it was nearly as difficult the second time around not to be bowled over!). And I totally appreciate that. I was more than happy to explore this film more deeply on a second journey. Thank you Mr. Tarkovsky for making the films that you did. When you sought to fulfill your audiences' lives with your art, you came closer to succeeding than any artist could have. Of course, you couldn't have made life perfect, nor would you have wanted to. For, as you said, if life were perfect, art would be pointless. May my life always be imperfect.","user":"zetes","rank":[81,95]}]