[{"title":"\"The truth is just a lie that hasn't been found out.\"","rating":5,"date":"9 July 2006","review":"Sam Peckinpah is one of my favorite directors. I'll always see him as a visionary maverick responsible for crafting some of the most enjoyable movies I've ever seen. His The Wild Bunch and Bring Me the Head of Alfredo Garcia are among my favorite films. His last film, The Osterman Weekend, is something of a mixed bag. On the positive side, it has several good action set pieces that are very reminiscent of the other films I've mentioned. Scenes of bullets and arrows flying through the air and a particularly brutal fight scene with a bat filmed in slow-motion remind me of Peckinpah's glory days. Unfortunately, there's a plot in there that gets in the way of the fun. I've seen The Osterman Weekend twice now and I'm as confused about some of the events in the movie as I was the first time I saw it. I don't know if it was just Peckinpah being stubborn, but it feels unnecessarily confusing. There are plot points that go nowhere, plot holes big enough to drive the proverbial truck through, and plot twists that don't work. After a good set-up, the movie simply loses its way. A script that didn't try so hard to be clever and secretive and some judicious editing might have made The Osterman Weekend a winner.","user":"bensonmum2","rank":[10,10]},{"title":"Spy Yarn Gets Too Tangled","rating":4,"date":"22 May 2010","review":"It's Sam Peckinpah's last film, and as a fan of this brilliant, troubled man, I wanted it to be a good one to go out on. What I got instead is another of his problem pictures, an interesting premise and eye-raising performances done in by a loss of focus.<br><br>John Tanner (Rutger Hauer) is a TV interviewer given an unpleasant assignment by CIA operative Lawrence Fassett (John Hurt): Confront a group of college friends with evidence they are working for a KGB operative named Mikalovich. An array of videotapes provided by Fassett demonstrates their culpability to Tanner. So he sets to work, his home the setting for a prearranged weekend gathering. If it works, a live interview with CIA Director Maxwell Danforth (Burt Lancaster) will be his reward.<br><br>For Peckinpah, it was his first film in more than half-a-decade, and a chance to show he was still able to deliver a solid action film well after his gritty early-'70s peak. The CIA comes equipped with cool surveillance equipment and laser-sighted automatics. The Weekend itself, once it gets going, has a nice \"Big Chill\" vibe with paranoid undertones.<br><br>So what goes wrong?<br><br>It starts with a 40-minute intro that establishes the premise in clunky fashion. \"I'm Cloak, you must be Dagger\" Tanner says upon meeting Danforth, whom Lancaster plays with brio but not subtlety. \"Being wrong is not nearly as important as not admitting it, not these days,\" he tells one Company weasel, and acts throughout as the kind of clod you wouldn't put in charge of a shoe store, let alone the CIA.<br><br>Then we get to the Weekend itself, with Tanner's college friends taking center stage. Each has their quirks. Osterman (Craig T. Nelson) is a very cool TV producer who describes himself as \"a nihilistic anarchist who lives on residuals\". Nelson is great fun, though the rest of the group, including Dennis Hopper, gets lost in the mix. Only Helen Shaver's turn as a coked-out floozy stands out, as much for her gratuitous nude scenes as for her entertaining freak outs.<br><br>Sappy lite-jazz music by Lalo Schifrin underscores a lack of suspense. Hauer's Dutch accent keeps creeping in like Nastassja Kinski's, and his fragile relationship with his bow-toting wife (Meg Foster) isn't developed any more than those with his once-merry, now-sullen Berkeley chums.<br><br>The actual jigsaw puzzle we get here is indifferently assembled and seems at end a few pieces short. At one point Tanner hears Osterman on tape tell his friends \"Let's go to our friend John Tanner's house and set him up\". Tanner doesn't take this kindly, reasonably enough, yet what Osterman may have meant is never explained. A lot of threads are pulled out this way only to be left floating in the breeze.<br><br>John Coquillon's cinematography does capture something the rest of the film flails at, a sense of mystery and foreboding. Hurt's tortured performance as Fassett is nicely underplayed, watching beady-eyed between sips of wine from a china cup as the gears shift into play. And Nelson does crack me up, as in one scene which finds him running for cover.<br><br>\"It'd be nice if we had weapons!\"<br><br>\"We do!\" he is told. \"Bows!\"<br><br>\"Bows?\" Osterman replies. \"That's keen!\"<br><br>In the end, we get a wrap-up lecture about the pervading influence of television and how this all was, as one character puts it, \"just another episode in this snuff soap opera we're all in.\" Peckinpah supposedly hated this script, only using it because he needed the film, but I think those sad words represent his actual mindset all-too-well. Distrait, somewhat lethargic, and depressing, \"The Osterman Weekend\" gives us lots of clues but no answers as to where Sam fell off.","user":"slokes","rank":[16,19]},{"title":"The films of Sam Peckinpah. The last hurrah.","rating":7,"date":"29 August 2005","review":"The Osterman Weekend (1983) was Sam Peckinpah's last film. Years of drug abuse (alcohol, pills etc..) took a devastating toll on the legendary film maker. Desperate for work, he took an uncredited second unit directing job with his buddy Don Siegal's swan song JINXED. He finally got the chance to direct a movie when he was given the job to try and adapt the complex and layered espionage spy thriller The Osterman Weekend. Not pleased with trying to bring to life a novel he really didn't care for, he did the job (albiet with mixed results).<br><br>Tanner (Rutger Hauer) is a talking head newsman. He has an eclectic group of friends (Chris Sarandon, Dennis Hopper and Crag T. Nelson). One day, Tanner is approached by a rogue C.I.A. named Fassett (John Hurt) agent to \"keep an eye\" on Osterman (Craig T, Nelson) because of his ties with certain \"red\" double agents. But Tanner knows Osterman and doesn't believe that he would be a traitor to his country. After a couple of attempts on his life, Tanner doesn't know who to trust. Is Osterman the traitor that Fassett claims to be? Who's telling the truth?<br><br>Not the way I wanted to see Sam Peckinpah end his career but hey, you play with the hand life deals you. People have complained about how confusing the movie is (have you read the book?). Considering with what he had to work with, I say that he did a fairly decent job.<br><br>Recommended for Sam Peckinpah fans.","user":"Captain_Couth","rank":[33,44]}]