[{"title":"The French \"collector\"","rating":12,"date":"12 July 2003","review":"A strong analogy with William Wyler's masterful \"the collector\" (1965).But \"la drôlesse\" is a good movie on its own,probably Jacques Doillon's finest hour.<br><br>François,a hung-up young man,locks up Madeleine ,a teenage girl ,in an attic.François is an outcast,unable to integrate well into a society. Here begins a \"in Camera\" drama ,with a subtle development.Soon ,we do not know anymore who the prisoner is and who the jailer is.An inhibited person,François is completely baffled when Madeleine tells him that she wants to be pregnant by him.As some critics noticed when the movie was released ,the keyword is \"games\".The two characters seem to play dad and daughter ,dad and mom ,and so on....<br><br>Madeleine Desdevises,who was very promising,died from leukemia shortly afterwards.","user":"dbdumonteil","rank":[34,37]},{"title":"Good idea and acting but boring movie","rating":2,"date":"22 August 2007","review":"I watched this movie with open mind knowing that it was French, therefore not expecting Hollywood plots. I know it was going to be quiet but I wasn't expecting something boring! It is about Mado, a 11 y.o. girl who lives in the countryside with her mother. Even thought the mother character is not developed at all we are told mom and daughter do not love each other. One day the girl is kidnapped by Francois, a mousy and lonely guy about 20, for no apparent reasons. It's strange that Mado does not put up too much resistance.<br><br>Francois does not have a good relationship with his parents either and he lives with them but apart in an attic, the same place where he keeps Mado locked. Then you realize that Francois kidnapped her just because he needs company. After a while Mado becomes his sister, his daughter, his wife, his friend, etc. They sleep and eat together and develop a love &amp; hate relationship (oh, they sleep together but clothed so don't think bad).<br><br>The movie drags along with this and you start wondering if she DOES want to live locked there forever. At some point she has the chance to go away but she returns. The movie turns boring because you don't know what the point is with this implausible bunch of things. She stays days by days there with the same clothes, no bathroom, no school, almost no food, and she is not reported missing or anything.<br><br>If the director wanted to make a love &amp; hate story about a lonely boy and a lonely girl I think there are many other interesting ways to do it. The strangest and misunderstood fact of this movie is its stupid title \"La Drôlesse\" that means \"The libertine girl\" or \"The hussy\". It could even been translated as \"The little whore\" while actually Mado is a lovely and innocent girl far away from that and has nothing to do with \"libertine\" behavior.","user":"vocklabruck","rank":[19,32]}]