[{"title":"The Penitentiary Trilogy: Penitentiary","rating":8,"date":"6 March 2009","review":"Penitentiary (1979) follows the life of Too Sweet, a young man who's life is has taken a very wrong turn. A very tragic and unlucky event lands the dude in prison. Looking at a long stretch in the jug, Too Sweet looks for any opportunity to get out of the joint. Finally a big break comes along, boxing. But like all good guys, he makes a very nasty enemy in the guise of Half Dead, a cruel sadistic inmate who doesn't take a liking to our young hero. How did Too Sweet get in Prison? Can Too Sweet fight is way out of prison? Why does Half Dead want Too Sweet's head? Who in the hell is Peaches? All your questions will be answered when you watch Penitentiary!<br><br>Highly recommended for fans of low budget films.","user":"Captain_Couth","rank":[7,7]},{"title":"A long lost blacksploitation Gem!","rating":16,"date":"16 March 1999","review":"Surprise, surprise blaxpo fans the movie that started off the penitentiary series is available. No, it's not the one with Mr. T (penitentiary II) or that horrible one with the midget. (penintiary III) This is the one with the original too sweet, half dead and seldom seen. Despite the fact this movie is the epitome of low budget, try to find the boom mike in some scenes.<br><br>This remains one of my favorite cult films. The cinemetography is pretty good. The fight between Too sweet and Half dead is particularly interesting. The use of the Wide angle lenses to give the viewer a distorted view. And the way some characters address the camera. Look were not talking Citizen Knae here, but it still is interesting.<br><br>That's not what impresses me most about this movie. It's the fact it transends the usual blacksploitation stereotypes. They are still there but also there is also a lot of truth within it's characterizations. Seldom seen character is no caricature he's a real. (He plays too sweet's trainer.) I was amazed at how realistic his portrayal of an institutionalized convict was. We really get to understand him and why he does what he does. Another interesting thing about this movie is the character half dead (Badja Djola) was hilarious. (You want some Mr. goodbar) You might remember him from the dozens of movies she's appeared in afterward (a rage in harlem, mississippi burning and other films) I also liked the fact that this was funny (mostly) but it also contained moments of dead seriousness. If you are any kind of fan of blacksploitation movies, or cult movies in general check this one out. If you can find it.","user":"hampton70","rank":[12,14]},{"title":"Passionate and very intense cinema experience","rating":3,"date":"3 June 2000","review":"I read in an article that \"Penitentiary\" is one of John Singelton's favorite films. I can see why. It is an film that is kind of like an \"acquired taste\". It has its own audience. Hard-hitting, intense, and memorable, with some very well done casting, especially bad-man Badja Djola as \"Half Dead\". The musical score takes great risks that ultimately pay off. There is one part during the terrific fight scene between Too-Sweet and Half-Dead where there is no score, just screeching. Another interesting point, in Penitentiary 2, Ernie Hudson is just as good as Half-Dead's replacement.","user":"pwmoses","rank":[9,10]}]