[{"title":"A challenging film","rating":27,"date":"27 January 2001","review":"This is one of the most important films made in the sixties, and should be understood as an attempt to develop non-classical forms of film narrative in a politically-oriented way. The movie is based on a novel by Heinrich Boll which tells the story of a german family from 1900 to 1950, from the beginning of the XXth century to the rising of nazism and the postwar years. The plot from the novel is however condensed and disarticulated in the film, with many flashbacks, and therefore the viewer is encouraged to reconstruct the story and to fill the gaps. This creates a fascinating atmosphere and conveys the main message from Straub: that Germany, in the sixties, was still haunted by the specter of nazism, and in that sense German people were \"not reconciled\" yet.<br><br>If you are not used to art movies, this film will be a difficult one, but you should keep in mind that this movie is closer to a painting by Picasso than to a TV series. If you don´t like this kind of movies, don´t watch this one, and if you watch it by mistake, don´t send silly comments to IMDB:","user":"marcosmarino","rank":[42,48]},{"title":"pretty close to the book, if obliquely rendered","rating":5,"date":"26 May 2013","review":"If you've read the book, the film makes pretty much sense. Then again, if you've read the book and didn't have a professor explain it to you, you probably didn't understand it anyway. I know I didn't until we discussed it in class. I can't imagine what you'd make of it if you'd never read the book though. There's a lot of symbolism that isn't really all that clear from the movie, I don't guess. You'd have no idea who anyone was or how they were related or what they were talking about if you hadn't read the book. I guess that's the thing, this movie won't make any sense if you haven't read the book, but I'm not altogether sure what it would add if you had. An interesting curiosity anyway.","user":"stadtkind78","rank":[11,14]},{"title":"Does almost nothing for me","rating":4,"date":"21 June 2016","review":"\"Not Reconciled or Only Violence Helps Where Violence Rules\" is a West German black-and-white film from 1965, so this movie already hast its 50th anniversary last year. It is a work by Jean-Marie Straub and Danièle Huillet, a French filmmaking duo that made many films in French and German language together. This one here is among the latter. And like some other of their works, it is not particularly long, only runs for 50 minutes approximately. There are several core messages and plot points in here, but one major aspect of the film (and also the somewhat only memorable to me) is about a father-son relationship. I have seen some works by Huillet and Straub and I must say I was not impressed at all. this film here does not change things for the better. The script and characters seemed uninteresting to me and it was virtually impossible to care for any of the protagonists. Apart from that, the line delivery was occasionally truly amateurish. I do not recommend the watch and 4 stars are actually somewhat generous for this movie. Thumbs down.","user":"Horst_In_Translation","rank":[3,4]}]