[{"title":"A primeval western experience","rating":12,"date":"12 July 2008","review":"As far as westerns go, the 60's were all about Italy and the spaghetti western. By 1967 the ripples Leone's movies are about to make in the American film-making business are around the corner, which leaves The Shooting hanging in a peculiar time and place. Too out there to be appreciated by the traditional western crowd of the 50's and not as cynic and hard-boiled as the spaghetti western-influenced works of the early 70's.<br><br>But it succeeds exactly because of that. Monte Hellman crafts a mesmeric, primeval, ultimately existential western that exists in a parallel western universe. A mythic world of some other order. That it refuses to sit down and explain what is going on with the plot is a testament to the film's strength. Not everything needs to be explained. It's all about the impression images make. Impressionistic in that aspect but also surreal. Very. Who is the woman? Who is Billy and the bearded man? As Warren Oates, Jack Nicholson (in an early role here but showing the potential he would fulfill later on in his career) travel through the barren desert, in search of something or someone, The Shooting slowly but gradually peels back the layers of conventional film-making to reveal an off-beat, gritty and fascinating movie. Some of the editing used by Hellman (day to night and vice versa) only serves to disorient the viewer more.<br><br>Not only is this a rare, one of a kind western but in all its psychotronic, b-movie glory, it's one of the best of its kind America has to offer. Kudos to Hellman for not refusing to take chances.","user":"chaos-rampant","rank":[44,57]},{"title":"Absolutely fascinating viewing. A difficult movie but an unforgettable one!","rating":7,"date":"7 May 2003","review":"Monte Hellman has my vote for the most underrated and overlooked American director of all time. Like so many excellent film makers he got his first big break from legendary b-grade producer/director Roger Corman, and he co-directed (uncredited) Corman's 'The Terror' and edited his biker classic 'The Wild Angels'. Jack Nicholson starred in 'The Terror' and he an Hellman soon bonded together personally and professionally. Their greatest collaborations were the two 1960s westerns 'Ride In The Whirlwind' and 'The Shooting', filmed simultaneously, but released separately. Both are great movies but 'The Shooting' is the more interesting of the two, and along with Hellman's classic road movie 'Two-Lane Blacktop' his finest achievement. Both movies are close to being masterpieces, but rarely get mentioned except by other film makers, like Quentin Tarantino, who is a major fan, and enlisted Hellman's help in getting his debut 'Reservoir Dogs' to the big screen. 'The Shooting' is difficult viewing for most people. It requires you to pay close attention and fill in the blanks yourself. It isn't exactly a puzzle movie, but not everything is blatantly spelled out. The viewer has to work a little, but it's really worth it! The four main actors are all excellent. Not just Nicholson, and the legendary Warren Oates, but also Will Hutchins (of 50s TV western 'Sugarfoot'), and the beautiful Millie Perkins, who also appeared with Nicholson in 'Ride In The Whirlwind', though her role here is much more substantial and impressive. 'The Shooting' is one of the most original westerns I've ever seen, and easily one of the most underrated movies of the 1960s. I highly recommend it!","user":"Infofreak","rank":[50,66]},{"title":"Uncompromising Indie Western","rating":29,"date":"29 October 2002","review":"The Shooting is an indie western that reflects Americans' feelings of dread and uncertainty following the assasinations of JFK, Bobby, Malcolm, and Martin. Man overwhelmed by his environment. This West is a lonely,cruel world primarily populated by poor, uneducated men struggling to survive. The style is minimalist in that we are given information, through images and words, with great restraint and economy. An intense experience that calls for sustained attention. Comments below:\"no idea what it's about\", \"dialogue incomprehensible\",wish \"storyline  could be followed easily\"-indicate some may benefit from a proper sinopsis, which I have not found. Others should view film before reading further. Willet returns to his camp and finds dimwit Coley quite agitated.Coley states that Willet's brother Coin and partner Leland arrived drunk from Winslow. Coin had run over a man and a child and needed to flee.Leland stays behind and gets shot by an unknown assailant. Willet and Coley are approached by a woman(we had seen her shoot her horse for no obvious reason) who offers $1000 to be escorted to Kingsley but refuses to reveal her name.They travel toward Crosstree where Leland learns Coin bought a horse 2 days ago. They proceed through the desert. The woman shoots at random, Willet believes she is sending signals to someone following. Gunslinger Billy emerges from hiding and joins them. His relation to the woman is unclear.They encounter day-old horse tracks as Billy and Coley threaten each other. The woman's horse pulls lame. Billy threatens to shoot Coley if he doesn't stay behind, demands Willet's gun and reveals he killed Leland. Willet:\"I have my reason for staying.There ain't gonna be no killing\". They encounter a bearded man with a broken leg and his horse.We see Coley following on foot. He takes the bearded man's horse. Billy spots Coley approaching and goes after him. Coley aims at Billy who shoots Coley in the face. Willet buries him. Woman to Willet:\"I know that feeling.I've carried the burden of it longer than you\". The elements continue to take its toll on people and animals.The woman rides while the men follow on foot.Willet charges at Billy, tosses his gun away,beats him and crushes his hand with a rock. Willet follows the woman, now on foot, into a canyon. She spots Coin, who looks identical to Coley, and shoots. Coin returns fire as Willet comes behind the woman. All three are hit.Billy wanders aimlessly waiting to die. The film leaves plenty of questions open to interpretation. Why wouldn't the woman attempt to kill Willet if Coin looks just like him? Did her son(and husband?) survive being run over? Why is Billy involved? An existentialist view of man and his predicament permeates this uncompromising western. 9/10","user":"cineman2","rank":[38,55]}]