[{"title":"\"You'll find what you're looking for. But afterwards?\"","rating":10,"date":"10 April 2005","review":"Based loosely on an famous unsolved murder mystery (the multi-millionaire Sir Harry Oakes, who was brutally killed at his island retreat), Nicolas Roeg's \"Eureka\" takes this bare bones idea and transforms it into one of the most daring, ambitious and insightful films of all time. The film's screenwriter Paul Mayersberg packs each line of dialogue with thematic clues. <br><br>The opening half hour is so stunning that it makes your head swim- the camera sweeps into the snowfields of British Colombia whilst Stanley Myers' hauntingly repetitive theme throbs on the soundtrack. Jack McCann (Gene Hackman) is prospecting for gold and ditches his partners. Surrounded by wolves, he gets a small talisman that he takes back to a brothel. The madam Frida fortells the future: \"You'll find what you're looking for. But afterwards?\" <br><br>Jack sets off and discovers the gold (a genuinely amazing sequence). His ecstasy is short lived when he returns to his dying mistress. A burst of flame shoots forth and the film cuts to twenty years later when Jack is nostalgically telling the story to his daughter Tracy (Theresa Russell). Tracy is in love with an insubstantial dilettante Claude Mio Van Horne (Rutger Hauer), who Jack loathes. At that moment in time Tracy is looking forward, Jack is looking back. <br><br>Jack is bored. He says \"Once I had it all. Now I only have everything\". He is aware that his daughter is his soul-clone. On the surface, they appear quite different- he's bitter, she's a hedonist. Yet small details (both admonish Jack's alcoholic wife Helen to \"lay off the sauce\" and they both have a stunning gift for mathematics) tell the truth. They understand each other perfectly. <br><br>Jack is under siege from a pack of wolves who come in the shape of gangsters who want to develop Jack's island. Eventually the gangsters and Claude invade the house and Jack is brutally murdered. After this terrifying yet beautiful sequence, the film becomes more problematic. The courtroom scenes that follow contain dialogue that spells out the movie's themes and Russell's performance is hysterical. But the punchline as Tracy emasculates her husband is a doozy: \"Claude...they despise you because you have me and I'm worth having. They despise me because I'm Jack's daughter and I have too much. And of course, they still despise Jack because he found what they're all still looking for\". The movie atones for a lot with its gorgeous final moments as Claude paddles away. <br><br>It's difficult to articulate the power this movie has. It has an extraordinary power to sweep you away- it's a crazy, violent, lovely, magical experience. It's about the human condition and it deals with issues that are almost never talked about- the price we pay for getting what we want, the moments in life where we find our purpose, the essence of people that is passed down through the generations, the difference between old and new souls. The film's main flaws (clumsy dialogue) are directly linked to the main virtue (the sheer overwhelming density of the material). Its a movie that will speak to you personally or leave you cold (there's no middle ground) and I find it almost an affront when somebody doesn't respond positively to it.","user":"wilderfan","rank":[46,58]},{"title":"Eureka is about desires!","rating":5,"date":"5 July 2002","review":"Eureka is the kind of film you think you'll hate unless you give it a fair shake. It is a interplay between many characters, much like a soap opera. It works only if you take a general interest in the trivialities of each character. Jack McCann (Hackman) is the center of the film. His life is all about the gold he felt he earned, and the principle that he will never have any partners to share a percentage with. His life is ravaged by Mayakofsky (Pesci) and his henchmen. Charles Perkins, a friend of Jack's spent much of the movie trying to warn him that these men were dangerous. Jack's dilemma wasn't that he was waiting for his death, but the fact that he thought he was invincible. Being stubborn and set in his ways, Jack refused to give in to Mayakofsky. Jack was a man preoccupied with gold, but not loveless. He seemed to love all the women in his life. Also his daughter, Spacey Tracy. A loose young woman married to Claude (Hauer). Tracy had her head in the clouds, and wanted to live in a fantasy world. She did not provoke the fights between her father and Claude, but instigated them. She wanted Claude to fight as a proof of his love. Claude was most elusive. You never get his angle. If he loved Tracy or was just using her. She even used the witness stand as a way of finding out where Claude stood with her instead of pinning for the guilty ones involved in the tragic end of her father. (Claude did his own defense in court!) The movie has it's funny points. Like the dinner table scene at the McCann's where Jack makes some insulting remarks to the guests. Some of the best scenes involve Aurelio D'Amato, played by Mickey Rourke. He's cast in another glossed over film where he is perfect, but forgotten. D'Amato is a yiddish associate of Mayakofsky. And one of the main guys pestering Jack to sign the Luna Bay deal.(Mayakofsky wanted to build a casino on it.) There are scenes where D'Amato is begging Jack to sign. His baby face and soft voice should have gotten the devil to sign the document, but Jack wasn't so easy. Rourke's performance alone is reason enough to see this movie. And its not surprising he has a night with Tracy. Tracy loved Claude, but how could she resist D'Amato? Eureka is more of a film about the desires of man. Each character wants something, and they spend the entire film in pursuit of those things.","user":"poohpooh","rank":[24,32]},{"title":"More direct process makes subtext even more meaningful","rating":9,"date":"26 April 2007","review":"This movie is an odd one, even for Roeg fans. In one sense, it's much more straight-forward, linear, and narrative than his other works. It's metaphysical attributes are also more directly stated, instead of the kaleidoscopic mix of character and occult you find in other Roeg works. On the other hand, that straightforwardness makes all of his subversive use of editing and narration even more effective, as this movie tends to cause a sense of security right before dealing a blow.<br><br>The plot, as it exists in relatively straight-forward form, is about a man named Jack (played by Gene Hackman) who strikes it rich finding gold (a surreal moment made all the more effective by the water-like quality of the valuable substance). The movie then jumps forward over a decade later, where Jack's wealth and happiness on his own private island, surprise surprise, is filled with ennui and unhappiness, made all the more dramatic with his increasing selfishness, his constantly drunk wife, and his daughter's (Theresa Russell proving that her partnership with Roeg has a lot more power than mere outside-of-work relationship) romance to a womanizing French man (Rutger Hauer, in the best role I've seen him in since Blade Runner). Jack, since he's such an unlikable person AND rich, is a target to everyone else's priorities, so he gets killed. The husband of his daughter is framed, and suddenly the movie becomes a courtroom drama.<br><br>The story is Roeg's most dramatic and poignant along the human level. But what seems incongruous to that aspect of the film is the Voudou, the religion, the Tarot, the Kabbalah, and all the other religious and occult symbols and dialog welded into the frame like some kind of scrapheap onto a statue. However, what all that symbolism reveals, along with the dialog (I think this is Mayerberg's best collaboration with Roeg), is the fact that this movie is neither a gold-searching adventure story, nor an idle-class ennui drama, nor a courtroom thriller... it's a meditation on life and success. But saying it like that doesn't really give credit to the type of meditation it is, for this is far from the typical art-house \"let's deconstruct modern life\" style meditation on an upper class it despises; it's much more a question onto the nature of what part of success is really important, and above all what part of life can actually be called life. Putting it into the context of a metaphysical/spiritual realm makes it all the more powerful, as in most cases the camera is set at a God's-eye-view. The trial is a different type of judgment than you think. The title \"Eureka\" isn't just about finding gold.<br><br>Finally, a note about the cinematography: along with being a much more narrative work than Roeg's previous films, Eureka also is a lot less flashy. Despite that, the photography is still completely stunning, more so than ever in the lighting of the trial, which is probably one of the most reserved and subtle aspects of Roeg's film-making to date.<br><br>--PolarisDiB","user":"Polaris_DiB","rank":[18,24]}]