[{"title":"A classic one of my personal all time favorite movies one of Peter Weller's best movies","rating":10,"date":"12 February 2017","review":"Leviathan (1989) is my personal favorite film it is an underrated creature film from the 80's starring Peter Weller (RoboCop) and directed by George P. Cosmatos who directed my all time favorite classic sequel Rambo: First Blood Part II and he later worked with Stallone again on Cobra (1986) my two favorite movies. So Leviathan become one of my all time favorite classic creature films and I love this movie to death! I wish they would make more movies like this to day and it is really a shame because special effects that time in the 80's were really good.<br><br>Stan Winston's creations, while on a second-tier level to some of his other work, are still shudder-worthy. Jerry Goldsmith's score is quite effective and it provides more prestige than this B-movie probably deserves.<br><br>Leviathan was worth the hassle of those repeat visits to the rental store. The movie transcends its derivative plot structure (\"John Carpenter's The Thing wins an ocean vacation and pretends to be Ridley Scott's Alien.\") A lot of people are complying that the movie was a rip off Ridley Scott's Alien and John Carpenter's The Thing I personally enjoy it every time I watch the movie. I had an identical experience with Leviathan's underwater monster counterpart The Abyss and DeepStar Six the movie I watched previous month and I thought the movie was a boring, lame a time waster and identical copy of this movie.<br><br>Plot: Underwater deep-sea miners encounter a Soviet wreck and bring back a dangerous cargo to their base on the ocean floor with horrifying results. The crew of the mining base must fight to survive against a genetic mutation that hunts them down one by one.<br><br>I love the cast, I love the set, production design, the story and the plot, the horror and action. I do enjoy the creature effects, a lot of people don't care about the creature effects, I disagree. The music score is beautiful, the film goes fast paced around, I am never bored with it. The acting from all the actors are good and enjoyable.<br><br>All the people that were involved with this film are no longer with us anymore. R.I.P. George P. Cosmatos, Stan Winston, Jerry Goldsmith, Michael Carmine and Richard Crenna. It is really a shame that they are no longer with us anymore.<br><br>We have the cast that I love: Peter Weller (RoboCop 1, 2), Richard Crenna (Rambo Trilogy), Amanda Pays (The Flash), Daniel Stern (Home Alone 1, 2, Bushwhacked), Ernie Hudson (Ghostbusters 1,2), Lisa Eilbacher (Beverly Hills Cop), Hector Elizondo (Beverly Hills Cop III) and Meg Foster (They Live).<br><br>Peter Weller is believable as the calm-mannered supervisor who must maintain a cool head while managing any potentially volatile problems with the crew in an enclosed location where the slightest mistake could have deadly consequences. Amanda Pays, who was the ultimate object of infatuation for nerdy guys like me who enjoyed the The Flash TV series in the 90's and I still do enjoy her in the new Flash, is gorgeous and cool in Leviathan as a mining operative who plans to begin astronaut training after her undersea duty, and this role cements my opinion of her as one of the top 10 most beautiful women of the 1980s. Richard Crenna, excels as the seemingly-shady doctor who, like Ash in Ridley Scott's Alien, may or may not have an agenda all his own. Ernie Hudson and Daniel Stern lend some needed personality and levity to the equation. Lisa Eilbacher is competent in her role that provides one of Leviathan's most unsettling moments.<br><br>Leviathan is a 1989 Italian-American science fiction horror film directed by George P. Cosmatos and written by David Webb Peoples and Jeb Stuart.<br><br>Such negatives are distracting. Your ability to ignore such distractions will ultimately determine if you give this a 5 or a 9. Were it a little more humane as it stands, I give it a 10 because It is one of my favorite movies and it is very underrated.","user":"ivo-cobra8","rank":[68,75]},{"title":"one of those good scifi-movies!","rating":8,"date":"3 November 2003","review":"Leviathan is one of those underwater scifi-movies wich were made 1989. Abyss was a success with all that fantasy it included, but Leviathan and for example Deepstar six never made it to the stars. It just wasn't the right moment. Leviathan was made with good budget, average actors(Peter Weller, Richard Crenna and so on) and with professional director(George P.Cosmatos, who made wonderful job in Tombstone 1993). So what went wrong? Personally I liked the movie, because it had a good plot, lots of action and little humour there and there. I liked it, let's see if you like it!","user":"jarkantt","rank":[62,83]},{"title":"Alien Rip-off Underwater","rating":7,"date":"23 September 2014","review":"In the Atlantic Ocean, 16,000 feet deep, the Tri Oceanic Mining Corporation keeps a eight-men crew with the mission of extracting silver and other precious metals. The geologist and leader Steven Beck (Peter Weller) works with Dr. Glen 'Doc' Thompson (Richard Crenna) managing the miners astronaut wannabe Elizabeth 'Willie' Williams (Amanda Pays), the prankster Buzz 'Sixpack' Parrish (Daniel Stern), Justin Jones (Ernie Hudson), Tony 'DeJesus' Rodero (Michael Carmine), Bridget Bowman (Lisa Eilbacher) and G. P. Cobb (Hector Elizondo). He is also the liaison with the Tri Oceanic executive Ms. Martin (Meg Foster).<br><br>In their next to last day, Willie and Sixpack are assigned to work outside the base and Sixpack falls in a hole. Willie seeks him out and finds a Russian vessel named Leviathan. Sixpack finds a safe inside the vessel and brings it to their base. They find money, vodka, a videotape and documents and Beck keeps the content of the safe. However Sixpack steals a bottle of vodka and drinks with Bowman. Meanwhile Beck and Doc watch the videotape and the Russian Captain explains a problem that killed his crew. On the next morning, Sixpack does not feel well and stays in the sickbay. Soon Doc learns that his patient has a genetic mutation. When Bowman shows the same symptoms, Beck asks Ms. Martin to rescue them. But there is a hurricane on the surface and the rescuing mission is not possible. <br><br>\"Leviathan\" is an Alien rip-off underwater, but it is nostalgic to see this movie in the present days to admire the excellent cast in the late 80's. The lovely Amanda Pays shines with her beauty and is always good to see the eyes of Meg Foster. Peter \"Robocop\" Weller, Richard Creena and Hector Elizondo, all of them in good shape, is another attraction. Another good point is the special effect with the monsters, usual in the 80's and 90's and different from the exaggeration of the CGI in the present days. My vote is seven.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[20,24]}]