[{"title":"City of Women","rating":8,"date":"4 January 2012","review":"Kind of shrill and not very subtle, but nonetheless fascinating. Marcello Mastroianni plays \"Snaporaz\" (Fellini's nickname for the actor), who gets lost in a nightmare world where he is confronted with feminism, absurd satires of machismo and sexual fantasies and confusion. This film doesn't seem to have a very good reputation, even among Fellini fans, but I was mostly enthralled with its strange, unpredictable rhythms, visually astonishing sets, sense of humor and dreamworld logic. The cinematography (by Guiseppe Rotunno, who did a number of other Fellini films, as well as ALL THAT JAZZ, with which this picture shares some similarities) is delightful and the score is a mix of the usual carnivalesque tunes and eerie, more modern sounds... and one hell of a great Italo-disco song. Some parts are annoying or just too long, but overall it's my favorite of Fellini's later career, a surreal amusement about masculine fear and self-loathing.","user":"MartinTeller","rank":[12,13]},{"title":"Not a masterpiece but the trademark Fellini genius still shines through","rating":8,"date":"19 March 2006","review":"A few weeks ago, I posted a review of 8½, presently my undisputed Number 1 favourite movie. Still on the subject of Il Maestro, I've recently rewatched City of Women. This is another Fellini movie I'd watched many years ago, in my late teens, and didn't like at all back then. Well, I liked it (with reservations) this time. La città delle donne is one of the most robust, unrepressed and rough-around-the-edges explorations of the specifically Latin nature of machismo, feminism, gender rivalry and sexual politics I have ever seen. Many people don't like La città delle donne, but like 8½ and most Fellini movies of the later period it has an extraordinary, instinctive grasp of the rhythm and symbolic power of dreams. Its irritating aspect is coupled with and impossible to separate from the grasp it has upon the potency of what our psyche hides in among its hidden, ancestral folds - in this case, Marcello Mastroianni's character's but also our very own. This movie worms its way into your own psyche in time - as with other Fellini movies, it seems to reveal scenes that are totally new and surprising, yet strangely familiar to me even though I've never seen them before. As if I'd always been familiar with them, perhaps from a previous life - Fellini seems able to tap into a universal psychic blueprint of the soul, I think that's what it is - only a true Genius could do something like this. He gets to the emotional core of human experience, which means that even though I was never a young man who went to a brothel in 1930s Italy, as he has, there is something of the experience that I can relate to, as if it were universal. I guess the fact that things are rarely LITERALLY represented in his later movies (post-La Dolce Vita), also contributes towards this, making everything more symbolic and hence, universal.<br><br>But Città delle donne is also a shrill, over-the-top movie, grating in some ways, ridiculous, dated in others. Character-wise, Marcello is probably at his most repulsive... or perhaps I should say pathetic. But the movie, though flawed and a rehash of some other familiar Fellini themes treated more successfully elsewhere, is also delightful in parts, with a power in the use of visual symbols that I have rarely seen before, even in his own, more overall successful movies. For instance, the whole sequence in Dr Xavier Katzone's grotesque house, especially the mausoleum-like tunnel containing what is essentially the \"essence\" of his numerous past conquests, as well as the scenes of Marcello floating on the very originally-shaped \"hot air balloon\", Marcello being chased by the drugged-up teenage girl bullies in their squeaky old jalopies, etc - all scenes I won't be forgetting in a hurry.<br><br>If one really finds nothing to like in La città delle donne, it's ultimately still an important document on the gender battles that recent humanity has crossed. Perhaps Italy began these a decade or two later than, for instance, Northern European nations, but it got there eventually and in its own special, culturally individual way that can be compared to no other, since Italian men and women are not German or British or Swedish. Fellini pays tribute to that very Italian type of battle of the sexes here, stereotype-free but ever so evocatively. I have never delighted more in the never-obvious send-up of machismo as with this movie. This may be lost on non-Italian speakers but even the man's name, Katzone, is a phonetic rendering of the vulgar Italian word for... er... \"big (male) genitals\"! I give La città delle donne a 7½ out of 10 - I would have given it an 8 if it hadn't irritated me with its excesses in certain parts. Oh, what the hell - let's give it an 8/10!","user":"Asa_Nisi_Masa2","rank":[22,28]},{"title":"Entertaining, funny, absurd, visually marvelous.","rating":5,"date":"5 December 2003","review":"Fellini never made too many films that had absurdly intense sexual themes and dialogue. He made two, and along with `Casanova,' `The City of Women' revolves almost entirely around sex. What `City of Women' has that `Casanova' did not, however, is a beautiful child-like view of things that really makes Fellini's movies fun in the first place. It also has Marcello Mastroianni (one of my favorite actors) and gorgeous surreal cinematography by Giuseppe Rotunno. \t `City of Women' begins, appropriately enough, with a train going into a tunnel. Marcello Mastroianni is Snaporez, an again man on a train. He begins to flirt with the woman who is sitting across from him and follows her into the bathroom. As he reveals his lustful feelings, the train suddenly stops and she gets out. He runs after her and ends up at a hotel that appears to be hosting a feminist convention, a REALLY exaggerated and completely insane feminist convention. He soon discovers the entire land he is in is populated with women. Snaporaz is both frightened and in awe of the variety of women that surround him, and they represent virtually all viewpoints of feminist issues - from angry man-haters to whores to crazy teenage girls to dancers to roller skaters to older, more motherly women. Throughout the film the women are clearly in total control, and I interpret this film as a womanizer's nightmare, which makes perfect sense.<br><br>The film is perfect by no means, but it's still a bit of a treasure if you're a Fellini fan who has explored most of his body of work, and yet are still starved for some Felliniesque fun. This film has that, and a lot of it. The greatest scene in the film is toward the end, where Snaporez crawls under a bed and comes out inside a bright beautiful carnival. He slides down a stylized rollercoaster and mentally goes through some of his life's most memorable sexual situations. This was a marvelous scene, with a beautiful carnival set, and above all, brilliantly scored by Luis Bacalov.<br><br>Overall, I have no idea who will like this film. Even Fellini fans seem to dislike it, or even hate it. I found it to be a lot of fun, and visually marvelous.","user":"Ymir4","rank":[36,51]}]