[{"title":"A Diamond In The Rough","rating":10,"date":"14 March 2005","review":"This movie is a perfect example of a film that divides people into 2 groups.. Those who get the joke and those who don't. People usually attack what they don't understand. This film has a comic style and charm that has been unparalleled since. It's a GREAT comedy.. and a GREAT romance. It's a perfect date movie. A perfect movie for someone who wants a good lighthearted laugh. And if your perspective is too tense, maybe this movie isn't for you, and you may need counseling. It is an injustice that Paramount has kept this film on the shelf since the early 80's, having never seen the light of day on DVD. Yet they feel an Urban version of \"The Honeymooners\" is a good idea. I find it odd that my two alltime favorite romantic comedies have never been released on DVD. The other being Gene Wilder's \"The World's Greatest Lover\" which Fox has sat on since the early 80's as well... Yet, \"From Justin To Kelly\" is in nearly every video store in the country. There is no Justice in the world. Maybe those who took the time to bash this will enjoy \"From Justin To Kelly\", I'm sure that one is watered enough for them to \"get\". Sometimes with age people lose their sense of humor... Or sometimes it just goes stale and they find comic satisfaction in reruns of \"Full House\".","user":"rdi210","rank":[13,19]},{"title":"One of the best professional wrestling films period.","rating":10,"date":"28 June 2000","review":"The One and only was a great film. I had just finished viewing it on EncoreW on DirecTV. I am an independent professional wrestler, and I thought this was a good portray of what life is like as a professional wrestler. Now this film was made 4 years before I was born, but I don't think the rigors of professional wrestling traveling has changed all that much. Sad, funny, and all around GREAT!!! **** 10+","user":"memberofwo","rank":[7,9]},{"title":"Hope it screened One and Only One Time","rating":4,"date":"4 September 2000","review":"Possible Spoilers:<br><br>I saw One and Only when it first came out; I am a fan of Henry Winkler but this film almost turned me into an ex-fan; Winkler plays an obnoxious, self-absorbed acting student about to graduate with no job prospects.  He does things like ruin his college play so his minor character can get a standing ovation, and try to rewrite scripts at auditions.  Winkler tries to play the character as \"brash\", but it comes across as overbearing and obnoxious in the extreme.  This movie came early in his career, and I don't think he would make the same acting choices now.   He can't seem to get a job acting, and falls into professional wrestling as a way to fame.  This is not developed to be as much fun as it sounds. His personality seems to fit the field, but success does not mellow out his character; towards the end he makes a charming statement to his fiance (who he stole with his winning personality from a pipe-smoking \"nice guy\" - big surprise):  \"If you don't stop thinking like that you're going to wind up an old single woman with a picture of JESUS on the wall!\"  said in absolute disgust.  Even to an athiest this was an offensive moment in the film; it made one want to pour a bucket of water over this girl's head for being with this ass;  and this is supposed to be a love story, with Winkler at the \"hero\".  Creeps like this don't change; and girls keeping falling for them; though that's not the point of the film.  If you can find the point, good luck.  But there are 99.9% better films at Blockbuster, and all of Winkler's other films are better.  Avoid -  unless you like watching Herve Vellachez humping furniture.  (Don't ask.)<br><br>Three out of ten stars.","user":"mercuryix","rank":[11,16]}]