[{"title":"Great story, no really.","rating":9,"date":"13 August 2002","review":"I found this on DVD -- some sort of low-budget or bootleg pan-and-scan transfer -- and since it wasn't marked very well hoped it might be the Yu Wang film. Alas it wasn't but this, I suppose the first of the three films involving the flying beekeeping hat of death, stands out on its own terms.<br><br>\nWe meet the inventor of the flying guillotine, complete with an origin scene involving a lot of chin scratching. The basic premise is that an evil emperor has a few grudges and trains a crack team of assassins who use the deadly decapitator to carry out his will (complete with a decent training sequence). A few guys on the team get hit in the conscience (with shades of Macbeth) and the story gets moving. A hero emerges, the villains reveal themselves, it's a whole lot more shaded than I expected.<br><br>Be forewarned that this isn't a film of great fight scenes. Yu Wang brought those to the flying guillotine genre later. This is an HK action flick with a plot -- more like a grainy, overdubbed Die Hard. Perhaps a shot at emulating Kurasawa or Leone without the budget and great equipment, plus an awesome metalworker with a blade fetish. There are great fights but the first kill without a clean separation of mind and body happens around the 40 minute mark.<br><br>You'll also see some nice early wire work -- the assassins bound silently atop buildings in ways that would evolve to Crouching Tiger. The fight scenes are there, they just aren't the whole point of the movie and the guys fight more like real grunts than Bruce or Jackie. The guillotines might here have been like seeing light sabers for the first time.<br><br>\nIt may not have the reputation or sense of humour of its successor, aside from the weapon itself you'll barely need to suspend disbelief, but it's heads and shoulders above most other HK films being produced at the time. In fact it's probably the reality-factor that I liked so much and I swear it reminded me of a Shakespearean plot way more than it should have. Add that up with great early effects, terrific editing, and the coolest gadget to behead a censor or two at 100 yards and you've got yourself a winner.","user":"Eli-11","rank":[13,16]},{"title":"Total classic !","rating":8,"date":"9 June 2009","review":"I like kung-fu films starring Chen Kuan Tai, but this one is special even for him. In my opinion, this is the baddest kung-fu movie ever made because of the weapon that's used and how its victims dies one after another under its nefarious power. This first and (imo) best of the Flying Guillotine sagas, has actual plot and a story for a change, and good acting and quality cinematography.<br><br>The idea is shocking, and the way its ruthlessly used is even more so, but that's what makes this film extra special good. Basically, 12 assassin ninjas who are trained to use the flying guillotine goes out killing unsuspecting victims one by one from a distance they never suspect attacks to come from. And of course all the people standing around them pee in their pants to see the head get sliced off their body.<br><br>Along with Executioner from Shaolin, this is one of the best movie Chen Kuan Tai starred in, and one of the best kung-fu action movie made in the '70s.<br><br>Watch this along with its equally high quality sequel - Flying Guillotines II (1978) where it picks up where this story left off.<br><br>Highly recommended.","user":"ebiros2","rank":[9,11]},{"title":"Heads do roll...","rating":8,"date":"28 January 2012","review":"Xin Kang (Ku Feng) is tasked by The Emperor with coming up with a new method for eliminating scholars and intellectuals (not to mention other government officials) who deviate from the Party Line. Watching jugglers in the town square, he comes up with THE FLYING GUILLOTINE. While the contraption as presented here (and elsewhere, in various other films) may be improbable, it serves its cinematic purpose. The Emperor is so impressed with it that he assigns a special squad of assassins to perfect the killing technique(s) to be employed. Ma Teng (Chen Kuan-Ti) quickly becomes a standout, but when he comes close to accidentally killing fellow assassin Ah Kun, Kun decides to get rid of Ma Teng by accusing him of plotting treason. When Ma Teng expresses qualms about the assassinations of several government officials, it's only icing on the cake for Kun. It turns out that Ma Teng isn't the only assassin having second thoughts. Xin Kang and Ah Kun go after the dissenters. \"Our heads don't belong to us any more,\" Kang says. Will Ma Teng survive, or will The Emperor's assassins take his head? THE FLYING GUILLOTINE, while it doesn't contain a LOT of fight scenes, is good, old-fashioned storytelling and well worth your time.","user":"poe426","rank":[6,7]}]