[{"title":"Wyatt Earp cleans up Tombstone","rating":14,"date":"14 July 1999","review":"MY DARLING CLEMENTINE ( rating, * * * * ½ out of 5 )<br><br>Adapted from the book 'Wyatt Earp, Frontier Marshal' by Stuart N. Lake, writers Samuel G. Engel, Winston Miller and Sam Hellman, and the great director himself John Ford, offer this most atmospheric depiction of Wyatt Earp, Doc Holliday and the most famous of shootouts in Western folk-lore.<br><br>The story basically covers the period when Wyatt Earp cleaned up Tombstone and wiped out the Clanton gang at the OK Coral. This is time-honored stuff. Nostalgic dramatizations that romanticized the Wild West while creating unforgettable heroes and notorious villains.<br><br>John Ford's handling of this motion picture is done with great care and obvious affection. Significant endeavor and attention to detail has gone into the period's reconstruction and the result is what can only be described as lyrical. A synchronous composition of sight and sound that produces a mesmerizing effect which in turn forces any viewer to fall instantly in love with this film.<br><br>Henry Fonda's portrayal of Wyatt Earp is without doubt the best that has ever been attempted and Victor Mature's Doc Holliday has him in rare form. Add cast members Walter Brennan, Linda Darnell, Ward Bond and John Ireland, and this film just crackles along.<br><br>There is one interesting irony I have noted. In John Ford's celebrated history as a director, particularly in the days when he was making silent films, the real Wyatt Earp acted as Ford's technical adviser bringing a new level of authenticity to gun play that Hollywood in the past had only guessed at. But in 'My Darling Clementine', the final shootout although well done, has a fantasy-like quality about it that avoids a sense of violent realism and adopts a surreal quality - as if seen through a dream.<br><br>Because John Ford knew all too well how to make a gunfight look believable, maybe this film allowed him to go beyond what was expected and to produce something a little special, and maybe it was shot in the way that Wyatt Earp wished it could have really happened. To successfully bend the rules, it really helps to have written them in the first place.<br><br>'My Darling Clementine' is a joy to behold. Sure, there are a few moments when minor cracks appear, but for pure entertainment value, it is unsurpassed. This movie is what going to the pictures on a Saturday afternoon was all about - those delightful matinee sessions when you'd load your arms up with confectionery, scramble for the best seats in the back row and experience the escapism that made growing up in the suburbs almost tolerable.","user":"smarty-13","rank":[68,84]},{"title":"Shakespeare In Tombstone","rating":10,"date":"25 April 2006","review":"Set amid the sweeping vistas and the towering sandstone buttes and spires of Monument Valley, this John Ford film, about Wyatt Earp (Henry Fonda) and his encounters with the Clanton gang in rowdy Tombstone, Arizona, fulfills our need to experience the Old West as mythic romanticism. The visuals are striking. El Greco skies oppress a majestic and lonesome landscape of rock, dirt, dust, and cattle. Ghostly human figures confront death in heavy rain. Indoors, small, overhead lanterns emit soft light in tough barrooms. The B&amp;W cinematography conveys a somber, moody, idealized vision of the nineteenth century American frontier.<br><br>But the film's romanticism is not just the product of adroit cinematography. The relaxed narrative weaves multiple, seemingly insignificant plot lines into a unified whole, and thus depicts the Old West as a place and time of humor, wit, religious faith, amiable conflict, even poetry and philosophy.<br><br>And so, in his heartfelt soliloquy of \"the undiscovered country\", Granville Thorndyke (Alan Mowbray), that congenial thespian rogue who quotes Shakespeare and who seems so out of place, adds texture and soul to the script, as a precursor to violence and death. This is after all ... Tombstone.<br><br>Inspired by the real life gunfight at the OK Corral, the story is less factual than suggestive. It's not just the film's fanciful portrayal of the shootout that abets credulity. It's the setting ... Tombstone is nowhere near Monument Valley.<br><br>But this is not a textbook. It is a romanticized cinematic interpretation of a long-ago culture, using a textbook incident as a premise. The film's theme centers on the nobility of outcasts and the basic goodness and humanism of frontier people. It's a broad-brush character study of historical figures like Doc Holliday (Victor Mature), Old Man Clanton (Walter Brennan), the Clanton sons, and of course Wyatt Earp and his sons. Although one could argue that Fonda lacks the tough guy strength and roughness that we would expect for a frontier legend, the casting and the acting are overall quite good. Editing, costumes, and production design also enhance the film's credibility.<br><br>Understated and meditative in tone, \"My Darling Clementine\" is a different kind of Hollywood western, one that conveys a humanistic theme with emotional depth. Characters are multi-dimensional, unvarnished, and as striking and memorable as the stately buttes and spires of Monument Valley.","user":"Lechuguilla","rank":[43,54]},{"title":"Flawless acting, direction and photography combine to produce the pinnacle of the western genre.","rating":10,"date":"28 May 2001","review":"Absolute perfection.  Without a doubt, `My Darling Clementine' has secured its place in film immortality, resting proudly at the top of the list of the finest westerns ever made.  It represents the genre at its peak and the career high point of all involved, including director John Ford and star Henry Fonda. `Clementine' achieves the difficult blend of drama, action, romance and occasional comic relief necessary to appeal to all viewers.  This is the kind of film at which Ford excelled - straightforward and powerful, sentimental but never maudlin.  It is needless to say that this is the definitive portrayal of Wyatt Earp and the gunfight at the OK Corral.  It may not be the grittiest, most penetrating or historically accurate rendition, but it mixes just the right quantities of realism, legend and Hollywood magic. Its characterizations leave no room for improvement.  Henry Fonda was born to play Earp.  His folksy, unpretentious demeanor, coupled with the hard edge of a man who must occasionally deal out justice through the barrel of his gun, produce a multidimensional performance that others approaching the role could only dream of.  With his portrayal of the tubercular Doc Holliday, Victor Mature forever shed his light image and began a series of solid dramatic roles.  Other actors have played Holliday as flamboyant and eccentric, but Mature is effective in approaching him as a fatalist who has relinquished his aspirations of greatness and now lives life one day at a time.  He forms an alliance with Earp because he has nothing better to do, and nothing else to live for.  Walter Brennan's Old Man Clanton is a study in evil personified, and will certainly shock viewers who know him only as the crotchety but lovable grandfather he played on so many occasions.  The rest of the cast is uniformly fine, featuring many members of Ford's `stock company' which followed him throughout his career. Ford's direction is strong and sure-footed.  Although this was familiar territory for him, he was careful to instill each scene with a certain degree of uniqueness so the film would never appear routine.  In this he was entirely successful, and a brief glance at his filmography confirms that this holds true throughout his body of work.  The cinematography is breathtaking.  Vast outdoor imagery and intimate gatherings of people are conveyed in an equally compelling manner.  Earp's soliloquy at his brother's gravestone, a church dance sequence and the gunfight itself are among the film's many highlights.  Only so much praise can be given in a review such as this; it must be seen to be appreciated.","user":"rmears1","rank":[71,96]}]