[{"title":"A great film that grows on you","rating":9,"date":"8 October 2004","review":"\"Kagemusha\" is one of those films which wasn't intended as a great success, yet it became that, winning the Golden Palm and giving Kurosawa back his much needed acclaim in Japan and re-establishing his reputation as the giant of Asian cinema. <br><br>Although Kurosawa himself thought of this film as a mere dress rehearsal,a preparation for \"Ran\", \"Kagemusha\" carries its own distinctive essence which makes it a work in the same category as its successor.The story deals around one of the greatest feudal lords and generals in Japan's history, Takeda Shingen, showing his unexpected and untimely demise. Although Shingen is the most powerful figure here, he is used as a monument around which everything revolves and not as the principal hero.<br><br>This film is full of sad and tragic moments, starting with Shingen's untimely death and culminating with the rebuking of his impersonator, Kagemusha. Nakadai plays the dual roles wonderfully. He is so emotionally involved in his part as Kagemusha that it seems almost uncanny. Thus we see why Kurosawa has chosen him as Mifune's successor. The other actors are also splendid and specially young Daisuke Ryu makes a startling appearance as Shingen's arch rival Oda Nobunaga.<br><br>The ending is very hard to watch, both the scene where Kagemusha is thrown out in the rain and the last scene which illustrates the death of the Takeda clan. What makes this film a pleasure to watch is the incredible cinematography and photography, specially in the incredible dream sequence where the ghost of Shingen chases Kagemusha through red clouds, as well as the hauntingly beautiful music and marvelous performances.<br><br>All in all, this is a great film that will grow on you the more you watch it. Although \"Ran\" is more spectacular and gripping, \"Kagemusha\" is more compelling because of its epic nature. 9/10","user":"ereinion","rank":[54,60]},{"title":"Another Brilliant Epic","rating":10,"date":"23 September 2009","review":"This is a great epic of war and a film of great emotion. At the center is a man who has nothing. He is thrust into a world he didn't create. He is a petty thief and really would like to just get on with his life. What he also has is great loyalty to his now deceased lord, and despite his great concern for his ability to carry it off, he agrees to the position. He has to know that at some point this will all come crashing down. The Samurai code makes it so that he has few options. He runs the war the best he can but occasionally falls victim to who he is. Even with advisers watching his every move, he becomes so much a part of the entire picture that he is left to destroy himself, and, in the process, the clan that he represents. The battle scenes are remindful of the other huge films like \"Ran\" and \"Throne of Blood.\" They sweep across the screen with the flag carrying horsemen and the infantry fighting until there is nothing left but total carnage. Because of the complexity of the story and the wonderful acting, I would put this at or near the top of my Kurosawa list.","user":"Hitchcoc","rank":[25,27]},{"title":"A Great Mature Kurosawa Film","rating":10,"date":"15 November 2004","review":"I am a fan of Kurosawa and have seen many of his films many times. There is a sweep and an ache to Kagemusha that is genuine and has remained in my heart's memory. Unlike Ran, it is not Shakespearean. Unlike Seven Samurai, my favorite all-time film and I believe the best film ever made, it is not a western. <br><br>Although epic, it is about a sweet and rueful soul swallowed by karma and history. It is redemptive without overt sentiment, and the lead performance by Tatsuya Nakadai is nuanced and unforgettable. <br><br>I will always remember this film, not for its complexity or savagery, but for the simplest moments between Lord and subject, between the highest self and the lowest self, and most particularly, the very real pain of a man caught in the vise of his own life and death.","user":"george-b","rank":[63,76]}]