[{"title":"Powerful","rating":9,"date":"5 November 2001","review":"Let's get this straight right off the bat: I have read William Faulkner's novel Pylon, and Douglas Sirk's cinematic adaptaion of it, Tarnished Angels, lives in the original's shadow. Pylon, which for some reason is the only Faulkner novel currently out of print, is one of that glorious author's best works. Still, the film is an excellent achievement. The story's power may be a bit lessened, but Sirk's direction as well as the performances of Rock Hudson, Dorothy Malone, Robert Stack, and Jack Carson make up for it. And while the plot suffers from reductions, the dialogue, much of which, I'm pretty sure, was not in the novel, is very good. The best scene in the film is Rock Hudson's drunken and passionate speech in the news room near the end of the film. In the novel, the equivalent of that speech is found in a garbage can. The final image of the novel is of the newspaper editor reading Burke Devlin's impassioned, prosaic description of the final pylon race. It's a perfect ending for a novel, but the screenwriter here was right in putting those words, or at least the idea of those words, back into Devlin's mouth. <br><br>Tarnished Angels is equal in artistic accomplishment to the other great Sirk film I've seen, Written on the Wind. Both star Rock Hudson, Robert Stack, and Dorothy Malone, but there is a big difference between the two. Written on the Wind is a florid melodrama, the kind that Sirk was famous for. The colors are almost psychedelic, and the level of melodrama makes it feel like the world is about to end. Tarnished Angles is filmed in black and white, and, while it is melodramatic, it never feels like it's going over the edge. Sirk plays it at a level where you can feel the desperation of the characters (the novel, which isn't as prudish (the film, of course, was made under the Hayes Code), depicts a level of loss and desperation that is simply murder; the ending of the film, which I wouldn't exactly call happy, is a hundred times less depressing than that of the novel). But, unlike in Written on the Wind, it never seems like Sirk is laughing at or making fun of the characters in Tarnished Angels. It seems like he meant this film to be an honest adaptation of a great novel. He succeeded quite well. 9/10.<br><br>PS: The Criterion Company recently released Written on the Wind and All That Heaven Allows on DVD. I beg them to release this one next. The version on VHS is cropped from its widescreen glory, and you can tell. It feels very cluttered and claustrophobic, and often the panning and scanning seem choppy. The opening credits keep the widescreen, and it looks like it might be an even more visually spectacular film than I noticed. I really wish that they wouldn't get my hopes up by holding the original aspect ratio through the opening credits. What I want to see one day is the word \"CINEMASCOPE\" cropped to \"EMASC\" at the beginning of a film in a 1.33:1 aspect ratio.","user":"zetes","rank":[24,27]},{"title":"The Blight Stuff","rating":10,"date":"12 April 2003","review":"Alone, during an all night boot camp fire midwatch in a huge, sepulchral building, at one o'clock in the morning I dared (had I gotten caught I'd have done a punishment tour at 'Happy Hour') to switch on the TV in the Master At Arms' office. On came the titles of 'The Tarnished Angels'.<br><br>I've been enthralled by it ever since.<br><br>It would be a revelation to get to see this film in CinemaScope, but it's one of those few films whose themes seem to be intensified by pan-and-scan: the characters' claustrophobic loneliness in a throng; the pressing anxiety of a child about his parentage; the narrowing, time-running-out bravado of the former war ace; the ache of the mechanic who can fix only aeroplanes but not his timorousness; the naked greed and lust of the depression mogul lucky to have been spared the worst of his era's depredations; the despair of the wife who followed a man and ended up jilted by his corpse, with no place to turn; and the outside-looking-in fascination, desolation, and crashed dreams of a reporter lying torpidly in a pond of bootleg hootch.<br><br>Atypical of director Sirk's opus 'The Tarnished Angels' shows his grasp of his medium in the haunting chiaroscuro of black &amp; white, and in the edgy editing of the flying scenes that furnish the only relief from - or should that be masterful exacerbation of - the confining, torturous ties and jealousies, yearnings and flailings that bind the characters in existential angst.<br><br>Not much of a plot here, but the acting is to marvel at. Robert Stack's muscular, sexy, once-genuine hero turns to tin before your eyes. Dorothy Malone's aching milk-and-honey farm girl fecundity, horse-traded libido, and lovelessness struggle against the vast flush of the Depression's The Blight Stuff toilet in which her husband's sole skill is no life preserver for his family's plunge into life-and-death, give-and-give, take-and-take despair. Rock Hudson's goodhearted reporter, yearning to find some goodness in humankind, having his search thwarted by the grinder of want and need, loyalty and betrayal, helplessness and manipulation. The mogul frustrated because his only skill is heavy-handed buying and selling (played wonderfully by Robert Middleton - in a diabolical role that makes the bargain in 'Indecent Proposal' look frivolously angelic by comparison), whose physiognomy oozes reptilian menace that cloaks his unrelievable aching to possess one immutable, beautiful, worthy thing.<br><br>'The Tarnished Angels' left me feeling as wrung out as the overstressed airframes in its hell-for-leather air race scenes, and quite a bit more grown-up than I was before I'd seen its characters rooting round in the Depression gutters of abasement and debasement.<br><br>After my midwatch, near dawn, when I tumbled into my open-bay barracks rack, I couldn't sleep. I wished for an angel to hand me a tin of BrassO for my coming-of-age, tarnishing soul.","user":"Piafredux","rank":[36,46]},{"title":"Tarnished Angels is a great film","rating":20,"date":"20 September 2005","review":"I was fortunate enough to attend a screening of \"The Tarnished Angels,\" on a wide screen with a fresh print, at the Museum of Modern Art in New York City back in 1980, with no less than Douglas Sirk himself invited by MOMA as a special guest. The film blew everybody away emotionally; Hudson, Stack, and Malone all give performances that are equally tough and vulnerable, but the grandeur of Sirk's mise-en-scene, which really has to be seen in a theater on a wide screen to be fully appreciated, is a textbook example of the art of telling a story in film terms with both force and grace. Don't mind the other reviewer; Faulkner himself, according to Sirk, said it was the best adaptation of his work he had seen in films.","user":"taguanutivory","rank":[17,23]}]