[{"title":"Classy Classic","rating":27,"date":"27 August 2004","review":"The Lubitsch Touch is evident in this witty, intelligent film. Jennifer Jones shows a vivacity and humor she had never displayed before and would not again until her clever performance in \"Beat The Devil\". In one amazing scene where she cannot resist showing her wares as a Plumber (to the disdain of the other party guests) she gets to play a reaction to the debacle that is amazing in its combination of pathos and hilarity. Very interesting character actors including a very, very funny Una O'Connor (whose dialogue consists mainly of incessantly clearing her throat), the light as a feather and dead on playing of Margaret Bannerman, and also a chance to see Helen Walker. Charles Boyer plays with his customary light touch and is the anchor to this film, but finally it is Jennifer Jones' performance that takes one breath away and stays with you long after you've seen it.","user":"StevieGunder","rank":[43,46]},{"title":"Squirrels to the nuts","rating":7,"date":"29 June 2006","review":"\"Cluny Brown\" had quite an impact on me when I saw part of it as a child. I'm sure my feelings had to do with the luminous beauty of Jennifer Jones and wanting to be just like her when I grew up. Jones has the title role of an imaginative young woman who, being the niece of a plumber, doesn't mind picking up a hammer herself once in a while and having a good whack at the pipes. It gets her into some trouble at the apartment of Hilary Ames (Reginald Sinclair) when she arrives before a party to clear out his sink before his guests arrive. There she meets Adam Belinski, a Czech academician who's on the run from Hitler. Well, that's who the very earnest Andrew Carmel (Peter Lawford) assumes he is...Belinski never actually says.<br><br>When her uncle finds Cluny drunk and on the couch at the Ames apartment, he puts her into service. She winds up working at the Carmel country estate, where Belinski comes to stay. Attracted to her, he sets about aggravating the local pharmacist, Mr. Wilson (Richard Haydn) who is courting Cluny, and getting involved with Andrew's romance with Betty Cream (Helen Walker).<br><br>This is a very sweet, light comedy from Lubitsch that touches on not only the class system in England but the attitude of the upper class toward the impending war. As in the Fox film \"This Above All,\" the upper class in \"Cluny Brown\" seems annoyed by the mere thought of war and hope the nonsense will just go away. As for Cluny, born to her class, she's expected to work and behave a certain way, though it isn't really her nature.<br><br>The performances are all very good, with Boyer a delight as Belinski, a character perhaps modeled on the Czech freedom fighter Jan Mazurek - though he basically doesn't act in danger or worried and manages to hit Andrew up for money. One is never really sure throughout the film what he's up to. Richard Haydn is hilarious as Cluny's suitor Mr. Wilson, one of the best scenes taking place when he plays the harmonium for her and she all but swoons. As his mother, all Una O'Connor does is cough, but that's all she needs to do. Playing opposite boyish Peter Lawford, Helen Walker seemed too old for the part of Betty. The other supporting players are all excellent, including Sara Allgood, Reginald Owen, and Margaret Bannerman.<br><br>David O. Selznick saw Jennifer Jones in his outer office, and it was love at first sight. It's easy to see why. She is radiant and spirited as Cluny, her vivid imagination shining through her eyes and smile. A wonderful presence - gentle, vulnerable, and guileless.<br><br>\"Cluny Brown\" isn't at the top of Lubitsch's best - it's uneven and doesn't have enough of a plot. It's entertaining nonetheless, and the ending is pure joy.","user":"blanche-2","rank":[36,40]},{"title":"JENNIFER JONES - COMEDIENNE","rating":9,"date":"1 July 2002","review":"***SPOILERS***   ***SPOILERS*** This is a little known Jennifer Jones (JJ) film because it has to my knowledge, never been seen on UK television and I have never seen a video of this film in any store or video catalogue.I got mine by bidding on \"E-Bay\" winning the auction.Fortunatly my VCR takes both US NTSC &amp; British PAL formats.Therefore viewers who have seen JJ play a variety of straight dramatic roles, will be pleasantly surprised by this tour de force comic role of her's.What a pity Selznick did not realise his wife had such comic potential in her later parts.Instead of casting her in say \"A Farewell to Arms\" (1957), he should have realised comic acting does not require an actress to be of a certain age and he could have put her in latter day Sandra Bullock type roles with great success.Comediennes can age graciously! Viewers who enjoy \"Cluny Brown\" should also see JJ's other comic role as Gwendolynn Chelm, the congenital liar, in John Huston's \"Run With The Devil\" (1954.<br><br>Ernst Lubitsch produced and directed this sparkling comedy satirising English Society, from the remote upper classes, to the fawning middle class to the working class who have to \"know their place\".Being English I do like a good laugh at my own expense.The reversed snobbery of the Housekeeper Mrs Maile (Sara Allgood) and the Butler Syrette at Carmel Manor, had me in stitches.<br><br>Charles Boyer playes a dissident intellectual Czech emigre (Adam Belinski), fleeing from Nazi persecution and who is living a hand to mouth existence in London because no-one understands or buys his arcane treatise on philosophy.He has the ability to think laterally and thinks if people want to feed squirrels to the nuts in Hyde Park instead of normally feeding nuts to the squirrels, \"who are we to say no\"? Jennifer Jones plays the title role with gusto as a plumber's niece who desperately wishes to follow her uncle's career, but Society frowns on such career moves for young ladies.Her uncle Ern (Billy Bevan) \"rescues\" her from a fate worse than death from the abode of the snobby Hilary Ames after she has fixed his blocked sink before an imminent party in honour of The Honourable Betty Cream (Helen Walker), (what we call in modern parlance a \"Sloane Ranger\" becuase of the proximity of Sloane Square in London to Knightsbridge/Chelsea - the traditional hunting ground of debutantes.<br><br>Cluny Brown is packed off by her uncle to Carmel Manor to be a humble maid and again meets Belinski.She is definitely not cut out to be a maid because she has trouble \"knowing her place\".She very nearly becomes betrothed to Wilson (Richard Haydn), the fawning, mother-fixated character who is the unimaginative local village chemist and who has no ambition whatsoever in life apart from doing exactly the same thing in the same place until the day he dies.I did however like his rendition of \"Flow on Sweet Afton\" on the harmonium!His mother (Una O'Conner) only communicates by coughing, certainly a novel method!Belinski is obviously enamoured of Cluny and tries to sabotage his rival by irritatingly ringing Wilson's shop bell then walking or hiding away \"Outrageous!\".The social gaffe comes at a tea party held by Wilson with his mother and friends who are gathered for an important and imminent announcement.Suddenly there is an ominous sound from the other room and it is evident the plumbing needs attention.The temptation is just too much for Cluny.She rolls up her sleeves and fixes Wilson's blocked sink in a \"jiffy\".Such a ,solicism cannot go unremarked and the party comes to an abrupt end.<br><br>When Belinski leaves to return to London Cluny rushes to the station to see him off.Before she knows what's happened, she too is on the train with him and has had her symbols of servitude thrown out of the carrige window by him.Belinski then talks of \"Madame Belinski\" and Cluny then realises he has just proposed \"That's the same as Mrs isn't it?\".Then Adam has an idea.Instead of writing non-selling philosophical works, he will write a murder mystery entitled \"The Nightingale Murder\" after a particularly noisy bird that kept him awake at Carmel Manor.The couple now reside in New York and the book is a great success.Evidently Cluny is now pregnant!To keep the family, Adam Belinski has obviously written a sequel \"The Nightingale Returns\".<br><br>I enjoyed every frame of this comedy.A Young Peter Lawford plays  the heir Andrew Carmel whose idea of stopping Hitler is to write a letter to the London \"Times\"!His mother explains to her future daughter in law that \"English gardens have to be planned three years ahead\", so she knew where her future duty lay.C Aubrey Smith plays his usual Hollywood colonel role as friend of the Carmel family.Delightful.","user":"m0rphy","rank":[27,31]}]