[{"title":"SIlent Reproach is Often Times a Loaded Gun!!!!!!","rating":10,"date":"10 September 2002","review":"Richard Benjamin and Carrie Snodgress are a married couple who are plagued with the preconceived notion that a prerequisite to living in Central Park West means being content with nothing!!!...Richard Benjamin is an attorney who is floundering in his attempt to be accepted into New York's intellectual circles!!!..Carrie Snodgress is a housewife who is fatigued with domestic malaise and always seems to be the scapegoat for her husband's frustrations...As a diversion, she seeks a form of social escapism by way of a gigolo...The relationship is manifested through sophisticated encounter...The gigolo is a precocious punk who gets emotionally abusive to her...As a result the wife (Carrie Snodgress) feels more isolated and confused than ever before in her life...At the end of the film, the wife finds out that her gigolo prefers the boys, and the husband is resolutely defeated by irrational conclusions in every aspect of his life...The lavish parties, the academic pretensions, and the extensive therapy are all urban subterfuges for individual insecurity!!!<br><br>The characters and the social situations are extremely well developed, especially in that they bring out the nuances as being the true culprits for this married couple's precarious existence!!!...This film makes avoidable disappointments a very emphatic reality!!... An Excellent!!!Excellent!!!Excellent!!! Excellent Film!!!!","user":"dataconflossmoor","rank":[41,47]},{"title":"A delicious bestseller makes for an adequate urban comedy-drama","rating":6,"date":"16 January 2001","review":"Carrie Snodgress is wistful, sad, conflicted, fed-up and funny playing harried NYC housewife on the verge of collapse; Richard Benjamin is her anal-retentive husband; and Frank Langella is her uncommitted lover. From Sue Kaufman's book, one of the funniest satiric novels of its era, comes this sometimes-surreal jumble by Frank Perry, who is so concerned with making a monster out of Benjamin's Jonathan that he in turn makes Snodgress' Tina look a little pathetic. The character was feistier in the book, with a (self-contained) deadpan sense of humor that Perry isn't quite able to replicate on film. This Tina has her moments--throwing her ruined Thanksgiving platter against the wall, berating Jonathan for making fun of her in front of the kids--and Snodgress is terrific, really the only reason to see the film. She overcomes the knockabout structure and obvious swipes at indifferent urbanites and makes something touching out of the material. I first saw this on television and admired a couple of scenes with Snodgress and her headstrong daughters (a beauty involved smacking her kid when she deserved it, and then going to apologize). I later rented the video and found a number of those scenes missing. Turns out they had been added to the network version to pad the picture's length from other cuts--mostly sexual ones involving Langella. This is a first: I liked the discards much better than what ended up in the actual movie. **1/2 from ****","user":"moonspinner55","rank":[17,19]},{"title":"Experiments in editing","rating":16,"date":"16 July 2004","review":"There are two different versions of this movie, one for t.v. and one on video.  They're both the same length, but they are incredibly different in tone.  On t.v., the movie is about a harried housewife who has a brief (mostly offscreen) affair as part of her attempt to make sense of her life. On video, the movie is a dark portrayal of an illicit affair, emphasizing the sexual dysfunctions of everyone involved.  If one reads the book, it is clear that both versions are unsatisfying--the best solution is a \"Director's Cut,\" like the one I made on my own, that incorporates all the scenes and brings the running time up to a tolerable 2 hrs even.  This makes it an almost perfect adaptation of the book, and a very fulfilling movie. Here's  hoping someone, someday, has the sense to release this great old film on DVD this way.  <br><br>Career-defining roles for Carrie Snodgrass, Richard Benjamin and Frank Langella, as well as a wonderful blend of humor and drama. <br><br>\nAnd the little brats are just great:  \"Why, even the salad isn't normal--mooky oranges and cut up plants!\"","user":"TonyDood","rank":[16,18]}]