[{"title":"A Classic - The Forerunner of Sketch Comedy","rating":7,"date":"7 February 2003","review":"I remember seeing this movie on U.S. Television way before Monty Python or Benny Hill.  This was my introduction to British Comedy.  I had not seen the film for about 25 years until I found it on video.  It was just as funny as when I saw it as a child!<br><br>It's funny, camp and silly.  I can watch it over and over again.  Alistair Sim in drag in a hoot!  The stereotypes are hysterical.  I believe this was the film that inspired Carry-On movies, which in turn inspired other sketch comedies.  If you can look past the fact that this movie is almost 50 years old, I strongly recommend getting a hold of it for some good, old-fashioned bawdy laughs!","user":"tmichaelny@aol.com","rank":[36,36]},{"title":"Huge fun - the finest of the series","rating":17,"date":"17 October 2004","review":"The St Trinian's film series, in which a rowdy crowd of girls, their drunken and appalling teachers, and their 'refined' headmistress (played by a man, natch), remain high in any league table of Britain's comedy moments.<br><br>In a cast headed by the superb Alistair Sim (Miss Fritton, the headmistress; and her brother, race shark Clarence) we also find Joyce Grenfell as a policewoman joining the staff undercover (and no one was better than Grenfell at this jolly hockey kind of stuff), Beryl Reid as a mannish, drunken chemistry teacher, Hermoine Baddeley and Irene Handl as memorably unsuitable members of staff, George Cole as 'flash' Harry, an odd-job man who deals with the export of the St Trinian's bathtub gin and places racing bets for the girls, and the incomparable Richard Wattis as a harassed Ministry of Education inspector. <br><br>The girls themselves include some memorable turns - Vivienne Martin as chain-smoking Bella, Belinda Lee as horny Amanda, also Barbara Windsor and Carol White are somewhere in there. <br><br>The plot revolves around a race horse, Arab Boy, who ends up in the fourth-former's dormitory; a side plot involves missing Ministers of Education, who have become part of the staff as 'the Lotus Eaters'. <br><br>Probably the funniest of the series, this film is fast-paced, furious, with some violent 'old girls', some wonderful set-pieces, and a nice script from Launder and Gilliat.","user":"didi-5","rank":[31,31]},{"title":"British fun that spawned an industry","rating":9,"date":"3 August 2005","review":"The first of five St Trinian's films (although the last is usually discounted) was based around artist Ronald Searle's schoolgirl characters, and features the wonderful Alastair Sim in drag as Millicent Fritton, headmistress, as well as her own brother. Much of the humour is dated, yet curiously touching and outrageous in today's PC world - the girls drink, gamble, smoke and are later sold off to rich Arabs, yet always remain in charge, defeating bureaucrats, police, judges and other establishment figures as they maraud across England. Perhaps because the films have been so regularly seen on TV, St Trinians still inspires fancy dress parties and club nights. The films have recurring characters that include PC Ruby Gates (Joyce Grenfell) and Flash Harry (George Cole). The precursor to the entire series is a charming film called 'The Happiest Days Of Your Life' (1950).","user":"chris-fowler","rank":[27,29]}]