[{"title":"Kay Kendall and the other Ladies In Waiting...For the King","rating":9,"date":"18 December 2005","review":"LES GIRLS is the forgotten musical gem of the last great splurge of MGM musicals in the 1950s. It's reception (judging from the other comments here) is less than overly enthusiastic, due to the script. LES GIRLS is possibly the most philosophical of the MGM musicals, because it tackles an immortal issue of mankind: \"What is truth?\"<br><br>Gene Kelly had been leading a highly successful nightclub group around Europe for many years called LES GIRLS. But he has ceased doing so, and disbanded the group. We learn that Kay Kendall has published her memoirs. She has married Leslie Phillips, a wealthy British aristocrat. In her memoirs she describes what life on the road with the act was like, and how she saved the life of fellow dancer/singer Taina Eig when the latter tried to commit suicide with gas. Taina has married wealthy Frenchmen Jacques Bergerac, and she is furious at this libel suggesting that she was mentally ill enough to try to kill herself. She brings an action in London against Kendall.<br><br>This being a George Cukor film, he will have many touches in it that are normal. One, that I note, is the justice in this trial is none other than the old Cukor favorite Henry Daniell. Daniell appeared in Cukor's films from CAMILLE (as Baron De Warvell), through THE PHILADELPHIA STORY (as Sidney Kidd), up to MY FAIR LADY (as the Prince of Transylvania at the embassy ball - he only appears in one sequence as he died on the set). Here he is just determined to have an orderly libel trial in his court. In the end, he is just as amazed and perplexed by what he hears as everyone else. Also to be noted is Patrick Macnee, playing a titled barrister.<br><br>The act being a song and dance one (with Kelly, leading the two ladies and Mitzi Gaynor) the music is from none other than Cole Porter. It was the last complete music score that Porter made for a film. It is not a bad score, but not up to the par of say SILK STOCKINGS or CAN-CAN (both composed in the early to mid-1950s). My favorite song is \"We're Ladies in Waiting\" sung by the three ladies in 18th Century costumes. The lyrics suggest King Louis has plans for them outside their normal duties.<br><br>As the film continues, Eig produces as her defense that she was not the woman who tried to kill herself. It was Kendall, and she (Eig) rescued her. So now the court and the public have two versions of the story of the \"suicide attempt\". The final witness is Kelly, who gives his account of what really happened. I won't explain it (see the film) but in revealing what he claims happened he also reveals something of the lies told by him to the two woman and Mitzi Gaynor, as well as some subterfuges he is working out with both Bergerac and Phillips regarding their personal interests in the matter. The results of his testimony settle the trial, and all parties return to their lives. We even see Kelly going home with his wife (Gaynor), who was in the court but never questioned. But now she has questions about the validity of Kelly's testimony! As they yell at each other in the back of their car, we see a man wearing a sandwich board with the eternal question: \"What is truth?\" on it. And the film ends.<br><br>It was only a handful of years before that Akiro Kurasowa's brilliant RASHOMON tackled the same problem, again in relating a legal issue (who was responsible for the death of an nobleman, and how did the nobleman die). The screenwriters certainly picked up on this perennial problem of truth and it's limits, and a courtroom happens to be the best place to show it. Who can tell if somebody has told the truth completely or partially, and if partially why partially? In looking over the issue of telling the truth, note that besides Kendall, Eig, and Kelly, the behavior of Phillips and Bergerac get scrutinized. Gaynor is also pulled in (we have Kelly's version of how and why she behaved - but we never even hear her explanations). The tactics of Macnee and his opposing counsel (and all lawyers, including his Lordship Daniell) are based on playing out certain tell-tale facts that may hide other tell-tale facts. Who, in the end can judge the truth?<br><br>It is one of Kay Kendall's best performances, with GENEVIEVE and THE RELUCTANT DEBUTANTE. She was aware, in 1957, of physical problems that she revealed to her husband Rex Harrison. Before the end of the year he knew it was leukemia, and that she was doomed. In his autobiography REX he tells how he made her last two years the happiest in her life. One would never think of the sudden end of such a funny, vibrant actress being so close seeing her with Kelly doing a song and dance duet (and a saucy one at that). For that alone, I would recommend seeing the film to think of such a promising talent that was cut so tragically short.","user":"theowinthrop","rank":[35,38]},{"title":"Girls in Cukor's hands","rating":8,"date":"1 February 2005","review":"There is a unique kind of elegance in Cukor's way to see the world. An elegance that is utterly personal. Witty, warm, enchanting. It could disguise, transform and magnify the smallest, thinnest trifle. I remember feeling my cheeks kind of numb after the film was over, not from laughing but from smiling all the way through. Cukor's reputation as a women's director was no myth. Here, the glorious Kay Kendall, in a character written with a tired left hand, shines all the same because Cukor knew and understood what made her so irresistible. She was, in the history of the movies, like a comet that flashed before us dazzling us and disappearing very fast but leaving behind a unique brand of magic. In \"Les Girls\" she even dances with Gene Kelly, wears hats and sun glasses like no one ever had before or since. She's an impossibly perfect combination of Allison Janney and Greta Garbo. This is a film that more often than not, people forget to remember. I think it's time to correct that. Rent it or buy it, switch on the weather channel, select a rainy winter Sunday, invite a bunch of friends and have a ball.","user":"arichmondfwc","rank":[57,65]},{"title":"Kay Kendall makes it a delight","rating":28,"date":"28 February 1999","review":"This would have been an enjoyable film without the enchanting comic actress Kay Kendall, but with her it's hilarious.  It's a musical comedy version of \"Rashomon\"; a trial for libel where all the principals give wildly different versions of the same events.  Gene Kelly, Taina Elg, and even Mitzi Gaynor are all fun, but it's Kendall who carries the show.  She is one of those rare performers who can make you laugh with just a look on her face, but when given something like a drunk scene she can make you weep with laughter. Who cares if she could neither sing nor dance.  Good score, too.<br><br>Sadly, Kendall made only two more films before her untimely death, what a loss to the world.","user":"otter","rank":[31,34]}]