[{"title":"Jose Larraz's recently unearthed first film","rating":1,"date":"1 March 2005","review":"This is the first film of the cult Spanish expatriate director Jose Larraz (which was lost until very recently). It is far more amateurish than his later (and better) films like \"Symptoms\", \"Vampyres\", and \"The Coming of Sin\", but it has the same basic themes--omnivorous sexual perversity played out against a background of haunting natural beauty. A Swinging London era fashion (played by Vivian Neves, who was a, um, Swinging London Era fashion model)is lured to an isolated country estate by a creepy older woman to meet her even creepier photography-obsessed nephew. She doesn't seem too perturbed to learn that a previous female model that went there has disappeared without a trace, nor does she find it strange that her first night there the aunt and nephew get her drunk and engage her in perverse game of strip poker. She almost has sex with the nephew (while his aunt secretly watches) but he isn't able to, uh, rise to the occasion. The next day he takes her into town and pays a friend to rip her clothes off and nearly rape her while he takes pictures. This doesn't seem to bother her either because soon she's involved in another bisexual three-way sex/photography session with the aunt and nephew. There is also an allusion to the old Bluebeard story--the model has been forbidden to enter the nephew's mysterious darkroom. Hmmmm. Guess what she does?<br><br>This movie was written off as a cheap sex movie when it was released, even though it doesn't really contain any more sex than any other Larraz movie. The problem is that just isn't very good. It kind of reminded of the sexy Italian giallo \"Amuck!\" released a few years later, but it lacks both the strong acting and the directorial flair of that movie. It's also hard to muster much sympathy for the protagonist as she is unbelievably stupid. And there's no doubt from the beginning that the villainous couple are the worst kind of creeps (and the actors that play them might as well be twirling their mustaches). You can see the ending coming from a mile away--the tagline and the alternative title pretty much give it away. There is also a really lame voice-over coda before the end credits, which was no doubt added to ameliorate the censors. Still this IS a J.R. Larraz movie, so it is not entirely uninteresting and worth seeing if you're a fan of the director like I am.","user":"lazarillo","rank":[22,24]},{"title":"Finally available!","rating":23,"date":"23 January 2005","review":"After many years this fine first film from Jose Ramon Larraz has finally surfaced from an online dealer.<br><br>The film itself is amazingly sleazy considering its both British (though registered in Denmark) and from the 60's, before films like EXPOSE and FRIGHTMARE became the norm. The film has many similarities to other Larraz films of the period, such as being set in rural England during the fall and featuring a severely warped family relationship.<br><br>Stars frequent Larraz favorites Karl Lanchbury (in yet another oddball role similar to those in DEVIATION, SCREAM AND DIE and VAMPYRES) and Andrew Grant (also in DEVIATION and EMMA PUERTAS OSCURAS). <br><br>Its score is by Stelvio Cipriani, who also did the score for Larraz's DEVIATION (which was VERY similar to his score for Mario Bava's TWITCH OF THE DEATH NERVE aka BAY OF BLOOD).","user":"dr_pretorius2001","rank":[10,11]},{"title":"Whirlpool","rating":3,"date":"9 October 2017","review":"A diplomatic person might call this an erotic thriller. Diplomacy is for diplomats, and no amount of tact can gloss over it. This low budget film is not total rubbish, but only if you like lesbian sex, simulated rape and the odd murder, and these are odd murders.<br><br>A woman lives in the country with her ersatz nephew who is also her bedmate, well, they do it on the floor. Sonny boy is a photographer, naturally he likes photographing attractive young ladies, and, you guessed it, frightened young ladies. Before the film starts, a girl has already been murdered - we see a flashback of that later. The lady of the house is apparently ignorant of his murderous proclivities, but someone is suspicious, namely the sugar daddy of the first girl, who gets a bit too nosey for his own good.<br><br>The man with the camera also has an ad hoc accomplice who provides the sexual assaults while he takes the pictures. What more do you need to know? The film is atmospheric, but it is very slow in places. Thankfully, justice is done at the end, although we don't actually see it, and of course it comes too late for his next victim.","user":"a_baron","rank":[4,6]}]