[{"title":"Confusing and frightening for a young kid","rating":18,"date":"18 July 2005","review":"I was perhaps seven or eight years old when I saw \"Gog\" in the 1950s. The story was only somewhat comprehensible to me; although I understood that the laboratory was some type of research facility, it was unclear to me why things were going haywire. The jet flying overhead was a mystery: where did it come from, who was in it, and what was it doing?<br><br>The scientific devices were fun to watch, especially the \"ray\" weapon. Being unable to grasp the concept of sabotage, I didn't appreciate why the device was not operating as designed. But what had the biggest effect on me was the action of the robots. Their running amok in the lab scared me to death. Maybe I picked up on the terror of the lab's occupants.<br><br>The combination of confusion and fear made watching the movie (on TV) unpleasant but fascinating. It would be fun to see \"Gog\" now, knowing what I do about the plot, the actors, and the Cold War era in which it was made.","user":"davebeedon","rank":[31,32]},{"title":"I saw this theatrically ...","rating":7,"date":"18 September 2001","review":"... and there are unforgettable images which have stayed with me, especially the horrific scene as Dr. Hubertus (Michael Fox, perfectly cast) finds himself trapped within the test chamber with the slowly oscillating window wiper, and the growing panic that follows with the grim realization that his screams for help cannot be heard. And then that stare through the glass as his spectacles ice over ...<br><br>Look for \"Gog\". There have to be copies out there somewhere.","user":"Hup234!","rank":[28,29]},{"title":"Ivan Tors put the \"Science\" in Science Fiction","rating":8,"date":"6 March 2005","review":"In my opinion this is one of the best films made by Ivan Tors. Tors created \"Science Fiction Theater\" for TV and made several SciFi films (like The Magnetic Monster) before this genre was really popular. He brought real science to the screen in plots that may seem dated today but afterall, it was 1954. In GOG, Tors brings in then brand new inventions such as jets, computers, robots, high frequency sound, cryogenics, sunlight as a weapon, electronic surveillance, atomic power and even man-made satellites (which would not become reality for 3 more years). To an audience unfamiliar with such things, it was exiting and scary. Especially scary when you were made to think such super weapons were under the control of a foreign power. The Korean War had just ended and the USSR was making aggressive comments about atomic war with us. This movie gave me nightmares for quite awhile.<br><br>-BullMoose","user":"BullMoose","rank":[41,44]}]