[{"title":"Let right be done!","rating":10,"date":"16 July 2001","review":"This is my second favorite movie of all time, after A Man For All Seasons. Both are spectacular to me because they embrace, discuss, and analyze philosophies and ideals.  Both are also spectacular because of once-in-a-lifetime leading man performances.  Scofield, quite justly, won Best Actor of 1966.  I think he his portrayal was the Best of the 20th Century -- but I digress.<br><br>Donat is equally eloquent, compelling, and vulnerable as Sir Robert Morton. Donat is, in my opinion, one of the best 10 actors ever, and has a screen presence, and an embedded sense of irony, few have ever equalled.  Sir Cedric Hardwicke and Margaret Leighton are absolutely superb in their roles as well.  And there is a marvelous dance hall cameo from Cyril Ritchard and Stanley Holloway.  <br><br>The brittle exterior of Sir Robert belies a passionate and sensitive lover of the law.  Many times actors have essayed crusty characters trying to hide their hearts of gold, this portrayal goes so infinitely beyond that it makes all others look like pale imitators.<br><br>This is a movie that demands to be seen.  The recent remake with Northam and Pidgeon was surprisingly good, but this one is pure greatness.","user":"aromatic-2","rank":[48,49]},{"title":"Enduring Greatness","rating":10,"date":"26 August 2001","review":"This is one of the greatest movies I have ever seen, and since I turn 92 next month, I have seen a fair number of movies.  Robert Donat, one of England's greatest actors ever, embodies the true-life soul of Sir Robert Morton, a high-powered attorney, who sacrificed his success for principle. Sir Cedric Hardwicke as magnificent as the accused boy's beleaguered father. Margaret Leighton's chemistry with Donat is flawless.  The dialogue by Terrence Rattigan is equally classic.  There are also wonderful small bits by Stanley Holloway, Cyril Ritchard, and Ernest Thesinger.  If you wish to see a classic English film, almost unknown in this country, rent this one, and you are in for a treat.<br><br>Incidentally, there is also a 1998 version of this movie starring Jeremy Northam and Ian McKellen.  Although it does not approach the greatness of the original, it is a more than satisfactory homage, and well worth seeing in its own right  --- AFTER you've treated yourself to Donat's classic performance.","user":"the_old_roman","rank":[57,59]},{"title":"Let right be done - a drama in early 20th century England","rating":8,"date":"28 January 2009","review":"This film kept me in suspense not knowing what the outcome would be. The acting, period atmosphere and historical recreation are all outstanding. The Winslow Boy is directed by Anthony Asquith and has a stellar cast led by Cedric Hardwicke, Robert Donat, Margaret Leighton and others. The film evokes a period of time when honour, self-sacrifice and the heavy arm of authority ruled countries such as England in the name of the common good. <br><br>The setting is the Edwardian Era of early 20th century England and into this time and place, we find a youth who has been expelled from a naval academy for stealing. The family believes he is innocent and his recently-retired father, distant from his children, ageing and afflicted with arthritis, sees an opportunity to strike a blow for his youngest child against injustice. In jurisprudence, it is called let right be done.<br><br>In this heroic effort, Arthur Winslow the father, played by Cedric Hardwicke, is backed by the strong conviction of his daughter Kate (Margaret Leighton) and Sir Robert Morton who takes on the government of the day (Robert Donat).<br><br>Thirteen-year old Ronnie Winslow is expelled from his academy for theft. The evidence against him is real but the son is adamant that he is innocent. Arthur Winslow believes his son and takes the matter to his lawyer and eventually to the Cabinet. He is paid a visit by Robert Donat, as Sir Robert Morton, a Member of Parliament, who takes up the case.<br><br>One of the most hard-hitting scenes is a ruthless cross-examination. The boy maintains his innocence and the MP leaves their home convinced of the boy's innocence. The badgering is relentless and had me on the edge of my seat as Donat hurls one accusation after another at the boy, who does not bend during the ordeal.<br><br>Sir Robert takes a shine to Kate, Arthur Winslow's daughter, who is played by Margaret Leighton. She superbly performs the role and risks her engagement by pressing the MP to proceed with the case, which has now become a national sensation.<br><br>There is a dramatic showdown in the House of Commons and the First Lord of the Admiralty, egged on by Sir Robert, agrees to let the case go to court. The final outcome has added emotion as the senior Winslow, and Sir Robert are tired and ailing. <br><br>This is an excellent period piece as well as high drama with great acting by the leading players and those in supporting roles, particularly Kathleen Harrison, the housekeeper. The era is evoked with scenes taking place on golf courses and men's clubs where politicians discuss matters of state, not to mention the churches, concert halls and railway stations. The nation's affairs are dominated by the suffragettes and the Irish question. All-round great entertainment. Highly recommend.","user":"barryrd","rank":[18,18]}]