[{"title":"This is a man's movie: ugly, violent, and pessimistic...it's great!","rating":21,"date":"21 October 2004","review":"This movie scared the hell out of me when I was little, mostly because I'd never seen an evil Ernest Borgnine. With his fierce eyes, maniacal laugh, and drop-forged fists, he commands every scene with a demonic self-assurance. You have to see this movie just to see Borgnine, he's perfect as the railway conductor. He's like a violent gorilla in a conductor suit. Lee Marvin as Number One mumbles his way through the movie with an impressive vocabulary and intelligence that belies his appearance. He wanders about waxing philosophical about the state of the world, the battle between good and evil, and his place in the grand scheme of things. Keith Carradine wouldn't have been my choice for the role of the young kid, he just wasn't very convincing and some of his lines come off a bit forced and awkward. One of the other reviewers mentioned the photography, and I'm left wondering how they got some of the shots, especially considering the movie was made thirty years ago with gigantic, bulky cameras. There are scenes where the train is way out in the middle of nowhere and the camera is actually pacing the train and the action that happens on it; great photography. This is a very good film and worthy of all the praise it gets from the other reviews.","user":"bregund","rank":[75,78]},{"title":"One of the great unsung films of the 1970's","rating":22,"date":"22 May 1999","review":"Robert Aldrich was one of the most interesting American directors of the last 40 years.  He moved with relative ease between genres and told his stories in a direct, honest style.  This film is one of the unsung gems of the seventies, part adventure film, part social drama, part road movie.<br><br>Set during the depression when riding the rails was a way of life for desperate men (and women), the film follows three characters - Lee Marvin, as Number One, a legend among the grizzled hobos congregating along the rail lines; Ernest Borgnine as Shack, the sadistic conductor perfectly willing to do whatever necessary to keep free loaders off his trains; and a young Keith Carradine as Two-Bit, a novice full of bluster and false bravado out to make a name for himself.  Marvin takes the kid under his wing; their relationship is part adversarial, as the weary elder tries to educate the fool how to survive on the line.  Looming in the background is Borgnine, out to do his job at any cost.  Ultimately a wager is made, and Marvin will put his life on the line to best Borgnine and show he is the Emperor of the North.<br><br>At times it's a very brutal film - the final confrontation between Marvin &amp; Borgnine is one of the toughest, nastiest fights ever photographed - but it is splendidly made and endlessly fascinating.","user":"Cru3","rank":[40,41]},{"title":"Love trains? See this movie!","rating":9,"date":"9 July 2006","review":"The 1970's were known for gritty, sometimes violent movies about cops and criminals (You may remember classics like Serpico, The French Connection, Dog Day Afternoon, the 7 Ups, The Dirty Harry movies). There were a few exceptions dealing with depression-era subjects (Bonnie &amp; Clyde, The Last Picture Show, Paper Moon, Days of Heaven) and this mostly unknown and unsung masterpiece with the confusing title. <br><br>I was just a teenager when this movie was released in theatres. (There were no DVD's or VHS home releases back then). I caught just a few brief commercial promos on TV advertising \"Emperor of the North Pole\" and from that moment, I was hooked and had to see it. Then, in the flash of a weekend passing it was gone, yanked from the schedule at the local theatre. Perhaps it was considered too brutish in its violence or perhaps the misleading title \"Emperor of the North Pole\" kept audiences out of the theatre. There was further confusion for years afterwards when the reissue title came out as \"Emperor of the North\".<br><br>I never did get to see it way back when, but it stayed in my memory and thankfully in the era of satellite dishes and 24 hour movie channels, it lives again for the world to see in all its glory.<br><br>For those who love steam engine trains, this movie, (along with \"The Train\" and \"Danger Lights\") is an absolute must see. Director Robert Aldrich having completed the acclaimed and commercially successful \"The Dirty Dozen\" just 6 years earlier had the resources, the artistic courage, and the benefit of working with two veteran Dirty Dozen actors (Lee Marvin &amp; Ernest Borgnine)who just lock-on to their respective characters with perfection. <br><br>The casting of this movie, (especially the minor roles of all the bo's and the railroad men) is superb. The cinematography is also fantastic and not only captures the beauty of Oregon, but a sense of the time and place of a depression-era story. Even the changing Oregon weather (alternating rainy-foggy days, with bright sunshine, is depicted accurately). The viewer can actually feel the cold of the soaking rain as the two hobos ride the passenger car. The frequent violence is brutal but a necessary part of the tale. <br><br>As for the story itself, the hobo's speak their own language in a kind of closed-society lyrical tongue that seems to be partially inspired by the depression era paintings of Thomas Hart Benton. It's not Shakespeare, but half the fun is trying to figure out what they are saying.<br><br>The music track, although it mostly works for the movie, seems oddly out-of-place with the period depicted, as it has a definite 1960's elevator-beautiful music component, at times. Not that this takes away anything from the movie, however. Similar, out-of-the-era music exists in great movies like, The Sting, Butch Cassidy and the Sundance Kid, and Ryan's Daughter.<br><br>Even the effects soundtrack is a masterpiece of tight editing that greatly adds to the enjoyment of the movie. Listen to the whistle blowing of the opposing \"mail train\" slowly growing in intensity during the scene where the two trains are highballing it to a full head-on crash. Certainly one of the most frightening moments of any \"train\" picture. This is film-making at its best.<br><br>Also appreciated... a subtle moment when a passenger train is pulling into the station and the viewer hears (but does not see) what might be typical comments from the passengers from a 1930's-era train. \"The train only stops for a few minutes\"...\"I think I'll buy a newspaper\", etc. <br><br>Emperor of the North Pole is great movie and an absolute must see if you are a fan of vintage railroading, Lee Marvin, Ernest Borgnine, Robert Aldrich, or Keith Carradine. You won't be disappointed!","user":"tdemos","rank":[38,41]}]