[{"title":"Thatcher's London through the eyes of a socialist.","rating":8,"date":"11 March 2007","review":"Released in 1988, this is Mike Leigh's (director of Vera Drake) sublime comedy which examines the social climate of 1980s London.<br><br>I really liked this film, it centres on one extended family living in London during the Thatcher years. Cyril is a Marxist, who does despite his strong values and views chooses not to act on them, giving the world up for a hopeless cause. His partner, Shirley, desperately wants a baby, despite Cyril's strong views that the world is already \"over-populated\". Living in the last council house on a now yuppie infested road is Cyril's mum. A member of the generation who has been forgotten, she is slowly losing her marbles, much to the distaste of her neighbours. And as for Cyril's sister, Valerie, who lives in the social climbing climate of the middle class, she has seemingly to forgotten her roots and family ties, no doubt due to her excessive drinking of cheap champagne and her leeching husband.<br><br>This film is a brilliant gem of 1980s British cinema, despite its clear socialist values (it's cartoonish portrayal of the rich and yuppie somewhat softens the blow of its left wing message), it brings up so many interesting questions in an intelligent manner, portraying all its characters from a variety of angles and political stances, its hard not to like Cyril, but when he criticises a young 'active' Marxist follower for planning to open a market stall, he is shown to be hypocritical.<br><br>Leigh' doesn't just direct, but also write, and the script is water tight. It is extremely witty, just full of emotion and very down to earth.<br><br>This film is a very good snap shot of life in a variety of social situations and views in the churning world of the 1980s as the capitalistic London really began to boom. It is a flick that will not doubt have you smiling from cheek to cheek, yet also leave you feeling emotionally vulnerable and self-questioning.","user":"p_adkins2004","rank":[22,23]},{"title":"sad, hilarious cross-section of England in the 1980's","rating":9,"date":"27 November 2010","review":"Mike Leigh's bittersweet social satire dissected with devastating accuracy (and a sometimes heartbreaking sense of humor) the widening gap between the haves and have-nots in Margaret Thatcher's England, moving from transparent criticism to crass parody to, finally, a touching plea on behalf of the elderly. It's a gray little film, giddy and depressing all at once, although often as funny (and just as striking) as hearing fingernails scraped down a blackboard. Leigh's cross-section of British society rings true even at its most exaggerated, and his ear for language, whether mumbled Cockney slang or nasal upper-class snobbery, is pitch perfect.<br><br>The film is essentially a showcase for some wonderfully defined characters: marginalized counterculture Marxists Cyril and Shirley; Cyril's ultra-neurotic middle-class sister and her vulgar salesman husband; an infirm old mum; a pair of callous upscale neighbors; and an odd, occasional houseguest named Wayne. The plotting is furtive: nothing much happens over the course of the film, giving the cast plenty of room to stretch out in their roles. The characters and story lines were created by the entire cast through extensive pre-production rehearsals, but the finished film is remarkably cohesive, with acting so natural it could easily be mistaken for improvisation if it weren't so well written. The result is a film of rare and genuine emotion: it's either the gloomiest comedy ever made or a tragedy with no shortage of laughs.","user":"mjneu59","rank":[11,11]},{"title":"Irony is a Dying Art","rating":10,"date":"18 April 2003","review":"This is a magnificent film full of humour, dignity and tragedy. The two most compelling characters are the hirsute courier, Cyril, and his gardener girlfriend Shirley, socialists both, who have an ongoing, symbolic debate about whether to have a baby or not. In the meantime - no pun intended - the courier's mother is dying - tired, losing her short term memory, and lonely. Other important characters include two appalling yuppies - caricatures only if you had your eyes closed in 80s Britain - plus the courier's nouveau riche but working class sister and her misogynistic husband. Karl Marx's sad big head at Highgate cemetery also makes an entry into the film.<br><br>Mike Leigh is a wonderful talent - long may his film-making continue! Postscript: Great news the film is now available on DVD - see http://www.hopscotchfilms.com.au!","user":"russdean","rank":[22,25]}]