[{"title":"how many Ford products does it take to screw in a light comedy?","rating":9,"date":"8 August 2007","review":"For what it is - a cop buddy movie - FREEBIE AND THE BEAN is the paragon. Violent action, high comedy, low humor, more car wrecks than a weekend with the Lohans, and something rare in any genre: two hours of genuine sympathy between grown men. Plus Alex Rocco. <br><br>Alan Arkin and James Caan play cops in love, an un-ironic friendship displayed with banter and charisma. Mutual appreciation and respect is palpable in every scene. (This is even more impressive in light of Alan Arkin's public denigration of working with Richard Rush and this particular film-making experience generally.) They are aided by a Laurel &amp; Hardy-meet-Lenny Bruce sensibility in the script and direction, which demands the extent of their abilities at the height of their powers. Gifted comedians both, Arkin and Caan invest the technical stuff - timing, delivery, physicality - with real emotion. It doesn't hurt that Robert Kaufman and Floyd Mutrux have given them wonderful things to say, and wonderful situations in which to say them. <br><br>Richard Rush uses a lot of carnival music, and this is not his only evidence of carny taste. He likes to titillate, shock and amaze. That's all fine, as far as entertainment goes, but Rush has aspirations. Throughout his career he's made gestures to the absurd and surreal, with mixed results. His movies often seem giddy, his hand showing on purpose, pawing in self-reflexive gesture. This kind of trapeze act doesn't always work. THE STUNTMAN, for all its many virtues, does not pull off 100% of the tricks up its sleeve. Fellini and Fosse had a surer hand for that sort of detail. <br><br>This movie aims lower and succeeds at just about every level, though careening on two wheels. The whole film feels just on the edge of out-of-control: the plot, the story, the action, all strain credibility. The cops kill people, destroy public and private property, bicker, donnybrook; the robbers preen, prance and pratfall. The jokes and the violence push the limits of good taste. And the guy on that trials bike isn't even trying to look like James Caan. But it's all part of the cuckoo world of Me Generation Hollywood, show biz kids drunk with power and roaring for approval. You can almost catch a buzz off all the cocaine blowing around the post-hippie pre-yuppie San Francisco set.","user":"rhinocerosfive-1","rank":[14,14]},{"title":"Classic 70's actioner!","rating":21,"date":"21 November 2000","review":"A mainstay on cable in the 70's, Freebie and the Bean is by no means \"great\" but it certainly is thoroughly entertaining to anyone who doesn't let political correctness stand in their way.<br><br>This is no doubt a film that can offend; the two cops (especially Caan) use muscle whenever they can; a crossdresser is treated horribly and insulted; there's some racial humor. But hey, this was made in 1974 when people simply weren't as uptight as they are now.<br><br>It's a goofy movie, it has goofy music, goofy comedy and a goofy script. The goofiness, violence and non-political correctness of this flick make for an odd mix, but it's an entertaining mix. Cann and Arkin are great in their roles, and show geniune affection and friendship for each other as they try to keep a criminal alive to break a case.<br><br>Car chase fans especially like this movie, and there are some classic chases here! The highlight chase shows the duo chasing after a blue car with some truly amazing stuntwork.<br><br>All in all if you aren't the easily offended type, and like some goofy comedy mixed with action, it's worth a spin, if only to see how movies were made when not under a watchdog's microscope.","user":"thecat72","rank":[23,27]},{"title":"The most dysfunctional buddy cop movie I've ever saw!","rating":9,"date":"28 April 2006","review":"Before Riggs and Murtaugh, or even Starsky &amp; Hutch, there's Freebie and The Bean, most in-your face buddy team of the police force. Maybe they are the laughing stock of the police force. These team make Dirty Harry want to change his ways of handling crime. These guys put the P.B. in Police Brutality! But in a funny way! Other than attacking the perpetrators they attack each other. Freebie(James Caan) is a hot-head and practical joker, while Bean(Alan Arkin) is calm in some ways just as the same as Freebie. Ford really put themselves in high gear with their vehicles, and the famous white LTD, took a lot of punishment through the movie. My favorite scenes is where the car leaped off the bridge, and made a window in someone's apartment. Calling a tow truck? HA! You better call a crane instead. While most cops work out their differences, Freebie and the Bean handle their way, they go at each others throats! This movie is funny, scary, and adventurous all together, with the choice of stars, everything was pulled off great. And how. What a comedy! While you have a chance. 4 out of 5 stars.","user":"GOWBTW","rank":[19,22]}]