[{"title":"A Nightmare on Elm Street (1984) The best slasher horror film in The Elm Street series.","rating":10,"date":"13 September 2015","review":"I am written this review In Memorie of my all time favorite the best horror director Wes Craven that sadly is no longer with us anymore. On August 30th 2015, Craven died of brain cancer at home in Los Angeles. I am doing this for him. <br><br>A Nightmare on Elm Street is a 1984 American supernatural Classic slasher horror film written and directed by Wes Craven, and the first film of the Nightmare on Elm Street franchise. <br><br>The best horror flick I have ever seen.I love this film to death, I love it!!! It is one of my personal favorite horror movies. It is my number 1 favorite film in the franchise it stays in my heart forever. I am a big fan of this film I even have a poster hang on door in my room, my girlfriend give it to me as gift. I love some other films of Wes Craven that he directed like are New Nightmare, Scream, Shocker,The People Under the Stairs, Scream 2 and Scream 3. A Nightmare on Elm Street (1984) for me will be always in the genre the best slasher classic horror film written and directed by Wes Craven. He gave us Freddy Krueger which was followed six sequels one crossover and one remake after success of the first film that gross $26.505.000 in USA. The sequel after the first film A Nightmare on Elm Street Part 2: Freddy's Revenge was refused from Wes Craven to work on the film because he never wanted or intended A Nightmare on Elm Street (1984) to become an ongoing franchise (and even wanted the first film to have a happy ending), and also because he didn't like the idea of Freddy manipulating the protagonist into committing the murders. The sequel for me wasn't a good movie after the original was released. My top 5 films of We Craven would be A Nightmare On Elm Street, Scream , New Nightmare, Shocker and The People Under the Stairs. <br><br>The first film is so original, realistic, and overall terrifying horror classic slasher flick that is actually happening in dreams, a sociopath child killer with sharp clawed glove who has knives in stead for a fingers, can enter into your dreams. If he kills you in your dreams, you're dead for real. The main protagonist is Nancy Thompson a teenager where her friends start dying and are killed one by one from Freddy Krueger, she try's to warn people from Freddy coming in to their dreams, but no one listens to her not her father the Sheriff not her mom or her friends. Her parents hold a dark secret from her long ago. She is alone in this and she has to fight him by her self by going back in to her dreams and get Freddy out of her dream in to the real world. Nancy the character was so clever, smart and intense carefully. She was awesome unique legendary heroine did you see how she put booby-traps for Freddy? Awesome!<br><br>Tina Grey played by Amanda Wyss, is really good in her role for the short time she is in this film. <br><br>Heather Langenkamp is excellent in her role as the main protagonist in this film. She's legendary unique teen heroine a very attractive,and gives 100% as Tina's friend Nancy Thompson who starts to have the same nightmares. <br><br>Robert Englund as Freddy Krueger the actor's contribution to the character is 100% superb. I think that Freddy Kruegar IS Robert Englund and vice versa, even though a lot of his moments in this film are about injecting a scary visual presence, he also creates a mystic before the film's revelation: Who is he? Where does he come from? Why is he doing these things? After the third film of the series, Englund would become a Hollywood star and a horror icon. For me Robert Englund will be the only Freddy Krueger I love him in all Nightmare films. <br><br>John Saxon as Lt. Donald Thompson, Nancy's dad was fantastic in his role and his performance. <br><br>Johnny Depp in his first role as Glen Lantz was awesome, I seriously loved him in 21 Jump Street TV Series and today I still love him in Pirates of the Caribbean film franchise. <br><br>I love the main theme Nightmare Freddy Krueger score from Charles Bernstein and I love the song at the of the credits Nightmare by 213.<br><br>A Nightmare On Elm Street (1984) is the best classic slasher film,one of the best horror movies ever made. It is one of my personal favorite horror movies. My number one favorite horror film in the franchise and it will always be the best one in the series. I have always enjoyed seeing this film, it is fast paced, entertaining, not boring or over long film, but short and very intense from the beginning till the end. I love this movie death. 10/10 Grade: Bad Ass Seal Of Approval","user":"ivo-cobra8","rank":[105,122]},{"title":"The original and best of the Elm Street series!","rating":9,"date":"8 December 2005","review":"The teenagers of Springfield, Illinois are having nightmares. Tina and her best friend Nancy learn that they're dreaming about the same creature, a hideously burned man in a dirty red and green sweater who bears an odd weapon; a glove with razor fingers. When Tina is brutally murdered in her bed one night, suspicion falls upon her volatile boyfriend Rod, who was the only other person in the room with Tina when she died. But Rod swears he didn't do it, and tells Nancy that he too has been suffering from terrible nightmares in which a knife- fingered man is trying to kill him. Nancy begins to suspect that something evil is happening within their dreams, and that perhaps the boogeyman is real. When Rod turns up dead in his jail cell, Nancy is convinced that a ghostly killer is stalking them in their sleep. Her mother, worried for Nancy's sanity, takes her to a dream clinic where her sleep patterns can be monitored. When Nancy awakens screaming from a nightmare with a bloody slash mark on her arm, she shows her mother and the doctor what she has pulled out of her dream: the battered fedora that the killer always wears. The hat bears a name tag: Fred Krueger. Nancy's mother recognizes the name and soon tells Nancy the story of a brutal child killer who had terrorized the town many years ago. When he was released on a technicality, Nancy's parents and the parents of the other nightmare-plagued children hunted Fred Krueger down and burned him alive. Fred Krueger is dead, but he's found a way to return and wreak vengeance upon the children of his killers. Nancy knows that she must find a way to stop him before he kills her and everyone else on Elm Street.<br><br>I just sat down and watched this movie again the other day and it's still damn impressive. The acting isn't always the greatest and it looks just the slightest bit dated, but it's still a really damn good movie. It's power lies in the fact that sleep cannot be avoided. In so many other horror movies, the victims are nothing more than vapid cattle wandering dumbly up the slaughterhouse chute and calling out: \"Is anyone there?\" as they go up. They purposefully get themselves into stupid and dangerous situations and therefore we feel no real pity for them when they are eviscerated. However, in A Nightmare On Elm Street, all the characters have to do to endanger themselves is to go to sleep. Even the most hardcore insomniac (like myself) knows that eventually, sleep will come for you; it is unavoidable. We cannot blame our cast for wandering around doing stupid things in their dreams, because how many of us have had dreams in which we show up for work naked? Very rarely are we in control of our dreams, and in A Nightmare On Elm Street, the only person in control is Freddy Krueger. <br><br>Robert Englund as Freddy is flawless. Before this movie was released, the boogeymen of horror films had always been hulking, silent, expressionless shapes usually hidden way behind masks. Not that there's anything wrong with that! But Englund gave us a new kind of Boogeyman - a smartass. Freddy is hideously burned, covered in scar tissue and has all the fashion sense of a wino, but he's cool. Not content to simply disembowel his screaming victims, Freddy has to tease them a little first, flirting, humiliating or showing off. He makes Tina watch him cut off his own fingers and smiles at her like a drunken uncle who's just pulled a coin out from behind her ear. He sticks his tongue in Nancy's mouth via her telephone. He doesn't waste his sense of humor on the guys in this film, but there's plenty of sequels in which he makes up for that. <br><br>This is such a great, innovative film, filled with pretty cool special effects, disturbing sound effects (including scraping metal fingernails and baby goats bleating in terror) and creepy music. The boiler room is an especially unnerving set, complete with hissing pipes and dripping chains. A young Johnny Depp and his feathery 80s hair make their debut in this film as well, and though his character is about half a million miles away from Captain Jack Sparrow, the raw talent is still very much in evidence here. <br><br>This remains the best movie of the Elm Street series, with a few good sequels and some really crappy ones. But Freddy is always worth watching.","user":"Gafke","rank":[83,97]},{"title":"A horror classic...","rating":10,"date":"7 January 1999","review":"The \"Nightmare\" has been recently on in our TV and I must admit that even after those fourteen years it made a deep impression on me. I saw the film for the first time in 1989 and at that time I was scared because I was just a teenager then. But now, I can see that the film has got something unique, which makes the film different from other horror movies. I think it`s down to the basic idea of this film - dreams and everything that can happen in our dreams sometimes become true. The authors of this film did not have to be bound with the need to stay realistic and that opens a free way to their wildest imaginations. Charles Bernstein`s music in this movie has become clasic and we can hear the basic melodic motive in some of the sequels. Original music composed by different authors in the sequels to this first Nightmare stays far far behind Bernstein`s masterpiece.","user":"Atulur","rank":[115,139]}]