[{"title":"Bully, Bully","rating":27,"date":"27 January 2002","review":"A group of crazy, violent teens makes life a living hell for a town of babies, handicapped people, blind men, and single women with nary a cop in sight when anything happens, shortly after anything happens, or even after that.  Herschell Gordon Lewis tries his hand at making a teen gang violence picture with some kind of social commentary.  But the result is a film with a very sadistic side and loads of intentional(I think they were at least) and many unintentional laughs.  Acting, a far off feeling in most Lewis films, is fairly decent here.  The youthful leads convey menace enough to hope something terrible happens to them.  The group plays all kinds of pranks...some harmless at first but then work their way up to murder and rape.  The Lewis touch is clearly evident in the relentless, unfeeling tone of the film.  It has no heart at all.  Because it has some laughs and shows some situations of intended violence hitherto unseen in any of Lewis's works, I would take a moment and see the film....just for the hell of it!","user":"BaronBl00d","rank":[10,12]},{"title":"Classic 60's JD film","rating":8,"date":"4 June 2005","review":"\"Just For The Hell of It\" has to be one of the greatest exploitation flicks I have ever seen. I wanted to see it ever since seeing the trailer a few years ago, which was basically just kids ripping stuff apart. How can you not love that? The film sets the tone quickly as almost immediately the gang destroys a roomful of furniture, even before a single word is muttered on screen. It actually takes seven minutes for any words to come out of anyone's mouth, as after the initial destruction we see a wild late 60's band, complete with guys who seemed like they influenced Angus Young with their head banging on stage.<br><br>From there, the movie is virtually non-stop as the gang goes literally from one thing to another, destroying stuff, bothering people, causing all sorts of hell. Some of the things they do are throwing buckets of water at people, hosing down a woman, ripping clothes off a clothes line, ripping up a magazine a woman is reading, and more. These scenes are completely hilarious.<br><br>The acts seem to get more violent as the film progresses, as those things progress into beating a blind man with his cane, beating an injured man with his crutches, beating an eatery owner and burning his hand (after destroying his place), and putting a baby in a garbage can while destroying the carriage (where did the mother go?).<br><br>The funny thing about all of this is that the gang does it all in broad daylight, in congested places where there are plenty of cars and people around, and of course no one does anything. Even when the gang starts beating on a bunch of little kids playing baseball in the park (in a hilarious scene where you can spot a kid or two laughing as they are being tossed around) one old lady who does see what happened, blames a guy trying to stop the gang for starting a fight with them, and has him arrested.<br><br>Then from there, things get much more violent and a little less funny as the gang adds murder and gang-rape to their mayhem.<br><br>Much of \"Just For The Hell of It\" appears to have been shot silent, with sound added later, adding to the cheesiness of the whole thing. It is funny listening to goofy 60's music as the gang commits these crimes, and they also seem to produce hammers and axes wherever they are when they start breaking stuff, despite the fact that you never actually see them carrying any weapons.<br><br>The film almost never drags, constantly going from one destructive event to another for almost the entire duration, until the last 15 minutes when things slow down a bit to build up some tension. The guys are all smart alecks and the girls are all pretty. This is a classic JD problem child flick that anyone into very cheesy low-budget stuff will get a huge kick out of. It is H.G. Lewis after all, no one does it quite like him!","user":"stevenfallonnyc","rank":[13,17]},{"title":"Unbelievable juvenile delinquent opus from H.G. \"Gore\" Lewis","rating":8,"date":"17 October 2000","review":"Shot back-to-back with SHE-DEVILS ON WHEELS, JUST FOR THE HELL OF IT is almost as good. Filled with amazing scenes of mass destruction and devilish deeds, HELL may be the ultimate j.d. film. Too bad it came a few (10) years too late!<br><br>Destruction Inc. is a leather-jacket, bike-riding teenage gang who, for the duration of the film, cause trouble for law-abiding citizens and the law. That's it. There really is no plot here, just scene after scene of crimes committed by boys AND girls.<br><br>HELL is obviously the sister of SHE-DEVILS. The cast, almost all having appeared in SHE-DEVILS, includes Rodney Bedell, Nancy Lee Noble, Ruby Tuesday, Pat Poston, a number of the men from the stud line, two of the biker chicks, and the heroine's mother! Ray Sager, who plays one of the gang leaders, later played Montag in WIZARD OF GORE! Nancy Lee Noble really deserved more roles in these types of movies. She's great in SHE-DEVILS and is good here, too. I have yet to see her in THE GIRL, THE BODY &amp; THE PILL, but she has already become one of my psychotronic favorites. On another note: the music is all from THE GRUESOME TWOSOME, with the exception of the two songs performed by the Florida garage band. I wish a CD would come out of music that Larry Wellington supervised for H.G. Lewis' films. He really aided the 60s feel of movies like this one, GRUESOME TWOSOME and SHE-DEVILS ON WHEELS.<br><br>JUST FOR THE HELL OF IT is, like I said, scene after scene after scene of mass destruction. This gets a little repetitive, but never gets dull. The main gang leader (I'm hazy on the name of the actor) seems more apt to play the good-looking hero and I would love to have seen him try that role. Not H.G. Lewis' best, but JUST FOR THE HELL OF IT is full of scenes that only Lewis would film and that 60s Florida feel that makes it indescribably fun to endure.","user":"Casey-52","rank":[10,14]}]