[{"title":"It's like The Rink, only without any skating","rating":8,"date":"19 March 2005","review":"This two-reel comedy, one of a dozen Chaplin made under his Mutual contract, offers a story line he followed time and again throughout his career: lower class Charlie fakes his way unto upper class society under an alias, fools people for a while, then wreaks havoc. Sometimes Charlie's fraud is deliberate (as in this film), while on other occasions people mistake him for something he is not, but whatever the case the idea was one Chaplin used regularly, starting with an early Keystone of 1914, Caught in a Cabaret, and recurring in other short comedies of 1915-16 such as A Jitney Elopement and The Rink. The premise turns up as late as 1940 in The Great Dictator, although in that instance the farcical aspect of the plot has turned into a darker political statement. Without getting overly analytical about the matter, it would appear that this scenario held some sort of deep meaning for Chaplin, who grew up in poverty and yet wound up wealthy and celebrated, hobnobbing with some of the most famous people in the world. Was this man insecure about the wealth and power he'd earned? It's not so far-fetched to wonder if Chaplin, recalling his roots in the London slums, might have sometimes felt like a fraud when he found himself dining with the likes of Winston Churchill, Lady Astor or Bernard Shaw.<br><br>Anyhow, getting back to the matter at hand: The Count stands as one of Charlie's lightest and most playful short comedies, perhaps not one of his very best but highly enjoyable nonetheless. There's a lot of good byplay between pint-sized Charlie and his most memorable \"heavy,\" the enormous Eric Campbell, who wears an outrageous beard this time around. Campbell plays a tailor and Charlie is his assistant, soon fired for ineptitude; but before long the former apprentice gets mixed up in the conniving tailor's scheme to impersonate a count, in order to court a wealthy heiress (Edna Purviance). I especially enjoyed the bit when Campbell explains his scheme to Charlie, and punctuates the speech with his elbow in a \"Get it?\" gesture, until Charlie finally slides a wooden chair into place to protect himself. Through various complications Charlie himself is mistaken for the count, and receives royal treatment at a grand party at Edna's mansion, while his boss is forced to serve as his assistant. The party is the setting for a number of amusing comic set-pieces, including a dinner of spaghetti and watermelon (when did you last see these dishes served together?), and a dance in the ballroom. For me, the dance is the film's highlight, as it displays Chaplin at the peak of his physical skill, sliding and gliding about with almost supernatural agility. Only Mickey Mouse could move so well, and with such comic grace!<br><br>The Count may not rank with Chaplin's greatest short comedies, but if any of his contemporaries had made this same film it would probably be regarded as something special. It's hard for me to be objective about this particular movie because The Count was one of the first Chaplin comedies I ever saw, way back in grade school, when I borrowed an 8mm print from my local library, threaded it up on my projector, and threw the beam onto a wall of my room. It was the first inkling I had that Chaplin's reputation as a great comedian was so well deserved, the first time I said to myself: \"Hey, this guy really IS funny!\"","user":"wmorrow59","rank":[9,9]},{"title":"Aristocratic Business","rating":7,"date":"25 February 2007","review":"After having seen in the \"Schloss\", \"The Count\", a film directed by Herr Charles Chaplin in the silent year of 1916, this German Count must enumerate both the accurate and inaccurate elements in order to prevent the many misunderstandings that still persist among the longhaired around the world and the provincial aristocracy, even after centuries.<br><br>Inaccurate :<br><br>· A genuine Count's secretary never accompanies his master to a ball · The free style dancing is not allowed in a ball · In an elegant and aristocratic dinner, ordinary foods such as watermelon or spaghetti never are served. · A wealthy heiress never dances with a man in civvies · A wealthy heiress usually is not young, thin or charming.<br><br>Accurate:<br><br>· The servants always cause problems for their masters · The aristocratic floors always are waxed · The aristocratic servants wear slovenly wigs · A genuine Count wears top hat and matching moustache<br><br>Those were necessary clarifications so in this way it does depict aristocratic business in the correct manner.<br><br>And now, if you'll allow me, I must temporarily take my leave because this German Count must continue in this aristocratic corporate spirit.<br><br>Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com/","user":"FerdinandVonGalitzien","rank":[8,10]},{"title":"Pretty Good Slapstick With Chaplin & Eric Campbell","rating":30,"date":"30 August 2001","review":"There's not much subtlety in \"The Count\", but there is some pretty good slapstick. Chaplin regular Eric Campbell gets a big role in this one, and he and Charlie always make a good pair of comic rivals. The settings offer some good props and comic possibilities, and the story and the cast make pretty good use of them, as well as the kind of identity mix-up that Chaplin liked to use. There is pretty good detail in some of the settings as well, making them rather interesting in their own right, as a small look into the daily life of 1916.<br><br>Chaplin and Campbell have some good moments in their series of confrontations with one another, getting into a series of antics first in a tailor's shop and then at a formal dinner. The first part moves pretty slowly at times, but then things start to pick up, and there is a rather manic finale. Edna Purviance also appears, but she does not get a lot of material to work with this time.<br><br>It's not among the best of Chaplin's shorts, but it's still worthwhile. There are no especially imaginative or innovative ideas here, but there is enough funny slapstick to make it worth seeing.","user":"Snow Leopard","rank":[8,10]}]