[{"title":"A Charming and Wistful Fantasy; Great Dialogue, and Very Fine Acting","rating":8,"date":"21 September 2005","review":"Some postmodernists have suggested this is a dramatic film. It is a satire--the sort of film where the hero cannot fail because of his/her values, ideas and ethical self-command. The central character in this well-loved feature is an man (William Powell) who has reached the age of fifty. He has a lovely wife (Irene Hervey) but he is restless; he has lost the sense of adventure in his life, and his wife is treating him as if he were \"old\". Then on a fishing trip, he catches a mermaid (Ann Blyth). She cannot talk, she has a tale and lives beneath the sea; but she does not think he is old, she finds him kind, fascinating and absorbing. Of course this fabulous find upsets his staid routine and disrupts all his relationships. He has to keep the lovely young mermaid a secret; He takes her home, where she takes a bubble bath. Andrea King all-but-steals the film; she is gorgeous, on the make for him, and suspicious that he is hiding something. A highlight of the film comes when she dons a bathing suit (she is a champion swimmer and gorgeous) and investigates the mermaid tale underwater, where Blyth bites her on the leg. Clinton Sundberg, one of the best line-readers on planet, plays a man who is giving up smoking with whom Powell has droll conversations. Art Smith plays the psychiatrist to whom he confesses his find; he is also older, and has had a fantasy of his own. Ever the practical sort, Powell tries to buy half a bathing suit, with hilarious results; he also eventually has to explain the goings on to his wife; this is a character-based adult script by Nunnally Johnson adapted from Guy and Constance Jones' novel \"Peabody's Mermaid\"; and it makes, by my lights, an unforgettable, charming and beautiful made film. Irving Pichel directed with verve and intelligence. others in the cast include Lumsden Hare, Fred Clark, James Logan, Mary Field, Beatrice Roberts, Mary Sommerville and many more in smaller roles. The film boasts fine underwater cinematography by David Horsley and Russell Mettey's usual very fine work. Original music was composed by Robert Emmet Dolan with art direction supplied by Bernard Herzbrun and Boris Leven; the difficult set decorations were supplied by talented Russell A. Gausman and Ruby R. Leavitt with costumes designed by Grace Houston. Carmen Dirigo is credited with the film's challenging hair stylings and Bud Westmore with the makeup for Lenore the mermaid and the rest of this talented and beautifully-chosen cast (a hallmark, I suggest of Nunnally Johnsons' films, since he co-produced as well as writing the script). This is not a film about someone being old; it is a wistful and intelligent look at being human, using the fantasy of a mermaid who is decidedly real as a symbol of youth itself--Mr. Peabody's youth--in which others believe or do not depending on their attitude to selfhood and individual desert. I find this film a touching and memorable screen achievement, thanks to all concerned.","user":"silverscreen888","rank":[34,35]},{"title":"Charming tale [tail] of Man meets Mermaid.","rating":7,"date":"7 September 2002","review":"The man is William Powell, reaching the age of 50 [supposedly a land mark in a man's life] and feeling in low spirits with still such an attractive wife, played by the attractive Irene Hervey, snags a beautiful mermaid while out on a fishing spree.  Of course, he is all in a dither to have caught this delectable sea creature, played with such lovely and simple sincerity by Ann Blyth, that he proceeds to bring her home, placing her in the bath tub, where she takes a bubble bath.<br><br>Mr. Powell is wonderful in these type of semi-comedy films where he can show his sensitive side as well as his impeccable timing of high class comedy. He steals the film, along with Miss Blyth, fresh from her scene stealing scenes as the bad girl in MILDRED PIERCE, who never speaks a word, but does some very intricate underwater swimming, including a water ballet that would make Esther Williams jealous.  However, Miss Blyth had a fish tail attached to her.<br><br>Other cast members include Andrea King as a delicious woman out on the make , she swims and sings] Clinton Sundberg cast in a very funny role of a man trying to give up smoking and Art Smith as the psychiatrist who examines Powell for possible lunacy in having met a mermaid only to reveal later that he, himself, had visions of a small ice skater who proceeded to skate across the window shade.  Hmmmmm! Watch for another funny scene in a ladies' apparel shop when our hero requests from the saleslady, played wonderfully by Mary Field, for half a bathing suit.<br><br>This is a first rate small film, directed by Irving Pichel and written by Nunnally Johnson, made in the 40s, when films were an escape.  And that's exactly what it does.  Charms the tail right off of you.","user":"guil12","rank":[32,33]},{"title":"Another fun fantasy flick from the 40's.","rating":8,"date":"23 April 2006","review":"I've only seen this movie a couple of times as it seems it was hardly ever shown on television and I don't know why it was so overlooked. It's not a big film and is a typical escapism fantasy fun film that were so popular in the 1940's but it's well done and deserves a look. William Powell whose days as a leading man were waning plays a man who is turning 50 and going into a mid-life crisis (Powell was in reality 56) so while on a seaside vacation with his wife away, he snags a mermaid while out fishing. A beautiful mermaid, played by the 20 year old Ann Blyth who in 1948 was breaking away from teen roles with this film and two others released that year, A Woman's Vengeance and Another Part of the Forest. This is adapted from the Constance and Guy Jones novel Peabody's Mermaid by noted screenplay writer Nunnaly Johnson who wrote The Grapes of Wrath, Tobacco Road and The Three Faces of Eve. Versitle director Irving Pichel who worked in comedy, drama, film noir, westerns and sci-fi and did such films as The Most Dangerous Game, Tomorrow is Forever, They Won't Believe Me and had just come off the sentimental The Miracle of the Bells, directs. Proliffic cinematographer Russell Metty photographs with underwater sequences filmed by respected visual effects photographer David S. Horsley. Irene Hervey and Andrea King are also in the cast. Ann Blyth looks beautiful and makes one of the best on screen mermaids ever in an unusual role. I would give this an 8.0 out of 10.","user":"johno-21","rank":[14,14]}]