[{"title":"Action packed Cantonese comedy from director Sun Chueng","rating":8,"date":"11 April 2007","review":"Sun Chung is one of the lesser known Shaw directors but he had a reputation for taut action filled serious genre films. HIs fight scenes, even with some unusual choreography, usually seem like an actual fight not a stage show. Since most of his films are unknown in the United States, each re-release from Celestial is a surprise of sorts. This is the first comedy I've seen from Sun Chung. <br><br>Wong Yu plays the brash son of a cotton dealer in a small city. He doesn't want to learn his lessons or follow his father's footsteps in the cotton business. He rather learn kung fu from a mysterious beggar living on the out skirts of town. The kid is great at kung fu but pretty stupid at everything else. He gets into trouble constantly and receives beating from his father played by Ku Feng. Meanwhile a crooked shipping firm run by Wang Lung Wei has hired the feared Red Spear gang to guard a shipment of opium and kill the police detective on the trail of the opium. It doesn't take long before the kid is in the face of the criminals and in really big trouble.<br><br>Rather light hearted for any Sun Chung film I've seen, it has a tone like similar films from Liu Chia Liang especially with the presence of Wong Yu. What is not different is Sun Chung's direction. The film is stylish but still within the Shaw tradition. The action is what make this film noteworthy. Tang Chia creates some of the best choreography I've seen from him. Many of the supporting actors are excellent martial artists but are not familiar to me. And to top it Sun Chung films the action in his usual excellent manner. Lots of different angles and image compositions.<br><br>Recommended!","user":"ChungMo","rank":[8,8]},{"title":"Convoluted plotting, but the cast is excellent","rating":6,"date":"11 December 2016","review":"KID WITH A TATTOO is perhaps one of the lesser known martial arts films from the Shaw Brothers studio. It was made in 1980 and has a relatively complex back story involving a secret assassin who hides in plain sight under a pseudonym; a brash young kung fu fighter who believes his father is said assassin; an undercover policeman hiding out in some local ruins and masquerading as a beggar; and some criminal thugs out to get their hands on any kind of wealth they can.<br><br>The story adopts the comedy action mould although the different sub-plots aren't quite as fluidly intertwined as elsewhere in this genre; it all feels a bit over the place at times and even at the climax things don't really gel all that well. It's a good job that the direction is strong and the choreography is top notch, because that takes your mind off any issues with the narrative. KID WITH A TATTOO also boasts an exemplary Shaw Brothers cast to be enjoyed. Wong Yue is the erstwhile hero and quite fun in the Jackie Chan mould; Ku Feng does his usual straight man role as the exasperated father and continues to impress.<br><br>Villainous Wang Lung Wei gets less of a look in, playing very much a stock role, but the good news is that the criminally underrated Yuen Wah has a massive role here and is excellent throughout. Wah is one of the 'Seven Yuens' and the one guy that Jackie, Sammo, and Yuen Biao all said could beat them in a fight. Best known for his later villainous turns in DRAGONS FOREVER and the like, he also appeared in a fair few Shaw films in minor roles, so it's great to see him given the limelight here. Also appearing is the fine fighter Dick Wei, another actor well known for playing henchmen in 1980s Hong Kong cinema. He's a tough cop and he burns up the screen as usual. With Wah and Wei on board, KID WITH A TATTOO is a film that can't really fail.","user":"Leofwine_draca","rank":[1,1]},{"title":"Just another good one from Shaw Brothers","rating":7,"date":"21 November 2016","review":"Wong Yu loves kung fu and is practicing with his master. There is a new weapon, the sling shot. Master is unhappy with the menu afterwards. At home, his father Ku Feng, expects him to be a scholar. Outside, Wang Lung Wei and Yuen Wah discus the opium shipment then do some kung fu. Wong Yu goes out with his buddies. He shows off his eagle tattoo and fights the snake fist guy. Later he goes to a tea house and gets into a fight with one of the opium gang. Ku Feng discovers his son has been learning kung fu. Yuen Wah kills a guy and Wong Yu is a witness. He runs but they see his eagle tattoo. Wong Yu comes to believe his dad is really a gangster. Shaw Brothers spent some money on some new sets for this movie. Back at the old temple Wong Yu brags and this attracts police attention. Captain meets with Ku Feng. He suspects Wong Yu. <br><br>The action director is Tang Chia, aka Tong Kai. This reviewer has praised Liu Chia-Liang aka Lau Kar-Leung many times as the greatest man in the history of martial arts movies. Tang Chia also deserves a mountain of praise. Born in Hong Kong in 1937, or maybe Macau, he became a martial arts student of Yuen Woo-Ping's father, Yuen Hsiao- Tieng then a martial arts instructor in his own right. His initial work as an action director was alongside Liu Chia-Liang. They both worked at Shaw Brothers then in the 1990s he turned to television just before retiring. He had a prolific career as action director of 189 films and 123 as actor. He was more prolific in the bedroom having two wives at the same time and 20 children. (Yes, this was legal in Hong Kong then.) What a man!<br><br>Since I am heaping on the praise, let's also applaud for Yuen Wah. He began martial arts training at age seven under instructor Yu Jim Yuen and alongside of Sammo Hung, Biao Yuen, and Jackie Chan (who were also about the same age). Jackie, Biao, and Sammo have all said in interviews that none of them were Yuen Wah 's match and that in a real fight or any other contest of skill Yuen Wah would beat them all.<br><br>I rate this above average and recommend it.","user":"ckormos1","rank":[1,1]}]