[{"title":"Cultic Polish sci-fi satire","rating":22,"date":"22 August 2004","review":"I must admit that I haven't seen many movies made in Poland (shame, but not many are played here...), but this one is a real gem, which achieved cult status in this region.<br><br>The story is about two men who are hibernated for 3 years for showing \"the victory of mankind over time\", but wake up 53 years later in society ruled by women. Men are extinct, all living men were killed by a bomb and the surviving women have to leave under the Earth's surface in complexes. One of the women says: \"Encounter with men are areal\". Our heroes don't panic however... they have only one goal: re-establishing somehow the old regime. Not an easy task, considering they are the only men alive, surrounded by man-hating (\"man-eating\"), fanatic women whose goal is either to naturalize or to kill them.<br><br>One can't forget that this movie was made in 1984 when communism was in its place and didn't seem to melt yet. Nowadays I wonder a bit that it was allowed to show in the cinemas, because this movie is a perfect satire of any totaliarist regime (including communism) and blind fanaticism. There is very subtle humor between the lines and this humor is what makes this movie a cult movie. However serious the theme, the movie catches the mood and the movements so easily and with such wit that you can't help but laugh. Making fun of something is the best way to criticize it and Seksmisja is a perfect example.<br><br>This movie is highly recommended for anyone in the world. Seeing it only once isn't enough... to get the whole idea and the subtler humor, you have to watch it several times. If you want to enjoy it fully, get the original Polish version with subtitles.<br><br>\"Someone hurts you? You're in trouble? You can count on Women's Council!\"","user":"varberg","rank":[92,98]},{"title":"Accidental discovery of a comic gem, plot outline, slight spoiler warning.","rating":9,"date":"8 November 2001","review":"I happened to watch this movie completely by accident, whilst flicking between channels, the title gripping my weak young mind!<br><br>The version I watched was subtitled, and I can't often be bothered with all that, but this didn't stop any of the fun. The film operates on several levels, appearing to be just an excuse for a sexist pile of nonsense, but in reality it's a very funny film with quite a bit of socio-political comment, but not too much to spoil it.<br><br>The basic plot is of two regular guys who get the cryogenic treatment, having sneaked cigarettes and a hip flask into their sleeping tubes. They are awakened many years later to find that they are the last two men on earth, an \"M-bomb\" having killed all the men in the world! The existing women all live in underground complexes and have discovered how to make babies without men, somehow. Our two fellas are allowed to live just so long as they have the offending items (between their legs) removed. They promptly escape, and run amok in the bunker, with the final result not quite what you might have imagined!<br><br>An example of a typical scene; they happen across this room which has an apple tree in it. Growing there is a solitary apple, which they pluck and bite into, and immediately spit out as it's sour. This turns out to be the last apple on the last tree in the world, and does not go down too well with the lady president.<br><br>There is some quite bizarre incidental music which did start to grate, but this is the best of all those films you trip over late at night when you really ought to have gone to bed (Moon 44 anyone?)<br><br>you'll laugh, you'll wince, you'll not hurl, but you might think.","user":"agentx2zero","rank":[49,52]},{"title":"Good sci-fi comedy","rating":9,"date":"21 October 2000","review":"I saw this movie with Danish subtitles a long time ago, and I found it very funny. It was a little difficult to find it because of its title.<br><br>There are at roughly two types of science fiction. One type focuses on the fascination with science and tries to depict the future. Another type seeks to satirize or criticize contemporary society by simplifying the problems in futuristic settings.<br><br>This movie is of the second kind. Two men are frozen down and wake up 50 years later in a society populated only by women. Not a very credible story, but that's not the point of the movie. The movie is full of funny dialogues as well as satire of questions of sexuality and the meaning of equality in contemporary society.<br><br>The movie is highly recommended. It also gets away with the special effects quite well despite a low budget.","user":"Lebech","rank":[61,67]}]