[{"title":"Great Kid-hood Memories with this One :'}","rating":8,"date":"20 November 2014","review":"The Legend of Boggy Creek - like so many 'cult classics' - is a great example of how a film can carry a low critical rating and still be awesome.<br><br>I remember seeing this film in Roger's Theater in the (then little) town of Poplar Bluff, Missouri - the nearest town to where I grew up, in very wooded, lakeside, Wappapello. So, I actually DID live in the same sort of woodsy, lakeside spookiness setting the film. Where I grew up, the word 'neighbor' meant the 'nearest house' and often you couldn't see their lights - or they may even be a nervous flashlight-trek through the pitch-black woods and along lonely, moonlit, gravel roads - and if the Fouke Monster happened to be tearing you apart out behind your place, they MIGHT hear your loudest screams. Probably not - and definitely not, if he got INSIDE.<br><br>My pal and I got brought into town by my Grandma and dropped off outside the Roger's that night. Having been lured-in by the short, terrifying trailers on TV, we anxiously bought our tickets and headed for the center-front seats, shoving and prodding each other over our mutual certainty that the other would get a scare that would make him pee his pants.<br><br>I can still remember ourselves - along with many others - cringing and ducking through several parts of this movie. As far as me and Bruce were concerned, to our eleven-year-old brains, the (then novel) documentary-like presentation and 'I-Sweah-Befo'-Gawd-Awmitey' testimony just seemed ALL too plausible - and real. We both KNEW people like those!<br><br>Leaving the theater in shudders from flashes of snarling memories - and a new and real dread of returning to the remoteness of where we both lived - we climbed into the big, crimson-velor back seat my Grandma's Delta 88, wordless and white. To us, that Fouke Monster was REAL - and not only that, but it - or one just like it - could easily be living in the endless woods behind our very own houses!<br><br>This film is a treasure for several reasons, not the least of which is the nostalgia it will hold for those of us to who got to see it at that perfect, naive age when it hits a kid exactly the way it was intended to - it's the perfect 'scary movie' for preteen sleepovers.<br><br>I can watch it now and roll my eyes, of course, but, when I reminisce back to that darkened, all-enveloping theater, so many of us gasping, crying out, grabbing our armrests and jumping in unison - and the nighttime nervousness for a week, afterward... it still makes me smile. :}","user":"topsfrombottom","rank":[16,16]},{"title":"Old, moody, and atmospheric. I like that. *** out of 5","rating":21,"date":"21 April 2005","review":"I will go ahead and say I realize that the songs featured in this movie are absolute cheese. This really takes away from an otherwise realistic documentary like film.<br><br>It's really moody and atmospheric, you really come to believe that the things you are seeing in the film are real.<br><br>There are also some very funny moments like toothless old men talking about the creature. The songs I mentioned before are a real hoot. But overall, this isn't a film I watch for a few giggles. It's quite an interesting film. I've never seen the sequels, but hope to some day.<br><br>It's not for all tastes, but for the fan of 70's horror nostalgia, it can't be missed.","user":"pumpkinhead_lance","rank":[31,35]},{"title":"A genre of its own.","rating":7,"date":"7 April 2003","review":"First things first- The Legend of Boggy Creek is in a class of its own, literally. This film is part Documentary, part Drama, part Musical(!) and 100% classic horror/speculation/fantasy, not to mention historical document (if you believe that Bigfoot's for real). But did you know that Bigfoot wasn't just tooling around the Pacific-Northwestern USA? Oh no. Apparently he likes to vacation in a little place called Fouke, Arkansas. At least he did back in the 70's when he was most active and when The Legend of Boggy Creek takes place.<br><br>\"Boggy Creek\" was a runaway low-budget smash hit in the mid 70's. Sequels tried to cash in on its success, but to no avail. Like the Blair Witch much later once the public had had its initial scare the magic was gone. I personally viewed the film at the theater during it's first release, and the kids packing the cinema ate it up, and yucked it up too, as perhaps the greatest genius of this film is that it is not only loaded with scares and suspense, and the famous monster of course, but also is loaded with (sometimes inadvertent) humor, as well as a musical score which lulls you into a sense that you are watching a harmless and serene Disney wildernesss travelogue, that's it! That's what it is. It's like \"Charly the Lonesome Cougar\" with a blood thirsty monster! <br><br>This film is one of the most remembered movies from the 70's because it was so unique and effective. It is funny, and it is pleasant to watch. It is hilariously cheap, but only with the DVD freeze-frame can you really tell that the Bigfoot is actually a guy in an gorilla costume (seriously). And since the people in the cast are purported to be the actual folks who this actually happened to, you can't fault their terrible acting either, but you sure can have a good laugh at their expense.","user":"Year2889","rank":[34,39]}]