[{"title":"Vastly underrated and hugely influential","rating":9,"date":"27 February 1999","review":"I have this theory about the horror films of Val Lewton. It is my contention that these movies caused a sea change in the content and tone of the movies of Alfred Hitchcock. The reason I say this is simple, really: Lewton is the only filmmaker I have ever caught Hitchcock cribbing scenes from. He did it twice. Once from The Seventh Victim (dir. by Mark Robson), which I swear to god provides the first half of the Shower Scene from Psycho. The second from Cat People, which provided the pet store scene in The Birds. This second scene is almost a shot for shot swipe. Both of these steals are evidence that Hitch knew and admired the Lewton movies. More than that, though, there is a change in the subtext of Hitchcock's thrillers after the Lewton movies. The movies he made before them were cut from the Fritz Lang mold of political thrillers. After the Lewton movies, Hitch's movies became more psychosexual in nature. Vertigo, for instance, could easily fit into Lewton's output.<br><br>Cat People is the first of the Lewton movies and sets the tone for them. It pretends to be about a McGuffin (serbian were -panthers), but is actually about something else (in this case, frigidity and repressed lesbianism). This represents a huge change in the evolution of the horror movie. Cat People is the first horror movie to explore these themes as central concerns rather than as sub-rosa undercurrents. It also pioneered the techniques of film noir (which as a genre didn't really exist yet). Cat People is strikingly stylized and its effect is of stranding the viewer in the middle of a darkened room with some dreadful beast circling just outside his sphere of perception. This has a hell of an impact--particularly if you have the good fortune to see this in a theater. I'm not going to claim that Cat People is one of the best horror movies ever made (it does have flaws), but it is one of the four most influential horror movies ever made (along with The Cabinet of Dr. Caligari, Psycho, and Night of the Living Dead). But unlike its brethren, its influence spreads corrosively through the entirety of cinema through both film noir and the films of Alfred Hitchcock. You would be hard pressed to find any film short of Citizen Kane or Rashomon that is nearly as influential.","user":"Chris-435","rank":[87,97]},{"title":"Absolutely amazing...","rating":10,"date":"31 January 2004","review":"More often than not, it's much better to show nothing than anything at all. Hitchcock knew this, and that's how he essentially became known as The Master of Suspense.  Had he shown Norman's \"mother\" from \"Psycho\" killing the girl in the shower in greater detail, the horror of the scene would have been more greatly ineffective as compared to just how haunting it is today.<br><br>Jacques Tourneur obviously understood this idea and used it to his advantage in \"Cat People.\"  An experienced director of cult horror films from the 30s and 40s, Tourneur's story of a woman with a mysterious background still works as a pinnacle thriller sixty years later.  Movies like this aren't made anymore--and I mean that in a literal sense.   A more modern director would use bad CGI effects to reveal the \"cat woman\" for what she is, and I can only imagine how an idea like this would translate to the screen nowadays.  But the key to \"Cat People\" is that we never even see the cat people.  We don't see anything.  We don't want to see anything.<br><br>\"A Kiss Could Change Her Into a Monstrous Fang-and-Claw Killer!\" boasted the tagline in 1942.  Of course, this is an ancient filmmaking technique for that age--symbolic of the loss of one's virginity, the essential background of the tale is rooted deeply in the nature and misconceptions of sexuality at the time.<br><br>The monogamy of it all is very subtle and, at first glance, nonexistent--but the deeper you look into the hints the clearer the signs appear.  Irena is not allowed to kiss a man or she changes into a monstrous beast.  A metaphor for loss of virginity and the result stemming from this is old folklore, and the film's use of Irena's background is more than just an explanation for her genetic traits--it is a way of creating the central idea that she lives in fear of her own background of sexuality.  It's as subtle and effective as the entire film's approach to horror.<br><br>Irena Dubrovna (Simone Simon) is a fashion artist living in New York City. Born from a Serbian background, she lives under the impression that her own family's roots lie in an ancient curse of the \"cat people\" that were thrown out of a city in Serbia hundreds of years before.<br><br>Animals do indeed react strangely to her.  She is unable to enter into a pet store, because the squawks of scared birds and the barks of sensitive dogs drown out the entire area.  It is almost as if she is truly an animal.  When she is given a pet kitten, she takes it back and exchanges it for a bird. The bird dies from fright weeks later.<br><br>When she meets Oliver Reed (Kent Smith) downtown in the city, she falls desperately and hopelessly in love, but the depression of her own fear of unleashing the cat within prevents her from coming in close contact with her own boyfriend--and eventual husband.<br><br>Left untouched by his own wife, Oliver eventually turns to his co-worker Alice Moore (Jane Randolph) for satisfaction (only lightly hinted at by the film), which ends up sparking a terrifying anger and hatred within Irena. Hounded by a curious psychiatrist (Tom Conway) and feeling like an outcast around her own husband, Irena's inner cat is indeed released and wreaks brief havoc upon those around her.<br><br>We never see the cat, and we never see Irena's transformation into another species.  But, as I said before, it's much better--and certainly more effective--this way, as the suspense and mystery of the film propels it towards repeat viewings.  The movie is even a bit like \"Ginger Snaps,\" in a way, only it's certainly more moody and suspenseful.  And there aren't any fake-looking dog puppets in this version of the tale.<br><br>It's always pleasant to watch classic movies late at night on a Friday or Saturday night. No one cares about them anymore--cheap straight-to-video movies air on television earlier than the classics.  But these are the staples of every existing genre--specifically horror, when it comes to films like \"Cat People.\"  These types of films should be appreciated much more than they have been in the past, say, sixty years.<br><br>\"Cat People\" is an amazing achievement with a distinct sense of classic horror and a good dose of suspense.  If you like horror--or if you don't--this is a must-see film, and it is certainly one of the most memorable cult horror classics of all time, led by some great performances and a very talented director behind the camera.  What a treat.<br><br>5/5 stars.<br><br><ul><li>John Ulmer</li></ul>","user":"MovieAddict2016","rank":[90,106]},{"title":"My favorite Lewton/Tourneur Collaboration","rating":9,"date":"25 January 2005","review":"At the zoo, Oliver Reed (Kent Smith) sees the mysterious Irena Dubrovna (Simone Simon), who is sketching a black panther. He's intrigued by her--it seems to be love at first sight--and is surprised when she invites him into her apartment for a cup of tea. While in her apartment, he sees an odd statue of a man on horseback, holding a sword-skewered cat high in the air. Dubrovna tells him of her native Serbia, and the legend of unchristian \"cat people\" who were driven into the mountains. Dubrovna's behavior becomes increasingly odd, and animals often react strangely to her. Could she have something to do with the legend of the cat people? <br><br>This was director Jacques Tourneur and producer Val Lewton's first horror/thriller film together (they were to do two others together, I Walked With A Zombie (1943) and The Leopard Man (1943)), and for my money, this is the best of the three. Lewton was famous for understated, atmospheric horror that suggested more than it showed, a style that is also evident in his later collaborations with director Robert Wise (who went on to direct the infamous The Haunting (1963), which is often thought to be a pinnacle of this more \"suggestive\" style, although it's not a particular favorite of mine).<br><br>So what does this mean? Well, a lot of younger horror fans, for whom the oldest film that they are really familiar with in the genre is something like The Texas Chainsaw Massacre (1974) or an even more recent film, might be reluctant to call Cat People a horror film. It is \"talky\", doesn't contain any graphic violence, and we don't even see a horror creature/villain until just a glimpse near the very end of the film. But it is horror--the talking is centered on a captivating supernatural \"myth\", there are a lot of creepy, well-photographed scenes laden with heavy shadows, there are a couple exquisite chase/suspense scenes, and there is a lot of complex, dark psychological interaction.<br><br>The psychological tension is really the focus, as Lewton and Tourneur's films together are moral parables that function more as a metaphor for horror (rather than the more common flipside, where the horror is more prominent and might be a metaphor for some other kind of philosophical point). In this case, the moral and social situations are varied and complex, but are all focused on romantic relationships, ranging from quick actions taken due to lust, to emotional distancing, adultery and abuse of power. The more one watches the film, the more one is likely to get out of the subtextual messages. They remain more subtextual than they might in modern cinema because of content restrictions imposed by studios in this era (although of course those were a reaction to prevalent cultural attitudes at the time). But in retrospect, the buried nature of the themes is a benefit, at least in this case.<br><br>Occasionally, the horrific aspect of these types of films can be too understated, so that they simply become realist dramas. That's not the case here. This is a film that is rewarding on many levels.<br><br>A 9 out of 10 from me.","user":"BrandtSponseller","rank":[55,65]}]