[{"title":"\" How did you know I had dry leprosy? . . . . I didn't\"","rating":10,"date":"29 October 2008","review":"Henri 'Papillon' Charriere, was a lifetime inmate under the French government's harsh penal system in French Guiana. In his declining years he wrote his memoirs describing his years of incarceration, his cruel mistreatment and daring, multiple escapes. Weather or not he was the actual character of his own book, is disputed to this day. But the fact that he was an inmate is true enough and fits in with the actual site which came to be known as 'Devil's Island.' Court records indicate that Henri Charriere (Steve McQueen) later called \" Papillon \" which is french for Butterfly, was indeed a minor burglar and safe cracker. His claim he was innocent of murder, may be true enough, due to an unreliable source accusing him in court, yet producing little supporting evidence. Nevertheless, the infamous thief was given a twenty year sentence, which was extended due to his numerous escapes. During his imprisonment, he becomes lifelong friends with an equally famous treasury forger named Louis Dega (Dustin Hoffman). Don Gordon (a real life friend of McQueen) plays Julot, an experienced prisoner with his own intentions of escape. Anthony Zerbe is hideously interesting as Toussaint, a ravaged leper, who aids escaping prisoners. The entire film is one remarkable story and becomes an incredible journey, one which transcends the screen and offers audiences, the raw reality of life under the most severe and brutal penal systems in the world. The infamous 'Devil's Island ' today has become synonymous with a hellish place of unspeakable conditions. A fantastic movie for those in search of true-life Classic. ****","user":"thinker1691","rank":[60,69]},{"title":"Unforgettable, fantastic film, one of my top personal favorites","rating":10,"date":"25 July 2004","review":"Papillon is one of my all-time favorites films. Steve McQueen is fantastic in the lead role. Dustin Hoffman is at his finest as Louie Dega. Very memorable, unforgettable performances, shocking action scenes and psychological thrills and twists. I cannot write enough good things about this film. After years of looking, I recently found this film on DVD and added it to my collection. This is the kind of movie that you can watch again and again and continue to see things you've never noticed before. This film never gets old and you never grow tired of watching Papillon. Some of the cast includes Vic Tayback also known as Mel from the hit TV series \"Alice.\" He is convincing as a mean, surly prison guard. Also, Billy Tumy known for his role in \"Lost in Space\" as Will Robinson, plays a young, doomed inmate. There are other character actors included in the cast that you will more than likely recognize throughout the film. I give this film the strongest and highest of recommendations.","user":"JonDavidCampbell","rank":[145,185]},{"title":"A Fine Film Which Does The Book Justice","rating":9,"date":"18 May 2009","review":"Usually, after reading a long book filled with many interesting adventures, watching a two-hour film later winds up being a big disappointment. There is no way a film can give you anywhere near the info you glean from a book, especially one over 500 pages as is the case with \"Papillion.\" Yet, despite most of Henri Charriere's incredible feats of survival, (\"Papillion\" was Charriere's nickname) this movie is above average and basically does the book justice. The movie runs about two-and-a-half hours and gives enough of a flavor to have the viewer appreciate - at least to some degree - the brutal trials and tribulations Papillion went through in real life.<br><br>If you enjoyed this film, the book is a \"must-read\" for you and very highly-recommend You won't believe all the things Charriere experienced: good and bad. In real life, the man escaped something like eight times and each time went through hell.<br><br>Steve McQueen, playing \"Papillion,\" was excellent. He was particularly good at showing the physical effects of years of solitary confinement. By the way, in real life, Charriere was much younger went sent to jail than McQueen was at the time this movie was shot. Papillion should have been played by a younger actor, but who's going to complain when you get an actor of McQueen's caliber? <br><br>Dustin Hoffman also was great as Papillion's friend, \"Louis Dega,\" who had a bigger role in the movie than he did in the book. For the most part, Papillion had a number of friends, all helping him over the years. Hoffman also provided some good comic relief to the movie and, heaven knows, it needed it. Take it from someone who has read the book: this is a grim story, worse than what you saw on screen here.<br><br>Nevertheless, thanks to the two leading actors and the wonderful work by Director Franklin Schaffner and Cinematograher Fred Koenekamp, this long film entertained. No, it wasn't the caliber of the book, but it's didn't insult it, either, and is definitely worth a look.","user":"ccthemovieman-1","rank":[51,63]}]