[{"title":"quintessential Columbia B","rating":6,"date":"2 October 2003","review":"A woman dreams of a man being murdered, and later she experiences the scene in real life. Before he made his name with the Ranown series of Westerns, Boetticher churned out a skein of low-budget programmers for Columbia and Monogram, many of them well above average. This mystery, while no masterpiece, nicely illustrates what Andrew Sarris called \"the beatitude of the Bs\". With typical B movie non-logic, the intriguing dream-coming-true angle is taken at face value and never explained. There are a couple of clever escape scenes, and the stylish 40s wardrobe (wide lapels, pin-striped suits, floppy hats) rivals the sartorial splendor of a Hawks movie. Second-string stalwart Nina Foch, more alluring than usual, gives another intelligent performance despite the plot holes. An even finer second-feature from the same director, Behind Locked Doors, has recently received mainstream video release.","user":"goblinhairedguy","rank":[27,28]},{"title":"I'm not ill and I'm not insane. And I'm certainly not the victim of hallucinations.","rating":6,"date":"19 October 2013","review":"Escape in the Fog is directed by Oscar \"Budd\" Boetticher and written by Aubrey Wisberg. It stars Nina Foch, William Wright, Otto Kruger and Konstantin Shayne.<br><br>Foch plays nurse Eileen Carr who dreams of a man being murdered only to wake and meet the man in real life...<br><br>Solid programmer out of Columbia, Escape in the Fog runs at just over an hour and gets by on its nifty spy like premise and a good sense of atmosphere. Boetticher himself would say that this early period in his career was all about a learning curve, and he shows some nice economical touches to mask the low budget nature of the production. Film is at its best when Frisco is fog bound, while the war time shenanigans amount to race against time espionage intrigue. Noir darling Foch is good value and Wright decent hero/romantic foil, and the skulduggery dealing villains are a fun product of the time. 6/10","user":"hitchcockthelegend","rank":[8,8]},{"title":"Clever, economical wartime espionage thriller set in foggy Frisco","rating":7,"date":"5 August 2004","review":"In 1945, Dutch-born actress Nina Foch had the good fortune to star in a pair of economical, satisfying thrillers.  She was a damsel in distress in Joseph H. Lewis' My Name Is Julia Ross, an updated Gothic set in England.  In Budd (then Oscar') Boettischer's wartime espionage drama Escape In The Fog, she's a dame in distress in the city by the bay.<br><br>It opens in a nightmare she's having.  Walking one fog-bound night on the Golden Gate Bridge, she sees three men piling out of a taxi trying to kill a fourth.  She screams  and the screams bring to her room in Ye Rustic Dell Inn other guests running to her aid.  One of them is the intended victim in her dream (William Wright), whom she's never before laid eyes on.  They hit it off, though, and he persuades her to join him for a few days in San Francisco.  <br><br>Their fling seems destined to be a short one, however, as Wright's a government agent who receives orders from his operator Otto Kruger to courier top-secret documents to Hong Kong.  But he's waylaid by agents of the Axis powers, led by Konstantin Shayne.  Luckily, Foch believes that her nightmare was in fact a premonition, and rushes off to the Golden Gate Bridge, this time for real....<br><br>It's not an especially memorable movie, but it's clever and atmospheric.  If its ingenuity at times seems a bit stretched, it's stretched in the (pop)corny way of Saturday matinee serials of the era.  There's of course the obligatory dose of wartime rhetoric, with much derision of `Japs,' while the Germans all speak in the most guttural tones they can reach without doing irreparable damage to the larynxes.  Still, Boettischer keeps those fog machines churning, and there's plenty of skullduggery in Chinatown at Midnight.  Not a bad way to while away an hour-plus.","user":"bmacv","rank":[16,19]}]