[{"title":"Two Words--> Critters rock","rating":7,"date":"8 May 2000","review":"and they roll and they chew and they eat and eat and eat. Darn those space people for solving the critter problem. <br><br>\nThis was one of those TV late night movies that is totally awesome because of its creativity.  Oh course while I watched it, I had no dreams of Gremlins and never connected the two.<br><br>In reality, I guess Critters are Gremlins without the Gizmos, but then again Gremlins without Gizmos are just plain mean.<br><br>and Critters are just mean....<br><br>They kill with no reason, they eat like there is no tomorrow, and even the Church cannot save the poor town's cattle.<br><br>As far as a classic, this is not, but it and Tremors are up there with the most immaginative and creative horror movies of the past few decades.","user":"ryangilmer007","rank":[39,43]},{"title":"Amusing Sci-Fi Horror Thriller with an Sense of Humor.","rating":8,"date":"3 August 2005","review":"Eight flesh eating aliens has escaped from a maximum security prison in space! These aliens are traveling to Earth to eat anything living. The Brown Family (Dee Wallace Stone, Billy Green Bush, Scott Grimes, Nadine van de Velde) are being stalked and trapped in their own farm house. The only ones that could help The Brown Family is a shape- shifting trigger happy bounty hunters that could help destroy the aliens.<br><br>Directed by Stephen Herek (Bill &amp; Ted's Excellent Adventure, Life or Something Like It, Mr. Holland's Opus) made an genuinely well made low-budget sci-fi/thriller with comedic overtones. This film was a small box office success. The film went on to be a Cult Favorite. Also starring in this film is M. Emmet Walsh as a Sheriff, Terrence Mann as the lead Bounty Hunter and Don \"Keith\" Opper as Charlie. Which Opper did some additional writing for this film. Lin Shaye from \"Kingpin\" and \"There's Something About Mary\" fame has a bit part. Watch for Billy Zane has a bit part as well.<br><br>DVD has an sharp anamorphic Widescreen (1.85:1) transfer (Also in Pan &amp; Scan) and an good digitally remastered:Dolby Digital 5.1 Surround. DVD also includes an alternate ending as a hidden feature. \"Critters\" is amusing knock-off to \"Gremlins\" but done extremely well, despite it's low budget. Written by the director and Domonic Muir. From a Story by Muir. Robert Shaye (The Then-Founder of \"New Line Cinema\") executive produced the film. This is worth seeing. Followed by Three Sequels. (*** ½/*****).","user":"hu675","rank":[21,23]},{"title":"Entertaining and fun!","rating":7,"date":"20 December 2003","review":"Critters tries to be nothing more than good entertainment and simple fun and succeeds admirably at both. Decent acting, believable characters, and an engaging story prove once again you don't have to spend tons of money to make a good picture.","user":"yossarian100","rank":[27,31]}]