[{"title":"Lotsa fun and some real thrills","rating":6,"date":"23 April 2013","review":"I reviewed this clever tribute to low-budget 1950s sci=fi flicks (most notably \"Invaders From Mars\") some years ago. Having just watched it again, I felt compelled to write it up one more time. The people who put this charming cult classic together definitely knew what they were doing: A big city college teacher (LeMat) goes searching for his missing ex-wife in a rural Midwest town, only to discover the town is populated by what appear to be very hostile aliens (for one thing, they love blowing up cars). The professor learns the aliens took over the town in the late 1950s, with our government's permission. One of the great gags in this delightful movie is that, 25 years later, nothing has changed in the occupied town. It's still full of hayseeds and sock hops and hideous American-made monster mobiles. A tabloid journalist (Allen) joins the professor in his search, and all hell breaks loose as the aliens attempt to keep their identity a secret. The supporting cast is populated by award-winning actors like Louise Fletcher, doing a variation on her legendary Nurse Wratchet (around the same time, she also appeared in a spoofy remake of \"Invaders From Mars\"), and Michael Lerner, whose woebegone character has lost his wife and kids to the aliens and has been locked away in the funny farm. The movie was clearly shot on a shoestring, with poor sound quality and way too many single takes (watch the little boy at the end put his right arm around his dad for a split second before dropping it and staring off-camera at what probably was one of his real-life parents). But the film also exhibits a unique charm and features some truly unnerving moments (dig the \"Evil Dead\" bit when the professor's dog, now a captive of the aliens, appears to rush back and forth past the professor on a lonely road, unseen but definitely there via incredible sound effects and unusual camera work. Also, some of the other effects are extremely satisfying in their crude way, such as a series of glowing orbs that hold the captive humans and the aliens' spaceship. Plus, the story's pace never slackens. There's something going on every second of this movie; there ain't no padding. The ending is utter hokum, but intentionally so, I suspect.","user":"ctomvelu1","rank":[12,12]},{"title":"A \"serious\" spoof.","rating":7,"date":"12 July 1999","review":"This movie is pays great respect to the Sci-Fi movies of the 50's, but takes itself somewhat serious. If you view this film in that sense, you will have a great time!<br><br>The special effects are on a low budget and some of the camera angles are kind of strange, but the acting and the story are what keep this film going. A pre Barton Fink Michael Lerner is here and is great as always!<br><br>Be sure to look for two cameo's from former Lost in Space stars! Also, a very early R.E.M. song can be heard in the back ground of one scene.<br><br>Again, if you watch this with the frame of mind that this is a 50's sci-fi movie made in the 80's, you will get a real kick out of it!<br><br>I give this film a B+","user":"brijess-2","rank":[31,35]},{"title":"Nostalgic Tribute to the Sci-Fi's from the 50's","rating":6,"date":"13 March 2015","review":"In 1958, in Centerville, Illinois, a spacecraft lands on the city in an alien invasion and the population vanishes.<br><br>Twenty-five years later, Margaret Newman (Diana Scarwid) leaves her daughter Elizabeth in New York with her ex-husband Charles Bigelow (Paul Le Mat), who is an entomologist and professor of Columbia, since she would go to her hometown Centerville to attend the funeral of her mother. Margaret disappears and Charles drives with his dog Louie to Centerville to seek out his ex-wife. He finds a weird population living in a typical 1958 town. While looking for Margaret, Louie disappears and Charles is attacked by an alien but he succeeds to escape.<br><br>Back in New York, Charles visits a government department directed by Mrs. Benjamin (Louise Fletcher) to report his findings but she does not give credit to his words. Charles finds a tabloid newspaper with a picture of an alien and he visits the editor Betty Walker (Nancy Allen) that discloses that she has made up the story using a photo that the newspaper received ten years ago from a lunatic. Soon Betty has a close encounter with an alien disguised as Avon Lady and is chased by them. So she teams up with Charles expecting to rescue Elizabeth from the extraterrestrial beings.<br><br>\"Strange Invaders\" is a nostalgic tribute to the sci-fi from the 50's. The naive story is very well written with humor and good screenplay. The cameo of June Lockhart and Mark Goddard from the original \"Lost in Space\" is another tribute to the series that is part of the childhood of a generation. My vote is six.<br><br>Title (Brazil): \"Estranhos Invasores\" (\"Strange Invaders\")","user":"claudio_carvalho","rank":[20,24]}]