[{"title":"A high-tech murder and cover-up thriller","rating":7,"date":"17 July 2005","review":"This film is a taut thriller and has a very good pairing of Kevin Costner and Gene Hackman in a story of a cover-up and murder. Sean Young is the tragic figure who falls for Costner and sets in motion the wheels that make this picture one of the best of its type. Plot twists and suspense are highlighted by great acting, and as the cover-up unravels, Costner finds himself in increasing danger in the halls of the Pentagon. Will Patton and George Dzunda are solid in support of the leads although Patton is a bit over the top as Hackman's attack dog. This fine film is marred by an ending that doesn't connect with the film's plot or pulse and gives the picture an awkward, unsatisfying conclusion. Costner is the hero but it is Hackman who makes this picture as good as it is.","user":"NewEnglandPat","rank":[52,67]},{"title":"Definitely underrated first-class thriller","rating":9,"date":"21 March 2007","review":"There are only a fistful movies I gave 9 points. This is one them. After watching it I immediately had an itch to watch a sequel (regrettably impossible due to the story line). Didn't actually want it to stop and was sad that it ended. (True for just a few other movies, like for example Dr. Zhivago or 12 Monkeys) When I checked the IMDb - rating composition to find out why this movie is so grotesquely underrated, I asserted that the IMDb Staff gave 8 points, anyway. (Phew!) One of the very few US-thrillers, the end of which I wasn't able to predict. Gene Hackman and Kevin Costner are habitually brilliant, Will Patton deserves an Oscar as the best supporting actor in my book.","user":"Zekarius","rank":[46,63]},{"title":"A brilliant cold war thriller that is as rivetting today as it was when it was made in 1987.","rating":28,"date":"28 February 1999","review":"\"No Way Out\" is one of the most original, suspenseful, tightly-knit thrillers ever made, comparable to John Frankenheimer's \"Seven Days in May\". Set in the Cold War era, Gene Hackman plays the Secretary of Defense, a married man obsessed with his mistress, the exquisitely beautiful Sean Young...as is her other secret lover, Costner, a Naval Admiral who is the C.I.A.'s Liaison.   When Hackman accidentally kills Young in a jealous rage, a cover-up begins to find the notorious, never-seen Russian mole \"Yuri\" who works within the Pentagon, and to frame him for the murder.  Costner is commanded to oversee the operation, and the action begins...and is sustained with the intensity of a race on the Autobahn.  The amazing all-star cast also features Will Patton, George Dzunda, Iman and David Paymer.  Costner delivers what is perhaps his most subtle performance.  What distinguishes \"No Way Out\" is its brilliant plotting, tautness, and constant surprises...with the ending being the most deliriously mind-blowing surprise of all.","user":"matahar","rank":[51,71]}]