[{"title":"Republic's last classy drama","rating":12,"date":"12 February 2004","review":"Probably one of Republic's last good films, LISBON is a feast for the eyes and a good thriller to boot. Produced in Portugal, I assume on a Republic budget subsidised by the Portugese government or tourist office, Ray Milland produces, directs and acts in  a lush and lavish romantic drama. The  music theme Lisbon Antigua was a massive  radio and disc hit in its day and it would be inetersting to know who much in boxoffice it contributed. The indoor studio scenes are very snazzy and well decorated, but some outdoor seabound back projection is wobbly. Still, the location shoot is used to excellent effect and I would say was very much influenced by To Catch A Thief, as is the whole reason for the film existing. Republic didn't make anything much of note around this (maybe only COME NEXT SPRING)and it is probably as modern and A grade as they were able to create by 1956. They folded in 1959, their market overtaken by Allied Artists, AIP and TV. It would be so beautiful to see on a cinema screen as it is in republic's NATURAMA process, their very own brand of CINEMASCOPE. Well worth finding and enjoying.","user":"ptb-8","rank":[24,29]},{"title":"Thin on story, but with great players who make it work","rating":6,"date":"5 October 2016","review":"This obscure adventure romance from Republic may be thin on story but is, at least, distinguished by its lovely Technicolor photography shot on location in the title city and the pedigree of its Hollywood veteran cast, Ray Milland (who also directed), Maureen O'Hara and Claude Rains. The film is further blessed with a light, engaging Nelson Riddle song, \"Lisbon Antigua,\" which plays throughout the proceedings. The Riddle song was a radio hit at the time, and is still pretty easily recognized.<br><br>The story involves Milland as a smooth operating smuggler (his operations are always kept vague) hired by suave well bred scoundrel Rains to pick up a \"package\" from an American just arrived in the city (O'Hara) which will involve her kidnapped wealthy husband. The story is neither here nor there, really. The combination of visual pleasures, Riddle's musical score and a capable cast of veterans may be enough for some viewers to want to spend an hour and a half of their time with this fairly inconsequential enterprise.<br><br>Rains is always fun to watch with his velvet voice, as a suave sophisticate who is also moral corruption incarnate. He seems to be almost playing his part in his sleep this go round but a Claude Rains asleep is still a great deal more entertaining than many other actors awake.<br><br>At one point in the film Rains delicately makes reference to O'Hara of how lovely she looks and how even more lovely she would look should something unforeseen \"happen\" to her millionaire husband, with he, Rains, receiving a small portion of her inherited good fortune. O'Hara is shocked and outraged by the suggestion, calling him a monster. Rains, realizing his faux pas, quickly regroups, saying that \"in my own clumsy fashion\" he was merely attempting to pay her a small compliment for not yielding to an idea to which a less scrupulous woman might succumb.<br><br>As Rains hints at the implications of a murder he could arrange, a small smile constantly dances across his lips. His expression could almost be that of a wine connoisseur discussing a rare vintage very much to his liking. It's a small, almost throwaway moment in the film, but it's a pleasure to watch the effortless aplomb that Rains brings to the scene.","user":"AlsExGal","rank":[11,12]},{"title":"Beautifully filmed romantic crime thriller.","rating":8,"date":"30 January 2002","review":"Elegant is the only word to describe this wonderful example of 1950s film-making at its best.  Art direction is usually one of those obscure technical credits nobody ever bothers about, but in this case the entire movie is a feast for the eyes thanks to clever art direction using subtle shades of blue and brown to reflect the beautiful natural locations in Portugal.  Almost every frame is a painting in its own right and the movie is worth watching just for its sumptuous looks alone.<br><br>Against this delightful visual backdrop, a complex double/triple-cross crime story is allowed to unfold at a leisurely pace as the viewer is gradually let in on the intricacies of the plot.  Characters and motives also develop with the story and by its conclusion little is what it first seemed. Claude Rains, Maureen O'Hara and Ray Milland (who was also director and associate producer) are each excellent in their roles.  Claude Rains in particular as a raffishly handsome crime boss with impeccable breeding is both lovable and chilling.  Ray Milland has all the women falling at his feet, and not without reason.  Maureen O'Hara is alternately tough and romantic as we see her character gradually revealed.<br><br>Movie buffs might even see some tongue in cheek allusions to the plot of Casablanca, particularly in the final scene, as this cleverly crafted story unfolds.  There's certainly something to please everyone.  I'm a person who rarely enjoys movies made in the 1950s because of the stifling social values of the era, but for me Lisbon has been a revelation of the artistic heights which could be achieved in that era when the movie makers stopped trying to preach political and social values and just did what they were good at.","user":"Neil-117","rank":[27,34]}]