[{"title":"Vintage Fun","rating":7,"date":"9 August 2002","review":"Lookit, I know the humour is lame, and the plot is standard fare, but lets call a spade a spade. When this film came out, it had no intention of setting the world on fire, or raking in hordes of Oscars...it's just a teen movie.<br><br>I am a child of the 80s. In fact, Spring Break holds a very dear place in my heart as it was the first \"R Rated\" film I ever saw (I was 14 at the time) and it was merely fuel for my raging hormones, which was all it was supposed to be. There were millions of movies just like this in the 80s. However, as lame as this film could be considered, I strongly feel that the teen films we see now are far worse. At least the acting in this film is good (the actors did well with what they had to work with).<br><br>If nothing else, it's great to watch and remember our (fleeting) youth. I just got it on video and was afraid to watch it for fear that it was much worse than I remembered (after all, it WAS 1983 when I saw it last...19 years ago!!!). I must admit that I was pleasantly surprised. What more, even through all the bad hair and a wardrobe that makes us cringe and say \"What were we thinking\", the girls are still very beautiful and REAL!!! Nary an implant in sight!<br><br>Another highlight: .38 Special's \"Caught Up In You\" used in a great spot for the soundtrack.<br><br>Yeah, it's another 80s teen-geek-gets-laid-and-becomes-cool flick, but it's a good one!","user":"wdeadder","rank":[23,24]},{"title":"1983 Brainless Spring Break Fun With Heart","rating":6,"date":"14 July 2005","review":"Charming Ft. Lauderdale spring break film from 1983. Would this movie ever win any awards for cinematic excellence? Not a chance. But then it never tries to be anything other than what it is; mindless spring break fun circa-1983, but with a difference. The movie has heart, treating its likable leads in a positive way rather than depicting them as the stupid, sex-crazed, goofs that most films of the time seem to prefer. In short, there are a LOT less worthwhile ways to spend 101 minutes.<br><br>Although this was my era, I never experienced spring break while in college myself (much to my ever-lasting dismay). But movies like this allow those of us spring break wannabe's who missed out, a way to share in the fun.<br><br>DON'T bother watching if you are looking for a deep, filmatic experience. Instead, simply celebrate the era and enjoy the good \"clean\" fun that was Florida's spring break, before 'girls gone wild'!","user":"msdemos","rank":[11,12]},{"title":"Great Film!","rating":4,"date":"4 June 2001","review":"I LOVED this film!  It is such a reminder of the great teenage sex films of the 80's.  HBO used to show this almost 24/7 and I still watch it everytime I can.  Most people probably dismissed this film as being nothing more than another 80's \"teenage coming of age\" movie, but it really is more!  Look at MTV's Spring Break yearly specials and \"reality\" shows.  You'll see how much things REALLY have NOT changed.  It should be noted that Steve Bassett who was an actor in this film went on to become one of the most loved actors in the daytime drama \"As The World Turns\" in the role of \"Seth Snider\" for many years.  If you catch this film, watch it an relive the 80's fun all over again!  And by no means, Don't Burn It!","user":"crushin","rank":[7,7]}]