[{"title":"The most underrated movie of the 1970s?","rating":30,"date":"30 April 2003","review":"Bob Rafelson and Jack Nicholson's creative relationship began because of The Monkees. Rafelson directing and Nicholson writing their weird and wonderful psychedelic cult classic 'Head'. After that the two teamed up for one of the early Seventies best loved movies 'Five Easy Pieces'.  A couple of years later they did it again with 'The King Of Marvin Gardens', though inexplicably it doesn't have the reputation or the high profile of their previous collaboration. I really fail to see why. File it under \"great lost 1970s movies\" alongside 'Scarecrow', 'Bring Me The Head Of Alfredo Garcia', 'Tracks', 'Fingers' (and add your own personal favourite to the list). Marvin Gardens features a really strong and controlled performance from Nicholson in the lead role, an introverted DJ with a show in which he spins \"true\" tales. But even better than Nicholson is Bruce Dern, a wonderful actor who never became a superstar like Nicholson, Pacino or De Niro, despite a long career of consistently good character roles in movies by Hitchcock, Roger Corman, Walter Hill, Hal Ashby, John Frankenheimer, Elia Kazan, Sydney Pollack and many others.  Dern is absolutely wonderful as Nicholson's brother, a dreamer and Mob hanger on. He comes back into his brother's life with a nutty get rich quick scheme which ends up going horribly wrong. This is one of the very best performances by Dern I've ever seen, and his scenes with Nicholson make this essential viewing for any 1970s buff. Added to that are excellent performances from Ellen Burstyn ('The Exorcist', 'Alice Doesn't Live Here Anymore') and newcomer Julia Anne Robinson (her only movie role - too bad!) as the women in Dern's life, and nice bits from legendary musician/actor Scatman Crothers ('Black Belt Jones' and appearances in no less than four 1970s Nicholson movies) and the underrated John P. Ryan ('Runaway Train', 'It's Alive', 'Class Of 1999'). 'The King Of Marvin Gardens' is a slow and thoughtful movie, but once you get into the rhythm of it, an extremely rewarding one. One of Nicholson's best, and Dern is just dynamite. Highly recommended.","user":"Infofreak","rank":[57,67]},{"title":"A great and unusual film","rating":8,"date":"13 April 2004","review":"A truly great film and sadly overlooked and under rated, following up Five Easy Pieces and showing Nicholson at his most awesome.  A far better take on Atlantic City than the Louis Malle's film of that name.  Incredible acting from Nicholson, Dern, Burstyn... great direction and cinamatography.  The movie is set in a pre-casino Atlantic City, sort of Coney Island perfected. A real actors film that we rarely see anymore.  Perhaps difficult to watch because of that yet immensely rewarding.  A film that perfectly captures the time and place.  Dern plays an over the top hustler while Nicholson, of all things, plays an intellectual radio dweeb.  Go on... see it...  \"no one reads anymore...\"","user":"cornishchristopher","rank":[34,43]},{"title":"An unusual vision of American pessimism","rating":7,"date":"16 June 2013","review":"It's hard to imagine Jack Nicholson appearing in a film like 'The King of Marvin Gardens' today. The movie is a story of an introverted broadcaster and his hustling brother; there's an air of seediness to the portrait of a run-down, early 1970s, east-coast America; of doomed hopelessness about the the huckster's implausible vision; and of a terrific sadness in the way that the broadcaster finds a touch of glamour and excitement in hanging out with his brother for a while, although the two of them have nothing in common and surely nothing is actually going to turn out right. I've heard it said that Saul Bellow's 'The Adventures of Augie March' is the great American novel because of its optimism; but this is another side of America, post-Vietnam war, a world of fraudsters, impossible dreamers, and those just hunkering down to survive. As a film, and certainly as entertainment, it's weaker than Nicholson and director Bob Rafelson's earlier 'Five Easy Pieces', primarily because Nicholson's character here is fundamentally less interesting: it's a correctly restrained performance from Jack, but playing a man who has little capacity for change, and constrained by a story that's low-key painful, rather than exciting. Yet even if this is not a fun movie, it's a telling one. Pessimism, like optimism, remains part of the American landscape, as it is in every country; but it's a shame that it's been written out of the contemporary Hollywood vision.","user":"paul2001sw-1","rank":[11,12]}]