[{"title":"I Know It's A Bad Movie, But I Love To Watch It!","rating":4,"date":"4 January 2001","review":"I just bought a copy of Zapped for $5 and watched it for the first time in several years the other day.  All the reviews you will read for the movie here sum it up.  It's a bad story, with bad actors, with bad acting, with bad special effects and I enjoy it every time I watch it.  I don't know why because I've never liked Scott Baio or Willie Aames in anything else they did, but they click here.  I also think Felice Schacter was a cutie in the picture.  I always make the comparison to WKRP in Cincinnati when I watch this picture.  Felice is Bailey Quarters and Heather Thomas is Loni Anderson's Jennifer (and I preferred Bailey by far).  I always got a kick out of Scatman Crothers and he has some great lines in this movie as does LaWanda Page (from Sanford and Son fame).  And don't forget the movie industry's biggest geek, Eddie Deezen, who makes an appearance.<br><br>As another reviewer put it, watching Zapped is a guilty pleasure.  if that's the case, I probably belong on Death Row!  If you want to clear your mind of all thoughts and don't want to do it with chemicals, pop in Zapped and enjoy!","user":"Kevin1963","rank":[18,20]},{"title":"Best Baio Film Ever","rating":10,"date":"8 December 2004","review":"I believe I'm one of the few people who are huge fans of this movie. It's not a great movie but it excels in it's 1980's cheesy-ness. Forget John Hughes and St. Elmo's Fire, if you are looking for the quintessential teen movie, it's Zapped. Scott Baio gets hit on the head and gets telekenisis powers, Willie Ames is with him as always, Scatman Crothers gets high and rides a bike through a field, girls shirts rip off. I have devoted my life to make sure as many people see this movie as possible. And the song they play at the prom, \"Got To Believe In Magic\" by David Pomeranz. It's beautiful, I've used it in video projects and a play I directed. It's a horrible movie but it's not in the so bad it's good category. It's a movie I can watch repeatedly and enjoy even though it is pretty bad. Stay away from the sequel you will only get scorned.","user":"Edwinjhill","rank":[19,23]},{"title":"Funny, in a weird kinda way","rating":6,"date":"21 November 2000","review":"It's your basic 80's teen comedy.  How can you identify this unique sub-genre?  Look for a movie with a good brunette and an evil/bad girl blonde.<br><br>Scatman Crothers was probably embarrassed to list this on his resume, but Christopher Aames is actually kinda funny in a few spots: he does a decent Groucho impersonation near the end.<br><br>Baio and Schacter have some decent chemistry, and for some odd reason I really like the music.  Other then that, it's pretty much a guilty pleasure.","user":"Gislef","rank":[16,19]}]