[{"title":"An obscure, but interesting film","rating":9,"date":"9 September 2011","review":"As you look at the evolution of film through the 50's and 60's, one trend readily observed is that of increasing use of sex and nudity - as earlier boundaries began to expand. This film, coming in 1965, appears on the cusp of a change from more veiled hints of sex to more explicit scenes as the 60's closed and we moved into the 70's and beyond.<br><br>A few themes run through this film, one being that of the overbearing boss many of us have been saddled with in our careers - one who knows that the men have signed on for an extended stay under his \"command\" and plays his hand to the hilt. A boss who has little or no regard for his men and motivates through intimidation.<br><br>Clearly, the director reaches out to the farthest boundaries of the times (and mores) to inject the sexual tension of Ms. Baker arriving on the scene. She is beautiful and sexual and is never out of control of the situation. There is nothing explicit here (but oh so close); nevertheless, the suggestive nature of visits from members of the crew works just as well. In the end, she stands up to the crew commander in a way none of the men (save one) ever had.<br><br>I think the film is a well-acted little gem.","user":"pjc7992","rank":[18,19]},{"title":"A truly international cooperative film venture","rating":9,"date":"18 April 2013","review":"One thing I noticed previous reviewers left out of their critiques of this film is that it was a cooperative venture utilizing German, Australian and American actors and crew. I first saw this film as a preteen on TV and fell in love with it. It was the first time I ever saw Peter Van Eyck (of \"Rocky Horror Picture Show\" fame) act. The truly great performance, however, is given by Ian Bannen (an Aussie) as a happy-go-lucky, crusty oil field worker. IMHO, this work holds the essence of \"art film\" in the palm of its hand. I also do not know anyone else who has ever seen it but feel, if you don't appreciate this film, you know nothing about \"true art\".","user":"jeancfisher","rank":[13,14]},{"title":"Lust in the dust","rating":5,"date":"4 September 2017","review":"Five men of disparate nationalities work an oil station in the sweaty Sahara; just as tempers begin to boil over within the group, a sexy girl and her ex-husband invade their territory (or rather, crash it--seems this reckless dame harbors a death wish for herself and her former spouse). Brian Clemens and Bryan Forbes, adapting Jean Martet's play \"Men Without a Past\", invest the dialogue exchanges with interesting give-and-take, but their scenario isn't inventive or enlightening or even titillating (despite the ads). Certainly the basic thrust of the material--when will the men take advantage of their new arrival--is salacious, however the writers are more interested in probing the human condition and all its faults (although there is some sex involved). Director Seth Holt ably delineates the disintegration of morality and decency among the men, but this woman is something else: a willing pawn in their company, she's both tease and temptress. Actors Studio alum Carroll Baker seemed to get stuck in a revolving door of sexually-uninhibited characters after \"Baby Doll\", yet this role does call for an actual dramatic performance and she delivers. ** from ****","user":"moonspinner55","rank":[5,5]}]