[{"title":"Cinema's Best Shaggy Dog Story","rating":10,"date":"5 September 2005","review":"With all humor, you either get the \"joke\" or you don't. If you don't, no amount of explaining can change your mind. If you do, the details are endlessly enjoyable.<br><br>Part of the joke that's \"The Trouble With Harry\" is that \"nothing happens.\" Hitchcock's \"anti-Hitchcock\" film defies expectations for action, shock, mayhem, suspense, spectacular climaxes on national monuments, etc. Instead, it's a New England cross-stitch of lovingly detailed writing, acting, photography, directing and editing.<br><br>Saul Steinberg's title illustration tells you exactly what you're in for. One long pan of a child's drawing of birds and trees . . . ending with a corpse stretched out on the ground as \"Directed by Alfred Hitchcock\" briefly appears.<br><br>So meticulously is \"The Trouble With Harry\" conceived, the only two images in the title art that are NOT trees, plants or birds are a house with a rocking chair on its porch and that corpse. The film literally plays in reverse of the title sequence -- from little Arnie's (Jerry Mathers, pre-Beaver. The boy who drew the titles?) discovery of the corpse, back to the home with the rocking chair, as Hitchcock's final \"joke\" puts the audience safely to bed. A double bed, in this case.<br><br>What's the film about? Oh, Great Big Themes like Life and Death, Youth and Age, Love and Hate, Guilt and Innocence, Truth and Lies, Art and Pragmatism -- packaged with deceptive simplicity.<br><br>The \"hero,\" Sam Marlowe (John Forsythe), is an artist. The man the \"child\" who drew the titles (Arnie, or someone like him) might have become. His name is an amalgamation of two of hard-boiled fiction's greatest detectives: Sam Spade and Philip Marlowe. Indeed, Sam Marlowe functions here as a \"sort of\" detective. But enough of pointing out the detailed construction of this script and film: repeated viewings yield far greater pleasures.<br><br>\"Introducing Shirley MacLaine\" in her first screen role threw that enduring actress into an astounding mix of old pros: Edmund Gwenn, Mildred Dunnock, Mildred Natwick and Forsythe. That MacLaine held the screen then, and still does 50 years later (name another major actor who can say that), validates Hitchcock's astute casting.<br><br>In fact, TTWH is a tribute to cinematic \"acting\" as much as anything else. These are among the finest performances ever captured of these terrific actors. Since there are none of the expected \"spectacular\" Hitchcock sequences, nor his nail-biting tension, all that's left is for the actors to fully inhabit their characters.<br><br>That they do with brilliance, efficiency and breathtaking comic timing. No pratfalls here. Just nuances.<br><br>Edmund Gwenn and Mildred Natwick are the real stars. Had Hitchcock said so, the film would never have been produced. Their scenes (they receive as much if not more screen time together than Forsythe and MacLaine) are possibly the most delightful (and yes, romantically and sexually tense) ever filmed of courtship in middle-and-old age. Perfectly realized in every intonation and gesture. Occasionally laugh-out-loud funny.<br><br>Theirs is paralleled by the courtship of the younger \"stars,\" Forsythe and MacLaine. \"Love\" at both ends of life, young and old, and love's wonderful humor and mysterious redemption, even in the face of death -- that inconvenient corpse on the hill.<br><br>Perhaps the most surprising and powerful undertow in \"The Trouble With Harry\" (one hesitates to name it because it's handled so delicately) is Sex.<br><br>It is only barely present in the lines given the characters, but the subtext is always there. Occasionally, it boils over into an infinitely subtle burlesque, as in the exchange between Gwenn and Forsythe about crossing Miss Gravely's (get that name?) \"threshold\" for the first time.<br><br>The look in Gwenn's eyes and the repressed joy and romantic hope in his face -- even at his stage of life -- is bliss.<br><br>The coffee cup and saucer \"for a man's fingers;\" the ribbon for Miss Gravely's newly-cut hair (Wiggy cuts it in the general store -- Mildred Dunnock in another unbelievably subtle performance -- muttering, \"Well, I guess it will grow back.\"); Arnie's dead rabbit and live frog; the constantly shifting implications of guilt in the death of \"Harry\" up there on the hill; the characters' struggles to regain innocence by \"doing the right thing\"; the closet door that swings open for no apparent reason (never explained); the characters' revelations of the truths about themselves; their wishes granted through Sam's \"negotiations\" with the millionaire art collector from the \"city\" -- ALL portrayed within the conservative but ultimately flexible confines of their New England repression and stoicism (yes, the film is also a satiric comment on '50s morality) -- these details and more finally yield a rich tapestry of our common humanity, observed at a particular time and place, through specific people caught in an absurd yet utterly plausible circumstance.<br><br>Nothing happens? Only somebody who doesn't know how to look and listen -- REALLY observe, like an artist / creator -- could reach that conclusion about \"The Trouble With Harry.\" Only a genius, like Hitchcock, would have the audacity to pull the rug out from under his audience's expectations at the height of his career by offering a profoundly subtle morality play in the guise of a slightly macabre Hallmark Card.<br><br>When the final \"revelation\" arrives, in the last line that takes us home to the marital bed where love culminates and all human life begins -- yours and mine -- and draws from us a happy smile of recognition, so Hitchcock's greatest secret is revealed, more blatantly in this than any of his films.<br><br>\"Life and death -- and all of it in between -- are a joke! Don't you get it?\" It's there in all his pictures. Nowhere more lovingly and less showily presented than in \"The Trouble With Harry.\" Thank you, Hitch.","user":"Holdjerhorses","rank":[136,151]},{"title":"Outlandish black comedy from Hitch, a failure when released as it was probably a little ahead of its time.","rating":9,"date":"10 April 2005","review":"The Trouble With Harry is a comedy film about a dead body. Alfred Hitchcock makes the macabre concept deliciously funny and entertaining in his unique style. Helping Hitchcock to turn this unlikeliest of premises into an enjoyable film are Bernard Herrmann (providing fabulous music scoring), and a cast of winning actors who judge to perfection how far to push their tongues into their cheeks.<br><br>A dead body turns up on a patch of grass near the top of a wooded New England hill. Various people have reason to believe that they're responsible for the man's death. Septugenarian ex-sea captain Albert Wiles (Edmund Gwenn) is worried that he might have accidentally shot the man while hunting for rabbits. Old spinster Miss Gravely (Mildred Natwick) fears that when she whacked the man over the head with her shoe, she may have done more damage than she intended. And single mother Jennifer (Shirley MacLaine) has even greater cause to feel responsible, for she is the dead man's wife. During an argument, she smashed a bottle over his head and is now almost sure that he died as a result. Local artist Sam Marlowe (John Forsythe) decides to help his neighbours to cover up the crime, but after burying and digging up the corpse several times, the truth behind \"Harry's\" death is finally revealed.<br><br>No Hitchcock film divides viewers more than this one. Some consider the film a masterpiece of understated black comedy; others deem it a plot less, pointless time-waster. The film was a fairly massive box office flop at the time (audiences obviously felt from the movie poster that they were going to see a murder mystery, and were disappointed to actually find themselves experiencing a bizarre, off-kilter black comedy). In retrospect, I'd say The Trouble With Harry is a great film that was probably a good two decades ahead of its time. The performances are wonderfully outrageous, especially the elders (Gwenn and Natwick) who give perceptive comic turns that actors nowadays just don't seem to have the range to do. Forsythe and MacLaine are delightful too (the latter in her movie debut), and Royal Dano rounds off the cast as a gullible cop who nearly finds out that the other four have been up to no good. There's no doubt that The Trouble With Harry is an acquired taste; but if this taste is to your liking then you're in for a delectable treat!","user":"barnabyrudge","rank":[69,81]},{"title":"Entertaining Change-Of-Pace From Hitchcock","rating":17,"date":"17 July 2001","review":"This is a real change-of-pace from Hitchcock, and some of his most devoted fans do not really enjoy \"The Trouble With Harry\", but it is quite entertaining if you appreciate Hitchcock's subtle British sense of humor. There are funnier black comedies, but this one holds up pretty well, and has a number of things going for it.<br><br>'Harry' appears only as a dead body, discovered at the beginning of the film in a clearing outside a picturesque New England town.  More than one of the residents feels responsible for Harry's death - so, just by being there, Harry sets off a lengthy chain of events in the lives of several persons in the town.  There are no tremendous laughs, but a lot of good low-key wit, much of it having to do what the situation brings out about the various characters' perspectives on themselves and others.  The cast is pretty good, and the scenery is beautiful, some of the best in any Hitchcock film. <br><br>\nThere is not the action or suspense in this one that most fans associate with Hitchcock.  But if you appreciate Hitchcock's sense of humor - for example, the kinds of subtly ghoulish remarks that he used to make on his television shows - give it a try.","user":"Snow Leopard","rank":[32,37]}]