[{"title":"Waiting to be rediscovered!","rating":18,"date":"18 August 2001","review":"I can't understand why 'The Manster' isn't better known! It's often unfairly lumped in with 'The Incredible Two Headed Transplant' and 'The Thing With Two Heads', but 'The Manster' is much more than a kitschy gigglefest. It is closer to another forgotten Japanese 60s movie, 'The Human Vapour', made around the same time. Both movies use horror/sf trappings to explore questions of identity and what it means to be human Philip K. Dick style. Neither reaches the giddy, hallucinogenic heights of PKD's best work, but they are both a cut above your average \"monster movie\" of the era.<br><br>'The Manster' concerns a cocky American journalist who befriends a charismatic Japanese scientist. The scientist's lifestyle seduces the journalist who goes off the rails and ignores his job, wife and responsibilities. He thinks he's just letting his hair down after several years of hard work, but doesn't realize that he is the unwitting guinea pig in an ambitious scientific experiment which turns out horribly wrong.<br><br>Try and see 'The Manster', and if possible make it a double bill with 'The Human Vapour'. You'll see that was a LOT more going on in Japanese fantastic cinema that Godzilla, Mothra, et al. 'The Manster' is a low key, imaginative movie just waiting to be rediscovered!","user":"Infofreak","rank":[51,53]},{"title":"A film you never forget!","rating":8,"date":"11 October 2001","review":"As one poster put it... this is the film you saw as a kid but never remembered its name. I did!!! It is kinda cheesy...but I've seen much worse. But for its time, I gotta hand it to the make up folks and the actor's reaction for that scene with the eye on his shoulder. Gosh! Ya gotta guess that most of the budget went into that, and what fun! There isn't one person I have shown this film to that hasn't gasped at it! I just wished the rest of the film was that way. This is one film that HAS to be in your Halloween collection...your \"low budget\" vintage B movie horror collection...you know you've got one. Set it right between the William Castle films and the Hammer Films!! Get this film, get it now. It's a hoot!","user":"lambiepie-2","rank":[20,21]},{"title":"THE THIRD EYE","rating":24,"date":"24 March 2001","review":"I saw this thing as a child, for chrissakes, and still vividly remember that darned eye!  Since I didn't exactly knew what a movie was (I was a VERY SMALL little runt) and didn't understand a word of English, and though the movie was subtitled in Spanish I didn't yet know how to read, I was absolutely terrified!  Were there really people around us who grew eyes on their shoulders, turn into really scary monkeys that split in half, and then each half tried to strangle each other?  I don't understand.  Is this for REAL!?<br><br>It really took me a while to get over that one, I'll tell ya, until I saw The H-Man Monster and the whole stinking nightmare started over again.<br><br>Is this for REAL!?","user":"maxbemba","rank":[27,31]}]