[{"title":"First \"Panther\" was very different, but quite good","rating":5,"date":"5 March 2002","review":"I honestly thought I had seen every Pink Panther movie. (Or should I say, every `Clouseau movie,' since I had even seen Adam Arkin's `Inspector Clouseau'?) I discovered tonight, however, that I had never seen the original 1963 classic, `The Pink Panther.' (Or, if I had, I was far too young to appreciate it and had forgotten all but a couple of scenes.)<br><br>For those not familiar with the film, this, of course, launched the Clouseau character and the Pink Panther series. Beyond the characters of Inspector Jacques Clouseau (Peter Sellers) and Sir Charles Litton (David Niven) and the fabulous Pink Panther diamond, though, there is little resemblance between the series-launching film and later Panther comedies. This is not necessarily bad, although fans of the fast-paced slapstick of the later entries will likely be a bit disappointed.<br><br>Of course this was the precursor, and Sellers and director Blake Edwards were just beginning to explore the character and world of Clouseau, that most incompetent and clumsy of detectives, who nevertheless gets his man.<br><br>The original Panther is a romantic comedy, with Sellers as merely part of a very good ensemble cast. We see very little of the hilarious Clouseau schtick for which Sellers is best remembered. He has no bizarre pronunciations yet and even has a gorgeous  though highly devious  wife. We can certainly see flashes of the Clouseau to come, though, and Sellers blends into the exotic montage quite well.<br><br>Niven is really the star of this first Panther production. As the swashbuckling, womanizing aristocrat/phantom, he turns in one of his best performances. A very young Robert Wagner also does good work as his long-lost nephew, George Litton.<br><br>Two extremely attractive and exotic actresses also heat things up. French beauty Capucine plays Simone Clouseau and is at the height of her career in 1963. Director George Cukor said that `The camera has a love affair with her face.' Edwards' camera certainly did. She handles both the romantic and slapstick scenes with equal aplomb. (Compare the `husband coming home unexpectedly' scene with Capucine, Liven, Wagner and Sellers with the same scene in `Horsefeathers' with all four Marx Brothers, Thelma Todd and her husband!) The other enchanter is Claudia Cardinale, as Princess Dala. The Italian beauty queen is perfect as the sexy, exotic princess and owner of The Pink Panther diamond. In the champagne scene with Litten and the Tiger rug, Cardinale is enticing enough to make a male viewer completely forget Sellers and his bumbling detective work!<br><br>While Edwards and Sellers changed directions a bit in later films, the original Pink Panther is worth renting for more than just its historic value. It is indeed a fine film and a wonderful work of art  something, which, indeed might be said for both Capucine and Cardinale, as well! By all means, rent the original Pink Panther; just don't expect slow motion Kung Fu attacks and insane chief inspectors taking shots at Clouseau!","user":"mlevans","rank":[76,82]},{"title":"It's Not Supposed to be the same as the sequels","rating":25,"date":"25 July 2002","review":"Nearly every review I have read condemning _The Pink Panther_ to second or third rate status in the \"pantheon\" of Clouseau movies comes from someone who either didn't know it existed or who was raised on the totally slapstick offerings that came later. If you are expecting the hackneyed humor and over-the-top performances that came with the last few Panther movies you are bound to be surprised by a movie that took time to make sense out of a story. If those movies are your standard for humor, you are bound to be disappointed.<br><br>This is one of my all-time favorite movies. I watched it when it came out. I was eleven and it was showing at a local drive-in. Since then the movie has never failed to entertain me. <br><br>Unlike most of the other reviewers, I don't share the same admiration for the later Clouseau movies. I did enjoy _A Shot in the Dark_ and even liked _Return of the Pink Panther_ and its sequel, but frankly, Herbert Lom's twitch, Kato's surprise attacks, increasingly more ludicrous plot devices, and the very fact that Clouseau was still in a position of responsibility was more disbelief than I was willing to suspend.<br><br>_The Pink Panther_ is a great Romantic Comedy. That, in itself separates it from all the other Panther clones, which are all farcical slapsticks. Different humor, different purposes, therefore a different appreciation.<br><br>_The Pink Panther_ was not a blueprint for other Clouseau movies. Only for the Clouseau character. <br><br>This movie was the inspiration for an American icon. The Pink Panther cartoons came out well before the next movie. It also featured inspired comedy performances by its four leads. Yes, FOUR leads. Just because Clouseau wasn't the only major character doesn't mean he was minor. Sellers has more scenes than anyone except David Niven.<br><br>_The Pink Panther_ deserves to be considered on its own merits and not compared to movies of another genre that strove to capitalize on the popularity of the original.","user":"wdbrown","rank":[117,130]},{"title":"Birth of the \"Panther\"","rating":7,"date":"21 May 2001","review":"The one that started it all and set `Clouseau' on the path to becoming Chief Inspector, `The Pink Panther,' directed by Blake Edwards, stars David Niven and Peter Sellers.  This film is memorable for a number of reasons, primarily for being the first in a tremendously successful (and funny) series which would ultimately showcase one of the world's favorite cinematic policemen, the bumbling Jacques Clouseau (Sellers).  it also introduced His Royal Pinkness, the Panther himself, to the format of the feature length motion picture.  And can anyone remember a time before Henry Mancini's familiar theme existed?<br><br>\tBeing the first, of course, makes this the prototype, and though it's a good movie, it's obvious that the formula for success which the following films in the series employed had not yet been honed to perfection. Consequently, though funny, the hilarity level of this one is comparatively low, though it does have it's moments, the best of which involve Clouseau.<br><br>\tFrom the day it premiered, it was readily apparent that what really made it a go was Sellers; and Edwards and his team have to be given credit for recognizing it immediately.  Often a sequel fails because the filmmaker has attempted to capitalize on an element of the original that seemingly made it good, only to discover that what the poet once said is true:  You can never go home again.  Merely expanding the part that worked before doesn't insure success; usually, in fact, quite the opposite is true, as without fail it becomes a matter of overkill (The Penguin was no Joker, and those participating in `The Return of the Seven' weren't so `magnificent' after all).  There are the exceptions, of course, like the `Stars Wars' saga, the `Indiana Jones' movies and, it goes without saying, the `Panther' films.<br><br>\tEdwards was clever enough to discern that key element in the original, and not only expand upon it for the sequels, but fine tune it as he did so.  In developing his formula he seemed to possess an innate sense of what was funny, even from an objective point of view-- which is amazing, given that comedy is probably the most subjective of genres.  And then again, he had the inimitable Sellers as his star, which was certainly no hindrance to their combined efforts.<br><br>\tIt's interesting to watch this movie again, especially after seeing the rest of the series, as you're seeing Clouseau in his raw stage of development; the accent is not yet as pronounced as it will be later, and his `denseness' is not quite refined yet.  But funny he is, even as he experiments, searching for that perfect comedic note (which he would finally find in `The Pink Panther Strikes Again').  Seller's performance is the highlight of the movie, and it gave birth to what would become one of the defining characters of his career.  From the first moment Clouseau appears on screen, you know that you're about to be treated to something special. And Sellers never disappoints-- from that first frame on, he is a joy to watch.<br><br>\tDavid Niven, meanwhile, lends an air of sophistication to the proceedings as the suave and debonair, legendary jewel thief, Sir Charles Litton. Though not a unique character, Niven plays him well, exuding the kind of charm possibly only Cary Grant could have matched at the time.  As usual, he brings a smooth presence to the screen, he plays comedy well and the facility with which he brings Litton to life is impressive.  Watching Niven and Sellers together calls to mind the pairing of Michael Caine and Steve Martin some years later in `Dirty Rotten Scoundrels.'<br><br>\tThe supporting cast includes Robert Wagner (George Litton), Capucine (Simone), Brenda De Banzie (Angela), Colin Gordon (Tucker) Fran Jeffries (Greek `Cousin') and the lovely Claudia Cardinale as Princess Dala.  Sellers created a number of characters during his career that will live forever, but with `The Pink Panther' he carved out a special niche for himself when he created Clouseau.  There's never been anyone else quite like Clouseau (or Sellers, for that matter), and it's doubtful there ever will be again.  As for the movie itself, there's no denying it's place of significance in the history of the movies as the one that kicked off a series that made the world laugh-- and thanks to the magic of DVD/video, that laughter continues on, unabated, today-- with no end in sight.  That's the magic of Sellers, and it's all a part of the magic of the movies.  I rate this one 7/10.","user":"jhclues","rank":[57,66]}]