[{"title":"Yes, it's a mess, but I do like watching it on occasion.","rating":24,"date":"24 February 2003","review":"Okay, okay, it's a mess, but it makes me feel good and I like watching it, okay? ;)<br><br>It's not bias, you understand: I am willing to admit that it's just as muddled as anyone else. And it took at least three viewings for me to understand what it was attempting to say. But I finally got the basic idea, and somehow it comforts me.<br><br>I'll try to explain since so many have grown confused by it in hopes of helping understanding.<br><br>The basic plot: Prince and Morris Day are co-owners of a club called Glam Slam. Prince represents good with flaws, Morris Day represents evil with potential good. It's a battle of good vs. evil for Glam Slam. Prince at first attempts to win with a wildly sexual song (after quite a few wildly sexual songs), but fails to do any good. But finally, he realizes that love and God's grace is the real way and wins with a heartfelt spiritual ballad called \"Still Would Stand All Time\". And he embraces Morris Day, who realizes the error of his ways, and everyone lives happily ever after.<br><br>Seriously, that's the basic idea. It's botched in its attempt, but that's what Prince was attempting to do: make a musical pop parable. And somehow, even with all its muddled attempts, the movie makes me smile and feel good about myself, the world and life in general. So to that end, I'm pleased to own it.<br><br>It's a mess and easily the weakest of the movies Prince made, and I don't watch it as much as his other ones by a long shot, but its good intentions and cheerful tone somehow entertain me. So hey, I like it, and I can think of a lot of other crummy films out there which I would diss any day to watch this instead.","user":"San Franciscan","rank":[17,17]},{"title":"What exactly is going on in this movie?","rating":5,"date":"30 June 2001","review":"That's the question I was asking myself as I watched it.  Now, I know that it is a pseudo-sequel to the much-better and more coherent Purple Rain and it showed, especially with all the motorcycle trips out to the \"graffiti bridge\" (very similar in appearance to some of the lake sequences in the previous movie).  And Morris Day and the Time are around again.  That's really where any comparision ends.<br><br>Prince's character is hyped-up on spirituality (which of course, isn't popular with the club crowds in the film).  But ever other spiritually-themed song is followed by one that is much more sexually-charged and with little if no connection to the theme the character is trying to get past.  The phrase \"in the Temple\" is used way too often in way too many of the songs, and is often the only religious link in any of the tunes.  <br><br>This movie seems to reflect the quagmire that was inside Prince himself at the time...He was trying new things but very disjointedly. The New Power Generation had replaced the Revolution, and there are many occurences of the symbol that would become his name (at least early forms of it).<br><br>\nThe highlights of the film for me were the performances of Morris Day and the Time, Mavis Staples, George Clinton (even though he seemed to be performing a Prince tune instead of his own work) and the short dance number by Tevin Campbell.<br><br>If you like Prince, take a gander at the film...just don't expect Purple Rain.  If you don't like Prince, don't bother.","user":"Vigilante-407","rank":[11,11]},{"title":"Pretty Bad and Offbeat","rating":2,"date":"7 April 2008","review":"This was not a good idea to say the least. This was a pretty atrocious movie from start to finish. The major problem was Prince tried to have his hands in everything in this film and it doesn't work. He wrote, produced, directed, and starred in this movie. This was a bad move. Now the music in the movie was slamming because Prince is always on point when it comes to music, but the rest doesn't make a lot of sense. It's very offbeat. Many times in the movie for no apparent reason Prince would lift up his girl and they would just stare at each other for minutes at a time with no dialog. There's a lot of weird and pointless situations that happen like this throughout the movie. Because of this the movie crashes and burns.<br><br>Now I'm a fan of Prince's music. He's definitely a brilliant artist but he honestly should have had someone else write the script. He's always gonna come correct with the music, but the rest he might not wanna work in. Purple Rain was cool and so was Under the Cherry Moon, but this one shouldn't of been given the green light. If there's anything good that comes from this movie it's the soundtrack.","user":"gator1110","rank":[6,6]}]