[{"title":"One cool (and good) movie.","rating":9,"date":"11 November 2006","review":"Like the rest of the English-speaking world, I've recently succumbed to poker-mania, and started wasting some of my spare cash in amateur Texas Hold 'Em games.<br><br>Due to my newfound interest in card-playing, and my appreciation for old movies, I picked up \"The Cincinatti Kid\" on DVD. And I sure wasn't disappointed. The movie's awesome, on so many levels. As you might expect, the poker scenes are incredibly tense and, from what little I know of the game, they're pretty realistic. But other aspects of the film are great, too.<br><br>The New Orleans location shooting is gorgeous. You get to see a lot of the city, so I imagine the crew must've spent a fair amount of time there. There's plenty of cool jazz numbers and some nice French Quarter atmosphere. Director Norman Jewison manages to imbue New Orleans, and the movie as a whole, with an atmosphere that's both sleazy and glamorous at the same time.<br><br>The strong cast is another highlight. Steve McQueen is understated yet compelling, while Joan Blondell hams it up in a highly entertaining fashion (I love how she keeps teasing Lancey Howard about his age). Edward G. Robinson, one of my favorite character actors, radiates class and even a little menace as Howard. And - this is the best part - the movie also features the sweetly beautiful Tuesday Weld and the painfully sexy Ann-Margret. You just can't lose with a multi-generational cast of stars (and babes) like that.<br><br>Some commentators have complained that \"The Cincinatti Kid\" is slow, particularly during the scenes that don't feature poker. I can't say that I agree. The McQueen-Weld romance is sweet, and it doesn't really take up that much screen time. Sure, the movie may seem a little plodding if compared to contemporary films, but then again even \"Aliens\" is plodding compared to contemporary films.<br><br>The theme song's catchy, too. What more do you need? This movie's a mini-classic.","user":"dr_foreman","rank":[26,30]},{"title":"McQueen and Robinson are aces","rating":7,"date":"6 March 2003","review":"This fine film chronicles a tense, dramatic marathon game of poker between a rising young star and a cagey old pro. Steve McQueen is the cool, detached hot shot and Edward G. Robinson displays nerves of steel, razor sharp instincts and a veteran's poise as the two players probe each other, searching for openings and seeking any advantage, however subtle. Both men are excellent and have good support from a solid cast of veteran actors. Ann-Margret is nice as a siren who just can't sit still when she and the Cincinnati Kid are in the same room. She slinks her way through her interpretation as the sluttish wife of a compromised card dealer who figures prominently in the grand game. The romantic angle between the Cincinnati Kid and his girlfriend doesn't ring true, although Tuesday Weld is pleasing as a vulnerable, love-struck girl. The cinematography shows a grim, gray, seedy side of New Orleans that brings realism to the story. The music has a jazzy score and nice vocals by Ray Charles.","user":"NewEnglandPat","rank":[37,46]},{"title":"A poker classic with suspense, realistic characters and a stunning cast","rating":10,"date":"8 November 2005","review":"Steve McQueen, who was deservedly called Mister Cool, plays the young upcoming poker player, already said to be among the best in the business. But there is one he hasn't played against, The Man, Lancey Howard, played by the great Edward G. Robinson. With the help of his friend Shooter they set up the big fight. While having a high suspense factor in the poker scenes, the non-poker ones might get a bit boring at times, especially in the love story between the Kid and his girlfriend Christian. But when it comes to playing this gets almost perfect. McQueen has the ideal poker face, and so has Robinson, and they both play their parts realistically and brilliantly. McQueen was said not to be a real actor, just a poser, they said he didn't act he only looked, but he proves it wrong here. His facial expressions are perfect, and he plays the young hotshot player convincingly.<br><br>Needless to say the cast is the really stunning cast. Next to the afro-mentioned McQueen and Robinson, there's the always reliable Karl Malden, as Shooter. Malden has the most developed character in the picture, and he does a great job. And the women, oh my god, two stunning young ladies are here in all their glory. Ann-Margret plays the cheater, the femme fatal, the sexy beast, who's married to Shooter but wants the Kid. Surely one of the most attractive actresses of her time, actually all time, Ann is presented here in all her glory and beauty and sex appeal. Her seduction of McQueen early in the film, is incredibly sexy, and played brilliantly. They say Ann learned to act during Carnal Knowledge in '71. but that's not true, she already was a versatile and talented actress here. Watch her face during the cockfight scenes, or her cheating while doing a jigsaw puzzle, she acts naturally, and does a great job. And those tight dresses she wears with lots of cleavage are eye candy in its best form. One of the sexiest performances ever. Definitely shows you can be looking divine, and having acting talent at the same time.<br><br>Tuesday Weld plays the good girl, the girl from the country, Christian, and while not as pretty as Ann, she's quite a looker too, and she's also a talented and natural actress. The supporting cast is rounded out by Joane Blondell, Rip Torn, Cab Calloway and Jack Weston, all great actors who all do a fine job. Music score by Lalo Schifrin is good too, and so is the title track sung by legendary Ray Charles.<br><br>As for the often-mentioned, often-criticized last hand, it's Hollywood, only Hollywood, not a poker documentary. The film needs a strong climax, and gets it. Norman Jewison is a fine director, and especially the poker scenes and head-shots are well directed. Not much action, not much character development but it's not much of a problem. If only Peckinpah had directed, now that could have been something, Jewison is a great substitute, but I like the thought Peckinpah could have even improved it.","user":"floydianer","rank":[44,58]}]