[{"title":"The Prey: Second rate 80's slasher","rating":4,"date":"20 February 2018","review":"The Prey follows the tried and tested formula of a group of 20 somethings who venture into the forest to camp unaware that something lingers between the trees with evil intentions.<br><br>In this case we have a bit of a Wrong Turn (2003) vibe and absolutely no originality or standout moments at all.<br><br>One thing I can certainly say for The Prey is that certain elements are beautiful. The movie is full of what I can only assume is stock footage of forestry wildlife and though it seems like filler it really is quite exquisite.<br><br>As for the film itself it is full of mediocre deaths, generic characters and lackluster writing.<br><br>The Good:<br><br>Beautiful nature shots<br><br>Oddly dark finale<br><br>The Bad:<br><br>Paint by numbers stuff<br><br>Weak death scenes<br><br>Things I Learnt From This Movie:<br><br>I've seen enough of these films now to put me off camping for life","user":"Platypuschow","rank":[14,15]},{"title":"Gypsies, Tramps, and Cucumber Sandwiches","rating":4,"date":"25 October 2019","review":"Last night, I was going to take a pill to get to sleep, but it turns out that The Prey works a thousand times better than any Advil PM. Obviously made to cash in on the Friday the 13th hysteria, The Prey features an admittedly attractive cast of 20-somethings who wander off into the woods and are picked off one by one by a charred gypsy.<br><br>There's not much rhyme or reason for anything that happens in this movie and good luck trying to remember any character names. Gail is the only memorable character simply because she has the annoying habit of checking and re-applying her makeup in pretty much every one of her scenes.<br><br>There's a fairly useless side character of a forest ranger who talks in baby voices to deer and eats cucumber and cream cheese sandwiches whenever we're not going on hikes with our leads. To make matters worse, every scene transitions to the next via overlong sequences of nature that go on forever. I'm convinced that, if you took these shots out, the movie would be 15 minutes long. I could almost believe that they ran out of money midway through and, when they got more funds, the original cast wasn't available so they decided to beef up the forest ranger scenes and nature footage just to make the film feature length (it barely qualifies at just under 80 minutes).<br><br>That said, there are some decent effects here and the music score isn't too bad. It's just a shame that, right as the film starts to take off, it ends.","user":"tildagravette","rank":[8,8]},{"title":"CAMPFIRE STORY","rating":6,"date":"24 September 2019","review":"Released and shot somewhere between 1979 and 1983 depending on which source you choose THE PREY was one of those movies that had a limited theatrical release and soon found its way onto the shelves of video stores everywhere. The cover art at the time featured an axe piercing what appears to be a body. That was enough to get horror fans ready to rent. What they found was familiar and different at the same time.<br><br>The story takes place in the Keen Wild national forest in the Colorado where in 1948 a wildfire burned down much of the North Point area. Now 6 college age students are on a camping trip in the area. Before heading up they meet Ranger Mark O'Brien (Jackson Bostwick) who catches the girl's eyes and leaves tells them to be safe.<br><br>The group heads out with one of the girls more interested in her looks than carrying a backpack loaded with supplies. Along the way we get a point of view shot of someone or something watching them. They eventually make camp and settle in for the night. While sitting around the campfire one of the guys tells them a story about what took place all those years ago.<br><br>This takes up a large portion of screen time as he tells them a camp of gypsies used to camp nearby. One of the heads of the group was having an affair with a woman from town. When her husband finds out she claims she was raped. He and a few other townsfolk track down the gypsies and kill them with the exception of one, a boy who was born physically challenged and much larger than his age. Now folks talk of him haunting the woods.<br><br>Of course the group laughs at him and, of course again, he does indeed exists and begins killing off the kids one by one. We've seen this story before and little is added to it for this movie. That is with the exception of a twist at the end.<br><br>The movie moves along at a meandering pace which some praise and others condemn. For myself I found it added nothing. The \"creature\" we're presented with at the end is also a major let down looking more like a man in a mask than Michael Myers did in HALLOWEEN. I was stunned to read that John Carl Buechler was responsible for this makeup. Then again he did give us the effects for GHOULIES.<br><br>There are no performance here worthy of note and the fact that among the 6 actors portraying the students they have less than 100 performances between them says something. Some in fact have only this film to their credit. Smart move.<br><br>Here's the thing. For such a poorly received movie that made its way to video quickly Arrow Video is giving it a major overhaul. Fans of the film will rejoice, slasher fans will be glad to add another film to their collection and the less discerning horror fan will pick it up to make it part of their shelf as well. Making it worth that is the fact that Arrow, as is always the case, are treating this film like a major event and their decision to do so makes it worth picking up, in particular for all of the extras they've added.<br><br>I mean come on, look at this list of extras! It includes 3 different versions of the film: the original US theatrical cut, the international cut and the composite cut. They're all 2k restorations of the film giving fans the ultimate quality for the film. The International cut features the gypsy flashback footage that was added later by the producers without the approval of the original filmmakers. The 2 disc set features an original slipcover with the original UK home video artwork, a reversible sleeve with new artwork by Justin Osbourn, a limited edition booklet featuring new writing on the film by Ewan Cant, a new audio commentary track with producer Summer Brown, a new audio commentary track with director Edwin Scott Brown, an audio interview with Edwin Scott Brown, a new on-camera interview with actress Debbie Thureson, a new on-camera interview with actress Lori Lethin, a new on-camera interview with actor Carel Stuycken, a new on-camera interview with actor Jackson Bostwick (who some may remembers as TV's Saturday morning hero Shazam from long ago), \"In Search of The Prey\" where actors Cant and Thureson revisit the original shooting locations in Idyllwild, CA, a Q&amp;A session at Texas Frightmare Weekend in 2019, the VHS trailer and TV spot, the original script on BD-ROM content and an extended outtakes reel with 45 minutes of never before seen outtakes. If that wasn't enough that composite version features the combined efforts of both the US and International prints to make the most complete version of the film available.<br><br>Arrow is doing this movie right like they always do. But changing things up they are limiting it to just 3000 copies so if you're inclined to want this one in your collection make sure you order yours right away. With so few copies they won't last long.","user":"kirbylee70-599-526179","rank":[3,3]}]