[{"title":"A Masterpiece!!","rating":10,"date":"19 October 2000","review":"THE KID BROTHER should be the film Lloyd to be remembered by.   No matter how many times you watch it, you can always find something you did not notice previously. The structure of  the film is something to be marveled at. It is so delicately built that every frame, even every prop serves a purpose for either characterization or as link between gags, or both. Even the tilt of the abandoned ship serves toward the end of the movie.   The film is so beautifully shot that it has an idyllic quality.  It also has a really great plot and even greater sight gags.  And Lloyd's acting is beyond praise.  The film itself is a masterful blend of great comedy and sentiments.  Definitely one of the best silent films ever made.","user":"gelatoflo","rank":[25,29]},{"title":"One Of The All-Time Classics","rating":10,"date":"20 December 1999","review":"All silent movie buffs know about Chaplin's THE GOLD RUSH and Keaton's THE GENERAL. Strangely, THE KID BROTHER has been almost forgotten, which is a shame, as it is Harold Lloyd's masterpiece.<br><br>Better known for the \"human fly\" sequence in SAFETY LAST, it is in THE KID BROTHER that Harold reaches the top level of silent comedy stardom, alongside Chaplin &amp; Keaton.<br><br>The story is a Western, set mostly on the ranch where Harold lives with his burly sheriff father and two older brothers. There's a dumb bully down the road, a very pretty young lady, a traveling medicine show and a nasty, bald bad guy. I don't want to give away any of the plot, but suffice it to say that Harold gets to showcase his famous athletic agility and there is a very complex &amp; satisfying final showdown with Mr. Bad Guy at the climax.<br><br>For pure romanticism, however, there are few scenes in any silent film that can beat the one where Harold climbs a tree, ever higher, for one more glimpse of the very pretty young lady. It's about as sweet as they come...","user":"Ron Oliver","rank":[24,29]},{"title":"Brilliant","rating":9,"date":"18 April 2003","review":"Even though I had enjoyed several of Lloyd's films, I never really looked at him as being on the same level as Keaton.  That's changed after seeing \"The Kid Brother.\"  The last half hour is as entertaining as anything on film. Harold's resourcefulness while fighting is a thing to behold!  And the monkey with the shoes?  Fantastic!","user":"huboon","rank":[21,26]}]