[{"title":"Brilliantly fun, dark humour and satire","rating":10,"date":"23 March 2005","review":"Undoubtedly one of the most perfect, brilliant comedies ever, this movie is extremely fun and revels in its dark, clever humour. What can one say about a comedy centred around a dapper, charming, likable, impoverished young English gentleman who is at the same time an utterly remorseless, ever-calculating killer who has no qualms about killing an entire line of relatives who all stand in his path to inherit the family fortune? On top of that, he all the while takes great care in preserving his demeanor and status as a gentleman; all the relatives he must eliminate are brought to life by the genius of Alec Guinness; and there's an executioner who takes pains to show proper respect to his social \"superior.\" The dialogue, indeed pretty much all of the humour, is a shining example of \"British humour\" at its best. It is subtle, clever, dark, and full of irony and satire. It is pure, brilliant entertainment that doesn't stop. Comedy really can't get much better than this.","user":"Wulfstan10","rank":[106,124]},{"title":"The Supreme Example of Dramatic Irony","rating":10,"date":"24 September 2006","review":"SPOILERS GALORE <br><br>Everyone describes this film as a black comedy, but its defining trait is its all-pervasive sense of irony. For starters, whereas DR. STRANGELOVE is a truly black comedy, ending in the destruction of the planet, KIND HEARTS AND CORONETS is a moral tale in spite of its theme of cold-blooded revenge.<br><br>The \"for instances\" of irony go on forever in this film. Here are a few: Sibella rejects Louis for being too poor and marries the rich Lionel. Ultimately both she and Lionel turn in despair to the prosperous Louis for support.<br><br>As Young D'Ascoyne indifferently deprives Louis of his position at the shop, so Louis coolly goes on to replace Young D'Ascoyne at the bank.<br><br>The two members of the D'Ascoyne family who suffer the most emotional distress by Louis's murders (Edith and The Banker) are the two who do the most to give him aid and comfort.<br><br>The Reverend Henry, in spite of being a Christian minister, lives in an atmosphere of luxury and pleasure to excess. His very reputation provides an excuse for his poisoning and its resultant cover-up.<br><br>The Admiral's sheer inaccessibility protects him from Louis but dooms him all the same. Even a man standing beside him can't get through his thick skull in time to save him. He drowns at the salute with a life preserver bobbing nearby.<br><br>The General praises the fame of the Russians for their caviar, forgetting that they were also infamous for their bombs.<br><br>Lady Agatha is a crusader for women's rights, but it's her own equality with men as an heir to the Dukedom of Chalfond that marks her for elimination. Her willingness to martyr herself in one cause (women's suffrage and freeborn equality) gives Louis the opportunity to kill her for its exact opposite (patriarchy and inherited rights.) <br><br>The cruel and judgmental Duke is caught and sentenced to death in a mantrap set by his own orders, and executed with his own weapon.<br><br>Edith marries Louis as a show of faith in his innocence even though he turned her into a widow once before and will do so again if he's hanged.<br><br>The eager executioner loses his opportunity to hang a nobleman because his inflated sense of occasion delays the proceedings.<br><br>Lastly, Louis escapes the noose only to hang himself seven times over when years of meticulous planning are undone by a moment of forgetfulness.<br><br>The more you watch this movie, the more details emerge each time. They don't write scripts this brilliant anymore.","user":"Picador66","rank":[47,53]},{"title":"His memoirs!","rating":10,"date":"5 August 2005","review":"Robert Hamer, the director of \"Kind Hearts and Coronets\", one of the better comedies to come out of the Ealing studios in the late forties, created a memorable film that still keeps enchanting, no matter how many times one has seen it. This is a film that like a vintage wine gets better with age.<br><br>Of course, the right elements were put together in this venture under Mr. Hamer's direction, which is probably the best tribute one could say about the film.<br><br>Louis Mazzini, the young man who should have inherited a noble title that is lost as her mother elopes with an Italian tenor and she is disinherited. Louis is determined to regain what's due to him, by whatever means possible. Things go well for him, but he commits a mistake in entering an illicit romance with the calculating Sibella, while at the same time falling in love with the radiant Edith D'Ascoyne, the young widow.<br><br>Dennis Price gives a smart account of Louis Mazzini. He is a delight to watch as he keeps scratching off dead relatives from behind the picture frame. Alec Guinness portrays eight D'Ascoynes with an unusual panache. Best of all is Lady Agatha who encounters 'turbulence' while flying in a balloon. Valerie Hobson makes an impression with her Edith and Joan Greenwood is at her best as Sibella.<br><br>This is a film to treasure.","user":"jotix100","rank":[77,91]}]