[{"title":"Melville: two syllables - magic.","rating":9,"date":"29 August 2000","review":"the first of Jean-Pierre Melville's astonishing and unique cycle of gangster films, which have been variously called 'ironic', 'structuralist', 'post-modernist', 'doconstructionist', 'existential', 'Lacanian', 'oneiric', 'philosophical' etc.  Their influence on modern cinema has been incalculable - Melville's creative indepedence, location shooting and low-budgets inspiring the nouvelle vague; his filming of violent men in action everyone from Scorcese and Coppola to Tarantino and Woo; his deconstruction of genre encouraging Bava and Leone.<br><br>Yet in many ways, 'Bob' is the least typical of Melville's thrillers. Where, say, 'Le Samourai' exists in a sparse, abstract, geometric, dreamlike Paris, the Montmartre of 'Bob' in vibrantly alive, with its nightclubs, bars, stray GIs, petty hoods, casual sex, late-night gambling.  Where in 'Samourai', the hero's character is pared down to psychological abstraction, Bob is a recognisable human being, stern, but sweet, honourable, a Chandlerian knight, with back-history and motivation.  Other characters are plausible, if elusive, also.  Where 'Samourai' is a masterpiece of tone, in which direction, acting, cinematography, narrative, sound, colour, decor all cohere into a perfect whole, 'Bob' is a riot of clashing modes, more reminiscent of the gleeful iconoclasm of the nouvelle vague - parody and action, humour and seriousness, dream and realism, co-exist in fertile, thrilling tension.<br><br>The hero is what the title suggests, a man who can't stop gambling, moving from one late-night backroom poker-game to another, betting most of his money on horse-races, leaving his diet to a throw of the dice; he even has a fruit machine in his well-appointed flat, where his art collection seems to consist of framed carpet.  Yet, ironically, he is a methodical man, keeping to the same routine, the same hours, one night losing a fortune, another making one.  Gambling is his only vice now; formerly a con, he did time 20 years previously for a failed bank job - he now considers himself too old for the criminal grind.<br><br>After one particularly unprofitable spree, and a chance conversation with a pimp-turned-croupier, Bob and an old friend decide to rob the casino safe at Deauville, and begin rounding up the usual experts and investors, minutely orchestrating the heist.  Almost immediately the plans fall through - the dissatisfied wife of the inside man informs the police, as does a thug Bob once refused to help.  The casino boss is informed, the police lie in waiting.  And yet Bob goes ahead...<br><br>For a man who took his pseudonym from one of the great novelists; who adapted most of his films (including 'Bob') from books; and who wrote his own screenplays, Melville has little patience with words, and the story of Bob is brilliantly encapsulated in a series of establishing images.  The opening narration eulogises Montmartre with shots defining milieu in realistic terms.  yet, when we first see Bob, he is in a setting of extreme artifice, with symbolic chess walls (a recurring pattern) and pictures of, rather than actual, locations.  He puts on his trenchcoat and fedora, his signs of movie criminality; whereas Jimmy Cagney and Humphrey Bogart's characters WERE gangsters by their deeds, Bob plays the role of a gangster just as Ledru plays the role of a cop, and  Anne plays the role of vamp or femme fatale - they are recognisably human behind their 'types', but, in this world made of movies, they cannot do the sensible, plausible thing, but are locked into their roles, despite Ledru's humanistic insistence otherwise.  Sense would tell Bob to give up the heist; his pre-ordained role means that he cannot.<br><br>As he walks in the early dawn at the beginning, he looks into a tarnished mirror, a further visualisation of the difference between one's self and one's role, identity etc.  In an extraordinary long shot, the road-sprayer that circles Bob is echoed in the circular shapes of a nearby park, echoing the circles of the film, the vicious circle Bob gets trapped in, the circles of the casino, the cycles of life.  He watches as Anne is picked up by an American motorcyclist - Bob as helpless observer; the movie will dramatise the various ill-fated ways in which he will try to move from passive to active, to stop being a pawn of fate; the frequent, unmotivated-angle shots undermine this.  Like all Melville's films, this is not the story of a gangster, but a dismantling of all the concealed codes, ideologies, assumptions, of the gangster, of masculinity, of Hollywood cinema.<br><br>One of the ways 'Bob'  breaks with traditional cinema is in its anti-Oedipal bias. ; A conventional film often uses an Oedipal trajectory, usually showing an immature hero's moral progress, often defeating an older figure, taking his place and power, and winning the girl.  This is a necessary process of continuity for the social order.  And this seems to be fulfilled here, as Paolo, who hero-worships Bob, obeying him like a father, takes his place, takes his girl, takes his apartment to have the sex Bob can't have anymore, even using Bob's gestures.  Bob is a shadow of himself, de trop in his own home.  As it should be.  The subsequent narrative could be seen as an attempt of Bob's to regain his identity and power, and to emasculate Paolo.<br><br>This sublime film is full of little twists of the norm like this.  Isabelle Corey is unprecedented among all film heroines, her amoral, seemingly indifferent sexuality far more suggestive and powerful than her contemporary, Bardot's - her fulfilling her femme fatale role does not result in tragedy any more than Bob's fulfilling his gangster role does.<br><br>\nThe use of the narrator is interesting too; voiced by Melville, creator of the film, he is also a kind of God-creator, talking about heaven and hell, taking us on a journey from one to the other; talking from the darkness, about how lives cross, but destinies don't meet, than creating a work where crossed destinies are crucial; intruding at bizarre moments, with prior knowledge of the characters' fates before the action has actually determined them.  This, of course, dissipates tension, as does the clownish music, mocking and undermining as much as it propels the action, and the characters' theatricality, their awareness of their roles (eg the rehearsals for the heist like a play).<br><br>The filming of this goes way beyond Melville's heist models, 'The Asphalt Jungle' (his favourite movie) and 'Rififi' - after all the plot elements have been put in place - the plan, the preparations, the tip-off, the suspense - Melville moves to a completely different register, and what had been a crime film involving many interested parties becomes a solitary, private rite, Bob's gambling in the casino is a heightened, hallucinatory dream, not quite a rite of death, but a rite of middle-age, of letting go the trappings of youth, also paving the way for the great climax of 'The Good, The Bad and The Ugly': the shoot-out is pure, beautiful, dream abstraction.<br><br>For many, great cinema is defined in rarefied terms of high art, snobbily above the detritus of popular culture.  For some of us, though, great cinema means a transformative enriching and expanding of popular genres, a cinema that can speak to everybody, not above them, but making the familiar strange.  Keaton.  Hitchcock.  Hawks.  Whale.  Ophuls.  Sirk.  Leone. Melville.","user":"the red duchess","rank":[66,82]},{"title":"Gamble, Bob, Gamble, in it is the source of salvation","rating":8,"date":"16 November 2006","review":"Imagine a movie in which a gambler finds out about a huge payday at a casino and decides to pull off a major heist. He and a couple of friends find a rich backer to put up the money necessary to pull such a large heist and then Bob (the gambler) decides to enlist some others to help out. In the end, he has involved not 9, not 10, but 11 people in the heist. Sound familiar. This hugely influential film by Jean-Pierre Melville has spawned both versions of Ocean's 11 and is also often credited as the grandfather of the Nouvelle Vague movement. <br><br>This movie is French, so unlike the American versions of Ocean's Eleven, there is no singing, no laughing, no hi-fiving, just straight-faced gambling, plotting and even the loving is grim and made without a smile. The characters are memorable, especially Bob and Anne as they go through life expecting no happiness. Bob never goes to bed before 6am, as he spends his nights, every night, gambling at different locations. This addiction is part of who he is and plays a key role in the twist at the end.<br><br>This movie is like a good strong Camembert. As with many French movies, definitely an acquired taste, but once one learns to appreciate the sharpness, one realizes that there is nothing comparable. Camembert, unlike bacon, is not the food of joy. But it is good, flavorful, and powerful in making one want to partake again and again. Until you feel the tanginess in your mouth, there is no describing the taste or effect, but it is definitely worth the effort to build an appreciation for it. 8/10","user":"jeuneidiot","rank":[27,33]},{"title":"Cool and elegant blend of American gangster film and French sophisticated comedy of manners","rating":9,"date":"19 June 2007","review":"Jean-Pierre Melville's \"Bob le Flambeur\" (1955) has been often called the first film of the French New Wave. First or not, French New Wave or not, \"Bob le Flambeur\" is one of the coolest and memorable films I've seen. The most fascinating element of this exquisite crime/dram/noir film is its title character, Bob Montagne- Bob the Gambler (Roger Duchesne). All women wanted to be with him and all young men wanted to be him. He was the man well respected and liked by the cops, the criminals, and the gamblers alike - the king of cool, the elegant loser with his own respectable code of honor. He drove an American car and wore an American hat but he belonged to the streets of Montmartre, Paris, where he was born just as the film itself that could've been only made by a French director who admired American films and had created a perfect blend of American gangster film and French sophisticated comedy of manners. Made back in 1955, the movie is fresh, crisp, sensual, modern and simply delightful. Having watched already all \"Ocean's\" movies, including Frank Sinatra and the Rat Pack's classic, I see where the inspiration for them came from. \"Bob Le Falmbeur\" was released in the USA in 1982, nine years after Melville's death and became an instant cult hit. Often, cult movies are not the best made but it is not true in the case of \"Bob le Flambeur\". Its direction is perfect: seemingly simple and truly elegant, its cinematography is beautiful, its music score is amazing and its characters are not the caricatures - they are the real human beings of flesh and blood and they have something (or a lot) to lose. Acting is great by everyone with Roger Duchesne unforgettable and Isabelle Corey as a young streetwalker Anne whom Bob took under his wing, absolutely marvelous in her first role - child-like innocent yet already perfectly aware of her powers over the men, by the words of Bob's friend, \"she will go far -she knows what she wants but does not show it\".","user":"Galina_movie_fan","rank":[20,25]}]