[{"title":"You're going to see things no one has ever seen before","rating":8,"date":"21 June 2008","review":"\"Fantastic Voyage\" follows a surgical team of three scientists: Dr Peter Duval, the top brain surgeon in the country (Arthur Kennedy); Cora Peterson, his technical assistant (Raquel Welch); Dr Michaels, chief of the medical mission (Donald Pleasance), plus the skipper of the ship (William Redfield) and Grant (Stephen Boyd) the security agent for security purposes... <br><br>The sealed vesselThe Proteusis reduced down by a secret branch called CMDF (Combined Miniature Deterrent Forces) and injected into one artery of a defecting Russian scientist who has suffered brain injury and he's in a coma from an assassination attempt... The crew must navigate to the scientist's brain (within exactly 60 minutes) where Dr Duval will attempt to dissolve the coagulum with a laser beam After that everything starts growing back to its original size<br><br>\"Fantastic Voyage\" is a film of authentic wonder: An ocean of life, the corpuscles, the heart, the lungs of the human body through which the crew move are exquisitely designed in great detail with artistic quality...<br><br>The plot creates unceasing moments of suspense as the ship and its crew are continually threatened by the scientist's natural defenses: white corpuscles, reticular fibers, antibodies and other factors Leonard Rosenman's futuristic score nicely complements the adventure on screen with the strange sound of the human blood rushing through arteries, veins, rhythmical muscular movements, and of course, the sabotage occurred on board <br><br>With two Oscar Awards for Best Visual Effects and Best Art Direction, 'Fatastic Voyage' is certainly the most unusual journey into the human body, where the 'medieval philosophers were right. Man is the center of the universe. We stand in the middle of infinity, between outer and inner space. And there's no limit to either.'","user":"Nazi_Fighter_David","rank":[51,56]},{"title":"Superior Sci-Fi Adventure!","rating":8,"date":"9 July 2002","review":"The premise of \"Fantastic Voyage\" seemed very unlikely in 1966, however in 2002 I'm not so sure.<br><br> The story concerns a top secret miniaturization program being developed by the Americans and concurrently by \"the other side\". A scientist from the other side has the secret of counteracting the situation where the miniaturization effects wear off after one hour. Unfortunately, the scientist receives a brain injury in an assassination attempt. This results in General Carter (Edmond O'Brien), the commanding officer of the project deciding to \"send in\" a team of experts miniaturized, to the injured man's brain to repair the damage.<br><br> The team consists of Drs. Duval (Arthur Kennedy) and Michaels (Donald Pleasance), Pilot Capt. Owens (William Redfield) and the romantic leads, Grant (Stephen Boyd) and the ever lovely Raquel Welch as Duval's assistant. Assisting O'Brien as a medical expert is Arthur O'Connell as Col. Reid. Of course, as in most film's of this type there is the inevitable fifth columnist aboard. The acting is good, particluarly the performances of veterans Kennedy, Pleasance, O'Brien and O'Connell.<br><br> The real star of the \"Fantastic Voyage\" are its amazing special effects. Filmed long before today's computerized digital effects, this film still makes believable, the illusion of a team of people being injected into a person's bloodstream. To fully appreciate the effects the viewer should see it in its widescreen format.<br><br> Watch for James Brolin in a small role as one of the lab technicians. And if you get bored, there's always (snort, pant, drool) Raquel in her form fitting diving suit.","user":"bsmith5552","rank":[44,52]},{"title":"And What A Trip It Is!","rating":9,"date":"24 February 2003","review":"This film was originally introduced to me at about 8 or 9 years of age on a Saturday afternoon and it quickly became a favorite of mine.  This film tells the story of a brilliant scientist who is injured on his way to offer the U.S. military some much needed info for miniaturizing people and objects and allowing them to stay in the miniature state beyond the now 60 minute time limit the military is faced with.  With a top-notch cast that includes; Stephen Boyd, Edmond O'Brien, Donald Pleasence and Raquel Welch as the medical Dr.'s and scientists that are miniaturized and injected into the scientists body in an effort to repair a wound that can't be fixed through the usual means.  The effects in this film are truly amazing and make for a lot of fun as the sub/crew journey through the body and face problems along the way, especially as they are attacked as foreign bodies by the scientist's own natural defense system.  If you haven't had the pleasure of seeing this little gem, by all means find it and rent it and if it's been a while, why not revisit this film, I'm amazed at how well it stands up, even after almost 40 years since it's release.","user":"ClassixFan","rank":[35,42]}]