[{"title":"So cute I wanna hug","rating":8,"date":"8 October 2003","review":"I originally came across Linda Feferman's Seven Minutes in Heaven when I was 14 and worked at a video store and I loved it. I recently watched the movie again and have realized that it is a lost treasure. The movie stars Jennifer Connelly, almost twenty years before she would go on to win an Oscar for Beautiful Mind, as Natalie Becker. Byron Thames plays her best friend in the world, Jeff Moran. The film is definitely a milder, cuter and softer version of the Pretty in Pink's and Some Kind of Wonderful's of the 1980's, which is exactly why it is so good. It's honest, not forced like those films, and parents will enjoy watching this movie with there kids.<br><br>\nWhen Natalie's Dad leave home on a business trip, Jeff convinces her that he should move in because his home life sucks. With support from Natalie's friend, Polly, played exquisitely by Maddie Corman, she lets him. But this movie isn't about putting kids in situations and seeing what they can get away with. The three leads are so natural and the script, surprisingly so honest, that what comes through best in their performances is heart breaking. These characters really do care about each other. It's a great film to show to kids who are reaching pre-teen adolescence.","user":"umbacka","rank":[15,17]},{"title":"A few problems, but enjoyable.","rating":7,"date":"12 December 1999","review":"Despite its rather salacious title, this is a light teen dramedy. Unless you're an old coot, you'll probably find it likeable. It isn't so good on developing characters or situations smoothly, though. When you view it, you get the feeling that you've been running back and forth to the kitchen even if you've been sitting down watching the whole time. This is one of those films that counts a great deal on your liking the characters, and they are appealing enough. Jennifer Connelly is the heartthrob of many, I know, but I've always liked the more obscure Maddie Corman. The teens get most of the screen time without a lot of intrusions from those pesky grown-ups. Is it just me or did most of the young males look an awful lot alike?","user":"Hermit C-2","rank":[12,14]},{"title":"A rare teen gem!","rating":6,"date":"2 December 2013","review":"While other 80's teen movies get all the glory, this movie is worth taking a good looking into. \"Seven Minutes in Heaven\" is an angst on the art of coming of age. Most of the themes is love, sex, and relationships that come and go. Here you got Natalie(Jennifer Connelly) a brilliant, yet independent student who lets her friend Jeff(Byron Thames) stay at her house after a big fight with his stepfather(Marshall Bell). Then there's Polly(Maddie Corman) who has the toughest time in school finding a boyfriend. So what does she do? Falls in love worth a baseball player from New York named Zoo(Billy Wirth) . Well, when Natalie dates one of Jeff's friends, she discovered he is anything but faithful. And Polly meeting with Zoo doesn't go the way she wished for. All the pandemonium is going on all around. Jeff's mother tries her best to bring her son home, and make a connection with the new stepfather. As for Natalie, she just need to open up, and be more forward with everyone. She lost her mother to leukemia. Polly on the other hand needs to be happy with herself and be true to herself. Yes, it's a pain to be goofy, but chasing the winds can make you more miserable. It's a fun movie, should be used for educational purposes in my opinion. Not too raunchy, very subtle. A keeper in the books. 2 out of 5 stars.","user":"GOWBTW","rank":[5,5]}]