[{"title":"Society's child lost in Utopia.","rating":8,"date":"10 May 2001","review":"What kid did not fantasize, at one time or another, being left alone, completely unsupervised, for a long, long, LONG period of time?   To be allowed to say or do whatever he pleased, whenever he pleased.  To eat anything he wanted, to go to bed late, to not go to school, to act or behave as he pleased without reproach.  To be his own adult.  Usually those kind of thoughts permeated our little minds right after a heavy-duty punishment.  In 1990's \"Home Alone,\" we saw a broad, comical take on this fantasy.  With 1963's \"Lord of the Flies,\" we get to experience the flip side.<br><br>\"Lord of the Flies\" was required reading in junior high school.  William Golding's dark, sobering allegory, set during wartime London, tells the story of a large group of young schoolboys airlifted out of England who are left to their own devices after a plane crash leaves them marooned on an uninhabited isle with no surviving adults.  As the boys struggle to adapt to their crude but strangely exotic \"Robinson Crusoe\" existence, the troop begins to splinter into two opposing sects after failing to come to terms on an autonomous code of ethics.  Most of the boys decide to revel in their unsupervised freedom, reverting to primitive, animal-like behavior while resorting to barbaric acts and ritualistic practices.  A conch shell becomes the embodiment of power; a boar's head a symbol of lordly conquest.  On the other side, a minority group try to repel the tempting force of evil by forming a more civilized commune.  Eventually the \"survival of the fittest\" factor sets in as the anointed leader of the hostile group incites violence to force an autocracy. <br><br>Golding's fascinating premise certainly does not hold much hope for the future of mankind.  We are conditioned as a people to be civilized; it is an acquired trait, NOT an inherent trait    according to the author.  And if and when the shackles of goodness and purity are at any time removed to the extent that we are allowed to become our own social and moral dictator, we will invariably revert back to what comes naturally.  And with a child, who has been less-conditioned, it will take little time at all.  Evil is stronger, easier, and much more seductive.  When playing \"good guys and bad guys\" as a kid, which did YOU prefer to be?<br><br>Boasting a surprisingly natural cast of amateur actors and directed by radical stage director Peter Brook (\"Marat/Sade\"), this lowbudget British effort impressively captures much of the novel's back-to-nature symbolism that I found so powerful and fascinating.   The young masters representing good and evil, James Aubrey (\"Ralph\") and Tom Chapin (\"Jack\"), effectively portray the resolute leaders of the two disparate tribes, while butterball Hugh Edwards as the bespectacled, philosophical \"Piggy\" and towheaded Tom Gaman as the quietly sensitive \"Simon\" are touching as two of the weaker followers who become likely targets of the surrounding chaos and burgeoning brutality.  What I love most about this cast is that they act like little boys, not little actors, grounding their often awkward actions and behaviors in reality.  Trivia note: one of the secondary boy players is none other than Nicholas Hammond, who went on to play young Friedrich in the film classic \"The Sound of Music\" two years later.<br><br>Brook's use of grainy black-and-white photography, plus the lack of any comprehensive musical score (remember Tom Hanks' \"Castaway\"?), accentuates the bleakness of its surroundings and feelings of isolation.  The movie can hardly be expected to capture fully every single intention of this highly complex novel (most don't), but it does respect Golding's words and captures the very essence of what he wanted to say.  For that alone it should be applauded. <br><br>By the way, don't waste your time on the 1990 color remake featuring \"professionals\" like Balthazar Getty.  The poetic beauty is all but dissipated in this haphazard, jarringly Americanized update.  It makes me worship Peter Brook's version even more.<br><br>And what story could BE more disturbing yet topical than \"The Lord of the Flies\" as it applies to today's \"latch-key\" society?","user":"gbrumburgh","rank":[87,94]},{"title":"What's Everyone Complaining About?","rating":19,"date":"19 April 2002","review":"After reading Golding's classic novel, my class watched this adaption of \"Lord Of The Flies\" in our literature class. I found it to be quite good, and a hell of a lot better than the 1990 version, which alters all too many important moments and characteristics of the book. Reading over these comments, I was very confused. 1. The story and moral of \"Lord Of The Flies\" is so haunting and powerful that it does not need an overly dramatic score. The tune that Jack and his choir sing around the island is just the right touch. 2. Of course the acting wasn't as amazing as it could have been! Everyone seems to be forgetting just how young and inexperienced these boys were. Besides, the character's in Golding's story are just as young, and act their age (however violent and disturbing it may be). I found the camera work to be quite lovely. The film uses beautiful shots, which only enhance it even more. The final scene is one of my favorites. My only bone to pick is how quickly the film goes through the events in the book. I really do wish it would have slowed down a bit, and concentrated more on such characters as Simon, as well as the boys transformation into savages. Overall I found this adaption of \"Lord Of The Flies\" to be fantastic. My advice to future viewers of this film is to read the book first, definitely watch this 1963 version afterwards,and completely avoid the 1990 version all together.","user":"samluv616","rank":[62,69]},{"title":"A mirror to society","rating":8,"date":"22 September 2005","review":"Peter Brook's film adaptation of William Golding's \"The Lord of the Flies\" is still an interesting piece of cinema one doesn't get a chance to see too often. After more than forty years of its release, the film is still a good way to get to know Mr. Golding's masterpiece, as Mr. Brook stayed truthful with the screen play he wrote.<br><br>The mere idea of children shipwrecked in an island to fend for themselves, as they make a world of their own, was quite revolutionary when Mr. Golding wrote the story. To witness what children are capable of doing in extreme circumstances is an eye opener. In fact, the children put into practice what they have seen of their society as they realize they are stuck in an island without any indication of anyone looking out for them.<br><br>Although some criticism has been expressed in this forum about the way the accident happens, and the way the boys come from all parts as they first gather in the beach, Mr. Brook's intentions seem to be more into the theatrical staging of this scene as the different groups come together. The best scene being the group lead by Jack as they march on the beach singing Kirie Eleison in their sweet and melodious voices.<br><br>Cruelty is the most notorious trait the boys display for one another. That, and the leadership that Jack wants to take away in forming his own tribe and the complete breakdown in the communication among the boys. Mr. Golding was telling us that given to certain circumstances, man, or children in this case, will revert into being savages and that perhaps society's role is to keep people controlled into what is known as a civilized world.<br><br>Peter Brook made an excellent film, but perhaps his biggest achievement is the magnificent work he got out of the mostly unknown cast of young children. There are no false notes, especially in the principals. With the notable exception of James Aubrey, who plays Ralph, none of the other boys had a film career, although one sees the promise in some of them. Tom Chapin is good as Jack. Hugh Edwards gives a heart wrenching account of Piggy, the boy that is ridiculed by the rest and betrayed by Ralph in telling the new arrivals about his nickname. Tom Gaman as Simon also had some good moments.<br><br>This film shows Peter Brook at his best.","user":"jotix100","rank":[42,47]}]