[{"title":"Charming comedy about the counterfeiter next door.","rating":8,"date":"30 December 2002","review":"Edmund Gwenn (best known as Santa Claus in \"Miracle on 34th Street) portrays another charming old man who makes ends meet by a little counterfeiting on the side.  Burt Lancaster is the treasury agent set to track down the mysterious \"Mr. 880,\" as the Secret Service calls him, but who has time for a little romance.  Gwenn, as usual, is delightful and Lancaster, at the beginning of his career, shows the softer side that became more apparent toward its end.  The film is a forgotten gem.","user":"crothman","rank":[30,31]},{"title":"Highly entertaining Burt Lancaster comedy!","rating":8,"date":"8 August 2000","review":"Very Enjoyable film.  Too bad Burt Lancaster didn't make more comedies - as he displays a very nice touch here, making fun of his macho image.<br><br>I didn't know anything about this film before I watched it and was pleasantly surprised.  The characters are a little more \"loose\" or natural acting than is seen in most Hollywood fare of the time.  The story concerns a secret service agent looking for counterfeiters, a translator at the United Nations, and a beloved old man.  A very nice, original story.<br><br>All the actors are good - Burt, Dorothy McGuire is quite radiant and Edmund Gwynn is dynamite.  I'd say he is better in this than in \"Miracle on 34th Street\". If you are looking for a nice movie that will put a smile on your face - you can't go wrong with this one.  It'll stick with you.","user":"victrader","rank":[18,18]},{"title":"The Whimsical Edmund Gwenn","rating":7,"date":"3 May 2006","review":"Burt Lancaster was always one who took firm control of his career. He got out of the studio system very early in Hollywood and was always the one who called his own shots. I'm guessing that he probably owed someone a favor which is why he did Mister 880.<br><br>It's not that Mister 880 is a bad film, but it's most definitely not a Burt Lancaster project. Burt and leading lady Dorothy McGuire play a definite second fiddle to Edmund Gwenn as the whimsical old neighborhood character who does some counterfeiting on the side when he runs short of money.<br><br>The title stems from the number on his file with the United States Secret Service. Mister 880 isn't even that good a counterfeiter, but his case has been put on the agency back burner for years while they assign top priority to organized gangs of counterfeiters. Gwenn does his work on cheap office supply paper with a hand press. He even spells Washington wrong on the one dollar bills he prints. And he's been getting away with it for years because of the small denominations.<br><br>McGuire comes to Lancaster's attention as she gets stuck with one of Gwenn's phonies. He's the agent who the New York office finally decided to assign to the 880 case. Of course the usual romantic complications get in the way of the case, but not forever.<br><br>Edmund Gwenn is one of those delightful character actors you cannot help but like. His charm is infectious, never more so than when he won that Oscar for Miracle on 34th Street. His character of the Skipper is in the same vein as Kris Kringle in Miracle on 34th Street. <br><br>Who could not like Edmund Gwenn and therefore who could not like Mister 880.","user":"bkoganbing","rank":[32,35]}]