[{"title":"Brilliant British Bank Heist Movie!","rating":10,"date":"10 May 2006","review":"I'm a huge fan of \"heist\" movies, a sub-species of \"caper\" movies. And there's something especially delicious about the British argot that makes British heist movies especially great fun. (\"Sexy Beast,\" \"The Great Train Robbery,\" \"The General\" all add to this list) <br><br>But across all heist movies \"Bellman and True\" is my all-time favorite. Bernard Hill gives one of his most nuanced performances as an alcoholic computer programmer who is left with his girlfriend's son (\"True\") when she dumps both of them. To get out of debt he's sold some information to a gang about bank security, but now he and the boy are on the run because the gang wants more than information--they want him to help plan the heist. <br><br>I won't give away anything more, but the heist itself is a white knuckle masterpiece, directed by Richard Longcraine (Richard III, with Ian McKellen, and Smiley's People, with Alec Guiness). <br><br>Through it all Russell is surrounded by more than a dozen great performances by some of the UK's finest character actors. Richard Hope as \"Salto,\" is especially strong, as the gang member assigned to be Russell and the boy's jailer.<br><br>Trust me---the caper, which makes up the second half of the film, is worth a viewing on its own, but the strong characters and acting make it a real hidden gem of 1980s British cinema. This film jump started Longcraine's career, which recently included \"Wimbledon,\" \"My House in Umbria,\" and the to be released Harrison Ford thriller \"Firewall.\"","user":"rmiller-44","rank":[7,7]},{"title":"This is the REAL McCoy","rating":8,"date":"19 December 2000","review":"A fired computer programmer (Bernard Hill) has been hired by a gang of bank robbers to steal confidential computer information from his previous employer. The problem is, the information is encoded. He takes his son along with his payment and runs away but gets stuck when the money runs out. He returns home only to be confronted by his \"new\" employers. He is forced to decode the information he stole so that the robbers can use it. His son is kept hostage until he has what they want. It gets more involved when the plans change and he has to go along on the robbery to disable the alarm system. This movie is a great heist movie. The video release has been edited so much it doesn't explain important parts in the plot. There is a unedited version out there that shows more details but is usually only shown in full on TV.<br><br>This movie was the original for which the 1993 movie The Real McCoy was based on. Only this one is better!","user":"DJ-21","rank":[9,11]},{"title":"gritty English caper","rating":7,"date":"6 November 2010","review":"This brisk, efficient thriller finds its character in the ranks of working class Britain, but includes plenty of high-tech trappings, which (fortunately) are never allowed to overwhelm the blood and sweat of the caper itself. And there's a welcome human element worked into the heist, when a burned-out, middle-aged mechanical wizard drafted into an impossible bank robbery scheme discovers the criminal syndicate that recruited him is using his young son as leverage. The job comes unstuck, naturally, and after a leisurely introduction the plot moves quickly to and capably to a (literally) bang-up climax, after one of the more exciting getaways in recent years. Too bad none of the three credited writers could find a neat resolution for the overabundance of conflicts, or gave much thought to the opposite sex in what turns out to be an almost exclusively male adventure. The hero's (presumably selfish) wife has already abandoned him before the story even begins, and the only other sympathetic woman in the cast is finally revealed to be (what else?) a heartless lesbian informer. Don't leave the theater before the truly oddball closing credits.","user":"mjneu59","rank":[3,3]}]