[{"title":"In one word: perfection","rating":10,"date":"17 December 2013","review":"Needs to be seen to be believed; in one word: perfection. Every frame, every voice-over, every song - it all comes together at the exact right moment to create the perfect film experience. This film makes you really understand and feel what makes the American mafia so compelling; in the eyes of a kid, who was unfortunate enough to grow up in a tough neighborhood, those gangsters are rock stars. Live fast, die young - but when you die, it ain't gonna be of a glamorous suicide or drug overdose - the ending will be brutal, ugly and sad. And it may very well be one of your best friends that will blow your brains out.<br><br>I'll never get tired of watching Goodfellas; the entertainment value of this film is just amazing. It doesn't happen very often that every person involved in the process of making a film is at the peak of his/her game. And rarely do art and entertainment come together the way they did here. Storytelling with impeccable pacing, this is what it's like when a master composer conducts his masterpiece. All hail the king; the most versatile and talented filmmaker of his generation: Martin Scorsese.<br><br>My vote: 10 out of 10<br><br>Favorite films: IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[239,267]},{"title":"An Offer You Can't Refuse...","rating":10,"date":"31 March 2003","review":"\"As far back as I can remember, I've always wanted to be a gangster.\" -- Henry Hill, Brooklyn, N.Y. 1955.<br><br>Gangsters are all around us. Everyone knows it, not everyone wants to accept it. \"Goodfellas\"--based on true events--explores the lives of gangsters, chronicling the events through the eyes of Henry Hill (Ray Liotta), who gets involved with the Mafia at a young age and continues his \"career\" throughout the film.<br><br>As he gets older, he marries and has children, but still works for the organized crime family, under mob boss Paulie (Paul Sorvino); and he is friends with Jimmy (Robert De Niro), a calm, steady gangster; and Tommy (Joe Pesci), a wild man with serious mental problems. <br><br>Eventually Henry's life goes down the gutter, leading to drug abuse and paranoia, that leads to other unfortunate incidents that will be ruined if I type any more about them.<br><br>\"Goodfellas\" is one of the best films I have ever seen. It's a tour de force of breathtaking images, witty scriptwriting, superb acting and realistic violence.<br><br>Robert De Niro gives one of his best performances -- ever -- as Jimmy, even if he's not in the film as much as you might be lead to believe from the front cover.<br><br>Joe Pesci is in this movie about as much as De Niro, maybe a bit more or less. But when he's on screen there's no doubting he's on screen--he's very hard to miss. A short, deranged, loud-mouthed man with something wrong in his head. Someone makes an insult toward him and he shoots them, and then laughs. It's quite disturbing. I am a huge fan of Pesci, and I tend to love his characters, but he really makes you feel sick towards his character in \"Goodfellas,\" while at the same time taking a strange liking to him. That just goes to show how good of an actor Pesci is.<br><br>Ray Liotta is perfect as Henry Hill. I can't think of a better actor to play him. He captures a sense of innocence yet at the same time a feeling of violence. I love the scene where he walks over to a man's house with a regular expression on his face. \"What do you want, f&amp;*^&amp;?\" the man asks. Liotta continues walking, takes out a gun, and starts to continually beat the man in the skull with the butt of his gun. As Henry walks back to his car, his face is disturbing and his expression stays with you for a long, long time.<br><br>Martin Scorsese is a brilliant director and his work here is fabulous; it's been recreated by other directors (namely Paul Thomas Anderson in \"Boogie Nights\") and there's a reason: it's great stuff. He totally deserved to receive Best Director in 1990, but of course he didn't. (Rumor has it the Academy frowns on Scorsese's use of racial slurs in his work. Oh boo hoo, get over it.)<br><br>The movie is based on the true-crime memoirs of the real-life Henry Hill, whose novel with Nicholas Pileggi -- \"Wiseguys\" -- was adapted into a screenplay by Pileggi and Scorsese. The book itself was fantastic and insightful; the screenplay is even better. The dialogue is incredible.<br><br>Anyway, \"Goodfellas\" has to be one of the best films I've ever seen--a true modern classic that will be remembered for what it is: One of the greatest tales told on screen. It's an offer you can't refuse!","user":"MovieAddict2016","rank":[480,639]},{"title":"One word: priceless","rating":10,"date":"6 November 2004","review":"If there was one word that I could use to describe Martin Scorsese's \"Goodfellas\": it'd be priceless.<br><br>A surreal and deeply fascinating take on life of Henry Hill who was involved in the Mob for three decades and his rise throughout the time span (and Nicholas Pileggi's book \"Wiseguy\").<br><br>There isn't a single moment in the movie where it doesn't miss a beat, you could only tell by the atmosphere of the time period and it seems so real.<br><br>The performances in this film simply make it even more memorable and how the characters are portrayed here especially by Ray Liotta, Robert De Niro, Joe Pesci (who won an Oscar for Best Supporting Actor), and Paul Sorvino are believable and easy to understand that they were a family, very close and tightly knit to the core. Also, how director Martin Scorsese lets the movie pace itself and keeps the viewer off guard in what happens deserves a lot of credit.","user":"mhasheider","rank":[312,454]}]