[{"title":"My Favorite Godzilla movie","rating":10,"date":"28 November 2006","review":"Anyone who says that Godzilla movies are nothing more than men in rubber monster suits, wrestling and destroying scale models of Tokyo... has not seen this film! When I first saw it, I was like 5 or 6 years old and it scared the beejeezus out of me! I agree with another reviewer, definitely not a \"G\" rating. What makes this a rare and exceptional Godzilla movie is the not-so subtext. Pollution was a big concern in the late sixties and early seventies, and this film has the most powerful images of anti-pollution propaganda that I have seen in any film! Add to this, a bizarre mix of dancing disco hippie chicks singing \"Save the Earth\", with real images of the horrendous pollution in Japan and things like spontaneous animated clips...and you have THE most unique of the Godzilla films ever made! But don't worry! There is plenty of all-monster-wrestling!! You either like Godzilla movies, or you don't. If you don't like the franchise, avoid this like the plague. If you are a huge fan of the big \"G\", like I am, this is the most interesting variation on the standard zilla plot. And a refreshing, bizarre and disturbing mix of imagery!! I gave it a 10 of 10 because it is my favorite of all the Godzilla movies.","user":"gramdal","rank":[14,17]},{"title":"This is a psychedelic Godzilla movie!","rating":8,"date":"21 February 1999","review":"This film has a really post modern feel to it. It begins with a song in Japanese called Save the Earth that (like The Lost Continent song) you won't stop singing (Kaishan! Kaishan! Kaishan!). The opening credits mix in shots of a girl singing the song with shots of a sludge clogged Tokyo harbor. Things get stranger from here. It opens with an annoying kid and his dad going swimming. The kid's father's face is disfigured and the kid gets his hand burned off by a smog monster named Hedorah who spits acid balls and inhales the fumes off smokestalks. Things get even stranger from there. Theres a Save the Earth concert or something with this girl in spandex with stuff painting on singing, this lava lamp like thing on the wall (definitely hippies) and this teenager who gets drunk and starts halucinating and sees everyone with fish masks on (when I saw this the first time when I was six, couldn't get why everyone started wearing fish masks and why the teen seemed so disturbed about it) until Hedorah suddenly attacks after sucking up fumes. Well Godzilla comes and saves everybody and they start fighting really bizarrely (similar to the Saturday night wrestling scenes from King Kong vs. Godzilla. They wrestle and wrestle some more. Though released in 1971, this is very sixties. Director Yoshimitsu Banno blends mind twisting images, real scenes of Tokyo bay covered with sludge, the scenes with the hippies, disturbing scenes with dying babies on mutiple screens, gory scenes of Hedorah's victems being reduced to skeletons, scenes with the kid and his scientist father trying to figure out how to stop the monster, and scenes with a newscaster. This is very poetic, bizarre, beautiful, and sometimes extremely disturbing and has about the strongest anti pollution messages I've ever seen (Japan was polluted the most back then). This is one colorful film. P.S. I don't know how this film got a G rating with all the disturbing images in it.","user":"Horror Fan","rank":[9,11]},{"title":"Godzilla's Court-Ordered PSA","rating":7,"date":"4 February 2006","review":"Godzilla vs. Hedora (or the Smog Monster, to the old-school Saturday afternoon horrorshow crowd) is, in some ways, one of the most ambitious films in the G canon. It's got a heavy environmental message, snazzy cinematic tricks including split-screens and animated transition sequences, and attempts at multi-generational appeal (though still heavy on the kid-friendly elements of its era). For the most part, all this baggage manages to mesh together well with the giant monster rampages that we really came looking for. (And if you weren't looking for that, why'd you come here?) <br><br>And there's certainly more than enough rampage to go around. Hedora is the first of G's multi-form mutant foes (unless you count Mothra), and each form - giant tadpole, crawling worm, flying pancake, and finally quasi-upright slug-thing - has to get its fair share of screen time wandering from place to place consuming pollutants and transforming them into even nastier chemical attacks. Throw in several good fights against Godzilla and/or the military, and one might almost be willing to forgive the famously embarrassing \"Godzilla uses his atomic breath to 'fly'\" sequence.","user":"stmichaeldet","rank":[6,7]}]