[{"title":"A wonderful Romance!In a nice southern way.","rating":14,"date":"14 May 2003","review":"Joanna Morgan (Faye Grant) Comes to the Ozark Mountains for a two week visit with her uncle Reese(Leslie Nielsen). At first Joanna doesn't care for the Ozark very much.Till meets Linc(Barry Van Dyke) a very handsome southern ridger runner.And for a long time Uncle Reese has had a crush on Rachel(Lara Parker)a very sweet and shy widow who dont like to give Reese the time of day. And also there is Jessie.A very sweet but  backwoods kind of guy.Joanna doesn't get on a good start with Jessie at first.She really misjudges people when she first meets them.But she never gets along with Jessies mules. This is a wonderful movie and a book.I really enjoyed the both very much.Full of Romance it will keep you wondering till the end. Drawn by a great cast. ILL give a A+ to this movie","user":"kimberly-24","rank":[23,31]},{"title":"The storybook South","rating":3,"date":"3 March 2006","review":"This extremely lightweight romance film depicts the American south as a bucolic paradise filled with polite and handsome (white) gen'lmen, ladylike (white) women, and amusing old (white) farmers who still drive mule-powered carts down the back roads. Tippi Hedren stars as a fancy pants Yankee outsider who comes to visit her uncle (Leslie Nielsen, in non-comedy mode) and ends up falling for handsome Linc (Barry Van Dyke). Along the way she learns important lessons about how women shouldn't be too uppity and how the native intelligence of hillbillies matches or exceeds that of most corporate bigwigs. Janet Dailey's screenplay is bland and uninspiring, with one-dimensional characters who trot through the story in completely predictable fashion. And wait till you see the dreadful special effects used to represent the titular phenomenon! Foxfire Light was shot on location in Branson, Missouri, which is now, of course, a tourist destination and decidedly short on hillbillies and mules.","user":"JohnSeal","rank":[4,25]}]