[{"title":"The last film by Orson Welles, finally upon us","rating":8,"date":"30 September 2018","review":"I had the privilege of seeing this at the New York Film Festival. A sense of awe descended upon the audience as soon as the opening credits began. The fact that this film was finally completed and released is a triumph in and of itself.<br><br>Orson Welles' final film is chaotic and unwieldy, but also very haunting and melancholy. The soundtrack is amazing. There is frankly a sliver of a plot. An aging director attempts to make a comeback as Hollywood has drifted away from his era as he throws a big birthday party in which journalists, critics, admirers and some industry professionals join to celebrate. It soon becomes apparent that reporters are there to ascertain information about more than his work. His new film that is in the works is shown. We get to see an unfinished film within a film that is titled \"The Other Side of the Wind\", one that is sexually explicit.<br><br>The late John Huston portrays Jake Hannaford, the director whose approach to filmmaking has earned him a great following and his relationships with the actors he works with makes him a lightning rod of controversy. Huston's sepulchral voice and domineering presence make him flawless in the role as Hannaford. Peter Bogdanovich is well utilized as a younger, successful director whom Hannaford has taken under his wing but whom now Hannaford consults on how to better reach audiences of the new era.<br><br>This film is not flawless. The experience of seeing this at long last outweighs its drawbacks. There are some parts of this film that drag a bit. But there are also many, many scenes that are just astounding and I'm so happy they were finally brought to the big screen. Although this film is inconsistent in its narrative thrust, it returns very quickly to its busy, slightly manic state. I don't know if Welles deliberately left this unfinished. What I can say is that the editing is superb and provides us with a film that is a lasting testament to Welles and his legacy as a filmmaker. Highly recommended.","user":"PotassiumMan","rank":[56,78]},{"title":"Disappointing","rating":5,"date":"2 December 2018","review":"A famed, and infamous, movie director, JJ Hannaford, dies in a car accident. He was about to release his latest movie and a documentary camera crew had been following him around in the days preceding his death. We see the events leading up to his death, the careers Hannaford destroyed, the enemies he made and his last film, The Other Side of the Wind.<br><br>Written and directed by the great Orson Welles, this movie has taken nearly 50 years to be released. Welles started shooting it in 1970 and by his death in 1985 it had not been released. Production issues and politics prevented this. Now, in 2018, Netflix has released it. Being a huge fan of Orson Welles, the thought of seeing his long-dormant final film released was an exciting one.<br><br>However, the final product is quite disappointing. It looks and feels unfinished, a mashup of random scenes. While watching I thought that this was due to the film being in an unedited state when Welles died and it was edited to the final version after his death. Turns out the final version had already been edited by Welles, so we can't blame Netflix's production team.<br><br>The film-within-a-film element was initially intriguing but is ultimately confusing. What is part of Hannaford's film and what is Welles's film? Are the pretentious, trippy, hippy sequences and the gratuitous nudity and sex scenes Welles trying to appeal to early-70s arty audiences or his take on the pretentiousness of modern movies?<br><br>I would like to think that one of the themes of the movie is the pretentiousness of Hollywood, so will give Welles the benefit of the doubt on the content. However, it does become a jarring, disconcerting experience when you have seemingly-gratuitous scenes like those thrown randomly into the movie.<br><br>This said, it is not all bad. Welles's take on Hollywood, its movies and the pretentiousness of the times is well directed (if, indeed, that was his aim. It's so difficult to tell). The mystery surrounding John Dale adds intrigue. The story of JJ Hannaford is interesting and John Huston is perfect in the role. He pretty much just had to play himself!<br><br>Even here, however, Welles overeggs the pudding. I would have been more engaged in the Hannaford story if there weren't so many scenes that added nothing to plot or character development. So many scenes that just take up space and so much long, pointless dialogue. There's no momentum to the movie at all and the ending is a damp squib.","user":"grantss","rank":[14,17]},{"title":"Mired in the 70's","rating":2,"date":"8 December 2018","review":"This film totally lacks the precision and meaning revealed in Orson Welles' master works. The experimental vehicle employed not only completely fails but descends into a thoroughly depressing and overly pretentious 70's style that does not transcend the period which most of his earlier work achieved.<br><br>It seems to me that Welles, so hungry for the acceptance he had (unfairly) lost over the years was trying to please his audience with what may have passed for an artistic statement at the time.","user":"jarwarr19","rank":[7,8]}]