[{"title":"most realistic gunfight ever","rating":1,"date":"1 August 1999","review":"Madigan is memorable for its final, climactic gunfight.  This is the closest the cinematic art will ever come to reality unless someone actually captures a real life up-close-and-nasty gunfight on film.  Widmark and Guardino vs. Steve Ihnat in about 4 seconds of absolute mayhem, with tragic results.<br><br>By the way, I saw this film in an Army hospital in 1969, while recovering from being wounded in Vietnam.  It was projected on a bedsheet hung in the middle of a ward.  The image showed through clearly, so I (and half the audience) watched it from the back side of the sheet; all lefts and rights were reversed!","user":"SquirePM","rank":[35,45]},{"title":"Great bookends, sagging middle","rating":6,"date":"1 February 2005","review":"Detective Daniel Madigan (Richard Widmark) and Detective Rocco Bonaro (Harry Guardino) enter a squalid Manhattan apartment building to pick up Barney Benesch (Steve Ihnat), who is wanted for questioning on a case in Brooklyn. When Benesch manages to take Madigan and Bonaro's guns away and escape, Police Commissioner Anthony X Russell (Henry Fonda) tells them that they have 72 hours to get Benesch back, or else.<br><br>Out of all of the Don Siegel-directed films I've seen to date, this was the biggest disappointment. The film begins and ends with fantastic action sequences--well directed, well shot, with a nice, gritty feel, but in between the film felt overlong, overly complex, and far too soap-opera-like for my tastes.<br><br>It could be due to Madigan being adapted from a novel, but Abraham Polonsky and Howard Rodman's (\"Henri Simoun\" here) script includes so many different threads, most of them inconsequential to the outcome of the film, that it almost begins to lose coherence in the middle. It's a bad sign when the major arc of the story is completed, but characters still have to engage in a number of \"But what about so and so?\" verbal tags at the end of the film to try to satisfy the audience.<br><br>It feels almost as if Madigan is made for two entirely different crowds--one, fans of gritty crime action films, and the other, fans of realist dramas cum soap operas. I can't imagine the former caring about most of the material in the middle (unless it had a pay off towards their genre), and I can't imagine the latter being interested in the action scenes. Most of the material in the middle, although it has some more than admirable dialogue and decent performances, hinges on a complex web of personal and professional relationships--various romantic affairs, questionable relations between the police and citizens, and so on. It all comes to naught in the end. Also not helping is Henry Fonda's odd aloofness. Again, it might work if it had some other payoff, but it doesn't.<br><br>Still, the positive aspects were good enough to not bring my score below a 6. The film might also play better on a second viewing, where you better know how to adjust your expectations as it goes along. On a first, uninformed viewing, the beginning is likely to gear you up for a great, suspenseful and witty ride, leaving you disappointed in the middle, until you finally adjust and then you're awakened again with action at the end.","user":"BrandtSponseller","rank":[21,27]},{"title":"Lively, well-characterized police thriller with excellent locations","rating":8,"date":"14 May 2005","review":"In the late Sixties there has been a tendency towards rough cops who are up against the system  whatever that is  yet who win through despite all odds Richard Widmark was one of them <br><br>In \"Madigan\" he is a solid, touchy New York detective who, like Quinn in \"Across 110th Street,\" knows the people on his patch and knows how to handle them<br><br>Unlike the Quinn character, however, he is honest to the nth degree He will kill, beat and cheat to destroy the big villains, yet retains a curious affection for the little crooks that cross his path One feels that if Madigan took a bribe, it would be secretly witnessed and the evidence produced in court to the ruination of some baddie","user":"Nazi_Fighter_David","rank":[18,23]}]