[{"title":"Holiday sentiment, well-acted and unsappy.","rating":8,"date":"18 December 2002","review":"Some occasionally clumsy dialogue only mildly undercuts the virtues of Greg Taylor's thoughtful script, which provides a surprisingly realistic depiction of the joys and heartaches of simple lives at Christmastime.<br><br>Rebecca Harrell is superb as 9-year-old Jessica, who finds an injured reindeer in the woods near her Michigan farm and determines to nurse it back to health in time to help pull Santa's sleigh on Christmas Eve. She's a marvelously realized character, refreshingly minus the cute kid mannerisms of many a Hollywood acting tyke. I particularly liked the way she deflected her father's tirades with her singlemindedness of purpose: he might get mad at her, but she was still going to do what she had to do. Very childlike, and very real.<br><br>A subplot about Jessica's helping a reclusive, eccentric neighbor (played by Cloris Leachman in a virtual cameo) seems truncated and unnecessary, but for the most part Taylor's scenario sticks to the basics and is better for it. Characters surrounding Jessica act like real people, not stereotypes, and events transpire with a sense of realism, not melodrama.<br><br>Credit for this tale's effectiveness also goes to Sam Elliott, who plays Jessica's father, a recent widower, with a harsh demeanor that seems to mask real pain and desperation. Thus his rapprochement with his wayward daughter carries unexpected depth of feeling and could not fail to move all but the most cynical. For a dad like me, I admit it put a big lump in my throat.<br><br>Despite a somewhat flawed climax -- to my mind, the vfx shot of Santa's sleigh coursing across the sky is unnecessary, given the magic moment just prior to it that reveals reindeer hoofprints leading to a precipice -- this nice little holiday film delivers a timeless message about faith and selflessness. Recommended for mature kids of 8 or older.","user":"jckruize","rank":[35,37]},{"title":"Sincere and heartwarming Christmas movie...","rating":10,"date":"30 January 2007","review":"This is one of the best contemporary Christmas movies made. A very sincere and sweet movie, but one that won't give you tooth decay. Rebecca Harrell gives one of the most believable and intelligent performances as a young girl who nurses an injured reindeer back to health and holds the belief that the reindeer is indeed Prancer. Sam Elliot gives a strong performance as the girl's apple farmer father who has fallen on hard times and is trying to raise his kids without a mother. The rural scenery of this film is beautiful of the farms and woodlands and gives the film a real feeling of Christmas. A very simple plot fuels the movie, but it grows surprisingly darker and deeper as the film progresses and will be tugging at your heart strings by it's conclusion. Highly recommended viewing for kids and adults and all believers of Santa Claus.","user":"gloomyrival","rank":[25,27]},{"title":"An integral part of our Christmas","rating":9,"date":"8 December 2002","review":"This film proves that there are still unspoiled hearts left on Planet Earth. Those who find it sappy or irrelevant have spent too much time wearing Grinch suits and need a good dose of humanity to thaw that hard matter in their chests that passes for a heart.<br><br>The child actors are the heart of _Prancer_. They are real, never overacting or coming off as children playing at making a film. Sam Elliot is the epitome of the overstressed, depressed man who has lost his wife and despairs of losing everything else too. His transformation is believable and worthy of the time spent to watch his character unfold. Cloris Leachman is a delight as the female Scrooge who is touched by two children--Jessica who reintroduces her to the joy of Christmas, and a little boy in church who reintroduces her to the joy of human fellowship.<br><br>Above all, this is a story of transition. The earnest child must move forward to knowledge, and the jaded grownup must move back to mystery and faith. If your Christmas is too much take and not enough give, I prescribe hot chocolate, hot buttered popcorn, and a viewing of Prancer with people you love. Better yet, do as we have and make this movie part of your personal holiday tradition. It might help make you a better person the rest of the year.","user":"BookPoet","rank":[25,28]}]