[{"title":"There's Majesty For You!","rating":14,"date":"14 July 1999","review":"\"We are all killers, on land and on sea,\" wrote Herman Melville more than 100 years ago.  But the artistic failure of a recent television adaptation of his greatest work shows that some are killers, too, on screen.  Movie makers.  Butchers.  Their guts are now gorged with Moby Dick.<br><br>\"Majestic\" raved \"TV Guide\" about USA Network's production of Melville's book.  Reading that review I had a fantasy where Captain Ahab, with his sublime limp, walks into the magazine's office, shoves director John Huston's 1956 film of Moby Dick into the VCR, points to the screen and defiantly exclaims:<br><br>\"There's majesty for you . . . \"<br><br>. . .  in the faces of men.  Huston's film benefits from its intelligent casting of the seamen.  The actors in the recent production are just pretty-boy imports from Los Angeles, rabble-rousers lacking the dignity that is gained from a lifetime of duty.  But that dignity is plainly visible on the rugged faces of the men in the earlier film.  One rarely sees that anymore.<br><br>. . .  in the faces of women, too.  The images of the women suffering as they watch their men go off to sea are utterly devastating, they hold so much emotional depth, so much beauty.  The attention to detail in Huston's film is striking:  the hairs on the chins of the old women, the tired, thick-skinned expressions of the wives and widows, the heavy shawls covering their heads.<br><br>. . .  in the performances.  Over 40 years ago when Orson Welles gave his performance as Father Mapple (a role which only a person with a special kind of magnificence could successfully take on), Gregory Peck might have been busily preparing for his role as Captain Ahab in the same film.  What a testament to Peck's stature as one of our leading actors that throughout his career he could play not only Captain Ahab but also, in the recent production, Father Mapple.<br><br>. . . in the color.  Huston's film is in Technicolor, a technique which produced colors not even seen in nature.  The sky is now blue now red now green.  The water is brown, pink, gray. Colors blend. Colors clash.  By comparison, how banal the colors of our post-Technicolor world!<br><br>. . . in the mouth.  The seamen have the exquisite mouths of pipe-smokers. The upper lip tight and stiff after so many hours pulled down in the puff.<br><br>. . . in the eyes.  My favorite scene is where Peck as Captain Ahab famously proclaims: \"Speak not to me of blasphemy.  I'd strike the sun if it insulted me.\"   The lighting, the acting, everything here is superb.  The camera is focused tightly on Peck's face.  The stark appearance of his eyes --  the tense, black irises all surrounded by gleaming white -- seems to reveal the subtext of the story.  His eyes electrify!<br><br>John Huston's film says more in its two hours than USA Network's says in four; it suggests a lot and explains little, whereas the latter tries to explain a lot but says nothing.  A great film, it doesn't butcher Melville's Moby Dick but adds to its power.","user":"Damion-2","rank":[103,117]},{"title":"Better and better each time you see it","rating":19,"date":"19 April 2000","review":"Some critics panned this pic when it came out - Peck too wooden, the script too cliched, etc, etc. Don't believe a word of it. I saw this one when I was 8 or 9, and for years I watched it every time it came on TV - even in B&amp;W! Peck isn't wooden, he's intense and fascinating (my favorite scene: in his cabin, saying to Starbuck, \"That bed is a coffin\"). The language may sound stilted, but it's MELVILLE'S, and the cast sink into it with conviction.<br><br>\nSome critic (I don't know which) has said that Moby Dick (the book) is an \"uncomfortable masterpiece\" - or something like that - meaning that it's a hard pill to swallow. The movie is bound to be a hard pill for many viewers as well. But that's their loss. Huston's movie is a great big powerful thing - you believe in Peck's crazy passion, in Starbuck's gentleness, in Ishmael and Quequeg's bond, in the evil of the whale, even. <br><br>Another favorite sequence: the Pequot becalmed, the crew lying about under the intense sun, slowly going crazy. The climactic chase is superb and thrilling, of course; what it all adds up to is a film about the elements, and our relationship to them. The whale is just the biggest of a whole slew that constantly threaten to destroy us. Nature, our natures - all the things we fight against with our intelligence, that threaten to engulf us.<br><br>Beautiful film, one of Huston's best. I find the analogy with Hitler/Nazis in an earlier comment very interesting. Another would be with an earlier Huston film, The Treasure of the Sierra Madre - another film about people taking terrible chances for reasons that don't stand up to a lot of examination, whose biggest obstacle turns out to be themselves. By the way, will someone please rerelease Moby Dick in a restored version so we can get a really good look at all that glorious Technicolor?","user":"ericl-2","rank":[73,84]},{"title":"A Fine Job of Filming a Challenging Novel","rating":20,"date":"20 September 2004","review":"It would be impossible to make a movie that came up to the standard of the novel \"Moby-Dick\", but this film does a fine job of capturing some of the most important themes, and of telling a selection of the key parts of the story in an interesting way. It would be a temptation for any film-maker to put the focus on the action and the special effects, and thus ruin the heart of the book by downplaying its themes, as so many recent films have done with other classic material. Instead, John Huston's version concentrates on bringing out many of the complex internal and external conflicts of Captain Ahab, in sketching the crew members and their reactions to Ahab's monomania, and in portraying the atmosphere of frequent tedium, growing tension, and occasional dread aboard the 'Pequod'.<br><br>Richard Basehart's mild, pleasant demeanor makes Ishmael an appropriate mirror for the events and characters on the ship. Gregory Peck does rather well in the very challenging role of Ahab. Ahab is one of the most carefully-designed and demanding characters in literature, and lesser actors would simply be an embarrassment in the part. On screen, there is much to Ahab that just does not come across, and Peck's performance has to be judged with that in mind.<br><br>Leo Genn makes his scenes as Starbuck count, and several of the other crew members are portrayed well, albeit in much smaller parts. As Father Mapple, Orson Welles has only one scene, but it is an important one, in that it sets up some of the vital themes of the story ahead. Welles was an ideal choice, and his scene in the church is one scene that does come up to the high standard of Melville's novel.<br><br>While there may indeed be some areas in which this version falls short, and it's fair to point them out, it would be pretty difficult to improve on it in a cinema version of the story. And if taken on its own, it fits together well, making generally good choices as to what material would fit together and would work on screen, and in using the photography and settings to create the right atmosphere. For those who appreciate the depth of the original story, this has more than enough to make it worth watching.","user":"Snow Leopard","rank":[56,65]}]