[{"title":"First Half Good - Second Half Bad","rating":6,"date":"22 December 1998","review":"That's what most of the other commentators say, and I can't disagree.  Part 1 (or the first half, depending on which format you're seeing it in) is great:  pitting some excellent child actors (including future star Seth Green of Buffy the Vampire Slayer) portraying some in-depth characters fighting against a demonic clown.  The second half seems more like a \"gee-wow - look who we got\" self-indulgence at casting Anderson, Thomas, Reid and Ritter, with very little to make us care about these folks.  The ending is also an incredible dumbed-down letdown, although in all fairness I don't think they could pull off King's ending, and most of the audience wouldn't understand it if they had tried.  There are a few touching moments in the last half, and Tim Curry couldn't screw up no matter how bad the writing is, but generally the two mismatched halves make for a mediocre film when it could have been so much more.","user":"Gislef","rank":[176,223]},{"title":"Solid adaptation of a great book","rating":6,"date":"6 November 2004","review":"This is a very entertaining made for TV mini-series. It does a good job at jamming a book with more than 1000 pages into 2x90 minutes movie running time. The most important parts have been adopted, unnecessary fat was thrown out, little amandments have been made, sometimes for better, sometimes for worse. The writers really tried to remain faithful to the novel and even mentioned side characters or story lines in short sentences for those who have read the book. The coolest thing, however, is that director Tommy Lee Wallace somehow managed to transfer that unique spirit of nostalgia, friendship and fear into his movie. Of course, the incredible cast deserves a lot of credit for that, too. Amazingly the child actors of part 1 upstage their adult companion pieces of part 2. The greatest performance of all, however, is given by Tim Curry, who really gives \"It\" a face, and a very scary one. He makes this movie what it is. In my opinion, it's the role of Curry's career, even outshining his part in \"The Rocky Horror Picture Show\".<br><br>Now for the bad sides of \"It\": as a made for TV project this movie obviously couldn't get too graphic and violent and that's a bit of a pity. Stephen King's book is awfully graphic and the movie would have been twice as scary if they had shown a bit more gore. Mostly Pennywise just appears and shows his sharp teeth and that gets lame after a while. The other big minus of this film is its ending. It has to be said that the ending in the book is so bizarre it's unlikely it could ever look good on celluloid. Still, those crappy special effects were just disappointing and made me (and everyone else I know) go: \"Is that what I've been waiting for the last 3 hours? That is the big climax?\"<br><br>Bottom line is that for a TV movie with such strict time limits \"It\" did a very good job at bringing this scary book to life. Nevertheless, I think the story should be retold properly and turned into a mini-series à la \"Twin Peaks\". The only problem is that it's going to be hard to find someone who can fill Tim Curry's giant clown shoes.","user":"Superunknovvn","rank":[124,155]},{"title":"A made for TV classic.","rating":10,"date":"24 June 2018","review":"Most know the story, a killer clown that terrorizes kids in a little town on the east coast. But many don't know this TV mini series follows the book much closer than the new release in 2017. This series is split into two parts. The first part is excellent. The second part is fair. What makes the first part of the film so good is the characters who play their roles. All seven of the children in this film are great actors/actresses. We are able to identify with them and follow them through the 1960s town of Derry Maine. Tim Curry who plays Pennywise is exceptional to say the least. He plays the clown that will forever terrify kids and grown ups for years to come. Overall the kids who play the part are great actors, with a good script, and beautiful cinematography throughout the entire first series. One of my favorite films!","user":"adriscoll-25665","rank":[20,23]}]