[{"title":"Bond had to catch that train...","rating":8,"date":"12 July 2005","review":"'Octopussy' begins at an East German circus, where 'a man in a clown suit' is chased through a dark wood by two circus knife-throwing experts The clown eventually gets a dagger in his back, but survives long enough to drop a fake Fabergé Easter Egg at the feet of the British ambassador <br><br>The clown is actually 009 in disguise, who is investigating a smuggling ring that uses carnivals and circuses for cover But the plot is much more grave than that <br><br>There is a rebellious Russian general called Orlov, assuming a fortuitous atomic explosion on an American Air Force Base in West Germany<br><br>Orlov's connection is an exiled Afghan prince (Kamal Khan), who is willing to help the Soviet general smuggle his deadly A-bomb into West Germany in exchange for Kremlin most remarkable jewels<br><br>James Bond enters the case, in London, to investigate the death of 009 He attends a sale at Sotheby's where a priceless super green egg (used by Czar Nicholas in 1897) is auctioned There he first sees Kamal Khan and his lady friend, Magda<br><br>Aware that Khan will get the Imperial Egg to fulfill some unknown but obviously vital purpose, 007 actually bids against the exiled Afghan prince, raising its market value over the top Although Khan eventually outbids him, Bond is clever enough to switch the real Fabergé egg with a perfect replica<br><br>Convinced that Khan is somehow mixed up in 009's murder, Bond is soon sent to India to find out why 009 was murdered<br><br>Bond remains the sophisticated man with a price on his head He pays a surprise visit to an island exclusively populated by attractive women He seems to like 'eggs, preferably Fabergé and dice, preferable loaded.' He maneuvers the world's smallest jet, and swings through the high trees to someone else's tunes He orders a ferocious beast to sit, and creates a spontaneous mass action by flinging 'hard currency' in the air... In a crucial moment, he appears to have a 'very good memory for faces and figures, survives a series of throwing knives, and gets caught on a train tracks He follows a plane on horseback for a terrific mid-air fight sequence<br><br>Maud Adams' Octopussy serves little purpose in the story taking a backseat to Kamal Khan's disloyalty Nevertheless she is a statuesque resourceful woman living with her stupendous sexy acrobats on a floating palace, developing a talent for illegal activities <br><br>Christina Wayborn's Magda actually steals the show from Maud Adams Magda is by far the prettiest of Kamal's friends exposing a 'little Octopussy' tattoo on her lower backHer dramatic exit from 007's bedroom certainly must rank up as one of the best memorable escape in any Bond movie<br><br>Louis Jourdan brings poetic elegance to a treacherous character He is quite sure that Bond is 'indeed, a very rare breed soon to be made extinct.'<br><br>Kabir Bedi plays the villain Gobinda, with strong hands that can pulverize so easily a pair of dice <br><br>Steven Berkoff plays Orlov, the wonderful Russian villain who surely is leaving the way clear for a full-scale Russian invasion of Europe <br><br>With John Barry beautiful score; the snake charmer playing the 'James Bond' theme; the disturbed fakir resigning his bed of nails; Bond climbing at a steep angle of an engaging décolletage; John Glen's 'Octopussy' is exotic, lush, very enjoyable and highly entertaining","user":"Nazi_Fighter_David","rank":[45,56]},{"title":"Anther great one","rating":4,"date":"4 October 2005","review":"\"Octopussy\" is really peculiar in the series. Because, for example, we see Bond dressed like a clown or keeping a plaster; there's an exotic and romantic atmosphere -which reminds us of some adventure books (like Emilio Salgari's \"Sandokan\" and \"The count of Monte-Cristo\"...) Here 007 has to travel between India and Germany for stopping a catastrophic plan of Soviet General Orlov and Afghan prince Khamal Khan.<br><br>With a little more parody than in the previous film \"For your eyes only\", \"Octopussy\" continues in the line of more down to earth Bond adventures.<br><br>Roger Moore's performance is good as usual, the cast is also remarkable -Louis Jourdan is one of the French actors who built a good Hollywood career, starring in films like Hitchcock's \"The Paradine case\" and Vincente Minnelli's \"Gigi\". He's Kamal Khan, a very charming and sophisticated villain -he's the criminal equivalent of Bond. Jourdan brings a special touch of glamour -you see he's an actor of the golden years of Hollywood!<br><br>Maud Adams is the only actress who played twice a Bond girl -she was Andrea in \"The man with the golden gun\".<br><br>Steven Berkoff is an established English actor, mainly for theater, but he played also in Stanley Kubrick's \"Barry Lyndon\".<br><br>Kabir Bedi is an Indian actor very popular in the second half of the Seventies -he was \"Sandokan\" in a famous TV film made by RAI, Italian public TV.<br><br>John Glen directs the film with a lot of fun and assures a great show. The film doesn't disappoint.<br><br>\"Octopussy\" is the last great Roger Moore movie as Bond, and maybe the last BIG Bond of the series as well -because it's original, lavish, acrobatic, romantic and pompous. <br><br>8,5/10","user":"michelerealini","rank":[54,70]},{"title":"Good fun, and a great Bond film!!","rating":9,"date":"24 August 2012","review":"This is Roger Moore's 6th Bond film and you can see that he has aged a bit since For your eyes only. The plot is rather nonsense, hard to follow and, like a lot of Bond films, not to be taken seriously. But for this film, the eight stars are for the sheer energy and work the crew have put into this film to make it funny, exciting and with heaps of stunts and action work. Roger Moore still has his great class from when he started in 1973 ten years before this film. Octopussy is based in India,with heaps of lovely big wide city shots with a scene showing India's jungle as well. The acting is fine, you don't need to worry about that and there are a few funny one-liners and jokes to keep the story from being to serious. All in all, take the film with a pinch of salt, its a bit of fun.... and a great popcorn film!","user":"xboy614","rank":[30,37]}]