[{"title":"Remarkable realism","rating":9,"date":"26 June 2009","review":"A Woman Under the Influence is an emotionally packed film that is centered around a capricious yet troubled housewife named Mabel. Mother to three young children and wife to her loving but volatile husband Nick, Mabel's mind is consumed with gaining acceptance and being reassured by those who surround her. Her psychological ability to keep up with normal everyday situations eventually reaches full capacity and she struggles to maintain emotional and mental competency.<br><br>Director Cassavetes intentionally chooses not to grant clemency to the viewer. Imagine walking in late to an opera that's in it's third act – that almost seems like what Cassavetes does to the audience – introducing his depiction of a distressed family while they're in mid flight. Gena Rowlands' portrayal of the likable but frail Mabel is nothing short of incredible, and Peter Falk gives an equally remarkable performance as Mabel's husband Nick. This film is not for the weak-hearted nor for those seeking traditional entertainment. It's distinctive approach to such an emotional journey will undoubtedly impede many viewer's enjoyment - but for those who appreciate unique cinema and realism, it doesn't get much better than this.","user":"thieverycorp76","rank":[36,43]},{"title":"Brava, Mabel!","rating":19,"date":"19 September 2004","review":"Everyone views movies differently. I for one didn't think we were meant to wonder who was crazier Mabel or her husband. Cassavetes makes a strong, bold (and rarely voiced) point...it is the husband! Mabel loved her children, loved to dance and sing and for that she was committed. Her \"unidentified mental illness\" seems to intensify when her husband mistreated her and was physically or verbally violent...in my opinion going a bit crazy after someone slaps you is probably healthier and saner than being polite, demure, and rational. <br><br>Mabel loves life, shows her love without apology, and is severely punished for it. Everyone else in the movie struggles to calm everyone down and avoid showing too much emotion. While this may be more socially acceptable it isn't sane or even healthy. Humans are emotional beings...I for one say Brava! Mabel. <br><br>I think the director tips his hand and proves his point when Mabel's character comes home from the institution. She hasn't seen her children, husband, and family for 6 months and people assault her, some she has never even met, before she even leaves the car. When she does get inside the safety of her own home the people who put her away and told to forget the past greet her with small talk and politeness! Then when she finally sees her children after being told to \"wait a minute\" she says to herself that she wants to remain calm and show \"no emotions.\" It seems obvious that this is a perfectly acceptable time to be emotional but fresh from the institution she know being normal doesn't allow you to be emotional. Emotions are scary, messy, and inconvenient and I for one am thrilled that John Cassavetes didn't shy away from them. <br><br>This movie is a true original.","user":"watt1975","rank":[74,100]},{"title":"A Bruising Portrait of Mental Illness","rating":8,"date":"10 July 2007","review":"Eeesh, what a tough movie to sit through.<br><br>This two and a half hour movie left me sweaty, exhausted and hollowed out. In its own way it's an extremely well done film, but I don't know that it's an experience I want to repeat. Director John Cassavetes follows a few months in the life of a family whose mother and wife (Gena Rowlands) is suffering from mental illness, and the movie consists of one long scene after another of her cracking up, or trying not to crack up, and the various family members' reactions to her cracking up. Peter Falk plays the husband and father who thinks that mental illness is just some silly nonsense his wife should be able to stop if she just tried hard enough. Rowlands has the showier role, but Falk is the revelation here. His depiction of a husband who blusters and shouts to hide his overwhelming sense of helplessness and fear is superb.<br><br>Cassavetes's camera is relentless. We watch Rowlands suffer again and again in long takes and intimate closeups. There are times when you simply want to look away from the screen to help this poor woman preserve a shred of dignity. The highlight of the film (or low point, depending on your point of view) comes when Rowlands's character returns home from a stay in an institution, and her family works overtime to convince themselves that everything's fine when the audience can see clearly that everything is not.<br><br>Bruising is the best word I can think of to describe this film.<br><br>Grade: A-","user":"evanston_dad","rank":[29,37]}]