[{"title":"Extremely funny, even better if you recognize the General Hospital cameos!","rating":18,"date":"18 February 1999","review":"This is a great movie.  The two subplots are almost better than the main storyline.  I've always liked Michael McKean and it was nice to see him in a serious role.  If you used to be hooked on General Hospital and recognize the characters in their cameo roles it's even funnier.  It's very seldom seen on television but well worth watching, even though they will cut it up a bit.","user":"Julep","rank":[11,13]},{"title":"Garry Marshall's attempt at a spoof","rating":28,"date":"28 May 2002","review":"When I was younger, this was one of my favorite movies.  Don't ask why... just accept it.  I remembered the little things.  Michael McKean cutting out the pinatas appendix as a child.  The kids imitating Sean Young as she goes into convulsions during a dance class.  Gary Friedkin trying to hang up the phone (he's a 'little person'... you know the scene.)  The Philadelphia F'in Philharmonic.  Harry Dean Stanton... as though you need anything more, right?<br><br>I bought a used copy in the late 90s and watched it again... oh boy... nowhere near the film I thought it was.  Then I realized it followed up Airplane! and several other like-minded spoofs of the day.  It was confused in a lot of ways, as though it wanted to be raunchy but wasn't sure how to do it.<br><br>I still like the film in bits... some of them are genuinely funny.  But as others said, it has a genuine sitcom feel to it.  This is Marshall's first film after having worked in television for over 20 years and considering his track record since, you can tell he learned a few things from this film. After this, he went on to make Pretty Woman, the Runaway Bride, and Frankie &amp; Johnny, all of which are decent films.  Of course he also directed Exit to Eden (Rosie O'Donnell and Dan Aykroyd in bondage-wear?  OUCH!) but we'll forgive him for that...","user":"insane_larry","rank":[10,12]},{"title":"One Of The Best Spoof Movies I Have Ever Seen!!!! Totally Underrated!!","rating":9,"date":"15 August 1999","review":"The title \"Young Doctors In Love\" is perhaps the most mis-leading title ever to be placed on a movie. It sounds like a passionate love story and not like a hilarious \"spoof\" movie that it is. This spoof movie is right up there with the \"Airplane\" and \"Naked Gun\" movies, and far better than the spoof movies of the 90's such as \"Wrongfully Accused\", \"The Silence Of The Hams\", \"Hot Shots\", and \"Mafia\". Rather than poking fun at other movies, \"Young Doctors In Love\" has an original idea for a spoof movie....A Total Satire On Hospitals!!!! It may sound crude or it may sound boring, but it's nothing less than hysterical and once you view it you'll find out for yourself. I loved Michael Richards' performance as a hit man who tries to assassinate a mafia godfather who is a hospital patient but has trouble finishing the job due to his mis-identity. Hector Elizondo is great as the godfather's son who dresses up as a woman to disguise himself from the other gangsters! There are great one-liners! Dabney Coleman was marvelous as an insane surgeon! Every doctor, along with the patients, have something comical about them that makes all of the jokes that are pulled in this film work 100%! If you love silly movies, then this one is a treasure! Stay tuned during and after the credits! Great fun from beginning to end!","user":"MovieMan-112","rank":[18,25]}]