[{"title":"Why the film is worthwhile to me...","rating":26,"date":"26 April 2004","review":"Yes, DMCL is shot well.  Yes, the car chases are great.  And yes, if '70's kitch is what you seek, you'll find plenty of it here.  But that's not why I love the movie.<br><br>The reason I love the movie is this : the characters.  I've read other users comments regarding the lack of writing or character motivation, and there is validity to that.  But hey, the selling point of the film wasn't an in-depth look at people, the selling point was watching Peter Fonda and Susan George ram their car into several other cars.<br><br>But I digress, what I love about the characters (and what I hate about the characters in most action movies today) is that they are totally unlikeable.  They even hate each other. Fonda is a complete jerk to everyone.  Susan George rhymes with rich and Rorke is weak and ineffectual.  Hey, most the time the characters don't like each other. And it's my opinion that  these characters are unlikeable by design.  Think about it: when was the last time you went to the movies and the main characters were people you were suppose to dislike?  Rare is it that modern filmmakers will take that chance, Even more impressive, somehow you end up routing for these people.<br><br>Bottom line, it's a good chase movie, with solid performances by two 70's icons in thier prime.  If you manage to catch it, you'll probably have a good time.","user":"jcmazel","rank":[40,47]},{"title":"\"K-i-s-s o-f-f!\"","rating":7,"date":"15 October 2005","review":"Ostensibly a mindless, flashy car-chase-&amp;-crash B-flick has all the usual drive-in elements, but there's more going on here than at first appears. Two NASCAR enthusiasts, needing to buy a new entry vehicle, concoct an elaborate plan to rob a grocery store; Larry is the talent behind the wheel, Deke is the contemplative brains of the outfit. Soon they're saddled with good-time girl Mary, stubborn and sassy, who proves her mettle on a wild ride getting out of town. From Richard Unekis' book \"The Chase\", with a plot that is exactly that, yet the script by Leigh Chapman and Antonio Santean is surprisingly funny and literate and John Hough's direction is exceptionally tight with very little nonsense. Peter Fonda is appropriately manic, loose and shaggy, and Susan George has fun playing low-class (she has a tough time camouflaging her British accent, but it passes); every time Mary uses her brains, it provides more shading and substance in the character. Adam Roarke is a revelation as accomplice Deke, a sensitive, complicated man with heart and soul; he's not above larceny--he even masterminds it--but he's a thinker, and a realist. This film should have broken Roarke as a star in Hollywood, he is incredibly good. Vic Morrow has the standard role of the lawman on the trio's trail (he plays cat-and-mouse with them, and vice-versa, which is routine) and it's nice to see Roddy McDowall in a non-hysterical role as the supermarket manager. The chases are terrifically charged with adrenaline and excitement, and while the character animosities are trivial, the movie is stylish and wire-drawn. Apparently a big hit with Quentin Tarantino, who used a film-clip in his \"Jackie Brown\" (and adopted this picture's violent, jokey tone as well). Good show: *** from ****","user":"moonspinner55","rank":[31,36]},{"title":"Larry & Mary : Not A Bit Contrary.","rating":10,"date":"19 January 2006","review":"I'll kick this one off by saying I literally jumped for joy when I saw that \"Dirty Mary and Crazy Larry\" had \"finally\" been released on DVD! I haven't bought it yet but, I haven't seen this film in over 20 years but I remember it pretty well. When the movie aired on ABC in the late 70s,I just somehow ended up tuning in (as I've stated elsewhere,my parents made no big deal out of what I watched.) <br><br>Peter Fonda plays what is in my opinion an \"Easy Rider\" type character except his character is a loser. (Not meaning to quote a song here) Then along comes Mary who's young and not too bright herself. Then again,people who commit these kind of crimes aren't noted for being Rhoades Scholars! So,the acting and actions of these two are played exactly how they should be. Not really thinking intelligently.<br><br>Vic Morrow did a great job and yes,him waiting for a helicopter to arrive is quite \"chilling\",now that I recall that scene. One thing I knew when I saw this,is that Mary and Larry were the \"bad guys\". Lots of movies like this one then would have made these two \"anti-heroes\".<br><br>I know some folks here find the ending down-beat but i for one think it's the right ending. Any other,to me,sends the wrong message. Without giving it away,when I saw what transpired,like most people,I couldn't believe it! I want to say more on that subject but I'd spoil the ending for others.<br><br>This movie is a non-stop ride and a very exciting one at that. If I can still be this excited about it after all these years since seeing it,it''ll certainly be worth the $20.00 + when I buy it. You should too! (END)","user":"happipuppi13","rank":[19,21]}]