[{"title":"Depressing but impressive","rating":8,"date":"29 August 2007","review":"Wren (Susan Berman) is a restless young woman trying to break into the music scene in NY of the early 1980s. A young, handsome and trusting man named Paul (Brad Rijn) falls for her--but she just uses him and tries to hook up with self-centered Eric (Richard Hell) who says he has contacts to get a career going.<br><br>This was a very impressive directorial debut by Susan Seidelman. It was made on a very low-budget and had mostly nonprofessional actors. It was surprisingly a favorite with critics and a success with art house college audiences of 1982. However it's pretty much disappeared since then. It's easy to see why. The clothes, music and attitudes are all clearly from the early 1980s. Most college kids today wouldn't know what to make of this. Still it's a good movie and, as a college kid from that era, I can honestly say this caught the look and feel of that time expertly. Purportedly this is also a pretty accurate portrayal about how the Village was way back then--hard to believe it was 25 years ago.<br><br>The film itself is gritty and negative and looks cheap--but that's because it was and it actually helps the movie. Seidelman's direction was actually pretty assured considering it was her first feature movie. Also, for the most part, the acting is good--Rijn in particular stands out. The only negatives I can think of is that is a depressing movie and Berman is miscast. She's a good actress but seems far too intelligent for the character she's playing.<br><br>Worth catching--especially for men and women who were in college in the early 1980s. It will really take you back! I give it an 8.","user":"preppy-3","rank":[21,21]},{"title":"Brilliant","rating":9,"date":"31 December 2003","review":"Unromantic view of East Village life perfectly captures the people and the place. Depressing and totally convincing. I love the first couple of minutes, which so perfectly and wordless establishes the character of the protagonist and the style of the film. And the score is terrific. Seidlemann's first and best film, an indie sleeper.<br><br>I've shown this movie to two girlfriends, neither of whom were as thrilled as I was, so it's possible some of my love for this movie is because I remember that East Village. I didn't hang out with the sort of characters in the movie, but I did see them around the neighborhood and found them intriguing.<br><br>I can't believe this sleeper hit and critical darling only has a six on IMDB!","user":"cherold","rank":[27,28]},{"title":"Nu-Wav \"Documentary\"","rating":9,"date":"15 March 2000","review":"There's something about black and white checkered miniskirts in 1982 that sums up an entire era.<br><br>\"Smithereens\" documents a brief history of an archetype that many are familiar with: the Hip Urban Street Punk on a Path to Nowhere.<br><br>What makes this film superb is that it treats the subject with a frank honesty rarely seen in such a genre. No happy endings, convoluted plot points or moral judgments are imposed upon Wren as she bumbles about New York trying to make her way.<br><br>She is neither likable nor despicable. Belonging to no demographic, she creates her own. She has vague desires, but no goals. And as such an aimless character, the film's closing shot is quite perfect.<br><br>\"Smithereens\" is an engaging, refreshingly stark 'documentary' that does not gloss over its themes with the glitz and glitter otherwise prevalent in the early 80's. It successfully encapsulates a time and a lifestyle rarely portrayed correctly, except maybe in \"Sid &amp; Nancy\".","user":"MarquisDD","rank":[34,36]}]