[{"title":"A legendary exquisite musical...","rating":10,"date":"22 August 2002","review":"Audrey Hepburn is radiant and touching as the poor flower seller Eliza Doolittle who challenges her mentor's makeover powers, before eventually passing for a lady in London society... She is skillfully transformed into an elegant lady by a speech professor Henry Higgins (Rex Harrison) and taught to speak properly... From first frame to last, the film is slick, graceful, gorgeous to behold, with costumes and sets richly evoking the Edwardian era...<br><br>'My Fair Lady' begins in London, on a rainy evening outside Covent Garden, where a 'respectable girl' is selling bouquets of violets... Professor Henry Higgins, a phonetics and linguistics expert, confronts the 'deliciously low so horribly dirty' Eliza Doolittle for the first time...<br><br>In the best tradition, their first songs reveal their characters: 'Wouldn't It Be Loverly?' expresses Eliza's own ideas of what she dreams, while in 'Why Can't the English Learn to Speak' Higgins sings his despair over the deterioration of the English language, and displays his hard, irritable, intolerant, and elegantly arrogant nature...<br><br>Lerner and Loewe's songs are shear delight as the story moves from Higgins's wager with sympathetic Colonel Pickering (Wilfrid Hyde-White) that he can change the street girl with a strong cockney accent into a different human being by teaching her 'to speak beautifully' and pass her off in an upper class lady within six months... Higgins and Pickering are both single men, and the housekeeper, Mrs. Pearce, has misgivings about the way in which they are proposing to amuse themselves without caring about the consequences for the \"common ignorant girl.\"<br><br>The songs are extraordinary in their ability to enrich our knowledge of the characters... Higgins' early song 'I'm an Ordinary Man' confirms that he is a 'quiet living man' without the need for a woman... Alfred Doolittle's 'With a Little Bit of Luck ' not only states his general philosophy of life, but exposes the perfect portrait of a friendly scoundrel... Eliza's father, who calls himself one of \"the undeserving poor\" is one of Shaw's best comedy creations... When he arrives to protest at the immorality of Higgins and Pickering treatment of his daughter, it soon becomes clear that he just wants to gain something for himself out of the situation... Eliza, becoming subject to Higgins' intimidation, belts out her discomfort at the rude, selfish Higgins, imagining a king ordering his death, in \"Just You Wait, 'Enry 'Iggins.\"<br><br>The music is also a logical extension of the characters' feelings... When Eliza finally pronounces impeccably: 'The rain in Spain stays mainly in the plain,' Higgins can hardly believe what he has heard: ('By George, she's got it. Now once again, where does it rain?'), and Eliza ('On the plain! On the plain!') and Higgins simply cannot be contained ('And where's that soggy plain? ') Eliza responding: In Spain! In Spain! They sing a duet together to celebrate their success... The scene leads to one of the most triumphant sequences in musical history...<br><br>Further, the stunning scene in which Eliza Doolittle appears in high society when she meets Higgins's mother (the impeccable Gladys Cooper), and attends the Ascot races... She instantly charms a young admirer Jeremy Brett (Freddy) by her slightly odd manner of speaking, who later haunts Higgins' house (\"On the Street Where you Live\").<br><br>The climax comes at the Embassy Ball, where Higgins' protégé, now \"an enchanting young lady\" charms everyone with her beauty... Her exercise is an unqualified success... Her waltz with the Queen's son, and other dance partners, spreads throughout the audience about her identity...<br><br>Henry and Pickering are ecstatic... They congratulate each other for their \"glorious victory,\" ('You Did It'), but Eliza is hurt and angry at being ignored... They barely acknowledge her presence... She is no longer a part of any world... When Higgins returns for his slippers, which he has forgotten, Eliza flings them angrily at him, and voices her feelings: 'Oh, what's to become of me? What am I fit for?'<br><br>In an attempt to find her true identity a frustrated Eliza encounters Freddy who declares his love for her, but she returns to the populated flower market outside Covent Garden, where no one recognizes her... Her own 'miserable' father - tuxedo-dressed - gives her the cheerful news that he is about to get married...<br><br>In the closing scenes, Higgins is upset to discover Liza has left him and is led to wonder why 'can't a woman be more like a man? Men are so honest, so thoroughly square.' Eliza surprises Higgings with her decision to marry Freddie, and claims: 'I shall not feel alone without you. I can stand on my own without you. I can do bloody well 'Without you!'<br><br>At his home, at dusk, Higgins ultimately recognizes Liza's quality... He recalls Liza and realizes how much she has come to mean to him... Without her, he is lost and lonely... <br><br>The climax is a great ending to a great musical...<br><br>'My Fair Lady' has great style and beauty... The film describes what is common in many societies... That accent determines the superficiality of class distinctions... The motion picture is humorous, notably the wonderfully steamy bath in which Prof. Higgens' female staff cleanses the accumulated dirt of the street off Eliza Doolittle...<br><br>With the dazzling splendor that director George Cukor offers: the designer's eye for detail, the painter's flair for color, the artist's imagination, and the delicacy of handling, the film garnered no less than twelve Oscar nominations, and took home eight statuettes including Best Picture of the year, Best Actor- Harrison, Best Director- Cukor, as well as Best Art Decoration, Sound, Scoring, Costume Design, and color Cinematography...","user":"Nazi_Fighter_David","rank":[117,192]},{"title":"The character of Henry Higgins is greatly misunderstood by many and so is the film.","rating":8,"date":"28 December 2003","review":"I have read in a great many places (including the IMDb) that Henry Higgins is a misogynist.  It has also been said that the film is a misogynist's fairy tale.  Anyone saying this has clearly not watched this film too closely. <br><br>First, Higgins is not a misogynist.  A misogynist hates women.  What Higgins is, in reality, is a misanthrope.  A misanthrope basically dislikes and distrusts everyone!  Watch the film and you'll notice that Higgins treats everyone with the same disregard-Col. Pickering, Eliza's father, his own mother-everyone receives his rather cynical disdain. Some of the minor characters come off being treated worse than the principals do.  It's simply more noticeable with Eliza because it's more frequent, it's newer with Eliza because the other principal characters have known Higgins longer and thus take it in stride.  The myth that Higgins is a misogynist is perpetuated by the song, \"Why Can't A Woman Be More Like a Man?\".<br><br>Second, it can hardly be called a misogynist's fairy tale.  If that were the case, I doubt Alfred Doolittle would have cause to sing, \"Get Me To the Church On Time\", as he'd hardly be getting married.  His life is just as \"ruined\" as Eliza's by his encounters with Higgins, just as altered as her life has been.<br><br>This is a great musical, a good movie and it was even better as the original play by Shaw.  Well worth seeing.  Recommended.","user":"llltdesq","rank":[167,280]},{"title":"A musical with a brain as well as a heart","rating":10,"date":"28 August 2003","review":"There's a lot of negative things been said about Audrey Hepburn's interpretation of the role of Eliza. Perhaps she's not ideal in the earliest scenes of the movie - her \"dirtiness\" is never quite believable - but it has to be said that despite this smallish drawback she still glows, and makes an amazing Eliza overall.<br><br>The reason for this is simple; Audrey Hepburn brings her \"own spark of divine fire\", (to quote Higgins) to the role and her vulnerability, mixed with her sweet, naive charm and even her wonderfully juvenile pettishness shown in \"Just You Wait\" all prove what a talented actress she really is. For an example of this, just watch Eliza's facial expression at Ascot, when she realises her opportunity to demonstrate her new-found mastery of the English tongue - sweetly hilarious.<br><br>MFL has been criticized as being too romanticized, too overblown. I disagree; musicals are suposed to be lavish affairs, and none pull it off quite so well as \"My Fair Lady\" does. It's a momentous film but it has its subtle points: watch the way in which Eliza's eyes are centred on Higgins when she enters at the ball, and the way in which the two of them stare at each other for a few seconds at the top of the stairs a few moments later.<br><br>\nIt musn't be overlooked that, thanks to its being based on a Bernard Shaw play, \"My Fair Lady\" has what the great majority of musicals lack: a deeper meaning and something really quite profound to say.<br><br>The actor in the role of Colonel Pickering is a little weak, but it must be said that Rex Harrison IS Henry Higgins. In a lot of ways (in fact, in most ways) Higgins has an objectionable personality: rude, snobbish, impatient and even misogynistic, but somehow Rex Harrison pulls it all off and makes us like Higgins without betraying the character. As to romance, his song \"I've Grown Accustomed to Her Face\" is an ode to the kind of love which sneaks up on you. Overall, this movie is romantic, but not too sentimental. It has just enough romance to be dramatically fulfilling, but it never becomes soppy or mawkish. The word \"love\" is never mentioned at all and the two leads never even kiss. The famous end sequence is perfect and does the movie justice; after all, a big happy bow tied around a perfect romance at the end would simply not fit with everything we have learned about the two protagonists.","user":"eliza-doolittle","rank":[104,173]}]