[{"title":"A stylish crime drama from the late silent era that still packs a punch","rating":9,"date":"12 March 2005","review":"Books and essays about the gangster genre often cite Josef Von Sternberg's Underworld as an early, influential milestone, but unfortunately it's not easy to track down in any home-viewable format. Recently I was lucky enough to see this film in a theater, accompanied by live music in a packed house of enthused buffs. Whenever possible, this is the way to see a silent movie! The combination of a good score and the response of a simpatico crowd can really bring these works to life. And while there are some dramas of the '20s that show their age and provoke giggles at the wrong moments, this one is not in that category. Underworld holds up, and offers an unlikely yet oddly credible romantic triangle set in a milieu of violent crime. Like all of Von Sternberg's work it's exquisitely well photographed, and like many late silent films takes full advantage of a range of dynamic devices, including a \"whip-pan\" from face to face in one early scene and a startlingly fast montage of close-ups in another. But what makes this movie click isn't flashy cinematography or editing, it's the chemistry between a trio of top-drawer players working at full steam.<br><br>The story is built around three personalities: Bull Weed, played by George Bancroft, \"Feathers,\" played by Evelyn Brent, and \"Rolls Royce,\" played by Clive Brook. Bancroft is unforgettable as Bull, an outlaw of the old school who robs banks and jewelry stores single-handed. The character is, in some respects, the model for gangland kingpins played in later years by Jimmy Cagney and Paul Muni, and yet in a sense he's not a \"gangster\" at all, for he works solo and has only a handful of allies who show up at key moments and then vanish. Bull doesn't travel with bodyguards or hang out with the boys; despite his natty suits and urban lifestyle he suggests a Western bad man who rides alone. In the early scenes when he's at the top of his game Bull is boisterous, punctuating every conversation with gusts of hearty laughter, but as his situation darkens the laughter vanishes and the guy suddenly resembles an actual bull in an arena, grim and beady-eyed, still physically powerful but cornered and bewildered over how it could have happened. It's easy to see why this performance made George Bancroft so popular at the time: he's a larger-than-life actor with one of those homely/attractive faces, along the lines of an Edward G. Robinson or a Wallace Beery, not handsome but decidedly charismatic.<br><br>The beautiful Evelyn Brent is Bull's girlfriend Feathers, so called because of her feathery outfits. Although her character is not as fully delineated as Bancroft's Brent manages to convey a great deal of information with her fascinating eyes. It's clear that Feathers is a lot more intelligent than she lets on. She stays with Bull out of loyalty and gratitude but is well aware of his limitations, and increasingly unhappy about her own dependent status as his \"moll.\" When an opportunity arises to run away with a more attractive and substantial guy she is immediately tempted, even if it means toying with the idea of betraying Bull to the cops, but she's also decent enough to recognize her obligation to him. Bull, after all, risks everything as a direct result of defending her honor when she's attacked. Feathers, despite her froufrou outfits and a nickname more suitable to a bimbo, is smart, sensitive, and surprisingly ethical for someone in her position.<br><br>Bancroft and Brent are terrific, but for my money the most memorable performance in Underworld is delivered by Clive Brook. Before this I'd seen Brook in several other films (including Von Sternberg's Shanghai Express opposite Marlene Dietrich), most often playing noble, stiff-upper-lip Englishmen, handsome and respectable but just a bit dull. Here, Brook is a revelation. In the opening scenes he's so decrepit he's not even recognizable, playing against type as a washed-up bum, unshaven and bleary-eyed. We learn that Brook's character is an attorney who went crooked and eventually became an alcoholic, but we aren't told much more. However, like Brent, the actor tells us everything we need to know that isn't directly stated in the text. His transformation begins when Bull Weed takes a liking to him, nicknames him \"Rolls Royce\" and makes him, in effect, his lieutenant. Much of what happens after that point concerns the growing tension between the three characters as an unavoidable attraction develops between Feathers and Rolls Royce, although they fight temptation and struggle to remain loyal to their boss. The scenes between the trio really heat up as the sexual tension between Feathers and Rolls Royce deepens.<br><br>Underworld isn't as flamboyantly violent as some of the famous crime flicks of the '30s and '40s, but there are a number of stylistic touches that mark it as a definite progenitor of those films. For instance, just before the climactic gun battle, Bull takes a sympathetic interest in an orphaned kitten, a motif echoed years later in This Gun for Hire. At another point, with rather heavy irony, a crook is gunned down in a flower shop before a wreath reading \"Rest In Peace.\" A drawback as the film rolls along is the pile-up of increasingly unlikely plot twists, especially where Bull's escape from jail is concerned, although the momentum of events tends to carry the viewer along. Also, while the writing is generally taut, one title card during the gangsters' party sequence is so over-written it suggests a witches' coven. (This line drew chuckles at the screening I attended.) Aside from that unfortunate lapse into purple prose, Underworld holds up beautifully, at least as well as the more familiar gangster classics of the '30s it influenced. This film deserves the attention that should come with a full restoration and greater availability.","user":"wmorrow59","rank":[44,44]},{"title":"A question of loyalty","rating":9,"date":"22 July 2004","review":"In a way, I suppose this film simply managed to push all the right buttons so far as I was concerned. The basic theme of conflicting love and loyalty is one that has always called to my heart, and the central trio of characters happen to tap into stereotypes of instant appeal: gentle, honourable intellectual - sharp-witted and independent beauty - and brash, brave brute of a bully, as intemperate in his passions as in his lack of taste, and yet not wholly without merit.<br><br>But while the initial premise may benefit from join-the-dots attraction, it is the performances and execution of the film that give it its power. All three principals do an outstanding job. Clive Brooks, as the educated man brought low by drink and redeemed by the casual generosity of a gangster, makes use of every shading of expression in a sensitive face, conveying more with fewer words in one glance than anyone else in the cast. His scenes with 'Feathers' are a tour-de-force. Despite his reticence, it's easy to credit that he is not only the most intelligent but - with the ironic vulnerability of the civilised man amidst those who live by tooth and claw - the most idealistic character in the film. Having thrown his lot in with criminals, he does the best he can to keep faith; but his eyes betray everything he cannot say.<br><br>Evelyn Brent has perhaps the hardest task, that of raising the moll 'Feathers' into more than just an object of general desire and appendage to her man. From her very first scenes - where she publicly adjusts her garter beneath the thigh-skimming hem of her dress - she radiates allure. But she also comes across as more perceptive and quick than her consort, and far more collected and self-contained. It's not hard to understand her roving eye when she meets a man more intriguing than Bull Weed, the jovial vulgarian who maintains her in the lap of luxury; but it is to the credit of George Bancroft, as 'Bull Weed', that we also sympathies with her reluctance to leave her protector in the lurch when she has the chance.<br><br>My admiration for Bancroft's acting gradually increased throughout the film. At the beginning he comes across as little better than a ham, gesturing over-widely and falling into uproarious laughter that is a little too loud and a little too long. But as time progresses it becomes evident that it is not the actor but the gangster himself who is playing a larger-than-life role, and when Bull Weed's defences slip we start to see the limited, confused man behind the act. Striding drunkenly for revenge, he transcends his humanity to become a lurching, elemental force. In court he shrinks to an uncomprehending ox of a man, all swagger gone. And finally, in perhaps Bancroft's finest achievement of all, with no audience left to play to but the shadows, Bull Weed in his betrayal becomes merely human, sinking back into the pretension-free gutter from which he must once have climbed. His last scenes carry a conviction and depth of character on which the success of the film ultimately rests, and which would have been all but unthinkable at the start.<br><br>Besides all this, the film itself is quite simply beautiful; beautifully made, beautifully lit, beautifully shot. It's no wonder that it was a smash hit by word of mouth, nor that it still stands up today, where the use of cruder sentiment or melodrama might long since have reduced it to the status of mere historical curiosity.","user":"Igenlode Wordsmith","rank":[24,24]},{"title":"ethics","rating":9,"date":"20 July 2003","review":"One of the great joys of prohibition-era gangster films is the colorful dialogue spat out by the likes of James Cagney and Edward G. Robinson.  As that element would, obviously, be missing from a silent film, I wasn't sure how I would react to Underworld.<br><br>Not to worry.  This is a great film, one of the best prohibition-era gangster films I've seen, ranking slightly ahead of Little Caesar and the Public Enemy, and maybe only slightly below Scarface (1932).  Tough, tense, tightly written--interestingly, Howard Hawks is credited for the scenario--and with gorgeous DARK cinematography and Josef von Sternberg's usual excellence in direction.  I barely missed the lack of gangster-speak.<br><br>I suppose this film was a template upon which a lot of gangster films were based.  It struck me while watching it how much it had in common with the Coen brothers' Miller's Crossing (1990)--a love triangle between a mob boss, his moll, and his right hand man.  And it's all about the gangsters' peculiar code of ethics.<br><br>I'd rate it a perfect 10, but for a muddled and badly-handled prison break sequence, which I watched three times and still couldn't figure out. Maybe I'm just dense; maybe it was actually a genius bit of filmmaking and it just flew over my head, but for now, 9/10.","user":"plaidpotato","rank":[20,20]}]