[{"title":"A Demanded Sequel","rating":8,"date":"1 September 2005","review":"When Jesse James came out in 1939, the player that got the best reviews for that film was Henry Fonda who played the laconic older brother Frank. His reviews were so outstanding that it was almost a public demand that a sequel be done.<br><br>It almost didn't get done because instead of Henry King who directed Jesse James, Darryl F. Zanuck assigned Fritz Lang. Henry Fonda hated the man, he was a sadistic bully on the set and even though he directed Fonda to a great performance in You Only Live Once, Fonda hated every second on that set.<br><br>Fonda tells in his autobiography that he and Lang sat down prior to shooting and Lang agreed to tone his behavior down. But the same thing happened as on You Only Live Once. And Fonda dutifully finished the film.<br><br>Though he hated the experience Fonda was on the mark again as Frank James. What The Return of Frank James lacks in truth it makes up for in capturing the spirit of the times in the post Civil border state of Missouri and why the James Brothers were regarded as heroes by some.<br><br>In addition to Fonda, John Carradine, Charles Tannen, Ernest Whitman, Donald Meek, Henry Hull, George Chandler and J. Edward Bromberg repeat their roles from Jesse James so continuity is assured. Bromberg as the railroad detective who basically plans an assassination for Jesse James in that film and tries again to Fonda in this film particularly stands out.<br><br>So does Henry Hull as the newspaper editor/lawyer who was a very colorful character in both films, dictating the same editorial at whatever group or individual he doesn't like at the moment. His patented formula is to \"shoot 'em down like dogs.\"<br><br>If you liked Jesse James and I think more than western fans liked that film, no reason you shouldn't like The Return of Frank James.","user":"bkoganbing","rank":[24,26]},{"title":"A Satisfying tale of Revenge served hot!","rating":4,"date":"4 June 2002","review":"Thanks to the terrific cast and photography, this story makes a terrific western. Henry Hull is terrific as major Cobb, who expresses justified Southern outrage over the depradations of the carpetbaggers and the railroads. Despite the ignorant comments of some who  dare to make a ludicrous comparison to fascism, what we get here is an honest expression of southern feelings. Yes, there was a condesencion toward blacks then, but let film show it as it was, let's not try to rewrite history or create a pleasing fiction as all too many modern films do. 'Shoot em down like dogs??!' I would dearly love to see Major Cobb in a modern day courtroom, giving fire and damnation to the lawyers and other parasites that hide behind suits and ties! This is a real satisfying film and Gene Tierney never looked better.","user":"d1494","rank":[16,17]},{"title":"Gene, Fresh On The Scene","rating":7,"date":"27 June 2011","review":"The sequel to the previous year's \"Jesse James\" (1939), \"The Return of Frank James\" is a perfectly entertaining, fast-moving Western that is historically important for two reasons: It was director Fritz Lang's first picture to be shot in color, and it served as the setting for the debut of one of Hollywood's most beloved actresses, Gene Tierney. In her 1979 autobiography \"Self-Portrait,\" Gene tells us that Fox Studio head Darryl F. Zanuck had seen her performing on Broadway in 1940 in \"The Male Animal,\" and immediately offered her a contract. After a previous stalled career in Hollywood, however, Gene--and her family--managed to finagle an unusually liberal deal from the studio chief: $750 a week, with a raise every six months, and the freedom to return to Broadway for half the year (an option that Gene never took advantage of), AND the right to make no changes to her hair or (soon-to-be-famous) teeth. In her first film for Fox, 20-year-old Gene played the role of Eleanor Stone, a liberated woman and nascent reporter on the Denver Star newspaper of 1882. She is duped by Frank James (Henry Fonda) and his sidekick Clem (Jackie Cooper, who had grown up a LOT since playing the role of kids a mere 10 years before, in films such as 1931's \"The Champ\") into writing a false story of the outlaw's demise, so that he might more easily track down the Ford brothers (John Carradine and Charles Tanner), who had just shot Jesse in the back and gotten away with it. Gene is excellent in her ingenue role, fresh faced and dewy eyed, and hardly deserving of Harvard Lampoon's \"The Worst Female Discovery of 1940\" citation.<br><br>As for the rest of the film, it is nicely shot and filled with amusing characters and situations. Besides Fonda and Carradine, Donald Meek returns in this sequel (a bit tougher than usual, as the conniving railroad man McCoy), as does Henry Hull (almost stealing the show as Frank's buddy Major Rufus Cobb). The film contains surprisingly little action per se, although a horse chase through the Rockies and resultant gunfight, coming at the picture's midpoint, are very well executed. Fonda, who had worked with Lang before, in 1937's \"You Only Live Once,\" is very fine here as Frank James: sympathetic, cool and tough; a reformed badman with a conscience, and perhaps only 1/100th as nasty as he would be 30 years or so later, playing another Frank, in Sergio Leone's \"Once Upon a Time in the West.\" Tierney, apparently, absolutely adored working with Fonda, especially after he defended her against the director. As Tierney reveals in her book, she had the unfortunate habit of keeping her mouth slightly parted when she wasn't speaking (an adorable habit, sez me!), and Lang chastised her severely for it, yelling \"You little bitch! When you have no lines, keep your mouth shut!\" Little could Lang know that that mouth and those teeth would soon make Gene one of THE preeminent screen goddesses of the 1940s! Anyway, although \"The Return of Frank James\" has been faulted elsewhere for its many historical inaccuracies, it remains a fun enough diversion. Capped off by one of the most amusing trial scenes since The Three Stooges' \"Disorder in the Court,\" the film is perfect for all ages, and most especially, of course, for fans of Miss Gene Tierney....","user":"ferbs54","rank":[11,12]}]