[{"title":"This film n Charles Bronson sure was something man.","rating":9,"date":"14 November 2019","review":"I first saw this in the late 80s on a vhs. Was dying to revisit this film for a long time. Revisited it few days back. This film n Charles Bronson sure was something man. To see Bronson in such a remarkable physical condition is truly inspiring. He was about 54 that time.<br><br>The film has a western n country feel to it, soothing n without the hustle and bustle. The music too is simple.<br><br>A man named Chaney (Charles Bronson) arrives somewhere in Louisiana during the Great Depression. We don't kno whether he is a hobo, an ex convict, a deserter or an asylum seeker but he sure is a freighthopper n a very good fighter.<br><br>He comes upon a street fighting competition n after observing a bare knuckled fight, he approaches the manager (James Coburn) of the losing fighter n asks the manager to set a fight for him but cautions the manager that he needs only enough money to fill a few in-betweens before moving on.\nBefore his first fight the opponent finds our hobo a little too old to be participating in such kinda fights to which our hobo responds to him with his knockout punch.\nIn one of the competition in the bayou side, our hero is cheated n not given his winning amount. This one is replicated in Christian Bale's Out of Furnace where Woody Harrelson's character doesn't give the winning amount to Casey Affleck's character.\nA bad image of the Southern sportsmanship.\nOur hobo gets to fight Jim Henry (Robert Tessier) a well built, grinning, head-butting skinhead.\nThe film has good fights minus the blood n the elaborate period recreations is top notch.\nInspite of the Great Depression, the debts n the gambling habits, James Coburn's character is seen sitting in his open balcony with his feet upwards. Now that is something so relaxing n carefree attitude.","user":"Fella_shibby","rank":[28,28]},{"title":"Just perfect !! Why don't they make 'em like this anymore ??","rating":10,"date":"14 July 2006","review":"Just a few days ago I saw HARD TIMES again, after I had seen it already twice some 10 to 20 years down the road. I did remember that I liked it a lot then, but I was not prepared to see how great it actually is! This is one of the movies that gets better with every viewing (liek THE OUTFIT with Bob Duvall)!! Glorious, just perfect and that in EVERY DEPARTMENT!! The OPENING SCENE is so beautiful, it makes you fall on your knees! A long shot of a slowly arriving train in beautifully landscape and run-down buildings of New Orleans, SUPERBLY shot in first rare camera-work, THE MAN standing framed in the door of one of the trains' wagons, the music (and what music, DeVORZONs probably best score, still unreleased = a shame!) starting slowly and you immediately realize here's a drifter, a taciturn MAN arriving in town. Charlie looks sad, run down, tired, WITHOUT mustache, not having had much luck in live. These are just the first 3 or 4 minutes, but one probably never will forget them. GREAT! Like many of the directors, who started their work in the 70ies, Walter HILL is no exception to the \"rule\", that most of them (if not all of them) made their BEST picture within their first 3 movies released (Carpenter: ASSAULT, Spielberg: DUEL &amp; SUGARLAND EXPRESS, Coppola: THE CONVERSATION, M. Ritchie: PRIME CUT, John Boorman: POINT BLANK, ...): Wlater HILL made HARD TIMES as his debut and although he made some nice pictures later-on, none of his later pictures (the DRIVER, which is # 2 included) could beat HARD TIMES. It's - like EMPEROR OF THE NORTH POLE - a really beautifully shot study of depression-era America.<br><br>Bronson's muscles are - THE MAN being in his mid-50ies then !! - just unbelievable, slim, trim, knock-out hard, every ounce hardened flesh (check out CHATO'S LAND, too!), his acting is 100% on target (he does not look \"bored\", how some stupid critics wrote, but the way unlucky-in-life depression-era people would most likely look: sad), he is the ideal man for this role, and that just a year after he made DEATH WISH, which proves he was not out for an easy follow-up movie and certainly far away from getting as type-cast as Golan &amp; Globus made him from Death Wish II (1982) onwards (sigh &amp; weep).<br><br>JAMES COBURN is great, too, maybe slightly overdoing his sleaziness, but great nevertheless. Jill Ireland has her usual bit-part, she's fine &amp; OK, but not outstanding, whereas nearly all the other character parts are just that: outstanding! Nobody plays himself into the foreground, but everybody fits his part 100%. You'll hardly find any other movie, where the whole cast is as great as in this one.<br><br>The STORY is simple but true! I just can't stand those fancy elaborated twist-here twist-there stories , straight forward simple but high-crafted storytelling, one of THE craftsmanship's of US cinema in the 40ies to 60ies (Ford, Mann, Huston) is brought here to another peak! The Camera-work is outstanding, too,a s is Barry DEVORZON's superb bluegrass/jazz/hillbilly score (release it, please!), which is probably just half an hour of music, but certainly deserved a full or at least half-CD release.<br><br>In short: BREATHTAKING and certainly one of Charlies best movies of the 70ies (when he made all of his best movies), truly at the same level as MECHANIC &amp; CHATO'S LAND, beating (a little) BREAKOUT and MR. MAJESTYC.<br><br>10 out of 10! Go and see yourself!","user":"wmjahn","rank":[20,20]},{"title":"Bronson's Best","rating":10,"date":"23 January 2006","review":"Of all the movies I have seen Mr. Bronson in \"Hard Times\" stands out to me. He should have been given an Oscar for this time piece.<br><br>We currently have Spiderman,Batman and Superman etcetera, as the contemporary super heroes of our day. Charles Bronson as Chaney outdoes them all without ever leaving the ground. You feel when watching this movie that you are right there in New Orleans. Charles Bronson as Chaney is hard as nails and yet you feel as if he could be your best friend. If you needed bullies to be knocked down you would want Chaney on your side.<br><br>Many times I have heard the question \"what is a real man?\". Chaney is I think the perfect picture of what a real man is, or at least the way most good men would want to be. Chaney is fearless,shrewd,compassionate.I could go on and on. Oh he also like the ladies.<br><br>I have seen this movie more times than I can count and I know I will watch it again. Whenever I recommend a Bronson flick this is the one. The rest of the cast was chosen to perfection, I could mention each. Just see the film you will not regret it.","user":"salignac2","rank":[49,54]}]