[{"title":"\"We Have A Contract Of Depravity\"","rating":16,"date":"16 January 1999","review":"\"The Hustler\" is steeped in the seedy atmosphere of smoke-filled pool halls in the ugly urban hinterland of America. The Ames Billiard Hall is funereal in feel.  When 'Fast Eddie' Felson walks in with Charlie, his manager, Charlie remarks, \"These tables are the slabs they lay the stiffs on.\"  The film is about the talented men who perform, but equally about the talentless predators who exploit them.  The habitues of the pool hall cling to the shadows.  They wince when a blind is opened and sunlight gets in.  A new hustler enters, and these vultures gather silently on the margins.<br><br>Eddie is the youngster hungry for glory.  He and Charlie pose as salesmen and Eddie feigns drunkenness, hooking the punters by repeating an almost-impossible shot.  For all the slickness of the con, Eddie is impatient for bigger things.  He wants to challenge Minnesota Fats, the best hustler in the land.<br><br>Newman gets his name above the title, but this is a film with four exquisite pieces of acting.  Jackie Gleason as Minnesota, Piper Laurie as Sarah and George C Scott, playing Bert Gordon, turn in wonderful performances.<br><br>Eddie matures as the story progresses.  He starts as a cheap chiseller, hustling ten bucks, but ambition carries him to Louisville and the world of the high rollers.  Sarah's love opens emotional dimensions in him which he previously lacked.  Bert Gordon confronts him with his own spiritual inadequacies, forcing him to understand himself.  Eddie is jejune in the first game against the Fat Man, but by the second meeting he is emotionally strong, and completely his own man.  He has made the spiritual journey from the whining \"everybody wants a piece of me\" to the inner knowledge that Sarah bequeathed him - that only those who give can truly live.<br><br>Bert Gordon, with his dark glasses and hawkish features, is a creature of the night.  Loving the 'action' of a clash of talents, but lacking any talent of his own, Gordon is the predator on the sidelines.  Hearing of the new hustler's presence, Gordon arrives soundlessly and sits watching intently for hours.  His dark genius sees the weakness in every soul.  In the bar, when he and Eddie talk business, Gordon is foreshortened to look tiny alongside the talented youngster.  For all his money and sharp wits, Gordon will never be more than a parasite living off the ability of others. Finally, Eddie and Fats walk into the sunlight, heroes who have proved themselves.  Gordon remains perched on his gloomy barstool, a prisoner in his own dark kingdom.<br><br>If Sarah is the vulnerable, physically-disabled woman who relies on drink too heavily, the victim of the men she encounters, she is also the heart of the movie.  She destroys Gordon's certainty and she shows Eddie the meaning of love.  Her tragedy is Eddie's salvation.  She and Eddie find each other in a deserted bus station in the dead hours.  They are both lost souls, Citizens of Hell.  She is the deformed girl with the empty life, and he is the emotional cripple with no resources of education or character to sustain him.  They cling to each other  as if shipwrecked.  When the seduction comes, Sarah hesitates.  She knows this will lead to suffering. \"Why me?\" she asks, then surrenders to her fate.<br><br>The time when Eddie's hands are in plaster is Sarah's brief season of happiness.  She stops drinking and even makes progress with her writing. Somebody needs her, belongs completely to her.  It cannot last.<br><br>\n\"I made you up, Eddie,\" Sarah tells him, and in a sense she did.  She imagined him to be loyal and stable.  On the night when the truth dawns, Sarah goes from feeling pretty in her new dress to being a rain-sodden wreck.  She is supplanted in Eddie's attention by the sinister Gordon, who asserts the new power-balance in the railroad dining-car.  The hotel suites are adjoining, and though Sarah closes all the doors, she can't keep Gordon out.  By Findlay's party, she has hit the bottle again.  The patterned dress which Eddie bought her, a symbol of her incarceration, has the shadow of the ballustrade projected onto it, seemingly magnifying her sense of ensnarement.<br><br>Though Jackie Gleason does very little in this film, he dominates it. On screen for a fraction of the film's totality, and having neither great speeches nor grand gestures, he impresses by his sheer presence.  Stillness, self-containment and an ironic amusement make Minnesota Fats the perfect foil for the angry, ambitious Eddie.  In the final showdown, Fats' quiet poise outshines the grandstanding of the others.  Gleason conveys beautifully the fear at the core of this big dandy.  When Eddie has him in trouble, the Fat Man begins to lose his sartorial integrity as his confidence unravels.<br><br>This contrast of stillness and motion is effective in the first meeting of the hustlers.  Fats and Gordon, who know what they are about, remain motionless and tranquil.  Eddie the incontinent wannabe gradually loses control of both mouth and limbs.  The film is rich in symbolic language. The cheap rooms which Eddie rents are mere boxes for hire, like the bus station locker which he lives out of.  When he and Sarah meet for the second time, the inevitability of their coupling is conveyed in a scene without words or gestures.  Eddie's plastercasts are manacles - without his hands, he is nothing.  A sumptuous restaurant and a happy couple are transformed when the brutal truth emerges.  The camera angle is reversed, and Eddie and Sarah are now separated by gaunt shelves of crockery.  The illusion has been shattered.  When Eddie sneaks out on the sleeping Sarah with the stake money in his hand, it is the betrayal of Charlie re-enacted.<br><br>A marvellous film is enhanced by a superbly sleazy jazz score (Kenyon Hopkins) and the violence is all the more gut-wrenching for being suggested, rather than shown.<br><br>Verdict - probably a masterpiece.","user":"stryker-5","rank":[186,229]},{"title":"More praise heaped onto enduring classic","rating":10,"date":"18 January 2004","review":"I've seen The Hustler repeated times, thought not as many as some of the other commentators.  Recently I saw it for the first time in the theater, at the Alamo Drafthouse in Austin.  Watching \"The Hustler\" in a theater is like listening to Dave Brubeck's \"Time Out\" album: you start to see and even hear things in black and white.  You know the pool tables are green, and the balls are multi-colored, but somehow the black and white perfectly matches the colorless existence of the protagonist and his supporting players.  You can smell the cigarettes, taste the booze.<br><br>Newman, Gleason, Scott, and Laurie all turn in great performances.  But this movie, made after the heyday of the studio players' contract, still bears the hallmark of great movies from that era: strong supporting performances all the way down the line.  Vincent Gardenia, for pete's sake, as the unlucky bartender in the first scene!  Michael Constantine as Big John. Myron McCormick as Charlie, Eddie's sponsor most of the way through the movie.  And Murray Hamilton as the millionaire Southern mark.  This movie was made when supporting roles were an end in themselves, by actors who believed every second they were on screen should be of high quality.<br><br>The day I wrote this review -- January 18, 2004 -- The Hustler was no. 143 on the Top 250 list.  No way are there 142 better movies.","user":"Cue-ball","rank":[81,109]},{"title":"A Talented Loser","rating":8,"date":"29 October 2005","review":"It's an intriguing idea. If a person is talented, that person should be a winner. And, we would expect a loser to be someone who is not talented. But the idea that someone could be a talented loser is a paradox, a contradiction that doesn't fit into the conventional mindset of American culture, and is the basis for \"The Hustler\", a character study of an ace pool player who can't seem to win respect from his peers.<br><br>The pool player is (Fast) Eddie Felson (Paul Newman). The plot moves along by means of four secondary characters with whom Fast Eddie interacts: (1) his manager, Charlie; (2) the veteran pool player, Minnesota Fats; (3) Eddie's girlfriend, Sarah; and (4) the money man, Bert Gordon.<br><br>\"The Hustler\" is very much a product of the late 50's and early 60's, when progressive filmmakers were trying to buck the staid post WWII era, with its reactionary Cold War mentality that resulted in strict conformity to established American values. In this film, Bert Gordon and Minnesota Fats represent the establishment. Eddie Felson is the loner, up against the establishment; he's the renegade kid, out to beat the system. Yet, at every turn, the establishment beats Eddie, one way or another. His idealism is useless. He must conform to the establishment's rules, expressed in the film as \"character\", or give up his dreams.<br><br>The film is therefore very cynical and incredibly cold. From start to finish, there's not an ounce of humor. It depresses the spirit. But the film is a very good metaphor for a terrible era wherein societal repression was the norm.<br><br>While the story's main character may be a loser, the film itself is a talented winner. The excellent B&amp;W lighting, together with a jazzy score, create an effectively somber and downbeat tone, consistent with the oppressive political atmosphere of that era. The dialogue is sparse and incisive. And the acting is persuasive. Paul Newman is convincing, as are the secondary characters. I especially liked the performance of Jackie Gleason, who comes across as suave, serious, and in total control, a great contrast to his comedic side, in \"The Honeymooners\".<br><br>\"The Hustler\" is depressing and grim. But the film is very well made. It entertains in ways that are obvious, and educates in ways that are subtle.","user":"Lechuguilla","rank":[107,147]}]