[{"title":"A hidden Gem of a movie","rating":7,"date":"21 March 2009","review":"Obviously forgotten today, and maybe that's a problem.<br><br>Michael Crichton dealt in practical Science Fiction. How a potential technology could really cause problems in the here and now. This movie hit on a few of them, some of which HAVE come to pass.<br><br>His premise is that computers could be used to simulate characters (already has happened) and that they could be used to influence us by using algorithms to calculate our optimum responses. (Again, probably happening now, even if we don't know about it.) <br><br>The plot is that a plastic surgeon is asked to alter four women into perfect specimens, but three of them are killed after wards (they never really explain why.) In trying to protect the last, whom he develops a personal bond with, he uncovers a plot to use computer generated images (wow, and now they are real!) to manipulate our responses.<br><br>A note on nudity. We have Susan Dey of Partridge family fame going topless in a couple of scenes. We'd NEVER see that now. If we are lucky, we might see a name actress have her head CGI'd (ironic) onto a body double. But usually, the MPAA would go completely nuts and give the film an R or NC-17 rating.<br><br>Some things are dated, such as tape-reading computers and big hair on the women- SO 1980's. But the film's concepts hold up pretty well.","user":"JoeB131","rank":[23,26]},{"title":"UNSUNG THRILLER FROM MICHAEL CRICHTON","rating":22,"date":"22 May 2001","review":"Michael Crichton's \"Looker\" is a challenging and intelligent thriller that's better than you would expect. Since most reviews of the film are negative, that's created an unfair bias against it. That's a shame because this film is a pleasure to watch.<br><br>The plot is like a Rubik's Cube. Just when you thought you had it figured out, WHAM!! a twist comes out of nowhere and confounds the viewer. That's one of the films' pleasures.<br><br>The stylish photography is another plus. A key part of all of Crichton's films is the flashy, stylish photography and that's no exception here. Shot by Paul Lohmann in Panavision, \"Looker\" often looks and feels like \"Westworld\" mixed with \"Coma\" polished with lemon pledge. It's atmospheric and great to look at.<br><br>The performances are another key. Albert Finney, entering the horror cycle of his career (with this and another 1981 release \"Wolfen\", which contains many of the same elements that make this so good), projects fear and calm every scene he's in and it's another strong performance from one of our most underrated actors (he's never won an Oscar; a thought that boggled the mind). It seems fitting that he's paired up with another underrated actor, James Coburn. In a time where he was making one horrible film after another (until his renaissance in 1997), it's good to see him in a good film for a change.<br><br>I have some problems with the plot, mostly things that are left unexplained (the American TV/European theatrical version restores 15 minutes of story that fills in these holes) Now that I think about it, that's a good thing. Crichton wants us to be confused just like his hero and part of the fun is figuring everything out as he does.<br><br>\"Looker\" is a film that deserves to be mentioned in the same breath as \"Westworld\", \"Coma\" and \"The Great Train Robbery\". It shows impeccable skill and masterful direction that lesser talents have shown in bigger hits than this. It's worth a look.<br><br>**** out of 4 stars","user":"Katmiss","rank":[47,57]},{"title":"\"Looker\" worth another look...","rating":9,"date":"9 May 1999","review":"Nearing its 20th birthday, \"Looker\" still holds up today as a solid techno-thriller. Expertly tucking a government/industrial conspiracy beneath a blanket of computer-phobic tension, the film manages to predate the success of the \"X-Files\" before cyberspace became a household word.<br><br>Finney and Coburn are subtly superb in their roles, while Crichton (unintentionally) satirizes a media-saturated culture ripe for the string-pulling. Barry De Vorzon's score is hauntingly impressive (and sadly, unavailable in soundtrack form) as is the cheesy 80's title track performed by Sue Saad (later covered by Kim Carnes on her \"Voyeur\" album).<br><br>People have slammed the script for its lack of explanation... however, a 15-minute scene depicting a rather detailed \"summing up\" of the plot was deleted from the theatrical/home video cut, but did make the film's network TV airings. With or without the scene, the film is an often-overlooked gem I would strongly recommend to anyone in the mood for a slick, sci-fi thriller.","user":"Joshua F","rank":[32,39]}]