[{"title":"Magical film about the city and those looking for love","rating":9,"date":"5 January 2005","review":"Woody Allen once said that, whereas Scorsese had generated a host of imitators, he had generated none. This may be true; films like Manhattan certainly come along far too infrequently.<br><br>That this is such a gorgeous film may strike those following the formulaic, Hollywood approach to cinema as strange and heretical. The story is unexciting (restless male in love triangle), most of the characters are unsympathetic, at least on the surface (particularly Isaac), Allen leaves lose ends lying around all over the place, and there's certainly no action (unless you count the car-chase-without-a-chase-scene involving Diane Keaton, Woody Allen and a VW Beetle).<br><br>So why should any self-respecting member of the MTV generation spend time on this film? Well, here are a few reasons.<br><br>The script is wit of the highest order. This is not gag-a-minute humour like Friends, but an altogether more acute art form stemming from character, some wonderful dialogue and a fair amount of darkness (I love the bit about Isaac trying to run over his ex-wife's lover). Allen is also prepared to turn his biting satire to personal issues, such as being Jewish. Just don't expect someone to look shrug their shoulders, slap their forehead and with mid-rising intonation say d'uh! It's not that kind of comedy.<br><br>Then there is the gorgeous cinematography. Woody loves Manhattan and you can certainly tell. If there is one criticism of the film, it is that it leaves a rather picture postcard impression of the city, but I suppose if it's love, then it's love. Much of the film appears to have been shot at either sunrise or sunset to soften the light, and there are spectacular views of the towers, bridges and waterways of America's finest metropolis.<br><br>Then, I suppose, there is the fact that Manhattan is probably the archetypal Woody Allen film. Other films may be better, like Annie Hall or Hannah and Her Sisters but, in Manhattan, all the elements of Allen's style are in perfect balance. There's the jazz, the neurotic, unsympathetic lead, the choice between stable and highly-strung women, the self-mocking humour (hilariously done in the opening voice-over), the railing against intellectual snobbery, the deep unease with popular culture.<br><br>And there are great performances. Allen is at his most difficult  and in some ways his least likable. As Isaac, he's trying to do the right thing, but is rarely selfless enough to follow through with it. Diane Keaton is great as Mary, the lynchpin between the two love triangles  vain, pretentious and yet you can see why Isaac falls for her. Well, all the actors are great, and very believable, but special mention must go to Meryl Streep, who manages to steal the show with her tiny cameo as Isaac's ex-wife, writing a book about their break-up and living with their son and her lover. She is magnificent.<br><br>Of course, the film will also do nothing to dispel the popular rumour that New Yorkers are neurotic, self-obsessed and self-indulgent  at least that narrow social circle Allen so often writes about. If you don't mind that, though (and I'm English, so what do I care) you're in for a treat. As with the city itself, the memories of this film will stay with you forever.","user":"j30bell","rank":[140,169]},{"title":"Rhapsody in NYC","rating":10,"date":"25 January 2003","review":"Manhattan is an exhilarating American romance set against the backdrop of New York of the late 70's: my favorite New York, the New York of painters, poets, punks, and Pauline Kael.  Three great, very American talents -- Woody Allen, Gordon Willis, and George Gershwin -- intertwine their respective gifts to create a comedy that manages to satisfy both the brain and the heart, and even, perhaps, the lower regions.<br><br>Allen is so brainy and such a nebbish that he can get away with gestures that would be painfully sentimental in the hands of any other director: when he begins the movie with fireworks cut to Gershwin, it isn't to soften you up for a soap opera, but to remind you that however much his neuroses may seem to drive the scenes, its the love of New York that drives the movie.<br><br>The entire cast is note perfect: Meryl Streep as his caustic bisexual ex-wife, Diane Keaton as a nervous journalist from Philadelphia, and especially Mariel Hemingway, whose performance as Allen's 17-year old girlfriend is charming, heartbreaking, and wise.<br><br>Allen's comedy here is at its absolute finest.  The fact that it is interwoven with a genuinely moving love story told with a subtlety and indirection that is unheard of in today's mainstream cinema only makes the laughs that much richer.<br><br>Gordon Willis' cinematography is good enough for the Museum of Modern Art. Scene after scene leaves a grin on your face as his moving (in both senses) black and white photography floats across the screen.<br><br>And finally underlying everything is the music of George Gershwin, whose exubertant melodies propel the movie forward at every turn.<br><br>This is Woody Allen's best movie, a great movie, and an American movie in the best sense.  As an homage to the city of New York it will surely remain unsurpassed.","user":"tvspace","rank":[92,121]},{"title":"\"Chapter One. He was as tough and romantic as the city he loved. Beneath his black-rimmed glasses was the coiled sexual power of a jungle cat.\"","rating":8,"date":"11 May 2007","review":"After the phenomenal success of 'Annie Hall,' the hilarious Oscar-winning comedy detailing the romantic exploits of neurotic Jewish comedian Alvey Singer, Woody Allen had become of America's most respected filmmakers. In 1979, he released what is generally accepted as his second great masterpiece, 'Manhattan,' a poignant tribute to the city that Allen loves so dearly. Written by Allen and his 'Annie Hall'-collaborator Marshall Brickman, 'Manhattan' stars Allen as Isaac Davis, a twice-divorced, 42-year-old comedy writer who is intimately involved with a 17-year-old high school student, Tracy (an Oscar-nominated Mariel Hemingway). Meanwhile, Isaac begins to fall for Mary (Diane Keaton), who is the secret mistress of his best friend (Michael Murphy). Adding to all of Isaac's troubles, his former second wife, Jill (Meryl Streep), who had originally left him for another woman, has plans to write a tell-all book on their failed marriage.<br><br>If this all seems very confusing to you, then you're not alone. Just as in 'Annie Hall,' Allen plays the hopeless romantic who is struggling desperately to understand the maddening complexity of human relationships. Though Tracy is only seventeen years old, she is arguably the most honest and mature of the women in Isaac's life; nonetheless, he doesn't treat her seriously. In his mind, anything that she says is quite obviously influenced by the naivety and downright ignorance of the young. Their relationship was never meant to be anything more than a brief \"fling,\" and so he feels no guilt for seeing another woman behind his back, an act that makes him livid when it ultimately happens to him.<br><br>'Manhattan' was shot in beautiful crisp black-and-white by Gordon Willis, who has also worked on, among countless other films, 'Annie Hall' and the three installments of 'The Godfather.' The cinematography offers New York City a romantic 1940s feel, reminiscent of how Allen claims to remember the city as a child: \"Maybe it's a reminiscence from old photographs, films, books and all that. But that's how I remember New York. I always heard Gershwin music with it, too. In 'Manhattan' I really think that we  that's me and cinematographer Gordon Willis  succeeded in showing the city. When you see it there on that big screen it's really decadent.\"<br><br>Mysteriously, this film remains the least-liked by the director himself, though, at the same time, it was also his most commercially successful. As you've no doubt already noticed from this review, 'Manhattan' is often likened to 1977's 'Annie Hall,' perhaps due to the repeated casting of Allen and Keaton (a not uncommon occurrence) or its similar attempt to uncover the elusive secrets behind love and relationships. In terms of film-making style, however, the films are quite dissimilar. Unlike the highly-energetic 'Annie Hall'  which cut back and forward in time, visited old memories, broke the fourth wall and made conversations with passing extras  'Manhattan' boasts a more classical approach  quiet, softly-spoken and accompanied by a wistfully slow jazzy soundtrack, also relying heavily on the works of George Gershwin.","user":"ackstasis","rank":[39,52]}]