[{"title":"Watch out for your ears!!","rating":1,"date":"1 October 2002","review":"I've heard it commented that Monterey Pop is less of a `movie' than Woodstock because it doesn't really get to know the Audience as a character (through interviews, pointed observation, thru-stories, etc.). This is nothing more than old-fashioned critic snobbery. The distance is precisely the mystique of the film. Do we need to talk to the audience or to Janis Joplin, for example, after her performance? As an impressed Cass Elliot looks on, we see Joplin playfully skitter off the stage like a schoolgirl to embrace a friend after her victorious `Ball &amp; Chain,' and we totally feel her sense of accomplishment and state of exhaustion after delivering such a powerhouse. Sometimes a picture speaks a thousand words. <br><br>\nMonterey Pop, in comparison to Woodstock, does indeed have a distant feel and, overall, lacks that film's spit &amp; polish. But this is like comparing two different directing styles  say Kubrick vs. Ford. Based on its own merits, this film is a fantastic, bare-bones look back at the state of (what was then!) underground musicbefore drugs &amp; death took their massive toll, before it all became `classic rock' commercialism, and before everyone (including myself) had a chance to pontificate on its merits ad nauseum. The distance afforded their subjects by the filmmakers adds to this experimental `street' allure and is actually very appropriate. Have you ever felt cheated by a band simply because they went commercial? How it just doesn't feel the same because what once seemed like a hip secret kept by a choice few had now gained Mass Audience Appeal? The jig was up. Alas, for those old days Monterey captures that spirit of an unbridled, non-compromised and spontaneous movement that has just the right touch of danger attached.<br><br>\nEven though Monterey Pop has a garage rock feel, it's not really about `garage rock' per se, which has its roots back to 50s. It's more about a time when rock really went through a kind of psychedelic overhaul that continues to influence today. Besides the psychedelia, however, rock went through a diverse artistic transition that begun to incorporate music from other countries, styles and mediums (You want diversity? Try Otis Redding and Ravi Shankar on the same bill!). Although the Beatles had already begun to incorporate this stuff, most had not by '67 and were just perfecting their own innovative sounds (Janis Joplin, for instance, did not bring in a full horn section until a couple of years later, and Big Brother remained very guitar-driven). The jazz of Hugh Mesekela, for instance, is a standout here. I don't see Woodstock as having such a wide scope.<br><br>On the other hand, comparisons made to Woodstock are valuable enhancements to this film's enjoyment, not necessarily the base of negative critique. One reviewer, for instance, pointed out the medium hairstyle length of most of the men here (most were so new to The Scene that they hadn't had enough time to grow it out yet. Crew cuts and horn-rimmed glasses also abound). Many of the bands also look surprisingly young &amp; innocent when compared with their Woodstock performances only 2 years later (the results of hard living?). Hendrix at Woodstock, in particular, comes off as nearly sedate when compared to his historic appearance here. Such details are what make Monterey Pop a gorgeous document of this period.","user":"billymac72","rank":[28,30]},{"title":"The 60's Personified...Period!","rating":10,"date":"28 June 2008","review":"A most excellent time capsule of a period. No questions. If you want to see what the sixties were like...Then watch. This really does put in a time capsule more of the generation than anything I've seen. You can feel the shift happening via the music. I vote this is infinitely more important than Woodstock because the movement was already in full swing at that point. Witness the birth of so much of what we still are listening to today. This is the real unadulterated thing. Kudos to the \"Criterion Collection\"! If only Otis Redding would have lived longer?There is no telling the musical legacy he was going to leave? Based on the incendiary performance here it would have been formidable. This is a must see for anyone interested in the procession of rock through all the permutations of soul and blues. Not to be missed.","user":"AudioFileZ","rank":[13,13]},{"title":"If You Think The Film Is Great, Check Out the Outtakes","rating":10,"date":"21 November 2002","review":"This has to be one of the greatest concert documentaries ever made. You get to see some of the greatest early performances by some of rock's greatest legends (Jimi Hendrix, The Who and Janis Joplin) as well as the performance of one band on their last legs, the Mamas and the Papas. The festival also could be seen as a turning point in popular music due to the fact that after the festiveal the more singles oriented acts were being pushed aside in favor of the more progressive album oriented artists.<br><br>Also, if you need more convincing of how much of a pivotal event this was, check out the outtakes video. It contains many of the performances that didn't make it to the film, including Buffalo Springfield without Neil Young who had quit the band a month before their scheduled appearance. Replacing him for this performance was David Crosby, who performed earlier with the Byrds but joined his friend Stephen Stills and the rest of the Springfield for the show (less than a year later Crosby and Stills would team up with Graham Nash and the rest is history). Also check out Laura Nyro. Legend has it that she was booed off the stage. However, she gets a nice applause for her renditions of her classics \"Wedding Bell Blues\" and \"Poverty Train\".","user":"Sargebri","rank":[17,18]}]