[{"title":"Robert Ryan Rides Again","rating":25,"date":"25 August 2001","review":"This is an uncommon, stark western starring the versatile Robert Ryan in tough guy mode, as a ruthless cattleman at odds with homesteaders in a tiny, bleak western town. As he is about to settle a feud with a local farmer, Burl Ives and his band of sadistic thugs ride into town and hold the citizens hostage. As Ives tries to keep his men from raping the women, Ryan must find a way to save the town, and redeem himself in the process.<br><br>Beautiful outdoor photography and solid acting combine with an unusual story line to make this a very interesting, tense flick. The movie eschews the usual western cliches in favor of maintaining a somber, moral tone. Ives excels as an internally conflicted villain. And Ryan, as always, is the man.","user":"rockbroker","rank":[52,55]},{"title":"Fresh enough to merit a watch","rating":8,"date":"17 May 2008","review":"I must admit up front that I am not a huge fan of Westerns and the biggest reason I watched this film was because it had Robert Ryan in it. For some time, I have thought that Ryan was one of the best \"unknown\" actors, as he appeared and even starred in quite a few films but most people today have no idea who he was. My admiration for him is because he looked a lot like an ordinary guy (since he wasn't overly handsome) but despite this, his performances always seemed so realistic. He really was a heck of a good actor and his work in this film is no exception.<br><br>DAY OF THE OUTLAW isn't a great Western but it is different enough from the average film that it seems fresh enough to merit watching. What I particularly liked is how the first 15 minutes or so of the film turned out to be not at all directly related to where the film went next. Not knowing the plot, this really took me off guard--and I like when a film isn't easy to predict.<br><br>I also liked the idea of a gang of thugs invading and holding a town hostage--though this idea has been done before in Westerns (FIRECREEK) and non-Westerns (THE WILD ONE). What made this one stand out more from the others is that this group wasn't just bad in the usual sense, they were moral degenerates--rapists and sadists, not just socipaths or thieves. Plus, the idea of a strong but wounded leader (Burl Ives) trying to control these sick freaks was fascinating--as was the final showdown.<br><br>All in all, a very good film and one you should try to find due to its intelligent script and excellent acting.<br><br>By the way, one reviewer said they felt Burl Ives was wrong for the part since in real life he was a nice-guy folk singer. Well, with gritty previous roles in CAT ON A HOT TIN ROOF and THE BIG COUNTRY, I would certainly have to disagree with the sentiment, as Ives played the heavy in movies about as often as he played a good guy.","user":"MartinHafer","rank":[35,40]},{"title":"White western","rating":4,"date":"4 October 2006","review":"This is an excellent western by Andre de Toth. It is mainly remembered for its final thirty minutes,an extraordinary ride in the snow ,where the director makes the best of black and white pictures while he's filming all the tired horses ...Hell freezes over.<br><br>But the first hour is absorbing as well with its depiction of an one-horse town lost in the snow,a dead end where one never really knows which ones are prisoners and which ones are guards .The \"ball \",during which the four women are really having a bad time (particularly Tina Louise)is one of the most violent scenes ever filmed in a western .And all they are doing is dancing.It has to be seen to be believed! Robert Ryan is ,as always,excellent ,as a tired blasé man who just wants to live in peace.","user":"dbdumonteil","rank":[37,43]}]