[{"title":"One of the very best comedies of all time","rating":10,"date":"11 July 2005","review":"This film is on my top 20 comedies list. This is a truly unique film. To the reviewer who said \"I must be really missing something.\"--you are correct. You are missing something. If you don't have the kind of sense of humor this film requires, that's one thing. But don't give it a bad review because you think it's \"looney\" but isn't intended to be. Loony is an apt description of both what it intends to be and what it succeeds in being. I laughed much more often and much more intensely at this film than I do at most other funny films.<br><br>Michael Almereyda brought out the best in his cast in this, his first big film, for which he was nominated for an Independent Spirit award for Best First Feature. Crispin Glover, as usual, is absolutely brilliant in some perfectly inexplicable way, and some of his very funniest lines ever were said in this film. Glover is clearly the best comic actor working right now. Harry Dean Stanton puts in an excellent comic performance. William Burroughs is incredible in a small role. Dylan McDermott was ideally cast, and Lois Chiles is completely excellent.<br><br>All of the above are perfectly funny in their own perfect way, but this is one of Crispin's finest performances--up there with his performances in River's Edge and Willard. If you are a Crispin Glover fan, but have somehow overlooked this film, you need to stop whatever it is you're doing and see this immediately.<br><br>But just remember to relax first, and maybe have a beer or something. This is a great film, but it is very unusual, and I recommend being in or inducing an appropriately silly state of mind before viewing.","user":"youaresquishy","rank":[16,26]},{"title":"Way up there on the \"strange scale\"....","rating":5,"date":"23 June 2009","review":"The cast does all they can with this dysfunctional family fiasco, but ultimately the movie fails to maintain interest. The title \"Twister\", is totally misleading, as the tornado plays out in five minutes, and has no bearing whatsoever on the \"free form\" script. The few positives would have to be, an interesting soundtrack, Crispin Glover's over the top performance, and a final third that is somewhat better than what precedes it. The negatives are the meandering script, that quite frankly goes nowhere, the unlikable characters, and a running time that seems endless. This might have made a tolerable short, but as a feature film it is just too weird, unfocused, and lengthy. - MERK","user":"merklekranz","rank":[4,6]},{"title":"Another Vestron film","rating":4,"date":"21 June 2000","review":"I used to work at the company that originally put out this film, Vestron Pictures. Vestron had the same problem that a lot of small independent film companies had, they didn't have a lot of money to put into the production values of their films. Not that money alone will buy you a good film. Look at Kevin Costner's Waterworld, for instance.<br><br>Sometimes, if you have a talented person in-house doing the acquisitions or development, you can create your own new talent. But at Vestron, there wasn't such a person and they always skimped in some crucial area. In this case, it was on the director and the writer. Which makes it pretty hard to have a decent movie, even with the great ensemble cast this film has.<br><br>I think the basic premise of this movie was \"Let's put a bunch of quirky characters in a room and see if anything interesting happens.\" It's an intriguing idea, but not worth your time watching.<br><br>Most Vestron films ended up having a very distinctive look and feel to them. My wife and I developed the ability to spot this quality even in non-Vestron films. Many times, we were even able to spot that quality from watching only the trailer or TV ad. We'd sit there, watching the trailer or ad, and afterwards, we'd turn to each, and almost in sync, we'd say, \"Now that's a Vestron movie!\" This is a Vestron movie.","user":"Musicop","rank":[13,32]}]