[{"title":"The best of British horror!","rating":10,"date":"27 December 2006","review":"A superb slice of vintage British horror from Amicus productions, which although headed by two Americans Max J. Rosenberg and Milton Subotsky, Amicus was based in England at Shepperton Studios. I personally am a huge admirer of the work of Milton Subotsky, I think he gave a great deal to the British film industry and gave us the 'portmanteau' style of horror film which meant that the stories would be around half an hour long, it was impossible to tire of such a short subject! Milton himself claimed that the classic 'Dead of Night' was the inspiration behind these multi segment horror films and I think he took it to another level. I think that 'From Beyond' is the finest one they made, with atmospheric stories and great acting from the entire cast and of course the wonderful Peter Cushing as the mysterious proprietor of 'Temptations Ltd'. Peter was the actor most used by the studio, he being very reasonable by way of his fees, whereas Subotsky claimed the great Christopher Lee became too expensive!","user":"seantheslug","rank":[25,28]},{"title":"Sadly Underrated","rating":30,"date":"30 March 2000","review":"From the plethora of Horror films from the Amicus and Hammer studios in the late 1960's and early 70s, this is one that stands out above many of the others. The opening sequence with the camera moving through the mist graveyard is a masterful piece of horror film. Each of the stories is built up very well with an excellent element of tension in each. If you want to see a great example of the British horror film genre, this is the place to start.","user":"pha96lgc","rank":[30,37]},{"title":"Great anthology of British horror!","rating":8,"date":"9 June 2003","review":"\"From Beyond the Grave\" is a typical horror anthology from Amicus.It's not very scary or frightening,but it still manages to raise a few chills and a few thrills.Cushing's performance as a creepy shopkeeper is simply fantastic.All the stories are intelligent,well-written and seriously memorable stuff-my favourite is the first one with David Warner,who buys an antique mirror.Anyway the mirror is haunted and demands blood,so Warner brings home a couple of women and proceeds to stab them to death!Eventually the spirit behind the mirror is released,and changes places with hapless Warner.To sum up,if you like British horror give this one a look.8 out of 10.","user":"HumanoidOfFlesh","rank":[29,37]}]