[{"title":"A Personal Favorite","rating":22,"date":"22 July 2003","review":"I've loved this film from the moment I saw it as a kid.  To this day Tim Conway's rambling \"I think that someone doesn't want anyone to know that there may be someone here that might be someone that's a killer\" line still gets me laughing!  Highly recommended to anyone in search of a fun (and funny) film!","user":"Moondog-6","rank":[18,19]},{"title":"If you like Conway/Knotts, then you MUST see!","rating":8,"date":"8 November 1999","review":"I admit that this is not a movie that will be sung about by generations to come, but if you like Tim Conway and Don Knotts together (or your sense of humor is from the old Carol Burnette Show) then this one is for you.  As a team, these two clearly have advanced slapstick and very much kept it alive. When I watch this I have come close to losing bladder control and at the least have broke down into tears of laughter.  This movie isn't meant for kids but clearly the whole family can enjoy (sorta like Rocky&amp;Bullwinkle). If you just want to laugh your butt off for 90 minutes and forget about life for a while, the The Private Eyes is just want you want.","user":"redfivemd","rank":[14,15]},{"title":"Elementary, Don and Tim....","rating":7,"date":"10 September 1999","review":"Any movie that features Don Knotts as a brilliant detective and Tim Conway as his faithful assistant certainly has courage going for it.<br><br>But \"Private Eyes\" is better than you might expect; the setting (Biltmore Castle) is beautiful, the supporting cast (Fox in particular) is hilarious and a lot, if not all, of the gags are priceless.  <br><br>Then again, what would you expect from Knotts' above-it-all air of pseudo-intelligence and Conway's endless pratfalls and an overcoat full of pigeons (don't ask)?  They're two of the old-school comedians who know what's funny and never try to go further than the jokes will go. <br><br>\n\"Private Eyes\" works because Knotts and Conway are, more or less, just being themselves.  Definitely a film worth seeking out.<br><br>You'll laugh.  Trust me.<br><br>Seven stars.  And don't drink the ink.","user":"Mister-6","rank":[12,13]}]