[{"title":"Could Have Been Great! But boy! It Sucks to be Brent!","rating":6,"date":"14 July 2002","review":"(Major Spoilers!!!) \"Beneath...\" has to rank as one of the meanest movies ever made in its treatment to its main character. Consider this...Brent wakes up to his space ship's crash landing, realizing it's 3955(?)[what happened to 3978?], so everyone he ever knew except Skipper is dead...then skipper dies too! He finds out that (gulp) apes rule, then gets shot for his discovery (same as Taylor). Is rewarded with white, stinging \"vet\" powder plentifully poured on his (still bleeding) gunshot wound, by Zira. Gets captured and sentenced to ape target practice; en route he gets an ape boot shoved into his larynx while said ape tries to pull his arm off. Escapes while apes on horseback fire their guns at him. Goes underground and realizes where he's at. Painful!...and the movie is only into its first 45 minutes. What else can happen to the poor guy? Well...as his mental stability starts heading toward the brink of insanity, he does some depressing sight-seeing, watches helplessly as mind control forces him to near drown Nova, then face telepathic inquisitors who proceed to scare the crap out of him with a whoosh of fire, fry his ear drums with high pitch sound waves, thought-project agonizing, searing pain that contorts his whole body and again, he watches helplessly as he's forced to near suffocate (poor) Nova with a brutal passionless loo-oong kiss. Then!... he's required to sit still during mass (for some people, this is very painful) and realizes that everyone else in attendance is a replicant of \"Gray's Anatomy\". He then catches up with friend Taylor (finally)...and Taylor proceeds to beat the crap out of him too, by kicking him in the face and chest, strangling him, shoving his back into cell bars with long sharp spikes sticking out, mercilessly stepping on his face, strangling him some more and delivering some shattering right hooks to the jaw (all under mind control, of course). After the fight, instead of friendly gossip, they realize they're about 100 yards away from an active bomb, not just any old bomb, but THE Doomsday Bomb. And they're trapped inside a locked cell. And an army of Militia Apes are attacking!  Finally... escape! but Nova ain't coming. Back to the church, Brent witnesses Taylor (after spending the whole movie trying to locate him) get fatally shot, knows he's now alone and goes on a one man kamikaze assault with his one puny rifle against 100 gorilla sub machine guns. And if that ain't enough, THEN he runs out of ammo! And he doesn't even get the satisfaction of seeing Taylor's final efforts. What happens to him is what you'd want to see happen to the worst of villains, but not to the heroic character. After all this, it would have been better to stay in bed.<br><br>That aside, \"Planet of the Apes\" WAS a tough act to follow. \"Beneath the Planet of the Apes\" cinematography does border on spectacle and alot of credit should go to director Ted Post for getting alot more out of the half baked premise and limitations he was trapped in. Many still frames and action sequences from the film are just as epic-like, colorful and bizarre that is on par with (and in many instances, exceeds) the original; but the editing in the original surpasses the sequel!(not Ted's fault). Still...\"Beneath's\" camera angles are far superior than any of the sequels that followed. Composer Leornard Rosenman created a very eerie, foreboding music score that touches on some semblance to Jerry Goldsmith's music from the original, while taking it into a different direction that effectively captures the mood of the film that works perfectly. It's unavoidable that both \"Planet\" and \"Beneath...\" have a flavor of their own considering all obstacles, so it's appropriate that the both scores follow suit in different scales; they're both brilliant.<br><br>Charlton Heston can't be blamed for his lack of enthusiasm, considering what he was presented with. If a more fuller and better continuation of the story was better fleshed out...who knows (after all, look at his lone survivor interpretation from \"The Omega Man\", not far removed from his position at the end of \"Planet...\"). But a more diversified storyline was necessary that needed splitting the story between Taylor and the Apes which changed the flow of what followed previously...because the first movie was presented subjectively through the eyes of Taylor. The addition of the new elements that carried the narrative forward was not going to be consistent with director Franklin Schaffner's original subjective approach to the first \"Apes\" that made it so successful. So it's very appropriate that James Franciscus' 'Brent' is allowed to discover Ape City because the Apes are one of the main reason people would want to return to the story anyway. The other reason is Taylor! (and Nova).  And that is the main problem. Because, NO sequel was ever planned for Planet of the Apes! If a storyline was preplanned then this may have paralleled author Pierre Boulle's excellent 'Bridge on the River Kwai' more closely if additional characters were already evident, like the way the story in 'Kwai' continued after William Holden escapes from the prison camp (as Heston did from Ape City) while the events flipped back and forth between Holden's increasing dilemma and that of Alec Guiness' misguided actions. Sadly, (because it's only 1967 before sequels were recognized as obvious cash cows) 'Planet...' didn't have the luxury of foresight of the epic possibilities that could have logically continued the story forward in the same care and quality. Thus we're left with a more emphasis on action orientation, less on character growth and a more speedy presentation that's intended to camouflage the story's inadequacy.<br><br>It's almost easy to say that \"Beneath...\" is better appreciated on its own merit, as an almost separate entity from \"Planet...\" because of its radical introduction to science fiction elements new to the story. But it's not that easy! Comparison is unavoidable!<br><br>On the many plus sides are:  James Gregory's scene stealing 'General Ursus' that propels the conflict between ape and man (especially his rousing call-to-arms speech); Maurice Evans' 'Dr.Zaius' who steals scenes right back; the buried underground scenes, the Ape Army on the move, Cornelius and Zira's home; Brent and Nova's underground odyssey; the steam bath; more (if brief) views of Ape City and the cages; General Ursus' helmet symbolically backed by the many more militant gorillas; and the under rated James Franciscus who took upon himself to further flesh out more of his character's heroic attributes. And ANY scene with Taylor! that is all too brief.<br><br>One thing is near certain: \"Beneath...\" is never boring in its breakneck pace in storytelling. but it could have been better if there weren't so many 'egos' involved in the decision-making process of delivering a quality continuation of the Apes saga. Just think of the possibility if Nova was able to retain her pregnancy scene cut from the first film, the bomb wasn't doomsday, and she survives the end of the second film.<br><br>\nStill kind of fun entertainment!<br><br>6 out of 10","user":"jbirtel","rank":[39,42]},{"title":"\"We were following Taylor's trajectory, so whatever happened to us must have happened to him.\"","rating":6,"date":"21 April 2001","review":"Beneath was the best Planet of the Apes film bar none. Everything was bigger and better this time around: bigger sets, more gorillas, the whole of New York instead of a mere Statue of Liberty, and, best of all, faceless, telepathic mutants than can kill with the mind. Yes, I was once ten years old.<br><br>Watched again with many years of hindsight, it's clear that, while entertaining, Beneath was produced without anything approaching artistry. The ultimate in sequels, it tries to tell the same story twice as big, but with only half the success. Until Battle came along and picked the flesh off Apes' rotting carcass this was the worst sequel because it did nothing new with the format. Even the working title - Planet of the Apes Revisited - betrays the lack of thought and the desire for finance that went into this one.<br><br>A virtually identical plotline rattles along at a fair pace, meaning all subtlety is jettisoned. The allegories are also confused by not really being allegories at all. Look at the metaphor for anti-war protestors by casting chimps as ... er, anti-war protestors. A look at how man often judges another man on the colour of his skin is alluded to ... er, by having an ape judging a man on the colour of his skin. (On this note, perversely for a film that purports liberal satire, the only one of the mutants to demonstrate real cruelty was Don Pedro Colley, the sole black character in the film. And despite its worthiness, I don't think I've ever seen another film where a man's credit is given as \"Negro\"). However, I did have to smile at the chimp that punningly complains about \"gorilla brutality\".<br><br>The decreased budget (a sensible studio idea to cut the finance of the sequels to a hit movie) shows with some of the ape extras having decidedly ropy masks in the crowd scenes. The opening of the picture also recaps the first, cannily highlighting the glaring difference between Roddy McDowall's and David Watson's performances as Cornelius. Watson, standing in for an absent McDowall, does reasonably well but really doesn't look anything like him, even under latex. Note too how all the ape masks give the actors lisps, something I never noticed before. Never mind apes, anyone would think James Franciscus had landed on the planet of the Pertwees. There's also some abysmal back projection work when Franciscus is wrestling on top of the horsedrawn carriage. The mutants are pretty good, though their prayers to \"The Holy Fallout\" are a little silly. Why do they wear human masks anyway? Where do they make them? I dunno, I don't make the rules up, do I?<br><br>Of course, the main problem is the pointless game of one-upmanship it plays with its source. There's no longer any element of surprise that this is Earth, so the ruined monuments, nice as they are, no longer have any great effect. It misses the point, also: the Statue of Liberty is not just a relic, but a symbol. New York Subway is just where people caught trains. And as impressive as the effects are, if not directed well  which they aren't, particularly  then it becomes fatuous.<br><br>It's weird how all four sequels were made within a year of each other, yet at least two of them tried something new. Beneath came two years after the original yet has a rehashed \"in it for the money\" feel all the way through, right down to its abrupt, slightly unsatisfactory climax. Yet despite the many, many faults I've levelled at it, Beneath the Planet of the Apes is still a very enjoyable film. Not in the sense of the first, which genuinely had something to say, but in the guise of pulp SF then this sequel is well worth seeing. In fact, despite the slating I've given it, I still awarded it 6/10.","user":"The_Movie_Cat","rank":[85,104]},{"title":"Again the Apes along with an underground civilization of mutated human beings living in subway system","rating":7,"date":"21 October 2010","review":"Good and frantic science-fiction movie with a first rate James Franciscus and special intervention of Charlton Heston who literally disappears in the beginning and re-appears on the ending . This known story is the second and best of the primates sequels ; it starts when Brent (James Franciscus) through the same time warp crashes on the far planet and meets the gorgeous native Nova (Linda Harrison). At the start they trek across the desert , after that he learns the culture where simians rule over humans and they are divided in three lineage : gorilla , chimpanzee and orangutan . Later on, he discovers humanity has gone awry and now is slave and reduced to beasts . Man is treated as animal of burden and regarded as scum . A couple of chimps named Cornelius (David Watson replacing Roddy McDowall) and Zira(Kim Hunter) think otherwise and even agree Brent escape , following the same traces as Taylor (Charlton Heston) . Meanwhile, an expedition commanded by militaristic General Ursus (James Gregory) and Dr. Zaius(Maurice Evans) sets out the forbidden zone where live human mutants (Victor Buono, Jeff Corey , among them) who survived a nuclear explosion several years before . Brent and Nova find an underground civilization in the ruins of bomb-blasted N.Y.C. until a downbeat and bleak final with the mutants worshipping a nuclear missile .<br><br>This is a nice sci-fi flick plenty of metaphysical significance with thoughtful reflexion about origin of human being and nuclear catastrophe , though also packs action, adventures, intrigue and entertainment. In spite of time and being mostly a replay of the original movie , energy remains still and turns out to be an enjoyable following full of fantasy and suspense . Exciting writing credits by Paul Dehn and Mort Abrahams from Pierre Boulle novel . One of the important attributes of this work, is the magnificent , spectacular production design with excellent sets by Walter Scott and great visual effects by means of matte paintings by L.B. Abbot . Glimmer and luminous cinematography by Milton Krasner. Phenomenal make-up by John Chambers, a first-rate expert, such as proved in 'Blade runner, Ssss, Island of Dr Moreau' among others . Sensational musical score by a top-notch Leonard Rosenman though imitating sounds from the great Jerry Goldsmith .The picture is lavishly produced by usual Arthur P. Jacobs , producer of whole saga, and well directed by Ted Post , realizing a similar work to Franklyn J Schaffner , utilizing a great visual sense.<br><br>It's followed by three inferior sequels that get worse and a TV series, 'Escape of planet of apes'(71, Don Taylor), 'Conquest of planet of apes'(72, J. Lee Thompson), 'Battle for the planet of apes'(73, J.Lee Thompson)","user":"ma-cortes","rank":[24,28]}]