[{"title":"Still life","rating":10,"date":"18 January 2006","review":"Certain songs, or melodies, associated with films one has seen, stay in our sub conscience forever. This is the case with the Rachmaninoff's Second Piano Concerto for this viewer. Any time we hear it, or parts of the main themes are played, it immediately evokes this romantic film of 1945. It's a tribute to its director, David Lean, that after more than sixty years, it still is one of the most cherished movie experiences for a lot of people that saw it, or that are just getting acquainted with it.<br><br>\"Brief Encounter\" owes it all to one of the best talent in the English speaking world of the last century: Noel Coward. As part of his \"Tonight at Eight\" theater work, this one act play, \"Still Life\" was turned by its author and David Lean into what we know as \"Brief Encounter\", a bittersweet account of two lovers, doomed from the start.<br><br>The film works because the exquisite chemistry between its two stars, Celia Johnson and Trevor Howard. Both these actors make Laura Jesson and Alec Harvey come alive and stay with us every time we view this timeless film. The story is not far fetched and is made real by the two stars that elevate it to one of the best films of all times. The movie is done with an impeccable sense of decorum and style, yet it has such a sexy subtext. That was a time when a film didn't have to \"bare it all\" in order to catch the viewer's imagination. In fact, Laura and Alec let us know, without being specific, about the passion that both feel for one another.<br><br>Celia Johnson was not a great beauty. Neither was Trevor Howard the epitome of handsomeness, yet, their scenes together project such a heat, as the one that their characters are feeling at any given moment. The fact the two illicit lovers are played by people one could relate to, is what makes the film resonate the way it does every time we watch it. Of course, we realize this situation had no future from the start, yet, one keeps hoping their love will end well.<br><br>The supporting cast is excellent. Stanley Holloway is seen as the station master Albert. Joyce Carey is perfect as the woman in charge of the refreshment area of the station where Laura and Alec spend some of their time together. Cyril Raymond makes Fred Jesson, a man who perhaps understand much more than what he lets know. Everly Gregg is seen as the chattering Dolly Messiter.<br><br>\"Brief Encounter\" is one of the best films directed by David Lean, a man who was able to give the film the right tone and made it the classic that it is.","user":"jotix100","rank":[136,147]},{"title":"An excellent, charming, moving film.","rating":10,"date":"22 November 2000","review":"Have you really never seen Brief Encounter? What have you been doing all these years? You have a treat in store.<br><br>I have a great love for British films of the 1940s. There seems to have been a great flowering of creative talent then, and the films of the period look beautiful, and have such wonderful characters in them. David Lean is more famous for his huge Technicolor epics, like Lawrence of Arabia, or A Passage to India, but Brief Encounter is his most moving film. It is shot in atmospheric black and white, and tells the story of two people who fall in love, in mundane little England.<br><br>Celia Johnston plays Laura, a middle class woman who lives a happy but predictable life, who meets Dr. Alec Harvey, played by craggy Trevor Howard. There starts a doomed love affair, set to the sweeping romantic sounds of Rachmaninov's 2nd piano concerto. This single piece of music plays throughout the film, and stirs up exactly the right emotions. The film will make you want to own a recording of the music.<br><br>Such is the power and influence of this film, that it has been remade a few times, and spoofed on countless occasions. It created the archetype for the romantic farewell on a station platform, with steam hissing from trains, and an orchestra playing in the background. Though this has been copied often, it has never been bettered. The film involves a few scenes on railway platforms, and some of these are mundane, others joyous, or despairing, wretched. The director uses many deft tricks to heighten the emotion all along the way. A simple tilt of the camera, or contrasting mood of another character, serves to add tremendous power to the emotion of the scenes.<br><br>Times were different then. People were brasher, accents were stronger, and social attitudes to affairs quite different. The period of the film gives it much of its charm. It does not make it a cold study of a different culture, however. The film is very personal. The character of Laura's husband is hardly seen in the entire film, which means that we identify more with Laura's feelings. We see the affair and next to nothing else.<br><br>Celia Johnson brings a great deal to the film. She is so likeable, and so able to express the misery that her new love brings her. Her manner of speaking is quite alien to a modern ear. In the 1940s, it was quite normal to add a Y sound to many words. \"Hat\" became \"hyat\". The accents are not forced, though - they come across as quite natural, and very likeable.<br><br>This film would not be made this way today. The modern audience would demand younger stars, and nudity. See this film to witness how it was once possible to make films about love without bedroom scenes. Brief Encounter is very much stronger for lack of these. Stoicism and restraint are under-rated traits in modern cinema. Modern directors and writers would do well to remind themselves with this film, that a story can be given tremendous emotional power by techniques which seem to have been lost.","user":"Lloyd-23","rank":[193,219]},{"title":"Briefly, a great film","rating":20,"date":"20 June 2002","review":"There's not a lot to say. Like many classics this film is simply constructed with all the elements in balance so that none stands out. Everything in it contributes something essential; the lighting, the unromantic railway station sets, the minor characters and of course the music, the ultra-romantic Rachmaninov Piano Concerto no 2. The emotional rollercoaster of the illicit affair has seldom been better portrayed. Perhaps it is a little understated for transatlantic tastes but no-one viewing this movie would not appreciate that the English can be as passionate as the rest of us.<br><br>Celia Johnson as Laura and Trevor Howard as Alec are perfect together. It being 1945, they do not get to bed  that would have ruined the audience's sympathy for them in those rather more censorious times. It's all in their minds but their faces give the game away  to each other and to the bystanders. Nothing happens to drag anyone near the awful divorce courts, but you are left wondering whether Celia will ever feel quite the same about her dull, comfortable, patronising and boring husband. As for Alec, he professes he will love her forever but then, he's a man.<br><br>\nNoel Coward produced this film from a short play of his from 1935 (the war and post-war shortages are absent), and his dulcet tones may be recognised in the railway station announcements. David Lean directed, and it is a remarkable collaboration. The action is opened out a little  a row on the lake, a drive in the country - but the scenes from the play set entirely in the railway refreshment rooms still remain the centre of the story. The parallel relationship between Albert the station guard (Stanley Holloway), and Myrtle the refreshment room attendant (Joyce Carey), is an interesting counterpoint to the angst-ridden middle class would-be adulterers. Surely Noel old boy you weren't suggesting that the working class handles this sort of thing better? We see things largely from Laura's point of view and perhaps Alec didn't feel quite so guilty, but their consciences are going to make them pay. A gem of a movie.","user":"Philby-3","rank":[117,132]}]