[{"title":"Great performance by Spinell...","rating":7,"date":"7 January 2000","review":"I had put off seeing this for a long time because, although an admirer of Joe Spinell and Caroline Munro, I am NOT a fan of gore.  When the only video store in my area with a copy told me they would be closing, I finally gave in and rented it, knowing it may very well be my last chance.  I was pleasantly surprised to see how little gore there was (and what WAS there was either too brief to really disturb me, or was obviously \"movie-within-movie\" fake), and by the cleverness of the script.  The brilliant performance by Joe Spinell, however, came as no surprise. Playing an obsessed fan and would-be director, Spinell was both pathetic and sympathetic.  I found myself feeling sorry for this desperate loser, even as I dreaded what he might do.<br><br>The Cannes Film Festival setting makes this a must-see for movie buffs, who will enjoy going frame-by-frame through the montages of movie posters and marquees.","user":"Erich-13","rank":[12,13]},{"title":"A slasher with a sense of humour","rating":6,"date":"30 September 2012","review":"A taxi driver is dangerously obsessed by a horror movie actress. He travels to Cannes to convince her to star in the movie he fantasises he is going to direct. A series of killings start.<br><br>On the face of it this is one of the many films from the early 80's slasher cycle. However, it's hardly typical of that genre. Sure, it has the usual slasher ingredients – lots of gory violence and lots of semi-nude girls – but overall the tone is quite different. There is a definite comic feel to this one. Much of that is down to lead actor Joe Spinell who plays the deranged taxi driver. Spinell is a good enough actor to make, what could easily be a very unlikable character, sympathetic. His interplay with his mother is also kind of funny and I suppose is a jokey take on the stereotypical mother-fixated psychopaths from these types of movies. Joe's delusional world view is illustrated with segments that blur fantasy and reality. We see him as a ludicrous tuxedoed famous director interspersed with the scenes of his grim reality. All of this stuff gives The Last Horror movie a definite difference from other movies with similar scenarios.<br><br>The film also stars Caroline Munro as the famous scream queen. And she looks pretty striking with her black and white mane of hair. Interestingly she is making a movie called 'Scream' and this was way before Wes Craven came up with his post-modern slasher. In fact, you could argue that this very film was playing around with a few of the ideas that Craven would use over a decade later to great commercial success. After all, this is a film that playfully points out the conventions of the slasher film while still essentially delivering various methods of bloody murder. What was also pleasing was the way that The Last Horror film winds things up with a pretty decent ending that wasn't obvious. So, all in all, this has to be considered one of the more innovative slasher flicks of the 80's.","user":"Red-Barracuda","rank":[6,6]},{"title":"Worth a pound of anyone's money.","rating":6,"date":"6 September 2005","review":"I bought this on DVD from a Poundland for, hey! - a pound. It was re-titled as 'Fanatic'. Actually it was a double bill. Another schlock flick who's title I forget was on the flip side of the disc. So in effect, I got the Spinell picture for 50p. I'd say it was money well spent.<br><br>This was shot on the hoof at the 1981 Cannes film festival. Joe is a taxi driver who goes there to seek out his idol/wet dream Caroline Munro. Caroline appears with her then real life spouse Judd Hamilton. Husband and wife are both dubbed, and Caroline looks pretty much as she did when she was a hostess on '3-2-1' with Ted Rogers. The film bears little resemblance to the previous Spinell/Munro vehicle, 'Maniac'. That was grim, gory and reprehensible. This is light, silly and incomprehensible.<br><br>'The last horror film' seemed to receive an inordinate amount of coverage in the British film fantasy magazine 'Starburst' at the time. I can now see why: Spinell appears reading a copy of said periodical. Reciprocal publicity. There are also numerous references to other films, especially Scorsese's 'Taxi Driver' (which Joe appeared in). In fact, there is a vaguely interesting blurring of film reality and fantasy and 'real' reality and fantasy throughout. Generally, though, it's a mess. Scenes just seem to rear up out of nowhere. But if you're interested in such things, the footage of Cannes and the general nakedness of the female cast will provide fifty pence's worth of entertainment.<br><br>There's a nice story on the Spinell documentary included on the Anchor Bay 'Maniac' disc which pertains to the making of this film. The cast and crew were staying at a rather expensive Cannes hotel, and due to the penurious nature of the budget found themselves unable to foot the extravagant bill. Spinell, Winters, Munro and all concerned therefore decided to do a runner in the middle of the night and catch the nearest plane home. Pity they didn't film that little episode and stick it in here along with everything else.<br><br>Watch out for Joe's verbal sparring with his real life mother Filomena (aka Mary). Pretty funny.","user":"LewisJForce","rank":[9,10]}]