[{"title":"30 years ago...","rating":8,"date":"28 March 2004","review":"I am shocked to realise this hilarious film is now 30 years old! Films from 1964 seen in 1988 looked a zillion years apart.....how can a 1980s film like this one still be so new and play so fresh in 2014? ...Apart from it being funnier and truly inspired I really now appreciate more the legacy of John Hughes in his series of films that were released in that 5 year span 1984-89. Anthony Michael Hall is rightly celebrated and gorgeous Molly Ringwald deserves her fame in the teen hall of Stardom. Whatever happened to Michael Schoeffling (Jake)....anyone know? It seems incongruous that so many future stars got their start in this film yet he seemed to go nowhere. I am also very surprised it got a PG rating.......given the swearing and the nudity..but I guess in the spirit of it all it was a perfect pic for anyone 12 - 112. Very clever and very funny.","user":"ptb-8","rank":[75,91]},{"title":"\"They F##king forgot my birthday!!!\"...","rating":9,"date":"29 March 1999","review":"These are the immortal words spoken by SIXTEEN CANDLES heroine Samantha Baker (Molly Ringwald) in the ultimate 80's teen comedy.  This movie has become a classic to those born in the 70's, like myself, and I now consider it a \"guilty pleasure\". Its a movie we all grew up with.  Didn't we all know a person like 'Farmer Ted', or a hot queenie like the blonde he hilariously gets.  It was every young freshman's fantasy.  This funny flick is also a relic of the 80's that is not all that dated.<br><br>The jokes still work (as long as you see it uncut) and it is neat seeing things of the not so distant past be on display.  Floppy disks, headgears, leotards, etc...  Time has not been so good to the featured stars. Ringwald and Anthony-Michael Hall, who was born to play this role, and this one only, have all but disappeared.  The biggest stars now are blips on the screen here: Joan (in a headgear) and John (a geek)  Cusack.  The film is like a toy you can't put away.<br><br>Some situations are beat, but at least Paul Dooley adds an extra dimension to the father.  Too many of John Hughes' teen-angst comedies of the era feature tissue-thin parental figures.  This was the first and best of the so-called \"brat pack\" movies, and will always hold a place in 1980's filmmaking history.  Girls learned never to lend their underwear to a geek and we all learned that high school is just a phase, easily forgotten as time goes on.","user":"Don-102","rank":[82,102]},{"title":"The eighties were great weren't they","rating":7,"date":"12 July 1999","review":"Films like Sixteen Candles personify what the eighties was all about.  And if you were a child of the 80s, you will probably identify with this film a lot more than the now younger generation.  The story is simple enough, but it works so well.  Molly Ringwald is particularly likeable in this, and she is almost irreplaceable in her part.  There are heaps of familiar faces, including small parts from many of the present day 'movie stars' ie John Cusack, Joan Cusack and Jami Gertz.  It's kind of daggy though, and when you tell people you watched it their response is usually \"Oh My God.  That is so OLD.\"  But that's what I like about it. If you want to watch a film that reflects the eighties, forget the nostalgia trips of The Wedding Singer and Romy and Michelle.  Hire a true eighties product, such as Pretty in Pink, Sixteen Candles, The Breakfast Club, St Elmo's Fire.... The list goes on and on.","user":"Meredith-7","rank":[65,81]}]