[{"title":"Most Underrated Film I've Ever Seen","rating":10,"date":"12 June 2006","review":"It's crazy the way some films get labeled \"brilliant\" while others get ignored just because of bad timing or poor studio backing or any # of things.<br><br>I'm not a fan of Westerns. I don't consider this a Western. I consider it a wonderfully written, directed, and acted work of art.<br><br>Gerald Wilson's script, and its interpretation by the three leads, is so skillful that it functions almost as a poem on the themes of \"man,\" \"animal,\" \"law,\" and euphemism.<br><br>Micheal Winner's direction is beyond good. Every cut--early on he uses many overlays, then as the film builds he uses jarring smash cuts--is breathtaking in its thoughtfulness and thematic effect. And he knows when to lay off the music. An eerily quiet early showdown scene with Burt Lancaster, Albert Salmi, and Richard Jordan (with Robert Ryan in the background) is probably the most creative and effective such scene I've ever witnessed, Leone notwithstanding.<br><br>Then there's the acting. Lancaster is THE great underrated American actor, and it's because so many of his best performances came after he'd turned 50. I truly think this is his best. He says so much with his eyes, and especially with a tiny flutter or break in his voice. The range he achieves within this supposedly rigid character is phenomenal. From the knockout first scene between him and Ryan, to the touching scenes between him and Sheree North--you'll never see a sadder face than his when North gets out of the bed--to the scene by the river with Jordan, he creates a full character simply by being a great actor. No gimmicks or wackiness. He just out-acts anyone on the screen today.<br><br>Ryan equals Burt's performance. This is the best of the ten or so Ryan performances I've seen. Like Lancaster as he aged, Ryan is unafraid to play an aging, weakening character. Seeing him come to life briefly when he takes on a \"Bronson man\" is thrilling.<br><br>Lee J. Cobb has less to do but does a heck of a lot with it. The supporting actors are, to a person, superb. But special kudos must go to Richard Jordan.<br><br>This is a film that challenges the macho stereotype and finds it wanting. Lancaster's character offers a complex alternative. An absolute must-see. Tremendous script, unparalleled acting, superb directing. Oh, and the locations are just breathtaking. It's criminal that there's no true widescreen of Lawman available. Anyway, SEE IT.","user":"matthewd-9","rank":[73,82]},{"title":"Fiat Justitia, Ruat Caelum","rating":8,"date":"14 May 2004","review":"Director Michael Winner is a controversial figure, at least in his native Britain, partly because of his political opinions, but chiefly on account of the `Death Wish' movies, which were widely seen as advocating wild-west style vigilante justice in a modern urban setting. I was therefore interested to learn that, before making these films, Winner was also responsible for `Lawman', a traditional Western that takes a more subtle, nuanced view of law and order.<br><br>Burt Lancaster plays Jered Maddox, the Sheriff of the small Western town of Bannock. Maddox has travelled to another small town, Sabbath, to arrest the cowboys who were responsible for the death of a man in Bannock. The local people of Sabbath, however, are not willing to help him, and the local Sheriff, Cotton Ryan, is a coward whose motto is `anything for a quiet life'. Despite this lack of cooperation, Maddox remains determined to do his duty, come what may.<br><br>The above summary might suggest that this is a story of right versus wrong along the lines of `High Noon', with Maddox standing as the lone representative of truth and justice against the forces of evil and cowardice. Things, however, are not so simple. It appears that the death was not deliberate murder, but an accidental shooting resulting from drunken gunplay. The cowboys' employer, a wealthy rancher named Vincent Bronson, is a popular figure in the town. Maddox himself admits that, even if he succeeds in bringing the men back to Bannock, they are unlikely to receive condign punishment, as the local Judge is notoriously corrupt and could easily be bought by a man of Bronson's wealth.<br><br>At first Maddox does seem to be a heroic figure, and he certainly shows great physical courage in facing his adversaries. Fearlessness alone, however, is not enough to make a man a true hero, and as the film progresses we begin to question whether he really is doing the right thing. Although the cowboys are likely to be acquitted if tried, and to receive a lenient sentence if convicted, their false pride and obsession with honour means that they cannot bring themselves to surrender without a fight. One by one, unafraid of his reputation as a lethal gunfighter, they challenge Maddox and are shot down. As the death toll mounts, we begin to see that he too is guilty of false pride and an obsession with upholding an abstract idea of justice, no matter what the human cost. `Fiat justitia, ruat caelum', said the Romans- let justice be done, though the heavens fall. When Maddox takes this idea to its absolute limits, the result is tragedy.<br><br>\nThere are a number of good performances. Lee J Cobb gives a poignant performance as Bronson; cattle bosses are usually shown as villainous figures in Westerns (Bruce Cabot's character in `Dodge City' being a classic example), but Bronson is a decent man, regarded as a generous benefactor by the people of Sabbath. His tragedy stems from the conflict between his sense of personal honour and a growing realisation that violence is not the answer to life's problems. Robert Ryan is also good as Sheriff Ryan, a once-brave lawman whose character has been corrupted by years of compromise, as are Sheree North as Maddox's love interest and Richard Jordan as a young gunfighter out to make a name for himself. The real star, however, is Burt Lancaster as the steely, inflexible Maddox. This is a role which combines the two distinct sides of Lancaster's talent as an actor. On the one hand, he could play a swashbuckling action hero in Westerns and other films such as `The Crimson Pirate'. On the other, he was also the thoughtful, star of intelligent films like `Birdman of Alcatraz', `The Train' or `The Swimmer'. Maddox is a fearless gunfighter, but he is also a man whose actions give rise to philosophical questions about law enforcement, the nature of justice, and the nature of honour. One could therefore almost say that it is a role that Lancaster was born to play, and he does so brilliantly. The result is a complex film that asks difficult questions without providing easy answers. It is unfortunate that Winner did not make more films like this; none of his other films that I have seen come close to it in quality. 8/10","user":"JamesHitchcock","rank":[77,96]},{"title":"Frontier justice taken to the extreme","rating":10,"date":"12 July 2001","review":"This underrated 1971 western is not your standard issue good guys/bad guys John Wayne-type film; that style went out thanks to men like Peckinpah and Leone. LAWMAN stars Burt Lancatser as a hard-bitten lawman who rides from Bannock to Sabbath to bring in a group of ranchers who, in a drunken spree, had shot up his town and killed an old man. He states his goal to Sabbath's local marshal (Robert Ryan) as plain as day: \"I'm gonna take these men back with me, or kill 'em where they stand.\"<br><br>The problem is, however, that the \"good people\" of Sabbath are beholden to these same group of ranchers and their leader (Lee J. Cobb), and are openly hostile to Lancaster for the most part. Lancaster, of course, is unperturbed by the hostility, dedicated as he is to finishing his job one way or another. The result is a somewhat violent but always compelling psychological western along the lines of HIGH NOON, well directed by future DEATH WISH director Michael Winner, perhaps his best film as a director.<br><br>Lancaster is, as always, extremely good in his role as the stoic and unbending lawman, but so too is the often-underrated Ryan as Sabbath's aging and pragmatic marshal who, when he sees Lancaster being openly threatened, stops being a \"kick dog\" and starts being the kind of marshal the West still needs. Cobb is sympathetic as the leader of the ranchers. The cast is rounded out by such top-notch performers as Robert Duvall, Richard Jordan, Albert Salmi, J.D. Cannon, Lou Frizzell, and Joseph Wiseman.<br><br>Except for an over-reliance on zooms, the cinematography by British cameraman Robert Paynter really captures the bleak scenery of the arid Southewest; the film was shot on location in and around Durango, Mexico during the summer of 1970. Jerry Fielding's score (as conducted by David Whittaker) adds to this film's starkness and occasional violence, and is sometimes influenced by jazz and even a bit of Aaron Copland in one sequence.<br><br>LAWMAN is for those western fans with a taste for suspense and psychological tension, and remains impressive to this day.","user":"virek213","rank":[57,71]}]