[{"title":"The Invasion Will Be Televised","rating":9,"date":"11 November 2009","review":"If a ninety-nine out of a hundred science fiction films fall into being cliché ridden, one will stand out above the rest. V, in its original miniseries, would be one of those that stands above the rest. V is anything but your typical science fiction story of an alien invasion. It is a tale of a fascist (alien) takeover of our society and the resistance of a few in a society to it. As a result V, while a product of the technology and culture of the 1980's, is a timeless piece of science fiction.<br><br>One of the elements to V's success is its cast. Leading, so to speak, the cast of human characters are Marc Singer as cameraman Mike Donovan and Faye Grant as med-student turned rebel leader Julie Parrish. Both Singer and Grant give nice performances that, for the most part, come across as real people in extraordinary situations. In fact the performances of the entire cast be described by that last phrase as well ranging from the Maxwell family (Michael Durrell, Penelope Windust as the parents with Blair Tefkin, Viveka Davis and Marin May as their daughters) who find themselves persecuted to the point of joining the resistance much like the Taylor family (Jason Bernard, Richard Lawson and Michael Wright) to the Bernstein family (George Morfogen, Bonnie Bartlett) who find themselves torn between their Visitor friendly son Daniel (David Packer) and the Holocaust survivor grandfather Abraham (Leonardo Cimino). In fact the single best scene involves Abraham, who is wanting to hide the persecuted Maxwell's, reminding his son that this whole situation is all too familiar for the consequences of them not being hidden means \"we haven't learned a thing\". This is a scene that is not only well acted and well written but incredibly rare in your average science fiction story as well. There's also many other fine members of the cast including Neva Patterson (Donovan's mom), Evan Kim (Donovan's camera partner Tony), Jenny Sullivan (reporter turned Visitor spokeswoman Kristine Walsh) and Kristine Walsh (as Gardener turned rebel Sancho) amongst many others. The human side of the cast is just the tip of the iceberg though.<br><br>There's also a fine cast playing the alien \"visitors\" as well. They range from their seemingly benevolent leader John (played briefly and well by Richard Herd) to Andrew Prine as the authoritative Steven. Then there's the innocent abroad in the form of Robert Englund as Willie and the resistance from within the visitors themselves in the form of Frank Ashmore as Martin and Jenny Neumann as Barbara. Then there is Jane Badler as Diana, perhaps the most attractive and conniving of the alien visitors, who plays the role with a seriousness not usually found in this kind of role. Together they form one of the best, and definitely one of the most diverse, cast of alien invaders ever assembled.<br><br>V is also aided by fine work behind the camera. There's the cinematography of John McPherson especially the tracking shot of characters watching the first contact sequence and the scenes in the mother-ship. The production design in the form of the mother ship interiors are fine examples of science fiction sets. There's also the special effects work ranging from the excellent shots of mother-ships (a decade plus before Independence Day) to the aerial dogfight at the end which all work marvelously for the most part despite a very few shots which don't look quite finished. No review of V is complete without mentioned the fine prosthetic work of the miniseries which range from the Visitors true faces to some rather uncomfortable dining sequences. Last, but not least by any means, is the fine score by composer Joe Harnell which takes puts together classical music influences and choir in one of the most unusual and best scores produced for any science fiction television piece I have heard, especially for the opening and closing credits of any part. In short: strong production values go a long way.<br><br>To my mind V's ultimate success lies in the script and direction of Kenneth Johnson. V was originally conceived not as a science fiction tale of alien invasion but as the tale of a fascist takeover of the U.S which can still be found deeply embedded in the final product. In fact that is what separates V from many other alien invasion stories. V is about fascism, how people can be lured in by it, how far those in power will go to secure their position, how the average person will react and what happens when ordinary people stand up to resist it. There's also more then a few hints of Nazi Germany as well from the Swastika-like symbol of the Visitors to Friends of the Visitors youth groups (the Hitler Youth) and, before the miniseries is over with, a strong allegory with the Holocaust as well (see the miniseries to get it). Wisely Johnson also puts a fair (but not gratitude) amount of action in as well which helps to compliment the story and move it along. V is embedded in the technology and culture of the 1980's when it was made to sure but that doesn't date the story at all. Instead V becomes, like H.G. Welles War of the Worlds before it, a timeless tale of alien invasion and human resistance to it.<br><br>What makes V successful? Well it's large cast of fine actors, nice cinematography, good special effects work, excellent prosthetic work and fine score go along way. Yet the true success of V lies in its script and story. Why? Because ultimately V is not about spaceships and ray-guns but is about people and their reactions to the extraordinary events around them.","user":"timdalton007","rank":[31,32]},{"title":"V for Victory!","rating":9,"date":"14 May 2005","review":"Now this is real sci-fi! Kenneth Johnsons story is (in my opinion) one of the best ever written. While I rank The Tripods as my favourite sci-fi adventure, this will come as a good second.<br><br>I wasn't very old when I saw V for the first time, but I can honestly say it blew me away! And even now almost 20 years later I can still watch it and be in awe like I was way back then.<br><br>And now I am just waiting for the return of V, which finally seems to be becoming reality. Hopefully it will stick to the basics and not go \"overboard\" like so many re-makes have done over the years. But with Kenny at the helm I doubt that will be a problem, since I happen to know that the legacy of V means a lot to him.","user":"dakki78","rank":[18,18]},{"title":"The TV event of my day","rating":10,"date":"14 June 2000","review":"I was 11 and 12 years old when V first aired.  It was on late at night, so I wasn't allowed to stay up and watch it.  I taped the show and I would get up at five the next day to watch the adventures of Donovan and company before I went to school.  Now granted, I loved TV when I was a kid but nothing captivated me like V.  I couldn't get enough of this show.  And seeing as it went on for two years, those of us that saw the show were quite frustrated as we waited for the Final Battle to be introduced to us.  But that is another review.  As for V, it was unlike anything I had ever seen.<br><br>Kenneth Johnson introduced us to the situation, it's characters and the tyranny and then he cut us off.  He made the first two episodes and as the show ended with Elias spray painting the wall, you sat there and said, \"that's it?\"  You just knew that the Final Battle would have to be made to sum it up and finish the series.  And when you think about it, I'll bet this series could have made so much more money if it had been made into a major motion picture.  You could have had five movies from this mini-series.  But as it stands, you have a five part mini series that just knocked everyone out back in the early 80's.<br><br>This series came out 10 years before ID4 and the similarities are astounding.  But I really believe that this does it so much better.  Right from the beginning we are hurled into the story when Donovan and Tony are in El Salvador or Nicaragua or whatever, and they witness the giant spacecraft hovering over the earth.  From there we meet the leaders of the aliens and we are introduced to some of the key players.  The set up is great but what makes it so compelling is that none of the people that form resistance groups are super-men or larger than life super-heroes.  They are regular, common people that band together for a common cause.  Sure many of them are doctors and scientists but you also have the elderly, a cameraman, a Mexican truck driver, a thief, and kids, black, white, jews, christians, atheists and a plethora of others.  This makes you feel as though it is somewhat real and the events which are taking place are actually possible.  A great touch was Abraham, the elderly Jewish man that is one of the first to take in and hide some so called \"fugitives\" on the run.  He equates the reign of the Visitors as nothing more than Hitleresque imprisonment.  He tells his son that when he was eight days old he had to be smuggled in a suitcase in order to flee the Nazi's and that alone should make them want to help. <br><br>\nV introduces and teases us with everything that the Final Battle is going to encompass.  Think of the first two V's as Star Wars and Empire Strikes Back. They set up Jedi as does V set up Final Battle.  I really and truly think that this is the best mini-series ever made and it is the highlight of TV in the 80's.  Watch all five back to back to back to back to back and you are in for a treat.<br><br>10 out 0f 10","user":"baumer","rank":[29,32]}]