[{"title":"Intelligent and interesting.","rating":8,"date":"26 June 2002","review":"There's a lot to see and enjoy in \"The Black Cannon Incident\", but two things are particularly interesting: firstly, the political satire and symbolism, while somewhat guarded, is some of the most scathing ever to reach cinemas in mainland China - it may not always seem like much to Western viewers, but when viewed in the context of, for example, other \"post-socialist\" films like those of Eastern Europe, it is considerable.<br><br>The second aspect of the movie that makes it really worth seeing is its bizarre aesthetic qualities - in this film and \"Dislocation\", Huang Jianxin uses an industrial setting and discordant music to symbolize visually China's awkward transition into modern Western-style life and the clash of cultures that eventuate.  In this and later movies, Huang picks up on seemingly minor details which, under his control, seem to develop much deeper meanings.<br><br>On the other hand, it should be stressed that this is a first film for Huang Jianxin - he later refined his film-making considerably.  The performances are good, and the idea behind the film is excellent, but the basic storytelling lags behind a bit - the endless meetings and circular conversations may be historically and symbolically realistic, but they don't really excite an audience.  If you're prepared to sit through a few dull parts, it's a very interesting viewing experience both for Chinese and foreigners.  It's a pity that Huang's plans to collaborate further with German actors fell through.","user":"humanresistor","rank":[8,9]},{"title":"Very true story that actually happened in real life","rating":10,"date":"19 November 2003","review":"SPOILER Of course, not the exact incident, but those happened under similar circumstance due to the political atomsphere of commie China.<br><br>This film was produced in 1986, a decade later than the end of Cultural Revolution (1966 - 19767), an era that can be described as same as those described in Mr. George Orwell's Novel \"1984\".  Although that mad era ended for a decade, incidents like the one depicted in this movie still happens. The road toward greater liberty was a long and uneasy one for China.<br><br>The film had better fate than the movie Fu Rong Zhen (1984), which was banned when it was first released.  This film was also hated by hardline conservative commies, who inevitably advocating its banning.<br><br>However, the era of Cultural Revolution was over a decades ago and its influence is fading, the movie was allowed to be released after fierce debate between commie old guard dogs and others with hearts, and it was a huge success.  The film was based on the novel with the same name.<br><br>The story basically tells how alert governmental cadres suspecting an innocent engineer simply because he wanted to find a Black Cannon of Chinese Chess: In Chinese Chess, one side is red and the other is black, and besides King, Horse, there are two Cannons.<br><br>The engineer was addicted to Chinese Chess and when he was sent to away on assignment, he played Chinese Chess with his friend in his spare time. When he returned, he discovered that one of the black Cannon was missing, so he rushed to the post office in the heavy rain to sent a telegraph message to his friend that read: Black Cannon Lost, Find It Fast.<br><br>The alert postal employee view this message as a secret code for spies, so she reported this to cops.  Cops responded promptly and followed the Engineer back home in the imported police car that was equipped with advanced surveillance system, from which the engineer's clear photos were taken in the heavy rain and dark night.<br><br>The security department of the factory where the engineer worked get the instruction from the cop and reviewed the engineer's personal archive, which could only be viewed by governmental cadres but the engineer himself could not veiw, just like that of most ordinary Chinese.  Huh! someting fishy about this engineer: he was born shortly before the commie takeover and as a baby, he was a Catholic (although he was taken to the church by his parents). He is also an expert in German, both can connect him to some foreign spy ring.  Enough to suspect him to be a spy.<br><br>Even though there was no solid evidence, but the suspicion was enough to transfer him for the important post he current is on.  No other person was good enough to translate technical manuals in German, but that is not important, a tourist guide with limited German proficiency was selected to replace the engineer.  The important thing is to prevent spies, real or imagined.  As a result, the imported German equipment broken down due to operational errors caused by incorrect translation and millions of bucks was lost.<br><br>Finally, to put all this to an end, the cadres intercepted the mail from the engineer's friend and opened his mail without his permission (a common practice that was accepted in China, not for inspections by governmental cadres, but also recognized as proper when parents did the same to their kids, as shown in the film \"A Great Wall\", about oversea Chinese returning to China and suffers cultural shocks), and to everyone's shock, it was a just a black Cannon of Chinese Chess, simply as that.<br><br>The cadres were stunned, they could not understand why such worthless piece of junk would cause such a big fuss for the engineers (Note: Not for the government!), because the money spent for sending the telegraph would be sufficient enough to buy an entire new set of Chinese Chess.<br><br>The engineer, humbly believes that it was his fault, too, sincerely apologized to the governmental cadres that he caused all these troubles and never would he committ such blunder again.","user":"zzmale","rank":[5,6]},{"title":"A too-restrained satire","rating":4,"date":"5 February 1999","review":"\"The Black Cannon Incident\" is a very cautious attempt at political satire; while it extracts a few laughs from the spiraling misunderstandings caused by a mysterious telegram sent by a technical translator, there is also an awful lot of tedium, at least for this Western viewer.","user":"Levana","rank":[3,11]}]