[{"title":"Simple, but Effective","rating":7,"date":"22 February 2006","review":"\"Warlords of the 21st Century\" aka \"Battletruck\" (as it is known to me) was a movie that I saw once when I was about eleven years old. It came on late night television and it left an extremely good impression on me.. Since then I've been trying to obtain the film on VHS for nearly eight years. It was so hard to get, even when I was in New Zealand I couldn't get my hands on it, as it was only for rent and no one would sell it to me.<br><br>Seeing it again it didn't give me the same rush as I was little, but still, it was very entertaining. This low budget \"Mad Max\"-like action flick is no blockbuster, nor is it surprising since the storyline is very straightforward.. But the battletruck itself looks scary, the music is a little creepy and the acting performances are good enough.. Great for an evening on the couch with some friends, IF you can get your hands on a copy.. 7/10","user":"rochus_meijer","rank":[17,20]},{"title":"Battletruck","rating":6,"date":"15 June 2009","review":"Reading the comments about this movie, for one, their not trying to sound like Americans, they are speaking New Zealand, thats the way we sound except for the odd over acted lines. i remember this being made and even seeing the land rover series one come to our school.knew the truck driver who drove the Mack, and even where most of the scenes where filmed. Alexandra right in the heart of central Otago. one scene where he is being chased though pines trees is 30 seconds out of Alexandra, heading north from Alex to Cromwell looked left and there you have it!! Back in the 80's this was great but now in the 2000 looks abit cheap. the original tidal was Battletruck but I see they changed to it warlords, Battletruck is better. Just finished watching again, been 24 years since i last seen it... brings back memory's!! But man as kids did we have fun with our toys after watching this!! Same with the movie Convoy....cool!","user":"nzmush","rank":[8,10]},{"title":"New Zealand's take on the 80's Post-Nuke Future hoopla and as they see it: Napalm has won over lipstick and chicken excrement is the way to drive!","rating":7,"date":"31 January 2008","review":"Man, this was one of my favorite movies when I was a kid. Must have watched it countless times. I hadn't watched it in many years, so I decided to pop it in again. With having watched quite a few 80's post-nuke films more by now, I was kind of afraid that BATTLETRUCK wouldn't hold together very well anymore. But surprisingly, it very much does! Of course BATTLETRUCK holds references to MAD MAX (but that's what we expect from any post-apo flick, right?). At least it's not one of those laughter-inducing Snake Plissken rip-offs this 80's sub-genre was flooded with.<br><br>This is one of those very few 80's post-apocalyptic/wastelands themed movies that I can actually agree on being a very serious genre-effort (as in: It doesn't go shamelessly over-the-top) and even a good movie in general. I don't really understand why this movie was released under the title WARLORDS OF THE 21st CENTURY For one thing, it makes you suspect that you're dealing with a very cheesy, incompetent and blatant 80's Italian genre-effort. And second, BATTLETRUCK is a much cooler and more appropriate title. The black truck featured in this movie, really is the main attraction and it looks frickin' great! Mounting the camera on the front of the truck (but turning it around so we actually see the truck) while it's driving, makes this black beast on wheels a truly menacing entity. And then there's also great shots of the evil truck approaching in the distance, while on the foreground you can see unsuspecting (soon to be) victims.<br><br>Truck itself, isn't really a demonic entity of course - like the car in THE CAR (1977), for instance – but it's owned by Colonel Straker, the villainous leader of a band of thugs roaming the wastelands (basically pillaging everything in sight, torturing and killing random people and always searching for precious gasoline). When a girl (named Corlie) fleas from Straker's camp, that's when the trouble begins. Loner Hunter (Michael Beck), rescues her and he had better not done that. Because now, not only his and Corlie's life is in danger, but also the whole peace-loving, democracy-upholding community of Clearwater might be wiped out by Straker's vengeance. The only thing I can comment about on the plot, is that it sometimes seems a bit to run around in circles. But that even seemed to be done on purpose: It gives you the time to really get to know (and care about) all the characters, and see how they tie in all together (because some of them have secrets).<br><br>The whole cast is doing a pretty swell job for a movie of this type. Michael Beck pulls it of nicely as the loner-hero with his nifty-looking bike (thankfully not featuring any goofy gadgets), not really intending to fight, but taking action and making a stand when doing what is right is called for. Especially James Wainwright, as the sadistic Straker, is delicious to behold. He gives a dead-serious performance, and the nasty, meaningless killings he performs and orders are just so mean-spirited. I mean, he's not just an idiot like, for example Gearge Eastman portrayed in WARRIORS OF THE WASTELAND (aka I NUOVI BARBARI). Colonel Straker really is a cunning, vengeful, bad mo-fo. And you can bet your sweet behind, that whenever he puts his arm around your shoulder and smiles, your minutes are numbered.<br><br>Brings us to the violent outbursts (that every self-respecting post-nuke film simply must have). BATTLETRUCK isn't a non-stop portrayal of action and violence (and that really uplifts this movie above the general sludge that was being released in this genre). But I assure you, every killing in this movie is handled with such care. Every death-scene looks real. The blood-splatters look real and so do the flesh-wounds and other make-up effects. My favorite scene involving on-screen violence shows us a nasty blow-to-the-head by a fire-extinguisher. Man, that's gotta hurt! Great timing with the good-looking blood-squirts in that scene too. But just don't expect gory sights in BATTLETRUCK; director Harley Cokeliss kept it realistic and didn't over-do it.<br><br>The cinematography is also a lot better-looking than many of those notable Italian post-nuke efforts. The landscapes from Otago, New Zealand are astonishing (as if we didn't know that already), without going astray too much from that \"dusty wasteland\" feeling every post-apo flick needs. And there are a couple of cool helicopter-shots, filming Hunter ripping through the landscapes on his bike and showing the battle truck roaming the wastelands. Particularly the final chase (bike vs. battle truck) is filmed in a very capable fashion. Aside that, the few stunts (with vehicles) in the movie even look real and convincing. A final mention goes to composer Kevin Peek. His eerie electronic 'soundscapes' provide very appropriate atmospheric wrappings every time our menacing truck is on the move. But during some action-sequences, when his score becomes more up-tempo rocking (and some guitars even come on), it gets reduced to being not much more than just amusing (oh well, after all: This is a movie from the 80's). The set-design and vehicles look convincing enough too and there's even a nice roll for a 'modified' Volkswagen Beetle. <br><br>So, BATTLETRUCK has a tight, not too complicated plot and decent character-drawings. The action is there. The violence is there. The drama is there. The performances and dialogues are good. The blood and injuries look real. And all the characters that die, you even get to know (on some level) first. And the climax is also satisfying. I've never seen all those elements dosed in such a well-balanced manner in any post-apocalyptic movie. And to be able to make this statement, I had to see numerous post-apo crap-fests first in recent years. In the end, BATTLETRUCK rightfully remains a favorite of mine, and if you like this sub-genre and can appreciate a more serious entry in it, then I can recommend tracking this baby down.","user":"Vomitron_G","rank":[10,15]}]