[{"title":"Ra was cool, including on the set.","rating":15,"date":"15 March 2004","review":"I was credited as 2nd unit director on this film.  Ra was a calm, sort of surreal Buddha through the whole thing, even one time when the script called for him to be tied-up in a chair and menaced by gangsters.  During the many hours it took to get this scene on film, Ra just quietly sat tied-up in that chair, so quietly that a couple of times I went over to make sure he was still breathing.  He said he was fine, just relaxing on \"another plain\".<br><br>\nNear the end of the shoot, we had a nightclub scene with about 70 extras and a chorus of girls on stage.  They were supposed to dance to a tune that Ra insisted on playing live on camera with his band.  I had been bugging him unsuccessfully for days as to what he was going to play so that the girls could rehearse.<br><br>On the day scheduled to shoot this scene, I nervously reminded Ra again about the music. Ra smiled, casually produced some old vinyl albums done by other bands and a portable record player, and suggested that I play them for the chorus to see what they liked. I did, and they caught fire with one of the tunes.  Ra said \"Fine. You got any music manuscript paper?\"  I was ready for him.  I did.<br><br>And so, during lunch break, Ra listened to the record, transposed the instrumental lead sheets to paper for his band with a few of his own alterations, and we choreographed and shot it after lunch.<br><br>For my money, Ra was a fine musician...extremely cool and really \"there\".","user":"firewatr","rank":[61,62]},{"title":"Part science fiction, part music documentary","rating":7,"date":"24 August 1999","review":"I can't help but think that Vxf111 is either joking, or (unfortunately) did not know who Sun Ra was before viewing the film.  Yes, the film was certainly produced with a low budget, and it might not be of much interest to those who aren't fans of, or at least interested in, Sun Ra.<br><br>Sun Ra maintained that he was from Saturn, although historical documents note that he was born Herman Blount (or Poole) in Birmingham, AL.  Sun Ra was a first-rate pianist, arranger, and composer, and worked with Fletcher Henderson's orchestra.  He formed his own big band, the Arkestra, during the 1950s in Chicago.  This ensemble was completely unlike any other big band, as it incorporated elements of Egyptian mythology, science fiction, and other exotica and esoterica (those familiar with Earth, Wind, and Fire and Parliament-Funkadelic should take note).  Sun Ra was also an early proponent of electronic instruments in jazz.<br><br>The film \"Space Is The Place\" is part science fiction and part musical documentary.  A comparison could also be made to the \"blaxploitation\" films of the 1970s.  The story centers around Sun Ra's return to Earth after an extended absence, and focuses on his concern for the fate of humanity and African-Americans in particular.  All of this is infused with his mythological outlook.  This certainly makes Sun Ra an \"interesting character\" but he was very serious about what he did and what he said.  If any of this makes you the least bit curious about Sun Ra then I would recommend the film, which is available on videocassette.","user":"Gyrofrog","rank":[20,21]},{"title":"Crazy movie from a serious genius","rating":10,"date":"24 October 2000","review":"I'll tell you what, Sun Ra was a gift we didn't love enough.  He gave us fifty years of his time to \"get it,\" but no one bothered.  He's sitting on his home planet right now, entertaining his minions on Saturn.  Sun Ra made one movie, that's all he needed to preach his philosophy.  It is a brilliant statement on race relations in the early 1970's.  An interesting story, engaging characters, and some out there music.  One fault: this was not his best period in music.  His records from the 50's and 60's were astounding, good enough to make this film even more of a classic.  Space Is The Place is essential viewing for those who care about jazz or Africana cinema.","user":"drocta950","rank":[20,22]}]