[{"title":"Try to watch this without talking to the characters...","rating":8,"date":"21 April 2000","review":"I think this film, probably more than any other, causes me to talk to the characters on the screen in an exasperated way--something akin to the way you want to yell at the characters in a slasher movie not to run outside to investigate sounds.<br><br>The only difference is that this film is fantastic, whereas cheap slasher movies are not.  Blood Simple is emotionally involving and the suspense is played to perfection.  While the characters are completely clueless as to what has gone on around them, we know everything.  What we don't know is what the characters are going to do next.  <br><br>As in every Coen film, things quickly get out of control.  Some people have commented that the characters here acted unbelievably, but I'd have to say that when you think about their situations, the reactions are completely compatible with the way the characters are set up.  The problem is that nobody knows what's going on except the viewers.<br><br>Coen fans will notice many recurring themes from their other films (especially Fargo and The Big Lebowski) such as the use of headlights, passing motorists witnessing a crime, shower curtains and bathroom windows, detectives driving VW beetles, husbands hiring the wrong people to carry out a crime... I had a longer list in mind earlier while watching it but I've forgotten some.  It's almost like these films all go together as a series of films depicting how similar situations would end up in different locations in America.","user":"bross3","rank":[145,175]},{"title":"First outing for the Coens is an outstanding 80's film noir thriller","rating":9,"date":"24 July 2015","review":"This is the Coen brothers' directorial film debut, and not only is it different from most other films in the Coens' catalog of work, it is just a different kind of film altogether. With a budget of just a little more than one million dollars and four main characters, the Coen brothers created a film noir thriller 35 years after the genre had expired. In this film the Coens demonstrate that if you have a conscience, a killing can be hard to carry out, but regardless of whether or not you have a conscience, a killing is hard to get away with.<br><br>Throughout the film, as is true in many film noirs, the audience is kept aware of most of what is really going on, which is a grand misunderstanding with very tragic consequences. The four characters are all being misled by the incomplete part of the jigsaw puzzle that each of them possesses. The setup is simple enough: Ray is having an affair with Abby, wife of his evil boss Marty. Marty gets angry about the situation and decides to pay a private eye to murder both of them. Things proceed to go as badly as possible for everyone from that point on as each of our characters are mainly motivated by mistrust - even the young lovers Ray and Abby.<br><br>What makes Blood Simple different from other Coen brothers films is he complete lack of humor throughout the entire film. Even the bleak \"Fargo\" is sprinkled with humor throughout. Equally noticeable is the cold remoteness that fills every square inch of this film which includes everything from Abby's Texas-sized apartment, to the flat open stretches of Texas landscape. This cold remoteness just seems to magnify the quiet terror of what is going on. For in this movie, the spilling of blood isn't clean, easy, or free of emotional consequence. For example, when one character is in the process of burying the \"body\" of someone he believed had been murdered by someone else, he finds out, much to his surprise, that the person is actually still alive. Now faced with the \"necessity\" of killing this person to cover up the crime, he finds the task impossible to do in a clean quick way - with a rifle. As a result, he winds up actually killing the person in the most horrible way possible - by simply ignoring the fact that he is still alive and burying him anyway - all because he is too queasy to commit the overt act of shooting someone himself. As we witness the sun come up on a day bereft of the life of the deceased and the entombment complete, it's very relieving to remember it's only a movie.<br><br>None of this is to say that Blood Simple isn't an enjoyable film. Seeing the characters and their lives come apart one by one will keep you riveted to your seat. We already know \"who done it,\" we're just hanging around to see if the other characters figure out not only \"who done it\", but what it is that has been done in the first place. All the cast members were great and Frances McDormand, Dan Hedaya, and M. Emmett Walsh have gone on to bigger and better things since this movie was made. I just wonder what happened to John Getz, since he performed just as well as the other three only to remain largely unknown. With the exception of a small part in the remake of \"The Fly\" in 1986, I can't think of another film in which I've seen him.<br><br>In summary, the best thing about Blood Simple is that even if we always know what's happening, we never know what's going to happen next up to the very end. Highly recommended.","user":"AlsExGal","rank":[17,18]},{"title":"Texas noir","rating":8,"date":"28 March 2000","review":"Blood Simple is pure Coens.  There are the usual bag of cinematic tricks, the twisting storyline, the seamy characters, and the occasional droplet of dark humor.  The story concerns a bar owner who thinks his wife is cheating on him.  He hires a sleazy private investigator to find out, and when he learns the truth, he wants them dead.  Trouble is, things get kind of complicated when a murder occurs.  The film creates a palpable feeling of tension, where you don't know what to expect next.  Half the fun of this film is trying to figure out what will happen.  A true testament of the well sturctured nature of the film, is the fact that there are only four main characters, and they hold your attention till the very end.  And in traditional film noir fanfare, all of these characters have some sort of sordid business to attend to.  The Coens drew on their experiences on Blood Simple and made the similar, but very different, Fargo.   Watch Blood Simple for a good old fashioned film noir that will keep you guessing.","user":"bat-5","rank":[90,119]}]