[{"title":"a bit of 60s-era trivia","rating":5,"date":"5 June 2004","review":"IMBD refused to post this in the \"Trivia\" section, so I'll add it as a comment:  note that throughout the film, the men are often shirtless; however their pants and shorts are always carefully tailored to cover their navels, like Barbara Eden's harem-pants in \"I Dream of Jeannie\".<br><br>If you have access to the DVD, it is very well worth it to watch the special-features documentaries and interviews on disc 2.  What the actors and crew went through to make this thing is incredible!  The many animals used are mostly nasty and potentially very dangerous.  That no one got disemboweled by a zebra or ostrich kick, or a tiger-claw, is a miracle; let alone the face-off scene with the hyenas!  Wrestling an anaconda chest-deep in a mosquito and leech-infested swamp is probably not a role most actors dream of.  James MacArthur was told by the snake's handler to just dunk the snake's head under water when it started to constrict him; apparently it worked, as he lived to tell the tale!","user":"notmicro","rank":[49,53]},{"title":"Great Disney film!","rating":8,"date":"5 October 1999","review":"This is one of Disney's best efforts.  Beautiful scenery, great soundtrack music, and a hard-working cast add much to this compelling story of a shipwrecked family.  To me this film is an exception to the less-weighty fare that Disney was wont to produce over the years.  I like Disney flicks, but this is one I can go back and watch when I want to get lost in an idyllic setting (with beautiful soundtrack music to establish the mood).  You've gotta love those coconut bombs!","user":"kolob","rank":[40,49]},{"title":"Swiss Family Robinson","rating":8,"date":"8 January 2006","review":"Pure Disney magic! What a movie....might just be the greatest Disney film of all, might throw in \"Pollyanna\" and \"Song of the South\" in there as close competition. What is there not to like? Beautiful photography and a perfect casting of Dorothy McGuire as the mother who is the glue that holds the family together along with the suave British actor John Mills (Hayley's father) as the dad of the family. Great opening scene of foundering ship nearly stuck on a reef during violent storm...family quickly recognizes they will be on the island for the long haul and makes it an island paradise complete with a tree house that the Hilton hotel chain could rent out for big bucks. Family makes use of every scrap of fabric, wood, powder, and weapons as they struggle to survive the hazards of the island they are stranded upon. How in the world did the Disney team transport all of the animals onto that small island for this wonderful film? Zebras, elephants, snakes, tigers, and throw in an ostrich too for a family fun filled ride picnic. Only thing I wondered about was how the entire crew of pirates seem to be madeup of asians....most pirates in films are usually caucasians. Tommy Kirk, Kevin Corcoran, who flew into Tobago days after finishing \"Pollyanna\" and James McArthur play splendid roles as the three sons who grow up physically and discover themselves as young men on the island. Love the scenes of the watering hole complete with a natural water slide and swinging vines to traipse back and forth on. Janet Munro plays the stranded girl, rescued by McArthur and Kirk, and becomes a tug of war for affection between the two. Just the scenery alone on the island and the lagoons makes me want to visit the filming sight. This is a timeless classic, watch it a couple of times a year and it is just as entertaining the second time as the first. Wish Disney would re-release this film to theatres so you could see it on a big wide screen, preferably Imax. Movies just do not get any better than this one. Perfect film for family viewing.","user":"mhrabovsky1-1","rank":[30,38]}]