[{"title":"The definition of satire on film","rating":10,"date":"15 April 2004","review":"I first saw \"Heathers\" when it was first released in 1989 and to this day I remember most of the lines and scenes which cause me to laugh at all the wrong times.<br><br>I went to see the film because the hot actor of the time was Winona Ryder and I was in love with her after seeing her in \"Lucas\" and \"Beetlejuice\" and \"1969\". In each movie she played a version of a Goth chick - very smart, very pretty, but with a monotone delivery and moody attitude.<br><br>I also wanted to catch Christian Slater. I remembered him from his role as Binx in \"The Legend of Billie Jean\" and in the film \"Tucker: The Man and His Dream\"<br><br>\"Heathers\" is great satire of teen life back in the 1980's. It picks apart every teen angst and cliche and spins it in a goofy plot of rebellion and revenge gone amuck.<br><br>Ryder, playing Veronica, is on the fringe of the popular clic run by 3 girls names Heather. Each Heather is abusive, dumb, and pretty. For any teen who wanted to fit in the popular crowd but couldn't make it completely will identify with Veronica.<br><br>She meets a new student, J.D., played by Slater who is the complete opposite of the popular crowd. He wants nothing to do with them or the school. Veronica finds this interesting and soon she falls under the expert manipulation of J.D. Due to what starts as an accidental death, the two start a chain of events that looks like a teen suicide epidemic that was the common fear of adults back then.<br><br>Slater steals the movie from Ryder with his sly Jack Nicholson line delivery and James Dean attitude. Ryder is good but she can't stop Slater from chewing up the scenes.<br><br>The adults in the movie are classic clueless parental units that teen movies seem to always need. The best one is the guidance counselor that says \"Whether or not a teenager decides to kill themselves is the biggest decision of their life. \"<br><br>Watching this movie I kept saying to myself \"They just did not do that?\" or \"They just did not say that?\" I never laughed so hard in my life at that time.<br><br>A special treat was the Heather played by Shannen Doherty. Besides Ryder and Slater, she was the only other actor that I knew (except for Patrick Labyorteaux, who played the jock \"Ram\" who can now be seen on JAG as Ens. Roberts). Before Heathers, Shannen had played good girl roles and had just ended a series called \"Our House\" where she wanted to become a pilot. Her role became more interesting after finding out she turned out like her \"Heather\" character in real life.<br><br>The only thing that bothers me about this film today is that it could never be made today. The suicide epidemics (that still happen from time to time) has been replaced by killing one's classmates at school. I just don't think the studios would have the guts to film a satire like \"Heathers\" today.<br><br>As a side note: I read some of the previous comments from users who have only seen this movie on TV. All I can say is see the uncut version either on a movie channel or rent the DVD. The language and satire will only work in its uncensored format.","user":"cadfile","rank":[106,125]},{"title":"Lick it up viewer; Lick. It. Up.","rating":9,"date":"15 May 2006","review":"Ahhh... the late 80's. When shoulder pads were still in fashion, Winona Ryder hadn't yet been arrested for shoplifting and teen movies didn't solely feature recycled actors.<br><br>When teen genius Veronica Sawyer (Ryder) gets bored with the shallow and cliquey lifestyle of the three Heathers; her new-found high school chums, she wishes them dead. She never expects it to happen, but this all changes when she meets Jason 'JD' Dean (Christian Slater), a cool, darkly-dressed rebel who moves around the US randomly with his distant tycoon father.<br><br>From the iconic opening sequence to the explosive ending, every scene is darkly comic and dripping with irony. It almost looks over-rehearsed as nearly every actor's performance is flawless. Ryder in particular shines with her angst-ridden 'Dear Diary' entries, and Slater I don't believe has ever again encapsulated such a perfect role in his career to date.<br><br>The queen Heather (Kim Walker) really deserved more screen-time. She perfectly represents the bitchy, sneering, self-obsessed High School teen. She even manages to convey vulnerability after uttering the immortal line 'Well f/ck me gently with a chainsaw.' Shannen Doherty starts off with what seems a minor part which gradually builds and lets her have fun with the role. The only disappointing Heather is Lisanne Falk, with whom we don't really connect or care about. <br><br>It's hard to find anything to pick on with this movie, but it could have used some smoother editing. The scenes cut to actors in different lighting and obvious passages of time to deliver major lines, and correct me if I'm wrong but I don't think corpses should breathe.<br><br>The humour is dark and the plot unbelievable at times, but this only adds to the surreal atmosphere and unforgettable lines. A sexy cast, a great script and director Michael Lehmann's vision makes this a must-see film and a worthy addition to any DVD collection. If you haven't yet witnessed the brilliance of Heathers, rectify this now.","user":"Two_Pieces_of_Christina","rank":[77,93]},{"title":"Best teen comedy ever.","rating":10,"date":"5 April 2005","review":"Daniel Waters wrote one of the best satires ever in \"Heathers\", a dark comedy that ranks right up there with \"Dr. Strangelove\" and \"Network\". Certainly it's the best teen comedy ever made. Why? Because in spite of its highly stylized depiction of teenagers, it caught the truest essence of what high school is actually like in America. Not only that, it trashed the entire genre and-- in a feat of sheer genius-- even the *reaction* to the genre by outside observers (namely parents). Terry Southern could have done no better.<br><br>\"Westerburg high school self-destructed not *because* of society but because Westerburg High School *was* society\" was restated, to near-universal praise, by Michael Moore in \"Bowling For Columbine\", but Waters said it before him, said it better, and frankly he's got a lot more credibility (\"Hudson Hawk\" notwithstanding). The cast is brilliant, even if, strangely, some of them don't seem to get what the whole movie was about. You half expect that most of the cast and crew, like the kids who sign a petition to bring Big Fun to the school for a gig, made a movie they didn't know they were making. But the key figures nailed it-- Ryder and Slater were never better.<br><br>\"Heathers\" is one of the best films of the Eighties-- put the lid on the Eighties, as it were. It has suffered criminal neglect, probably because it may have required an \"indie auteur\" to really knock the cinematic elements out of the park. The direction is competent but unspectacular. Still, the star is the writing, and Waters deserved an Oscar for this script. Unsentimental, vicious, and above all hilariously funny, he drove a stake through the heart of those oh-so-precious John Hughes films and, at the same time, set the stage for Kevin Williamson and all the rest. He did it with a perfect ear for dialogue combined with a Swiftian vision of social structures, and did it all as an argument *against* ironic detachment, for which this film and its messages needs to be revisited now more than ever. Simply incredible.","user":"nick-848","rank":[133,168]}]