[{"title":"\"The Tortured Soul of an Artist or Smiles of a Summer Night meets Hour of the Wolf.\"","rating":7,"date":"17 September 2005","review":"With the exception for the abrupt and somehow rushed and unsatisfying ending, \"Magician\" is a typical (in a good sense of the word) Bergman's film that I liked a lot. I would call it \"The Tortured Soul of an Artist or Smiles of a Summer Night meets Hour of the Wolf.\" I did not know what to expect from the film and was pleasantly surprised by an interesting story; impressive (especially in the earlier scenes in the woods) black and white cinematography; perfect blend of humor, intense drama, and mystery. Acting was perfect - not a big surprise with the cast like that: Max von Sydow, Ingrid Thulin, Gunnar Björnstrand, Bibi Andersson, and Erland Josephson. I'd like to mention Naima Wifstrand as Granny Vogler - what a great actress and what a character - she stepped out from the pages of the fairy tales, the old witch, wise and powerful; she also provides many comical scenes.<br><br>7.5/10","user":"Galina_movie_fan","rank":[32,37]},{"title":"I didn't die, but I haunt the living.","rating":8,"date":"5 June 2009","review":"Vogler's Magnetic Health Theater rolls into town and is promptly summoned for a meet with the town big wigs. Hoping to expose all involved in the theatre as charlatans, the disbelievers request a personal show before allowing the show to go public. With very interesting results.<br><br>There is a belief amongst many Ingmar Begman fans that Ansiktet (The Magician) is far too accessible a piece to be considered one of his greatest pieces. And whilst it does find Bergman more easy to understand for the casual viewer, it's however still complex enough to thrill and niggle the mind in equal measure. Taking two factors that he very much adored, masks and magic, Bergman threads them off into various directions, and in the process testing us the audience as to just what to expect from the story. The mysterious wonder of it all is naturally aided by Bergman's use of light and shadowy trickery, symbols loom heavy without dampening the theme on offer, with nothing of course actually quite being as it seems.<br><br>As is normally the case under the master director, the cast are uniformally strong. With Gunnar Bjornstrand and Ingrid Thulin particularly standing out. But really this is all about tricks and ideas relating to magic and its blending in with reality. So much so that with the end comes an awakening that we the audience are indeed props in one of Bergman's shows, and that can never be a bad or even an accessible thing.<br><br>A fascinating picture from a very fascinating director. 8/10","user":"hitchcockthelegend","rank":[24,28]},{"title":"a Bergman film that's not depressing or about death!","rating":8,"date":"8 July 2005","review":"I've seen a lot of Ingmar Bergman films and sometimes I don't want to see one of his films about death or mental illness. Well, starting in the 1960s to the 1980s, these were the main themes of his movies, but in some of his earlier films, these are not so pervasive--such as the movies The Devil's Eye (a comedy) and The Magician (\"Ansiktet\"). Because of this, they may be more approachable to the average viewer who would balk at the much more serious tone of such classics as Through a Glass Darkly (deep depression), Persona (mental illness), Autumn Sonata (repressed anger and abandonment), The Seventh Seal (death and the plague) or Fanny and Alexander (child abuse and emotional neglect).<br><br>The story is about a traveling group of hoaxters who put on a show combining magic and \"animal magnetism\" (i.e., an early name given to hypnosis). When they arrive at a Swedish town, they are forced to come to an audience with the local official and his cronies who want to prove that the act is a fraud. Bergman really doesn't try to resolve this issue, but instead shows how the town officials are really rather petty and mean people. How this traveling group deftly survives this encounter is the main focus of the movie. I especially liked the portion of the movie about the autopsy. It sounds gross, but I thought it was actually kind of funny. One of the officials is a cold and rather nasty doctor who longs for a chance to do an autopsy on the hypnotist. He gets far more than he bargains for--that's all I really want to say--otherwise it might ruin the suspense.<br><br>So, overall I liked the movie. It was not great but well acted and not the least bit depressing.","user":"MartinHafer","rank":[31,38]}]