[{"title":"Sassy, warm and genuinely funny","rating":2,"date":"2 October 2001","review":"\"Family\" movies usually make me cringe. Saccharine plots, cloying kiddie actors, goopy dialogue...no, thank you! But \"The Parent Trap\" succeeds admirably as both children-friendly fare and reasonably witty, sophisticated comedy.<br><br> The high-class production values don't hurt, and neither does the superb cast, right down to the character roles. The ever-dependable Una Merkel is a gem as the smart-talking maid,  having lost none of her streetwise timing since her brassy blonde days in the 1930's. Charlie Ruggles is extraordinarily lovable as the grandfather, and Cathleen Nesbitt plays wonderfully against type as the domineering grandmother. Leo G. Carroll once again benefits a film simply by his appearance, and even Nancy \"Miss Hathaway\" Kulp is on board as a butch camp counselor (quite a stretch).<br><br> Of course, at the heart of it all, is the bravura performance of Hayley Mills as twins Susan and Sharon. She's never revoltingly sweet--there's a winning streak of spice in her personality that separates her from all other child stars. Plus, her kicky pre-Beatles British accent and snub-nosed beauty lend her a more worldly air than her contemporaries.<br><br> The ravishing Maureen O'Hara, in one of her last major roles as the twins' mother, Maggie, begins the film as a nondescript cipher, but her glamorous metamorphosis in the latter half of the film shows just how funny and sexy she can be. Mitch, the twins' father, is played by the ruggedly handsome Brian Keith, who generates the right mixture of roughneck toughness and paternal warmth.<br><br>And the criminally-overlooked Joanna Barnes plays Vicki, the  predatory golddigger looking to sink her claws into Mitch.  Vicki's verbal duels with Maggie and the twins are surprisingly catty for a children's film, and delivered with perfect villainy.<br><br> The very 1961 flourishes are priceless: the hopelessly tone-deaf Tommy Sands and Annette Funicello \"singing\" the theme song; the \"formal\" dance, with the girls all decked out in crinolines and laces; Susan plastering her bungalow wall with pictures of her favorite pin up boys (Rick Nelson!); and, my personal favorites, Sharon and Susan showing each other their parents' photos: hyper-posed, glamorous Hollywood 8x10 glossies!<br><br> The plot actually plays like a highly sanitized Rock Hudson/Doris Day bedroom farce, except that Susan and Sharon direct the course of action. You know what the ending will be even before you watch the movie, but it doesn't really matter. This is a delicious bon-bon of a flick, as irresistible to adults as to their children.","user":"TJBNYC","rank":[49,51]},{"title":"A Classic Charmer","rating":8,"date":"8 April 2005","review":"Although the split-screen technique had been around for a decade or so, it was usually more noted for its failures than its success, and the actor required to play dual roles usually took tremendous heat for their failure to create two physically identical but distinctly different characterizations on screen. But with THE PARENT TRAP, with the difficult dual role resting on the shoulders of an extremely young star, Walt Disney struck gold. It would be the single highest grossing film the studio had released up to that time, and even some forty years later the baby-boomers who flocked to see it in 1961 regard it as one of their favorite movie experiences.<br><br>But THE PARENT TRAP has a lot more going for it than mere nostalgia. The cast is really, really good, featuring the ever-likable Maureen O'Hara and Brian Keith in leading roles and a host of great character actors (including Leo G. Carroll and Nancy Kulp) in minor roles. And then there is Haley Mills. The daughter and sister of noted English actors, Mills was no newcomer to the screen when THE PARENT TRAP went before the cameras--she had even picked up an Oscar for her earlier Disney film POLLYANNA. Even so, this was no guarantee that she could pull off the feat of double roles, something that had daunted even the legendary Bette Davis. But she did.<br><br>The story has been told so often that surely every one knows it by now. A wife delivers twin daughters--but shortly afterward divorces her husband, and each wins custody of one child. The children are raised without any knowledge of each other's existence... until they unexpectedly bump into each other at summer camp, put two and two together, and devise a scheme to get their parents back together again.<br><br>Even today, and in spite of its familiarity, it's an amusing idea, and while the actual script is weak in spots the cast, and especially Haley Mills, makes the most of it. There's plenty of slapstick, lots of laugh-out-loud scenes, and enough charm to beguile all but the most cynical viewers. And Haley Mills clearly demonstrates why she was regarded as the single most gifted child actor of her era: although she plays both Susan and Sharon with the same edge of mischievous fun, they do indeed come off as completely different personalities.<br><br>Of course, digital technology has left the old split-screen technique in the dust, and today its easy to see the flaws in the technique that weren't so obvious at the time. And the quality of the film transfer is not the best: while this isn't the worst transfer I've seen, it is full of artifacts nonetheless. Even so, the appeal of the story, the cast, and most particularly Haley Mills make up for a lot, and this Disney double DVD comes complete with a host of bonuses (including a making-of documentary and an audio commentary track by director David Swift and Haley Mills) that fans will enjoy quite a bit.<br><br>If you were a fan of the film then, you'll remain a fan of it now. And if you want to introduce your family to a truly charming movie experience, you couldn't make a better choice.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[29,30]},{"title":"One of my favourites","rating":8,"date":"8 November 2000","review":"This is one of the best Disney movies ever made. It is funny, warm, and it is something everybody can enjoy. To watch this in the twenty first century is a wonderful trip back in time. This movie is very 60's, but that does not make it out of date, the tricks and gags are timeless. I loved this movie when I saw it for the first time many years ago. Therefore, when the new 1998 remake came out, I had to see that too. The new one is also sweet and warm, but the original version is the best. If you see this version first and then all or some of the new afterwards (as I tried, for fun, one was on TV and I have the other on DVD), the new one reveals itself as being superficial and a bit cheasy compared to the original.","user":"Peter Rasmussen Denmark","rank":[19,19]}]