[{"title":"This one didn't Kapture me.","rating":4,"date":"26 September 2011","review":"Lt. Andrews will be spinning in his grave: after rescuing Molly Stewart from a world of vice (in the original Angel) and financially supporting her through law school (in Avenging Angel, the second movie in the series), she decides to go to New York and become a blinking freelance photographer instead. Now there's gratitude for you!<br><br>But being a snapper doesn't prevent Molly (now played by Mitzi Kapture) from crossing paths with dangerous criminals: after realising that the L.A. art dealer in one of her photos is actually her estranged mother, who she hasn't seen since she was abandoned by her at the age of twelve, Molly returns to California in search of answers, only to find out that her mum is involved in a cocaine smuggling racket and her sister, of whose existence she was previously completely unaware, is in danger of being sold into white slavery. When her mother is killed in a car bomb, Molly once again adopts her Angel persona, entering the world of adult films to try and rescue the only family she has left from a lifetime of forced sex with sweaty foreigners.<br><br>Considering all of the trashy possibilities open to an exploitation film-maker by such sleazy subjects as prostitution, white slavery, drug dealing and the porn industry, Angel III is a very disappointing film. Sure, there's plenty of T&amp;A on display (the first pair of bare knockers appears on screen within seconds, and the nudity continues throughout), but the pacing is dull, the direction uninspired, the story pedestrian and the less said about the acting the better. Plus, it's kinda ironic that of the three actresses to play Molly, the one with the name that sounds most like a genuine porn-star or hooker is actually the least sexy (yes, Mitzi Kapture is pretty, but she lacks either the jail-bait charm of Donna '25 going on 15' Wilkes, or the sheer va-va-voom of Betsy Russell).","user":"BA_Harrison","rank":[6,7]},{"title":"Angel in L.A.","rating":24,"date":"24 June 2005","review":"*SPOILER ALERT* *SPOILER ALERT* <br><br>I bought this video for three bucks. There were two hookers on the cover, one of them had a gun, and the tag line was \"This beauty will blow you away.\" Yeah. That's all I needed to know. As an extra bonus, \"Angel III\" has one of the first appearances of Julie Smith. She plays the star of the porn movie that Angel infiltrates on her quest through the L.A. underworld. There was one glaring difference between the Julie Smith we all know today and the Julie Smith of yesteryear: Her breasts had shrunk dramatically. I almost didn't recognize her. The twins have grown up nice and healthy since this movie.<br><br>Anyway, even though I could talk about Julie Smith's breasts all day long, \"Angel III\" is not about Smith or her breasts, it's about Angel. Angel decides to move back to L.A. so she can take out the trash. Her long lost mom gets mixed up with some pimps and pushers. Angel's sister is also lost in the sordid, vice-ridden world of Hollywood/L.A. Angel needs to go undercover as a porn star/hooker to uncover the truth about Maud Adams and her white slavery ring.<br><br>I enjoyed this flick. It was as sordid and sleazy as it could afford to be. Maud Adams was a sparkling jewel of fine acting compared to some of the other players. There were plenty of gratuitous naked breast shots as well. The only thing a little off about this one was Angel. Angel does not get naked. That seems odd as she is the star of this sleaze fest and she is playing either a hooker or a porn star throughout most of the movie. She also doesn't really blow anybody away. She wasn't the avenging Angel I thought she would be. But even though the Angel action was a little light, I still liked this one. The sleazy exploitation vibe coming off \"Angel III\" was strong. It's worth a look.","user":"Dr. Gore","rank":[5,7]},{"title":"A somehow fading image","rating":7,"date":"19 January 2009","review":"I watched Angel 1 and 2 last night and 3 tonight, so I try to contrast them. First of all, 3 brought a very different style again - much less comedy, and a different kind of drama - not much left to show of LA street life, and the quirky persons out there - just one gay (and less elaborated) sidekick, Sparky.<br><br>And hey, wasn't Molly's mother called Margaret in 1? At least in the German dub (my cheap 3-pack doesn't have the original soundtrack, sorry). Now, meet Gloria (briefly). And how law school honor student Molly wound up as freelance photographer, wasn't explained either.<br><br>The strongest continuity to 2 came from the nice 1950s truck, remodeled from pet cemetery hearse to ice cream vendor's. And Molly (Mitzi Kapture, actress #3 in 3 movies, but still somewhat credible, glory be to the hair stylist) having no bullet under the trigger in a most tense situation...<br><br>And of course, the Message about the dangers of teen abuse (this time reaching out to slavery in Middle East or Calcutta) which was strongest in 1, of course, and appeared as sideline in 2.<br><br>I'm not sure what to think of this movie. It's not exactly bad (and has good moments, just fewer - take the naked pimp, or the hooked henchman), but somehow I still felt a little disappointed. After 1 and 2, acquiring a feeling for Molly Steward's exquisite adventures, I expected more from 3. Sleaze fans still get their occasional servings of bare breasts (ok with me), but I expected more \"real\" life scenes, like 1 and 2 delivered.","user":"suchenwi","rank":[2,2]}]