[{"title":"A magnificent filmic version of the Offenbach opera","rating":10,"date":"8 February 1999","review":"A magnificent spectacle. A truly filmic version of a classic opera. Often mentioned as a favourite movie and constant inspiration for young Martin Scorsese.<br><br>With the audacity that Powell &amp; Pressburger were famous for we are presented with a wonderful performance of a truly \"composed\" film. All the soundtrack was recorded by Sir Thomas Beecham and the Royal Philharmonic Orchestra and then the filming was all done on the open stage (it didn't need a sound stage) at Shepperton.<br><br>With choreography by Sir Frederick Ashton and performances by ballet luminaries such as Moira Shearer, Ludmilla Tchérina, Robert Helpmann, Léonide Massine and Sir Frederick Ashton himself. Assisted by opera stars such as Robert Rounseville and Anne Ayars and the Sadler's Wells Chorus. All this backed by the designs of Hein Heckroth and the experienced team of technicians that worked regularly under the banner of The Archers leads to a treat to behold.<br><br>The plot - from a 1951 (year of release) programme.<br><br>The Prologue : The Opera House in Nurnberg (Nüemburg). Hoffmann sits in the auditorium watching a performance of the Dragonfly ballet. He is in love with Stella, the prima ballerina, who seems the embodiment of all his past loves. In the interval Hoffmann goes to Luther's Tavern. Here young students greet him. He sings them the ballad of Kleinzack. But the sight of Stella has reopened old wounds. \"Would YOU hear the three tales of my folly of love?\" lie asks. The students gather round the punch bowl, with Hoffmann's companion, Nicklaus, who has accompanied him throughout his adventures, and his enemy Lindorf.<br><br>The Tale Of Olympia : As an inexperienced student in Paris, Hoffmann was tricked by two puppet-makers, Spalanzani and Coppelius, into falling in love with their latest creation, the doll Olympia. Spalanzani passes Olympia off as his daughter and hopes by this means to get some money from Hoffmann. At a ball given for her, Olympia sings the \"Doll Song\" and dances a ballet. Hoffmann is entranced. Only when Spalanzani and Coppelius fall out, and Coppelius destroys the doll in revenge does Hoffmann realise how he was fooled.<br><br>The Tale Of Giulietta : As a young man of the world, he was enslaved by a beautiful Venetian courtesan, Giulietta. Acting under the influence of the magician Dapertutto, Giulietta captures his reflection and so gains possession of his soul. Hoffmann kills her former lover Schlemil in a duel, to get the key to her room. He hurries back to her, but finds she has left with Dapertutto. Mad with rage, he flings the key against her mirror. It cracks, and his reflection reappears. He has regained his soul.<br><br>The Tale Of Antonia : As a mature artist and poet, Hoffmann falls in love with Antonia. Her mother, a singer, has already died of consumption (Tuberculosis). Crespel, her father, through grief at his wife's death, is now the half-mad wreck of a formerly great conductor. Crespel keeps his daughter in seclusion on an island in the Greek Archipelago and forbids her to aggravate her own weakness by singing. He also forbids his deaf servant Franz to admit either Hoffmann or the quack Dr. Miracle who killed his wife. Franz misunderstands, and in turn shows them in. Hoffmann realises Antonia is ill, and she promises him not to sing again. Dr. Miracle persuades her it is her mother's wish she should disobey. She does so, and dies in his arms.<br><br>The Epilogue : On the stage of the Opera House, it is the finale of the Stella Ballet. In the tavern Hoffmann's audience is spellbound. Hoffmann's tales are told and with the telling Hoffmann finds his true destiny as a poet. Stella appears at the door of the tavern and looks down at him. But Lindorf, who has also understood the meaning of the Tales goes to meet her and together they pass out into the town.","user":"Steve Crook","rank":[39,41]},{"title":"Bravo, Tales of Hoffmann!","rating":10,"date":"28 December 2004","review":"What a splendid film is this combination of opera and ballet for those partial to this type of fare. The performance of Robert Helpmann in four roles is exceptional and dancer Leonid Massine makes a chilling villain as Schlemil in the utterly fantastic \"Tale of Giuletta\". Ludmilla Tcherina as Giuletta is an alluring sex-goddess and enslaver of men. I am totally absorbed whenever I watch this episode. Having said all this, I must also say that the \"Tale of Antonia\" is a severe letdown after the two preceding episodes. It is not just the film version that is bad -- it was actually a letdown the first time I saw the opera live at the old Metropolitan Opera 45 years ago. Actually, there have been suggestions that the \"Antonia\" episode be moved from last to first episode sequentially in the opera, however I doubt if this would make a significant improvement. If I am correct, the \"Antonia\" episode was completed by another composer, Offenbach having died before completing Tales of Hoffmann. Ahhh...that hauntingly beautiful \"Barcarolle\"....nothing can compare to it!! And the film version is just icing on the cake.","user":"guidon7","rank":[28,29]},{"title":"A grand artistic vision","rating":7,"date":"18 February 2006","review":"TALES OF Hoffman  Powell &amp; Pressburger This colorful film adaptation of an by Offenbach is a musical in the truest sense, meaning every bit of narrative and dialog is put forth by means of song. I am not in general the biggest fan of such endeavors, but it works quite well for this film, although some of the love paeans may be outstaying their welcome.<br><br>In the story a poet  Hoffman  tells in episodic fashion about the many times that he has loved and lost. There have been several films made with such a theme but Hoffman stands well apart because of the Goth-fantastic nature of the narratives. Hoffman, in turn, falls in love with Olympia - a puppet, Guiletta - the temptress of a soul-stealing demon, and Antonia - a singer doomed by fatal consumptive illness.<br><br>This narrative is complemented by the brilliantly supportive artistic design of the film. The makers construct a deliberate stage-like ambiance, with the use of representative backdrops, suitably exaggerated props and striking motifs to convey the settings and moods of the various episodes. In this aspect it shares strong kinship with Masaki Kobayashi's period ghost story anthology Kwaidan. You also have the concept of the same actor returning to play different parts in the various episodes of Hoffman's life, the most notable of which is Robert Helpmann who portrays the sinister element in all the episodes (and with his vampiric menacing look, does a terrific job of it, although his motive for evil in the Antonia episode goes unexplained).<br><br>The fantastic elements of the plot, color-drenched distinctive look, intricate balletic choreography and excellent fit of all the actors in their roles make Tales of Hoffman a very interesting watching experience on the whole.<br><br>One of my caveats with the film is that Hoffman's companion Nicklaus is never properly explained. Who is this woman in man's garb and why is she doing what she does?","user":"ravenus","rank":[17,17]}]