[{"title":"Perhaps it was made in the wrong decade...","rating":7,"date":"15 March 2007","review":"Blake Edwards once again turned to his bread-and-butter genre, and kept things nice and simple. However, for whatever reason, this downplayed treat was and is often panned by critics left and right. I submit to you that this is because most of us just don't get it.<br><br>I'll use the plot portent to tell you what this movie isn't, first of all. Despite appearances, it's not about up-and-coming, wannabe yuppie Walter Davis (Bruce Willis), not really about his blind date of the title with the beautiful and potentially deadly Nadia Gates (Kim Basinger), not about psychotic defense lawyer and jealous ex David Bedford's (John Laroquette) attempts to break the two up and steal back his first love, and not about the punches and rolls with which these people, along with their families and acquaintances, must deal.<br><br>It's just my theory, but I think most of us didn't get this movie because it was a humorous commentary on the time during which it was made. This movie is all about the '80s; the yuppie culture, the self-absorption, the repeated attempts of folks to find solace in getting and having things, and our near-tragic couple's struggle to be who they are, even if it doesn't fit with '80s yuppie culture, and embrace what's important. Consider it--during her drunken binge, Nadia assaults everything that could make Walter a yuppie as if it were a well-organized plan. Walter, in turn, tries his hand at the same thing, mostly upon David and car salesman brother Ted (late, great Phil Hartman). Sure the details give a chuckle or two, but there's an almost cerebral humor going on under the surface of the film, right at the core, which pokes fun at a cornerstone of life in the '80s.<br><br>This led to the movie's downfall in favor, since the very people at which the movie so heavily pokes fun were probably among the first ones to see it premiere in the '80s. Even if they got it, they probably didn't appreciate the joke. Essemtially, Edwards had spoofed the '80s DURING the '80s. A gutsy move, and witting or unwitting, this gave it a kind of staying power. It really is about more than you think.<br><br>So, if you're one of the lonely soldiers who likes the movie, try to view it in this context and see what you think of it. If you hated it, please try to observe this point of view, and again, see what you think. Blind Date is one of the most different comedies to emerge from this decade. No matter where you sit on the quality issue, perhaps it deserves a second look.","user":"Cel_Stacker","rank":[48,52]},{"title":"I never understood why this film was criticised so much","rating":8,"date":"26 November 2005","review":"I saw this film when it first came out and I laughed out loud at quite a few scenes and thoroughly enjoyed it. Both Bruce Willis and Kim Basinger are excellent and there was obvious comic chemistry between them. There also plenty of great lines and performances from the supporting cast too, especially from John Larroquette (Basinger's psychotically obsessed erstwhile boyfriend). It was a complete mystery to me why it was so panned on release, but reading some of the comments here I am glad to see that this minor gem is finally getting the recognition it deserves. All I'll add is: dobermans, golf balls, moonwalking and an abject lesson in why you should never get your new girlfriend drunk.","user":"gtbarker","rank":[26,35]},{"title":"One of those movies that makes you laugh","rating":6,"date":"8 December 2004","review":"I love this film. This was Bruce Willis' first box office film in a leading role. It's a nice little film that has its funny moments. Blind Date is not Citizen Kane, but it's sure a good film to watch on a day off. When Kim Basinger gets drunk, that's where the funny moments start. She goes from being a sweet southern belle to the date from hell. She embarrasses him at a business dinner, goes ga-ga at a club, gets his car lifted, and drives him to the point of insanity. Meanwhile, ex-boyfriend Larroquette is stalking them around the town driving them nuts. His character isn't given much depth, but he works with it. All in all, it's a funny, innocent film that will make you laugh.","user":"MichaelMovieLoft","rank":[21,29]}]