[{"title":"Well done","rating":14,"date":"14 July 2005","review":"During World War II, young Jerry Lee is with his cousin sneaking into a dance hall in the black section of town. His cousin says that's the devil's music, and Jerry Lee agrees--but to him that's a good thing.<br><br>In the 1950's, Jerry Lee is performing that 'devil's music', and quite good at it. We see him go to Sam Phillips, the man who made Elvis a star. Will he be the next Elvis? He might very well be that talented. Phillips is very impressed, and his record becomes a hit.<br><br>Once Elvis goes into the army, Lewis has his chance to become as big as the King, if not bigger. What may have been his downfall, if this movie is accurate, is his marriage to his second cousin Myra. The English do not approve, and Americans aren't much more receptive.<br><br>Dennis Quaid does a great job, although it is apparently Lewis himself doing the singing. But Quaid pounds that piano and behaves wildly and shows a lot of passion and energy. I did enjoy the music, even though I usually like my music softer. It's amazing Lewis' music was banned by radio stations, because his songs get played on the station where I listen to Frank Sinatra, Perry Como and Nat King Cole. <br><br>Winona Ryder is a delight, especially when Myra goes shopping after the wedding. Steve Allen looks surprisingly young playing himself, and he seems to be having a good time. <br><br>Elvis appears briefly several times, played by Michael St. Gerard, who portrayed the King in a 1990 TV bio. Elvis doesn't say much, but he does look the part. In one scene he and a girl are in bed together watching Lewis perform on TV, and the girl seems to want to do 'a whole lotta shaking'. Footage of others watching Lewis is shown (though they are probably watching something else). Included are a shocked Ward and June Cleaver.<br><br>'Patricia' by Perez Prado seems appropriate for the scene where Jerry Lee and Myra wonder whether to tell Myra's parents. The organ has the whimsical, playful quality that is such a big part of Myra's character, the trumpet section reflects Lewis' wild streak, and the trombones sound like Myra's father probably will after he gets the news.<br><br>While there were negatives in Lewis' life, this movie doesn't really make these look as bad as it could have. I found the movie entertaining as a whole.","user":"vchimpanzee","rank":[18,18]},{"title":"Great music, good movie","rating":22,"date":"22 June 2003","review":"I am usually too lazy to put in my review comments. But when I read some of the negative comments about this movie, I ad to make a stand. I came across this movie accidentally and I'm glad I did. I think it is one of the unsung great films on music and musicians. Based on the true life of Jerry Lee Lewis, the somewhat eccentric rock and roll genius from the 50s this movie has got soul. Most of the movies about artists end up portraying them as somewhat crazy, egomaniacs, always on the edge of a break down. But this movie has a very warm and light hearted take on Jerry's life. Throughout his ups and down his character comes out as a likable one whom you want to fall in love with. There's not a moment in the film where you would feel sad or annoyed by Jerry. And for this the kudos go to both Dennis Quaid and the director. For the reviewers who have labeled Dennis's portrayal as over the top, you guys don't have a clue who and what Jerry was. Dennis has nailed the spirited and buoyant soul that Jerry Lee Lewis was. I think the people who didn't like this film wanted to see a more serious and toned down film. But this is a film about rock and roll, and there's no better way to make it then it has been donw here. I give it a 9 out of 10. Go watch this immensely entertaining film!","user":"pbhowmick","rank":[45,53]},{"title":"Dennis channels Jerry Lee","rating":27,"date":"27 May 2003","review":"From some of the reviews here, I get the feeling many viewers of this film have never seen a Jerry Lee Lewis performance, much less have ever seen him offstage.  Well, I can tell you, Dennis Quaid has the man down to pitch perfect.  But it isn't just a great impersonation.  Beneath every nuance and gesture is the frenzied heart and mind that probably would never have been able to function outside of the venue of rock and roll.  Jerry Lee was the white man's Little Richard.  He had rock and roll in his blood and he was BORN outrageous!  He also made Elvis Presley look like a wind-up doll. `Great Balls of Fire' captures the essence of Jerry Lee's music, especially in the musical' scene with the kids outside the high school.  Rock and Roll breaks the rules, so why not have a film that breaks the rules by throwing in a musical number that obviously has no backup band?  Those who have seen the high school rock and roll movies like `High School Confidential' and `Rock Rock Rock' will appreciate this spirited ode to them.  Winona Ryder does a pretty good job for Winona Ryder, and it's fun to see John Doe (of the L.A. punk band `X') playing the somewhat stymied father of little Myra Gale.  This film is not a biopic, it's a rock and roll movie, which is what the King of rock and roll (as far as I'm concerned) deserves.  Is he a bad, bad man for marrying his thirteen-year-old cousin?  Is it anyone's business? The marriage lasted longer then most marriages these days do.  Even if it hadn't, I think people can be capable of respecting the artist and his music even if that artist's lifestyle offends them.  That's this film's point of view, so no doubt, there will be viewers who will take offense.  But to set the record straight, the whole world did not turn their back on Jerry Lee when the news got out about his marriage to his cousin.  There were thousands of fans who actually embraced him more BECAUSE their parents and authorities hated him.  And then there were just the fans (like myself) who will always love his music and audacious energy at the piano, and have decided to leave judgment of his personal life to whatever entity is in charge of such things.","user":"Zen Bones","rank":[41,48]}]