[{"title":"And justice for no one.","rating":7,"date":"30 April 2006","review":"At first sight,Duvivier seems to follow in André Cayatte's footsteps.At the time,the latter director had launched a crusade against all the miscarriages of justice and had begun to champion any good cause going.But further acquaintance shows this:\"l'affaire Maurizius\" is a Duvivier movie .In Cayatte's movies,the problems are finally generally solved: in \"Nous Sommes Tous Des Assassins\" ,René was granted a pardon,in \"Les Risques du Métier\" ,the schoolteacher was rehabilitated.Even when the story turns black (\"Le Glaive et la Balance\" or \"Justice est Faite\") ,Cayatte \" manages to limit the damage\" so to speak.One should note that the young lead ,Jacques Chabassol,was part of Cayatte's \"Avant le Deluge\" (1953).<br><br>In \"l'Affaire Maurizius\",no one was saved:the judge has lost his son who is ashamed of his father ,the son has lost all his illusions,the gorgeous reluctant femme fatale has turned into a prematurely aged lady,her former lover is now living on the fringes of society,and the chastised innocent ......his fate is sealed as soon as the film begins...<br><br>....because,when the movie begins,\"L'Affaire Maurizius\" is an old one everybody wants to forget.That an innocent man may have spent seventeen years in jail does not seem to move the bourgeois judge (Charles Vanel),jealous of his privileges.Little by little,through flashbacks,scenes of the past resurfaces again .The judge 's son believes in justice and wants to save the prisoner(Daniel Gélin)who was \"burried alive\" .But Waremme (Anton Walbrook) tries to explain to him that the society scoffs at the law:while he is talking to the desperate young man,two dancers appear as shadow graphs on the window.This is the key to the film and to Duvivier's black world.<br><br>\"L'Affaire Maurizius\" is wrapped in mystery: all the flashbacks are filmed in places which seem secret and where a danger seems impending.The film sets are bare when they depict the past,emphasizing the characters who,unfortunately,with the exception of Vanel,sometimes display a tendency to overact.This misty atmosphere will emerge again in later works such as \"Marianne de Ma Jeunesse\" or \"La Chambre Ardente\".<br><br>Some objections to \"l'Affaire Maurizius\" remain: overacting (Anton Walbrook verges on ridicule),and Madeleine Robinson's underwritten part:she barely appears ten minutes whereas she plays a pivotal role in the screenplay.Her relationship with her younger sister (Eleonora Rossi-Drago) is only skimmed over whereas it is essential to the plot.<br><br>However,like almost all the movies Duvivier made ,it is a must: his pessimism leaves the viewer no hope : the last scene could be subtitled \"out of the blue ... and into the black ,they give you this but you pay for that,and once you're gone you can never come back..\" (Neil Young)","user":"dbdumonteil","rank":[18,21]},{"title":"Powerful and brilliant Oedipal drama about a miscarriage of justice","rating":10,"date":"2 August 2016","review":"This French film, L'AFFAIRE MAURIZIUS, is listed on IMDb as ON TRIAL, despite the fact that I believe that only the new French Blu-Ray with the French title has ever been distributed in the English-speaking world. Amazon lists it as ON TRIAL, but it is the same French disc bearing the French title, which in its newly restored state has had English subtitles added. Julien Duvivier wrote the screenplay and directed this film. He is one of the finest French directors, and this is one of his finest films. It has been restored as part of a series of French classics being revived on Blu-Ray, about half of which have had English subtitles added. The film is based upon a novel by the Austrian Jewish author Jacob Wassermann (1873-1934) entitled DER FALL MAURIZIUS (1928), published in English in 1930 as THE MAURIZIUS CASE, and also published in France in 1930, in two volumes, as L'AFFAIRE MAURIZIUS. It is the first novel of a trilogy, the second novel being ETZEL ANDERGAST (1931), published in England as ETZEL ANDERGAST (1932) and in America as DR. KERKHOVEN (also 1932). The third volume was Joseph KERKHOVENS DRITTE EXISTENZ (1934), published in English as KERKHOVEN'S THIRD EXISTENCE (1934). By that time, Wassermann was dead, having died of heart failure on January 1. The trilogy was his last literary work. He is best known internationally for having written CASPAR HAUSER (1908), which was apparently the basis for the film THE ENIGMA OF KASPAR HAUSER by Werner Herzog in 1974 (with script by Herzog), though without Wassermann being credited. DER FALL MAURIZIUS was also made into mini-series twice. The first was made in 1961 in Italy. (Few details are available concerning this. Virna Lisi appeared in it.) The second was in five episodes on German television in 1981. Wassermann's books were all banned and burnt by the Nazis. I must be one of the few people who has read all three novels. I was therefore very eager to see what Duvivier could do with THE MAURIZIUS CASE, when his film was recently released in restored condition. The result is perfectly spectacular. The original novel was extremely lengthy, and rather tedious, over-loaded with case evidence and heavily over-written, so that it was something of a task to read it. But Duvivier saw the cinematic possibilities and with a particular genius managed to extract the essence and make a film far more powerful than the book itself. Duvivier was in top form, and every line of dialogue, every framed shot, every bit of atmosphere, every bit of editing, contributed to a work so refined that it could constitute a marvellous specimen for a master-class in film-making. The film is set in Bern, Switzerland, and shot there on location, to great effect. The original novel was set in Vienna. The film's hero is Etzel Andergast, the 16 year-old son of Procureur Andergast (in the novel, Freiherr, i.e., Baron, Andergast, Attorney General). Eighteen years earlier, the father had been responsible for sending a man named Leonard Maurizius to prison for murdering his wife. Young Etzel meets a strange old man who presents a petition to this father, and when his father is out, he reads it. It is a petition on behalf of his son, the imprisoned Maurizius. Etzel can see that there are serious defects in the case. A witness claimed to see Maurizius shoot his wife as he approached the door of his house and she came out towards him, but in fact she had been shot in the back. All such inconvenient evidence had been swept aside by Etzel's father in his desire to win a sensational case and make his way in his career. Etzel cannot tolerate this, and begins to investigate personally. This leads to immense complications and conflicts, and the true story slowly emerges. All the lies are exposed, the passions revealed, the secret history of a murder made clear. It is an extremely powerful story. The acting is magnificent, and the script and direction are utterly astounding. This is a real classic.","user":"robert-temple-1","rank":[7,8]},{"title":"An Affair To Forget","rating":8,"date":"8 June 2006","review":"In case there are any Literalists out there let me begin by saying that my summary merely refers to the fact that nearly everyone concerned wants to forget the Maurizius Affair but for various reasons are unable to do so, what the summary is NOT saying is that this is a forgettable film. Anyone who's read my comments on other Duvivier movies will know that I bow to no one (not even the extremely generous French guy who tapes French movies unlikely to be shown in the UK from French television and sends them to me) in my admiration for Duvivier and love of his work. Okay, it's bleak - at least this one is - but so is life, Charlie, and where else could you see quality actors like Charles Vanel, Madeleine Robinson - albeit underused - and Anton 'Tillie' Walbrook going through their paces. Ultimately this is an affair with no winners only losers and what is lost among other things like respect are illusions, perhaps the most precious gift of all. The shadowy, misty sets are reminiscent of the 'poetic-realism' school pioneered by the Prevert-Carne team and, of course, none the worse for that. On balance I wouldn't rank this with Duvivier's finest work but it's definitely the best of his second-string and should certainly be seen.","user":"writers_reign","rank":[7,8]}]