[{"title":"Wonderfully stupid fun","rating":6,"date":"11 January 2006","review":"Dr. Goldfoot has: <br><br>1. Vincent Price having a field day hamming it up like John Barrymore on scotch and speed! <br><br>2. Harvey Lembeck as Erich Von Zipper in a hilarious 10-second cameo! <br><br>3. The titanic teaming of Dobie Gillis and Frankie Avalon! <br><br>4. One of the finest \"second bananas,\" the late Jack Mullaney as Price's Mad Scientist henchman, Igor! <br><br>5. Tons of young American International babes! <br><br>6. The Supremes singing the title song! <br><br>7. It's directed by Elvis' #1 Man, Norman Taurog! <br><br>8. It's written by the Three Stooges #1 Man, Ellwood Ullman! <br><br>WOW! <br><br>What have you got: Only the greatest film since \"Gone With The Wind,\" \"Citizen Kane\" and \"The Bicycle Thief\"! Okay, perhaps not - but it is a ton of zany low budget screwball fun,'60s American International-style. <br><br>I really liked it.","user":"estabansmythe","rank":[27,29]},{"title":"Stupid but Fun","rating":9,"date":"9 January 2000","review":"What can one say about this movie?  It's ridiculous but iresistable. Vincent is always fun, the film has great color and location photography. A perfect time capsule of how much fun the '60s could be.  The Les Baxter score and songs are great and the opening number, with the Supremes, no less, is a rockin' Baxter classic!","user":"carolsco","rank":[17,18]},{"title":"A too-little-known (and too-little-appreciated) gem","rating":10,"date":"11 June 2005","review":"Now this is what I call a too-little-known gem. Despite being a perpetual \"student\" of film and being a fan of Vincent Price, 1960s films, and the various genres this film can be seen as, I somehow overlooked this title for years. I can't remember anyone else I've read or talked to who mentioned this title. Maybe that's because a film like this is an acquired taste, one that apparently many people haven't acquired. I must have come across it sometime, but I didn't really notice it until I stumbled across it on Netflix recently. <br><br>Some of the descriptive terms that regularly pop up in others' reviews of this film include \"silly\", \"ridiculous\", \"goofy\", \"insane\", and \"absurd\". I wouldn't disagree with any of those terms. What I would disagree with is that they denote something undesirable in films, or that they denote something that deserves less respect than other descriptors. Other admirable terms that I would add include \"surreal\", \"satirical\", \"madcap\", occasionally \"atmospheric\" and \"funny\". Dr. Goldfoot and the Bikini Machine certainly isn't intended to be realistic, and despite popular conceptions, it's not intended to just be a laugh-out-loud comedy, either.<br><br>One could think of Dr. Goldfoot and the Bikini Machine as what we now call \"high concept\"--\"Vincent Price, in a transformative mode between his Corman-directed Poe characters and Dr. Phibes, meets Frankie Avalon in a beach film attitude meets James Bond meets 1960s 'madcap'/'screwball' comedy\".<br><br>Price is Dr. Goldfoot, a satire of a Bond mad scientist, with a name that's obviously a pun on Goldfinger. He's planning on usurping the wealth of some of the world's richest men by creating a veritable army of hot robotic women in gold bikinis, appropriately enough, since they're mechanical but artificially intelligent/sentient gold-diggers. Todd Armstrong (Dwayne Hickman) is one of the victims of the nefarious plan, and Craig Gamble (Frankie Avalon), an almost secret agent, becomes involved because the robot aiming for Armstrong initially mistakes Gamble for him--they have a similar look. Gamble falls in love with her and searches for her once she disappears. This gradually leads to Armstrong and the eventual discovery of Dr. Goldfoot's scheme.<br><br>In the 1960s, filmmakers were on the upswing of increasing experimentation. The Hays Production Code, which filmmakers had started seriously challenging in the 1950s, was decreasingly influential or \"enforceable\", and would be abandoned before the end of the decade. In addition to broaching previously forbidden subject matter and images, filmmakers were also increasingly experimenting with the structure of films. The roots of this were the same as the roots fueling parallel revolutions in pop music, for example, and more importantly, in society, leading to the lifestyle experimentation of the hippies. For films, plots were often pushed and prodded, including some attempts to effectively abandon them. The result was a lot of sprawling and too-often-messy \"madcap\" comedies. In a number of famous cases, such as Casino Royale (1967), or What's New Pussycat (1965), the experimentation ended up hurting the films as much as helping. Dr. Goldfoot and the Bikini Machine has the same basic attitude and sense of experimentation, but director Norman Taurog and writers Robert Kaufman, James H. Nicholson and Elwood Ullman admirably keep a relatively tight lid on their plot. It gives us the best aspects of the era's \"freewheeling\" sense of filmic adventure while not forgetting about the importance of a coherent story.<br><br>As a Price fan, some of my favorite moments arrived with Price satirizing his previous screen personae. Dr. Goldfoot lives in an elaborate laboratory/dungeon beneath a funeral parlor that serves as a front (this is prescient in an oblique way of Don Coscarelli's 1979 film, Phantasm), and many scenes of Dr. Goldfoot in his home environment are surprisingly atmospheric, including the chamber housing Goldfoot's razor sharp pendulum, which almost trumps the one in the Roger Corman Pit and the Pendulum (1961), which it references, or questionably \"spoofs\". Price is good with this kind of comedy if you like complex ambiguity, because he's so dry and his \"comic\" characters are so closely played to his serious characters. It's a very subtle difference.<br><br>Frankie Avalon is far less subtle, but he's no worse for that, and he's primarily done lighthearted roles anyway. Avalon's scenes often veer towards slapstick. Some of the best material in that vein arrived in his special agent office, with his boss, Donald J. Penny (Fred Clark).<br><br>Even though this is a 1960s film with one foot in the comedy genre, as a Vincent Price film you wouldn't expect the climax to be an extended, madcap chase scene. It is, and it's one of the best sequences of the film. Our heroes and villains chase each other around the streets of San Francisco (with some attendant very attractive cinematography in a mini-San Francisco travelogue) in a number of increasingly absurd vehicles and scenarios.<br><br>Insofar as Dr. Goldfoot and the Bikini Machine is a James Bond spoof--and that's a prominent mode, although certainly not the only dominant one--it was obviously one of the influences on Austin Powers: International Man of Mystery (1997). But Dr. Goldfoot and the Bikini Machine is also somewhat serious about its other genres, and it satirizes gold-digging, marriages and high-profile divorces in a time where they were becoming much more commonplace in the public consciousness. Of course, it's also a great excuse to watch a dozen scantily clad, beautiful women, who even go-go dance a bit for us.","user":"BrandtSponseller","rank":[33,39]}]