[{"title":"For Viktor Tzoi fans","rating":10,"date":"10 July 2000","review":"This movie's main attraction is, of course, the protagonist played by Viktor Tzoi - famous Russian rock mucisian who died tragically in a car accident merely two years after making this movie. The film's plot is quite primitive and unoriginal.  Moro (Tzoi) comes to Alma-Ata and tries to save his junky girlfriend from drug addiction, but runs into trouble with the local drug mafia. The lowest point of the film are Tzoi's pathetic attempts to imitate Bruce Lee.  Plus, his coolness comes off as a bit forced and pompous. Despite all that, director Rashid Nugmanov was able to create some pretty cool moments with addition of post-modern twists and some surreal scenes. Piotr Mamonov's performance as an evil doctor also helps.<br><br>The film's soundtrack, including original music by Tzoi's band KINO, is also very cool, and really contributes to the overall feeling of the movie.<br><br>This movie was originally released in Russia in 1989, and as a teenager I still remember that all the people, especially the young, impressionable kids, agreed that the movie's final scene was quite a highlight.  I don't want to give it away, although it's not as mindblowing as you might think (and it's definitely not up to the standard of contemporary Western movies), but I still think that it's pretty effective, especially with KINO's hit song playing in the background. To sum it up, I will say that if you are not Russian, and not into rock music, there isn't much you will get out of this movie. Personally, I still like it quite a bit, but in a nostalgic sort of way.","user":"grob248","rank":[33,38]},{"title":"Full of atmosphere, great direction and amazing music","rating":10,"date":"25 October 2011","review":"If you can understand Russian then you simply have to watch this film, I'm not aware of an English translation available but if you find one and have an interest in life at the end of the USSR then watch Igla. This film is a vehicle for Viktor Tsoi, Soviet rock superstar and one of the most talented musicians there has ever been. It's a film made on a budget but this adds to the atmosphere of the thing,The film has some great direction and although cheap has been made with thought and care. However the best thing about this film is it's soundtrack, truly brilliant, Tsoi really is a music icon and this film, made not long before his death is a fitting tribute to him and his legacy. I recommend this film wholeheartedly!","user":"markgbullen","rank":[8,8]},{"title":"Viktor Tsoy movie","rating":8,"date":"17 July 2001","review":"The main attraction in the movie is obviosly it's main actor - Viktor Tsoy, a late Russian rock star with an asian facial qualities. Eleven years after his death, his music still holds a huge following and unfortunately exploited. In this movie, he plays a Bruce Lee-esque character who defeats the villains and suffers for it in the end. I love this movie because I'm a huge fan of Tsoy's band \"KINO\" otherwise I wouldn't pay much attention to it. Great soundtrack and interesting photography. Unfortunately Tsoy was not an actor and he was pretty much playing himself. Pyotr Mamonov, ex-leader of Russian experimental band \"Zvuki Mu\" probably was the best actor but received a minor role.","user":"garde_noisemaker","rank":[13,16]}]