[{"title":"Titillating nipple biting with a twist.","rating":12,"date":"12 December 2002","review":"This movie is bad.  But it's the laughable, entertaining kind of bad you find in movies like Grease II.  You see great and crummy actors and actresses cast together that you would have never imagined, EVER. Gene Simmons of KISS fame plays the villainess gal with 'something extra'.   You camp it up, Gene! You gotta love Gene Simmons, who has been playing in drag longer than Dame Edna.  John Stamos plays himself basicly, no change in hair or motivation.  He's handsome enough I suppose, but there is no acting range for this man.  George Lazenby (one time James Bond) even makes an appearance!!  Vanity made her career on those flawless cheekbones/exotic beauty, matched with dazzling clothes and sexy prancing, works her formula to the hilt.  But she's convincing, because she seems like the type who really could beat the stuffing out of someone.  She's a tough gal, secret agent with a heart of gold.  The flirtation scene between John Stamos, Vanity and the garden hose will make heterosexual men lose sleep over her. (And make transvestites pine for Vanity's jungle bikini) The breast and nipple biting in this movie will truly surprise and titillate you!  See it to laugh, to mock, and to marvel at the feminine charms of Gene Simmons. Nothing beats a great pair of legs!","user":"anthonyfeather","rank":[20,20]},{"title":"On the eighth day, God created this movie...","rating":6,"date":"13 March 2014","review":"This has to be seen to be believed. John Stamos plays college gymnast Lance Stargrove whose father is a super spy that still finds time to send him care packages. When Dad is killed by hermaphrodite Velvet Von Ragnar (Gene Simmons), Stargrove teams with sexy spy Danja Deering (Vanity) to get revenge. Oh yeah, Simmons wants to poison the water supply with radioactive waste or something.<br><br>Stamos brings perfect hair to his role, which is the most important thing. There are lots of scenes of him doing gymnastics. Perhaps the director was a fan of '80s classic Gymkata. He also rides a dirt bike because in the '80s dirt bikes were cool. One of the many highlights of the movie is when Stamos is being beaten up by two of Simmons' thugs. He is crying like a little baby but then he sees a picture of his dad. Suddenly he's like Popeye on a spinach high and he kicks the crap out of the bad guys (\"The name's not scumbag, it's Stargrove! Lance Stargrove!\").<br><br>Vanity is a stone fox, as usual. She also has a nude scene, as usual. Her seduction of John Stamos I will mock publicly but privately I thought it was hot! Gene Simmons is gross to look at dressed in drag but a hoot hamming it up as the super villain. Seeing him flirt with Stamos is priceless. He also likes to use his middle finger for...well, I won't spoil it. There's an Asian inventor friend of Stamos' who, at one point in the film, wears an outfit that is practically every color known to man. George Lazenby plays the spy dad. I'm sure some casting director beamed from ear to ear over that ingenious casting. He dresses like a Ghost Buster and uses a bulletproof umbrella as a shield. In a scene that I'm certain was the actor breaking the fourth wall, Lazenby says to Simmons \"Oh come on, this is stupid.\" <br><br>The movie is filled with laughably cheesy music. The song that plays during Stamos' first scene keeps repeating his character's name \"Stargrove\" over and over. Simmons gets to sing during his club routine (\"Yeeeah!\"). There's also a rather cheesetastic tune that plays leading up to Stamos taking Vanity to Pound Town.<br><br>This is the kind of movie you just don't see anymore. These days when they try to do trash like this, it's always so self-aware and obvious that it takes the fun out of it. Truly \"so-bad-it's-good\" flicks don't try to be bad on purpose. If you ever wondered what Uncle Jesse did before Full House, all your questions will be answered here. This movie is so awesome it will change your life. If you watch this, it will make a man out of you. So female viewers beware.","user":"utgard14","rank":[16,16]},{"title":"Sweet Screaming Jesus, Save Us!","rating":7,"date":"24 July 2001","review":"***SLIGHT SPOILERS*** Wow. I've seen a lot of crap in my life, but this, this may truly be the worst of it all. I didn't know whether to laugh or cry, I wanted to hide under my chair, but I was paralyzed with fear and disbelief.<br><br>So, what happens? Well, let's see... John Stamos and his big poufy head of hair play Lance Stargrove, a high-school gymnast who wears either creepily tight jeans or scarily semi-transparent white Z. Cavaricci pants. His dad--played by George \"I was James Bond once. Once.\" Lazenby--was some spy who got whacked for some computer disc that can contaminate! the city's entire! water supply! forever! (I guess it has some kind of water-soluble virus on it.) Vanity plays his dad's former partner or something, in a lot of spandex and bronze makeup and the two of them have to get dad's killer and find the disc. <br><br>And who was his dad's killer? None other than Gene Simmons. In drag. Yes, you read that right. Gene Simmons stole one of Cher's old wigs and a few of her cheesier outfits to play a transsexual or transvestite or hermaphrodite or something--the plot is vague on this, as it is with many things. Actually, this entire film feels as though it was generated by Mad Lib. And Gene Simmons has an army of Road Warrior-rejects to do his bidding, all done up in the best \"punk\" attire the crack-addled, clinically insane and underpaid wardrobe lady could come up with, including that ubiquitous spike/shag synthetic \"punk\" wig that appeared (usually with wraparound sunglasses) in every \"punk\" crowd scene during the 80's. (And I say underpaid because she had to measure Stamos for those pants. And Simmons for the gold lame corset. Let us shy away from Vanity's buckskin fringed bikini altogether.) As if all this weren't disturbing enough, Robert \"Freddy Kreuger\" Englund appears as Simmons' lackey. And sometimes they touch each other. In unsettling ways.<br><br>Other disturbing events? How about the seemingly endless and definitely pointless scene in which Vanity strips, hoses herself down, takes her top off and hoses herself down more while Stamos chomps down on a variety of apples and bananas like a 70-year-old redneck with a half-pound of tobacky stuck in his craw. How about the scene where Simmons unfurls the tongue that once rocked Detroit City and sticks it down the throat of Stamos? The array of really bad fake facial hair inexplicably sported by various characters throughout? No wonder Vanity left the entertainment industry and turned Christian: After just watching this movie, I felt like I should spend the next three years praying for forgiveness.","user":"scorpio-x","rank":[15,16]}]