[{"title":"Interesting film to watch on Christmas.....","rating":8,"date":"25 December 2003","review":"I couldn't sleep last night, so I decided to dig up something to watch. Being in the holiday spirit, I wanted to watch something I haven't seen on Christmas.  I got sick from the 24 hour marathon of A CHRISTMAS STORY, so I found this little doozy of a picture in my vaults.  Bottom line - I liked it.  It blatantly rips-off THE LAST HOUSE ON THE LEFT, but this film took more time in getting to know the characters, and the German-Austrian-Italian locations are gorgeous.  Blackie (the guy from SUSPIRIA), and his pal hop a train bound to Italy for Christmas and violate two young girls with a psychopathic woman (creepily played by Macha Meril from Argento's PROFONDO ROSSO).  Afterwards the trio unknowingly run into the parents of one of the girls ala finale LAST HOUSE.  I had an extremely difficult time finding this movie, I don't think it was ever released in the United States; the copy I had was Dutch subtitled. If you can obtain this film, I recommend it.","user":"MikeK-7","rank":[19,22]},{"title":"Difficult to watch","rating":7,"date":"29 November 2005","review":"Two young girls travel by train at Christmas time, little knowing it will be a ride filled with horror.<br><br>Aldo Lado's Night Train Murders is at times very difficult to digest. As with most Italian movies of this period, the film takes a while to get started, with many fill up scenes that aren't of much interest but once it gets going the film makes a strong impact. The scene where the two girls get molested is a pretty tough viewing experience. Lado stretches the scene to almost unbearable length, displaying such inhuman and immoral tendencies you can't help but be disgusted. The final violent confrontation between the distraught father and the violators becomes not only justifiable but wholly satisfactory.<br><br>The film's intercutting between the normal goings on in the lives of the father and mother of one of the girls and what's happening to them on board the train makes a strong impact as well. Lado is purposely trying his best to make the events even more unbearable and sad and it works very well. The script is also philosophical to some extent, displaying grounded ideas about the human nature and it's incapability of letting go of some it's animal instincts and it's refusal to be controlled. An immoral and inhuman tendency cannot be distinguished easily and it's visual display here comes from the socialite who's actually the worst of the violators while the two punks are more visible just by how they look and act (not to mention the one who becomes involved but is also the most \"moral\" one as he contributes to the end justice).<br><br>While not an intellectual powerhouse the film does boast some very strong visuals and hugely effective scenes of the worst mankind has to offer. It makes an impact, but it's not very enjoyable to watch.","user":"ODDBear","rank":[15,17]},{"title":"Decent Italian take on \"Last House...\"...Good flick!","rating":7,"date":"23 October 2005","review":"This movie is well worth at least one look:yes,it is a variation (rip-off)of Last house,but it does have a few surprises and arguably,a stronger theme than Last House;there is a definite anti fascist ,left leaning sensibility to this film,underlying its more European take on the \"Us and them \"idea behind Last house.<br><br>Firstly,its really well made.If you've seen Lado's Gialli ,you'll know hes no hack,but he sets scenes really well.The scenes on the train have a insular,outward looking feel,as though you are really trapped inside looking at the world flowing by the windows.<br><br>Thematically,the two films are VERY similar;two ultra middle class girls (more worldly than their square parents know)get involved with two scumbags,Blackie and er...his junkie friend (cant remember his name).Sorry,THREE scumbags,as Macha Merill,middle class but a deviant,joins in as the two girls are trapped on an overnight train,en route to a family Christmas.Rape,torment,and retribution follow,as you damn well expect.<br><br>Anyway,its not as brutal as last house.The rape and revenge stuff is strong (enough for it to be banned here,anyway)but its quite a dark film nonetheless:its very influenced by Pasolini.Hence,the middle class are twisted deviants who exploit the working class to get their fun.Its Macha Merill who is the real villain here,not Blackie,enjoying the twisted stuff to fulfill her libertinism,as the ending (no spoilers)reveals.Shes good in this film,too.<br><br>The bad?the theme song is awful.Seriously.I played this on my laptop and at first I thought the speakers had melted,the singer warbles so much.Awful.I hope Morricone had nothing to do with it.The actings so-so,I liked Blackie anyway.Cute Irene Miracle is one of the girls.The parent figures are really dull...and the Dads a doctor!How blatant is that!<br><br>I dug the humour of the film too:in one scene in the train a young priest notices that the rummy old Cardinal is slyly winking at him;he turns to another priest who says \"Oh its just a nervous tic\".But in the best scene,Blackie discovers a carriage full of old ex-Nazis singing a fascist marching song(the film is set in Germany and Italy).He sneaks in and shouts \"Heil Hitler\" to which all the old chaps jump up and shout \"Heil\" in response.I liked it anyway.i think it reveals a lot about the films idea that perversion is always under the surface,in the most respectable of places.<br><br>This is one of the few nasties I never tracked down on copied VHS,so its great to see it so pristine and clear.It could easily get released now in the UK;but they would probably cut the scene where Merill gets raped and enjoys it,totally taboo for the BBFC,especially in a non art-house flick (total hypocrisy of course)as they did with House on the edge of the Park.The scene with the knife would get axed as well,if you see the film you'll understand.All readers in Countries where people can make up their own mind,check it out now!<br><br>N.B has now been released with an uncut 18 certificate by shameless in the UK. What a dunce I sound like now...","user":"beerismyfriend","rank":[22,27]}]