[{"title":"You wanna know what it's really like ?....","rating":10,"date":"10 September 2003","review":"FAN......TAS......TIC !<br><br>Well,not quite, but still very watchable. There's a sort of hollow feeling to the whole thing, but then I sort of think that adds new character to an already well told story. We'd have certainly been cheated if they tried to re-do \"funny girl\" all over again. I have played the soundtrack so many times and really have never felt cheated in any way. The sequel portrays Fanny Brice as more worldly and cynical. She couldn't have possibly remained the same naive, dewy-eyed girl portrayed in the first movie. I think, as sequels go, this is well done and enjoyable...but, a sequel nevertheless. A little less magic than the original, but enjoyable on several levels.","user":"krisroboneil","rank":[15,16]},{"title":"Grumpy Lady","rating":5,"date":"28 December 2010","review":"Watching \"Funny Lady\" always makes me laugh. Not because it's particularly humorous (the only scene I think that works for humor is Streisand's hotel room shout-fest that follows Billy's disastrous opening night), but because each time I see it I am reminded of the one-sentence review a friend gave it back when it opened in 1975: \"Why did they call it 'Funny Lady'? They should have called it 'Mean Barbra'!\" Indeed, Streisand seems to be in a constant state of pique throughout most of the film's 2+ hours. (It's well known that she didn't want to do it and had to be sued to take on the job.) Fanny Brice has indeed grown up, and in place of the ambitious but lovable \"Funny Girl\" from the original, we have a scowling, foul-mouthed, perpetually angry and upset harridan in anachronistically overdone gowns.<br><br>\"Funny Lady\" exists because \"Funny Girl\" was a success. There is really nothing going on in Fanny's adult life that warrants the mammoth film built around it. She has no emotional mountains to climb (unless you count the need of a Nicky Arnstein detox) and Billy Rose is not the love of her life, so what do we have? We have the Barbra Streisand show. A musical and costume fix for Streisand junkies, but not much of a movie.<br><br>I like Streisand a lot, but here her face looks hard and mad all the time and she seems to be striking one pose after another in her extravagant costumes that bear that unmistakable Bob Mackie stamp that recalls the look of every 70s Vegas revue. It's kind of entertaining to see such an abrasive Fanny Brice, but scene after scene of her being bossy and telling musicians and producers how to do their job, you kind of lose the feeling this is Brice you're watching. It's Barbra.<br><br>All that being said, the movie is somehow so light and inconsequential that it is rather watchable. It requires absolutely no brain work on your part and just asks you to sit back and admire Barbra for a couple of hours. Which, even in her caustic mode, is pretty easy to do.<br><br>James Caan is pretty good but miscast as the teeny-tiny Billie Rose, and poor Omar Sharif is hung out to dry as Fanny's punctured romance, Nick Arnstein. They really don't give him much to do.<br><br>So, if you like your Streisand hard edged, singing up a storm, decked out like a Christmas tree, lovingly photographed and serving up ample glimpses of bosom and behind, perhaps \"Funny Lady\" is for you. If you're looking for a really good movie, better rent \"Funny Girl.\"","user":"efitness","rank":[9,9]},{"title":"Entertaining sequel","rating":8,"date":"20 April 2006","review":"The 1968 film version of FUNNY GIRL was an absolute masterpiece, and as perfect as a musical-comedy film can be. A sequel to this classic was not something that was ever needed to be made, but since the original was so successful (FUNNY GIRL was the highest-grossing film of 1968) and well-loved, it was pretty obvious why producer Ray Stark wanted to make this follow-up so badly. It took awhile, but he eventually convinced Streisand to sign on and reprise her role as Fanny Brice, with Herbert Ross (who had staged the musical numbers in the original film and had directed Streisand in the box office hit THE OWL AND THE PUSSYCAT) set to direct. Although the film was generally well-received by most critics and proved to be another big box office hit, many fans of the sweet-natured original did not care for the slightly more harsh and cynical tone of this follow-up, and it has since fallen out of favor with many Streisand fans.<br><br>While no film could ever recapture the easy charm and beautiful sentiment of FUNNY GIRL, FUNNY LADY is highly entertaining when viewed on it's own terms. Streisand plays the now-hard-bitten Fanny with a depth and maturity that is very different from her characterization in the first film, but almost equally as stunning. Many viewers often complain that James Caan was badly miscast as Billy Rose. While Caan is physically wrong for the role of the short, unattractive Rose, he still comes across as oddly likable, and he has a nice comic chemistry with Streisand. Roddy McDowell is fun as Fanny's assistant, and veteran hoofer Ben Vereen brings down the house with a incredible, almost gravity-defying dance routine. Omar Shariff also returns for two very effective scenes as Nick Arnstein, the man Fanny will always love, but can't seem to live with.<br><br>Though Streisand is in terrific singing voice, the song score is a bit more hit-and-miss. The period standards that Streisand vividly performs (particularly the bittersweet \"More Than You Know,\" the gospel-infused \"Great Day,\" and the heart-wrenching \"If I Love Again\") are absolutely fantastic, however, the heavily-promoted original songs from Cabaret composers Kander and Ebb are a major disappointment. The intended show-stopper \"How Lucky Can You Get\" is fine number that is made memorable by Streisand's scorching performance, however, the remainder of the original songs (\"Blind Date,\" \"Let's Here It For Me\") are pretty forgettable despite Streisand's impassioned vocals. Fortunately, these few mediocre numbers (and the rather predictable narrative) are flaws that are very easy to forgive. No, FUNNY LADY doesn't hold a candle to FUNNY GIRL, but the film remains a fun and enjoyable ride that should entertain those who loved the original.","user":"robb_772","rank":[19,22]}]