[{"title":"This is a remake of the 1941 move \"Man Hunt\" based on the same book.","rating":23,"date":"23 March 2000","review":"This is a remake of the 1941 movie \"Man Hunt\" based on the same book.  It's a pity one can't combine the casts of both films, because the villain in the earlier version was played by George Sanders, who would have been wonderful opposite O'Toole.<br><br>The plot is marvellously gritty, with a brutal struggle for survival and a sense of desperation rarely seen in British films.","user":"Matinee-3","rank":[29,30]},{"title":"A Story of Nazi Appeasement","rating":7,"date":"17 July 2006","review":"I first saw this on TV back in the mid 70's and it was definitely a story of the time, when WW2 was still in the forefront of many peoples minds. <br><br>Maybe not to the more modern taste, I've always enjoyed this film. It has a feel of the Thirty Nine Steps about it.<br><br>Just before the outbreak of WW2, Peter O'Tooles character fails in his revenge assassination attempt on Hitler. With the help of a sympathetic German, and English sailors, he escapes back to Britain and has to go on the run from the British and Nazi authorities who are both after him to return to Germany to answer for his \"crime\". He goes into hiding in the country, drawing on his hunting experience, and waits to the outbreak of war when his assassination attempt is looked on in a completely different light by the British, who now see him as a potential asset.","user":"Aglaope","rank":[16,18]},{"title":"perfectly Seventies","rating":28,"date":"28 July 2004","review":"I found this film lurking in the BBC Archives with dust on it.Last viewed the year it came out.It is an immensely atmospheric film shot in that typical seventies film which has aged - slightly murky and blurred with low and dark colour range, a bit like Bergerac or outside scenes of Fawlty Towers! I think Peter O'Toole does a great job in this and is so suited to the role and is really the only real acting presence apart from perhaps the chap he shoots at the end.There are a couple of nice quirky characters though who he meets on the , like the couple who sell him a tandem in a quaint village in Dorset and his plump uncle who we only ever see in a Turkish steam room.<br><br>This a a good bit of greyish British seventies TV.","user":"FelixFlanken","rank":[16,18]}]