[{"title":"A Prophet known as Paddy Chayefsky","rating":10,"date":"20 January 2008","review":"To think that this blackest of black comedies was made in 1976 could only means two things: 1) Nothing has changed or 2) Paddy Chayefsky was seeing the future with the most disturbing clarity. I endorse the later of the two because I believe things have changed since 1974 - I wasn't born yet, but I know because of my parents, the movies, literature, etc, etc, etc. Peter Finch as the mad prophet of the airwaves gives Chayefsky a riveting and powerful voice. The scenes between old chums Finch and William Holden are some of the best written scenes in any American movie until the Coen brothers emerged. Finch is superb, superb! and Holden, at the end of a legendary career, gives a performance of such ferocious sincerity that I rediscovered the man, the actor and felt the need to revisit some of his opus. From Golden Boy to Sunset Boulevard, Holden was a man who carried his own discomfort as a weapon. Extraordinary! However, the most alarming character in the whole thing is Faye Dunaway's. She is magnificent in her thin, nervous, bra-less attitude. She is a monster of commercial amorality. Everything in this incredible movie moves with the precision of an inspired clairvoyant's vision. Duvall's executive, Beatrice Straight's betrayed wife and Ned Beatty's god like big shot makes this one of the most frightening, entertaining, funniest, remarkable film from the 70's. Sidney Lumet proves once more that he's as good as his material. Here he is at his zenith.","user":"Andrea-Orsini-1","rank":[157,172]},{"title":"It's so prophetic it's scary","rating":10,"date":"25 June 2006","review":"Now, here is a film that everyone needs to see, especially today.<br><br>Children should be raised on the truth instead of fiction.<br><br>Television seduces, entertains, divides, desensitizes, and corrupts not just kids but adults as well. It's gotten so bad over the years it's like some kind of a disease now. Most people believe everything they see, read, and hear. Fortunately for me, I'm not most people. There are things that I question and there are things that I know are very wrong. Lying to the American people in every possible way is very, very wrong.<br><br>I've never seen anyone open up their window and stick out their head and yell that they're as mad as hell and they're not gonna take this anymore. I've never seen anyone say that they were a human being and that their life had value. We're so screwed up in the head we don't even deserve to be called human beings. We're like pre-programmed, numbered, clones enslaved from the cradle to the grave; clones that are programmed and structured to obey authority of all kinds.<br><br>\"Network\" deserved the Best Picture Oscar for '76, but it lost to \"Rocky\". How the Academy of Motion Picture Arts and Sciences allowed that to happen is beyond me.<br><br>That's all I have to say about that.","user":"malikroberts16","rank":[90,104]},{"title":"One of the best of all time.","rating":10,"date":"8 January 2008","review":"I can't put it more perfectly than Turner Classic Movies' Robert Osborne who said \"What was originally a satire is a stinging mirror of television news today.\" I strain to think of a film that is a more brilliant take on society, and all of the flaws it has. It's obedience and entertainment by those who rebel, no matter how insane they are. The exploitation of those in peril for any kind of economic profit. And the fact that everything Beale preaches is completely true and completely bashes the people who are producing him. I was amazed by how much he sells out while continuing to rant about how terrible the people he works for are, and the fact that they just keep him on the air because they want ratings.<br><br>It couldn't be more related to today. Turn on the news and you see videos of how horrific the war on terror is and how horrific American society has become, but it stays on the air because people don't want to see the good things in life. They care about the bad and the corrupt. People must have laughed it off back then, but it was such a foreshadow to the near future. The performances are just as brilliant as the social commentary. Each actor becomes so absorbed into their characters that you can't even tell they're acting. It feels like you're watching these people in their daily lives, interacting and becoming more and more corrupt. Finch and Dunaway easily give two of the greatest performances of all time. I could write 20 more pages about it's brilliance, but I'll stop now to keep me from rating. I just have to say that it's so rare to find a film as incredibly flawless as this.","user":"dead47548","rank":[127,149]}]