[{"title":"delightful movie","rating":10,"date":"11 February 2006","review":"I first saw this movie in 1979. I loved it then and it has not lost any of it's magic 37 years later. Lane and Bernard are sweet and captivating and of course Sir Laurence Olivier gives another wonderful performance in his long distinguished career. Like many who saw this movie so many years ago, I often wondered what ever became of the young actor who portrayed Daniel. Apparently he decided that acting was not a profession he would continue to pursue as I have recently discovered, ashame that he did'nt do more. The award winning score to this movie by Georges DeLarue is probably the movies greatest triumph, for without it the story may not have come across with quite the power that it did. This movie is a real blessing!","user":"mtvernonandfairway","rank":[23,23]},{"title":"26 years later, still magical and a work of supreme craftsmanship","rating":10,"date":"5 June 2005","review":"I've never been able to get this out of my head since its first release; it is one of the best films I've ever seen. I just looked at the DVD and was amazed at how many details I still remember from that first viewing 26 years ago. Gunfire-addled IMDb voters are dead wrong; this should be a 9+, but I guess it gets docked two points for having no explosions and only one shooting (with a blank pistol, which probably doesn't count).<br><br>The only \"modern romances\" in the same league are Richard Linklater's \"Sunrise/Sunset\" films, which I urge all fans of \"A Little Romance\" to see.<br><br>As fine as Diane Lane has been in recent films, I don't believe she's ever been as good as she is here, 13 years old and simultaneously fresh as new snow and polished as silver plate. She absolutely belonged on that TIME magazine cover. It's a miraculous performance which may owe more to director Hill than to Lane herself, but who cares? Just enjoy it...her interview feature on the DVD is excellent, by the way.<br><br>With the exception of \"Marathon Man\" and a couple of British TV plays, you can't find better late-period Olivier. He's simply delightful. If you are really perverse (like me), watch this and then compare with \"The Boys from Brazil,\" a dreadful Olivier movie from the previous year, which should have qualified Sir Larry as the all-time champion \"great actor working like hell while thigh-deep in pure crap.\" Here it's the exact opposite: the consummate old pro, totally relaxed, tossing off another memorable performance because he's in a terrific movie that he doesn't have to try and save. This is how I choose to remember the older Olivier. Another old pro, Broderick Crawford, damn near steals the movie in his too-brief cameos. He has a wonderful moment with Thelonious Bernard that will charm anyone who's dealt with an aging person's fading memory.<br><br>Arthur Hill, yet another reliable old guy, puts a nice turn on the #2 step-dad character. Who ever looked better in a business suit? The only truly unbelievable thing in the movie is that such a smart and understanding man would actually marry Sally Kellerman's vapid, starstruck mother character. Heavens, what a bitch. She doesn't deserve Arthur, and the scene in which he ejects equally vapid Potential Next Husband David Dukes from their lives is a classic of real-world, real man macho.<br><br>It's a real shame that Thelonious Bernard didn't have a film career, but if you can only star in one movie, this is a pretty damn good one for it. The iconic freeze-frame final shot of him leaping above traffic to wave goodbye is something one never forgets. It's like the alternate universe version of the last shot in \"The 400 Blows.\" <br><br>One more thing: thank heavens there was no sequel.","user":"yawn-2","rank":[43,45]},{"title":"One of my new all-time faves","rating":10,"date":"17 March 2003","review":"One of the finest movies I have ever seen.  Let no one ever again say that intelligent movies can't be deeply moving, spiritual, and just plain fun.<br><br>I was utterly stupefied at the seamless way this movie exposes the spiritual landscape.  I'm really at a loss to explain this movie in the normal way one speaks of theatrical productions; in terms of components, like writing, direction, acting, etc.  This movie was marvelously \"of a piece\", which is very, very relaxing and refreshing.  Analyzing it would feel like dissecting a living thing, which I won't do.<br><br>Just one of the gems:  This movie makes perfectly plain the essential role of familial love for the full and timely flowering of romantic love.  At a time when people are accused of ascribing to movies an inordinate responsibility for social conditions, this movie reminds you why it might be reasonable to do so.  It can be fairly well depended upon to stand as a model for father-daughter love, true husbandry under difficult circumstances (a spiritually impoverished mother), and exploring your first love.<br><br>And there are lots and lots and lots of other gems in this movie.  There's sweet chaos, Sir Laurence Olivier, an excellent balance of English and subtitled native speech, a truly fine and unaffected portrayal of European life, and on and on and on.  SEE THIS MOVIE!","user":"rzajac","rank":[20,20]}]