[{"title":"Looking For Answers? No Better Place To Look Than Here...","rating":8,"date":"23 August 2004","review":"MONTY PYTHON'S THE MEANING OF LIFE (4 outta 5 stars)<br><br>I never really thought this was anywhere near the best work of the Pythons... but, the more I see this movie, the more I like it.  People not in tune with the Python sense of humour will find this film unbearable I'm sure.  (When I saw it in the theatre when it first came out there were an incredible numbers of walkouts... even *before* the infamous \"Mr. Creosote\" scene.)  Not an actual movie so much as an extended (and expensively-produced) episode of the classic BBC TV series \"Monty Python's Flying Circus\"... depicting several stages in the lives of human beings, from birth to death.  There are some hilarious bits (the sex education class, Death crashing a dinner party), some clever bits (the opening fish skit, the show-stopping dance number \"Every Sperm is Sacred\") and some just plain gross, disgusting bits (Mr. Creosote, organ donations).  Plus, the movie has its own special short subject \"The Crimson Permanent Assurance\"... where an accounting office staffed by aging workerbees suddenly metamorphosizes into a pirate ship!  Most people find this bit incredibly boring and pointless... but, dang, its cleverly done!","user":"hokeybutt","rank":[78,90]},{"title":"Monty Python's final film adventure","rating":8,"date":"24 March 2006","review":"The famous British comedy troupe, Monthy Python, crafted this bizarre collections of their special brand of humor as their last film together; loosely tied by the common theme of the everlasting search for the Meaning of Life, this series of sketches make a very good closure for their film adventures, as it seems as a return to their roots in the TV show \"Flying Circus\" and dedicated to long time fans. Nevertheless, this may also be a turn off for fans expecting something akin to \"Holy Grial\" or \"Life of Brian\".<br><br>Terry Gilliam and Terry Jones direct the segments that form \"The Meaning of Life\", divided in the diverse stages of human development (from birth to death), the action flows with ease; although due to the nature of the film, some sketches are definitely better than other. It's safe to say that this movie contains some of the best and the worst the troupe has done; however, their most mediocre work is still better than most modern comedy out there.<br><br>The movie also foresees the future careers of both Gilliam and Jones as directors; their film style (particularly Gilliam's) is now mature and almost fully developed. Gilliam's short \"The Crimson Permanent Assurance\" is an outstanding segment that could even stand alone on its own, and that presents Gilliam fully in form as a wild fantasy director.<br><br>While this was their last film, the group seems to be at its peak when talking about acting; from John Cleese's Dr. Spenser to Graham Chapman's near perfect impersonation of Tony Bennet, the acting never lets down, and even when some scripts are dull even for their time, the Pythons as actors never disappoint.<br><br>Something worth to notice are the great quality of the songs performed in the film. they are not only written with their high quality witty humor, musically they work very well and rank among the best the group has written in their history together.<br><br>Still, the movie may be overlong and at times tedious to people not used to the team's brand of humor. Specially considering that \"The Meaning of Life\" has more in common with their early roots than with what made them famous. Also, probably some of the jokes are definitely outdated now; however, \"The Meaning of Life\" is a very good display of the gang's different sides.<br><br>While maybe not as ingenious as \"Holy Grail\" and definitely nowhere near the masterpiece \"Life of Brian\", the Pythons last movie is still a very good comedy to watch. However, this certain brand of humor may be appealing only to fans of the Python's TV work, as it has more of those early roots than of their past film adventures. 8/10. An acquired taste indeed.","user":"jluis1984","rank":[53,60]},{"title":"Bloody good \"Python\"!","rating":21,"date":"21 January 2007","review":"The moment you start watching \"Monty Python's Meaning of Life\", and you see the unexpected movie within the movie \"The Crimson Permanent Assurance\", in which an office building turns into a pirate ship, you know you're in for one hell of a surreal ride. \"Meaning of Life\" is the Pythons at the zenith of their lunacy, filled with shocking moments of violence, offensive behavior, repulsive bodily functions, and all sorts of jaw-dropping bric a brac. Whether or not the movie truly intends to make us ponder the meaning of life or not is debatable, but you have a great time watching it. With an aquarium full of fish as a sort of Greek chorus, we explore the 3 stages of life: birth, growth, and death. The faint of heart better beware: \"Meaning of Life\" has scenes that would, even today, barely fly in the land of the Puritans. Michael Palin, as a dirt-poor father of 100 children, leads an epic musical number against birth control. Eric Idle, while singing about the vastness of the universe, witnesses a constellation take form of a naked woman giving birth. John Cleese plays a headmaster who teaches sex ed by having intercourse with his wife in front of his class (it's easily the least erotic sex scene in cinema history). And, in \"Meaning of Life\"'s most famous scene, the revolting, gluttonous Mr. Creosote (Terry Jones) literally eats until he explodes. The film lampoons several touchy topics: Catholic dogma, basic human stupidity and selfishness, the foolishness of war (in a brilliant parody of \"Zulu\", with Michael Caine in a brief cameo), and even death itself (one man is able to choose his death, in which he is chased off a cliff by a mob of topless women). Yet it's not entirely gratuitous. In fact, the Pythons make several good points: birth control shouldn't be denied to anyone, especially those too poor to have children. Gluttony is wrong, and will in time punish you itself. We only live once, so we better enjoy the ride. It's no-holds-barred madness, and it's Monty Python at their best. \"Meaning of Life\" doesn't have the same cult following as \"Holy Grail\", but it's certainly one of their best. If you can't handle gore, sex, vomiting, or lunacy, steer clear. For those willing to take the chance, check out \"Monty Python's Meaning of Life\" and maybe we'll figure out, as the title song says, if \"mankind's evolving, or is it too late?\".","user":"lauraeileen894","rank":[44,51]}]