[{"title":"Grand fantasy film-making, fun for all ages.","rating":8,"date":"27 August 2002","review":"I can attest to the feelings expressed by the last couple commentators about 1959's \"Journey To The Center Of The Earth.\"  This is a wonderful family film from the bygone Eisenhower-era of the 1950s.  Even though I've been watching it on TV since I was a kid in the sixties, I'd only seen pan&amp;scan versions, and it wasn't until I got it letterboxed on laserdisc that I finally saw what a big-screen entertainment this movie was meant to be.  It has wonderful scope and a score by Bernard Herrmann that takes you right down into the bowels of the earth.  Listen to it and you'll notice what I mean, as the movie progresses the music keeps going into a lower and lower register.  Five organs were used, including one meant for a Cathedral. (The complete original recordings of the score are available on CD from Varese Sarabande.) This movie also has the great James Mason in it, so you know it's got to be good.  Sure it's long in the telling and takes a while to get you down that extinct volcano in Iceland, but it's fun all the way with great special effects work by L.B. Abbott and matte paintings by Emil Kosa Jr.  The only way to watch this movie is in wide-screen and it's long past due that 20th Century Fox puts this out on DVD in a letterboxed anamorphic transfer.  Let's hope that they do it soon.","user":"haristas","rank":[71,73]},{"title":"I rest my case","rating":21,"date":"21 April 2000","review":"After reading some of the comments on this film I feel I have to spring to it´s defense. You see I am born and bred in Iceland and as I write this I am in front of my computer in Iceland, so you can believe me when I tell you that ALL THE ICELANDIC IN THIS FILM IS REAL. I understood almost everything that the Icelandic character in the film said and I can assure you that it was particularly articulate and well pronounced. Why someone said that it was fake, I don´t know. I am guessing that he did not hear it well because the sound can be pretty bad in these golden oldies. While we are on the subject let me also add that some of the facts concerning Iceland were wrong. The horse carriage used to transport the group to the volcano is out of place. The interior design of the hotel and the maitre d´hotel´s costume was a bit off. But it´s described like that in Verne´s novel as well so it´s no big deal. And besides every ethnic group is portrayed in a very stereotypical manner; Scots, Italians, everybody. Such nitpicking is therefore dull and unnecessary and people should just enjoy the film for it´s imagination.","user":"Rage-7","rank":[49,50]},{"title":"Wonderful fantasy adventure.","rating":9,"date":"29 April 2008","review":"Intrepid professor Sir Oliver S. Lindenbrook leads an expedition towards the center of the Earth via an extinct Icelandic volcano. The journey is sure to be fraught with danger and little do they know that their trip will take in many unchartered wonders.......both good and bad!<br><br>As adventure films go, Journey To The Center Of The Earth has few peers, it's a wonderful film based around the Jules Verne story of the same name. There are no hidden agendas here, no wry social commentary or satirical edginess, it is pure fantastical entertainment that wants you to enjoy its science heart whilst you have a blast following this group into the wondrous unknown. Lost cities, prehistoric lizards, underground oceans, crystal caves, sand mines, murder, sabotage, and on it goes for just over two hours of delightful movie making, it even has time for a bit of cheeky sexual tom foolery for the knowing adult. <br><br>I'm sure the likes of Spielberg &amp; Lucas were nodding in approval back in the day.<br><br>The sets, the sound, and the special effects were all nominated for academy awards, and sure enough all may well seem tame by todays bloated standards, but this is 1959 and let your mind be back to that time and you surely will be taken in by this joyous experience. While I must also mention that location footage shot in the beautiful Carlsbad Caverns adds to the dynamic feel of the picture. Lead acting duties fall to the irrepressible James Mason as Lindenbrook, perfectly cast as he nails all the traits of this dyed in the wood professor. Support comes from Pat Boone, Arlene Dahl {the colour photography perfectly showing her piercing eyes}, Peter Ronson and star of the show Gertrude The Duck.<br><br>It was magical to me as a child, it's still as magical to me now I'm in my advancing years, wonderful indeed. 9/10","user":"hitchcockthelegend","rank":[21,21]}]