[{"title":"Cirio H. Santiago strikes again with another mixture of madness","rating":6,"date":"21 June 2017","review":"Cirio H. Santiago seems to have been a bit of a legendary Filipino director from the period when many cheap and cheerful genre flicks were being knocked out in the Philippines. From the little that I have seen, his output seems to be a guarantee of a good time on at least some level. One thing I have noticed is that he is fond of throwing everything at the screen no matter how disparate, with Future Hunters (1986) for instance he combined a post-apocalypse, time-travel, religious artefacts, Shaolin monks, neo-Nazis, dwarfs and Amazonian women. With the earlier TNT Jackson (1974) he simply combined martial arts with Blaxploitation, which was a tactic he returned to with Fighting Mad, with the added bonus of a vigilante revenge story and Hell in the Pacific thrown into the mix as well. The story itself has a lot going on in it. Three Vietnam veterans steal a cache of gold and then two of them double-cross the third by killing him and throwing him in the sea. Trouble is he doesn't die and winds up on a tropical island inhabited by two Japanese soldiers who are still fighting World War II in the late 70's. They nurse him back to health and train him to be a martial arts expert and samurai sword master. He eventually ends up back home in L.A. and seeks out his ex-buddies - who are now crime lords - for a slice of violent revenge.<br><br>It would be churlish to complain too much against a movie which has a synopsis like the above. In true Santiago style its attempt to mash genres up does result in something a little bit different for sure. It's full to the brim with fighting, training montages, heads and ears being lopped off, soul singing, 70's hats and Afros. So while it's not always entirely engaging stuff it tries its best to deliver a bit of stupid fun and you really can't argue with that too much.","user":"Red-Barracuda","rank":[4,4]},{"title":"Prime seventies exploitation - with swords!","rating":7,"date":"25 March 2014","review":"My first Cirio H Santiago film! This one has a brain-meltingly random premise, Afros, cool music, is choppy as hell and even throws in a bit of gore at the end there.<br><br>Russell is a Vietnam vet who's smuggled some gold with his mates Morrello and McGhee, who of course double cross him, slit his throat, throw him in the sea and head off to L.A to waste the mob there and become crime lords (as we see them blast their way through many gangs). McGhee also has the hots for Russell's wife, and periodically turns up to try and woo her (getting more aggressive with every visit).<br><br>Russell, however, washes up on a desert island, where he meets two Japanese soldiers who have never surrendered (and never will). After becoming friends and indulging in some funny banter (\"You should see Japan now!\"), the ranking officer (great character) teaches Russell how to slice things up good with a samurai sword, which as you know will lead Russell back to LA where he can chop his buddies, and their hired goons (Hired goons?) into little pieces.<br><br>Full of ridiculous situations, action scenes and funky music, Fighting Mad is a good bet for an exploitation fan. There's a good relationship between Russell and the Japanese officer, and just when I thought Russel would never get off that damn island, he does in a rather sad scene and the film picks up from there. Whenever the film bogs down in training sequences, Santiago just switches to L.A to show McGhee and Morrello taking on rival mobs.<br><br>Once Russell arrives in LA, he becomes an unstoppable killing machine to get to his enemies. It looked like some of the violence had been cut from the version I watched (a leg being severed), but as there were several graphic decapitations at the end, who knows? This is good for a watch if you're like me, and just switch your brain off before hitting 'play' and just go with the flow. It's cheap and cheerful and action packed – what else do you want?","user":"Bezenby","rank":[4,5]},{"title":"Excellent multi-cultural smackfest","rating":7,"date":"4 August 2005","review":"Hi, Everyone, This film has Leon Isaac Kennedy billed as Leon Isaac. He is the rottenest villain in the story. He is superb as a likable monster.<br><br>James Inglehart is all things good, but still willing to smash a person's head. The hero is part of a trio of bad guys who aren't real bad at the beginning of this movie. James takes it personally when his buddies try to kill him. The scenes where our hero is learning martial arts are very well done. The casting is very true to character. A nice mix of an Asian martial arts pro who is believable and very funny and White and Black and Asian good and bad guys and girls in a 70s era story.<br><br>The one song sung by Jayne Kennedy is played instrumentally throughout the film. It is actually a nice song that could have become a hit for that time period.<br><br>The movie has lots of good location shooting. Lots of scenes in a Pacific Island and scenes on a boat mix with street scenes in Los Angeles and then Mexico.<br><br>I got this as part of a 50 Martial Arts movie package for about $19. It is well worth that and it is worth much more. If you like action, this movie should give you plenty.<br><br>Leon Isaac Kennedy was one of my favorites in the early 1980s. He was always tough yet he had a smile for the ladies that made him appear to be a a real sweetheart.<br><br>One last observation about this movie is something to watch for in the barbershop scene. What is the price of a haircut? In this nice barbershop it will cost you only... $2.<br><br>Tom Willett","user":"yonhope","rank":[4,5]}]