[{"title":"Another great memory of childhood","rating":8,"date":"22 December 2008","review":"It always puzzles me how adults can review movies that were meant for a young audience and review it negatively (through adult eyes), completely forgetting about a child's unique and innocent perspective on the film. Shame on them all!!<br><br>As a young kid in the 70's, Disney, cartoons and sports were all weekly staples- so many good memories!! Escape to Witch Mountain was one of the first movies I saw in the theater, and was both entertaining and fun. A good adult cast; Donald Pleasence, Ray Milland and the underrated Eddie Albert, all provide good support for our two hero kids who use their powers to not only try to find home again but thwart the evil intentions of those trying to use their powers for their own benefit. The movie is well paced and has the usual hi jinks one expects in a \"chase\" film. I enjoyed it then and liked it just as much after a recent viewing on cable.<br><br>This movie also illustrates how one doesn't need bad language or crude behavior/jokes to appeal to kids. What some people regard as \"corny\" others find a refreshing change from today's standards of \"acceptable\" programming.","user":"ramsfan","rank":[17,18]},{"title":"Wonderful Film","rating":7,"date":"27 September 2003","review":"I was thrilled to see one of my favourite films, as a child, released on to DVD.  I can now share some of my childhood with my own kids.  No big surprise, but my older daughter (7) loves it.  My younger daughter (2) thought some parts were \"scary daddy\"; the broom/jail scene was well done! Highly recommend it as a family film for folks that want a nice movie to watch with their kids.","user":"geonadak66","rank":[25,29]},{"title":"My Favorite Childhood Film Experience","rating":11,"date":"11 August 2004","review":"In 1975, I was 11 years old. \"Escape To Witch Mountain\" played to a packed house at a now-defunct old theatre called, Miracle. People were sitting on the floor because they sold more tickets than they had seats. I'd never seen anything like that before.<br><br>My dad and step mom took me to the movie and we got the last of the few remaining seats. They probably only took me because it was a Disney flick. Had to be harmless, right? Hardly. Afterward, they were puzzled by the seemingly surprising UFO angle. I remember being absolutely transfixed. I'm still fascinated with mysterious stuff like UFOs and ghosts. I wasn't supposed to like that stuff but this film made it impossible for me not to.<br><br>And I identified with the kid heroes on a deeper level as well. I, myself, was kind of a ragamuffin misfit kid from a broken home who spent weekends with my dad's new blended family. I felt the siblings' pain at being torn from their home. Tia broke my heart. She was as fragile as me, but far stronger when it really counted. Tony was just hot! Older and very cute at 13. And those powers they had? How cool was that? By the time the credits rolled, I knew I'd seen the best movie ever!<br><br>I was lucky enough to have an older cousin who loved movies and hanging out with me and she bought the Disney movie record for me. I don't know if any of you remember these; Disney used to release LPs of the audio track of some of their movies, usually truncated and featuring narration. In the case of \"Escape\", it was narrated by Eddie Albert. This thing enabled me to memorize every line of Tony and Tia's dialog and much of that of the other characters, too. I still have it, though the sleeve is long lost. It's tough for me to watch the movie without speaking along with the characters (especially Tia), at least in my head.<br><br>My cousin also bought me Alexander Key's book. Boy, Disney sure took liberties, didn't they? Key's book is far more serious and developed and meaningful. I tried to take the best parts from the book and the movie and incorporate them together into the Tony and Tia of my imagination. It deepened them. Too bad there was no fanatic outlet back in those days! It was pretty egolesss of Alexander Key for coming together with Disney on the eventual novelization of \"Return\". Without Key's kind participation, it would of been an empty exercise. I was especially impressed with how he incorporated the issue of Tia needing to learn to speak.<br><br>Through the years, I never \"Escape\" and I saw it as often as I could. For instance, when \"Return\" was released, Disney sent the movies out as a double feature. I loved \"Return\", silly as it was, even though there were things in it that really bugged me. Like the sibs being split apart for most of the movie. I loved them together! I think most of the fans of the first film were most affected by their chemistry. I think we wanted to see more of that. Even so, I really liked the Earthquakes, all of them. And it was fun to see Kim and Ike a bit older and even cuter than before. I also remember seeing \"Escape\" on an odd revival double-bill with \"Bambi\" at some point in my teen years. I think I would've followed Kim and Ike anywhere. Heck, I even followed them to \"Devil Dog, The Hound Of Hell\". You have to see the comments page here at IMDb if you haven't already.<br><br>I would've seen \"Tuff Turf\" even if Kim wasn't in it, but that's a convoluted story for another thread. Suffice to say I have seen TT far too many times and many of them were for Kim. Also, I can honestly say I enjoy the TV edit of \"Star Trek II\" far more than the theatrical cut because it has more Ike. I even had a good time watching \"Blair Witch Mountain...\" when it hit the web. I have to agree that it might be fun to revisit Tony and Tia with the original actors today. Hey, last year, the new \"Twilight Zone\" brought Anthony (Billy Mumy) back and introduced us to his similarly gifted, but far less scary (real life) daughter (Liliana Mumy). And all those people came back from the cornfield. Why not Tony &amp; Tia?<br><br>I could rhapsodize for paragraphs about both \"With Mountain\" films, and I may still do so when I get my special edition DVDs. In the meantime, here's hoping that a whole new generation of kids will discover \"Witch Mountain\" for themselves.","user":"sisterdebmac","rank":[39,48]}]