[{"title":"A real ripping yarn","rating":9,"date":"30 November 2003","review":"As a World War One naval buff, I enjoy this film on one level. As a film enthusiast, I enjoy it on another, all the more so for it being based on fact.<br><br>The actual story of the Koenigsberg is actually far less glamorous than the fate of the Blucher in this film but no less enthralling. After the ship was destroyed, her crew joined the German land forces under Count Paul von Lettow-Vorbeck and, together with their few thousand fiercely loyal African troops, fought 1 million British soldiers to a standstill for 4 years until, after the Armistice, they surrendered to the Portuguese, undefeated and proud. A tale well worth reading, far better than the fiction.<br><br>Back to the film. The central character is one Flynn O'Flynn, a thoroughly disreputable character, played by Lee Marvin. Always good value for money, he merely reprises Ben Rumson in Africa - no effort required! Roger Moore, aged 49, plays the 'young' interest! Mind you, he don't look bad for it! He is married to the delectable Barbara Parkins, Flynn's daughter Rosa, really the only female character in the film, a grim role she carries off to perfection. Fleischer, the evil German, the exact opposite of von Lettow-Vorbeck, is brilliantly overplayed by Rene Kolldehoff - he really is unlikeable! Also look out for Ian Holm as the mute Arab servant Mohammed.<br><br>The film has great pace, really rolling along, well shot in wonderful scenery. It has been well researched too. The Blucher, an actual German cruiser, has been pretty accurately recreated. The whole film has a very genuine feel. <br><br>I can see why it's not popular with female viewers. It's quite bloody, very cruel and Barbara Parkins character has a dreadful time of it. The scene in which the farm is burned is quite harrowing.<br><br>There are plenty of laughs too. Flynn O'Flynn has all of Ben Rumson's comic characteristics. The big fight between Marvin and Moore is very funny. And then there's Roger Moore blacked up as an African porter - he's about as convincing as I would be - and I'm blond!<br><br>If you're a fan of Ripping Yarns, then this one is for you. If not, then I wouldn't bother.","user":"johnson50","rank":[35,43]},{"title":"A very good old fashioned adventure movie.","rating":8,"date":"19 May 2006","review":"I first saw this movie, when it was first released in 1976 and must say, it hasn't lost its momentum. Fine performances from all the actors and the only actress in the film Barbra Parkins.<br><br>When i was a child, i read a story in the victor comic of the destruction of a battleship in the first world war like the Blucher and if i remember correctly, it was never discovered who actually blew the ship up. As stated in another comment, it is a pity that you cannot get an original full version of this film. The version i have is from the BBC. Also in a couple of comments, it has been stated that it was a pity a baby was murdered. I would like to make a point, that it was in the book by Wilbur Smith, Rosa and Smiths child being thrown into a fire and this is the beginning of the story of their fight with the character Fleischer, brilliantly portrayed by Reinhard Kolldehoff. It is a pity films like 'Shout At The Devil' are not being made today, as there are still books of adventure stories in the shops there for the taking. A must for people who still like a good old fashioned yarn with a beginning a middle and an end.","user":"k-thomas","rank":[14,16]},{"title":"A good film set in a little known theatre of the First World War","rating":6,"date":"22 April 2006","review":"If C S Forester had not written The African Queen the fact that Germany once had a colonial empire would be totally unknown. This little known theatre of WW1 has been the background to The African Queen and this film as well as an episode of Young Indiana Jones. Contrary to what some commentators have said Fleischer is not meant to be based on Lettow-Vorbeck. He holds a different position, namely that of commissioner for the southern district. Lettow-Vorbeck was commander of the Schutztruppe. It is a cracking good yarn but like many people who have seen it I don't like the part where the baby gets killed. The special effects are some of the best pre-CGI effects I have seen.The editing of the film leaves a bit to be desired.Lee Marvin basically reprises Ben Rumson and Roger Moore plays James Bond as an Edwardian adventurer. As I said the special effects are good for their time but when the battleship blows up the hull remains in the same position. It doesn't sink or even list. Also, if there was a bomb right in the ship's magazine the explosion would be a lot bigger and Rosa and Sebastian would not have much chance of survival being just across on the opposite bank. But still a very good film.","user":"de_niro_2001","rank":[9,10]}]