[{"title":"Even twenty odd years after I first saw it, this film makes me want to cheer. Gillian Armstrong, if you're out there, thank you!","rating":10,"date":"4 December 2000","review":"My mother took me to see this film when I was ten, the year before she died. It changed my entire perspective on the world, set me free from the constraints of fairy tales and inspired me to do something worthwhile with my life (write). I've seen it a few times since then, and found it improved in pace with my understanding.<br><br>Apparently Judy Davis didn't like this character or sympathize with her. All I can say is that I'm glad she went ahead and took the role anyway. Sybylla is like Cinderella with a twist worthy of M. Night Shymalan.<br><br>The film is sometimes beautiful and lyrical, sometimes depressing and ugly. At all times it is believable because the forces driving Sybylla transcend time and place: creativity and independence. This film taught me that a gilded cage is still a cage.<br><br>Even twenty odd years after I first saw it, this film makes me want to cheer. Gillian Armstrong, if you're out there, thank you!","user":"wse","rank":[34,37]},{"title":"One of my all-time favorite films","rating":30,"date":"30 April 2000","review":"Judy Davis, as Sybylla Melvin, struggles with the conflicts that we all have between ambition, family, love, and guilt in a most remarkable manner. Sybylla grows to understand that life is a series of trade-offs, and that no one can have it all, and that no one can please everyone.  Simple yet universal themes told with charm, wit, and a vulnerability that allows us to get right inside of her character and to understand her --- up to a point that is, a career is vital but I don't believe I'd have the strength to pass up Sam Neill under any circumstances, especially as cute as he is in this movie.  In fact, all the acting is great, and the cinematography is breathtaking.  Gillian Armstrong has been my idol ever since she made this magnificent film.  I give it a 10.","user":"aromatic-2","rank":[25,28]},{"title":"A quiet, rewarding story of a young woman's ambition","rating":9,"date":"25 December 1999","review":"Judy Davis is Sybylla, a girl of the Australian outback around 1909.  As portrayed by Davis, in her breakthrough role, Sybylla is a font of boundless energy wanting desperately to escape the backwardness of her young life. Sam Neill, also in one of the significant early roles of his career, is likewise charming as the young man who presents her with a tempting alternative to her ambition to become a writer and escape the frontier life forever.<br><br>This is not a great or epic story, certainly, but it is a quiet, rewarding story of a young woman's quest for a better life.  A worthy entry among the films that marked the ascendancy of the \"Australian Renaissance\" in film-making during the 1970s; director Armstrong would go on to make such films as \"Mrs. Soffel\" and the 1994 \"Little Women.\"","user":"Aldanoli","rank":[28,32]}]