[{"title":"One of My All Time Faves - But the original is gone I suspect","rating":27,"date":"27 March 2006","review":"Saw this in the theater at it's release. Went back the next weekend and scenes were cut. They remain cut in every version I've seen since. Frank snaps chalk lines off traces of blueprints onto the safe face in the opening heist. Guess the crime commission didn't dig that, 'cause that 5 seconds is history in every cut I've seen since. How do the boys and their gear get up on the roof of the bank building? Rocket assisted grappling hook mortars firing mountain lines and Jumar ascenders from the parking lot. You won't see that scene anymore, either. Man, I miss the Corned Beefs at the Belden Deli on Clark where Frank hands the stones to Gags. Long gone. But if you are in Chicago, stop in early at the Green Mill and you might be able to have a drink in that big, round wood booth - still there. Great gun &amp; car flick. Frank's .45 looks like a Bomar Svenson custom combat, tremendous. Watch for the High Standard 12 guage stakeout special at the end - very rare. Take a drive up north on Western Avenue to check out all the used car lots - still there. Great locations. Yup, the creme was ALWAYS cottage cheese at the old Oasis restuarants. Yuch! You know - Tuesday Weld actually even ACTS a little in this movie, amazing. Man that was a gorgeous house in my old neighborhood and yes they blew it up. Notice when they are snuggling on the outdoor patio - it had a two-sided fireplace - indoor and outdoor. Probably the best Chicago movie ever. The phone book and trash can - time honored tools of the early 80's. When I saw it opening night the theater was filled with every crook and detective on the north side with their wives. And everybody just nodded to each other on the way out. Those days are gone but not forgotten. Great, great flick. Cool TD soundtrack album, too. Also probably the best metallurgical movie ever. I want Frank's coat.","user":"tandkmoran","rank":[132,149]},{"title":"a real classic!","rating":21,"date":"21 October 2001","review":"Even though this film was made only a little over two decades ago, I consider it a film-noir classic! James Caan said once that this was the film he was in that he was proudest of next to The Godfather. I remember that Roger Ebert and Gene Siskel said this was one of the finest films of 1981. Caan is wonderful in a role that he was born to play, a tough guy with his heart on his sleeve. Everything about this film is wonderful from the musical score by Tangerine Dream to the dark lighting effects to the authentic detail about the life of a thief ( I read that Michael Mann actually used real life thieves as technical advisors to this film!). Even though Caan's character is an anti-hero, you have to feel sorry for him because he is caught in a situation where there is no way out! The best scene in the film is where he tells Tuesday Weld about his prison experiences and shows here the picture cut out that he has made of his American dream. Jimmy Caan is truly awesome, he is the only actor that ever made me cry (in Brian's Song) I also wanted to mention another great character actor who is in the film. His name is Robert Prosky and he plays the mob boss who uses Caan. This was his film debut after many years as a stage actor and he is terrific. Watch the scene in the acid plant where he threatens Caan. He is really chilling! Michael Mann created Crime Story and Miami Vice and he also directed Manhunter, but lets not forget this film as well.","user":"dtucker86","rank":[71,81]},{"title":"When James Caan was allowed to be real!","rating":9,"date":"4 May 2010","review":"This is one of the few Michael Mann films I can stand to watch. Caan is at his absolute peak here, with his intensity just blazing off the screen. The supporting cast is excellent, the edits are perfect, everything just clicks.<br><br>As has been noted by other reviewers, the technical aspects of this film are right on the money. All the locations are really there (or were at one time) and the settings didn't have to be faked up. Yes, Chicago and surrounding Chicagoland is really like this, folks.<br><br>I try to watch this thing every few years. Should buy a DVD, I guess, and insert it into my permanent circular film buffer.<br><br>Highly, highly recommended.","user":"SomeUselessGeek","rank":[39,43]}]