[{"title":"Good memories","rating":10,"date":"1 April 2006","review":"This movie is the 80s to me. Cheap and tawdry but also earnest and full of heart. Frankly me and friends liked seeing topless girls and were too young to see them any other way. Yet this movie also had a lot of humor and action. I can still watch it because the lead guy was genuinely personable. The world depicted in this movie exists on its own terms. A cross between the world of MacGyver and John Holmes. There were dubious sequels to this film, but the same cast was not used. While Hard Ticket to Hawaii had one or two moments of fun, they never had the down home feel of this Malibu. I must tell you it still makes me laugh. Now for different reasons. It is both an embrace and a condemnation of the high rollers of the 1980s. The crude attitudes about gays and even a semi rape wouldn't fly today, but it stands as a record of a more ignorant yet more laid back time.","user":"Edermike","rank":[16,17]},{"title":"This one has it all!","rating":12,"date":"12 October 2001","review":"This is what the \"Dukes Of Hazzard\" would be like if it was geared to adults! Cody Abilene, a man who can't shoot straight with a gun, but can with a...well, you know, is a P.I. trying to solve a crime involving a rich family being bilked out of its cash. This one has it all, gorgeous babes, graphic violence, great sex scenes (for 1985), a good plot, and a hilarious sub-plot involving The Hogg family's cousins, The Buffingtons. A Russ Meyer film made for the 1980's by Andy Sidaris, and a memorable one. The best scene is when Cody needs to find a new car to replace the one he lost, and he goes to a used car lot owned by a woman who recognizes who he is, and when he request to buy a car, the lady starts to seduce him; and later, when he leaves, he says (in a first person voiceover, that he was raped!). Good stuff.","user":"BlackJack_B","rank":[13,14]},{"title":"Greatest movie ever made...","rating":10,"date":"6 October 2001","review":"And I've still yet to finish watching it! Definitely the guiltiest pleasure one could have. How can you not like a movie that features quasi-attractive 80's playmates and a red DeLorean! I recommend this to everyone.","user":"MikeFX","rank":[14,17]}]