[{"title":"\"We can't all do good, but at least do no harm.\"","rating":10,"date":"19 September 2001","review":"Brain Dead...where do I begin? One could easily go crazy thinking about this movie. Brain Dead was written by the late Charles Beaumont (the man responsible for some of my favorite Twilight Zone episodes) and was directed by Adam Simon (The American Nightmare). It's basically one long chaotic nightmare and, at the same time, one of my favorite films. It's a real head trip where one is constantly questioning the sanity of the main characters. Is Bill Pullman crazy, is Bill Paxton out to get Bill Pullman, should the two Bills be taken seriously? In this movie, yes. The Bills are excellent and so is the rest of the cast. This is the film that really made me take notice of Bud Cort. He's hilarious as Halsey. If you're up for some serious insanity, give Brain Dead a spin. I give this movie a 10 on the psychological mind bender scale. It ranks up there with Cronenberg's Videodrome.<br><br>Note for genre buffs: Miskatonic University is mentioned by Dr. Martin in the film. That is the same school Dr. West attends in Re-Animator and is mentioned in many films based on the works of H.P. Lovecraft.","user":"Backlash007","rank":[27,30]},{"title":"Butterfly dreams of being a man","rating":9,"date":"8 August 2003","review":"The great Taoist master Chuang Tzu once dreamt that he was a butterfly fluttering here and there. In the dream he had no awareness of his individuality as a person. He was only a butterfly. Suddenly, he awoke and found himself laying there, a person once again. But then he thought to himself, \"Was I before a man who dreamt about being a butterfly, or am I now a butterfly who dreams about being a man?\" <br><br>This quote is being used in the film and clearly illustrates the basis of the brilliant screenplay. The claustrophobia of not knowing reality from imagined reality is very real in this film. Earlier acts by Bill Pullman, and Bill Paxton make for a real viewing pleasure. But the real star of the film is Bud Cort (Harold, from the film Harold and Maude). Set designs and lighting make for a fine surreal experience. This movie is a great one with a fine story, fine actors, fine cinematography, special-fx and direction. The music sounds like synths left over from the 80's. But that adds to the B-effect of the film. Highly recommended.","user":"Semih","rank":[19,25]},{"title":"Neurological nightmare.","rating":7,"date":"11 December 2010","review":"Bill Pullman plays a brilliant surgeon who decides to perform an operation on a psychotic mathematician.He tries to unlock corporate secrets hidden in his patient brain.As the result Pullman is plagued by a series of bizarre dreams and nightmares.\"Brain Dead\" by Adam Simon is often confused with Peter Jackson's insanely gory horror comedy \"Braindead\".The script is clever and sophisticated,the atmosphere is quite chilling and the acting is solid.The film has pretty warped sense of humour,unfortunately the action is slow and there is no gore.A must-see for fans of \"Twilight Zone\",\"Blue Sunshine\" or \"Strange Behavior\".7 homicidal mathematicians out of 10.","user":"HumanoidOfFlesh","rank":[8,9]}]