[{"title":"Overlooked, hard to find and not too bad.","rating":1,"date":"1 July 2003","review":"I agree that this is not one of George Pal's stronger efforts, but it does have merit.  The sinking of Atlantis at the conclusion still looks good today even though some of the shots of the burning city were taken from \"Quo Vadis.\"<br><br>Near the end of the film Russell Garcia's music repeats an easily remembered motif from his \"Time Machine\" score.<br><br>Edward Platt's performance as High Priest Azor is one of the best in the film although I kept expecting someone to call him \"Chief.\"<br><br>The writing is a little stiff as it always seems to be in these ancient times epics.  The only real awkward moment is the bizarre chant the slaves recite as they twist the giant drill in order to speed the eruption of the volcano.<br><br>Very colorful sets and costumes along with the usual amount of special effects mayhem you would anticipate from George Pal.  The lead f/x man was A. Arnold Gillespie who worked on \"The Wizard of Oz\" and \"Gone With the Wind.\"  The miniature sets and explosions are especially good.<br><br>An overlooked, above average spectacle from one of the best showmen working in Hollywood at the time.","user":"TSMChicago","rank":[37,41]},{"title":"If you hook a princess--throw her back.","rating":2,"date":"2 June 2004","review":"Here's a flicker that scared the bejesus out of me as a child. I had trouble understanding the overlapping of modern science with the ancient world. A Vernesque-style atomic submarine blew me away. And that solar laser--which vaporizes enemies of the state--defies logic.  I hear there were scenes of men in flying machines that were cut. Why?  One scene that was not cut involved a mad scientist experimenting with turning men into swine. Strange and scary stuff. And the costume designer went berserk with HIS creations. Watching the film recently I discovered my utter contempt for the lead female role. I felt sorry for the poor fisherman who saves the ungrateful princess from certain death. He, however, has only himself to blame. The princess whines, schemes and disparages his occupation right from the start AND in front of his father. And that's only the beginning. Later on, she has no problem casting him into slavery. Enough about her. The soundtrack is very rare because it is out of print--and costs a royal fortune. I just touched the surface with this well made and imaginative film. Look for it on cable somewhere--or visit Atlantis on your next vacation.","user":"lemon993","rank":[32,36]},{"title":"A fun movie","rating":26,"date":"26 March 2000","review":"I first saw this film when I was a child.  My friends and I were enamored of it, and played \"Atlantis\" for weeks after. Watching the movie with adult eyes, however, reveals that it is not George Pal's best work.  Even so, it continues to have sentimental value for me and I do watch it occasionally.  I still believe it to be a \"fun\" movie, real Saturday Matinee, popcorn and juju beads, sticky floor fun.  Just turn off the brain, drop your expectations, and enjoy.","user":"hammjp","rank":[22,25]}]