[{"title":"Pushing the Envelope of Space!","rating":9,"date":"18 November 2000","review":"'The Right Stuff' is one of the most glorious adventure films ever made, a story of incredible heroism, poignant romance, gripping drama, and broad humor...and amazingly, it has actually happened within our lifetimes!<br><br>This is a tale of test pilots, 'pushing the envelope', proving the sound barrier couldn't constrain mankind's reach for space. Leading the way is plain-speaking Chuck Yeager (portrayed by Sam Shepard with Gary Cooper-like charm), a Beeman's gum-chewing cowboy with a passion for his feisty wife (the beautiful Barbara Hershey), and hot planes. Not even a broken rib could hold him back when an opportunity to fly the X-1 was offered. His record-breaking flight could fill a movie by itself...and this is just the BEGINNING of the story!<br><br>Jumping ahead a few years, Yeager is joined by a new breed of test pilots, whose total love of flight challenges their relationships, and is the true measure of how they define themselves. Among them are 'Gordo' Cooper (Dennis Quaid), a hot dog jet jockey with an unhappy wife (Pamela Reed, giving an exceptional performance); and Gus Grissom (Fred Ward, in his breakthrough role), coarse and direct, and anxious for his shot at the fastest jets.<br><br>The entire world changes when the Russians launch Sputnik, in 1957. As the American space program struggles to 'catch up', the government realizes that American men will have to go into space, and President Eisenhower wants 'educated' test pilots to fill this role. Yeager is out (he never completed college), but Cooper and Grissom, and many others, compete for spots in the New Frontier.<br><br>These pilots, from all services, are weeded down to seven men, dubbed 'Astronauts', and the Mercury Space Program is born! Along with Cooper and Grissom, the story focuses on Navy pilot Alan Shepard (Scott Glenn), laconic and prone to ethnic humor; and Marine John Glenn (perfectly cast Ed Harris), a 'boy scout' of unimpeachable morals, who loyally supports an impaired wife (sensitively portrayed by Mary Jo Deschanel). Working under the glare of the world press, the seven gradually come to respect one another, and embark on an epic adventure, full of triumph and tragedy!<br><br>Meanwhile, Chuck Yeager, snubbed by NASA, continues to test new generations of jets, pushing the 'envelope', until, in a climactic scene, he achieves the threshold of space, himself. The flight is a near disaster, resulting in a horrendous crash, but the image of the burned but undefeated pilot, walking proudly away from the wreckage, is an unforgettable image of courage, and truly defines 'The Right Stuff'!<br><br>This is a REMARKABLE film in every way, and is director Philip Kaufman's masterpiece. Lushly scored by Tom Conti (who won an Oscar for the Tchaikovsky-inspired music), the film soars, both on earth and in space!<br><br>If you believe the Age of Heroes is past, watch 'The Right Stuff', and you might change your mind! This is a film to treasure!","user":"cariart","rank":[82,95]},{"title":"an epic film with something for everyone","rating":10,"date":"20 August 2003","review":"The Right Stuff is terrific: exciting, complex, funny, crammed with memorable scenes, unforgettable lines, and wonderful actors (many of whom went on to become big stars).<br><br>A classic shot shows a test pilot on horseback coming over a ridge stopping to look at a new rocket-plane, steadying his nervous horse as it edges past the flames coming out the back. The test pilot is the twentieth century's cowboy: tough, laconic, independent, fearless.<br><br>The Right Stuff tells two parallel stories: the (often fatal) exploits of the early test pilots and Mercury astronauts, with intersecting storylines. The movie never takes itself too seriously. Witness general crawling on the floor to plug in the projector, the sounds of the locusts when the press surrounds the astronauts (Yeager called them locusts initially), the Halleluiah Chorus during the press conference, the enema scene, Sheppard needing to take a leak in the suit, Johnson trying to deal with a housewife. Yet underneath all the fun that is poked at the astronauts we see respect for real men doing a scary, important job.<br><br>This film has all the excitement of Top Gun, but is longer, better, just as high-tech exciting, and much funnier. (A washroom scene rivals Meg Ryan's famous restaurant scene...the audience laughed so hard we all missed Cooper's next line!).<br><br>And some wonderful lines: Cooper's response to \"Who's the best pilot you ever saw?\", \"O.K. You can be Gus\", \"The Military owes me\", \"Read'em and weep\", \"Hey Ridley, you got any Beemans?\", \"I go to church too.\", \"Everything is A-OK\", \"Our Germans are better than their Germans\", \"What are you two pudknockers going to have?\", and, said with regret and frustration \"test pilots!\"<br><br>To those who have seen it, here's a challenge that will enable you to appreciate the excellent writing, the workmanship and planning that went into the script. View the movie again and see how many times the screenwriter and director took the trouble to set up a later event or comment with an earlier reference. Here are three examples: Cooper dropping a tiny toy space capsule into Grissum's drink (foreshadowing), Copper reading Life magazine before the publisher enters the movie (to make sure we viewers know that Life magazine exits), Yeager bumping his elbow on a limb of a cactus tree as he walks into Pancho's at the beginning of the movie (I never noticed this the first few times I watched the movie, but surely this tiny action was deliberate.) I count a dozen more examples. Send me ones you find.<br><br>If you haven't seen The Right Stuff, I strongly recommend you rent the DVD. -RS","user":"rmsmythe","rank":[103,126]},{"title":"the film does praise Yeager (response to mrbisco)","rating":9,"date":"30 March 2003","review":"I have to correct \"mrbsico\" for not paying attention to the very things he comments on. It's not that he turned down the opportunity to apply to be an astronaut, it's that Chuck Yeager wasn't allowed to apply. When seraching for astronauts Harry Shearer's character praises Yeager as the ace of aces, but goes on to say that he \"doesn't fit the profile\" of the type of man Washington is looking for because he never went to college. This was a true pre-requisite which the Mercury Program had. Also, the scene at the end where Yeager crashes his NF-104 doesn't bring him down, it glorifies him. Gordo Cooper even comments that he gets on the cover of magazines, gets a free car, free lunches all across America, a free home with all the furnishings and loads of money and \"I ain't even been up there yet\". He's famous because he's an astronaut alone - not because of anything he's done. Kaufman cuts back and forth between the scene where Cooper is with Yeager's flight in the desert for reason. Yeager's almost alone with no media around, out in the desert attempting a record which won't put him on Life Magazine's cover. He's trying to set a record because that's what he's made of. He has The Right Stuff; which is something Cooper reazlies as we cut back to the reception and Gordo is asked by the reporters who the best pilot he ever saw was. Yeager may have crashed his plane in his last flight of the movie, but he emerges as a fearless man ever up for the challenge. And that he's not doing any of it for fame or fortune (although in real life the real Yeager cashed in with TV ads and a best-selling autobiography after both the book and the movie were released!!). That's what's rare about this movie for Hollywood to have made. Films are almost never about measuring a man's inner desires, but rather his being able to win the fight at the end. Yeager in contrast doesn't win the flight record at the film's end, but he is still the hero. This is because he dares to do what we never would. And even after his plane crashes he walks out of the gulf of fire and smoke with a severely burned face as if he will be back; you can't keep him down. This is why as the rescuer driving the ambulance as he sees Yeager's figure walking out of the fire in the distance asks, \"Is that a man?\", Jack Ridley replies, \"You're damn right it is!\". Ridley isn't merely remarking that it's a man over there, he is commenting that in our world Yeager is one of the few true \"men\". This film is not about the space program. That is merely a pretext to explore the type of men who have what it takes to volunteer for dangerous missions - even in times of peace. It's about men who have The Right Stuff - and of all those men whom we see in the movie it is Yeager who shines about all others.","user":"torreydeluca","rank":[103,126]}]