[{"title":"Good old stuff","rating":10,"date":"17 November 2006","review":"I wasn't going to post my own comment, but after reading Jibrielle's thoughts, I decided she was a bit too stringent in her opinions. This movie is definitely worth watching and worth showing to your children. Although the FX seem somewhat outdated, they're still quite amazing; besides, the combination of living actors and cartoon characters is a thrilling experience for kids. Who said that kids nowadays are only into sophisticated things? Nah... They watch with sheer pleasure movies which were made back in the 1980-s, and 1970-s. Moreover, films like \"Akademia\" can give you and your kids something else, something which the newest blockbusters lack - these films convey a sense of an inward harmony, can teach you positive thinking and making (and keeping) friends. Now talk about individual isolation in modern society, as they call it. So, all doubts aside, go for it and enjoy!","user":"KatrineM","rank":[22,26]},{"title":"Not Sophisticated","rating":10,"date":"3 August 2008","review":"\"Akademia Pana Kleksa\" Not sophisticated no no it has everything children in modern days like for example we have here a character named Alojzy Bąbel who is an android. The movie is a children story however it is actually quite good Science Fiction Still to understand it you need to watch the whole Trylogy: \"Akademia Pana Kleksa\" \"Podróże Pana Kleksa\" \"Pan Kleks w kosmosie\" Not based on a book (only a movie story) of course the original ending is the \"Tryumf Pana Kleksa\" which is however done in a different style !<br><br>Akademia is just the beginning of the adventures of Mr Kleks and introduces as more to the world are extraordinary researcher lives it is also the only movie which explains to us What is Mr Kleks real form (Cause he's not a human but just a magical object created by the legendary Chinese philosopher Paichiwo) so hows that ? This story can rival with Anime !","user":"galaxia6","rank":[5,6]},{"title":"aged","rating":6,"date":"15 September 2001","review":"I've seen this movie years ago, as a child. I loved the book and Piotr Fronczewski was always one of my favourite actors. While \"Akademia\" is not as good as the book itself, it still is a fun, family fare. Having seen short clips of the movie recently, I can see its age, and what it brings is a different demographic. Children are not going to be interested in this story anymore, it's not as sophisticated as kids would expect it to be. This is a must see only for fans of the book and the leading actor.","user":"jibrielle","rank":[7,19]}]