[{"title":"Spanish Horror at its finest","rating":8,"date":"2 July 2012","review":"The Plot = A young girl joins a French boarding school for problem girls and soon feels that something's amiss with a sinister head mistress and nasty students, and girls begin to disappear and the teaching staff keep covering it up.<br><br>Despite being over 40 years old, this movie still holds up well in my opinion and is still effective and creepy by today's standards. The directing is both skillful and artistic and the suspense is spot on, with the murder sequences played out like a stylish nightmare and kept me on the edge of my seat the entire time. Okay there is not a lot of blood and gore and this flick does rely on character development more, but that works because the cast are well acted and keeps you interested the entire way through. The killer's identity was easily figured out, but the motive when it's revealed is highly shocking and effective and will stick with for a long time afterwards.<br><br>The formats of this movie is nothing new but given the fact that this movie came out in 1969, it's pretty easy to see where a lot of these slasher movies get their inspiration and this proves that this movie is ahead of its time. The performances like I said before are excellent, Lilli Palmer who plays the head mistress simply steals to show, with a strong performance easily hold a film together single-handedly, and inject menace or compassion into a scene with a subtlety missing from many horror films of the period. Christina Galbo balances emotion and strength perfectly, as the new student.<br><br>All in this entire movie works well as a Gothic murder mystery filled with tension, a definite must see for any fans of European horror.","user":"acidburn-10","rank":[16,17]},{"title":"Exceptional, unique and ahead of its time","rating":8,"date":"5 August 2001","review":"This rather rare film from the director of \"Quien Puede Matar a un Niño\" (better known as \"Island of Death\" or \"Who could kill a child\", see also my comment on that) tells an intriguing and uncomfortable story about sinister things happening in a French boarding school around 1900. The acting is thoroughly outstanding, especially by Lilli Palmer as the head of the school, and John Moulder-Brown, her seemingly weak teenage son.<br><br>It is said that this mix of classic and modern horror that undoubtedly was years ahead of its time was Dario Argento's inspiration for his own masterly \"Suspiria\", and although the two movies are quite different in style, this seems to be undoubtedly true. The creepy atmosphere of the school, the uncanny characters of the women in charge: it's all there already, only that Argento put the whole thing into a more extreme shape.<br><br>\"La Residencia\" is probably a little bit slow moving for today's standards, but no time is wasted: The careful development of the characters make the viewer involved in all characters very soon, so one really cares about them when they reach their grisly demise. The film's atmosphere is terrific, extremely creepy throughout the picture.<br><br>And there is also the topic of oppression: Palmer's character is leading the school relentlessly; she knows no mercy for girls that are disobedient. But the oppression also works (in a far more subtle way) towards her teenage son, who has learned to obey his mother a long time ago.<br><br>One more word about inspiration: It seems to be, without a doubt, Juan Piquer Simon too was inspired by some elements of \"La Residencia\" when he made his overtly gory chainsaw-killer-film \"Pieces\" (\"Mil Gritos Tiene la Noche\" in spanish), although you can't compare the two films.<br><br>This hard to find gem is highly recommended for all true fans of the horror film.","user":"rundbauchdodo","rank":[30,39]},{"title":"A Good Older Horror-Thriller","rating":8,"date":"15 January 2016","review":"Generally speaking, the reviews on this film are in it's favor. After watching the movie I have to agree that this is a worthwhile older horror-thriller - it's good.<br><br>It's fairly easy to know whodunit and why but it's still interesting to watch how the film plays out. Knowing whodunit and why does not spoil the film.<br><br>Sexual repression, incest, murder, a sadistic boarding school owner/teacher, lesbianism, torture and mystery - this movie has all of that. It is reminiscent of the 60s/70s Hammer Horror films. If you like all that then you might enjoy this film. It's sorta a hidden gem.<br><br>8/10","user":"Rainey-Dawn","rank":[9,10]}]