[{"title":"\"You're so COOL, Brewster!\"","rating":7,"date":"18 March 2006","review":"'Fright Night' is a movie that has stuck with me for years. Recently I was able to get it on DVD and have been watching it and trying to convince my friends to watch it ever since. It has it's flaws but time has been kinder, I think, to 'Fright Night' than it has been to either 'Near Dark' or 'The Lost Boys.'<br><br>Chris Sarandon is great and charismatic in his role as the new next-door neighbor. He gives a deep performance and it seems like he's having a lot of fun in every scene. William Ragsdale isn't bad either as he tries with greater desperation and anxiety to convince people that the vampire exists and win allies to help him destroy it. My favourite performance comes from Roddy McDowall. Like Donald Pleasance later in his career, Roddy McDowell could reasonably be accused of acting in anything if there was a paycheck involved; this has damaged his reputation somewhat. I think 'Fright Night' and his performance as Peter Vincent definitely falls in the plus category rather than negative. He is great at hiding behind masks and is constantly performing for the other characters. As an actor, the part required versatility, compassion and depth. Had they been able, Peter Cushing or Vincent Price would have also played the part splendidly -- McDowell's character is of course a tribute to both these actors and I think that he was simply fantastic.<br><br>So many of the moments in 'Fright Night' compete to be my favourite but I think it comes in the final third of the film. Peter Vincent has run out of masks to hide behind and becomes a very tired, very frightened and very old man. Redemption isn't out of reach -- but he's going to have to work for it.<br><br>I mentioned earlier that 'Fright Night' has aged fairly well. There is decent gore and make-up so anyone looking for that will likely be satisfied. Music can kill films and age them more quickly than anything else. It works here where it might fail in other films.<br><br>The strength of 'Fright Night' though are it's performances and the sense of fun that it has. Definitive vampire film? No, but a lot better than many, many, many of the pretenders to that title. Rewarding, fun, and worth a look.","user":"A_Roode","rank":[33,37]},{"title":"A true classic horror vampire flick better than remake!","rating":10,"date":"8 November 2015","review":"Fright Night (1985) is an awesome true classic vampire horror film that is written and directed by Tom Holland him self. I love the remake, but I just love the original much better. In here you have monsters, a real vampires and werewolves in it. <br><br>Chris Sarandon did a wonderful job as Jerry Dandridge a vampire by night. I love the make up and I love how they were portraying a vampire in this movie. Evil Ed (Stephen Geoffreys) is a turned werewolves at the end of the film and he is staked by Peter Vincent (Roddy McDowall). <br><br>Fright Night (1985) is one of my favorite vampire horror flicks, I love vampire movies and this film is for me. The remake is a good film, but they aren't portraying real monsters and werewolves like they do in this movie. I am pretty sure if the new movie would portrayed such a monsters, werewolves like in here, I am pretty sure the movie would be better! The end was perfect and awesome how Charley and Peter are fighting Jerry, I love how Vincent and Charley are smashing in all the basement windows, allowing the sunlight to hit Dandridge. Using a mirror, they reflect the sunlight and finally manage to kill Dandridge by blasting him with the rays and he bursts into flames and within seconds his body is reduced to dust and bones. That scene was awesome!<br><br>I love Roddy McDowall as Peter Vincent the great Vampire Killer! Seriously this movie kick ass! Roddy McDowall kicks ass in this slasher vampire film! I love everything about this film, that it is in it! My all time favorite vampire movie ever, a classic, the remake doesn't even come close to matching it. Chris Sarandon was perfect as Jerry Dandridge the next door neighbor vampire, nothing will ever change my mind about this one, no vampire movie since this one has ever matched it, movie or series!! Fright Night is a ultimate classic a classic film that I will always cherish it to death! The special effects are great in this one. This film not only has vampires, werewolves and monsters in it, it also has a virgins, it has Roddy Mcdowell in one of his best performances. It has Prince Humperdink/Jack Skelenton as the baddie. It is quotable, self-aware way before Joss Whedon/Kevin Williamson, and funny as hell. The weakest link, although she still gives a very good performance, is Amanda Bearse AKA Marcy Darcy from Married with Children as the sexpot (could be bonus if you are so inclined), object of desire. It's hard not to look nor listen to her, without waiting for an Al Bundy insult, but there is some consolation when she \"turns\". Watch it and love it, this is what comedy-horror is all about. <br><br>This is a great movie. I wouldn't say it scared me to death but it's good and creepy, it's one of those movies you can watch over and over again. GREAT FILM! Our heroes are a motley group of characters, the straight-laced boy next door who no one believes, the bookish girl crush who is coveted by all, the monster-fan geek, and a most wonderful touch with Roddy McDowall playing a washed-up horror actor similar to character actors such as Peter Cushing/Christopher Lee/Vincent Price. Bottom of line I love this film, it is one of my favorite Vampire horror slasher films, I also love the remake, tough it even can't hold a candle to this film. <br><br>Meet Jerry Dandridge. He's sweet, sexy, and he likes to sleep in late. You might think he's the perfect neighbor. But before inviting Jerry in for a nightcap, there's just one thing you should know. Jerry prefers his drinks warm, red and straight from the jugular! It's Fright Night, a horrific howl starring Chris Sarandon as the seductive vampire and William Ragsdale as the frantic teenager struggling to keep Jerry's deadly fangs out of his neck. Only 17-year-old Charley Brewster (Ragsdale) knows Jerry's bloodcurdling secret. When Charley can't get anybody to believe him, he turns to TV horror host Peter Vincent (Roddy McDowall), who used to be the \"Great Vampire Killer\" of the movies. Can these mortals save Charley and his sweetheart Amy (Amanda Bearse) from the wrathful bloodsucker's toothy embrace? If you love being scared, Fright Night...will give you the nightmare of your life. That is the main plot in the remake they don't even mentioned Jerry's last Surname. <br><br>Fright Night is a 1985 American horror film written and directed by Tom Holland and produced by Herb Jaffe. It stars William Ragsdale, Chris Sarandon, Roddy McDowall, and Amanda Bearse. <br><br>I love this film to death! It is my favorite best horror slasher film, the rating I am giving tot his film is 10/10. This film deserves it! Tom Holland thank you for so beautiful wonderful horror vampire film, big cheers and thank you!","user":"ivo-cobra8","rank":[46,53]},{"title":"There's something about FRIGHT NIGHT that everybody seems to love.","rating":8,"date":"23 August 2004","review":"Is it the 80's cheesiness (fashion, clichés, music)? It's impressive F/X? The story? Who knows. Time made justice to \"Fright Night\", one of the best vampire movies ever and probably the best of the 80's. When it came out in 1985 the Slasher genre was on it's highest peak and as Peter Vincent said to Charlie, \"his generation prefers movies where a masked looney kills virgin innocents\" (or something like that). When nobody cared about Vampires \"Fright Night\" came out with a tremendous potential on it's story, actors, and make up; the basic elements that a Slasher movie needs. The result is an entertaining, chilling, and very well done horror movie better than expected.<br><br>*SPOILERS* Charlie Brewster an average boy finds out that his neighbor is a vampire. He has doubts until Jerry Dandridge his vampire neighbor appears on his bedroom and threatens him to death. Nobody believes Charlie and after a series of events not only his life is in danger but also his girlfriend's. Charlie finds in Peter Vincent, t.v.'s popular \"Vampire Killer\" character his only hope to save his girlfriend. In order to accomplish what he wants, Charlie and Peter Vincent will face the deadly Jerry Dandridge, his guardian Billy Cole, and their attacks.<br><br>ACTING. You can't go wrong when a great actor like Mr. Chris Sarandon carries the entire movie on his back with his performance. His character, Jerry Dandridge completely steals the show. Sarandon made the character. Roddy McDowall as Peter Vincent is a pleasure to watch. His character has an admirable quick evolution in the movie. First he's the vampire killer t.v. character that after meeting a REAL vampire knows what fear is like. Then after dealing with fear, he recovers faith and that makes him stronger in every aspect. William Ragsdale is good as Charlie Brewster, the teen main character in the movie. The boy that discovers that his neighbor is a real vampire but nobody believes him. Good character. Special mention to Stephen Geoffreys as Evil Ed for being one of the weirdest but likable characters ever to appear in a horror movie. His performance is truly evil and humorist. A nice touch. Amanda Bearse (from Married with Children fame) is also a good addition to the cast, she delivers an o.k. performance. Jonathan Stark as Billie Cole, Jerry's guardian, delivers a solid performance. This is one of the best casts that you can get from an 80's horror movie.<br><br>DIRECTION. The 80's craziness was never this creepy. Tom Holland makes a terrific job this time. This man is behind key horror movies from the 80's like \"Child's Play\" and the surprisingly good \"Psycho II\" among others. His camera work in \"Fright Night\" is great. He knew how to combine perfectly the 80's feeling (something that nobody has ever described for it's madness) with the Vampire movies basic rules.<br><br>The idea of watching a Vampire movie from the 80's could make you think the worst but luckily it's a great idea. Excellent job Mr. Holland.<br><br>F/X/SCORE/CINEMATOGRAPHY. The f/x and make-up are very ahead of it's time. You can't get better gore effects! The scene of Evil Ed's death (when he's a werewolf) is amazing. On it's time I'm sure that it shocked more than once. Also, Billy Cole's death and the ending are great scenes that will please the horror audience's eyes. Great use of gore and f/x. Enough said. The score is great. The 80's pop metal and club music fits perfect with the feeling of the movie. The club scene is something you haven't seen. In the tense and thrilling scenes the music works perfect. The cinematography is pretty good. The use of lightning on dark settings is very good. Watch the DVD version for a different experience. I love the lines from the movie. I can assure that \"Fright Night\" is something you haven't seen. Don't get fooled by the 80's big hair, laughable fashion, and clichés. The movie stands alone. Be prepared for a real FRIGHT NIGHT!","user":"insomniac_rod","rank":[70,84]}]