[{"title":"Must see movie","rating":10,"date":"16 October 2006","review":"\"A Raisin in the Sun\" is one of the finest American films ever made. This film discusses many vital issues, such as racism, abortion, trust, family values, greed, and even atheism.<br><br>My favorite character in this film is matriarch Lena Younger, impeccably performed by Claudia McNeil. Mrs. Younger is a wise, loving mother and grandmother to her family. While she may not always agree with her children's decisions, she never stops loving them.<br><br>Sidney Poitier is brilliant as the defeated Walter Lee Younger. Walter is frustrated with his job as a chauffeur, and believes he has more to offer the world.<br><br>Ruby Dee is great as Walter's supportive and level headed wife.<br><br>The dialogue and issues that are discussed reinstate the values upon which America was built. I strongly recommend this excellent film.","user":"thowen1988","rank":[48,55]},{"title":"An Underrated American Classic","rating":9,"date":"21 February 2002","review":"Some stories leave you shattered. They speak to you on such a level and you identify with such intensity that by the end of the film, your nerves and emotion are raw.<br><br>Is Raisin in the Sun a play about racial prejudice? Yes indeed, an important one too. No story illustrates the ignorance of 'restricted neighborhoods' better. No film offers the ugliness of white arrogance and presumption, something that still lives and breathes in this country.<br><br>For me personally, this is also a movie about being a man.<br><br>This movie illustrates so well how men are composed. We honor the father, love the mother and protect the traditions that raised you. Mixed in with all of that and no less important, are our dreams and aspirations.<br><br>This movie teaches us, with immense power and clarity, that to be a man, to be a real man, you must never sell out your pride. Never. No matter how badly your dreams have been shattered, your pride and your manhood belong to no one. Simple, basic redemption lies within that truth.<br><br>It's an important lesson, a deep lesson, that men of today (including myself) need to remind themselves of from time to time. There is a pride within all men. It can be stubborn, it can be arrogant and it can be so full of dreams that it can lead to bitter heartbreak. But it is there, burning in all men and it's our most treasured asset. <br><br>I can't think of a contemporary play that illustrates more strongly, the struggle and rites of manhood in American culture today. How ironic and perhaps appropriate that the film is written by a woman. It is after all the women in this film who patiently wait for Walter to find himself. The love, faith and patience of the women in this film, illustrate the grace, power and importance women have in all our lives, regardless of our gender. A Raisin in the Sun, is a marvelous film and brilliant play. It is, from my perspective, an American classic and I believe one of the most underrated American plays of all time. I recommend it to any man that is struggling to find themselves or trying to recapture what is real and what is untouchable within our souls and within our dreams.","user":"snazel","rank":[59,69]},{"title":"The Greatest Story Ever Told","rating":1,"date":"1 January 2004","review":"This is the embodiment of the Mr. Langston Hughes poem that obviously inspired Ms. Lorraine Hansberry to write this wonderful piece.  What indeed DOES happen to a dream deferred?  Each of the adult main characters has a dream about what should be done with the $10,000 insurance policy paid after the Younger patriarch's death, and each person's dream is challenged.  I most identify with the character of Beneatha, the doctor-to-be in a time when few women, and even fewer Black women, could achieve this dream. This is a story of dreams, of family, of strength, of sacrifice, of mistakes and of recovery from the consequences of those mistakes.  Whenever I need a dose of inspiration, when things in my own life seem too difficult to conquer, I watch A Raisin in the Sun and feel strong again.  The acting in this film is so incredibly moving that there are parts (and I won't give them away) that are so disheartening and sad that they still move me to tears, after all these years and after all the times I have watched it.  It is truly the greatest story ever told.","user":"nsantiago_md","rank":[23,27]}]