[{"title":"An average outing for the King of the Cowboys .....","rating":5,"date":"6 June 2006","review":"Roy Rogers and Trigger (The Smartest Horse in the Movies) are at it again, helping a border Sheriff get to the bottom of some stolen rifles that are being sought. Rogers ends up in hot water, but is able to solve the crime through his normal cool determination. Gordon Jones is along as his sidekick, but he was never as solid as Gabby Hayes or Pat Brady had been ........<br><br>The music was well done by Roy, with support from Foy and the Riders of the Purple Sage. However, the script and supporting cast are not up to the earlier high standards for Roy's films. It's good entertainment for Roy's legion of fans, but compared to his other classics, this oater is only so-so ..... Fun, but not memorable.","user":"revdrcac","rank":[7,9]},{"title":"Gunrunning on the Pacific coast","rating":5,"date":"10 January 2014","review":"Herbert J. Yates splurged for color in this Roy Rogers western where he and Gordon Jones, former deputy sheriffs to Will Wright, are helping out their old boss. The populace of Wright's town is up in arms at his inability to stop train hijackings. The worst part is that there seems to be no rhyme or reason for them.<br><br>As Roy investigates it'a a very sophisticated ring of gunrunners that's settled in this Pacific coast town and they have contacts in a lot of places. And Roy's not the only one investigating the gunrunning either.<br><br>Romance is provided by Penny Edwards who was one of a few women substituting for Dale Evans as Roy's leading lady while she taking care of their child. And together with Gordon Jones playing the dumber than a post Splinters is Estelita Rodriguez giving out her comic style with a Hispanic touch. She did a number of Roy Rogers westerns but she's best known for playing in Rio Bravo as Pedro Gonzalez Gonzalez's wife.<br><br>Not the best of his westerns, it's a bit overplotted for a B western, but Roy's fans will be pleased.","user":"bkoganbing","rank":[4,5]},{"title":"Fully restored!","rating":7,"date":"13 July 2018","review":"The big news here is that Kino-Lorber has fully restored two late Roy Rogers flicks -- this one and \"Trigger Jr.\". The latter is the better of the pair, but one thing is clear: when they can find all the elements of a RR film, they're better than I actually remember them being. Unfortunately, the sliced well over fifteen minutes from most RR movies to run them in an hour slot on television in the 1950s. Much footage simply disappeared. A few have been saved, and these two color efforts (TruColor) have been restored to their actual original run times, and the quality of the print is very good (on this one), and excellent on \"Trigger Jr/\". <br><br>The plot here is a little confusing. Some gun runners are sabotaging trains to run their guns...but we never learn who they're running the guns to. This was filmed near Santa Clarita, California...which is also confusing, because they don't tell us how close they are to the ocean until midway through the film and suddenly there's Roy about to be dumped in the ocean. Oh well. There are better RR films, but at least this one is whole and nicely restored (there is some graininess, but this superior than any previous releases of old RR films).<br><br>And yay! No Dale Evans (I only say that because as a kid when Dale would sing her song...that's when I'd head for the kitchen and a snack). Here, Roy is supported by Estelita Rodriguez (who was the Mexican wife in Dean Martin's \"Rio Bravo\"), Penny Edwards (who?), and Gordon Jones (who is a pleasant enough sidekick, but he's no Gabby Hayes or Pat Brady). But the real treat here is the casting of Will Right as the sheriff. Wright is a veteran character actor whom you'll recognize right away. <br><br>The film is available of Blu Ray or regular DVD.","user":"vincentlynch-moonoi","rank":[1,1]}]