[{"title":"Simple but slick stunt-man flick.","rating":6,"date":"27 July 2006","review":"Following the success of the 1977 film \"Smokey And The Bandit\" Burt Reynolds was, for a short time at any rate, the world's no.1 box-office star. Alas, like so many actors who get to the top Burt soon found himself losing his mantle as he stumbled from one lousy picture to another. Part of the problem was that Reynolds formed a long-running partnership with stuntman-turned-director Hal Needham, a union that yielded too many bad movies. In total, the two men worked together six times. A chronological list of their films together would run like this: \"Smokey And The Bandit\", \"Hooper\", \"Smokey And The Bandit II\", \"The Cannonball Run\", \"Cannonball Run II\", and \"Stroker Ace\". Of this sequence, only the first two are really worthy of praise. The others are generally rather poor movies which met with considerable negativity from the critics and did little to enhance the star's popularity with the public. \"Hooper\" was released in 1978 and, as noted, was the second of the Reynolds-Needham collaborations. It is a simple but very slick story set in the world of testosterone-fuelled Hollywood stuntmen, and is perhaps the best of Reynolds' late '70s/early '80s films.<br><br>Sonny Hooper (Burt Reynolds) is a middle-aged Hollywood stuntman. He leads a freewheeling lifestyle with his girlfriend Gwen (Sally Field) and her father Jocko (Brian Keith), who was himself once a leading stuntman and is something of a father figure for Sonny. Sonny begins to feel the heat when a young new stuntman named Ski (Jan Michael Vincent) appears on the scene and threatens to take his mantle as the bravest performer in the business. Believing that he has never proved his greatness - neither to himself, his girlfriend, his companions nor the younger generation of the profession  Sonny decides to pull off one final stunt so dangerous and outrageous that it will cement his place in legend. Film-maker Roger Deal (Robert Klein) offers Sonny just the stunt he is looking for. Deal is busy making a James Bond style adventure movie and needs two fearless drivers to perform a record-breaking 325 feet leap across a collapsed bridge in a jet-fuelled sports car. Sonny and Ski agree to do the jump, even though everyone close to them urges them to turn it down as the odds of performing it successfully seem almost impossible.<br><br>\"Hooper\" is admittedly a light film with a story that demands little of the viewer, but on its own terms it is an enjoyable and involving film. The performances are surprisingly strong and nuanced for a film set in the world of macho stunt performers. Reynolds appears brash on the surface but elicits genuine humanity in the scenes where he torments himself over the daredevil legacy he wants to leave behind. Field is superb as his terrified girlfriend; Vincent shows gung-ho spirit as the youthful pretender; Keith is wonderful as the old-timer who has lived long enough in the business to appreciate the value of survival; and Klein gives the best performance in the entire film as the single-minded director willing to risk the lives of his stunt team in order to shoot the greatest action sequence ever filmed. The film is punctuated with several impressive action sequences, and climaxes with the jet car leap around which the story is based. This closing sequence is brilliantly put together  with real suspense generated about whether the drivers will or will not survive their attempt. As brash, brainless and brawny as it is, \"Hooper\" is still a tremendously enjoyable film. Fans of fast cars and sensational stunts will revel in it!","user":"barnabyrudge","rank":[19,19]},{"title":"Burt at the top of his game","rating":7,"date":"3 August 2004","review":"\"Hooper\" is yet another example of Burt Reynolds at the top of his game. Burt was a superstar who enjoyed making these action comedies for the summer drive-in crowd. The films usually made bundles of money and were usually pretty enjoyable. \"Hooper\" is one of Burt's better comedies of the 70's. He plays the title character, an aging Hollywood stuntman looking to make that last great stunt for the money and retire before his body gives out on him and serious damage occurs. Sally Field yet again plays Burt's girlfriend and, yet again, isn't given a whole lot to do. Jan Michael Vincent plays the new, young, hot shot stuntman that worries Burt. Brian Keith has a nice turn as Sally's father who happens to be a veteran stuntman himself.<br><br>The characters are not the important thing though. You go to see \"Hooper\" to laugh and enjoy the action scenes. The filmmakers deliver the goods on both counts. One standout scene involves a bar fight involving such tough guys as Terry Bradshaw. Burt confronts Terry one on one and it's the comic highlight of the film. The stunts are sensational and the final stunt is, thematically, totally ridiculous. But it's so well filmed we forgive the obvious silliness.<br><br>\"Hooper\" is a fun film to watch but make sure to see it uncut. It seems that many of Burt's PG-rated movies of the 70's stretched the limits to get as close to the R-rating as possible without going over the line. \"Hooper\" is no exception.","user":"jrs-8","rank":[18,18]},{"title":"Just an excuse for lots of great stunts","rating":7,"date":"21 September 2018","review":"Not much of a story but just enough to get by. Lots of stunts including a spectacular ending sequence that delivers enough to make this an enjoyable love letter to stunt men and a solid Burt pic.","user":"jellopuke","rank":[5,5]}]