[{"title":"Probably the greatest movie of an opera ever","rating":9,"date":"31 July 2002","review":"I first saw this movie when I was in my teens, and it was the first opera experience I truly loved. Since I now work in opera, that was ultimately a very important event in my life! Bergman manages to achieve the impossible--a perfect synthesis of drama and music, the visual and the aural. (Years ago someone told me he thought that opera--the art that combines drama with music--ended up by denigrating both forms, and I don't completely disagree with that.) But in this almost magical movie, all of the flaws inherent in the piece (and there are many--poor dramatic structure, confusing story line, nonsensical plot elements) are ironed out, or somehow don't matter. Visually, it's sumptuous, thanks to Sven Nykvist's usual gorgeous cinematography, and aurally it's quite pleasing, despite some pretty mediocre singing--but thanks to Bergman's genius, that doesn't matter, either. Because of his careful work with the singing actors, every intention and dramatic impulse is realized, all motivations are clear--something you never see on an opera stage. Of course, much of it is impossible on an opera stage.....Bergman can use close-ups where opera can't. And a little ways into the opera, one realizes that gradually, imperceptibly, the stage has \"opened out\", and we're on sets and in places that would never be possible in a theater. He makes it all work, seamlessly.<br><br>In a way, the beautiful 18th-century Drottningholm Court Theater is a secondary star--one can't imagine a more perfect place for this opera to be performed. But the real star (among the singer/actors, at least) is Håkan Hagegård. There is no more beautiful and charming (both physically and vocally) Papageno imaginable--he became an international opera star a few years later. He more than compensates for all the other weak vocal links in the cast.<br><br>You'll never see a better \"Magic Flute\" than this.","user":"timon88","rank":[38,41]},{"title":"A theatrical experience made cinematic","rating":8,"date":"10 February 2003","review":"Adapting theater to the screen is not easy. It is difficult enough to film a play; staying too close to the text can render the tone too \"stagy,\" while \"opening up\" the story can cause it to lose its authentic feel. Filming opera is twice as problematic- there is so much that is rooted to the stage and simply cannot be pulled away. How is it possible to film something that has been performed in such a specific, disciplined way for hundreds of years and keep all the elements fully intact? The answer has been provided by Ingmar Bergman, a man known to most of the world for harrowing films which peer unsentimentally into the depths of the human soul. With \"The Magic Flute,\" Bergman takes another great talent of his- theater direction- and combines it with his cinematic abilities to create an elaborate fantasy that even his detractors can enjoy.<br><br>Rather than just treating Mozart's opera as a story to be filmed, Bergman relies on familiar themes within the narrative to strike a balance between the stage and the screen while keeping the audience involved throughout. This is not to say that the story is simplified or made abundantly clear to any half-attentive viewer; the surprising accessibility of the film comes not from any reconstruction of the story but rather from an emphasis on elements that today's audience can easily recognize: sacrifices that are made for love, rebellion against the amoral nature of one's community, and magical occurrences that pop up just in time to save the hero, to name a few. Although the opera itself unfolds on a stage, with frequent reaction shots of the audience, Bergman's direction keeps us so deeply involved that tone is distinctly that of a film. Indeed, `The Magic Flute' proves to be a very cinematic opera, and there are moments when the imagery, theatrical as it is, becomes so overwhelming that Bergman has to cut to the audience to remind us that we are in a theater.<br><br>`The Magic Flute' is evidence that the `epic' existed long before movies, and that much of what we enjoy viewing today owes its style to stories that have been told through vastly different mediums for centuries on end.","user":"Oblomov_81","rank":[21,22]},{"title":"It's Sweden!","rating":10,"date":"24 February 1999","review":"An excellent movie, one of my all-time favorites.  I watch it more often than I listen to \"Die Zauberflote\" on CD.<br><br>Bergman changes the story slightly and shuffles some of the musical pieces around, but the result makes better sense than the original.  Pamina's struggle is presented as a custody battle between Mother and Father.  The depression of wintertime in the far north is brought out clearly in the attempted-suicide scene.  And all the knicknacks and props lying around...are pure Sweden!  I didn't realize that until I visited Gothenburg last fall.<br><br>Bergman's comical, warm and cozy images really fit the music.  Not that \"The Magic Flute\" from Mozart needs much improving...after all, 9 out of 10 German composers agree that it is the \"perfect\" German Opera.  But Bergman's images go with it so well I consider it the perfect staging of the opera.","user":"Tom-267","rank":[20,21]}]