[{"title":"Captures perfectly youthful feelings of loneliness and isolation","rating":8,"date":"10 December 2006","review":"I watched this TV movie in January 1979 on television in England one weekday afternoon when I was off school. I was 15 years old and having a miserable time in my life. Bad Ronald captured perfectly my feelings of loneliness, isolation, being trapped and retreating into myself. You can imagine that I identified closely with Ronald's experience and the film made a lasting impression on me as it seems to have done on others. A couple of years ago I did manage to get hold of it on video and saw for the first time in a quarter of a century. Happily I can watch it now with much greater detachment. The director Buzz Kulik is better known, I believe, for Brian's Song but Bad Ronald deserves to be remembered too.","user":"Ollyda","rank":[25,25]},{"title":"memorable","rating":13,"date":"13 November 2002","review":"I was eleven or younger when I watched his film.  I had sat up late watching t.v. with my father (sometimes we would do that until it went off the air--remember those days?).  He fell asleep and I ended up watching Bad Ronald, the last thing on that night, all alone.<br><br>All I know is, I couldn't stop watching until the end, and I have never forgotten this movie.  It scared me so much that I was afraid to get up and turn the t.v. off when it was over, and I still have a surprisingly clear recall of the film more than twenty years later.  Surely this says something about the power of the idea, if nothing else.<br><br>Ronald's fantasy world was a big stand-out to me, as was the horror of his position, unexpectedly deserted by the only person who loved him.","user":"lesliesho","rank":[44,46]},{"title":"Another decent 70's made for TV film.","rating":20,"date":"20 September 1999","review":"Another one of the made for TV films that appeared on the ABC Movies of the Week. Perhaps by today's standards it does not have the impact that it did when it came out in 74. However for a made for TV movie the story is intriguing and a level of suspense exists which keeps the viewer interested in finding out what will happen next.  Most of the 70's made for TV films consisted of original unique stories with good acting and were all presented in a 90-minute format.  All in all they including this one still seem head and shoulders above the made for TV movies of the 90's.","user":"yenlo","rank":[16,16]}]