[{"title":"oh so cool","rating":8,"date":"9 November 2003","review":"Overall the film is not an 8 but the cool parts just won't allow me to give it a lower score.When it was first released I was in junior high school and there existed a non-conformist society within a society.These non-conformists wore long dark coats(trench coats ?) and small brimmed dress hats.My older brother used this kind of dress,I thought it looked so cool.The best I could do was a hand-me-down off white coat that had been balled up in the closet.My big head size ruled out using a hat,instead of looking like a teenage gangster I probably resembled a juvenile Colombo.In the film the gang called the Horsemen dress in the coat and hat style,I really could relate to this cool look.Real gang members are used for some parts of the movie.The viewer sees a style of dress that really existed at the time,for me it's history preserved.The slang and look of the young people are what I like about this movie.Among them are Zorro,Pretty Boy,Gargantua and Batman.The outstanding one and for me the scene stealer of the movie is Arthur Reardon one of the accused murders played by John Chandler.Although only involved in violence twice in the movie he goes about it gleefully as it escalates.A complex person he grins telling how he wanted to live on a farm but his parents put him out on the streets to play with bad boys.Most of the time he is sneering giving indication many things in the world annoy him.His character would have no trouble fitting into a current movie. Soundtrack is very good and in one scene sets the viewer up for seeing Diavolo for the first time.The back of his jacket is something else,be ready for it they only show it for a second. The big finale court trial is unbelievable,a fairytale.About the most realistic scene involving Burt Lancaster is when he is at home talking to his wife and reflects on changing his name from Bellini to Bell.Probably especially after one of the Italian gang members yells..What's the matter you ashamed of being a W--?.This is not a Burt Lancaster movie/story,changes were made to fit his image.When asked by a gang member..Do you know why I stomped him? Lancaster gives the correct answer to show his so called tough up bringing.In the book Lancaster's character can't give the answer and is more meek.The character in the movie still has to take a backseat to the young persons maybe all the way to the trunk.Look for the emphasis on poverty,one gang leader lives in a crowded apartment with people laying around. It looks like a combination flop house/sweat shop where sleeping is done in shifts.My favorite touch is a rooster pecking around on the stairwell INSIDE the apartment building(a housebroken slum rooster?)","user":"non_sportcardandy","rank":[26,29]},{"title":"Burt Goes Home","rating":6,"date":"13 August 2008","review":"For The Young Savages Burt Lancaster went back to his roots. The actor was born and raised in the East Harlem section of Manhattan. At that time it had not become a Latino neighborhood, it was predominantly Italian where he grew up. To this day there are still a few Italian families in the area in and around Pleasant Avenue and neighboring streets. His had to be the only WASP family in the area at the time.<br><br>In 1961 just as you see in West Side Story the neighborhood was divided with racial and ethnic tensions. But these kids don't sing and dance between rumbles. They are a hard bitten bunch of punks on both sides.<br><br>In fact that's where our story begins as three Italian kids leave their turf and go and stab a blind Hispanic youth. It's a crime that shocks the city. Ambitious District Attorney Edward Andrews sees this as a case when successfully prosecuted could make him governor. He relies on one of his best men, ADA Burt Lancaster to bring home a victory and a trip to old Sparky as they called the electric chair in Sing Sing.<br><br>Of course there's a lot more to the case than meets the eye both in the crime and in Lancaster's conflicted loyalties. He's happily married to pretty Dina Merrill from the suburbs. She's what you call a limousine liberal, one who's ideas are shaped by books instead of living the poverty she's studied in school about. <br><br>I've met many like that and it really is true many conservatives are liberals who've been mugged. When one of the gangs gives her a bad experience, she sings a different tune.<br><br>But where The Young Savages falls apart for me is the fact that Lancaster was once involved with Shelley Winters, the mother of one of the three defendants. I'm sorry, but right then and there Lancaster in real life would have recused himself from this case. Of course Winters appeals to him for old time's sake and Lancaster starts doing his own investigation and prods the police to do more on their end. <br><br>In the film also Lancaster is from that neighborhood. His character's family name of Bell was once Bellini. Many families with ethnic names of all types anglicized them or had them anglicized by immigration officials. <br><br>The film which according to a recent biography of Burt Lancaster was shot in 35 days on location in New York City. It was a project Lancaster did while waiting to do Birdman of Alcatraz. The Young Savages is notable for being Telly Savalas's big screen debut and for Lancaster using TV director John Frankenheimer on his first big assignment. Purportedly Lancaster was pretty rough on Frankenheimer, but in the end he impressed the star so that he did four more films with him including Birdman of Alcatraz. And Telly Savalas was in that one too.<br><br>Though the film is based on one horribly bad premise, the acting and directing are not bad. I had the same criticism of 12 Angry Men in which another young talented director, Sidney Lumet got his first break. The Young Savages remains a graphic look at a seamier side of New York City during the Kennedy years.","user":"bkoganbing","rank":[23,27]},{"title":"I was secretly glad that my name was Bell instead of Ballini","rating":6,"date":"9 August 2005","review":"***SPOILERS*** 1961 motion picture loosely based on the notorious August 30,1959 Salvador Agron \"Capeman killings\" in New York City's Hells Kitchen. The movie has the racial backgrounds of victim and killer reversed which made the film a bit disingenuous to the movie going public back then in 1961, just two years after that terrible event. The killer Salvador Agron was Hispanic and his two teenage victims, Anthony Krezsinski and Robert Young, were white. <br><br>Three members of the white Manhattan street gang The Thunderbirds cross into Spanish Harlem on the turf of the local Puerto Rican gang The Horsemen and zero in on young and sensitive harmonica playing Roberto Escalante, Jose Perez,knifing him to death. Caught minutes after the killing are the three gang members Reardon Di Pace &amp; Aposto, John David Chandler Stanley Kristien &amp; Neil Nephew. <br><br>With the city D.A Daniel Cole, Edward Andrews, wanting a first degree murder conviction of the three teenage assailants, to give him a boost in the upcoming gubernatorial elections, he put's his best prosecutor on the case Asst. D.A Hank Bell, Burt Lancaster. With the three defendants claiming that they killed Roberto in self-defense their excuse falls apart like a house of cards when it's shown that he was totally blind and a threat to no one, much less themselves. It now starts to look like D.A Cole would get the first degree murder conviction that can send the three youths, all under 18, to the electric chair. <br><br>Bell who at first had no idea who the three defendants were soon realized that one of the accused killers, Danny Di Pace, is the son of a woman Mrs. Mary Di Pace ,Shelly Winters,that he was in love with years before he got married to his present wife Karin, Dina Merrill. This made prosecuting Danny very difficult and painful for him.<br><br>Slowly getting all the evidence in order and at the same time being attacked,far worse the his wife was earlier in the film, by gang members for doing his job Asst. D.A Bell finally gets to the bottom of the case. Bell finds out the real reason for Roberto's killing and it totally throws him off to what he's supposed to do in the case; get a verdict that would strap the three into the electric chair, regardless of their guilt or innocence, in order to further his boss' D.A Cole political career. <br><br>A bit ahead of it's time \"The Young Savages\" goes into the mental mindset of the three accused killers of blind Roberto Escalante and comes up with some startling conclusions; all three were not in full control of themselves or in what they did so a first degree murder conviction was unable to be reached by the jury. Not that they got off Scot-free for their actions and Roborto himself was anything but the innocent bystander that he was made out to be by his friends family and the liberal newspapers.<br><br>A cowardly bully with a deep inferiority complex who was the leader of the pack Arthur Reardon is given 20 to life. A mentally retarded and delusional Anthony \"Batman\" Aposto, who thinks that he's the Batman of comic book fame, ends up in an institution for the criminally insane until he's seen fit, by a battery of psychiatrists, to again become a member of society. It was Danny Di Pace who got off from getting heavy jail time, Danny got a year in Juvenile Hall, for just wanting to be a member of a street gang to have the family that he never knew but that involvement lead to Roberto Escalante losing his life.<br><br>Hank Bell threw away whatever future he had in the New York State D.A's office by looking at the facts and perusing Justice instead of letting the three gang member fry for the sake of his, and D.A Cole's, future in state or national politics.","user":"sol1218","rank":[22,26]}]