[{"title":"An interesting first of a pair that shows us Bergman's political side","rating":7,"date":"22 November 2019","review":"Ingmar Bergman moved to the small island of Faro in the early sixties with Liv Ullman and their baby. He stayed a resident of the island for the rest of his life, filming some of his most iconic films there. In the pair of documentaries that Bergman made about his adopted home, it becomes obvious what drew Bergman to the place. They're both filled with affection for the people who have called the island home for generations and sadness around the state of the next generation.<br><br>Faro Document, the first of the two, is the more overtly political of the pair. Bergman set out to make a series of short films about live on the island, and he ended up focusing on the people and their problems, especially those around trade with the larger neighbor island and the mainland. Farmers have no recourse but to take whatever markets will give them because they don't have the ability to send their goods anywhere else. The youth were all clamoring to leave because they called the island boring with no job prospects. The young couple highlighted needs to worry about what to do with their new baby if the mother decides to go back to work since there are no child care services on the island. It's a moving portrait of rural and isolated life that Bergman ends by pleaded with the Swedish government to spend more money on the island.<br><br>Faro Document 1979 is the better of the two because it takes a less political approach and comes to the residents of the island for a more purely humanist lens. We see glimpses of some of the interviewed citizens (the children begging to leave get a few seconds each to talk about how they either stayed or left), and a farmer woman gets extended time to talk in both, but 1979 takes a more expansive view of life on the island. In particular, it brings in summer, which the first film avoided, to showcase the influx of tourists that acts as a direct contrast to the locals. The locals tend to be older, craggier, and in the fields of the small island while the locals are younger and spend almost all of their time on the beaches. We hear stories of a local who lost his house in a fire, partially because there is no local fire department and the fire truck from the larger island had to wait for the ferry. We see an old man make his meal of fish and potatoes alone in his house. We see a group of men slaughter a pig and clean it (an interesting addendum to a similar scene in the first with a sheep). We see a community come together to thatch the roof of a barn.<br><br>The first movie is a political work, designed to beg for funds, but the second is more of a slice of life. It shows what the cycles of the year are like on Bergman's adopted home, and it seems like a wonderful place to call home. I have to imagine, though, that the films actually helped increase tourism to the island, which seems like something Bergman didn't want. Maybe that's why he never made Faro Document 1989.","user":"davidmvining","rank":[0,0]}]