[{"title":"William Marshall lifted this film...","rating":7,"date":"25 September 2004","review":"...from the standards of Blaxploitation movies of the time. The movie itself is more comical than scary (which is why I love it), but William Marshall brought a sense of dignity to his role of Mamawalde. In fact, it was his idea to change the main character from a jive-talking Black vampire to a tormented former king with a rich and tragic past. In the end, you actually feel sorry for him. This is an underrated film that is much better than it's avertizements would suggest. Though it may not be the best vampire/horror flick in the world, and it takes liberty with historical facts (a slave trade in Transylvania?!) it does contain a rather touching love story. With that being said, I have to admit that this movie also contains some of the most hilarious dialogue I've heard in a monster movie. <br><br>\"Hey, man, that's a baaad cape!\"<br><br>\"A bat! A BAT! A GIANT BAAAT!!\"<br><br>\"Hey, where's that big dude with the cape?......AAAAH!\"<br><br>\"Suddeny I find your Congnac to be as...distasteful as your manner!\"<br><br>And a load of others that, for censorship reasons, I probably cannot repeat here. <br><br>I recommend this movie to anyone who wants to have a spooky, retro good time.","user":"Look_The_Other_Way","rank":[41,46]},{"title":"Pure Marketing Genius","rating":10,"date":"30 December 2002","review":"At the time of Blacula's release, studios such as American International and Hammer were pumping out  cheap horror flicks for an ever-thirsting legion of young fans (myself included).  At the same time, blaxploitation films were also making big bank . . . so why not combine the two genres?  It was pure marketing genius, backed by some of the biggest box office of 1972.  The great Shakespearean actor William Marshall (Dr. Daystrom to you original Star Trek fans) plays the tormented African prince magnificently; asleep for 200 years, he awakes to find an African-American culture riddled with blaxploitation cliches.  It's bad enough such a dignified man has the hunger -- he also has to deal with these people in giant heels and 'fros.  The juxtaposition works as a statement about what slavery did to African culture, but is never overtly mentioned. . .after all, this is a horror flick too! Extra points for a musical appearance by The Hughes Corporation (before their big hit, \"Rock the Boat\") and a fine supporting performance by Denise Nicholas, a wonderful actress who should have had a bigger career.  More silly than scary, Blacula endures as a unique film and pop-culture time capsule worth seeing.","user":"stuart321","rank":[32,37]},{"title":"There is more to this film than meets the eye...","rating":22,"date":"22 March 2002","review":"Yeah, I know, it sounds ridiculous. There is, however, quite a lot beneath the hilarious surface of \"Blacula.\" This is a unique take on the vampire legend. It is the first Dracula film I have seen in which the lead vampire is driven by rage, not by lust or blood lust.  Blacula is a tragic figure, a man who is angry about his condition. One could even view this film as a microchosm of race and civil rights issues in the seventies.  Yes, I know, that's pushing it. Oh, well, even if you don't go in for the sociological aspects of Blaxploitation horror, check this movie out. It's funny and campy--a great party movie. Also, believe it or not, there is a film called \"Blackenstein\" though I have been unable to find a cop","user":"mcamolly","rank":[34,40]}]