[{"title":"Historical moment at the Oscars and Tonight Show","rating":29,"date":"29 August 2004","review":"When the preview of \"Z\" was shown at the Oscars, it received a standing ovation. I didn't know why until I saw the movie. The Oscar forced it to be shown in the United States. At the time, the US backed the military government in Greece. The totalitarian government represented a stand against communism. This movie depicts the true story of a beloved olympic athlete who became a doctor and began speaking out against his Greek government. For that, he was murdered. This is about a brave investigator who begins to search for the origin of the orders to have the doctor killed.<br><br>It leads to the downfall of a country. Mikis Theordorakis wrote the music from house arrest in Greece and it was smuggled out to be placed on the film. Yves Montand played the lead role and was blacklisted from getting a US Visa for his participation until some strings were pulled and he was allowed a 24 hour visa, to be extended each 24 hours in order to allow him to film \"On A Clear Day You Can See Forever\". At the end of filming,that night he made a surprise appearance on Johnny Carson's Tonight Show. He told the story about \"Z\" and commented that he was in the care and custody of US Immigration and the FBI. The camera panned right and a dark suited man slid quickly behind the curtain. He apologized for his abruptness, but his visa expired at midnight and he had to get to the airport. When I saw these things, I was shocked my government would take a movie so seriously. When it showed up in an obscure movie theater in Houston, I had to go. I was the only person buying a ticket just after noon that day. Upon entering the theater, a dark suited man was sitting in the lobby. I walked into theater and then stuck my head back out to see what the only other individual in the theater was doing. He was stepping away from the ticket booth. I watched as he walked the short distance to my car, took out a notebook and wrote in it while looking at my license plate. This is how it happened. It was 1969. J. Edgar Hoover had stated publicly that no truly loyal American would pay money to see such a movie. It was unpatriotic. Newspaper articles that spring reported it.<br><br>Watch this movie and consider the importance \"entertainment\" can have on government, media, and yourself.","user":"lhwilliams","rank":[285,296]},{"title":"One of the few, however great, films concerning a dark period of Greek history","rating":9,"date":"23 July 2001","review":"The film '' Z '' is based upon the same-titled book written by  Vassilikos and referring to a real-life event: the assassination of one of the most honorable Greek politicians ( his real name was Grigoris Lambrakis ), who sacrificed his life in the name of peace and human dignity. Costas Gavras did his best to present the prevailing atmosphere and the political situation in Greece ( although Greece is at no point straightly mentioned, but implied ) during May of the year 1963, which is the year when the real events took place. Choosing an adventurous, thrilling or hilarious style according to the facts and scenes presenting at each part of the story, he made an '' all time interesting and provocative '' film. Great acting was also put in by everybody and particularly by Jean-Louis Trintignant, who was great as the Examining Magistrate. As long as the script is concerned, the plot builds up very satisfactorily and carefully, thus not leaving any holes. Great respect should also be paid to Mikis Theodorakis who wrote the original score for the movie, helping it gain the marvelous rythm it retained right until the very end of it. As a concluding remark I would like to mention that anybody who's interested in late Greek history ( from post World War II era to date ) should watch it carefully. The whole result is very rewarding.","user":"fifalog","rank":[95,99]},{"title":"The most important political film in Greece","rating":9,"date":"13 July 1999","review":"First and foremost, it is a true story. It's the story of the assassination of Grigoris Lambrakis, that eventually led to the military junta. Every time I see it, it gives me the chills. Since Z was released while the junta was still in power, it was banned in Greece for several years. After the fall of the military junta, Z was worshiped, although we saw it on TV much later in order to avoid stirring passions. In terms of the plot, if you're not Greek, it's quite possible you might be left with many unanswered questions, but, in general, it is an accurate description of Greece during that era. <br><br>While Vassilikos' novel (written in 1966) has driven him to exile from 1967, Theodorakis was still in Greece under surveillance and managed to write his excellent score secretly. <br><br>Costa-Gavras gives us a top-class fast paced direction which hasn't aged even today, although I'm sure the Oscar was as much a political decision as a purely artistic one. What is truly spot-on is the casting. Both Montand and Trintignant excel, but even minor roles like Vago and Yago are portrayed in an extremely realistic way. My small objection would be Irene Papas staying near-silent throughout the movie. Although her talent allows her to pull it off with class, I really didn't understand why she was not supposed to talk.","user":"Angeneer","rank":[96,103]}]