[{"title":"V. Tibbs still at it!","rating":7,"date":"7 May 2008","review":"Sydney reprises his Mr. Tibbs moniker in a nicely paced crime drama that has some well orchestrated action sequences, especially the one at the onset of the film. Those first 10 minutes or so reminded me of the heist scene in \"Rififi\" (1955), in that this scene too was captured with no dialog, letting the viewer see for himself how the action plan was set into motion.<br><br>Some reviewers \"dissed\" the 70's sound track and street jargon, but what do you expect? It's a period piece, a 70's action film and by definition will employ those contemporary motifs. To me, it's both refreshing and amusing to be thrust back into the cultural modes of yesteryear.<br><br>The plot line may have had some small weaknesses to it and some of the actors were no Academy Award nominee hopefuls, but the thrust of the film keeps you attentive and anticipatory. Also, it was nice to see Raul Julia, Demond Wilson and Ron O'Neal in one of their earlier films. Sydney, as usual, shines in his rendition of the Tibbs detective. But the plot twists toward the end where Mr. Tibbs puts the pieces together and gets ready to see justice served... Well, see for yourself in this brutally realistic conclusion.","user":"mdewey","rank":[14,15]},{"title":"An obscure delight","rating":6,"date":"28 September 1999","review":"Perhaps the least-known Poitier work, certainly of the period; at date of writing only nine IMDb members had voted on this film. This is just over 1% of the votes attained by it's initial prequel, the superb \"In The Heat of the Night\". Between the two is the awful-yet-lovable \"They Call Me MISTER Tibbs!\" which took the Virgil Tibbs franchise on a downward slope.<br><br>Those that do get to see this movie on it's rare t.v. rescreenings and decide to give it a go after the disappointing \"Tibbs\" will be justly rewarded. Essentially, the production team is the same as the previous film, though Gil Melle provides a jazz-orientated score instead of Quincy Jone's adequate but inappropriate themes. The domesticity is also played down, with Alan R.Trustman absent as co-writer and James R. Webb taking full control of the screenplay. Most importantly, though, is Don Medford as the well above average director. Apart from a rather crude edit where a car accident occurs in the second half of the picture, the scenes are melded together seamlessly and flow together exceptionally well.<br><br>Poitier reprises the role of Tibbs, an arrogant, aloof, bad-tempered, authoritarian, bigoted Lieutenant. As a result, this is probably the most appealing of all Sidney's characters, and he slips back into the role effortlessly. With no star names to support him, such as Rod Steiger or Martin Landau (though Raul Julia did become a star later in life), Sidney stands way above his peers. His ability to project a bad atmosphere every time he walks into a room is flawless. This time he is not let down by the plot, either, which sees Tibbs caught between the Police Department and a vigilante gang that seeks to expose a wide net of heroin dealers. The plot takes on many shifts in loyalty and focus, keeping the attention, while a chase through underground tunnels lends the requisite chase an extra air of tension. The racial motif is again absent, though a rival black cop played by Bernie Hamilton gives off a frisson of resentment.<br><br>While predictably not of the calibre of \"In Heat of the Night\", The Organization stands as the greatest of Sidney's seventies vehicles.<br><br>Post-Script, March 2016: Over 16 years since I wrote this review (where does the time go?) I realise that I was too soft on what is quite a shaky film. Continuity and editing are not great, and the tone is frequently dirge-like. It's OKAY, but the concluding line that it's the best of Sidney's 70s movies was clearly written by a man who hadn't then seen The Wilby Conspiracy or Brother John. It's what's known as a \"take a chance\" point of view, and in this case it was wide of the mark.","user":"The_Movie_Cat","rank":[22,27]},{"title":"Not a bad film but sort of hokey even then but still fun to watch","rating":7,"date":"7 September 2006","review":"I lived in San Francisco from 1964-1980 and got to see a LOT of movies filmed there. I watched them film the sections in Bart ( being built back then and one of the film's chase scenes goes on in the tunnel) and Muni and saw this and the 2 previous Virgil Tibbs films in San Francisco theatres.<br><br>It is fun to look at this movie after 30+ years and see what is still there and what has changed over the years. The 70's seems like a million years ago. The Phillips gas station on Beach Street has had about 10 different brands over the years. The hofbrau on Turk Street ( Iate there every night, it was cheap) and Lew Lehr's steak house disappeared in the 80s.Hare Krishna's on Market Street across from the Sheraton Palace.<br><br>I feel this movie is better than the previous Tibbs film, but my opinion is, of course, subjective. Even a bad detective movie has some merits. <br><br>Of course, the premise of this film, that 6 people could bring down \"the organization\" ( mafia?) by stealing 4 million dollars worth of heroin is kind of silly. And the organization is having a hard time coming up with cash to buy back the drugs? Come on guys....<br><br>As for the 70s music, well, Lalo Schiffrin and others composed a lot of movie music back then and times change. I liked the music myself.<br><br>The 70s saw a lot of movies filmed in the city by the bay. Bullitt, The Laughing Policeman, The Dirty Harry Films, The Monk ( TV film, not the recent TV show, this was with George Maharis and Janet Leigh), The Towering Inferno,and the Streets of San Francisco TV show. I worked as an extra in films in those days and miss that era of cheap food, cheap rent, and cheap Giants tickets...<br><br>A great site I just found shows probably every movie filmed in San Francisco.<br><br>http://www.MisterSF.com<br><br>click on cinematic sf !<br><br>George Senda Concord, Ca","user":"Falkenberg2006","rank":[8,9]}]