[{"title":"Charming story, top-notch performances, sublime music, excellent script, lush visuals, and beautiful women","rating":10,"date":"21 May 2005","review":"If you read my title, that's probably all I should have to say about this one. But I'll flesh it out for you a bit. If you couldn't tell, this is one of my favorite musicals, and one of my favorite films, period. In my view, there's not a flaw to be had here--we'd have to invent one, and it would be implausible. I give plenty of 10s, but quite a few are like rating a one-scoop ice cream cone where they forgot the cone, but where there's an extra scoop of ice cream in an attractive dish to make up for it. Pal Joey is like a one-scoop ice cream cone where not only is the cone there, it's the kind of cone you love, and there are two extra scoops of ice cream that happen to be your favorite flavors.<br><br>Frank Sinatra is Joey Evans, a peripatetic musician who is also quite popular with women, but who has a reputation for not being exactly dependable or trustworthy. As the film opens he's being put on a train with a one-way ticket out of town because he was caught in an almost compromising situation with the Mayor's underaged daughter. He makes his way to San Francisco, where he sees that an old \"friend\"--more like an old debtee, Ned Galvin (Bobby Sherwood), is leading the band in a local club, The Barbary Coast. Joey finagles his way into a job, made more enticing to him, aside from the fact that he's broke, by the large number of very attractive women performers. But the club owner, Mike Miggins (Hank Henry), can see through his conniving ways.<br><br>Joey, who dreams of one day having his own club, begins falling for Linda English (Kim Novak), despite the fact that Ned is head over heels for her and out of all of the women, Linda is the one who wants the least to do with him. He also runs into Vera Simpson (Rita Hayworth) when he does a society gig with Ned. It seems that Vera used to be a showgirl like Linda, but she \"married up\". Pal Joey is largely about a love triangle between Joey, Linda and Vera.<br><br>This is an unusual romance in that for much of its length, all of the involved parties are reluctant. Linda may be attracted to Joey, but she knows better than getting involved with such a shifty womanizer. Vera is likewise cautious--especially since she has an implied history with Joey, and she now has a lot at stake. Joey is more than content to not approach commitment--he's satisfied with the string of women who continually pass through his life, who are all too happy to go out of their way to accommodate him--including doing his laundry and politely looking on and smiling when Joey puts the moves on another \"mouse\", as he calls them. As for Joey's interest in the two principals, it's not that he's not attracted to either, of course (what woman isn't he attracted to?), but with Vera he's playing her both for her money/social influence and to undermine what he sees as a feigned identity, and with Linda, he's initially attracted because she's playing hard to get. Both Linda and Vera also end up playing Joey to an extent to get back at him for various ethical blunders.<br><br>In addition to being intriguing for its uniqueness and relative complexity, all of this works as well as it does because the three leads are incredible performers and the script is intelligent, witty and tightly constructed. Sinatra, Novak and Hayworth are mesmerizing to watch on their own, but they all have great chemistry together, too. The characters seem tailor-made for these actors, despite the fact that the script was based on a popular Broadway show that began its run in 1940, and the Broadway show was itself based on short fiction pieces by John O'Hara that appeared in New Yorker Magazine.<br><br>Dorothy Kingsley's screenplay is loaded with subtle, quick humor in its clever dialogue. The combination of script, exemplary direction by George Sidney, and the great performances enables a number of very sophisticated dramatic moves, such as the deep backstory between Joey and Vera that is almost completely implied, and the overall atmosphere of the film, with its captivating and paradoxical combination of an ideal, romantic (in a more formal sense) world and a more earthy, cynical reality.<br><br>The atmosphere is also helped by the lush Technicolor cinematography, with some impressive shots of San Francisco, but equally attractive soundstage set-ups. It's interesting to note Kim Novak's look here, especially when she's framed against San Francisco cityscapes--it's remarkably prescient of her appearance in Hitchcock's Vertigo (1958). I suppose Pal Joey may have been why Hitchcock decided to cast Novak, and it may have influenced him a bit visually.<br><br>Before I run out of space, I should mention the music, by the incomparable duo of Richard Rodgers and Lorenz Hart, which is one of the best things about the film. Every song in Pal Joey is a gem. As a testament to how good they are, four of them--\"I Could Write a Book\", \"The Lady is a Tramp\", \"My Funny Valentine\", and my personal favorite, \"Bewitched, Bothered and Bewildered\" (the theme of the film)--have become jazz standards over the years. There have been hundreds of recordings by different artists performing them--for that matter there are hundreds of recordings of \"My Funny Valentine\" alone. The arrangements (partially by Nelson Riddle) and performances (especially by Sinatra, but that probably goes without saying) in the film are sublime. If you're a jazz lover, the film would be worth viewing for the music alone, but of course it offers much more than that.<br><br>Unless you simply hate musicals (in which case it's very unlikely that you've read this far), make sure you see Pal Joey at least once.","user":"BrandtSponseller","rank":[49,55]},{"title":"Pretty Good Frank, Very Bad Theatre History","rating":28,"date":"28 June 2000","review":"I like Sinatra as much as the next girl and then some.  Probably the best thing about this film is the numbers The Chairman does alone onstage. However, I'm also well acquainted with PAL JOEY in its stage form, and this watered down film doesn't serve it well.  As is so often the case with film musicals, it bears very little resemblance to the show it purports to represent.<br><br>First of all, like many other movie musicals this one is rife with interpolations.  Viewers should realize that both \"My Funny Valentine\" and \"The Lady is a Tramp\" come from Rodgers and Hart's BABES IN ARMS (though, ironically, both were cut from the film version of that musical).  \"There's a Small Hotel\" is from ON YOUR TOES and TOO MANY GIRLS gave us the haunting \"I Didn't Know What Time It Was\"  (probably the interpolation that works best).  Secondly, most of the songs they did keep don't remain intact.  For instance, when they moved the setting from Chicago to San Francisco the song the club girls sing went to pot.  Also, the lyrics to \"Bewitched\" had to be sanitized for popular consumption, which is a pity because they're some of Larry Hart's best. \"Zip\" was also revised and given to Vera.  The witty \"Take Him\" was cut, which is a real pity, and several other numbers are gone entirely or reduced to underscoring.<br><br>PAL JOEY was one of the first shows to bring cynicism to the musical stage. The second you inject romance into it, you've killed what it's about.  If I was just looking for a lightweight love story, I might enjoy this film. Knowing what I know now, I find it a bit tough to take.","user":"ekennedy421","rank":[40,45]},{"title":"John O'Hara, he could write a book","rating":9,"date":"26 February 2006","review":"In his career Frank Sinatra did two film adaptions of Rodgers and Hart musicals. The first was Higher and Higher which was his first feature film speaking part. Pal Joey was the second and it is probably the greatest show Rodgers and Hart ever did.<br><br>When it debuted on Broadway in 1941 it got good, but not great reviews. But everyone loved the Rodgers and Hart score. Bewitched, Bothered and Bewildered and I Could Write a Book were the big hits of the show and were retained for the film. <br><br>Pal Joey may have been ahead of its times. It was revived in 1951 and ran twice as long as it did in its original production. The reviews were far better. To say this is unusual is putting it mildly. <br><br>On Broadway, Joey Evans who we would now call a lounge lizard was played by Gene Kelly and in the revival by Harold Lang. The part really fit Sinatra perfectly. But the role had to be changed from a dancing part to a singing part. I believe that was the reason for the interpolation of other Rodgers and Hart songs in the film. <br><br>And Sinatra sings some good ones in Pal Joey. Added in for the filmgoers listening pleasure are There's A Small Hotel, I Didn't Know What Time It Was, and The Lady is a Tramp, the last one becoming a Sinatra standard in his live concerts. Movie singing don't get too much better than this.<br><br>Frank is an ambitious man of rather low morals who is caught between rich widow Rita Hayworth and ingenue Kim Novak. He loves Kim, but Rita can give him financial security. These are the kind of people that populate the John O'Hara world, very real and not too noble.<br><br>Although a few years later Frank Sinatra sang a concert version of Bewitched, Bothered and Bewildered with a hundred piece orchestra for his Reprise record label, it is in fact a woman's song as is My Funny Valentine. Rita does Bewitched as well as Zip. The latter song is a tribute number to Gypsy Rose Lee as Rita plays an ex-stripper. My Funny Valentine is done by Kim Novak. <br><br>When I say done, both ladies mouthed the words, but the vocals were dubbed as they always were for Ms. Hayworth. And I guess that had to be because both Hayworth and Novak could never have had the parts done by the best of vocalists. <br><br>As Pal Joey came to the screen in 1957 along with The Joker is Wild, my favorite Sinatra film, I've always picked that year as the year Old Blue Eyes was at the height of his career. His acting is impeccable and his singing, some of the best he ever did on screen.","user":"bkoganbing","rank":[44,50]}]