[{"title":"Pretty much faultless - 5.9? How come?","rating":8,"date":"18 February 2012","review":"I don't do IMDb reviews. I drop by all the time, and when I've just sen a movie, I often drop by with my prediction...and though I say so myself, I've got pretty good over the years. I guess 6.3, it's a 6.5; I guess 7.2, it's a 7.0.<br><br>Just watched Twins for the first time in 20 years and came in with my prediction of 8.1 and what the...? 5.9? You have got to be kidding! Of its genre, Twins is damn near perfect. Great idea, brilliantly executed. An excellent script, with great one-liners and terrific plot twists along the way. And above all, one of the best buddy-twosomes outside of 48 Hours. How this ended up under 6 just defeats me.<br><br>I was so amazed - and indignant - that I ended up doing my first IMDb review in years, in the hopes it might ease the score just a bit closer to where it deserves to be - which is 8, minimum. If you don't enjoy Twins, check for a pulse.","user":"alan997","rank":[46,51]},{"title":"Schwarzenegger and De Vito (both!) steal the show in \"Twins\".","rating":20,"date":"20 March 2002","review":"Arnold \"is back\" as \"Julius\"; the result of a secret genetic experiment to help create a better human being. He has lived a sheltered life on a distant tropical island and has no real practical experience with real life issues; especially with dangerous situations involving criminal activity. He has matured into a kind of naive innocent not unlike anyone you may have found in the proverbial \"Garden of Eden\". His desire to trace his roots leads him to the big city where he soon discovers he has a \"twin\" brother named \"Vincent\" (expertly played by Danny De Vito). Vincent was raised in an orphanage and subsequently has led a life of crime; he seems to favor car theft as his main source of income. These two soon meet and the antics from then on are nothing but hilarious. Arnold attaches himself to Danny like a puppy dog and is very determined to help and protect him. Together, they seek their birth mother as well as get into all sorts of amusing and sometimes potentially dangerous situations. But don't worry fans; with Ah-nold around what could possibly go wrong? Just remember to add this VERY funny movie to your collection of comedies on DVD and remember to pay (or avoid altogether) those parking tickets! Or get a bicycle! Or a scooter! Just don't forget the pop corn!","user":"brian james","rank":[35,42]},{"title":"One of Arnie's better comedies.","rating":8,"date":"27 June 2004","review":"The idea of Arnold Schwarzenegger being in a comedy sounds like a recipe for disaster. But his stiff delivery actually works in his favour for this film, and he makes a great double-act with Danny DeVito.<br><br>Arnie plays Julius Benedict, and is the result of a top secret government experiment to create the world's most physically and mentally enhanced human being. Six men who were model citizens, like athletes and scientists were chosen to contribute a sample of genetic material. Mary-Ann Benedict was chosen to carry the baby. But instead of giving birth to one baby, she had twins.<br><br>Julius was taken to a tropical island in the South Pacific where he was educated and cared for. By the time he was 35, he can speak up to twelve languages, holds degrees in biology, chemistry and physics, and is an expert in the martial arts. When he is told he has a twin brother, Vincent, he decides to leave the seclusion of the island to find him.<br><br>Vincent (Danny DeVito) had a completely different upbringing than Julius. He was taken to an orphanage in Los Angeles, where he eventually ran away. By the time he was 35, he is up to his eyes in debt, loan sharks are after him, and he is now in jail.<br><br>When they finally meet, they are both shocked that they look nothing alike, and are almost completely different in every way. Julius is very naive, and has a big heart. Vincent is a selfish hustler, who has as much taste for women as he does for money. Despite their differences, they try to track down their mother, and learn more about each other in the process.<br><br>Arnie and DeVito have a terrific chemistry, and director Ivan Reitman made the wise choice of putting the two of them together. Its clear in their scenes together that they enjoyed working with each other. Scenes such as Julius saving Vince from a loan shark, and Vince teaching Julius how to dance are definite highlights.<br><br>Reitman adds more into the film with a subplot about a stolen engine Vince wants to sell. Honestly this doesn't contribute anything to the film, and the most interesting things are Julius and Vince's exploits.<br><br>Arnie manages to be convincingly awkward as he deals with the outside world for the first time. DeVito is perfectly cast too, and he shows what a great actor he is by being dramatic as well as sarcastic. Interestingly, when Reitman paired them up again in Junior, the magic wasn't the same.<br><br>Although not on the same level with Reitman's Ghostbusters or Evolution, Twins is very entertaining, and is carried almost single-handed by Arnie and DeVito.","user":"DavidSim240183","rank":[20,23]}]