[{"title":"Fellini's best.","rating":10,"date":"12 September 2004","review":"Federico Fellini's second feature, *I Vitelloni* (literal trans.: \"fatted veal calves\"; figurative trans.: \"the guys\"), is an honest, unpretentious work from the Master before he became besotted with his own self-indulgence.<br><br>It's autobiographical in several indirect ways. The depictions here of young men who are not quite so young anymore, living with their mothers, settling for dead-end jobs or simply not working, and generally languishing their lives away, are based on Fellini's own observations of such fellows in his boyhood home of Rimini. Autobiographical too in its sense of style: the movie is inescapably stamped by the Neo-Realism of Fellini's apprenticeship. The grimy faces of working-class people, crumbling tenements, and weed-choked rail-yards are all here. But with a difference: Fellini casts a critical eye on this scene, eschewing the usual Neo-Realist appeal to our presumed socialist sympathies. *I Vitelloni* is not a political film in the usual mid-century Italian manner. Fellini gives us a quintet of heroes who, for the most part, aspire to be bourgeois big-shots of their shabby seacoast town. Not content with that, he makes them lazy, as well . . . and then he asks us to root for them, to actually like them! Needless to say, the intelligentsia of the period didn't warm to this film, even as the film-going public in Europe loved it, recognizing themselves and their friends and their own hometowns in it.<br><br>Just as Shakespeare shows us the brilliant results of striving within the non-negotiable limits of the nine-line sonnet or the blank verse of his plays, Fellini achieves genius in this film, stylistically, from the fruitful tension between the dictates of Neo-Realist imperatives (which no young Italian director of the Fifties could ignore if he wanted a career), and the dictates of his own vision. For, even while being a dutifully serious Neo-Realist (even to the point of employing a static, unblinking, non-flashy camera on the proceedings -- hardly the \"Fellini-esque\" style we would see in later years!), the director's penchant for the grotesque can no longer contain itself. In this film we get the aging, corpulent homosexual actor, with hair in need of a cut, noisily slurping up soup while one of the Vitelloni reads aloud to him some terrible play he has composed. We get the nauseous parties, in which Fellini tosses the Neo-Realist camera in the trash and picks up his own camera, swooping with it into the hot, frantic fray, honing in for sweaty close-ups, climbing the rafters for a dizzying aerial view, skewing the angles while watching an off-key trumpet player blare into the ear of a miserable drunk, and filling the screen with gigantic papier-mache clowns that constitute the floats of a Lenten parade. At the same time, the mandate to keep himself in check, or perhaps the humble desire to make an easily digestible movie, gives *I Vitelloni* the discipline and order so lacking in post-*8-1/2* Fellini films.<br><br>But the thematic meat of the movie provides the most fruitful tension. Fellini shows us the Vitelloni, the \"guys\", most of them creeping past 30, grasping after any passing pleasure that comes to hand, whether it be a woman (young or old, married or not, willing or not), a drunken night at the local pool hall, an attempt at petty thievery, a day of gambling at the races, or whatever. Then Fellini contrasts this with the older generation, tellingly single (their mates long buried), barely supporting the passel of lazy Vitelloni and assorted nieces and grandchildren who all lay about the family home. The old folks' sacrifices seem to have produced ignoble results, particularly within themselves: all too often, the old men and women are grouchy, unhappy, prone to fits of violence or weeping, and -- saddest of all -- lonely. The Vitelloni look at their elders, see the sterile results of lives rendered bereft by tradition and \"sacrifice\", and naturally rebel, searching in easy hedonism for the happiness that has eluded their parents. One character, a compulsive womanizer, plans on running away after he knocks up his girlfriend -- and why not? The womanizer's bitter father provides no wholesome example of \"responsibility\". Indeed, it seems as if the old man forces his son to marry the girl simply because he, the father, is friends with the girlfriend's father, and, after all, misery loves company. The question of whether or not the cad actually loves the girl is never asked. Guess how this marriage turns out.<br><br>Without unduly spoiling things, one of the Vitelloni actually DOES escape the shabby town by movie's end, but even here Fellini offers an unequivocal qualification: the character, staring out the window as the train pulls out, hangs his head and weeps. He knows, as do we, that he will be just as unhappy in Rome as he was in this fictionalized Rimini. Meanwhile, a young boy who works at the train station waves goodbye to the leaving train and turns his back on it, balancing precariously on a rail as he boyishly walks off. Fellini indicates that some people will simply be happier than others, no matter the circumstances: truly one of cinema's bleaker statements on the human condition.<br><br>*I Vitelloni* remains a great masterpiece, and is Fellini's most neglected film . . . though it somehow seems fitting that a movie which virtually INVENTED the notion of \"slackers\" should be forgotten. No matter: perfection is rarely popular, anyway. 10 stars out of 10.","user":"FilmSnobby","rank":[78,102]},{"title":"The Eternal Students","rating":9,"date":"14 November 2005","review":"Somewhere on his way from neo- to sur-, young Federico Fellini had made a \"I Vitelloni\" (1953), lighthearted, unconventional, bold, and above all entertaining film that tells the story of hopes and miseries of four friends, four young men, \"I Vitelloni\" in a small seashore province town. \"Vitellone\" means \"idle young person of the provinces, often an eternal student\". The title matches its characters very well. They live in the town where nothing much happens; they don't have jobs and spend the money given by their loving families. They have the most ardent hopes and they face the cruel disappointments. They are different - cynical skirt chaser Fausto who is forced to marry a girl pregnant with his baby; the intellectual and ambitious Leopoldo who dreams of becoming a famous writer; the irresponsible \"big child\" Alberto (Alberto Sordy, the famous comic, absolutely wonderful in his early role), and Moraldo, the only one of the group who in the final scene will leave the town of his childhood to start a new life.<br><br>I loved I Vitelloni. Nino Rota's music is above any words (as always) as well as the young director's camera work, the character study and acting. I think of \"I Vitelloni\" as more realistic and sober \"Amarcord\" in B/W. One of scenes was absolutely stunning -the carnival - the music, the dancing, the camera's rapid but fluid movements - simply breathtaking.<br><br>It is without doubt that Fellini influenced a lot of directors, and there are similarities between \"I Vitelloni\" and George Lucas' \"American Graffiti\" and Barry Levinson's \"Diner\". Stanley Kubrick and Marin Scorsese both named \"I Vitelloni\" as one of their favorite films.<br><br>Highly recommended: 9/10","user":"Galina_movie_fan","rank":[25,31]},{"title":"The interchangeability of gang members","rating":10,"date":"10 August 2004","review":"I think that the only other user to have commented on this film may have missed some of the point. The actions of the characters are not hard to understand. Fausto is a womaniser because he does not take love and its attendant responsibilities seriously. Alberto and Riccardo booze and smoke and hang around because those are the roles designated to some men in adult gangs of this kind. Moraldo sees Fausto's womanising and is torn between loyalty to the camaraderie of the group and to his friend and love for his sister, resulting in him helping Fausto to protect Sandra from the truth.<br><br>With regards to the lack of character definition of the characters, I don't think that this should be seen as a problem. Their inability to escape the attraction of a casual life robs them of character and their love of the gang robs them of individuality. The interchangeability of their looks and the swapping of facial hair styles illustrates the dynamics of a gang - shared vocabulary, shared likes and dislikes, playing off each other.<br><br>I think that this is a perfect distillation of the aimless lives of adult males, unable to break away from the gang. Whether this is Fellini's best or not, it is a very affecting study of small-town ennui and male relationships.","user":"nick-pett664","rank":[29,38]}]