[{"title":"Obscure gem","rating":9,"date":"3 August 2005","review":"It's always nice to find an obscure gem like this. This film is VERY good. Don't let the other reviews here fool you. An intelligent viewer who actually WATCHES and takes in all the atmosphere built up will find a lot to reward them. One should not go into this with the typical 2 second attention span so prevalent today. The film is intelligently made and builds slowly but surely. You have to take this as an Italian horror movie from the 70's to appreciate. All the conventions of this style of film-making are present. The weird dubbing zooms and creepy vocal music are all their and are very effective in creating the proper Euro Horror feel. The director Ferroni was very competent in this genre. It starts off with a bang of weird gore and settles into a slowly building story with a Wizz bang finale, with some of the most off the wall goofines I have ever seen in one of these types of films. It is Definitely worth the wait for the gore and mayhem at the end. The Vurdalak(witch/Vampire) theme is an underdone sub genre and is quite different than the usual Vampire conventions. The very foreign Yugoslavian setting is also a plus.<br><br>Gianni Garko is quite effective as the lead and has the requisite chemistry to pull off his central role. He also creates sympathy which helps make this better than the average Italian gore movie. The children are also REALLY creepy and effective. Special kudos to Carlo Rambaldi(ET) for his effective 70's gore effects. This is available form Midnight Video in a Good quality widescreen transfer with slightly annoying Japanese subs. If you are a fan of atmospheric Euro horror this is a must have. A proper DVD release in the Future? I hope so.","user":"ster2001","rank":[33,37]},{"title":"Eerie and mesmerizing Italian horror film.","rating":9,"date":"20 August 2009","review":"\"Night of the Devils\" is a rare Italian adaptation of the Tolstoy story \"Lu Famille du Wurdulak\" made by Giorgio Ferroni. The story was also adapted previously for the segment \"The Wurdulak\" in Mario Bava's splendid \"Black Sabbath\".A man stumbles upon a cottage in the Yugoslavian woods that happens to be inhabited by a family of vampires.Atmospheric Euro horror with vampires,a witch,some horrific gore and full-frontal female nudity tossed in for good measure.Ferroni's take on Tolstoy story is genuinely moody and atmospheric.The special effects by Carlo Rambaldi are effective and it's nice to see jaw-droppingly beautiful Teresa Gimpera is one of the supporting roles.I loved \"Night of the Devils\" and you should too,if you are into Italian Gothic horror.9 out of 10.","user":"HumanoidOfFlesh","rank":[16,18]},{"title":"wonderful 70's movie","rating":9,"date":"2 January 2007","review":"I've seen this movie many times; I have to say I love this movie because of many reasons : there are scenes that really scare the hell out of me , for example , the witch running through the woods , the animals running , the scenes that create suspense like when Gianni Garko is inside the house and they're all waiting for the grandpa to come back (and we all know something is happening) Gianni Garko is one of the great actors of the 70s ,he's been a guest star in \"Space 1999\", as well;<br><br>the movie has got that 70s atmosphere (like in the hospital) mixed with a sense of Hammer Horror , but more low-budget From what I know, the movie was shot near the place I live (North East Italy) close to Slovenja (Yugoslavia, back then) It's less scary after two or three views, but it's a very good movie","user":"sirius_6it","rank":[21,25]}]