[{"title":"Murphy and Nolte are Still Great Together","rating":7,"date":"15 May 2009","review":"When I was little and saw the first 48 Hours, I thought Eddie Murphy looked pretty scrawny in that suit and that, upon seeing the sequel, he looked a lot more fashionable. Then I realized he was wearing the same suit throughout this movie (I guess he was in a lot better shape). Other than considering this film to be a fairly entertaining rehash of the first, I guess that's my review.<br><br>Although I must mention that if someone were to fire a Desert Eagle handgun as close to their face as Andrew Divoff does in the final act of this film, he would probably burn his cheek and deafen himself... but I guess that's just part of Walter Hill's bombastic direction.","user":"dwinters_23","rank":[14,15]},{"title":"Revenge of the 80's: The sequel!","rating":7,"date":"7 November 2004","review":"Another 48 Hrs. (1990) was another sequel. During the 80's any movie that made the slightest of profits made a sequel. For one reason only, to make even more money. However many producers never made another dime off of the momentum of the previous film and were stuck with a sequel that cost two or three times as much as the original film, Another 48 Hrs. was a prime example. The only reason films that produced multiple sequels raked in the dough was the films were cheaply made, low overhead means more potential for a profit. When you pour millions into a movie and expect to make a buck, two out of three times you're going to lose your shirt. <br><br>The movie has a \"rushed into production\" feel. I felt the same way after watching Scary Movie 2. The director was given what he had to work with. I can't fault Walter Hill because he made a pretty watchable movie. The problem was this film didn't need a sequel. The end results are a remake of the first movie. No more, no less. This film was made during the peak of Eddie Murphy's over exposure period. Like so many actors, he was a victim of his own excess. Nick Nolte seemed to be going through the motions whilst Eddie Murphy had that \"look at me\" thing going.<br><br>Overall it's not a bad movie. But if you're expecting something different then look elsewhere. Maybe the filmmakers should have watched the first movie again before they wrote the script. It would have helped a bit. <br><br>Recommended for fans of the first film.<br><br>B","user":"Captain_Couth","rank":[29,39]},{"title":"Mind the word: another!","rating":3,"date":"3 February 2002","review":"It's a good thing that director Walter Hill has waited 8 years before making a sequel of the original \"48 hrs.\"  If he had released this film immediately after the first one, it would have become a flop.  The reason is because both films are very much alike.  \"Another 48 hrs.\" hasn't got anything new to offer; it's an almost exact copy of the first one.  And that's precisely why they waited so long before making this sequel.<br><br>Nothing really changed actually.  There's Nick Nolte who plays the same cigarette-smoking and alcohol-addicted tough-guy cop forced to team together with Eddy Murphy who takes up his part as the noisy, bad-mouth and know-it-all convict-character again.  Just like in the first film, it's the chemistry between these two actors that makes \"Another 48 hrs.\" really worth-watching.  And just like in the first film, the only decent acting comes from Nick Nolte and Eddy Murphy while the rest of the cast is merely below average. Once more the action scenes are great to watch.  This is a good thing, because it makes you forget about the weak script.  The dialogues are funny, but they're overloaded again with harsh language.  Some might find this annoying; I honestly thought it became funny after a while.<br><br>The ending is pretty weak and predictable, but on the whole \"Another 48 hrs.\" is almost as good as its predecessor and good waste of time; not money.","user":"ken_vandenbussche","rank":[20,26]}]