[{"title":"Nothing can match the 70s movies","rating":5,"date":"26 August 2004","review":"Tamara Dobson plays the title character, the best dressed United States Agent in the history of cinema.  She's on a quest for justice and for burning down poppy fields. <br><br>Her rival is Mommy, played by Shelley Winters, who gives a subtle, restrained perf...naw, I'm fooling ya, she's re-defining over-the-top as she GNAWS on every single piece of scenery, all in a variety of Eva Gabor wigs. Seeing her rub the bottom of her young girlfriend, and then get her feet rubbed by the same girl...I wasn't sure if I was going to vomit or thank the movie gods that created this.<br><br>Plot is virtually unimportant as Cleo battles the fuzz, Antonio Fargas and anyone who gets in her way.  Movie is vintage fun and it was nice to see Esther Rolle in a small part.  6/10.","user":"Boyo-2","rank":[14,15]},{"title":"Who was that Bad Mamma Jamma???","rating":14,"date":"14 December 2001","review":"Cleapatra Jones is one of those movies that you might have caught on t.v. as a little kid and thought, \"Wow, that was amazing!  I want to be just like her!\"  Then, when you are older and see it scheduled to come on t.v. again, or see it in the video store, you arrange to watch it with all sorts of anticipation and end up laughing through the entire movie-the choreographed fight scenes, the extreme villains, the jive \"put downs\". Either way, it is a cool movie to watch, whether you want to go \"WOW\" or joke it.<br><br>I think Tamara Dobson is absolutely stunning in the movie. Very glamorous and very \"tough\" (if you disregard the fake fight scenes)and within the context of the movie, she is very smart. Blaxploitation films had their place back in the day (and they still do).<br><br>Shelly Winters played a \"surprising\" role as the villain.  If you need to get a handle on this, view the movie, \"I'm Gonna to git You Sucka\"-  Towards the end of the movie, a whole list of actors/actresses, who are thought to be above playing in exploitation movies, are named in various exploitation films.  Of course Cleopatra Jones is mentioned.<br><br>While the movie can be classified as \"cheesy\" by many, it does have action, adventure, and romance. The action is non-stop-Cleo is always kung fuing someone or driving the hell out of her Corvette to get away from the bad guys.  Also, there a pretty neat scene where she rides a motorcycle up a steep hill to everyone's dismay (if you happen to catch CJ on DVD or VHS, use pause on this scene-it is clearly a Caucasian male, with brown makeup, who is actually riding the motorcycle). The adventure is during the beginning-she is in Turkey blowing up poppy fields.  Also, her investigations takes her to various parts of  town and she interfaces with various \"interesting\" supporting characters.  And then there is the romantic scene with her and Bernie Casey.<br><br>If anything, CJ is a wonderful film to have going if you happen to have a 70's theme party or something.","user":"anitatanky","rank":[12,13]},{"title":"Funky & Fun Gem!","rating":8,"date":"31 March 2003","review":"\"Cleopatra Jones\" was one of the first \"blaxploitation\" movies that I ever saw back in the '70s.  Tamara Dobson plays Cleopatra Jones, a government agent that must crack a drug ring run by Mommy, Shelley Winters.  This movie has a nice pace, and looks like it had a fairly big budget for this genre. Tamara plays the role flawlessly and with style.  Some of those fashions! I am surprised she could do some kung-fu fighting with those killer platform shoes on.  The other thing that stands out in my mind about this movie is Cleo's sexy corvette, complete with a cassette deck!  This was state of the art back in '73 for most cars came with the standard AM radio, or if you wanted to, you could upgrade to 8-track!  Shelley Winters is funny and over-the-top with her role as Mommy, the Queen of drug trade.  Her performance just adds to the campy appeal of this movie.  The supporting cast do well too, and round out this made-for-drive-in classic!  The DVD is very basic with no extras, however, it is presented in it's original \"cinemascope\" aspect ratio.  The print looks good, and clear. I am glad that this movie is available on DVD, for it's an enjoyable taste of the '70s!","user":"dgordon-1","rank":[14,16]}]