[{"title":"One of the best Disney films","rating":10,"date":"20 February 2020","review":"Beautiful and lovely in every way. The colors and the animation for this movie were beyond amazing, given that it was made in 1937 - absolutely astonishing! The story was so good even though there were a few fairy tale cliches but very inventive. It was so charming. I'll definitely be watching it again.","user":"MR_Heraclius","rank":[37,38]},{"title":"A Movie Milestone","rating":10,"date":"14 January 2004","review":"Where would the animation world be without the humongous success of Snow White and the Seven Dwarfs?  If the movie failed back in 1937, there would be no Disney Company today, no Lion King, and no Disneyland.  Disney's Folly, as critics first called it, would probably have scared any other industry from attempting such an ambitious and innovative project.  Pixar may not have ever had the chance to put out their groundbreaking features, and even the Disney- and fairy tale-bashing Shrek may never have been made if Snow White didn't set the course for the world of the animated feature.<br><br>There must have been tremendous pressure on everyone involved in the making of Snow White, but they did not disappoint.  The end result includes a timeless story, classic songs, and beautiful imagery that will live on for future generations to enjoy.  In fact, this was only the second movie that captured my nieces' full attention spans (The Lion King being the first).<br><br>In my opinion, the story was great but not perfect.  It's not as exciting or filled with as much witty remarks as today's animated features, but as soon as the dwarfs are introduced, the movie takes on an endearing lighter side. For the record, my favorite dwarf is Doc, because I can relate to him being a strong leader with some very humanistic follies, such as always getting tongue-tied (I do that myself all too often).  All the songs stand out in their own way.  `Some Day My Prince Will Come' is a classic, fairy-tale ballad.  `Heigh-Ho,' `Dig, Dig, Dig,' and `Whistle While You Work' are great songs to pick up your spirits when you have to go to work, do chores, or do homework.  And my favorite, `The Silly Song,' is just a great, catchy, and funny song.  As for the imagery, it's just breathtaking, especially considering how early it was introduced.  The colors are rich and lively, and the multi-plane camera does add some great depth to the movie.<br><br>As you can tell, for an animation and Disney fan like myself, Snow White is a perfect milestone in the movie world.  Even compared to the animation and storytelling styles of today, Snow White still stands the test of time. Kudos to everyone involved in this picture as their work will live on forever.<br><br>My IMDb Rating: 10/10.  My Yahoo! Grade: A+ (Oscar-Worthy)","user":"travisimo","rank":[84,91]},{"title":"STILL The Fairest One Of All!","rating":10,"date":"18 July 2006","review":"There isn't much that hasn't already been said about \"Snow White and the Seven Dwarfs\", Walt Disney's first feature length animated film. Suffice it to say that it not only fulfilled the studio's hopes beyond their wildest dreams, it made possible the Disney films that followed it. From the famous Grimm fairy tale about a beautiful princess who flees her jealous stepmother and finds refuge with seven friendly dwarfs, Walt Disney created a cinematic milestone. At the time the film was in production until the day it was released, rival producers were supposedly referring to it as \"Disney's Folly\".Although this myth has been recently debunked in film historian JB. Kaufman's magnificent new book (''The Fairest One Of All:The Making Of Walt Disney's Snow White And The Seven Dwarfs''Weldon Owen/Disney Press, 2012)it's true that only after it's huge success, did fellow movie makers attempt their own full-length cartoon features. Upon it's debut, at Hollywood's Carthay Circle theater, (December 21, 1937)the film was embraced both by critics and audiences, grossing many times it's then record (for an animated film) $1.5 million budget. Eight successful reissues have kept the movie in the public consciousness now for over six decades, during which time the field of animation has grown by leaps and bounds. Still. despite the cinematic advances and the passage of time, \"Snow White\" stands alone. While the classic story is but a framework for the film (a fact which troubled me for years), \"Snow White\" can be fully enjoyed for the pioneer it truly is. <br><br>Along with a splendid cast of voices headed by Adriana Caselotti (Snow White) Harry Stockwell (father of Guy and Dean, as the Prince) and Lucille La Verne (The Queen), there are songs which can truly be called timeless: \"Whistle While You Work\", \"Heigh Ho\", \"Some Day My Prince Will Come\", etc.). Much time and effort went toward developing the characters of the Seven Dwarfs and giving each a distinct personality (absent in the original story) which went a long way in making audiences care for Snow White's plight. Interestingly enough, although the fairy tale was toned down considerably to make it more \"family friendly\", the overzealous way in which the film makers transformed the Wicked Queen into a hideous hag at the climax was the subject of an incredible amount of controversy at the time. In fact, it was under a partial ban in England which made it off-limits to children under 16 years of age! Nevertheless, it was the recipient of a special Academy Award in 1938.<br><br>To go on about the impact made by the film would be redundant. It simply must be seen to be appreciated. In 2001, it was released on DVD as the first of Disney's \"Platinum Editions\". And many months before it was in stores, there was great speculation about the content. All the anticipation was justified when the DVD finally arrived. Critics and consumers were overwhelmed (just like the audiences back in 1937) with both the content and the painstaking restoration (beyond that done for it's 50th anniversary reissue) and made it THE DVD for the subsequent holiday season. Without going into detail, it looks as if it were made yesterday, and sounds better than a film of this vintage could ever be expected to. But the streamlining has not diminished it's charm--only accentuated it. And when you think (before you are drawn into the story, and you ARE) that \"Snow White\", unlike today's computer-drawn animated features was entirely done by hand, that makes it even more of a miracle.In one scene, when Snow White is scrubbing the steps of the Castle, and pours water from a bucket on them, the effect is remarkable-and that one, near the beginning, is just one small sample of the film's artistry.Back to the DVD. Instead of listing the already well publicized bonus features, let me say that this \"Platinum Edition\" is like a self-contained history of the film, with hours worth of delights the most astounding being a pieced-together commentary by Walt Disney himself. Out of print for years, it is well worth the effort and expense to find. And although Disney made it a point to announce that they planned to go even further with their subsequent \"Platinum Editions\", they have yet to top this one. And I doubt they ever will. Incidentally, this year marks the film's 75th anniversary, and I can think of no better way to celebrate this movie milestone than picking up Professor Kaufman's beautiful new books The second volume '' Snow White And The Seven Dwarfs:The Art And Creation Of Walt Disney's Classic Animated film''is also published by Weldon Owen/Disney Press.It's a very extensive and fully detailed catalog of the ''Snow White'' exhibition,(currently at the Walt Disney museum in San Francisco,California).Here, the emphasis is more on the beautiful art as well as rough sketches and background paintings. Along with it's companion book ''The Fairest One Of All'' it will educate and enchant anyone who cares about the history of Film, Disney Animation and especially ''Snow White'' They are, without a doubt,the definitive tributes to a Timeless Classic, and together, they make perfect souveniers for both the film's 75th Anniversary and and a once in a lifetime event.","user":"phillindholm","rank":[97,108]}]