[{"title":"The Toxic Avenger Part III The Last Temptation of Toxie: Drivel","rating":2,"date":"20 November 2018","review":"The previous two Toxic Avenger films managed a total 5 points out of a potential 20 from me so it goes without saying that Troma hardly have a fan here.<br><br>The companies most famous character returns for a third and perhaps worst outing. Here Toxie sells his soul to the devil in order to raise the money for his girlfriends eye surgery, and that's basically it.<br><br>Unlike part 2 there aren't even any purile gags to be found here and the whole thing is cringe inducing. If a 5yr old were given money to have a movie filmed based on their writing I'm pretty sure this is what it'd look like.<br><br>Toxic vomit, men in tutus, another awkward Toxie sex scene and random dog people are to be found and little else. Childish, dumb and I can't believe there is another one and that I'm going to watch it.<br><br>The Good:<br><br>Consistent cast<br><br>The Bad:<br><br>Simply not funny<br><br>Things I Learnt From This Movie:<br><br>Intestines make great skipping ropes<br><br>Tattoo removal in the 80's was savage!<br><br>Redneck Zombies was not a Disney film","user":"Platypuschow","rank":[9,9]},{"title":"#3","rating":3,"date":"3 January 2004","review":"I'm probably the only person that likes this installment. Even Kaufman himself doesnt care for it but I like this one. I can't really compare it to part II becuase c'mon..it's pretty much the same movie just a 2nd half. Toxie III is the 2nd half of an overlong movie that was split down the middle. It opens with an awesome scene a video store with Troma posters covering the place , some bonehead criminals pop in to cause trouble attacking the role Troma plays on consumer favorites like anything released by Warner Bros and MGM. It's also an attack on how mainstream chain video stores like Movie Gallery and Blockbuster are driving independent mom n pop video stores out which always have an awesome variety of movies..especially low budget horror on their shelves. Toxie bust in as a symbol of Troma's stance on cleaning up these corporations with some grissly death scenes..ahh how funny jump roping with intestines is. After this Toxie isnt having as much fun as he used to , he's resorted to stopping old ladies from cheating at cards..to getting kids to eat their lima beans. That annoying girlfriend Claire can get her eyes corrected with an operation..all Toxie needs is money. He signs a deal with Apoclypse Inc the corporation he ran out in Part II and gets her the operation.. And so Toxie becomes the most horrible thing of all..a yuppie. Clearly taking a stab at the Reagan era spoiled brats Toxie III has the least action in the series..in fact the entire middle is pretty lifeless until the chairman (again Rick Collins) reveals himself to be none other than the Devil himself and challenges Toxie to the Levels Of Doom. In the end..you'll just have to see it. Definitly not the best in the series..but hey..it's got it's moments see it anyway...but probably only really worth it in the Unrated Directors Cut since the R version omits most of the gore in the first half.","user":"chaosnbeer","rank":[6,7]},{"title":"Great opening scene, but very disappointing overall","rating":7,"date":"20 March 2003","review":"As somebody who for the first time just got to watch all of the Toxic Avenger films back to back, it is all too obvious that splitting the original 2nd film into two films was a rather big mistake.  While this film does have some of the best moments in the Toxic Avenger series, the film feels flat due to the major lack of action in the film overall.<br><br>There are several very good moments in the film however worth seeing. The opening videostore heist, containing what has got to be the weirdest (and funniest) cardboard cutout joke I've ever seen in my life, along with a obvious kick in the shins to what would later be known as the \"Media Cartel\" courtesy of Lloyd Kaufman.  Another classic is obviously the end fight between Troma's rendition of the Ultimate Evil and Toxie.<br><br>Overall, for fans of Toxie and Troma this is a mandatory viewing. However, I have to agree with Stan Lee's opening narration of Citizen Toxie when parts 2 and 3 were disowned.","user":"AlucardAnderson","rank":[4,5]}]