[{"title":"All That Jazz","rating":8,"date":"26 August 2007","review":"Part fictional and part non-fictional, this lavish two-hour Francis Ford Coppola film spotlights the Cotton Club, the legendary, real-life Harlem jazz nightclub that flourished in the Prohibition era of the late 1920s and early 1930s. Richard Gere plays Dixie Dwyer, a young musician who works for mobsters, in an effort to advance his career. Dwyer falls in love with Vera Cicero (Diane Lane), the girlfriend of gangster Dutch Schultz (James Remar). The Dwyer character is based loosely on real-life jazz trumpet player Bix Beiderbecke.<br><br>Throughout the film, various gangsters and bootleggers interact, sometimes violently, but much of the action centers around the Cotton Club, an establishment owned in real-life by Owney Madden, played in the film by actor Bob Hoskins. Madden would bring in Black performers to entertain a Whites-only clientèle, a truly racist policy, and a major plot point in the film's story.<br><br>The film's plot is somewhat muddled, the result of a less than stellar screenplay. And, as you would expect, the gangster characters are not terribly likable. But the film overcomes these script weaknesses with a captivating visual and musical style that is both tawdry and elegant. The corruption, the violence, and the implied sleaze are garish and tawdry to be sure. Yet, the Club's ambiance gushes with a certain elegance and glamour. It's a strange mix, but one that is entirely consistent with that era in U.S. history.<br><br>The film gets points from me for its lush, period piece costumes and production design, and adroit lighting, as well as all those jazz numbers, both sultry and flashy. Gregory Hines together with brother Maurice Hines provide some snappy tap dancing, some of which is improvised. Interestingly, their grandmother really did perform at the Cotton Club during its heyday. Also of interest in the film, viewers get to watch towering Fred Gwynne, who plays Frenchy, the oh-so-serious assistant to Owney Madden; the two of them engage in some interesting dialogue.<br><br>Although the script's story and characters are less than ideal, I enjoyed the film a lot, mostly as a result of the tawdry and elegant visual style combined with the lavish jazz numbers. If you're interested in gangster movies or the Prohibition era of American history, this film is a must-see.","user":"Lechuguilla","rank":[31,35]},{"title":"One of Francis Coppola's best and underrated films","rating":19,"date":"19 July 2002","review":"The Cotton Club is such a well-made movie, you have to wonder why so many critics and audiences ignored it when it was first released.  Was it because of the murder case surrounding its production?  Or did some people feel that a mixture of gangster films and Hollywood musicals didn't mix?  Whatever the reason, The Cotton Club deserves to be watched again and again, not just for its music and dancing, but for the great performances, scenery, cars, costumes...and tommy-guns.  The movie was nominated for two Oscars, but a third nomination should have gone to Bob Hoskins, for his brilliant performance as Owney Madden.  Despite his few film credits, James Remar is brilliant as Dutch Schultz and comes across as the sort of person you wouldn't want to meet in a dark alley.<br><br>There are rumours the film may be re-released with scenes and music that were cut from the original version.  If this is true, would the film finally become a hit?  After all, Robert Evans, the film's producer, apparently told one reporter...\"How can it miss?  It's got gangsters, music and girls.\" Well said, Robert.","user":"broadfoot","rank":[56,67]},{"title":"Companion to the pictoral history of The Cotton Club","rating":8,"date":"8 July 2003","review":"inspired by photographs of the legendary Cotton Club in Harlem, some shots appear exactly as they were (now in colour). I noticed Dutch Schultz's slumped pose when he is shot is exactly that of the police photograph, though he died several hours later (see William Burroughs \"The Last Words Of Dutch Schultz\"). The actors often play too broad (Diane Lane), and Richard Gere shows his lazy, grinning acting here too. However, many notable smaller roles for Gregory Hines (and his brother), Bob Hoskins, Laurence Fishburne and others who make it well worth watching. It is true that $40 million could have been used better, but when you consider both Bob Evans and Coppola's involvement it seems with hindsight that they were asking for trouble. The music deserves special credit, as do the tap sequences (which i gather were shortened and some cut - what a shame). Mostly Duke Ellington classics. As i've already suggested the look is a perfect recreation of the time, but sadly the plot is patchy, some dialogue weak and it has been said before - there is no chemistry between the romantic leads. 9/10","user":"el1sdf","rank":[20,22]}]