[{"title":"The Girl Scouts...Beverly Hills style.","rating":6,"date":"14 April 2004","review":"Troop Beverly Hills is a funny movie for pre-teen girls. Goofy Shelly Long plays eccentric Beverly Hills mom, Phyllis Nefler, who decides to get involved with her daughter's life and prove that she can do things for herself (sort of), so she becomes troop leader of her daughter's Wilderness Girl's squad. <br><br>This proves to be an embarrassing experience for the young girls, seeking some much needed leadership from their mother who can't seem to gain independence from the luxuries of her Beverly Hills lifestyle. But, once the pack is forced to compete with an aggressive, survival squad of hard core rival troopers, Phyllis and her team, tired of being a laughing stock (and also because Phyllis wants to gain her daughter's confidence and respect) are going to prove that they're not just a bunch of whiny rich girls from Beverly Hills. <br><br>80s fans will probably recognize many of the young troopers (from Jenny Lewis to Kelli Martin to Tori Spelling), and I'm sure pre-teen girls are sure to like the movie for it's silly story, young female cast, and the goofy antics of Shelly Long. It's a hilarious little movie with a good message for kids about the importance of female independence (Phyllis doesn't want her husband to think she can't fend for herself without a man's guidance) as well as individual confidence. It's bona fide family fun.","user":"vertigo_14","rank":[18,19]},{"title":"No grit and grime.Just glamour and glitz for Troop Beverly Hills!","rating":9,"date":"12 March 2005","review":"If only all girls scouts were as fun as Troop Beverly Hills! The film about a down and out divorced house wife with a passion for fashion becoming a girl's scout leader is both hilarious,exciting and thoroughly entertaining.Comedic actress Shelley Long shines as Phyllis Nefler,the woman who dares to make alterations to her daughter's scout uniform,and modify the location of their bushland camping trips to the Beverly Hills Hotel! Phyllis rejects traditional scout activities such as bush walking for manicures and pedicures,preferring her troops to live in the lap of luxury.Needless to say,the girls adore her,the leaders of the other scout groups despise her,and this is all makes the delightful,hilarious and wacky comedy that is Troop Beverly Hills!","user":"BettieTeese","rank":[27,30]},{"title":"adorable!","rating":27,"date":"27 June 1999","review":"A stereotypical portrayal of a Beverly Hills \"Wilderness Girls\" troup of pre-adolescent girls and their flighty but maternal leader, Phyllis Neffler, played by Shelley Long.  Phyllis is going through a \"terribly messy divorce\" to her husband Fred the Muffler Man and decides on a whim to take over her daughter, Hannah's troup.  The group encounters many problems that spawn from the jealousy of Velda Plender, the organization's leader who resents the rather \"untraditional\" ways of the Beverly Hills troup.  All of these hilarious incidents lead up to the Wilderness jambouree where... oh see for yourself!  Although not particularly deep, this movie is sentimental, hilarious, and adorable all rolled into one.  The antics of the sheltered Beverly Hills troup are guaranteed to make you laugh.  This movie is definitely a must see!","user":"Denny","rank":[16,17]}]