[{"title":"The BEST desert nature footage ever made!","rating":10,"date":"22 June 2003","review":"Everyone of all ages should have the opportunity to see this great film. Living desert took 3 years to make and was the spinoff of a doctoral thesis. It features real life desert adventure footage. Red tailed hawk vs. rattlesnake, ground squirrel vs. gila monster, kangaroo rat vs. sidewinder--- it's all here. The real highlight is a breathtaking 2'25\" confrontation in which a large female wasp subdues and paralyzes a tarantula with her stinger. The film also features beautiful botanical time lapse photography in brilliant color. The \"Best Documentary Oscar\" was created specifically for this film and it was the first recipient of the award. I,ve seen a lot of desert nature footage over the years, but Living Desert is still the standard by which all of the others are measured.","user":"3119jmarchese","rank":[14,14]},{"title":"Never ages, quite lovely","rating":8,"date":"27 August 2005","review":"1953 Oscar winner for Best Documentary prompts the question, \"Why don't they even make documentaries like this anymore?\"...yet, the advent of the success of \"March of the Penguins\" proves that perhaps they do. This live-action film from the Disney studios details the lives of the animals and insects that fill up America's Southwest desert region. Some of the footage is manipulated for a jokey effect, but why complain when it is such a beautifully assembled picture? Colorful and entertaining, it's the perfect primer for children. Disney continued in this True-Life vein with \"The Vanishing Prairie\" in 1954. Very lovely, with a terrific background score and narration. Classic Disney.","user":"moonspinner55","rank":[12,12]},{"title":"Beautiful and educational without being stuffy","rating":6,"date":"6 April 2005","review":"Wow, what a nice film! It's true that they just don't make documentaries like this anymore. The Technicolor is gorgeous, and narrator's voice is classically 50's. The score is whimsically apt, and the whole effect is just campy fun. \"The Living Desert\" is a truly enjoyable film. It educates without lecturing - a rare and very appealing quality. Children and adults will both enjoy following the antics of the kangaroo rats and other creatures of the desert. This film is a great example of the kind of wonderful work the Disney studio used to produce. One note of caution - if you are squeamish about insects, spiders, or snakes, don't watch this!!! All three get plenty of screen time, in full-blown Technicolor close-ups. I definitely had to close my eyes when the tarantula was on screen. Eek!","user":"birdinthecity","rank":[11,11]}]