[{"title":"A great western which enables multiple interpretations","rating":9,"date":"30 April 2005","review":"John Wayne is \"The Ringo Kid\" in this John Ford-directed parable of outcasts traveling towards various kinds of figurative and literal redemption/salvation. On a surface level, the basic plot is disarmingly simple--a motley crew of eight takes a stagecoach from Tonto to Lordsburg, trying to avoid Geronimo and his Apaches on the way. They are having their own problems with the U.S. government and are thus likely to attack. The stagecoach bounces from outpost to outpost while the relationships of its passengers evolve, helping each other to \"find themselves\" and (usually) providing hope of some kind of new life.<br><br>The Ringo Kid has been wrongly accused of a crime and is on his way to Lordsburg to avenge both the false accusations and more importantly, the murder of his father and brother. Dallas (Claire Trevor) is implied to be a prostitute, and so is ostracized from Tonto (which means \"stupid\", \"foolish\" or \"daft\" in Spanish) by a self-stylized matronly moral majority. Doc Boone (Thomas Mitchell) is far more concerned with getting drunk than being a doctor, and is partially ostracizing himself from Tonto. Hatfield (John Carradine) is a \"gambler gentleman\" with a shady reputation and a false identity. Lucy Mallory (Louise Platt) is trying to get to her husband, who is in the military; she's in a surprisingly \"secret\" physical state. Samuel Peacock, whom everyone keeps mistaking for a reverend, is in the alcohol business and just wants to get back east to get back to his business. Henry Gatewood is a crooked banker trying to flee before his questionable dealings are discovered. And the stagecoach drivers consist of a lovable buffoon, Buck (Andy Devine) and the most forthright, straight arrow of the bunch, Marshal Curly Wilcox (George Bancroft).<br><br>Even though Stagecoach remains tightly focused on its wilderness road trip, that might seem like a large stable of characters to shape into a taut plot. Ford, working from script by Dudley Nichols and Ben Hecht, based on a short story, \"Stage to Lordsburg\", by Ernest Haycox (which itself bears a relation to Guy de Maupassant's \"Boule de Suif\", 1880), keeps the proceedings in check by only giving us the information we need to explore the evolving relationships, and only focusing on each character when they're important to the plot. This results in a few of the characters being functionally absent for extended lengths of time, but Ford can so easily establish a \"deep\" character with a minimum of screen time that the absences are not a detriment.<br><br>The principal focus, of course, is between Ringo and Dallas, as on a significant level, Stagecoach becomes a romance. They're initially brought together via their mutual ostracization, even among the ostracized, which gives them an immediate bond beyond their physical attraction towards one another. Wayne and Trevor are both fantastic in their roles, avoiding the occasional overacting by some other performers. But this is a film where it's difficult to count the slight overacting as a flaw, as it was more of a stylistic tendency of the genre during this period and it provides a nice counterbalance to Wayne and Trevor.<br><br>Stagecoach is also famous for its setting. Much of the film was shot in Utah's Monument Valley, along authentic stagecoach \"roads\". The (beautiful) starkness of the desert is often taken as a symbolic trip through a kind of purgatory for the characters, where they're left alone with their souls, their only connection being their small group, to contemplate their pasts and futures. Whether we choose to read something along those lines into the film or not, Monument Valley is at least a captivating presence in the film, although for me, the cinematography could have been better technically, especially considering that Stagecoach was made at the same time as The Wizard of Oz (1939). Ford's famous tendency to do only one take results in a couple minor gaffes, such as the initial shot of John Wayne--a zoom into a close-up--that is out of focus for most of the zoom.<br><br>As one could guess, eventually our passengers run into a band of Apaches, who are often interpreted as representing more of a \"natural force\" that our heroes must surmount. The climax features a fabulous extended chase/fight sequence with a number of amazing stunts by both humans and animals. The most impressive human stunts are performed by the legendary Yakima Canutt, including one that involved being dragged through the dirt by the horse-pulled stagecoach, which was moving along at about 40 miles per hour and supposedly missed running over Canutt by only 12 inches (30.5 cm). This scene was an inspiration for a similar stunt in Steven Spielberg's Raiders of the Lost Ark (1981).<br><br>Although it's not a \"perfect\" film to me, and it's not even my favorite western (I'm more partial to the classic spaghetti westerns, for example), Stagecoach is a very good film and was very influential, despite being made at a time when Ford was told that he was committing professional suicide by even contemplating a western. As the plethora of critical literature attests, it works on many levels, including as an allegorical microcosm of U.S. Depression-era society, and should be seen at least once by anyone serious about film literacy.","user":"BrandtSponseller","rank":[125,150]},{"title":"The western that made Wayne a major movie star, the western that upgraded the genre from B grade to A grade n the first western that was shot in the beautiful Monument Valley.","rating":10,"date":"6 May 2018","review":"Saw this in the 90s on a vhs. Revisited it recently on a bluray. It is an awesome entertaining film with beautiful scenery n amazing action sequences. The long shots captured the landscapes well, the characters r all very memorable n the tension is maintained throughout, the action scenes were top notch, especially the stagecoach running in the middle of the vast wide open space n pursued by the Indians. Wayne shooting his guns from the top n he controlling the horses were amazing action sequences.\nThis movie did two great things. Wayne became a major movie star n western movies upgraded to A grade. It is also the first western shot in the beautiful Monument Valley.\nThe movie is about a group of passengers who r travelling in a stagecoach. The passengers are given the alarming news that Geronimo is on the warpath and that their lives are in danger but each of the passenges has their own reasons for taking the risk.\nWhen the Marshall is informed that an outlaw is present in the destination town, he joins the stagecoach which is filled with a driver whos got a unique voice, a prostitute who has just been forced out of the previous town, a drunken doctor, a pregnant woman, a gambler, a liquor salesman and a crooked banker.\nWayne gets a solid entrance after we have heard about him multiple times from other characters.\nRingo Kid (Wayne) joins the stagecoach cos his horse has gone lame. He has to surrender his gun to the Marshall n will be arrested once they reach the destined town but our Ringo kid has to settle score with a trio of outlaws who killed his father n brother.","user":"Fella_shibby","rank":[24,27]},{"title":"Great ensemble western","rating":10,"date":"6 May 2004","review":"I grew up watching the old, crotchety, gruff John Wayne, the iconic hero of the right wing, and even though I'd seen some of his early films on television, I'd forgotten what a sexy and compelling presence he had when a young man. It's easy to see while watching his performance how this film made him a star. As great as Wayne is in this film, he doesn't overshadow any of his fellow performers. Thomas Mitchell plays the drunken doctor thrown out of town, a performance that earned him an Academy Award. Andy Devine is hilarious as the complaining, squeaky voiced stagecoach driver. John Carradine is sleek and snake-like as the gambler. Claire Trevor gives a heartbreaking turn as the good-hearted whore thrown out of town by pious hypocrites. Donald Meek plays his name, a meek whiskey salesman befriended by the whiskey-loving Doc. Each actor quickly and deftly sketches his character so vividly that every performance is memorable.<br><br>But the real star of the show is John Ford, the director. To introduce and define nine characters in the context of a fast-paced western is no easy task, and he accomplishes it in masterly fashion. Much of the action takes place in the limited confines of a stagecoach, but Ford takes advantage of the limits by staging brilliant and subtle bits between characters; John Wayne casts sultry glances at Clare Trevor, who blossoms under his glance, the young calvary wife's eyes glaze over as the banker pontificates, and Doc sneaks sips of whiskey from the samples case while he solicitously keeps the wind from chilling the whiskey salesman. When the action moves outside, he films the action in dynamic angles and stunts that were the most daring of its time.<br><br>If you enjoy westerns and haven't seen this, you have a great night of film-watching ahead of you. And if the last time you saw Stagecoach was some midnight years ago when you wandered home for a bit of the late show before bedtime, watch it again and rediscover what a great western it is","user":"ninazero","rank":[71,89]}]