[{"title":"Knick, Knack, Paddy Whack!","rating":8,"date":"12 December 2012","review":"The Criminal (AKA: The Concrete Jungle) is directed by Joseph Losey and written by Alun Owen. It stars Stanley Baker, Sam Wanamaker, Margrit Saad, Patrick Magee, Grégoire Aslan, Rupert Davies and Laurence Naismith. Music is by John Dankworth and cinematography by Robert Krasker.<br><br>Johnny Bannion (Baker) is an ex-con who's taken part in the robbery of a racetrack but is caught and sent back to prison; but not before he has time to bury the cash from the gig. Back in prison Johnny is keeping the cards close to his chest but finds there are big crime forces wanting a piece of his action. With plans afoot to \"twist\" his arm, and his girlfriend kidnapped, Johnny knows something is going to have to give...<br><br>All my sadness and all my joy, comes from loving a thieving boy.<br><br>Once tagged as being \"The toughest picture ever made in Britain\", The Criminal obviously seems tame by today's increasingly over the top standards. Yet it still packs quite a punch and shows the very best of Messrs Losey, Baker and Krasker.<br><br>In some ways it's a strange film, the pace is purposely slow and the narrative is bolstered by bouts of hang wringing tension, where periods of calm come laced with a grim oppressive atmosphere, but there's often electricity bristling in the air when Bannion (Baker is magnetic and brilliant as he apparently models the character on Albert Dimes) is holding court. Even when on the outside and feeling the love of a good woman, Bannion exudes a loner like danger, he's tough but being a hard bastard can't break him free from the shackles of his life. We know it and you sense that he himself knows it, and it gives the film an exciting edge not befitting the downbeat tone of the story. Characters here have not been delivered from happy land, you will struggle to find someone here who isn't nasty of heart, bad in the head or simply foolish. Inside this concrete jungle it's a multi cultural hive of emotional disintegration, and at the core stirring the honey pot is one Johnny Bannion. The film makers here are all about pessimism, self-destruction and the battle against the system and the underworld, right up to (and including) a finale fit to grace the best noirs of the 40s. <br><br>Losey and Krasker ensure the prison sequences are stifling, the walls close in, the bars and netting are unsettling and close ups of the odd ball assortment of crims and warders strike an incarcerated chord, visually it's an impressive piece of noirish film. But it's not just about shadows and filtered light, the director has skills aplenty with his camera. A kaleidoscope shot has a delightfully off kilter kink to it, while his overhead filming and pull away crane usage for the frosty cold finale is as memorable as it is skillful in selection. Musically the pic begins and ends with the soulful warbling of Cleo Laine, the tune is a Prison Ballad (Thieving Boy), and it's tonally perfect, while Dankworth and his orchestra provide jazz shards that thrust in and out of the story like knowing accomplices to fate unfolding. Set design is superb, especially for the recreation of a Victorian prison which is impressive and makes it easy to not lament an actual prison location used, while the supporting actors are very strong, particularly Magee (Zulu) who excels doing sneaky menace as Warder Barrows.<br><br>Flaws? Not any if you don't actually expect the toughest film made in Britain back in the day (though it was banned in some countries!). I do wonder why Baker had to be an Irish character and not just be Welsh and therefore do his natural Welsh accent? And if we are are being over critical we could suggest there are some prison stereotypes that even by 1960 were looking frayed around the edges. But ultimately this is tough stuff, a gritty and moody piece of cinema with class on either side of the camera. 8/10","user":"hitchcockthelegend","rank":[11,12]},{"title":"Falling between two stools","rating":7,"date":"25 April 2009","review":"A strange film.<br><br>On the one hand it is a realistically drawn Melvillean study of criminals who fall out and destroy one another; on the other it is a non-naturalistic Behanesque portrayal of prison life, its hierarchies and the relationships among and between warders and prisoners. At a guess, the crime story dominated in the original script and Alun Owen emphasised the prison scenes and introduced the element of ensemble work in the later version. The problem with this mixture of films, either of which could be good on its own, is that they don't fit together- that's leaving aside the film's Dickensian relish for characters, regardless of their relevance to the story. Thus the comic Northerner who wants to hire the gang's getaway taxi after the robbery, the piano-tuner in Bannion's flat (what does Bannion want a piano for anyway?- it's isn't consistent with his character.) when they are talking plans for the robbery, many of the prisoners- effectively portrayed as helplessly institutionalised, Magee's talismanic and enigmatic head warder, the prison doctor, the cynical prison governor- all distract from the film's plot, but aren't given enough time for their own story, which might be more interesting- the mixture of antagonism and co-operation between prison staff and prisoners- \"Come on\" says a screw, \"I always treat you straight; you do the same for me.\" an effective tactic- is well-portrayed and rouses our interest without satisfying it. Equally, important parts of the crime story are thrown away- we never see the robbery and Bannion goes back to prison remarkably quickly- six weeks, we are told- we never even learn how long he will spend back in prison. The women- the abandoned moll played by Jill Bennett and her replacement- aren't convincing at all, mere plot-devices; on the other hand, the suggestion that some of the characters are homosexual is well-placed and carefully shown in passing. There are strengths too- effective and sometimes beautiful camera-work, especially in the prison scenes, all of the actors are good in their parts, a very fine score by John Dankworth. It's certainly a film worth seeing, but we can't help regretting what it could be but isn't- but then, that's true of so many British films.","user":"allenrogerj","rank":[9,10]},{"title":"Gripping from start to finish","rating":10,"date":"21 March 2001","review":"Joseph Losey does a superb job of directing cinema-verite'-style from start to finish.  From the moment Cleo Laine sings Thieving Boy over the opening credits, I knew I was in for a special experience.  Stanley Baker spent a career delivering some of the most haunting criminal characterizations of all time, and this is one of his all-time best.  Patrick Magee is memorable in a minor supporting role. An incredible gritty film.","user":"aromatic-2","rank":[20,28]}]