[{"title":"A Classic Woody picture, one of my favorites of his","rating":10,"date":"18 August 2005","review":"Woody Allen's Purple Rose of Cairo is a brilliant piece of film-making. He combines drama, comedy and even a little bit fiction (people jumping out of movie screens into the real world). Its a great story involving a woman with marital problems played superbly by Mia Farrow. Here Farrow gives one of her best performances, much better than she was in a film i recently viewed called Shadows and Fog. Jeff Daniels is also good in his role as the movie character who comes into the real world, as well as the actor who plays that role. This is by far one of the most complex yet well written Woody Allen flicks. All the performances are good as well as the direction and writing, almost everything is perfect. A must-see for any Woody fan.10/10 #60 on my list of all-time favorite films","user":"PersianPlaya408","rank":[51,53]},{"title":"Our Daily Escape","rating":10,"date":"9 May 2017","review":"The only Woody Allen that I hadn't seen. I was waiting for the opportunity to see it on a proper screen in a proper movie theater, with other people you know, like in the previous century. At the end I was convinced to see it in a friend's living room but in one of those super duper mega wide TV screens. What a delight! A movie about the love of something not quite real but that it becomes the more real thing in our lives. The transportation that Mia Farrow goes through while sitting in the movie theater brought tears to my eyes - my friend turned to me in disbelief \"Are you weeping? He asked. Well yes, I was. I can't explain it. Have you seen the movie? Sometimes I felt I wanted to sit next to Mia Farrow in see the movie she's watching all the way through. Why not, Jeff Daniels, Mia Farrow, John Wood, Zoe Caldwell, Van Johnson, please! It's so much better in here than out here. You can bet I will see this again. Top notch.","user":"ggallegosgroupuk","rank":[50,53]},{"title":"One of his Great Ones","rating":25,"date":"25 July 2002","review":"A movie I like to recommend to people who really dislike Woody Allen (because of his on-screen characters or off-screen life).  And I usually get positive feedback.....he does not appear in this movie, and that makes sense because there really are no characters he could play in The Purple Rose of Cairo.  It is a hugely entertaining movie--one of his best.  Sharp, hilarious, and poignant.  And anyone who can keep a dry eye for that ending must be a machine. This is the movie where Jeff Daniels really gets to strut his best comic stuff.  He's always been underrated in my opinion.  He's terrific at playing the \"Everyman,\" but in Allen's movie he has a duel role--the clueless movie hunk who leaps off the screen to be with Mia Farrow, and the frustrated actor who plays him.  Farrow is also good, back to playing mousey after her bold turn in Broadway Danny Rose. I really can't say enough about this.  I would rank it as his best film of the '80s.  I never get tired of watching it.  I don't like using this adjective, but it seems to fit the movie....it is magical.","user":"drosse67","rank":[70,77]}]