[{"title":"Beach Girls Is A Blast!","rating":5,"date":"5 April 2004","review":"I first saw this movie on late-night Cinemax when I was about fourteen years old. It has become a cult classic in my book. I showed it to all my friends after taping it. It is an absolute hoot! It's so bad that it is absolutely hilarious! The story: Virginial Sarah (Deborah Blee, who went on to the triumphant \"Hamburger: The Motion Picture\") goes to spend the summer at her Uncle Carl's beach house. Sarah has invited two friends to join her for the summer: Loose hussies Ducky (Jenna Thomasina, a PLAYBOY playmate of the year) and Ginger (bleach-blonde Val Kline, who seems to have vanished.) Much to the disapproval of Sarah, Ginger &amp; Ducky turn Uncle Carl's beach house into a wild, no-holds-barred sex, drugs, and alcohol orgy. When Uncle Carl arrives unexpectedly, he demands that the party stop, but topless Ginger and Ducky ply him with booze and marijuana, and soon Uncle Carl joins in the party. Meanwhile, drug smugglers being chased by the Coast Guard dump dozens of garbage bags filled with pot into the ocean, and the bags float up in front of Uncle Carl's. What follows is a wild pot party, with the Coast Guard raiding Uncle Carl's and building a bonfire with all of the confiscated weed. Everybody gets deleriously high. That's the movie! I could list some truly classic lines but there's not enough space. Trust me...this is funny, funny, funny...in a good/bad sort of way. Get your hands on it if you can! Great party flick!","user":"robc-11","rank":[32,35]},{"title":"Fluffy, light hearted teenage T & A flick","rating":5,"date":"12 October 1999","review":"The acting in this beach romp feast is not to be compared with the likes of Citizen Kane, more likely to that of Hard Bodies 1&amp;2. This movie would by most standards be regarded as a \"B\" movie, but even at that it is a easy viewing movie, there's no political messages, no stands for anything, just some parody, slap-stick and a little skin. If you feel this movie may not be mentally stimulating enough, sit back,relax and mellow out for a little laughs and silliness.","user":"DKehr","rank":[20,22]},{"title":"I wanna go back to early 80's!!!!","rating":8,"date":"25 January 2009","review":"AWWW... The beach girls, an ol cable favorite. First saw this back in summer of 83 on many cable channels running it. It has the makings of an early 80's sex/comedy for sure. Good looking girls, parties and good atmosphere. Story isn't much, centers around three girls around college age who just wanna party and get naked every chance they can.. Out of the three, we have Sarah, the smart one with the rich uncle who lets her stay at his beach house. Now, uncle has no idea shes bringing her friends and throwing orgies, parties etc. But once he finds out hes in on getting her two friends for a pot smoking frenzy to keep him cool with them staying at the beach house and carrying on the party. There's also this dude that shows up named scott, hes picked up hitchhiking by the two wild friends, now scott seems very out of place in this picture. First off, he appears to be in his thirties and a drifter to boot. He seems so 1970's like hes way out of his element with these girls. But once scott meets sarah, he likes her and wants to protect her from any bad influences which includes trying to start a fight with some kid who trys to dance with sarah. Very strange considering hes only met her a few hours ago.. But overall, the beach girls does have that early 80's beach/sex/comedy feel to it... It really at times feels like a vacation itself . A departure from the movies we have today. This is a film at a time where things seem more innocent than it is these days. Beach girls i think was shot sometime in 1981. And shown in a few theaters and drive -ins in 1982. And all over cable in the summer of 83.. if your looking for some interesting and good fun and some good nudity, beach girls is for you. Trivia, for those interested this low budget movie has a first role cameo from an 80's more less mid 80's actress Cathrine mary stewart. Shes on screen no longer than 2 seconds , don't blink. But shes at the end .. By the way the grindhouse DVD version thats out now along with a movie called coach is the one to get . The DVD transfer is really clean... and widescreen.","user":"saint-21","rank":[14,15]}]