[{"title":"A must to see for anyone who liked THE OMEN.","rating":10,"date":"10 November 2001","review":"This sequel to THE OMEN is a \"fun\" film.  It continues the story of the anti-Christ Damien into his teenage years and his years in military school. Now adopted into the family of his father's brother, an unsuspecting Damien is unwittingly at the centre of a plot to bring Satan's son to the threshold of power.  Everyone around him is at risk as the secret of Damien's birth is under threat of exposure by forces emerging from around the world - and at the root of this threat are the mad depictions painted on an ancient wall that reveal the very face of evil.<br><br>Jonathon Scott-Taylor gives a commanding and creepy performance as the ultimate misfit son.  Looking particularly significant in his military outfit, Scott-Taylor captures - as much as the script allows him - the torment of self-discovery as the truth of his existence is revealed to him. The script could have demanded more from such a fascinating scenario, and tried to make Damien more of a Miltonic Satanic Hero, but the film chooses to go for as much shock value whenever it can.  Mysterious and violent accidents - linked by the ever-present shadow of a raven of death - dominate this movie from beginning to end.  The scene involving an ill-fated lady on a deserted country road is one of its most grotesque.  As death and destruction mount, Damien goes from self-possessed orphan to self-recognized supreme power in the span of two hours.<br><br>William Holden and Lee Grant play Damien's surrogate parents, Richard and Ann Thorn.  They are not really allowed to display their incredible talents in this film, but Holden does fine trying to duplicate Peck's memorable performance in the original. Grant does what she can with this supporting role, but has a great moment in the film that proves worthy to wait for. The always wonderful Sylvia Sidney makes a memorable appearance as one of Damien's greatest \"thorns\" - the troublemaking menace Aunt Marion. And the ending is a bit of a shock if you watch the film closely, particularly if you listen to the exposition early on in the film about \"The Whore of Babylon.\"<br><br>Another highlight is Jerry Goldsmith's title score - empowering, commanding and downright evil, the opening score is one of my favorites.<br><br>\nAlthough not as creepy as the first film, DAMIEN: OMEN II has its moments, and is worth seeing for anyone who likes to have a fun time with all this biblical stuff.","user":"Christiancrouse","rank":[51,53]},{"title":"\"She pollutes the air with her craziness\"","rating":7,"date":"26 March 2005","review":"\"She pollutes the air with her craziness\", gotta love that line near the film's beginning. Damien:Omen II is an ambitious and entertaining sequel to the classic Omen. This film is an almost perfect stepping stone in the Omen trilogy, focusing on Damien Thorn becoming a teenager. The film obviously lacks the fresh originality of the first film but it still deserves credit for maintaining a sense of dread and menace when somebody crosses the young Damien Thorn. The death scenes are both chilling and creative and the film's trademark score is brilliant. As far as sequels go, Omen II is a solid effort, leading the pathway clearly open for the third chapter. In terms of comparison Omen II doesn't surpass the original but if you enjoyed the Omen then Damien:Omen II shouldn't disappoint.","user":"roh3220","rank":[34,39]},{"title":"Damien hits puberty.","rating":7,"date":"22 November 1998","review":"If you liked the first installment, you probably will like Damien-Omen II. It still has the creepiness involved in the first movie and the theme of good vs. evil.  But like the first Omen movie, it is quite predictable. Some of the kill scenes are good though, especially the elevator scene.<br><br>Take a shot and rent this one.  Just don't expect to see a classic.","user":"kneel","rank":[36,44]}]