[{"title":"Huge drive-in hit","rating":10,"date":"8 July 2002","review":"Despite what previous posters have been saying this movie was a big hit when it came out.  There was even a sequel a few years later.  But it was only a hit at drive-ins and (like other drive-in hits) has been largely forgotten. That's a shame because it's a really great movie.<br><br>It's not based on a true story (despite what they say at the beginning and end).  It's bloody, violent and made on virtually no budget.  It all works though because you get four believable characters--the two brothers (real life brothers Alan and Jesse Vint), the hitchhiker (Cheryl Waters) and the sheriff (Max Baer Jr.).  They all give natural, unforced performances and through the dialogue you get to know them and understand them.  The script is very well-written.  Still, this IS a drive-in movie so it opens with a sex scene including flashes of male and female nudity.  And the last half hour is frightening and includes a neat twist at the end.<br><br>A very good film that deserves to be rediscovered.  See it!","user":"preppy-3","rank":[28,29]},{"title":"Deep-fried","rating":24,"date":"24 August 2008","review":"70's gritnik cinema doesn't get much better. Pure tautness. Imagine Sam Peckinpah had done this, or John Boorman, or that it starred one of the many young upstarts of New Hollywood; it would've been one of the classic movies we referenced from this era, that's for sure.<br><br>Alas it had none of those things. But it wasn't a drive-in smash hit for no reason either and as much as high brow critics would dismiss the regular love-pit crowd as easily pleased or what have you, the truth is Macon County Line is an all around accomplished movie that is almost too good to be classified as exploitation. Or the kind of hicksploitation you find in movies like Gator Bait.<br><br>What starts as an amusing \"boys just wanna have fun\" road movie soon turns into a tight, gripping thriller but not without stopping to sample some of the local Lousiana colour first. The economy in the story is incredible, there's no frame wasted, nothing that doesn't propel the story forward or build mood or characters. The direction is confident, without highfallutin auteur-ism but with an efficiency and energy that suits the material.<br><br>What really elevates Macon is the superb cast. Names and faces I've never seen before but they're all perfect in their roles, understated and emotional in just the right measure and true to the characters they're supposed to be playing without becoming self-conscious caricatures of themselves. Even the backwoods mechanic carries an authenticity, a sense that you're watching a real person and that such people do exist.<br><br>Which brings me to another major success for the movie. It presents and inhabits a real world with real characters that have lived their lives there. The real locations and unknown cast sure help a great deal but so does the story, dialogues and actor interplay. We get a vision of the graphic South without the self-conscious quirks the Coens used in Raising Arizona or Oliver Stone in U-Turn, both great movies but still \"artificial\" in how they depict life.<br><br>Tightly edited, beautifully photographed, with cool music and a fine-tuned screenplay, memorable performances and an unexpected ending, Macon County Line justifies its cult status and drive-in success 30 years down the line and belongs in the very elite company of gritnik gems like Two-Lane Blacktop and Bring Me the Head of Alfredo Garcia.","user":"chaos-rampant","rank":[17,18]},{"title":"Tense, Tragic, Highly Watchable","rating":10,"date":"12 August 2005","review":"Macon County Line was apparently a huge hit at the drive-ins when it came out in the seventies but since I seldom went to drive-ins I missed it. A few years ago I caught it on television, and was very impressed, not so much by the story but by the way it's told. The film concerns a couple of out-of-town brothers caught up in violent crime and mistaken identity in the Deep South, where, in movie terms anyway, it's never a good place to be a Yankee without a road map, or worse, have your car break down. The story unfolds at a decent clip, and the actors are all good, some much better than than that. It's interesting seeing an old-timer like Emile Meyer in a movie with an up-and-comer like Leif Garret. The real surprise in the film is the strong, silent performance of Max Baer, Jr. in the key role of the deputy sheriff. Like most viewers, I tend to think of Baer as the gentle, simple giant, Jethro, on the long-running television series The Beverly Hillbillies. As the lawman in this movie Baer actually gives a serious performance. As a dramatic actor he comes off a little like James Garner, a little like Clint Eastwood, but he has a distinctive style of his own. There's something rock solid about Baer. He has real screen presence, and he comes off as alternately heroic and frightening, depending on what he's up to at the moment. Baer also produced the movie, and made a fortune from it. Baer may in real life be a gentle giant, but he sure ain't a simple one.<br><br>This is at times a very dark movie, violent and forbidding, and at times almost painfully tense. It may be a product of the Burt Reynolds good old boy era of movie-making, but it plays very differently from the kinds of films Reynolds made, closer in style to Sam Fuller or Phil Karlson.","user":"telegonus","rank":[21,23]}]