[{"title":"The TRUE origin of \"blaxploitation\"","rating":9,"date":"17 January 2001","review":"COTTON COMES TO HARLEM is the adaptation of Chester Himes' 1965 novel of the same title and stars Godfrey Cambridge and Raymond St. Jacques as his two Harlem police detectives \"Gravedigger\" Jones and \"Coffin\" Ed Johnson respectively.  Their motto:  \"[We] may have broke some heads, but we ain't never broke no promise.\"  Jones and Johnson are on the trail of \"Reverend\" Deke O'Malley (Calvin Lockhart.  O'Malley is funding a \"Back to Africa\" cruise by taking donations from the good people of the 'hood.  However, before he can make his getaway, a robbery breaks out and the money, hidden in a bale of cotton, gets lost in Harlem.  This sends the cops, O'Malley and the robbers on a wild search through the New York area for the stolen loot.  Redd Foxx appears as a junk dealer (two years before SANFORD AND SON) who holds the key to the fate of the money.<br><br>Oddly enough, the movie is less rough then Himes' novel (which had quite a bit of rough language and sex in it), yet received an R rating back then. It would hardly register as a PG-13 today.  COTTON COMES TO HARLEM should be seen to see the true origins of the genre known as \"blaxploitation\" (black exploitation movies).<br><br>COTTON is quite an enjoyable action romp.  It is especially light compared to the later \"blaxploitation\" films that followed it.","user":"Tresix","rank":[21,22]},{"title":"Hysterically Edgy","rating":9,"date":"8 July 2002","review":"Cambridge and St. Jacques are one of all time best buddy cop duos.  They are hip, sexy, and funny.  The mystery is intriguing, and the uncomfortable situations keep the viewer's attention throughout.  This is one to be seen uncut, because a lot of the humor is quite racy.  It's a time capsule in a way also since the Harlem depicted here no longer exists.","user":"turk_182","rank":[19,20]},{"title":"Tote That Cotton, Lift That Bale, It's Worth A Fortune","rating":6,"date":"2 March 2009","review":"One of the better black exploitation pictures to come out of the Seventies was Cotton Comes To Harlem where Raymond St. Jacques and Godfrey Cambridge gave a black twist to the male buddy film that so many white actors had done over the years going all the way back to James Cagney and Pat O'Brien.<br><br>St. Jacques and Cambridge play a pair of police detectives assigned to a precinct north of Central Park where they've drawn duty being security for a rally headed by the Reverend Calvin Lockhart who's got a nascent Back to Africa movement going. He's collecting money at his rally and preaching up a storm when some masked bandits armed with automatic weapons take off with the proceeds. The money gets hidden in a bale of cotton and then the bale gets ripped off.<br><br>Our two detectives got a whole host of suspects, some white numbers gangsters from Pleasant Avenue, black militants, the good reverend himself who St. Jacques has a passionate dislike for and various and assorted other criminal types. Lockhart is one charismatic preacher and as he says himself, he could be another Marcus Garvey who immediately came to mind before Lockhart mentioned his name during the film.<br><br>John Anderson and Eugene Roche are St. Jacques and Cambridge's superiors in the police department, Anderson impatient with them and Roche inclined to give them plenty of room to maneuver. Judy Pace plays Lockhart's mistress and one seductive temptress if there ever was one. And we can't forget Redd Foxx in a delightful performance as an old rummy whose ship might just be coming in.<br><br>Cotton Comes To Harlem moves at a very fast pace with absolutely not a wasted frame of film. It holds up very well after almost 40 years even if those fashions and those Afros don't.","user":"bkoganbing","rank":[15,16]}]