[{"title":"And They WERE Giants","rating":10,"date":"12 December 2005","review":"I saw this gem of a motion picture on television in the early 70's. I really was no more than a boy when I saw it and yet it touched me in a way that no other film had. For the first time I appreciated a piece of cinema for more than just idle distraction from dull small town Texas life. They Might Be Giants taught me that movies could be art and could elevate as much as they entertain. From that time to this, whenever I am asked what is my favourite film, I always point to this picture. It was done on a very low budget so the story, characters and amazing actors carry it along the streets of New York, creating a world of whimsical romance and serio-comic tension. The relationship between the mad Justin Playfair (a loony judge who thinks he's Sherlock Homes) and Dr. Mildred Watson (obviously destined to become the pschizo's unwilling side kick) builds into a romance that is funny, touching and, by the end, uplifting. It is available on DVD now and is a cherished piece of my extensive collection. 10 out of 10 all the way.","user":"patdwyer4","rank":[27,29]},{"title":"Magical film, full of poetry","rating":10,"date":"7 May 1999","review":"If you look for flaws in this film you will find plenty.  Still, I gave this film a 10 vote because it has overriding qualities which are extremely rare. It is a magical film, full of poetry, it touches you where other films cannot reach.  It creates a fantasy world of its own in the midst of modern society, a fantasy world which is utterly implausible and yet so compellingly persuasive.<br><br>The cast of this gem is mesmerisingly excellent, all parts I can think of are cast with character actors who on their own have stolen entire films from the stars.  The central performance by George C. Scott is majestic, and so is John Barry's wonderful score.  The film contains many memorable scenes, but outstanding amongst the lot is the supermarket scene.  If I had to compile a list of the ten best scenes ever put to celluloid, this would be included.<br><br>Unique.","user":"SMK-4","rank":[36,40]},{"title":"Ought to be on everybody's top-ten list.","rating":10,"date":"9 February 1999","review":"(Contains spoiler.) I recently did a free-lance graphic-design job for a video store owner. My pay? He had to come up with a copy of \"They Might Be Giants\" for me. He swore it was the last copy on Earth.<br><br>George C. Scott made Justin Playfair/Sherlock Holmes into a great film character. If you pay attention to his delightful patter, you hear a soulful philosophy of life that nails our culture  whether in 1971 or 1999. His rescue of poor Mr. Small made me want to cheer. Joanne Woodward's portrayal of Dr. Watson was brilliant. You could palpably feel the missing pieces of her wretched existence. \"Just keep repeating to yourself, \"I am adequate!\"<br><br>This may be one of the all-time best collection of character actors ever put together. Jack Guilford and Rue McClanahan were wonderful But so was every other actor that appeared. Al Lewis (III) as the messenger, \"You were right, Mr. Holmes. My dog did have Pellegra.\" The clueless march of the crazies en route to the supermarket was heroic. Too few people remember this film. If you get a chance, check this one out.<br><br>***Note - I originally wrote this comment seven years ago, but some of the new user comments prompted me to add to it. First, understand that Justin Playfair's condition is totally explained by Rue McClanahan, his sister-in-law. He was a brilliant jurist until his wife was killed. He couldn't cope with a world that allowed such bad things to happen. In an attempt to understand how bad things can happen to good people, he became the world's greatest sleuth in a relentless effort to understand evil. He showed saved newspaper clippings, of innocent people killed by inexplicable accidents, buses going off a cliff, boyscouts attacked, and so on. His one thread that held him to a tenuous sanity was the belief he could always figure it out... and that there were always clues.<br><br>He frequented an old movie house that showed old Westerns, where Randolph Scott always wore a white hat and won over the bad guys in black hats. The purest celluloid version of ultimate good over evil. In black and white. He did the London Times crossword puzzle in ink, and could read a person's life with the same exactitude as the original Sherlock. When he rescued Mr. Small, he commented under his breath, \"Why can't analysts ever analyze?\" The more he studied and investigated the clues, the surer he became that all the clues pointed toward one malevolent perpetrator - the evil mastermind, Moriarity. In the end, he knew he and Watson were no match for him, but that the noblest thing a Man could do was stand up against evil, even if it was a futile gesture. In that acceptance of holding onto good - even in the face of absolute evil - was his salvation. <br><br>In an insane world - only the insane are sane.","user":"Wm Lambe","rank":[29,32]}]