[{"title":"Clinches and clichés, not classic Ealing","rating":5,"date":"3 September 2005","review":"Based on the stage play by Ralph W.Peterson, THE SQUARE RING hardly ventures outside its theatrical roots but is one of the very few British films about the 'Noble Art'. It contains every single cliché known to boxing movies: the nervous novice, the washed up ex-champ looking for one more shot at the 'big time', the anxious wife who threatens to leave if he doesn't quit, the behind the scenes 'fix', camera close ups of ringsiders screaming for blood and of course the rows of spectators throwing imaginary punches during the fight scenes. Unfortunately THE SQUARE RING has the worst impersonation of a 'punch drunk' boxer in celluloid history. George Rose narrows his eyes into slits, screws his mouth sideways and ends up resembling a grumbling grotesque gargoyle. His repetitious rendering of the line \"first, first ...I'll show 'em\" in a strange, gravelly groaning whine is deeply embarrassing. It's a terrible performance from Rose. Almost as bad is Bill Travers as a morose heavyweight in a permanent state of idiocy, reading a juvenile comic and only answering questions in a monosyllabic, moronic fashion. These two wouldn't pass the stringent medical examinations of todays Boxing Board of Control. On the plus side THE SQUARE RING has an excellent performance from Bill Owen, who bounces into the dressing room full of vitality and spouts out lines like \"look at the nose son, not a dent in it\". He moves like a confident fit boxer even when he's not in the ring. Real life man and wife Maxwell Reed and Joan Collins share a few scenes, your enjoyment of these scenes will be enhanced if you read her autobiography before viewing the film. Ronald Lewis makes his film debut as a clean cut, shy, Welsh amateur having his first professional fight, who learns the hard way that the pro ranks aren't \"fair\". Look out for the stiff way he moves towards the centre of the ring when the first bell goes, it's unintentionally hilarious. If he moved like that in a real fight he wouldn't last 20 seconds. Also, watch out for the ending of his bruising battle, he literally sees stars (and so do we!). The climatic encounter between Kid Curtis (Robert Beatty) and the unbeaten prospect Barney Deakon (Alf Hines) contains some excellent camera work and is quite realistic. Robert Beatty, 44 at the time, looks too mature to be sporting the ring moniker \"Kid\". His opponent was played by the former light-heavyweight from West Ham, Alf Hines, a good club fighter who fought at the Albert Hall, Wembley and Earls Court and had just retired from the ring. He played a boxer in another Joan Collins movie THE GOOD DIE YOUNG, boxing historians should find it interesting that the world famous gym owner, Joe Bloom, was the referee in both these movies. On 2 June, 1958, a TV version with Sean Connery playing Rick Martell and a very young Alan Bates was broadcast on the ITV Play of the Week. THE SQUARE RING's technical adviser was Dave Crowley, the former British Lightweight Champion, it's not a bad little movie and is well worth watching. Fans of CARRY ON comedies will enjoy the early performances of Sid James and Joan Sims.","user":"James_Byrne","rank":[20,24]},{"title":"On the ropes","rating":1,"date":"1 May 2015","review":"Directed by Basil Dearden, and based on a stage-play by Ralph Peterson, \"The Square Ring\" observes several characters over the course of one night. These characters are linked to a seedy boxing venue, in which they work, hustle, trade blows or mourn for lovers lost.<br><br>Despite a predictable script, \"The Square Ring's\" aesthetic is fairly sophisticated. Dearden's camera glides into and out of shadowy back-rooms, cleverly juggles subplots, and teases his audience with the prospect of eye-balling the film's titular ring. Released by Ealing Studios, Jack Warner and Robert Beatty co-star.<br><br>7/10 – See \"The Hustler\" and \"This Sporting Life\".","user":"tieman64","rank":[5,7]},{"title":"An Underrated British Gem","rating":8,"date":"16 December 2018","review":"A British film from the 50's about professional boxing. We get to meet those fighters who participate in a one-night event that involves a programme of many fights.<br><br>This film is like a snapshot of a long lost era of British filmmaking. We have great characters, a sly sense of humour at play and grit in the way the sport is portrayed as completely corrupt and in turn corrupting.<br><br>The film also shows how truly brutal the sport is. The ending is totally gut-wrenching and completely unexpected.<br><br>We also get British film royalty in the guise of legends such as Joan Collins, Joan Sims and Sid James as part of the cast.<br><br>Highly recommended.","user":"meathookcinema","rank":[0,0]}]