[{"title":"Bogart and Grahame Are Great","rating":9,"date":"4 July 2005","review":"Very adult film about a surly Hollywood writer, a would be actress, and a murder. Among the very best Bogart performances, yet this film is practically unknown. Top notch acting across the board. Bogart and Grahame are a terrific team (she is the designing actress), but also good are Frank Lovejoy, Jeff Donnell (as his wife), Martha Stewart (no not that one) as the murder victim, Art Smith as the agent, and Robert Warwick (just wonderful) as the washed-up actor. Everything in the story revolves around Hollywood and movie making, but this is NOT really a film about Hollywood; it's a murder mystery. Great script is full of memorable lines, and all the supporting actors are sharp. Ruth Warren is funny as the maid, and Ruth Gillette is really spooky as the masseuse. Carl Benton Reid is the Lieutenant, and William Ching another officer. But the center is Bogart's harsh, unrelenting character. His Dixon Steele must rank with his best characters. And we never get to know him, nor is there any apology for his toughness. He seems almost psychotic--very rare for the hero of the 1950s movie. This also rates as one of Grahame's best performances. A truly unique Hollywood movie all round. In a Lonely Place still rates as an undiscovered gem.","user":"drednm","rank":[81,85]},{"title":"One of Nicholas Ray's best movies with brilliant performances from Bogart and Grahame.","rating":6,"date":"6 February 2004","review":"Nicholas Ray is a director who has almost been forgotten these days, despite making brilliant movies like 'They Live By Night', 'On Dangerous Ground', 'Johnny Guitar' and 'Rebel Without A Cause', and numbering Martin Scorsese and Wim Wenders among his fans (the latter even gave him a small role in his 'The American Friend'). 'In A Lonely Place' could be Ray's best. It's a fascinating movie that mixes drama, suspense and romance in a very interesting way. You could call it Noir I suppose, but it's a very difficult movie to tie down. Humphrey Bogart plays a bitter, hard drinking and frequently violent screen writer who becomes a murder suspect when a young girl (Martha Stewart) is killed.  Gloria Grahame ('Crossfire', 'The Big Set Up') is a neighbour who supplies him with an alibi. This odd way of meeting leads into a romance. At first everything is wonderful, and Bogart is even writing again, but bit by bit Grahame starts to see his dark side and begins to fear him, even suspecting that he may have been involved in the murder after all. I don't think I've ever seen Bogart better. It's a terrific performance, and while his character can be charming at times he's also surprisingly unlikeable and intense (we are told he broke an old girlfriend's nose, for example. Imagine Mel Gibson or Brad Pitt doing that in a movie today and still being the romantic lead!).  Grahame pulls off a difficult role too, being torn between love and terror. They both make a great team. Such a pity they never worked together after this. I also liked Frank Lovejoy ('House Of Wax', 'The Hitch-Hiker') who plays Bogart's cop buddy. 'In A Lonely Place' is a movie not to be overlooked. I thought it was superb entertainment.","user":"Infofreak","rank":[114,129]},{"title":"Classic Bogart, classic script, classic noir","rating":10,"date":"11 March 2004","review":"This is one of my all time favourite films, and (alongside the obvious - Casablanca, Maltese Falcon etc) my favourite Bogart.<br><br>The script is smart, witty and cynical, just like a typical Bogart character. But in this film Bogart plays probably his darkest character.<br><br>\nIn some of the scenes with Gloria Graeme he's at his smooth, wisecracking, slightly irritable best, but in the moments where the anger and the fog of despair descends he is a more threatening character than in any of his other leading man roles.<br><br>The cynical, darker aspects of this film just go to highlight how few contemporary films are prepared to be so bleak.<br><br>Despite the fact that the plot is ostensibly a 'did he do it?' crime story, this is largely inconsequential to the psychological character and relationship study that is the central concern of the film.<br><br>\nIf you like a cracking script with sharp performances, with all kinds of deep psychological observations on love and loneliness to be read into it, in the best noir tradition, this is the film for you.","user":"CountZaroff","rank":[114,137]}]