[{"title":"A fairly violent western, with touches of discrimination and prejudices working themselves into the story","rating":8,"date":"26 June 2001","review":"\"Duel at Diablo\" filmed in 1966, has a cast of both American and international players and touches of violence coupled with prejudices.  It makes for an interesting mix and provides the viewer with a tense depiction of the usual struggles of the Apaches against the US Cavalry. James Garner plays Jess Remsberg, an Indian scout now out looking for the man or men that raped and killed his Indian wife.  Sidney Poitier adds an excellent portrayal of a former Army sergeant who has quit the job of soldering in exchange for breaking horses, and selling them to the Army.  Bill Travers and Bibi Anderson provide the international flavor in the cast, and Dennis Weaver gives the viewer a chance both to detest him and feel some sorrow for his warped prejudices toward those he considers inferior or below his status.<br><br>The group of troopers heads out across the desert to another fort in the area, but are headed off by a group of Apaches that have jumped their reservation.  Garner does find out the identity of the man who was responsible for the rape/killing of his Indian wife, but in order to extract his revenge, he must first make it to the canyon of Diablo and rescue the beseiged group of Army troopers from being killed by the Apaches.<br><br>Good, tense story, sweeping vistas of the Utah landscape, and two actors, Garner and Poitier, delivering masterful performances.","user":"Mickey-2","rank":[37,41]},{"title":"Unconventional Western","rating":7,"date":"11 December 2004","review":"What makes this film interesting albeit unconventional are various themes that swirl beneath the main story line. Made at the time when the Civil Rights movement was in full swing, the film subtly touches on issues that were important during the 60s (e.g. racial tolerance, treatment of women and minorities). The film also has a brutal hard edge to it when it comes to the violence, death and the mayhem that takes throughout. The score gives a sense of desperation and inevitability which enhances its hard edge. Unlike many films of the genre, there is no clear cut protagonist or antagonist. The characters are realistic and more than mere two-dimensional cartoon characters for which the viewer could identify with. Overall, it is a thought provoking film that deserves a look in.","user":"smrgeog","rank":[38,43]},{"title":"A Western Adventure Morality Play!","rating":7,"date":"30 July 2002","review":"I first saw this movie as a small child on television, and twenty-two years later I finally got the guts to rent it last week to revisit it, and to see why I was so interested in it then.  I recalled the exciting cavalry charges etc. and I even remembered the opening refrain of the strange musical score. I really enjoyed this movie unlike most of my childhood favorites. While the movie itself is alot like a John Ford Cavalry opera, it plays out alot differently.  This one has more in common with the modern action movie, I think, than with most B-westerns of the 1960's.  The fast pace of the movie, unearthly fates of the dead, anti-heroism of the protagonist (James Garner), and well done scenes of horse-borne combat combine to create a Western-Adventure-Morality Play that I certainly recommend. There are multiple forces at play here.  Among them the bizarre, scorched desert scenery, Garner's quest for revenge for his dead Indian wife while pining over the married woman disgraced by her captivity with the Apaches, The underlying loyalty of Poitier's former soldier character to his former comrades (despite his overtly self-serving statements) contrasted with the underlying self-promoting purposes of Bill Traver's role as military commander.  Too, I see shades of this one in 1993's Geronimo by Walter Hill (burning vistas, Apaches hidden in the ground, Garner's Remsberg character in Duval's Al Seiber etc.) The musical score is off-beat for standard western fare, but who needs more drum beats, flutes, and rattles?! I think the score compliments the movie well, and is perhaps the best indicator that this production thinks outside of the box, even if it remains within it subjectively. This may not qualify as a classic, but I definitely think its a great action flick, and a breath of western fresh air with intriguing insights into race, warfare, culture, and the winning of the west.","user":"floridawar","rank":[37,42]}]