[{"title":"Sex, Violence, Silliness, and an Emerging Cult Favorite","rating":8,"date":"20 May 2005","review":"In general terms, the basic premise of both original 1942 CAT PEOPLE and the 1982 Paul Schrader remake are the same: an exotic European beauty is given to transforming into a black panther when sexually aroused. But Schrader unravels this fantasy concept in some very overtly Freudian directions, setting his version in against the decadent charm of New Orleans, introducing a theme of incest, and ramping up the original with a lot of nudity, a lot of sex, and some of the most graphic violence around. The result is an American blood-and-gore horror film with a hypnotic European sensibility that equates both sexual frustration and orgasm with violent death.<br><br>The story line concerns two orphaned siblings (Natasha Kinski and Malcom McDowell) who are reunited in New Orleans as adults--but they are, unbeknownst to the sister, the descendants of a mutant race who can only mate with their own kind without transforming into ravening beasts who must then kill to regain their human form. When sister Natasha rejects her brother's advances and then falls in love with a hunky zoo director all hell breaks loose.<br><br>In some respects the film is extremely, extremely frustrating, often sliding over the edge from a sexually provocative shocker into moments of annoying silliness--but on the whole it works extremely well as a both a sexual fantasy and a semi-camp statement in gratuitous sex and violence. Kinski is ideally cast as the sexy but virginal Irena; you can literally see the \"cat\" side of her nature emerge more and more as the film progresses. McDowell is equally interesting as her mad brother, and John Heard, Annette O'Toole, and particularly Ruby Dee offer excellent performances in the supporting cast. The New Orleans backdrop is extremely effective, and (speaking as one who has been there) the darker side of the city is perfectly captured; the Moroder score--which includes some sultry vocals by David Bowie--is also extremely good.<br><br>A great many people will loathe CAT PEOPLE, and the reasons will be diverse. The film is extremely bloody, often to a can-you-stand-to-look-at-the-screen degree; there is tremendous nudity and considerably sexual activity; and the combination of sex and violence into a sadomasochistic eroticism is quite disturbing. Beyond this, more critically inclined viewers may find themselves annoyed by the script's silliness and the fact that it does not always go as far over the top as it leads you to expect, and certainly the film's very literal depiction of fantasy elements will not be to every taste. But if you have a hunger to walk on the wild side, CAT PEOPLE (which is rapidly gaining status as a cult film) will suit your need as guilty pleasure.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[75,95]},{"title":"Brilliant film, but should not be thought of as a remake","rating":10,"date":"11 February 2005","review":"After looking for years for his long lost sister, Irena Gallier (Nastassja Kinski), Paul (Malcolm McDowell) finally finds her and has her come to New Orleans, where he's currently living. While there, she gradually discovers the truth about their bizarre past and falls for a zoo curator.<br><br>First, a caveat. Director Paul Schrader, in his interview on the Cat People DVD, says that he regrets that he didn't just change the name of the film to remove some of the perception that this is a remake of Jacques Tourneur's Cat People from 1942. It is wrong to look at this as a remake. Aside from mostly superficial similarities, Schrader's Cat People really has little to do with the original--no more in common than, say, The Grudge (2004) and The Ring (2002), assuming that \"Kayako\" from The Grudge would have been named \"Samara\" instead, or no more similar than any two random vampire films. Irena's first name is the same, there are similarities in her background story and what she is, she visits a zoo, she falls in love with a man with the same first name of \"Oliver\", and there are maybe two and a half scenes similar to Tourneur's film. That's it. Yes, I'm a fan of Tourneur's film, too--it's my favorite out of his collaborations with producer Val Lewton. But you have to forget about Tourneur's film when watching this one. This is a remarkable work of cinematic art in its own right, with its own story and goals.<br><br>Schrader's Cat People deserves a 10 on visual terms alone. The cinematography, production design and lighting are nothing short of genius throughout the film. Almost every shot is one that deserves to be paused and studied. Director of photography John Bailey never ceases to find interesting perspectives, angles and tracking. The sets are elaborate and exquisitely constructed for visual impact. In conjunction with the lighting, the film is mired in a rich, varied palette of colors similar to (and as good as) Dario Argento's best work.<br><br>Of course the film is more graphic than Tourneur's--it would be almost impossible for it not to be, both in terms of blood/gore and nudity, and all of that is shot brilliantly as well. The only cinematic instance of blood that I can think of that is as effective as the scene in this film where blood runs by Irena's shoes and down a drain is the shower scene from Alfred Hitchcock's Psycho (1960). The event leading up to this image has more impact of most similar scenes, as well. The copious amounts of nudity throughout the film are never gratuitous (not that I have anything against gratuitous nudity, mind you), but always interestingly blocked, with some grander artistic purpose. These scenes range from creating juxtapositions between prurient voyeurism and horror, to surrender to and (sometimes perverse) domination of animality, to interior psychological conflicts--just look at the ingenious placement of a window frames during a full frontal nudity shot in Oliver's \"swamp cabin\".<br><br>The music--both the score and the incidental songs, are just as good. Most of it is an eerie, synthesized score by Giorgio Moroder. It often approaches the tasty moodiness of Brian Eno's excellent work with David Bowie (Low, Heroes, Lodger), which is perhaps ironic in light of the fact that Bowie contributed a great song for the closing credits. The limited incidental music--such as Jimmy Hughes' \"Why Not Tonight?\" during the cab ride to the zoo--fits the mood of the film perfectly.<br><br>Of course, the film isn't all just visuals and music. There's an intriguing, surreal story here, and great performances from a seemingly odd combination of actors--ranging from Kinski and McDowell to Ed Begley, Jr. and John Laroquette. Setting the film in New Orleans was an inspired choice, as it allowed for eerie voodoo-weirdness ala Angel Heart (1987) and moody swamp vistas ala Down By Law (1986) to seep into the already creepy story. Setting the more dreamlike imagery in a desert (albeit a studio-created desert) also helped draw me into the film, as there is probably no environment I find more aesthetically captivating.<br><br>I first saw Cat People as a teen during its theatrical run. I didn't like it near as much then, and that fact caused me to put off re-watching it for a number of years. I think at that time, the film may have been too slow for me, I may not have understood it very well, and I certainly didn't have the visual and overall aesthetic appreciation that I currently have. Now, I think it's a masterpiece--perhaps one of the better films of the 1980s. It's worth checking out at least once, and if you've seen it awhile ago and think you didn't like it so well, it's worth giving a second chance.","user":"BrandtSponseller","rank":[93,123]},{"title":"I'm a cat person...and I liked \"Cat People\"","rating":7,"date":"26 May 2003","review":"Like Joe D'Amato's \"Buried Alive,\" this remake of \"Cat People\" is technically a love story with a tough horror exterior.  Both aspects of these genres fit quite well to create an unconventional entertainment.  The movie gets especially high mileage out of two inspired leads--Nastassia Kinski as the young, attractive virgin (she also looks like a more predatory version of Isabella Rossellini); and Malcolm McDowell, who still glows with all the playful malevolence he brought to \"A Clockwork Orange,\" as her brother, who morphs into a panther when sexually aroused.  In spite of an ill-defined supporting cast, Paul Schrader's assured direction, the bizarre script (by \"Children Shouldn't Play With Dead Things\" star Alan Ormsby), those lush New Orleans locations, and the chemistry between Kinski and McDowell keep \"Cat People\" afloat.  It's a sexually charged horror story told with a straight face, and it works.<br><br>7/10","user":"Jonny_Numb","rank":[38,53]}]