[{"title":"The Third Vampire Film by Toho Studios","rating":6,"date":"23 November 2019","review":"Professor Shiraki (Toshio Kurosawa) travels from Tokyo to the countryside by train to work as a psychology teacher in the Seimei School for girls. There is a driver waiting for him and he sees a car accident on the road. He learns that the principal´s wife died in the accident. When they arrive at the school, the Principal (Shin Kishida) welcomes him and Shiraki offers his condolences to him. He tells that the coffin of his wife will stay in the basement for seven days as per the local costume. He also tells that Shiraki was chosen to be the next principal of the school. During the night, Shiraki has a dreadful nightmare with the principal´s wife. Soon he befriends three students and learns that a roommate has disappeared and other students are also missing. What is the mystery of the Seimei School for girls?<br><br>\"Chi o suu bara\", a.k.a. \"Evil of Dracula\", is the third vampire film by Toho Studios. There is no Dracula in the story despite the American title. However it is cult and does not disappoint the fans of a vampire movie. My vote is six.<br><br>Title (Brazil): \"A Maldição de Drácula\" (\"The Curse of Dracula\")","user":"claudio_carvalho","rank":[5,5]},{"title":"Terrible dubbing, but very interesting","rating":9,"date":"25 June 2003","review":"The last part of Yamamoto's Vampire Trilogy has been described as the worst, but it's still very entertaining. The main problem is that it obviously tries to copy the Hammer Vampire movies, and the man with the cape always looks a little bit out of place. Otherwise, most 'scary moments' are carried out in the `Kaidan Eiga'- fashion with slow camera movements and impressive lighting. Here, and in some beautiful long shots, it shows that some skill was involved, and that the movie could have become a minor classic if it had stuck to the Japanese tradition of the Horror Film. The sound track sounds too European, too and the dubbing is a total nightmare, but I think, a subtitled version recently got released in the U.K. Recommended viewing for fans of offbeat seventies horror.","user":"Alex Klotz","rank":[12,15]},{"title":"A Different Flavor","rating":5,"date":"26 October 2012","review":"\"Professor Shiraki\" (played by Toshio Kurosawa) arrives from Tokyo to a new school for teenage girls in a small Japanese village. Upon checking in he learns that the principle's wife died a couple of days earlier and that a student named \"Keiko Nonomiya\" (Tomoe Mari) went missing about the same time. That night he has an encounter with a vampire that matches Keiko's description but dismisses the incident as nothing more than a dream. Not long afterward another student named \"Kyoko Hayashi\" (Keiko Aramaki) faints in his classroom and is taken to the school's doctor, \"Doctor Shimimura\" (Kunie Tanaka). During Kyoko's examination two small \"needle pricks\" are discovered but neither Professor Shiraki nor Doctor Shimimura are able to figure out their significance. Since she appears to be tired, they send her back to her dorm room to recover with her two roommates, \"Yukiko Mitamura\" (Mio Ohta) and \"Kumi\" (Mariko Mochizuki) promising to take care of her. All hell breaks loose after that. Anyway, having outlined the first part of the story, I'll stop here so I won't spoil everything for any viewers who wish to see the rest. Now, although this is a \"standard\" vampire story, the fact that it is entirely Japanese results in a few curious details. For example, a white rose is seen by the bedside of each of the females who have been bitten. Once they drink blood the rose turns red. I thought that was an interesting touch. Having said that though, I thought there were a couple of faults as well. First, the dialogue was awful. But the movie I saw was originally in Japanese and dubbed in English and it is quite possible that much had been simplified or even lost in translation. Likewise, the acting was also quite bad. Even so, this film had a different flavor than most other vampire movies and I thought some of it was actually quite good. Obviously, there will be people who might not like this film. Like I said, it has its flaws. But I think fans of this genre might be pleasantly surprised.","user":"Uriah43","rank":[3,3]}]