[{"title":"Good for what it is","rating":5,"date":"21 July 2005","review":"I think this movie was hilarious simply because of how serious it was. from the heavy-handed acting to the comedically badly choreographed fight scenes, to the outlandish scenario to the completely unrealistic portrayal of city gang violence, this movie made me and my friends laugh our butts off. when Roy Boy shouts \"YOU MOTHERRSSSS!!!\" we couldn't stop laughing. the front of the box features a team of steroidal, rambo-type Vietnam soldiers wielding flamethrowers and assault rifles, and yet there is only maybe 5 minutes of Vietnam scenes in the movie. not to mention i never witnessed any real annihilation. maybe some destruction, a few murders, some depravity, but no annihilation. no sir. I'm not calling this a good movie. just an unintentionally hilarious time capsule of C-moviedom from the 80's. if you can find it, for god's sakes buy it. it's a good time.","user":"carapjuc","rank":[12,12]},{"title":"Street justice - Hell yes!!!","rating":6,"date":"27 March 2008","review":"One of a fairly long line of generic vigilante action flicks to emerge post Death Wish, this as with most of the others of its ilk, proves to be highly satisfying stuff. The plot which is virtually identical to the earlier and slightly superior Kill Squad, has a group of Nam veterans setting out to avenge the death of one of their friends and cleaning up the streets of the vicious gangs that are terrorising the neighbourhood.<br><br>The villains, led by a delightfully OTT Paul Koslo, are all wonderful 80's stereotypes of street thugs and crooks (ah, they just don't make cinematic scum like they used to!) <br><br>One thing's for sure; you'll be guaranteed left cheering as each one of the main antagonists in this bite the dust in style at the hands of our heroes. Hell, it's almost enough to make one want to form a posse and kick some criminal butt!","user":"HaemovoreRex","rank":[9,9]},{"title":"Made me cry... really","rating":20,"date":"20 February 2004","review":"To the people who have seen this hilarious movie, try and imagine in what state of mental exhaustion and/or depression I was, when I actually shed a tear in the scene where the leader of the vigilantes tells the alcoholic one he still trusts him to watch his back. I also cried when the cripple died.<br><br>Don't worry for me, my life is now back on track.","user":"krayzp","rank":[21,25]}]