[{"title":"The Best Vampire Film of all time!!","rating":10,"date":"19 February 1999","review":"Terence Fisher's DRACULA (HORROR OF DRACULA in the USA; 1958) is the best vampire film of all time.  No other picture combines the right amounts of horror, humor, action, and eroticism.  Britain's Hammer Films is legendary for their horror films--this is the best of them all.  Although quite different from the book in many ways, I feel this picture captures the spirit of Stoker's work better than the more literal adaptations. Everything works here--Fisher's tight, crisp pacing, James Bernard's throbbing, full-blooded score, and especially the acting.  Christopher Lee inherits the role of Dracula from Lugosi and makes it his own--he still holds the record for most film performances as the Count.  Peter Cushing is the definitive Dr. Van Helsing--by turns tough and tender, his interpretation far outshines those of far better known actors--Anthony Hopkins and Laurence Olivier played the part later, but their performances were totally inferior to Cushing's.  And how about Michael Gough--Alfred in the recent BATMAN films--as Holmwood?  He's a treat in his own right! Lugosi came first, and later films spent more money; however, the best combination of all elements is in HORROR OF DRACULA.  It is required viewing for all vampire fans.","user":"Jonny L","rank":[101,124]},{"title":"The most influential British film","rating":8,"date":"6 June 2006","review":"It's difficult to overestimate the significance of Dracula. Far more so than its predecessor, The Curse of Frankenstein, it set the tone for Hammer's movie output over the next two decades - the two decades (1956-1976) when British films, or at least British horror films, were among the best, most admired and most imitated in the world. A far cry from the terribly English whimsy of the Thirties and Forties, or the provincial, \"arty\" stuff that's predominated since the end of the Eady levy in the 1980s.<br><br>With this movie, Hammer not only created an international star out of Christopher Lee, but a worldwide phenomenon that persists, in series such as Buffy the Vampire Slayer and films like Sleepy Hollow, to the present day. Taking the Kensington gore quotient of The Curse of Frankenstein, and combining it with an unprecedented dose of eroticised violence, Dracula revolutionised horror, ultimately leading to the breasts and blood exploitation movies of the Seventies, as well as the heavy sexual overtones of films such as Alien and The Company of Wolves.<br><br>The movie benefits from two astonishing central performances. Christopher Lee's Dracula is a creation of passionate intensity, to whom Cushing's monomaniacal Van Helsing is the antithesis  fire and steel; hot-blooded animal instinct versus cool scientific rationalism. This has led some critics to identify Van Helsing as the real villain of the piece, a brutal fanatic who coldly pounds a stake through the vampirised Lucy. Either way, both actors give supremely effective performances. The final confrontation between the two remains the single most iconic scene in any Hammer film. Hardly surprising, given their on screen charisma, that Lee should reprise his role six times and Cushing four.<br><br>The most influential British movie of all time, Dracula's electric mix of sex and death fuelled a global revolution in genre film-making, and presented Hammer with a formula that they would return to again and again over the next two decades.","user":"msquared","rank":[49,58]},{"title":"Lee's Dracula reigns supreme!","rating":9,"date":"6 August 2004","review":"Hammer's Dracula, the first Dracula film to incorporate fangs, blood, and red eyes, brings the best Dracula to the screen - Christopher Lee.<br><br>I first saw this on TV at home on Thursday 5pm on a channel that featured some classics. I also remember seeing War of the Worlds and others every Thursday. Each time they repeated it, I was there watching it. I just bought this DVD for my collection and the color and quality is awesome.<br><br>In Stoker's book Mina Murray is Harker's fiancé and Lucy Westenra was Arthur Holmwood's fiancé. Despite these changes the story holds together nicely. Sangster manages to avoid having Dracula turn to a bat to make the character more believable. In Stoker's book the Lucy character dies and returns as a child-lusting vampire so Van Helsing and Holmwood stake her as shown in the movie.<br><br>Trivia: Lee said the fangs he wore were easy to speak with but not eat. The contacts he wore were very painful and made him teary eyed and his vision a bit blurry.<br><br>There are some scenes that were deleted. One was of the impaled Harker in the early stages of decomposition which was removed by the British censor when it was released in English speaking countries. Surprising because it was tame compared to other scenes. Another scene that was removed by the same censor was Dracula's stages of decomposing during his death scene. This scene was reportedly left intact in foreign speaking countries and the rumor is Warner does not consider the scenes to be worth pursuing. What U.S. audiences see is the jump to the final stage of dissolving. Lee says they were kept in for the Far East parts of the world because they were considered to be too gruesome in those days. There are stills floating around of them both. A solid 9 out of 10, this remains the best Dracula film ever made. Yes, much better than the overrated \"Bram Stoker's Dracula.\"","user":"rams_lakers","rank":[66,80]}]