[{"title":"The first Powell-Pressburger collaboration","rating":5,"date":"5 November 1999","review":"This is an entertaining, well-made spy adventure set during World War I. Although made 60 years ago, the film has a sophisticated approach to the relationship between its three main characters. In particular, the natural attraction between the parts played by Conrad Veidt and Valerie Hobson is portrayed believably. Many of the supporting characters are also interesting; look out for Hay Petrie as the Scottish engineer aboard a ferry and an early appearance by Bernard Miles as a hotel desk clerk. Unlike the majority of British movies of this period, the film doesn't stereotype or make fun of its working-class characters.<br><br>The story has several good twists and an ironic climax. There are also some improbable coincidences, but no more than the typical James Bond movie.<br><br>Unlike Bond, however, \"The Spy in Black\" adopts a quite dark tone in its final 20 minutes. There is an almost tragic dignity and regret in the final scenes.<br><br>Director Michael Powell composes some interestingly-framed shots that make good use of Vincent Korda's sets. One of his favourite devices is to set a key character in sharp focus in the background while lesser parts stand or move slightly out-of-focus in the foreground. The effect is often quite striking.<br><br>This film marks Powell's first collaboration with the Hungarian writer Emeric Pressburger. The maturity of the romance between the leads and the snappiness of the dialogue are probably attributable to Pressburger's European upbringing.<br><br>Despite its age, \"The Spy in Black\" is well worth seeing just for the simple pleasures of a well-made entertainment executed with a little more care and imagination than usual.","user":"Watuma","rank":[56,58]},{"title":"An Intriguing Little Thriller with a Difference","rating":8,"date":"3 May 2002","review":"Just wanted to second the other user's comment.<br><br>I saw this last night as part of a Michael Powell/Emeric Pressberger retrospective underway at the American Cinemetheque. There are some unlikely aspects to the plot, but on the whole this is well crafted WWI thriller with a remarkable level of moral complexity, especially given that it was made and released just as England was entering a second war against Germany.<br><br>The protagonist (hero?) (played by the extraordinary Conrad Veidt) is a German officer on a spy mission and he is, in many respects, a quite admirable character. For the first half of the film, it's almost entirely from his point of view. It's hard to imagine Hollywood filmmakers EVER having the confidence that Powell and Pressberger clearly had in the intelligence of their audience, allowing them to actually like and admire an enemy agent.<br><br>While \"The Spy in Black\" eventually does come down squarely on the side of the English, the agents of the Kaiser come off only as perhaps a hair more ruthless than those fighting for king and country.<br><br>Of course, the Germany that England would be fighting within a few a few months would be far, far worse. This film is a potent reminder that while World War II might have a morally clear \"good\" war because of the vast evil of the Nazis, World War I was a horse of a far grayer color.<br><br>With sophisticated, occasionally black humor, this is a neat bit of old-fashioned movie entertainment with some genuinely intriguing differences. Enthusaistically recommended.","user":"bobwestal-2","rank":[60,64]},{"title":"Comparison with first viewing of the movie in 1939","rating":9,"date":"18 February 2007","review":"I first saw this movie on Derby Day 1939 at the then Capitol Cinema in Epsom Surrey UK when I had intended to watch the world famous horse race to be run that day on the nearby Epsom Downs. However, the weather was so wet and windy that I decided to go to a cinema instead. Having just watched the film on television I find that it thrilled me just as much as an octogenarian as it did when I was a teenager in 1939. In my view this is one of the finest of the 1930s British films. The fine quality of the direction and the talent of the principal actors and supporting cast make this a memorable piece of fiction which accurately reflects the narrow attitudes to manners that prevailed in remote parts of Scotland during the time of the first world war.","user":"fred-plant","rank":[90,98]}]