[{"title":"Great true story, wonderfully done","rating":6,"date":"6 March 2002","review":"I watched this again last night. I had forgotten just how beautifully done it was - both a character study of two very different men and a gripping plot of their attempts to succeed - partly through athletics. the writer and director so well convey both Cambridge and the Edinburgh Presbyterian missionary disciples, in the early 1920s so very well.<br><br>The acting is superb - I had never seen a character presented like Eric Liddell in movies - how fine Ian Charleson was in this role, the softness of his voice, his ease and joy in running competitively (especially in contrast with the tense tortured Harold Abrahams). I also loved the more supporting roles - I've read a biography of F.E. Smith and Nigel Davenport is exactly how I would imagine him. The actor who played the Prince of Wales also seemed exactly right with his effortless charm, looks, and lack of imagination. Ian Holm, John Gielgud, Lindsay Anderson - all wonderful.<br><br>The actors weren't chosen for glamour either - Liddell and Abrahams are not Leni Riefenstahl images of athletic ideals, Liddell's sister is no beauty - and Abrahams' girlfriend is pretty but not stunning. It made them seem more real. (In nice contrast were the near-pretty boy looks of Nigel Havers as Lord Lindsay - it so suited his character).<br><br>The races are riveting - partly due to the music and sound effects.<br><br>So many small things are done so well - e.g., when Lord Lindsay has the confidence of his class to barge into a room containing the Prince of Wales, and three other lords (including Birkenhead and the head of the British Olympic Committee) and greets them by name - no need for introduction there (as there was for Liddell). It's small but seems quite real.<br><br>As an American, it was interesting and funny to see our Olympic team shown as the numerous, ominous, invulnerable \"other\"! (something like watching a Rocky movie with Rocky as the product of a Russian or East German success machine!). In fact, the one scene that seemed a bit off was the scene of the American track athletes warming up for the Games - all heavy music, machine like athletes, ferocious coach yelling with a megaphone into people's ears. It pounded too hard on the \"these are the scary almighty inhuman opponents\" theme in contrast to the cheerful British boys running along the beach.<br><br>Something I had forgotten about the movie was how stubborn BOTH protagonists are - Liddell fully as much as Abrahams. Liddell is not overly deferential or bashful when dealing with the Prince of Wales - but instead straightforward and very firm. <br><br>I truly can't understand anyone not liking this movie - it is very exciting even on the basic level of \"will they win?\" and so much more. (For example, Ian Holm's character's reaction to success after 30 years is very moving). Those who write to say that \"Reds\" deserved the Oscar more - are simply wrong. (Reds was so simplistic that it felt like watching the movie \"The Hardy Boys Go to the Russian Revolution\"). Those who say they cannot differentiate among the boys or between the Scottish and English accents - well, it sounds like some political statement to me. <br><br>Do watch it - it's very fine, very moving, very exciting.","user":"trpdean","rank":[117,134]},{"title":"Truly an outstanding film.","rating":9,"date":"26 January 2003","review":"I beg to differ with several previous reviewers.  This film is neither bland nor is it solely about professionalism vs. amateurism.<br><br>This film is about what drives people to do what they do.  Eric Liddell (Ian Charleson) runs for the glory of God, whereas Harold Abrahams (Ben Cross) runs to prove his worth to a society that was anti-Semitic.  Even though they run for different reasons, their drive and determination spur them on. They stand up for what they believe in and refuse to sacrifice their principles because it is the easy way out. <br><br>The supporting cast is also extraordinary, with Nigel Havers, Nicholas Farrell, Ian Holm and Sir John Gielgud all making important contributions to the final product. <br><br>There is absolutely nothing unnecessary in this film.  The writing, the direction, the acting, the dialogue are all outstanding.  And then there's that haunting score.  <br><br>Once again, this is truly an outstanding film. One with universal themes that transcend time and place.","user":"Julie-30","rank":[126,145]},{"title":"An engrossing and powerful sports story","rating":10,"date":"17 January 2001","review":"I enjoy sports films, especially when they are used to exemplify greater human truths.  In that regard `Chariots of Fire' is one of my favorite sports films.  What differentiates this film is that it is really a human story about sports rather than a pure sports story.  Based on a true story, it centers on two gifted athletes and their quest to run in the 1924 Olympics.  The first is Harold Abrahams (Ben Cross), a haughty sprinter with an obsession for winning.  Abrahams, who is Jewish, is a man with something to prove, mostly to himself.  His rival is Eric Liddell (Ian Charleson), the first man to ever beat him in a sprint.  Liddell is a devout Christian and runs for the glory of God.<br><br>There is an exquisite interplay of subtle themes in this film underlying the obvious sports tale.  There is the contrast of motives.  Abraham runs to validate his feeling of personal power, and his preoccupation with winning is actually motivated by his fear of losing.  His quest is torturous, and ultimately his victory empty, more of a relief than a triumph.  Liddell runs out of a desire to repay God for the physical gifts he has been given.  He is at peace with himself, but at odds with all those who want to control him.  Their rivalry represents a battle between the forces of the physical and spiritual.  Other themes pervade the film.  We have undercurrents of bigotry against the Jewish runner, a man of whom Cambridge was begrudgingly proud while berating him behind his back.  We have sinister political attempts at manipulation in the face of Liddell's staunch integrity in adhering to his principles.  Together, these forces combine to produce a film rich in drama and meaning.<br><br>The film has been criticized for its inaccuracies.  Some say Abraham did not suffer from anti-Semitic bigotry and that he was wildly popular at Cambridge.  This does not necessarily mean he didn't feel inferior.  No one can know what childhood experiences might have affected his psyche.  Jackson Scholz was quoted as saying he never gave Liddell a note of encouragement on the track.  I have to agree that this was a bit of Hollywood drivel that didn't need to be there.  Additionally, Liddell knew weeks before that the heats would be on a Sunday, not just before the race as shown, and he was always scheduled to run the 400-meter race.  The meeting of political bigwigs that allowed him to switch from the 100 to the 400 was pure fabrication to emphasize his resistance to compromising his beliefs about running on the Sabbath.  However, these liberties can be forgiven because they enriched the story and did not change history in major ways.<br><br>The direction by Hugh Hudson is powerful.  Hudson captures the feeling and excitement of track and field competition, as well as giving us numerous beautifully photographed scenes and a wonderful period rendering.  Though nominated for an Oscar, Hudson was unable to capitalize on the success of this film, and he has directed very few, mostly minor films since.  The music by Vangelis is also wonderful, and it won the Best Music Oscar.<br><br>Ben Cross is fantastic as Abrahams.  He brings great intensity to Abrahams' single-minded obsession for winning.  Cross hasn't done much film work since, but has had a long and distinguished career in TV.  Ian Charleson is also excellent as Liddell, but his career went the same route as Cross'.<br><br>This minor film was the sleeper of 1981, nominated for seven Academy Awards and winning four, including Best Picture.  I rated it a 10/10.  It combines the best elements of human drama and sport to create a potent and engrossing film.","user":"FlickJunkie-2","rank":[93,108]}]