[{"title":"Probably not as much red sauce as curious Giallo fans will be expecting, but still well worth a look","rating":7,"date":"3 October 2012","review":"Boasting a steady throttle of well-orchestrated suspense, some solid jump-scares, one whopper of a gore set-piece, and a fantastic musical score, this Lamberto Bava vehicle is an uneven but satisfying offering.<br><br>The film is centered around a composer who moves into an opulent villa to record the soundtrack for a horror film. He quickly finds himself living one when a series of strange events plunges him into a macabre mystery centered around the house's previous tenant, Linda. A series of female acquaintances of his predecessor begin showing up to provide him tantalizing clues, but then disappear just as suddenly when they are targeted and slayed by a deranged killer with a fondness for sharp objects. As he delves deeper into the cryptic saga of Linda's \"secret,\" he learns that the movie he's working on may hold the key to discovering the dark, hidden truth.<br><br>The classic Giallo whodunnit formula is firmly in place, and Bava wisely provides enough suspects, both male and female, to keep things intriguing. We're left to puzzle over the potentiality of the lurking handyman who decorates his walls with pornographic pictures, the slightly batty film director who we imagine may be crafting her own real-life slasher movie, and the jealous girlfriend who bristles at the idea of other women setting foot anywhere near the house. This guessing game isn't stymied until the climax, when our possibilities start getting offed one by one, so the film maintains its mystique throughout.<br><br>The opening scene, in which two young boys dare their friend to descend into a creepy, shadow-strewn cellar and a grisly artifact plunges out of the darkness to announce his fate, gets the film off to a rousing start. From there, Bava sets a leisurely but effective pace, unfurling a piece at a time of the overarching enigma and punctuating each act with displays of the killer's prowess for carnage. Genre aficionados may find themselves disappointed by the meager body count leading into the finale, but the engrossing storyline renders this a minor complaint, and as the final act plays out, Bava makes up for lost time by whittling away his remaining cast in quick fashion.<br><br>The most gruesome and memorable scene in the film, a deliriously blood-soaked rendezvous in a bathroom, is constructed with a meticulous Hitchcock-ian flair for tension, and the end result is one of the most harrowing clips in the Giallo canon. Bava never quite reached the Grand Guignol via art-house heights of his brilliant countryman Dario Argento, but as evidenced by this particularly stunning segment of Blade, it wasn't because he didn't try.<br><br>Granted, there's plenty of silliness on display here, most of it a result of the dubbed dialogue, which at times clearly demonstrates some glaringly awkward translation (\"Is it possible you're such a vacant nerd? Your satisfaction is to sit like a frog in the sun?\"). Likewise, the concluding summation of the murderer's motivation is so rushed and dicey that the film ends on a fairly humorous note.<br><br>The final twist works well enough, but Bava falters a bit there by trying to keep the audience guessing for too long at a point when the solution to the riddle is plainly obvious. By the time we find out who's been holding the titular Blade, there are are only a couple of characters left, so knowing who the killer ISN'T strips the reveal of its big \"a-ha\" moment.<br><br>However, despite its flaws, A Blade In The Dark is an entertaining and cohesive thriller that delivers everything its premise promises. I'll let horror scholars debate whether this is Bava's best film or not; as for myself, I liked it a hell of a lot, and that's more than good enough for me.","user":"happyendingrocks","rank":[8,8]},{"title":"Pretty enjoyable Argento pastiche.","rating":27,"date":"27 November 2003","review":"Okay, Lamberto Bava isn't anywhere near as talented as his father Mario. Let's just accept that and move on. 'A Blade In The Dark' is a surprisingly entertaining giallo that is equal parts Argento and Hitchcock, though obviously not as accomplished as either at their best. If I specify which Hitchcock it is heavily inspired by it'll give the whole game away, so I won't, but I'm sure most viewers will have guessed the twist long before it is revealed. It doesn't really matter, it won't detract from your enjoyment. Andrea Occhipinti from Fulci's 'The New York Ripper' plays Bruno, a young composer who rents a villa while working on a horror movie score. Pretty soon assorted lovelies start disappearing and he fears the worst. He also begins to think the movie he's working on holds the key to the mysterious events around him. The version I watched of this movie was very badly dubbed but it was still effective and stylishly directed, with some gruesome touches. Occhipinti was more than adequate as a hero, there were plenty of babes, and Eurohorror buffs will get a kick out of seeing the kid from Fulci's 'The House By The Cemetery' in a bit part and Michele Soavi (Argento pal and director of cult favourite 'Dellamorte Dellamore') in a supporting role. While I don't think 'A Blade In The Dark' is quite as good as Bava's first 'Demons' movie I enjoyed it a LOT more than I expected, so if you like Argento and Fulci, check it out.","user":"Infofreak","rank":[9,12]},{"title":"Very scary giallo","rating":8,"date":"4 April 2004","review":"Okay. A lot of the negative things that people have said about this movie are right on the money. The dubbing is HORRIBLE. To the point of nonsense. The \"cockroach\" scene is a bit odd. The plot and plot twists are at times predictable and cliche.<br><br>\nNow the good parts about this giallo. Its f****** scary!!! Some of the slow stalk sequences and cat and mouse chases are absolutely nerve shattering. Lamberto Bava layed on the atmosphere double thick here. The violence is terrifying and brutally graphic. The score is without doubt the best I've heard in a giallo. And I've seen the Argento films and many others.<br><br><br><br>Final analysis: Technically speaking its flawed, very flawed, but as a slasher/giallo/horror movie its atmospheric and scary. And my personaly favorite giallo.<br><br>\n*** (out of ****)","user":"sethputnam69","rank":[11,16]}]