[{"title":"marvelous--both charming and poignant","rating":10,"date":"5 June 2005","review":"This is my favorite Leslie Caron movie. I like it even better than the wonderful \"Gigi\"--and that's saying a lot.<br><br>There are several elements of the movie that are outstanding. The cinematography and music combine to make an incredibly artistic film that helps to convey the love and sadness of the young lovers. The acting is generally top-notch--especially the supporting roles played by Charles Boyer and Maurice Chavalier. But most importantly, the overriding theme is unusual and profound (illegitimacy and the choices you make once this unwanted pregnancy occurs). This makes this film very adult in sensibilities and yet a good family picture as well---I certainly would want my daughters to see and learn from Fanny and Marius' experiences.<br><br>This movie has so many wonderful moments (such as Panisse's utter devotion and acceptance of Fanny and her baby, Cesar's confrontation of Marius near the end of the flick or Panisse and Cesar's game with the hat in the street) and overall it can't help but satisfy.<br><br>One of the absolute best films of the 1960s--though how it's becomes somewhat forgotten is beyond me.","user":"MartinHafer","rank":[42,43]},{"title":"Wish I could see this gem in letterbox, not pan and scan!","rating":10,"date":"22 October 2005","review":"This is one of the sweetest movies ever made, without being \"sickeningly sweet.\" The characters are funny and interesting. All kinds of love are depicted here--parental love, romantic love, love between friends. The characters are very much products of the time and place they live in--Marseille, France, before World War 2. They are steeped in Catholic tradition, which contributes to their inner struggles at times.<br><br>The problems of Fanny and Marius might seem dated, and yet the conflict between pleasing parents and following one's heart remains relevant today for many young people. Father-son relationships are as complex today as they were then. Bullying parents may not be as plentiful, or as extreme, as they were in the time FANNY is set, but they still exist.<br><br>This is a beautiful film, the right mix of sentimentality and humor. I have only seen it on VHS in pan and scan. There is one place where Marius and Fanny are partially cropped to fit the TV screen, unfortunate but it does not spoil the film. <br><br>PUZZLE: I don't know why gorgeous Horst Buchholz didn't get more acclaim for this film from critics at the time or reviewers like me, on this site. He was a young German playing a young Frenchman. But no French or American actor could have played the part better. He expressed angst and love very realistically.<br><br>This is a great film for women and for men with a romantic streak, lovers of French stories and locales, and Caron or Boyer admirers. The wrap-up in the last quarter of the film is not perfect, but the film as a whole is a 10, and the lovely score will stay with you!","user":"stancym","rank":[33,34]},{"title":"Fanny","rating":9,"date":"23 July 2005","review":"I saw this movie when I was but 11 yrs. old. I am now 56 yrs. old but I have never forgotten its simple beauty, and the powerful emotion portrayed by actors who were expert at their craft. It is a classic, definitely worth seeing.<br><br>The story transports you to a world less glamorous, but full of charm and it reflects the passion of young love, the desperation of a girl \"in trouble,\" and it explores the depth of a woman's love for a man, even when he cannot return that love, and for her child. It teaches that a sperm donor does not a father make, but shows how mutual respect can foster great admiration and loyalty, leading to their own special kind of love.<br><br>This movie has everything that one can consider good entertainment: the characters are colorful if not intense, the background music is pleasing, the language is acceptable for all ages, there is humor and there are tears. It is one of my all-time favorite movies, in company with the likes of Love is a Many Splendored Thing.","user":"piseas49","rank":[30,31]}]