[{"title":"Swanson in a Subway","rating":10,"date":"24 July 2005","review":"Gloria Swanson did everything in films from Mack Sennett comedies with Charlie Chaplin to the high drama of Queen Kelly and Sunset Boulevard. Manhandled is a drama with comedy. Shop girl Swanson works at a department store and lives in the same tenement as boyfriend Tom Moore, a mechanic with big ideas. By chance she is spotted by the store owner (Arthur Housman) and invited to a party along with pal (Lilyan Tashman). A chorus girl (Ann Pennington) does a snazzy dance so Swanson does her impersonation of it, losing her underwear. Later she impersonates a Russian Countess. The owner of a ritzy store (Frank Morgan) offers her a job as a fake Countess to lure customers and Swanson is on her way to big money and big parties. She poses for a famous artist (Ian Keith) but he gets fresh and she keeps getting \"manhandled.\" Meanwhile the boyfriend has gone off to Detroit to sell his new engine part. There is a happy ending.<br><br>Swanson is just wonderful as the gum-chewing shop girl, especially in the amazing subway scene. The print I saw did NOT include her famous impersonation of Chaplin (the inspiration for her similar scene in Sunset Boulevard), so that was a disappointment. But it's still a nice little morality tale. And Swanson was an excellent comic actress. It's easy to picture Marion Davies or Carole Lombard in this same role. The male co-stars are all OK but nothing special. Real-life showgirl Ann Pennington appears as herself in the party scene with Brooke Johns.<br><br>Originally 75 minutes, but it seems the longest version to survive runs about 69 minutes and is missing that Chaplin impersonation.","user":"drednm","rank":[25,27]},{"title":"A former Mack Sennett employee demonstrates what she learned at Keystone","rating":8,"date":"2 September 2007","review":"This rarely shown film is a delightful surprise, still fresh and amusing after 80 years. Manhandled is a saucy comedy which concerns the struggles of an ambitious working girl in New York. The biggest surprise is the identity of the leading lady: it isn't Colleen Moore or Clara Bow, who made careers out of doing this sort of thing, but Gloria Swanson, who in 1924 was best known for playing patrician beauties in high-class romantic comedies or soap operas. Gloria is surprisingly believable here in the unlikely role of Tessie McGuire, a lowly clerk in a department store, who commutes on the subway, lives in an apartment the size of a tool-shed, and struggles to make ends meet. What's more, Swanson is genuinely funny! I've seen a few of the two-reel comedies she made for Mack Sennett early in her career, but in those shorts she was usually relegated to playing straight woman (or Damsel in Distress) while the male clowns were entrusted with the gags. In Manhandled, however, Swanson is the star comedian, and her comic abilities are given free reign in scene after scene. I was fortunate enough to see this movie at Film Forum in NYC, where it was greeted with waves of laughter throughout; a passerby outside might have assumed we were watching Harold Lloyd.<br><br>The story is introduced with a wordy but intriguing title card: \"The world lets a girl think that its pleasures and luxuries may be hers without cost—that's chivalry. But if she claims them on this basis, it sends her a bill in full, with no discount—that's reality.\" Based on that intro alone a viewer might expect the sort of light comedy of manners Swanson had been making for director Cecil B. DeMille a few years earlier (the moralistic prose certainly smacks of DeMille) but the opening scenes make it clear that we're in for something earthier and more fun. Tessie McGuire is a gum-chewing gal who wears a silly hat adorned with fake fruit—the kind of hat Gloria Swanson, legendary clothes-horse, wouldn't have been caught dead wearing in reality, but somehow she doesn't come off as patronizing in this role. Within a few moments we adjust and accept her as a hard-working clerk from Thorndyke's department store, weary and footsore after a long day's shift on the job. After leaving the store our bleary-eyed heroine heads for the subway, and the sequence that follows is a classic: the petite Tessie is shoved every which way as she crams herself into the train, squeezes uncomfortably between two large men, and even gets hoisted into the air, accidentally, as she attempts to retrieve the contents of her dropped purse. Adding insult to injury, a gross looking guy winks at her, and she can't even get out easily when the train reaches her station, as mobs of incoming commuters repeatedly force her back in. This sequence scored a particular hit at the recent Film Forum screening, earning big laughs from New Yorkers who deal with this stuff every day!<br><br>The subway scene is deservedly famous, but the movie is just getting started. We learn that Tessie has a boyfriend named Jimmy (Tom Moore), a garage mechanic who is convinced that his car-related invention will make a fortune, enabling them to get married and live well. Tessie is supportive, but frustrated that Jim's heavy work schedule doesn't allow them much time together. When circumstances permit her to go to a swanky party with a girlfriend, she goes, and this is where things really take off. Tessie scores a hit with the swells, although it's clear (in another comic highlight) that she's baffled by the pretentious party chat flying back and forth. Guests include a number of wealthy and powerful people along with prominent artists and performers; among the latter is real-life Ziegfeld Follies star Ann Pennington, who dances with her stage partner Brooke Johns. Tessie—who has had a drink or two—performs her own version of the dance, loses her drawers, and takes a tumble, but somehow charms a handsome artist (Ian Keith) who engages her as a model and then dresses her in a wacky pseudo-Asian outfit that looks like a parody of Betty Blythe's Queen of Sheba. When the modeling gig doesn't work out, Tessie is engaged by the owner of a Park Avenue salon who hires her to pose as an exiled Russian countess and lend his establishment a touch of exotic class. Tessie's new employer is portrayed by Frank Morgan, already playing roués at age 34, and looking very much as he would throughout his entire career. (At the screening I attended I overheard a young woman exclaim: \"Wow, the Wizard of Oz as an old lech!\") Tessie's new job is certainly a step up from the department store, but her disguise is threatened when she is confronted by an actual Russian exile; her escape from exposure is ingenious and amusing.<br><br>As Tessie's strange career lurches along she comes into conflict with Jimmy, and unfortunately the story takes a brief sentimental turn towards the end, but I think it goes without saying that romantic comedies like this one always end happily once the misunderstandings are ironed out. Manhandled is not a plot-driven film, and a simple scene-by-scene description of what happens in it really doesn't do it justice. This movie is driven by Gloria Swanson's beautifully calibrated performance: it's her priceless facial expressions as she's chewed-out by her boss at the department store, her tipsy maneuvering at the party, her Pola Negri send-up when she masquerades as a Russian countess. She's terrific, and seeing this film makes me wish she'd appeared in more comedies, and that this one could be more readily accessible for modern viewers. Swanson could do a lot more than play crazy Norma Desmond, and this film is ample and highly enjoyable proof of that.","user":"wmorrow59","rank":[10,11]},{"title":"Gloria nearly falls prey to society men","rating":8,"date":"8 March 2001","review":"I just saw this film at the Silent Movie theater in LA.  The print was original, from 1924 and in remarkable shape.  The music was live organ played by a man who has been accompanying silents for more than 70 years. It was fantastic.  Not only does Gloria Swanson really shine, but Alan Dwan makes a hilarious picture out of a paper thin plot.  Every character is shown to the fullest, each moment is packed with nuance (usually by Swanson) but also for the other characters.  You can't help but feel the director at work there, sculpting each scene until it plays just so, a laugh a minute, but also so human.  Terrific.<br><br>ABE LEVY","user":"chrisjaymes","rank":[12,14]}]