[{"title":"Guilty pleasure of mine is not that bad of a slasher film that everyone says","rating":6,"date":"24 September 2017","review":"Friday the 13th Part VIII: Jason Takes Manhattan is a guilty pleasure of mine. I know this movie was also cut by the MPAA like was Friday the 13th Part VII: The New Blood and it is most of people's at least favorite film mine isn't. I am one of the fan's that I think it is not that bad film at all, like many of people are claiming. I will admit Jason Takes Manhattan and Jason X are guilty pleasure of mine and In my opinion are not that bad of a films.<br><br>I know this film is more Jason Takes A Cruise Ship then Manhattan because 1 hr is mostly set on the cruise ship and the first hour goes slow around. This movie is slow and boring at first but when the characters come in to the city New York the film get's really quickly around and interesting yes I love movies in the city's. Predator 2 get's a bad rap because the story was set in the city. But in my opinion it is good and a great sci-fi action slasher film. Maniac Cop was also set in the city and it was a good action slasher film. Why everyone dislike this movie I don't know I thought it was an okay film.<br><br>Kane Hodder was good as Jason Voorhees I didn't mind him in this movie I thought he was an alright Jason. I like the kills I also like the cast and the soundtracks for this film.<br><br>I like Jensen Daggett and Scott Reeves in this movie they are not that bad, this movie also has some action like police car explosions I love that. In here we also have Kelly Hu when she wasn't famous but she is now. Saffron Henderson was hot babe in this movie too bad she was killed in the beginning of the film. Sharlene Martin was great hot sexy babe in this. The gore scenes in my opinion wasn't that bad but were still good.<br><br>The reason Part VII and VIII were so toned down in gore and violence is the MPAA took an absolute hatred and developed contempt for these movies. Their minds were already made up before they sat down to review it. Sad to have this kind of censorship in modern times.<br><br>I love the song Darkest Side Of The Night by Peter Freddette. Director Rob Hedden also wrote the song for this film Tamara's Bio Project and he performed.<br><br>I know I said I dislike Friday the 13th Part 3: 3D and Friday the 13th Part V: A New Beginning but in my opinion I have simply enjoy this movie more I really like that Jensen Daggett and Scott Reeves were on the train and Jason was chasing them, I like that Scott Reeves electrocuted him and Jason still walked ha ha that was funny.<br><br>I love that toxic waste killed Jason on the end of the film, but what was I confused was why Jason suddenly turned in to young boy after he was killed by toxic waste? I don't understand that at all. But the ending was satisfying for me I didn't except a lot but it was alright and it has happy ending. I like happy endings in horror movies and I was rooting for the good guys.<br><br>The reason why this movie was on a cruise ship and was filmed in Canada was because they run out of the money so they filmed on a cruise ship mostly scenes in Canada because it was cheap. The last scenes were filmed in New York they didn't had properly money to make it as an awesome movie but I like it.<br><br>It is not great but it is at least watchable tough it doesn't take place in Crystal Lake. Before I forgot I love that funny scene in which we see Jason with Hockey Mask and we just see with hockey mask a poster hanging on it and he looks right in the camera boy was I laughing that scene was entertaining.<br><br>This movie get's C+ 6/10 the most underrated movie ever this is guilty pleasure of mine I am still going to watch it when I will have time.","user":"ivo-cobra8","rank":[48,56]},{"title":"Friday the 13th Part VIII Jason Takes Manhattan: Not the blotch I'd heard but still pretty meh","rating":5,"date":"7 October 2017","review":"I'd been told from multiple sources that Jason Takes Manhattan is a weak link in Jasons legacy. Though hardly impressive I'd say its no worse than many of the others.<br><br>Finally taking Jason away from the camps we see the majority of the movie take place on a ship with it's perhaps last third in the bustling city of New York.<br><br>Same cut away deaths, same lack of storyline, but same Friday 13th charm. Also Kane Hodder is Jason so that's an immediate win right there.<br><br>I do have to ask, what is it with Friday 13th and inconsistencies and poor endings? This one is no different and I feel like I could rant about it for an hour but will resist the urge.<br><br>Jason Takes Manhattan is a worthy addition to the franchise even if the events that transpired in the finale are not explained in part 9.<br><br>The Good:<br><br>Kelly Hu<br><br>Kane Hodder<br><br>Refreshing new setting<br><br>The Bad:<br><br>Why'd they have to kill off such a great character so early?<br><br>Ridiculous ending<br><br>Weak deaths","user":"Platypuschow","rank":[10,10]},{"title":"The Last True \"Friday\"","rating":5,"date":"23 November 2006","review":"Renowned film critic Leonard Maltin calls \"Friday the 13th Part VIII: Jason Takes Manhattan\" the highlight of the series. Of course Maltin rated virtually every other \"Friday\" film a dud, so that's not saying much. In any event, he's wrong. But while this eighth installment is comparatively inferior to most that preceded it, it's not as bad as reputed outside Maltin circles.<br><br>\"Jason Takes Manhattan\" is one of those movies that's impossible to love unconditionally. There are simply too many flaws, from ridiculous plot elements (Jason can teleport???) and an uneven pace to a lack of chills and incompatible attempts at humor. Indeed this entry represents a bitter come-down after the absolutely stellar parts VI and VII.<br><br>In many ways, \"Jason Takes Manhattan\" doesn't feel like part of the franchise. The Jason here isn't scary like we know he can be. His deadly moves, be it the electric guitar impaler or decapitatingly powerful right hook, seem contrived. Kane Hodder looks like a guy in a Jason suit rather than the real deal. Director Rob Hedden fell into the trap of gore for the sake of gore, but that's never been what \"Friday the 13th\" is all about. It's all in the build-up, and sometimes, even in low-budget '80s horror, less is more.<br><br>With all of that said, \"Jason Takes Manhattan\" isn't a total loss. The mere sight of the rapidly decaying villain storming through the mean streets of the Big Apple is worth at least four stars. Aside from the change of scenery, the film offers a semi-compelling storyline or two. And the masked one does have his frightening moments, smashing through portholes and firing harpoons at horny teens. As usual, the climax -- this time a chase through the city and sewer -- is the highlight.<br><br>For better or for worse, \"Jason Takes Manhattan\" marks the last true \"Friday the 13th.\" This was Paramount's last stab (pun intended) at things before selling the rights to New Line Cinema, which basically destroyed the series with absurd ideas like Jason switching bodies and rampaging through spaceships. Not great, but not godawful, this film carries limited appeal outside of fanboy circles.","user":"ReelCheese","rank":[35,52]}]