[{"title":"An appealing digression","rating":6,"date":"25 October 1999","review":"Interesting movie has something of the rueful eccentricity of a Peckinpah movie, although it's told on a much more modest scale. The movie has a sense of transition, with expressions of wonderment at the new steam engine vehicles and even at the game of baseball - there's a sense of gun culture being pushed out and marginalized, although the town's crooked banker illustrates that the new age isn't going to be free of corruption. The structure also has an appealing oddity,\tillustrated by the band of pursuers on the train, monitored through the entire movie, only to turn up at the end after it's too late. Duvall is occasionally almost Apostle-like as Jesse James and Robertson gives one of his most flavoured performances as Cole Younger. The movie seems very much like a tentative first work and explores themes and ideas in a fundamentally very modest way, but the overall mood is quirky and distinctive and the trim ninety minutes running time makes it an appealing digression.","user":"allyjack","rank":[22,24]},{"title":"The inner life of outlaws","rating":7,"date":"21 September 2010","review":"There are a few western staples in 'The Great Northfield, Minnesota Raid': the last mission, the friendly whorehouse; but compared with most films of this type, it's a plausible and honest portrait of the life of a criminal gang, and set in the relatively lush lands of the near west instead of the dry high plains further west. In fact, it's based on the story of a real gang, one that featured the legendary Jesse James, and it's refreshing to see this character demystified: he doesn't even take top billing. However, the plot never quite comes to life, and perhaps more could have been made of the gang's origins in the aftermath of the civil war. But like Altman's superior 'McCabe and Mrs. Miller', made at around the same time, the film deserves credit for telling its own tale, instead of merely re-hashing the clichés of the genre.","user":"paul2001sw-1","rank":[12,13]},{"title":"Bob ain't dead, Jesse ain't the Lord and we ain't going","rating":6,"date":"28 September 2007","review":"There are really nice things here. Duvall taken by the spirit and delivering visions of Yankee raids; his sycophant brother following him even to the toilet; Luke Askew's missing lip; the old woman pronouncing doom in cryptic rhyme; Duvall's escape in drag; Robertson shot 16 times. But Kaufman apparently didn't have the chops to know that Bruce Surtees was quietly destroying what could have been a pretty good little art picture.<br><br>What should be a semi-psychedelic fever dream of distorted Americana looks like a drunken episode of Bonanza, crowded/blurry/badly framed two-shots all in brown. Half the film takes place in the woods, in Missouri, and it's not even green. The whole movie seems to have been shot with a single lens. Even the credits appear cheap and dated. No question, this movie looks as low-end and made-for-TV as any Aldrich or McLaglen Western of the same period. LONG RIDERS, a later, more traditional and visually interesting James Gang movie by Walter Hill, certainly is slicker in delivery.<br><br>But NORTHFIELD, for all its art-school faults, at least reaches toward transcendence. In Kaufman's writing and direction is an attempt to commandeer the drive-in horse opera formula and ride it into 70s ambiguity. The bad guy heroes are sort of unheroic; the Pinkertons are a cartoon counterpoint; the dialogue is occasionally quite choice. But while this is my favorite screen investigation of Jesse James, the film as a whole does not rise above its weaknesses.","user":"rhinocerosfive-1","rank":[10,11]}]