[{"title":"Fun & Charming","rating":10,"date":"2 August 2000","review":"This is a truly great and fun movie. I found an old copy of it in my local video store, and rented it twice!! Thanks to a fellow Tim Curry fan, I now own a copy as broadcast on the CBC network.<br><br>I'm a huge Tim Curry fan, and I love all his work. But.. I will admit that this movie is hands down the best work he's done. \"Rocky Horror\" was great, yes. But \"Blue Money\" shows off his versatility much more. I laughed, I drooled at Tim's beauty, and had a ton of fun.<br><br>We see Tim singing, dancing, doing impressions, dressing in drag (once again!), and he finally doesn't play a bad guy. Larry's no angel, but you'll love him anyway.<br><br>If you see this for rent, or in a bargain bin at a flea market or video store...BUY IT!! You'll never regret it, and own a fun movie too.","user":"carina6679","rank":[11,11]},{"title":"blue money","rating":10,"date":"29 March 2005","review":"I have seen this film once and thought it was brilliant i would like to see it again but have no idea where to obtain it.i have told friends about it and they tell me they would, the acting is very good and Tim curry plays a brilliant part its also funny.I have not seen any other films with Tim Curry in so i cannot compare it with any of is other films,therefore if there is any Tim Curry fans out there this is a film for you,it will keep you in your seat from start to finish with a lot of action and a lot of laughs. I do not watch a lot of television so i may have put it on by chance i am very pleased i did.Because this film kept me in my seat,the main part of the film i can remember is Tim Curry as a taxi driver i am now a taxi driver myself and often think of this film while i am taxi driving.","user":"mposbiston","rank":[7,7]},{"title":"Take the Money And Run! (spoilers)","rating":7,"date":"25 December 2004","review":"This movie was a great find...something obscure and possibly long forgotten--a low-budget English caper comedy about a chauffeur (wonderfully played--as usual--by Tim Curry) and aspiring stage performer who, almost seemingly down on his luck and out on his ass, comes upon a rather problematic opportunity when he finds his employer carries around a suitcase full of cash.<br><br>The pathetic dolt steals the money and goes on a spending spree with his girlfriend, Pam, who unfortunately gets caught up in the mess as well, though somewhat understandably so. Although she was once reluctant to play along in the game for fear of violent retaliation by the owners of the money--South American drug lords, she has fun indulging in the \"finer\" things of life with her mate. This leads to a large number of problems once the drug lords figure out who has the money and follow him across the United Kingdom to get hold of it.<br><br>The beginning of the film is somewhat slow. If you are unfamiliar with the plot (although, if you read this review, you now have some idea), then you may just think it is the story of a struggling stage performer. Actually, that's pretty perfect, because the beginning moves rather slowly and at times--slightly confusingly--but once the chauffeur gets a little curious about the contents of his driver's briefcase, it is more than the story of a rather pathetic, happy-go-lucky guy. It turns into a hilarious little caper.<br><br>Moreover, the ending to this rather mad, and often hilarious, series of events was somewhat of a let down and, one might say that our character, though at times sympathetic, was still an idiot for stealing the money and, even though they presumably wanted a happy ending for the film, he got off rather light and we were left with a very vague way of tying up the loose ends of the story's on-going conflict among the main characters. Nonetheless, Tim Curry (and the rest of the cast) give a great performance.<br><br>This movie is perfect not only for Tim Curry fans, but for people who just love to watch movies, especially older, obscure ones that no one has really ever heard of, but could never hurt to try. It is a great way to pass eighty-two minutes.","user":"vertigo_14","rank":[4,4]}]