[{"title":"I Saw This Thirty-three Years Ago","rating":1,"date":"1 June 2004","review":"I saw this in a theatre here in the United States in 1971, when I was eleven years old. I'd seen Richard Attenborough as the circus master in DOCTOR DOLITTLE and I wonder if I'd sold my mother on taking me to this one because I knew the name Richard Attenborough. In any case, this movie burned itself into my brain immediately and, for the next three decades I told many of my fellow American film-buffs that there was this British movie no American had ever heard about that was more blood-curdling than PSYCHO. I suspect the obviously limited release of this movie in the United States had something to do with the fact that one of its chief selling-points was that it was based on a murder not well-known to Americans. The Christie murders were famous in Britain, and, in fact, historic because of their effect on the elimination of the UK's death penalty. But the distributors in America had to market this on its qualities as a thriller. Attenborough had yet to make his name a household word here, GHANDI being about ten years in the future and the probable difficulty with accents couldn't have made people who did see it very eager to recommend it. On top of this, the movie is not a thriller but a truly disturbing exploration of evil. It makes the roughly contemporary FRENZY look like a sitcom. Movies became more realistic in the late sixties and early seventies than they have been before or since. 10 RILLINGTON PLACE may be the most realistic movie about a serial killer ever made. It may not be the scariest, but it's the most memorable. I haven't forgotten it, and I haven't seen it in more than a generation. It is a mournful movie for serious viewing.","user":"thurberdrawing","rank":[100,103]},{"title":"Creepy film, but excellent!","rating":5,"date":"5 February 2002","review":"This British thriller is one of the best films I have ever seen.  It tells the story of John Christie, the serial killer whose \"career\" lasted from the middle 1940's until the early 1950's.  The name is taken from the scene of the murders; 10 Rillington Place, Notting Hill, London.<br><br>Chillingly portrayed by the great actor Richard Attenborough , Christie was a little mouse of a man who first lured his victims home on some pretext or other, usually by saying that he could perform some desired medical procedure on them, for example, an abortion, which was illegal at the time. Once there, he put them at ease by offering them a cup of tea,  deceived them into breathing gas from the pipe, rendering them unconscious, then strangled them.  He disposed of the bodies, at first by burying them in the garden, then putting them under the sink in the water closet, and finally by tearing up and replacing floorboards and papering over cupboards.<br><br>The primary reasons that Christie was able to do what he did for so long were first of all the war.  London was undergoing the blitz, and people had a tendency to disappear during the bombing.  Another reason was that he was able to turn the suspicions of the police from him to a not very bright truck driver named Timothy Evans, (played by John Hurt)  who was convicted of the death of his baby daughter, and was also suspected in the murder of his wife, but due to English law could only be tried for one or the other of them.  He was hanged in 1950.  The scene in the film where Evans is hanged is chilling, and quite accurate.<br><br>Slow at first and shot on location at the actual scene of the murders, the film shows a dangerous manipulative killer hiding behind a bland, mild exterior. Because he appeared so mild, Christie was all the more terrifying. Attenborough brings this out expertly and the overall effect is very creepy.  <br><br>This superbly-acted film is British cinema at its' very best.<br><br>Cup of tea, anyone?","user":"garyoverman","rank":[80,86]},{"title":"A film which shows why the death penalty will never return to the UK.","rating":10,"date":"13 July 2000","review":"10 Rillington Place is more than a classic film. It is frequently referred to whenever the call for the death penalty is made in Britain. The notorious miscarriage of justice i.e the hanging of Timothy Evans, an immature half-wit, for the murder of his wife and child when it is almost universally accepted that they perished at the hands of John \"Reg\" Christie, is one which will always haunt the British legal system. When Christie was found guilty and hanged as a serial killer of women, the body of Evans was exhumed and reburied in consecrated ground but this did nothing to hide the embarrassment of those who supported the death penalty.<br><br>The film itself is a dark and brooding masterpiece which depicts life in post-war London perfectly. The grim, dirty, rain-washed Rillington Place in Notting Hill was a seedy side-street which housed the poor but largely respectable families which had survived the blitz. John Christie had moved down from the North to find work in the capital but ill-health and a penchant for petty crime prevented him from being successful.<br><br>Richard Attenborough plays the downtrodden but curiously arrogant Christie to perfection. His voice almost a whisper as he lauds it over London's underclasses. In fact Christie was not a landlord, as many believe, he was merely a tenant who fancied himself to be a landlord and acted accordingly. He also dreamed of being a doctor, with devastating consequences. His treatment of the poor, subnormal Evans (John Hurt) and his beautiful but foolish young wife, Beryl, (Judy Geeson) was centred around their desire for an abortion - illegal in the UK until the late 1960s.<br><br>John Hurt is very good as the hapless Evans although his Welsh accent needed refining. His look of wide eyed horror and disbelief is a sight to behold. Geeson pouts and whinges and looks gorgeous: the kind of wife any man would desire and yet the kind destined to irritate intensely.<br><br>The key to appreciating 10 Rillington Place is to have some idea of its setting in British history. To wander in clueless will result in disappointment. There is no gore or x-rated content of any kind and its slow pace will infuriate many. Yet, as a snapshot of an England now gone and a reminder of the folly of capital punishment it is a timeless classic worthy of many viewings.","user":"drj-12","rank":[86,99]}]