[{"title":"I love this movie!","rating":7,"date":"13 December 2002","review":"Okay, the plot sounds ludicrous, doesn't it? A giant killer pig? Despite the apparent ridiculousness of the plot, this movie is better than one might expect.<br><br>Beth Winters, a Canadian reporter, has come to the small Australian Outback town of Gamulla to shoot a story about the local dog food packing plant, which uses the meat of poached kangaroos in its product. When Beth disappears one night, her husband Carl arrives to find out what happened. Beth apparently ran afoul of the psychotic Baker brothers, who work in the plant. But crusty old Jake Cullen soon learns that Beth was a victim of a giant razorback, the same one that carried off his grandson years before and which he has been hunting ever since. <br><br>The Australian Outback becomes an almost alien world - desolate, strange and scary where any form of undiscovered life might exist. You don't get to see much of the giant pig, admittedly, but then they didn't have CGI back in the early 80's. The real menace of this movie lies with the kangaroo poachers, two brothers who reek of malevolence and filth all the way through the film. They were truly terrifying, and the insane laughter of David Argue (playing younger and more dangerous brother Dicko) still haunts me to this day. <br><br>Worth watching at least once.","user":"Gafke","rank":[38,45]},{"title":"fantastic piggy fun","rating":4,"date":"4 October 2003","review":"Judging by the external reviews, quite a few people appear to hate this film. I can see why, but I think they're coming at it from the wrong angle.<br><br>\nI see it as - intentionally - trying to send up the whole genre of vengeful animals horror flicks. In truth, neither sharks nor grizzlies, and certainly not razorback hogs, are smart enough to conceptualize, let alone carry out, acts of vengeance on humankind. The film simply takes the \"rules\" of this particular genre and applies them to a ludicrously unfit vehicle: a giant pig. And there are some pretty funny scenes, notably one where the monster eats a nasty watchdog that's chained to the side of a house; naturally, the corner of the house to which the chain is attached comes off and Joe Couch Potato is left sitting in a wall-less abode, staring quizzically as his television disappears into the outback.<br><br>Treat it as comedy, and the film makes a lot more sense.","user":"macduff50","rank":[27,32]},{"title":"giant pig on the loose...where's the slop?","rating":29,"date":"29 March 2001","review":"Call me stupid, but this is actually one of my favorite horror flicks. The story's about a giant wild boar munching on Aussies in the outback. Our hero goes in search of his wife...she's missing out there. Many interesting ideas come forth in this movie. I especially like the kangaroo killing brothers Benny and Dicko (hehe). The way the movie portrays them is interesting, contrasting the life of the outback trash to the much more civilized life of Bill, the hero. I also enjoyed the use of weird settings(the desert with that \"horse\") to create atmosphere. Overall, I enjoyed this flick a lot, and I think most horror fans would if they look beneath the seemingly ridiculous plot.","user":"sick_boy420xxx","rank":[18,21]}]