[{"title":"Enjoyable Boys Own Romp.","rating":7,"date":"3 November 2002","review":"Some time after the successful mission to destroy the huge guns on the island of Navarone, Mallory and Miller are sent to Yugoslavia to kill Nikolai, a German agent who nearly blew the Navarone operation, and who has now infiltrated the Partisans. To get there they are attached to Force 10 led by Col. Barnsby, who have their own mission to destroy a vital bridge. From the outset things go wrong, as they steal a Lancaster from an airfield in Termoli, are joined by Sgt. Weaver (escaping US MP's), then get shot down, bail out, and are captured by Chetniks who are loyal to the Germans.<br><br>   By the time this sequel to 'The Guns Of Navarone' was made, 17 years had passed. Gregory Peck and David Niven were too old to reprise their roles, so Robert Shaw and Edward Fox took over. Harrison Ford, fresh from 'Star Wars', played Col. Barnsby, Franco Nero signed on as Nikolai, and Richard Kiel, Barbara Bach, and Carl Weathers all came from recent box office hits - the former two from 'The Spy Who Loved Me', the latter from 'Rocky'. Guy Hamilton was hired to direct (Goldfinger, Battle of Britain, Live and Let Die etc.)<br><br>   This film has been much maligned over the years, somewhat unfairly. It could never hope to emulate its predecessor, and therefore takes a different approach. While 'Guns' had a taut, serious tone, this adopts a more tongue in cheek feel. Some of the interplay between Shaw and Fox is quite deadpan and amusing, with the actors obviously not taking proceedings too seriously. Harrison Ford looks uneasy at the start, but settles into his role as things progress. The use of the stunning Yugoslavian countryside gives the film a unique feel, and it appears to have had a decent budget. The score harks back to the type of Boys Own adventures that were so popular a decade earlier. <br><br>   There are some flaws, yes. Possibly more tension could have been injected at some points, and Mallory seems to have lost the ability to speak fluent German since 'Guns'. It's not in the same league as that film or the marvellous 'Where Eagles Dare', but it's an enjoyable way to pass a couple of hours on a cold, wet winters' night.","user":"KEVMC","rank":[23,24]},{"title":"Okay, But Don't Watch It With It's Predecessor Back-To-Back","rating":5,"date":"5 June 2000","review":"If you love the \"Guns Of Navarone\" as one of the greatest, and more importantly most literate WWII action films of all time, then this \"sequel\" is really going to cause some painful moments, and I wouldn't recommend watching the two films back-to-back under any circumstances.   Owing to the fact that it took original \"Guns\" producer Carl Foreman a decade to get the \"Force 10\" film project off the ground, Gregory Peck and David Niven were both  Social Security eligible by the time the film was ready to go, and that meant we'd have to see a new cast.  And for the most part, despite the borrowing of footage of the first film's climax at the beginning you might as well watch this film pretending the first one never happened.   The \"Nicolai\" connection to the first film is weak and barely explored, and we probably could have done without that plotline altogether.  And whereas \"Guns\" was deadly serious in tone, filled with some rich character studies and literate exploration of the moral questions that get raised even when fighting a good cause, \"Force 10\" is really more of an escapist war film, punctuated with moments of light comedy, and with no depth whatsoever in the characters and script.  If one is willing to accept the film on that level, then it can be enjoyed as an entertaining diversion, but no more.   It is interesting to see Harrison Ford in his first post-Star Wars role working alongside the great Robert Shaw in his last film, and Edward Fox appears to emulate most of David Niven's mannerisms quite well.   Carl Weathers though, was an annoying distraction and the scene where he demanded \"answers\" while the enemy was approaching was just plain dumb.   <br><br>By it's very title though, \"Force 10\" is always going to have the problem of it's magnificent predecessor hanging over it.  Too bad the sequel possibility wasn't cashed in on sooner when Peck, Niven and Quinn could have still done their parts (I always hoped they'd lead a new mission to rescue Anthony Quayle!)","user":"Eric-62-2","rank":[47,54]},{"title":"FORCE 10 FROM NAVARONE is a great yarn.","rating":8,"date":"6 February 2007","review":"My Take: Often lambasted, but fast-paced and highly entertaining sequel to the classic adventure film. <br><br>Honestly, I think \"Force 10 from Navarone\" was more fast-paced, action-packed and hilarious as it's predecessor, \"The Guns of Navarone\", but then, it also lacks the stronger elements that made its predecessor better. But it seems unfair to compare a sequel to its predecessor when the film is a sequel in name only. Other than the opening which re-tracks the memorable final scenes from the original, FORCE 10 FROM NAVARONE mostly flies solo. <br><br>The cast was excellent. Robert Shaw and Edward Fox are good replacements to Gregory Peck and David Niven in the roles of Keith Mallory and Major Miller. Harrison Ford absolutely amazing as Lt. Col. Barnsby. Carl Weathers is usually out of place, but he's fine enough. While Barbara Bach and Richard Kiel offer fine performances after their roles in \"The Spy Who Loved Me\".<br><br>There will be a few hate remarks from fans of the original, but seeing it as not a sequel to the classic film and more of a film that uses 'Guns' as its inspiration, this \"sequel\" is fun, exciting and occasionally excellent. <br><br>Rating: **** out of 5.","user":"vip_ebriega","rank":[31,39]}]