[{"title":"MISHIMA: A Troubled Life in Four Chapters","rating":10,"date":"3 April 2001","review":"One would think that a film based on the life of the Japanese author Yukio Mishima would be a daunting if not impossible task. However Paul Schrader has indeed made a film \"about\" Mishima that is both superb &amp; complex. While it is not a literal biography, Schrader &amp; his co-screenwriter Leonard Scharder (his brother) have taken several incidents from his life, including his sucide and crafted what can best be described as incidental tableaus that are visually sparse and stunning. Mishima's homosexuality is almost not there, due to legal threats from his widow, but in spite of this, the film is still terrific, and one of the best films I saw in 1985. I should also mention the important contribution of Philip Glass who did the score, which adds an additional texture to the film, and is superior to the one he did for Scorsese's Kundun. Also notable is John Bailey's fine crisp beautifully colored cinematography and the great production design &amp; costumes by Eiko Ishioka who went on to do the memorable costumes for Coppola's Dracula for which she received a well deserved Oscar. Hopefully this film will soon be available on DVD.","user":"irajoel","rank":[36,40]},{"title":"Magnificent","rating":21,"date":"21 February 2003","review":"A story told in four chapters and in three levels. Flashbacks of Yukio Mishima's life, dramatizations of his written works, and the events of his final day of life.<br><br>If Mishima was a fictional character, I doubt if anyone would believe or accept such a creation. But he was a real, flesh and blood, human being, which makes the film all the more incredible. Granted that some of the facts have been dramatized or \"enhanced\" for the screen, but the story is quite factual.<br><br>A man of many contrasts: A devoted family man who kept a gay lover. A writer who saw his words being \"not enough\". A patriotic man at home in the present who yearned for a return to Imperial Japan's past glory. A man who struggled to unite movement with action, and saw everything he strove for fall apart at the most critical moment.<br><br>The film is lovingly made, magnificently acted, painstakingly edited and the musical soundtrack by Philip Glass will stay with you for days. The film's tight budget doesn't show at all.<br><br>Now available on DVD, this film is a worthy addition to the collections of true cinemaphiles.<br><br>My rating: 10/10","user":"Baroque","rank":[29,33]},{"title":"Stunning","rating":9,"date":"9 July 2008","review":"\"Mishima: A Life in Four Chapters\" is one of those films which is extremely hard to write about simply because it hit me on such an emotional level and stunned me with its artistry to the point where writing a review or comment on the film seems trivial and useless. Hence, this will be rambling and poorly-written, but I'll give it a shot anyway.<br><br>The easiest thing to talk about when discussing \"Mishima: A Life in Four Chapters\" is the technical elements of the film. The narrative is superb and fairly original with a fine script by Chieko, Leonard, and Paul Schrader and Schrader's decisions as director are pretty much faultless. Every stylistic turn the film took, every sequence which took a risk, and pretty much the whole time the camera was in motion I was utterly enthralled and fascinated with how well the film works as a film. Paul Schrader may not be as great a storyteller as some of the great directors are but in \"Mishima\" he proves that he is more than capable of being a wonderful storyteller if necessary. The film moves at an extraordinarily fast pace and one barely notices the passing of the two hours.<br><br>I have to say, despite being a literature buff to an extent, I have never read anything by Mishima. I knew one or two things about Mishima, including the big ending to his story (which I won't reveal, to keep this spoiler-free) prior to seeing the film, but not much else. Perhaps this is why I felt, contrary to some others, that the film got progressively stronger and ended with a breathtakingly brilliant final act. I also found it completely refreshing how this biopic took no position on Mishima or the final act of his life- it is simply a portrait of a man, not a comment on his life. <br><br>The Phillip Glass score is utterly brilliant. There is very little of this film that doesn't prominently feature it, which can come off as the result of a lack of confidence from the director, but in this case it is used superbly well in the film. The score is original, vibrant, interesting, and memorable- much like the film itself.<br><br>\"Mishima: A Life in Four Chapters\" is a film that is certainly ripe for interpretation and analysis. I am not going to attempt to provide either of those, mostly because I'm not really in a position to, and also because I found this a profoundly emotional experience, a film of such artistry that it is a film that everyone should experience without preconceived notions of quality or content and one that everyone should attempt their own analysis of. It's that special. It's that good.<br><br>10/10","user":"ametaphysicalshark","rank":[23,27]}]