[{"title":"Excellent sequel","rating":9,"date":"8 October 2003","review":"\"Rocky II\" is one of those sequels that is just as good as the original, if not better in some aspects.  I can't say it's better than the original because you can't have the second film without the first one.  Meaning that this film does not stand on it's own, you need the first film to understand the characters and back-stories of everything in this film. But all in all, I think \"Rocky II\" is slightly more enjoyable than the original \"Rocky\".<br><br>In all honesty, I think this film is better directed than the first film. The story seems to flow quite nicely and is slightly faster paced than the original.  Not only that, but the main fight in the film is much more exciting and longer.<br><br>The acting in \"Rocky II\" is better as well, or at least I thought so. Sylvester Stallone does a fantastic job with his role of Rocky Balboa and really struts his stuff here.  Talia Shire and Burt Young also pull off nice performances.  Carl Weathers plays the character of Apollo Creed to a \"T\".  And of course, Burgess Meredith does a fantastic job as Mickey.<br><br>This is one of those sequels that truly has the same feel as the original. Granted, it isn't as fresh as the original...but it's a re-match that can't be missed.  If you liked the original \"Rocky\", then you definitely ought to check this one out, I don't think you'll be disappointed.  I hope you like the film as much as I do.  Thanks for reading,<br><br>-LebowskiT1000","user":"LebowskiT1000","rank":[92,98]},{"title":"One of the best sequels ever made. I'm not joking.","rating":7,"date":"10 August 2004","review":"I have to hand it to Sylvester Stallone  he did the impossible with 'Rocky II' and made a successful follow-up to 'Rocky,' winner of the 1976 Best Picture Academy Award.<br><br>Some argue that 'Taxi Driver' (also nominated) deserved the Oscar more. I'm not so sure. 'Rocky' came along at just the right time  it was an uplifting story and people needed that back then. Now, 'Taxi Driver' is usually considered the superior of the two  but they're entirely different and, in my opinion (and it's a rare one), 'Rocky' is just as good  but in a different way. They're both great films, and I'm not saying that 'Taxi Driver' shouldn't have won  but I'm not necessarily saying it should have, either. 'Rocky's' achievement is monumental and it is one of the greatest films ever made. To say it's 'not as good' merely because it is more optimistic is nonsense.<br><br>So what's so great about 'Rocky II' and why is it generally underrated? (Its average user score right now on the Internet Movie Database -- with over 8,000 votes -- is a measly 6.2/10, compared to the original's 7.7)<br><br>Because it maintains the focus of the first film, and continues the story rather well. A story that didn't really need to be continued, per se, but nevertheless formed the foundation of one of the greatest film franchises of all time. That's right  many people hate the 'Rocky' sequels, but apart from 'Part V,' they're all surprisingly entertaining  and, more importantly, well made. I like them; they entertain me, and I think they all serve their purpose.<br><br>What's particularly interesting about 'Rocky II' is that apart from repeating the central theme of fighting Apollo Creed (Carl Weathers), Rocky (Stallone) goes through a character arc here that many sequels totally ignore  we see the after-effects of his fight, and him struggling to adapt to the 'New Life.' <br><br>Rocky is not a smart person. But he is one of cinema's deepest characters. Stallone (who wrote all the scripts and directed three of the sequels) succeeds at evolving Rocky's self-confidence. After winning a small fortune from his famous fight with Creed, he goes out on an impulsive shopping spree, buying a cool car, a new leather jacket (with a tiger  the beast with the 'eye' that Rocky re-captures in 'Part III'  printed on the back), and a new luxurious apartment for him and his wife Adrienne (Talia Shire).<br><br>The problem is that Rocky soon runs out of money. His happy-go-lucky personality crashes when he is faced with the prospect of losing it all. He promised Adrienne never to fight again, and keeps his word by trying to get a 'real' job at the meat-processing factory (the same one he trained at in the original film). However due to staff cut backs he is fired and soon realizes that he was born for one reason: To fight. <br><br>Meanwhile, Apollo is eager to take on 'The Italian Stallion' again  to prove he isn't the coward that criticizers are implying he is. He entices Rocky back into the ring for a final match  and to say that the outcome is satisfactory is an understatement.<br><br>Most people seem to forget that Stallone is almost solely responsible for the entire success of 'Rocky' as a whole. He came up with the idea, wrote a script, fought to get it made, fought to become the leading star, and literally fought to get in shape. All of this fighting paid off  and it continued to pay off as he kept on cranking out all the sequels.<br><br>Indeed, the 'Rocky' legacy is often poked fun at because it is the typical endless Hollywood moneymaking franchise. But 'Rocky II' and 'III' (more so than the other two sequels) have guts, power, determination and focus  they've got the so-called 'Eye of the Tiger' and I can't really say that I agree with anyone who says these movies are worthless. They aren't masterpieces but they certainly aren't trash, either. I give 'Rocky II' a hearty recommendation  it's a truly solid sequel that surprises us right when we expect to be disappointed.","user":"MovieAddict2016","rank":[114,132]},{"title":"Outstanding Sequel.","rating":9,"date":"16 January 2009","review":"\"Rocky\" is truly one of the greatest films ever made. So a sequel to this film would have a tough time following it. Rocky 2 does a great job following up \"Rocky\" and is truly a great film.<br><br>The story starts up right where \"Rocky\" left off. Rocky goes to the hospital and has surgery and it is revealed that further fighting could damage his eye badly and make him go blind possibly. So Rocky settles down, marries Adrian and starts making commercials. Soon Adrian gets pregnant. However soon his ability to not read well costs him his job making commercials and Rocky struggles to find another job. Elsewhere Apollo Creed is furious that so many people are criticizing him for going 15 rounds with a guy who came off that street. So Apollo wants a rematch. Rocky decides that he must fight again, which upsets Adrian due to the health risks he may face.<br><br>This film succeeds mainly due to the fact that it does a great job continuing the Rocky saga. It starts right up after \"Rocky\" and further continues the story. It is an awesome follow up. All of the characters are further developed. Apollo Creed is shown more and his character is expanded the most and you get to see what he is like more. Carl Weathers does a great job with Creed in this episode and really plays the upset athlete at the media well. Paulie takes a back seat in this film for the most part but Adrian is very significant in this film as she is the main reason why Rocky is so reluctant to get back in the ring.<br><br>Rocky 2 is really funny, more so than the first one. Love how Rocky goes around trying to get a job despite the fact that he has basically no education. Also humorous is how bad Rocky is at reading cue cards and what he chooses to talk about at his press conference with Apollo. For the most part Rocky and Rocky 2 are more funny than the next films mainly because of how Rocky becomes \"civilized\" in \"Rocky 3\" and loses his sense of humor in some ways.<br><br>The training that ROcky does in this film is epic. Love the training that he goes through in this film, slamming metal, chasing chickens, and hopping around with lumber on his shoulders. Rocky really works hard training in this film, my personal favorite of his films in how he trains.<br><br>No film is perfect though. The \"Gonna FLy Now\" song is not the same as it is in the first film. It is not sung by the same people who sang it is the first film so it is not nearly as good. However this song is only used when Rocky is running, not when he is doing his other training. They use the \"Going the Distance\" song when he is doing his training outside of his running which is fine.<br><br>Also the fight at the end of the film is not nearly as good as the fight in the first film. It is mainly just Rocky getting pounded relentlessly and having to overcome a superior athlete. Not like in the first film where it is an even fight for the most part.<br><br>A great sequel that is funny, further expands the story and characters, and has some really great and memorable moments. A must see and easily the second best film of the series.","user":"jerekra","rank":[26,28]}]