[{"title":"Forgotten Gem","rating":8,"date":"8 May 2005","review":"Although (unfairly) ravaged by critics at the time and so generally dismissed ever since, HOW I WON THE WAR is both a brilliant anti-war film and anti war film film (much more so than the usually heralded M*A*S*H). Filled with biting satire and brilliant performances from Michael Crawford, John Lennon, Roy Kinnear, Ronald Lacey, Michael Hordern and, well, the entire cast, HIWTW was perhaps a bit too odd for 1967 audiences who expected perhaps a more madcap adventure, but today it deserves not only a rethink - but a reissue on DVD. (Why this wonderful movie is not available on DVD (at least in the US) is yet another slap in its face.) Richard Lester and writer Charles Wood (who also wrote HELP! for the Beatles) have crafted a brilliant black comedy that easily stands with Dr Strangelove. It won't be everyone's cup of tea, granted, but if you forget your preconceptions and let it wash over you, you will be richly rewarded. RELEASE IT ON DVD!","user":"thearchives","rank":[31,41]},{"title":"Catch-22 Meets Waiting for Godot","rating":10,"date":"15 April 2006","review":"This challenging film is in a class all of its own. It's as if Samuel Beckett had written a screenplay filling it with low slapstick and very smart commentary. Lester's ultimate point seems to be that war is merely just an extension of class war. Michael Crawford is excellent as the clueless, Bertie Woosteresque squad commander; always trying to piece things together with a seemingly high class education that does him absolutely no good in the thick of war's irrationality. The fast-paced gags come in rapid succession, punctuating each working class soldier's senseless death with great comic absurdity. And yet, armed with his upper class and horribly thoughtless \"sacrifice for King and country\" paradigm, Lt. Goodbody forges ahead on a completely senseless mission inadvertently causing the deaths of all of his men. <br><br>It's perfect that in the end the only person he can relate to is his German upper-class captor. His ultimate \"winning\" of the war by simply purchasing the only bridge left crossing the Rhein (with a bad check, no less) is the perfect metaphor for the film's main idea; that it's not even money that separates the classes - it's just the collective illusion of the classes that separates them. And it's this illusion for which the working class are forced to fight and die.<br><br>A fantastic piece of anti-war theatre.","user":"davconn","rank":[14,17]},{"title":"sheep in wolf's clothing","rating":9,"date":"11 February 2001","review":"An anti-war film in disguise... As a \"fan\" of war films but also a \"peacenik\" I love this movie. Aside from the fact that i am an overtly biased Beatles' fan this film is an intellectual riot. John Lennon co-stars with the star of Hello Dolly as members of a British military unit saddled with the ridiculous duty of building a cricket pitch during the invasion of North Africa! Filled with ironic black war humor, it suffers a little from the predictable muddle of most 60's films.<br><br>Something interesting to note is that John Lennon is first seen wearing his trademark round spectacles in this movie. Having been asked (for some reason) to wear the glasses for the film he continued to wear them for the rest of his life!<br><br>This movie is a must for all Lennon fans.","user":"Jedi Clerk","rank":[18,24]}]