[{"title":"A popcorn movie if ever there was one!","rating":8,"date":"15 September 2007","review":"Producer/director Irwin Allen had big plans for this one. He also had the big budget needed to craft a truly spectacular remake of the original 1925 classic silent film. And, he rightly felt that a new movie based on Sir Arthur Conan Doyle's science fiction masterpiece had better be up to the task. Allen originally intended using the \"Stop-Motion animation\" technique (made popular by Ray Harryhausen) to bring his prehistoric monsters to life. But, just as production was about to commence, Twentieth-Century Fox, who commissioned the film (and were then experiencing severe monetary shortages, due to production problems with their money guzzling \"Cleopatra\") slashed the budgets of nearly every film currently being produced. \"The Lost World\" was no exception, and Allen's dreams of a Sci-Fi Spectacular were crushed. Being a resourceful film maker, though, he did the best he could with what he had, and that turned out to be very good indeed.<br><br>For his cast, he chose British character actor Claude (\"The Invisible Man\") Rains to play the indomitable Professor Challenger, leader of the expedition. As Playboy Johnny Roxton, he cast another British actor, Michael Rennie. David Hedison played newsman Ed Malone, Jill St. John played Jennifer Holmes, daughter of Malone's publisher and Fernando Lamas was Gomez, the expedition's pilot. Supporting them were Jay Novello, as a cowardly guide, and Vittina Marcus as a helpful island native girl. Forced to forego his original Stop-Motion technique, Allen had to make do with photographing lizards, alligators and such, adding horns and gills when necessary. The result was pretty much the way it sounds - the creatures this bunch discovered were a long way from prehistoric beasts. Nevertheless, the movie entertains, with truly beautiful wide screen photography, a fantastic collection of colors which really bring the striking sets to eerie life. <br><br>As for the performances, they are decent enough. Rains has gotten plenty of criticism over the years for his bombastic Challenger, but that's the way the character was written, and Rains is true to the material, and highly enjoyable too. Michael Rennie is a bit colorless in his big game hunter part, but he does have some good scenes as well. David Hedison is OK as Malone, who falls for Jennifer (Roxton's girlfriend) though their romance must have ended up heavily edited, as there's little evidence of it here. Ms. St John and Ms. Marcus are mainly eye candy, (this WAS the '60s after all) but act capably enough, though for a woman described as \"brave as a lioness\". Jill certainly does a lot of screaming while dressed in a very flattering, if impractical wardrobe (which includes a Toy Poodle). Ray Stricklyn is very persuasive as her rather immature but compassionate brother. Lamas and Novello are the supposed villains of this piece, though Lamas has a reason for his hostility. Allen's direction is good and the score by Bert Shefter and Paul Sawtell adds immeasurably to the drama and suspense. All in all, the picture is perfect Saturday Matinée fare, and though the script is talky in places, it still delivers the goods at the climax. The movie is a textbook example of a period when celluloid escapism was all viewers demanded, and here, they got it In spades. <br><br>Fox Home Video has just released \"The Lost World\" as a two-disc DVD set, with special features (trailer, newsreels and galleries of promotional material) from the film on disc one, and a restored version (with a few outtakes!) of the 1925 original on disc two. Allen's film looks wonderful in it's anamorphic CinemaScope transfer, and after years of suffering through the faded pan-and-scanned prints used for TV and video this is really a revelation. The new stereo soundtracks are equally impressive and make this film, from a producer/director who would one day be known as the \"Master of Disaster', (thanks to such fare as The Poseidon Adventure' and \"The Towering Inferno\") a must have for collectors.","user":"phillindholm","rank":[47,54]},{"title":"It just isn't what it shoud have been . . ..","rating":2,"date":"2 March 2002","review":"Unlike `The Lost Continent' (1951), this 20th Century Fox Cinemascope production had an ample budget -- but the money wasn't spent very well.  A good cast (Michael Rennie, Claude Rains, Jill St. John, David Hedison, and Fernando Lamas) are all part of an expedition that discovers a plateau in South America where dinosaurs still thrive.<br><br>Unfortunately producer Irwin Allen elected not to use stop motion animation to create the dinosaurs. Instead, the audience is treated to two hours of disguised iguanas and enlarged baby alligators.  Irwin Allen also co-wrote the script, which is burdened by an excess of soap opera melodrama. The good musical score, however, is by Paul Sawtell and Bert Shefter.<br><br>Top quality production values and good photography make the film easy enough to watch, but there's a tragic story behind `The Lost World'.  Willis O'Brien, creator of `King Kong', spent several years during the late 1950s making preparations for a big-budget remake of his 1925 version of `The Lost World'.  He made his pitch to producer Irwin Allen and the big wheels at 20th Century Fox, showing them the hundreds of preproduction drawings and paintings he had done.  He succeeded in persuading them to make the film -- but Fox refused to let O'Brien do the film's special effects, substituting the poorly embellished reptiles instead.<br><br>From all reports, O'Brien's version would have been the greatest lost-land adventure movie of all time.  Irwin Allen's lack of vision is puzzling in view of the fact that in 1955 he produced `The Animal World' with animated dinosaurs by Ray Harryhausen and Wills O'Brien!   See my comments on `Animal World' for more info.","user":"Bruce_Cook","rank":[37,46]},{"title":"Irwin Allen dinosaur adventure is high in corniness.","rating":14,"date":"14 April 2002","review":"You would expect much more from an Irwin Allen film than 1960's The Lost World delivers. This film is high on silly-to-obnoxious characters, and corniness. The first few scenes in the film are particularly loaded down by corniness as we are introduced to the characters. There's eccentric Professor Challenger (Claude Rains) with his silly facial expressions, and boisterous but stuffy personality. There's Lord John Roxton (Michael Rennie) with his selfish and uncharming personality. There's Jennifer Holmes (Jill St. John) who starts out by trying to show the men a woman can also be worthy to take along on an expedition, but then becomes a useless, timid character who shows no strengths at all. The sexist remarks made by some male characters in the beginning become even more obnoxious, because Jennifer never comes through on showing strength, courage or ideas to help her crew members. The only strength she really proves is that she can pick out some elegant but inappropriate clothing to wear during the dangerous expedition. Jennifer has also brought along her silly, little poodle named Frosty. And then there's Costa (Jay Novello), a wimpy, greedy, seedy, little man. Throw in Fernando Lamas as Manual Gomez, the hired helicopter pilot who is also along for a side plot of personal revenge. He plots his murder-revenge and strums his guitar along the way (the natives even let him keep his guitar when the group is captured!) Not too many characters to really care for, but there are a few to possibly like such as Jennifer's brother, David (Ray Stricklyn.) David actually turns out to be more of a help then originally believed. A captured native girl (Vitina Marcus) turns out to be one of the better characters in the picture, but that is most likely because she has none of the corny lines and characteristics the expedition party's characters have. There's also corny drama from a love triangle that forms along the way. We all know Claude Rains (Phantom Of The Opera), Michael Rennie (The Day The Earth Stood Still) and others can do fine acting jobs, and the acting in this movie is fine--It's just most of the characters are so corny at times it should be embarrassing to the stars of the picture. The action in the film does not really build to any exciting levels as the crew is menaced by various creatures. The dinosaurs are lizards and reptiles with fins and horns applied to their bodies, and the giant spider is a rather lame effect (especially since it just hangs there, and only moves its legs a bit.) There is an unpleasant scene in which a real lizard fights a real reptile (portraying dinosaurs) that seems very politically incorrect by today's standards (and should have been a no-no even back in 1960.) Irwin Allen and 20th Century Fox could've done much better than this, and it is not nearly as good of a film as Journey To The Center Of The Earth (also from 20th Century Fox.) Still, The Lost World may entertain on a Saturday afternoon matinee level, and it is one of those movies collectors of horror and science fiction films will probably want to add to their 1950's and 1960's collections.","user":"onnanob2","rank":[29,37]}]