[{"title":"Ever hear of a Switzer, name of William Tell?","rating":7,"date":"2 February 2012","review":"Shoot Out is directed by Henry Hathaway and adapted to the screen by Marguerite Roberts from the novel The Lone Cowboy by Will James. It stars Gregory Peck, Patricia Quinn, Robert F. Lyons, Susan Tyrrell and Dawn Lyn. Music is by Dave Grusin and cinematography by Earl Rath. Plot has Peck playing Clay Lomax, who is out of prison after 7 years and seeking revenge on the partner who shot him in the back during a robbery. But Lomax soon finds he has company in the young child form of Decky Ortega (Lyn), who has been sent to him by his one time lover Teresa, sadly now deceased.<br><br>Just do your little chore, punk.<br><br>It took a whack from critics of the day, and even now it only seems to have a handful of fans prepared to stand up and say they enjoy it very much. Shoot Out is not a great film, well actually the location work is certainly great, but it is a very rich and warm Western. The problems are hard to argue against, Peck is not adept at playing a vengeful bastard in his later years, the villains are of the near cackling pantomime kind, and a number of cheap money saving tactics are employed by an on the wane Hathaway. Yet the action hits the right notes, Peck's unfolding relationship with the adorable Lyn is heart warming, and the elder female characters-put upon prostitute desperately seeking a way out (Tyrrell)/plain Jane homemaker who drinks to forget her unfulfilled lot (Quinn)-are afforded intelligence in the writing. While some of the location photography, in Technicolor, is gorgeous as Earl Rath gets excellent value out of the New Mexico and California landscapes. And hey! There's even a cameo by the always awesome Arthur Hunnicutt.<br><br>I'm giving it a generous 7/10 because it's not deserving of the scorn poured on it elsewhere. If only for the central father/daughter relationship, the scenery and a neat flip-flop pay back scenario, this is recommended to Peck and Western fans. Just don't expect True Grit like some apparently did!","user":"hitchcockthelegend","rank":[30,31]},{"title":"Much better than the comments would indicate","rating":8,"date":"8 June 2005","review":"I watched this as part of a cheap DVD set I bought at the supermarket for $6.99. It also included an Audie Murphy film, a Dale Robertson film and a Guy Madison film. All were westerns from the late 40's to early 70's. I really liked Shoot Out. I think that comparing it to True Grit because of some commonalities of cast/crew/producer and ( vaguely) theme is unfair. The relationship between John Wayne and Kim Darby was very different than the growing affection and dependence between Dawn Lyn's delightful Decky and Peck's tough but tender Clay. The way Peck and Lyn become father and daughter whether they actually were or not is touching. I like the way the little girl is very self-sufficient at one moment and kind of lost the next. And she seemed like a kid in many ways too; not a miniature adult. In addition, Robert F. Lyons was terrific as the psycho villain. He was cocky, stupid, pathetic, cruel, greedy and just mean. The ending where the tables are turned on him is brilliant and inventive and probably not what viewers expected. I also like Peck's final line after the final \" shoot out\" - \" Fetch the law\" Funny and brilliant.","user":"dphelan-1","rank":[27,30]},{"title":"Great Cowboy movie of the old style","rating":8,"date":"26 April 2006","review":"Lots of action but the same old plot of good, but not too good versus bad, pretty bad. No gratuitous sex and violence in the old style with no gore. Interesting story line of old grudges and the new breed of cowboys learning lessons from the older guys. Gregory Peck is outstanding and out shines the rest of the cast but the bartender, Trooper, does his own shining. Bobby J is the meanest of the bunch but Sam Foley has his own secrets and he does an excellent job. This is one of those you enjoy seeing every few months. This is a tough guy movie about tough guys but one with a heart. It does have a few unexpected turns and twist, especially the kid, and there are several turn of events that keep it interesting with out all the technical tricks of todays fare of flicks.","user":"kenneth_sutphin","rank":[25,31]}]