[{"title":".....and the rest is history","rating":12,"date":"12 April 2003","review":"Mark and Ho are gangsters for a major syndicate.  Ho's brother Kit is unaware of his brother's lifestyle and himself is an ambitious police officer.  However when Ho is betrayed by the bosses he is sent to jail and his father murdered, leaving Kit marked within the force and bitter towards Ho.  Mark takes revenge on those who set up Ho but suffers severe damage to his leg as a result.  When Ho comes out of prison Mark is reduced to cleaning up for new boss Shing.  Ho and Mark resolve to move on, but Shing has other ideas and also plans to deal with Kit to stop him investigating. With the police and mob closing in Ho, Mark and Kit are forced to take a stand.<br><br>As part of my build up to see Bullet Proof Monk I have been watching some of Mr Chow's HK action movies again  just to remind me how good an actor he is when he is used well.  A Better Tomorrow was Chow's big break through from television to movies and also the film that kick started John Woo's career after a couple of commercial failures.  The plot is nicely overwrought and has a strong focus on the male relationship of friends and brothers.  Honour plays strong in all scenes and it is actually quite involving despite the focus on gun play and action.<br><br>The action is good but dated.  This is to be expected after about 20 years but it does still stand up well.  The action is pretty over the top but also well choreographed to appear even more exciting than it is.  Happily the plot stands up by itself and the film has a lot less action than later Woo films The Killer and Hard Boiled.  I really got into the lives and destinies of the men involved and the strength of feeling and, perhaps, debts of honour, between them was palatable.<br><br>The strong characters are greatly helped by strong actors in all the leads. Chow is particularly good as he has to play two very different stages of his character and does them both very well (although the supercool part must have come easier to him).  Ti Lung is clearly the lead here and does good work even if he is a little too righteous and moral to be a gangster. Leslie Cheung is good after a slow start required by his character.  Lee Waise plays a good villain and only the female characters are as weak as they often are in these films.<br><br>Overall this film is regarded as a classic and responsible for the birth of the genre and certainly the genesis of many Hollywood action movies of today (how many multiplex goers who marvelled over the lobby shootout in the Matrix have even heard of this film?).  It has dated a little bit but the action is still as outrageous as ever and still as exciting, despite a slight feeling of seeing it bigger somewhere else.  The film's main strength to me is simply the male characters' relationships within the plot  they get me involved in the film and make the action even more dramatic.","user":"bob the moo","rank":[30,32]},{"title":"A Better Tomorrow starts today...","rating":8,"date":"3 September 2006","review":"Two brothers (One a cop played by the late Leslie Cheung, the other a thief played by Ti Lung) become enemies after the death of their father while Chow Yun Fat plays a crippled assassin who teams up with Ti Lung to help protect Cheung from the mob boss that is looking to do him in, while at the same time try to redeem himself in the eyes of his police officer brother. A Better Tomorrow is often reported as the best movie John Woo has done and while it is certainly a superior staple on his resume, the movie's tone is a little off and although the movie is very well done the movie gets a tad too melodramatic at times. However that minor flaw aside A Better Tomorrow provides an unusually rich story that details a rocky relationship that seems to never be forgiven. Indeed even at the end, we doubt whether the brothers will ever be as close as they once were. Ti Lung and Leslie Cheung are very good in their roles but it really is Chow Yun Fat that sells the movie and his performance as an out of work assassin provides a tragic figure that is far more tragic than the relationship between Lung and Cheung. As noted the acting is flawless with Cheung turning in a flawless 180 degree turn in his character. A Better Tomorrow while not the best movie from John Woo, is still a rewarding tale.<br><br>* * *1/2 out of 4-(Very good)","user":"fmarkland32","rank":[12,12]},{"title":"Mr Chow has achieved what no one else could: He looked cool in the 80's","rating":19,"date":"19 August 2002","review":"When this film was made in the 1980's Hong Kong cinema was dominated by wushu films and bizarre swordplay movies involving people flying around and other acid flashback inducing scenarios. John Woo was a young director who had done a string of martial arts films, comedies, and musicals. In 1981 he split from Golden harvest and joined Cinema city, after a couple of comedies, He directed the modern day action film \"Sunset Warrior\" and it was held on the shelf and not released. After the failure of \"Sunset Warrior\" he was sent to Taiwan and directed another two comedies. Returning to Hong Kong, Woo had always wanted to make a modern day gangster film. Teaming up with friend and producer Tsui Hark, they made a film that would inspire countless films for years to come. Casting Chow Yun Fat who was mainly a television actor as one lead, an old school Kung Fu actor in another and a singer in the third lead role, it was a risky venture which paid off. The script is great featuring lines such as \"Do you believe in God?\" \"sure i'm one, you are, a god is someone who controls their own destiny\". There is strong characterisation of the characters, aided on by perfect performances from the actors, The action choreography was excellent and inspired virtually every film made involving guns ever since. It makes you realise that the only thing \"the matrix\" didn't take from this film and it's sequels is the plot. This is one of my favourite films of all time, and if everyone in the world saw this, I guarantee that the sales of matchsticks and toothpicks would soar.","user":"the_saint_107","rank":[16,17]}]