[{"title":"Does this movie rock? Sho'NUFF!","rating":8,"date":"27 February 2005","review":"If you occasionally get nostalgic for break dancing, too much hairspray, De Barge, and Cyndi Lauper-style hair extensions, then this movie will give you an awesome blast from the past! I watched it on a Saturday morning and it made me feel like a kid again.<br><br>As many of the naysayers have already posted here, this ain't no bona fide martial arts flick. But it does make Tarantino-esque allusions to kung-fu pop culture- namely, Bruce Lee's films- that will be appreciated by 'true' kung-fu fans. And the fight scenes were co-choreographed by Ernie Reyes, Sr., so that gives them some credence.<br><br>In my opinion, the \"worst\" parts of this movie are actually the best because of their kitsch value: Prince protégé Vanity performs a ridiculously bad song and dance number; Leroy finds his inner \"glow\"; Sho'Nuff and his gang interrupt a screening of ENTER THE DRAGON; the list goes on. I think I'll watch it again next Saturday!","user":"sandyluc80","rank":[40,45]},{"title":"Flashy Kung Fu 80's Flick","rating":9,"date":"25 January 2005","review":"It's so easy to dismiss a movie from another time-line as pure trash. Why, if I just pick up any car-chase movie from the 70's, or some old spy movie from the 60's WITHOUT considering the era &amp; what was in it, I'd be lost.<br><br>The 80's introduced a pop culture focused in music, thanks to MTV. Break-dancing was the norm. Synthesized keyboards backing up great, and some not so great singers were all over. Also, movies in the 80's carried over what Bruce Lee &amp; others had brought from the 70's: martial arts. Lots of movies with the word 'ninja' in it, and of course 'Karate Kid' made a big impact in 1984.<br><br>If you were already into the hip-hop scene, &amp; you liked the American dance pop music that was playing all over New York, then going to see 'The Last Dragon' would have been a natural extension for your weekend experience at the movies.<br><br>The story is simple- Young kung-fu master Leroy Green (Taimak) must seek his inner-self by obtaining what is called 'the glow', and is faced with wrath of a great, cheesy bad guy called Sho'nuff, along with his gang. Along the way he will learn about his family, himself, and even find love. There's plenty of side stories that include our hero, who, by the ways, eats popcorn with chopsticks. He's a modest, gentle young man who is faced with other challenges you wouldn't expect, like, for example, how to be 'black', and the fact that he's a virgin. <br><br>There is some hilarious lines, and I remember the entire theater in a riot with some of these:<br><br>Sho'nuff: Now, when I say, \"Who's da mastah?\" you say, \"Sho'nuff!\" Who's the Master?\" <br><br>Gang: \"Sho'nuff!\"<br><br>Leroy Green: \"The truth will be revealed only to eyes unclouded by desire.\" <br><br>Sho'nuff: \"It's mumbo jumbo like that &amp; skinny little lizards like you thinking' they the Last Dragon that gives kung-fu a bad name.\"<br><br>Those who really watch Kung Fu films are in for a treat, as this one really lays on the Bruce Lee references. The villain, Sho'nuff, is a just oozing with the typical kung-fu bad guy look &amp; sound. There are some good fighting scenes, as Taimak is really an expert in martial arts (there were some karate how to videos he did), but there is one little kid in this movie who really kicks butt. You have to see him in action to believe it.<br><br>Nope. There are no Oscar winners in here. You won't see an outstanding story line. No expensive SFX. Just a moderately low budget, flashy movie filled with that decade's influence- like bright colored clothes, neon lights, &amp; music. It's the right blend of kung-fu, fantasy, romance and comedy together with 80's clicks and buzzes that really make this movie. If you like kung-fu, forget the nay-sayers and watch this, you won't regret.<br><br>9 out of 10","user":"silentcheesedude","rank":[48,55]},{"title":"One long music video with chop socky thrown in","rating":27,"date":"27 June 2001","review":"Lest we forget, this is BERRY GORDY's The Last Dragon. He was the head of Motown Records. It has the look of a music video for a good reason, it was produced and directed by music video people. Made to sell soundtracks like almost every Robert Stigwood movie of the 1970s.<br><br>Tiamak play Leroy, often called Bruce LeeRoy in this movie(ouch). It's amazing that he didnt do more in Hollywood than he did, maybe it was a personal choice of his, it certainly does not seem to be because of any lack of talent. He could have been an action hero on the level of a Van Damme in my opinion (with a little acting talent added in...).<br><br>Vanity is beautiful, as usual, as the host of a TV video show, remember them? She is very easy on the eyes and the role does not require too much in the way of her acting, so she does very well.<br><br>The story line is silly and improbable. All this action and no police ever show up? The movie makers and Tiamak seem to obviously love Bruce Lee movies, and for Lee fans this was a nice way of seeing Bruce back on the big screen after 12 years or so of nothing after his death. The scene where Vanity presents Leroy with a video compilation of some of Bruce's greatest moves is a highlight of this movie.<br><br>Worth seeing. Be in a light, silly mood and you will get the most out of it. Be sarcastic and critical and you will have a miserable time. Remember, your children will laugh at your favorite movies as well.","user":"Schlockmeister","rank":[29,32]}]