[{"title":"Bidi-bidi-bidi....","rating":24,"date":"24 August 1999","review":"If that phrase puts you in the mind of Gil Gerard, Erin Gray and lots of \"Star Wars\"-derived FX, you already know where a movie like \"Buck Rogers\" is coming from.<br><br>If not, then let me enlighten you.<br><br>Most everyone familiar with sci-fi know Buck's story (frozen astronaut from 20th century is revived in the 25th century, must learn to re-adapt).  This was old news as far back as the '40s.<br><br>But in the '70s...well....  Let's just say that it looks new.  For the '70s.<br><br>Gil is game as Buck, shooting laser guns and cracking wise and making a good space-age hero.  And Gray's Wilma Deering is both stern and soft as the Earth's military leader.  Felix Silla makes a good impression as Twiki (with a more-than-equal assist from Mel Blanc's voice wizardry) and as Princess Ardala, Hensley gives what must be the most sensual performance from an alien up to that point in time.<br><br>But the special effects are clearly from the '70s, as is the music (disco music in the 25th century?  Someone must have unearthed Studio 54.) and the set design: its glittery, shiny look may have been futuristic then, but now it just looks more '70s than anything else.<br><br>Yes, it's a dated future.<br><br>But is it entertaining?<br><br>Pretty much.  No one went into this thinking they were making \"2001\", but are spots here and there where it looks like everyone was having a good time with the material.  Especially Gil, who just plain has fun with his role as the 25th century's loosest guy.<br><br>Too bad they cut out Wiseman's work as King Draco.  Some of his best stuff since \"Dr. No\".<br><br>Six stars.  Here's to futures past.","user":"Mister-6","rank":[24,25]},{"title":"A Retro Funfest for Any Child of the '80s!","rating":16,"date":"16 August 2001","review":"A long time ago, in a childhood far, far away...<br><br>I remember seeing 'Buck Rogers' in the theater in 1978, back when 'Star Wars' was king of the box office, 'Battlestar Galactica' was smashing all ratings records, and science-fiction was experiencing a renaissance of sorts - it was a great time to be a kid.<br><br>'Buck Rogers' struck me as an all-right kind of guy:  dashing with the ladies, quick with a punch, did a nifty spinning side kick, had a way with a laser pistol, occasionally danced a little disco.<br><br>The movie itself was a harmless piece of fluff.  Even as an 11-year-old, I found it to be simple, low-key, even charming.  I bought the requisite number of toys, talked about it with my friends, and enjoyed the occasional episodes (once the film left the theaters and went to the small screen) with a bowl of Cheerios in my jammies.  Life was good.<br><br>Looking back now, it's pretty obviously a product of the '70s.  Sure, it had chicks in spandex.  Sure, it had the gravity-defying hairdos (and bosoms) of some of Hollywood's most buxom beauties - who can forget the 'Volcanic Hot-Tub Room' scene in \"Planet of the Slave Girls?\", or Jamie Lee Curtis in \"Unchained Woman\"?  Sure, it had the simple, brainless plots typical of '70s television.  Sure, it had the unredeemable stupidity of the 'Searcher' episodes...<br><br>But, for a time, it was the best thing going for sci-fi on television.<br><br>Remember, this is a time before Star Trek:  The Next Generation, Star Trek: Deep Space Nine, or Star Trek:  Fill-In-The-Blank.  Science fiction on television wasn't a sure bet, nor was it always a ratings winner...even with it's target audience.  Which, at the time, was me.<br><br>But 'Buck Rogers' had something going for it, something none of the other sci-fi shows ('Battlestar Galactica', et al) had going for them.<br><br>Erin Gray.<br><br>Oh, yeah.  Erin Gray.<br><br>Let me tell you, one of the dates that stands out in my mind the strongest is January 3, 1980 - the date that the episode \"Space Vampire\" premiered. The day I became a man.  :)<br><br>Okay, not really...but you have to understand - Erin Gray, spandex and vampires all combined to give my 11-year-old brain (among other things) something to think about with regard to women.  Since then, no woman is truly attractive to me unless she can say in a sultry voice, \"I like the taste of fear best.\"  :)<br><br>Come on, it's only television!  It doesn't have to be smart to be funny, it doesn't have to be expensive-looking to be cool.  Just ask David Hasselhoff if he'd be in Baywatch Heaven without a certain Trans-Am, or if Dirk Benedict would have REALLY been as interesting to watch on the A-Team if we'd never seen him battling Cylons.<br><br>Erin Gray.  Spandex.  Vampires.<br><br>See, it all makes sense.<br><br>'Buck Rogers' appeals on the intellectual level of an 11-year-old, and for most of us, that's saying something.<br><br>'Buck Rogers' fueled a lot of my early television viewing entertainment, folks.  Watch it, and you'll see why.<br><br>Of course, it helps if you watch it from an 11-year-old point of view, but that's more than most of us can muster anyway, yes?","user":"Headshot","rank":[30,34]},{"title":"Gerard Makes BUCK a Delight!","rating":8,"date":"12 September 2003","review":"BUCK ROGERS IN THE 25th CENTURY could easily have become dated camp, by now (Rogers' disastrous space tour was supposed to have occurred in 1987...did we miss it?), but there's such a sense of joy and humor to the production that it actually is more fun to watch today than when it was briefly released, theatrically, in 1979. <br><br>A large measure of this is due to Gil Gerard, as Capt. William 'Buck' Rogers, who gives an enthusiastic, likable performance. Some of his dialog is ripe with sexual innuendo, particularly in his scenes with Erin Gray, as the beautiful, if a bit wooden, professional soldier, Wilma Deering, but his rakish charm (and an occasional wink!) keeps the one-liners from sliding into bad taste. The other female lead, Pamela Hensley, as a bikini-clad evil Princess, would do Mae West proud with her lusty vampiness. Her scenes with Gerard, as she eyes him as an evening's 'entertainment', are a delight. (And in the \"Is this a coincidence?\" department...Her character is named Ardala, and wears a horned headpiece...Could George Lucas have been influenced by her when he created Natalie Portman's Princess Amidala in STAR WARS: EPISODE ONE - THE PHANTOM MENACE?) The other major male roles are filled by Henry Silva, as Ardala's superbly evil partner, Kane, and Tim O'Connor, wise and sympathetic, as Earth scientist Dr. Huer. Deserving recognition, as well, is Duke Butler, who, as Ardala's eunuch bodyguard, Tigerman, should find another line of work, considering how he fared against Rogers!<br><br>\nIgnore Twiki, the low-tech R2D2 rip-off (Mel Blanc voices him, with dialog lapsing into disco-era clichés and bad sexual puns), and Dr. Theopoulis (the talking Frisbee...well, that's what he looks like!), and concentrate on the decent FX and Gil Gerard's charismatic performance...and I think you'll find BUCK ROGERS a winner!","user":"cariart","rank":[12,14]}]