[{"title":"Strangely compelling","rating":10,"date":"4 June 2005","review":"This is really a cult within a cult. The first few scenes are the standard revenge and search for gold spaghetti fare. However, after the bandits entire the strange town, the movie really enters a surreal land. I was quite bemused watching the various sub-plots but it was extremely compelling. It gives the impression of two scriptwriters who love westerns just brainstorming the most outrageous script. Despite its confused feel I give it 10/10 as it has many startling, original and occasionally jaw dropping moments'. Highlights are , 'digging for gold in the bandit', Zorro the 'affable sadist', the black-shirted gay muchachos, the commentary by the parrot and the liquids gold 'House of Wax scene. What the 'traditionalist American Cowboy fans make of the gay muchachos, god only knows. Highly recommended.","user":"washboard","rank":[24,28]},{"title":"gold gold gold!!!","rating":22,"date":"22 August 2003","review":"A fine, if somewhat bananas spaghetti western that cashes in on the Franco Nero/Sergio Corbucci Django of the previous year simply by including Django in the title. What we have here, though, is a marvelous, if somewhat slightly mysterious example of the genre. More interesting than Django is a B***ard, or whatever its called this week, Django Kill really pulls out all the stops in an endless parade of the macabre. From the curious opening scene with Tomas Milian crawling out of a grave to the brutal lynchings and gothic horror drenching of one of many villains in liquid gold- this is a real treat for genre fans. As with many similar movies there are no morals anywhere to be seen, characters turn up, rub their hands together, kill mercilessly and then are shot down or, in this case, killed by an exploding horse. I understand that there are many versions of this movie in existence, which is not surprising in the least. The version i have was shown on uk tv five or six years ago, so i suppose its incompleteness would be down to broadcast quality prints. Its still a real doozer though.","user":"servalansrazor","rank":[16,18]},{"title":"Shock horror euro-western delivers on all fronts","rating":8,"date":"1 July 2005","review":"The Stranger (Tomas Milian) arrives in the town known by the local Indian tribes as \"The Unhappy Place\" to see the bodies of his recent partners in crime hanging in front of him. Flashbacks have already revealed that he had been betrayed and left for dead by the gang, led by Oats (Piero Lulli), following a theft of gold from the army.<br><br>The two most prominent townsfolk, Tembler (Quesada) and Hagerman (Sanz) have split the stolen gold between them, and are keeping it hidden from Sorrow (Camardiel), a larger than life bandit whose \"muchachos\" dress all in black and, lets say, presumably enjoy the pleasures of men. Throw into the pot the mysterious figure of Hagerman's imprisoned wife, who beckons the Stranger from her cell window, and you have a very strange, yet apt, setting for this highly entertaining and frankly bizarre movie.<br><br>In fact, this film is straight out of horror territory, from the Stranger's first screen appearance - clawing his way out of an open grave - until its bitter ending. The mood is ably assisted by Ivan Vandor's score, which adds suitable suspense and tension, particularly during the scenes portraying Hagerman, his wife and her relationship with the Stranger.<br><br>The cast is quite superb, particularly Sanz in the part of the treacherous Hagerman. Milian meanwhile plays the Stranger role competently but fairly static without the mysterious charisma of a Nero or Eastwood. I am a huge fan of Milian, but much prefer to see his characters portray a little more humour (as he does so brilliantly in Face to Face and the Big Gundown, to name just two performances).<br><br>At times graphic (like the notorious scalping scene, or the sight of Oaks' body being torn apart by the locals desperately clawing at the gold bullets within his barely alive body), at times obviously low budget (such as the scene in which the Stranger is tortured, by being subjected to blood sucking bats and other creatures), but captivating throughout. One of the \"must view\" euro-westerns, in my view.","user":"marc-366","rank":[14,16]}]