[{"title":"\"Rolling Stone\" gathers no gross....","rating":22,"date":"22 April 2004","review":"A legendary flop and a legendarily bad movie, this mess is part three in a career-killing trilogy of Travolta's that also includes \"Staying Alive\" and \"Two of a Kind\".  It took him a long time to bounce back.  It also stalled Curtis's career for a while until \"A Fish Called Wanda\" rescued her.  The story, such as it is, concerns Travolta, a Rolling Stone magazine reporter, looking for a story angle within a huge gymnasium at the height of the aerobics and fitness craze.  He's already working on another more important story, but wants this as a back-up in case an all-important interview falls through.  He zeroes in on high-profile aerobics instructor Curtis who has a huge following (which often kisses her on the mouth following one of her workouts!)  Unfortunately, she's had a major disaster with a reporter in the past and resists being interviewed for his story.  In order for there to be a movie, he must wear her down and get her assistance even though there are 90 other instructors at this mega-gym.  The film is very unfocused and disjointed throughout.  It tries to be too many things:  a reflection of investigative journalism, an ethics drama, an examination of self-esteem issues, a music video crash-course in Jazzercise and, most obviously, a jiggle movie with emphasis on lycra-clad spread legs and tight behinds.  The script is so crass and stupid with ludicrous lines like, \"You're a sphincter muscle...\" (this one is repeated often!) and unnecessary subplots which lead nowhere.  Travolta is awful.  He speaks his lines with his mouth almost open, stares blankly with no skill at conveying what's on his mind and, in the films most celebratedly horrendous scene, gyrates his bulging crotch at the camera ad nauseam while sweat trickles down his pale, clammy face and body.  Curtis looks very fresh and attractive most of the film (if a bit sexually ambiguous) eschewing the huge hair and heavy make-up of the times. Her character is a little too self-righteous, but her acting is better than anyone else around.  Wenner, a non-actor, provides a jarring presence whenever he appears because he (along with several other \"real\" people cast in the film) hasn't got the polish to really sell his role even though it reflects his position in real life (as the founder of Rolling Stone!)  Most of the other actors in the film either overact horrendously or flat-line. More importantly, the audience does not care about anyone in the film and so does not care when various events and revelations come about.  There is some inherent camp value in revisiting the hilarious workout clothes of the 80's and in hearing the bouncy, tacky music of the era, but the movie is way too long for it's subject matter and the music montages wear out their welcome very quickly.  And for all the sweating and gyration, there are no sex scenes in the film.  Look out for pansexual Burt Reynolds look-alike (and alleged Travolta bed partner) Barresi in the cast as a gym rat eager to show off his body.","user":"Poseidon-3","rank":[26,33]},{"title":"Come on, its not that bad!","rating":5,"date":"8 August 2006","review":"Really, \"Perfect\" is not the tactical warhead everyone seems to be implying. This is not on the same level as 80s catastrophes like \"Megaforce\", \"Grease 2\", \"Howard the Duck\", or (heaven help us) \"Staying Alive\". \"Perfect\" is nothing more than tragic misfire from extremely talented director James Bridges (\"The Paper Chase\", \"Urban Cowboy\") that makes the dire mistake of treating the aerobics, health club fad of the mid-80s as a serious cultural phenomenon (ugh).<br><br>It also helped to derail John Travolta's career for the better part of a decade - sad, because all one has to do is take a look at his outstanding performances in \"Blow Out\" and \"Urban Cowboy\" and realize that his acting in \"Perfect\" was just fine (if a bit low key). It's a shame, he could have made a lot of great movies while he was stuck in dreck like \"The Experts\" and strange late 80s Altman theatre pieces like Pinter's \"The Dumb Waiter\" (with Tom Conti!).<br><br>Travolta plays a Rolling Stone journalist hot on the trail of a big story about how health clubs are the new pick-up joints, replacing singles bars. He meets \"The Pied Piper of aerobics teachers\" Jamie Lee Curtis, a former Olymic swimmer who was once burned by a journalist over a piece about how she was having an affair with her coach. Of course, she and Travolta hook up and Travolta meets some other folks who frequent the gym, who are like supporting characters in a David Lynch movie (I'm unsure if the director intended to portray them as weird as they come off).<br><br>Real-life Rolling Stone editor Jann Wenner shows up to essentially play himself (not very well) and, in the film's most laughable detail, Travolta writes a version of his story portraying health clubs as Emersonian watering holes of the future (or something like that).<br><br>It's all kind of bloated and weird, but really not that bad. Travolta's actually pretty good. Jamie Lee Curtis looks great but comes off as slightly grouchy, but she was probably directed that way.<br><br>Don't miss Travolta's notorious pelvic thrust sequence (you can't miss it).","user":"tbyrne4","rank":[15,18]},{"title":"Perfect? Not really... Entertaining? Definitely.","rating":7,"date":"25 January 2007","review":"This film was definitely the final nail in Travolta's metaphorical coffin having been preceded by 'Staying Alive' and 'Two of a Kind'. Upon first viewing of the film, I was dumbstruck to find what I thought was Travolta acting poorly and the story seemed to be absolutely forgettable and pointless! But after persevering with the movie a couple of times more, I enjoyed it. I even changed my mind on Travolta's performance and realised what he actually tried to do-a mixture of anger, frustration, fatigue, mild charm-all of which are attributed to a workaholic Rolling Stone journalist such as his character Adam. The music has a pulsating beat although I do admit some songs on the film's soundtrack are better than others but the music does seem to carry this film along. Curtis is dazzling in her role as the 'Aerobics Pied Piper.'(Her sexy body and amazing legs are a plus for this movie.) Jann Wenner deserves special mention even though he's probably playing himself considering he was then the editor and now owner of Rolling Stone Magazine. This is a real 80s movie, and a strange theme involving both journalism and aerobics somehow merging together. Travolta and Curtis both do a great job in their roles bringing a contrast of characters in their relationship. I didn't however like the beginning or ending credits at all. The beginning was just basic and static-a list of credits against a plain background. The ending wasn't great either--Berlin's 'Masquerade' song (which is, in my opinion, a weak link in the film's soundtrack), plays on while ALL of the key characters do aerobics...Is that realistic? Bizarre. I rather liked it when Curtis meets Travolta at the end and they drive off. There, is when it should have ended. But I guess all in all, an entertaining mid-80s movie.","user":"rivau319","rank":[5,5]}]