[{"title":"A Little Here........A Little There.........","rating":6,"date":"25 June 2005","review":"Lady for a Night is a Joan Blondell film with John Wayne as her leading man. It is not a John Wayne picture, I repeat not a John Wayne picture. If you're looking for fights, or shootouts, this ain't the film for you to see. <br><br>The Duke plays a part that would normally go to an actor like Ray Milland. He's the political boss of Memphis and the old Southern gentry of the town, tow his line. John Wayne even has a bodyguard, Leonid Kinsky. Who'd have ever thunk that.<br><br>Wayne and Blondell are partners in a riverboat gambling ship. Wayne would like to make it a matrimonial partnership. But Blondell, who's a girl from the wrong side of the tracks wants some respectability as well as money. When Ray Middleton gambles away the title to the old Alderson family estate, Blondell offers to marry him to save the good gentry from being thrown out on their duffs. It's a marriage she has soon cause to regret.<br><br>Blondell sings a nice number entitled Up In a Balloon on the riverboat stage and I bet she was looking around for Busby Berkeley. Kind of strange to see her singing without the splashy Warner Brothers production around her. But her performance was effective, the best in the film.<br><br>What struck me so curious was that they seem to have grabbed off characters from other films and tossed them here. Hattie Noel plays Blondell's black maid and it's a total ripoff of Hattie McDaniel from Gone With the Wind. Edith Barrett and Blanche Yurka play Middleton's aunts, Barrett good, Yurka evil. Edith Barrett copied Patricia Collinge as Birdie Bagtry Hubbard from The Little Foxes and Yurka is another Mrs. Danvers from Rebecca.<br><br>Still it does mix well and while it's not a great film, Lady for a Night is a passably decent one, though it's far from the usual Duke.","user":"bkoganbing","rank":[17,17]},{"title":"Not a top notch storyline, but worth seeing just the same.","rating":6,"date":"13 November 2006","review":"OK, it wasn't an Academy Award winner. However, it did have many good elements to it. I'm not going to waste time telling you what it was about, you can read that in other comments. John Wayne was young and good looking, standing straight and tall. John Blondell was young and pretty. I remembered her in later movies after she had gotten older and a little heavier. Old man time sure beats the heck out of all of us.<br><br>Some people will raise and eyebrow at the plantation type scenes with the blacks dancing and singing. Did that go on? I don't know, but I wouldn't be surprised that after hard work in the fields, ANY people would be happy for the party time. Hattie Noel played the maid (Chloe) of Joan Blondell (Jenny). Chloe was funny and did an energetic job. Were these type parts demeaning for Blacks? Sure. But the way to look at it, is that it was the beginning of getting the foot in the door to show what you could do. There was a lot of talent in that singing and dancing. Nothing to be ashamed of, many a White person has played a demeaning part. The main thing is to showcase your talent. Hattie Noel may not have had the good fortune to be in Gone With The Wind, but she would have done quite nicely.<br><br>The best acting came from Edith Barrett who played the kinder Alderson sister Katherine. Some might call it overacting but I don't think that to be the case. You could feel her anguish between being torn by family loyalty, fear of her sister and doing the right thing. She gave a terrorized, impassioned performance.<br><br>Also enjoyable was John Blondell's singing performances as the part owner of the riverboat. In fact, she was so good that I wondered if a professional singer had dubbed her voice, even though I was aware of her own musical talents.<br><br>Blanche Yurka played the evil sister Julia, and how she could ooze evilness, with those eyes boring into anyone who crossed her. She hadn't changed much from her earlier days as Madame Defarge in A Tale of Two Cities.<br><br>Leonid Kinskey played John Wayne's bodyguard. Although Mr. Kinskey was always a good character actor (remember him as the funny bartender in Casablanca?), the reason for the part in the movie escapes me. I guess John Wayne needed a sidekick.<br><br>The rest of the cast was adequate, but nothing noteworthy that I can remember. Except of course for the can-can girls who really knew how to dance that thing with plenty of spirit.<br><br>OK, should you see it? If you have the movie or see it coming on the late show, no reason not to. The story is predicable and acting is adequate with a few who stand out as mentioned above. Don't watch it just to see John Wayne because the Duke was just being the Duke. And although the Duke is almost always fun to watch, this role didn't give him much room to do his thing. His part was overshadowed by larger parts going to Joan Blondell and the Alderson sisters. However, if you have the time, you will be entertained by a movie that is \"not too bad\" and \"fairly enjoyable\". There are some good acting parts and the singing and dancing routines are quite good too. I do not think you will be disappointed.","user":"padutchland-1","rank":[12,14]},{"title":"Murder, music, and malice in the old south.","rating":7,"date":"3 May 2001","review":"To start, this is not a John Wayne movie. Yes, he is in it, and yes, he is featured in a major role. However, his character is secondary. The primary character is Joan Blondell as Jenny Blake, the owner of a gambling boat on the Mississippi. Desperate to be accepted into society, Jenny is thrilled when she is announced Queen of the Mardi Gras, not knowing that man-about-town Jack Morgan (Wayne) rigged it. Memphis society is aghast and boos her. She becomes more determined than ever to break into society, and accepts the proposal of drunken plantation owner Alan Aldredge (Ray Middleton) to become his wife. <br><br>Alan's family, with the exception of his Aunt Katherine (Edith Barrett), is aghast at the entrance of Jenny into their blue-blooded family. Aunt Julia (Blanche Yurka), an evil looking woman, starts to scheme almost from the get-go, going out of her way to get rid of her new in-law. The gift of a blind horse as her own almost kills Jenny, and later Julia attempts to humiliate Jenny by arranging for no one to show up at the ball Jenny has planned. That is thwarted by Jack, who obviously has feelings for her. Julia's next step ends up in tragedy, with Jenny on trial for murder. But, with her luck, Jenny is saved from the hangman's noose, and learns a valuable lesson.<br><br>This Republic \"B\" feature is actually a pretty lavish costume drama. Blondell, a wonderful leading lady at Warners in the 30's, gets to show off her singing and dancing abilities in the \"Up in a Balloon\" production number. Later, at Jenny's party, there is a campy rendition of \"Ba Ba Ba Boom De Yay!\" during which Jenny's lively black maid (Hattie Noel, an obscure character actress, equally as funny as Hattie McDaniel) gets into the act. It is a camp moment that is still treasured by those who adore over-the-top cinema.<br><br>Wayne does not have much to do but step in to rescue Blondell in her times of need. This was not an important film for him, but for the cast playing the evil Alderson clan, it was a chance to show off their acting skills (or at least their hamming ability!). Phillip Merivale has little to do but disapprove of Jenny as Alan Alderson's elderly father, but his sisters (Yurka and Barrett) have great opportunities to show off their talents. Yurka, best known as Madame DeFarge in the Selznick production of \"A Tale of Two Cities\", is equally evil here; she is a definite rival with Judith Anderson and Gale Sondergaard as the perfect screen villianess. A stage star in the 1910's and 20's, Yurka is a combination Lady MacBeth and Madame DeFarge as she sets on her sites to make Jenny miserable. Deliciously camp (my guess it was unintentional), Yurka is a delight to watch from start to finish. As her fragile sister Katherine, Edith Barrett (the first Mrs. Vincent Price) is the epitome of sweetness, a total contrast to her evil sister. The scene where Barrett accuses her sister of having murdered her fiancée years before is powerful stuff, and makes us realize that underneath her fear of her sister, Katherine has a strong side determined to come out.<br><br>The less said about Middleton as Steve Alderson, the better. I will just say he is stiff, unromantic, and lacking in charisma. In other words-he was perfect as the husband Blondell couldn't love no matter how much money he had! While Hattie Noel's character may raise some eyebrows in today's society because of stereotypes, she does create many laughs, especially when she arrives at the Alderson house by breaking down the side door when she is rebuffed by the stuffy black butler. You just have to consider the time that this was set in and accept the fact that it would be many, many decades before the treatments of blacks began to change.<br><br>Although Leonard Maltin gives the film only two stars, I have to disagree with his review. Although no cinema classic, it is a very entertaining and light-hearted film, even with its macabre plot developments. Perfect for a rainy afternoon or the late show, \"Lady For a Night\" is worth a look as a camp classic.","user":"mark.waltz","rank":[9,11]}]