[{"title":"I had a Seizure watching this film!","rating":20,"date":"20 December 2002","review":"Well, almost...<br><br>When I first saw this film, back in 1979, my wife &amp; I were 2 of 5 people in the theater at 7:00 on a Friday night. We were about to walk out when Carolyn Munro was sentenced to mine Radium in a bikini for the rest of her natural life. At that point, there was no way to get me out of there.<br><br>The remarkable thing about this movie is that every time you think \"that is the most ridiculous plot device ever...\" something else comes along that blows your socks off. About mid way thru I could not quit laughing. For instance, our heroine sets a ship on collision course with the Evil Count's space fortress. To save herself, at the last second before the catacylismic collision, SHE JUMPS OUT OF THE WINDOW! And then does the BREAST STROKE! through OUTER SPACE! Oh My God! I can't stop laughing!<br><br>\nBottom Line, this movie is WAY funnier than many that TRY to be funny (Spaceballs, Ice Pirates, etc.)","user":"sitdownbike","rank":[101,109]},{"title":"Hilarious Italian sci fi insanity!","rating":10,"date":"27 August 2006","review":"This movie is completely insane. The plot makes absolutely no sense whatsoever, which is pretty much par for the course with Italian knock-offs like this. The special effects are colorful and eye-popping, the sets designed by some wonderful nut with an eye for that crazy psychedelic-art-deco-cocaine-disco-Flash-Gordon look that Italians do so well. The actors are completely at a loss as to how to act/react to the film they are in and... I loved it.<br><br>What else can one say about a film where the best performance is delivered by....David Hasselhoff. Scary but true. Not even the usually mesmerizing Marjo Gortner can do anything with the logic-defying lines of dialog he is forced to utter. After 10 minutes I was laughing so hard I knew I'd found something unique. <br><br>I rarely venture down the road of \"so cheesy it is good\" movies but STARCRASH is mind-boggling in its cheesiness. Characters can tell the future but won't let anyone in on what is going to happen because \"You would have attempted to change the future...which is against the law.\" A depressed and hung-over-looking Christopher Plummer states at one point, \"I wouldn't be the Emerperor of the Universe if I didn't have a few talents. Now, Imperial Spaceship--halt the flow of time!\" (not bad, eh?)<br><br>Joe Spinell, dressed like a dime-store Satan and dubbed by a man who sounds dangerously constipated, declares at one point, \"By sundown I will be the most powerful man in the universe!\" And you sit there and think, Sundown? You're in outer space, dude!There are many such hilarious lines.<br><br>I could go on and on: There are jerky stop-motion monsters, psychedelic blobs of light that attack people for no explainable reason,Robert Tessier painted green, a robot who begins the film speaking normally and then about 15 minutes in starts talking in a southern accent,Christmas tree lights masquerading as stars, a weapon called The Doom Machine and a central non-performance from the ravishingly lovely but blank Caroline Munro, she of the stilted delivery and mis-matched eye-lines. But, my lord, she rocks a series of outfits that would make Barbarella envious. Gorgeous woman.<br><br>So, if you are looking for a rousing sci fi adventure with narrative coherence, decent special effects,and good acting, watch Star Wars; but if you're in the mood for an incomprehensible but colorful mish-mash of Ray Harryhausen movies, old Flash Gordon and Buck Rogers serials, Doc Savage, Perry Rhodan, and just about everything else up to and including the kitchen sink, watch STARCRASH. You certainly won't forget it soon. Did I mention the leaping cavemen?...","user":"raegan_butcher","rank":[87,95]},{"title":"Good fun","rating":1,"date":"1 September 2000","review":"This cheap \"Star Wars\" ripoff presents some of the worst and most ridiculous special effects ever made. It also delivers dumb dialogue that will make you laugh yourself into the next dimension. And, above all, the cast includes Marjoe Gortner, Caroline Munro (wearing a bikini on every planet), David Hasselhoff, Christopher Plummer and the great late Joe Spinell. Everybody is outrageously overacting (except for Plummer, who is outrageously underacting). But the movie never becomes boring, there is always happening something more or less stupid, so you'll always be entertained. \"Starcrash\" is a real party tape that can be enjoyed best with mates and enough beer, chips and popcorn. Don't miss this utterly cheesy movie: It's so dumb that you have to love it!","user":"rundbauchdodo","rank":[54,59]}]