[{"title":"Keeps close to the story, though with a very different tone.","rating":3,"date":"6 August 2015","review":"This movie could have gone in a number of different directions because of Hemingway's writing style. I read the book about a week before watching the movie (niether by choice) so I had a pretty good idea of where and how each was different. If you've read the novel, you can understand how the director and actors would have had a hard time getting the characters across since Hemingway provides practically no emotion or description to his dialogue. He wanted to keep the meaning behind his characters words ambiguous to make it interesting. However, that leaves a few too many options when you're an actor and have to choose one emotion to convey. I didn't like how it came off, but I'll talk about that more later. The story doesn't transition from the book to the movie well. It's not a bad subject matter, but the story is famous for its symbolism rather more than anything else, and symbolism expressed with words is extremely hard to translate into images.<br><br>Our two characters are a little hard to grasp since they were written in a way that reflected to aimlessness of the 1920's. Catherine in particular has a very romanticized perception of the war and her relationship with Frederic Henry. Frederic has an inverse view of things in which he carries a constant air of what is almost construable as apathy. Rock Hudson's sappier portrayal of him makes him seem like less of an unfeeling Bond-type and more of a star-crossed lover. There are very few other characters of significance. Rinaldi is probably the most prominent minor character, followed by the Milan nurses (Fergusson, and Van Campen), and the army priest. These parts feature the better acting performances of the movie. The scene where the priest remains in the burning hospital (which by the way was not in the book) was, in my opinion, the best scene of the movie. I don't know that Vittorio de Sica's portrayal of Rinaldi was Oscar worthy, but it was the most worthy of a nomination out of all the aspects of the film.<br><br>The story ends up being driven by a number of things. Among them are Frederic and Catherine's relationship, Frederic recovering from his injury, the general tide of the war, the impending birth of Frederic and Catherine's child, and Frederic's desire to seek solace from the war after deserting. The story as a whole just sort of exists. It doesn't feel terribly alive, but it's functional and doesn't have any logic issues or inconsistencies.<br><br>The acting from the lead roles felt pretty weak. They must be forgiven to an extent by Hemingway's ambiguous dialogue, but they certainly didn't give the best possible portrayals. When I was reading Catherine's rambling sentences in the book, I thought there might be some kind of coherence to it that would make it sound natural and hoped that an actress saying those same lines would provide that. Unfortunately, I was wrong. Jennifer Jones portrayal didn't have any more coherence than the static text and felt almost pathetically unrealistic. This even extended to her expressions like in the scene where Catherine is looking for Frederic among the advancing Italian force and she wears over exaggerated smiles and frowns. Rock Hudson's performance didn't really work for me because he seemed like he was trying to be too emotional while playing a character that has a hardened personality. Besides that, his emotions seemed kind of inconsistent and I didn't really buy that the character would have felt the way Hudson portrayed him to be. The supporting roles were all acted pretty well, though I don't think the talent was \"wasted\" on those parts since the supporting actors wouldn't have fit the lead roles.<br><br>The overall feel of the movie felt a bit too romantic and not quite dark enough. Now, since that statement is coming from an action fan, it will sound biased. However, Earnest Hemingway felt much the same way upon the film's release, and was disappointed that it didn't portray the horrors that he saw as an ambulance driver in WWI. I wouldn't be surprised if major he wrote the story was a means to warn people to avoid war at all costs since it was so awful for him. <br><br>If you've read and enjoyed the book, I guess it isn't a bad idea to watch this, but be warned that the tone changes drastically from book to movie. This is a much better pick as a romance movie than a war movie, though I doubt this will be at the top of your watchlist since it's kind of old. It stays pretty close to the book, which I know a lot of people can very particular about. To all prospective viewers, I'll say that it will likely come off as cheesy even if you love old movies or Earnest Hemingway's books. Overall Rating: 3.8/10.","user":"CinematicInceptions","rank":[7,7]},{"title":"The Great Stone Face","rating":4,"date":"27 May 2005","review":"Had she not been married to the producer, Jennifer Jones would not have been the most obvious choice for the leading female role in this tragic tale of an affair between an American soldier and an English nurse, set against the backdrop of the First World War. Her British accent is not perfect, and in the fifties it was unusual for a big romantic lead to go to an actress in her late thirties, even one as attractive as Miss Jones, especially when she was several years older than her leading man.. There were a number of beautiful young British actresses in Hollywood around this time, such as Audrey Hepburn, Elizabeth Taylor, Jean Simmons and Joan Collins, any of whom might have been more convincing in the role, but Miss Jones had one important attribute they all lacked, namely a marriage certificate with David O. Selznick's name on it. In the event, the film turned out to be such a turkey that they were doubtless grateful not to have it on their CVs. <br><br>The film tells, at great length, the story of the romance between Frederick, an American volunteer serving with the Italian Army as an ambulance driver and Catherine, a nurse with the British Red Cross. After the Italian defeat at the battle of Caporetto, Frederick is wrongly accused of being a German spy and sentenced to death. (The film paints a very harsh picture of Italian military justice; it would appear that Italian Courts-Martial had the power to pass the death sentence after a trial lasting all of thirty seconds without hearing any evidence and without allowing the defendant to be legally represented or to speak in his defence). Frederick manages to escape and to cross the border into neutral Switzerland, accompanied by the pregnant Catherine. <br><br>Hemingway's novels have not always been a great success when filmed. Howard Hawks succeeded in making a good version of \"To Have and have Not\", a film that is considerably better than the book on which it is nominally based, but that is because he largely ignored Hemingway's plot and turned the film into a remake of \"Casablanca\", set in Martinique rather than French Morocco. Like the 1943 version of \"For Whom the Bell Tolls\", \"A Farewell to Arms\" is overlong and fatally slow moving. It is also miscast. Jennifer Jones never makes Catherine come to life. As for Rock Hudson, his assumed Christian name could be unfortunately appropriate. He could be as solid as a rock but also as impassive as one, and in this film his Frederick seems an impersonation of the Great Stone Face. Despite the passion and emotion inherent in Hemingway's plot, the emotional temperature is always far too cool. The picture has little going for it apart from some attractive picture-postcard views of Italian and Swiss scenery. It is hardly surprising that it was not a success and that its failure ended Selznick's career as a producer. 4/10<br><br>A goof. Shortly before the battle of Caporetto, an Italian officer states that Russia had already concluded a separate peace with Germany. That battle started in October 1917, at a time when Kerensky's Russia was still fighting alongside the Allies. The Russian Revolution did not take place until November; it was only the \"October Revolution\" by the old Julian calendar. The new Bolshevik regime signed an armistice with Germany in December 1917, but a separate peace was not signed until the Treaty of Brest-Litovsk in March 1918","user":"JamesHitchcock","rank":[27,34]},{"title":"Hemingway strikes out again!!!","rating":11,"date":"11 May 2001","review":"Strange that one of America's favorite writers has no success in having his novels transferred to the screen with any fidelity or improvement over the original. 'A Farewell to Arms' is a lumbering, turgid, over-stuffed movie that never seems real. Chemistry between Hudson and Jones is simply not there--Jennifer Jones, in particular, seems remote and detached as the nurse even when she's supposed to be wildly in love. And then there's the matter of length--it seems to go on forever with a very weak resolution.<br><br>David O. Selznick wanted to create something that would rank alongside his 'Gone with the Wind' as an epic romance with a war background--but the talky script defeated everyone. Hemingway himself publicly disowned the movie, claiming that Jones was far too old for the part and unhappy about the film in general. At any rate, it was not the hoped for success and did nothing to halt the decline of Selznick's career--or Jennifer Jones' career for that matter. A big disappointment.","user":"Doylenf","rank":[28,38]}]