[{"title":"One of the greatest fable of the 90s.","rating":10,"date":"22 February 2020","review":"Tim Burton all time favorite artist of all time. Not just one of the greatest directors of all time, not just one of the greatest imaginative writers of all time, not just versatile camera works ever put to film, but a versatile genius of art. That's how I think of Tim Burton. Edward Scissorhands is his personal film that he ever put to film by his heart. When I saw this film for the first time, my heart burst of love. I was always in love with his films, I don't start loving Batman because of him, nightmare before Christmas is my all-time favorite holiday film, Ed wood, Big fish, big eyes, Beetlejuice, Sweeney Todd the Demon Barber of Fleet Street, all of them. But only one that is true to his heart and that is Edward Scissorhands. Edward Scissorhands is a versatile work of art ever put film, with darkness and colors combined together to make into a perfect rainbow is Edward Scissorhands. As for me this film is a work of art and yet one of my favorite films of all time. This prestige film is my childhood, my everything. As for Tim Burton, is everything you need to know about his charismatic of film. Grade A perfect 10","user":"MR_Heraclius","rank":[38,39]},{"title":"A poignant miracle","rating":10,"date":"18 September 2004","review":"Many people say the cried at the end of this movie... Huh! Knowing the plot already, I (a grown up man) can barely hold my tears from the very beginning whenever I watch it. Much more than just a \"cute and sad fairy tale\", this movie is a true piece of art. This is one of those rarest cases when a bunch of talented and truly, but truly dedicated people set out to create something beautiful, some chemistry occurs and ... a miracle happens. Fortunately for all of us, this miracle immortalized on film.<br><br>Throughout the human history, the wisdom of generation was conveyed through fairy tales. This tale is no exception. This story, told in magic simplicity, actually has some deep philosophical meanings. While mercilessly debunking the true nature of human beings, this tragic story really tears your heart, and yet it fills it with hope. That is the true and, perhaps, the only purpose of art, if you ask me.<br><br>Why do we need music, painting, theatre, poetry? Is there a real excuse for their existence? To me, the only purpose, the only excuse is to help people go on, to give them hope. And it's well worth it!<br><br>To sum up, easily Tim Burton's best, this film is a masterpiece, my favorite American movie, and probably one of the best movies of all times. 10/10","user":"IlyaEck","rank":[382,427]},{"title":"A dark fairy tale about a man who only wanted to fit in","rating":10,"date":"18 November 2003","review":"I have watched Edward Scissorhands ever since I was a little girl, this movie has always held a very special place in my heart. I think because I could relate to Edward no, I don't have scissors for hands, but what I mean is that this is a fairytale story, but this is a simple story of a man who just wants to fit into a society of \"norms\". This is completely Tim Burton's creation and story, he's a very criticized director, he's either loved or hated. Some consider his stories to be too dark and strange, but when you get inside his head, you realize this is a man who is pure genius. He thinks completely outside the box and doesn't just resort to what Hollywood wants, he knows his audience and doesn't insult their intelligence, he brings us a charming story about Edward Scissorhands.<br><br>An elderly woman tells a story to her granddaughter of a man with scissors for hands named Edward, the creation of an inventor. He raised Edward as his son and tutored him in various subjects, but died while in the act of offering a pair of hands to Edward. Many years later, local Avon saleswoman Peg Boggs, after failing to make profits in her suburban neighborhood, visits a Gothic mansion on a hill. There, she finds Edward, and convinces him to have her take him in. Edward befriends Peg's young son, Kevin and her teenage daughter Kim. Peg's neighbors become curious and thrilled at Edward's masterful skills at hedge clipping and haircutting. However Kim's jock boyfriend Jim dislikes Edward immediately. Edward's innocence becomes an easy target for everyone to take advantage of him as often as they can. Wither it's destroying his reputation or putting him in danger, Edward was never prepared for this harsh world when he was given the kindest heart.<br><br>From the acting, Johnny Depp's first real leading role in a movie, he's so young and so incredibly talented. He plays Edward with perfect sympathy not over or under acting it, to be honest I'm a little surprised he wasn't nominated for an Oscar, but it's such a bizarre role, I think it was very over looked. He makes Edward into a charming beautiful character that you fall in love with. Dianne Wiest, one of my favorite actress as the Avon lady, Peg, who takes Edward home with her, the reason I love her so much is she brings so much class into whatever role she is playing. She seems like the most lovely woman you could meet and makes Peg into a delightful woman who just wanted to help this man and didn't realize the world she brought him into. Winona Ryder, who was dating Depp at the time, had great chemistry and was absolutely beautiful. To the sets, which this world was just bizarre and stands out against so many other movies, like a strange Leave it to Beaver nightmare, all the houses in the suburbia are different pastel colors to this one hill with a dark castle. To the outstanding make up effects, can only imagine the pain it took to get in and out of that costume for Edward. Edward Scissorhands is truly a masterpiece and in my opinion will always remain a treasured classic, because all in all this is one of the most beautiful movies of all time.<br><br>10/10","user":"Smells_Like_Cheese","rank":[255,286]}]