[{"title":"A Visionary Tale","rating":10,"date":"26 August 2005","review":"Martin Scorsese and Robert De Niro seem to have taken a different road to arrive to very familiar places. Forttunately we're all in for the ride. This is a bitter, dark comedy in the tradition of Pietro Germi and Mario Monicelli. In Scorsese's hands it becomes something we've never seen before. De Niro travels unknown territory with the panache of a seasoned explorer. His Rupert Pupkin is a sub Jay Leno without an agent. His hunger is as shallow as his talent. The arrival to Jerry Lewis's house without an invitation trying to impress his girl is one of the most painful studies in modern humiliation ever put on film. I found myself laughing in horror. \"The King of Comedy\" is ripe for a revival. Some people consider it a \"minor\" Scorsese. I disagree. I think it's one of Scorsese and De Niro's best.","user":"dboyleukgroup","rank":[171,190]},{"title":"The world that we live in...","rating":9,"date":"22 June 2004","review":"I hate the celebrity culture. I hate the fact that people become famous, just for the sake of being famous. I hate the fact that just because a celebrity gets married or has a child, that's front page news. I hate reality TV. I hate shows like \"Pop Idol\" (or \"American Idol\"), where normal people seem to think they are destined for A-list status. The fact that this film (The King of Comedy) is as old as I am, is either an all too worrying statement on society, or proves that it was way ahead of its time. Maybe that's why I love it so much.<br><br>De Niro has always amazed me, but the fact that he seems to understand this character so well is a little overwhelming. Whether he is delivering cringeworthy gags to a cardboard audience, or embarrassing himself, obliviously, in front of Jerry Lewis, his consistency is amazing. His motives are understandable to anyone who's ever had a dream. Perhaps it's De Niro's early ambition as an actor, that fuelled this shamefully overlooked performance.<br><br>Jerry Lewis is perfect as the disgruntled TV host. A man who lives a double-life of hilarious TV personality, with a bitter persona off-screen. You can certainly relate to this man's motivations, his love for his work, but his resistance to allow it run his personal life.<br><br>The only character I can't totally emphasize with is Sandra Bernhard's Masha (her actions aren't justified as well as De Niro's Rupert). But maybe that just goes with my aforementioned hatred for celebrity culture. The scary thing is, I know that people like this exist, and I didn't for a second, question the feasibility of her performance.<br><br>As usual, Scorsese shows brilliant control, despite this being one of his most modest works.<br><br>\"The King of Comedy\" should be looked upon, now more than ever, as a very important film, that has a lot to say about the world we live in and the obsessions that we consume. 9/10","user":"akpiggott","rank":[201,226]},{"title":"Scorsese's forgotten masterpiece","rating":10,"date":"23 August 1999","review":"From Jerry Lewis's subtle, deeply personal performance, to Robert DeNiro's amazing interpretation of a neurotic nerbish whose fantasy world collides with reality on late night talk TV, \"The King of Comedy\" is a true original that guts the glamour from showbiz and finds it cold and empty inside.  Then there's the media, always ready to create another celebrity, even if he's an autograph hound and hack comic turned kidnapper who believes he's earned a shot in the spotlight.  Cynical and melancholy, at times hilarious, it bombed when first released, but has been surprising video treasure hunters ever since.","user":"djfoster","rank":[85,94]}]