[{"title":"Memorable 60s Paranoia","rating":8,"date":"17 December 2002","review":"Very intriguing film to watch. One must consider it was made during the era of the Cold War to begin with so the situation implied probably didn't seem as implausible in its time. One of the earliest films to portray a secret government organization up to no-good unawares to ordinary citizens. Would have benefitted if more time had been given to the children involved here as then their plight might affect us as and audience even more. Still it's a nice if not fully successful effort to put a thoughtful science fiction tale on film. Teen Gang side-story works mostly to take away the focus from the kids and was probably a mistake although it did give Oliver Reed a good role.","user":"Space_Mafune","rank":[36,40]},{"title":"Restored print is Damned nice to see","rating":3,"date":"3 March 2002","review":"(THESE ARE) THE DAMNED is now being seen in the U.S. in a restored print that has been making the rounds (I caught up with it at the 27th Annual Boston Science Fiction Film Marathon &amp; Festival (for info go to: www.sf.theboard.net) on February 17th. <br><br>After having seen it only in edited form on late night TV decades ago, it was fascinating to see the exquisite B&amp;W photography on the big screen (with footage not in the TV prints). Although it was made under the Hammer Films banner, THE DAMNED is not a typical SF picture by any means. Expatriate director Joseph Losey set out to make a social parable more than an SF thriller. He succeeds in showing how society's increasing violence and callousness on the streets could lead to the horrible thought of \"breeding\" radioactive children in the government in order to survive an inevitable (?) nuclear war. The moral is both, of the time &amp; time-less. Of course, modern audiences may feel that the end of the Cold War makes such a tale outdated and even silly - but are we only fooling ourselves? <br><br>\"Black Leather, Black Leather.....\"","user":"gortx","rank":[42,48]},{"title":"Much deeper than it appears?","rating":7,"date":"29 August 2007","review":"I saw this recently on a late night \"British Film Celebration\" series, showing various odds and sods of yester-year. In some ways I wished I had videoed it now, as thinking about it afterwards (and thinking about it is certainly something you'll do)there's clearly something going on with the characterisation that was far more important than lets on at first. A second viewing was perhaps needed, certainly the characters don't seem quite fleshed out and when thinking about it I was wondering if that was the point. But here's what I mean by the characters:<br><br><ul><li>The spiritually hurt \"old/young\" man played (and in fairness, perhaps miscast) by MacDonald Carey, desperate in some way to \"complete\" himself; the numerous old English establishment/power figures, feeling out of time and place, as if powerless to deal with the worlds changes, still \"in\" power but somehow no longer; the devout artist, passionate about her work, which in itself is a little dehumanising (there is a great, heart rending scene, where she cries in agony as Oliver Reed destroys some of her art work, that will stay with me for a while); the young girl unable to \"become\" what she wants, perhaps of her \"possessive\" brother, who really genuinely wants to protect her from the evils of the world; the emotionless children, full of potential but ultimately radioactive and poison, and most of all the \"angry young men\" lead masterfully by Oliver Reed, They represent the irrational human, simply wanting to \"be\" and nothing more.</li></ul><br><br>While trying to follow some sort of standard narrative, there seems to be something else going on in this film that is talking about a far wider, human theme with actually makes it much more of a \"pure\" science fiction/philosophical film than it maybe gets credit for. Yes, you can look at it at face value and ultimately see it as nothing more than a curious English B movie, but...<br><br>The film moves very slowly, but its shift from what looks to be a critique on teenagers turns into a science fiction film with a very gritty message about human survival and with its grim ending its something you tend not to see much in films, either then or now.<br><br>Perhaps I am reading FAR too much into the film, but cold war polemic aside there seems to be something far more rhetorical being said about \"radiation\" and the death of humanity/culture/civility. There seems to be comments made on how the individual deals with a world that can face potential catastrophic change at any moment which will deny you your very humanity and dignity. I'm not saying the film does this successfully, but nonetheless it's a very interesting \"attempt\" and well worth a little look.<br><br>Oh...and as for the \"Black Leather, Black Leather, Smash, Smash, Smash\" song. Well, it's interesting... Maybe there's a comment being made there too...about inanity? Perhaps I need to get out more.","user":"ldoig","rank":[27,30]}]