[{"title":"lots underneath the surface here","rating":8,"date":"10 August 2005","review":"This is a terrific movie that reminds one what we lost when Debra Winger slowed down her movie-making. She gives an honest, heartfelt performance as an investigator chasing a woman who marries rich and whose husbands wind up dead every time. The widow then remakes her appearance, gets a new identity, and dupes another man. Only Winger is convinced that this trail of murders is the work of one woman.<br><br>Eventually she catches up with this black widow (Theresa Russell) and the two hang out together in Hawaii. The Russell character likes the danger - she knows Winger is after her, and after trying to kill her during a scuba dive, saves her at the last minute.<br><br>My favorite scene with Winger is the one in which she almost tells Nicol Williamson the truth about his bride. She stands and stares at him - she knows he's going to die, she knows he won't believe her - you can see every thought in her head until, regretfully, she leaves.<br><br>Theresa Russell has the right detachment for this role. One suspects the character is a real man-hater and is, in fact, attracted to Winger. Winger is admiring of Russell's constant flirtation with danger. This is a complex relationship that the two play out. The finale is not up to the standard of the rest of the film, but I still highly recommend it.","user":"blanche-2","rank":[49,57]},{"title":"Stimulating film about obsession, nicely directed as a thriller by Bob Rafelson.","rating":29,"date":"29 January 2004","review":"Winger and Russell are sensational here, characteristically different yet essentially the same in nature.  The sinister plot trappings and black widow symbolism keep the film lively but only serve to heighten the intriguing subtext of two women obsessed with success and competition.  Winger is exceptional as always, and while Russell is notably uneven as usual, they both succeed admirably.  All the supporting parts are brilliantly played. This is one of the finest and most enjoyable femme fatale films around.  A widescreen version is thankfully now available on DVD from Fox.","user":"TheVid","rank":[38,45]},{"title":"First Rate Cast In Terrific, Gorgeously-Shot, Lady Fed Vs Lady Psycho Thriller","rating":8,"date":"12 February 2006","review":"Alex is a workaholic fed who becomes convinced a female serial killer is seducing, marrying and poisoning rich men. After failing to prevent the death of a museum curator in Seattle, she follows the femme-fatale to Hawaii and manages to befriend her. But when she starts to fall in love with the killer's next victim, a complex web of intrigue ensues ...<br><br>The script for this movie is a lot of fun but not very original - how then do the filmmakers hold our interest ? By simply making both the (usually male) cop and psycho interesting, intelligent women, and populating the supporting cast with offbeat, funny characters. The subtext is fascinating; is it a feminist piece with a plucky heroine emancipating herself, a sultry lesbian potboiler, or your standard obsessive cop/crook mirrored-existence caper ? The film wisely never takes itself too seriously (there's a great moment when Winger fobs O'Quinn off with a pat psychiatric diagnosis of Russell and then cracks up into hysterics) and it's so beautifully made that I can easily forgive it the odd cliché. It has a great old-fashioned style reminiscent of the big women's pictures of the thirties and forties, with elegance to spare; sumptuous costumes by Patricia Norris and exquisitely crystal-clear primary colour photography by Conrad Hall, with light bouncing off every surface possible and gorgeous locations (New York, Washington DC, Seattle and Hawaii). Best of all though are the cast - Winger is just sensational as the driven Alex, in equal parts meek and brash, and Russell as Catharine / Marielle / Margaret / Renee is the definitive thinking-man's homicidal crumpet - stunningly beautiful, devious, just a little bit nutty, alternately bewildered and cool as ice. Why can't we have more action/thriller movies with two lead actresses like this ? The supporting players are also superb; Williamson as a nervous anthropologist, O'Quinn as the concerned mother of a boss, a hilarious Hong as a seedy private-eye (\"No knock !? Come into a person's office, no knock !!\"), Hopper as a good-ol'-boy toy tycoon, Rossi as a doubting Thomas local cop, Woronov as scuba-diving instructor and playwright Mamet as a poker-player. There are lots of terrific moments in this movie (my favourite is the wedding gift scene) and thanks to Rafelson's polished, cool direction, it has a classy, seamless, elegant atmosphere.","user":"ShootingShark","rank":[28,33]}]