[{"title":"This movie made me come to terms with my own sexuality","rating":3,"date":"3 September 1999","review":"I was 17 when I first watched this movie and I had never seen a lesbian film before which treated the lesbian characters with such respect.  Also, I had never seen such a passionate love scene between two women, needless to say after that scene I could no longer deny my own lesbianism.  Great use of Patsy Cline's music.","user":"Seething","rank":[36,42]},{"title":"Vasty underrated","rating":9,"date":"28 December 2001","review":"Reading some of the other comments, and the reviews at the time it came out, I suppose my feeling about this movie must be extremely idiosyncratic. Yet, all the people I rope in to watching this film seem to agree with me - so this is to give a counterpoint to the tepid (at best) comments I've read so far.<br><br>This is a beautifully photographed film, from beginning to end.  It perfectly captures the ambiance and look of the Reno area in 1959 (I know because I was there); not just in appearance, but in the characters as well. Period music is expertly used throughout the film, with the final choice of Ella Fitzgerald's \"I Wished on the Moon\" a haunting and perfect end.  I can't help but think that because this film was one of the first to spend several uncompromising minutes devoted to lesbian lovemaking that people tended to focus almost exclusively on that scene - and make pronouncements based on their own comfort levels with how it was filmed.  This scene is really quite beautiful, but it could be left out and the sex only hinted at without harming the flow of the film.  The two main characters are well-thought-out and fully realized; both fine performances (Helen Shaver is near perfect).  All of the supporting characters are interesting and perfectly believable.  The intelligent, witty script gives deep insight into the characters with minimal time spent.  The humor is subtle but satisfying. Two examples:  1) when \"the professor\" comes out of her room after brooding for several days she is asked by another guest what she has been doing in there - the eccentric, grizzled ranch manager (Audra Lindley - who looks like she has been burned into the Nevada landscape)answers like a schoolmarm, \"whatever it is, it's too deep for us to understand\"  2)  while horseback riding in the desert a Marilyn wannabe in blue jeans gets off her horse and says \"my girdle is killing me!\" For me this is a near perfect film.  The only thing close to a criticism I can muster is the Kay character seems a bit too contemporary (but his is a very minor point and the role is well played). Unlike the other commentors, I think the characters are fascinating, each scene stands on its own as a perfect little vignette, and not only did I find the film enjoyable when it first came out, I have watched it at least 18 times since and it always holds up beautifully. Watch this movie with an open mind, void of preconceptions and value judgements, and see if you aren't enchanted (or at least entertained).","user":"seathrough8","rank":[28,33]},{"title":"The best romantic movie","rating":10,"date":"26 March 2005","review":"It was a really beautiful movie. The director really captures the beauty of 2 women and 2 women finding true love in 1950's in the least expected situation. As you watched the film, your emotions just followed the main characters'. It is a very touching, tender, romantic movie. This is my favorite movie. I have been watching it many times since I got it.<br><br>Thumbs up for Patricia Charbonneau for her stunning performance esp. this was her first performance on films. She played this young, dark haired, beautiful, free spirited, and passionate woman, Cay, who compelled Helen Shaver to look into her heart and finally allowed herself to admit her feelings for Cay. Patricia is really HOT in this movie. Her beautiful smile, her sparkling eyes, her sexy voice, and every move of hers is really attractive and charming. How can anyone not fall for her? I wonder why she didn't become a star after this movie?! She is absolutely Gorgeous and she can really act. It is a shame that she didn't get enough recognitions for her talents as she deserves in the film industry. Helen Shaver did an excellent job as well. She played a repressed English professor, Vivian, who went to Reno for a quick divorce. After closing herself up for years, meeting and knowing Cay finally forced her to face her true emotions and admitted her feelings for Cay. These 2 characters' personalities are really opposite of each other. One enjoys order and the other is free spirited but somehow they are able to find true love with each other. This movie described really well how Helen Shaver struggled with her own feelings and the society's expectations, and the hardship the society and Cay's family gave to the same sex couple. Yet, Cay is very courageous, facing her true feelings, and chasing after who she wants, Vivian. Although there was no clear ending for these 2 women, it is still hopeful since Patricia got on the train with Helen. One can only hope for the best for these 2 women and May they live happily ever after. <br><br>The scenery views are quite beautiful. The mountain, the lake views and horses running are extra plus. The other characters are quite good such as Frances Parker, Cay's step mother. The love scene between these 2 is amazing. You can feel these 2 women's desires for each other. Vivian is initially repressed but once she follows her heart, you can feel these 2 women are truly in love and enjoy being intimate with each other. There is Great chemistry between Patricia and Helen, which makes this movie very real. The glances they exchanged with each other, the way they look at each other, and the way they talk to each other are very convincing that they are in love with each other. I love to watch the scenes between them over and over. I think they build up a strong foundation with each other, which then leads to a very believable, amazing, and erotic love making at the end. <br><br>The director, Donna Deitch, did an outstanding job. The script is nicely written. The display of emotions is appropriate in 1950's. There are wonderful background musics. Donna Deitch is really successful bringing out the outstanding performance of these 2 lead actresses. It is not easy to direct a film such as this one in 1980's and she had to raise the fund for this movie herself. Overall, it is an excellent movie, something you can watch over and over. Highly recommended.","user":"friend_city","rank":[34,41]}]