[{"title":"the most honest characters I've ever seen....","rating":8,"date":"8 October 2001","review":"'Marty' is a movie that can be summed up simply in three words.  It's very honest.  Ernest Borgnine and Betsy Blair play the two main characters, Marty and Clara.  The bulk of the movie takes place over one night, the night Marty and Clara meet.  Everything is really that simple.  The thing that is great is that neither of the characters is anything but human.  They are flawed, they are insecure, and they are awkward around each other and don't know how to act in certain situations.  The chemistry between Blair and Borgnine is absolutely beautiful.  They give us a relationship that is real. There are moments in the movie, that I won't give away, that are almost hard to watch and its hard not to feel sympathy.  At the same time, its hard not to relate to the characters on some level.  They are human, they are flawed, and its beautiful to watch, yet sad at the same time.  I was surprised by the charm of the movie and I recommend it to anyone.  8.5 out of 10.","user":"tripper0","rank":[56,59]},{"title":"Proof That a Picture Doesn't Need SPFX - It needs great Actors","rating":3,"date":"3 June 2002","review":"Okay, so I'm in the Business.  I don't believe this movie could get made today except as an art house film.  Its beauty lies in its simplicity. Starting with a terrific script by Chayefskey (arguably one of the five best playrights of the 20th century), this movie eschews every that's big about motion pictures for a story about Everman who didn't have a date on Saturday night. Rod Steiger first performed the role on television. It won a number of Emmys. \"Opened up\" for the silver screen, it retains the intimacy of its characters. Ernest Borgnine has probably been in 100 movies, but this was his shining moment. He breathes live into the hapless Bronx Butcher whose soul longs for love. When he gives his \"I'm gonna get down on my knees...\" speech, the tears begin to flow.  Why? Because in our heart of hearts, each of us feels the need for love and self validation. Marty doesn't need special effects or action sequences. Marty is in a class by itself. Had it never been made we would have all missed an opportunity to look inside ourselves.  Maybe in this day and age, with all our CGI and Virtual Reality, we need another Marty, to remind us who we really are.<br><br>10/10","user":"StarCastle99","rank":[96,104]},{"title":"Simple, Beautiful and Touching Love Story With Magnificent Performance of the Cast and Sensitive Direction","rating":9,"date":"1 August 2004","review":"Marty Piletti (Ernest Borgnine) is a lonely, insecure and honest thirty-four years old good man, living with his Italian mother, Mrs. Theresa Piletti (Esther Minciotti), and working as a butcher. Angie (Joe Mantell) is his best friend, a very shallow person, and his company to the bars and ballrooms in the evenings, since the ugly and fat Marty is rejected by the girls. His Italian family and friends put pressure on him to get married, but Marty has no girlfriend and lots of difficulties to get close to women. One Saturday night, Marty meets Clara Snyder (Betsy Blair), a twenty-nine single, ugly (obs: `dog', in accordance with the description of Marty's friends in the story, but indeed Betsy Blair was a charming woman, having beautiful eyes and lovely smile and voice) and rejected woman, in a ballroom. Betsy is a teacher in Brooklyn with college degree, and like Marty, is very insecure and has the feeling of rejection by men. They feel attracted by each other and spend a wonderful night together. On the next day, before and after the Sunday Mass, Marty's relatives and friends make jokes with the lack of beauty in Clara. The marvelous open end of the story, uncommon in American movies, is one of the best I have ever seen. This movie is a simple, beautiful and touching love story with magnificent performances of the cast and a sensitive direction. The story and slangs (dog, tomatoes etc.) are dated in 2004, but does not jeopardize the beauty of this delightful romance. `Marty' is the only Best Picture winner (awarded in Picture, Director, Actor and Screenplay and nominated for Supporting Actor, Supporting Actress, Art-Direction and Cinematography) to also win at the Cannes Film Festival. My vote is nine.<br><br>Title (Brazil): `Marty'","user":"claudio_carvalho","rank":[109,120]}]