[{"title":"Immortal (***** stars out of five)","rating":10,"date":"27 July 2004","review":"In the years since his bizarre and tragic death, martial arts legend and master Bruce Lee has become a sort of icon within the Kung-fu movie circuit.<br><br>The last film that he completed before his death, 1973's \"Enter the Dragon,\" has become not only a masterful showcase for Lee's talents (both fighting and acting), but in the 31 years since its release has become perhaps the definitive martial arts movie of all time.<br><br>Lee, in his first and last English-speaking performance, stars as a martial arts expert who is recruited by the British government to infiltrate an island fortress, under the cover of being invited to a martial arts tournament, to investigate a possible slavery/drug ring led by a former nemesis of his. <br><br>Indeed something is amiss at this isolated island fortress, as he discovers that his nemesis Han (Shih Kien) is the host of the tournament and is also the leader of the same gang that murdered his sister. Soon enough, Lee, together with two other martial artists, Roper (John Saxon) and Williams (Jim Kelly), go to work kicking a** everywhere until the final showdown with the murderous, one-handed villain Han in the classic \"Hall of Mirrors\" fight sequence.<br><br>\"Enter the Dragon,\" a joint American-Chinese production, was intended to be Bruce Lee's introduction to Western audiences, but due to his tragic death just weeks before the film's American release, we will never know what he would have been capable of here in the states. Even more tragically, his son Brandon Lee would experience a similar fate just like his father only 20 years later with \"The Crow.\"<br><br>There are so many classic fight scenes, which I can watch over and over without them ever becoming boring. Many of them still hold up very well, especially by 2004's standards, where fight scenes are mostly digitally enhanced or involve \"wire\" or \"Matrix-fu\" to make up for lack of actual stunt work; plus one has to remember that this film was made in 1973, in the days before wirework would become dominant in today's martial arts cinema. The \"Cavern Fight\" is probably my favorite fight sequence of all time, in any martial arts movie. <br><br>Many of the fights in this movie, more specially the ones where Lee is involved, have a surreal feeling to them. He brings a kind of grace to his action scenes that have yet to be topped by any actor alive today. Lee even brings many of his own personal philosophies to this film, which makes much sense and perhaps help to understand some of the more philosophical elements to the story. But more than anything, this was Bruce Lee's entrée to Americans; many people, including myself, were introduced to martial arts cinema through \"Enter the Dragon.\"<br><br>There are also several cameos made by future martial arts stars that would eventually reach stardom, most notably Jackie Chan (as a henchman during the \"Cavern Fight\" sequence who has his neck broken by Lee) and Sammo Hung (as Lee's sparring partner in the opening fight sequence).<br><br>I could go on and on about what makes this movie immortal, but I feel I should let you see what makes it great. Bruce Lee was forever immortalized with this film and it will be cherished and praised forever.","user":"dee.reid","rank":[121,135]},{"title":"Don't think! Feeeeeeelll!","rating":9,"date":"5 January 2006","review":"When it comes to kung fu, Bruce Lee is a legend. When it comes to kung fu cinema, Enter the Dragon is the most highly regarded. In other words, you owe it to yourself to see this flick! The story is relatively simple but quite sufficient and sprinkled with humor. The locations and setting are wonderful as well. The characters are one of the main attractions here though, with the gambling but honorable Roper (John Saxon), the feisty and unorthodox (but effective!) Williams (Jim Kelly), Chinese Hercules Bolo, and the great baddie Han, the hand man. Bruce Lee's presence, of course, steals the show. While some of the fight scenes from Lee's Chinese Connection (I think that's the one) may rival the ones here, ETD is a far more well-rounded film. The variety of exciting fights are skillfully choreographed and there's not too much downtime from the action either; even in the flash back we have some excellent female butt-kicking. And you gotta love that 70's soundtrack! This is a classic action film that will never be forgotten. The two-disc DVD was loaded with goodies; you really couldn't ask for more, except for maybe a better commentary. Producer Paul Heller was dull, dry, and had little to offer.","user":"Golgo-13","rank":[51,57]},{"title":".....simply the best","rating":19,"date":"19 March 1999","review":"Even though it is more than 25 years since Enter the Dragon was first released, to this day it is still hailed as the landmark of martial arts films.<br><br>Used primarily as a vehicle for the late, great Bruce Lee this movie has a thin plot, little actual character development and the acting isn't fantastic.....it was never meant to be another Citizen Kane.  Its merit lies purely in the action content.  If you were to ask any learned martial artist I'm sure that 9 out of 10 would tell you that the fight sequences are unparalleled, even today.  The fluidity of Lee is astounding.  Unlike most martial arts films of that time the fighting is very realistic, and has a somewhat visceral quality.  There is also the use of traditional Oriental weapons (nunchaku, escrima sticks, etc..), although the British censors in their wisdom have seen fit the cut the nunchaku sequence, and I'm afraid, like any censored movie, it just isn't the same watching when you know you aren't getting the full monty, so to speak.<br><br>Still, on the whole one of my personal favourites and a must see for any action or seventies film fan.  If you get the opportunity see the remastered American version with added footage....I've got one,envy me!!!","user":"Dean Routledge","rank":[71,81]}]