[{"title":"\"Your wish is my command.\"","rating":1,"date":"1 April 2007","review":"The Outing is a textbook example of how great artwork can entice you to pick up a movie from your local mom and pop video store's shelf. Now, the status of the movie inside said case could be questionable, but how can you pass up that art? Luckily The Outing is not that bad. Granted, the acting could use some touching up and the formula is an old one, but the gore effects stand out and the sheer eighties-ness of the piece shines through. The Outing (aka The Lamp) is about a group of high school students who decide to spend the night at the local museum. Unbeknownst to them the newest piece at the museum is a genie lamp harboring an evil Djinn. Keep in mind that this was many years before Wishmaster was made. When the horny teens decide to split up and explore the place (and each other) the Djinn is set loose to work his evil magic. That's the formulaic part. But there are some interesting moments along the way. Highlights include: A man getting ripped in half under water, a scientist being thrown into a ceiling fan, and a nubile teen taking a bath with snakes. It's just campy enough to keep me watching and gory enough for me not to give it a bad review.","user":"Backlash007","rank":[12,13]},{"title":"look closely","rating":28,"date":"28 July 2006","review":"This movie was filmed at the Houston Museum of Natural Science. There are a few glimpses of the sign in the front of the building and current Museum patrons will notice that the Planetarium is mysteriously disconnected (pre- grand hall) and the \"side door\" where the kids get back into the building after the building is locked down now leads to a ramp and into the parking garage. I am the Museum's Overnight coordinator now and have spent the night in this same museum many times - unfortunately there is no jin to be found... or is there? <br><br>Obviously we've updated the Museum a bit since this was filmed but if you grew up in Houston going to the Museum on field trips take a closer look at this movie for a good laugh. Don't worry - the laughs definitely continue as you examine the plot, dialog, special effects and fashion! <br><br>This movie is beloved by HMNS staff and we were especially excited to find out about the secret bathtub/snake room!","user":"allison-159","rank":[10,11]},{"title":"I didn't know 4000 year old djinn's had laser beam eyes.","rating":25,"date":"25 March 2002","review":"If scary movies are supposed to have morals than the lesson taught by this movie is \"Be careful what you wish for\".  Okay, forget the fact that all the \"teens\" in this movie look too old even for grad school and concentrate on the plot.  A girl (Andra St. Ivanyi) has an argument with her father and wishes he were dead.  So what?  Well dad is a museum curator and he just happened to come into possession of a real magic lamp (\"from Iraq\") and whoever, or whatever, is inside heard her wish. This isn't one of those nice \"Your wish is my command, O Master\" sort of djinn's; he has a mean streak a mile wide.  When the same girl and her friends decide to spend the night in the museum for a little carnal fun he pops up and starts killing everyone in various exotic ways.  Watch for a boy snapped in half at the waist and dead snakes brought back to life to deliver poisonous bites.  They had to save the budget for the big FX at the end so we just get to see the aftermath of the really gory stuff.  The snake bites and impalements are all shown though. So is this a good movie?  Yeah, I thought so.  The ending left me wondering though . . .I mean it is kind of inconclusive.  What DID that shot of the Pepsi truck mean?  Well, maybe I will just have to see it again.","user":"Nozze-Foto","rank":[10,11]}]