[{"title":"One of His Better Films","rating":7,"date":"21 August 2007","review":"Although it has the worst title of any Elvis movie, \"Clambake\" (1967) is actually one of his better films. Which is surprising as it is one of his last and generally speaking each film seemed a bit worse than its predecessor. \"Clambake's\" salvation is certainly not in the soundtrack which is at best very ordinary, only the title song has any energy. Although there is an actual clambake scene on the beach about midway into the film, it seems thrown in just to justify the title, more impressive is a cameo of \"Flipper\" who had his own television show at that time.<br><br>I'm inclined to credit Shelley Fabares for the good vibe I got from this film. She plays \"golddigger with a heart of gold\" Dianne Carter, Elvis' ultimate love interest. I never cared for her uptight Mary Stone character on reruns of \"The Donna Reed Show\", and therefore paid almost no attention to her until recently. But since seeing her in \"Ride the Wild Surf\" and \"Clambake\" I've had a major attitude adjustment. \"Clambake\" was the third time she was tapped for the love interest role in an Elvis film so obviously she and the King had grown comfortable working together. <br><br>Their romance is a little different than the Elvis standard. In \"Clambake\" she does not start out hating or ignoring him. Instead they quickly become friends and she is obviously attracted, but she puts the brakes on any romance because she is hunting for a rich husband and has tycoon J.J. Jamison (Bill Bixby) squarely in her sights. She comes around in the end and their chemistry actually feels real, much like it did with Ann Margret in \"Viva Las Vegas\".<br><br>The comfort factor is also apparent between Elvis and Will Hutchins, his real-life buddy. Oil tycoon Scott (Elvis) pulls a \"Prince and the Pauper\" and swaps places with drifter Tom Wilson (Hutchins). He wants to find someone who loves him for himself. Hutchins is supposed to provide the film's main comic relief as he enjoys the life of the rich and famous, driving Scott's \"Munsters\" inspired convertible and surrounding himself with gorgeous women who can't dance very well. Although the director had Hutchins overplay the part it is so poorly written that they can't squeeze many laughs out of the premise. But having most of his scenes with Fabares and Hutchins seems to have relaxed Elvis considerably, which makes both he and his film more likable. <br><br>Contrary to most, I enjoyed the corny playground scene with the little girl who was afraid of the slide. The \"Confidence\" song is not a rip off of \"High Hopes\", the whole scene is a variation on the \"Bounce Right Back\" number Donald O'Connor did in \"Anything Goes\". While \"Confidence\" is not much of a song, this surreal scene is priceless. I wonder what long-time fans thought as they watched Elvis and Hutchins do something so totally \"Guffman\"? Most entertainers only do embarrassing stuff like this when they are first breaking into the business. <br><br>Then again, what do I know? I'm only a child.","user":"aimless-46","rank":[16,17]},{"title":"I know, I know, but it's still fun","rating":6,"date":"8 January 2006","review":"As weird as this sounds, I've always preferred the Elvis movies that aren't considered among his best. His best include \"Jailhouse Rock,\" \"Loving You\" and \"Wild In The Country.\" You know, the heavier, more serious early ones.<br><br>No, I'll take his later films - you got it, the dumb, stupid, oh-so light ones. Films like \"Tickle Me,\" \"Girl Happy,\" \"Spinout\" and \"Double Trouble.\" And \"Clambake.\" The plots were always mindless fun and \"Clambake\" is no different.<br><br>Elvis was almost always a moody, brooding loner in the early films. He usually played unappreciative guys with chips on his shoulder the size of the Rock of Gibraltar. The characters in those films are guys I'd have little desire to know.<br><br>However, the guys he played in his later movies aren't that way at all. They're nice, decent, upstanding, fun-loving fellas. I like those guys. I like watching them as heroes, as leading characters in fun, dumb little movies. Hence, I like those movies a lot more. I couldn't give a rat's rear about appraising them as serious films because they're not.<br><br>In his silly mindless mid-'60s films, Elvis always had a goofy main sidekick. Here in \"Clambake,\" it's Will Hutchins, who starred in one of Warner brothers' classic '60s television westerns, \"Sugarfoot.\" And believe me, Hutchins can goof it up with the best of them.<br><br>The two wise, sage, old guys are (1) old pro James Gregory and (2) Bette Davis' ex, Gary Merrill, who, if you really look, often looked as though he hated whatever film he was in.<br><br>Elvis' Number One girl, Shelly Fabares plays the gal Elvis competes for with Bill \"My Favorite Martian\" Bixby. There are also plenty of Elvis Girls around, as usual.<br><br>Alas, there are no true classics or any memorable songs in the entire film. Tunes like \"High Hopes\" clone \"Confidence\" aren't either.<br><br>\"Clambake\" ain't no \"Tickle me,\" but it's still great fun!","user":"estabansmythe","rank":[19,21]},{"title":"A postcard of the 60´s","rating":15,"date":"15 January 2004","review":"This movie represents the end of Presley´s cinematic career,because the other \"movies\" after this one was just a waste of time for him,and he knew it. When you see Clambake,you can smell the 60´s decade,the inocence and childish happiness before the Vietnam War,the death of Kennedy and Martin Luther King. The title song shows what you can expect of it,it´s a fun film,with no intentions to be taken serious by anyone.It´s a party,with lot´s of girls,color and Elvis Presley.The songs are not so bad,\"You don´t know me\"is a great ballad,\"A house that has everything\"it´s a little pearl,just like \"The girl i never loved\". About the plot....well,it´s a quest for find true love,and that great question:\"Does she love me,or my money?\"... It´s always great to see Elvis,even in his movie decade,because there´s no artist´s like him nowadays,unfortunatelly....I almost forgot to say that this movie is better than:\"Gigli\"","user":"eccs2003","rank":[15,17]}]