[{"title":"Childhood nostalgia.","rating":8,"date":"27 August 2002","review":"Almost three decades later,Yves Robert comes back to what he does best:childhood movies.\"La guerre des boutons\" (1962) was the first work featuring almost only brats.It was a timeless blockbuster in France and an (English or Irish) remake was made a few years ago.<br><br>Yves Robert tackles here Pagnol 's autobiographical books and transfers them to the screen with taste ,humor and magic.Magic is everywhere as Robert perfectly recreates those little simple pleasures of long ago.\"Le château de ma mère\" is the follow-up to \"La gloire de mon père\".Both movies are likable,Robert showing tenderness for his characters:The enthusiastic atheist father (Philippe Caubère), the mother everybody would like to have (Nathalie Roussel),their two children ,Marcel -who would become the great director and writer- and his brother\"petit Paul\", the Christian uncle Jules who prays for his heathen brother-in-law,and plays the occasional Father Christmas. A lot of colorful secondary characters adds to the enchantment:Lili,the little boy of the garrigue,a girlie,some kind of stuck-up thing,a noble who's a true gentleman,a wicked warden(One of Jean Carmet's last parts) who's got instructions by way of heart.<br><br>The main difference between \"le château de ma mère\" and the first part \"la gloire de mon père\" lies in the fact that the former opens the gates of life(not only the gates the father illegally opens) .The conclusion is very harsh,but Robert avoids pathos and melodrama.It does not prevent us,though,after three hours (the two movies together) in these green pastures of childhood paradise,from getting a bitter taste in the mouth.<br><br>Robert knows it:so he ends his work with a wonderful epilogue(faithful to the book) which thoroughly justifies the title.And the audience will leave the Provence,while thinking that here or elsewhere,dreams may come true.<br><br>As Pagnol wrote at the end of his book:\"life is made of small pleasures and big grieves :don't you tell it to the children\"","user":"dbdumonteil","rank":[28,28]},{"title":"Second part of a two-part masterpiece","rating":31,"date":"31 January 1999","review":"\"My Father's Glory,\" and its sequel \"My Mother's Castle,\" tell the story of a young boy's \"wonder years\" growing up in a family with an adored father, a lovely but frail mother, and assorted eccentric relatives and friends. These are incredibly charming films that feature none of the violent action and highly charged emotions that we've come to expect in popular films today. Instead, they celebrate the simple joys of life in a warm and loving family. When minor but unexpected events occasionally disrupt the day-to-day flow of events, they can seem like terrible disasters. On the other hand, a simple visit to the country can seem like a tremendous adventure. It's not necessary to have seen \"My Father's Glory\" to enjoy \"My Mother's Castle.\" In fact, I happened to see them out of order and I loved them just the same. But if I had my preference, I'd watch them in order. The final scene of \"My Mother's Castle\" is emotionally powerful and satisfying; for me it confirmed that every minute I'd invested in these films was worthwhile. I wanted to get up there on the screen and help. In French with English subtitles.","user":"Bill-308","rank":[19,19]},{"title":"Wonderful gems from Marcel Pagnol","rating":10,"date":"24 October 2005","review":"Both of these films are excellent autobiographical recollections of the author's youth. I enjoyed them both very much as the subject matter is delivered with aplomb and the photography is stunning. <br><br>They really take you back to this era, romantic in approach but doesn't neglect the real hardships experienced in that period. The way all emotions are played out is masterful.<br><br>He also wrote Jean de Flotette and Manon des Sources. If you haven't seen them but enjoyed Le Château de ma mère and La Gloire de mon père then I recommend you do as they are both in a similar vein and are even more stunning.","user":"naxman","rank":[13,13]}]