[{"title":"Better than its rating indicates if you like the genre","rating":9,"date":"9 August 2003","review":"I didn't really understand on why this movie was rated so low, until I realized that to really enjoy this film you needed to grow up watching horse operas on Saturdays. This means to appreciate the humor, you're probably closer to 40 than 20 or spend a lot of time watching TVLand. From what I've seen most members here are closer 20. This movie satires the Saturday matinee western where you can tell the good guys in the white hats from the bad guys. So it would be better for those of us who saw and liked westerns before the \"anti-hero\" westerns of the late 60's to present. Where the cowboy star has a new set of duds on for each scene, foils the bad guys and gets the girl but would rather kiss the horse. The storyline is thin because they were all pretty much the same back in the 50's. That's part of the joke. I'd forgotten about this little gem until I was looking at Tom Berenger's credits. He and the rest of the cast were really good. It may not be a great movie but its definitely worth a watch. Favorite line G.W. Bailey saying \"Gee Rex, you  really ARE a good guy!\"  7 out of 10","user":"stryder1","rank":[24,24]},{"title":"Parody of the old Singing Cowboy Movie","rating":8,"date":"15 August 2006","review":"Absolutely side splitting satirical look at the early singing cowboy western. Tom Berringer plays Rex O'Herlihan the singing cowboy who spoofs every western cliché in the book. Great comedy performances are made in this movie by Andy Griffith, Mary Lu Henner, Sela Ward and Fernado Rey plus a lot of great supporting actors. Also Patrick Wayne makes a guest appearance in the movie.<br><br>If you are looking for a sophisticated film that the critics all love, this probably won't be it. But if you're regular folks that enjoy the old time western, you'll bust a gut laughing at this movie. Side note, the main musical theme is performed by Rex Allen Jr. as well as the love theme by Country Artist Garry Morris.","user":"gjudd-1","rank":[16,16]},{"title":"Are you guilty of overlooking this really funny movie?","rating":28,"date":"28 January 1999","review":"Why would a really funny movie like Rustler's Rhapsody get passed over and over and over?<br><br>Because most times these over-the-top parodies stumble all over themselves, then fall flat. RUSTLER's RHAPSODY hangs right in there, start to finish.<br><br>It starts with a really b-list cast---Tom Berenger as the lead, G.W. Bailey as the town-drunk, Marilu Henner as the saloon girl..but the basics of comedy, strictly applied set this  Wild West Farce right there with Blazing Saddles.<br><br>Andy Griffith has NEVER BEEN funnier, as the effeminate cattle-baron, set on taking over the dusty old town.<br><br>Take, Tom Mix, add the Marx Bros, and a little something extra, and you've got Rustler's Rhapsody. A must see.","user":"Doctor_Bombay","rank":[30,32]}]