[{"title":"A beguiling film","rating":8,"date":"19 July 1999","review":"Seems to represent Renoir bringing his classic concerns into a modern format - the movie begins with a (slightly leaden) satire of modern media, and the plot relies heavily on artificial insemination, the politics of a modern Europe, the politics of image, and preeminently the relationship between science (here representing repression and fastidiousness and self-denial) and nature (here representing a rustic, lusty, idyllic, semi-slapstick integrity). That sounds a bit condescending, and indeed it s an old man's movie. But it's also a very good one, with superb choreography of the elements and many moments of  bliss (the shot of the loosened-up professor beaming as he rides a motor scooter is priceless). Sadly, it s hard to get beyond the wretched quality of the Eastmancolor print - there s virtually no green left in it, just a sickly pink. A restored print would surely add to the movie s emotional lushness, perhaps revealing whole layers of additional subtlety in the design, and giving it a sharpened modernity. Even as it stands, a beguiling film.","user":"allyjack","rank":[12,14]},{"title":"A GREAT FILM","rating":10,"date":"31 August 2000","review":"The third part of Renoir's impressionist trilogy (\"The River,\" and \"French Cancan\" are the others) is a gorgeously photographed panorama of the French countryside which serves as the background for a picnic thrown by a biologist who has perfected a method for 'artificial insemination,' and who furthermore, is about to run for \"President of Europe!\"<br><br>Catherine Rouvel plays Nennette, a beautiful country girl who has had bad luck with men but would very much like to have a baby. After hearing about the famous doctor's techniques she decides to go and volunteer for 'artificial insemination.' She ends up being employed by the doctor's staff and goes on the country picnic with them, during which the picnicers are subjected to 'mysterious occurrences and temptations' which are produced when a certain goat-shepherd plays his wooden flute! The famous biologist, very detached and committed to strict methods of reason, starts to discover the higher harmonies embedded in nature while he falls in love with the lovely Nennette, a union to which his political cronies are opposed.<br><br>The film is rich with fantastically beautiful images. The scene of Rouvel taking a skinny dip while the doctor casts quick diffident glances her way is one of the most poetic in all of cinema. Of special note also is the scene where all the picnicers ride on mopeds through the country lanes, which was the direct inspiration for the famous bicycling scene in Truffaut's \"Jules and Jim.\"<br><br>Renoir takes what may at first seem like just a trivial comedy and turns it into an ultra-subtle, timeless and poetic meditation on the conflict between modern society and 'natural imperatives.' As always it is Renoir's deeply romantic (in the best sense of the word)and compassionate view of humanity which underlies everything and makes his criticisms so poignant.","user":"Aw-komon","rank":[18,23]},{"title":"Slight but charming","rating":7,"date":"20 December 2019","review":"A satirical farce from Renoir on the bourgeoisie, (naturally), built around the subject of artificial insemination and sex but too broad to make a real impact, a kind of Carry On Picnicing. Paul Meurisse is the priggish scientist running for President of Europe who wants to make babies the arificial way but who comes under the spell of Nenette, (Catherine Rouvel), quite literally thanks to a flute-playing shepherd who can conjour up a wind-storm if need be. It looks great, (Renoir shot it in colour), and there's a nice score by Joseph Kosma but in the Renoir canon it's really only a divertissement . Still, even a Renoir divertissement counts for something and this one is undeniably 'charmant'.","user":"MOscarbradley","rank":[2,2]}]