[{"title":"A pleasant surprise","rating":7,"date":"10 April 2006","review":"I love it when I find a movie in the bargain bin, watch it, and it turns out to be really good. Such is the case with The Bride. The cinematography is beautifully done, creating a rich atmosphere and setting for the story. Filmed in England and France, the locations add some real authenticity to the story; this is no Hollywood back lot. Some may criticize the acting skills of the leads or the degree of depth in the story line, but one thing is sure, the movie is consistent in story, direction, mood, and content from beginning to end, a well delivered package. I also enjoyed this spin on the Frankenstein monster; he's got personality and character. Instead of being only an object of horror as in other films, the viewer gets to know and identify with him as the movie progresses, coming to care for his success and well being. As another viewer stated previously, approach this movie as a Gothic novel instead of a horror story, and you're sure to find some enjoyment from it.","user":"spinman140","rank":[11,11]},{"title":"A Different Version of Frankenstein Story","rating":7,"date":"29 March 2016","review":"After the creation of his creature (Clancy Brown), Dr. Frankenstein (Sting) researches and creates a perfect woman, Eva (Jennifer Beals), to be the mate of the creature. However, the anxiety of the creature creates havoc in the laboratory that is burnt down and explodes, killing Frankenstein's assistants Dr. Zahlus (Quentin Crisp) and Paulus (Timothy Spall). Dr. Frankenstein believes the creature died too but he flees to the woods. Soon he meets and befriends the dwarf Rinaldo (David Rappaport), who gives a name to him, Viktor, and invites him to work in a circus in Budapest. Meanwhile Frankenstein and his house keeper Mrs. Baumann (Geraldine Page) teach Eva how to behave and to be independent. One day, Frankenstein introduces Eva to the high-society, telling that she was found amnesic in the woods and has become his protégée. But Frankenstein becomes obsessed of Eva while Viktor and she have a strange connection. What will happen to Eva? <br><br>\"The Bride\" is a different version of Frankenstein story by Mary Shelley. The film is actually a romance that begins slow paced but well resolved in the end. Clancy Brown has an outstanding performance in the role of the naive creature. My vote is seven.<br><br>Title (Brazil): \"A Prometida\" (\"The Promised One\")","user":"claudio_carvalho","rank":[10,10]},{"title":"A Dark Fantasy of a Movie","rating":8,"date":"19 October 2006","review":"In this wonderful movie, Sting plays Dr. Frankenstein, who after already creating his first monster and finding him disappointing and annoying has decided to create the perfect woman. He's successful in his pursuit, but the first monster, Clancy Brown in a heartwarming role, is chased away after becoming a little to possessive of his new bride.<br><br>The monster runs off into the woods and befriends a little person, Rinaldo the Midget, played wonderfully by David Rappaport, on his way to join the circus. He invites the monster along, and gives him the name of Victor. It is from Rinaldo, who's patient and understanding in a way Dr. Frankenstein never was, that Victor learns how to get by in life, how to behave, how to share, and to go after your dreams.<br><br>Meanwhile, back at the castle, Dr. Frankenstein is trying to educate and enlighten his newest creation Eva, a lovely and talented Jennifer Beals. He aspires to create the perfect woman, as intelligent and independent as a man. He does not, however, consider the full implications of his aspirations.<br><br>As Eva grows and learns, she begins to ask questions. She has been lied to about who she is and where she comes from. Much to Dr. Frankenstein's annoyance, she has become strong-willed and independent, just like a man, but obviously not quite what he had considered. He had also not considered how arousing he would find her.<br><br>Victor and Rinaldo successfully join the circus after much persuading, but Rinaldo longs for his dream to visit Venice, and Victor discovers he longs for his dream of Eva, his intended.<br><br>As the movie progresses, there is an obvious connection between the two characters which they are aware of, but aren't in contact with each other.<br><br>As Dr. Frankenstein introduces Eva into society with a few little mishaps, Eva discovers a handsome young soldier played by a very young Cary Elwes. He pursues her as he would any woman he would like to bed, much to agitation of Dr. Frankenstein.<br><br>The movie moves towards its climax, bringing with it an intensity and a heartfelt conclusion that makes it overall a remarkable movie.<br><br>Sting manages to convey Dr. Frankenstein's increasing frustration with his independent, disobedient, yet lovely creation, a dark character who also enjoys his opium from time to time. The scenes with Victor and Rinaldo are wonderful. Jennifer Beals is perfectly bewitching, at first unknowing and naive, then becoming strong and intelligent as the movie progresses, yet still revealing an innocence to her character.<br><br>I think anyone would be charmed and entertained by this wonderful movie, and I highly recommend it to all.","user":"moon110581","rank":[12,13]}]