[{"title":"So Ahead of its time!!!","rating":8,"date":"25 April 2005","review":"Just rented and watched HI, MOM! and am blown away by parts of it which are so ahead of its time as to seem contemporary, given today's post-MTV-era approach to film-making. <br><br>I would say 80% of this film is utterly brilliant and 20% is merely so-so; scenes with extended dialog sometimes have you checking your watch since the characters may seem to drone on about this-or-that, but there are enough funny moments in these sorts of scenes to keep your attention. And, believe me, you want to stay tuned for the \"Be Black, Baby\" portion of the film which is nothing short of side-splitting. <br><br>The way the film is made, with its occasional fast-paced editing, sped-up footage, and other visual tricks (so dePalma) will appeal greatly to the short-attention-spans of today and seem to anticipate the way films will be made by mainstream producers and directors who cut their teeth creating music videos for MTV. I'm not saying this film feels like a music video, but it uses various visual devices which would become standard fare in music videos and part of today's cinematic vocabulary. Again, I can't reinforce how ahead of its time this film is, apparently foreshadowing things like \"reality TV\" in the \"Be Black, Baby\" guerrilla theatre piece.<br><br>It's astounding and frightening to see how far we possibly HAVEN'T come past these notions of entertainment, or how they've become scarily mainstreamed by Hollywood. <br><br>DeNiro gives a terrific performance and it's a real treat to see him doing something like this at a young age. Kudos to DePalma for this film, also -- it's a filmmaker's dream with all the film-within-film devices and you can see he's working out his fascination with optical and split-screen-type manipulations in a very youthful, bravura sort of way. I would say this is DePalma at his most innovative, aside from his shamefully underrated film SISTERS...before he became bloated and weighed down by the mainstream Hollywood ethic. That's not to say DRESSED TO KILL or CARRIE are bad pictures or bad reflections on DePalma, but they don't reflect the liberated genius that is clearly evident in HI, MOM! or SISTERS.<br><br>HI, MOM! is an absolute MUST-SEE for any DePalma fan, general cineaste, film student, or comedy devotee. There are still lessons to be learned from watching this film, even today when it seems all the tricks DePalma used have been exploited ad infinitum. HI, MOM! manages to feel fresh in an era when -- by rights -- it really ought to feel stale. <br><br>It's also a tremendously valuable look at pop culture from 1970 and contains some great moments in an adult movie theater. My favorite line occurs there, when a porno producer is counseling DeNiro (a would-be amateur porno producer himself, using his Super 8 mm camera). The two men sit in the back row, discussing the film they're watching and how it's made (and, for the uninitiated, this is typically where men-who-seek-the-company-of-other-men will congregate). Suddenly we have a rapid cut which shows another theater patron has sat himself next to the men, and the patron puts his hand on the leg of one of the men (DeNiro, I think, who brushes it off with some shock and embarrassment). The porno producer (mentor) says very sympathetically, regarding the gesture of the patron, \"...he means well.\" Boy, ain't that the truth! Meanwhile, in the background, another patron is being thrown out of the men's room (presumably for having made a pass at someone homophobic).<br><br>Another scene involves a pharmacist opening a condom package and demonstrating its strength and elasticity. Hilarious.<br><br>These are issues you would likely never see addressed today in a mainstream Hollywood film because of America's prudishness, or they would be handled in a way that was purely condescending. Instead, DePalma takes you *into* the circumstances, humanizes them, and permits them to be funny on their own merit (he doesn't clobber you over the head with bad, smarmy, self-conscious jokes the way today's writers would).<br><br>What is disappointing about this film is that it shows how DePalma's work ultimately suffered as he became a victim of the Hollywood machine -- the studios and execs who no doubt had a hand in reigning in his talent and vision, styling it for a perceived audience. <br><br>Again, I can't recommend this film enough -- please rent it and see it and revel in its good-naturedness, it's incredibly edgy foreshadowing of things-to-come, and it's hilariously genuine humor.","user":"weho90069","rank":[28,33]},{"title":"A unique movie, which is both funnier and darker than 'Greetings'. A must for both fans of De Palma and De Niro.","rating":27,"date":"27 February 2004","review":"'Hi, Mom!' is supposedly a sequel to Brian De Palma's earlier 'Greetings', but the connections are a bit tenuous, even though Robert De Niro once again plays Jon Rubin. Is he the same character? I suppose so, but it's hard to say. Alan Garfield and Gerrit Graham also reappear. Garfield could well be the same guy, he's involved in pornography after all, but Graham is most definitely playing a different person. It's just one of many fascinating things about this unique movie, which is both funnier and darker than 'Greetings'. Rubin is a Vietnam vet who fancies himself a movie director, or maybe this is just an excuse to spy on the occupants of the building opposite. They include Graham, a radical involved in guerrilla theatre and the black power movement (there's a priceless moment where he paints himself black), and the sexy Judy (Jennifer Salt who subsequently co-starred in De Palma's breakthrough thriller 'Sisters'), who he decides to seduce (another classic scene). De Niro is on top form throughout, I really enjoyed his performance. Charles Durning has a hilarious bit at the beginning as the building Super, and cult fave Paul Bartel ('Eating Raoul') can be spotted if you keep your eyes open. The highlight of the movie is the brilliant 'Be Black Baby' sequence, which has to be seen to be believed. De Palma is a talented and versatile director who rarely gets the credit he deserves. Those who simplistically dismiss him as nothing but a Hitchcock rip-off would do well to watch 'Greetings' and 'Hi, Mom!' two of the most original and innovative American movies of the late 60s/early 70s. And Robert De Niro fans just have to see his work in these two movies, and I also recommend they check him out in Roger Corman's 'Bloody Mama' with Shelley Winters and Bruce Dern, and his small role in 'Born To Win' opposite George Segal. These all show that he really had something special going on before he teamed up with Scorsese.","user":"Infofreak","rank":[20,24]},{"title":"An odd mix indeed","rating":5,"date":"18 September 2006","review":"I rated this movie in the middle only because I feel there were two distinct parts to the movie with an indecisive end. The first part, with Robert De Niro prominent is very funny, at time uproariously so. (The opening with Charles Durning is priceless.) The part with the theater of \"Be Black Baby\" was pretty strong stuff, even today. It was real and scary and had no relationship to the first part. This part was really tense and made me shudder several times.<br><br>The problem I had was what did the De Niro part have to do with the \"Be Black Baby\" part. Maybe I am old-fashioned and wanted something more linear or, really, coherent. Perhaps the appeal of this movie is the lack of obedience to strictures. I do applaud that kind of freedom, but only when it works. I laughed and cringed during what felt like a double feature. Both parts work very well. But together they make an uneasy mix.","user":"tedr0113","rank":[11,13]}]