[{"title":"Preaching the revolution -- with lucidity","rating":7,"date":"30 July 2008","review":"After the huge critical and box-office acclaim of the iconoclast political satire \"Macunaíma\" (1969), director Joaquim Pedro de Andrade raised funds in Brazil and Italy (through RAI-TV) to make \"Os Inconfidentes\", a politically and artistically ambitious (though low budget) film that tries to throw new lights on the most important political event in colonial Brazil  the ill-fated plotting of a coup d'état by a group of Brazilian military officers, poets and intellectuals and their failed attempt to overthrow the Portuguese Crown and establish a Brazilian Independent Republic in 1789, inspired by Rousseau and the success of the American Revolution.<br><br>The conspiracy failed due to many factors, perhaps most importantly the lack of proper organization, funds and efficient articulation with sympathetic groups. Once the coup plans were discovered, some of the conspirators (\"inconfidentes\", hence the film's title) were imprisoned and tortured, and one of them committed suicide in jail. Most of them were exiled, but one was \"exemplarily\" sentenced to death: the impetuous young dentist and low-rank military officer Joaquim José da Silva Xavier, aka \"Tiradentes\". In 1792, he was hanged, beheaded and quartered, his head and limbs subsequently displayed in public roads as a scary cautionary warning for potential conspirators. One century later, Tiradentes became Brazil's highest martyr and hero, of course, when Independence was finally declared in 1889. <br><br>Andrade re-stages (with liberties) the actual events in some of the historical locations (the fantastically well-preserved villages of Ouro Preto and Mariana and their amazing 18th century architecture), aiming at a contemporary political meaning -- in 1972 Brazil was living the darkest years of its violent military regime (1964-1985), with arbitrary imprisonment, torture and/or assassination of hundreds of political activists, not unlike what had happened in 1789. But Andrade wisely avoids naive revolutionary propaganda: \"Os Inconfidentes\" is rather an alert against hurried, hot-headed, improvisational actions by small activist groups who, though speaking in the name of the \"oppressed majority\", are perhaps guided by class or political esprit de corps, or utopian, unrealistic ideals (Glauber Rocha had already called attention to these issues with his 1967 \"Terra em Transe\"). \"Os Inconfidentes\" is also about the role of artists and intellectuals in the political fights of the tumultuous 1970s, when most of Latin America was stifling under violent military regimes.<br><br>Andrade had another BIG obstacle to dribble: censorship, that would never allow him to \"reinterpret\" the official version of History. Thus, he goes down to the actual historical sources, using as dialog material the actual letters, articles, poems and legal testimonies of the conspirators, as well as the Portuguese government's official reports on the \"interrogation\" proceedings (that notoriously included torture, as it did in the 1970s). \"Os Inconfidentes\" features erudite, archaic 18th century vernacular that is almost incomprehensible to average modern audiences, but the subtitles in Portuguese in the newly released restored DVD version are a lot of help (there are also finely translated subtitles in English, French and Spanish). Besides, Andrade takes for granted the audience's knowledge of historical facts: if you really want to understand plot and characters, you have to do your homework first.<br><br>This choice for archaic vernacular leads Andrade to let the talented, experienced cast overact (if the audiences can't understand the words, they can at least sense the urgency and despair through loud, theatrical performances), with Wilker (as Tiradentes), Pereio, Sabag and Carlos Gregório shamelessly hamming it up -- though Andrade never lets pastiche set in: it's a painful, tragic film. The film closes with contemporary official propaganda newsreel footage glorifying Tiradentes's martyrdom: we see the \"power elite\" of Brazilian dictatorship paying homage to a man whose ideology couldn't be farther away from theirs. It's a startling reminder of the way history is often conveniently \"reinterpreted\" by the men who happen to be in power.<br><br>\"Os Inconfidentes\" is far from an easy film but -- for those willing to do their homework -- it demonstrates that even in times of intense censorship it's still possible to deliver a powerful political message, albeit through \"codified\" language.","user":"debblyst","rank":[13,13]}]