[{"title":"Impressive work of early docu-ganda","rating":8,"date":"6 October 1999","review":"Documentary account of the building of a railroad through central Asia, presented as a heroic triumph of Soviet progress over natural adversity. As a work of high-powered editing, a notch below Berlin Symphony of a City, perhaps, but only one notch, and with far less overt political content than many Soviet films.  If I'd been a peasant and they'd come to town showing these heroic bulldozers and hammer-swingers, I'd have signed up for the revolution.","user":"mgmax","rank":[17,17]},{"title":"Great film","rating":10,"date":"1 June 2000","review":"Stirring, with countless lovely images: the camels cresting the dune casting spectacular shadows, the sand sliding down the slope after the simoon, the incredible faces of the Asiatic peasants, as they stoically wait for their water. And who cares about the political content of any of these early Soviet films? Let's not be anachronistic. Remember that they were intended to educate a vastly disparate population, and to inspire them. To complain about the propaganda is similar to watching horror films and then objecting to their \"scare tactics\", even if they are skillfully done.","user":"rmh3283","rank":[4,4]},{"title":"Turksib—An Emotional Journey in Connecting North to South, and South to North","rating":9,"date":"17 February 2013","review":"Turksib is a gripping documentary illustrating the societal struggles resolved with the construction of the 1445-kilometer Turkestan-Siberia (\"Turk-Sib\") railway line through Kazakhstan in 1930. For a silent film, Turksib features exemplary organization to guide the reader. First, the viewer is exposed to the problems affecting the people of Turkestan without a railway connection. Next, the film displays the unfaltering determination of man and machine as they battle nature to construct the Turk-Sib line. Finally, upon the line's completion, one is given a happy conclusion showing montages of successful harvest and manufacture of cotton and wool products from Turkestan, aided by the railroad. <br><br>The repetitive use of inter-titles, often just single words displayed on multiple occasions, added a lot emotional power to the three aforementioned parts of the film. For example, the words \"water,\" \"grain,\" and \"waiting\" were frequently repeated in between images of the people of Turkestan miserably awaiting water or not being able to transport their cotton to the market, making the viewer sympathize and understand the need for a Turk-Sib line. Furthermore, during the construction of the line, repeating words like \"forward,\" \"man,\" \"machine,\" and \"civilization\" emphasized the stubbornness of man in conquering nature, shown with montages of workers digging up the land and detonating mountains to lay track. Finally, the words \"north-to- south,\" \"south-to-north,\" and \"cotton\" were continuously redisplayed towards the end, underscoring the successful railway connection, shown with montages of successful harvests in Turkestan and of cotton mills springing to life again. <br><br>Throughout the film, the viewer remained engaged through the repetitive inter-titles and logical organization, feeling the struggles experienced by the people of Turkestan, sharing in the intrepid attitude of the workers ripping apart the land to build the railroad, and celebrating alongside the people when the pulse of the mills picked up again after the Turk-Sib was completed. All in all, Turksib is a great account of a huge accomplishment, Soviet Russia's version of the Darlington to Stockton-on-Tees line in Britain, or the trans-continental railroad in the United States.","user":"kril10","rank":[3,3]}]