[{"title":"Nightmare for children, heaven for adults!","rating":10,"date":"20 June 2004","review":"Of course this is not really a movie for children. The structure of the movie is similar to \"Wizard of Oz\", beginning with a child which seems to be frustrated with the real life and then dreaming into another world, full of magicians, witches, fabulous adventures and so on. But while \"Wizard of Oz\" is funny, the characters can simply be divided in \"good\" and \"bad\", the adventures can be understood - in \"5,000 Fingers\" the little boy enters a nightmare! Funny and helpful characters are emotional disturbing. A witch can be recognized as fabulous being, but a piano-teacher is close to real life, and Dr. T. is much more frightening than the evil witch from Oz! The decoration and especially the musical numbers are fantastic, think of the bearded twins on skaters! Fantastic! The psychology of the movie is excellent: A boy suffering from the lack of a father is afraid that his beloved mother is hypnotized by a strange man and will marry him. Certainly thousands of children at any time are fearing such a situation. Literature and cinema are full of this theme, think of \"Alice in Wonderland\", \"Fanny and Alexander\" and so on. Really interesting is the time at which this movie was made. During the 50s almost everything was nice and perfect, and here you have a nice and perfect Musical showing frightening, fear, the \"other side\" of everything. - Here in Germany I am desperately waiting for getting it on DVD or TV! This movie is quite unknown and perhaps unpopular for its content. But believe me: It's one of the \"pearls\" in movie history!","user":"haddock","rank":[51,57]},{"title":"The most underrated film of all time","rating":10,"date":"15 April 2009","review":"I saw this when I was about 5 years old and the images were burned into my brain. Images created by Dr. Seuss! I especially remember the Twilliker Institute, with it's electrified Barbed Wire Fence...<br><br>And the curved ladder into the sky... And all of he strange and wonderful musical instruments played by the prisoners in the dungeon. And the costumes that possibly inspired the makers of Star Trek, the hoods in this film look like the Original Klingons (Without the forehead makeup).<br><br>And the wonderful music and dancing and the insane lyrics written by Dr Seuss! Seeing this film at an early age definitely affected me... And it also made me afraid of music teachers. But it was not music teachers but Normality and Forced Peer Pressure I despised- The being told. HOW to dress, HOW to talk, HOW to walk, HOW to live! This film is, as Groucho Marx says: Is \"Against That.\" What this film is for, is free musical expression, and free speech. This film teaches us, that not all people talk or look the same way. And the ever growing popularity of this film shows us a great deal about our societies: 30 years ago, freedom of expression was NOT encouraged, but now it is.<br><br>This film will forever be on the front lines of free speech, and it is probably one of the most important films ever made, due to the fact that a child can figure this out about the film, that it is about freedom.<br><br>And the biggest mistake regarding this film is by parents who insist that \"This is a movie not intended for children\" or that the film is not appropriate for children: I can say with 100% assurance that this is false, that I saw this film when I was a small child and I believe I benefited from the experience. This film should be shown to small children, but with discretion because some of the images can frighten a child: But because my parents were in the room I did not get frightened by the imagery.<br><br>The way this film is shown to a child can affect a child's creativity forever- And if the child is frightened, well then they can always watch it later. I was mortally afraid of Mr. Magoo cartoons until I was about 3 years old, the noise frightened me. But about 1 year after I was frightened by the introduction to a Mr. Magoo cartoon, I saw this, with my brother and parents, and we all loved it.<br><br>What is amazing was the almost 100% negative reaction to this film by the critics of the time, and we can thank whatever deities that they were 100% wrong.","user":"XweAponX","rank":[21,22]},{"title":"Surreal, funny, poignant... and there IS a logic to it","rating":10,"date":"9 August 2002","review":"I am a European who hasn't read one single book by Dr. Seuss, but I am magically captivated by this movie. I've seen the DVD four times by now, first having seen it twice at film archive shows.<br><br>There's only one way to have the seemingly absurd pieces to fall into place. This film is a  highly sensitive depiction of a little boy's hopes and fears--occasionally wildly fluctuating between the two. Just try and find another logic behind \"Didn't you know? This makes you my old man.\" \"Yeah, I guess it does, at that.\"<br><br>Yes, Tommy Rettig's singing voice was dubbed by Tony Butala. After all, there's only so much one person can do. Hans Conried probably sang himself. After his double voice role in Disney's \"Peter Pan\" he went on to play the Magic Mirror in several Disneyland TV shows. \"5,000 Fingers\" must be the finest showcase of his talents.<br><br>Repeating the last words of the previous speaker was not a mannerism of Tommy Rettig's. All that is in the script, and Tommy was simply doing his work. The previous year, he was incredible in the neglected b/w movie \"Paula\" which is basically a two-person drama with Loretta Young. (If anyone watches \"Paula\" and does not have a lump in their throat at the end they are beyond all hope.)<br><br>The \"Hassidics\" with the Siamese beard (\"Or you will get choked by the beard of the twins With the Siamese beard With a terrible twin on each end\" as it says in a deleted song) are simply the boy's two great-uncles--their photos can be seen on top of the family piano.<br><br>Originally, Dr. Terwilliker did not appear in the parlor scene at the beginning. Some stills are in circulation--one on the VHS tape box--where Bart Collins darkens the eyebrows on the sheet music portrait with a pencil. The same version includes an alarm clock which Bart attempts to set ahead. In the final movie the clock still remains in one scene, at the high end of the piano keyboard. Late in the production, an immense risk was taken; having anyone speak directly to the camera is problematic, let alone a child. But this worked superbly. Some lines were obvious afterthoughts. I've seen a script with the line \"One hundred per cent perfect gold plated fony [sic], double fony\" added in Tommy Rettig's hand.<br><br>\nThe musical score goes to show what years of experience can do. Friedrich Hollaender--Frederick Hollander in America--composed music for pictures as early as in 1931. The simplistic ditty \"Ten Happy Fingers\" is developed into many superb variations in the film score. As someone who plays himself, I found Bart's \"hundred pianos\" rendition under the baton of Dr. Terwilliker a sheer delight. (Characteristically, Dr. T. is not satisfied...)<br><br>Films like this also remind us about the ephemeral nature of life. At least Peter Lind Hayes, Hans Conried, and Tom Rettig have passed away. Tom--a highly esteemed computer programmer--later said these words in his dBase language, \"IF its_time EXIT ENDIF.\" But they will live forever on film. And when \"Bart and the excited dog run lickety-split down the street\" you will want to see it all over again... I did.","user":"markkufin","rank":[43,48]}]