[{"title":"Husband and Wife Can't Hate Each Other, No Matter How Hard They Try","rating":8,"date":"24 March 2006","review":"\"The Palm Beach Story\" is a lopsided comedy (part of it's funny and part of it's not), but the movie is back-ended with all of the funniest bits, so it allows you to forget the slower parts and it sends you out on a high.<br><br>After a sensationally bizarre opening credits sequence, the movie settles down into a slightly less zingy version of \"The Awful Truth.\" Claudette Colbert thinks her marriage to Joel McCrea isn't working, even though he doesn't think likewise. She thinks she's not a capable enough wife; he thinks he's a failure as a man and husband. She takes off for Palm Beach to get a divorce despite all of his attempts to stop her. On the train to Florida, she meets a wealthy tycoon who wants to marry her and give her everything she could possibly want, but she realizes that what she really wants is her husband.<br><br>This is all told with a lot of wit and flair. The early scenes with Colbert and McCrea drag, and an extended bit of nonsense on the train involving the Ale and Quail Hunting Club is superfluous and not very funny. But once everyone shows up in Palm Beach, the film becomes a delight, and a bonus is added in the person of Mary Astor, who plows on to the screen about half way through the film and decimates everyone in her path with her quick-tongued and hilarious performance as a rich society lady with a lot of time on her hands and her sights set on Colbert's husband.<br><br>What I liked about this film was that Colbert and McCrea don't seem to have a lot of chemistry in their early scenes together; he seems so stiff and bland, and you don't really blame her for wanting to get away. But after you've seen both of them with other people, they seem so much more right for each other when they get back together, and there's all this chemistry you didn't initially realize was there. I don't know if that's due to their performances, the writing, the directing, or whether it was just a happy accident, but it works beautifully.<br><br>Grade: A-","user":"evanston_dad","rank":[26,28]},{"title":"Funny, wacky comedy of the '40s","rating":8,"date":"9 September 2005","review":"Claudette Colbert is a knockout who knows it. She wants the good life, which her inventor husband can't give her. So she leaves him, intending on marrying someone who can support her and finance his invention. Things don't quite work out.<br><br>The opening of \"Palm Beach Story\" is a bizarre scene that only makes some sense (and I'm emphasizing some) at the very end of the film. It's certainly an original way to start a movie. There are some hilarious scenes in this film - desperate to get to Palm Beach for a quickie divorce, but with no money, Colbert accepts the invitation of the gentlemanly Ale and Quail Club to ride in their private train car as their guest and mascot. Unfortunately, the emphasis in this club is the ale and not the quail - shooting sugar cubes will do - also blowing out train windows, trashing whole train cars - you get the idea. Running from them, Colbert soon meets up with Rudy Vallee, who gives an absolutely delightful performance as a filthy rich man. He serenades her at one point, and it's great, hearkening back to his days as a crooner! Mary Astor is his many times married sister, and when Colbert's husband shows, in the form of Joel McCrea, Astor sees her next mark.<br><br>McCrea has a funny slapstick fall down a flight of stairs, but otherwise, doesn't have much to do except be angry and jealous of his wife. Colbert in her glorious clothes, Vallee, and a vivacious Astor upstage him a bit. A very funny film, produced during World War II to give America a much-needed laugh.","user":"blanche-2","rank":[28,31]},{"title":"Zany fun...overflowing with Sturges madness!","rating":8,"date":"7 April 2005","review":"THE PALM BEACH STORY is not to be confused with reality. It's a zany romantic comedy given full speed treatment by director Preston Sturges who brought screwball comedy to an art form.<br><br>His script, full of hilarious one-liners that fly by almost too fast to catch, is acted to perfection by CLAUDETTE COLBERT, RUDY VALLEE and MARY ASTOR--with a less enthusiastic turn by JOEL McCREA who gives the only so-so performance, perhaps because none of the wittiest lines come his way. I've always liked this actor but here is performance is almost muted and strangely remote.<br><br>Nevertheless, if screwball comedy is your dish, this is one you can relish. From the moment Colbert gets aboard a train carrying her to Palm Beach, the fun starts and gets into high gear, racing toward a conclusion that is not altogether satisfying nor even remotely hinted at until the final few minutes of film. It's a twist that somehow doesn't ring true--the only really false note in an otherwise perfect screwball comedy.<br><br>Rudy Vallee is outstanding as a nutty millionaire, a role written expressly for him (and he even gets to sing a little)--and Mary Astor, as his husband hunting sister, is hilariously over the top as a woman who can't stop talking while pursuing her man.<br><br>A good way to spend a pleasant 90 minutes.","user":"Doylenf","rank":[27,31]}]