[{"title":"Excruciatingly bad but it can't help it!","rating":2,"date":"18 April 2003","review":"There are bad movies that are funny. Bad movies that are boring. Bad movies that are offensive. And then there are bad movies that are just plain incompetent. You can't get angry at these movies, because it's obvious they were made by people who simply didn't have the talent or the budget to make something even halfway decent. \"R.O.T.O.R\" is one such movie. You know where you stand right from the beginning, where you can spot the most ludicrously mismatched day-and-night shots since \"Plan 9 From Outer Space\". Thankfully, the \"filmmakers\" don't take themselves too seriously, as is immediately evident by the continuous flow of campy and corny dialogue (about half of which is hard to understand anyway, due to its mumbled delivery). The leading actor gives an amazingly narcotized performance...and as for R.O.T.O.R., well, if Robocop had been so inept he wouldn't have lived to be in the sequels.  I'd give it 0.5 stars out of 4.","user":"gridoon","rank":[30,31]},{"title":"If I ever find that shop assistant...","rating":1,"date":"3 October 2002","review":"My friend Dave and I went to our local newsagents to see if we could hire out RoboCop. This was back in the days when you could rent videos from newsagents, before laws were introduced to stop the assistants from recommending films. Unfortunately for us, such laws had yet to be invented and this lady behind the counter said that they didn't have RoboCop yet, but they had R.O.T.O.R. Now being young and naïve, we looked at the box and saw that both films had similar letters in their titles and R.O.T.O.R. had a picture of a robot man jumping off a bike and firing a gun. WE WERE SOLD!!<br><br>My therapist thinks that a lot of my current problems stem back to this film and our decision to hire it. I have tried to block it from my mind, but it's burned in there and it won't go, it just flashes images from the film at me from time to time.<br><br>Here's what it just flashed at me:<br><br>There's a stainless steel Desert Eagle in it. How do I remember that? Because I think it's the only pistol they had in the film. Watch for the bit when R.O.T.O.R. is in the boat and he's going to fall I the water, and the DE turns into a toy Colt Python. I could just imagine some redneck off screen saying `You ain't getting' my sweetheart, I mean Desert Eagle, wet. That gun an me have a special relationship. She's real pretty.'<br><br>From what I remember of the story, this woman makes some kind of driving violation, so R.O.T.O.R. chases her across the country and tries to kill her. His programming has gone wrong so he'll kill anyone who gets in his way. Harsh? Yes it is, but if the punishment for speeding was death then we'd all drive a little more carefully.<br><br>Well, the budget isn't quite up to that of Water World, and I think that it was made by a group of friends (one of who was going through that transition of man to woman), but I can't really get mad at these guys 'cos at least they tried.<br><br>However, heed my warning. If a motorcycle cop who looks like a bulimic Ned Flanders ever stops you, then run for your life! You might just have met the R.O.T.O.R!!","user":"Neonsamurai","rank":[58,66]},{"title":"This is the worst movie I have ever seen, and I love it.","rating":1,"date":"9 June 2005","review":"This movie gets a 5 out of 10 not because it deserves five points, in fact, I don't think the quality is such that it deserves one point. But it is just so god damn bad that I love it enough to boost up the points.<br><br>To begin with, Richard Gesswein is the worst leading man ever to grace the silver screen. They had to get someone to pull a voice-over for his role, Coldyron (Yeah, that's a tough name), as well as his leading lady, Dr. Steele's part. Dr. Steele, by the way, is a bodybuilder woman with a skunk on her head.<br><br>The opening scene reveals the end of the movie immediately telling you that you are wasting an hour and a half. These three guys (the director, writer and star) came up with enough money to take RoboCop, The Terminator, and Judge Dredd (which was merely in comic book form at the time) into one completely awful masterpiece.<br><br>When we go back to the beginning of the story, the clock strikes 5:00 and Coldyron wakes up. Just as a quick note to the viewers, the filmmakers then had the clock read 4:50, as if to say, \"Please, it's not too late for you, turn off the TV and RUN!\" Of course, I didn't follow the directions, I just laughed. Shortly thereafter he fills up a cup of coffee with far too much sugar and you're thinking, \"Wow, he sure likes sugar.\" (This is a joke that you will soon be hoping the filmmakers didn't find to be funny). He grabs carrots from the fridge and heads outside, to his horse. You think the carrots are for the horse, right? But he gives the horse the coffee! THAT'S why there was so much sugar! Then HE eats the carrots himself! AHA! SO FUNNY!! This is about how great the entire movie is.<br><br>Absolutely nothing makes sense in this movie. Gesswein says that ROTOR will be ready in 25 years, then says he needs at least 4. Shortly thereafter a Native American character named Shoeboogie puts his headphones in the wrong place and sparks ROTOR. It just makes no sense at all.<br><br>I won't go into too many more details, but the worst part of the entire movie must be the fact that ROTOR can take off his sunglasses AND SEE INTO THE PAST! Apparently a function called SENSOR RECALL was built into his system, but it is so insanely dumb that the screenwriter didn't even bother trying to come up with some sort of half-assed explanation. None of the technical jargon even sounds like it makes sense, but he didn't even try going into sensor recall.<br><br>You have to see SENSOR RECALL in action to truly appreciate it's sheer madness.<br><br>At the conclusion of the movie, Coldyron utilizes a technique Shoeboogie spoke of earlier to kill ROTOR, as if to tie everything together in some sort of nice neat way. One of the problems is that Shoeboogie never spoke to Coldyron. Another is that a few pieces of string defeat this unstoppable supercop.<br><br>Another is that I am trying to make sense of a movie in which the comic relief is delivered by a Robot who can think on his own, but the supercop won't be ready for another 25 years.<br><br>ROTOR is the worst movie ever made. If you can find something worse, please bring it to me, because I need it.<br><br>Please see ROTOR. It is so bad, you will hate me for making you watch it.<br><br>And then you will make all of your friends watch it...and you will love me once more.<br><br>\"Look at these cheekbones: I'm either an Indian or a sissy. And, heh heh, I sure ain't no sissy.\" (or something like that...) -Shoeboogie","user":"Iama5yrold","rank":[40,45]}]