[{"title":"The Hero As Comedian","rating":10,"date":"24 December 2005","review":"In his autobiography, The Name's Above the Title, Frank Capra said that until It Happened One Night drama had four stock characters, the hero, the heroine, the comedian, and the villain.<br><br>What Capra did and you might notice he followed that in a whole lot of his films, the characters of hero and comedian are combined. Not completely though because Claudette Colbert gets a few laughs herself, especially with that system all her own. But in doing what he did for Clark Gable's character, Capra created a whole new type of screen comedy, the classic screwball comedy and It Happened One Night surely set the mold.<br><br>Capra's autobiography told the story of the making of It Happened One Night which in itself could be a movie. Capra worked for Columbia Pictures which at that time was a minor studio, along the lines of Republic or Monogram. As Capra tells it he had a vision about this story that Samuel Hopkins Adams wrote and persuaded Harry Cohn to buy it. <br><br>Capra also had a stroke of good luck. Adolph Zukor at Paramount and Louis B. Mayer at MGM were looking to punish a couple of recalcitrant stars, Claudette Colbert and Clark Gable. The idea was to show these two what it was like to work in a small budget studio without all the perks of Paramount and MGM. In fact the description of Gable arriving to work at Columbia that first day, drunk as a skunk, is priceless. Capra dressed him down good and said that to his credit Gable came to work afterwards and couldn't have been more cooperative.<br><br>At some point Harry Cohn at Columbia was convinced that maybe Capra had something. He had in fact delivered for Columbia the previous year with Lady for a Day. So the publicity drums were beat.<br><br>The rest as they say is history. It Happened One Night won the first Oscar grand slam, Best Picture, Best Director, Best Actor, and Best Actress. It won the first Oscars Columbia Pictures ever got and lifted it right into the ranks of the major studios. And it set the standard for screwball comedy.<br><br>The film could never have gotten off the ground were it not for the chemistry of Gable and Colbert. They're together for most of the film so if it doesn't click between the two of them, you have people walking out in droves. Colbert had already played a wide variety of parts at Paramount, ranging from Poppaea and Cleopatra to comedies with Maurice Chevalier like The Big Pond. Gable had played a whole lot of tough guys on both sides of the law at MGM. It Happened One Night showed he had some real comic talent, a flair MGM exploited in his roles from then on in. <br><br>Gable and Colbert did only one other film together, Boom Town for MGM. You can't get much more different than those two films. Boom Town had a huge MGM budget, Spencer Tracy and Hedy Lamarr as well, and a lot of special effects involving the oil industry and hazards therein. It's also a great film, but it's not a classic like It Happened One Night.","user":"bkoganbing","rank":[88,97]},{"title":"Introducing... the Screwball Comedy","rating":9,"date":"23 June 2002","review":"Frank Capra's idealistic outlook on life is evident in his films. From It Happened One Night to It's a Wonderful Life, Capra has always had a tendency to let the little guy rise above it all and beat the odds. It is no small wonder that Capra enjoyed much of his success during the Depression, when movies were used to truly pull an audience out of the despair of the 1930s into a world where anything can happen, where being a nice person is all you need to succeed. While the fact that the country was in the middle of the Depression was not completely ignored, an overly optimistic view on life was taken to counter the despair of everyday life.<br><br>There were many points in It Happened One Night where the true state of the country was indicated. Homeless people hitching rides on trains seemed perfectly normal. Rather than regard them with apprehension and pity, you smile and wave at them. Another example is the hostile reaction proprietor Zeke's wife had to the fact that her husband had let Peter and Ellie stay the night with promises of being paid. Upon seeing Peter and Ellie's car missing, they rush to the cottage to see if Peter and Ellie are still there. They cannot afford freeloaders.<br><br>In another scene, a child's mother has passed out from hunger, because they have no money to buy food. Peter and Ellie have nearly depleted their funds, but decide that the mother and child need money more than they do and give some to them.<br><br>Despite these instances, the movie was altogether cheerful in its depiction of the world. In the throes of the stock market crash, this movie signaled the birth of the screwball comedy. At a time when the country needed release, they could find that release and laughter in movies like It Happened One Night. Audiences were amused by scenes in the film, such as the segment in which Peter teaches Ellie how to dunk a donut. Or, when forced to share a room, Peter puts a blanket between his and Ellie's beds and calls it the `wall of Jericho,' which is revisited when the walls of Jericho come tumbling down after Peter and Ellie's marriage. Probably the most famous scene in the film is the hitchhiking sequence, which features Peter standing by the roadside trying to thumb a ride unsuccessfully, finally giving up after more than a dozen cars speed by without paying any heed to his attempts. After he gives up, beaten, Ellie simply lifts her skirt above her knee. The first car that passes stops, as we see extreme close-ups of a foot slamming down on the brakes and a hand applying the hand brake.<br><br>A master in his profession, Capra left his mark on the films he directed. With an almost childlike cheerfulness, he maintains a sense of dignity and class. The viewer is left with a feeling of hope for humankind, even if its only that a person's ideals could be used to make such a film. Capra's films are still regarded as masterpieces. It Happened One Night arguably remains to this day unparalleled in screwball comedies. It was one of many movies made during the Depression, a sometimes sad and even lonely time in our history. It gave its audience a chance to escape and forget their troubles for a few moments in time.<br><br>9 out of 10 stars","user":"comix-man","rank":[97,108]},{"title":"A fantastic Capra film.","rating":7,"date":"7 May 2003","review":"It Happened One Night directed by Frank Capra was made and released in 1934 by Columbia Pictures as a small budget film that was not expected to do well at the box office. Yet, after its release the film gained many accolades and won the Academy Award for best picture in 1934. Due to the original small nature of the film, the leading man role was surprisingly filled by Clark Gable who was on loan from another studio. He stared opposite of Claudette Colbert. Capra's film was a combination of many ideals, emotions and social perceptions of the American society of the thirties but it was also a combination of many new and innovative filming techniques and sound advancements. The film unfolds the story in such a attention-grabbing and remarkable way that most of today's cinema use his style and ideals when producing and creating films. Capra used the idea of a moving camera, one that was not fixed upon a box, but on a moveable crane instead. This produced more sweeping shots, more angles for filming and fewer distance shots. It allowed for more movement of the actors as well as a more realistic and real life feeling to the movie. The film also incorporates back projection of images. This is were a scene is filmed previously and played in the background while the actors perform the scene in front of the projection. Back projection is used for car scenes to give the impression that the actors are driving but in reality they are in a sound stage. Capra also incorporated the use of a wipe in his film. The technique of moving left to right and fading in or out to change a scene or show elapsed time took the place of the traditional place cards in silent films and allowed for a more constant stream for the film. The film was also all talk, the new technology of a sound strip on the side of the film was used. The text cards of silent films were completely discarded. Another camera trick by Capra is to show a change in feelings within Clark Gable's character for Claudette Colbert's character by depicting her character in a different light. This happens two times within the film at key moments to the development of their relationship. Claudette Colbert is seen in a close up of softer light to emphasize Clark Gable's character seeing her in a `different light.' In this romantic comedy Capra not only showed new styles and techniques but also addressed social issues of the time. Through comedy he showed the outlandish nature of the rich (King arriving for his own wedding in a helicopter) and the nature of man being the controller in relationships as well as in society. The fighting and struggles between the two main characters showed the man taking care of the woman, the social norms of how men and woman should act around each other in that era. But the fighting and the banter also show a strong-minded and intelligent woman. The two strong-willed main characters balanced each other out.<br><br>Capra's techniques for showing the social relationship between the rich and working classes as well as a relationship between man and woman in the 1930s captured film makers and film viewers for over 70 years. Films are now compared to his style of camera movement and his style of capturing the American ideals. When movies of today make a similar statement of achieving what one wants they are referred to as Capra-esc. Capra's imagination and style is one that changed the outlook of American films and introduced a new genre to film goers everywhere.","user":"emma502","rank":[110,126]}]