[{"title":"Familiar but enjoyable.","rating":6,"date":"28 July 2002","review":"Jim Brown, the personification of coolness, is the nightclub owner who decides to avenge his brother's murder and begins a war against the local Mafia. Familiar but enjoyable, thanks largely to Brown's presence, and to some dynamic action scenes. Two interesting things: the use of wide-angle lenses during a fight scene, and a strong supporting role for the actor who was memorable as one of the two homosexual goons in \"Diamonds Are Forever\". (**1/2)","user":"gridoon","rank":[6,6]},{"title":"Utterly dull","rating":4,"date":"26 June 2014","review":"Utterly dull blacksploitation that consists of a series of scenes that are boring and hysterically anti-white. The anti-honky messages are part of the game, but they don't add up at all, they get tedious after the first cliché of \"whites roughing up the blacks\". There's some 70's music and a few low-budget gun fights but it lacks any story or sense of urgency. <br><br>Features a few actors who are recognizable. Martin Landau as Capelli, Stephen McNally as Laurento, Bernie Casey as Seth, Gary Conway as Adams, Bruce Glover as Ray Kriley and Jim Brown as Gunn.<br><br>A few actors who are recognizable are also sports folks.","user":"osloj","rank":[5,5]},{"title":"Black Gunn could have reached a much higher level if the whole thing had been streamlined: shorter running time, more action.","rating":6,"date":"30 January 2013","review":"Tom (possibly Tim, not really sure) Gunn (Brown) is the coolest, smoothest club owner in town. All the hippest people are seen at his Gunn Club, the cleverness of the name alone surely drawing them in. While Gunn is content to run his business and be the life of the party, his brother Scottie Gunn (Jefferson Jr.) is involved with weightier issues. He joins a Black Panthers-style revolutionary organization known as BAG, or, the Black Action Group. It seems BAG has stolen some \"payoff books\" and money from the mob, notably Russ Capelli (Landau), who most people know as a used car salesman whose TV commercials show him as a trustworthy guy. When tragedy befalls Scottie, the elder Gunn must wage a one-man war against Capelli's gang. Will he ever get answers, with cops and politicians dogging his every move? Black Gunn is a typical example of the Blaxploitation of the time, so much so, it seems to be one of the main templates for parodies such as I'm Gonna Git You Sucka (1988), which also starred Bernie Casey, and Black Dynamite (2009). Jim Brown is beyond low-key as our hero Gunn. He whispers all his lines, but he always looks cool in his fly threads. He even makes bowties look stylish and not nerdy. Martin Landau should have been in the movie more, because Black Gunn as a whole needed a strong, central villain. He's more than capable of filling that role, but for most of the movie, we actually forgot Landau was on board! He kind of shows up, then goes away and shows back up at the end. Landau should have gotten more screen time.<br><br>Highlights include the funky soundtrack by Tony Osborne, the classic evil whiteys, its total lack of political correctness, including racial slurs you could never do today, and some cultural references: there are numerous allusions to Vietnam, and certain characters coming back from that conflict. Additionally, there's the line \"It'll make Watts look like a Saturday night in Disneyland!\" - indicating some of the tensions of the time. But the problem is the movie as a whole is too long and has too many extended, pointless scenes. Yes, it does have some gunplay and explosions, and maybe a few fights, but Black Gunn could have reached a much higher level if the whole thing had been streamlined: shorter running time, more action. Not that the movie is bad, really, but there's a bit too much fat. And the ending is lame.<br><br>Interestingly, and correct us if we're wrong here, but Black Gunn never received a VHS release during the Golden Age era of the video store, at least here in America. Its cult Blaxploitation status had to grow from other means, such as foreign releases, poster and film prints, and write-ups in such books as That's Blaxploitation! by Darius James and others. It did get a DVD release in the 00's, so stateside Blaxploitation fans could finally see it. The results...are mixed. It has a lot of things fans of the sub-genre love, but it's a bit bloated for its own good.<br><br>Fans of Blaxploitation, Jim Brown, Bernie Casey, and even the briefly seen Jeannie Bell (known for TNT Jackson, 1974), and even Luciana Paluzzi will want to check out Black Gunn. Casual viewers might not be as into it. After all, as great as Martin Landau is, as a Blaxploitation baddie, he's no Monroe Feather.<br><br>For more action insanity, drop by: www.comeuppancereviews.com","user":"tarbosh22000","rank":[4,4]}]