[{"title":"This movie saved my life","rating":10,"date":"8 October 2004","review":"I was 16 years old in 1984 when I first saw this movie. I was also clinically depressed and suicidal. I had been on antidepressants for about a year (in the pre-prozac days) and I happened to see this movie on Showtime or HBO - almost by accident. Timothy Hutton perfectly captures what it's like to be depressed as a teenager. And Judd Hirsch and Hutton perfectly capture the patient/therapist relationship. There are also a few perfect little scenes that capture the problems of a family that can't communicate. Especially memorable is the scene where Calvin tells Beth about the shoes he wore to Buck's funeral. This film captures all of the important moments like this that truly demonstrate the problems the family is having. After seeing it, I read the book and I knew that if Conrad could go on, so could I. I watch this movie once every few years. It really means a lot to me.","user":"will1410","rank":[307,327]},{"title":"One of the finest and most true to life movies ever","rating":10,"date":"6 February 2006","review":"I might consider putting this movie in my top 10 list of best movies. It's absolutely amazing that for his directorial debut, Robert Redford created such a masterpiece. Now it was not all due to him, as the story was so well-written and the acting is dead on for all the characters. Part of the reason I love it so much might be because I was a psychotherapist before becoming a school teacher (mid-life crisis, you know). And, having worked with dysfunctional families, this movie gets it right time and time again. Therapy is not a miracle cure that takes effect almost immediately (like in GOOD WILL HUNTING) and the parents BOTH have a strong role in keeping the family sickness alive. Donald Sutherland is the enabler who denies there is a problem--even after one son dies by accident and the other attempts suicide. He also cannot face that the family's dysfunction is mostly controlled and maintained by his very disturbed wife, played wonderfully by Mary Tyler Moore. She is not mentally ill but has a very sick personality, as she is cold as ice emotionally and deals with problems through massive amounts of denial as well as stuffing her anger WAY down deep. Timothy Hutton is, despite his being the patient, the healthiest one in the family, as his suicide attempt is a strong cry for help. Finally, Judd Hirsch plays the therapist--and one of the most realistically portrayed therapists on film. He has no miracle cure but tries his best to get Hutton, and later Sutherland, to work hard at uncovering their dysfunction. Again and again and again, the viewer is rewarded by a brutally honest script that is about people who would be real--not Hollywood's idea of \"people\". The film is neither manipulative nor condescending--this is the way more films SHOULD be.<br><br>In addition, as I have watched the film several times, I keep noticing just how perfect the direction was. How wonderfully framed the shots were, how wonderfully the music fit in and how unflinching the movie dealt with pain. In particular, I love the scene with Sutherland at the psychiatrist's office as he talks about his marriage....and his eyes keep looking away and avoiding the doctor as he says how much he loves her. And the great Christmas photo scene--it just screams out \"this is real!!\". For this to be Robert Redford's directorial debut is absolutely amazing and he surely earned that Best Director Oscar.<br><br>FYI--although this movie is rated R, it is only for language. There are a few REALLY CHOICE WORDS used here and there, but otherwise this is a great movie for teens. If filmed today, this would no doubt be a PG-13 film. I am a very conservative parent, and yet I found this to be totally acceptable for my 15 year-old. It's a great film to watch WITH your kids and discuss what you see.<br><br>I cannot recommend a film more highly.","user":"MartinHafer","rank":[70,74]},{"title":"Great Family Drama","rating":10,"date":"20 July 2005","review":"This is a powerful directing debut from Robert Redford, a great family drama that goes every which way but down. By the end, our thoughts have been altered a bit and its a film that leaves you thinking.<br><br>Conrad, played brilliantly by Timothy Hutton in an Oscar winning role, is the depressed suicidal son of a couple struggling to cope with their son's drowning death. Conrad of course feels responsible, and has already tried to take his own life once before.<br><br>Reluctantly, he begins to see a shrink at the advice of his father. Dr. Berger, also played brilliantly by Judd Hirsch {though there are no slouches in the cast}, helps Conrad through thick and thin. By the end of the movie, the audience truly feels for all characters to some degree.<br><br>As has been stated, the acting is magnificent. The story may seem simple but this type of film really doesn't need a heavy plot. Its an excellent look at the problems we all face. When I first saw this at a young age I related completely to Conrad's character. When I saw this tonight, I related more to the adults and could really feel for them a lot more than I remembered. Each character has a unique sense of reality to them. The actors really carry the film, making the characters seem like real people we've known for years.<br><br>Unfortunately this movie has received somewhat of a bad reputation over the years as the film that beat Raging Bull in 1980 for the Best Picture and Director Oscars. While both movies are excellent, its sad that one has to be better than the other and people just don't enjoy both movies for what they are. Many people have preconceived opinions about this 'small' film they have not heard of. After all, Raging Bull is an all time classic. Just watch this movie with an open mind, because it really works on every level as a powerful family drama detailing the persona of many different types of people.","user":"qdude440","rank":[82,91]}]