[{"title":"\"She Plays Chopin Delightfully\"","rating":21,"date":"21 November 2001","review":"A wealthy man dies leaving a huge treasure in his personal tomb with seven interlocking doors and keys to be used to get into the tomb after a period of time after his death.  Chamber of Horrors tells the story of avarice, murder, and intrigue that happens as a result of this tomb and treasure. This is a fun film with lots of suspense, classic hokey comedy, and some stellar character acting.  The evil guy, named Dr. Manetta, needs one more key in order to get the treasure, and one Lili Palmer stands in his way as the real heiress to the fortune and possessor of the last key.  Dr. Manetta dresses in capes, has a great aristocratic \"foreign\" accent, has a trained monkey perch on his shoulder and follow him on a leash, and collects horrific hardware, devices used for torture.  He utters great one-liners left and right, saying to his henchmen about the shame in killing the young heiress,\"She played Chopin delightfully.\"  The actor playing this role in none other than Leslie Banks, General Zaroff from The Most Dangerous game. He is in just as fine form here and really breathes what life this film has in gale strength.  Banks puts on an acting seminar as he waltzes through this role of sadism and wit.  The other actors are all capable and seem to have some talent.  The torture room is very impressive.  A neat little, seldom seen film.  Try it as a second feature after The Most Dangerous Game. Every time I watch Banks I wish he had done more films.  He is just incredibly good at playing incredibly bad men!","user":"BaronBl00d","rank":[11,13]},{"title":"The mystery of the Door with Seven Locks","rating":7,"date":"5 December 2005","review":"Chamber of Horrors is an entertaining British horror/mystery from 1940. I have the VCI edition of this on video which I had ordered from the US.<br><br>A series of murders at a creepy mansion are connected to the secret of a door which has seven keys to it and nobody has opened for a while. A young woman tries to solve this mystery and all is revealed towards the end when the door is opened... Includes a mute butler and a mad doctor who collects items used for torture. Also a thunderstorm.<br><br>Though not a lot of action in this movie, it is quite creepy and atmospheric at times.<br><br>The cast includes Leslie Banks (The Most Dangerous Game, The Tunnel) and Lilli Palmer.<br><br>Chamber of Horrors is worth a look if you get the chance. A good old mystery.<br><br>Rating: 3 stars out of 5.","user":"chris_gaskin123","rank":[9,11]},{"title":"Don't Lock Up the Cows for This One... ;=8)","rating":6,"date":"13 June 2000","review":"\"The Door with 7 Locks\", aka \"The Chamber of Horrors\", is a mildly entertaining, quaint little English mystery from the early 40's.  An eccentric old coot passes away, leaving his deformed son as heir to an estate, but locks up the family jewels in his tomb, cowplete with a door with 7 locks.  Various family members/servants/gawkers try to embezzle the loot and get away with murder.  Lovely snugglebunny Lilli Palmer, fresh from Canada, comes to make her claim on the loot, along with buddy Romilly Lunge from Scotland Yard.  The evil Dr. Manetta, his pet monkey, and his mute Spanish servant almoost rule the day!  Manetta has ancestors from the Spanish Inquisition(Nooooobody expects...), and he cowlects grisly little torture devices and poisoned chalices.  This is a fun little flick, despite the cliches - Manetta dresses like Fu Manchu on downers, the plot twists are obvious, and the characters seldom rise above 2 dimentional. Still, the film is brisk, the cinematography excellent, and the setting and mood are cowvincing enough to forgive these udder oversights.  Snuggly Lilli Palmer only worked in 6 decades-worth of moovie making, had her own tv show in the 50's, twice, and even married Rex Harrison.  The MooCow says this dusty old flick deserves moore attention; find it and rent it soon! ;=8)","user":"MooCowMo","rank":[10,14]}]