[{"title":"Enduring Fifties Western.","rating":7,"date":"18 January 2011","review":"Another cracker of a fifties western is Columbia Picture's THE VIOLENT MEN (aka \"Rough Company\"). Produced by Louis J. Rachmil for the studio in 1955 this enjoyable oater regrettably seems somewhat forgotten in these days of sparse western productions. It is a pity really for it is quite an absorbing colourful western tale directed with a genuine flair by Rudolph Mate and boasting an all star cast in Glenn Ford, Edward G. Robinson, Barbara Stanwyck and Brian Keith. With splendid production values it even has a score by the legendary Max Steiner who was borrowed from Warner Brothers. This was the second score the formidable composer wrote for a Columbia picture after his great success the previous year with \"The Caine Mutiny\" (1954). From a novel by Donald Hamilton THE VIOLENT MEN was well written for the screen by Harry Kleiner and beautifully photographed in Cinemascope and colour by W.H. Green and Burnett Guffey.<br><br>A recuperating Civil War veteran John Parrish (Glenn Ford)- along with some other small ranchers - is running his holding in a valley dominated by the powerful Anchor Ranch owned by big land baron the crippled Lee Wilkinson (Edward G. Robinson) and his unfaithful wife Martha (Barbara Stanwyck). But Wilkinson wants all the ranches in the valley to be Anchor owned and his younger gunslinging brother Cole (Brian Keith) is riding roughshod over them and burning them out when they refuse to be bought. Wilkinson offers to buy out the Parrish place and when he refuses and one of his hands is killed by some Anchor riders he decides to fight Wilkinson. Before long a full scale range war begins culminating in the Anchor stock being stampeded, the Anchor ranch set alight and finally Parrish taking on Cole in an exciting fast draw shootout.<br><br>THE VIOLENT MEN is an action packed and handsome looking western. Performances are fine from all concerned. Ford is his usual likable unforced self, presenting his affable cowboy image with that familiar attractive casualness. He was only two years away from his greatest western role in \"3.Ten To Yuma\" (1957). Good too is Barbara Stanwyck as Wilkinson's scheming cheating wife. A part the actress played many times before in her busy career. But miscast is Edward G. Robinson! The great pint sized actor simply doesn't suit the part of the big rancher in a western. Watching him here you can't help but wonder if he was only brought on board the production to replace someone like Lee J. Cobb or Albert Dekker or perhaps Raymond Massey.<br><br>Holding the whole thing together is the splendid music of Max Steiner. As the credits unfold a jagged staccato statement from the orchestra is heard to emphasize the film's title before segueing into an attractive broad loping western melody. Later in a resplendent sequence this lovely theme is heard in full bloom when we see Ford riding (with characteristic crooked elbows) across some spectacular locations at Lone Pine and The Alabama Hills with what looks like Mount Whitney in the background. A captivating example of the beautiful combination of film and music. Steiner's score was conducted by Columbia Picture's conductor in residence Morris Stoloff. A rare occasion when the composer's music was conducted by someone else.<br><br>THE VIOLENT MEN is an enjoyable and memorable motion picture and a fine addition to the list of splendid westerns that were thankfully brought to us in the fifties.","user":"jpdoherty","rank":[34,38]},{"title":"Great movie stars, great scenery, satisfying B-movie.","rating":2,"date":"2 August 2004","review":"Caught this on TCM late last night.  Could not resist watching a film with Glenn Ford, Edward G. Robinson, Barbara Stanwyyck  Barbara is the attractive woman you love to hate and plays it to the hilt.  Edward G. Robinson is convincing as always as the villain-in-chief.  Glenn Ford always a pleasure to watch.  The scene in the saloon where Glenn Ford faces down the murdering henchman, surrounded by his cronies, is just what you want to see a reluctant hero do.  <br><br>But what caught my attention most was the scenery.  I am sure this is one of the 100 or more movies filmed in Lone Pine, California amidst the Alabama Hills* lying just north of town.  Rock formations provide the rugged scenery where over 100 cowboy movies have been filmed with every major cowboy movie star.  It was the setting for \"Bad Day at Black Rock\" with Spencer Tracy, Ernest Borgnine and Jack Palance.  Films were made here with John Wayne, Gene Autry, Roy Rogers, Hopalong Cassidy, and it was also the setting for, surprisingly, \"Gunga Din\".  With snow-capped Sierra Nevada peaks in the background, I tried but could not possibly identify Mount Whitney, at just under 15,000 feet, the highest point in the lower 48 USA states.<br><br>One reviewer above complains about the use of stock footage for the cattle stampede as well as for stampeding the (enemies') horses.  I just marvel at the motion picture arts that they could even create such scenes at all.  Did they pay some huge rancher to allow a cattle stampede??? That must have run off many pounds of expensive beef.  The horse stampede must likewise have been expensive.  If these were wild horses filmed at large, they sure did a skillful job intercutting the clips with the ranchers' corrals in the film.<br><br>All in all, a standard oater but with great movie stars, scenery and action, I enjoyed watching.  I think you will too.<br><br>(* Oh, yes.  The Alabama Hills. In California?  They were named during the Civil War by miners sympathetic to the Confederate cause.  If you should drive North on California State 395 en route perhaps to ski at Mammoth Mountain, spend a few minutes to detour through the Alabama Hills.   And take your camera!  You'll be glad you did. Well worth the time.)","user":"AndrePhilidor","rank":[33,41]},{"title":"Another Range War Western With Some Infidelity Thrown In","rating":7,"date":"17 April 2006","review":"This is yet another western about a greedy cattle baron looking to push out small ranchers and farmers. It's certainly all been done before and since. But The Violent Men is something special.<br><br>What makes it special is Barbara Stanwyck playing the role of vixen as she often did in her later films. She's married to the crippled Edward G. Robinson who's the cattle baron here, but Robinson is crippled and there is some hint that his injuries may have left him impotent. No matter to Barbara, whose needs are being met by her brother-in-law Brian Keith. That doesn't sit well with either Dianne Foster who is Robinson and Stanwyck's daughter, nor with Lita Milan who is Keith's Mexican girl friend.<br><br>The infidelity subplot almost takes over the film, but Glenn Ford as the stalwart small rancher who is a Civil War veteran come west for his health manages to hold his own here. He's every inch the quiet western hero who people make the mistake of pushing once too often. I almost expect those famous words from Wild Bill Elliott to come out of Ford's mouth, \"I'm a peaceable man.\" Would have been very applicable in The Vioilent Men.<br><br>The Fifties was the age of the adult western, themes were entering into horse operas that hadn't been explored before. The following year Glenn Ford would do another western, Jubal, one of his best which also explores infidelity as a plot component.<br><br>There's enough traditional western stuff in The Violent Men and plenty for those who are addicted to soap operas as well.","user":"bkoganbing","rank":[39,51]}]