[{"title":"\"Beyond the Valley of the Dolls/In a corner of the sky...\"","rating":8,"date":"8 May 2001","review":"One of the all-time great cult films, BVD is an energetic, imaginative parody of Valley of the Dolls and other such dippy Hollywood melodramas. Our three lusty, busty heroines are the members of an all-girl pop group. From one trailer: \"Dolly Read is Kelly, the singer. Cynthia Myers is Casey, the swinger. Marcia McBroom is Pet, the soul sister.\" Whoa! Anyway, our trio of sexy supervixens move out to Hollywood, get discovered immediately, and are thrown into a whirlpool of pill addiction, alcoholism, lesbianism, abortions, depression, double crosses, crippling injuries, lots of violence, and lots of sex. All of this is played with a deceptively straight face, with the wild comedy arising from the ludicrousness of the soap-opera situations. One particularly sudsy moment is even accompanied by swelling daytime-TV organ music! There are obvious jokes, which are spirited and very funny, and even some sly references to Valley of the Dolls (a character named Miriam, the Warwick Court Apartments). The ending has to be seen to be believed, and even then....<br><br>The acting is very good (though Dolly Read's natural British and fake American accents are openly battling throughout), with top prizes taken by John LaZar as freaked-out record mogul Z-Man and Edy Williams as voracious porno queen Ashley St. Ives. The women, sporting big hair and thick false eyelashes, are all incredibly beautiful, and Russ Meyer lovingly captures them in neon-bright color. The editing and camerawork are fast-paced and super-stylish, as usual with Meyer. The soundtrack is excellent.<br><br>A groovy, sexy, X-rated look at L.A. back when it was cool!<br><br>Trivia: The reason this X seems so mild is because it was intended for an R! Meyer did prepare a more explicit version, but when this tamer cut was X'd, Fox elected to distribute it instead of the racier print. The video box says NC-17 because Fox has a policy against never releasing an X-rated tape. Of course, an X in 1970 did mean 17 and over, whereas it now means 18 and over. HUGE chasm there!","user":"Vince-5","rank":[21,22]},{"title":"The ULTIMATE Cult Film...","rating":10,"date":"28 July 2006","review":"I first caught this film as a kid watching Cinemax about 15+ years ago, and BEYOND THE VALLEY OF THE DOLLS has had a strange hold on me ever since. I've seen it several times since that initial viewing, and still love it with each subsequent watch. I have to credit this as the first cult/exploit film that I remember ever having seen - and I've been a sleaze-junkie ever since. But what is there not to love in this Roger Ebert (writer)/Russ Meyer (director) collaboration? You've got a sexy girl band, a slutty porn-star, a freak-show gay/tranny socialite, a good bit of tits-n-ass, some lesbo action, decapitation, crazy 70's music...the list goes on and on...<br><br>The Kelly Affair are an up-and-coming three-piece girl-band who decide to make the trek out to L.A. to see if they can make it big in the music biz. They meet up with Shakespeare-quoting, uber-eccentric socialite, Ronnie \"Z-Man\" Barzell, who takes an interest in the girl's and their band. Changing the band-name to The Carrie Nations, Z-Man takes over most of the booking/producing duties for the band at the irritation of lead-singer Kelly's boyfriend. Things begin to go downhill when the band gets wrapped up in the typical sex/drugs/rock-n-roll entrapments and fakery of the Hollywood music scene. This culminates in a frenzied and insane ending that has little to do with the rest of the film, but sure is a blast to watch...<br><br>BEYOND THE VALLEY OF THE DOLLS is a strangely relevant tale of the pitfalls of fame and fortune. It's completely silly, often sleazy, and 100% bizarre - but the film's \"point\" can't be missed nor denied. The performances in the film are all great in their own 70's low-budget Russ Meyer way - including the way Kelly's accent switches from British to American on the fly. There's really nothing about this film that I don't like. It's extremely entertaining, there's enough big titted women to keep you \"occupied\" (what else would you expect from a Meyer film???), and the storyline (as truly bizarre as it is at times) is quite strong and well written. If you consider yourself a cult/exploit fan and haven't seen this one, then you are TRULY missing out - and now there's no excuse as it has recently been released (finally!) on DVD. Honestly one of my favorite films and highly recommended...10/10","user":"EVOL666","rank":[11,11]},{"title":"this film has it all!","rating":10,"date":"20 March 2006","review":"I freakin love this film! It has everything you could want, hot amazons, camp, melodrama, dancing, cool music, orgies, and some classic lines. Either you get it or you don't, even though the script makes no sense. Z man is awesome and creepy, ashley st ives is on fire, and the carrie nations rock in that dopey pill popping late 60's acid pop style. The question is why has russ meyer never released it on DVD? Come on dude this and faster pussycat kill kill are films that the people need to see. A cut above 90% of the Hollywood recycled crap and remade TV junk they throw at you. To be honest if someone remade this flick I would see it. I also love the fact that they completely went in the opposite direction of the original, which I cant even remember if i have seen.","user":"bminor9","rank":[30,35]}]