[{"title":"What were they thinking?","rating":3,"date":"30 April 2013","review":"Direct from the What Were They Thinking files comes this bloated pageant of staggeringly foolish proportions. All about getting a cannon through battles and assorted other nonsensical issues this overripe piece of twaddle has a few things in its favor, nice scenery and beautiful color photography. They are outweighed however by the inert direction of the usually competent Kramer and even more by the complete miscasting of the principle actors. Sophia is gorgeous and was just starting in American films so her being shoved into whatever was available at the moment no matter how unsuitable can at least explain her presence here. Cary Grant who would seem a natural in period films actually looks rather absurd and is stiff as a board, he apparently felt the same way and after this often referred to this film with mocking scorn. He and Sophia, who became involved during the making of this stinker, would be much more properly and happily paired the next year in Houseboat a delightful comedy which is the place to see them together, not here. Worst of all is Frank Sinatra preposterously cast as a Spanish freedom fighter with both an atrocious accent and wig. He is simply dreadful. Worth watching only to see how an A level film with major stars and a respected director can go wrong in pretty much every aspect.","user":"jjnxn-1","rank":[24,25]},{"title":"You may fire when ready Cary!","rating":6,"date":"14 January 2005","review":"During the Napoleonic Wars, British naval captain Cary Grant and Spanish freedom fighters Sophia Loren, Frank Sinatra and a real cast of thousands try to keep an enormous cannon from the evil French occupiers. Lots of impressive scenes with hundreds and sometimes thousands of extras and lots of mules and rope to pull that gun over the countryside with the French Army in hot pursuit. The movie is visually impressive; a knife fight amongst windmills, great battle sequences, large epic shots of hundreds and thousands of people all set against the beautiful Spanish landscape (where the movie was filmed). The problem is the actors. Grant is the best, but too stoic; Loren is beautiful, but too fey; and Sinatra is just miscast, his Spanish accent awful and totally unbelievable as the passionate Loren's love interest. Worth watching for the spectacle and the great scenes and scenery, but the personal soap opera between Cary, Frank and Loren puts a damper on the fun. I wish another actor had played Miguel, Sinatra's character - how about Anthony Quinn, Ricardo Montalban, Fernando Lamas, or even mature character actors like Cesar Romero or Gilbert Roland? I could never believe Sophia was interested in Frank.","user":"lwetzel","rank":[23,27]},{"title":"Giant Cannon in Historic Misfire...","rating":4,"date":"4 November 2003","review":"Stanley Kramer's second directorial effort,THE PRIDE AND THE PASSION, gave him his first opportunity to create an epic, involving a cast of thousands against a backdrop of 19th century Spain. A tale of heroism, dogged determination, and sacrifice, the production reunited him with NOT AS A STRANGER co-star Frank Sinatra, along with international sex symbol Sophia Loren and screen legend Cary Grant. The three leads were to provide a romantic triangle that would add a 'human' element to the story of a massive cannon's journey to crush the 'impregnable' walls of French-occupied Avila. It was an ambitious endeavor for veteran producer Kramer, as his directorial debut, NOT AS A STRANGER, had been panned as nothing more than a glorified soap opera, criticized by reviewers for the miscasting of Robert Mitchum in the lead.<br><br>Miscasting would be a major criticism of this production, as well...along with the ponderous, overlong plot, occasionally sappy dialog, and lack of believability in the romance between the leads.<br><br>If only Kramer had filmed the action occurring 'off the set', which was FAR more spectacular...<br><br>Frank Sinatra had taken the role of the guerilla fighter, Miguel, simply to be close to his estranged wife, Ava Gardner, who was also in Spain, filming THE SUN ALSO RISES. He was well aware that his attempts at a Spanish accent would be the butt of many jokes, and he disliked the tedious production, anyway, especially as his co-star, Cary Grant, preferred multiple 'takes' of each scene (Sinatra was a 'one-take' actor, who believed in 'saying it all', the first time). As the production dragged on, with the movement of thousands of extras creating long waits between set-ups, Sinatra grew increasingly surly, and would often disappear to be at Gardner's side.<br><br>Cary Grant, at 53, coming off the classic AN AFFAIR TO REMEMBER, hated 'period' pictures and costumes, but was grateful to be away from America and his crumbling marriage to Betsy Drake. He was lonely and unhappy, however...a situation that would change dramatically, as he got to know Sophia Loren. The voluptuous 23-year old Italian actress, who had just exploded onto American screens in BOY ON A DOLPHIN (standing in trenches to accommodate her much shorter co-star, Alan Ladd), was earthy, passionate, and single, although romantically involved with director Carlo Ponti, the man who 'discovered' her, for several years. But Ponti was in Italy, had refused, as yet, to marry her, and Loren was working with an actor she had idolized since childhood...and the pair were soon having a tempestuous affair off-camera, as Grant fell madly in love with his young co-star. He proclaimed that he would marry Loren, as soon as filming was completed, and he could get Drake to file for divorce.<br><br>The announcement did NOT sit well with Carlo Ponti, who arrived as filming wrapped, acknowledged to Loren that he loved her, and wanted to marry. The actress contemplated both proposals, finally choosing Ponti, as she knew the depth of his feelings, and was well-aware of Grant's lousy track record as a husband.<br><br>Ponti married Loren in Mexico (and, in a bit of irony, was accused, five years later, of bigamy, as it turned out he was still married to another woman, at the time!), and Grant, heartbroken, would end up making a romantic comedy (complete with a wedding scene) with Loren, a year later, in their next film together, HOUSEBOAT. <br><br>The firings of the giant cannon at the climax of THE PRIDE AND THE PASSION couldn't match the explosiveness behind the scenes!","user":"cariart","rank":[37,52]}]