[{"title":"Ooh La La","rating":7,"date":"31 March 2018","review":"'My Father Was Right' has a somewhat different feel to the other films I've seen from Sacha Guitry - the wit is still there but wrapped around real-world sadness and heartbreak, adding an emotional weight I've not seen in his films before, most prominently in the center of the film, where the now old man is visited by the wife who once betrayed and abandoned him. It's a beautifully maintained scene, both funny and sincere in its pain, and Guitry himself is flawless in it.<br><br>Most of Guitry's films are patchy, and this one is no exception, but this additional dimension raises it above many of the rest.","user":"Fiahm","rank":[4,4]},{"title":"It's all in the delivery of the lines - at the speed of light","rating":7,"date":"14 February 2015","review":"I watched this movie again the other evening, and then watched a 2008 Parisian theater production of the original play (at the Théâtre Edward VII). An interesting contrast.<br><br>Guitry delivers his lines at the speed of light, with a precision that often comes off as angry. The 30-year-old father in the 2008 version is far kinder in Act I.<br><br>But in Act II, the confrontation between the now 50-year-old main character and his wife, who left him 20 years before and now wants him to take her back, to give her \"her place\" in his household again, the give and take between his anger and her completely immoral manipulation of abstractions like \"honor\" and \"fidelity\" is remarkable in the 1930s original, and rather pitiful in the 2008 version. In the 2008 version, the wife comes off as an air-head. In the 1930s version, she is a bright woman acting out a role she has clearly rehearsed carefully. The speed with which Guitry delivers his lines at her makes them resemble ammunition.<br><br>There are parts of this 1930s movie that are, I suppose, weaker than others. But seeing Guitry when angry using language as a weapon with which to shoot down his adversary is rather impressive. You'd have to speak French well to appreciate it, though. If you need subtitles, you'd miss the effect entirely.","user":"richard-1787","rank":[3,3]},{"title":"Trust your dad .","rating":17,"date":"17 November 2010","review":"Based ,like all the Guitry movies of the era, on one of the playwright's work ,\"Mon Père Avait Raison\" ,despite moments of unquestionable brilliance,is a desultory even a bit confusing work.One sees little of the writer's genius which produces such classics as \"LES Perles De LA Couronne\" or \"La Vie D'Un Honnête Homme\" .<br><br>The scene between Guitry and his father already shows,in 1936,the fear of getting old (which would be even more obvious in such works as \"Debureau\" or even the Maintenon/Louis XIV scenes in \"Si Versailles M'Etait Conté\" ) and of dying ;the father revealing he tells all the people around he is older than he really is ,it's a scene which is not anodyne but is more a way of deceiving death (later the search for immortality would be a permanent feature in the director's works)than interest in his appearance.<br><br>Another remarkable scene shows Guitry's unfaithful wife who succeeds in proving him she has always been faithful (for she was true to her lover till he died), Reductio Ad Absurdum,one of Guitry's forte.<br><br>Father may be right ,father knows best ,but father is going to die ,so Carpe Diem!It's a happy end ,provided you don't know Guitry's later works.","user":"dbdumonteil","rank":[5,6]}]