[{"title":"What a pile-up....","rating":6,"date":"15 August 1999","review":"If you're looking for a movie loaded with cars, crashes, 1/8th of the Rat Pack, Adrienne Barbeau's best assets... oh yeah, and Burt Reynolds, look no further than \"The Cannonball Run\".<br><br>It was a hit back in 1981 and no wonder: Burt was on top of his game and we were all young and naive back then.  Heck, I have a warm spot for all the rampant stupidity, myself.<br><br>All the better that Roger Moore plays a deft parody of his own James Bond persona, complete with an Aston Martin.  <br><br>If you've seen this film way back when, no doubt you remember it with some fondness.  Let's face it: it may not have been on par with films like \"The Gumball Rally\" or even \"Death Race 2000\", but in its own way and on its own terms, it works just fine.<br><br>A word of sage advice: if you watch this film, skip \"Cannonball Run 2\". It'll only ruin your good memories of the first.  And if you didn't like the original, well....<br><br>Five stars.  Plus one star extra for adding Jackie Chan for what adds up to mostly as a cameo as a karate-kicking racer.  And a half star more for Adrienne Barbeau's fancy work with a jump suit zipper.  Altogether, six and a half stars.<br><br>Wish she would have made it a seven.","user":"Mister-6","rank":[54,67]},{"title":"one of my all-time favourites!!!!!!!","rating":10,"date":"4 February 2006","review":"Okay, realistically speaking, it is not \"excellent\" in the grand scope of cinema history...It has virtually no plot, for example. But it's hysterically funny and just makes you feel happy all over. Could it be Sammy Davis Junior and Dean Martin paired as drunken priests in a red Ferrari that makes it so great? Is it the doctor of mysterious origin (\"Don't you EVER tell me where you found him!\" who seldom needs more than his middle finger for an examination? Perhaps it's Mr Uh, Mr Uh,...Foyt! No, the greatest reason for watching this film is for the sheer joy of experiencing Dom Deluise in orange spandex saving the world...and don't forget! \"Hamsters are a big responsibility!\"","user":"gotfong","rank":[24,28]},{"title":"Burt & Company In Their Element","rating":6,"date":"25 April 2006","review":"Burt Reynolds made a fortune in this area with these goofy \"chase\" movies (this and Smoky and The Bandit plus all the sequels). They featured a an irreverent '70s attitude toward about anything decent with an emphasis on a sleazy atmosphere, all covered up with a lot of humor, and they worked. They worked because they were fast-moving generally fun movies to watch.....certainly not any great works of art. <br><br>Cannonball Run had an all-star cast of Reynolds, his good buddy Dom DeLuise, Farah Fawcettt, Jack Elan, Roger Moore, Dean Martin, Sammy Davis Jr., Adrienne Barbeau, Jamie Farr, Jackie Chan, on and on....pretty amazing. <br><br>Reynolds, of course, was Mr. Cool/Mr. Macho.....at least in his eyes. Fawcett and Barbeau meant beauty and boobs whom all men - especially dimwitted cops which Hollywood loved to feature - drooled over. The Japanese were made to look stupid (this was pre-PC days) as were priests (nothing's changed there with filmmakers). The movie is filled with really profound statements such as, \"Why do we take all these risks? Oh, just for the hell of it.\" Yes, words to live by.<br><br>Yet, as dumb as this movie can be at times, is does provide a lot of laughs and speaking of that, DeLuise's laugh always made everyone do the same. Sometimes the best part of these films were the outtakes at the end with DeLuise cracking up and Reynolds slapping him!","user":"ccthemovieman-1","rank":[29,35]}]