[{"title":"Sally Field on the glory road","rating":7,"date":"21 January 2001","review":"There's nothing more exciting than seeing a slick Hollywood player like Sally Field getting down-and-dirty like she does in \"Back Roads\". At one point, she and her two male pals (Tommy Lee Jones and David Keith) are at a county fair and have no money. No problem! Sally fixes her hair and says to the guys, \"Don't wait up.\" She knows how to make money (with her body) and nonchalantly sets out to do it. She's proving nothing to no one--it's second-nature to her--and when Keith calls her a 'whore' she tells him, \"A whore is a sixteen-year-old with a bad reputation. I...am...a...hustler!\" There are many moments to cherish in this rough jewel: Field standing outside the school where the little boy she gave up for adoption attends, running into his angry mother; Field writing a letter to the same child, telling him how sorry she is; Jones and Field getting off their bus after a fight and going their separate ways, each trudging down two dusty streets. It's a top-notch road comedy with Field and Jones overcoming the obvious sentimentality of the overall conception and making a memorable duo. *** from ****","user":"moonspinner55","rank":[19,21]},{"title":"Good road movie","rating":7,"date":"21 October 2015","review":"Good road movie and pretty emotion provoking. There are so many involving moments where you may sympathize the characters or feel sad about them, feel their situation and live it with them. The story may lack direction or logically complete end but nevertheless it's worth watching for the warmth of the characters' relations, the sensual way they stick together. If you can enjoy movies without judging them too strictly and without expecting anything stunning or extraordinary and just want to spend time following the way and sharing troubles with the characters, this movie might be for you. I rate this movie for the warmth that is expressed by the protagonists","user":"igorfado","rank":[8,8]},{"title":"Interesting movie about two marginal people","rating":4,"date":"4 April 2001","review":"This little film has hooker Sally Field and drifter Tommy Lee Jones hitting the road together when Jones ruins Field's chances for, ahem, gainful employment in the one-horse Southern town where she lives after he decks a cop who tries to bust her. Along the way the two encounter various predicaments and characters, as well as revealing parts of their pasts. Fascinating study that gives two people on the fringe of society faces and intriguing stories. Keep an eye peeled for Nell Carter as a pistol-packin' waitress. Not a bad way to pass the time.","user":"thomandybish","rank":[13,15]}]