[{"title":"Nice mix of genres","rating":10,"date":"19 April 2004","review":"\"What is admirable on the large scale is monstrous on the small.\"<br><br>It's Agatha Christie meets \"The Battle of the Bulge\" meets... oh you get the picture. Great cast lead by the always fabulous Peter O'Toole who delivers a memorable performance as General Tanz. Also nice to see French veteran actor Philippe Noiret in an ensemble that includes Omar Sharif, Tom Courtenay, Donald Pleasence and Christopher Plummer.<br><br>It is tense all the way mostly thanks to the great use of  first Warsaw (and the atrocities performed there) as a backdrop for the story and then we move to Paris where the plot to kill Hitler is nicely interwoven.<br><br>\"The Night of the Generals\" is at parts predictable, yes, (with the great exception of Omar Sharif's final scene) but I guess that's also what makes it kinda' enjoyable at times - at least in the very last scene - when you know what's coming (and boy does it feel good).<br><br>Some may find it a bit tedious and yes it is long, but when it was over I knew I would definitely see it again sometime in the future so in short: it works! If you think this movie is your cup of tea, based on the IMDb-information, you're probably right.<br><br>8/10","user":"Renaldo Matlin","rank":[55,62]},{"title":"Well made movie that combines murder mystery and war.","rating":10,"date":"15 May 2004","review":"An overlooked little gem that gets better with each viewing. Murder mystery set in the German Army during World War II, involving 3 generals who are suspects. Entire cast in good form; fine ensemble acting. Peter O'Toole in top form as a fanatical SS general suspected in the murders. Donald Pleasence and Charles Gray portray the other 2 generals with secrets to hide. Omar Sharif does an excellent job as the Army colonel investigating. Film set in both 1942 occupied Poland, and 1944 occupied Paris. Also neatly ties in the July, 1944 plot to assassinate Hitler, with a cameo appearance by Christopher Plummer as Field Marshal Rommel. Recreates the actual bombing of Hitler's headquarters, and the efforts by the Paris generals to unseat the SS and Gestapo. Highly recommended viewing.","user":"douglasadcom","rank":[58,66]},{"title":"An Excellent and Very Underrated European Super Production","rating":9,"date":"28 January 2004","review":"In 1942, in Warsaw, a Polish prostitute is murdered in a sadistic way. Major Grau (Omar Sharif), a man from German Intelligence that believes in justice, is in charge of the investigation. An eyewitness saw a German general leaving the building after a scream of the victim. A further investigation shows that three generals do not have any alibi for that night: General Tanz (Peter O'Toole), Maj. Gen. Klus Kahlenberge (Donald Pleasance) and General von Seidlitz-Gabler  (Charles Gray). They three avoid a direct contact with Major Grau and become potential suspects. As far as Major Grau gets close to them, he is promoted and sent to Paris.<br><br>In 1944, in Paris, this quartet is reunited and Major Grau continues his investigation. Meanwhile, a plan for killing Hitler is plotted by his high command; a romance between Ulrike von Seydlitz-Gabler (Joanna Pettet) and Lance Cpl. Kurt Hartmann (Tom Courtenay) is happening and Insp. Morand (Phillipe Noiret) is helping Major Grau in his investigation.<br><br>\nThe story ends in 1965, in Hamburg, with another similar crime.<br><br>The first time I watched this film, I was a teenager and I recall that I left the movie theater very impressed. Two days ago, a friend of mine saw this movie again and sent me an e-mail. I decided to watch it again, on VHS, since it has not been released on DVD in Brazil. This movie is really an excellent and very underrated European super production, having a spectacular international cast. Peter O'Toole and Omar Sharif, from `Lawrence of Arabia', have another outstanding performance working together, highlighting the role of Peter O'Toole as a deranged man. It is amazing how Omar Sharif was a great actor in the 1960's. The story has war, mystery, crime, romance, drama and thriller, in right doses. Further, the character of Omar Sharif, as an ethic man who believes and pursues justice, no matter the price, is exciting.  The reconstitution of the period is also fantastic, specially the scene of the madness of General Tanz in a block of Warsaw, when he burns and destroys many buildings. My vote is nine.<br><br>Title (Brazil): `A Noite Dos Generais' (`The Night of the Generals')","user":"claudio_carvalho","rank":[66,77]}]