[{"title":"A beautiful movie.","rating":10,"date":"2 October 2001","review":"In my opinion, \"Night on the Galactic Railroad\" is an outstanding piece of animation.<br><br> Many reviewers will note, and accurately so, that this movie is both heavy and slow  as melted gold.  It's true: in our current world of sound bites and media clips, fast  action and short attention, this movie stands alone. This is especially so when the  movie is compared to other anime, a category under which fall some of the fastest  and slickest movies in the world.  If nothing else, \"Night on the Galactic Railroad\"  gets points for sheer originality and ingenuity.<br><br> Gisaburo Sugii (the director) has taken Kenji Miyazawa's children's story and  created for it a living atmosphere.  While highly detailed backgrounds are nothing  new for anime, \"Night on the Galactic Railroad\" combines its finely crafted images  with a brilliant use of frame shots, pacing, and audio montage to create a surreal  and ethereal viewing experience.<br><br> While often advertised as a children's movie, \"Night on the Galactic Railroad\" most  certainly does not tell a very light story.  With both religious and nihilistic imagery,  Sugii presents us with a powerful treatise on death and life.  However, even if you  do not appreciate the story itself, the beauty in the dream-like artwork and animation cannot be denied.<br><br> If this is the kind of movie that you'd just as soon sleep through, then you're  missing out on some amazing cinema.  Admittedly, most people these days would  probably rather numb their brains in front of the \"Tomb Raider\" movie, than sit  through the likes of \"Don't Look Now\" or \"Blow Up.\"  But, who knows....<br><br> If you want to be pulled into a beautifully crafted and mesmerizing world, then  watch \"Night on the Galactic Railroad.\"","user":"hellequin","rank":[27,30]},{"title":"Night on the Galactic Railroad is amazing piece of mind bending cinematic work.","rating":10,"date":"15 January 2002","review":"This by far is the best anime I have ever seen. With its slow moving and oft disturbing plot this is not a movie for everyone, especial the adolescent/short attention span types who have only seen slasher/action examples of anime.<br><br>This movie is so slow yet it sucks you in and you can't stop watching. I have never heard or seen anything like it and I don't think I ever will again. No movie I have ever seen has affected me half as much. Its amazing visuals, sounds and eerie plot make this fascinating movie hard to describe and do justice to it.<br><br>This movie definitely deserves a 10 out of 10.<br><br>P.S. If you are the crying type have tissues handy.","user":"has_no_pseudonym","rank":[16,18]},{"title":"Slow, Cryptic, Beautiful","rating":10,"date":"26 January 2002","review":"The first time I watched this movie I had to see it in two parts because my friend got sick of it after the first half.  This movie is definitely not for everyone.  The pacing is extremely slow and thoughtful.  If your not the sort of person who spends time contemplating the mysteries of life, you will not enjoy this movie.  If you watch this movie, don't watch it by yourself. Find a friend who you think might enjoy it, and set aside a quite relaxed evening to watch it.  You will want someone to talk it over with afterwards.<br><br>One thing that must be noted is the character design.  You may be initially turned off by the extremely cute, childish-looking characters. It doesn't take long to realize that the film is much darker and deeper than it seems at first.<br><br>Something to think about when viewing this film: It's interesting to see the strong use of Christian imagery in this film. I can't help but feel that as a westerner I'm getting a different reaction than the primarily Buddhist original audience and perhaps losing a bit of the mysticism.<br><br>I would suggest this film to anyone who enjoys spending a quiet evening lost in thought.","user":"Robotic_Castro","rank":[16,19]}]