[{"title":"An enormous box office hit...","rating":8,"date":"3 December 1999","review":"This pleasant comedy-romance opens with the beautiful view of the Fountain of Trevi in Rome, combined by another famous fountain garden at the villa d'Este in Tivoli where a great water organ exploits another attribute of moving water: its sound...<br><br>But in \"Three Coins in the Fountain,\" the 'sound of music' is the fine title song - sung by Frank Sinatra - that carries the whole picture...<br><br>The film is about the search for love by a simple trio... Three American secretaries believing in love, and throwing their coins in the 'Fontana Di Trevi' for a wish, for a romance, for an idealized love...<br><br>The first person is Dorothy McGuire, the confidant secretary in love (since 25 years) with her elderly boss, the American writer Clifton Webb...<br><br>The second is Jean Peters, a pretty indecisive brunette, doubtful in seeking love in Italy with Rossano Brazzi...<br><br>The third, a decisive Maggie McNamara aspiring to catch a wealthy suspicious lover (Louis Jourdan) by the art of lying...<br><br>Webb, Jourdan and Brazzi bring to the production its significant flavor... The film, nominated for Best Picture, won two Academy Awards for Best Cinematography and Music Song...<br><br>With a stunning photography in CinemaScope and sumptuous Technicolor of Rome and Venice, the motion picture is in itself a thin entertainment, but the title song carried it...","user":"Nazi_Fighter_David","rank":[38,43]},{"title":"Fountains and magic","rating":10,"date":"1 August 2008","review":"Lighten up, boys and girls! You must allow the director to display irony and fun in a feel-good movie in Rome not long after the fall of fascism! And how exotic it must have appeared to most of the world's population who at that time had not travelled abroad.<br><br>It does make you wonder how those secretaries could afford those glamorous clothes, and be so close to princes and movers and shakers of post-war Rome. Perhaps a gentle poke at role reversal?<br><br>One of the best tunes ever written, wonderful locations, and I don't care a damn about the Trevi fountain behaving inconsistently - that is the nature of fountains, and in Rome they are all drenched in magic!","user":"val-mainwood","rank":[27,31]},{"title":"Rome, the eternal city of love","rating":8,"date":"15 March 2005","review":"By the Fifties, the movie-going public was no longer satisfied with studio versions of far away places. They wanted to see the real thing and Hollywood had to give it to them. The year before Three Coins In a Fountain came out, Paramount had done another Rome based film in Roman Holiday. Though it had that winning romantic team of Audrey Hepburn and Gregory Peck, Paramount played it on the cheap and wouldn't splurge for color.<br><br>Not to be outdone by rivals, Darryl F. Zanuck went whole hog on terrific color cinematography and three romances. Dorothy McGuire, Jean Peters, and Maggie McNamara are three Americans sharing an apartment in Rome. Peters and McNamara work for a U.S. government agency and McGuire is secretary to expatriate novelist Clifton Webb. <br><br>The fountain of course is Rome's famous Fountain of Trevi where tourists are lured into throwing their pennies with the promise of good fortune and a return to the eternal city. Frank Sinatra sings the title song over the opening credits and the Four Aces also had a mega-hit out of that tune. I remember as a lad in the Fifties, hearing that constantly on the radio. It was a BIG factor in the success of this film and won an Oscar for composer Jule Styne and lyricist Sammy Cahn.<br><br>McNamara and Peters fall for Prince Louis Jourdan and aspiring lawyer and co-worker Rossano Brazzi respectively. They play the continental lovers effortlessly.<br><br>20th Century Fox during the 50s toned down Clifton Webb's acerbity in order to make him leading man material. They never quite succeeded, but Dorothy McGuire conveys that she has a deep and abiding affection for Webb.<br><br>The usual romantic complications occur, but it all works out in the end as it always does in these films.<br><br>But the star is Rome and even seeing it 50 years ago, you'll still want to a pack a bag and see the place after watching this film.","user":"bkoganbing","rank":[34,40]}]