[{"title":"My favorite underrated a good Friday the 13th horror slasher film","rating":10,"date":"24 September 2017","review":"Friday the 13th: A New Beginning is very underrated and a really good horror film. It is my sixth favorite Friday the 13th film. It grew on me Friday the 13th Part III 3D and this one really grow on me and they become my favorite films. I am big Friday the 13th Fan and I love mostly of the films. This is the good movie. I know it get's a lot of hate because it doesn't have a Jason in it, but Tom Morga who played the hockey-masked killer was fantastic. It has good kill's and it is really my favorite 80's horror film. This movie reminds me on The Blob (1988) the diner scene my favorite horror sci-fi film.<br><br>I love this film this time around the fourth time in the row it become guilty pleasure of mine. Melanie Kinnaman was a good bad-ass heroine, she was good and her performance was decent. The dinner scene was a fantastic death scene. Rebecca Wood as Lana was a good victim and I like the death kill. When the killer beheaded that biker guy Junior it was a good kill I like it. Tom Morga was a fantastic hockey-masked killer. Juliette Cummins as Robin was a hot great sexy babe. I like her as a victim. I like this film it is an alright slasher film not that bad. <br><br>Danny Steinmann R.I.P. who is no longer with us anymore. I respect Mr. Danny Steinmann and his vision of the movie what he was trying to do. Please my remorse goes to his family and rest in peace Danny you are really missed. You have my respect Danny Steinmann you were great director and your direction of this movie was solid and your writing ability for the screenplay was talented. <br><br>Melanie Kinnaman as the blond Pam was good excellent heroin I loved her. I love that in this movie the hockey mask design in this movie fro the killer was blue. I love in which Pam fights off The Killer with a chainsaw really awesome climatic battle fight scene. <br><br>I have enjoy this film and however I feel now it is better then Friday the 13th Part 2 because the killer wasn't so clumsy and the chainsaw worked in this movie. Just like the first movie it ravels about revenge. In the original film is Mrs. Voorhees and this movie has Roy paramedic the killer. I still love Part 2 to death but it does have confusing plot. <br><br>Friday the 13th: A New Beginning grew on me and I didn't thought it was horrible. I still don't like John Shepard as Tommy Jarvis but the movie more revolves around Pam and Reggie which I like. It is a good horror film. A 10/10","user":"ivo-cobra8","rank":[99,131]},{"title":"The best of the Friday the 13th series","rating":22,"date":"22 October 2006","review":"I love this film, and, as far as I'm concerned, it's the best of the series. \"Friday the 13th: A New Beginning\" is vastly underrated by all the crybabies out there. \"Oh, boo hoo, where's Jason?!\" He's not here, so get the hell over it already. Too many sequels that try to shake things up a little get shat all over for daring to not be a clone of what's come before. It's sad.<br><br>I love the halfway house setting. It's a unique idea that naturally lends itself to some offbeat slasher fodder. I also find the area in which the film was shot surprisingly atmospheric. Along with the killer being unseen for the first time since the original, it helps to make this a creepier entry in franchise. This is probably the most bizarre film in the series, too, which only makes it more endearing to me. The characters are great. From the quirky halfway house residents to the crazed backwoods hicks, to the wacky Demon, this film's characters are very entertaining, and on many occasions, quite amusing. I also love the direction in which they take the character of Tommy Jarvis, having all these mental problems thanks to Mr. Voorhees. His hallucinations are actually rather eerie, to boot. It's a damn shame they didn't continue the idea in Jason Lives, which I consider to be one of the weakest entries in the series (but that's another story for another review board).<br><br>I think the kills in this film are some of the most original in the series. A leather strap crushing someone's head against a tree, a road flare to the mouth, a cleaver decapitation while riding a motorcycle, among others, aren't your typical slasher kills. I also love the fact that the killer is copycat, Roy. It's a nice, refreshing take. I always see people whine about Jason not being the killer here, but I say it's better that way. I think having chocolate bar boy be his son was a nice twist. Funny how he kills everyone but his son's killer, but I'm sure he couldn't get to him with the authorities taking him into custody.<br><br>I could go on and on about how enjoyable this film is. It has a real charm to it, and it's a shame that so many consider it one of the low points of the series, even the worst. I was disappointed to see this film on the IMDb bottom 100 a good while back. It's no longer on the list, so that's cool.<br><br>And remember, \"Y-ya don't s-set a place for a dead person!\"","user":"Cujo108","rank":[65,93]},{"title":"Ooooh baby! Ooh Baby!","rating":6,"date":"9 January 2008","review":"This is the best Jason to watch drunk, it's almost like a Friday the 13th blooper reel. I love the singing on the crapper part, the mod chick doing the robot, the \"just wanna earn a meal\" guy, Crazy Ethel and Junior, Billy and Llana, that kid from Diff'rent Strokes, the stupid arse ending, and the excessive nudity.<br><br>It's a time capsule of sorts, it captures all the bad 80's slasher films in a hour and a half. Bad acting? GOT IT! Ridiculous costumes? GOT IT! Lot's of big haired women topless? GOT IT! No name stars obviously coked out of they're mind? OH THIS MOVIE HAS GOT PLENTY OF THAT! Watch it and laugh, preferably with some friends","user":"unkle_nasty_fingers","rank":[56,84]}]