[{"title":"a solid caper flick","rating":8,"date":"2 February 2005","review":"When I was a teenager, Peter Cushing was my favorite actor; I simply loved his commanding performances in Hammer Studios' horror films. But when I eventually became more interested in dramas and foreign flicks, my appreciation for both Cushing and Hammer waned. I started to wish that Cushing had taken meatier roles in less lurid movies.<br><br>Thankfully, I just had the chance to see \"Cash on Demand,\" a film that stretches Cushing's acting ability farther than most of his horror efforts. It's still a genre film  you could label it a crime/film noir movie  but nevertheless, it's got far more dramatic content and character development than the average Hammer film. Cushing is really superb as the cantankerous bank manager; his character is initially quite unpleasant, but as the plot unfolds he becomes gradually, genuinely more sympathetic.<br><br>It would be remiss of me to praise Cushing and forget to mention Andre Morell, who plays the debonair bank robber. His performance is wonderfully smug and, for lack of a better word, cool. The two actors have a great rapport throughout the movie, and together they hold the viewer's attention without the aid of any flashy sets or action sequences.<br><br>Clearly a modest movie, made for less money than it takes to film a TV show today, \"Cash on Demand\" is nevertheless a solid caper flick that deserves the attention of movie fans  particularly those who, like me, are interested in seeing Cushing flex his acting muscles outside the realm of vampires and other forms of animated corpses.","user":"dr_foreman","rank":[38,40]},{"title":"Fantastic thriller from Hammer studios!","rating":10,"date":"3 August 2009","review":"If you think of Peter Cushing in a Hammer production, it will be his roles in the colourful and camp horror films that will spring to mind first, and for good reason as it's those performances that defined the great actor; but Cushing and Hammer also combined on some non-horror films, and Cash on Demand is surely one of the very best of them; both in terms of the film itself and the performance from the great Peter Cushing. This is an absolutely brilliant thriller that works thanks to its simplicity, commanding and intriguing performances and well written script. The film focuses on a bank in a small town which is managed by the dedicated Mr Fordyce. His bank is disturbed one day by a caller who introduces himself as a man from the bank's insurance company, who has come to test the security. However, it transpires that the man is actually a bank robber, who has come to rob the bank, and he's got an associate in Fordyce's house ready to kill his wife and kid if he does not allow the robbery to take place! <br><br>Peter Cushing's performance in this film is absolutely immense and undoubtedly one of the best of his career. He gets his character spot on and is completely believable throughout the film and this is one of the main reasons Cash on Demand is such a success. He is joined by André Morell who is equally brilliant in his role as the debonair bank robber. Every scene in the film takes place either in the bank or just outside of it, and most of it takes place in Forsyce's office where we get to watch Cushing and Morell play a game of cat and mouse, which is always fascinating to watch. The film remains simple throughout and director Quentin Lawrence keeps his audience interested through the various elements of the plot. The film does have a few twists and turns, and of course the best of these is saved right up until the end. Overall, this is an absolutely great thriller that is well worth seeing and comes highly recommended! Unfortunately, the copy I saw was rather poor, which makes this a prime candidate for a pristine release on DVD!","user":"The_Void","rank":[38,41]},{"title":"Almost perfect","rating":11,"date":"11 February 2000","review":"This delightful little low-budget film is one of Hammer's least-known efforts and also one of their best.  The story is a reworking of \"A Christmas Carol\", as Peter Cushing's bank manager, a cold and austere man, and a petty tyrant to his staff, goes through a terrible experience which leads him to change his ways.  Cushing is quite superb as the manager and Andre Morell almost as good as the urbane thief who controls events until the denouement.  The plot twists and turns and the writing is first-class.","user":"heedarmy","rank":[28,30]}]