[{"title":"Landmark British Classic !","rating":9,"date":"14 February 2006","review":"I first watched this film when I was about 14 years old sat at home with my mam and dad and I was absolutely riveted. Ever since then I have kept an eye out for it in the TV listings but never spotted it until now !...they have finally released it on DVD and it was worth the wait. The black and white photography is stunning, painting a grey stark picture of life in the poverty stricken back streets of Salford and Eccles in the late 50's and early 60's. I grew up around most of the locations, many of the streets are now bulldozed and many of the historical landmarks are now set against different backdrops...maybe not as grim, but in my opinion not as interesting or compelling. The theme of the film is warm and loving giving a realistic picture of people in the area at that time..friendly, caring, enjoying life when they can as life could be hard, poor housing, low wages the dirt and grime of living and working in the post war northern inner city.<br><br>Barton Swing Bridge and the Manchester Liners Shipping Company, Old Trafford Football Ground - complete with floodlight pylons, the atmosphere of a back street boozer and Blackpools brightly lit amusements are seen in all their grim Majesty.<br><br>The acting is tremendous,Dora Bryan superbly cast as the selfish mother...she should have gone on to stronger roles after this performance. Rita Tushingham the gawky teenager full of youthful wonder of her harsh world and Murray Melvin as the young adolescent battling with his sexuality and feelings for the enchanting Tushingham.<br><br>It really is a must see for anyone interested in this genre or who lives or has worked around Manchester. It shows the hope and warmth of people who have nothing, who only maybe aspire to a simple life...but who have had a Taste Of Honey.......","user":"steve-broadhurst","rank":[68,75]},{"title":"Film Retains is Power","rating":9,"date":"15 May 2001","review":"Shelagh Delaney's screenplay for \"A Taste of Honey,\" based on her play of the same name, remains a moving period drama.  Beautifully directed by Tony Richardson, this film evokes all the stark realism of the famed English \"New Wave/kitchen sink\" dramas (made popular by John Osborne) of the late 50s/early 60s.<br><br>Rita Tushingham is striking as an working-class adolescent girl, growing into maturity--first through her pregnancy by a young sailor, played by Paul Danquah, and then by her association with a sensitive man, played by Murray Melvin. Dora Bryan is impressive Tushingham's mom. <br><br>The sparse photography, sets and score, all combine to make an unforgettable statement.","user":"harry-76","rank":[41,47]},{"title":"A poignant, delicately powerful gem of a movie!","rating":10,"date":"17 January 2004","review":"This offbeat film is funny, tragic, and all the stops in between...and if Rita Tushingham, as the teenaged heroine \"Jo\", is the movie's heart, its soul is Murray Melvin, whose subtle but searing performance as her friend \"Geoff\" is one of the greatest on film (it deservedly won him the Cannes Film Festival's \"Palme d'Or\").<br><br>Most of the musical score may sound odd to American ears (I believe it reflects the instrumental music that actually accompanied the stage play from which this film is adapted), but the chorus of lilting children's voices, singing a traditional song, that is heard over the movie's opening and closing sequences, is extremely effective.","user":"Rogue-18","rank":[45,52]}]