[{"title":"One of the best of a very funny series.","rating":27,"date":"27 September 2003","review":"What was more deserving in its day of being given a glorious sendup than the monumental production of \"Cleopatra\" with Liz and Dick's on- and off-set romantic interludes, so fulsomely (and scandalously - Can you believe it?!?) documented in worldwide tabloids?<br><br>20th-Century Fox rather carelessly left behind some quite elaborate sets at Pinewood Studios when production on the first attempt to film this spectacular under the direction of Rouben Mamoulian had to be shut down and then abandoned in London, when Elizabeth Taylor experienced one of her many life-threatening illnesses.  (Other IMDb-ers err in stating that the abandoned sets used were those from the Joseph L. Mankiewicz version filmed at Cinecitta in Rome and on various locations in Italy, Spain and Egypt.) When M-G-M finished production of \"Ben-Hur\" (1959) in Italy they prudently destroyed the massive sets to prevent those cleverly thrifty Italian producers of sword-and-sandal \"epics\" from taking advantage of the bounty left behind.<br><br>The \"Carry On\" series may not have translated all that well to American shores, but I recall standing in line in Westwood, California, to see \"Carry On Nurse\" and enjoyed several of the later productions in this lengthy British franchise of satirical and slapstick humor.  They were great fun and the new DVD collection is no doubt worth the price for aficionados of the series.","user":"gregcouture","rank":[20,22]},{"title":"Blimus!!","rating":24,"date":"24 July 2001","review":"Looking back at the many ups and downs of the British Film Industry one clear period stands out as very firmly 'up'. This was during the reign of the 'Carry On' team at their peak. For a five year period (1963 - 1968) the team churned out a series of slickly produced genre parodies which, though often substituting authentic locations for a beach in Wales or a field in East Anglia, managed to upstage the Hollywood productions they were thumbing their noses at. 'Carry On Cleo' (1964) exemplifies this period and stands out as (some would argue) one of the greatest British films ever made. The usual cast is out in force, with only a couple of notable absences (i.e. Barbara Windsor), all delivering at the top of their form, and clearly revelling in the luxury of using the sets and props left over from Mankiewicz's megaproduction of 'Cleopatra' (1963). Sid James was never more ruggedly appealing than when suited in the white miniskirt and golden breast plate of Marc Anthony,   he also gets to blast the immortal line \"BLIMUS!!\". Scriptwriting doesn't get any sharper, from start to finish Talbot Rothwell's script glitters. In the part of Cleopatra, Amanda Barrie gives us a good view of her ripples as she floats gracefully in asses milk. Whilst batting her extended eyelashes she asks \"Do'st thou like what thou see'st?\". Well I certainly do'st. The film is a pleasure to watch, there is never a dull moment as the plot flips furiously between the plight of the cowardly Hengist Pod and heroic Horsa escaping roman enslavement (Kenneth Connor &amp; Jim Dale buckling a fine swash together), and the drama of Julius Caesar's last days of power (Kenneth Williams camping it up to the nines as usual). The story threads intertwine and build to a hilarious climactic chase scene involving a Shakespearian identity swap and a hulking Egyptian guard by the name of 'Sosages'. If contemporary British film-makers would return to taking the mickey instead of sitting passively in Hollywood's thrall, we might see a few more gems like this in the future.","user":"Seph Rodgers","rank":[20,22]},{"title":"A very funny Carry On","rating":3,"date":"3 March 2004","review":"Julius Cesar returns from his three-year campaign across Europe with his captured slaves to find a less than warm welcome awaits him.  His wife is mad at him, the senate is plotting against him and a war between Cleopatra and a rival for control of Egypt.  While Cesar and Mark Anthony try to keep control of Rome, they also must side with the beautiful Cleopatra.<br><br>Although it is true that Carry On films are an acquired taste and that some of the jokes will be lost to those not familiar with British gags and terms, it is still the case that the Carry On's can be very funny if you get them and they hit the mark.  Cleo is yet another example of what made the Carry On movies such a success; this is one of the better ones - plenty of good gags and fine actors to deliver them.  The plot is good enough to hold the gags together but not good in the traditional sense - basically the gags are what drive the film rather than the plot!<br><br>And what good laughs there are to be had!  The humour is innuendo based but is not as out and out crude as the series often could be.  Even the slightly smutty jokes are pretty clever and witty; regardless of where you are from, there is enough laughs here to be worth watching.  I won't start quoting lines simply because there are so many good ones - the second half is a little weaker than the first, but it is all still good stuff!<br><br>The cast are great despite missing a few of the regulars.  The film's stand out performances are easily Williams and James.  James is his usual self, regardless of historical setting but Williams is simply superb and makes his lines work better due to his delivery.  He has most of the screen time and he makes the film.  Barrie is not that good looking but she makes a good Cleopatra and she has a good body on her.  Williams and Dale don't have that much to do but are still OK despite feeling supplemental to the action. Hawtrey is hilarious and Sims is OK.<br><br>Overall this is as good an example of the Carry On series as any other. It is smutty without being overly crude, with a good mix of sex jokes and witty puns and such.  The plot holds the film together without being intrusive on the gags.  A fine example of a series that could be as good as it could bad - here it is good.","user":"bob the moo","rank":[12,13]}]