[{"title":"Definitely not \"Buffy, the Vampire Slayer\"","rating":5,"date":"5 March 2005","review":"This is not Jean Rollin's best film, but it might be his most essential one for fans because it combines the moody visuals of films like \"Fascination\" and \"Two Orphan Vampires\" with the perverse softcore sex of films like \"Bacchanales Sexuales\". Two teenage virgins run away from a school party (which in the strange Rollin universe somehow involves dressing as clowns, having a shoot-out with police, and disposing of the body of their dead male accomplice in a burning car). After a bizarre accident while walking through a graveyard that almost results in one girl being buried alive, they arrive at a deserted castle and do what any two virgins would do in a 70's Eurohorror/sex movie--strip off all their clothes for some hot lesbian action. Soon though they meet the occupants of the castle who are, of course, vampires. Freely rewriting the vampire rulebook, Rollin's vampires in this movie can not pass their curse on to anyone except virgins. Any non-virgins are chained to the wall while the monstrous man-servants have their way with them in gratuitous sex scenes before the female vampire suck their blood from their breasts and the male vampire changes into a bat to commit an act of bestiality that no pervert in the world would find erotic (you have admire the sheer audacity of Rollin if nothing else).<br><br>The conflict happens when one girl decides to lose her virginity while the other decides to preserve hers and join the ranks of the living dead. But the bonds of love and friendship are not easily broken. This movie addresses some real themes of coming-of-age and friendship (albeit in a fantastical and at times ridiculous milieu), but no one will confuse it with \"Buffy, the Vampire Slayer\". If you're looking for sex,on the other hand, you certainly won't be disappointed, but unlike all the erotic vampire movies they churn out these days, this is a vampire film with a lot of sex, not a sex film with vampiric trappings. And there is something very personal and obsessive about Rollin's films that the modern-day hacks can never hope imitate. This movie contains all manner of memorable images--preserved human arms holding candles, posed skeletons dressed in clerical robes, a girl in a mini-skirt lying on a coffin being buried alive by oblivious gravediggers, a girl clamoring around the ruins of a Gothic castle dressed in nothing but knee socks. Good or bad, Rollin is definitely a one-of-a-kind filmmaker.","user":"lazarillo","rank":[28,29]},{"title":"Stream of Consciousness Nuttiness from France's Foremost Nutcase","rating":6,"date":"25 July 2007","review":"Initially, this incredibly simplistic film may look like a step backwards for Rollin after the highly experimental Rape of the Vampire and the highly strange The Nude Vampire but it could also be argued that it is, in fact a precursor to the dream-like The Iron Rose. It looks like it was shot over a long weekend and, indeed, would perhaps have worked better as a short film. The plot, what there is of it, concerns two girls (dressed as clowns) on the run after killing a would-be rapist. After their getaway driver is killed, they stumble upon a castle in which resides the last of the vampires and his servants. Aside form the odd diversion (one of the girls meets a man in a graveyard and offers him his virginity so as to remain free of the vampire's curse) that's about it.<br><br>Upon first viewing the film, there is very little to get out of it aside from the odd bit of S+M imagery (chained up naked girls attacked by bats, a kinky lesbian whipping scene) but ones whole perspective changes when one discovers that Rollin wrote it in ONE NIGHT. For those unfamiliar with Rollin, this would simply re-enforce the notion that what they are watching is complete crap but for those familiar with his work, it provides and excellent insight into the man's unconscious. Rollin's work is all about repressed sexual desire; his films are essentially adolescent fantasies, which is why many of them feel like fairy tales; they disguise their true meaning through the circumstances under which the images are presented. This is a true relic of the 60's/70's, a time in which Western culture was going through its own adolescence. Perhaps part of the problem with cinema today is that it has none of the innocence of that sexually uncertain time.","user":"MetalMiike","rank":[7,7]},{"title":"Surreal film","rating":4,"date":"24 March 2000","review":"This film was rated higher by others than I would have thought. Vampires usually do a lot of biting and blood sucking.  There was more erotic virgin handling and molestation than biting and the like in this one.  The use of silence in the film gave it a surreal quality. The whole movie was dream-like. The lure of the victims was not captured. The chase and seduction is the best thing about vampires but those subtleties were lost here. But, I must admit, the film did remind me of Vampyros Lesbos and, to a lesser extent, Suspiria. I must state that vampire films do not have to be bloody etc. But a little blood at the bite would have been welcomed. Not a bad watch if you seek those who walk at night.","user":"Anyanwu","rank":[14,17]}]