[{"title":"The pinnacle of the short lived British new wave","rating":4,"date":"4 March 2004","review":"The late fifties marked the beginning of the short lived new wave in British Cinema. This was largely influenced by the burgeoning of the American cinema and stage as opposed to the staid outdated state of affairs in British culture. In that brief period a number of films were made which broke new ground in an effort to portray the often harsh reality of life for millions of Britons. Tony Richardson was perhaps the most prominent exponent of the kitchen sink/angry young man genre and \"Look Back in Anger\" one of his finest works.<br><br>Time has not been kind to a lot of the films which at the time may have seemed important. \"Look Back in Anger\" is one of the few which have retained its power, due to John Osborne's writing, Richardson's direction and outstanding performances by all. <br><br>It must have been an exciting time with the emergence of some exceptional young actors, (Alan Bates, Albert Finney, Tom Courtney, Rita Tushingham, Vanessa Redgrave, to name but a few) as well as a new generation of writers and directors. But it was not long before this exciting movement petered out and British cinema would be once again dominated by largely mediocre films.<br><br>\"Look Back In Anger\" has an emotional rawness to it which is still extremely effective. Osborne does not shy from exposing the ruthlessness his characters are capable of. It's a ruthlessness born of frustration and pain and as such one we can comprehend if not forgive.<br><br>Richard Burton in the lead gives a virtuoso performance, but it's the kind of acting which belongs on the stage. Burton, unlike many of his theatrical peers never quite got the hang of screen acting. He's always a number of shades to big. Still, when at his best (such as in \"Night of the Iguana\"), it's fascinating viewing, despite the overt theatricality.<br><br>Claire Bloom who had partnered Burton often on stage, is a fine match for the fiery Burton. The lesser known Mary Ure (Osborne's wife at the time) gives a remarkably touching portrayal as the torn and suffering spouse. Gary Raymond lends much charm in the role that was created by Alan Bates on the stage. And then there's the great Edith Evans in a small role; but then you know what they say about there being no small roles, only small actors. She certainly was one of the greats.<br><br>This is classic film making and one of the high points of British cinema, which has never regained its position in the making of exciting, intelligent and important films. Sadly director Tony Richardson too, never really fulfilled the promise of his outstanding early works.<br><br>Not one to miss.","user":"grahamclarke","rank":[44,51]},{"title":"Dilutes the Power of Osborne's Play","rating":7,"date":"14 July 2006","review":"John Osborne's \"Look Back in Anger\", first performed at London's Royal Court Theatre in 1956, is often cited as marking a theatrical revolution. The British theatre of the early fifties, dominated by playwrights like Noel Coward and Terence Rattigan, was widely regarded as genteel, well-mannered and middle-class. Osborne's play can be seen as a deliberate reaction against those values. Its plot is conventional enough. It centres around the stormy marriage of a young couple, Jimmy and Alison Porter, who separate after a series of quarrels. Unknown to Jimmy, Alison is pregnant at the time, and he starts a relationship with her best friend Helena, an actress. Six months later Alison, having lost her baby, returns, and Helena ends her affair with Jimmy so as to allow the couple to be reunited.<br><br>What was shocking about the play was its social setting and the attitudes displayed by the characters, especially Jimmy. He is from a working-class family and, although he has a university degree, has turned his back on the sort of well-paid white-collar job that such an educational background would normally have led to in the fifties, working as a trader in the local market, running a sweet stall with his friend Cliff. He and Alison, with Cliff as a lodger, live in a dingy bed-sit in a large Midlands town. Alison herself is from the wealthy upper middle classes (her father is a retired Indian Army officer) and her family resent her marriage to Jimmy.<br><br>It was in the late fifties that the term \"Angry Young Man\" was coined by the critics to describe not only writers such as Osborne, Kingsley Amis and John Braine, but also their characters such as Jimmy Porter and Amis's Lucky Jim, characters who were seen as the mouthpieces of their creators. Jimmy is, to borrow the title of a famous film of the period, a rebel without a cause. He is instinctively suspicious of any form of authority and of the establishment. He is hostile to religion and to the growing conservatism of fifties Britain. He dislikes Alison's family, especially her mother, because he sees them as part of the traditional British ruling class. He does not, however, himself really subscribe to any alternative system of values such as Communism or Socialism. A frequent theme of his complaints is that there are no longer any good causes to fight for; he envies his parents' generation who could fight the anti-fascist battles of the thirties and forties. (His father was a veteran of the Spanish Civil War).<br><br>Jimmy's relationship with Alison is a complex one, perhaps best expressed by the cliché that they can neither live with one another nor without one another. On the one hand, the differences in their personalities and their social backgrounds is the cause of constant friction between them. On the other, they have a deep emotional need for one another, shown by their game of \"bears and squirrels\". To an outsider such as Helena this is mere sentimental whimsy; to them, it is a way of expressing their mutual love.<br><br>The British cinema was undergoing a similar revolution in the late fifties to that which was happening in the theatre, with an increasing emphasis on films about working-class life in what became known as \"kitchen sink realism\". It was, therefore, perhaps inevitable that \"Look Back\" would be filmed. It is, however, not a very cinematic play. Apart from its plot, it is traditional in another respect, in that it observes two of the three classical unities, those of place and action. The film-makers clearly felt that this structure would not work in the cinema, because they took pains to \"open it up\". The action moves out of Jimmy's flat- there are scenes set in a jazz club, in the market where Jimmy works and in a theatre where Helena is appearing. Characters, such as Mrs Tanner, who are only referred to in the play actually appear in person in the film. The writers have added a sub-plot, not found in the play, about Jimmy's struggles with an unpleasant market inspector and his attempts to prevent an Indian trader from falling victim to racist discrimination by the other stallholders.<br><br>At 115 minutes the film is already shorter than the normal running-time of a stage production of this play, and the insertion of these extra scenes meant that even more of the original text had to be sacrificed. Those who know the play from the theatre, therefore, will find the film version very truncated. Many of Jimmy's lengthy speeches, in particular, have been cut, and the centrality of the relationship between himself and Alison is diluted by the introduction of new characters and new sub-plots. Although \"opening up\" works when some stage plays are transferred to the screen, in my view this is not one of them. In my opinion the film would have worked better as a piece of \"filmed theatre\", sticking closer to Osborne's original text.<br><br>One reviewer compares this film to \"A Streetcar Named Desire\", which can be seen as a piece of American \"kitchen sink\". There are certainly similarities between the two plays, both of which have at their centre an angry, outspoken working-class young man (Stanley/Jimmy), a milder friend (Mitch/Cliff) and two more genteel, middle-class women (Blanche and Stella/Alison and Helena). Both plays, when performed well in the theatre, can also provide a powerful emotional experience. The famous Marlon Brando/Vivien Leigh version of \"Streetcar\", however, is a better film than \"Look Back\" because it succeeds in preserving the power of that experience in the cinema. At times, Richard Burton and Mary Ure come close to capturing the impact of Osborne's play, but it is only at times. At other times that impact seems weakened. 7/10","user":"JamesHitchcock","rank":[21,23]},{"title":"Oh, Do Shut Up!","rating":3,"date":"4 December 2009","review":"To watch \"Look Back In Anger\" so many decades after its brief era of relevancy is to encounter a head-scratchingly pointless film and wonder what all of the yelling was about. This dank and claustrophobic look at one of Britain's army of post-war \"Angry Young Men\" might be a tad more bearable were Richard Burton asked to take it down a notch. Burton's endless bellowing (second only to Peter O'Toole's bray-as-acting style) is ill served by it never being made quite clear just what this guy is so miffed at all the time.<br><br>Surrounded by characters that either incomprehensibly find him a lovable lad (Gary Raymond, Edith Evans) or serve as doormats (Mary Ure, Claire Bloom), Burton's character is given free rein to act like a colicky brat for most of the film without ever giving us much of a clue as to the root of his dissatisfaction. Brief references to Britain's class system, racial injustice, loss of loved ones and any number of social ills feel insufficient as explanations to the source of Burton's unpleasant personality. After 40 minutes or so of being subjected to one narcissistically histrionic rage after another, one just wishes he'd shut up and realize that he isn't the only one sufferinghe's just the only one who seems hell-bent on making sure others are as miserable as he is.<br><br>That being said,the entire film is not devoid of certain pleasures (the photography is appropriately dingy, Claire Bloom is always a delight and Gary Raymond, so good in \"Suddenly Last Summer,\" was a real surprise here with a more sizable role) but it's near unbearable being subjected to a film about a man feeling sorry for himself non-stop. It struck me as being sophomoric in theory and tedious in execution.<br><br>If this film reminds me on anything, it's of an episode of \"The Flintstones\" where Fred is cast with wife Wilma in a kitchen-sink domestic drama about an abusive, lout of a husband and his meek wife. The show's title: \"The Frogmouth,\" a perfect subtitle for this mess- Richard Burton in \"Look Back in Anger aka The Frogmouth.\"","user":"efitness","rank":[40,50]}]