[{"title":"One of the best films noir ever, Double Indemnity communicates with amazing effectiveness the depths of depravity, greed, lust, and betrayal of the seemingly innocent and beautiful.","rating":10,"date":"8 November 2000","review":"This is one of the best films of all time, not necessarily because of its story but because of the acting, direction, cinematography, lighting, and just the way that the story itself was told. At the time the film was released, the idea of revealing who the killer was in the opening scene was virtually unheard of, but it ended up being very effective because it allowed the audience to concentrate more on other elements of the film, which was the goal of Billy Wilder, the director. Instead of trying to figure out who the perpetrator was, there is more emphasis on how the crime was pulled off, what mistakes were made during the murder, who betrayed who, how close Barton Keyes (the insurance investigator) was getting to solving the case, and, probably most importantly, what kind of person Walter Neff is and whether or not sympathy should be felt toward him.<br><br>\nBarbara Stanwyck, in one of the most remembered performances of her extensive career, represents (with nearly flawless ease) the cold and ruthless manipulator who has no difficulty in ruining other people's lives in various ways (including death, if necessary) in order to get what she wants. Known in the film community as the `femme fatale,' this is someone who uses her sexual prowess, seductiveness, and emotional detachment to drag an unsuspecting person (generally an interested man) into a scheme from which she is expected to benefit heavily and he is most likely headed for destruction. In these types of films, the man often either finds his life in ruins or ends up dead, as is often (but not always) also the case with the fate of the femme fatale. <br><br>Barbara Stanwyck (as Phyllis Dietrichson, the murderous femme fatale in Double Indemnity) and Fred MacMurray (as Walter Neff, her victim'), have amazing chemistry on screen. Their attraction is incredibly well portrayed, and the development of their relationship with each other is so convincing that what happens between them almost seems normal. Besides that, their mutually calculated interaction, although it seems at first like it has been rehearsed endlessly and ultimately brought unconvincingly to the screen, is exactly as it was meant to be, because it represents each character's intentions, even very subtly foreshadowing their future betrayals against each other. Phyllis has gone through every word she ever says to Walter in her head. She has practiced what she wants to say when she brings up the idea of life insurance to Walter in the beginning and she knows what she wants to say whenever they interact with each other because she has been planning for quite some time the prospect of murdering her husband in order to collect his fortune. Walter, conversely, methodically makes amorous advances as though this is something that he does regularly, and then ultimately he also plans out his conversations with Phyllis because he begins to suspect her and is sure to tell her only what he wants her to hear. This seemingly stiff dialogue brilliantly represents Phyllis and Walter's precise (and sinister) intentions, and it's quick pace creates a feeling of urgency and restlessness.<br><br>Probably the most fascinating and entertaining actor in the film, Edward G. Robinson, plays Barton Keyes, Walter's friend and employer at the insurance company where he works. Keyes is a very suspicious man who closely investigates the insurance claims which come into the company, having a striking history of accurately isolating fraudulent claims and throwing them out. His handling of Phyllis's (and Walter's, technically) claim and the way that he gets closer and closer to the truth create a great atmosphere of tension and drama. <br><br>Double Indemnity is nearly flawless. From the shocking and unexpected beginning to the already known but still surprising end, the audience is held rapt by the excellent performances, the brilliant and imaginative direction, and the flawlessly created atmosphere. This is excellent, excellent filmmaking, and is a classic film that should not be missed.","user":"Anonymous_Maxine","rank":[268,313]},{"title":"Justifiably At The Top Of Most Film Noir Lists","rating":10,"date":"23 December 2005","review":"This is one of the best-liked classic films of all time and I am among that large group of fans as well.<br><br>Few movies have ever had dialog this entertaining.....at least the conversations between Barbara Stanwyck and Fred MacMurray. I think it's a big appeal to this movie, except to younger folks who look at it as \"cheesy.\"<br><br>I read the book, Double Indemnity written by James Cain, and was surprised that the film's snappy dialog was not in it. This is one of the rare times when the movie was far better than the book. That's not a shock after you find out that literary giant Raymond Chandler and Hall Of Fame director Billy Wilder combined to write the screenplay,<br><br>For a murder/suspense story, there is very little action, almost none, yet there are no boring lulls. The three main actors - Stanwyck, MacMurray and Edward G. Robinson, are what make this so good.<br><br>MacMurray's narration is fun to hear as he tells the story in flashback, from the beginning by dictating into an old Dictaphone to his co-worker Robinson. The latter is almost mesmerizing in his performance, the way he delivers his lines. He can even make a speech about something as boring as insurance and still keep you riveted to the screen.<br><br>Stanwyck was no sex symbol (at least to me) but she looked great here in the most seductive of 1940s clothing and, like Robinson, has a distinctive voice and accent that keeps your attention.<br><br>This film was the inspiration for the 1980 movie, \"Body Heat,\" starring William Hurt and Kathleen Turner. That, too, was a very, very good movie....but not many films are in the class of this one.","user":"ccthemovieman-1","rank":[146,180]},{"title":"It fits together like a watch","rating":9,"date":"2 May 2004","review":"I've now seen this movie 14 times in 25 years, at all times of the year, in all moods, sober or not etc - but always at night. I recorded my copy off TV in 1987 so I can only imagine what a remaster would do for it. With an atmosphere thick enough to cut with a knife it never fails to engross and enchant me, and although it's been dated for 40 years or more still seems relevant and watchable today. TV, answer phones, recordable CD/DVD, memory sticks and the internet have all come between us and yet I can still watch Fred MacMurray speaking into a Dictaphone without a qualm. Who wears a hat in California nowadays? Who buys beer whilst driving! Lift attendants have gone but I can still believe in Charlie working and laughing away in the garage past 11 at night.<br><br>Woman and man agree to murder woman's husband but on the way to the cemetery they face grilling by insurance company. I think everything has been said before on the IMDb - by those who think it's one of the best films ever made! To those who simply think the main problem is that it's dated I wish you could see the TV commercials that dug into DI back in '87 - what a hoot - and compare. I've just noticed the print TCM UK is showing in 2005 is lip-synced out, very wobbly Rosza music track, fading and ageing fast - worse than my 1987 video tape (maybe logically). They're supposed to be encouraging people to enjoy the classics but they won't do that with such inferior screening copies. Dear TCM UK, this is an impressive iconic film - it deserves a billion dollar remaster authorised by the Library of Congress, not repeatedly trotting out unimpressive cheap worn dupes to fill those 2 hour slots.<br><br>Everything about DI from the acting, production, direction, and music is superbly dignified and is as \"close to perfection\" as human beings are probably allowed to get with this form of Art - especially with the more limited technology at their disposal in '44. When most films from now are long forgotten and dated DI will still be getting re-runs on TV and art-house cinemas - God and remasters willing - that is the fact of it.<br><br>Fortunia Bonanova certainly was fortunate to have appeared in bit parts in 2 of the best films ever made - Citizen Kane the other.","user":"Spondonman","rank":[126,165]}]