[{"title":"good psycho horror,what if. but yes dated.","rating":8,"date":"3 February 2005","review":"a true story.<br><br>at 13 &amp; 10, my younger brother and i, who had a large 2 yr old neighborhood Shepperd (turk), went to see this movie and were unaware of the terror this film evoked until coming home from the theater that night. being a neighborhood dog, turk was roaming in the night alley as we walked by.<br><br>recognizing us, of course, with his reflective eyes, the dog advanced toward us. if you can imagine two boys being chased by their own dog down the street screaming murder, in sheer terror. we were banging on the door for help. the dog thought we were playing and joined in and further excited our fears.<br><br>over 20 yrs later my brother and i tell that story with fond memories of the era the dog and the movie.<br><br>having grown up in the horror hay-day of the 70s and having, arguably, seen the best and worst that Hollywood has to offer. psychologically, this film teems with possibilities for a remake. without all that computer generated junk.","user":"pnbdvdimaging","rank":[17,19]},{"title":"A dog good time","rating":7,"date":"22 May 2017","review":"Dogs ain't a half bad made flick, about a potpourri of dogs, who meet up and go on a killing spree, killing anything animal or human. What is doing it? That's the million dollar question. It leads us to question our our species, as if becoming part of a gang, where we become brainwashed, and commit things we normally wouldn't do, if graduating to murder. But in this open ended, and not too optimistic film, that's pretty gruesome, near it's finale, it's M rating pushing it, we don't find out. Bugger. David McCallum lends a fine performance as the smart hunky professor of Scientology, the real smartie, determined to get to the bottom of the killings, those cattle mutilations early on, aren't for sheep lovers. The violence in Dogs in pretty raw and frank. A younger Linda Gray co-stars before her Dallas days, as Wyner's performance as the new Scientist was strong, and actually likable in a sense. Suspense runs high, some of it electric near the end, and is well executed, the opening music score with our favorite pooches in slo mo, all banding together, my favorite part. They're are some unintentionally funny moments, whether dialogue or acting, but they made 70's movies what they were. This is a well made film, badly dated \"Yes\", but bad, \"No\". Warning: Are some scenes are dog murder.","user":"videorama-759-859391","rank":[7,7]},{"title":"A truly fantastic Sci-fi cinematic masterpiece.","rating":10,"date":"9 October 2001","review":"I was lucky enough to find a bootleg copy of this gem. To see some of Robert Schneiders legendary rare cinematography (uncredited) was truly an a life-changing experience. It's sad that he died from aids (he was one of the first Americans to contract this disease) shortly after the production wrapped. However, he obviously went out with a bang and he will be immortalized through this film. Dogs is so hard to find because it is such a rare film that if you find you just have to hold on to it. I hope this film eventually goes to DVD and it has the proper credit for Robert Schneider. On a scale from 1 to 10 I give this movie an 11. Go find Dogs. You won't regret it! For my name ain't Nathan Arizona!","user":"fukanesedragon","rank":[12,17]}]