[{"title":"A Dirge For A Dying America","rating":10,"date":"21 February 2004","review":"Richard Sarafian's 1971 film \"Vanishing Point\" is, for starters, a fascinating study of those persons anthropologists sometimes term \"marginal men\"--individuals caught between two powerful and competing cultures, sharing some important aspects of both but not a true part of either, and, as such, remain tragically confined to an often-painful existential loneliness. Inhabiting a sort of twilight zone between \"here\" and \"there,\" a sort of peculiar purgatory, these restless specters cannot find any peace or place, so they instead instinctively press madly on to some obscure and unknown destination, the relentless journey itself being the only reason and justification.<br><br> Disc jockey Super Soul (Cleavon Little) and delivery driver Kowalski (Barry Newman) are two of these specters, marginal but decent, intelligent men who can't or won't live in burgeoning competing cultures which in reality have offered them very little of worth or substance, despite their own personal sacrifices. Kowalski himself had tried to \"fit in\" with the Establishment as a soldier and police officer and later, attempted to do the same with the blossoming 1960s counterculture, but soon disappointingly found that they both were ridden with their own various forms of dishonesty and insincerity. Personal honor, self-reliance and genuine respect--Kowalski's stock in trade--were tragically valued very little by either, despite each one's shrill and haughty claims to the contrary.<br><br> Moreover, it's no accident Newman's character has a Polish surname; the Poles throughout their history have created a very rich and unique Slavic culture largely based upon just such a \"marginality\"--being geographically jammed between powerful historic enemies, Germany and Russia, and never being able to fully identify with either one, at often great cost to themselves. It's also no accident Little's character is blind and black, the only one of his kind in a small, all-Caucasian western desert town--his sightlessness enhancing his persuasiveness and his ability to read Kowalski's mind, the radio microphone his voice, his race being the focus of long simmering and later suddenly explosive disdain--all of the characteristics of a far-seeing prophet unjustly (but typically) dishonored in his own land.<br><br> The desert environment also plays a key role in cementing the personal relationship between and respective fates of these two men--to paraphrase British novelist J.G. Ballard, prophets throughout our history have emerged from deserts of some sort since deserts have, in a sense, exhausted their own futures (like Kowalski himself had already done) and thus are free of the concepts of time and existence as we have conventionally known them (as Super Soul instinctively knew, thus creating his own psychic link to the doomed driver.) Everything is somehow possible, and yet, somehow nothing is.<br><br> Finally, VP is also a \"fin de siecle\" story, a unique requiem for a quickly dying age- a now all-but-disappeared one of truly open roads, endless speed for the joy of speed's sake, of big, solid no-nonsense muscle cars, of taking radical chances, of living on the edge in a colorful world of endless possibility, seasoned with a large number and wide variety of all sorts of unusual characters, all of which had long made the USA a wonderful place--and sadly is no longer, having been supplanted by today's swarms of sadistic, military-weaponed cop-thugs, obsessive and intrusive safety freaks, soulless toll plazas, smug yuppie SUV drivers, tedious carbon-copy latte towns, and a childish craving for perfect, high-fuel-efficiency safety and security.<br><br> The just-issued DVD contains both the US and UK releases of the film; the UK release, I believe, is a much more satisfying film, as it has the original scenes deleted from the US version. As an aside, Super Soul's radio station call letters, KOW, are in fact the ones for a country &amp; western station in San Diego.","user":"AdamKey","rank":[260,299]},{"title":"Look back on your life torn asunder...then throw it into third gear and floor it.","rating":10,"date":"2 April 2004","review":"Barry Newman is \"Kowalski\", an enigmatic figure who has tried everything in his life from stock car racing to the military, and failed at every one of his endeavors. Working as an auto delivery man, he gets an order to transport a 1970 Dodge Challenger R/T to San Francisco, and makes a bet with a few friends that it can be done in an impossibly short time. After loading up on \"ups\" and throttling the car westward, he is soon pursued vigorously by the police and embraced by the public as something of a hero. During a time when national speed limits were all controversy, this film provides a compelling argument against them: A fast car in the hands of a capable driver is not dangerous. Even the police, so caught up in their own system, don't realize that they are the only ones causing accidents and endangering the public while blindly trying to keep up with and capture Kowalski.<br><br>While the film sounds at first to be a simple action film, it's really much more than that. Kowalksi's past is revealed little by little through flashbacks, making the film something of a character study. Kowalski's trip becomes a road trip of existentialism as he runs across various strange characters: Solitary hippies, gay bandits, a boogie-woogie snake handling Christian cult, and the blind soul station DJ (brilliantly played by Cleavon Little) who is attempting to guide him on his journey from within the car's radio.<br><br>Topping it off is a great soundtrack, breathtaking cinematography and direction, and automotive action that has seen no equal. This film manages to be both compelling and exciting. Just watch it already.<br><br>10/10","user":"Apollyon_Crash","rank":[157,178]},{"title":"The road can work on your mind.","rating":8,"date":"8 July 1999","review":"Kowalski transports cars across the western US in 1970. He gets a gig transporting a 1970 Dodge Challenger R/T from Denver to San Francisco and sets out at maximum warp, stopping only for gas and strategy. He commits no crime outside of speeding, and fleeing the cops who are trying to stop him simply because he will not stop. He finds allies along the way, including an old prospector, a DJ named Super Soul, and a hippie who seems to me to be an alternate ending to the life of Peter Fonda's character Wyatt in \"Easy Rider\". He drives and drives and drives until he meets his destiny in a tiny town on the California-Nevada border at 10:04 AM on some unnamed Sunday.<br><br>Why? Is it because of his past; ex-cop, ex-racer, tragically bereaved? Is it because of the truckload of speed he takes at the beginning of the movie (draw your own metaphors between Kowalski's internal use of the noun and external use of the verb)?<br><br>Or is it the road, the infinite expanses of the Southwest, the silence, the freedom, the sound of the motor surging, the tires spinning, the wheels gobbling up and sitting out the black asphalt? Who knows? Kowalski seems indifferent as to why he drives, only that he must drive, must evade, must get to where he is going and will not - can not - be stopped.<br><br>Do yourself a favor. Rent the original, don't see the '97 made for TV movie (it has some high points, but it's like watching the '99 \"Psycho\" before seeing the Alfred Hitchcock original). In fact, rent this and \"Two Lane Blacktop\" from Monte Hellman, and \"Mad Max\" and/or \"The Road Warrior\". Watch all of them in as close to one sitting as you can get.<br><br>If after watching these movies, you don't understand how they're expressions of the same call to the open road, return them and give up. Not everyone was meant to hear it, just like not everyone has perfect pitch or the ability to wiggle their ears.<br><br>This movie drove me (pun intended) to take the handle kowalski and buy a Challenger of my own (flame red, 1973, you see the 1970 R/Ts are very hard to get).<br><br>It probably won't do the same for you, but if you've ever been driving down the open road and wondered what would happen if you _didn't_ get off at the next exchange, in fact if you never got off at all, then this film is for you.<br><br>And I hope the next ignoramus who compares this masterful film to \"The Dukes of Hazzard\" loses his brakes and plows into a line of parked Harleys outside some bar with a name like Whiskey Junction or the Dew Drop Inn.","user":"L_Miller","rank":[133,154]}]