[{"title":"Silly Little Film","rating":6,"date":"13 January 2007","review":"Scared Stiff is definitely a film that most B horror fans should venture into seeing. It literally has EVERYTHING. Horrible editing, awful acting, a script that goes nowhere, off the wall gore (at the end), and an incredible silly ending!<br><br>Kate, David and Kate's son move into and old house. Kate is an actress and David is a therapist. When they move into this house things start going very strange as Kate starts seeing things, along with her son. It turns out that the house they moved into belonged to an evil man that tortured slaves back in the late 1800's. As the family stays in the house lounger, the more possessed David becomes.<br><br>I have a soft spot for movies like this. Yes, it was a terrible film. No doubt about that. But, did I enjoy this film... I would have to say yes. For fans of a genre long dead this is definitely worth seeing as the story is actually not half bad. It is everything else that brings this movie down. Example: there is a scene in which a man is hanging outside of a window. We get a close up of his face for roughly 15 seconds. At the end of the scene, we see the mans eyes move. Truly poor editing. If you watch this movie you will see many inconsistencies. For me, that is what gives it its charm.<br><br>Goofy movie that is well worth watching for all of you 80's horror fans. 6/10","user":"CMRKeyboadist","rank":[18,18]},{"title":"Imaginative Low Budget Horror","rating":6,"date":"23 May 2019","review":"I'm not going to sit here and say that Scared Stiff is some sort of lost classic of the genre. It's not. It has pacing problems and you're never quite sure if it's a haunted house movie, a \"she's losing her mind\" movie, or an installment of the Nightmare on Elm Street franchise, but when it gets something right, it really gets it right.<br><br>A single mother pop star moves into a spooky antebellum mansion with her child and boyfriend and not only begins to unravel the house's gruesome history, but starts to believe that she's actually seeing the previous owners in her day to day life.<br><br>Scared Stiff starts out as a typical haunted house film. The lead character is plagued with visions and dreams of the wicked slave owner who used to live there and she thinks she's losing her mind. All of a sudden, it seems as if her doctor boyfriend can't be trusted either and it turns into one of those \"is she crazy or being gaslit?\" movies, before pulling out all the stops in a genuinely imaginative and nightmarish final act.<br><br>It's not as if Scared Stiff is brilliant, but it's competent and the final act is incredibly memorable, creepy, and downbeat.","user":"tildagravette","rank":[9,9]},{"title":"Strictly for 80's Horror Film Fans !!!","rating":8,"date":"20 July 2019","review":"If watched in the context of 1980's horror films this is a great little forgotten horror, fits in with films of the era such as 'House' &amp; 'The Gate' movies, has the real film of USA middle budget horror films, it's a little surprise gem of that era .... enjoyable horror flick.","user":"Moviereeeels12","rank":[7,7]}]