[{"title":"How American Manhood Has Changed","rating":10,"date":"17 May 2013","review":"I remember something that Roger Ebert said in an interview with Martin Scorcese. Ebert said that \"Raging Bull\" was a great movie. People would protest that they didn't want to see it because they didn't want to see a film about boxers. No, Ebert insisted. The subject matter of a film is not the heart of the film. Rather, it's how well a film is made that matters. An expertly made film about boxers is better than a badly made film about a topic you may be interested in. So, no, I'm not a man; I'm not divorced. But \"The Odd Couple\" was so well made that I fell in love with it. I surprised myself by laughing out loud throughout the film. <br><br>\"The Odd Couple,\" of course, is the story of news writer Felix Unger leaving his wife and children and moving in with his friend, sports writer Oscar Madison, who is himself a divorcée. Oscar lives in an eight-room Manhattan apartment, which he used to share with his wife and their kids. Felix is neat; Oscar is messy. Sounds pretty trite.<br><br>But the movie is a revelation. The script reveals surprising depth about love, hate, and human relationships. The Walter-Matthau-Jack-Lemmon team is like a well-oiled machine – they seem to have perfected their shtick together through several lifetimes. <br><br>Jack Lemmon plays the entire movie completely straight. He gives the exact same kind of performance as he did when he was acting in \"The Days of Wine and Roses,\" a hyper serious film about alcoholism. When Lemmon, as Felix, is upset about his meatloaf burning, he shows as much agony as he showed in the previous film about a drunk ruining his own life. It's hysterically funny to watch this poor schmuck wrestle with his petty obsessions and compulsions, oblivious to how he affects others. Even as you laugh at him, you realize he can't help himself. Felix Unger has Asperger's. <br><br>What has changed in America, and American film, that this film from 1968 feels like a time capsule from a lost moment in America? Oscar lives in a spacious, eight-room Manhattan apartment. Manhattan real estate has become more expensive, of course. But it's more than that. <br><br>The words that kept going through my head as I was watching the movie were \"grown-up\" and \"intelligent.\" <br><br>Oscar, Felix, and their poker buddies are six white guys. They meet and play poker. There are no scenes where these adult, white men are revealed to be inept in comparison to women, blacks, or homosexuals. There are no scenes where the sassy gay man instructs the straight men on how to dress or create romance. There are no scenes where the \"magical negro\" shows the men that they can't dance. There are no scenes where a woman puts the men down for not knowing how to take care of children or shows the men up as being blinded by lust. There are no scenes where these straight, white men are made to apologize for being straight, white men. <br><br>The men are grownups. They have jobs. They wear adult clothing. They wear white shirts and ties, slacks, belts, and shiny shoes. Oscar does wear a backwards baseball cap, but he is the clown of the group. And he does not wear it throughout the film. When he goes out, he dresses properly. <br><br>They speak of their marriages as if marriage were something important. They speak of their children as if they love them. <br><br>They go on dates. They ask women out, dress up for the occasion, and make witty banter with subtle double entendres. <br><br>While watching \"The Odd Couple,\" I thought of recent Judd Apatow comedies starring men like Jason Segel, Paul Rudd and Jonah Hill. These current male stars all play children; they all play losers. They play failed men. The humor in these films is built around what pathetic creatures they are. In \"Forgetting Sarah Marshall,\" Jason Segel, who is fat and prematurely saggy, is shown fully naked. The nakedness highlights his humiliation when his girlfriend, Sarah Marshall, dumps him. These films all use the F word over and over in a manner that feels desperate and limited. <br><br>There is one very sly, very funny reference to the f word in \"The Odd Couple.\" Oscar complains to Felix Unger that he is tired of getting little notes from Felix like \"We are all out of cornflakes. Signed, FU.\" Oscar says it took him hours to figure out what \"FU\" meant. A funny joke. Delivered deliciously. The only time \"The Odd Couple\" has to refer to the F word to get a laugh. <br><br>I've never felt, while watching a Judd Apatow comedy, that I was gaining any insight into the human condition. There are so many payoff moments of absurd comedy in \"The Odd Couple,\" as when Oscar steps on a vacuum cleaner cord and then takes his foot off the cord at just the right moment to send Felix reeling. But there were so many moments that made me say, \"Gosh, yes, that's what human relationships are like. That's what it's like to love/hate another human being.\"<br><br>I can't imagine a film like \"The Odd Couple\" being made today. A genuinely funny, intelligent, rich, grownup comedy about men that shines light on the human condition and that need never speak the F word to get a laugh. And I can't imagine anyone other than a Trump being able to afford that eight-room apartment in Manhattan.","user":"Danusha_Goska","rank":[35,38]},{"title":"\"I'm a neurotic nut, but you're crazy\"","rating":8,"date":"26 September 2008","review":"I don't think I've really ever given Walter Matthau his due as a comedic performer. He's certainly been wonderful in plenty of lighthearted roles, but I guess I always put his success down to his characters' grumpiness and ruthlessness, a gruff contrast to the flamboyant personality of his frequent co-star Jack Lemmon, and, I suppose, a natural extension of his earlier work in dramatic pictures. Watching Gene Saks' 'The Odd Couple (1968),' adapted from a popular Neil Simon play, the realisation suddenly clicked: Matthau is, in his own right, absolutely hilarious! Initially striking the audience as filthy, crude and generally unappealing, his Oscar Madison eventually manages to worm his way into our hearts, culminating in a hilariously overplayed confession of emotions that Matthau rasps out in a voice not entirely his own. At the same time, while holding his own as a comedian, his interplay with Lemmon is, of course, pitch-perfect; indeed, the film rightly belongs to both actors, who have never failed to light up the cinema screen by themselves, let alone together.<br><br>Calling to mind Billy Wilder's screenplay for 'The Apartment (1960),' this Neil Simon comedy builds itself around around a rather morbid premise. Compulsive house-cleaner Felix Unger (Lemmon), having just been evicted by his wife of twelve years, attempts to commit suicide, but fruitlessly abandons the idea after he wrecks his back trying to open the hotel window. Dejected, he arrives at the house of good friend Oscar (Matthau), a divorced slob who lives alone on a diet of potato crisps and green sandwiches (that might contain either very new cheese or very old meat!). Oscar kindly offers Felix a place to stay, but is soon overwhelmed by his friend's finicky personality and constant insistence on absolute cleanliness. The pair form an unusual sort of marital arrangement, with Felix assuming the role of the effeminate and constantly-nagging wife, and Oscar as the sloppy, unappreciative husband who always comes home later than he's supposed to. This is a marriage that barely lasts three weeks, and, by the end of it, we can completely sympathise with Felix's ex-wife, who remains unseen.<br><br>'The Odd Couple' is a terrific comedy, most of all because it has a lot of heart. For all their arguing, it's obvious that the two roommates have plenty of affection for each other, most movingly seen when Felix tries to launch into a furious tirade, instead  perhaps inadvertently  ending up informing Oscar how \"tops\" he his. The pair's four poker buddies (John Fiedler, Herb Edelman, David Sheiner and Larry Haines) are also constantly badgering each other about some obscure annoyance, but you can't deny that they've got the best of intentions. Their decision to treat Felix as though nothing has happened to him may have sounded fine in theory, but maybe being ignored wasn't quite the correct solution to Felix's gloomy feelings of inadequacy and inconsequentiality. Unlike some comedies based on popular stage plays {I was recently disappointed by Wilder's 'The Seven Year Itch (1955)}, this film doesn't simply strike at the same chord throughout, and the relationship between the two leads is progressively developed, through tears, laughter and much disagreement.","user":"ackstasis","rank":[13,13]},{"title":"Lemmon and Matthau create an awesome partnership","rating":9,"date":"17 June 2004","review":"SPOILERS<br><br>In the words of Jean-Paul Sartre, \"Hell is other people\". In \"The Odd Couple\", Jack Lemmon and Walter Matthau demonstrate just how accurate this can be. As Felix Ungar and Oscar Madison, Lemmon and Matthau respectively create two good friends who decide to live together. As the two begin to slowly grow more and more frustrated with each other, the laughs come thick and fast, before Felix departs, leaving Oscar a changed and more cleanly individual.<br><br>Jack Lemmon as Ungar is absolutely superb as the neurotic, cleaning obsessed divorcee coping with life as a single man. Walter Matthau in contrast to Lemmon's character is equally as good as the slobbish sports writer who simply wants to play poker to earn money for his child benefits.<br><br>Lemmon and Matthau are magnificant in their selected parts, to some degree dependent upon the beautiful script by Neil Simon, and simultaneously because they work well as a team. As two friends who are inherently different in lifestyles, although similar in relationships with ex-wives and children, these two, late, great actors create a partnership which is practically impossible to recreate. So great in fact, that the world screamed out so much for something similar, that two years before Matthau's death and three before Lemmon's, the characters were reunited in an inferior sequel. This idea, whilst following Hollywood's irritating obsession with sequels, might have worked to a certain degree, but at the same time, it could never come close to replicating the genius of this original film.<br><br>Ultimately it's not really possible to say anything else. With Simon's amazing script, filled with humour and laughter, the creators of this film were already onto a hit. The casting of Jack Lemmon and Walter Matthau as Felix Ungar and Oscar Madison though, is the most important part of this film. \"The Odd Couple\", with it's traditional soundtrack (which even gained a tribute in \"The Simpsons\"), it's excellent script and it's genius leading men, is a tribute to cinema and a feature for history to remember.","user":"TheNorthernMonkee","rank":[21,23]}]