[{"title":"An undeservedly maligned fantasy treasure","rating":8,"date":"15 August 2001","review":"To truly understand and appreciate \"Return to OZ\", you've got to know two things.<br><br>First off, this is NOT a follow-up to the classic MGM movie.  This can't be emphasized enough.  It is actually a synthesis of the first five or so sequels to the BOOK.  (This isn't a dig at the movie, mind you.  If you don't like it on some level or other, you can't be human.  It's just that the movie was based on the book in the respect that the characters in the movie had the same names as the characters in the book.)<br><br>Secondly, L. Frank Baum's original, printed-page OZ is, quite possibly, the most messed up imaginary universe ever created.  There's a land of beings who throw their own heads at you as weapons.  There's a land of sentient vegetables who raise *people* in their gardens (think \"Motel Hell\" and you've got the idea).  To top it all off, it turns out that Dorothy's buddies are really good at killing things; in particular the dear, heartless Tin Man who bloodies up his hatchet with unsettling apathy.<br><br>What I'm trying to get at here is that \"Return to OZ\" is an OZ movie that is much more faithful to the books.  Much more \"THIS is how long you have to be alive!\" than \"We represent the Lullaby League\".  I think it goes without saying that you'd be legally insane to show it to little kids, but fantasy fans, OZ enthusiasts, and fans of cult movies should hunt it down as soon as possible.<br><br>By the way, please note that the old-school herky-jerky puppets and claymation monsters in this movie are scary as all get out.  Compare this to the awful remake of \"the Haunting\" with it's stupid cartoonish CGI creatures (and this isn't a dig at computer animation, but since the technique is inheritely realist, it's not scary).  There is a lesson here.","user":"La Gremlin","rank":[72,77]},{"title":"Yep, dark and disturbing","rating":9,"date":"19 August 2005","review":"After reading about 40 of the other comments here, all of whom say RETURN TO OZ is dark and disturbing, I will make a different comment. In the early 80s Disney certainly were off the cash trail with a range of films, each expertly produced, that were box office disasters. One may recall SOMETHING WICKED THIS WAY COMES, TRON, THE BLACK CAULDRON, ONE MAGIC Christmas and a few others that had much to offer any thinking crowd,and each had special effects that were quite astonishing. Disney were in a very bleak period and the films, attempting to reflect perhaps a more mature or even grown up perspective chose, oh dear I have to say it: a dark and disturbing theme. At the time of release every critic bleated at the grim and melancholy tone of RETURN TO OZ, and sadly themselves neglected to celebrate the original book look, a choice Disney execs applauded themselves for. One Exec infamously said to us theatre owners: \"We're going for the Frank L Baum book illustrations and nothing like that 1939 vaudeville thing\". Oh dear, I thought at the time. You mean the world's most popular kids film? Well. $27 million dollars later in production costs returned maybe a quarter in theatre film rentals and RETURN TO OZ for all its merit and lavish production care and superb scary special effects....was consigned to the Disney dud bin. At the time I was irritated by the fixed goony expressions on Jack Pumpkinhead and the Scarecrow (loved Tik-tok, though, a fascinating and completely compelling design and movement piece) This time around I didn't mind it and actually appreciated the fact that they were 'book' expressions. Viewed 20 years later on a Disney DVD of dubious quality, I have to say it is a film more suited to these dark and disturbing times and if released today would certainly get a better reception and better crits...and possibly make a lot of money. I think the world is tuned into this type of family film more now than in the Flashdance 80s. The production values of RETURN TO OZ are simply breathtaking. Scene after scene perfectly realised: the green walled horror of the psychiatric asylum in reel one, the amazing claymation of the Gnome King, and especially the glittering halls of Mombi's castle. One genuinely screamworthy scene in the hall of Heads with a headless Queen rushing about in a nightmarish vision is almost only for adults, so intense is it's genuine horror. The glittering climax of a restored Emerald City is a triumph of green and silver/gold set design, I defy any viewer not to rewind it several times just to see each and every part. Yes nominated for 5 Oscars, it won none and vanished for 20 years. The no-marquee name Fairuza Balk didn't help the public embrace, no matter how exquisite she is. At least she wasn't named Soleil Moon Fry. In the same class as The Dark Crystal and Labyrinth, RETURN TO OZ now deserves its place there as part of a trilogy of superbly crafted fantasy for smart kids and astonished adults. That 'vaudeville thing' it certainly isn't. But not a failure either. The DVD is lacking trailers and production material that should and could be included. Bad Disney! Good film! I also defy any viewer not to shriek with laughter at the Gnome King revealing he is wearing the ruby slippers, a sly joke well presented.","user":"ptb-8","rank":[105,117]},{"title":"When all you can do, is return to Oz...","rating":3,"date":"3 November 2000","review":"As a young kid, The Wizard Of Oz was one of my favourite-est movies in the world. The movie was bright, colourful, cheerful, happy and undoubtedly saccharine. And while it was a Box-Office smash and collected millions of Oz fans worldwide, it displayed nearly none of the points that made the book series so successful. So when after viewing Return To Oz, I was extremely happy.<br><br>While thousands blasted the film calling it 'dark' and even 'scary', I thoroughly enjoyed it. New characters, magic powders, creepier witches, talking chickens and flying couches - what more could an imaginative youngster want?!<br><br>Faruiza Balk portayed Dorothy Gale exceptionally well, and at times, takes on Judy Garland's version so similair, it's scary! Return To Oz was, I mean, is, better than the original, because it was more based on the books, whereas The Wizard Of Oz was a cross between the original book, bittersweet sets and a symphony orchestra.<br><br>While some disagree, I believe that 'Return' was not all a weak sequel, but more of a non-sequel sequel, which had little to do with the original, and had an exciting, haunting, script, which worked really well.<br><br>Well it's been about 10 years since I first saw Return To Oz, and I still think that it's one of the best children's movies ever made (however scary) and it's in everyone's best interests to rent it out - even if you hated it's predacessor.","user":"David, Film Freak","rank":[78,86]}]