[{"title":"Marg Helgenberger","rating":7,"date":"23 April 2018","review":"After seeing a movie with Marg Helgenberger made in the 90's \"Death Dreams\" with Christopher Reeve, I felt the need to look for other Marg Helgenberger performances besides her famous turn in CSI - To my surprise, not many, except \"Death Dreams\" where she gives a performance that goes straight to something truly personal. She is amazing, amazing! That's how I got to Always. The only Spielberg film I hadn't seen. The film is a sort of remake of \"A Guy Named Joe\" charming with a lovely central performance by Holly Hunter but where is Marg? She's way back in the background. Beautiful and real but way too far away in the background. The most memorable memorable moment, at least for a film buff - is the last film appearance by Audrey Hepburn, as an angel.","user":"francozeff","rank":[28,28]},{"title":"Excellent movie for aviation buffs","rating":10,"date":"6 July 2012","review":"My husband asked me to marry him after we saw this movie. He was a helicopter pilot and we had met at an air show. We both loved vintage aircraft so this seemed to be just the movie to see. We both laughed and cried so hard during the movie. Little was I to know that 13 years later I would lose my husband while he was flying. It took me some years to watch this movie again and I too cried through the whole thing. It is so personal to me. There are times when I feel, like Holly did, that I can hear my husband talking to me and guiding me. There is a lot to be learned from this picture about life and love. I highly recommend this picture.","user":"jelliott03","rank":[24,24]},{"title":"If you have ever had a loss, this is the one for you!","rating":23,"date":"23 July 2003","review":"I lost my husband suddenly about 2 years ago.  I first watched this movie about 10 years ago and I enjoyed it.  Then, I watched it last night again. This time, it was much more personal to me, and I still enjoyed it,only in a different way. The relationship between Holly Hunter and Richard Dreyfuss was portrayed wonderfully. The selfishness he felt when seeing her and Ted together for the first time was so very honest and painful. The pain she feels at moving on with her life, the love and concern John Goodman shows her, the uncertainty of her future and the way she will handle it kept me on the edge of my seat. The emotions were so real and many of them were the same ones I have felt over the past 2 years.  The scene where Dorinda dances alone yet with Pete simply sent me to the tissues. When she is putting out that last fire, and is contemplating the rest of her life alone hit home as well. I cried for almost the entire movie this time. The actors portrayed their characters as real as can be, and I truly felt their pain and confusion.  I read the book years ago and I feel that this is one of the few times the movie is as good as the book. This time after watching it, I actually was able to find a little peace in my life situation.  If you have ever suffered a major loss in your life, I wholeheartedly recommend this movie- even if you haven't, the acting, the script and the movie as a whole gets a 9.0 in my book.  Keep a box of kleenex nearby.","user":"mama_lisa1961","rank":[74,84]}]