[{"title":"Nice place to visit, but I wouldn't want to live there!","rating":4,"date":"4 November 2002","review":"There's nothing spectacular about this Canadian-made slasher flick, but it still provides a few jolts, a bit of the creeps and a few unintentional laughs.  Grant plays a strong-willed TV host who's crusading for the rights of a woman accused of murdering her husband (following years of abuse from him.)  Unfortunately, this ticks off loose cannon Ironside and he decides to shut Grant up...permanently.  His first try doesn't quite do the trick, so he has to infiltrate her hospital to finish her off, hence the title.  Purl plays a Florence Nightingale in waiting who's devotion to Grant makes her another target of Ironside.  Shatner has a thankless role as Grant's producer/lover.  Grant turns in her usual committed, thought-out performance, but it's for naught in a routine thriller like this.  Ironside is convincingly slimy and treacherous.  His almost wordless performance is effectively creepy.  Purl is likable and solid in an impossibly idealized role (the lady works overtime at the hospital and volunteers at the free clinic while trying to raise two kids all with a smile on her face!) Shatner fans will be pleased to see him looking rather handsome and tan, but he doesn't get to do very much.  The film has a very unsettling tone throughout, aided by an eerie score and claustrophobic settings.  It also features many cliches of the genre (absence of logic in the characters, unrealistically deserted settings, sluts being punished for their sexuality, etc...)  Still, it's creative enough and occasionally unpredictable enough to hold interest.  Some of the acting in minor roles (notably the nurses) is weak, but Zann does a pretty decent job as a slutty date of Ironside's and the leads hold the film together (as much as they can with the somewhat contrived script.)  Grant's conviction to her role and Ironside's steely determination go a long way to saving the movie.","user":"Poseidon-3","rank":[19,23]},{"title":"This film works on technique, not logic, and not a bad try.","rating":6,"date":"2 May 2006","review":"It's took a long time for me to get around to see this film. I distinctly remember being freaked out by the TV ads with the building's lights all being shut down to revealing the skull you see on the poster.<br><br>Well, if you have patience and you like old school films, you may find VISITING HOURS entertaining. It is one of those films that keeps you thinking and works more on your emotions, along the veins of DePalma's DRESSED TO KILL or, these days, any film by M. Night Shaylaman. There are some hit and miss elements with the viewing, but Jean Claude Lord gives it a good shot, in both his directing and editing. Fans of Lee Grant or William Shatner won't find much to endure: it's Michael Ironside who's really the star of this picture. Not as gory nor sexy as many of the other films of this genre during the early eighties, but it certainly is better than half of them--and specifically tries to avoid copycating. If you're not too cynical or sarcastic, give VISITING HOURS a watch.","user":"lastgaijin","rank":[15,18]},{"title":"Stupidly under-rated serial killer movie","rating":22,"date":"22 December 2010","review":"VISITING HOURS is a largely laughed-at serial killer flick starring Michael Ironside. I suppose many of the laughs generate from William Shatner being in the film, playing a concerned boyfriend. I've never understood the fixation with Shatner as a comedy figure. Shatner is OK in his role, playing it completely straight and not completely terribly. It seems in getting fixated on the (in my view, non-existent) laughs from Shatner, viewers seem to have a blind spot to a lot of good things that VISITING HOURS achieves.<br><br>Ironside is strong as the killer (Colt Hawker), whose desire to kill comes from a terrible childhood and an abusive father. He identifies with his father, and loathes women because his mother threw boiling water over his Pa's face. Seems a bit of a stretch, but it wouldn't be the first time sometimes chosen the abuser over the person they abuse.<br><br>Colt becomes a misogynist, and turns his attention onto Deborah Ballin, who speaks out against violence towards women. She's a little militant about it and annoys a few people, so it's hard for the cops to figure out that Colt is the one hunting her down.<br><br>Some of the kill scenes are genuinely affecting. Colt likes to takes pictures of his victims as they're dying, and one - where he pulls a breathing tube from an elderly lady - is harrowing. Don't forget that Ironside was great in STARSHIP TROPPERS and brilliant in TOTAL RECALL as the supremely slimy Richter, and he excels in a similar role here. It's pretty baffling why Ironside ended up in TV series/movie hell given his excellence in playing the bad guy. Just the luck of the draw.<br><br>But the main plus of VISITING HOURS is that it's incredibly well shot. It's wildly voyeuristic, with lots of uncomfortable close-ups and point-of-view shots... and lots of lingering on people's suffering. The director - Jean-Claude Lord - has made nothing else of note. Even his name rhymes in a comedic way. Lord started out in France, then ended up doing US TV movies. But VISITING HOURS has a slight Hitchcock vibe and the level of voyeurism that makes you feel a little grubby just watching the damn movie.<br><br>I'm not saying VISITING HOURS is a classic. It's not up there with HENRY, and it's not up there with the next rung of excellent serial killer movies... say something like ANGST or HIGHWAYMEN. The pacing is a little laboured, and there are passages of ropey dialogue. But VISITING HOURS is a very good movie. It certainly is stupidly underrated, and is definitely worth checking out for a well-directed slice of slimy horror.","user":"MurderSlimPress","rank":[17,21]}]