[{"title":"My favourite of all the Disney animated movies and worth a look for any Disney fans.","rating":10,"date":"8 May 2005","review":"For a lot of people on this site, this is either one of thew best Disney movies or one of the worst. There is about 40 animated Disney movies and my personal favourite will always be the mad world of Wonderland. I don't actually know why but to me this is what i always thought about as a child, a mad world where simply nothing made sense. It goes like dynamite at only seventy two minutes and in that they have an array of entertaining characters and fourteen entertaining songs. To me it is the genius of Disney creating an entertaining look at a child's world. I think it is because of the Jungle Book that this is not as popular as some of the Disney Classics but you can't help but smile when you watch the Queen of hearts and the Mad Hatter being their own creative self's in the wonder of this amazingly clever gem","user":"greatbritain1989","rank":[73,82]},{"title":"A wonderful Disney adaptation of Lewis Carroll's classic novels.","rating":9,"date":"20 January 2003","review":"I was a little worried when I went to watch the film version of Alice In Wonderland, because I just read the novel and Disney has a tendency to dumb down the material that they make into their films with goofball romantic nonsense and cutesy talking animals. While I did get more than the traditional share of talking animals with this film (as well as a variety of other inanimate objects), the film stayed more faithful to the original story than is generally expected from a Disney film. On the other hand, this WAS made in 1951, which makes me wonder what a more modern adaptation would look like. <br><br>I read Alice In Wonderland and Through The Looking Glass for English 180 (Children's Literature) at the University of California, Davis, so needless to say, I read it with more of a literary appreciation than is generally applied to children's books. I was pleased to see so many of the characters from the second novel in this version of Alice In Wonderland (such as the Cheshire Cat, the talking flowers in the garden, and Tweedle-Dee and Tweedle-Dum), although I must admit that I was slightly disappointed to see that Through The Looking Glass has been assimilated into this version of Alice In Wonderland rather than adapted into its own film, which I think is an honor that it certainly deserves. <br><br>As far as being a full length feature (although rather short at roughly 75 minutes), however, I think that this movie does justice to both stories, converting them into a single story rather smoothly, and only leaving out things that will only really be missed by people who know the novels enough to be disappointed that certain things were not included. I, for example, would have loved to see the whole chess story in Through The Looking Glass included in the film (there certainly was time for it), where Alice travels through Wonderland on her quest to become a Queen herself, but I am more than happy with how this film turned out.<br><br>One of the only things that I noticed about this film that did not match up to the quality of the novels is that the books have so much more in them for adults than the movie does. There are so many tricks with language pulled in the books, such as in the conversations with Tweedle-Dee and Tweedle-Dum as well as several other characters, that it really makes you think about the English language as a game with which an endless variety of tricks can be played. In the film, this is hugely downplayed, even if only because it is done visually and the language tricks pass by so fast that kids are almost certain to miss them and even the most attentive of adults will have a hard time keeping up with them.<br><br>As a whole, however, Alice In Wonderland is so wildly entertaining that the loss of some of the literary substance does not detract from it as a terrific tale of adventure and discovery, certain to be enjoyed by people of all ages. I have heard plenty of rumors that Lewis Carroll was on any of a variety of drugs while he wrote the novels (and plenty of rumors that he wasn't on any drugs at all), but there are certainly some things in the books and in the movie that could have only been conjured up by the most, um, eccentric of imaginations. We may never know for sure, but at least we have some wonderful entertainment.<br><br> Read the books to your kids.","user":"Anonymous_Maxine","rank":[32,36]},{"title":"Maybe not as 'charming' as most Disney films...","rating":9,"date":"28 January 2001","review":"...and certainly \"Pinocchio\" had a more popular and memorable song score, but for my money I'd pick \"Alice In Wonderland\" as one of Walt Disney's top achievements in animation. From Lewis Carroll's story, and filled with knock-out colors (pinks and blues and reds on inky blacks), this episodic tale would not have worked so well if the direction hadn't been so graceful, setting a light, jovial mood, and the songs so tongue-trippingly clever. Alice herself (voiced by Kathryn Beaumont) is lovely and funny, the supporting characters appropriately manic, and the quiet moments gently even out the craziness (as with the Tulgey Wood/\"Very Good Advice\" sequence). Disney certainly runs hot (\"Pinocchio\", \"Bambi\") and cold (\"The Sword and the Stone\"), but this fantastic journey into nonsense, from a practically-unfilmable book, is endlessly interesting from a visual standpoint. ***1/2 from ****","user":"moonspinner55","rank":[45,55]}]