[{"title":"great picture","rating":8,"date":"20 November 2004","review":"In Holiday Inn it isn't Bing Crosby or Fred Astair that makes the movie outstanding, but rather the relatively unknown \"B\" movie star of the time, Marjorie Reynolds. As you watch this movie you can \"feel\" the mood that Marjorie is portraying at the time, just by the look on her face. For example, during the the \"Easter\" scene, her eyes and smiles say it all, you can see she is in love, and as she sings \"White Christmas\" at the end you can feel the sadness of her character - throughout the entire movie she says more with her facial expressions then the most popular movie stars do today in their entire careers... If you love truly good acting, Holiday Inn will make you smile and make you cry, it will bring back memories of a time when ladies could truly dance in high heel shoes, we don't see that type of dancing these days in movies. Picture quality, sound and special effects are not of primary importance in these kinds of films, these are the kind that rely on your own imagination and feelings, much in the way you do when you read a good book. <br><br>These older movies serve up so much good feelings they could be used to replace prescription meds for those feeling bad.","user":"jel-12","rank":[77,82]},{"title":"Bing was a marketing genius.","rating":10,"date":"25 June 2004","review":"Finally Paramount gave Crosby a big budget musical and didn't rely on his charm and personality to carry the film. The budget went to hire such outside talent as Fred Astaire and Irving Berlin. And none of them disappoint.<br><br>In the first of two films Astaire and Crosby did together the characters are remarkably the same. Astaire is the elegant and charming show business professional who's ambitious for success. Crosby is the talented, but lazy partner who just wants a life of ease and comfort and not to work more than he has to. Small wonder that their double act broke up. But now enter a complication. They both get interested in the same girl who in this film is Marjorie Reynolds.<br><br>Crosby dreams up the idea of a nightclub/hotel called Holiday Inn where they only work on holidays. He wants Reynolds to help with the shows there. Astaire wants her for his act after his other girl partner Virginia Dale runs off with a millionaire. And the fun starts. Now since this was Crosby's home studio and he's first billed, just who do you think gets Reynolds in the end? As maid Louise Beavers put it, don't sit and mope because some slicker stole your gal.<br><br>Irving Berlin writes a majority of new songs to supplement a couple from his vast trunk of songs mostly about our holidays. By that time Berlin had extracted an agreement which became standard for all the films he wrote for. Not one note of non-Berlin music is ever heard in a score he writes. Just listen to this and just about any other film Berlin is associated with. Even music in the background is his.<br><br>The hit song in this was supposed to be Be Careful It's My Heart, the Valentine's Day song, sung by Crosby and danced to by Astaire and Reynolds. It did have a good deal of success. But the success of White Christmas was exponentially phenomenal. It netted Irving Berlin his one and only Academy Award and for Bing Crosby his number one item on vinyl. In fact everyone's number one item on vinyl.<br><br>I don't know if Bing Crosby ever set out to become the voice of Christmas, but if he did he was a marketing genius. If he's known and appreciated for anything with today's audience, it's for that. White Christmas became the first Yule song he was identified with although he had recorded some Christmas material before that. After this he started doing the holiday music in serious. Just think, along around Columbus Day, record companies even now reissue his Christmas stuff every year and his totals as largest selling recording artist in history grow once again. That's why the Beatles and Elvis, etc. don't have a prayer of overtaking him.<br><br>In fact White Christmas's initial success was so great that Decca wore out the original master putting out records to meet the demand. So in 1945, Decca got Bing, the Ken Darby Singers and John Scott Trotter to re-record it almost note for note. The original 78 had White Christmas with the flipside of Let's Start the New Year Right also from Holiday Inn. The newer version which most people hear has as it's flipside God Rest Ye Merry Gentlemen.<br><br>I don't want to ignore Fred Astaire's contribution here. He does a nice comic turn with I Can't Tell a Lie, the Washington's birthday number where Crosby keeps changing the tempo to upset him and Reynolds. The Fourth of July yields a number for each. Reynolds is kept from the show by Bing's machinations and Astaire has to \"improvise\" something. He \"improvises\" Firecrackers and anyone who knows anything about Astaire knows how hard he worked to get that spontaneous feeling in his dancing. Bing sings The Song of Freedom, reminiscent of James Cagney's Grand Old Flag number from Yankee Doodle Dandy also out in 1942 and Song of Freedom is also reminiscent of what Paramount could have given Bing in the 1930s had they hired someone like Busby Berkeley to give Bing some of the production numbers that Dick Powell had at Warner Brothers.<br><br>So what more is there to say, but sit back and enjoy the fun.","user":"bkoganbing","rank":[81,90]},{"title":"A magical Inn that influenced a hotel chain.","rating":21,"date":"21 July 2003","review":"Everyone has a favourite Christmas movie. For some it's \"A Christmas Carol\", or \"Miracle On 34th Street\", perhaps \"It's A Wonderful Life\", or maybe \"How The Grinch Stole Christmas\". Even Bing's later \"White Christmas\" gets aired locally every Christmas Day, while \"Holiday Inn\" is far more obscure. Yet, this film is my favourite holiday season film. Made long before I was born, I saw it as a child &amp; it had an influence on me. Perhaps the film is dated with its B&amp;W war-time feel but that 1940's elegance is part of the charm. Returning to the \"Inn\" is like re-visiting old friends at a magical, mythical place. It's a treat to see a younger Bing Crosby (compared with his performance in \"White Christmas\")&amp; Fred Astaire, as well as the beauty of Marjorie Reynolds. What may not be well known is that the film provided the inspiration for the name of the Holiday Inn chain of motels &amp; hotels. A Memphis businessman named Kemmons Wilson planned a national chain of motels. He hired a draftsman to draw up the plans. It happened that the draftsman watched the movie while he was working, and he sketched the name of it at the top. Wilson saw it, liked it, and stuck with it. Holiday Inn was born &amp; the first opened in August of 1952, some 10 years after the film.<br><br>Sure, not all the holidays are treated in the film. And the Independence Day segment contains some war-time \"propaganda\" with newsreel shots of McArthur, FDR, &amp; military hardware. But this was the era when Hollywood went to war &amp; stars did pitches to audiences to buy war bonds, etc. Yes, the black-face Al Jolson style \"Abraham\" number causes me to cringe a bit, but the tune is snappy, and the justification is in keeping with the plot as Bing tries to hide Marjorie Reynolds from Astaire. The supporting characters are also fine. There's \"Gus\" the cab driver for the Inn, whom Bing gives 10 bucks to take a detour to keep Reynold's away from the Inn the night the Hollywood men are there. Bing says for that kind of money Gus should take her by way of \"Medicine Hat\" (a prairie town in Canada). I also enjoy character actress Louise Beavers portrayal of \"Mamie\", the Inn's cook. She's not only a mother figure to her two charming kids, but also to her boss. During Thanksgiving, Bing mopes while  Astaire &amp; Reynolds are filming in Hollywood together. He puts on a recording of himself singing \"I've Got Plenty To Be Thankful For\", while he comically criticizes himself - even saying \"you're flat\". Mamie tells him that all he did was tricks to keep Miss Linda. He was never honest with her &amp; instructs him to go to Hollywood &amp; tell her how he feels. The song \"White Christmas\" became a huge hit with this movie. It's sung twice. The first time, Bing is teaching it to Reynolds on the piano &amp; they sing a duet with his coaching. The second time, at the end, it's an unplanned duet. Reynolds is singing it on a sound stage \"mock-up\" of the Inn, once again at a piano. She finds that at the same spot in the song as Bing had done earlier, she picks up his pipe &amp; rings bells on a tree. Then Bing begins to whistle in the wings. Her solo is interrupted as Bing then sings a line or two. The song isn't completed this time! In the later film, Bing sings the immortal song \"just like the record\". \"Easter Parade\" was another Irving Berlin hit from this movie. It would inspire another Astaire movie later with that title.<br><br>This is not a perfect film but it has been an inspiration to me (&amp; to others). The Inn is timeless. I can always re-visit every year or so &amp; the comedy, songs &amp; dance are eternal. Styles change. If \"Jim Hardy's\" Holiday Inn had been a real place, it probably wouldn't survive. The resorts of the Catskills, such as those in \"Dirty Dancing\" fell to changing times. Jim probably would have had to have rock acts in the 1950's (or Rap in the 1990's)! But I can always go home to this Inn &amp; know what kind of enertainment is on tap. And also enjoy Mamie's cooking!","user":"snake357","rank":[50,56]}]