[{"title":"Revolutionary Hong Kong movie","rating":7,"date":"14 January 2013","review":"The Hui brothers revolutionized Hong Kong movie making style with this and other movies. Especially San Hui who also wrote the songs for the movie, invented the modern comedic Hong Kong movie that involves lot more elements than was previously seen in Hong Kong cinema.<br><br>There's action, comedy, slapstick, and above all unique plot that all combines into an entertaining movie.<br><br>In about 10 years from the making of this movie, quality of Hong Kong cinema starts to skyrocket, and eventually rivals the movies made in Hollywood. But you can see all the elements that turned Hong Kong cinema in modern direction with this movie.<br><br>It's a ground breaking movie, and also a very good movie to watch as well. Music is also pretty cool.<br><br>This is a must see movie for an Asian movie fan.","user":"ebiros2","rank":[3,3]},{"title":"Comedy for all eyes!","rating":8,"date":"8 January 2015","review":"This is of the first Hong Kong comedies starring brothers Michael, Ricky and Sam Hui. This film helped launch a new chapter and revolution of films in Hong Kong and it provided tastefully done humor, good messaging, dramatic moments and slapstick comedy. Here, Wong Yuk-See (Michael Hui) heads a private detective agency with employees Pighead (Ricky Hui), Jacky (Angie Chiu) and Lee Kwok-Kit (Sam Hui) and they takes on various cases, some involving adultery, as evident in the hilarious scene of spying on the affair of a tycoon's young wife and her policeman lover (played by Richard Ng of the 80s Five Lucky Stars movie fame). <br><br>It's a nice little movie with an attractive cinematography, terrific acting and solid direction. The simple but captivating story of the detective story just shows how a movie could just rely on substance, drama and good clean comic relief to be entertaining. It also has a positive message of survival the fittest, partnership and redemption. The plot also involves the main villain, brilliantly played by martial arts legend and Wong Fei-Hung movie veteran Kieh Shih. The showdown between him and the detectives provide a classic good guy vs. bad guy concept. <br><br>Lastly, the catchy and funky title song sung by Sam Hui is toe-tapping groovy! <br><br>The movie is not as suspenseful as later Hui Brothers films like The Contract and Security Unlimited, but it's still great comedy that surpasses many of today's films of the 00s and on.<br><br>Grade B+","user":"OllieSuave-007","rank":[2,2]},{"title":"Pioneers of A New Generation of Hong Kong Comedies","rating":8,"date":"17 July 2013","review":"I just watched this again and was laughing so hard at certain parts that I was crying. Private Eyes is not the first of the Hui brothers comedies. They began with a variety show that mimicked the highly popular Laugh In on NBC between the late 60s and early 70s. Both the Hui brothers were educated in English-language schools in Hong Kong and no doubt were highly influenced by western cultures. Sam, by the way, was the lead singer of a local rock band and wrote many of the songs on their movies. Through their work, they also pioneered a new musical trend in Hong Kong that combines western popular music and Chinese lyrics. In their TV shows and movies, you can clearly see the same western influences with a Chinese twist. Other than the much more easily understood slapstick in this movie, parts play on linguistic twists and references to the temper of the times. If you are not familiar with the 70s or do not speak Cantonese, you will miss some of the humor. I've turned on the English subtitle while watching this movie and it is nowhere as funny as it is in Cantonese. Even in traditional Chinese subtitle, something is lost as the Cantonese vernacular dialogue cannot be fully translated into the very formal traditional writing.","user":"traveler85","rank":[2,2]}]