[{"title":"Everything we do matters....","rating":8,"date":"2 December 2001","review":"I've been intending to write a review of this film for some time, but only now have I actually managed to get my thoughts down for the perusal of others.<br><br>I never had the pleasure of seeing this film on the `big screen' which is a shame, as it is often visually stunning, but I have revisited it on video numerous times over the years, enjoying it immensely every time.  It definitely is on my personal list of favorite movies, and for more than just starring Kiefer Sutherland and Kevin Bacon, two of my `actors to watch.'<br><br>Perhaps I appreciate this film so much because it appeals to my slightly off-kilter taste in entertainment.  I like my movies a bit left of center - unpredictable and fresh.  And whether or not you `believe' the story line of the film, you have to admit, it is different!<br><br>Everyone has different tastes and opinions, but my impression of some of the negative reviews of this movie is that the viewers never really saw past the surface level of this film.  They got caught up in technicalities, `Why would there be green lighting in a subway?' or `Why would medical students pull such a stupid stunt?' and failed to see the artistry and psychological depth of the piece.<br><br>Yes, there are some medical and technical aspects that do not make logical sense, but if you are willing to suspend disbelief just a tad, this can be a very engaging film.<br><br>First, a note about the artistic quality of the movie.  Some have complained about the murky lighting, and the illogical nature of the sets - but for me, the use of innovating lighting techniques, the plastic and sheet draped sets, the unusual settings in old buildings and dank, dripping tunnels, the use of statuary, rain and billowing curtains - all add a poetic flavor to this film, a haunting beauty that suits the dark nature of the questions being asked about life, death and forgiveness.<br><br>I will focus on just two examples; in an alley scene, a change in lighting allows for certain elements of the set to come dramatically into focus, then to fade away once lighting returns to normal.  It is an innovative means of conveying a shift in the `reality' of the moment, and works beautifully. We are also allowed to see the interior of the character's apartments - contrast the warm wood, bright colors, golden lighting and cluttered comfort of Labraccio's rooms with the stark, white void of Nelson's.  Both are reflective of the characters themselves.  Nelson's lack of `objects' reflect our lack of knowledge about his past. and his carefully constructed mask that keeps his companions at a distance.  His past, we come to learn, is one of chaos and conflict.  He has determined to leave that behind in favor of an uncluttered emptiness. unfortunately, the emptiness is also reflective of his relationships with others, a realization he comes to along his personal journey of self-discovery in this film.<br><br>Flatliners is not your typical horror film.  Nor is a typical drama or suspense movie.it is rather more of an amalgamation of all, having the best elements of all genres intertwined in a complex, suspenseful plot.<br><br>\nThis is an ensemble piece, and the cast does an excellent job of breathing life into their individual characters.  Your immediate impression is that the characters are each representative of a well-established `stereotype': The female ice queen, the slightly neurotic 'physician', the playboy and the socially conscious `nice guy' etc.  However, as the film progresses and the characters are further fleshed out, they take on multiple dimensions and depth.<br><br>Most interesting of all is Sutherland's character of Nelson.  Nelson is not a character that is easy to like - indeed he is a bit of a b**tard, a master manipulator who definitely places self-interest above all else.  Yet, Sutherland plays him with a hint of insecurity that lends him a certain appeal.  As events unfold, you come to realize that much of Nelson's unpleasant personality is a smokescreen, a protective mask behind which hides a very uncertain and vulnerable young man burdened by a terrible secret.<br><br>By revealing bits and pieces of Nelson's complex personality throughout the film, the writers, directors and cast gradually lead you towards a greater understanding of and sympathy for him.  The character who started out as a `jerk' becomes important and valued in his own right - as you learn to `forgive' his previous behavior in light of new information.  Your journey of discovery with Nelson reflects the characters own journeys towards self-understanding, as they too come to realize that everyone has value, and `everything we do matters.'<br><br>Which leads to my final comment.  Although many of the posters here have picked up upon the theme of defying death.. few seem to have touched upon what I see as the main premise of the movie - the importance of forgiveness, and the need to be cognizant of all you do, because it does `matter.'","user":"Lagniappe","rank":[86,105]},{"title":"One of Schumachers better ones","rating":8,"date":"21 October 2011","review":"I recall seeing this movie three times, first in the early 90s, then 00s and now I just saw it again and each time I've grown more fond of it. There is something in Schumachers style that drags me into it. The story is OK, nothing really remarkable. It's one part ghost story, one part medical thriller, one part love triangle.<br><br>What really makes this movie worthwhile is Schumachers direction. He's got a very good eye for this Gothic style. One might wonder why the school was so poorly lit, or what exactly was the place they did their experiments at, but it's all for the mood, it's all style. Sometimes style does go over substance, but in this case they work hand in hand. The Gothic architecture and gloomy late autumnal Chicago are just what this movie needed. Just like The Lost Boys IS small town sunny California. Schumacher should've stuck to this style which clearly is his forte, but sadly he has since had a very varying career with only occasional hits.<br><br>The cast is great, all of the stars have gone a long way since. Makes one only wonder what could've become of William Baldwin had he made better career moves. He is very good in this movie. I've always liked Kiefer Sutherland as a movie actor, and he does a remarkable job here too. I really would've rather seen him as a full time movie actor rather than going for TV.<br><br>There is only one thing that bothers me in this movie and it's the story in all it's simplicity. If people have had near death experiences before and have come back to tell, what new did this crew try to achieve? If not only have personal experience of death, but I got the idea most of them were in it for the science. Why risk brain damage and gamble with life for something you will not get any proof anyway. Especially given that they are medical students, the story is not 100 % believable, but like I stated earlier, watch this movie more for the mood. <br><br>I'm glad it's already been so long since the 90s so one can start appreciate the movies of this decade again without getting caught on the hairdos and such.","user":"rlaine","rank":[26,30]},{"title":"A vaguely original horror idea","rating":7,"date":"10 November 2004","review":"The basic premise of Flatliners is fairly simple. Several medical students put themselves at the point of death in order to find out exactly what the brain does during the fact. It sounds like something a mob of bored students would do for a joke, but it forms the basis of some very creepy substories. In today's world, where Hollywood has to mine foreign markets for the ideas to make a horror film, Flatliners is one of those rare gems that show Hollywood can make something different when it tries hard enough.<br><br>What separates Flatliners from a lot of films based on this premise that would come out today is that it does not stoop to being condescending or arrogant. Flatliners recognises that people go to films to be entertained, not moralised to. In this kind of supernatural thriller, the difference this restraint makes is really incredible. What's even more incredible is that Julia Roberts appears without being annoying or demonstrating that she can only play Julia Roberts. The theory of obscurity, that performing artists do their best work with the smallest audience, is in force here.<br><br>The subplots concerning what the characters find during their loss of pretty much everything that makes them alive, and how it comes back to intrude on their present time, are done surprisingly well. The moments when William Baldwin's character finds his personal videotape collection coming back to haunt him are especially intriguing. That William Baldwin seems so perfectly cast in the role says a lot either about the script or the direction. I am not sure which.<br><br>Kiefer Sutherland, on the other hand, really shines as the lead. One really feels for him as the mystery of what past experience is intruding on the present and why unfolds. As Kevin Bacon's character goes to find an old school pier whose life he made hell and tell her how sorry he is, it becomes clearer what the film is about. We can try to change the past as much as we like, but it's what we do with the present that matters most.<br><br>Another good aspect of Flatliners is how it achieves an atmosphere without the use of expensive, elaborate visual effects. Quite unusually for what is essentially a horror film, Flatliners did not expend its budget in places where it did not need to. Much of what we see during the more surreal sequences is a case of professional pretending, simple trick photography, or stock footage. Sometimes the simplest things are the best.<br><br>If there is a problem with the film, it's that it feels about ten minutes too short. The ending seems more perfunctory than conclusive, as if someone in the studio asked the director to wrap the film up so they can bring it out at a certain market time. Of course, many films have been left with sore spots for this very reason, so Flatliners shouldn't really need to be any different. The hundred and fifteen minutes we do get is highly satisfactory, though not overly brilliant.<br><br>I gave Flatliners a seven out of ten. It works well as a date flick or a kind of late-night popcorn film. That aside, it makes a good reminder that low-budget horror shows weren't always sad pieces of garbage.","user":"mentalcritic","rank":[86,119]}]