[{"title":"The Secret Of My Succe$s's evil twin","rating":5,"date":"1 November 2009","review":"You have to leave it to Michael J.: no-one looks better harried in a casual suit than he. That artfully ruffled hair is just the shizzle. Even when he's been boozing and snorting lines all night, he looks like the picture of life. Here he's teamed up with Kiefer Sutherland, the second best-looking guy in a ruffled suit, and all seems to be set for a zany, New-York-in-the-Eighties comedy along the lines of Fox's previous The Secret Of My Succe$s. Only that they decided to make a dire \"serious\" movie instead, probably to allow Fox to work beyond the comedy genre for a change.<br><br>So Fox plays the young would-be writer of the Great American Novel who struggles with:<br><br>*the death of his mother a year ago<br><br>*being left by his model wife (meaning they're married and she works as a model -- everyone did in the Eighties) for a swanky French fashion photographer<br><br>*having to work as a fact checker for a The New Yorker-type magazine instead of being recognised as a literary maven<br><br>*New York City<br><br>*partying too hard, taking too much coke and hanging around models with earrings the size of dinner plates too much<br><br>Here's how the story went down with me: the main character and his entourage live the affluent life of New Yorker young urban professionals that everybody dreamed about in the Eighties. Our hero Jamie Conway has a well-paying job in the media, but he whines because he'd rather be an author. It's sad that his wife left him, but he handles it so immaturely that you begin to feel that she made the right choice. The dead mother in Kansas seems to be thrown in gratuitously to add ballast. The other women in this movie are so stereotypical (the motherly type, lots of club-going fashion skanks and finally the homely girl who goes to bed at ten under a large frilly duvet) that I garnered even more sympathies for the cheating wife. I couldn't buy into the whole coke fiend schtick because Michael J. Fox just looks so damn perky and apple-cheeked all the time.<br><br>Finally the ending: Jamie meets his estranged wife at a party, starts laughing hysterically, then his nose starts to bleed from doing all those lines. He then decides to call that homely girl, whines to her about his mother, and sorta decides that he's through with all those modern women and that she's what he needs. He then goes out into the New York morning and trades a loaf of bread for his sunglasses. Credits.<br><br>The story reminded me in many ways of The Catcher In The Rye -- only that TCITR a good, captivating book, while BRBC is a boring film. Maybe the book it was based on was much better, but it just didn't translate well to film, or maybe it was crap too.","user":"Karl Self","rank":[25,31]},{"title":"Not a bad movie at all","rating":10,"date":"10 January 2003","review":"Michael J. Fox does an admirable job in the lead role of this movie adaptation of Jay McInerey's book.  The plot concerns one man's downfall over the period of a week, and how it all stems from his mother dying and his wife leaving him.  The movie follows the basic plot of the book with few changes.  Overall a very decent movie, with a solid cast.","user":"tex-42","rank":[18,23]},{"title":"Fox was miscast","rating":5,"date":"17 February 2007","review":"There are two things that went wrong with this film. First and foremost is that Michael J. Fox is totally miscast for his role. I can understand him wanting to break away from the Alex Keaton character on \"Family Ties.\" But, although he tries, he simply isn't right as a coke-addled, anguished writer. And it knocks the whole film off-kilter. Another problem is that the story doesn't translate easily onto film. There are some compensations- great supporting cast, catchy theme song (\"Kiss &amp; Tell\" by Bryan Ferry), and excellent use of New York City locations. But they weren't enough to make the film a success, and the disappointing returns at the box office bear this out.","user":"highwaytourist","rank":[23,31]}]