[{"title":"Ivan, a shattered life","rating":10,"date":"17 May 2007","review":"\"Childhood of Ivan\" is not only about Ivan's life but it stands as a symbol for the many Russian lives shattered by the war. This is an elliptical film, that is, it doesn't reveal everything - it suggests.<br><br>\"Childhood of Ivan\" requires the use of your brain and imagination, but it is in no way a difficult film. Once you accept not understanding everything right now, just relax and follow the images and sounds and you are ready for the \"Childhood of Ivan\". <br><br>As I said before the film uses many ellipses to show Ivan's fractured life - he plays in the fields, his mother calls him and smiles; a water well, he stares down at the water and his mother stands beside him and tells a story about the stars; we hear a gun shot, someone lying on the grass; Ivan is wading through a swamp to reach a soviet army unit.<br><br>The war is not shown at all - it is suggested. We only see the enemy soldiers once for a brief moment. And two hanged men is all there is to denounce the carnage of the war. The rest is suggested by unfinished speeches, by faces where pain is followed right after by the desire to live and be happy......<br><br>Ivan's memories: His mother, his sister and their games, the beach, the sea and the rain, his captivity - his life, a broken life. Nothing remained for him in life but to fight - to fight against the enemy that had taken everything from him.<br><br>I repeat that \"Childhood of Ivan\" is not a partisan film, it doesn't try to demonize the adversaries. I would call it much more an intimist film, somewhat in the vein of \"Les Jeux Interdits\", but Ivan's childhood was over after the horrors he had to go through; his only way to survive as a human being was to fight the horror that had crippled his life, while the children of \"Les Jeux Interdits\" went on with their children games in spite of the war. France, because of her fast surrender, was preserved from the butchery inflicted on the Soviet Union.<br><br>I recommend this film to everyone who wants to see a paradoxically sad, beautiful, reflexive and passionate film.","user":"andrabem","rank":[68,72]},{"title":"Probably the best Russian World War II drama you will ever see.","rating":22,"date":"22 August 2002","review":"(***** out of *****)<br><br>Ivan's Childhood is Tarkovsky's debut feature film about a 12 year old boy who volunteers to fight in the front lines against the German invasion because his family where murdered by Nazis. His size and height make him the perfect spy for the Russians as he slides his way across muck and swamp to bring back vital information about the German offence that no other man can achieve. At the same time his commanding officers object to this boy being used as a tool of war but have no control over the matter because of Ivan's convictions to bring down those that killed his parents.<br><br>\nShot in beautiful monochrome the camera never ceases to capture nature, religion, dreams and love - all of which are major elements in any Tarkovsky film. This motion picture is one of the most stunning independent movies you will ever see.<br><br>Sometimes Ivan cries like the child he is but this is not because of the burden of war but because he can not do what he wants most - to avenge the death of his family. Other times he is like a General in the making - standing up to his commanders, spitting orders back at them, making other soldiers look pale in comparison and walking into the fray without any fear attached. The dichotomy of his fractured personality is evident the most when he is alone. One moment he is dreaming of his mother, the next he is stalking the ghost of a Nazi murderer in the room where he sleeps (which is one of the most disturbing scenes in this film).<br><br>The final sequence in the ruins of Berlin fully brings home the impact of the film's premise. This is a story about Ivan's Childhood and that is exactly what you get. Heart wrenching from the first frame to the last and never equalled. To think this was all made in 1962!  Shocking cinema at its very best.","user":"simonapro","rank":[85,95]},{"title":"A childhood like no other.","rating":2,"date":"2 February 2000","review":"Tarkovsky appeared dismissive of this, his first feature, saying it was the sort of project dreamed up in film school pool halls. It was not a film he himself instigated, but it cannot for a moment be described as uncommitted or pedestrian. It most closely resembles some of the other 'names' in purely artistic cinema of the day in terms of formal style, Tarkovsky having not at that point worked out his own unique and so far inimitable 'style', if that's the right word. The dream sequence with the apples, though brilliantly done, seems derivative. He never used optical flourishes like that again.<br><br>Tarkovsky believed a great deal of editing for the audience was vulgar and inimitable to great art, but this film is quite structured and conventional compared to his later slower and arguably more obscure works. The key performance comes from Ivan himself, a fine effort from one so young, and indeed Tarkovsky used him again in the bell section of Andrei Rublev; although he used rather harsh methods to get the performance he wanted in that case. Obviously influenced by Dreyer, you see the beginnings of Andrei's obsession with water and it's reflective calm around more tempestuous events. His use of black and white stock in terms of lighting is exemplary.<br><br>The film's title is ironic as Ivan does not have a childhood, but the films majestic and moving final shot suggests that Ivan does receive a kind of immortality beyond the bleak finality of his discovered photo in Berlin, that the Russian spirit itself cannot be stifled and will ultimately run free.","user":"Gary-161","rank":[46,50]}]