[{"title":"This movie got it all: perfectly paced study of human darkness","rating":10,"date":"26 August 2017","review":"I knew CHINATOWN was hailed as the paragon of a film noir, and that's why I finally got down to watching it. However, despite having known about the movie for quite a while, I wasn't really prepared for just how dark it could be. The movie starts slowly, with a private detective taking on what looks like a routine case. But soon he finds himself enmeshed in a web of conspiracy, murder, lies and deceit. The plot is like a perfect machine that relentlessly moves towards a final resolution that is truly epic and truly soul-wrenching.<br><br>In a recent New York Times piece, they called CHINATOWN \"a meditation on evil\", which is spot-on. Set in 1937, this movie is just all-round perfect, first and foremost how everything is connected within the grand structure of the movie, that is rich in themes (water, evil, trust, guilt, greed) and even richer in suspense, as the audience—just like our protagonist—tries to find out what is happening. The story is \"complex\" for sure, but it's not \"complicated\". Everything makes sense in the end and the complexity pays off big time.<br><br>Besides the impeccable screenplay, everything else about this movie is perfect as well. Jack Nicholson and Faye Dunaway carry the movie with sophistication and dignity. Dunaway's stunning performance in particular fills every scene with an aura of mystery as you are trying to find out what her motives are. The set pieces are beautiful, the score is compelling; and camera-work and editing could not be any better. There is a reason this one is called a classic! So, if you're ready to delve deep into a richly layered exploration of the dark side of humanity—enjoy the ride. But don't expect to come back unscathed.","user":"stroggos","rank":[59,65]},{"title":"Capturing the True Spirit of Film-noir","rating":10,"date":"10 September 2004","review":"The seventies were the last years of great (American) films. I say films because when we speak of movies nowadays, we allude to blockbusters that generate hundreds of millions of dollars, the least amount of controversy, and are mostly inane crowd pleasers with tacked-on endings.<br><br>Consider the output of influential film makers Allen during that time: Coppola, Scorsese, Altman, Lumet, Ashby, Bogdanovich, to name a few Americans, not to mention European directors Fellini, Bergman, Wertmuller, Truffaut, Argento, Saura, and Bunuel -- all household names in those days. Before Spielberg and Lucas came along, not a single one of these made movies appealing to the \"summer blockbuster tradition,\" and unlike Spielberg or Lucas, they have a body of work filled in high artistic quality with minimum special effects and a lasting mark on future generations.<br><br>Polanski is another one of these directors, and with \"Chinatown,\" he reaches his directorial peak amidst the scandals which seemed to taint everything except his art. One can only imagine him in the forties, living his scandals, and transmuting this into high art -- when film-noir was at its darkest. Thankfully he lived in a time which did not demand the \"happy ending\" or re-shoots in order to be politically correct -- else \"Chinatown\" would have lost its devastating punch and conformed to the norm.<br><br>A departure from the horror genre which brought Polanski to stardom, he re-creates an equally grim genre with his jaded view of 1930s Los Angeles down to the choice of the color palette, and using the acting powers of Dunaway and Nicholson to a fantastic effect, he creates haunting characters who can't be easily dismissed as film-noir archetypes without looking very closely at their reactions, listening to their words, and following their progressive involvement in a plot which threatens to swallow them whole, and ultimately does. And having Huston play Noah Cross -- who virtually took noir to its heights with \"The Maltese Falcon\" -- Polanski hits the mark dead center, because Huston is the hardened heart of the corruption in \"Chinatown.\" In brief scenes he creates a character almost unbearably evil with a hint of madness just underneath, and how he affects the characters around him will pervade the viewer long after the credits have rolled -- after all, he is the person who tells Nicholson he has no idea what he's getting himself into.<br><br>I doubt this movie could be made today for reasons stated above. I'm thankful Polanski's vision prevailed, and not Towne's. Film-noir is a genre about human darkness, and here, the envelope is pushed all the way through, making this film, in my opinion, rank second to \"The Maltese Falcon.\"","user":"nycritic","rank":[264,332]},{"title":"A very classy, consistently engaging and dark detective story","rating":3,"date":"3 January 2005","review":"Jake Gittes is a former cop turned private detective. When he is contracted by a Mrs Mulwray to find out if her husband is having an affair, he takes to trailing Water Company Executive Hollis Mulwray. Mulwray appears to only have water and a dry riverbed on his mind but eventually they catch him with a young woman, although almost immediately the news gets leaked to the papers and Mulwray goes missing, only to turn up dead. At this point the real Mrs Mulwray comes to Gittes threatening to sue him for his involvement and Jake realises that he had been set up to set up the Mulwrays. He continues his investigation into the murder only to find a conspiracy involving thousands of gallons of water being wasted during a drought and the mysterious presence of Mrs Mulwray's father, Noah Cross.<br><br>As a fan of film noir and tough detective movies, I am too often put off by modern entries into the genre that try to replace atmosphere and intelligence by just having nudity and swearing; the genre managed atmosphere without these in the forties and fifties but yet modern films seem to rely on them. With Chinatown however, everything works well as a homage to the best years of the genre and, as such, is very well set in the period and is of suitable presentation even if the material and tone is darker and harder than would have been allowed years ago. This is not to say it is just a copy and paste from better films because it isn't and indeed stands out as one of the best detective noirs I have seen in ages. The plot is always going to be the most important thing and it gets it spot on throughout, doing the proper thing of starting with a simple story and continually building it more and more complex as it goes. Unlike some other \"classics\" of the genre, Chinatown manages to do this without ever losing the audience and I found the plot to be both rewardingly complex but yet still very easy to follow.<br><br>Needless to say, things are very dark and the script is convincingly dark and miserable, leading to an ending that is as depressing as I've seen  not so much in what actually happens but also in the wider implications for the characters that the credits prevent us from seeing. Director Polanski does a great job of putting this story in a lush setting that produces a real strong sense of period but also manages to always be showing us the darkness coming through subtly throughout the movie. Of course it helps that he also has a great cast to work with. Jack Nicholson is iconic in this role and, if I had to pick one film to act as an introduction to Nicholson then it would be this one. He is tough yet damaged, upright but seedy and he brings out his complex character well. Dunaway has less screen time but is just as impressive with a similarly dark role. Huston adds class and manages to ooze menace while also coming across as a harmless old man. The support cast are all fine but really the film belongs to these three, with Nicholson being the stand out role.<br><br>Overall this is a very classy film that has stood up very well to become a well-deserved classic. The story is complex, mysterious yet simple to follow; it is dark and seedy without relying on swearing or nudity to set the atmosphere. The direction is great, with a real atmosphere and sense of time and place that is matched by a great collection of performances delivering a great script.","user":"bob the moo","rank":[215,287]}]