[{"title":"Great Dixieland Jazz.","rating":6,"date":"18 May 2009","review":"PETE KELLY'S BLUES (1955) has finally made it to DVD and a fairly enjoyable issue it is too but mostly because of the music - which I'm sorry to say there isn't an over abundance of either. From a lean enough screenplay by Richard L. Breen it is nevertheless well directed by the picture's star Jack Webb. The light plot has cornetist Pete Kelly (Webb), leader of a Dixieland Jazz band in 20s Kansas, going up against racketeer Fran McCarg (Edmond O'Brien) who wants a \"piece\" of the band. Trouble follows when Kelly's drummer Joey Firestone (Martin Milner) objects and pays for his objection with his life (In classic old Warner gangster movie style he is mowed down with a Tommy gun in a back alley by a passing Limousine in the teeming rain). A stoic Webb tells Rudy, the nightclub owner, \"get someone to bring Joey in - it's raining on him\". The picture ends with Kelly having a showdown with the mob boss and a couple of his \"goons\" in a well executed shootout in a deserted ballroom.<br><br>In between all the drama and gunfire there are some fine jazz numbers \"played\" by the on-screen band which is ghosted on the soundtrack by popular jazz band of the day Matty Matlock's Dixieland Jazz Band. Matlock himself ghosted for Lee Marvin on clarinet while Matlock's trumpet player Dick Cathcart doubled for Webb on the Cornet. It is reputed that Webb - an avid jazz fan - based the band in the movie on his own favourite Dixieland band - Eddie Condon's Dixielanders (who themselves in real life had problems with gangsters). But the movie is disappointing in that there aren't enough numbers played by the band in the film. We could have tolerated quite a few more of them from Matlock's great band! However as compensation we are treated to some terrific songs. The great Peggy Lee gives us her wonderful and unique renditions of such standards as \"Sugar\" and \"Somebody Loves Me\". Then there's a marvellous cameo by the First Lady of Jazz herself the inimitable Ella Fitzgerald belting out \"Hard Hearted Hannah\" and the title tune \"Pete Kelly's Blues\" (composed by Warner Bros. musical director Ray Heindorf). Interestingly Peggy Lee won an Acadamy Award nomination for her portrayal of McCarg's drunken moll in the picture.<br><br>So not too bad a movie really - saved mostly as I've said by the music. But it is stylishly photographed in Cinemascope and colour by Hal Rossen and has some clever rapid-fire dialogue. Thanks to Webb's expert direction he imbues his film with an exceptional jazz era atmosphere and his knowledge of Dixieland jazz helps it along. Dixieland jazz was the pop music of yesteryear. Hearing it here and in the light of what we have to listen to today it's a great pity it still isn't. Hmmm!<br><br>Now a word about the DVD! Although it is in a well defined 2.35 widescreen format Warner's presentation of \"Pete Kelly's Blues\" leaves a lot to be desired! There are no extras to speak of! Just a silly very dated short about the early days of motoring and a Looney Tunes cartoon. Surely they could have scraped up, from their archives, some short about jazz or something jazz related. No?? Also why was there no attempt to have a commentary? And to add salt to an already blistering wound - there isn't even a trailer! For shame Warner Home Video!<br><br>However, nothing can diminish this classic line from \"Pete Kelly's Blues\"........... The deadpan Webb (the only actor who could walk without moving his arms) in a confrontation with gangster O'Brian : \"I've heard about you McCarg - down south they say you have rubber pockets so you can steal soup\"!","user":"jpdoherty","rank":[24,26]},{"title":"Very stylish and a little confusing","rating":6,"date":"16 January 2010","review":"This film is musically great with a couple of numbers by Ella Fitzgerald. However, this is not anything close to a musical. Rather it is a 20's gangster tale that involves Pete Kelly (Jack Webb) and his band. For those of you who remember Dragnet, Webb's narration might have you thinking of Dragnet just a little too much. Webb also directed this film, and he did a great job of giving it a real 20's feel. You don't feel like you're looking at a bunch of people from the 50's dressed up for a 20's costume party.<br><br>The only thing bad I can say about it is I had a hard time figuring out Pete Kelly's motivation. A person close to him is killed, and he is ready to give in to the gangster responsible and forget the whole thing ever happened. He finds out another person he barely knows has been killed by the same gangster and he's ready for war. He tosses an eager and beautiful Janet Leigh out of his room in one scene, and in the next scene he's overjoyed to see her to the point of wanting to marry her. The clinical acting style that worked so well for Webb in Dragnet just left me a little confused here. Still, overall, I would recommend it.","user":"AlsExGal","rank":[7,7]},{"title":"Shaking Down The Musicians In Prohibition Kansas City","rating":7,"date":"6 March 2009","review":"The background of the Prohibition Era of Tom Pendergast's Kansas City in the Twenties at its height is the setting for the story of Pete Kelly's Blues. Jack Webb's crisp documentary like style honed by years of doing Dragnet on television is the manner in which Pete Kelly's story of resistance to the mob is told. All Webb in the title role wants to do is play jazz, but playing jazz in mobbed up Kansas City came at a price.<br><br>The one who wants the payoff is political ward boss/gangster Edmond O'Brien. He's got the swinging part of Kansas City in his pocket where all the speakeasies and clubs are and he's thought of a new racket, charge protection to the musicians, even to the extent of moving their own legitimate agents out. And O'Brien wants 25% not the usual 10% real agents charge.<br><br>Webb's defiant, cowed, and then defiant again during the course of the film. The murder of his drummer Martin Milner takes a lot of the fight out of him. But O'Brien pushes way too hard and he's a really crude sort of thug. In the end Webb snaps.<br><br>With one exception the cast is great. The music end is taken by two really great singers Ella Fitzgerald and Peggy Lee who have some great numbers that show why they were the best in their business. Lee even copped an Oscar nomination for Best Supporting Actress, but lost to Jo Van Fleet for East Of Eden. Lee Marvin is here and not playing a thug, but is a clarinetist and Webb's best friend. Webb plays the trumpet. Andy Devine is law enforcement and deadly serious. The squeaky voice is moderated and Andy's bulk is used similarly to Laird Cregar in I Wake Up Screaming and Orson Welles in Touch Of Evil. Andy never had a role this serious on screen. And Peggy Lee even with that Oscar nomination never followed up on it, my guess being she thought of herself as a singer not an actress primarily.<br><br>Janet Leigh who usually is great disappoints me here. Her role as an air-headed party girl is really out of place and why Webb is falling for her is a mystery. Later on she nearly gets him killed when he finally decides to face down O'Brien. Janet does her best, but the part makes no sense at all to me.<br><br>The locale of Pete Kelly's Blues in Pendergast controlled Kansas City is interesting. O'Brien is just the kind of guy Pendergast would have as a lieutenant. Pendergast's name is not mentioned, in 1955 it didn't have to be. The recent president of the United States, Harry S. Truman was a product of that machine and that was never out of the public's mind even after Pendergast was dead.<br><br>Dixieland jazz fans will really like the music from Pete Kelly's Blues, I certainly did along with the rest of the film.","user":"bkoganbing","rank":[12,14]}]