[{"title":"When Advertisers Attack!","rating":10,"date":"19 April 2004","review":"This film is literally about \"How to Get A HEAD in Advertising.\" Once a vigorous advertising agent in his field, able to sell anything to anyone, Denis Dimbleby Bagley (Richard E. Grant) has suddenly found himself working himself to death trying to come up with a sales pitch for pimple cream. His obsession with trying to conquer those bloody boils suddenly leads to an unexpected epiphany in which Denis, sick of how everything has become so relentlessly commercialized and every single value of life turned into a money making venture, decides to give up the advertising trade and wage a war on the commercialization of life. But, if there's one thing a revolutionary cannot do freely, it's stand in the way of profiteering.<br><br>\nDenis faces a nemises, the one who wants him to keep on ruthlessly selling (and lying) to the world and stomp out the idealistic and possibly costly ambitions of the born again Denis Bagely. But it is no ordinary nemesis. It is a boil that grows on the his neck, an alter-ego that grew out of Denis's inability to sell everything (i.e. the pimple cream) and his newfound war against advertising. This boil comes to gain it's own personality, it's own voice, and even it's own appearance (it looks exactly like Denis). Everyone thinks that Denis is insane with his talks of a muttering boil on his neck which he engages in conversation with. The boil starts to grow a life of it's own, and even a head of it's own, seeking to stifle Denis before his epiphanies are carried to far, and people start thinking for themselves and so forth.<br><br>It is certainly an off-the-wall dark comedy, but an absolutely hilarious one with a valid point about the incessant commercialization about nearly every aspect of life, and one person who recognizes what a load of bullocks it is and tries to rid himself of it as much as he can. The ending makes for a cool finale as boil head Denis is yapping like a proud general riding his horse around unconquered territory about the possibility of amassing the earth and selling the world bit like bit. He ideas so dangerous, yet he is unstoppable and out of control. It is one hilarious movie and certainly an inventive story.","user":"vertigo_14","rank":[20,23]},{"title":"Great film on modern life","rating":10,"date":"11 October 2002","review":"Hilarious, bitter satire of adverising, humanity, and personality.  Ad exec Dennis Bagley gets so hung up on boils developing a \"boilbusters\" ad campaign that he grows a malignant boil which takes on its own personality and eventually takes over the show.  Grant is perfect in the lead role, the direction and photography are excellent, and the effects cheap but grotesque.  There are so many hilarious scenes, I found myself laughing out loud through most of the film even though I saw it by myself!  I love the scene where Bagley explains to his wife why the boil only talks to her when she turns away :  \"He's waiting for you to do it!\"  A classic, should be sought out by all fans of sadistic humour(especially British, i.e. League of Gentlemen, Monty Python) .","user":"funkyfry","rank":[16,21]},{"title":"Awesome premise, writing, and acting; good direction","rating":10,"date":"20 November 2000","review":"This is a severely underrated film. Richard Grant's more-than-capable slimeball antics are put to a very worthy test in this bitter little polemic about consumerism. It's very British, and very 80's, but its message is still as universal as ever, and the execution is wickedly original, affecting, and cough-out-loud funny.<br><br>The only negative point about the movie is the occasionally lax direction towards the end, but that's just a quibble.<br><br>Overall, this is definitely very cool, and highly recommended to fans of Withnail and I, Network, and Fight Club who want something nice and bitter at the end of the day.<br><br>This would make an awesome play...","user":"David Sticher","rank":[15,20]}]