[{"title":"Ticks most of the giallo boxes in style.","rating":8,"date":"24 January 2016","review":"Lisa Baumer (Ida Galli) collects on her husband's life insurance—a cool $1m—after he is blown to smithereens in an air disaster. Several people suspect Lisa of foul play, including a junkie ex-lover who resorts to blackmail, her husband's mistress Lara (Janine Reynaud), who also feels entitled to some of the money, and insurance investigator Peter Lynch (George Hilton). But when Lisa is murdered after cashing her check, and the money goes missing, the case becomes much more complicated<br><br>Sergio Martino's The Case of the Scorpion's Tail might not be the most innovative of giallos, but it does meet many fans' expectations of the genre, making it a very enjoyable way to waste some time.<br><br>An animal in the title: the insect of the title refers to the Scorpion-shaped cuff-link discovered at the scene of an attempted murder.<br><br>A convoluted plot: this one's got twists and turns aplenty, making it a thoroughly engrossing mystery from start to finish A character struggling to recall a vital clue: Peter Linch is convinced that he knows something that will help to solve the case.<br><br>Red herrings: there are lots of these, but to tell you about them would be to spoil the film.<br><br>Exotic locations: the film opens in London, but the action soon moves to sun-kissed Athens.<br><br>Stylish cinematography and lighting: Martino employs some crazy camera angles to help spice up proceedings, and lights certain scenes with vivid colour.<br><br>Sexy women in peril: there are several Euro-babes in this giallo, a couple of whom meet very nasty fates. Anita Strindberg as French photojournalist Cléo Dupont, Peter's love interest, provides the obligatory T&amp;A, happily showing off her '70s silicone implants.<br><br>Creepy dolls/freaky paintings: it has absolutely nothing at all to do with the story, but there is a scene featuring several dolls with missing eyes and limbs, and a portrait of a man with bug-eyes.<br><br>Gruesome murders: Martino ensures that gore-hounds are kept happy with two bloody throat slashings, a nasty knife in the abdomen, an even nastier broken bottle in the eye, and a victim having the back of their hands slashed with a switchblade before falling from a height to their death.<br><br>A leather-gloved killer: goes without saying.<br><br>Blatant product placement: fancy a glass of J&amp;B Scotch? You might do after watching this film.<br><br>Cops who figure out the truth in the nick of time: the law waits till the very last moment before arriving on the scene to save the heroine.<br><br>In fact, all that's missing is a haunting lullaby/nursery rhyme.<br><br>7.5/10, happily rounded up to 8 for IMDb.","user":"BA_Harrison","rank":[9,9]},{"title":"Thanks Again, No Shame!!!","rating":7,"date":"31 October 2007","review":"After dipping his toes in the giallo pool with the masterful film \"The Strange Vice of Mrs. Wardh\" (1971), director Sergio Martino followed up that same year with what turns out to be another twisty suspense thriller, \"The Case of the Scorpion's Tail.\" Like his earlier effort, this one stars handsome macho dude George Hilton, who would go on to star in Martino's Satanic/giallo hybrid \"All the Colors of the Dark\" the following year. \"Scorpion's Tail\" also features the actors Luigi Pistilli and Anita Strindberg, who would go on to portray an unhappy couple (to put it mildly!) in Martino's \"Your Vice Is a Locked Room and Only I Have the Key\" (1972). (I just love that title!) I suppose Edwige Fenech was busy the month they shot this! Anyway, this film boasts the stylish direction that Martino fans would expect, as well as a twisty plot, some finely done murder set pieces, and beautiful Athenian location shooting. The story this time concerns an insurance investigator (Hilton) and a journalist (Strindberg, here looking like Farrah Fawcett's prettier, smarter sister) who become embroiled in a series of grisly murders following a plane crash and the inheritance of $1 million by a beautiful widow. I really thought I had this picture figured out halfway through, but I was dead wrong. Although the plot does make perfect sense in this giallo, I may have to watch the film again to fully appreciate all its subtleties. Highlights of the picture, for me, were Anita's cat-and-mouse struggle with the killer at the end, a particularly suspenseful house break-in, and a nifty fight atop a tiled roof; lots of good action bursts in this movie! The fine folks at No Shame are to be thanked for still another great-looking DVD, with nice subtitling and interesting extras. Whotta great outfit it's turned out to be, in its ongoing quest to bring these lost Italian gems back from oblivion.","user":"ferbs54","rank":[14,19]},{"title":"Pay attention -- there's so much going on","rating":22,"date":"22 October 2017","review":"While she makes love to someone else, Lisa's husband dies in a jet crash. She stands to inherit all of his money, despite them being basically separated. An ex-lover has a confrontation with her, threatening her with blackmail. She pays up — some money now, then some when she gets the letter where she wished that her husband was dead. But a gloved hand finds the letter and kills the ex-lover!<br><br>Lisa has to go to Athens to collect the money, but runs into one of her husband's ex-lovers, Lara Florakis (Janine Reynaud, Succubus) and a knife wielding maniac. Peter Lynch (George Hilton from All the Colors of the Dark) saves her and takes her to the hotel. She asks for all of the money in cash, despite warnings to how dangerous that is.<br><br>That same maniac tries to kill Peter, then comes back to kill Lisa, sharp jazz wails staccato punctuating each stab of the knife, each rip across her body. Jump cuts and flashes and the room is covered by the police, who question him.<br><br>An INTERPOL agent, Inspector Stavros (Luigi Pistilli, The Good, the Bad and The Ugly, Your Vice is a Locked Door and Only I Have the Key), offers to help Peter with the case and the moment he goes to talk to Lara, he's attacked by the gloved man.<br><br>That brings in Cléo Dupont(Anita Strindberg, Who Saw Her Die?), a journalist who pretty much instantly falls in love with our hero. They go up to his room, but it's been turned over by the police, with even the bed sliced open looking for the million dollars that went missing when Lisa was killed.<br><br>Turns out the gloved man wasn't on Lara's side — he or she slits her throat, then runs up a spiral staircase as a guard gives chase. This reveals a room full of one eyed baby dolls and a strange oil painting. Between the woman's face against the glass with blood spraying everywhere and these reveals, this film is really tipping its hat toward Argento.<br><br>The bodyguard chases after the killer, but is knocked off the roof. One slash across the fingers and we have another dead body. It's 45 minutes inand most of the IMDb cast is already dead!<br><br>That said — there's a stewardess that gets the gift of scorpion earrings from an unseen lover. So there's that.<br><br>Meanwhile, Peter and Cléo make love on an orange shag couch while a peeping tom watches from the window. You know how Bruce Banner always has on purple slacks and you wonder, \"Who wears purple slacks?\" Peter does.<br><br>Read more at http://bit.ly/2xdXawP","user":"BandSAboutMovies","rank":[4,4]}]