[{"title":"Country Hitchcock.","rating":11,"date":"11 April 2002","review":"This is Jacques Becker's second effort and the first one that really counts.Along with \"casque d'or\" ,\"rendez-vous de juillet\" and \"le trou\",it may be his finest work,and for sure one of the classics of the French cinema,one of these that you can watch and watch again without being tired.<br><br>The scenarist Pierre Very,is,along with Boileau-Narcejac,the best French suspense writer,and he outdoes himself here,creating an absorbing plot,a magic atmosphere,and a dozen of colorful characters .Out in the sticks,lives the Goupi family:actually a clan who's got its own laws and in which strangers are looked upon pretty much as enemies.In this strange family,every member has got a nickname,each one of them beginning with Goupi:Goupi-mes-sous,Goupi-Muguet,Goupi-Tonkin,of course Goupi-mains -rouges (Goupi-red-hands),and more.One fine day,a young man arrives from Paris :this is the first time he has come in this lost country,to visit his family.His late mother had escaped the Goupi clan,being unable to stand this place cut off the world.Needless to say,coming from the City,he's not welcome.The plot thickens when a Goupi wicked woman is murdered and the patriarch has a stroke and is no longer able to indicate where the family pile is hidden.<br><br>Jacques Becker created a very strange atmosphere,mainly during the first part:when the young man arrives ,he's taken by his uncle Goupi-Mains-Rouges to a scary place full of stuffed animals and black magic. He has wonderfully depicted his peasant milieu,in which they all stand together ,and in which they would not betray one of them,even if the police investigates their home.<br><br>There is a first-class cast,including Fernand ledoux,Georges Rollin,Germaine Kerjean and Blanchette Brunoy ;but the stand out is Robert Le Vigan,who portrays a former legionnaire,slipping gradually into madness.The most famous scene of the film belongs to him:pursued by the police,he climbs upon a tree,higher and higher,trying to reach for this sun he used to know when he was a soldier in the Colonies.A similar character is featured in Becker's follow-up movie \"Falbalas\",but insanity is much more credible in \"Goupi Mains Rouges\".<br><br>Had Hitchcock directed a country thriller,that would have been this one.","user":"dbdumonteil","rank":[15,15]},{"title":"Goupi Mains Rouges","rating":30,"date":"30 December 2006","review":"This is actually a very subversive film, given the circumstances and the date (1943) at which it was made. It is set in the Charente, which is a region a little to the east of La Rochelle, and not too far from the cities of Limoges and Poitiers. As such it was close (if not on) the border between the zone of (German) occupation and Vichy France. Although this film consists mostly of interiors there are enough outdoor scenes (all shot in what looks like late autumn or early winter) to give a real feel for the countryside.<br><br>Vichy (which had a reduced jurisdiction over occupied France) sunk a very large amount of political capital into the promotion of a 'certain idea of France' - that's De Gaulle's phrase, however, not Petain's). That 'idea' was of a rejuvenated nation, that case aside the infamous corruption of the Third Republic, and which gave pride of place to morality, (Roman Catholic) religion and country - specifically the countryside, rather than the cities (which were nests of subversives and Semites, so-called). It was a form of the 'integral nationalism' promoted by Charles Maurras, but with Petain as a substitute monarch.<br><br>However, here is a film which deliberately sets the city (in the person of the naive store clerk, Eugene, played by the young Georges Rollin) against his rather wicked rural relatives, complete with a tipsy, centenarian patriarch (Maurice Schultz). It turns into a rather interesting detective story, but one with a very literary style.<br><br>I imagine that it slipped through the censor's scissors only because of the portrayal of the Parisian Eugene as witless and rather feckless - almost a pawn in the hands of his unscrupulous uncles and cousins. Yet the film is much more savage towards the peasants, who are really a gallery of grotesques. They are superstitious, opportunistic, entirely selfish, idle and grasping - it is almost like one of Guy de Maupassant's caricatures of the narrow-minded and bigoted Norman farmers and petit-bourgeois. So the enormous propaganda push by Vichy to elevate 'la France profonde' to mystical status is here either ridiculed or simply disregarded. This is really a film about characterisation rather than plot, and the cast (led by the excellent Fernand Ledoux) are first rate.<br><br>It is a pity that Jacques Becker was not able to keep up the good work in the postwar years - films like \"Ali Baba\" (with Fernandel), \"Montparnasse 19\" and \"Arsene Lupin\" for the most part didn't measure up to \"Goupi Mains Rouges\" or \"Casque d'Or\". Perhaps it is true that the restraints of a repressive culture and regime do make for a better and more subtle product.","user":"dreverativy","rank":[15,18]},{"title":"Meet the Goupis","rating":9,"date":"15 May 2007","review":"Who could have wanted to kill Tisane? The list of suspects is a long one. Marie and her son Jean had just been told that they would have to leave the house where they had been taken in \"out of charity\"; no love lost there. Mains-Rouges and Tonkin both had been the targets of Tisane's insults over the years, while Muguet had just been told that she must marry Monsieur, who has just arrived from Paris. The 10,000 francs that Tisane had hidden in the armoire are missing... The story as told by Pierre Véry and Jacques Becker is full of atmosphere and menace and has the cream of French actors of the time (those who hadn't left Vichy France for easier surroundings).<br><br>Fernand Ledoux is splendid as Mains-Rouges; he puts on a deadpan face in order to play detective--we are told that the Goupis have no need of the police, they solve all their problems in house. Robert Le Vigan is once more at the top of his game: Tonkin is so poetic and threatening, an unforgettable performance. Blanchette Brunoy gives an accomplished performance as Muguet, the girl who is not sure where her heart lies.<br><br>A film classic that is not available on DVD is an orphan. Will somebody give this deserving orphan a home?","user":"bob998","rank":[9,10]}]