[{"title":"\"Re-enlistment blues\"","rating":8,"date":"17 May 2009","review":"It's often said that the simplest stories are the best. This isn't true. The simple stories are easy to get right, but a complex ensemble piece with multiple protagonists and numerous subplots can be just as effective, although it's a lot harder to pull off successfully. From Here to Eternity stands in the tradition of The Best Years of Our Lives, Seven Samurai and The Godfather, of pictures with interwoven plots that have become classics thanks to strong screen writing, intelligent direction and powerful acting performances.<br><br>Part of the reason From Here to Eternity works is because it is very quick in establishing its characters and plot lines. It opens with a series of interlinking scenes, introducing us to Montgomery Clift, Frank Sinatra, Philip Ober, Burt Lancaster and Deborah Kerr, giving us clues about Clift's past and hinting at the future relationship between Lancaster and Kerr, all in the space of five minutes. Director Fred Zinnemann, with a confidence that is lacking in his earliest features, shoots these scenes with subtle technique to give them maximum storytelling effect. For example, he gives Clift's character a superb introduction, walking at a right angle to the marching column until he is brought right into close-up. Once the dialogue begins he uses sudden changes of angle to highlight certain lines, for example the close-up of Lancaster telling Kerr \"I'd be happy to help\", at which point the audience know exactly what is going to happen between those two characters. Donna Reed is of course introduced a little later, but to compensate she is given a very distinctive first shot, framed on her own immediately after some busy crowd shots.<br><br>But Zinnemann's direction isn't all pure functionalism. He makes sparing use of attention-grabbing stylisation when the moment demands it, such as the dolly-out through the rain-soaked window during Lancaster and Kerr's first kiss. And this stylisation even helps keep the narrative together, for example cutting from the roaring sea at the end of the famous beach scene to the smoke rising from Clift's cigarette. Throughout the various parallel plots there is a tone of melancholy and regret, and Zinnemann keeps this commonality with his consistency of style.<br><br>Of course, you get the same problem or at least the same feature in From Here to Eternity as you do in They Died with Their Boots on or Titanic, in that the audience, knowing their history, know what is going to happen at the end. The strength of the non-combat story lines is such that we forget when and where we are, and as such it is important that we are eased into the finale of the Pearl Harbour attack so it does not seem such a surreal break in tone. This is done with characteristic subtlety, with two objects placed noticeably yet not obtrusively into the frame to jog our memories. The first is a calendar showing December 6th on the wall beside Burt Lancaster, and the other a signpost reading \"Pearl Harbour\" after his final meeting with Kerr.<br><br>One of the biggest challenges for the makers of an ensemble piece is that you need a larger than normal pool of leading players, and yet you must ensure none of them will overshadow the others. This is another thing they got right in From Here to Eternity. Clift, Kerr and Lancaster are all competent performers without big egos, and they all give steady performances, even if they are far from career-bests. As to Sinatra, what's amazing is not the quality of his performance (it was always evident he could act) but that he was even allowed to play a dramatic, non-musical role. It just goes to show the increased flexibility of cinema in the 1950s, as well as the rising status of the musical genre. To give it some perspective, can you imagine Fred Astaire or Bing Crosby having done the same thing in the 30s? From Here to Eternity won 1953's Best Picture Oscar, and like all successful pictures was followed by a host of imitators. 1955's Battle Cry for example is another many-stranded story about soldiers at the start of World War Two, and even features a rather tepid knock-off of the famous beach scene. However, while Battle Cry has some nice moments, structurally it is an absolute mess, an example of how easy it is to do a botch job on a complex storyline. That's why From Here to Eternity is such a rarity, being an ensemble piece that really works.","user":"Steffi_P","rank":[19,20]},{"title":"A Realistic View of the Army","rating":10,"date":"2 September 2005","review":"One of the big blockbuster best sellers of the post World War II years is James Jones's From Here to Eternity, a tale of the peacetime army in Hawaii before Pearl Harbor. The book was definitely going to be made into a film and it was only a question of casting to make it a success.<br><br>Director Fred Zinneman had a good intuitive sense about casting here, even against type. The two principal female parts were done against type. Deborah Kerr who made a career of playing respectable women played a captain's wife who's drinking and playing around. Not that husband Philip Ober is letting grass grow under his feet either, but Kerr's latest sexual exploit involves her with the First Sergeant of her husband's company, Burt Lancaster. <br><br>Donna Reed, who up to that point was best known for being Mary Bailey in It's A Wonderful Life, plays a prostitute here. A girl from the wrong side of the tracks, jilted by a rich boyfriend stateside, she's in Hawaii to make money and then go home and buy some respectability. She's not looking for romance with any soldiers, but you can't plan these things.<br><br>Especially Montgomery Clift if he comes in your life. It's been argued that this is Clift's greatest role and a case can sure be made for it. His character of Robert E. Lee Pruitt is like so many who still join the army today, from small town America who have no future there and find a home in the Armed Services. What makes Clift unique is that strong sense of individualism he can't control in an organization that does not encourage individuality.<br><br>Clift and Lancaster are a great study in contrasts and that's what drives From Here to Eternity. Lancaster as Sergeant Milt Warden is the ultimate professional soldier, held in the highest regard by his men. Lancaster is someone who knows how to work the system, you see it in the way he manipulates his captain. Of course he's got to be a manipulator there since he's having an affair with Deborah Kerr. He tries to protect Clift from himself and ultimately fails.<br><br>Clift has transferred into an infantry company and he was at one time a boxer. But he blinded someone in a fight and quit boxing. Philip Ober who prides himself on having several champions in various weight classes worked to get Clift in his company. Clift upsets his plans by refusing to box so he has the various sergeants give him \"the treatment.\" <br><br>Clift's best friend in the company is a tough street wise soldier from the big city named Angelo Maggio, played by Frank Sinatra. Sinatra read the book and knew this part was for him. He did everything he had to do to get that part, including working for scale. At the time Sinatra was considered a has been as singer and actor. Sinatra was right on the money in terms of picking a role. His faith in himself and Columbia Pictures and Fred Zinneman's faith in him netted him an Oscar for Best Supporting Actor, one of eight awards won by From Here to Eternity.<br><br>By the way Sinatra credited both Lancaster and Clift in helping him through this film as a dramatic actor. Lancaster and Sinatra didn't inhabit the same Hollywood orbit, but they remained friends for life. The same could not be said for Clift. Allegedly, some five or six years after From Here to Eternity and after Monty Clift's automobile accident while shooting Raintree County, Clift at some party at Sinatra's made a drunken pass at one of Sinatra's retainers. That got him kicked out of Sinatra's circle permanently.<br><br>In fact From Here to Eternity was also the Best Picture of 1953, with Zinneman getting his second Best Director Oscar in a row after the one he took home in 1952 for High Noon. Donna Reed won for Best Supporting Acress. Burt Lancaster and Montgomery Clift were both nominated for Best Actor, but split the vote allowing William Holden to win for Stalag 17. Another great acting job itself. And Kerr was up for Best Actress, but lost to Audrey Hepburn for Roman Holiday.<br><br>From Here to Eternity is a film loaded with good actors in small roles who got their first notice in this film. Ernest Borgnine, Robert J. Wilkie, Claude Akins, Jack Warden, Mickey Shaughnessy, all play various soldiers and each one is memorable. Especially Borgnine as the vicious sadistic sergeant of the stockade.<br><br>TV's Superman was in From Here to Eternity also. George Reeves who was looking to escape the typecasting from Superman has a part as another sergeant who warns Lancaster about Deborah Kerr. He gave a fine performance, but most of it wound up on the cutting room floor. That would have unforeseen tragic consequences.<br><br>This is not any kind of glamorous army. These people are all too real and not very noble. The original novel was toned down quite a bit for the screen. But when the attack on Pearl Harbor comes, the men rise to the occasion, do their jobs in a more than competent manner and led by Burt Lancaster in that company. It's these men who won that war in the Pacific and the one in Europe as well and From Here to Eternity despite the less than noble portrayals of them as individuals is a great tribute to them as a team.","user":"bkoganbing","rank":[109,140]},{"title":"From Montgomery Clift to Eternity","rating":9,"date":"14 August 2007","review":"Fred Zinnemann's \"From Here to Eternity\" is really more of a soap opera than a war story. Still, it is very well done, and very entertaining. The main attraction isn't World War II, or the soap opera story lines - the main attractions in \"From Here to Eternity\" are the actors' performances.<br><br>Montgomery Clift's is the \"main attraction\" performance. He makes his character the central figure, despite other story lines, and his performance is mesmerizing. Every look Clift gives, every facial tic, every syllable is fascinating to watch. And, it's all very natural very character-driven. Not that all the others aren't terrific, too. Burt Lancaster is a close second, and everyone performs exceptionally well.<br><br>Mr. Clift's performance helps elevate both the other performances, and the film in general. Check out how great he makes all the other actors, \"look\" simply by playing a bugle. This is a case where an actor's performance affects both the other players in the scene, and even leaves its impressions in scenes where the actor doesn't appear. If you take Clift out of the film, you have a much more ordinary movie.<br><br>I'm not sure, however, what/if the film is trying to say about war - is it making a statement of some kind? The main story is: Will Mr. Clift's character box (fight) or, won't he fight (box)? I guess he is bullied into fighting, but does not initiate fighting (he blinds a man, symbolically, by knocking him out in an unseen fight). I am not sure if I got the film's message, or even if there was one.<br><br>I would have also made either MORE EXPLICIT or MORE SUBTLE the whole prostitution part - it was a place to have sex during the time, I guess. Donna Reed and the other women were prostitutes, I guess. Since they couldn't make it more explicit, they toned it down to make us really think these men went to town so they could exchange \"nice\" smiles with \"nice\" women. Elsewhere, Mr. Lancaster and Ms. Kerr's sound like they've had physical relations, when, it looked, to me, like they'd only been hit by a wave. I know this was the '50s, but filmmakers had developed many subtle ways of relaying this information for the prior half century... <br><br>So, what it boils down to: This is a great wartime soap opera, with great performances. <br><br>********* From Here to Eternity (8/5/53) Fred Zinnemann ~ Montgomery Clift, Burt Lancaster, Frank Sinatra, Deborah Kerr","user":"wes-connors","rank":[9,9]}]