[{"title":"FIRST HALF FUNNY","rating":6,"date":"10 May 1999","review":"Though never subtle this Dieter Hallervorden vehicle does not have the tastelessness of some of his other films, and certainly the first half is entertaining and funny (a little knowledge about German politics is required here). But the satire dies out and the story switches to a too sentimental story with Dieter trying to get back his young friend Paul. Only at the end the satire comes back, but the viewer (at least this one) is already too bored with Paul to be interested again. The end of the film is very badly scripted: at once the film is over and the viewer waiting for a meaningful ending. Director Schabenitzky keeps the comedy and especially Hallervorden under control thereby avoiding getting it too farcical.","user":"J. Steed","rank":[1,1]},{"title":"Nothing new or refreshing","rating":4,"date":"21 July 2016","review":"\"Der Experte\" or \"Non Stop Trouble with the Experts\" is a West German German-language film from 1988, so this one will soon have its 30th anniversary. It is one of the later works from German actor Didi Hallervorden's very prolific 1980s in terms of German comedy films. The director is Austrian filmmaker Reinhard Schwabenitzky and the script was written by no less than 3 people. This is especially disappointing as the screenplay is probably the film's biggest weakness. And also it may have needed Hallervorden himself to work on it in order to be a success. This film runs for slightly under 90 minutes, which is already somewhat long for a Hallervorden film. He has his moments for sure as he always does, but I still found it underwhelming overall. One reason may be that, on many occasions, it felt like a weak copy of Hallervorden's earlier film \"Der Doppelgänger\". And there were also moments when the film tries to be too much against politicians in order to appeal to the masses who don't like politicians either. Another weakness was everything related to Paul, a teenage boy who is an orphan. His story-line added absolutely nothing of value to this film and I have no idea why he was included here. The reason must have been to get in some tear-jerk moments and emotion perhaps that goes beyond the camera. But neither the child actor nor the way he was written were good enough to really make an impact. Hallervorden shines though his comedy and same can be said about his films in general, at least the more known ones. What we see here now is desperately fake and cringeworthy on some occasions. This film tries to be way too much for his own good. Without Didi it could very well have received an even lower rating by me, but of course 2 out of 5 is nothing to be proud of either. I do not recommend the watch.","user":"Horst_In_Translation","rank":[0,0]}]