[{"title":"Film Noir At Its Very Best.","rating":9,"date":"14 December 2010","review":"Universal International's THE KILLERS (1946) is arguably the finest Noir ever to come out of Hollywood. It certainly has the most effective opening scene of anything that was ever seen in a film of this type before or after. Bright street lighting throws long dark shadows on the street that emanate from the two wanton and pernicious hit men of the title as they stealthily walk to a diner in the small town of Brentwood seeking their prey. With stunning monochrome cinematography by Elwood Bredell and underscored by the ominous pulsating music of Miklos Rozsa it is one of the most perfectly conceived sequences ever seen on the screen. From a short story by Ernest Hemingway THE KILLERS was beautifully adapted and written for the screen by Anthony Vieller and bracingly directed by master craftsman Robert Siodmak. This was the second of three high tension crime thrillers produced for the studio by Mark Hellinger - the other two being \"Brute Force\" (1947) and \"Naked City\" (1948)<br><br>A brooding Burt Lancaster, in his first starring role, plays ex prizefighter Ole Anderson known as the \"Swede\" who has buried himself in the unknown town of Brentwood where he works at a filling station. But the \"Swede\" is a man with a past! Years before he was involved in a robbery and after double crossing the gang he absconded with the loot. Now it's payback time and two hit men (Charles McGraw and William Conrad) have been sent to Brentwood to \"take him out\".(\"Why do you want to kill the \"Swede\" asks the barman in the diner \"We're killing him for a friend\" replies Conrad coldly). But the \"Swede\" doesn't run and is strangely reticent about his impending fate. Even his friend Nick Adams (Phil Brown) warns him about the two strangers in the diner intending to kill him. \"Why do they want to kill you\" Nick asks.........\"I did something wrong ......once\" responds a resigned \"Swede\". Later after the killers fulfil their grisly contract (a brilliantly intense heart stopping scene) an insurance investigator (Edmond O'Brien) is assigned to find out the whole story about the Swede. And in flashback we see how he fell in love with the beautiful Kitty Collins (Ava Gardner) wife of gang boss (Albert Dekker) and the series of events and double crosses that occurred before and after the heist that ultimately led to his killing.<br><br>Performances are excellent from all concerned. Lancaster is terrific as the ill-fated \"Swede\" and Ava Gardner never looked more ravishing than she does here. But superb are those in smaller parts such as gang members Albert Dekker, Jack Lambert, Jeff Corey, Sam Lavene as a cop and not forgetting the perfect casting of William Conrad and the chilling Charles McGraw as the title characters. Carrying the whole thing along is the extraordinary nominated atmospheric score by the great Miklos Rozsa. His raw biting music with terse rhythms and musical hammer blows adds immeasurably to the picture. ( Curiously his motif for the two killers was \"stolen\" and used without permission as the theme for the long running TV series \"Dragnet\" in the early fifties.) Rozsa'a music for films came in three distinct phases. The first phase was his writing for fantasy films which included \"Thief Of Bagdad\" (1940) and \"Jungle Book\" (1942). THE KILLERS came from the second phase which covered his output for psychological and crime thrillers like \"Spellbound\" (1946), \"Lost Weekend\" (1945) and \"Brute Force\" (1947). Then finally his third phase - for which he is best known - covered his work on historical and epic subjects like \"Quo Vadis\" (1951), \"Ivanhoe\" (1952),\"Ben Hur\" (1959) and \"El Cid\" (1962).These films all had unequalled rich highly textured vibrant scores.<br><br>Rozsa's powerful music is but one aspect alongside editing, cinematography, directing, writing and great performances that makes THE KILLERS an exceptional work of cinematic art. Here is a movie that maintains a palpable dramatic thrust throughout its running time. Few films achieve this. THE KILLERS does ....in spades!","user":"jpdoherty","rank":[50,53]},{"title":"This is the one --well, one of the ones","rating":12,"date":"12 September 2005","review":"Along with Billy Wilder's \"Double Indemnity,\" this is the one that established what film noir was all about.<br><br>Robert Siodmak's classic thriller, along with \"Criss Cross\" are two of his best pieces of work, proof positive that crime dramas could rise above the mundane and the clichéd.<br><br>Based on one of Hemingway's Nick Adams short stories, it tells the intriguing tale of two hit men who show up in a small town (the film moves it from the Midwest to New Jersey), where they take over a diner and tell its terrified occupants they intend to murder a nobody of a gas station attendant when he comes in for dinner. When he doesn't show, they hunt him down at the rooming house where he lives and do the job there. That's where the short story ends, but the script by Anthony Veiller picks it up from there, pursuing the fascinating story of what makes a man give up on life to the point where he passively waits for a pair of gunmen to show up and blow him to smithereens.<br><br>The protagonist,called the Swede, is a guy who isn't a criminal by nature, just a guy who fell upon hard times, but sees a way out by committing one more crime. And of course, as in any good film noir, his greed is fueled more by lust than anything else. There's a girl involved and in order to get her, he has to get the loot.<br><br>Burt Lancaster, in his first staring role, comes off very well here, as does Ava Gardner, also top billed for the first time. Strong supporting performances by the great Albert Dekker as the top hood and Sam Levine as a cop with a heart of gold. And we cannot forget Charles McGraw and William Conrad as two of the most frightening cold blooded killers in film history.<br><br>Siodmak does a great job in the director's chair in this Mark Hellinger (The Roaring Twenties) produced drama, but it is cinematographer Woody Bredell who steals the show. His use of lighting goes beyond spectacular. All of the clichés we think of in film noir lighting spring from this one film, where they were done right. And watch for one of the longest tracking shots in film history, as Nick Adams flees the diner and races to the Swede's rooming house to warn him. It's an amazing, unbroken shot that runs more than a minute.<br><br>Watch, too, for the brilliant shoot 'em up scene in a restaurant at the end of the movie when the two gunmen reappear. It is just a textbook blend of all the movies are supposed to be about, great acting, camera movement that means something, and brilliantly layered music by Miklos Rozsa. Film-making doesn't get any better than this.<br><br>A four star film and one of the godfathers of the genre. Don't miss this one.","user":"Tony43","rank":[77,90]},{"title":"Has aged unbelievably well.","rating":9,"date":"11 November 2004","review":"Maybe I've just seen too many old movies, but for me, other than the period fedoras and suits, nothing about this movie would really give away that it's almost 60 years old. <br><br>The plot is solid and keeps you guessing until the end, with many twists and turns along the way, and is told asynchronously (perhaps necessary for today's audiences, which may be why it holds up so well). The acting is great, quite realistic, and for the most part avoids the maudlin sentiment and overacting that characterizes some older films. <br><br>The Killers is an incredibly enjoyable crime film, perhaps the perfect crime film. I haven't seen the remake, so I can't comment on that, but I hold this film in high regard.","user":"cebudden-1","rank":[82,109]}]