[{"title":"Charlton Heston goes for poetry instead of bombast, romance instead of heroism","rating":10,"date":"22 September 2002","review":"If you want a movie about long ago and far away, this one is highly recommendable, unless of course you need light sabers or all-powerful rings to hold your attention. <br><br>Costume pictures often reek of Classics Illustrated comic books. This is among the few whose script as filmed is not an insult.<br><br>Director Franklin Schaffner obviously loves the material. He later returned to the period with \"Lionheart: the Children's Crusade,\" after \"Planet of the Apes,\" \"Patton,\" and his other famous epics.<br><br>The film's atmosphere is incredibly strong - I was absolutely sure that this was shot on location in Europe until I recognized the Universal hillside towards the end. Rarely does a Hollywood movie hide its back lot origins so thoroughly.<br><br>Minor drawbacks must be acknowledged. The girl suffers well silently but can't deliver her few lines. Maurice Evans is an awful ham, showing once again why he was Orson Welles' least favorite actor. There's a handful of clumsy process shots, and Paul Frees not only delivers the opening narration but voices both Sammy Ross and Michael Conrad, later familiar from \"Hill Street Blues.\" Someone in the Universal sound department thought that Frees' voice was undetectable; and it isn't. (It gets worse: you can hear Frees as four separate characters in \"Spartacus.\")<br><br>None of these quibbles matter. The \"War Lord\" is romantic, poetic, mildly gritty (by today's standards), and the production design, cinematography and music are all gorgeous. The tumultuous siege of the tower is solid in the way things were before computers, and features what seems to be every stuntman in Hollywood, including Joe Canutt, Hal Needham, Richard Farnsworth and Buddy Van Horn. <br><br>I wish Universal could figure out a way to keep the DVD in print. Remastering might help. If you have a multi-system, multi-region player, at this writing a far superior widescreen Danish transfer is available from both UK and German Amazon.<br><br>IMDb lists at least 250,000 worse ways to spend two hours than \"The War Lord.\" Make yourself comfortable and enjoy.","user":"tonstant viewer","rank":[59,64]},{"title":"A Castle and Some Swampland for Chuck","rating":8,"date":"20 August 2005","review":"The War Lord is Chrysagon, as essayed by Charlton Heston, a knight come to a moody medieval place with his retinue to take charge. This is one of Heston's best performances, as he actually loses himself in the role, at least in a few spots, rather than projecting his standard Chuck persona. He's somewhat superstitious, as everyone is during this period, longing for a little love which he never had a chance to have before, and in strange, if expected, competition with his younger brother (Stockwell). The fighting scenes are excellent, a bit ahead of their time, even if they don't seem so now. Back then, having guys clanking swords always carried the same limited appeal, but here there's some nicely energetic choreography, quite complex in places. As someone states near the beginning, the atmosphere has a queer, moody tinge and all the players seem caught in a suffocating tragedy waiting to happen. Director Schaffner, as he would continue in later films, conveys a reality to all the proceedings, despite a rather fantastic setting from our point of view in modern times.<br><br>Most of the actors are terrific. Boone is Boone, being his usual tough ornery personality; no one would mess with this guy. Stockwell is tremendous; it's a shame he only appeared in a few more films which no one went to see and faded. He's very intense here, his envy of his brother and coveting his station a palpable energy. Forsyth, the object of Heston's desire, does seem out of place, never really in sync with the rest of the cast. In a way, this works in her character's favor, what with the suggestion of witchery surrounding her. Farentino, in an early role, doesn't get to show much range but what he does show is very effective. You genuinely feel for his plight towards the end due to the strong emotion he projects. In all, this is a smaller-scale epic than what one is used to from Chuck (\"El Cid\" and \"Ben Hur\" for example) but the almost intimate focus on this patch of land and the small cast of characters works in its favor.","user":"Bogmeister","rank":[34,36]},{"title":"This is the role Charlton Heston was born to play.","rating":10,"date":"19 August 2004","review":"If you're under 20 years of age this flick is going to look a little strange to you. There are no super-women wielding swords in battle, very little profanity, and the only sex is in PG form. Made in 1965, The Warlord is an accusing yet romantic look at medieval Europe. It's no Disney movie, but you could still take the whole family to see it.<br><br>The cast is first rate. Forget El Cid. This is the role Charlton Heston was born to play. You can pretty much say that about all the great actors in this story, most of whom are gone now. Richard Boone, Guy Stockwell, Maurice Evans, Michael Conrad,...but thank heaven we have them all assembled here in this exciting yarn about the middle ages. There's plenty of action, romance, and even a little comic relief. Men will enjoy the kick-butt sword fights, (Heston kicks one guy in the groin actually,--crude but effective). Ladies should enjoy the romance if they can remember that this is happening in the year 1060, long before the women's movement. The hero Chrysagon fights two empires for the love of one woman, says the promo. Even in 1965 that was enough for most women. The peasant girl Bronwyn, played by Rosemary Forsyth, has scores of men killing each other over her, although quite unintentionally.<br><br>Other good ingredients: a rousing and romantic musical score, and some well-done outdoor photography of Chrysagon's tower fortress and the battle scenes.<br><br>All in all, this is a great movie to watch on some Saturday afternoon. It will take you away from your problems for a while to a time and place long ago. And since medieval Europe really stank, it will make today's world look pretty good to you again.","user":"lloyd7202003","rank":[57,64]}]