[{"title":"Cheers Guv'nor","rating":8,"date":"29 October 2005","review":"A no frills film in keeping with the series, the genre and the time.<br><br>This is a film about edgy London police in an edgy London in the edgy 70's. You could of course substitute \"edgy\" for \"dodgy\" in the above sentence and it would still be true...<br><br>For those of us around in the 70's it, like the series, is fantastically atmospheric. The hair, the clobber (look out for Regan's green anorak), the boozers, the motors, the women.<br><br>The plot is far less important than the characters who are all superb, and a particular mention for the young (and very beautiful) Diane Keen, and to a lesser extent Linda Bellingham - whose nudity makes you look at those OXO adverts very differently (or it would if they were still on) The film also gives some extra scope to the relationship between Regan &amp; Carter, and there are some edgy moments between the 2, starting with their morning-after-the-night-before and culminating in the dramatic ending and indeed the film's last words. One of the many things I liked about the Sweeney was its realism and how it didn't portray its main characters as heroes but showed their dark sides and their failures.<br><br>I loved the TV Sweeney, for me John Thaw's (God rest his soul) Regan is one of, if not the, best TV characters of all time and this is an appropriate and very satisfying movie length \"episode\" Hollywood it ain't guv'nor, and for me thats what makes it the boll***s.","user":"markmartin2305","rank":[21,22]},{"title":"Sweet as a nut, guvnor","rating":18,"date":"18 September 2004","review":"\"Sweeney!\" was one of the innumerable TV spin-offs which kept the British film business perilously afloat in the 1970s. For once this low-budget work did not spring from a sitcom but from Britain's best ever cop show, which made \"Starsky and Hutch\" look like \"Sesame Street\" with its relentless violence and raucous backchat. (\"Sweeney Todd\", it should be explained , is London rhyming slang for the Flying Squad, an elite detective unit of the Metropolitan Police.) <br><br>Jack Regan and his sidekick George Carter here find themselves out of their depth with a bigger budget and canvas than on the boob tube: they get \"webbed up\"in an international conspiracy to lower, or raise, or something, oil prices. A suave Energy Minister is too fond of the high-class \"brasses\" furnished by his American PR agent. He is blackmailed, with multiple-murderous consequences and mucho ketchup.<br><br>In some ways this is very much a 1970s period piece: flared trousers, two-tone grey telephones and no computers, police who drink and smoke heroically, ugly lowlifes, hideous pubs, tyre abuse, shootouts in junkyards and an overall grey, downbeat atmosphere which is a far cry from the Swinging London of Hollywood England in the previous decade. \"Sweeney\" was conceived at the moment of maximum crisis when OPEC was holding the industrialised nations to ransom, inflation was the highest for 60 years and trade unionists and militant socialists seemed poised to seize power in Blighty. <br><br>True, a red double-decker bus figures during one chase, but the film makes concessions to mid-Atlanticism neither in casting, nor by moderating the constant Cockney badinage (\"leave it aht!\", \"you wot?\", \"shut it!\", \"dull it isn't\" (mocking a Met recruitment slogan)) nor by glamourising its high-life scenes. Also carried over from the series is the endless friction between different law enforcers: Regan clashes not only with his superior but with the security services and Special Branch, the Met's anti-subversion arm. Typically, he cocks up the operation to snatch the PRO and bring him to justice. Regan is no superhero.<br><br>Contrary to what others have posted, I find Foster's accent and manner all too convincing, and his performance incisive. The theme of politicians being corrupted by their spin doctors remains fresh. Ian Bannen as the blackmailed MP looks and has a role not unlike Robert Vaughn's. Thaw and Waterman are the same crumpled reprobates as on the small screen, but the plot makes too little of their partnership; Regan is suspended and lone-wolfing it for much of the running time.<br><br>No doubt the best of \"The Sweeney\" was on TV, but this is a fair-value distillation and introduction. It makes the mockney gangster movies of Mr Madonna and his posse look pathetic. \"Up yours, sunshine!\"","user":"Oct","rank":[15,18]},{"title":"They didn't kill him. YOU DID!","rating":7,"date":"11 June 2005","review":"I suppose anyone born in the late 60s or before is going to look fondly on this, and I'm no exception. I don't know about you but watching this (and the series of course) makes me think that there is just something missing in today's police related stuff on TV. It comes across as too sanitized, too clean, as though every 'officer' is reduced to some kind of professional stereotype (the good guy, the bad guy, the guy trying to escape his typecasting as Mark Fowler etc etc).<br><br>'Sweeney' comes across as REAL. Of course it's cannon fodder for all those comments about trim phones, flares, kipper ties etc, but let's face it folks, at least the 70s had an IDENTITY. What is there now? What differentiates a 15 year old episode of 'The Bill' from one made in 2005? Not much I reckon.<br><br>That's why this is good - real people with real personalities, foibles, quirks etc behaving human beings. I remember once that Regan was asked why he was still an inspector - 'I don't play golf' was the response. How true is that in the wider world! Enough rambling - the film itself. To me the acting is uniformally excellent; Foster doesn't come across as negatively pragmatic or oleaginous till mid way through the film, and the way his plan unfolds slowly as your distaste for him increases is carefully handled. By the end, you're rooting for him to get his come uppance. Also, the way Regan is hemmed in by those in authority as the film progresses is nicely claustrophobic, particularly when a suspended Regan meets Carter in a pub and is advised to 'get yourself some Alka Seltzer.' There are many quotable one liners here, deftly delivered by key protagonists. 'Alright Tinkerbell, you're nicked' is up there with 'in a thin glass' IMHO. Of course, they needed a 'big' plot to fill 90 minutes, and comparisons with Watergate and the general economic malaise endemic in Britain in the mid 70s are obvious. But put all that to one side folks - if you liked the series, you will like this, especially if, like me, you can remember a time when watching something on TV was an event to look forward to.","user":"philkessell","rank":[5,6]}]