[{"title":"A classic of children's cinema","rating":10,"date":"20 December 2006","review":"Truly without any shadow of a doubt a masterpiece of children's cinema. Totally different from US or European cinema: there is no play to the emotions here. It is simply who and what Pippi is: and it is deeply enthralling to children.<br><br>We have three children who all LOVE watching these. They are not clever, or brilliantly filmed, have no CGI whatsoever and yet they come back to them again and again and again.<br><br>For a child what can be more exciting to have a friend who doesn't need adults, is generous, fun, mischievous, silly, has fantastic adventures, AND is the strongest (yes! strongest!) girl in the world. <br><br>This series shaped a generation of Swedes: it is truly is one of the best of all children's cinema. Adults may not get it as much as their children will. Best for those around 3-7 you will be amazed at what they see that we no longer do. Hurrah for Pippi!","user":"intelearts","rank":[13,13]},{"title":"The first movie i've ever seen in the cinema","rating":10,"date":"24 May 1999","review":"Pippi Longstocking was the heroine of my childhood. When i was a little girl I wanted to be so strong like her and I wanted to have such beautiful red plaits. Now I am a thirtysomething adult woman and it still fills my heart with joy when I watch the film. Astrid Lindgren has really written one of the most beautiful children's books in the literature history and all the Swedish Pippi Longstocking movies are absolutely awesome. Georg Riedel has also written a memorable and wonderful title song.","user":"giraffelover","rank":[10,11]},{"title":"The Best Inger-Pippi film","rating":10,"date":"3 July 2006","review":"This is, by far, the best of the four films starring the original (and in my opinion the only) Pippi, Inger Nilsson. She's fantastic and so are the actors playing her cohorts, Tommy and Annika. You cannot have a Pippi film without all three kids. In this outing, the trio run away and go on many adventures. One includes riding on a train. Another includes taking a trip on a flying car that runs on super-glue. I like the scenes when they are watching the wild strawberries and kicking back, enjoying their freedom near a river in the journey's start. There is such a relaxing aura watching these gems. Space and time are quite important, especially since it's shot in the beautiful Swedish countryside that seems to go on forever. Another great scene is when Pippi rides a barrel down a waterfall. And they also visit a farm and Pippi battles a bull to save a child. All is great fun. This one is the best. Pippi is the epitome of a superhero, and she's one of the best superheroes of all time.","user":"A_Minor_Blip","rank":[5,5]}]