[{"title":"Ectoplasmic!","rating":8,"date":"15 January 2006","review":"I taped this from UK Channel 4 on 20th Dec '90 - it has a better soundtrack than the admittedly budget DVD from Carlton. The Technicolor is still sumptuous, clever and thought-provoking however and overall it doesn't need remastering - just turn the volume up! Noel Coward's witty play transferred to the ghastly green screen perfectly, in 1945 it was as wildly old-fashioned as \"Brief Encounter\" was in 1936 on stage as \"Still Life\". But same as that film and almost everything Coward did from the '20's to the '40's, it remains eminently watchable and a riveting experience.<br><br>Basically Rex Harrison's dead 1st wife is summoned back in a séance to the \"real world\" much to his and his 2nd wife's consternation. A marvellous cast mainly depicting erudite and splendidly eccentric English so-called \"middle-class\" - because they had to work for a living hence they were all highly paid working class - an amusing concept Coward would have violently and amusingly disagreed with. Margaret Rutherford takes the prize for the most eccentric performance as ever flailing never failing Madame Arcati the lively spiritualist. The dialogue is urbane, brisk and witty throughout, so a thorough knowledge of English language and English customs up to 1945 is essential to getting the most from this.<br><br>That can also mean that although it helps you don't have to be English and live in England to enjoy it. A previous non-blithe commenter with apparently no sense of humour from the UK displayed a complete non-understanding, non-interest and non-acceptance of anything British and must desire complete separation from anything to do with Britain - probably apart from the passport. What would the ghosts of 1945 say if they could come back today and realise that a classic such as this can be dismissed so negatively?","user":"Spondonman","rank":[41,51]},{"title":"A comic masterpiece with all the right ingredients","rating":10,"date":"26 August 2004","review":"Noel Coward wrote Blithe Spirit in 5 days during Britain's darkest days of the Second World War. The play completed 3 decades as Britain's longest run in West End for a comedic play. The film which was adapted from the play was directed by David Lean and incorporated some of the most sophisticated special effects yet seen in a movie. The film tackles some dark themes such as death and falling in and out of love. The characters themselves are on the face of it unsympathetic. Elvira is a siren, Ruth is shrewish and Charles a misogynist. Despite this the film works well as a comedy because of the quick and clever dialogue between the characters and the scene stealing performances of Margaret Rutherford's Madame Arcarti. You end laughing at and sometimes with the characters as one would do a Shakespeare comedy. Never has a film about death been so funny","user":"SATURIASIS","rank":[33,41]},{"title":"Spiritual mirth is a joyous thing.","rating":9,"date":"4 March 2008","review":"Blithe Spirit is directed by David Lean and adapted from by Noel Coward's play by Lean, Coward, Ronald Neame and Anthony Havelock-Allan. The title Blithe Spirit was devised out of the poem by \"To a Skylark\" written by Percy Bysshe Shelley. The film stars Rex Harrison, Constance Cummings, Kay Hammond and Margaret Rutherford. Music is by Richard Addinsell and Neame is the photographer. Plot finds Charles (Harrison) and his second wife Ruth (Cummings) haunted by the ghost of Charles' first wife, Elvira (Hammond). Medium Madame Arcati (Rutherford) is enlisted to try and help. Things get colourful to say the least...<br><br>Written by a maestro and directed by someone so gifted, Blithe Spirit is a fantastical comedy that gladdens and lifts the spirits (no pun intended) to the point that this viewer always wears a grin 12 hours after watching it. Noel Coward's witty approach is given perfect treatment from David Lean and a cast clearly having fun with the material to hand. Rex Harrison is all fresh faced and youthful, whilst some of his mannerisms of incredulity and cheek are a joy to behold, while Constance Cummings &amp; Kay Hammond bounce off each other with electrical mirth. However, it is Margaret Rutherford's show all the way, her portrayal of the batty, almost maniacal, medium Madame Arcati is a lesson in visual and well delivered oral comedy, it is something that on its own is worth watching the film for.<br><br>Ghostly goings on with a cracking turn of events at the hour mark, mark this out as a truly delightful movie, thankfully we get an ending that is perfect and in tune as regards the fun that has gone before it. Essential viewing for the classic comedy fan. 9/10","user":"hitchcockthelegend","rank":[18,21]}]