[{"title":"The Kerbys in purgatory","rating":8,"date":"30 August 2005","review":"\"Topper\", the delightful and original film directed by Norman Z McLeod, should be seen more often. It is one of the best things Hollywood ever produced at the height of the madcap comedy craze of the thirties. In fact, just to watch Roland Young, Constance Bennett and Cary Grant in the same film is a dream come true.<br><br>\"Topper\" has always been an old time favorite. We were treated the other night to watching it again, courtesy of TCM. The film's great black and white cinematography by Norbert Brodine looks good, even after these many years.<br><br>Constance Bennett and Cary Grant made a fabulous couple. Ms. Bennett had the uncanny gift of blending with all her leading men well. She was a charming actress with such a sense of style and an amazing figure to boot that made her an irresistible presence on the screen. Cary Grant is also seen at his best in the film as the careless and fun loving George Kerby.<br><br>Roland Young, in our humble opinion, steals the show! He plays the staid banker Cosmo Topper, who is all business until he starts being made the object of the Kerby's antics. Cosmo Topper's wife is the incomparable Billie Burke, one of the most gracious actresses of that era.<br><br>The rest of the cast is not too shabby. Alan Mowbray, Eugene Palette, Ward Bond, Hoagy Carmichael, and as an extra, Lana Turner could be seen backing the principals with their usual elegance and enormous screen presence.<br><br>\"Topper\" is a film that should be \"rediscovered\" by new audiences, as it shows how great Hollywood could be when it wanted to be original. But above all, \"Topper\" should be seen for the fantastic Roland Young, who is nothing short of perfection in the film!","user":"jotix100","rank":[41,44]},{"title":"Ghostly Encounters--Act One","rating":10,"date":"28 June 2004","review":"Cosmo TOPPER has his stuffy, henpecked life turned upside down by the interference of two recently deceased friends.<br><br>The folks at Hal Roach Studios fashioned this popular supernatural comedy. Intended to be at the opposite extreme from the typical ghost thriller, there are no sudden chills or eerie ectoplasms here--just lots of good humor and a few (well done) special effects.<br><br>Owlish Roland Young plays the bemused recipient of his dead friends' good deeds. No matter how drastically the intentions backfire, leading to arrest &amp; scandal, Young remains a decent chap bent on regaining some equanimity in his life. (What is most impressive about his performance are his hilarious physical contortions when under the invisible influence of the ghosts.) Dear Billie Burke is wonderful, as usual, as Young's slightly bewildered wife, who has relinquished the role of lover to be mother hen to her husband -- hoping her control over him assures their acceptance by high society.<br><br>As the Kerbys--living and dead-- Constance Bennett &amp; Cary Grant have plenty of star power &amp; charm to spare and their spirits are certainly blithe, but a frank examination of their characters reveals some flaws. There is nothing funny about alcoholism or reckless driving, both of which contribute to their demise, and they are fortunate they kill only their own silly selves and not anyone else. That being said, they certainly do make a pair of great-looking spooks.<br><br>The rest of the cast adds to the fun: Alan Mowbray once again plays a butler with an attitude; young Arthur Lake appears as a hapless hotel employee; elegant Hedda Hopper does well with her single scene as an unstuffy society doyenne; J. Farrell MacDonald plays a no-nonsense cop; and corpulent Eugene Pallette has fun with his role as a suspicious hotel detective.<br><br>Composer Hoagy Carmichael appears as himself and Ward Bond plays a taxi driver, both uncredited.<br><br>This was the first of a 3-film series and was followed by TOPPER TAKES A TRIP (1939) and TOPPER RETURNS (1941).","user":"Ron Oliver","rank":[33,37]},{"title":"Introducing George and Marion Kirby, ghosts","rating":8,"date":"25 November 2006","review":"A dead couple is determined to loosen up their friend in \"Topper,\" a 1937 comedy starring Constance Bennett, Cary Grant, Roland Young, and Billie Burke. Cosmo Topper (Young) is a bank president whose wife (Burke) has him on a strict schedule and, though unhappy, Cosmo complies.<br><br>When bank stockholders George and Marion Kirby are killed when their car crashes into a tree, the two become worried about what St. Peter will have to say to them. They were, after all, two fun-loving, hard-drinking, partying kooks. They decide they must do a good deed before approaching the pearly gates so they make loosening up Topper their project.<br><br>This is a wonderful film that inspired the Leo G. Carroll TV series with real-life marrieds Anne Jeffreys and Robert Sterling as Marion and George. The special effects in the 1937 film are groundbreaking and ingenious. Mores have changed over the years - driving drunk is no longer acceptable. I'm afraid George and Marion would be heartily disapproved of today. Nevertheless, they're a gorgeous, glamorous couple and the real stuff of fantasy. Bennett only has a couple of years of big stardom left and, with his second billing, Cary Grant is still on the ascent. They're both hilariously madcap, Grant blasting into a stockholders' meeting and trying to take notes, and Bennett flirting with poor Topper in her silky voice.<br><br>Roland Young is the perfect Topper - henpecked, confused, and a nervous wreck. He's a man dying to break free of his shackles, and he's always envied George and Marion's lifestyle, even though it killed them. His frustration and unhappiness make him sympathetic, and the audience is with him all the way.<br><br>Very enjoyable, with some effects that were eye-popping in 1937. Don't miss \"Topper.\" It's a classic.","user":"blanche-2","rank":[17,19]}]