[{"title":"It is a very good movie.","rating":7,"date":"17 August 2002","review":"Having worn the Habit, having gone through similar personal struggles and worked with inner city poverty and issues, I can attest to the accuracy of this movie.  Also based on my own experiences, Elvis is also quite believable as the young inner city doctor trying to connect with his patients.  It does accurately reflect the turbulence and changes of the 60s, besides being a fun movie.  I identified with it, and feel that people who make fun of it don't really deeply understand the issues it's dealing with. I would especially recommend it to those who would like to understand that period better, plus the personal struggles of the inner city.","user":"vdamien","rank":[46,50]},{"title":"Underrated Presley Performance","rating":7,"date":"13 February 2002","review":"Although I am not a fan of the legendary Elvis Presley (in music or on screen), I must say that after seeing his 1969 film, \"A Change of Habit,\" I realized his talent as an actor was very underrated. Of course, he was placed in his share of cheezy B-movie musicals, some so terrible that, to quote the King himself, they made him \"physically ill.\" But this film lets Presley perform in a more relaxed atmosphere, without the restrictions of having to have a guitar at his side every second (though he does sing a bit in this film, but not so much that it ruins the drama). The same year, Presley was offered Jon Voight's role in the Academy Award winning \"Midnight Cowboy.\" This film has led me to believe that Elvis may not have been bad at all in that role. --Bud Sturguess, Texas","user":"full_meddle_jacket","rank":[26,28]},{"title":"Watch to the end.","rating":8,"date":"29 December 2009","review":"This movie is dated in a lot of ways, and not so dated in others. The fact that it was made at the end of the 60's comes out not only in the topics, but the way the movie was made, using modern (for the time--but maybe outdated for movies now) sets, filming techniques, and even story lines. Still, we see here that Elvis was an outstanding actor. It was not hard to think he was anything other than the character he played in this movie. I also have to add that he looks extremely cool in this movie!<br><br>The part that really shines in this movie is the last 20 minutes. The complicated love between Elvis' and Mary Tyler Moore's characters is NOT outdated at all. This part of the movie is played out really well. On top of this, finding out the destinies of the other sisters will leave us as viewers with a lasting impression.","user":"rogerinjp","rank":[13,13]}]