[{"title":"Well-worn ruts on this \"Trail\"","rating":5,"date":"7 August 2005","review":"By 1959, TV westerns had begun to replace the Hollywood B-western so there's the distinct feeling that \"The Oregon Trail\" -- despite its color and widescreen -- really isn't needed. Certainly there's no passion or style apparent in the film's making. It's more a case of everyone just going through the motions and collecting a paycheck.<br><br>Things begin unpromisingly with a scene involving President Polk in Washington D.C. This scene tries to give the story a historical context but it's on the dull and talky side. This is followed by another lax scene in which dapper, man-about-town reporter, Fred MacMurray, is assigned to go west on a wagon train and write a story for his newspaper. Finally, as MacMurray arrives in Westport, Missouri -- the eastern start of the Oregon Trail -- things begin rolling. They do so in a conventional way, however, and the entire trek west is filled with the usual situations: troubling encounters with Indians, dry water holes, tensions among the folk on the wagon train, an unexpected rain storm, a funeral service by the side of the trail, a settler protecting his apple-tree seedlings, etc. The use of stock shots and indoor sets hamper the effects of many of these scenes and there's no real villain to conflict with Fred MacMurray. There's also no tension about his mission since he makes no effort to hide it and the possible romantic- triangle involving him and William Bishop and Nina Shipman never takes form. Instead, MacMurray is implausibly paired with Gloria Talbott who appears fairly late in the proceedings.<br><br>Action builds toward a last-reel Indian attack which now seems quite \"politically incorrect.\" (The \"half-breed\" Indian girl implausibly says: \"It is because of this, I renounce my people.\") Perhaps the only notable thing about \"The Oregon Trail\" is the scene in which Indians capture Fred MacMurray, strip off his shirt, and stake him out to die. (For a man in his early 50s, MacMurray looks pretty good bare-chested!) While TV westerns often staged these stake-outs, they're not all that common in the movies, and who'd believe one of them would \"star\" an actor about to get a career boost by playing in Disney comedies?!","user":"dinky-4","rank":[21,27]},{"title":"Good Movie","rating":9,"date":"29 May 2016","review":"I actually liked this movie better then some of the posters. It is important to NOT look at this movie in terms of 2016. Why is that? For example:One of the biggest complaints about this movie was about the 1/2 white 1/2 Indian girl Shona Hastings ( Gloria Talbott) renouncing her people. Keep in mind why did she? Seeing the pleasure on certain people's faces like her father's when small children die is the reason why. What they did was not about a military objective it was actually enjoying killing. As for her father, Gabe (John Dierkes), his guy did not \"Go Native\" to use a British term that a poster used. This guy hated people, and the Indians just gave him the means and opportunity to inflict hurt on others as opposed to preferring a lifestyle or favoring some cause ( right or wrong). If you watch the movie and see how her father treated her ( like a savage) you will see he had no love for her. Spoilers Ahead: Did she choose Neal Harris ( Fred MacMurray) when she saved him after being tied up? Yes she did but that was a personal choice she made. The reason she did was Neal treated her with kindness, decency and respect which no one else did. That act is what saved everyone from getting killed ( not just MacMurray). Is it a great movie? No but well worth watching ( although I suspect it will be hard to find because certain people will not like it) 9/10 Stars.","user":"davidjanuzbrown","rank":[4,4]},{"title":"Obviously this film was not written by a history professor!","rating":3,"date":"25 January 2020","review":"An anachronism is something that appears in the wrong time period. For example, if you see jet planes fighting at the Battle of Gettysburg...that would be a serious anachronism. However, sometimes these anachronisms aren't that obvious and make their way into movies. In the case of \"The Oregon Trail\", it is chock full of anachronisms...so many that you cannot believe that the writers did any research at all to make sure they were getting the facts right. And, for an ex-history teacher like me, it's really annoying!<br><br>Let's mention some of the many anachronisms in this film. The movie talks about the new 'Colt revolver' and show the soldiers using them in 1846. But Samuel Colt didn't make his prototype revolver in 1847 and didn't even open up his own company until 1855...so there would have been no Colt revolvers in 1846. The same goes for the repeating rifles you see in the movie...they didn't come out until about 1860 and were very rare even then....but the natives and soldiers all seem to have them! And, it's not just about weapons...at one point Fred MacMurray's character talks about sending a telegraph from out west to his employers on the East Coast. But the telegraph was never used until 1844 and telegraph wires didn't make it West until a decade later.<br><br>But anachronisms aren't the only problem in the film. President Polk had long hair and styled it in a mullet....but here he's nearly as bald as Kojak! And, often characters do things that simply make no sense...such as MacMurray's character defending a thief even when it's obvious the guy is stealing as well as his crazy fight with the guy with a whip early in the movie. The nasty guy is whipping the snot out of people and Fred is literally standing NEXT to the guy. But instead of socking him then, he backs up...thus allowing the whipper to whip him!! Who is THAT stupid??!! Fred....when you are standing NEXT to a guy with a whip, he cannot use it on you....get it?! Apparently not. Such is the care the writers and director took in making this film. And these little details are why I was not enthralled with this movie.<br><br>If you care, here is the plot: Fred plays Neal Harris, a reporter from back East. There's a rumor that President Polk is sending soldiers disguised as settlers into the disputed Oregon Territory. He heads there in a wagon train to determine if the rumor is true. Along the way, there's a lot of nonsense and really, really bombastic music!<br><br>Overall, this is a sloppy film and one I'd just as soon skip. There are far better westerns and far better Fred MacMurray films out there!","user":"MartinHafer","rank":[2,2]}]