[{"title":"Begging for a remake, but...","rating":6,"date":"7 April 2002","review":"Now that movie musicals are in vogue again, maybe somebody at Warner Brothers will give the green light to remake this Lerner &amp; Loewe spectacle that was poorly filmed in 1967.<br><br>This version is really a shame, considering how beloved the original 1960 Broadway musical is.  Lerner &amp; Loewe wrote some of their best songs for this show:  \"If Ever I Would Leave You\", \"Camelot\", \"What do the Simple Folk Do?\" and \"Fie on Goodness\".  But when making the film, producer Jack Warner chose tone-deaf actors, one of the worst directors in the medium, and had Alan J. Lerner rewrite his script, stressing the drama over the comedy (to the narrative's detriment) as well as throwing out half the score (including, sob, the show-stopping \"Fie on Goodness\").  Richard Harris and Vanessa Redgrave ARE great actors, and in their dramatic scenes, they are quite effective, but they most certainly are NOT singers, especially poor Ms. Redgrave (although, her orgasmic rendition of \"The Lusty Month of May\" has to be seen to be believed).  Franco Nero, a beautiful, beautiful man, has a great opening with \"C'est Moi\", but then goes downhill from there.  David Hemmings manages to bring some mirth to the film, but he's only in the last third, and by that time it's nearly too late (plus, they cut his only song!).<br><br>On the plus side, the film DID deserve the 3 Oscars it won:  Best Scoring (if you take the voices out, the music sounds magnificent), Best Art Direction/Set Decoration, and Best Costume Design (the flick IS sumptuous). And the cinematography is rather breathtaking at times. (If you do watch it, try to see it on DVD, where it's letterboxed.)<br><br>So, if anybody from Warner Brothers, or any other studio for that matter, is reading this, give it another go:  go back to T.H. White's original source novel and Lerner's original B'way script, keep ALL the songs intact, and hire actors who are proven singers, say, Ewan McGregor (he demonstrated his pipes in Moulin Rouge!) as Arthur, Kate Winslet (who scored a British top 10 hit last year) as Guinevere, and Hugh Jackman (who got his start in a West End production of Oklahoma!) as Lancelot.  Please....","user":"jojofla","rank":[32,43]},{"title":"\"........a fleeting wisp of glory, called Camelot.\"","rating":6,"date":"17 December 2005","review":"I wish I had seen the original Broadway production of Camelot. As a lad the Broadway cast album was a treasured staple in our house, played over and over again by my parents. Can you imagine a cast led by Richard Burton, Julie Andrews and introducing Robert Goulet as Lancelot?<br><br>So why couldn't Warner Brothers sign the original cast from Broadway for the movie? Robert Goulet had in fact come to Hollywood and didn't set the world on fire, but the other two were already big box office names by 1967. Julie Andrews had won an Oscar for Mary Poppins and just did the Sound of Music. And Richard Burton was one half of the most noted show business couple of the Sixties with his wife Elizabeth Taylor.<br><br>Jack Warner, usually a smart guy, said that he didn't think that anyone would believe that two guys like Arthur and Lancelot would put a kingdom at risk for the love of Mary Poppins. So Julie wasn't even asked and Vanessa Redgrave got the call. She's certainly sexy enough, but she opted for the Rex Harrison talk/sing in doing Guinevere. If you have the video or DVD of Camelot play that and then listen to Julie Andrews sing from the original cast album. My favorite song from the score is I Loved You Once In Silence and Julie Andrews is at her best singing that song. Vanessa doesn't come close.<br><br>Ditto for Richard Burton and Richard Harris. Though in the case of Harris I think he was toning it down a mite for a clearly handicapped co-star in the vocal department. Harris later in his life toured extensively in various productions of Camelot as Arthur, virtually taking over the role originated by his close friend Burton.<br><br>The biggest hit from the Camelot score was If Ever I Would Leave You, sung by Robert Goulet. In 1961 you couldn't get away from that song being played on the radio right in the midst of all the rock and roll. Goulet also toured in various stock companies of Camelot and like both Burton and Harris revived it on Broadway. I don't think anyone ever asked Franco Nero to tour.<br><br>But Redgrave and Nero certainly created their own screen magic, they got involved with each other on the set. But folks this is a musical and musically they don't measure up.<br><br>David Hemmings takes over the role of Mordred from Roddy McDowall who did it on stage. His Mordred is a clever schemer, but a coward as well. For myself the best Mordred ever portrayed on screen was in Knights of the Round Table by Stanley Baker. Baker's interpretation of Mordred is light years from Hemmings, he's a schemer, but he's definitely no coward.<br><br>I love the score of Camelot and when it was filmed I only wish the singing was half as good as the Broadway show.","user":"bkoganbing","rank":[43,62]},{"title":"One of the Best Broadway to Hollywood Film Scores, Marred by Sledgehammer Direction","rating":23,"date":"23 July 2011","review":"There is a great deal of misinformation on this blog concerning Camelot (1967), the film adaptation of the legendary Broadway hit. First, Producer Jack L. Warner had asked stage stars Richard Burton and Julie Andrews to reprise their roles as King Arthur and Queen Guinevere. Both refused. At the time, Burton was co-starring with then wife Elizabeth Taylor in a succession of films (The Taming of the Shew, Faustus, Boom!). Andrews was interested until she was told Burton had refused. She also had a commitment to honor her second picture to 20th Century-Fox (the first was the wildly successful Sound of Music; the second the ill-fated Star!). She did not have the best working relationship with Richard Harris, with whom she had recently co-starred with in the epic Hawaii. Harris hated her in kind.<br><br>Camelot did not achieve its legendary hit status until after its director, Moss Hart, had overhauled the musical play long after it had been running. He had suffered a heart attack during the out-of-town tryouts. When the play opened on Broadway in late 1960, the critics were less than kind. While they liked Burton, Andrews &amp; the music, they disliked the second act, when Camelot is under siege by Arthur's illegitimate son, the evil Mordred, and the disclosure of the the queen's infidelity. They did not appreciate the clash in styles, an enjoyable lighthearted first act overtaken by an overly dramatic second act. Hart remedied its faults by tightening the book and eliminating several - though lovely – songs, including Fie on Goodness!, Take Me to the Fair, and Before I Gaze at You Again. The show's hit status was also elevated by its best-selling cast recording, one of the most pleasing ever produced. An appearance by Julie Andrews and Richard Burton on the Ed Sullivan Show, singing Camelot and What Do the Simple Folk Do?, in full costume, helped the box-office sales, too.<br><br>Camelot, the motion picture, has its strengths, primarily perhaps the best adaptation of any Broadway score in the history of motion pictures. Musical Director Alfred Newman and his choral associate, Ken Darby, richly deserved their Academy Awards for their work. The costume, production design and art direction are also Oscar worthy. Beyond that, let there be silence.<br><br>Richard Harris overacts. Mon Dieu, what a ham! He sings acceptably, but overdoes the lyrics considerably with his e-nun-ci-a-tion, especially the title song. As others have noted, the blue eye shadow and ugly wig do not help. Visuals aside, his Arthur renders on the effeminate.<br><br>Franco Nero is handsome but can't act his way out of a paper bag. Stiff and wooden, his Italian accent is incongruous with his dubbed musical vocals. <br><br>Vanessa Redgrave, of the three co-stars, comes off best. Although not a true singer, her songs are passable. Her acting is laudable. She is beautiful, convincingly regal and winning in most her scenes. Her reaction to Lance's bringing the knight back to life is touching and real. She must have ignored direction from the director at times (thankfully for us), otherwise she would not have been as effective.<br><br>Under the sledgehammer, heavy handed direction by Joshua Logan, this film fails on every dramatic level. He has his actors amplify every single syllable and nuance – in extreme close up! Did he not watch his own daily rushes during filming? This is the same director who managed to wreck South Pacific (1958) and would go on to ruin another musical, Lerner and Loewe's Paint Your Wagon (1969). It was Logan – not Warner –who remarked, \"Can you see two men and two countries going to war over Julie Andrews?\"","user":"jonathanlarge","rank":[10,12]}]