[{"title":"Grease Will Always Be The Word...","rating":10,"date":"31 May 2005","review":"How do I start? I love this film! It has a great plot line and incredible music. It is a fun musical that makes you want to get up and dance.<br><br>Grease is the story of Danny Zucko and Sandy Olsen (or Dumbruski) two high school seniors who fall in love over the summer. They have a wonderful summer together and are sad to see it end. The first day of school arrives and little does Danny know him and Sandy would soon be reunited. But Sandy is shocked to find the nice guy she meet at the beach is the leader of a greaser gang called 'The T'birds' Meanwhile Sandy is trying to fit in with her new \"friends\" the T'birds female counterparts The Pink Ladies. Will Sandy and Danny ever be together again? Along with this plot comes song that will be stuck in your head for centuries. Such songs include Summer Nights, Beauty School Dropout and the now famous song Greased Lightining. Grease is a timeless classic that will have you singing and dancing by the end of the movie.","user":"Theater_Princess19","rank":[137,169]},{"title":"One of the best musicals brought to the big screen.","rating":9,"date":"21 July 2007","review":"Although it is old, Grease is still loved and watching by adults and children alike. Once you watch Grease you just want to get up and dance! Grease is the story of bad-boy Danny and good-girl Sandy meeting each other over summer break then happen to returning to the same school. There's a great mix of kids, they all are very different and have one thing that separates them very much from each other. There's a great mix of songs too; slow and very fast. Also, the dancing is amazing. The end also blows your mind and just makes you so astonished, but in such a good way. The up-beat fun never stops and makes you want to watch the movie again and again. Grease is a definite must see for everyone!","user":"uhmyeahhbrooke","rank":[39,48]},{"title":"'It's Still the Word'","rating":5,"date":"5 May 2004","review":"Sandy and Danny, their names alone mean nothing, together they represent the film we all know and love that brought us 'Summer Nights' and 'Greased Lightnin'. Grease is an infamous musical-play turned film, adapted and produced by Allan Carr, chartering the summertastic rock 'n' roll of the 1950s, centring on the highs and lows of a group of teenagers at high-school, Rydell High.<br><br>The film begins with two people having a summer romance, Sandy (Newton-John) an uptight, naïve, nerdy Australian girl and Danny (Travolta), a 'jack-the-lad' 'T' bird. After the opening credits which are amusing cartoons of the main characters we see the two well known groups of teenagers, the Pink Ladies and the 'T' Birds going back to school after summer vacation. The rest of the film centres mostly on the relationship of Sandy and Danny, the problems they face, and the ups and downs of their high school chums. The main characters and the unusual pairing of Sandy and Danny makes for comfortable viewing.<br><br>My favourite part of the film is the music, this film has such a brilliant soundtrack. If you have the chance to watch the film on DVD you get the added bonus of a songbook. However with a musical film you do find some parts unrealistic when they sing, why would a group of lads sing Summer Nights for example? Yet that aside the songs, mostly corny love songs are addictive and easy to pick up unfortunately will be in your head all day. Grease may not have had a lavish budget like films made today, but this 1978 film directed by Randal Kleiser still manages to have great audience appeal. Its' scenes and costumes are basic and probably didn't break the bank to produce but this all adds to the realism of the film.<br><br>I like the film and could watch it over and over again. Newton-John's debut performance is excellent but her character Sandy is too 2D and has no depth. Travolta's performance is to perfection and this film benchmarked his film career. Danny is 3D, he can be loving, self obsessed, a saviour and a winner, whereas Sandy to me is just a bore. All characters bring something different to the film making it a success. Rizzo is the hard nosed cow, bitchy about Sandy, possibly jealous, who seeks revenge on her boyfriend by going out with his arch enemy. There is also Marcy who loves the men and has lots of boyfriends, and Frenchy who becomes Sandy's best friend who is caring.<br><br>This uplifting, audience grabbing film may be slightly cheesy but there is just so much to love about it, especially the soundtrack and dance moves! This gives it longevity making it such a great film that could be the best musical ever made. This classic film deserves a 5/5 just for being groovy! But I just can't stop thinking why is it called Grease?!","user":"ks_archer","rank":[101,139]}]