[{"title":"Head 'em west.","rating":6,"date":"9 July 2005","review":"Kirk Douglas plays former U.S. Senator William Tadlock who ramrods a wagon train of Missouri pioneers to a new start in Oregon. Dick Summeres(Robert Mitchum)is goaded into scouting for the trek. He seemed to be the best choice. He did find mountains, water and the Grand Canyon; but then Indians did find the wagon train. A little bit of firewater helps the travelers gain free passage from the Indians. Drought and death does not deter the westward caravan. The heavy hitting lineup of stars include: Richard Widmark, Jack Elam, Lola Albright, Stubby Kaye, Harry Carey Jr. and \"introduces\" Sally Field as a sagebrush tart. Beautiful scenery throughout. Andrew V. McLaglen directs this movie that just seems to plod along and falls far from the status of a genuine classic. A great way to spend a long afternoon.","user":"michaelRokeefe","rank":[16,18]},{"title":"Considering the considerable cast, I expected more...though it's not bad.","rating":6,"date":"30 December 2011","review":"This western is very unusual in that it features three top leading men--Kirk Douglas, Robert Mitchum and Richard Widmark. Now you'd think with all this high-octane masculinity and acting that this would be a terrific film, well, you'd be wrong. While it isn't a bad film, it does suffer from a thoroughly adequate script--one that never seems to deliver the goods.<br><br>Douglas plays an ex-senator bent on starting the first white colony in Oregon in 1848. The problem is that he's not exactly 'Mr. Personality'--and his abrasive and autocratic ways rub everyone in the wagon train wrong. Can he get them all to his promised land or will the folks ditch him and make for California? Tune in and see.<br><br>For the most part, this is a pretty ordinary drama about settling the West. As for Douglas, he overacts more than usual (and what's with that whipping scene?!?!). Widmark's character is inconsistent and underwritten. The only lead who comes off well is Mitchum--as a weary Kit Carson-type. Aside from being pretty ordinary and predictable, the film did have a few pluses. There was nice cinematography and as a history teacher, I appreciated how they showed lots of mules, oxen and cows pulling the wagons--whereas most films only show horses (a mistake). But this isn't enough to raise it above mediocrity.","user":"MartinHafer","rank":[19,22]},{"title":"Spectacular Western focusing a wagon train of emigrants bound from Missouri to Oregon","rating":6,"date":"23 April 2008","review":"This motion picture is based on the Pulitzer-winning novel by A. B. Guthrie. It starts in Independence, Missouri, 1843, senator William(Kirk Douglas) asks volunteers to unite themselves towards Oregon. Among them find the Evans family, formed by Lije(Richard Widmark) his wife Rebecca(Lola Albright) and their son Brownnie; the justly married Johnnie and Amanda Mack and various traders from Independence. Kirk Douglas join forces with Robert Mitchum, as a taciturn explorer, he's a supreme hero in a performance that epitomises the spirit of the early West at least as Hollywood saw it.<br><br>The American West has a turbulent and mighty history , some of which is told in story and folk songs . Here is a panoramic view of the American West, concerning on the dangers, hazards, travels and tribulations of pioneers set against the background of breathtaking landscapes and risked deeds, including Indians attack and one deeply cliff. Particularly impressive for its notable cast list and expansive Western setting. Any Western that play stars such as Kirk Douglas, Robert Mitchum, Richard Widmark and Sally Field -film debut- is at least worth a glimpse. Furthermore a magnificent secondary casting, as Jack Elam, Stubby Kaye, John Agar, John Mitchum, among others. Sadly this epic Western doesn't hold up that well on TV set because was released on the great screen and much of the grandeur of the original version is lost. But Shootém-up and spectacular scenarios fans won't want to miss a chance to see many of the genre's greats in one movie. This is an epic movie , photographed in gorgeous Technicolor by William Clothier- John Ford's usual cameraman-, adding lustre on the groundbreaking sweep, along with an emotive musical score by Branislaw Kaper. The film is splendidly filmed on locations in America's National forests and professionally directed by Andrew W McLagen.","user":"ma-cortes","rank":[13,15]}]