[{"title":"Better than you'd think","rating":7,"date":"19 May 2000","review":"Had I seen the film without reading the back of the video cassette, I would have enjoyed the film a lot more. But for some reason, a major plot point, revealed 1 1/2 hours into the film, is plainly written in black on orange. Since the movie moves in ever decreasing circles to reveal this secret quite efficiently, I don't see why the publicity department chose to sabotage it.<br><br>Nevertheless, the plot is more plausible than it sounds when you try to describe it (which, as I have just said, should be avoided anyway), and the leads play beautifully. Especially incredible is Laurence Olivier as the doddering, worldly-wise jewish Nazi hunter, Dr. Lieberman. You'd never expect the frail form in this movie to be the same man as Hamlet. Gregory Peck also plays Dr. Joseph Mengele as suitably and calmly evil. A lesser actor would find playing the part of a Nazi Death Doctor, responsible for some of the worst atrocities in human history, a perfect excuse to ham it up and click into the black-hatted, moustache-twisting token villain.<br><br>The less impressive acting of Steve Guttenberg overacting into a telephone and Jeremy Black with a really strange german accent as Erich Doring. This I can forgive. The ending is also comfortable and understated, with a moral instead of a huge explosion, as could have been expected in a 90's movie. Worth seeing, especially if you know nothing about the film.","user":"conspracy-2","rank":[57,64]},{"title":"One Of Schaffner's Best...","rating":8,"date":"11 March 2004","review":"THE BOYS FROM BRAZIL opens in scenic and remote Paraguay where Barry Kohler (a young Steve Guttenburg) is on the trail of a mysterious gathering of former Third Reich heavy hitters, including Eduard Seibert (James Mason), now in exile.  As his information becomes more detailed, he contacts Ezra Lieberman (Laurence Olivier), a renowned Nazi hunter.  In the meantime Dr. Josef Mengele (Gregory Peck) makes the scene and after Kohler's bugging of a secret meeting goes wrong, Lieberman is left with only a thread of a much deeper story, which he sets about to unravel...<br><br>Even though the plot is fairly well known by now, I will assume some people are not familiar with Ira Levin's book or the film.  In fact the less you know about the plot the better; I think that the dust jacket gives far too much of the story away...Anyway, THE BOYS FROM BRAZIL is a film that toes a very dangerous line, I mean few film makers want to turn a man like Menegele into a camp figure.  But the cast and crew handles the material with deft intelligence.  The cast is fantastic:  Peck, as Mengele, delivers a strong performance that never falters.  In the tired yet determined Lieberman, Laurence Olivier creates a wonderful character; a late highlight of a distinguished career.  James Mason, as Seibert and Bruno Ganz as a mouthpiece for outdated genetic research, do well to support the action, but are given little to do.  It is Peck and Olivier that propel the film along; the violent showdown between the two men is a must see.<br><br>Jerry Goldsmith supports the on screen action with a Straussian waltz to tie in the Austrian backdrop.  Goldsmith also provide some terse action music for the third act of the film.  This is one of the last films that Goldsmith and director Franklin J. Schaffner would collaborate on.  On that note, it would seem to me high time for a more detailed retrospective of Schaffner's body of work; which includes THE WARLORD, PATTON, ISLANDS IN THE STREAM, PLANET OF THE APES, PAPILLION, LIONHEART.  It is Schaffner's sensibilities that keep THE BOYS FROM BRAZIL from jumping the track.  He uses steady camera work and smooth style to create a world the characters can inhabit (something \"over\" directors of today know little about).  Schaffner's style is more subtle, workman like, which may explain why he is not better known among the general populace.  He keeps THE BOYS FROM BRAZIL grounded and allows his actors to flesh the characters out, which makes all the difference in the world.  8/10.","user":"underfire35","rank":[74,89]},{"title":"Good flick. Good, not great.","rating":7,"date":"29 December 2002","review":"An exciting plot, a workmanlike script, and good performances from Peck and Olivier help overcome the complete implausibility of the premise. It's fun seeing what may be Steve Guttenberg's best performance. And Lilli Palmer was still gorgeous, even in her 60s.<br><br>The worst thing about watching it for the first time is knowing beforehand what the film's big, shocking revelation is (in fact, summaries of the film's plot tend to give it away, apparently not realizing that it's supposed to be an epiphany). I would really like to have seen it without knowing in advance just what Ezra Lieberman was going to figure out about the mysterious deaths of those harmless old men.<br><br>Those who have looked into Mengele's postwar career will be amused at Peck's makeup. In an effort at accuracy, it is based on a picture which was widely circulated for years in the belief that it showed a middle-aged Mengele. In fact, the man in the photo was just some poor South American shlub who had the misfortune to be snapped by an overenthusiastic photographer. We now know that Mengele himself was much less impressive in his later years, with his sagging jowls, gray hair and walrus mustache. In fact, photos show him as rather friendly-looking and avuncular--except for his eyes, which are stone cold.<br><br>This film, of course, has nothing to do with the real Mengele's postwar life. Mengele was not a commanding, white-suited figure, living the high life in expensive hotels, attending parties with sycophantic underlings, and continuing his hellish experiments in a jungle laboratory. He lived out his days as a sad, pathetic weasel of a man whom nobody liked. That's a better fate for Mengele...but it wouldn't make such a good movie.","user":"counterrevolutionary","rank":[29,33]}]