[{"title":"Great little Movie","rating":9,"date":"12 November 2001","review":"David Niven and Yvonne de Carlo.  Wow.  Add to that, the list of Irish character actors, headed by none other than Barry Fitzgerald himself, toss in a ghost story, a bit of romance and a plot to do in the heir, Niven and you got a great 50's comedy.  Lots of wacky entanglements with the lovely Yvonne remarking about the ne'er do well, heir apparent, Niven, \"He's a cad.\"  Great escapism and nothing here to take too seriously.  Alas, no video, no DVD, so watch for it on the late show where it pops up from time to time.","user":"artzau","rank":[17,17]},{"title":"Wonderful fun film!","rating":8,"date":"6 March 2003","review":"Really love this movie.  David Niven just sparkles and has some of the best lines of his illustrious career, especially the ending one.  Supporting cast is superlative too.  Everyone really seemed to enjoy making the movie.  In addition the perfect song to set the mood.  Please, someone put it one DVD or VHS.","user":"norise","rank":[16,16]},{"title":"Froth?...yes. But definitely a worthy watch.","rating":9,"date":"29 April 2010","review":"Has to be said that this is a wonderful little farce which pushes all the right buttons. Some great Irish accents and some dodgy 'oirish' accents.<br><br>Lots of familiar Irish actors who regularly appeared in British films during the 40's &amp; 50's are on show. Some of the comedy pieces are very funny indeed.<br><br>For me though, George Cole as the put-upon, hyper-nervous cellar-boy Terence, whose comedic timing allows him to steal every scene he's in, is the standout amongst a very talented cast. I think Bernard Cribbins must have studied this performance for his 60's comedy film appearances.<br><br>The lovely Irish-born actress, Noelle Middleton, makes a rare screen showing. The following year she appeared with David Niven again, in the excellent Carrington V.C, for which she received a BAFTA Best Actress nomination.<br><br>A 'slow to start' film that in the end seems to finish too quickly.<br><br>All in all, a little gem, so it is!","user":"angryangus","rank":[13,13]}]