[{"title":"Depressing but powerful","rating":8,"date":"3 December 2005","review":"If you want two hours of enjoyment, forget about it. This is one of the most depressing films ever made. Every grim feature of post war North of England is piled on in black and white - chimneys, mean terraces, cooling towers, mucky fields, stunted ambition and rising damp. A contemporary view of the early 1960s, you're given all the warts and none of the glitter.<br><br>But both performance and plot reek with power and there is a compulsive attraction to see a story through to a bitter end that you know has no trace of sentiment. The tight coldness of Margaret Hammond (Rachel Roberts), steadfastly refusing to let herself be happy for a second time in her life, grinds against the macho world that Frank Machin (Richard Harris) has climbed into.<br><br>It is one of Harris's two great roles and came near the start of his career (the other being Bull McCabe in \"The Field\" which came near the end) and possibly came closest to the forces that drove him through his life. His skill at and love of rugby gives the sporting dimension of the film a realism that very few others can match. Much of the passion that he showed on the screen came from experiences on the playing field in a career that was cut short through illness before he could realise his full potential. Anger at that lost opportunity is seen better in this film than in any other he made.<br><br>There are many other films in this genre when British cinema turned its back on elegance or heroism but none has captured the mood of resentment better than this. More than forty years on, it's still as raw as ever.","user":"johnjredington","rank":[39,44]},{"title":"A touch overlong but engaging in its naturalism and its character development","rating":10,"date":"10 September 2007","review":"Frank Machin is an amateur rugby league player in Yorkshire. Ambitious within the sport, Frank pushes himself in front of the local scouts and soon is signed to one of the professional clubs and able to hold out for £1000 down to join. As he rises within his own world, Frank has more resources and more opportunity but a strained affair with his landlady Margaret and his inability to shake off his basic roots see him frustrated and pained with his journey.<br><br>Like many others have said in relation to this film, British cinema did have something at one point. The \"Free Cinema\" movement of the 1950's gave a home to a slightly more realistic form of cinema and, although I do not like all within that \"movement\" that I have seen, I do think that Anderson's work with that paved the way for this. At times the film is too keen to revel in the depiction of working class England but this isn't too much and perhaps, if you think of the context of the period (where such views were not the norm) then you can perhaps understand why. However the power of the film is less in its depiction of the working class work (although this is indeed of value) but more in the convincing exploration of the character of Frank.<br><br>Here is a man who has aspirations but seems unable to reconcile these goals to be \"better\" with the fact that he is from the working classes and doesn't fit with those above him. Likewise he needs affection, love and intimacy but his outward emotions are much cruder and he is quick to lose his temper and resort to violence as the simplest reaction. It is a well written script and it doesn't push the characters or emotions past where they would naturally go for the sake of the film; you can see this in the conclusion which is meaningful and ultimately quite downbeat. Anderson's direction is suitably gritty and natural for the material, but it was Harris that impressed me most.<br><br>His performance can be mistaken for being a bit showy and loud and some viewers have made that call. However for me this was his character's boorishness, a quality that he sinks into with ease. However where Harris really does his best work is in the moments just before this happens, or immediately afterwards where, without words, we can often see this struggle, this conflict within himself. It is hard for me to describe here in words so think how difficult it must be to do as an actor but Harris pulls it off. He is well supported by Roberts and they share some excellent scenes. Smaller roles are also well filled with natural turns from the likes of Hartnell, Lowe, Blakely and others; but the film is Harris'.<br><br>Not perfect and perhaps a little longer than it can sustain, this is an impressive film. The working class depiction does seem a bit heavy at times through modern eyes but in the emotion and development of the characters the film is hard to really question. Engaging, well written and well delivered  like others have said, where are the British classics like this now? Four Weddings? Do me a favour...","user":"bob the moo","rank":[20,23]},{"title":"One of the Best of the \"Kitchen Sink\" Films","rating":8,"date":"10 January 2005","review":"\"This Sporting Life\" is one of the most famous of the British \"kitchen sink\" dramas of the 1950s and 1960s (\"kitchen sink\" films were very gritty, social realist films which were very popular in Britain at one time).<br><br>Frank Machin (Richard Harris) is a brutal, young miner in a city in northern England. Hoping for fame and fortune, he becomes a successful Rugby League football player. He uses his fame and fortune, along with physical violence, to try to force his widowed landlady (Rachel Roberts) to fall for him.<br><br>Photographed in bleak black-and-white, the film's scenes of emotional and physical domestic violence are still shocking today. Also notable are the violent, stylishly-shot rugby matches.<br><br>The cast are brilliant without exception, especially Richard Harris who manages to invest even his totally unsympathetic character with some degree of humanity.","user":"RobertF87","rank":[41,51]}]