[{"title":"Oh my, my, my...","rating":26,"date":"26 March 2003","review":"Okay, I'm going to assume the makers of this film knew they were making a cheap knock-off of the infinitely better E.T., and anyone who does not agree with me on this should have their brains examined. Look at the facts people! The plot is essentially the same: Weird looking alien gets separated from family and happens upon a family where the kids take him in. Then there's the fact that the dad in the family is gone (dead? divorcee? the movie never explains), and that the older brother is named MICHAEL! We get a cute little girl to play the Drew Barrymore character, there are government agents trying to find the alien, but in the end the finale is totally different (albeit ridiculous, but more on that later). But, to give the film credit, it is hilarious. I loved how the Mom assumed her handicapped, wheelchair-bound son Eric had somehow dragged plants into the house. And we can't forget the grossly obvious product placement (apparently the aliens drink Coke on their planet), the insanely ugly main character MAC (a name which is never actually used in the film I think), and a very 1980's dance contest in the middle of McDonald's. Getting back to the aliens: who the heck came up with their design? They are INSANELY unappealing and ugly. Granted, E.T. wasn't exactly beautiful, but he's Carmen Electra compared to the silly putty potato sack that is MAC. Oh, and I couldn't help but study the scene where the aliens first break out of the NASA satellite since it is so similar to the scene in Independece Day. Think about it: the government agents are peering through the glass window, trying to get a good look at what is making the scientists freak out through a haze of smoke, when the alien jumps out at them. It's weird, let me tell ya. And I swear, if I had heard Michael screech, \"They're not gonna hurt anyone!\" ONE MORE TIME...rrr. Just what made these aliens so innocent, anyway? Their electrical powers destory everything in their path, and they blow up a supermarket! Sure, they brought Eric back to life after they BLEW UP THE SUPERMARKET, but you would think someone else died in that explosion (which you really have to see to believe). Other great moments?<br><br>* Three bad '80s tunes in the span of 15 minutes. * The fact that none of the scenes had anything to do with the rest of the film. For example: MAC somehow hijacks a toy truck and gets chased by dogs. Another example: The hilarious scene where Eric's wheelchair goes out of control and flies down a ravine (!!!!!), leading his Mom to think he's suicidal (actual dialogue: Why would he do something like this???\"). * Gigantic boom box and break dancers! YES! * The final scene, which defies comprehension.<br><br>I can best compare this movie to Teen Witch, another ridiculous 80's family film. Although I would have to say that Mac and Me is the more insane feature. 4/4 for hilarity, 1/4 for quality.","user":"perni","rank":[51,55]},{"title":"Wow, this brings back memories. Too bad nostalgia doesn't defend the realization of awfulness. What a stinker.","rating":26,"date":"26 September 2004","review":"When I was a child I watched some very bad movies; some were so bad, they made Cool as Ice look like the original Rebel Without a Cause. I'm talking about grade-A quality garbage, here.<br><br>Mac and Me was a film I frequently watched  an embarrassing, agonizing, shameless marketing scheme fueled by McDonalds featuring a plot ripped off of E.T. And I ate it all up  I used to love this movie.<br><br>Watching it now is like a slap in the face. Wow, it's that bad. When I was younger I didn't notice the numerous references to Mickey D's and Coca-Cola  I just marveled at the sight of strange alien beings whistling to music that played only in my head. I considered Mac and Me to be the pinnacle of film-making. Or perhaps I'm discrediting myself  I wasn't that stupid, but I was naïve enough to believe, at least, that it was a fun movie, and unlike anything I had ever seen before.<br><br>Well, at least one opinion remains -- it is unlike anything I've ever seen before  a rip-off so bad beyond words that it's almost as unbelievably awful as another shameless E.T. knock-off, Pod People, my choice for the worst film of all-time  and another 'so-bad-it's-good' gem that is actually so bad it becomes good, then bad again, where it continues in this cycle until it becomes downright petrifying.<br><br>The film's protagonist is wheelchair-bound Michael (Jonathan Ward), an adolescent who moves to a new city and finds himself meeting up with a strange puppet  err, alien  named 'Mac' (I guess?), who waddles around like E.T. and is searching for his parents, who were picked up by a NASA space probe and are now out in California doing who-knows-what. Apparently they're not too eager to find their son since they spend the duration of the movie crawling at a snail's pace under the glare of the sun, stopping every now and again to emit sounds similar to that of a drunken elephant, making patterns in the air with their extended index fingers (now, where have I seen that in an alien-oriented movie before?).<br><br>I could write an entire book on the faults of Mac and Me. To fit them into a single article almost seems ridiculous.<br><br>Primarily it's just plain dumb, although it is also a horrendous mess from a technical standpoint. Its plot resembles that of RoboCop3  sloppy and vague. Direction is equal to that of a standard TV commercial, only one of the more boring sorts. The acting also compares to a television commercial, only in ads the people aren't always expected to actually say anything other than stare at the camera and smile like they're enjoying whatever product is being pushed. Some of that applies to Mac and Me since it is such a commercial, buy-this-product-after-you're-done-watching-the-movie sort of experience  unfortunately there is the odd moment where the movie doesn't focus on its bizarre alien creatures or Coca-Cola or Ronald McDonald or brand wheelchairs or space exploration companies and demands its so-called 'actors' speak their lines. I'd rather be stuck having to watch fake prosthetic extra-terrestrials quack and make weird noises than suffer through one more 'actor's' attempt at bringing life to the project. My guess is most of the cast were hired from a nearby McDonald's restaurant  seeing how McDonald's funded, promoted, and endorsed this movie, as well as the fact that their company logo is shown from beginning to end. It's about one hundredth as fun as those BMW commercials with 'The Driver,' and one thousandth as subtle.<br><br>The dialogue is classic stuff. Conversations usually consist of at least one marketing plug, sometimes more. Here's an example of some great screen writing:<br><br>Michael: Gee Mac, I don't know where your parents are. It's tough being in a wheelchair. I'm still adapting to this new home. By the way, in case you didn't get it by now, I don't have any friends except you! Where are your parents, Mac?<br><br>Mac: Blurp! Beep! Weeeooop!<br><br>Michael: Oh darn.<br><br>Annoying Brother Ripped Off of the Brother from E.T.: Gee, how the darn are we gonna get Mac to his parents?<br><br>Michael: I don't know. Let's go discuss it over a two-dollar quarter pounder with cheese at McDonald's. First one there's a Coca-Cola! By the way I heard that McDonald's is the number-one food chain in America with over one million restaurants nationwide! That's a whole lotta greatness! Hey look, it's a Krispy Kreme truck  I wonder if the driver, Mr. Shack, is still selling radios.<br><br>Granted, that conversation doesn't appear in the film  because it's too good. What I just wrote would qualify for a an Oscar for Best Original Screenplay after being compared to 'Mac and Me.'<br><br>Then there's the most memorable and infamous scene, which is when Mac is left home alone during a school day, and 'accidentally' throws a huge orgy with all the eager NASA scientists. Wait a minute, wrong movie. The best (or worst) part of Mac and Me actually takes place at McDonald's (!). It begins as a birthday party, becomes a dance competition, and ends as a frantic showdown between Ronald McDonald and a bunch of football players (?!) and, of course, Mac, doing flips through the air dressed as some sort of animal (another '?!'). Don't ask, because I don't think there's an answer, other than this: $$$<br><br>The movie is one huge conglomerate of '80s conglomerations, if that makes any sense. What a wonderful film! (Not.) If you can put up with the wooden acting, bizarre (often downright confusing) screenplay, annoying stereotypical characters, and merchandising plugsthen you really are a sad pathetic waste of space and are exactly the type of candidate they're looking for to pen 'Mac and Me II: The Quest for More Money.' (I had to fit a Mel Brooks reference in there somewhere. After all, he paid me to. And I think that's the entire approach to 'Mac and Me.')","user":"MovieAddict2016","rank":[115,134]},{"title":"MST3K","rating":1,"date":"25 November 2018","review":"Mystery science theater 3000 just riffed this movie. If that doesn't tell you everything you need to know, I don't know what will.","user":"coryleonard-62603","rank":[17,19]}]