[{"title":"A Better Tomorrow has yet to arrive. Will it ever come?","rating":8,"date":"24 June 2004","review":"A Better Tomorrow II (1987) was rushed into production after the success of the first film. Armed with a bigger budget, Cinema City forged ahead with this sequel. Following after the events of part one. Lung Ti is about to be released from prison when he's offered a job as an undercover agent. His mission is to find some criminal evidence to topple his former boss (Cinema City board member Dean Shek). A first he dismisses the gig until he realizes they're going to his eager younger brother (Leslie Cheung). Once Lung is out, he notices that everything is not quite as it seems.<br><br>An interesting film. This time Tsui Hark had more of a hand in the production. He included his friend Dean Shek into the movie and he employed his best action director (Ching Siu-Tung) to direct the over-the-top action scenes. John Woo wasn't pleased with this and he voiced his displeasure. The final rift came during the editing of the film. Tsui Hark wanted the movie to be under two hours so it could have more showings, John Woo wanted it to be an epic. Guess who one out? Say what you will about this film, the action scenes are pure Ching Siu-Tung. His wild action scenes made this movie. Mr. Tsui must have liked him a lot because he went on to choreograph the action scenes in The Killer (although he was credited with stunt coordinator the action scenes have all of his visual trademarks).<br><br>The budget was huge on this one. It was filmed in Hong Kong and in the United States. Tsui Hark had another one of his friends (Peter Wang) co-star in the movie as well (he plays the inner city priest Dean Shek meets in N.Y.C.). Despite the friction caused by the behind the scenes squabbling, A Better Tomorrow II is a magnificent exercise in the ultra-violence. Awesome!<br><br>Highly recommended.<br><br>The last film in the trilogy is the epic A Better Tomorrow III: Love and death in Saigon.","user":"Captain_Couth","rank":[16,16]},{"title":"Still better than Woo´s Hollywood standard!","rating":7,"date":"7 April 2002","review":"Even though \"A Better Tomorrow II\" is a pretty good sequel to its great predecessor, it is no masterpiece like \"The Killer\", but still much better than Woo´s awful Hollywood-garbage \"MI:2\"!!! Once more Chow Yun Fat´s giving an over the top performance, the gunfights are well choreographed and the score of Joseph Koo and Lowell Lo are real adrenalizers! This film doesn´t deserve the predicate \"cult movie\" and it will never reach the status of it, but nevertheless it´s a fine Hong Kong-actioner that lovers of Asian cinema should check out!","user":"DJ Inferno","rank":[6,6]},{"title":"A Far From Perfect But Satisfying Conclusion To The Original","rating":8,"date":"7 October 2010","review":"After the movie 'A Better Tomorrow' became a big success around Hong Kong, a sequel was inevitable to happen. Most of the original cast return, including Chow Yun-Fat as Mark Lee's twin brother Ken.<br><br>Taking place a few years after the events of the first film, we see how things are finally starting to look up. Ho is in prison but he's finally re concealed his relationship with his brother Kit, who has become a loving husband and soon to be father. But like the first film, things get bad real quick. Ho's former master Lung has been framed for murder and even loses his mind as his life gets worse. He's sent over to New York to keep a low profile and to be looked after by Ken who owns a restaurant and lives there. Meanwhile Ho and Kit are working together to end the triad gangs.<br><br>This is where the problem starts. The first film revolved around Ho and the people around him, but this film spends way too much time with Ken trying to get Lung back to normal. Ho and Kit's plot seems to delve deeper into the main story ark, yet they never seem to get enough scenes. Ken is pretty much similar to Mark although he may be a little darker and you can tell he's only in the film because of Chow Yun-Fat's character was so popular in the last film.<br><br>The film doesn't seem to make a huge continuation onto the first film either. Instead of being it's own story, it seems to just be an expansion of the first film, but not in a good way. We don't delve too much into the characters and they seem underused. The film is also known for having a sillier feel in a few scenes(Famous Rice Scene), but it didn't ruin the experience for me. These flaws are apparently due to disagreement between John Woo and producer/second writer Tsui Hark about the tone of the film, causing Woo to disown most of the film, except the end shootout. John Woo's original cut was around 3 hours and is rumoured to improve on some of the flawed moments. A version I hope will appear in some future release of the film.<br><br>Now for the goods. The film seems to get noticeable better during the second half, beginning with the amazing hotel shootout. The film is well known for it's exaggerated violence and blood and the film doesn't disappoint. The action is a big step up from the first and some of the best ever filmed for its time. Chow Yun-Fat is once again cooler than ice, with his trademark sunglasses, trench coat, matchstick and dual pistols and may be one of the main appeals of the film. The Climatic assault on the triad mansion is one of the greatest shootouts and one of the greatest ending ever filmed. It's no wonder that it's the only thing Woo likes about the film. The amazing soundtrack returns and their are a few emotional scenes that actually work well.<br><br>With many iconic scenes (The stairs scene being one), the film is a lot better than it gets credit for. The film is no masterpiece and doesn't compare to the first but it has its moments. Silly and flawed moments aside the film is actually quite enjoyable and as long as you keep an open mind, I think you'll enjoy this conclusion to the Better Tomorrow saga. Part 3 doesn't count!","user":"MovieMaster95","rank":[5,5]}]