[{"title":"Surprisingly a really good an awesome sequel classic","rating":10,"date":"24 September 2017","review":"Friday the 13th Part III: 3D is surprisingly a really good movie it is not a bad slasher it is a great movie like I thought it was. It is one of my personal favorite horror movies. It is my second favorite film in the franchise. This movie is the most scariest of all of them. The first time I watch it as a kid I was scared to death of the film. The first time and the second time around I hated it but now surprisingly watching third time around I enjoy it. The 3D thing was really a bad idea but the plot and the story was really good and I like the cast. <br><br>This was the second sequel that it was directed by Steve Miner. I have fun with it and I have enjoy it I love this movie to death and it come closer to my heart. It is now my third favorite Friday the 13th film and it was really hard to decide because I like almost all of them except 2 films I hated but the rest 10 films I liked a lot. Dana Kimmell as Chris Higgins the final girl and the heroine was a bad-ass and really beautiful and the cutest girl actually she was little better then Amy Steel in Part 2 tough I love Amy Steel. <br><br>Richard Brooker did really great as Jason Voorhees, R.I.P. he is really missed and he really did a great performance. The movie has also a biker gang in here in which Jason kills them one by one. Nick Savage was good as the leader Ali he was knocked by Jason, but on the end of the film he saved Chris from Jason, in which Jason cuts his hand. <br><br>We had a good kills good death scenes and I really think in my opinion it is better then Part 2. <br><br>Many fans has stated that this film copy's Part I and II, I disagree with that that is not true! It is a true sequel to part 1 and 2 and it strictly loyally follows the formula from first movie. I love the boat scene on the end in which Pamela Voorhees attacks Chris and run her over the boat on the lake, that scene was fantastic. Yes it was similar scene from the first movie in which young Jason jumps over and run over Alice on the lake this is just the opposite of the film I loved that.<br><br>I love that Jason Voorhees dons his iconic hockey mask for the first time and I know the movie doesn't show Jason putting ice hockey mask on his head. But we see Shelly (Larry Zerner) with a harpoon spear gun in his hands and ice hockey mask then in next scenes we see Shelly going to the barn and later we find Shelly with a slashed neck that's how Jason got his mask he take it from Shelly. <br><br>The final showdown between the heroine--one Chris (Danna Kimmell) of the cutest and most likable in the whole series and Jason (Richard Brooker)--it is excellent and great well done executed. Chris slams an axe in Jason's head right in the mask that's scene blow me away.<br><br>I love also the actors beside Danna Kimmell and Richard Brooker in here that did really a well done job as the supporting cast: Catherine Parks, Larry Zerner they were great couple. Gloria Charles, Paul Kratka, Cheri Maugans, Kevin O'Brien and Nick Savage I love this cast in here. <br><br>I love the atmosphere in this movie it is more windy and no it is not set in the summer it is set in autumn it feels more autumn time. <br><br>Dana Kimmell is a tough sexy girl and she doesn't get scared of Jason she kicked his ass twice and I have enjoyed this movie I love it. <br><br>The music score and 3D effect were a little cheese in my opinion but the movie surprisingly I loved it and it is a classic movie to me! Allan A. Apone did a great special make effects for Jason and I like some of the kills and the eyed balls also this movie does not have so much sex scenes unlike part 2 has but it is way better then Part 2. <br><br>R.I.P. Richard Brooker, Gloria Charles, Steve Susskind, Perla Walter and David Wiley you are all missed. <br><br>Score: 10/10 get's my score Bad-Ass Seal Of Approval it is my second favorite film in the franchise and it did not failed me I love it to death. To me is a classic sequel I love 80's horror movies and this one is really a suspenseful good movie.","user":"ivo-cobra8","rank":[92,102]},{"title":"Trivia question: what is the name of the guy that Jason gets the mask from?","rating":9,"date":"25 June 1999","review":"There are very few horror films that are like Halloween ( the first one ) and Nightmare on Elm Street ( the first one ). That is, horror films that not only scare, but have a good story and great direction. Steve Miner is obviously not in the same league as Carpenter and Craven, but what he does manage to do is make an effective sequel that is much scarier than the first and next to the final chapter, it is the best and scariest among all the Fridays.<br><br>This film is laughable in parts, especially in terms of continuity with some of the stories that are told by Chris, but having said that, Steve Miner makes a very atmospheric and very tense film.<br><br>The film starts off the day after part two ended. We know Jason is still alive because he kills two disgusting people at the beginning that at least establishes Miner's style to come for the rest of the movie. The false scares, the open doors with no one there, the strange noises, the missing props that the character knows she had just a few seconds ago. The beginning is very well done. But again, the continuity and stupidity of movie characters is at all an all time high here. ( A quick example: Harold is about 5'6, rotund and clumsy. His wife calls out his name when she sees a well built figure standing behind her sheets at night. This figure is at least 6 feet or more in height and he looks squared, not pear shaped like her husband Harold. Plus, on the television is the news about the massacre the night before saying that the killer has not been caught. DUUUHHH!! Should this not click into her brain that who she is seeing may be Jason? )<br><br>But what is excellent about this film are some of the same elements that made Halloween good. And that is the use of foreground for false scares. There are numerous times when the camera scans the for-ground and you are so sure that Jason is going to show up, and then he doesn't until whammo, someone loses an eye or their life. It is very effective. There are also numerous shots of Jason in the background waiting for his next victim to turn around to see him. And when we see him standing behind one stoner guy, his pure size really makes him menacing. And that mask....<br><br>How he gets the mask is one of the great trivia questions in Friday the 13th folklore.<br><br>Steve Miner did a masterful job of directing and why he decided to hand the reins over to Joseph Zito for the final chapter is a mystery<br><br>As Fridays go, this is one that you can't go wrong with. It also has ( I believe ) one of the five most gruesome and painful deaths in the series. Watch for Andy walking on his hands, it will make you cringe for quite a while.<br><br>Edit: The new remastered edition in 3-D is worth seeing. I found the 3-D to be entertaining in some parts and lacklustre in others, but there is some added footage in the deluxe edition. You get to see more of Fox hanging from the barn and in a truly jaw dropping moment, you get to see all of Andy, chopped up after he gets split in two walking on his hands. In the original version, you just see a glimpse of him as his blood drips onto the magazine, but now, you see his blood, his legs severed, and much more. I would say this alone makes the purchase worth it.<br><br>Answer to the question: Shelly","user":"baumer","rank":[53,65]},{"title":"The Hockey Mask Is Here!","rating":6,"date":"14 January 2006","review":"I liked this sequel. Yes, it's stupid, but it's a guilty pleasure thing. <br><br>A van load of stupid twentysomethings head up to Crystal Lake for the weekend for no other purpose than to smoke pot and screw each other cross eyed. Among them are the painfully unattractive Shelly who enjoys immature practical jokes, a newly pregnant girl, a hippie couple who are constantly ensconced in a cloud of pot smoke and the emotionally damaged Chris, who loves Crystal Lake but has terrible memories of it. It seems that, some time ago, Chris was attacked in the woods by a man with a terribly deformed face. During the attack she passed out and woke up the next morning, safe in her own bed at home. She is not entirely convinced that it was all a dream, and so decides that a weekend at her former haven may just be what she needs to deal with the past. Unfortunately, it was not a dream, as all of us already knew. The man who attacked her was Jason Voorhees, and no sooner do the kids settle in and start partying and screwing than he shows up, ready for some post-coital killings. First to go is an obnoxious trio of motorcycle thugs who harassed our heroes. Then Jason gets right down to what he does best - stabbing, skewering, bisecting and impaling anyone who is stupid enough to wander off alone and wait for him to approach.<br><br>Still, I liked this movie. Jason finally gets to don his signature hockey mask in this one, and I love the ending, when the rotted remains of Mother Voorhees rise from the lake in a nod to the first films shock ending. I'm still not sure how Mother Voorhees got her head back on, but who cares? This isn't a movie you're supposed to think about too much. I also love Jason's unmasked face in this one. A friend of mine succinctly pointed out the fact that he looks like the banjo player from Deliverance all grown up. A scene at films end when his deranged piggy face appears in a window is actually rather shocking. Dana Kimmel does as good a job as she can with the character of Chris, although Chris is not given a whole hell of a lot to do other than scream, act like a whiny wimp and run. <br><br>Yeah, this movie is stupid, but its harmless fun. It's not as bad as some of the sequels that followed it, believe me.","user":"Gafke","rank":[29,35]}]