[{"title":"Hooker w/o Heart of Gold","rating":14,"date":"14 January 2009","review":"Shot partially on location in Hawaii and at the Twentieth Century Fox studios in Los Angeles in 1956, this film recreates the atmosphere of the islands before and during the Second World War. Because of her Amazonian good looks and the notorious publicity associated with \"The Outlaw\" few critics have given Jane Russell her due as a dramatic actress. In this film, directed expertly by the old-hand Raoul Walsh, she plays a no-nonsense out-on-her-luck prostitute -here disguised in the usual Hollywood manner as a dance hall hostesswho falls for the rich guy on the hill. Unlike the other sex-goddesses of her time, foremost of all Marilyn Monroe who had been offered the part and turned it down, Jane shows none of that little-girl innocence and vulnerability of her sexy competitors; here she is as tough as nails, a big tomboy with a great body who knows exactly what she has and what it's worth. All business. Particularly memorable is a heated scene with Richard Egan in which she explains why she is obsessed with making money. It is probably one of the most convincing portrayals of a hooker without a heart of gold in film.","user":"ilprofessore-1","rank":[19,19]},{"title":"Oh My, Who, on Oahu","rating":6,"date":"17 December 2006","review":"I'm not revolting when it comes to enjoying Mamie Stover. The GIs in 1940s Hawaii enjoyed her and so do I. OK, it's not even close to a cinematic masterpiece, but it's worth a gander on a rainy Sunday afternoon when the hubby has on his football. It has stunning Hawaiian locations, a fun if melodramatic script and 20th Century Fox gave it gorgeous Technicolor. It must have had studio head Buddy Adler's blessing because he took producer's credit. If you're a Jane Russell fan, forget \"The Outlaw\" and \"Gentlemen Prefer Blondes\" and \"Underwater.\" The Russell you see here is smoldering...! She plays a down-on-her luck woman run out of San Francisco who lands on Oahu where she becomes a... a... a... dancehall hostess. (If they redid Mamie Stover today, it'd have a whole different look.) She makes lots of money and thumbs her pretty nose at her detractors. Maybe because she's called Flaming Mamie, Russell dyed her dark tresses to a shimmering red and natural redhead Agnes Moorehead, owner of the gin joint where Mamie works, has become a blonde. Aggie never made a film that she didn't elevate to a higher level. Michael Pate is wonderfully menacing as the gin joint bouncer/thug. Love interest Richard Egan is too bland and lovely Joan Leslie is wasted in a nothing supporting role. Tough-guy director Raoul Walsh, who had just finished directing tough-girl Russell in \"The Tall Men,\" knew how to best display her acting chops and sultry good looks. Mmmmmm, whatever Mamie wants...","user":"5November","rank":[19,19]},{"title":"A clever framework for Jane Russell's spectacular physique!","rating":8,"date":"26 November 2000","review":"The fifties provided its share of World War II films... The super classics being David Lean's \"The Bridge on the River Kwai\" and Fred Zinnemann's \"From Here to Eternity.\" Although Raoul Walsh's \"The Revolt of Mamie Stover,\" a closely related minor film, also bears some consideration...<br><br>The story, set in 1941, has Jane being escorted by the San Francisco Police to the entrance galley of a ship leaving town... She is advised not to return--ever!<br><br>Aboard the Hawaii-bound vessel, she meets science fiction novelist Richard Egan who proves to be the first man in her versatile lifetime who respects her as a person... Naturally she is, at the proper time, impressed...<br><br>Once they dock, she lands a job at the Bungalow Club, presided over by a domineering madam Agnes Moorehead...<br><br>According to the movie, servicemen were lining up just for the opportunity to dance and talk (but definitely nothing more) with Moorehead's \"hostesses,\" specially the ever popular Jane who makes a memorable impression as a cynical sleazy dance-hall hostess...<br><br>Jane is seen avoided by the better element in town, who do not appreciate her patriotic contribution... Her conscience forces her to tell Egan: \"No, Jimmy, I can't let you ruin your life... You can't lick the whole island-I've got a number on my back and they all know it.\"<br><br>Egan was positive that some compromise can be worked out, but in the meantime he goes off to war... The aerial Pearl Harbor Attack, on December 7, 1941, by the Japanese is also seen...<br><br>While he is away Jane is determined to make all the social abuse worth enduring and becomes the queen of the town's nightlife... Jane sees this as her only way to acquire wealth...<br><br>When Egan returns on leave to Honolulu, he was filled with consternation to discover that Jane is the star attraction of the Bungalow Club... The shock of it all pushes him back into the refined arms of his society fiancée, Joan Leslie, who has that nice home high on the hill... And Jane? Well, definitely you have to see the picture to know what she does...<br><br>Jane Russell wears a bright-red dress as the self-satisfied, eye-catching woman of \"The Revolt of Mamie Stover,\" but she is definitely no screen substitute of Sadie Thompson as had been intended...<br><br>In the middle of the ludicrous plot Jane sang \"Keep Your Eyes on the Hands\" and \"If You Wanna See Mamie Tonight.\" The latter tune apt to call up memories of Rita Hayworth's \"Put the Blame on Mame\" from Charles Vidor's \"Gilda.\"<br><br>The CinemaScope format provides a clever framework for Jane Russell's spectacular physique...","user":"Nazi_Fighter_David","rank":[29,31]}]