[{"title":"\"Nobody Gives A Damn What Indians Do\"","rating":12,"date":"12 August 2000","review":"In southern California at the start of the twentieth century, a young indian man gets into a violent dispute over a girl.  This triggers a manhunt.<br><br>     Director Abraham Polonsky was making his comeback to mainstream cinema with this film, eighteen years after being blacklisted by the UnAmerican Activities Committee.  He also wrote this screenplay, which strikes a defiant note in favour of the lone hero against the forces of intolerance and repression.  It is not too fanciful to see the indians, with their alternative sensibility and distinct code of values, as a metaphor for artists and free thinkers.  Minorities are always in danger, suggests the film, from the urge to hound and victimise manifested by some elements in society.<br><br>     Polonsky skilfully uses the camera to tell his story.  We follow the complex movements of the various characters around the fiesta fairground without the need for spoken dialogue.  The silent meeting of Coop and Willie tells us everything about these two men, and their mutual rivalry and respect.<br><br>     The wonderful topography of the Mojave Desert is superbly captured in Panavision.  In particular, the showdown on Ruby Mountain offers some gorgeous images.  The film's four leads are excellent: Robert Redford is a wise and humane Coop, the sherriff obliged to lead the inappropriate manhunt: Robert Blake is perfect as the nihilistic, elemental Willie: Doctor Elizabeth Arnold is played by Susan Clark, developing nicely the ambivolence of a woman who needs Coop sexually but despises herself for it: Katharine Ross is the spry, athletic Lola, the young indian girl who becomes Willie's 'wife by capture'.","user":"stryker-5","rank":[35,38]},{"title":"Fascinating film!","rating":8,"date":"23 May 2002","review":"I guess the cable companies have rediscovered this film in light of Robert Blake's legal woes.  And I'm glad they did.  It's an extraordinary example of filmmaking.  Though not w/o its share of mistakes &amp; weaknesses, they are all honestly come by.<br><br>The film covers several genres &amp; comments upon them in interesting ways: it is a Western w. conventional themes (turned upside down &amp; inside out) of Indian savages vs. white civilizers; it is a historical drama that chronicles the rise to power of the industry elites in late 19th century CA. (illustrated in the subplot of Pres. Taft's visit to the Riverside Inn). While this is a Western, it might be better termed an anti Western.  Every character (including Blake's Indian) is weak, vacillating &amp; morally changeable, which makes for a wonderfully complex tale.<br><br>Blakes dialogue gives us the film's title: \"Well, at least they'll know that Willie Boy was here.\"  He says this in responding to Katherine Ross' comment asking why he is willing to keep running, even though the whites will eventually trap &amp; kill him.  This scene conveys the film's elegaic tone about the death of the \"romantic\" West &amp; the rise of the homogenized, white, industrial CA. that would arise in the 20th century.  Willie is compelled to stand up for his own individuality even though in actuality few will mourn his passing &amp; even fewer remember that \"he was here.\"  But Polonsky, the filmmaker, tells us that someone will indeed remember Willie beyond those tracking him down &amp; exterminating him: Polonsky himself &amp; the viewers of the film.  Really cool stuff!<br><br>Another powerful layer of history is Abraham Polonsky's involvement.  As a Hollywood 10 member, the script seems to comment indirectly on the Hollywood Blacklist era.  Blake the hounded Indian is much like the renegades of the Hollywood 10.  Willie Boy tries to stand up for the principle of honor &amp; freedom in the face of insurmountable social odds.  Yet, he is never seen as a romanticized or one sided character.  Even Willie Boy is pig headed, monomaniacal and self-destructive.<br><br>I think Blake does a great job in this role.  It makes  you remember how good he could be in film roles (remember \"In Cold Blood?\") before \"Baretta\" came along.  And it makes you weep for his recent descent into hell &amp; wonder at what might have been if his life &amp; career had taken diff. turns.<br><br>I didn't mind Katherine Ross as much as some viewers.  She was much less bothersome &amp; stereotypical than in some of her other roles (\"The Graduate\" &amp; \"Butch Cassidy\").  During the film I was actually realizing how much I liked her in her role which surprised me.<br><br>I highly recommend this film.","user":"richards1052","rank":[33,39]},{"title":"Robert Blake in top form but the movie is a flawed western...","rating":6,"date":"4 January 2008","review":"TELL THEM WILLIE BOY IS HERE has top-notch color photography by Conrad Hall, a thinking man's script that is character driven, and good performances all around by a cast that includes ROBERT REDFORD, ROBERT BLAKE, SUSAN CLARK, BARRY SULLIVAN and KATHARINE ROSS. But it's a lumbering tale that takes a good hour before the dust begins to settle and we get some action along with the character development of both Blake and Redford.<br><br>Every scene is painfully slow in getting to the payoff so that the film seems a lot longer than one hour and thirty-six minutes. The first hour is devoted to the manhunt for an Indian killer (Blake) and then the plot involves the arrival of President Taft in 1909 California and the effort to protect him from any kind of assassination attempt.<br><br>Redford's role as the reluctant sheriff is never too clear since he's a man of a very few words (a regular Gary Cooper type), so it's up to Blake to carry much of the film and he does. He's terrific as the Indian lad who's trigger happy when the posse starts getting too close.<br><br>The last twenty minutes should have been a model of suspense as they close in on Willie Boy, but it's allowed to drag out interminably.<br><br>Summing up: Character driven tale had the potential to be a fine western, but badly paced direction of Abraham Polonsky is no help nor is the sluggish script. Film was released after BUTCH CASSIDY AND THE SUNDANCE KID put Redford on the map but was never a big box-office success.","user":"Doylenf","rank":[9,9]}]