[{"title":"we are allies, we are in this together, we must get along","rating":9,"date":"8 September 2010","review":"The most interesting part of the movie was that you couldn't predict how it would come out. It has less of the dislike of American military men (overpaid, oversexed, and over here) than was actually felt by British men in uniform, as well as those on the homefront who weren't just out for fun with the soldiers, and I suspect it was written to ease tensions that were almost to the breaking point. When this was made there was no way of knowing how long the war would continue so I don't think it was written with postwar relations in mind. I do know that a great many Brits even today are very hostile to the American notion that America won the war and saved the free world. Compared to their contribution, we were \"johnny come lately\"s to both wars. This movie tells us it was a cooperative effort and we should appreciate each other's contributions.<br><br>A touching aspect is the tie between the American who lost his father in WWI and the housekeeper who lost her husband in the same war.<br><br>I enjoyed the election when the woman suggested maybe they should have tried having a woman stand for that position instead of a man. Here, here! <br><br>There were short scenes of the worrying going on in the American homefront, to show families suffered in both countries. There was an American whose ancestor had come from that little town. To heavily underline that idea that we are very similar and can all get along was the American, flying a plane with a Brit, who married a Brit intending to bring her to the US and wished there were a bridge between the two countries--and the reaction wasn't that the fellow was a vile interloper stealing British women while their men were overseas. And finally a quotation on the screen if you hadn't gotten the drift from the rest of the movie. This should be titled Why Can't We Be Friends? <br><br>I might have given this a 10 but I got tired of the hammering home of the point. The fact that they felt they had to do that is an indication of how much Americans were resented in Britain, not just for their manners and culture, and romancing women with gifts of luxury goods they hadn't seen in a very long time (getting many pg) but also for being wasteful with food and supplies that British sailors were dying from U boat attacks to bring to Britain.","user":"skiddoo","rank":[14,16]},{"title":"WW II love story ... as a london state of mind","rating":7,"date":"21 April 2003","review":"I live in grosvenor square is an all star british production with Anna Neagle and Rex Harrison; Neagle at the time the biggest box office star in England and much of the rest of the world excluding the US. It is very British in style i.e. to say Merchant-Ivory, English Patient etc. The movie takes its time but it is worth it. The tragic battle for the heart of Neagle by the US officer, Dean Jagger and the British officer Harrison is tragic or is it?. The movie seems to be serving the higher purpose of post-war rekindling of Anglo-American relations and as a source of gratitude to the Americans by the British for saving the free world. Either way, performances are all around good with Neagle being the stand-out. The scene as a stenographer, while a list of dead officers' names are read is especially noteworthy. There's really not much more to add. I could detail every scene of the movie and it still wouldn't change a thing, to you, when you see it; because it's all atmosphere, directing and the acting. It's very subtlely done and in my book that is always a plus. So, if you like those merchant-ivory movies, you might not love this one but you will definitely laud it.","user":"raskimono","rank":[16,20]},{"title":"Romance at Eisenhowerplatz","rating":6,"date":"19 April 2012","review":"Grosvenor Square in London, more commonly known as Eisenhowerplatz because that's where the Allied Commander in Chief lived and had his headquarters. A large concentration of American GIs lived there as well and that's where the story begins in I Live At Grosvenor Square.<br><br>In fact the entire United Kingdom was one large armed camp with GIs quartered in every nook and cranny. I find it singularly ironic in that one of the objections to the British that started the American Revolution was the quartering of soldiers in civilian homes. Look it up. 160+ years later and we're over there with the largest invading army in history and they're going out of their way to quarter us and like it.<br><br>American Army Air Force sergeant Dean Jagger is one of those quartered in a posh London home now used as a barracks a fact the British family there puts up with but not liking it. Jagger makes the acquaintance of Anna Neagle who comes from the upper crust as does her steady boyfriend Rex Harrison. The three form an unlikely trio, friendly at first, but when Jagger moves in on Neagle, Rex is put out.<br><br>Later on in America a decade later a similar film was made with Robert Taylor, Richard Todd, and Joan Collins entitled D-Day the Sixth of June. This film ends also with D-Day, but as to how the love triangle straightens out, you watch the film for.<br><br>Anna Neagle and her producer husband Herbert Wilcox produced this film and of course Neagle was top billed as always. But she sang not a note. Instead guest star from America Irene Manning best remembered for playing Fay Templeton in Yankee Doodle Dandy played herself at a USO show and sang the British ballad Home. It's quite a lovely piece, one of my favorites which Gracie Fields recorded over there and Dean Martin used on one of his albums 20 years later.<br><br>I Live In Grosvenor Square is a nice romantic type film, very well done by the impeccably cast ensemble.","user":"bkoganbing","rank":[7,8]}]