[{"title":"A Minor Masterpiece","rating":12,"date":"12 December 2001","review":"The pacing is overly rapid in certain places, Bea's sister and daughter are painted with a cartoonish brush, but the film manages to be genuinely moving and poignant throughout.<br><br>We are never asked to condone every change Bea makes; only to understand. Maureen Stapleton's human, subtly-keyed performance is the perfect centerpiece. Charles Durning is also wonderful in a role many actors would coast through. Once you see him here you'll never think of him in quite the same way again. These characters are so real, so everyday, that we can feel their joy and sorrow in ways cardboard types can't transmit.<br><br>The singing is jarring at first, but their shaky voices add to the realistic undertone of the fantasy.<br><br>Bea's unapologetic stance in her relationship with Al typifies the 70's and the 70's willingness to shake off conventions; I'm not sure if this tv-film would be made today with the same viewpoint.<br><br>I loved the atmosphere of the Stardust Ballroom, the different relationships and the nostalgia for days gone by. Bea comes alive in a room where most are trying to relive their past glories.<br><br>Flawless it may not be, but if you want to believe in love, in having a second chance at life no matter what your age is, this is the film to see.","user":"LuvSopr","rank":[24,24]},{"title":"Unique","rating":10,"date":"1 December 2001","review":"The reasons I bought this DVD are because I'd rembered this film as being great fun (having seen it 15+ yrs ago on TV), Maureen Stapleton is a top drawer actress and I'm nearly as sentimental as the film.<br><br>But there is so much more. It's done quite creatively. The five or so bits where the two main characters sing their thoughts to themselves worked. Normally that would be difficult to pull off &amp; Hollywood would flub it up. Part of the reason why I enjoyed it (or found it acceptable, which I normally wouldn't) is because it's quite apparent that they're from a generation raised to be selective about the thoughts they share, in stark contrast to today's society.  It's also shot in a rather different manner, or have I forgotten how films of the 70s were photographed?<br><br>Queen of the Stardust Ballroom raises the moral bar by ignoring unwarranted judgements and dealing with more important matters.<br><br>And Maureen Stapleton... she's one class act and a brilliant actress.","user":"Mort & Spunky the awesome cat","rank":[22,22]},{"title":"Brilliant!!!","rating":10,"date":"14 May 1999","review":"This is a true tear-jerker.  The songs are beautifully written and the performances are finely honed by all concerned.  The only problem is that you may have trouble finding it, because it's not shown on television very often.  But what a find it is!  Have a box of Kleenex handy; you'll need it.","user":"Tim-177","rank":[18,18]}]