[{"title":"Yet Another Pre-Code Gem From Warners","rating":25,"date":"25 August 2000","review":"Although the early sound era presented some problems - such as stationary camera shots with the actors nailed to their marks, and minimal use of background music resulting in long stretches of torpor - by 1931 most of these bugs had been corrected; thus the pre-censorship period of '31-'34 is chockfull of some of the most vigorous, creative and satisfying movies of Hollywood's Golden Age, however little-known many of them may be. LITTLE GIANT is one such hidden gem. A lightning-paced gangster comedy from the Warner-First National studio (where speed and economy were stylistic hallmarks), it's fast, funny and flippant in a manner that the decayed virgins of the Hays Office would render, if not impossible, at least awfully difficult after '34. Edward G Robinson plays Bugs Ahearn, a Chicago bootlegger put out of business by Prohibition's repeal, who decides to relocate to California and buy his way into society. Once there, he's immediately preyed upon by the type of 'respectable' vipers &amp; parasites his background has left him ill-equipped to recognize, let alone fend off. This 'fish-out-of-water' comedy benefits greatly from a cheerfully amoral tone and a slew of zesty performances, not least of them Mary Astor's as a busted heiress who is the only non-hood here who's on the level. The mix of slapstick and rat-a-tat verbal comedy, coming at you at fast as it does, works very well, and nobody was better at this kind of hectic farce than the woefully-underrated Roy del Ruth, who was one of a number of sure &amp; steady craftsmen who hit their peaks only under the Warners' aegis. In Del Ruth's case, the coming of the Code (and his subsequent move to MGM) proved to be disastrous: though he continued to direct till the late 50s, his post-Warners work was so drained of zest and inspiration that he is hardly remembered at all today. Even the auteurist crowd dismisses him as a competent hack. But do yourself a favor and seek out everything he did prior to 1935, and you'll be rewarded with a body of work that will surprise you with its cynical bite and confident staging. They play as well today as they did the day they opened. (Highly recommended, besides GIANT, are BLESSED EVENT, LADY KILLER, EMPLOYEES ENTRANCE &amp; TAXI.)","user":"fowler1","rank":[45,48]},{"title":"A fast-paced Edward G. Robinson classic","rating":9,"date":"3 February 2012","review":"Like every great First National picture, this one starts off quickly, with Edward G. Robinson in full, glorious gangster mode, speaking the classic language of the Prohibition movie gangsters, words like \"mugs\" and \"rods\" ornamenting his lines. But there is a twist here: Robinson (as \"Bugs\" Ahearn, the \"Beer Baron\"), is going to quit the illegal beer business (since Prohibition has ended), and go straight. In fact, Bugs has a dream: to become successful in high society.<br><br>The script is very fast paced and delightful, and in a couple of places, quite shocking, reminding us of how progressive pre-Code Hollywood could be; I almost fell out of my chair when Robinson's flunky and companion Al, when asked by Robinson whether he ever saw a painting like the one in his living room, responds with, \"not since I stopped using cocaine\"!! Another shocker comes later when Robinson refers to some slimy society people as \"fags\". Oh dear! <br><br>Robinson was an amazing actor. He constantly shifts back and forth between the know-it-all wiseguy bully, and a would be high society snob, who is very unsure of himself. This uncertain, unconfident Robinson, a tough guy who swallows his pride and grovels before his betters, is pleasing to see, and he does it very well. Perhaps one of the great Robinson scenes of all time is when Mary Astor seduces an unsuspecting EGR on a couch. Robinson plays it beautifully, as he has no idea that he is being seduced; and in a delightful moment, when Mary Astor has shyly moved away, sudden realization hits EGR as to what might have just happened. He turns to the camera, and I swear he makes exactly the kind of faces, registering surprise and possible comprehension to the audience, exactly as Oliver Hardy famously did a thousand times in his career. A priceless and lovely moment.<br><br>There are many satisfying moments in this film, and I highly recommend this. The early EG Robinson movies are gifts to be treasured, and this is one of the best.","user":"audiemurph","rank":[14,14]},{"title":"A Gangster from Chicago named Bugs","rating":7,"date":"15 July 2014","review":"Edward G. Robinson who would occasionally channel his gangster image into comedy roles does it for the first time here in The Little Giant. He plays a gangster from Chicago named James Ahern aka Bugs Ahern who has seen the end of Prohibition and has wisely salted away his money. Wanting a little class and wanting to mix with the upper crust he moves to Santa Barbara and starts mixing.<br><br>Unfortunately he mixes with a family of society crooks father Berton Churchill, mother Louise Mackintosh, son Donald Dillaway. Worst of all he falls for Helen Vinson playing one of her patented bad girl roles who is a notorious flirt. <br><br>Robinson has rented a mansion from down on her luck society girl Mary Astor who along with thousands of others had her savings wiped out by investing in the junk bonds that Churchill's firm sold. And now he's sold the firm to Robinson.<br><br>No one makes a sucker out of Robinson and he settles the matter with some friends imported from back east who do it Chicago style. The real Bugs Moran would never have been this gentle as Robinson's old beer salesmen were in The Little Giant.<br><br>Robinson got deserved kudos for essaying comedy and he would do it many times in his career. You have to see how he and his friends play polo Chicago style.<br><br>A must for fans of Edward G. Robinson.","user":"bkoganbing","rank":[5,5]}]