[{"title":"This film \"converted\" me","rating":10,"date":"4 May 2004","review":"I was in my mid-thirties when the Beatles came to America, and appeared at Shea Stadium and (famously) on the Ed Sullivan. I saw their success, with the screaming girls, as just another teen-age phenomenon. I must have read in some column that this film was interesting for its direction and photography. That was true. What I did not expect was that I would be caught up by the Beatles themselves, both as personalities and as musicians. Those who comment adversely on their lack of acting ability are way off base, because neither they nor the director were looking for dramatic skill; only for a degree of naturalness, which was achieved. Those who criticize the technical aspects are not well-acquainted with new developments in film technique especially in France; for instance, the jump shot. Those who criticize lack of plot must be interested only in straight narrative. I suggest that all the previously mentioned critics see the documentary materials on the making of the film, particularly those contained in the DVD set. They will see, for better or worse, that the creators and performers achieved what they wanted, allowing room for the unexpected. For forty years now I have been an admirer, own all their recordings, etc.; and taught this movie in my history of film class regularly. Don't believe the nay-sayers; see for yourself.","user":"sryder@judson-il.edu","rank":[119,133]},{"title":"The Age of Innocence","rating":8,"date":"22 December 2003","review":"This is it. There has never been and never will be another band like the Beatles. The innocence of the generation is showcased in A Hard Day's Night. The perfect musical for any audience, the Beatles capture a time that can never be repeated. Like 4 childhood friends knowing that the Old can never get them down, they represented everything good and right of the world. They reflected the generation that wanted to be heard. Almost 40 years later, they are still as young as ever. Timeless, beautiful, true. A Hard Day's Night is perfection!","user":"caspian1978","rank":[96,111]},{"title":"Pipers At The Gates Of Dawn","rating":8,"date":"26 October 2004","review":"What can you say about the film that started it all? Where popular culture as we know it took shape in a \"let there be light\" Genesis kind of way? Where pop rock became worth listening and not just dancing to? Where John, Paul, George, and Ringo became firmly established as individual personalities as well as the premier entertainment troupe of the 20th century?<br><br>Only this: \"A Hard Day's Night\" is good, yes, and significant, but it's fun, too. Still, and above everything else, it's a lot of fun.<br><br>\"A Hard Day's Night\" is probably more responsible for the Beatles' enduring image in our culture than any single song they made. It came out in 1964, within a few short months of the Fab Four's sensational appearance on the Ed Sullivan Show that truly launched them globally, though they had been making great pop music for more than a year which was all the rage across Europe. \"Hard Day's Night\" captures the band when they were still relatively provincial and innocent, not yet in the \"marijuana for breakfast\" phase they were well into the following year when they made the zanier \"Help!\" LSD, Yoko, and the Maharishi were not even on the radar, nor was the psychedelic era the Beatles would usher in less than three years later. Finally \"Hard Day's Night\" clicked not only with the kids but the adults, who previously viewed the band as a motley band of overplayed haircuts. It gave all the generations of the time something they could agree on. These guys were good.<br><br>The story of \"Hard Day's Night\" is thin by design. We see the Beatles in slightly fictionalized form, with a manager named Norm and a roadie named Shake, traveling by train across England and ducking into a studio to make a TV appearance. Paul has his grandfather along, a codgy old troublemaker who nevertheless is \"very clean.\" The irony of the movie is that the old guy, played by British TV star Wilfrid Brambell, is the one that continually ruffles the feathers of society while the Boys themselves play things fairly straight and legal.<br><br>Grandpa has the best take on the meager storyline: \"I thought I was supposed to be getting a change of scenery, and so far I've been in a train and a room and car and a room and a room and a room!\" Brambell works very well in the film, a needful focal point in a film that requires some bearings in order to work. Of the Beatles themselves, Ringo makes the strongest single impression by showcasing his vulnerable side while John probably has the best moments with his wacky, caustic humor. George shines, too, in a scene with a trend-happy fashion maven, and married one of the girls on the train in real life, so he did pretty well here, too.<br><br>Is it the best Beatles film? I think \"Yellow Submarine\" is better for what it's worth, but \"Hard Day's Night\" is the best film actually featuring the Beatles for who they were and what they were about.<br><br>Great music, too. The sequence on the train with \"I Should Have Known Better\" still works as a video, with all the baggage-car bric-a-brac thrown in for ambiance. Then there's \"Can't Buy Me Love,\" which shows the Beatles in full-tilt boogie mode after momentarily escaping their studio confines. \"And I Love Her\" has some of the film's greatest camera work, very moody and intense in its focus on how well the Beatles worked in a TV studio setting.<br><br>As a film, \"Hard Day's Night\" lacks a bit of heart. Not that it's cold or cruel, just a trifle too detached to get enveloped by, the way one does with great cinema. I don't really miss the fact that \"Help!\" wasn't a true sequel; \"Hard Day's Night\" works for its 90-plus minutes but doesn't leave you wanting more. The relationships between the band members, and with Grandpa, Norm, and Shake, are left unexplored, and you don't really miss that as much as you maybe should.<br><br>But as a collection of small, witty moments interspersed with great music, \"Hard Day's Night\" is a pleasure through-and-through. Like the scene where John cuts the tailor's measure (\"I now declare this bridge open\") or has that absurd corridor chat with Anna Quayle (\"She looks more like him than I do.\") Or when Ringo tells the crotchety train passenger who complains he \"fought the war for your sort\" that \"I bet you're sorry you won!\"","user":"slokes","rank":[52,62]}]