[{"title":"Axel Foley: Eddie Murphy's best role","rating":9,"date":"5 June 2005","review":"Beverly Hills Cop was a big hit in the 1980's. The film was loved by many action fans, as well as comedy fans and movie buffs at the time. It is still being admired by many people as one of the funniest cop movies ever made.<br><br>The thing I love about this movie is that Eddie Murphy was perfectly cast as the Axel Foley character. Originally, Sylvester Stallone was considered for the role. Thank God he wasn't! Eddie Murphy was perfect for the role, because he can be a clever cop, and can at the same time be very funny! Another great thing about Beverly Hills Cop is its smashing soundtrack. There are some great hit songs from the 1980's featured in the soundtrack, as well as an excellent musical score which can be heard throughout the movie (to me, the musical score is the Beverly Hills Cop \"theme song\").<br><br>Perhaps the only downside of Beverly Hills Cop is that it can be pretty slow in certain scenes. Hardcore action fans would probably be disappointed by this. But let's face it: Beverly Hills Cop is not an all-out mindless action movie. It is actually a clever comedy with elements of action present within.<br><br>To conclude, Beverly Hills Cop is arguably Eddie Murphy's best film since he fits the Axel Foley character perfectly. There are many funny scenes featuring Eddie Murphy that will have people laughing (even the action scenes can be cleverly funny)! <br><br>P.S: Look out for cameos by Paul Reiser, Bronson Pinchot, and Damon Wayans!","user":"ShadySovereign","rank":[84,103]},{"title":"Funny, Entertaining And A Message Too","rating":8,"date":"2 December 2019","review":"This film takes me back to when Eddie Murphy was lighthearted and funny, but ironically he had a message and it was serious. racism, criminality of the rich, friendship and loyalty intermingle with a fun and action-packed movie.<br><br>Frankly, they just do not write them like this anymore.<br><br>His lady friend in Beverly Hills is a slender cutie too.","user":"donnie-finds-ivanka-hot","rank":[23,26]},{"title":"Murphy's best role - a unique fish-out-of-water comedy!","rating":10,"date":"12 November 2004","review":"Detroit cop Axel Foley (Eddie Murphy) is in Beverly Hills for a few days to investigate the murder of an old acquaintance. Axel assumes the suspect is a local tycoon, but no one seems to believe him  including the police force, being semi-run by Ronny Cox (in one of his rare good-guy roles).<br><br>Axel comes into trouble with the law his first day on the job after getting thrown through a glass window by some thugs. He is arrested, and when released finds himself hounded by a pair of inept police officers around the town for a few days. After outsmarting them (in one of cinema's most delightful moments  ever) Axel gets hooked up with an old friend and manages to roam the streets looking for clues  which, of course, he finds very easily.<br><br>Before this film Eddie Murphy had starred in one film that had launched his name into Hollywood: \"48 HRS.\" But by all reasonable comparisons this is a much, much better film, and it's also much, much funnier, too. What's most refreshing is that it doesn't fall back upon the stereotypes of African-Americans inherent in so many mainstream motion pictures  the role of Axel Foley was originally written for Sylvester Stallone (who was actually attached to star early on in pre-production before dropping out of the project) and it's quite clear that Foley was intended as a white character. Although massive rewrites were employed only two weeks before shooting, script flaws can still be spotted  the heroine of the story is a white businesswoman, for example, and we expect some sort of sexual tension between them but there is none. We begin to question the very presence of the female lead because in essence it leads nowhere. We can imagine how it might have developed into a love story, but Murphy works against the flow, awkwardly treating her as nothing more than a friend.<br><br>These sorts of things sometimes bring out the occasional odd touches in the film  ironically they unintentionally set the film apart from other such movies of the genre because it's not typical in any sense. Sure, it has the routine shoot-outs but there is no romance subplot, no pointless racial comparisons (more of which would be seen in the two sequels), etc. The movie greatly benefits from this because it seems so fresh, and far more believable  after all, rarely are romances developed in two days. The action genre always seems to end with the hero sending off the crooks to jail, and finally getting a long-awaited kiss from the leading lady. \"Beverly Hills Cop,\" to its credit, manages to avoid this and the result is a far more enjoyable film, even if most of its sequences are far from being 100% realistic.<br><br>The film's director, Martin Brest, has a clear handle on the buddy genre and would go on to direct the immensely successful Robert De Niro / Charles Grodin road-buddies-comedy \"Midnight Run,\" one of the most popular (and best) of the genre. Beverly Hills Cop works just as well  it's funny when it needs to be, thrilling when it wants to be, and features a stellar lead performance by Murphy in his most unusual role.<br><br>Murphy is the driving force behind the film, presenting us with a truly likable character  the most likable character he's ever played, as a matter of fact. Axel is unorthodox but a generally good guy  Murphy is sometimes typecast into playing roles similar to that of which he played in \"48 HRS.\" (being the loud, obnoxious racist who's got it all together), but here he plays someone we actually want to root for. At one point in the film he manages to get a couple of police officers in trouble with their superior  but he takes all the blame, and actually fabricates a lie wherein they were heroes doing their job, despite the fact that they were all actually hanging out at a strip club. Axel is tough, cool, quick-witted, nice, sarcastic, and likable  one of cinema's most enduring characters, and proof that African-American cinema heroes don't always have to be loudmouths in order to succeed as characters (pay attention, Chris Rock and Chris Tucker).<br><br>The now-famous soundtrack (including 'Axel F' by Harold Faltermeyer) is a great blend of techno-pop and electronic rock  the movie's theme is bouncy, rambunctious and fun: a good parallel to Axel himself.<br><br>Overall \"Beverly Hills Cop\" exceeds exceptionally well, even if a great deal of the film's success itself derives from pure accident and chance. I don't think anyone can say that those involved in the production knew exactly what they were doing at the time (DVD supplements include anecdotes about hectic filming and the project almost falling through at one point) -- but as luck would have it everything turned out fine. \"Beverly Hills Cop\" is an immensely enjoyable film, and one of the best examples of the cop-comedy genre executed properly.","user":"MovieAddict2016","rank":[57,72]}]