[{"title":"Supreme suspense and stylish direction","rating":12,"date":"12 May 2004","review":"Despite popular belief, Next of Kin isn't really a regular stalk and slash flick. There isn't much of a death count and Tony Williams doesn't waste time with constant self references to other genre pieces. However, the plot resolves around a psychotic intruder that's murdering the inmates of an old people's home, although the deaths are sporadic enough (we only see one) to keep the heroine believing that they're actually accidents.<br><br>\nThe things that lift Next of Kin above its contempararies is the superb, noteworthy direction and great atmosphere. It's beautifully photographed, with some instantly exquisite camera movements that add a supreme energy and sense of professionalism that's rarely found in slasher movies from New Zealand or Australia. In fact, such a notable level of craftsmanship is rarely seen in any category addition. There are plenty of credible shots, the best being the woodland scenes in which we see the mysterious menace lurking in the distance amongst the trees, barely recognisable. It's fairly well acted - although not superbly -, and it works well to set up a creepy suspense fuelled environment. When the nut-job reveals himself, there's some brilliant chases and a few surprises.<br><br>Like I said, don't expect slasher cliches by the dozen, but if you keep your options open, you'll find Next of Kin to be fairly rewarding. Worth a look...","user":"Raidar","rank":[19,20]},{"title":"An undiscovered classic from down under","rating":5,"date":"5 February 2012","review":"Following the death of her mother, Linda inherits the retirement home that she ran. Once there, reading through her mother's diary sets off a series of unsettling memories. Bizarre occurrences begin taking place as well, almost as if someone were toying with her.<br><br>I've seen this Aussie gem referred to as a slasher film on more than one occasion, though I wouldn't necessarily call it a slasher myself. It's more of a slow-burning mood piece, one that's quite ambiguous at times. It's also effectively creepy, one of my favorite scenes involving a figure watching Linda just out of her eye range as she roams the woods in search of her boyfriend. Said boyfriend is played by John Jarratt, a mainstay in Australian horror, and his presence here is a welcome one as always. Jacki Kerin is Linda, and she's solid as the isolated heroine who doesn't feel completely at home back in her old stomping grounds.<br><br>Naturally, the filming locations are gorgeous and the cinematography does a fine job of catching them in all of their glory. The film is complimented by a unique score and some stylish sequences, such as one terrific slow-motion bit where Linda is rushing down a flight of stairs. The ending gets really wild, leaving the film's more subdued nature behind for an extravagant finale.<br><br>I first discovered this film back in the early 90's when I stumbled across the VHS in H.E.B.'s video rental section of all places, that memorable cover art catching my eye. Even now, the film is just as effective an experience as it was way back then. All said and done, this is one of Australia's finest contributions to the genre. In fact, only \"Long Weekend\" is on the same level.","user":"Cujo108","rank":[27,30]},{"title":"Stylish Outback Horror","rating":28,"date":"28 April 2000","review":"This Australian horror film is a fine addition to the massive genre.  The story is about a woman named Linda who comes back to her home town in order to take possession of a home for the elderly which she has inherited as a result of her mother's death.  As Linda adjusts to moving back home and catching up with old friends, her troubled past begins to haunt her. Things get even harder for her when she finds her mother's diary and begins to read through it.  She learns that her mother had feared that someone was watching and following her. Also, some of the patients had died under suspicious and mysterious circumstances. Soon Linda begins experiencing the same fears and events her mother wrote about in the diary. She is now being watched, followed and her patients are dying off as well.  She learns the truth of what is happening in the films tense and devastating conclusion.<br><br>Next of Kin's plot is handled very well by the entire cast.  Although dismissed by some as a basic slasher movie, co-writer/director Tony Williams use of music, shadows and slow-motion add much style giving the film a unique edge.  The stalking scenes and action laced conclusion are very well done and bound to satisfy any horror fan out there.  This is one film to seek out.  Happy Hunting!","user":"tla.baio","rank":[13,14]}]