[{"title":"Very enjoyable British wartime adventure mystery","rating":8,"date":"8 February 2002","review":"A wartime evacuee from London arrives in a small Scottish village to stay in Mrs Barrington's cottage.  However the arrival of a wounded Spitfire pilot and a mysterious bald gentleman means the boy must stay in the Barrington's house.  At the house Mr Barrington and his assistant are working on a top-secret new bombsight to help the war effort.  Ronald begins to notice strange behaviour in the village and gradually uncovers a plot to steal the bomb sight when it is developed.<br><br>This is a typically jaunty British wartime adventure which contains some gentle laughs and a quite good `who-done-it' style plot.  Our eyes come in the form of cockney scamp Ronald as he notices some strange going on.  The film manages to keep the mystery going by giving each character shadowy motives - we're not sure if they are a spy, a policeman, a rogue after the ladies, a scorned lover or what - but they all seem to have something going on.  This makes it more enjoyable that it sounds and it isn't until the final 20 minutes when it all starts to come together.  The famous cast makes it enjoyable - surely none of them could be the spy!?<br><br>George Cole shows his lifetime career in a good performance as a cheeky cockney scamp.  Mills enjoys himself in his usual war hero role.  Leslie Banks plays it straight as the inventor Mr Barrington, while Alistair Sim has the most fun in his shadowy role (he would later work with Cole as an adult on the St Trinians series).  The only other role that stands out is De Casalis as the dippy Mrs Barrington, she gives plenty of gentle laughs.<br><br>Overall a gentle wartime adventure that has plenty of mystery and nice touches to keep you interested.","user":"bob the moo","rank":[32,32]},{"title":"One for aspiring film makers to watch","rating":9,"date":"19 April 2005","review":"From the jaunty opening scenes to the thrilling ending, you could be forgiven for thinking 'Cottage To Let' was made during the post war period. But this film was released in 1941, when the outcome of the war was still in the balance.<br><br>The cast reflects the wealth of talent available in the British Film Industry at this time and for two decades onwards. Not a false note is struck: Jeannie De Casalis makes me laugh out loud playing the dotty wife (check out her introduction speech for John Mills at the fête). Leslie Banks turns in a precise low key performance. He is an antidote to all the eccentric and unbalanced scientists that were/are the staple of cinema-land. Michael Wilding is urbane and, in his scenes, a good foil for a crumpled Alistair Sim, or the intense and faintly menacing John Mills.<br><br>Sim, of course, had managed to get his protégé George Cole the part of Ronald. Cole had (I think) already played this role on the stage, but took to the sound stage like a fish to water. He moved and acted as if born to boom and camera. In an idle moment compare young George as Ronald with middle-aged George as Arthur Daley in TV's Minder. It's all there: the sideway looks, aggrieved voice, controlled energy, sheer believable and likable personality.<br><br>The film scores on all points for me. The script is realistic and economical, the supporting cast firmly wedded into the few sub-plots. Even the sets, one or two seem to have migrated from other films, are splendid and evocative. And the final denouement is probably one of the most menacing in wartime film, if not the wettest.","user":"richard-meredith27","rank":[41,42]},{"title":"A fine home-front spy mystery from 1941, with Alastair Sim","rating":8,"date":"6 February 2008","review":"Wordy? A little. But this British home-front spy mystery from 1941 is also fine entertainment, reasonably exciting and features two first-rate performances by Alastair Sim as the suspicious Charles Dimble and 16-year-old George Cole as the 15-year-old London kid, Ronald, resourceful and energetic. Ronald thinks Sherlock Holmes is \"the greatest man whatever lived\" and is pretty good at deducing things. Bear in mind that Sim and his wife took Cole into their household when he was a boy and became Cole's foster parents. Sim saw to Cole's education. When Cole wanted to become an actor like Sim, Sim also saw to Cole's training. They appeared together in more than a dozen movies, not as a team but as two skilled comic actors. <br><br>John Barrington (Leslie Banks) is a brilliant, eccentric British inventor. He works at his grand manor house in Scotland and has almost developed a revolutionary bomb sight. The Nazis want his secrets, preferably with Barrington as well. Barrington has a flighty, well-meaning wife (at one point she kindly tells Ronald, who has nearly destroyed a suit of armor, \"Never mind, never mind. Just forget what a nuisance you are.\") and a good-looking daughter. He also has an assistant who longs for the daughter. Suddenly the cottage on their grounds, which had been up for rent, is taken over as a military hospital. In it goes Flight Lieutenant Perry (John Mills), a Spitfire pilot who had to bail out and landed in a nearby loch with a bad arm. Then there's Dimble, who says he had arranged to rent the cottage and now has nowhere to stay. He's put up in a room next to Perry. There's young, confident Norman, sent up from London because of the blitz and lodged in the manor house. There's the butler, a bull-necked, taciturn man who was recently hired and a housekeeper who leaves with little notice. And before long we see Dimble has a revolver, Perry makes odd phone calls, Barrington seems over-confident, his assistant seems unduly interested in the bombsight and we learn Scotland Yard and MI-something have each sent a man up there. They have learned a Nazi spy ring has targeted Barrington and now has an agent in place. But who are the spies and who are Barrington's protectors? Well, one of the Nazi agents is not hard to figure out and one of the protectors is. The fun is in seeing how the game is played. <br><br>Cottage to Let has serious themes and clever characterizations. Bannister's well-bred wife comes from the Billie Burke school of thespianism, well-meaning and ditzy. Addressing the townsfolk who have come to the manor for the annual pageant, she quotes Churchill in honoring all the volunteers, \"Never,\" she says, \"has so much owed so many to so little.\" There's snappy dialogue, plenty of skullduggery, a shoot-up escape and death by rolling millstone. It's always fun to listen to the careful, well-bred diction of the upper-class coming from actors of assorted backgrounds who had to learn how to speak \"properly\" if they were to get leading roles. So many \"girls\" to be turned into \"gels,\" so many a \"here\" and a \"dear\" to be turned into a nasal \"heah\" and a nasal \"deah.\" The main actors all do fine jobs, but once again it's Alastair Sim who captures the movie. He was a superb actor with a unique style, and he is just about impossible not to watch. With Cottage to Let, however, his foster son, George Cole, just about gives him a run for his money. Cole turns in a supremely assured job as the supremely assured Norman, no one's fool yet still a very likable young man.","user":"Terrell-4","rank":[21,22]}]