[{"title":"Bodycount!","rating":9,"date":"18 April 2005","review":"This film is a classic but then all of Bruce's completed films are classics. There are strong anti-Japanese messeges (including one Japanese guy having a tash similar to a certain German dictator) in the film but it has been over 33 years since the film was made and so this can be put down to it being dated. Ultimately it is a film about injustice and Revenge. The Bushido School's general evilness, the injustice against the Chinese in Shanghai and Bruce's (called Chen in this one) hot headedness create a circle of violence which escalates completely out of control. This is an intensely gritty Kung Fu film unlike Bruce's later films which were more escapist in nature and Fist Of Fury has the highest body count in terms of Bruce actually killing people with those fists. The legendary 'Sick Man Of Asia' scene is amazing and the end of Kill Bill clearly homage's this so any Tarentino fan's will get an added joy out of watching this beautiful sequence. DO get the uncut version.","user":"NeoNsMoKeJaZz","rank":[45,54]},{"title":"Bruce Lee classic","rating":9,"date":"16 July 2002","review":"Film maker Lo Wei directed this Bruce Lee classic Fist of Fury immediately after the success of Lee's first martial art film, The Big Boss. Fist of Fury tells the story of Chen (Lee) who arrives in Shanghai to his martial art school, only to learn that his beloved teacher has died and the funeral is going on when he arrives. Soon it is revealed that the death was without a doubt a murder and our fierce hero is going to solve the mystery..With the power of his fists and kicks.<br><br>This film is prehaps little too racist towards Japanese since they are depicted as dirty and greedy criminals here and some lines in the script are very underlining and judge the Japanese people too much. Then again, the film makes me wonder about racism in general since there is so much mayhem in the film and so many Chinese and Japanese get killed by each other, so maybe this film was not meant to be racist at all. Maybe the intention was to tell something about us who cannot live in peace with each other. All these things happen even today, 30 years after the film's release so the subject matter is definitely universal as it was back then in 1972. Still I would have toned down some of the dialogue bits since they are little too strong, and I think Bruce Lee himself didn't like the film's racial elements.<br><br>On the other hand, this film is really beautiful as it depicts the sensitive love between Bruce and Nora Miao, who is very beautiful and sweet female in this film, and also in other Lee's films. The scene at the teacher's grave is one of the most sensitive scenes of love I've ever seen, and those two characters are hand touchingly full of emotion. The themes in this film are mainly about relationships between individuals and humans in general, so the film has many things to offer moreover mere action. This is action classic with heart.<br><br>The film is famous for its legendary first nunchaku fight scene at the Japanese' training camp as Bruce shows for the first time his personal fighting tool and weapon, a pair of nunchakus. That fight scene even before nunchakus is among the greatest ever filmed since the choreography and timing is totally marvellous as the one take lasts very long without edits, and Bruce kicks and hits about ten victims during that, and the timing and stunt men had to be really sharp in order to not to get hurt for real. Also, the nunchaku fights in the film are incredible as Bruce uses his weapon without flinching an eye and with fierce look on his face. This all is even more powerful in his next film, Way of the Dragon.<br><br>The film was shot mostly in studio and there are only few exteriors in Fist of Fury. The staging is very convincing and the film's bigger budget compared to that of The Big Boss' really shows. The last fight in night time at the Japanese yard is very beautifully lighted and full of cinematic magic. The film is full of details and elements from Chinese culture and traditions, so this is little more personal and interesting film than The Big Boss, which had some irritating little flaws like the sound of Bruce' necklace he got from his mother and the scene where Bruce punches a guy through a wall with funny and campy result, which director Lo definitely didn't meant to look that funny. <br><br>Fist of Fury is a stunning piece of Hong Kong and world cinema and easily among Lee's greatest films. The atmosphere is created so convincingly that even people who usually don't appreciate action films should appreciate this, since this film is many more things than just action and fighting. Fist of Fury hasn't lost any of its power and punch during these 30 years and will remain one of the most important martial arts movies ever made. 9/10","user":"Bogey Man","rank":[32,40]},{"title":"Lee's most conventional martial arts film, but still classic stuff","rating":19,"date":"19 October 2004","review":"The second of the Bruce Lee-starring movies is in terms of plot a lot less interesting than the first. Here, we have the 'student sets out to avenge his master's death' which was already the major storyline of most martial arts films. However, it is handled in a more realistic way then usual and technically it is far superior. Lee was allowed to choreograph his own fights and his battle with Japanese martial artists in their school and climactic duels with a Russian boxer and a Japanese swordsman remains classic fight scenes.<br><br>The film drags somewhat in the middle although the lengthy dialogue scene between Lee and his girlfriend was another step forward for the Hong Kong martial arts movie, vivid proof that Lee was a pretty good ACTOR. By contrast, Lee's final farewell to his girlfriend is all the more powerful for being done completely without dialogue at all. The ending is the most powerful and moving of all the Lee films, the final freeze frame managing to encapsulate Lee's grace and power in a single shot.<br><br>Many mock Lee's films as being silly and just consisting of fighting. Both accusations are completely untrue. They have far less fights than most films of this kind and, at least in the three Hong Kong films he made, there is a clear message that violence does not solve anything. They may not have the polish of the more recent works of Jackie Chan and Jet Lee but their power remains undiminished, as long as of course one does not watch the awful dubbed versions!","user":"DrLenera","rank":[31,39]}]