[{"title":"Underrated","rating":10,"date":"1 February 2007","review":"A very fine movie, totally underrated. Despite a bad box for the DVD edition, this is NOT a \"horror flick\", but a greatly interesting and subtle approach of a strange and complex relationship between an influenced young man (Lowe) and a disturbed pow-wow-preacher, tortured by his secret fears -- and desires... Homosexual implications, wonderful camera work, and great musical score by Charles Gross. There is a magic in this movie, which places it somewhere between \"The Night of the hunter\" and \"The Reflecting skin\". Felicitations to R.L. Thomas. Oh !... and Donald Sutherland is memorable !... His performance is suave, well balanced, and constantly precise.","user":"pascal-francaix","rank":[6,7]},{"title":"Strange, but Based on Fact","rating":7,"date":"24 April 2005","review":"This film was based loosely on a bizarre murder investigation and subsequent trial in Pennsylvania. At the time, in the 1920s, backwoods Pennsylvania had folk-medicine healers called Pow-Wows, and the film involves one. These healers relied on a book, \"Long Lost Friend,\" written by a George Hohmann, that was full of prayers and folk remedies based on a form of sympathetic magic, that were supposed to cure ailments and the like.<br><br>The Sutherland character is a Pow-Wow, and a youngster, played by Lucas Haas, becomes his apprentice. A series of bad events takes place in the community, and the Pow-Wow suspects a neighboring farmer, culminating in the murder.<br><br>Significant Spoiler: The film is ambivalent on the nature of the Pow-Wow's power, and leads the viewer in one direction, and then suddenly reverses itself. This weakness could have been sidestepped easily. It would have been a better film if it had.","user":"skallisjr","rank":[6,10]},{"title":"Almost a Folk Magic Docu-Drama","rating":10,"date":"22 September 2007","review":"I love this movie and have recommended it to my students in folk-magic because it is closely based on a true story of murder, mysticism, and (possible) madness concerning a Pennsylvania Dutch Pow Wow doctor in the mid-1920s. Donald Sutherland is superb as John Reese, the highly eccentric conjure and herbalist. Chad Lowe is quite good as his young apprentice. The location shots, filmed in Norway, are spectacular -- not Pennsylvania Dutch country, exactly, but a wonderful rural landscape, with great old 19th century buildings. There is also a very good look at contemporaneous hoodoo practices, as the Pow Wow doctor seeks an outside consultation to cure his ills. If you're a prop and set decoration fan and knowledgeable about magic, look for the couple of Pennsylvania Dutch hex signs (inexplicably called \"hexagrams\" -- the movie's one false step) that contain Norse bind-runes thrown in on them -- obviously that was the Norwegian prop-maker's little in-joke. This is a great little underrated classic, and the perfect vehicle for Donald Sutherland.","user":"catherine-71","rank":[3,5]}]