[{"title":"Doris Day at her zaniest!","rating":19,"date":"19 February 2003","review":"I really like this Doris Day flick.  Doris does more slapstick in this feature than all her other movies put together.  James Garner thinks Doris has been dead for 5 years.  He is now on his honeymoon with new wife Polly Bergen and guess who shows up after being rescued off a deserted island? You got it.  Doris hilariously ruins the honeymoon (this was when couples waited until the honeymoon to make love, YEAH RIGHT!)  Anyway, Polly is quite frustrated not getting any action from James Garner.  Several scenes are classics. especially when Doris poses as a Swedish Masseur and practically beats Polly to a pulp.  The best scene of all is watching Doris drive a brand new 1963 Imperial Conv. into a car wash and then accidentally putting the top down.  <br><br>Don Knotts makes a funny cameo as a randy shoe salesman and Edgar Buchanan (Petticoat Junction) is funny as a surly Court Judge.  Thelma Ritter is always funny and she is up to par here.  This movie was apparently re-worked for Doris Day after the death of Marilyn Monroe who was essentially filming the same movie when she died.  Even the sets were basically the same.  I guess 20th Century Fox needed the money after the Liz Taylor fiasco \"Cleopatra\" almost put them in bankruptcy.  Overall, a very cute, sexy (for the era) funny movie.  They don't make cute movies like this anymore.  Too bad.","user":"Hoohawnaynay","rank":[34,37]},{"title":"Think Of The Potential","rating":7,"date":"17 August 2008","review":"Move Over Darling with James Garner and Doris Day which is a remake of the RKO classic My Favorite Wife is probably better known for being the end result of the disaster known as Something's Gotta Give. That of course is Marilyn Monroe's legendary last film that she never finished.<br><br>Looking over the cast of the unfinished Something's Gotta Give I have to say though I don't think it would have been Monroe's greatest film, the rest of the cast was pretty good. When 20th Century Fox fired Marilyn, Dean Martin also quit and the whole film was scrapped. At that point it was just decided to redo the whole thing with an entire new cast and apparently no one survived the change.<br><br>I also imagine that a serious rewrite would have to be done in order that a role originally cast for Marilyn Monroe could fit Doris Day. Seeing Doris on the screen I can't imagine that Chuck Connors or in Marilyn's case, Tom Tryon, would have been unsuccessfully trying to catch her on a desert island for five years.<br><br>The story as originally written by Sam and Bella Spewack has James Garner going to court to get his first wife, missing for five years after a forced ocean landing, declared legally dead. He wants to marry Polly Bergen. But wouldn't you know it, a Navy submarine rescues Doris Day at just that time and when she hears about Garner's new bride, it's Doris off to spoil that honeymoon.<br><br>Polly Bergen was just great as the picture of sexual frustration on that honeymoon. Although I can certainly see Cyd Charisse in that same spot with Dean Martin. <br><br>Edgar Buchanan is great as the crusty judge who declares Doris legally dead the first time and then has all the parties and then some in court to try and untangle things. That role was supposed to go to John McGiver and certainly those two would have been different types.<br><br>It goes that way up and down the cast list, Don Knotts substituting for Wally Cox as the timid shoe salesman Doris has impersonate Chuck Connors so Garner won't be jealous. And I can't see much difference with Phil Silvers as opposed to John Astin as the smarmy insurance man. <br><br>One thing I did notice is that there was no equivalent parts in Something's Gotta Give for Fred Clark the hotel manager and Thelma Ritter as Garner's mother. My guess is that whoever was supposed to play those roles may never have got on camera because there was no way to shoot around them.<br><br>I suppose the best thing to do is not speculate, but enjoy the funny comedy that did come out of all the grief 20th Century Fox had with this film. <br><br>Certainly only Doris Day could convince you that in five years she never succumbed to Chuck Connors.","user":"bkoganbing","rank":[17,18]},{"title":"Is it wrong to consider it one of my favourite Doris Day films?","rating":9,"date":"3 October 2010","review":"As a big fan of Doris Day, I loved Move Over Darling. My Favourite Wife is often compared to this film, but I personally prefer this film. Move Over Darling is funny, charming and without a wasted scene. The film looks fabulous, with beautiful cinematography and fresh-looking scenery, while the soundtrack is bright and breezy. Then there is an engaging story, a witty and charming script and professional direction.<br><br>Not only that there is some fine acting in this film. I have always loved Doris Day, not only as a talented singer but as a fresh and endearing actress, and she is lovely in Move Over Darling, and James Garner as always is immensely likable. While Polly Bergen and Chuck Connors give perfect support as the other woman and the hunk marooned with Day, it is the delightful Thelma Ritter who steals the show as Day's outspoken mother-in-law.<br><br>Overall, one of my favourite Doris Day films, and a film that is warm, witty and charming. 9/10 Bethany Cox","user":"TheLittleSongbird","rank":[14,15]}]