[{"title":"A gulity pleasure","rating":8,"date":"17 September 2001","review":"Breakin may have been made for one sole purpose to cash in on the break dancing phase but it's still a great film. Yeah the plot 's a bit contrived but who cares the soundtrack and dancing are great and that's all that matters.","user":"DunnDeeDaGreat","rank":[17,17]},{"title":"pop and lock.","rating":8,"date":"15 May 2005","review":"A true b-movie classic... pop and lock it, baby. Everything about this movie is funny watching it today. The wardrobes are awesome. They're so bad that they're good. The acting is so stilted and straight that you can't help but dig it, and the storyline is very predictable, but somehow does the job, and gets you to remain interested in the story in a 80's kind of way. This whole film is almost camp now. But the Break dancing is off the chain... Breaking 2 - Electric Boogaloo is even better! I'm surprised movies used to be this simple? Amazing how times and movies change, seems like usually for the better if you're looking at it from a modern sensibility. It's dated, but totally cool and fun to watch with friends...","user":"johnnymovieboy","rank":[14,14]},{"title":"bringing back the memories","rating":10,"date":"19 October 2006","review":"well as an adult watching back on what i used too do myself in the streets of NYC. This movie brought back memories i thought i had forgotten.Ozone and Turbo inspired me and it rekindled what i had lost as a child now as an adult.Memories last a lifetime and i wish i was back in the 80's again!I sit here now as adult wondering where my childhood idols are at now.Trying too think where all this time went, Being able too look up there Bio's is cool.Just wish that breakn'3 could have been made,that would be something truly unique.The movie was very in-depth of how it was growing up back then dancing in the streets and wondering if our dreams of making it big would come true. Just to get out and experience what life on the other side could have been like for a child in the hood.","user":"gjxsdda","rank":[12,12]}]