[{"title":"This movie was filmed on my submarine.....","rating":10,"date":"28 March 2006","review":"I was attached to the USS Portsmouth when this movie was made here in San Diego, at the Point Loma Submarine Base; some of my closest friends were cast as Soviet sailors in the movie. This movie is amazingly accurate on many levels (granted, there are goofs here and there...but nothing that a non-submarine sailor would be likely to catch). I actually had the pleasure of serving onboard two of the subs featured in this movie; the second one was the USS Blueback (SS 581), which was the last diesel submarine in our navy. The scene where the submarine flies out of the water is actually the Blueback, during an emergency surface; a little scary the first time I did it, but incredibly fun every other time I did it. This movie brings back so many memories, and I hope that everyone enjoyed it as much as I have.","user":"mmel__98","rank":[55,57]},{"title":"A submarine classic","rating":9,"date":"28 August 2000","review":"'Red October' did for modern submarine warfare what 'Das Boot' did for WWII. It took a concept that is inconceivable to most people (living in a boat underwater with people trying to blow you up) and brought it up close and personal.  The resulting suspense and excitement for this type of film is always extremely entertaining and this film delivers nicely.<br><br>Tom Clancy's thrilling novel converts well to the big screen.  Clancy is a master of making improbable tales of international intrigue seem plausible. This story of a Soviet sub commander who is trying to defect to the U.S. adds a unique twist to the suspense normally associated with submarine films.<br><br>John McTiernan, who is building an enormous reputation in the action/adventure genre did a fabulous job as director.  This film focused less on the submarine and its crew than its cousin 'Das Boot', and more on the international intrigue angle.  McTiernan is very effective in keeping up the pace and giving the viewer riveting suspense as smart torpedos chase subs through the murky deep.<br><br>As always, Sean Connery was powerful as the defecting captain, determined not to allow this first strike weapon to start a nuclear holocaust.  Connery gave his character both a conscience and a ruthless commitment, stopping at nothing to reach his goal.<br><br>Alec Baldwin turns in one of his better performances as Jack Ryan.  Unlike Harrison Ford who made Ryan into an action hero in other Tom Clancy adaptations, Baldwin seemed better cast as the CIA nerd who was thrust into a field situation without any real experience.  In this way, I felt he was a better representation of the character as Clancy originally wrote him.<br><br>This is a highly entertaining and engrossing film that will keep most action and suspense viewers on the edge of their seats.  I rated it a 9/10.","user":"FlickJunkie-2","rank":[127,138]},{"title":"The action-thriller to end all action-thrillers","rating":10,"date":"20 January 2006","review":"After seeing this movie, you'll wonder how Hollywood manages to turn out so many junk-action movies, now that they've figured out the right formula. To be fair, the vast majority of action movies don't have the benefit of Tom Clancy's greatest novel (granted, 'Sum of All Fears' was a very, very close second, for me). High tension and realistic (emphasis on that last word) depictions of modern warfare make for an excellent story.<br><br>Nonetheless, there are a few key qualities that shouldn't go unnoticed to today's directors. First (again) is the basis of a good plot that actually captures your attention, makes you think, and puts you on the edge of your seat. Second is the high caliber of actors: James Earl Jones, Alec Baldwin (I'm a Harrison Ford fan, but I still think Baldwin was far better for the role), and - last but certainly not least - Sean Connery. I'm sure this wasn't cheap, but when you look at the product produced by three of the best professional actors, it's worth every penny. Third, is the great music; nothing too over the top, but well-orchestrated, and featuring a great set of pieces by a Russian men's choir (hard to go wrong!). Lastly, the great use of special effects, from which George Lucas himself could use a clue or two: it smoothly supports, and doesn't take the place of or interfere with, the development of the plot.<br><br>This is my #2 favorite movie of all-time, but you don't have to take my word for it. See it yourself! You'll be glad you did.","user":"RogueSix_85","rank":[92,101]}]