[{"title":"Well-acted \"small\" film with a lot of heart and some suspense","rating":9,"date":"2 September 2001","review":"I just caught this film again on a cable channel and remembered how much I like it.  Most people will consider this a \"small\" film because it doesn't have a lot of action, but there are some suspenseful moments - especially near the end.  During World War II, Sissy Spacek plays a small-town phone operator raising her two sons on her own.  In fact, the switchboard is in the home where they live.  Many of the townspeople have no phone of their own and come to Sissy's home to make calls and sometimes to receive that dreaded call informing them that their husband/son, etc. has been wounded, killed or is missing in action.  Oft-seen character actor R.G. Armstrong turns in his usual strong performance as Sissy's manipulative boss.  Sissy's philandering former husband is played well by Sam Shepard in a small but pivotal role.  Playing their usual (but this time creepy!) Southern \"good ol' boys\" are Tracey Walter (seen recently as the provider of \"insider\" evidence in ERIN BROCKOVICH) and William Sanderson (perhaps best known as Larry with his brother Darryl and his other brother Darryl on T.V.'s NEWHEART or for his role in BLADERUNNER). They make great troublemakers in this film. Henry Thomas plays Sissy's older son and reveals the strength of character and sensitivity that he will later show as Elliot in E.T.  But the leads, Sissy and Eric Roberts, are my favorites.  They are terrific together but also great when apart onscreen.  Sissy has a fun moment alone singing and dancing as \"Rum &amp; Coca-Cola\" plays on the radio while she is housecleaning.  She's also good when she tries and finally succeeds at standing up to her boss.  And she's definitely believable as the boys' \"Mom\".  Eric, as a young sailor on a short leave, has a great early scene talking on the telephone and is absolutely wonderful in his scenes with the two boys.  I love it when he tries to make the boys feel better as he leaves to go back to his ship - he names his two shoes after them so that they will always be with him, calling out their names with each step as he walks off down the street.  And then there are the scenes with Sissy and Eric together - tender, sweet and romantic.  If you have forgotten like I had, this film will remind you what a beautiful young man Eric was, before the ravages of time and how ever many broken noses he has had, changed him into the more rugged but still handsome man he is today.  A few more films (STAR 80, RUNAWAY TRAIN, to name but two) have also shown us what a fine actor he is, but unfortunately, most A-list directors and producers tend to ignore him so that he has become a B-movie regular.  I saw him on Broadway about 10 years ago as the lead in BURN THIS, and he was amazing.  Come on, somebody, cast him in a really good role in a really good film!  He deserves the role and movie-goers deserve to see him at his best.  In the meantime, we can enjoy this film.","user":"JanKoengeter8","rank":[14,15]},{"title":"What are you waiting for...?","rating":10,"date":"28 July 1999","review":"Go Rent This Movie!  Really, it's a very good drama, set in what looks like South Central/Central Texas during WWII.  Spacek and Roberts reach their thespian peaks in this film.  It is a true classic with tones of despair and hopelessness, followed by love/passion and intestinal fortitude. Tremendous Realism, you'll push back the tears.","user":"hlw27","rank":[6,6]},{"title":"Southern Comfort","rating":9,"date":"3 July 2003","review":"As a dyed in the wool Yankee I must confess to a certain weakness for things Southern. They seem to do everything larger than life down there, possessing a daring and a sense of style a million miles away from us hyper-rational northerners, who, though we won the Civil War, seem to have lost the culture war. Anyone ever heard of Yankee fried chicken? In the movies the South can lay claim to not only the most acclaimed movie of Hollywood's \"golden age\" (Gone With the Wind) to its credit, but a lot of fine little ones as well. Indeed, since the early sixties, around the time To Kill a Mockingbird, there has evolved a genre which for want of a better term one might call the Southern Art Film, which is generally a modest though not B picture with high artistic aspirations, featuring first rate actors playing believable, for the most part un-stereotyped characters (Tomorrow, Sounder, Conrack, The Great Santini, Driving Miss Daisy, The Apostle, to name just a few). Raggedy Man falls more or less into this category, as it tells its modest tale of an abandoned wife and a footloose sailor, their love, the time they spend together, how this affects her children. Not a very eventful film, its slow pace and fine acting saves it. The music, alternately jaunty and wistful is of the sort that has become a cliché, and I wish they hadn't used it. The actors are outstanding, however, with Sissy Spacek and especially Eric Roberts both in peak form. Roberts is an enigmatic presence, which works for this film. Almost too pretty to be credible at times (not his fault), his work here makes me wonder why he never became a major star. In any case, the movie is well worth catching for some very good moments and a story that pulls at the heartstrings, but in a gentle, uninsistant way, with an ending that's sad but not depressing.","user":"telegonus","rank":[15,18]}]