[{"title":"A SOLID GOTHIC HORROR FILM","rating":7,"date":"24 May 2001","review":"Daniel Haller's \"Die, Monster, Die!\" is a solid gothic horror film, about ten times better than what you would expect from American International Pictures. It has a confusing story, but two exceptional performances save this from being grade z schlock.<br><br>The two lead performances are by Boris Karloff, as the scientist who has bad things happen to him and Nick Adams, as an American visiting his girlfriends' home. Despite his arthritis confining him to a wheelchair, Karloff manages to give a strong performance as the scientist who stumbles onto something big and lives to regret it. Adams' role could have been thankless, but he adds an aura of mystery and intrigue a lesser actor wouldn't have.<br><br>This is a great-looking film. Haller was art director for Roger Corman and he has inherited Corman's gift for making the most of the small budget. This looks as if it could have cost a million dollars or more instead of a few hundred thousand. The widescreen Colorscope photography is among the best I've seen and deserved an Oscar nod.<br><br>As for the story, it is confusing, but it all becomes clear if you pay attention and watch it more than once. I'm not sure people would want to do that, but this is the kind of film that deserves it. Its' odd and poetic feel make it spellbinding. Worth more than one look.<br><br>***1/2 out of 4 stars","user":"Katmiss","rank":[32,37]},{"title":"Flat chiller for fans only","rating":4,"date":"31 August 2008","review":"This production has everything an old chiller ought to have: an American in England, a spooky old mansion, locals frightened of the spooky old mansion, a pretty girl who knows not the evil which surrounds her, creepy old people with a creepier family history, monsters, pseudoscience, the occult, and more. It all ends up being both too much and not enough, altho Boris Karloff is certainly acting his heart out. The scripting is clumsy: the elements are too traditional and elementary, everyone knows something they refuse to tell for no particular reason, the heavies are homicidal for no logical reason, the hero is afraid of nothing yet makes no effort to pursue attackers.... Worse, the directing is flat and the leads have little charisma or chemistry. It's occasionally effective, but mostly boring, which is death to the chiller genre. I want to say \"Die, movie, die!\" but it's just not that offensive.","user":"djensen1","rank":[14,15]},{"title":"Boris gives us his all","rating":6,"date":"6 June 2001","review":"AIP decided to try cashing in on Lovecraft rather than Poe this time around.What we get is an above average movie that is hampered by its budget.<br><br> Nick Adams plays Stephen Reinhart who arrives in the small english town of Arkham.When he tries various means to travel to the Witley estate he is rebuffed by the townsfolk and has to walk.We're treated to some decent matte shots of a desolate countryside.<br><br> Arriving at the estate the young man is met by Nahum Witley (Boris Karloff).He is pointedly told to leave.Sticking to his guns Steve informs the man that he was invited by Mrs Witley.Of course Susan (Witley's daughter) rushes down to clear up some confusion.<br><br> Here we learn that there are some weird goings on involving everyone at the house. A maid has disappeared,weird screams are heard at night and Mrs Witley hides behind curtains.A real miasma lurks in this house. Nahum has a strange secret in the basement that seems to be killing everyone who comes in contact with it.<br><br> Rather than go further into the plot which is really basic there are a few things that lift this above your standard haunted (for lack of a better word) house story.This movie just reeks with atmosphere.It is very opressive and claustrophobic.The sets are wonderful and nicely done on the cheap.Boris Karloff gives his usual wonderful performance. Nick Adams actually holds his own here.<br><br> On the downside the special effects are very limited due to the budget. A minor quibble.Patrick Magee shows up for a role that will leave you scratching your head wondering what that was all about.<br><br> Definitely worth a look if you catch it on AMC or find the dvd cheaply.","user":"evilskip","rank":[29,34]}]