[{"title":"One of the finest","rating":10,"date":"12 August 1999","review":"Perhaps the pinnacle of comedy writing and acting in colonial Hong Kong. Michael Hui's genius is best demonstrated in Security Unlimited, which he penned. The Chinese humour is uniquely evident: some of it is slapstick, but a great deal rests on puns and jokes which require a little more thought.<br><br>He co-stars in this film along with Sam (who also composes the theme) and Ricky Hui, his two younger brothers, all playing security guards. Michael is the senior officer to Sam, training a bunch of new recruits, one of whom (Ricky Hui) is colourblind, under the regulation height, and has only got into the force by flattery.<br><br>The timing of all the gags is impeccable and in this respect, foreign viewers will liken it to British comedy, à la Peter Sellers or even Dick Emery. However, the film and its jokes are uniquely Hong Kong Chinese.<br><br>There is no overall plot to the story: it centres around individual assignments at a fictional company, Wong's Security. The first part of the film looks at the training of the officers, and shares some oddball comedy with the later Hollywood flick Police Academy. Fortunately for Hui's reputation, this film pulls off the humour more naturally, easily resulting in more laughs.<br><br>It's little surprise to find that Michael Hui won the best actor award at that year's Hong Kong Film Awards as a result of his performance in Security Unlimited. If you get to see this in its original Cantonese and understand the language, then this is the only way to enjoy it: dubbed versions will doubtlessly leave audiences puzzled about the above comments.","user":"Jack_Yan","rank":[4,4]},{"title":"Hui Brothers Comedy Fest!","rating":9,"date":"3 March 2005","review":"Security Unlimited (1981) was the last official Hui Brothers comedy film together (although they would appear together in other comedies but not all three at the same time). Their latter films were geared more towards younger audiences compared to the first three, but don't let that steer you away because this film his very enjoyable and fun for all ages.<br><br>Michael Hui stars as the head officer of a security firm. Sam Hui co-stars as his second in commander whilst Ricky plays a new recruit who joins the two on many assignments. Stanley Fung plays the son of the firm's owner and doesn't care for the antics of Michael and calls many of his ideas and techniques \"outdated\". The three guards go through a series of adventures such as foiling a group of grave robbers, a bank heist, helping a family of illegals come into Hong Kong but their biggest trial lies ahead. A gang of thieves want to break into the fiftieth floor of a high rise and take the Imperial treasure from an ancient Chinese Emperor. Can the three brothers rise to the occasion yet again and stop their biggest challenge to date? Will Ricky earn the respect of his fellow guards? Can Michael put up with his co-workers for one more month? To find out you'll have to watch Security Unlimited.<br><br>More hilarity from the Hui brothers. Even though it's their last film together, the brothers have managed to appear in each others films such as Chicken and Duck Talk and The Chocolate Inspector. Funny in their own right but not as good as this one. Highly recommended for fans of Cantonese comedies and slapstick humor. Enjoy!","user":"Captain_Couth","rank":[4,5]},{"title":"Possibly the greatest from the Hui Brothers!","rating":10,"date":"5 January 2015","review":"Security Unlimited is my favorite movie starring Michael Hui, Ricky Hui and Sam Hui together, and it is also possibly the greatest one starring all three. Here, Chou Sai-Cheong (Michael Hui), a bitter supervisor of a Hong Kong private security company, teaches unusual guard tactics to new recruits, unknowingly being secretly observed by his new boss-in-waiting (Stanley Fung). Chou gets a demotion and his assistant Sam (Sam Hui) is promoted as the new supervisor, leading Chou, new recruit Bruce (Ricky Hui) and others on a slew of misadventures, including pursuing stowaways on a party boat, guarding Hong Kong's prized treasures at a convention and trying to recover missing government money from a bank heist.<br><br>The direction of the movie by Michael Hui is terrific, assembling a cast of characters that delivered unique Chinese humor, witty remarks and slapstick comedy. There are puns and gags in abundance; however, it is tastefully done (not nonsensical or overboard) that the audience would appreciate and be sent roaring with laughter.<br><br>Amidst all the comedy (including the hilarious scenes of Chou teaching his security class), this movie has a good taste of drama and suspense, including Chou, Sam and Bruce attempting to help stowaways from the Mainland; the subplot of the relationship between Bruce and one of the stowaways; the guys keeping watch at a memorial service; and them pursuing sword-wielding bank robbers. There is also a touching message of partnership and teamwork within all the adventures.<br><br>While there is really no main plot in the movie, all the course of events are interwoven carefully which enables the story to flow smoothly and keep the viewer engaged. There are surprises and innuendos in this movie that just has about everything in it that would entertain an audience of all ages.<br><br>Grade A","user":"OllieSuave-007","rank":[2,2]}]