[{"title":"Legendary","rating":10,"date":"14 April 2018","review":"A stand-alone monument in cinema history, Stanley Kubrick's magnum opus 2001: A Space Odyssey (1968) is an undeniable masterpiece. 2001 not only shattered science fiction genre conventions, but gave cinema a whole new meaning. From the grandiosity of its futuristic idea to its ambitious execution, 2001 isn't concerned with entertaining us- but rather to inspire us with awe. I've never seen a person say, \"2001: A Space Odyssey? I don't think I've seen it... oh wait, the one with like, the spaceships and stuff?\", while most movies today are forgotten once the credits roll. What viewers must understand is that 2001 not the type of movie where you \"get it\" or not, nor is it designed to thrill us with flashy special effects- but as Kubrick said, is \"...intended to be an intensely subjective experience that reaches the viewer at an inner level of consciousness.\" In it of itself, exploring the philosophical and scientific arenas of mankind while serving as a groundbreaking achievement both on a conceptual and technical level is a hell of an accomplishment, but to transcend the audience to a whole new dimension all in one- that's sheer genius at its highest form.<br><br>At its premiere, 2001 polarized critics and audiences alike. Walkouts numbered well over 200, including Rock Hudson who asked, \"Will someone tell me what the hell this is all about?\" The New York Times remarked, \"Somewhere between hypnotic and immensely boring.\" \"Superb photography major asset to confusing, long-unfolding plot,\" Newsday commented. Renowned critic Pauline Kael even went as far as calling 2001 \"trash masquerading as art\". It's understandable, though. In a time in which excitement revolving around interstellar exploration and extra-terrestrial life was everyday talk, audiences came into 2001 expecting answers. When will we reach the moon? What does the future hold? Are we alone? To their great surprise, 2001 did the paradoxical; leaving more questions to answer than answered questions.<br><br>Even though the late 60s marked the height of technological optimism, Kubrick saw ahead, highlighting the potential negatives of technological advancement. Notice the contrast between how apes and humans approach the monolith. The apes approach it with dignity, respect, and mindfulness. The humans approach it with arrogance, grouping astronauts in front of the monolith to take a picture. Since the monolith represents the incomprehensible (man, with his limited senses, cannot comprehend the absence (perfect black) of color or light), Kubrick may be suggesting the manner in which we handle new information is careless and hasty, emphasized in the Clavius base briefing. Scientists discuss how to distribute this exciting news to the public, for \"if the facts were prematurely and suddenly stated without adequate preparation and conditioning\", as stated by Dr. Heywood Floyd (William Sylvester), it may cause \"cultural shock and social disorientation\". It's a significant message to the anxious people of 1968 to perceive fresh information precisely and draw conclusions logically.<br><br>Yet apes are not much better. They're not willing to share food and water with their fellow apes, and with the discovery of bones as weapons, kill their own race for a puddle of water- possibly foreshadowing our own demise if we continue to advance artificial intelligence. Because like our ancestors, at heart, mankind has been and will always be selfish.<br><br>Far before The Terminator (1984) or The Matrix (1999) accentuated the dangers of artificial intelligence, there was 2001. H.A.L 9000, voice played by Douglas Rain, was ingeniously crafted into one of the most terrifying villains in film history. There's something about his calm voice, unpredictability, and especially, his omniscient single red eye that's so frightening. Kubrick utilizes one of his favorite filmmaking devices to compare artificial intelligence with humans: irony. Neither Dave Bowman (Keir Dullea) or Frank Poole (Gary Lockwood) display much emotion throughout the film, while H.A.L, albeit a machine, exhibits some while pleading for life singing \"Daisy\" (which, by the way, is a heart-wrenching scene) and murdering his crew members. There are clear connotations of humanity's fate when H.A.L attempts to kill Frank, Dave, and the hibernating crew members. Yet H.A.L, contrast to what he may think, is not perfect. If he was incapable of miscalculating even the slightest bit, he wouldn't have gotten himself killed. Kubrick implies that artificial intelligence has not yet reached the level of annihilating the human race, but if we are not careful, they soon will.<br><br>This idea coincides with the perplexing final sequence, resembling man reaching the next stage of evolution. After the famous \"Star Gate\" sequence, Dave is enlightened in a room. The setting hints at the Enlightenment Era, exquisitely decorated in 18th century style and embellished with lavish paintings and furniture. Notice how the room is solely lit through the transparent ground, establishing a heavenly environment. The eerie silence is ominous, magnifying the mystical aura that is ever so present in the timelessness of the final scene. As Dave exits his EVA pod, he watches himself age rapidly through one-point perspective. He knocks over a wine glass while eating, suggesting that man, no matter how advanced, will keep making mistakes. As he lays on his deathbed later, he reaches out to the monolith, alluding to Adam reaching out to God in Michelangelo's The Creation of Adam. After man is enlightened, he inevitably dies.<br><br>A pessimistic ending? No. Man is then transported back to Earth as a \"Space Baby\", an infinitely more advanced race, marking a new age of evolution. A masterful stroke of genius, Kubrick ends hopeful, giving us another chance to improve on our mistakes. Or is it hopeful? Is he implying that civilization is evolving badly? Or is he suggesting that civilization will NEVER evolve? There are multiple interpretations of the ending, and it's a question for you to answer.<br><br>There is such a great deal of symmetry in 2001's composition throughout the film, possibly suggesting the equilibrium present in the universe. The painstakingly slow pace also compliments the exactness of its harmony, practically forcing you to admire its artistry. While Andrei Tarkovsky's work would breathe with such organic and poetic beauty, Kubrick's artificial visual fluidity mesmerizes the eye with meticulous precision and thoroughness. Each shot, averaging 13.6 seconds, possesses a sense of purity and perfection that can only be achieved through the medium of cinema.<br><br>But of course, it's impossible not to talk about 2001 without mentioning one aspect. The visual effects are so unanimously praised that it's hopeless to even try to describe how groundbreaking and influential they were. Hopeless. I can talk for days about the impeccable zero-gravity effects, clever rotating sets, fastidiously constructed spaceships, the brilliant use of slit-scan photography for the psychedelic Star Gate sequence, or how it pioneered the use of front projection with retroreflective matting, but what's the point? You don't need me to appreciate 2001's immaculate visuals.<br><br>Finally, the choice of music is outstanding. Originally, Alex North was appointed to score the film, but Kubrick turned it down in post-production. Critic Roger Ebert explains it perfectly, \"North's (rejected) score, which is available on a recording, is a good job of film composition, but would have been wrong for 2001 because, like all scores, it attempts to underline the action-to give us emotional cues. The classical music chosen by Kubrick exists outside the action. It uplifts. It wants to be sublime; it brings a seriousness and transcendence to the visuals.\"<br><br>\"But why all the slow parts?\" asks the one who fell asleep. Primarily, to establish tone. Unlike the low-budget commercial science fiction movies preceding it, 2001 was meant to be taken seriously. It symbolizes a quest for whether God exists or not, challenges humanity's fate, and questions evolution as a whole. If each shot's average length was two seconds and there was some sappy romantic love subplot mixed in between, the whole film would've been a mess. Space isn't fast-paced like we see in most movies. Space is slow-really, really, slow. The addition of three minutes and seventeen seconds of a black screen in the beginning was also pure genius, a signal for casual moviegoers to get out of the theater now and save your time.<br><br>Thankfully, its ingenuity was gradually recognized, and it's now widely regarded as one of the greatest and influential films of all time. It stands at an impressive #6 on the BFI \"Sight and Sound\" Critics' poll in 2012, ties for 2nd in the Director's poll, places 15th on AFI's 100 Years... 100 Movies, and tops the Online Film Critics Society list of \"greatest science-fiction films of all time\".<br><br>2001: A Space Odyssey breaks almost every rule there is in filmmaking. The first half drags, the dialogue is unnatural, the static camera creates no visual interest, there are barely any emotional punches, characters are monotonous, and none of the protagonists, if there even are, have dimensionality, arcs or epiphanies. Nonetheless, it's transcendental and sublime, awe-inspiring and thought-provoking, visually revolutionary, technically impeccable, monumentally imaginative, substantially rich, and way ahead of its time, thriving with unparalleled originality and ambition.<br><br>Only a few films will live forever. 2001 is one of them. Happy 50th birthday.","user":"Wesley-Wang","rank":[429,505]},{"title":"Unmatched accomplishment","rating":10,"date":"17 June 2003","review":"Sometimes reading the user comments on IMDB fills me with despair for the species.  For anybody to dismiss 2001: A Space Odyssey as \"boring\" they must have no interest in science, technology, philosophy, history or the art of film-making.  Finally I understand why most Hollywood productions are so shallow and vacuous - they understand their audience.<br><br>Thankfully, those that cannot appreciate Kubrick's accomplishment are still a minority.  Most viewers are able to see the intelligence and sheer virtuosity that went into the making of this epic.  This is the film that put the science in \"science fiction\", and its depiction of space travel and mankind's future remains unsurpassed to this day.  It was so far ahead of its time that humanity still hasn't caught up.<br><br>2001 is primarily a technical film.  The reason it is slow, and filled with minutae is because the aim was to realistically envision the future of technology (and the past, in the awe inspiring opening scenes).  The film's greatest strength is in the details.  Remember that when this film was made, man still hadn't made it out to the moon... but there it is in 2001, and that's just the start of the journey.  To create such an incredibly detailed vision of the future that 35 years later it is still the best we have is beyond belief - I still can't work out how some of the shots were done.  The film's only notable mistake was the optimism with which it predicted mankind's technological (and social) development.  It is our shame that the year 2001 did not look like the film 2001, not Kubrick's.<br><br>Besides the incredible special effects, camera work and set design, Kubrick also presents the viewer with a lot of food for thought about what it means to be human, and where the human race is going.  Yes, the ending is weird and hard to comprehend - but that's the nature of the future.  Kubrick and Clarke have started the task of envisioning it, now it's up to the audience to continue.  There's no neat resolution, no definitive full stop, because then the audience could stop thinking after the final reel.  I know that's what most audiences seem to want these days, but Kubrick isn't going to let us off so lightly.<br><br>I'm glad to see that this film is in the IMDB top 100 films, and only wish that it were even higher.  Stanley Kubrick is one of the very finest film-makers the world has known, and 2001 his finest accomplishment. 10/10.","user":"simon_booth","rank":[1,1]},{"title":"My god, it's full of stars","rating":10,"date":"20 April 2003","review":"For all those bewildered by the length and pace of this film (\"like, why does he show spaceships docking for, like, 15 minutes?\"), here's a word you might want to think about:<br><br>Beauty.<br><br> Beauty is an under-rated concept. Sure, you'll often see nice photography and so on in films. But when did you last see a film that contains beauty purely for the sake of it? There is a weird belief among cinemagoers that anything which is not plot or character related must be removed. This is depressing hogwash. There is nothing wrong with creating a beautiful sequence that has nothing to do with the film's plot. A director can show 15 minutes of spaceships for no reason than that they are beautiful, and it is neither illegal nor evil to do so. <br><br>  '2001' requires you to watch in a different way than you normally watch films. It requires you to relax. It requires you to experience strange and beautiful images without feeling guilty that there is no complex plot or detailed characterization. Don't get me wrong, plots and characters are good, but they're not the be-all and end-all of everything. There are different KINDS of film, and to enjoy '2001' you must tune your brain to a different wavelength and succumb to the pleasure of beauty, PURE beauty, unfettered by the banal conventions of everyday films.<br><br>  \"All art is quite useless\" -  Oscar Wilde.","user":"drn5","rank":[1,1]}]