[{"title":"This is the real thing.","rating":9,"date":"24 January 2000","review":"If you want to see the Vietnam War as it was experienced by a real Platoon Leader, this is it. Authentic, down to the mannerisms, slang, terror and disillusion of it all, this film has none of the wierd phantasms of Apocalypse Now or the left wing political hype of Oliver Stone's Platoon.<br><br>Richard C. Caporiccio, LTC, US Army, Retired, former Platoon Leader, 3rd Battalion, 503rd Infantry (Airborne), LZ Uplift, Republic of Vietnam from Jan 2 to December 24, 1969.","user":"capo-4","rank":[34,44]},{"title":"Fairly Entertaining Stuff","rating":5,"date":"12 August 2003","review":"This movie is underrated probably because of the prejudices held by critics against Michael Dudikoff.  Though his acting is widely thought to be mediocre (it is), he shines in this movie.  \"Platoon Leader\" is gripping fare and deserves more respect than it currently garners.  It is not just another throwaway Vietnam movie.  It is, in fact, entertaining and is required viewing for any fan of action movies.  5/10","user":"actionpro","rank":[14,18]},{"title":"I can't believe Platoon Leader is rated 4.4!!","rating":9,"date":"21 December 2000","review":"First of all I'd like to state my opinion that this movie does not deserve the 4.4 rating that has been thrust upon it.  I read the book \"Platoon Leader\" by James McDoughal (I'm not sure if that's how you spell his last name), and it's one of the best \"Vietnam experience\" books I have ever read. Upon that note, I saw this movie at the video store and picked it up, not really knowing what to expect.  Well, let me tell you that this is one of the better war out there.  Especially when compared to a movie like Apocalypse Now (which is in my opinion one of the worst depictions of the situation in Vietnam ever produced).  It realistically depicts the trials of a new infantry platoon leader in Vietnam as he arrives fresh out of West Point and must quickly learn the ropes of being a PL and at the same time earn the respect of his men.<br><br>Bottom line: this is a damn good movie.  If you have any interest in Vietnam or war movies in general, I highly recommend it.","user":"XPunisher02","rank":[23,33]}]