[{"title":"You Say it Best, When You Say Nothing at All ...","rating":8,"date":"3 June 2001","review":"The magic, the heart of Say Anything, is that it dares to be normal. You remember the 80 teen romantic comedy genre. It was a nice idea that became an epidemic, but once and awhile there was a gem like Some Kind of Wonderful. But here is the major difference, the lack of cliche, the lack of formula, the lack of cute dialogue, and saying things without any words. Instead it is said with a look, a touch, a smile, and a tear falling down a face. It allows these talented young actors to _act_!<br><br>John Cusack plays Lloyd and it is the fact that Lloyd dares to be normal that explains why the film works. Lloyd is just a regular guy who dares to just call the beautiful class brain Diane (Ione Skye) after they graduate. It is the genuine \"niceness\" and persistence of Lloyd's phone call, that is responsible for her caving and saying yes. And it goes from there. What is a friendship, a respect for each other, grows into \"friends with potential\", and then goes even farther. Writer-director Cameron Crowe is famous for not pushing it and he perfected that style here. He doesn't try to make John and Ione look and feel \"hot\", he lets them continue to play young adults, who would by all rights still be awkward, nervous, testing the waters of life, love, and trust.<br><br>In a brilliant parallel, we learn of Diane's relationship with her father Jim (John Mahoney) which she has always been sure of, even when she needed to chose between her parents after their divorce. The subtle and detailed scenes between Diane and Jim are important to the twists in the story when Diane grows to trust someone other than her father and finds deceit with something she had faith in. Jim, is not your typical teen movie father. He's real and normal as well. His car is not backed into a house, he is not thrown into a great body of water, and he is not a typical ogre. He is allowed to be a three dimensional character, a driving force and an obstacle in the teen romance. Jim runs a nursing home and wants the best for Diane. He holds their relationship very dear, as it is all a part of Diane being the best she can be. That desire will end up being a double edged sword as Diane's growing pre-occupation with Lloyd the summer before she is set to go to England, threatens his plans for her. And although Jim seems to respect how Lloyd treats his daughter and him, he is bothered by Lloyd's lack of drive, that the only thing that drives Lloyd is the then almost unheard of sport of kick-boxing and Diane.<br><br>When the story comes to important moments that changes Jim, Diane, and Lloyd's world, this is when the story shines. This is when Lloyd's rambling and desperation to re-define his life due to his despair is a welcome change from the overbearing or over brooding of most teen flick \"heroes\". This is when Diane's confusion and discovery is so wonderfully done with little dialogue. This is when Jim, feeling his world is spiraling out of his control, grows quiet, and the power of un-showy direction from Crowe says all we need to see.<br><br>The supporting characters as well are gems, who are true supporting characters. Joan Cusack appeared uncredited as Lloyd's single mother sister who, once a blast is now uptight, but is still a supportive guardian for Lloyd. Lloyd's girl friends D.C. and Corey are like salt and pepper for Lloyd. Corey (played by Lili Taylor) is terminally depressed. She previously had attempted suicide due to fellow classmate, Joe, playing with her heart like a yo-yo and is always being the voice of negativity for Lloyd, always telling him what will go wrong, what can't happen, what should happen, and how he is different from Joe. D.C. is practically dwarfed by Corey, never being allowed to talk and never being able to steer Lloyd in a much more sane direction which Lloyd usually discovers on his own anyhow. All of the supporting characters of friends, former classmates, and residents at Jim's nursing home, are important, none are cardboard cut-out cliches. They all have dimension, depth, feeling, and we can understand their motivation, what drives them with carefully crafted scenes and dialogue.<br><br>When the ending comes, it is the subtle way they foreshadow the future instead of the standard frantic pacing most romantic comedies have when it comes to a conclusion. That in itself pretty much sums up the beauty of the film.<br><br>It is pure genius, this film is pure genius.","user":"Pam-21","rank":[98,108]},{"title":"Romantic Masterpiece","rating":10,"date":"12 November 2003","review":"I rented this movie solely based on the excellent reviews that it has gotten everywhere.  I missed it during its theatrical release (as so many others did) and had the hardest time finding a copy of it at our local video rental stores.  Not because it wasn't popular but b/c, according to the clerks, people kept stealing or \"losing\" their copies...especially around Valentines Day.  When I finally got my hands on a copy I was blown away.  I had thought this was going to be just another in a long link of Pretty in Pinkish movies with predictable characters and a bad case of puppy love, but what I got was a surprisingly refreshing, unconventional story with a complicated and well-developed emotional depth flawlessly captured by the actors and Cameron Crowe.<br><br>And talk about role reversals!  I'm so used to seeing the man take the assertive and mature role while courting a woman of limited financial or intellectual means...but in this film it's the girl that's got her future together and the guy who's more than willing to concentrate his attention on making her happy.  And Lloyd Dobler isn't just a shiftless man with no future.  He's an eternal optimist who lives in the present and recognizes, admires, and compliments the qualities in Diane that go beyond her amazing intellect.  She becomes his dare-to-be-great situation and his absolute love and devotion to her is anything but unmanly.  The force of it is palatable and immensely erotic without being reduced to cheap teenage lust.  The sight of Lloyd in the shadows defiantly blasting out the truth of their love through the boombox is a scene which would have seemed awkward and goofy in any other movie but this one.  It's easy to understand why even the critics of the time gave Say Anything two enthusiastic thumbs up.  This is one of the few films that really captures the feeling of love.","user":"saprater","rank":[125,142]},{"title":"It's a wonderfully written film, with equal acting, to remind us all of falling in love for the first time without all the hurt, mistrust and disbelief in oneself.","rating":10,"date":"18 April 2003","review":"A wonderful film which made me laugh, cry and heavily identify with the first time I ever saw it. Then, some 13 years later, after buying it on DVD with faded memories, I watched it again and it all came back.<br><br>I laughed; I was moved; I cheered inside when things went well for the hero, and I even remembered things about my first love. Especially the shaking with happiness moment (Judith). This film has survived 13 years with me, and it's not all down to my own memories.<br><br>John Cusack and Ione Skye give such wonderful performances that are so believable there's not a second that you're thinking of them as actors. Everything they feel and do seems so real. John Mahoney portrays the over protective Father very well, and his understated struggle when he realises this is superbly done.<br><br>Cameron Crowe has excelled himself in capturing the feelings and moments that you can so easily identify with to make them just right, and seem so natural.<br><br>It's a wonderfully written film, with equal acting, to remind us all of falling in love for the first time without all the hurt, mistrust and disbelief in oneself. It even manages to provide one of the best endings I've ever seen.","user":"Rich B","rank":[79,89]}]