[{"title":"Win, lose, what's the difference?","rating":8,"date":"22 November 2009","review":"Based around a screenplay written by the legendary Akira Kurosawa, Runaway Train simultaneously follows three threads. The escape of two prisoners, Manny &amp; Buck, who jump on a train only to find that the driver has a heart attack, thus it speeds out of control. Then there is the efforts of the train dispatching office to try and safely stop the out-of-control train. And also there's the hunt by the sadistic prison warden who is hellbent on recapturing the fleeing convicts.<br><br>Relentless and engrossing action film from start to finish, Runaway Train boasts two Oscar nominated performances from John Voight {Manny} and Eric Roberts {Buck} and no little intelligence with its well scripted characters. The opening quarter is pretty stock routine prison fare, these guys are tough, the warden is a bastard and we just know they are going to escape. But once the guys board the train the whole film shifts in gear and tone. The dynamic that exists between Manny &amp; Buck, partners but very different in life approach, is riveting stuff courtesy of the nifty dialogue exchanges. Things are further enhanced by the appearance of Rebecca DeMornay's also stranded railway worker, Sara, who far from being a shoe-horned token female character, is the crucial piece of the emotional jigsaw. He presence gives the guys room to exorcise their demons and pour out their feelings of anger, bravado and mistrust.<br><br>The action scenes are very well handled by director Andrei Konchalovsky and his crew. As the train hurtles thru the snowy Alaskan wilderness we are treated to a number of crash bang wallops involving the train itself; derring-do from our boys on the icy outside of the locomotive, and a helicopter pursuit chartered by the obsessed John P. Ryan as Warden Ranken particularly stand out. Bona fide action sequences that are executed skilfully. Then we get to the finale, a finale pumped up for emotional impact, both visually and orally it closes the film justly. We even get time for a bit of Will Shakespeare as we go about reflecting on what we have just witnessed. A fine movie it be. 7.5/10","user":"hitchcockthelegend","rank":[46,51]},{"title":"A modest masterpiece","rating":9,"date":"15 September 2005","review":"The stock title promises action and suspense, and we get that, but with a story by Akira Kurosawa, expert direction by Russian émigré Andrei Konchalovsky and superior lensing by Alan Hume, we get a study of what defines a man.<br><br>John Voight and the vastly underrated Eric Roberts play two cons who escape from a hellish gulag and board a train with no driver. Their struggle to stop the train and battle their own inner demons is the movie.<br><br>Konchalovsky creates a cold, alien, ethereal world inside the train that, in the oddest way, provides a haven for self-examination for the two leads. Rebecca de Mournay is layered into the mix, as is the indefatigable John P. Ryan as a prison warden who risks death to return his charges to custody, but the movie belongs to Voight and Roberts who both bring tremendous humanity to their finely sketched characters.<br><br>The final image is as powerful as cinema gets and marks RUNAWAY TRAIN as a modest masterpiece.<br><br>Though often criticized for producing cheap rubbish, the Cannon Group, in fact, also produced many fine films including this, 52 PICK-UP and MARIA'S LOVERS (also Konchalovsky).","user":"fertilecelluloid","rank":[124,150]},{"title":"a knock-out!","rating":29,"date":"29 July 1999","review":"Everything about this film has a surreal, visceral, in-your-face quality; the anguished, violent intensity of the prison scenes, the frozen wastelands of the lands outside the prison (gee, a metaphor?), the train -- not just a lifeless machine but a huge, juggernaut-like beast -- that the title refers to, the fierce, animalistic performance by Jon Voight, who plays the character of Manny with such raw emotion and conviction that at no moment do we doubt that he is anything other than what he appears to be on screen.<br><br>It's based on a screenplay by the legendary Akira Kurosawa -- knowing this makes a lot of the elements a bit more familiar; the snow, the hopelessness, the apocalyptic atmosphere -- and it's directed by Russian Andrei Konchalovsky, who after this film directed two Hollywood embarrassments called \"Homer &amp; Eddie\" and \"Tango &amp; Cash\" (apparently trying to corner the market on ampersands), and most recently helmed the acclaimed Armand Assante mini-series \"The Odyssey\" for television.  \"Runaway Train\" is not a perfect film, some of the minor supporting performances are really awful and some viewers may find Eric Roberts to be irritating, but the sheer kineticism, among the other stronger elements, makes it worthwhile.  Often called an intellectual action picture, it's more of an existential one, i.e. man versus a indifferent/hostile universe, etc.  Everything in the film has a greater, more universal meaning, and it's not rocket science to figure out what stands for what.  The simplicity of its metaphors doesn't dull the impact of \"Runaway Train\" as a sensory experience, though, because it's still pretty potent stuff.  Provided you're not completely close-minded, this is one you'll remember for a long, long time.","user":"Jaime N. Christley","rank":[50,62]}]