[{"title":"Classic Western Drama.","rating":8,"date":"12 August 2009","review":"Warner Bros. THE HANGING TREE (1959) is something of an unsung classic western. But over the years cultists have been drawn to it and it just gets better and better with each viewing! A \"sleeper\" of 1959, nobody thought it would turn out as good as it did. Based on a story by Dorothy Johnson it was fashioned into a splendid screenplay by Wendell Mayes and Halsted Welles. Gary Cooper headed a fine cast which consisted of Karl Malden, the strikingly beautiful Maria Schell, George C.Scott in his first picture and newcomer Ben Piazza (resembling a young Victor Mature). Produced by Cooper's own company Baroda Productions (named after the street where he was raised) it was solidly directed by the ever underrated Delmer Daves and as usual with Daves' outdoor pictures richly photographed in Technicolor, this time, by ace cinematographer Ted McCord (\"Treasure Of The Sierra Madre\"/\"Johnny Belinda\"). The lavish Art Direction by Daniel B.Cathcart was superb with a whole mining town built on locations near Yakima, Washington which would double for the mining fields of 1880's Montana.<br><br>The story revolves around Dr. Joe Frail (Cooper) who arrives in the rough mining town of Skull Creek to set up practice. Since the area is bereft of any sort of law enforcement the only deterrent to lawbreakers is symbolised at the town's entrance by the presence of a great ugly and ghostly looking tree complete with a hanging noose (\"Every new mining camp's got to have its hanging tree - makes folks feel respectable\" a new entrant declares). <br><br>The enigmatic doctor is a man with a hidden past! Stories abound about him years before setting fire to a house with a man and a woman inside (\"The woman was my wife and the man was my brother - and I have no right to forget\"). But in Skull Creek things are not working out so good for him in the new life he is attempting to carve out for himself. Firstly he falls in love with a beautiful Swiss immigrant Elizabeth Mahler (Schell) when she becomes his patient after being temporarily blinded by the sun. Then he falls foul of an unscrupulous and licentious town wastrel (Karl Malden giving an excellent performance). The picture ends with an exciting but bloody shootout and Frail being frogmarched by the townspeople to the hanging tree just before Elizabeth arrives and offers the mob her newly acquired riches of gold and even her goldmine to stop the lynching. (\"Know what? She wants to buy her man! If she wants him that bad let her have him\").<br><br>Adding immeasurably to the picture is Max Steiner's extraordinary score! It boasts a wonderful central theme for Doc Frail! Heard in different guises throughout the film it becomes a ravishing love theme and is touchingly rendered in the scene where Frail removes the bandages from the eyes of the blinded Elizabeth. Later when she stands on a cliff edge and opens her eyes regaining her sight for the first time Steiner's arresting theme makes it a remarkable sparkling moment! The great composer also provided some exciting action cues such as those for the townspeople pursuing a sluice robber and also for a stagecoach hold-up. A song by Mack David and Jerry Livingstone was sung over the opening and closing credits by Marty Robbins and was nominated for an Oscar. Steiner cleverly interpolated the song into his score and is heard to best effect in the final scene when Frail is being dragged to the infamous hanging tree.<br><br>THE HANGING TREE is a splendid drama in an unusual and atmospheric western setting. Eclipsing his Will Kane in \"High Noon\" Cooper gives one of his very best and most likable performances in what would be his final appearance in a western. A genre he made all his own! It would also be his third last film!<br><br>A FINAL AFTERTHOUGHT - IS THERE ANY ONE OUT THERE THAT MIGHT KNOW THE REASON WHY WARNER HOME VIDEO HAVE NOT RELEASED THIS FINE MOVIE ON DVD??","user":"jpdoherty","rank":[43,47]},{"title":"A Western gem","rating":9,"date":"24 May 2006","review":"Little known, this Western gem has not attracted the attention or appreciation it deserves. Gary Cooper's Doc Frail is to me the most interesting of his Western heroes, much more complex than the Will Kane of \"High Noon.\" He is a man of sharp contrast, kind but domineering, compassionate but unyielding, a healer but a killer, strong but at the same time frail. He draws people towards him, only to keep them at a distance when they get too close because of a tragic incident in his past, one he can neither forget nor allow to ever happen again. He is a vagabond, moving from gold camp to gold camp to set up his services as a doctor, without hope of ever settling down. Into his life come two key figures bound to change it. One is Rune, a young thief whom he rescues from the hanging tree, and they are bonded together. The other is Elizabeth, a young woman from Switzerland who has come with her father to find a new life in the gold camps. After a stagecoach accident, Doc Frail must cure her, both body and spirit, and she loves him for it, a love he cannot accept. He would send her back to her country; she stubbornly refuses and eventually partners in a gold claim with Frenchy (played by the marvelous Karl Malden), a man with lust in his heart for both gold and women. The emphasis on character lifts this film above the realm of the ordinary. Add to that a memorable title song sung by Marty Robbins, an appealing music score by Max Steiner, a no-nonsense script based on a story by Dorothy Johnson and on location filming in the mountains outside of Yakima, Washington, and what you have is one really fine Western.","user":"matchettja","rank":[40,47]},{"title":"A sadly overlooked classic western--one of the best!","rating":14,"date":"14 September 2002","review":"This movie should be right up there with \"High Noon\", \"The Searchers\", \"The Magnificent Seven\", and other classic westerns.  The cinematography and fantastic outdoor location alone make it a must see.  Gary Cooper plays a gun-toting frontier doctor, with a mysterious past, Maria Schell, a determined immigrant, who becomes his patient.  Karl Malden, a ruthless miner, who becomes her partner.  The supporting cast is excellent, including a very slender young actor by the name of George C. Scott, whose performance is compelling.  This is one of Cooper's last movies, and one of his best. I'm not really sure why, but this movie has not been enjoyed as much as it should, or received the praise it deserves.  If you're a fan of the genre, and you have not seen this movie, you owe it to yourself to check it out.","user":"rufus-t- firefly","rank":[36,44]}]