[{"title":"Long, tough documentary forces you to think about what happened during World War Two and how documentaries are made","rating":8,"date":"28 August 2005","review":"This is the story of Kenzo Okuzai a very strange man who is haunted by what happened back in New Guinea during the Second World War. What happened during the war was that while all the men were starving the officers had several soldiers executed on trumped up charges so that they could be used for food. This is a documentary about his long lonely crusade to put the souls of the dead to rest (ie.to give himself some peace of mind).<br><br>This is a very in your face film. Okuzai drives a car with a loudspeaker on the top and is covered with what I can only assume is an explanation of his cause. He challenges authority at every turn (he went to prison for shooting ball bearings at the Emperor... and murder) and does what ever he can to get his point across. Its makes you laugh and it makes you cringe (a case in point in the opening wedding ceremony where he gives a speech that is not to be believed, which is funny for what it says, but cringe inducing for when he says it). Okuzai forces you to consider how far would you go to correct a wrong that happened even 40 years before.<br><br>Watching the movie I was forced to reflect not only what it may have been like in the jungles during the war and what I would do to survive. What is the moral obligations we should follow when we are near death and trying to stay alive? The film also forces you to think about the role of a camera in the proceedings. We are with Kenzo Okuzai all along his odd trip as he attempts to comfort the families of the dead and as he confronts (and assaults) the officers who ordered the executions. There is no doubt that he is aware he is being filmed, so does that make him more or less confrontational? Is his behavior more or less genuine than it would be had the camera not been there? Its a tough call and as you watch it you really do have to reflect on what is the role of a film crew in filming actual events? Can we trust the actions of those being filmed? Its all something to think about.<br><br>If you get the chance see this film. Its an interesting look at a very odd man. I'm not sure that I liked Okuzai (which is the problem with the movie, he isn't really likable), but he did force me to think about life and film in several new ways.","user":"dbborroughs","rank":[29,33]},{"title":"*shakes head in disbelief*","rating":8,"date":"15 April 2000","review":"This guy is really something. A raving mad and very dangerous man, Kenzo Okuzai spares no effort to atone for his formerly sinful and wasted life. Sometimes accompanied by the relatives of two army officers executed on false charges, Okuzai confronts the six executioners and their commanders in their homes, without notice. He demands they tell the truth, physically attacks them when they are disrespectful, and offers to call the police if the man wants. All the while, Okuzai relentlessly pursues the truth, which is probably that the murdered men went straight onto the menu.<br><br>This doco is, by turns, sickening, fascinating, compulsive .... and excrutiatingly funny. Not easy to watch, but highly recommended.","user":"sharptongue","rank":[20,26]},{"title":"A lonely crusade to expose the truth","rating":10,"date":"29 January 2000","review":"Like \"Fires on the Plain,\" this documentary gives you the side of World War Two they left out of the John Wayne films. A Japanese war veteran is haunted by memories of fellow soldiers who were executed (and eaten!) by officers in New Guinea. Ironically, the officers used false charges that the soldiers were themselves cannibals as an excuse for executing them. The old soldier goes on a quixotic and unpopular crusade to bring the truth to light.","user":"mrreindeer","rank":[12,16]}]