[{"title":"Eerie, provocative thriller...","rating":9,"date":"6 September 2005","review":"New to a seaside village, a young girl and her poet father seem to live an isolated existence, until curious neighbors get nosy and always seem to find the fiercely independent girl on her own... Unwisely advertised as a horror movie, \"Little Girl\" is instead an amazing psychological thriller, rich with atmosphere and featuring a lead performance by Jodie Foster that is deft and incredibly assured. The sequence where Foster, troubled by the sickness of a friend, eats alone at a hamburger counter (actually, she hasn't touched her food), then wanders down the street studded with marquee lights has to be one of the most beautiful Foster moments put on film. Well-directed and written, the movie is very cognizant of the way adults condescend to or ignore children, and allows leading character Rynn to use her intelligence as a tool--and maybe a weapon as well. Those looking for slasher-type jolts may be disappointed with the picture; it's more subtle than something like \"Halloween\", creating suspense out of tension and mood instead of outré violence. Foster was at a personal peak at this time in the movies, having just completed \"Taxi Driver\" and \"Bugsy Malone\". This isn't the harrowing character study of \"Taxi Driver\", but it is a remarkable portrait of a terribly uncommon child dealing with very grown-up issues. Due out on DVD in October 2005.","user":"moonspinner55","rank":[77,86]},{"title":"This little girl can look after herself just fine, thank you.","rating":9,"date":"24 June 2006","review":"Rynn Jacobs is a lonely, but well equipped 13-year old girl who lives with her poet father, while keeping a dark secret in the cellar. Although whenever somebody dropped by she would tell him or her that her father was too busy to greet his or her guests, or that he was out of town. But her life in solitaire is interrupted when she gets a visit from her snoopy landlady and her perverted son who takes a real shinning to Rynn. This is when Rynn goes to any lengths to keep this lifestyle with the help from a local crippled boy Mario, to herself.<br><br>This noteworthy gem of small-scale, mystery-thriller incorporates a fascinating slow-drifting character study that has certain believability in its characterizations and manipulative suspense. The macabrely, lurid context of the film could have over-step the mark, but it keeps it mostly under-wrapped with it being more hinted, than aiming for anything really illustrative. But that in mind, it doesn't lose any of that unnerving effect that's spun out, because the confronting performances and crafty dialogues are extremely effective in underlining the disquieting horror that lurks within the film's make-up. What sweeps you along is that the script is lyrically dense and quite thoughtful, while it still generates psychological tension in certain scenes without needing to go out with a bang. There's nothing big or powerful about it, because it plays it cards close to its chest and grafts away with it's involving story and sedated handling. The compelling plot is incredibly well defined by touching on many different aspects that Foster's character encounters. These range from loneliness to her approach on life through an adult perspective and finally that of her estrange relationships with some of the town's folk. It's all about her finding her feet and living her life the way she wants to without the intrusion of others (the adults) enforcing their resolutions onto her because she's \"just\" a child. Life is what you make it and she's not going to play their game. It's just really hard to categorise this unique film (which, was originally intended to be a TV movie), because it goes down oh so many paths, but it's successful in gelling them together.<br><br>Jodie Foster in the lead role makes the character her own by providing a maturely astute performance as the independent girl Rynn Jacobs. Her professionalism really does take hold in this picture and she does so with great control. Martin Sheen is equally as good and believable by playing his villainous character in a very subtle way, but still able to bring a creepy and vile presence to this predator Frank. Scott Jacoby is likable as Mario; Alexis Smith is great as the intrusively stern landlady Mrs. Hallet and Mort Shuman as the caring local officer gives a moving performance. What makes these performances so great is that they have vivid characters to feed off and shape.<br><br>Since it was intended to be a TV movie it does feel and look like one, but none of that took away from the elegant looking production. You could tell it was low-key because most of the film did take place in or around Rynn's isolated house. The direction by Nicolas Gessner is carefully crafted and from the outset he paints a mysteriously brooding atmosphere. The simple layout of photography is crisp and beautifully demonstrated. While, the stirring score is quite a strange one with it's heavy handed approach, but it has some sort of a hypnotic trance because it likes to play around with the moody and quite edgy situations.<br><br>This under-appreciated find of the 70's is a surprisingly focused and innovative treat that grips you from the very opening.","user":"lost-in-limbo","rank":[53,59]},{"title":"Not Your Typical Story Line! What a Terrific Off-Beat Thriller.","rating":9,"date":"18 July 2000","review":"Great Suspense and Atmosphere. This movie instantly became one of my all-time favorites and is difficult to describe without giving too much away. More than most movies I can remember, reading too many comments about it's content beforehand can detract from the viewing experience (and a great one at that!) and ruin the suspense. I will try not to give too much about the film away beforehand.  <br><br>First of all, I loved the production quality, atmosphere and locale. It would be a great movie to see on Halloween night for example, at least in my opinion. It really can be watched anytime however and will be just as great. The acting was high quality, all the way around but especially with Jodie Foster and Martin Sheen and the direction and score are excellent as well.<br><br>I had a problem with the plausibility of Jodie Foster's character behaving essentially as an adult. It was a little tough for me to buy into a 13 (or newly turned 14 year old) cooking gourmet meals, serving fine wines, listening to Chopin and generally acting much older than her chronological age.   <br><br>Even taking into consideration the events in her life which apparently had shaped her personality, she seemed too mature for her age. If you put that concern aside however and accept it as a given premise of the movie you can sit back and enjoy the fun of trying to figure out what's going on.<br><br>And trying to figure out what's going on really *is* fun in this movie. Figuring out what's going on with her mysterious father is enough to keep you occupied in itself (if you think you've figured out what's going on with him you will find later that you probably haven't) and that's only one aspect of this complex scenario.   <br><br>I hate when movies this good are not in general circulation any longer. Brian de Palma's \"Sisters\" and many other excellent movies also fall into this category. I can't figure out why studios can't figure out ways to continue to make them available to the public, after all...they went to the trouble to make them in the first place.<br><br>If you do get a chance to see \"Little Girl Who Lives Down the Lane\" however, jump at it. You aren't likely to be disappointed.","user":"Scot6","rank":[68,78]}]