[{"title":"A Picture is Worth a Thousand Bullets","rating":8,"date":"6 May 2006","review":"Two traveling salesmen (guess who) arrive in the lawless frontier town of Wagon Gap where the outlaw boss Gordon Jones and citizen's committee head William Ching are in a power struggle. Poor inept Costello winds up getting framed for a murder and he and Abbott are both about to be hung when Ching discovers a law in Montana Territory about a man who causes the death of another is responsible for the deceased's debts and family. Costello takes the responsibility.<br><br>He soon thinks capital punishment even the extralegal kind might be preferable to dealing with Marjorie Main and her squalling band of kids. Think of Costello inheriting the Kettle clan if Pa Kettle had met his demise at Costello's hands and you have some idea what Costello is going through.<br><br>But quite by accident it's discovered that Costello has carte blanche in Wagon Gap because no one wants to see any harm come to him or else they might inherit Marjorie Main. Costello carries a picture of her and the clan close to his heart and it's more valuable than a Sherman Tank would have been. He has a very funny scene cooling down a town drunk played by Dewey Robinson after he's made sheriff.<br><br>Marjorie Main with her own brand of rustic humor does not yield the film to Bud and Lou. You might also like the performance of George Cleveland as a judge not unlike Samuel S. Hinds in Destry Rides Again.<br><br>In fact the whole film has a lot of similarity to Destry and no surprise there since this was originally supposed to be a more serious story that was to have starred James Stewart. When he passed on it, it was rewritten for Abbott and Costello.<br><br>The Wistful Widow of Wagon Gap should appeal to both fans of the Kettle family and those of Bud and Lou. Between them they accounted for a big portion of what counted as profits for Universal Studios.","user":"bkoganbing","rank":[7,7]},{"title":"Definitely one fans will enjoy but also good enough for the casual viewer","rating":9,"date":"9 December 2009","review":"When travelling salesmen Duke and Chester are found guilty of a murder they did not commit, they face a choice between hanging or being responsible for picking up all the dead man's debts and responsibilities. Of course they pick the latter but they didn't reckon for the size of the dead man's family or the veracity of his widow. This is the setup for the film and, having seen a lot of \"formula\" Abbott &amp; Costello recently (the \"lead\" cast have a romantic plot of sorts while A&amp;C do the comedy parts) I was interested to see a film where they were the main players for all of it.<br><br>The result was actually one of their stronger films as the comedy is well mixed with the plot (such as it is). This means we don't have the usual reliance on wooden actors to keep the plot moving or musical numbers to fill the time out (both normal devices in these films). The laughs come from pratfalls, double-takes and clever dialogue and I must confess I was surprised by how easy the film was to enjoy. The plot is not that great but at least it is consistently moving without the stuttering effect that the other formula would often produce (wooden scene followed by funny scene) and it has much more of a flow to it than some of their films. Both Abbott and Costello are on good form and working well together but the real bonus is the casting of Main, who, from the tagline, must have been well known at the time (I know she is Ma Kettle – I just have no idea of those films whatsoever). She is great fun and she works very well with Costello in particular. The support cast are solid as they allow the stars to play off their support and generally everyone does what one would expect from them.<br><br>For some reason I had low expectations for this film (perhaps the title and that I'd never heard of it) but the reality was that it was a very enjoyable film from Abbott and Costello. By having them in the front of the plot the stuttering is gone and the film flows much better than some of theirs, while the laughs are fairly frequent and come from a range of types of humour. Definitely one fans will enjoy but also good enough for the casual viewer.","user":"bob the moo","rank":[5,5]},{"title":"Costello does a Sheriff in Drag Arresting The Bad Guys in Stitches","rating":7,"date":"21 August 2008","review":"This Abbott &amp; Costello outing is definitely a very much formula Comedy Western done in the late 1940's when all the movies were pretty much formula. Director Charles Barton who worked with the boys more than any other director does pretty well here. Barton never became a household name as a director but anyone who is a fan of the team knows his name was the most frequent one with them.<br><br>The best thing about this film is Marjorie Main. She is a major addition to a cast which includes Gordon Jones. Marjorie does comedy well including her Ma Kettle films but in this one she plays off and supports A&amp;C just fine. She is the Widow here and as in the case of the Kettles has a big household of young ones. This is very much in her element of comedy.<br><br>While Abbott &amp; Costello do not get a lot of verbal comedy in this, there is enough of them for their fans. Some of the special effects used we OK then but look dated now. At least there is not a lot of musical interruptions to annoy the viewer in this one. Overall, this one is much better than their worst outings.","user":"DKosty123","rank":[4,4]}]