[{"title":"Haunting dreamlike story of passion set in a small southern town-actually this movie is magnificent.","rating":10,"date":"17 August 2003","review":"WARNING-SPOILERS THROUGHOUT!!<br><br>One in awhile a motion picture comes along that, while not Oscar material, makes it's mark as unforgettable. This was definitely such a movie.<br><br>The story centers on April(Sherilyn Fenn) a rich southern belle engaged to a preppy southern boy who then meets Perry a drifter/carnival worker(played to perfection by Richard Tyson) and falls head over heels for him. There are thousands of movies made every year with a familiar theme like this. But there is something special and really unique about 2 moon junction that makes it a cut above the rest.<br><br>Besides having two absolutely magnificent looking stars two moon junctionalso has atmosphere, sensuality and a great supporting cast including an appearance by Kristy Mc.Nicol. Never boring, the movie is set in a small southern town and manages to capture to a tee, the luminous beauty of the south. Besides it's lovely southern feel, the film has an electric sensuality about it, that coupled with a certain dreaminess, a mystery in most every scene makes the picture irresistible. I'm not a major fan of movies like this but two moon junction was an amazing pic that never received much recognition beyond the \"it's hot\" type.<br><br>I don't know why Fenn and Tyson never became big stars. Both were made for these roles and have an on screen chemistry that contributes a lot to making this movie unforgettable. In fact they are so believable and the chemistry so apparent early on, that the audience is rooting for them from their first meeting. The rest of the cast,particularly an amazing, sassy, Christy Mc.Nicol, and a scheming Louise Fletcher were great too. There is a type of dream like, quiet to this movie, every scene is pivotal to the ultimate ending, the only gripe I have is the ending which while alright was to quick and could have been expanded on a little. Still, this movie(easily) gets a 10 of 10. <br><br>Through the years, whenever myself and my fellow movie goers turn somebody on to this film inevitably the same thing happens. They, at first don't want to watch it, then after viewing it, like it so much that they want to see it again. Says a lot about the picture....<br><br>Anyone who has ever loved with a kind of mindless passion will be able to relate to this. The magic of the film is also in turning everyday things into objects of mystery. (Look at what they do with a simple carnival!)Many may not agree with me, but I give it 10 of 10-easily. They took a subject matter that has been done over and over again and turned it into something with mystery and intrigue.","user":"triple8","rank":[37,38]},{"title":"A good old fashioned bodice ripper!","rating":9,"date":"9 April 2002","review":"Okay, let's take this movie for what it is -- a bodice ripper romance novel put on the screen for you to enjoy.  It's hardly anything more than that, but does it have to be?  The film is set in the \"deep south\", but the faulty accents and in-and-around LA locations sometimes give it away.  It's a highly stylized exercise in melodramatic erotica.  There's no mystery here -- even the ending can be seen coming a mile away!  Basically the plot is a Southern Belle sows her wild oats before her wedding, and finds herself torn between sensuality and stability.  She meets a carny who offers her one last hot fling before she marries her boring college sweetheart.  Which one will she chose?<br><br>What's to like?  Sherilyn Fenn is radiant as April, and overcomes most all of the bad dialogue. She's a great actress! Kristy McNichol steals the few scenes she is in with a flair for comedy and easy earthy sensuality!  Why is she not doing more?  Richard Tyson plays a rough and tumble drifter carny who gets to pout and preen as a male \"himbo\" who is justly portrayed as good at one thing.  The plot is silly, and you even get an over-the-top Louise Fletcher appearing as the matriarch who knows all too well that \"lust fades, but financial security is worth everything!\"  <br><br>I love this movie though.  It is charming in its own way, and sensual without being too graphic.  Nothing is subtle, but it pays off as one of the most enjoyable Zalman King outings ever!  Notice the almost \"ALL WHITE\" costumes!  These people spend a fortune on bleach.  Notice the hottest scene seems to be when Sherilyn Fenn and Kristy McNichol dance together on a deserted jukejoint floor.  Notice the great soundtrack!  Let yourself go, and enjoy an old-fashioned pot boiler romance filmed and acted better than it ever had a right to be.","user":"BrettC","rank":[30,32]},{"title":"Silly but I think I took it too seriously","rating":6,"date":"22 November 2006","review":"Southern belle April Delonpre (Sherilyn Fenn) is out of school and all set for a prearranged marriage with Chad (Martin Hewitt). However she meets Perry (Richard Tyson) who is low class and works with a carnival. They start having sex and falling in love and April's family is horrified...<br><br>Basically an R rated porno film for guys--there's plenty of nude shots of Fenn but very few of Tyson. I hated the film but I actually thought this was going to be serious. Obviously it's not. While the sex scenes are pretty hot and Fenn and Tyson have great bodies, the dialogue is pretty lame and the story has been done many times before. The acting is OK and Kristy McNichol throws in an amusing little performance (and goes topless too).<br><br>So as a silly little sex film for guys it works. It's gets a 6 for the attractive leads, some nice cinematography and the sex. Just don't take it seriously.","user":"preppy-3","rank":[27,30]}]