[{"title":"Karloff at his very best","rating":16,"date":"16 June 2005","review":"Val Lewton's THE BODY SNATCHER is one of the most \"literate\" films in the horror genre. Based on a short Robert Louis Stevenson shudder tale, it is the story of a young medical student, Fettes, in 1820s Scotland. Fettes is a promising doctoral candidate who has taken on an apprenticeship of sorts with a Dr. MacFarlane, a prestigious physician who runs a medical college. Todd MacFarlane is a very talented medical scholar of the academic sort, whose own past is tainted by an earlier acquaintance with the grave robbers Burke and Hare, who provided human specimens to his mentor, a Dr. John Knox.<br><br>Haunted by his past, MacFarlane is tormented and blackmailed by a \"jack of all trades\", a cab-man and grave robber John Gray. Gray, a working class man from the most impoverished sections of the urban poor, takes great delight in this power, and lords it over MacFarlane's household, which includes the doctor's wife- also privy to MacFarlane's secret- who poses as MacFarlane's housekeeper, in an awkward attempt to hide the roots of MacFarlane's own social climb. MacFarlane is also in need of Gray's continued \"services\", which Gray attends to with a sardonic relish. The younger medical student Fettes is pulled into the secrets of the household, which in the end, devour MacFarlane and his efforts to survive in the class structure of Scotland.<br><br>With THE BODYSNATCHER, Boris Karloff displayed his true depths as a performer, and outside of his original performance as the Frankenstein's monster and perhaps Columbia's THE BLACK ROOM (1935), there are few other films in his immense resume that really display what he was capable of as an actor. In THE BODYSNATCHER, he is at the top of his form. He is supported by actors Henry Daniell, Russell Wade and Edith Atwater, and the movie also marks his final appearance with Bela Lugosi. All of Val Lewton's technique is brought to bear in this work to offer the audience effective atmosphere, and tight pacing under the direction of Robert Wise. All in all, it is a remarkable work, an impeccable contribution to the genre that calls itself horror.","user":"oyason","rank":[54,56]},{"title":"One Of Karloff's Best!","rating":29,"date":"29 June 1999","review":"One could easily argue, as I surely will attempt to do so, that this film, The Body Snatcher, based on the classic story by Robert Louis Stevenson and produced by the wonderfully creative and inventive producer Val Lewton, is the home of Boris Karloff's best performance.  Some will argue that his portrayal of Frankenstein's creature was his greatest role, and I would not argue with that.  But his role as Cabman Gray is his best performance as an actor.  It gives us a chance to see the real Boris and his entire acting range.  He plays with  relish a character wicked as can be , yet full of contradictions.  This villainous rogue that steals bodies from graves and then creates bodies through murder is given an amiable side.  He is the most interesting character in the story.  He is the core of the story, and it is all due to Karloff's wonderful and witty portrayal.  The story is excellent as our the other actors in the film, most notably Henry Daniell as the doctor abused and tormented by Karloff and past secrets.  Although this was the last film to have both Karloff and Lugosi, it is a lopsided affair as Lugosi is given very little screen time and an even smaller role as a blackmailing servant.  The best scene with both of them is the murder scene of Lugosi's character, and it is one last glimpse of the two great boogeymen sharing the screen once more together.  Outstanding film, competent direction, and excellent acting make this film one of the better horror films of the 40s and one of Karloff's finest moments on the screen period.","user":"BaronBl00d","rank":[46,48]},{"title":"Craftsmanship at its best.","rating":28,"date":"28 October 2003","review":"SPOILERS.<br><br>You don't really want to miss this one unless you've been weaned on Arnold Schwarzenegger action movies or Nightmare on Elm Street, Part Twenty, the PreSequal. There is horror galore but served up with frisson.<br><br>One can't help admiring Val Lewton and his crew at RKO, working on tiny budgets, but producing miniature gems. It's like painting a masterpiece on the head of a pin. Robert Wise was his director here but the credit goes mainly to producer Lewton, the Russian master of Who Torok. Lewton was insistent on authenticity. The songs we hear are contemporary Scottish folk songs and the wardrobe as close to the real thing as they could get. And Lewton saw to it that \"reality\" was evoked by small items from the prop department and small incidents on screen. At night, for instance, in order to see something in a dark basement, the doctor calls out for someone to bring a candle. In a less thoughtful movie the deserted basement would have a couple of lanterns already lighted, or the set would be brightly lighted with no visible lanterns at all. A small thing, as I say.<br><br>But it's not just historical accuracy that makes Lewton's RKO pictures so appealing. His plots are rooted in time. And his scripts are -- how can one put this without sounding snotty? -- \"literate\". (\"Oh, how we cozzened them!\") I don't know how closely the dialogue sticks to Stevenson's original story but it works very well, partly because the actors are so competent. Stealing the dialogue isn't necessarily a bad thing when the words are good to begin with. John Huston lifted most of his dialogue for \"The Maltese Falcon\" directly from Hammett's novel. And Shakespeare ripped off whole sections of Plutarch's \"Lives\" for \"Julius Caesar.\" Henry Daniell, like Robert Douglas, later became stereotyped as heavies in Errol Flynn swashbucklers, but Danielle has a far more complex role here -- proud of his medical skills but driven insane by that pride. The accents are mostly American, alas, but the performers at least LOOK right.<br><br>Then there is the plot. I know it sounds odd in a producer of horror movies but Lewton was a man of good taste. Driven to find a dead body to sell to Daniell, Karloff decides to murder a sweet-faced young blind girl who is a street singer. A modern movie would give us a bathtub full of blood. Here's what Lewton does. The little girl walks alone down a deserted cobblestone street at night, singing a melancholy tune as she goes. The camera is held on her as she walks under a bridge and disappears in the darkness on the other side. Without any cuts, Karloff's horse and coach enter the frame, plodding slowly along in the girl's wake. The coach disappears into the same darkness under the bridge. We hear the girl's carol cut off at the end of a note with a slight squeak. End of shot. It's a far more moving moment than a dozen multiple on screen slashings and throat cuttings and we haven't seen any of it.<br><br>The ending, however, is fairly explicit. Daniell, now mad, gallops furiously through the rainy night along muddy roads, the recently \"resurrected\" dead body bouncing along in the seat beside him. Instead of the dead woman he has just disinterred, the body is now that of Karloff, revealed only when lightning blindingly illuminates the crazily rocking coach. <br><br>\"The Body Snatcher\" doesn't have the easy shocks of some of Lewton's other works, like \"The Curse of the Cat People,\" no \"buses\" as Lewton called them.<br><br>But there is a sense of evil throughout, or let's call it corruption, and it grows as the film moves quietly along. In its own way it's the equal of anything Lewton did before or after. <br><br>Outstanding.","user":"rmax304823","rank":[57,63]}]