[{"title":"Too Much Marriage","rating":10,"date":"29 October 2003","review":"Alec Guinness made a few silly comedies and \"The Captain's Paradise\" is the best.  Mr. Guinness portrays an international naval captain who is married to two different women at the same time:  Celia Johnson as your average housewife and Yvonne De Carlo as your average sexpot. The captain believes he has the perfect life with each wife until he finds out that he doesn't.<br><br>\nIt is an adorable movie.  Very funny!  It read Mr. Guinness enjoyed working with Ms. De Carlo, whom he respected.  She taught him to tango for their dancing scenes.  This is Ms. De Carlo's best role.  Also, this movie gives Ms. Johnson a chance to be funny.  She usually is sad in her early movies.","user":"smithy-8","rank":[31,34]},{"title":"A piece of paradise","rating":9,"date":"2 April 2005","review":"This film is a treat! It is the tale of an English sea Captain (Alec Guiness) who thinks he has devised the perfect arrangement for paradise. He has a wife in two ports - each one half his idea of the perfect woman. His English wife (Celia Johnson) is the dutiful, domestic wife, whilst his Latin wife (Yvonne De Carlo) provides the excitement which he craves. All three play their roles well - Alec Guinness is a delight to watch, making you root for him and at times losing sympathy for him. The two wives appear to be stereotypical characters - but neither is quite as they seem! The script is witty and perceptive and the plot always engaging. I can recommend setting sail for the Captain's Paradise!","user":"LDRose","rank":[24,26]},{"title":"A element of paradise not to be overlooked","rating":8,"date":"19 January 2007","review":"News today of the recent death of Yvonnne De Carlo brings this movie back into my mind. I saw it during a period of my life when I had for several years had few opportunities to go to the movies. I had been a student priest in Rome and movie houses were off limits for us. Away on summer holidays in 1953, I caught up with the movie at a cinema in Vienna that was showing English language movies for the benefit of the English military personnel, part of the post World War II occupation force in the Austrian capital. I was allowed to sneak in.<br><br>But quite apart from the fact that it was a welcome interlude in a period of drought in my movie watching life, the movie remains in my memory as one of the cleverest comedies I have seen. Not side splitting, it is true. But excellent English wit. And the final scene is unforgettable.<br><br>The movies is entitled \"The captain's paradise\" Reading the IMDb user's comments, I see they correctly note two reasons why the ship captain's life style was a paradise. His homely English wife in Gibraltar and his party going Spanish wife in North Africa. But there was a third element that none of them seem to note as a factor in the captain's happy situation. At sea, at meal times women are rigidly excluded from the captain's table. Those seated with the captain are diplomats, explorers, scientists and suchlike. All of them males. The third paradise element in the captain's life is the enjoyment of male company and conversation at meals. This link with the film's title needs to be remembered. No wonder the script received an Oscar nomination.<br><br>There is one aspect of the movie on which I would like another viewer to enlighten me. How did Yvonne De Carlo come to be in this very English movie ? Today after hearing word of her death I looked in IMDb at her listed appearances. From being Moses' wife in Ten Commandments to being the mother in The Munsters, pretty well every role seems to be in a United States production. How did she find her place in a Ealing comedy? But at least it was a most welcome appearance and I am glad she hopped the Atlantic for this one.","user":"holy1","rank":[23,25]}]