[{"title":"Enjoyable","rating":11,"date":"11 July 2002","review":"I saw Conquest of Space as a 6 year old when it was first released.  I was impressed with the Space Station, the Mars Rocket, the space walks and the landing on Mars.<br><br>I saw it again when it re-released in the 60's.  I was older (teenager) and I was still impressed with it.  The Mercury and Gemini programs were in full swing and I was looking forward to the establishment of a space station as a stepping stone to the conquest of space.  The space ships were a little dated compared to what was actually being used.<br><br>I noticed the plot beyond the space ships.  (1)  The crew was right out of the Air Force movies of the 1940's and 1950's.  (2) An Japanese-American was one of the crew: he hoped that with the resources they might find on Mars that the nations of the world could put an end to war.  (3)  The Commanding Officer was a little on the strange side about the exploration of another planet.  My mother voiced pretty much the same thing: man wasn't supposed to mess around in space; that was God's domain!  (4) The Sergeant was a typical Sr. NCO (Non-Commissioned Officer): loyal to the Chain of Command.  (5) Just when things seemed to be working (growing the first plant on Mars) nature did it's best to upset everything.  (6) The mission was accomplished with a minimum of casualties (2 dead) and the rest of the crew returned to base.<br><br>I got to see it again on the big screen (IMAX) in the 1980's when the Air and Space Museum (Washington, DC) showed it as part of a series of films on Science Fiction.  Also included in the series was Forbidden Planet, 2001, Star Trek: the Wrath of Khan, and the original Star Wars.<br><br>This time I noted the special effects: very good for that day but a little dated by 1980's and today's standards.  Imagine what George Pal could have done with CGI!<br><br>I recorded it years ago when it came on cable and took the commercials out. I've let my two sons (ages 7 and 4) see the movie.  They like it almost as much as Star Wars.  And it's a whole lot less violent!","user":"samos","rank":[34,38]},{"title":"HOW THE FUTURE USED TO BE!","rating":7,"date":"23 November 2000","review":"Disregard the critics on this one.  This unpretentious film has much to offer on many levels.  First of all, the acting is very good, especially from first time non-actor Phil Foster, whose primary occupation was that of a 'stand up' comedian.  <br><br>Also, the performance of the highly under appreciated character actor, Walter Brooke, is a winner. Brooke is believable as the General in charge of the Mars mission, whose mental fabric is rapidly deteriorating under the pressure of evolving religious misgivings about the divine role of humans in space.  This challenge to religion, within the framework of a science fiction film, was quite daring for the time.<br><br>Although not one of Director George Pal's best, the film, nevertheless, affords an informative and highly entertaining look at how the \"future used to be\", as viewed by the 50's generation.  And incredibly, among all of the things they got wrong, how very much they got right.","user":"sataft-2","rank":[37,42]},{"title":"Not quite a classic, but a must for George Pal fans","rating":26,"date":"26 March 2000","review":"Conquest of Space is certainly worth a look for anyone examining the more realistic (at least at the time) cinematic examinations of space exploration.  The space \"wheel\" scenes might be viewed as primitive precursors to the station in 2001.  The acting and script are typical of the era--the comic relief in particular is grating at times.  But the effects are well-done, especially shots of approaching rockets viewed from space, and meteoric fragments which bombard a hapless spaceman.  A minor effort next to Pal's other films of the period, but not a bad way to spend an hour and a half.","user":"newfunk-2","rank":[15,16]}]