[{"title":"Desperately needed some editing","rating":6,"date":"17 December 2001","review":"Child abuse, the trampling of Indian rights, prejudice, illegal FBI wire-tapping and subterfuge, television exposes, campus shootings by the National Guard, the Mi Lai massacre, culture clashes, Jungian philosophy, police brutality, government corruption, karate, guns, and a spiritual journey are just some of the subjects explored in this sequel to Billy Jack. Surprisingly, despite the title, this is not a courtroom drama. The film is told in flashback, and the trial is over rather quickly. Instead, it's an angry film that was finished shortly after several of the campus killings (ie, Kent State) and Watergate. Most of the film's events and anti-government sentiment were taken directly from the events of the early 1970's. <br><br>The director's commentary on the DVD is very interesting, and my favorite discussion is when Tom and Delores acknowledge they \"threw in everything but the kitchen sink.\" They both wish they had reduced the exposition and some of the plot lines, which would have certainly made it a better film, but they were being true to themselves at the time. Unfortunately, this makes the film too long and too preachy, but I still enjoyed it.","user":"walward-2","rank":[28,32]},{"title":"Billy's back","rating":5,"date":"9 November 2013","review":"After the first Billy Jack movie where he went to prison for five years for involuntary manslaughter the freedom school that Delores Taylor was building on the Indian reservation has expanded quite nicely. There are a whole lot of young people of all kinds now living there and attending school and absorbing the radical ideas as the locals see it of the school.<br><br>And the school has done one thing more. They have a pirate radio station on the reservation and are doing all kinds of exposes that some of the powerful locals aren't crazy about. The maddest of the lot is Riley Hill who is the brother of Bert Freed who was the owner of the local Ponderosa in the first Billy Jack movie. Freed moved away after the death of his son, but Hill is the local banker and that position gives him leverage on a lot of the locals.<br><br>Poor Taylor whose passive non-violence is being put to some stressful tests in this film as it was in the last film is caught in the middle. And Tom Laughlin is off on a vision quest not be disturbed. That gives the bad guys a chance to do their worst. Which leads to a horrible Kent State like confrontation at the school on the reservation.<br><br>This film could easily have told the story in a third to half of its running time. But I suppose producers Laughlin and Taylor couldn't bear to cut a single frame. It really dilutes the story and blunts the impact of the climax.<br><br>Still Billy Jack's fans should like The Trial Of Billy Jack.","user":"bkoganbing","rank":[5,5]},{"title":"terrible,....and a must see film!","rating":2,"date":"6 June 2005","review":"This is one of the BAD films I really enjoy. It is not painful or boring to watch but instead falls into the hokey and stupid category that make it great party film. Like Plan 9 from Outer Space, this movie tries so hard to say something and comes off as a completely laughable fiasco. The over-the-top completely serious aspects of the movie raise it to this level. The movie The Apple also rises (?) to this level of dreck as well.<br><br>Our hero (?) is Billy Jack, a half-breed American Indian who teaches peace through the repeated use of bone-crunching violence! It reminds me of the funny segment from the movie UHF when they advertise the fake movie \"Gandhi 2\" and feature Gandhi kicking butt and driving a sports car. It's so ridiculous, it's great! Amazingly enough, this was the third Billy Jack film (after The Born Losers and Billy Jack) and the first to bomb at the box office. In fact, the also deadly serious Billy Jack (1971) made zillions at the box office--not because it was a good film (though it wasn't quite as bad as The Trial of Billy Jack) but because it was a perfect film for the times. The hippy-ish aspects of the movies worked in 1971 but by 1974, it was reduced to a cliché.<br><br>A moment not to be missed in this movie--the little boy with a mechanical claw for a hand being gunned down by the evil soldiers as the boy tries to rescue his pet bunny! Meant to be poignant, it's just hysterically funny instead!<br><br>FYI--This film had the dubious distinction of being selected for inclusion in the book \"The Fifty Worst Movies of All Time\" by Harry Medved. I heartily agree with the choice--but must admit it gets a 2 because it's so darn funny--and it doesn't even intend to be!!","user":"MartinHafer","rank":[36,53]}]