[{"title":"The Mummy's Ghost: Consistently passable","rating":5,"date":"16 May 2018","review":"The Mummy's Ghost is the third of four movies in the original \"The Mummy\" franchise.<br><br>It follows on from the previous film and yet another high priest has risen our mummy (Played again by Lon Chaney Jr). Once again he is after the reincarnation of his original love. Trouble is this is the third time we've seen the same plot.<br><br>I'm not saying The Mummy's Ghost is any worse than the rest, it's just the same thing.<br><br>What it does have however is a very shocking and surprising finale that I found very entertaining. Movies from this time tended to be very predictable so this came as a surprise.<br><br>For fans this will entertain, but it could easily have been a stand alone movie.<br><br>The Good:<br><br>Fantastic finale<br><br>Well enough made<br><br>The Bad:<br><br>Some very hammy acting<br><br>Things I Learnt From This Movie:<br><br>Fainting was a big thing for women in the 1940's<br><br>Mummy tantrums are hilarious<br><br>Ancient egyptian bandages were bullet proof","user":"Platypuschow","rank":[17,17]},{"title":"The Mummy Rises Again!","rating":5,"date":"4 November 2004","review":"\"The Mummy's Ghost\" is a sequel to \"The Mummy's Tomb\" (1942). In that film Kharis the Mummy (Lon Chaney) perished in a house fire. Also the old high priest (George Zucco) dies of old age while handing over his powers to a new high priest. In this film we find out that not only did Kharis survive the fire unscathed but the old high priest turns up alive and shaking.<br><br>This entry has the High Priest Yousef Bey (John Carradine) being assigned the task of going to America to retrieve the mummies of Kharis and his queen Ananka. Hero Tom Hervey (Robert Lowery) is courting a beautiful Egyptian by the name of Amina Mansouri (Ramsay Ames). Meanwhile Yousef Bey sets about arranging to take the two mummies back to Egypt. To this end he unleashes Kharis upon the community to murder anyone who stands in their way.<br><br>At the same time Amina starts to experience blackouts as she is being gradually taken over by the spirit of Ananka (the \"ghost\" of the title) to become the re-incarnation of Queen Ananka. This suddenly becomes a point of issue between Kharis and Yousef Bey until......<br><br>Becoming a \"B\" movie second feature series, the films did nonetheless benefit from Universal's expertise in making this kind of film. Although it features a \"B\" list cast and runs a scant 61 minutes, it is still an entertaining way to spend an hour.<br><br>Lon Chaney would continue in the role of the Mummy in \"The Mummy's Curse\" (1944) the final film in the series.","user":"bsmith5552","rank":[13,13]},{"title":"another decent mummy B-movie","rating":7,"date":"30 March 2006","review":"This mummy film is one of a series of four produced by Universal Pictures in the 1940s--well after their original film starring Boris Karloff. While none of these films opened up a lot of new ground, they were good escapist fun--for kids and adults willing to suspend reality and have a good time. I personally LOVE these old Universal horror films--even the lesser ones like this film. This one's plot isn't so special (except once again the mummy somehow makes it to America), but it stands out due to the acting of George Zucco and John Carradine--two wonderful veteran horror actors who played up the campiness of the film and made it far more entertaining.<br><br>The film looks a lot less impressive than the newest mummy films from Hollywood, but they still managed to be fun. Plus, the newer films, in my opinion, lack fun because they are so special effects-driven. See this film and have a good old fashioned time.","user":"MartinHafer","rank":[24,27]}]