[{"title":"Cheesy, fun Halloween slasher, but no holiday classic","rating":5,"date":"27 October 2015","review":"Jag Mundhra's second stab at the slasher film (after 1987's snooze OPEN HOUSE) isn't an '80s Halloween-season classic like TRICK OR TREAT or NIGHT OF THE DEMONS, but schlocky horror fans will probably have a good time with it.<br><br>Hy Pyke (what a name!) is delightfully over-the-top as the grandfather (who is described as 'kindly' in the IMDb summary, but you're never given the impression he's anything but a scumbag) hell-bent on getting his eldest grandson to devote himself to his Satanic cult, a lame-o group that flash gang signs to each other and wear flannels under their devil robes. Meanwhile, someone in the cult is randomly killing people, and it's up to the other grandson, a boyishly handsome cop, to figure out what the hell is going on.<br><br>It's gorier than a lot of the slashers from this time period (though the body count is low), and just about every female cast member gets naked at some point (except, bafflingly, the most attractive one). Most of the leads have fun with their silly roles. It feels super padded, even at 90 minutes, what with random five-minute glam metal dream sequences and a head-scratching, unfunny stand-up comedy routine that grinds all the Satanic action to a halt.<br><br>Watchable for sure, whether or not it's worth watching could go either way. Don't spend too long tracking it down, but you could watch way worse.","user":"yourmotheratemydog715","rank":[5,5]},{"title":"charming low-budget 80's horror","rating":17,"date":"17 October 1999","review":"The particular copy of this movie that I saw was under the moniker \"Hack-O-Lantern\". In terms of pure gore, the movie didn't exactly live up to the name. It was, however, charming in a typically 80's horror fashion, i.e., just about every chick in the movie gets naked. The plot is nothing new, but it is rendered fairly well. In one particular scene, the movieturns into a music video by the heavy metal band D.C. La Croix.  If you like old-school metal like Wasp and Venom you will like the song they have in the movie.<br><br>Bottom line, the movie needs more gore and a higher body count.","user":"Trooper8-2","rank":[12,15]},{"title":"Really bad but pretty funny","rating":5,"date":"28 April 2018","review":"Really, really bad, but hilarious in that way that only cheesy 80's slashers can be. With the way the mother acts, this could have been taken as a light satire on the whole 'sex drugs and rock n roll' thing but I genuinely doubt there was any such self reflection present in the making of this movie. In fact I don't think there was a single joke the entire running length but I still found myself laughing pretty often. Well, other than when that comedian came out at the party. I wasn't laughing then.\nBad acting, bad dialogue, bad sets, bad cinematography. Classic case of 'so bad its good'... but not too good.","user":"nick121235","rank":[3,3]}]