[{"title":"It's the Velveeta of B movies","rating":6,"date":"12 February 2005","review":"This low, low budget sci-fier is somewhat derivative, but it's kind of a take-off on Bladerunner-type movies, rather than a ripoff of them. Jack Deth (Tim Thomerson) is a detective in the future who's sent back to 1985 to stop a madman who's decided to kill the ancestors of the city council of Deth's time. With the help of Lena (a young Helen Hunt), Deth fights Trancers (who have fallen under the control of the madman) and his own culture shock.<br><br>It's a short movie (76 minutes), and things move pretty quickly; plot isn't so much of a focus as a annoying gnat that appears from time to time. But for being so short, the characters are pretty well developed - and one huge bonus is that Deth isn't an no necked, shoot-first idiot, as renegade cops are often portrayed.<br><br>Trancers is original, often-funny sci-fi cheese. It's great to see Thomerson and Hunt - especially Hunt, who looks great.","user":"dfranzen70","rank":[21,21]},{"title":"the eternal struggle between detectives and zombies!","rating":7,"date":"19 March 2004","review":"\"Trancers\" is one of the most enjoyable B-movies ever made.  The time travel plot and \"fish-out-of-water\" aspects make it similar to the first \"Terminator,\" but try to imagine that classic film with an infinitely lower budget and a more highly developed sense of humor.  On some days, I probably prefer the wisecracking antics of \"Trancers\" star Tim Thomerson to the earnestness of Michal Biehn in Cameron's film; in this instance, cheaper production values and more obscure actors do not necessarily equal an inferior product.<br><br>Thomerson is, without a doubt, the glue that holds the whole silly series together.  He's a performer, not an actor.  He entertains without emoting. And hey, for this material, that's fine.  In fact, that's the bomb.  He could read his lines right off the page in a monotone, and you'd still want to stand up and cheer.<br><br>The only flaw in this film is a slightly boring villain, but everything else is cool - check out Helen Hunt as some kind of trashy '80s biker chick. Best scene?  When Thomerson beats up the stupid punks in the disco.<br><br>Overall, an effective blend of the sci-fi and detective genres, and a good indicator of what imagination and a good sense of humor can accomplish in the absence of cash.","user":"dr_foreman","rank":[46,50]},{"title":"Superb 80s Sci-Fi","rating":8,"date":"4 September 2005","review":"I remember renting this superb Sci-Fi movie back in the late 80s. I'd only had a VCR for about a year and this renting video titles lark was still very exciting for me. Trancers was one of my favorites at the time and still is to this day. It stood the test of time. Speaking of time, that's what this movie is all about. Jack Deth (Tim Thomerson in great form) travels back in time to stop Whistler who created the kill-crazy 'Trancers.' A terrific sci-fi action movie that, despite being low-budget, never fails to thrill. I haven't been able to find it on DVD as yet but I'm ever alert. I hope to get it and its 5 sequels in a box-set. If not I'd happily settle for 'Trancers' on its own...","user":"alex-999","rank":[27,30]}]