[{"title":"Grizzly Men and Dancing Chickens","rating":26,"date":"26 September 2010","review":"\"A person needs a little madness, or else they never dare cut the rope and be free.\" – Nikos Kazantzakis <br><br>\"Amerika ist wunderbar!\" - Rammstein<br><br>Many of the films which comprise \"New German Cinema\", a period in German cinema which lasted from the late 1960s to the mid 1980s, explored and attempted to come to terms with the cultural colonisation foisted upon Western Germany by America in the aftermath of WW2.<br><br>Wim Wenders, Margarethe Trotta, Rainer Fassbiner and Werner Herzog were the big names in this movement, with films like \"The American Friend\", \"Kings of the Road\", \"Storszek\" and \"Fear Eats the Soul\". But while Herzog's \"Storszek\" may have been thematically typical of the movement, it's a bit of an anomaly in Herzog's own filmography, whose films, at least at the time, tended to be set in the past and were often structured as allegories or medieval fables.<br><br>\"Storszek\" opens with a mentally unstable musician, Bruno Stroszek, being released from prison. This character is modelled on the life of Bruno Schleinstein, the actor who actually plays Stroszek in the film. Typical of Herzog's work, \"Storszek\" thus effortlessly blends fiction and documentary, Bruno, who always seems uncomfortable in front of Herzog's camera, \"acting as himself\" in a fictional story based loosely on his own life.<br><br>Like most of Herzog's films, the tale is told via several symbolic episodes. First act: a wet and oppressive Germany populated by violent pimps and prostitutes. Symbols like a shrinking boat and a bird which is confiscated are then dished out, after which Bruno \"rescues\" a prostitute and travels to America in the hope of making a better life for himself.<br><br>Vast and seemingly unrestrictive, America is initially portrayed as a place of possibility and freedom. Gradually, though, Herzog begins to populate this world with his usual assortment of freaks and grotesque characters. More symbols and symbolic subplots are then revealed: the story of a local murderer and body snatcher, the fact that Bruno's new hometown was the hometown of Ed Gein, warring farmers who fight over a thin strip of land, obsessions with metal detectors, a crazy old man's insistence that people are magnetic and that the dead emit magnetic fields, dangerous walks on frozen ponds, salty pretzels, mobile homes, a ski lift etc etc.<br><br>End result: by the film's final act, \"Storszek's\" faux-documentarian edge completely gives way to a kind of overt surrealism. And so Herzog has Bruno lose his home, lose his girlfriend (who returns to prostitution and leaves him for an obese trucker), and mount an incompetent robbery, all for 32 dollars and a Thanksgiving turkey. Chased by the police, Bruno then flees to a depressingly tacky town whose chief income is a large amusement park operated by Native Indians and awash with machines, neon signs, glitzy diversions, kitschy plastic facades and an assortment of fun-house fakery.<br><br>Seeking escape, Bruno hops on board a ski lift. He thinks it'll take him up into the mountains, to some heavenly getaway, but of course the ski lift is stuck in a loop and can take him nowhere except right back where he started from. Realizing that the American dream is the German reality, Bruno shoots himself, committing suicide off screen.<br><br>The film's final shot is of a solitary chicken, trapped in a fun-house, dancing (automatically, seemingly without thought) in a cage and making a fool of itself for bird-seed. This, of course, is Bruno's own trap: the Myth of Sisyphus in poultry form, life reduced to a circus act too grotesque to contemplate. Joy Division lead singer Ian Curtis would hang himself in his kitchen moments after witnessing this very sequence.<br><br>Herzog's cinema is a cinema of madmen (Timothy Treadwell in \"Grizzly Man\", Klaus Kinski's numerous starring roles, the various mystics and deranged prophets peppered throughout Herzog's filmography etc). What's great is that you're never quite sure how nuts these guys are and how sympathetic Herzog wants you to be toward them. But while it's easy to dismiss Bruno as an endearingly simple man-child with a couple screws loose in the head (he is), Herzog's ultimate point is three fold. Yes, the amusement park may violently spit madmen out of its machinery, mad men like Bruno who either reject the illusion or are too damaged to cope. But those \"chickens\" whom the machinery doesn't reject are far more insane. \"Normalcy\" is irrational, and in Herzog's filmography it is often the mad who see this clearest. Or as Harlan Smith once said: \"Fantastic insight into the true nature of Reality is isomorphic to insanity.\"<br><br>8.5/10 – Fittingly, this film was made the same year as Lynch's \"Eraserhead\". Lynch would use a similar filmic language or meta-story decades later with \"The Straight Story\". The film is too ambivalent to be taken as a jab at America and late capitalism. Herzog is primarily an existentialist, and whatever fingers he points at the US he points at Germany as well.<br><br>Worth two viewings.","user":"tieman64","rank":[12,12]},{"title":"Brilliant","rating":10,"date":"5 February 2005","review":"I discovered Werner Herzog first through his remake of Nosferatu and then through Fitzcarraldo and Aguirre: The Wrath of God. Though the brilliance of those movies is unimpeachable, Stroszek, at least for me, stands at the apex of Herzog's oeuvre. <br><br>This intensely moving and satisfying film which begins in Germany and winds up in Wisconsin is solid through and through. There's not a weak moment or weak element to be found. The acting, especially by Bruno S., is completely unaffected and without over-stylization (there is, perhaps, a reason for this - they aren't acting, simply being). The story itself deals with melodramatic elements without steering into soap opera territory and the film's ideology is not black in white. There's subtlety and complexity to the ideas put forth in this film about America, Germany, human beings, life, etc. Moreover, Stroszek avoids beating the audience's brains with its ideas; Herzog presents them in the context of the story, smoothly integrated. <br><br>And then there's the beautiful photography, particularly of the American Midwest; Herzog and his cameramen capture perfectly the cold, stark, desolate magnificence of the upper-Plains. To draw a weird comparison, the photography here is the equivalent of Husker Du's New Day Rising - crisp, harsh, and gorgeous simultaneously. <br><br>Stroszek also has a justifiably well-known ending, both surreal and completely sensible. Though any other director would be unable to top an ending such as that in Aguirre (the slumped conqueror, floating on a monkey-covered raft), Herzog does just that here. <br><br>Truly, if you have not seen any Herzog, this is a great place to start; then go see Aguirre, Fitzcarraldo, Nosferatu, Woyczek, and Invincible. The man is brilliant and I await with bated breath Grizzly Man, his new project.","user":"jay4stein79-1","rank":[53,64]},{"title":"**** out of ****","rating":9,"date":"23 September 2002","review":"Fascinating, unique look at the American dream follows three German social misfits (Bruno S., Eva Mattes, Clemens Scheitz) as they travel to Railroad Flats, Wisconsin to seek a better life.  Strange comic moments mesh together well with some extremely sad and moving moments.  Superbly performed by everybody, although the cast is mostly non-actors.  The documentary style shooting works well with the story.  One of Herzog's best.","user":"kyle_c","rank":[27,31]}]