[{"title":"Pure gold","rating":10,"date":"7 September 2011","review":"I may be the only person to say this but I think The Rescuers was a LOT better than the sequel. Oh don't get me wrong, Down Under's pretty good. But, to me, The Rescuers is the best.<br><br>Since I was a little kid, I have had a short attention span so movies with more action generally held my attention. The Rescuers and the Pooh films were the two exceptions for me. This isn't a very fast moving film, at times it's quite slow. But that's when the tension builds. You feel a certain warmth watching it, similar to the warm fuzzies you would get from a Pooh film. It's sweet. It's fun. The characters are lovable and the villains are detestable (I mean Madame Medusa kidnaps an innocent little girl and then forces her to go into a dangerous pirate cave, if that isn't evil, I don't know what is). Even the supporting cast is awesome, if not entirely memorable. I think there were too many critters at Devil's Bayou, had they cut the cast down a bit, perhaps I could remember them all. But that's literally my only complaint.<br><br>The film is slow but it doesn't feel slow. It doesn't lag at all. It keeps you completely focused on the characters. By the way, the acting is superb, particularly Michelle Stacy as Penny. Usually child actors are hit and miss but she does an excellent job, she really makes you feel for Penny and that's the most important part. Bob Newhart and Eva Gabor as Bernard and Bianca. They really bring the characters to life.<br><br>The animation is beautiful as well. It all seems like a painting come to life. I am particularly impressed with Bernard and Bianca's animation because they look a lot like their voice actors. So you can't imagine a better voice for them. You often forget that they're mice. And that's really impressive.<br><br>So, all in all, this is one of Disney's best. Ever. It's proof that the animation studio was still going strong after Walt Disney's death. And it's still one of my all time favorite movies. I say, check it out. There's something for everyone in it.","user":"nilanna999","rank":[25,25]},{"title":"One of the great Disney gems from the 1970's","rating":10,"date":"21 July 2007","review":"The 23rd animated Disney classic is underrated and somewhat forgotten, yet one of Disney's finest! It's a great movie, even one of Disney's finest underrated works.<br><br>This charming film, while undoubtedly heartwarming, is also creative and very lively. It has lots of adventure and suspense, classic humor, fine artwork, a wonderful soundtrack and a dark atmosphere. When I say \"dark\" I mean dark in the sense of being somewhat chilly, but without being extremely dark or a story of horror/terror. The darkness of the Devil's Bayou is amazing, creepy to the point of almost looking like a forbidding place, which helps a lot to create this distinct atmosphere.<br><br>Despite the apparent simplicity, this motion picture has some very artistic palette colors. One good example of this is the amazing and gorgeous opening sequence. The beautiful but sad song 'The Journey' matches in perfection.<br><br>The song 'Tomorrow is another day' is very optimistic and nostalgic. Not just that, it fits perfectly on that sequence: beautiful vistas painted with heart and soul. Besides, that rainbow and those New York City lights at night look incredibly real.<br><br>The song 'Someone's waiting for you' is heartwarming, but so is the sequence itself. 'The U.S. Air Force' is a delightful instrumental music, very energetic and full of life.<br><br>Medusa is a great villain. One of Disney's best villains, says I. She's mean and nasty, but at the same time funny (even hilarious at times). She is a little eccentric but not too much and not annoying. Besides, she isn't too sinister or one of the most cruel villains.<br><br>Medusa's sidekick, Snoops, is someone I don't consider a real villain. He's not bad enough to be a villain and he doesn't know how to be bad, although he attempts. I think that deep down he is a good guy. I like Snoops: he's a simple and goofy guy but funny (even hilarious at times) and not that bad. He's more of a poor guy who messed with the wrong person.<br><br>By the way, Medusa and Snoops have a nice pawn shop named \"Medusa's pawn shop\" or, like Medusa delightfully says on the telephone, «Madame Medusa's pawn shop boutique».<br><br>Comical characters like Luke and the albatross Orville have small roles, perhaps because this movie is more of a dramatic natured one. Numerous swamp animals appear (others than Luke), but their roles are minor (with the exception of Ellie Mae and Evinrude).<br><br>Bernard is the kind of romantic and shy hero. Bianca has a characteristic hungarian charm (her voice actress, Eva Gabor, was hungarian). Orville is carefree and spirited, as well as a comic relief. Like albatrosses in real life, he flies beautifully but is very bad at landings.<br><br>Evinrude's sounds are awesome. They sound so real! I have no words to describe them! James MacDonald really had a gift for sounds.<br><br>Penny was apparently modeled after Michelle Stacy, the cute little girl who did her voice. Penny is cute and has a very cute voice. People sympathize with Penny and her situation in the film, yet despite being very endearing she is also confident and has a strong personality - something which Snoops doesn't know how to deal with.<br><br>The crocodiles Nero and Brutus are hilarious in every scene they appear. I don't know why, but there is something hilarious about them even just by looking at them. They are at their most hilarious when they play organ. And those rascals really know how to play talent, LOL. They have talent for music, LOL! Besides, although they are Medusa's loyal pets, they are good crocodiles and not vicious. Whenever they catch Penny, they always grab her carefully not to harm her. And they are just as careful with her beloved teddy bear. Even in the water they have special care with her and her teddy bear.<br><br>A very good and timeless Disney classic! This is one of those animated classics I grew up with - and 'The Rescuers Down Under' too. Both were part of my childhood.<br><br>1977 was one of the best years in cinema ever!<br><br>This should definitely be on Top 250.","user":"Atreyu_II","rank":[27,28]},{"title":"Classic Tale Of Heroic Mice","rating":8,"date":"8 December 2013","review":"One of Walt Disney's finest animated films, this concerns two mice named Bernard &amp; Bianca, who belong to the Rescue Aid Society, that operates out of the basement of the United Nations building in New York. There is a little girl named Penny being held captive by an evil woman named Madame Medusa and her henchman Mr. Snoops, who need her to lead them to a priceless jewel in the Devil's Bayou swamp, where she is being held on a riverboat. The mice fly atop Orville the Albatross to rescue her, and defeat the villains. Surprisingly touching and thrilling film done with care and imagination, with wonderful songs. To be enjoyed by both children and adults alike.","user":"AaronCapenBanner","rank":[12,12]}]