[{"title":"One of the most popular musicals of the period","rating":8,"date":"27 March 2005","review":"Released some months before the end of the war, \"Anchors Aweigh\" is one of Gene Kelly's major musical triumphs of the forties <br><br>Under the direction of George Sidney, it had the benefits of a pleasant score, andbest of allthe services of Gene Kelly in his first true starring role at MGM The year before, in Columbia's \"Cover Girl,\" he had revealed an innovative approach to dance on the screen, a light but agreeable singing voice, and considerable charm In \"Anchors Aweigh,\" although he was billed under Frank Sinatra and Kathryn Grayson, he was laying the solid groundwork for his most revealing years at MGM <br><br>The film's story, a kind of dry run for \"On the Town\" four years later, follows sailors Kelly and Sinatra on shore leave, spend their holiday in Hollywood, where they become involved in the affairs of an aspiring singer (Grayson) and her little nephew (Dean Stockwell).<br><br>Grayson, it appears, has her heart set on an audition with conductor-pianist Jose Iturbi She gets the audition, of course; Kelly gets Grayson after some misunderstandings; and Sinatra, has forgotten to be shy, and has lost his heart to a girl from Brooklyn (Pamela Britton).<br><br>The plot is conventional for the period but, regrettably, it now seems barely tolerable But there is Gene Kelly, who dominates the movie with his agreeable personality Perhaps he grins too much, but when is permitted to dance, the film finally lifts off the ground <br><br>\"I Begged Her,\" his early song and dance with Sinatra, is amusing and slightly absurd, in which he imagines himself as a bandit chieftain in a Spanish courtyard, courting maiden Grayson with a flamboyant flamenco dance and some athletic leaps He also does a charming Mexican dance with little Sharon McManus in the square of a Mexican settlement in Los Angeles<br><br>The highlight of the movie, however, is Kelly's famous dance with the cartoon character Jerry the Mouse (of \"Tom and Jerry\" fame). Delightful and innovative, it skillfully combines live action and animation in its tale of a sad mouse king who refuses to allow music in his kingdom until Kelly, a sailor in the \"Pomeranian Navy,\" wearing a striped shirt and a beret, shows him how to dance \"Look at me, I'm dancin'!\" says the gleeful mouse king...","user":"Nazi_Fighter_David","rank":[37,42]},{"title":"Flashy, funny, overlong... but Kelly shines through!","rating":7,"date":"14 October 2002","review":"ANCHORS AWEIGH sees two eager young sailors, Joe Brady (Gene Kelly) and Clarence Doolittle/Brooklyn (Frank Sinatra), get a special four-day shore leave. Eager to get to the girls, particularly Joe's Lola, neither Joe nor Brooklyn figure on the interruption of little Navy-mad Donald (Dean Stockwell) and his Aunt Susie (Kathryn Grayson). Unexperienced in the ways of females and courting, Brooklyn quickly enlists Joe to help him win Aunt Susie over. Along the way, however, Joe finds himself falling for the gal he thinks belongs to his best friend. How is Brooklyn going to take this betrayal? And does Joe end up with Susie, who loves him too?<br><br>\nThe first and second times I saw ANCHORS AWEIGH, I also saw it at the same time as I did ON THE TOWN, the Kelly/Sinatra collaboration from 1949. Both times I felt that ANCHORS AWEIGH was the better film in terms of plotting and structure--all the dances and songs fit the moment in the plot, and they develop the characters and story rather than hamper them. Yet, both times I came away feeling that ON THE TOWN is the better film overall. Having now seen both films a third time, I still stand by that judgement. Somehow ON THE TOWN, as a film and a piece of entertainment, is just lighter, gayer, purely and simply *happier*. The numbers are more outrageous and less integral to the plot, and yet somehow it works better than all the dances and singing in ANCHORS AWEIGH. I'm not quite sure why this is. The typical argument is that the latter film is over-long: at almost two and a half hours, this is certainly a valid criticism to make. I certainly felt the length the first two times I saw it! However, it's also a film that grows on you--the more you see it, the shorter it feels and the more you appreciate the technical mastery involved in its making. And yet, something just doesn't hang together quite right. It feels almost as if the script was pored over, and *every* single moment when Kelly could break into dance or Sinatra into song was noted, and that's exactly what happened. No opportunity to shoehorn a musical number in was given up... and that's probably the film's biggest weakness. It has 16 numbers (give or take a few), and no matter how big a fan you are of Kelly or Sinatra, this really starts to turn one numb after a while. (Contrast this, for example, with the ten numbers in ON THE TOWN.) You might well feel that each song, each dance, can't be taken out of the film without leaving it lacking... and that's true. But that's also because the writers weren't more restrained in adding them in in the first place.<br><br>All this long preamble doesn't mean there's nothing good about ANCHORS AWEIGH. The musical *is* splashy with great songs bursting out all over, like the duets between Kelly and Sinatra ('We Hate To Leave', 'I Begged Her' and 'If You Knew Susie'), the singing of Sinatra ('What Makes The Sunset', 'The Charm Of You', and the best of all, 'I Fall In Love Too Easily'), and without a doubt the always inventive, always breathtaking dancing of Kelly. It's also hard to miss with a cast of this calibre. Grayson is sweet and seems to improve on each viewing (her voice becoming stunning rather than frightening); Jose Iturbi's role is written sympathetically and he does a great job with it; even Clarence's own Brooklyn, Pamela Britton, is cute and charming... as close as one could get to Betty Garrett without being Garrett herself! Sinatra is adorable with those blue eyes and curls of his, and plays the innocent boy-man wonderfully (a role he reprises in ON THE TOWN). His singing is, as usual, simply faultless from enunciation through to timing and phrasing. His solo numbers might seem to drag a little, but when you've got the voice of a century, showcasing it is probably as good a reason as any to slow up the rest of the film!<br><br>Gene Kelly's sheer genius in this film is worthy of its own paragraph. Third in the billing behind Sinatra and Grayson respectively, ANCHORS AWEIGH really is Kelly's film. His Joe Brady is a believable, real character--he's tough on the outside, glib and willing to lie when necessary to win a gal, but he's actually the biggest softy on the inside. Kelly makes this charming rather than cloying, but also gives Joe a real edge that you see in the scene when Joe chases Brooklyn around the room with a genuinely murderous look on his face and his breakfast tray in his hands. And the *dancing*--again, the film suffers from the 'too much of a good thing spoils the effect' syndrome, as it does with Sinatra's singing. But once again, if it's Gene Kelly doing the softshoe, or tapping across the screen in a sailor's outfit or dressed up as a bandit chief... might as well err on the side of overdoing it! All of Kelly's dances are breathtaking, be it the pared-down simplicity of his tap number with Sinatra to 'I Begged Her', his 'Mexican Hat Dance' with the sweet wide-eyed little girl, or his lavish Spanish-influenced dance 'La Cumparsita'. Of course, the classic image left in audiences' minds for all time would be Kelly in his red, white and blue sailor suit, dancing with Jerry Mouse of 'Tom &amp; Jerry' fame. A well-deserved golden film memory, to be sure--it's not often that one can say you're impressed by the special effects in a film made in 1945, given the saturation of CGI in the contemporary film market. But Gene and Jerry still look great, with Kelly always hitting his spots and looking exactly where he needs to look. It *would* turn out that just about the only people who could really keep up with Gene Kelly would be Kelly himself (in COVER GIRL) and a cartoon animation. <br><br>It's doubtless that this first daring, inventive Kelly dance with Jerry has reserved a place for ANCHORS AWEIGH in film history and the hearts of classic film buffs. But it's also notable for being the first of three Kelly/Sinatra film collaborations, and though rather too drawn-out, still a great couple of hours of entertainment. Watch it first, then again and maybe again--it'll grow on you before you realise it! 7.5/10","user":"gaityr","rank":[22,28]},{"title":"\"All Kinda Mixed-Up And - Interesting\"","rating":13,"date":"13 July 2000","review":"MGM was intent on making the most of its hot new properties Kelly and Sinatra in this affable sailor saga.  The stars' characters were created with maximum screen impact in mind, and were to be retained (with minor adjustments) in \"Take Me Out To The Ball Game\" and \"On The Town\".  Gene Kelly plays Joe \"Sea Wolf\" Brady, the twinkle-eyed Irish womaniser who never quite seems to get a woman.  Clarence \"Brooklyn\" Doolittle, Sinatra's screen persona, was put together as a blatant attempt to pander to his bobbysoxer following.  He is the bashful, slightly geeky ingenu, pushing his cuteness for all it's worth - \"the romantical type fella\".<br><br>     \"Anchors Aweigh\" set the pattern for a whole assembly line of MGM musicals to come, and one could almost say it established an art-form. Kelly did the choreography, and his first-ever 'dream ballets', two of them, are on display here - the famous pas de deux with Jerry The Mouse, and the Zorro interlude.  The dance sequences are brimming with innovative ideas - mixing human action with animation, artistic use of slow motion, 'playing' the items on the craft stall and bouncing on the beds in the servicemen's hostel.<br><br>     MGM itself appears, almost as a character in the movie, with self-indulgent shots of the art deco facade and the bustle of the back lot. Jose Iturbi, the Spanish musical director contracted to MGM at the time, plays himself in a slightly odd role.  He is the big noise at the studio whom Aunt Susie is anxious to impress, and in a bid to give the meandering storyline some cohesion, he opens the film conducting the Navy band (this strange set-up is 'explained' in a later throwaway line: he was brought in to tighten-up the Navy's musical style).  There are two problems with giving Iturbi an important role in the movie - one, nobody has ever heard of Jose Iturbi, and two, his Valencian accent is so strong that it renders him virtually unintelligible.  But anyhow, Iturbi conducts the said Navy band, and then an orchestra on the MGM sound stage, playing a \"Rhapsody In Blue\" rip-off.  He presides over Aunt Susie's auditon, and plays some classical stuff at the keyboard (including an interesting \"Hungarian Rhapsody\" at the Hollywood Bowl, with massed pianos).<br><br>     The plot (if that is not too choate a term for it) goes thus: an aircraft carrier puts in at San Diego, and two sailors are given shore leave.  They encounter a little boy who leads them to his pretty Aunt Susie, a taco joint chanteuse who dreams of the big time.  Without giving the game away, I can reveal that more than one person falls in love Susie, leading to the customary complications and misunderstandings.  The energy and exuberance of the performances, and particularly that of Kelly, carry the madcap action along nicely, and the eccentricities of a storyline which goes from mariachi groups to Tom And Jerry don't seem so very outlandish after all.  This new brand of musical comedy, breaking completely with the pre-war conventions of tuxedos and ocean liners, is attractive and refreshing.<br><br>     Young Mister Sinatra, under a separate contract from the others, sings numbers specially written for him by Jules Styne and Sammy Cahn.  By far the best of these formulaic boy-crooner ballads is the final one, \"I Fall In Love Too Easily\".  Throughout the film, Frank sings in his upper register, aiming for a light ballad sound, and consequently not doing any justice to that reedy baritone voice.<br><br>     The film has attractive visual gimmicks, quite apart from the man-and-cartoon-mouse stuff. Iturbi plays a transparent keyboard, shot from below.  In a clever comment on the storyline, Joe rises from the table and physically comes between Clarence and Susie.  The string section of the orchestra is filmed playing pizzicato in the reflection of Iturbi's grand piano.<br><br>     Katherine Grayson is more than adequate playing the female ingenue, and her voice is spectacular, if a little too showy and operatic.  The screen test is a knockout coloratura performance.  <br><br>     The film falls away a little towards the end.  The Hollywood Bowl is incorporated, one feels, merely to give the movie a photogenic location to use, and this passage distorts the storyline somewhat.  The fallings in and out of love are totally arbitrary, and the resolutions hurried and thin. But for all that, \"Anchors Aweigh\" is fun to watch, and its stylistic innovations paved the way for the great MGM musicals of the next ten years.","user":"stryker-5","rank":[16,20]}]