[{"title":"This Will Heat You Up On A Cold Winter Night!","rating":9,"date":"26 November 2005","review":"A modern remake of the 1940s film, \"Double Indemnity,\" this movie has a solid, large fan base of its own. That's justifiable, too, because this is well done.<br><br>It sports a 1940s-type film noir soundtrack but the rest is purely 1980s. By that, I mainly mean nudity and profanity, although the language isn't that offensive.<br><br>Kathleen Turner plays a femme fatale, similar to Barbara Stanwyck's role with Fred MacMurray in \"Double Indemnity,\" except with a different ending. Actually, the entire story is quite different from the classic film noir. William Hurt has MacMurray's male lead role. I liked the classic actors better but Turner and Hurt shine with their performances, too.<br><br>This is steamy movie to say the least. Set on hot, humid Florida summer nights, you can almost feel the heat coming out from the TV screen and the heat from the two leads going at it several times. Turner is excellent as a woman who will go to great lengths for money, as they sometimes do. (Hey, my 87-year-old father is dating a 24-year bimbo in Florida, so I know of where I speak.)<br><br>The story is divided into three segments: (1) the setup; (2) the romance and plotting of the crime and (3) the crime and unraveling of Hurt as things begin to go very wrong.<br><br>An intriguing film, this loses nothing with multiple viewings. It's always interesting. The more I watched this, the more I found - as the case frequently is - myself fascinated with some of the lesser characters such as Hurt's two friends, played by Ted Danson and J.A. Preston. Danson, by the way, gives us a preview of the amoral character he played later in the hit TV series, \"Cheers.\"<br><br>This is the kind of film you snuggle up with someone on a cold winter night. It will warm you up as much as your partner!","user":"ccthemovieman-1","rank":[87,99]},{"title":"A sultry, sweaty update of Double Indemnity","rating":8,"date":"11 December 2004","review":"The coastal Florida town in Lawrence Kasdan's Body Heat brings to mind remote colonial outposts in movies like The Letter (nearby Miami, here, seems as far away as London). A sweltering spell of weather settles down for a long roost, and the distant glow of an old hotel  a relic of the peninsula's past as an exotic getaway for northerners with money  lights the opening scene; it's been torched for the insurance, an occurrence so common as to warrant little comment. <br><br>It's a town where William Hurt, a lawyer who's neither very bright nor very scrupulous, ekes out a modest existence that seems to suit him; he can dine at the best restaurant in town once a month so long as he doesn't order an appetizer. The rest of his time he spends lazily with bourbon or beer or in bed with whoever obliges him. <br><br>Then he meets up with Kathleen Turner, who hangs around cocktail lounges when her wheeler-dealer husband (Richard Crenna) is out of town, which is a lot. After the ritual game of cat-and-mouse, Turner and Hurt kindle a torrid romance, despite the enervating heat that keeps everything else limp as dishrags. Soon, the pillow talk works around to murder....<br><br>Of course, Body Heat is a latter-day version of the story for which Double Indemnity serves as archetype: Duplicitous woman seduces lust-addled stud into killing rich older husband, then leaves him to twist slowly, slowly in the wind. There's not even enough wind to stir the chimes that festoon the porch off Turner's bedroom -- can't the rich old cuckold spring for air conditioning? Hurt and Turner are reduced to emptying the refrigerator's ice tray into the post-coital bath they share -- but Hurt's left twisting nonetheless, in one of the better updates of this ageless tale. <br><br>In her movie debut, Turner makes her deepest impression with her best asset, that dimple-Haig voice of hers, all silk and smoke (but neither she nor Kasdan, who also wrote the script, quite justify her character's long and intricate back-story of ruthless scheming). With his long, lithe college-boy's build and wife-swapper's mustache left over from the '70s, Hurt embodies the self-satisfied patsy whose zipper leads him through life. Crenna (who played this Walter Neff role in the 1973 TV remake of Double Indemnity) now takes on the role of the disposable husband, the victim (or rather, the first victim).<br><br>But it's two smaller parts that give the movie a special shine. Mickey Rourke, as the local arsonist whom Hurt once helped out of a jam, ups the voltage in his two scenes, warning the heedless Hurt, then warning him again when it's all but too late. And, as Hurt's amiable adversary in the town's tiny legal circle, Ted Danson proves surprisingly spry and intuitive an actor (and he contributes a lovely little idyll, doing a soft-shoe routine under a street lamp on a pier). There's a twist or two too many in Body Heat -- it's a bit gimmicky -- but, after watching it, you feel as though you, too, should be stripping off your clothes, if only to wring them out.","user":"bmacv","rank":[85,98]},{"title":"Ultra Cool","rating":8,"date":"2 August 2001","review":"Usually I find movies date really badly. For instance, John Carpenter's Halloween from 1978 is my favorite horror movie and although I like it a lot, I must admit it's dated badly over the years. No doubt due to the literally graphic changes in horror movies. I was thinking the same thing of Body Heat before I stepped into it. I was aware of such blessings it had been given, but kept in mind it was a product of the early 80's. Surely I thought this must be dated by today's standard of erotic dramas &amp; thrillers. This was not the case.<br><br>This movie has somehow managed to bypass the aging mechanism that movies succumb to. Twenty years after it's debut it still packs it's erotic punch and twisted bag of lies and William Hurt and Kathleen Turner are still the premiere duo of 'hot legs and ultra cool sleaze bags'. I won't bother giving even a morsel of the story to you - this is one you should walk into completely blind to better you viewing experience. If you need more, check out the plot summary or read the back of the movie box.<br><br>What I will talk about is the sex scenes. Erotica at it's cinematic best without being crude or pornographic. In today's age of softcore flicks on the video shelves and hardcore pornography conquering new territory every day it's a refreshing change of pace to look back to a movie made in the early 80's and witness such steaminess and tasteful erotica. Not to misdirect your thoughts. This movie isn't solely about sex, but it's a big part in a story of manipulation, money and deceit. The story, the direction and the cast are fit for a picture frame with Ted Danson and Mickey Rourke standing out amongst the supporting cast. A highly recommended view.","user":"refinedsugar","rank":[101,122]}]