[{"title":"Quirky \"B\" Film","rating":10,"date":"10 May 2004","review":"This is a strange little movie.......a film noir with some good performances and some not so good. You often see this film on lists of noir classics but it raises the inevitable question....is it a classic or does it have just too many faults to raise it to the level of winners like \"DOA\", \"The Big Sleep\" or \"Night and the City\".<br><br>The premise is fairly good. A man can't prove his whereabouts when his wife is murdered and can only describe his alibi as an unknown woman wearing a rather distinctive hat The story follows the hero's secretary and a sympathetic policeman as they try to prove his innocence. Alan Curtis is a disaster as a gloomy, rather unlikeable man who pretty much gives up trying to find the real killer and becomes resigned to his fate. He doesn't put up much of a fight and his attitude doesn't help much. The lovely Ella Raines portrays the secretary who gets herself into some uncomfortable situations, especially with Elisha Cooke Jr as the drummer man with the plan. Plenty has been said about the drumming scene which somehow sneaked by the censors. It has to be seen to be believed.......whew!!<br><br>Franchot Tone plays the hero's best friend and I am still trying to figure out if his playing of that part was really good or really bad. The answer is probably \"really bad\". The role is against type for him and he overdoes it. He does have a great apartment though!<br><br>Fay Helm, playing the woman with the hat, is strangely attractive and is just right for the \"phantom lady\". Thomas Gomez, as the friendly cop, does his usual good job. So is this film worth watching?......yes. It has some plot holes but overall it is enjoyable. Give it a try.","user":"Bucs1960","rank":[47,53]},{"title":"A Dark Treat","rating":10,"date":"3 September 2005","review":"Sadly not available on DVD as yet, but worth pursuing on TCM or VHS. A secretary believes her boss is wrongly accused of murder, and courageously takes on many dangerous characters in an effort to establish the truth. A movie with many twists and dark alleyways, none of which I will mention! The jazz band sequence where our heroine seeks the information about the killer, is one of the most erotic scenes in Hollywood history, despite being at very low budget and made during WWII in black and white. Despite the low budget - Long Island looks somewhat mountainous - this is a movie of original style and outstanding vision. Ella Raines was a great actress discovered by Howard Hawks who knew much about these matters, casting the feistiest women - Joanne Dru, Hepburn, Angie Dickinson, Lauren Bacall, Ann Sheridan - of their era. Robert Siodmak was of one of several German, Hungarian &amp; Czech film-makers - Sirk, Wilder, Zinnemann, Lubitsch, Curtiz,Lang, etc - who émigrés relocated to Hollywood, and brought a highly original fresh vision with them. Sadly Ella Raines was never given such a great part again, and eventually ended up in poorly produced westerns.","user":"manfromlaramie-1","rank":[40,45]},{"title":"ooh baby, that's some noir you've got there","rating":7,"date":"1 October 2005","review":"Robert Siodmak does a fabulous job with this B noir starring Ella Raines, Franchot Tone, and Alan Curtis. And he does it, I might add, without a lot of help from his male actors, i.e., Curtis and Tone. It's Raines all the way, a pretty, leggy actress who for one reason or another never reached the status of some of her \"noir\" counterparts.<br><br>Siodmak's use of sex, light, shadows, and music is truly remarkable as he tackles this genre. The shadows, lighting effects, and camera angles are all effective. But the highlight of the film takes place in a nightclub with a very sexual drum riff by Elisha Cook, egged on by an excited Raines. It's this scene that brings \"Phantom Lady\" into new territory.<br><br>Siodmak's commitment to the material is matched only by Raines, who gives a sincere performance as a woman in love trying to save her man. Franchot Tone phoned this one in. Alan Curtis didn't seem upset that he might die and didn't seem happy that he lived. And he never, except for a brief moment in prison, seemed to be in love with Raines.<br><br>The amusing thing about many of these films is that, as World War II progressed, interest in psychiatry deepened. But often the terms were used incorrectly in films such as \"Possessed,\" \"Spellbound,\" and \"The Greatest Show on Earth.\" Tone is called paranoid by Thomas Gomez - Tone probably has some paranoia attached to his disorder, but he appears to be closer to a psychopath. In actuality, as evidenced by his headaches, he may have had a brain tumor pushing against his brain.<br><br>Phantom Lady doesn't have the greatest plot, but it's well worth watching.","user":"blanche-2","rank":[32,36]}]