[{"title":"might enter the \"classic\" category","rating":8,"date":"30 October 2000","review":"Saw this movie again recently and found that it stands up well to repeat viewings. Tom Hanks meets a difficult challenge here - to convincingly show us how a twelve-year old boy would act if he were trapped in an adult's body and had to \"pass\" in a grownup world. He meets the challenge in spades, aided by a script that is by turns witty, clever, insightful, and touching, and by Penny Marshall's able direction. Much is added by Robert Loggia's sympathetic portrayal of Tom/Josh's boss, and by Jared Rushton as his friend Billy. The movie is much more than an exercise in slapstick or farce: it is really a disquisition on the wonder of childhood. In the end it is quite touching, if not moving, reminding us all of the innocence of youth and the aching sadness of recalling its loss. Too early to tell, but the film might very well be destined to become a classic.","user":"rupie","rank":[93,95]},{"title":"Keeping Your Inner-Child","rating":5,"date":"5 June 2001","review":"This charming, sweet, hilarious gem of a film works because Tom Hanks makes you believe he actually is a small boy in the body of an adult.<br><br>The interesting trick of what makes the story appealing is not so much the magic that the boy gets his wish to be \"big.\" It's that once he is in an adult, he has to navigate the adult world with the mind of a child -- and ultimately realizes that he is missing something if he makes the leap from boy to man without going through all the fun and the struggle in between. There are several other films that have the boy-to-man switch, but none of them have the depth of understanding about human nature that this film portrays.<br><br>The story is wonderfully written and directed, and Tom Hanks is a star. The film made me laugh, and it made me cry. What more can you ask of one movie?","user":"mermatt","rank":[87,90]},{"title":"This movie captures the innocence of youth beautifully","rating":10,"date":"12 August 2002","review":"I saw this film again yesterday for what must now be the tenth or so time and it's a film that makes me stop whatever I'm doing and immerse myself in the unfolding story. Never mind the fact that I am by now familiar with the premise, which incidentally far exceeds similar ones of the genre released at this time - Vice Versa and 18 Again (the latter being truly dire).<br><br>I think this is one of Hanks' finest hours and see it as the pinnacle of his early pre-90's career. His later performance in Philadelphia would eclipse this role, although this was obviously more serious in its message.<br><br>It takes real talent to act the young boy in the body of a thirty something and Hanks' copes admirably, from the comical leaping around the bedroom when he is trying to put on the jeans of the child on discovering his transformation to the child-like reaction displayed on Perkins' advances toward him. He captures the essence of youthful innocence both in the company of his younger peers and older 'work' colleagues.<br><br>Elizabeth Perkins complements the performance of Hanks' and it seems a shame that on searching the database that her career perhaps hasn't mirrored the success of Hanks' since making 'Big'.<br><br>I don't know why, but I always shed a tear at the end of the film. Perhaps it is the longing in all of us to want to return to the days of our youth and that we cannot turn back the clock as one can in the imaginary world of film.<br><br>As I grow older, and watch my children grow-up it makes me realise that time is a precious commodity and that life is a gift that should be cherished and nurtured carefully. This film somehow reinforces these feelings.","user":"toffeefan","rank":[118,125]}]