[{"title":"Florence Nightingale 1820-1910","rating":8,"date":"11 December 2011","review":"The husband and wife producing and acting team of Herbert Wilcox and Anna Neagle took a play written by Reginald Berkeley and ran a mere 12 performances on Broadway in 1931 as a vehicle for Anna Neagle giving her one of her most popular roles. Anna Neagle set some kind of record in her career playing more female British icons than anyone else. She played Queen Victoria, Edith Cavell, and Nell Gwyn before essaying Florence Nightingale who was a feminist icon way back in the day before women had the franchise.<br><br>Oddly enough she was not crazy about the suffrage movement in and of itself. At a time when she was trying to open up the nursing profession for women she received little support from those who wanted the vote. She thought a lot of them ought to be spending equal time participating in the profession she was trying to open up.<br><br>Nightingale was a woman born to the landed gentry whose family hobnobbed with a lot of the movers and shakers in the British Empire. Her interest in medicine dismayed her family who just wanted her to get married and settle down and do needlepoint if she wanted to create. <br><br>The film and play with brief prologues and epilogues in her old age covers the period of the Crimean War through the death of her friend and ally in the Palmerston cabinet Lord Sidney Herbert. Herbert is played her by a dapper and charming Michael Wilding who struggles tirelessly to get support among his colleagues for Nightingale's work nursing the soldiers in the Crimea and improving the sanitary conditions under which the wounded convalesced. Lord Palmerston is sympathetically played by Felix Aylmer and Wilding's greatest opponent is played by Arthur Young as William Gladstone who was Chancellor of the Exchequer and guardian of the nation's purse as it were. Seeing some of these people arguing seriously that proper nursing care was coddling the troops is truly frightening. <br><br>Nightingale's image with the oil lamp going about the dimly lit wards looking after her charges became her popular image thanks to the London Times reporting of the hospital conditions for the wounded troops in the Crimean War, one of the first examples of investigative journalism. Later on when American poet Henry Wadsworth Longfellow used the line about The Lady With The Lamp in one of his works, even though it wasn't about Florence Nightingale the line became a signature for her. Neagle is compassionate, determined and regal in her performance.<br><br>There is so much more to Florence Nightingale in her life and work, but The Lady With The Lamp will give you a fine introduction to one of the most useful lives spent on earth.","user":"bkoganbing","rank":[10,13]},{"title":"a long forgotten biopic","rating":5,"date":"30 September 2015","review":"Herbert Wilcox and his wife Anna Neagle made a number of these type of bio pics.They tended to be quite stodgy affairs,rather like moving tableaux.This is certainly one of the problems of this film.It is based on a stage play and very little has been done to open out the film.The brief scenes of the charge of the light brigade are clearly stock shots probably provided by another producer.The film lasts around 100 minutes and it does seem rather wordy and overlong.It manages to introduce a very lackluster and chaste romance with Michael Wilding.The fact that the director and star were now well into middle age and they now lacked the vivacious that marked the beginning of their partnership.This is a long forgotten film and it probably deserves to be.","user":"malcolmgsw","rank":[4,8]}]