[{"title":"\"Still I Always Always Keep The Memory Of\"","rating":8,"date":"20 December 2007","review":"With a fluff plot that's sillier than usual, Shall We Dance marks the one and only time the brothers Gershwin wrote a score for an Astaire/ Rogers musical. Fred was certainly no stranger to George and Ira, they had written Funny Face on Broadway for him and also had done Damsel in Distress which he co-starred with Joan Fontaine the year before.<br><br>This also is the last complete score the Gershwins did for the screen. While writing the score for the Goldwyn Follies, George would suddenly die of a brain tumor. It's a beautiful selection of songs, topped off by They Can't Take That Away From Me, a song forever after identified with Fred Astaire. It's also one of my favorite Gershwin songs, in fact one of my favorites period.<br><br>Fred's a hoofer at heart, but he's pretending to be a Russian ballet star named Petrov, appropriate for a guy named Peter Peters in real life. The girl he's infatuated with, musical comedy star Ginger Rogers is sailing to America on the same ship.<br><br>Through an incredible combination of circumstances rumor gets around that the two of them are in fact married. All the doing of her producer Jerome Cowan and Fred's manager Edward Everett Horton. They actually have to get married to keep the ruse going. Of course I needn't say what happens after that.<br><br>Two other Gershwin standards, They All Laughed and Nice Work If You Can Get It are sung and danced by the pair, the latter on roller skates. I also liked Fred's solo number with the engine room men on the ocean liner, Slap That Bass. The brothers Gershwin obviously saw the success Astaire had with Bojangles of Harlem in Swing Time and decided to imitate shall we say. <br><br>Look for a nice performance also by Eric Blore who plays the frustrated hotel manager who is getting positively flustered about how to handle the married/unmarried pair of Astaire and Rogers in his hotel.<br><br>There is a touch of sadness to this musical realizing that an incredible talent in George Gershwin would be stilled very shortly. I do love that man's music so. <br><br>You'll keep the memory of this film long after seeing it even once.","user":"bkoganbing","rank":[35,36]},{"title":"We shall not only dance, we shall roller-skate ...!","rating":10,"date":"13 April 2003","review":"It was a delight to come across the movie on DVD. 'Shall We Dance' was the only Fred and Ginger movie of 1937 and didn't do as well as previous efforts, making less than half a million dollars profit at the time (ref. 'The RKO Story' by Jewell and Harbin). Obviously I'd never be able to pick a money-maker as I found it totally brilliant from beginning to end! A wonderful sound track and beautiful score - the only one George and Ira Gershwin ever wrote for Fred and Ginger, more's the pity.<br><br>The skimpy story involving romances, misunderstandings and a luxury liner across the Atlantic has been done numerous times but here it seems to work, thanks to the wonderful Eric Blore, Edward Everett Horton and a good supporting cast, with the exception of Ketti Gallian. This lady seems out of place, not unlike the unfortunate Randolph Scott in 'Follow the Fleet'. The musical numbers are a knockout, especially the ship's engine room and roller-skating sequences. Fred plays one of his most endearing parts while Ginger is spellbindingly gorgeous. Viewing a sharp transfer really does show up a lot of things missed when watching less than good prints on television. Ginger's eyes kept me transfixed whenever she appeared :)<br><br>A movie to be viewed, and enjoyed, again and again. As good as 'Swing Time' and not far short of my favourite Fred and Ginger movie, 'Flying Down to Rio'.","user":"opsbooks","rank":[39,41]},{"title":"Who's Got the Last Laugh Now?","rating":8,"date":"18 October 2002","review":"SHALL WE DANCE (RKO Radio, 1937), directed by Mark Sandrich, which reunites Fred Astaire and Ginger Rogers for the seventh time on the musical screen, ventures them into a new world of dance, the art of ballet. While the opening credits focus silhouettes of ballet dancers in the backdrop, the movie itself is not necessarily devoted to ballet, but only a combination of that and modern dance.<br><br>Astaire plays Petrov, an American dancer born under the name of Peter P. Peters of Philadelphia, P.A., who's won fame as a Russian ballet star with the help of his impresario, Jeffrey Baird (Edward Everett Horton). While in Paris, where the first portion of the story takes place, Petrov has fallen in love with Linda Keene (Ginger Rogers), an American dancer whom he hasn't met, but knows of her by profession and still photographs he keeps with him. After Petrov briefly meets Linda in her hotel room, by which he made no impression (especially with that Russian accent that sounds more like Charles Boyer than Mischa Auer!), he soon learns she's leaving Paris setting sail on the Queen Anne bound for New York. In order on getting to know her better, Petrov agrees to an engagement dancing at the Metropolitan only if Jeffrey arranges for him to book passage on the Queen Anne. Before sailing, Petrov is reunited with Lady Denise Tarrington (Ketti Gallian), his former ballet dancing partner whom he now wants out the way. This is done through Jeffrey informing her of that Petrov is a married man with five children. When news of Petrov's marriage reaches the media, compliments of Denise, the passengers, having read of the secret marriage in the ship newspaper, believe Linda Keene, with whom he has been seen, to be the wife. In order to prevent Linda from quitting her dancing career to marry the well-to-do but dull Jim Montgomery (William Brisbane), Arthur Miller (Jerome Cowan), Linda's manager, joins forces with Jeffrey in keeping the marriage and scandal alive through practical jokes. After boarding in New York, Petrov and Linda decide to stop the rumors by actually getting married and then file for divorce. Situations are proved more difficult when Denise comes back to Petrov's life once again.<br><br>A casual reworking and revamping of the earlier Astaire and Rogers themes, SHALL WE DANCE (an appropriate title for them) succeeds on a higher level with a bright score and creative dancing by Astaire than on the flimsy plot. Aside from Horton making his third and final engagement with the team, Eric Blore returns for the fifth and final time playing the bewildered Cecil Flintridge, a New York City hotel floorwalker. The scene where Cecil gets arrested and telephones for Jeffrey to bail him out from the Susquhanna Street Jail, is amusing in itself, a reminder of an Abbott and Costello routine. While Rogers usually has female companions to accompany her, usually middle-aged types as Alice Brady or Helen Broderick (and later Edna May Oliver) for moral support, she has no such bonding here. Jerome Cowan as Arthur Miller steps in for them.<br><br>On the musical program, with words and lyrics by George and Ira Gershwin, the songs include: \"Slap That Bass\" (sung by Mantan Moreland and Fred Astaire); \"Walking the Dog\" (instrumental); \"I've Got Beginner's Luck\" (sung by Fred Astaire); \"They All Laughed\" (sung by Ginger Rogers/ danced by Rogers and Astaire); \"Let's Call the Whole Thing Off\" (sung/ danced by Astaire and Rogers on roller skates); \"They Can't Take That Away From Me\" (sung by Astaire); \"They Can't Take That Away From Me\" (ballet dance with Astaire and Harriet Hoctor); \"Shall We Dance?\" (sung by Astaire/ danced by Astaire and Rogers); and \"They All Laughed\" (reprise by Astaire and Rogers).<br><br>A notch below their previous efforts, SHALL WE DANCE takes a while getting down to business. In fact, Astaire and Rogers don't dance together until almost a hour from the start of the story. After that, the plot moves briskly followed by one good song after another, all standards from the Gershwin songbook. Of the tunes selected for this production, \"They Can't Take That Away From Me\" was nominated for an Academy Award. This is one where Astaire sings to Rogers in the foggy night on the Staten Island ferry. It's not followed by a dance but a sentimental gesture well handled by Rogers. Other than Astaire's dancing in the steam room surrounded by black stokers, another memorable moment occurs with \"Let's Call the Whole Thing Off\" where Astaire and Rogers dance on roller skates in Central Park. One wonders what they could have done on ice skates to compete with the recent performer, Sonja Henie, of 20th Century-Fox musicals? After a lengthy ballet sequence featuring Astaire and Harriet Hoctor (who arches her head to her heals dancing like a swan), it returns to familiar territory when Rogers steps in for the \"Shall We Dance?\" number.<br><br>One final note. Ketti Gallian, whose brief Hollywood movie career was coming to a close, usually a blonde now seen here as a brunette, playing Petrov's former ballet partner. While her part is relatively small, with scenes occurring in the beginning and near the conclusion, it's a wonder why Harriet Hoctor does the ballet dancing instead of Gallian, or why Hoctor didn't assume the role of Denise so not to add to the confusion? Overlooking this and other minor flaws as to the drawn-out double-takes between Horton and Blore, SHALL WE DANCE, is true to its word in title, especially during the film's second half. SHALL WE DANCE, distributed to home video and DVD, and formerly presented on American Movie Classics, can be found on Turner Classic Movies. (***1/2)","user":"lugonian","rank":[23,25]}]