[{"title":"Please put MST3K reviews in the MST3K section!","rating":10,"date":"8 February 2012","review":"I'm a big fan of MST3K, but some of their film choices are not good. 'This Island Earth', 'Son of Godzilla' and 'I Was a Teenage Werewolf' are all classic films, and while I have no problems with that, it appears that people that post reviews on here only see the MST3K versions, and skew the film ratings on this site. Bear in mind that MST3K often use badly edited, washed out and, in the case of foreign language film, badly dubbed (by Americans) copies of films. I suggest that people post reviews of MST3K episodes on the appropriate page on here (ie the page devoted to each episode of MST3K).<br><br>On to Projected Man itself, it's a decent take on the matter- transmitter-gone-wrong theme first seen in The Fly nearly ten years earlier. In truth, the influence was more likely the British sequel, Curse of the Fly, made one year earlier. <br><br>Bryant Haliday makes for a good twisted (both mentally and physically) villain. The main problem with the film is that nothing interesting is really done with the monster, although there are a few creepy scenes, including the claiming of his first victims. This would be fine if the concept of the matter transmitter was original, but obviously it isn't. But at least Doctor Who fans will enjoy seeing Ronald Crisp (from The Dominators/Ambassadors of Death).<br><br>Overall, an average film, which I'd normally give a six, but due to it's ridiculously low rating on here, I've given it a ten.","user":"darkwebonline","rank":[12,15]},{"title":"shocked at how hard everyone is on this movie","rating":8,"date":"10 May 2007","review":"This movie is no sci-fi/horror masterpiece by any stretch of the imagination. But it is far better than most of the reviewers on IMDb would have you believe. It was originally released here in the USA on the second half of a double bill with the somewhat better ISLAND OF TERROR with Peter Cushing. I convinced my dad to take me to the drive- in for the bill when it was released, but it was a school night and he wouldn't tumble to staying for the second feature. Since then, it has been notoriously hard to track down. I finally saw it about a year ago and was surprised on how entertaining it was, especially considering how I had read various disparaging things about it in the interim. It does borrow elements from the earlier FLY pictures as well as the Karloff film, THE INVISIBLE RAY, and is by no means particularly original. However, since when does that really detract from the enjoyment factor of a low budget, sci-fi monster film? For the most part, you better resign yourself to that going in, or else stop watching films altogether. In its favor, it does move at a fast pace, has decent actors and color cinematography, some nice grisly shocks and certainly decent effects for a low budget sixties film from England. An added bonus, there is a distinctly assertive heroine scientist played by Mary Peach, a character who remains in possession of her wits, and aggressively intelligent without being obnoxious (her character is the sympathetic colleague of Bryant Halliday who becomes the tragically disfigured, death-dealing PROJECTED MAN) Undeserving of its bad rep.","user":"chrisdfilm","rank":[17,23]},{"title":"Oops! Fried a guy!!","rating":6,"date":"18 January 2006","review":"Scientist has terrible accident with his teleportation device and ends up horribly disfigured and with the power to electrocute people with his hand!<br><br>Intriguing enough science-gone-wrong thriller from Britain. There's some decent suspense and occasional shock (no pun intended) to be had. The cast isn't half bad, star Bryant Haliday is the best as both the films tragic hero and semi-frightening villain. The makeup work on Haliday isn't half bad. Nice dramatic music score as well.<br><br>Over all a decent enough sci-fi flick, but it doesn't match The Fly.<br><br>** 1/2 out of ****","user":"Nightman85","rank":[6,7]}]