[{"title":"Underrated and charming 80's teen flick","rating":8,"date":"29 September 2002","review":"Most 80's teen flicks leave a rather sick feeling in my stomach, but this one has always been a favorite despite the stereotypical shallow, big-haired girls and the Animal House wanna-be jocks. The difference is that the stars, Patrick Dempsey and Amanda Peterson, are not so stereotypical in their roles as lonely nerd and ultra-popular head cheerleader.<br><br>Patrick Dempsey has always been underrated as an actor with style, and it is unfortunate that his character, Ronald, is so unlikable after the film's premise kicks in. Ronald goes \"from geek to chic\" and back again. But Dempsey himself seems too inherently confident to really pull off the geek aspect believably, and he's too cruel to the girl whose heart he won for Ronald to be a truly sympathetic character. The hip version of Ronald, however, is a hoot to watch, even if it is somewhat overdone in the context of an already unlikely plot. <br><br>The standout in this film is Amanda Peterson, whose character Cindy has to be one of the most genuinely likeable \"stuck up\" high school girls on film. Watching her character grow and open her heart to Ronald is the main reason I've given this film repeated viewings. Although the genres are quite different, I'd compare Peterson's character to Renee Zellweger's character in Jerry MaGuire in terms of sheer likability. Making characters likeable is much more difficult than making them sympathetic, and I'm frankly shocked that Peterson's career did not skyrocket after this performance.<br><br>Whether you're looking for creative ways to invest $1000 or dancing lessons, Can't Buy Me Love is one 80's teen flick that has a lot to offer.","user":"fineanimal","rank":[37,37]},{"title":"The High School Caste System","rating":8,"date":"25 April 2004","review":"Can't Buy Me Love is a sweet romantic comedy that's still great after all these years. What was the reason for making an exact replica of the film (Love Don't Cost A Thing) except geared for young black audiences? Why not just make an original romantic comedy altogether instead of trying to replicate this particular teen movie? I hate remakes. <br><br>Can't Buy Me Love ridicules the high school caste system--that popular kids are the invincible social class that other social groups strive to be part of, but are limited by the \"understood\" rigid rules of their place among the social system. <br><br>Ronald (Patrick Dempsey) is supposed to be the hopeless nerd. He's a quiet kid that flocks with loners (one of them being the cool Max Perlich). Ronald is in love with senior cheerleader, Cindy Mancini (Amanda Peterson). As the popular, rich cheerleader, she is definitely hands off for Ronald. Ronald wants the girl. He wants to be popular. Is it possible for the geek to transcend his expected role in the game of high school social groups? Definitely, but for Ronald, the consequences are disasturous and also conducive to helping Ronald straighten out his priorities of friendship, love, and the like. Is he willing to trade it all in for popularity and all the superficiality that comes with it?<br><br>Ronald's opportunity arrives when Cindy stumbles into the mall one day looking to return or exchange her mother's outfit stained with wine thanks to Cindy, who wasn't supposed to be wearing it, anways. The price of a new outfit: $1,000. So, Ronald, who happens to have that cash since he was saving up for a telescope, makes Cindy an offer: to pretend to be his girlfriend for a month. Ronald expects that this will give him just the popularity he wants. To be a high school senior, friends with Cindy, and make the A List? For Ronald, that's all he wants. <br><br>Cindy's grossed out by the idea at first, not wanting to be scene with Donald (as she constantly mistakens his name). But with the Mancini make over, Ronald's on his way to being the new stud on campus. One month later, Ronald is rubbing elbows with Cindy's senior friends, cheerleaders Barbara and Patti and and jocks Big John and Ricky. But, Ronald, in his transition, seemed to forgot that what he wanted all along was a date with Cindy Mancini, who's makeover has turned Ronald into some kind of monster. Ronald doesn't only push Cindy away, but also his closest friend, Kenneth (Courtney Gains) and the rest of his old crowd of friends who hate their friend's newfound social life. But, how far is Ronald willing to go? And how long can he live down the lie?<br><br>It was one of three good movies Dempsey made in 1987, along with Loverboy and In the Mood (actually the latter is better than the former), all being cute romantic comedies. But I think Can't Buy Me Love will always be my favorite. Patrick Dempsey, Amanda Peterson, Seth Green (who plays Ronald's little brother, Chuckie), or hell, even Max Perlich fans, are certain to like this movie. It's got good style for the 80s too and hot teen cast. I still think it is one of the top 80s teen comedies.","user":"vertigo_14","rank":[33,33]},{"title":"80's Entertainment At Its Best","rating":8,"date":"8 March 1999","review":"I love those cheesy 80's teenage love stories.  They are fun and entertaining.  \"Can't Buy Me Love\" is one of the better ones for sure.  It is one of those movies that you can watch over and over and still love it. The story is interesting and the performances are great. Amanda Peterson is fantastic as the high-priced yet emotionally repressed love interest of lawnboy Patrick Dempsey.  The story is funny and moving and can even make you cry.  Watch it with friends, watch it alone, watch it with someone you love and remember the pressures of high school and the friends that got you through it.","user":"Casa2000","rank":[41,44]}]