[{"title":"Laughably awful exploitation romp","rating":6,"date":"17 November 2002","review":"Michele Massimo Tarantini's NUDO E SELVAGGIO aka MASSACRE IN DINOSAUR VALLEY (Italy and Brazil, 1985) belongs to the category it's so damn bad it becomes totally enjoyable for fans of low budget trash cinema. The film is written by Tarantini, too, and some sources mention that also Dardano Sacchetti (the man responsible for many Fulci scripts) worked as a writer in this film, uncredited. Still most of Sacchetti's screenplays are much better and professional than this so I think he didn't do too much for this film after all.<br><br>In DINOSAUR VALLEY, Michael Sopkiw (BLASTFIGHTER (1985), 2019 BEFORE THE FALL OF NEW YORK (1983) etc.) stars as our Indiana Jones like hero who collects dinosaur bones and sells them to those who pay him much. He travels to Brazil and is willing to search for the bones there. There he gets to know an older doctor and his daughter, who are also going to the jungle alongside a photographer, his two almost naked female models and a traumatized Vietnam veteran and his more than annoying and paranoid wife. Now that sounds a hilarious cast doesn't it? It is as wild and laughable as it sounds, so the fanatics of trash cinema will love DINOSAUR VALLEY.<br><br>\nAfter their plane crashes (unbelievably funny scene by he way!), the fun and the so called plot begins. The most interesting thing in the cast is easily Suzane Carvalho who belongs to the most memorable beauties I've seen in any of these exploitation films of the 70's and 80's. She plays the part of the doctor's daughter, and her beauty steels the whole show. Her eyes are like chocolate balls waiting to be eaten. There are some other beauties in films of this kind like Uschi Glass (Umberto Lenzi's SEVEN BLOOD STAINED ORCHIDS, 1971)), Glory Annen (Norman J. Warren's PREY, 1978) and Olivia Hussey (Brian Trenchard-Smith's outrageous BLOOD CAMP THATCHER aka TURKEY SHOOT, 1981) but Suzane in DINOSAUR VALLEY is easily the most beautiful angel of all.<br><br>Sopkiw is as bad as can be expected and that goes to the acting in general in this film, too. The acting is so bad at times that one might wonder if they did it in purpose because it seems unlikely that somebody really \"acted\" that bad while trying to act good and believably. That of course adds to the enjoyment this junk gives and DINOSAUR VALLEY is easily to these jungle adventures (CUT AND RUN (1985), THE CATHERINE MILES STORY (1986), TREASURE OF THE AMAZON (1985) etc.) the same as Ivan Katansky's ridiculous Italian sleaze fest BEAST IN HEAT (1977) is for nazi exploitation and WIP films. All those who've seen BEAST really know what I'm talking about.<br><br>DINOSAUR has plenty of gratuitous sex, nudity and gore which can also be expected from these films. The sex and nudity-o-meter is very high and there are some shots of naked females that go farther than I expected so the makers noticeably wanted to \"deliver the goods\" big time with this film. The same thing is with the gore as there are the usual scenes of blood letting and people being killed in gory manner as the dangers of the jungle like piranhas and leeches attack the unhappy travellers as well as the hungry cannibals who happen to live there, too. Also, they soon find out that the jungle is terrorized by some sleazy slave ring led by a fat and horny dirtbag whose fate in a film like this isn't too hard to guess.<br><br>\nPretty much all the characters in the film are more or less disgusting and evil and there are some unbelievably sleazy scenes like the relationship between the war veteran and his wife as well as the laughably lusty men who, trapped in the jungle surrounded by different dangers, don't seem to be able to keep their eyes off the almost naked females and thus giving the camera man an excuse to give couple of close ups! Can it be even more exploitative and over-the-top sleazy than this?!<br><br>The settings in the Brazil jungles are very nice and beautiful as can be expected and that is perhaps the only positive and noteworthy cinematic achievement that can be found in this film. The water and trees are shot very lively and peacefully and it creates a nice atmosphere, and the overall beauty of nature is pretty stunning, and even the loathsome characters and goings-on cannot disturb that. The music score (the synthesizer one) is also worth mentioning and it is very simple but effective in the tradition of Carpenter's HALLOWEEN score.<br><br>After all, DINOSAUR VALLEY is almost perfect exploitation trash romp but the viewer really has to \"understand\" and love the genre in order to come to this conclusion. If you try to show this film to anyone with \"normal taste\" for cinema, you are guaranteed to be recommended to visit a mental hospital to get some help, because these films are so far away from what is considered as acceptable or correct in mainstream (and \"normal\") cinema. I give DINOSAUR VALLEY 6/10 as a fan of this cheesy genre.","user":"Bogey Man","rank":[17,19]},{"title":"let's jump in this piranha infested water for our fight","rating":6,"date":"28 May 2005","review":"An anthropologist, Vietnam vet, his bitchy lush wife, scientist, his daughter, and two fashion models(??!?) on their way to dig up some fossils on Dinosuar island (there's no dinosaurs in the movie, don't worry, it's just a name) crash land in the midst of a jungle and must contend with various obstacles to their survival including cannibals, wild animals, and various other things. This movie is so goofily cheesy that I couldn't help but to enjoy it. Lots of gore as well as T&amp;A (and some bush too) make this film go down so much easier. Add to that many quotable lines and you have a good bad movie.<br><br>My Grade: C+","user":"movieman_kev","rank":[13,16]},{"title":"What can I say- I enjoyed it.","rating":22,"date":"22 April 2004","review":"The copy that I borrowed from a friend is titled \"Amazonas\".  I have been a friend of all the Italian gore films, so that is why I checked it out. It has adventure, sex, and gore. It sort of reminded me of Emanuelle and the Last Cannibals in that it goes a little farther in the sex scenes then your average adventure movie. The copy I have is the uncut unrated version. So if there is a rated R version, I can imagine it just wouldn't have the same edge that the unrated version has.","user":"ericdetrick2002","rank":[11,15]}]