[{"title":"Brilliant from alarm bell to chopsticks","rating":10,"date":"18 July 2001","review":"Pickup On South Street is one of the most brilliant movies ever made. An example of the directing: When Candy (Jean Peters) starts going through her purse and notices her wallet is missing, an alarm goes off in the background in the building she's in -- as if it's an alarm going off in her head. It's not cartoon-like -- it's subtly woven into the background in a way that strikes you on a subconscious level until you've seen the film a few times and it just \"clicks\" that there's an alarm bell going off when she starts frantically going through her bag.<br><br>Richard Widmark is way on top of his game as a smart-alec -- he's really great -- but the highlight performance of the film was the first scene for \"Moe,\" the street peddler/informer, played by Thelma Ritter. Later, in her apartment, you are not seeing a movie -- you're seeing a real person. I've never seen anyone \"act\" so real I felt like I was looking into a real room until Ritter's performance -- right down to the way her hair stuck out a bit when she removed her hat. <br><br>About a million other things just *worked,* from the way Lightning Louie picks up money with his chopsticks to the way Candy's jewelry clicks when she flicks Moe's hand away from her brooch, to the way Moe gets the dollars and change from the police captain across the FBI guy's chest -- and even the way the captain opens his filing cabinet, like he's been doing it in that way in that room for many years. \"Pickup On South Street\" is detailed moves (directing) with consummate performances (acting) and superb now-nostalgic visuals of the day, such as the panel truck, the boards leading to the shack out on the water, the dumbwaiter, -- and the unforgettable place Skip stashes his pocket pickings. Wonderful stuff.<br><br>\"Pickup On South Street\" is also one of the few movies where, even though the characters aren't perfect, you do care about them -- perhaps because they have been somewhat branded by their pasts in ways that are hard to escape: Skip as a \"three-time loser\" and Candy as a youngish woman who has \"knocked around\" a lot. When these people behave a little more badly than you'd expect, it's in sort of novel ways that make it seem you're looking in at people you'd never otherwise imagine -- and yet you know that they are possible because the actors make them so recognizably human.","user":"Rebecca Rohan","rank":[101,110]},{"title":"Grifters, B-girls, secret microfilm: great ingredients for film noir...","rating":7,"date":"29 October 2005","review":"Director Samuel Fuller concocts a brilliant visual set-up to this gritty story: cocky pickpocket unwittingly lifts some microfilm from a woman's purse; it turns out she's a courier for the Communists, and now they are both being watched by the police. The noir formula in all its 1950s glory--before the ingredients became clichés--including waterfront locales, floozies, saxophones on the soundtrack, and one hell of a climactic fistfight. Performances by Richard Widmark and Jean Peters are right on target, and the smart, sharp script is quite colorful. Fabulous Thelma Ritter received an Oscar nomination for knockout supporting role as a \"professional stoolie\". Exciting, atmospheric, tough as nails. *** from ****","user":"moonspinner55","rank":[36,40]},{"title":"\"Everyone Has A Price\"","rating":9,"date":"4 January 1999","review":"In this excellent Twentieth-Century Fox film-noir, the metropolis is a labyrinth of despair in which scavengers and predators survive by living off one another.  Brooding cityscapes lower over puny humanity in bleak expressionist symbolism.<br><br>A prostitute has her purse snatched on the subway.  It contains a microfilm, and a communist spy ring will go to any lengths to recover it. Two parallel investigations unfold as both spies and cops hunt down the precious information.<br><br>Anti-hero pickpocket Skip McCoy is played with scornful assurance by Richard Widmark.  He knows the cops to be his moral equals and intellectual inferiors, so he taunts them: \"Go on,\" he says to captain Dan Tiger (Murvyn Vye), \"drum up a charge.  Throw me in.  You've done it before.\"  In this pitiless world, the cops are just one more gang on the streets.  Just as Candy the hooker bribes Lightning Louie to get a lead, so the police are busy paying stool pigeons for information.<br><br>It is hard to believe that when Widmark made this film he was already in early middle age.  The 39-year-old star, coming to the end of his contract with Fox, plays the upstart Skip McCoy with the irreverent brashness of a teenager.  Today it may not be acceptable for the romantic lead to punch his love interest into unconsciousness then revive her by sloshing beer in her face, but by the mores of the period it signified toughness - and Candy, after all, is a fallen woman.<br><br>Jean Peters is radiant as Candy.  Here, right in the middle of her five-year burst of B-movie fame, she is beautiful and engaging as the whore with the golden heart.  She is the story's victim, a martyr to her beauty as much as anything else.  She means well, but is constantly being manipulated by cynical men - Joey, Skip and the cops.<br><br>The real star of this movie is New York.  Haunting urban panoramas and snidering subway stations offer a claustrophobic evocation of the city as a living, malevolent force.  Like maggots in a rotting cheese, human figures scurry through the city's byways.  Elevators, subway turnstiles, sidewalks - even a dumb waiter act as conduits for the flow of corrupt humanity.  People cling to any niche that affords safety: Moe has her grimy rented room, Skip his tenebrous shack on the Hudson River.  As the characters move and interact, they are framed by bridge architecture, or lattices of girders, or are divided by hanging winch tackle.  The personality of the city is constantly imposing itself.  The angles and crossbeams of the wharf timbers are an echo of the gridiron street plan, and the card-index cabinets in the squadroom mimic the Manhattan skyline.  When Joey's exit from the subway is barred, it is as if the steel sinews of the city are ensnaring him.<br><br>A surprising proportion of this film is shot in extreme close-up. Character drives the plot, as it should, and the close-ups are used to augment character.  When Skip interrogates Candy, the close-up captures the sexual energy between them, belying the hostility of Skip's words.  Jean Peters' beauty is painted in light, in exquisite soft focus close-ups.  The device is also employed to heighten the tension.  The opening sequence, the purse snatch, contains no dialogue: the drama relies entirely on close-up for its powerful effect.<br><br>Snoopers, and snoopers upon snoopers, populate the film.  Moe (Thelma Ritter) makes a living as an informant, and her place in the hierarchy is accepted, even by her victims.  When Skip observes, \"she's gotta eat\", he is chanting a recurring refrain.  Just as 'straight' New Yorkers peddle lamb chops or lumber, the Underworld traffics in the commodity of information.<br><br>And yet even the stool pigeons are superior to Joey and his communist friends.  Joey's feet on Moe's bed symbolise a transgression of the most basic moral code.  Joey is beyond the pale.  Moe will not trade with Joey, even to preserve her life: \" ... even in our crummy business, you gotta draw the line somewhere.\"<br><br>\n\"Pick-Up\" was made in the depths of the Cold War.  Richard Nixon had just been chosen as the Republican vice-presidential candidate, having made his name with his phoney Alger Hiss expose - bogus communist microfilm and all.  The McCarthy show trials were a daily reality.  We see the cops in the movie inveigh against \"the traitors who gave Stalin the A-bomb\".<br><br>New York can be seen as a giant receptacle in which human offal cheats, squeals and murders.  Containers form a leitmotif throughout the film.  Moe carries her trade mark box of ties, and candy's purse, container of the microfilm, is the engine of the plot.  Skip keeps his only possessions in a submerged crate, symbolising his secretive street-wisdom.  The paupers' coffins, moving down the Hudson on a barge, are containers of just one more cargo being shifted around the pitiless metropolis.<br><br>The film is a masterpiece of composition.  Candy is shown above the skulking Skip on the rickety gangway of the shack, signifying her moral ascendancy.  When the gun is placed on the table, the extreme perspective makes it look bigger than Candy - violence is beginning to dwarf compassion. The lovers are eclipsed by the shadow of a stevedore's hook, reminding us that their love is neither pure nor absolute, but contingent upon the whims of the sinister city.  Enyard the communist is a shadow on a wall, or a disembodied puff of cigarette smoke.  He is like the lone alley cat amongst the garbage - a predatory phantom of the night.  Camera shots from under taxi hoods, inside newspaper kiosks and through the bars of hospital beds constantly reinforce in us the awareness that we are all trapped in the metropolis.  We are civilisation's mulch.","user":"stryker-5","rank":[86,107]}]