[{"title":"A Lovely, Special Film (possible spoilers)","rating":24,"date":"24 May 2004","review":"\"That's My Man\" is among Borzage's most unfairly neglected works in his late period, a fact that belies Andrew Sarris's assertion that Borzage's only great film in the 40s had been \"Moonrise\". <br><br>It was the director's second film for Republic Pictures after \"I've Always Loved You\"(1946); and I loved it as much as any Borzage classic I have seen. And despite the numerous claims that Borzage was not completely pleased with his tenure at Republic, it becomes something really special &amp; endearing with repeated viewings. <br><br>The story is not completely original - poor man has a dream of running a horse; fulfillment of dream causes him to lose values; downturn in his fortune causes him to realize what he truly cares about - but it's a believable and valid one. And Borzage directs it with great sensitivity in a number of fine and beautifully acted scenes. The one that stands out in my mind is in the beginning - Don Ameche and Catherine McLeod's wistfully romantic conversation the night they first meet in the darkened apartment. They both reflect about life and then Ameche utters some poignantly philosophical words about the world and how everything in it is just perfect.<br><br>The film is beautifully directed; there is tenderness and a subdued tone to it that I find very endearing. It is very moving, but also very cuddly and joyous. The black-and-white photography is characteristic of Borzage: haunting, painterly and expressive, and makes effective use of late 1940s film noir-style lighting. <br><br>I also liked the memorable score; the use of the lovely old song \"My Wonderful One\" was effective. There's a gentle sadness and nostalgic feel to the song, and captures the atmosphere marvelously.<br><br>The performances are top-notch. Ameche, whom I have always admired all along, underplays masterfully. I love his touchingly sensitive recitation of his son's favorite poem when the boy is ill at the hospital, and the moment when he quietly speaks to his horse \"Gallant Man\" after the inevitable victory. <br><br>McLeod is fine too. \"I've Always Loved You\" had been her first leading role; and again she comes off divinely in \"That's My Man.\" Roscoe Karns as the cab driver &amp; Ameche's pal who narrates the first half of the story to a stranger is given an adequate supporting role to display his quirky comic talents.<br><br>While \"Moonrise\" and \"I've Always Loved You\" may have a significant edge as far as the critics are concerned, \"That's My Man\" ranks, to my mind, very close to the director's best in quality. A lovely and special film.","user":"Kalaman","rank":[14,14]},{"title":"Forties weepy not without interest.","rating":13,"date":"13 January 2003","review":"Even at the tail end of their careers in regular employment, Ameche and Borzage don't let Republic's formula, tear jerker, horse picture totally defeat them. The triple punch still connects - in the card game with Ridgely, speaking the sentimental song to the sick child and the big race.<br><br> The production values are very 'forties with the use of studio setting and back projection nearly as much a distraction as the fashions.<br><br> It's nice to see Roscoe Karns get a substantial part.","user":"Mozjoukine","rank":[5,7]},{"title":"Well made, but slow paced and overly sentimental","rating":5,"date":"5 January 2015","review":"Sweet, sentimental romantic drama about a good man who sincerely loves his wife but who's gambling addiction continually sabotages their relationship. The first 20 minutes or so is fun and engaging meet-cute romantic comedy, but then the movie turns dark.<br><br>In 2014 the film became available for the first time on DVD in it's original length. After initial release in 1947, had only been seen rarely and in a heavily edited version. The DVD image and sound are fairly good; it looks to be a new video transfer made from a decent quality archival print.<br><br>The production looks surprisingly plush, given it was made for Republic Pictures.<br><br>I found the film well acted, especially by Don Ameche, whose unusual for him, calm and underplayed performance made the story a lot more credible than it would have been otherwise. The female lead gave a believable performance, but lacked star quality that would have made her character's tribulations more watchable.<br><br>Unfortunately, I found the film slow moving and overly sentimental. I became bored, especially with the overly repetitious plot.","user":"pacificgroove-315-494931","rank":[3,4]}]