[{"title":"When \"Pinocchio\" came out it was suddenly apparent that \"Snow White\" had been a mere ranging shot.","rating":10,"date":"16 August 2000","review":"There are a hundred great things about \"Pinocchio\".  Pleasure Island, for one.  I'm amazed how quick the Disney artists were to discover that the multiplane camera, as well as providing accurate perspective and spectacular landscape shots, could be used more subtly to suggest sinister murk.  (We get a similar effect in \"Fantasia\" in the first half of \"The Rite of Spring\".)  And Lampwick's transformation into a donkey is a disturbing moment, for many reasons ... today they might have made the mistake of using flashy computer morphing, which would have been a mistake: expert animation and cutting gives us the distinct impression - almost all done with shadows - that there is a donkey BREAKING THROUGH from inside; which, in his case, is metaphorically accurate.  (Probably the reason Pinocchio survives us that he is as free from native vice as from native virtue.  He must LEARN to adopt the mind-set of Pleasure Island.  This takes time: time enough for him to escape.)<br><br>But there's much, much more: clever use of songs (note the obvious, but none the less effective, irony of \"I've Got No Strings\"); daring use of stark WHITE backgrounds as well dense crowded ones; an intelligent, mythic story; a wonderful dash of humanity in the form of a cricket; a good musical score; rich atmosphere.  The last is hard to describe.  Of all Disney's films this one has the most pronounced Old World feeling, yet it doesn't seem to take place anywhere in particular - not even in Italy.  Nor does it seem to take place in any particular era.  I fear that no modern film could be so imprecisely evocative; the artistic innocence in which \"Pinocchio\" was forged may be lost forever.","user":"Spleen","rank":[69,74]},{"title":"Tough To Beat These First Disney Efforts","rating":8,"date":"5 July 2006","review":"When I - and I assume, most people - think of Pinocchio, we think of his nose growing longer when he tells a lie. Yet, that is only one scene in this movie - the first one ever done on this famous fictional character, I believe.<br><br>This is strictly a fantasy-adventure story, not a parable or a full story about lying, although that obviously is one of the messages. There are several moral messages in here, so it's a worthwhile story for kids to see.<br><br>Sometimes I think these totally-innocent first few Disney efforts (Bambi, Fantasia) are still better than all the stuff they have put out since.<br><br>The colorful scenes are another attraction. particularly in the beginning in the old man's house with all the fancy clocks and toys. That part is better than much of the adventure story, as it turns out. The story lags a bit in the middle and then picks up with a rousing finish with a big whale. <br><br>Overall, I enjoyed \"Jiminy Cricket\" the best and also appreciated that they didn't overdo the songs in here: short and sweet, and not that many. They don't make 'em (normally) like they used to!!","user":"ccthemovieman-1","rank":[46,49]},{"title":"Wonderful","rating":10,"date":"17 February 2001","review":"Last night I watched Pinocchio, Disney's second feature-length film and in my opinion one of the studio's best features. Based on the 19th century book by Carlo Collodi, but not half as unpleasant, Pinocchio combines winning animation with great humor and excitement. There are songs, but they're never like the huge production numbers that last four minutes and feature the voice of some up-and-coming princess of pop (who'll be gone in a year) that the studio later adopted with the applicable exception of When you Wish Upon a Star. My favorite song is \"Little Wooden Head\" which is featured in the beginning and is a truly wonderful scene as Gepetto and Figaro play happily with the new puppet.<br><br>The movie takes a sadistic, cruel, heartless little wooden boy (Collodi's character) and turns him into an interesting, 3-dimensional kid with a good heart but who is weak-willed and doesn't always listen to reason. The animation makes brilliant use of the multiplane camera, featuring a sprawling opening sequence in which the viewer practically sees the entire village at night. The characters are colorful and fun (I especially love Honest John Foulfellow and his sidekick Gideon) and the story has never a dull moment. This film is a reminder of the sort of efforts Disney put int o their films; the man himself had a great storytelling passion that was lost in later works (Alice in Wonderland, 101 Dalmatians). Pinocchio was never as famous as some of the others, and this is unfortunate because it is his masterpiece.","user":"Studio Morye Reviews","rank":[50,54]}]