[{"title":"Yellowish","rating":8,"date":"5 January 2005","review":"After the success of \"The V.I.P.s\" the year before, Anthony Asquith and Terence Rattigan are at it again with uneven results. The excuse this time is a Rolls Royce that passes hands from star to star. It is a formula used before many times, most successfully in Julian Duvivier's \"Tales of Manhattan\" in which a dinner jacket plays an important part in the destinies of Edward G Robinson, Charles Laughton, Henry Fonda and Paul Robson among others. More recently the formula was used by John Badham in his \"The Gun\" and then Martin Donovan in the lyrically powerful \"Seeds of Tragedy\" in which the Rolls Royce there is cocaine. Terence Rattigan was master at dialogue and his characters tended to move in confined spaces, take \"Separated Tables\" for instance. In \"The Yellow Rolls Royce\" we travel from England to Italy to Eastern Europe and the only confinement Rattigan finds for his characters is the interior of the luxury car. On the first segment, Rex Harrison and Jeanne Moreau show Rattigan at his best, they are great fun to watch. Harrison, playing a big shot at the foreign office, does wonderful things with Rattigan's words. On the second episode Shirley MacLaine and Art Cartney are lovely as a gangster's moll and her minder but the Italo-American gangster, as played by George C Scott, is so over the top that, practically, sinks the whole little segment. French star Alain Delon plays an Italian gigolo of sorts. He is beautiful to look at but hopeless at delivering Rattigan's lines. On the third episode Ingrid Bergman plays Ingrid Bergman, beautifully and Omar Shariff plays Omar Shariff, just as beautifully. Joyce Grenfell plays a cameo as Bergman's companion, as usually, when she's on, she steals the scene. As you may have gathered, this is the kind of picture that one would enjoy the most on a rainy Sunday afternoon. That in itself is a recommendation.","user":"filmquestint","rank":[68,76]},{"title":"A beautiful, roomy yellow Rolls Royce provides the set for three diverse stories, all of which are a treat to watch!","rating":8,"date":"29 August 2006","review":"What a visual treat to see the scenery of Europe, along with the acting talents of some of my very favorite performers! Three couples own a fabulous car over a period of years, each with a story worth telling. Rex Harrison presents a touching, surprisingly sympathetic husband who loves his wife too much. Jeanne Moreau is the cheating wife, probably the weakest female of the three. In act two, Shirley MacLaine shines as the gangster moll with a heart, who falls in love with the impossibly gorgeous Alain Delon. George C. Scott plays a part totally unlike any of his others, and Art Carney is a sweet cameo.I especially loved the final act of the trio, when aristocratic Ingrid Bergman, in a multi-layered performance, helps resistance fighter Omar Sharif (I could watch him brush his teeth for two hours!) transport his colleagues to safety in Yugoslavia during WWII. The car is almost a character in itself, as is Bergman's little dog, who plays her part with gusto. I especially loved the comedic moments so beautifully played by Ms. Bergman. She and Sharif make a gorgeous, sensitive couple, and are eye candy for those of us who love fanciful, impossible love affairs. A wonderful film for a rainy afternoon.","user":"edwardscampbell","rank":[24,26]},{"title":"Three faces of women and a car for a bedroom","rating":7,"date":"10 April 2002","review":"All the three actresses are beautiful and attractive: some honest and some dishonest. The men remain the drones to the queen bee in all the three episodes.<br><br>Jeanne Moreau is probably the weakest of the trio but elegant in her role as a wife who has a young lover. Shirley Maclaine is the classical stunning dumb blonde who has to make a choice to step into a stable, rich married life. The fascinating Ingrid Bergman chooses to step down from a wealthy peerage to a realistic rustic lifestyle using charming wit for achieving an honest end.<br><br>This is Asquith's last film with Jack Hildyard's cinematography that is patchy but stunning at times. As a film it is average but the casting and the performances of the three ladies and George C Scott are notable.","user":"JuguAbraham","rank":[21,25]}]