[{"title":"Fine Noir","rating":8,"date":"18 April 2008","review":"War veteran Jeff Warren (Glenn Ford) returns home and takes up his old position as a train engineer. One night Warren makes a pass at a friendly woman on a train, but she leaves him in a hurry, next day warren learns that a passenger wass murdered on the train he was travelling on. He is called as a witness at the inquiry. He tells the judge he saw nothing on the train and hides the fact from the judge that he unwittingly made advances on fellow passenger Vicki Buckley, the wife of his co worker Carl Buckley (Broderick Crawford). Warren and Vicki soon hit it off, but soon Warren believes Vicky may have had something to do with the killing. Nice thriller with some great railroad footage, but you might be hard pressed to recognize it as a Lang film. Grahame is especially good in a particularly slutty role","user":"Prof-Hieronymos-Grost","rank":[13,13]},{"title":"Lang's gloomy remake of Renoir's \"La bete humaine\"","rating":4,"date":"4 May 2003","review":"\"Human Desire\" is NOT one of Fritz Lang's masterpieces. Though it has its moments, it ultimately comes off as a second-rate work. A remake of Jean Renoir's 1938 \"La bete Humaine\" starring Jean Gabin, \"Human Desire\" is less successful than Renoir's adaptation of the Zola novel, but when all things considered, it is not bad, and is filled with some interesting geometric images &amp; visuals. The film turns out to be gloomy, often bleak melodrama that has a striking affinity with Billy Wilder's \"Double Indemnity\" in its plot, dealing with a married woman (Gloria Grahame) trying to get rid of her bland husband (Broderick Crawford) through the help of a train engineer (Glenn Ford). If you stop concentrating on the melodramatic plot and focus on Lang's lovely architectural compositions, \"Human Desire\" becomes quite engrossing picture, on par with \"The Big Heat\", Lang's previous film noir with Grahame &amp; Ford. From the first image to the last, the scenes of railroad tracks are masterfully handled: we see a series of precise lines and converging tracks moving forward. Moreover, Grahame and Crawford's rooms in their working class house are characterized by a series of squares, boxes, rectangles to conjure up a nightmarish vision of fate and destiny. <br><br>Also, it is worth noting that in the same house we see the appearance of television for the first time in Lang's films. Lang will later explore the dangers of media manipulation in his last two American films: \"While the City Sleeps\" and \"Beyond a Reasonable Doubt\".","user":"Kalaman","rank":[47,56]},{"title":"You never knew me.","rating":8,"date":"4 April 2011","review":"Human Desire is directed by Fritz Lang and adapted for the screen by Alfred Hayes from the story \"The Human Beast\" written by Émile Zola. It stars Glenn Ford, Gloria Grahame and Broderick Crawford. Music is by Daniele Amfitheatrof and Burnett Guffey is the cinematographer. The story had been filmed twice before, as Die Bestie im Menschen in 1920 and La Bête humaine in 1938.<br><br>The plot revolves around a love triangle axis involving Jeff Warren (Ford), Vicki Buckley (Grahame) and Carl Buckley (Crawford). Crawford's Railroad Marshall gets fired and asks his wife, Viki, to sweet talk one of the yards main investors, John Owens (Grandon Rhodes), into pressuring his yard boss into giving him his job back. But there is a history there, and Carl is beset with jealousy when Viki is away for far too long. It's his jealousy that will start the downward spiral of events that will change their lives forever, with Jeff firmly in the middle of the storm.<br><br>The Production Code of the time ensured that Fritz Lang's take on the Zola novel would be considerably toned down. Thus some of the sex and violence aspects in the narrative give way to suggestion or aftermath. However, for although it may not be in the top tier of Lang's works, it's still an involving and intriguing picture seeping with film noir attributes. It features a couple of wretched characters living a bleak existence, what hope there is is in short supply and pleasures are futile, stymied by jealousy and murder. Thrust in to the middle of such hopelessness is the bastion of good and pure honesty, Jeff Warren, fresh from serving his country in the Korean War. Lusted after by the sweet daughter of his friend and landlord (Kathleen Case and Edgar Buchanan respectively), Jeff, back in employment at the rail yard, has it all going for him. But as the title suggests, human beings are at times at the mercy of their desires, and it's here where Lang enjoys pitting his three main characters against their respective fates. All set to the backdrop of a cold rail yard and the trains that work out of that steely working class place (Guffey's photography in sync with desolation of location and the characters collision course of fate).<br><br>Featuring two of the principal cast from The Big Heat (1953), it's a very well casted picture. Grahame is a revelation as the amoral wife stung by unfulfillment, sleazy yet sexy, Grahame makes Vicki both alluring and sympathetic. Lang had wanted Rita Hayworth for the role, but a child custody case prevented her from leaving the country (much of the film was shot in Canada), so in came Grahame and film noir got another classic femme fatale. Ford could play an everyman in his sleep, so this was an easy role for him to fill, but that's taking nothing away from the quality of his performance, because he's the cooling glue holding the film together. Crawford offers up another in his line of hulking brutes, with this one pitiful as he has anger issues take a hold, his original crime being only that he wants to desperately please his uncaring wife. Strong support comes from Buchanan, Case and Diane DeLaire.<br><br>Adultery, jealousy, murder and passion dwells within Human Desire, a highly accomplished piece of film noir from the gifted Fritz Lang. 7.5/10","user":"hitchcockthelegend","rank":[19,21]}]