[{"title":"Peckinpah's final, haunting eulogy to the West and Westerns","rating":10,"date":"10 March 2005","review":"Simply put, Sam Peckinpah's \"Pat Garrett and Billy the Kid\" is one of the last great Westerns ever made. Like most of 'Bloody' Sam's films, \"Pat Garrett\" was molested and cut by the studio, MGM upon its release. The film would be panned by audiences and critics. It's a shame that Peckinpah never lived to see the longer cut of the film finally released to a wider audience on VHS. It would become a cult hit and is now known as one of the best Westerns and one of Peckinpah's best. <br><br>The film depicts the final days of Billy the Kid (Kris Kristofferson) before he was killed by his friend Pat Garrett (James Coburn), the newly appointed sheriff of the territory. Other than the fine performances of Coburn and Kristofferson, the film also features excellent supporting roles from famous Western regulars and members of Peckinpah's stock of actors. The long list of players include Jason Robards, Bob Dylan (also the film's music composer), Slim Pickens, R.G. Armstrong, L.Q. Jones, Katy Jurado, Paul Fix, Chill Wills, Jack Elam, Harry Dean Stanton, Richard Jaeckel, and Dub Taylor. Most of the characters are killed off in the film, violently evoking both the death of the West and Westerns.<br><br>Peckinpah's two regular themes are here: the death of the West, and men living past their time and deciding whether or not they should accept change. My favorite scene in the film takes place about halfway through the film. Pat Garrett, isolated and alone, is sitting by his fire near a river bank. He sees a man about his age and his family sailing on a raft down the river. The man is shooting bottles for target practice. Garrett takes a shot at a bottle. The man sees Garrett and shoots back. Garrett then takes cover behind the nearby tree. They both are aiming at each, but just lower their guns are stare at each other. The raft continues to flow down the river. The scene, which was the reason why Peckinpah, Coburn, and almost everyone wanted to take part in the film, has so much meaning to it. 1. It references an earlier scene with Garrett and Sheriff Baker (Slim Pickens). Baker was building a boat so he could drift out of territory because of how awful it has become. Tragicaly, Baker does not get a chance to see this dream. 2. The scene also references the shoot-out between Garrett and Black Harris (L.Q. Jones). Before his death, Harris yells to Garrett \"Us old boys shouldn't be doing this to each other.\" The same thing happens between Garrrett and the man on the raft. <br><br>Other than the performances, the film also features some good musical pieces by Dylan. John Coquillon's cinematography is also very beautiful and haunting at the same time. Peckinpah, as always, was able to get period detail down correctly. Rudy Wurlitzer also did a fine job at the screenplay, despite Peckinpah improving most of it himself. Coburn's performance was possibly his best ever. The idea of Garrett having a lot of inner conflict was good. Garrett knew that he had a job to do, but just could not handle the fact it was his friend that he had to kill. Maybe he was the one who put the gun in the outhouse for Billy to use. It was also great to see the myth and actual facts of the last days of this incident played out.<br><br>Although this film may have a few faults (some of Dylan's music and a few of his scenes), \"Pat Garrett and Billy the Kid\" is really worth the time to view now that a DVD will be released on January 10th, 2006. The Two-Disc set will feature two versions of the film. The first one is a 115 min. version editied by Peckinpah biographers Nick Redman and Paul Seydor. The second disc will feature the 122 min. version assembled in 1988. According to both men, there was no final cut to \"Pat Garrett.\" The version that Peckinpah screeded for the MGM heads was just a rough cut. Either way, the DVD will now a new generation of film lovers to be able to view how costly it is when an artist cannot complete his work. Peckinpah and editiors originally had six months to edit, but the idiots from the studio cut it down to two months. I guess the new 115 minute version of the film is closer to Peckinpah's vision because of notes and interviews with the filmmaker's colleagues. No matter which version you will watch, \"Pat Garrett and Billy the Kid\" is a sad but magnificent Western made by one of the last great storytellers of the Western genre.<br><br>Billy: Old Pat...Sheriff Pat Garrett. Sold out to the Sana Fe ring. How does it feel? <br><br>Pat: It feels like...that times have changed. <br><br>Billy: Times maybe. Not me.","user":"j_beaudine","rank":[80,98]},{"title":"A rich, haunting, yet demanding work...","rating":7,"date":"7 July 2000","review":"Peckinpah's \"Pat Garrett and Billy the Kid\" is a rich, haunting, yet demanding work that, above everything else, sees Billy as a creature of his day and age <br><br>He is by no means made a wholly sympathetic character, but who was sympathetic in the New Mexico of 1881? Peckinpah has most of his characters dyed with violence and sniffing the prevailing air of corruptionthe chief protagonists, their filthy henchmen, even the onlookers <br><br>Where and what is the law? No one seems to know or care Garrett and Billy have seen both sides, like almost everyone else<br><br>And among the confusion and violence that is the legacy of range war there is no gleam of purifying light in the efforts we see being made to clean up the territory The powers that be want Billy out of New Mexico, not for ethical reasons, but rather so that things can be neatly protected for the approaching business exploitation<br><br>Garrett is the man made sheriff to hunt him down and thereby the man who compromises . . . 'This country's getting older and I aim to grow old with it ... there's an age in a man's life when he has to consider what's going to happen next.'<br><br>But Billy can't compromise It's not his way \"Billy, they don't like you to be so free!\" proclaims the Bob Dylan theme song, summing up why the power men find Billy so irritating Perhaps that's why Garrett who has sold out to power is in some ways a reluctant hunter He salutes Billy's spirithis very own personal declaration of independencebut he knows it's not the spirit of the new times<br><br>It says much for Peckinpah's way with actors that he gets such admirable performances out of the comparatively inexperienced Kris Kristofferson, as Billy, and Bob Dylan, as Billy's mate It says just as much for his Westerns perceptiveness that he relies even more heavily on experience The well-tried James Coburn is both solid and hard to define as Garrett And then there are the others who know their way around Westerns so wellKaty Jurado, Slim Pickens, R. G. Armstrong, Jason Robards, Jack Elam, Chill Wills There's not a single performance here that isn't a rounded-off portrait in its own right<br><br>It all adds up to a richness in characterization that is matched by the richness of marvelously composed scenes in which interiors and exteriors alike have been put together with loving care and attention to detail, whether it's a big set-piece 'shoot-up' or a close-up of a can of preserveshow such a can looked in 1881<br><br>Garrett's hunt for Billy is told mainly in set-pieces and it has to be said that Peckinpah makes little narrative concession to an audience in the way they are strung together But for the out and out Western fan this is a most memorable movie","user":"Nazi_Fighter_David","rank":[71,90]},{"title":"The death of the Old West","rating":10,"date":"20 February 2000","review":"On the surface, a film about the doomed friendship between the two title characters, Pat Garrett and Billy the Kid is really a film about the death of a way of American life. Death is omni-present in this film, and the compelling aspect of it is that so many of the characters are completely prepared to accept it and deal it out. The best and saddest moments in the film involve characters who know they are going to die and accept it. And the performances are all remarkable. Kristofferson's easygoing and charismatic portrayal of Billy is the best work of his career, as is Coburn's sad-eyed interpretation of Pat Garrett. A wonderful film, almost as good as Peckinpah's masterpiece The Wild Bunch.","user":"contronatura","rank":[41,54]}]