[{"title":"Now THIS is a horror film!","rating":11,"date":"11 May 2003","review":"I just saw this for the first time and more than once while watching it I felt my body go ice cold. This was surely THE DAY AFTER of its time. Presented in a matter-of-fact documentary style it shows people blissfully ignorant of what could happen in the event of a nuclear attack. Sure enough, quicker than you can say \"On The Beach\" an attack comes and the lives of the people who couldn't care less a moment before are changed forever.<br><br>Some scenes are still truly jolting. Looters trying to get away with the only thing of value left in the world, tinned food, are gunned down by expressionless British police. A man displays a shotgun and declares there is only room in his shelter for his family and he will not hesitate to shoot his neighbours if they try to get in. A doctor laments that severely injured people are taken to a \"dying room\" and left to perish without care or pain killers. Bodies are stacked like logs for mass cremation. Shell shocked survivors are so traumatised they just sit and stare. This movie runs only 48 minutes but you will be aware of every second!<br><br>This movie was made in 1965, the year I was born, so I cannot say I understand what the people of that era must have felt but after seeing this I have a rough idea of the mindset of the public in those Cold War days.<br><br>After seeing those US Government produced movies telling people to just hide in their basements for 2 week; after which the U S of A will not only have won a nuclear war but will have put the world back into apple pie order THE WAR GAME is the cinematic equivalent of a sucker punch to the jaw. Watch this film, and then TRY to sleep!","user":"reptilicus","rank":[51,54]},{"title":"Too important to ignore, too powerful to dismiss.","rating":10,"date":"7 September 1999","review":"Although this film clocks in at a mere 48 minutes, not a scene, second or frame is put to waste. A level-headed and all too analytical examination of civil preparedness versus the yield of nuclear weapons. What this film presents is the absolute horror of nuclear war in simulated newsreel footage so realistic, you may feel the pain of those on screen. Fire-storms, asphyxiation, flash-burns, over-burdened hospitals leaving victims to die in pain, street executions under martial law, total social collapse, all filmed in a typical English suburb. Originally planned to be a simple documentary on nuclear warfare made for BBC-TV, the film was banned from television (officially because of it's graphic depictions of suffering, but most likely for it's anti-authoritarian stance and defiance of the official line). Later released to theaters, it went on to win major film awards. Two scenes in particular, one of men being executed for violating water rationing and an interview with children at a medical camp, haunted me for days. This is the great-grandfather of such films as \"Threads\" and \"The Day After\", but the matter-of-fact narration in BBC English to the devastation on screen adds an element of sheer horror that no other film comes close to. If anyone you know talks about the survivability of nuclear attack, show them this film, and watch their reaction. This film is too important to ignore, and too powerful to dismiss.","user":"Baroque","rank":[40,42]},{"title":"Essential viewing","rating":10,"date":"3 September 2004","review":"I saw The War Game thanks to my local branch of CND in 1979 when they showed it in a hall in our town. My mum was vehemently anti-communist so I had to sneak out to see it. The local paper kicked up at 14-year olds being encouraged to see an 'X' film. Was it worth the fuss? Yes, without a doubt. I had already seen Watkin's definitive 'Culloden' earlier that year and was bowled over by the documentary style applied to a drama, but The War Game surpassed even that. I will never forget the scenes of the helmeted English bobbies shooting people in the head to put them out of their misery, or the bucket full of wedding rings or most of all, the line of kids being asked what they wanted to be when they grew up and the replies of 'nuffink.'<br><br>For me, that summed up the futility of war, nuclear or otherwise.<br><br>'Threads' is good, but 'The War Game' is still the best portrayal of a nuclear attack on Britain ever made. It should be shown more often.","user":"glennwalsh44","rank":[44,47]}]