[{"title":"Life is a highway","rating":7,"date":"8 April 2007","review":"I'm a sucker for swinging 60's era flicks, even cheesy ones (because of the great visuals), but I had heard that this film was very so unwatchably BAD that I never made it a priority on my mod movie flicks list. So I am REALLY glad that it popped up on cable just as I was flipping the channels. The story is okay (not great, but not a disaster), the dialog is a little rough at times but not awful, and the tragic ending was a little on the Russ Meyers side. But Marianne Faithful is just STUNNING throughout the movie (any of today's Hollywood starlets WISH they had an ounce of her natural beauty and on-screen presence), Alain Delon is a stone fox, and the dreamy flashbacks provide enough of a plot to make this film, dare I say, enjoyable:) <br><br>Needless to say, not only was I thrilled I caught it on cable, but I was equally pleased to have stumbled upon it TWICE in one week. Definitely adding the DVD to my retro movie collection.","user":"polypam","rank":[24,28]},{"title":"POSSIBLE SPOILER!!! The ending isn't a puzzle at all!","rating":10,"date":"29 May 2006","review":"I feel I must comment on what aimless-46 said in his (or her) review:<br><br>\"The ending is a bit of a puzzle; after the accident they pull up from the scene to a wide aerial shot and you expect the movie to go out on this shot (copied for \"Easy Rider's\" ending), which would have been very effective. Instead they cut to a travelogue-like scene of a European village and go to credits after about 60 seconds of this stuff. It serves no purpose other than to deflate any lasting impact.\"<br><br>Actually the ending is quite clear and extremely effective!<br><br>Earlier in the film, Rebecca daydreams about seeing her lover at 8am. As the clock chimes 8 in Heidelberg, we see Rebecca on her motorcycle traveling the road, parking her bike, running up the garden path to the gazebo and falling into Daniel's arms. She is then pulled out of her daydream (I believe by the tank full of soldiers driving past her on the road) and continues with her \"real\" travel to her lover.<br><br>At the end of the film, this scene is played out again. Once the camera pulls away from Rebecca's crash, we hear the clock begin to chime 8 in Heidelberg. The camera focuses in on the clock, then revisits the same locations that Rebecca had imagined in her daydream, only she is not there. There is a sadness as we see the deserted road where she imagined she would travel, the place where she would have parked her bike, the empty garden path and the gazebo. We see the void she has left behind due to the carelessness leading to her horrible (yet spectacular) crash. And the viewer can't help but be reminded of how she told Daniel the last time they met that she would never come to him again. One wonders how he will take the news of her death, or if he will find out about it at all. Basically it's a meditation on loss and it's really quite moving.<br><br>By the way, it's impossible to see this film and not get the metaphor of a teenage girl's dark sexual awakenings as embodied in the wedding gift of a motorcycle from her lover.<br><br>A groovy soundtrack, leather, whips, motorcycle races, Alpine skiing, free love, fondue, Marianne Faithful getting lashed by a dozen thorny red roses - what a film! Thank you, Mr. Cardiff!","user":"arotolante","rank":[20,23]},{"title":"The European \"Easy Rider\"","rating":7,"date":"19 April 2005","review":"Imagine Diana Rigg joining \"Easy Rider's\" Dennis Hopper and Peter Fonda for a ride across France and Germany and you will have a pretty good idea what \"Girl on a Motorcycle\" looks like. Made one year before \"Easy Rider\"; this is an amazing 1960's road movie that includes hip camera angles, groovy music, a leather suit and a Harley Super Glide.<br><br>While low-budget, it is not a thrown together \"B\" Movie but a thoughtful existential trip inside the mind of a flawed character who happens to be a sexy woman. On close examination, what appears to be yet another fruitless examination of the mysteries of female discontent is really a more expansive study of the human condition. Rebecca, the main character, illustrates life as a process of choosing between comfortable security and the need for freedom and excitement; a daily struggle with guilt and its consequent self-destructiveness, and the seductive lure of risk. Motivations familiar to almost all serious motorcycle riders.<br><br>In voice-over, Marianne Faithful gives us Rebecca's story in a series of flashbacks, with minimal scenes of conventional dialogue. Most of these work very well although there is a ski weekend flashback about midway through the film that looks more like a travel advertisement than a movie scene. And while much of Jack Cardiff's film is beautifully shot, the action sequences are somewhat clumsy looking and obviously low budget. And there is excessive reliance on the Elvis movie technique of projecting moving scenery(shot by the second unit) with the star pretending to be cruising along the road while actually stationary in the studio.<br><br>Cardiff was very creative with the editing and came up with some great match cuts, typically used to bring Faithful out of her frequent flashbacks/dreams. In one we see her lover slowing pulling open the zipper of her suit, then the film cuts to the tread of an Army tank moving past the place where she has been napping by her motorcycle.<br><br>Cardiff's technique was quite revolutionary at the time as his camera has a love affair with the leather suit , the motorcycle, and Faithful's eyes. His extensive use of very tight shots is extremely effective and the most pleasing thing about the film.<br><br>The ending is a bit of a puzzle; after the accident they pull up from the scene to a wide aerial shot and you expect the movie to go out on this shot (copied for \"Easy Rider's\" ending), which would have been very effective. Instead they cut to a travelogue-like scene of a European village and go to credits after about 60 seconds of this stuff. It serves no purpose other than to deflate any lasting impact.<br><br>Faithful is on screen in almost all the scenes and gives a surprisingly good performance. Alain Delon as her lover gets a fair amount of screen time (all in flashbacks). I've not been able to take Delon seriously as an actor since his performance as a character named \"Baldy\" in Dean Martin's \"Texas Across the River\" in 1966. Plus I get him confused with Jorge Rivero and his almost identical character \"Capt. Pierre Cordona aka Frenchy\" in \"Rio Lobo\". Maybe they are the same person and used two names as a tax dodge.<br><br>Both the VHS tape and the DVD include a nice stills gallery and a couple trailers.<br><br>All in all I recommend this film. It has thoughtful themes and many well-shot scenes. If you like motorcycles, a sexy body in and out of a leather suit, the most beautiful eyes ever, and cute freckles you should view this film.","user":"aimless-46","rank":[34,43]}]