[{"title":"Well-meant but lighthearted look back on the 60's","rating":3,"date":"3 November 2000","review":"For a directorial debut, \"1969\" is better than average, but for an overall coming-of-age movie, it misses its mark somewhat.  Ernest Thompson tells the story of two college freshmen, Scott and Ralph, who are coming to terms with the grips of the world at present (Vietnam, family, patriotism, drugs) while their smalltown home, and their own parents, remain buried in the ideals of the flag-waving 50's.  Scott is naive, idealistic and hopeful; Ralph is cynical, careless and wild.  Although opposites, they complement each other. Scott wishes to become another human catalyst to help change a world he sees as having limitless possibilities.  Ralph just wants to get high, ignore his studies and stay out of Vietnam.  In between them is Beth, Ralph's younger sister whose also coming into age and also in conflict with the world at hand.  Both guys have trouble with recognizing Beth as a new woman and not just a kid anymore.  <br><br>Although the story centers on Ralph and Scott, all three of them are at odds - in different degrees - with their parents.  Scott is in most turmoil.  His brother has just been shipped off to Vietnam and their father begins projecting hostility towards Scott for objecting the war.  Truthfully, Scott's father has deep fear about the fate of his son in Asia, but clumsily hides it under a blanket of patriotism.  One misused character was Beth; whose personality was equal parts of her brother and his best friend; she had Ralph's sense of reality and Scott's optimism.  I thought she would serve as the bridge between Scott and Ralph but she is used rather as the cause of a rift when Scott and Beth become romantically involved. <br><br>\nI liked this film just for the energetic performances by Robert Downey Jr., Winona Ryder, Bruce Dern, and most of all Kiefer Sutherland as the wide-eyed wishful.  The film score is totally corny (especially in the finale), but Thompson puts good 60's tunes to fill in the scenery.  The film does have a realistic vision of smalltown life and effectively creates those various hippie hangouts like angry college campuses, head shops, and nude beaches. Its not \"The Doors\", but it works.","user":"JawsOfJosh","rank":[19,23]},{"title":"Shallow perhaps but meaningful","rating":8,"date":"2 June 2003","review":"Granted there wasn't much of a plot to 1969 and the acting was fair, but nevertheless I thought the film did accomplish something important. It made you realize that this kind of \"drama\" - coping with the aftermath of a Vietnam KIA - played out in tens-of-thousands of homes throughout the country during the '60s and '70s. The sum of all that pain and anguish makes me cringe. I served in South Vietnam from the summer of '68 to the summer of '69 in the USMC and I am glad to see this kind of message portrayed in a movie. It keeps alive the suffering endured by family and friends from that time. Maybe that sounds morbid but I think it's important for the here and now to acknowledge and remember that suffering. We can use it to give us perspective on how fortunate we are to be able to flourish and live to a ripe old age. For me of course it has special meaning. I could have ended my life at 19 and would have missed so much.<br><br>But that's what happened to so many. A horrible shame.","user":"Doug0809","rank":[20,26]},{"title":"Hip, Hippie, Hooray!","rating":15,"date":"15 December 2000","review":"As the child of a hippie, I can fully \"get\" this film. Downey is brilliant as Raplh, the drug taking friend of Scott (Sutherland), I guess life CAN imitate art. Scott's overbearing father is played equally well by veteran actor Bruce Dern. And the girl who wants to save the world is played nicely by Ryder. However, the movie is truly fueled by Sutherlands performance. His portrayal of a borderline hippie comming of age is heart warming and endearing. I don't think there is another actor who could have done this role. The fims content is heavy and the acting is really good, but it is Sutherland performance that makes this fim so good. Not to mention a kick-ass soundtrack featuring bands like Cream, Canned Heat, CSNY, and of course, the king, Jimi Hendrix. I truly recommend this movie to anyone who is interested in a good tale about growing up hard.<br><br>I give this one ****!","user":"ophelia_1969","rank":[24,34]}]