[{"title":"A Slightly Twisted View of Our Own World","rating":2,"date":"2 October 2001","review":"\"The World According to Garp\" must have been a challenging film to make for all involved. The film spans nearly forty years and requires the actors to not only age four decades, but to emote four decades of their respective character's development. All involved do this astonishingly well, especially Robin Williams in his first dramatic part, and Glenn Close, who plays his mother despite actually being younger than Williams. Even the film itself grows in character - it starts in our own world, and then rapidly snowballs into a world wildly different from our own, but not unbeleivably different.<br><br>\nClose plays Jenny Fields, a woman who grows from being oddly independent to becoming the symbol of ultra-feminism over the next 30 years. She sets a world-changing series of events into place with the unorthodox conception of her son whom she names T.S. Garp after his father, Technical Sergeant Garp. The boy (known simply as Garp) is brought up in the fifties and sixties as the only child of a single mother - unheard of in those days. This unique childhood gives Garp an unusual view of the world, which inspires him ot become a writer. As the young Garp struggles to become a writer, his mother (inspired by his writings and her own warped world view) also decides to be a writer. Her first and only book,\"Sexual Suspect\", is a radical feminist manifesto and becomes an instant bestseller in the already unstable and turbulent 1960s...as if Garp's life wasn't wierd enough.<br><br>It gets wierder still as Garp courts and married his college sweetheart, becomes an author in his own right, and raises a family. Garp's own family life is quite normal with it's rewards, fights, wonders and tragedies, but it is played against the backdrop of a world wildly twisted in it's values by his own mother. Meanwhile, his mother has created a home for women who are unable to integrate into society - probably as a result of having read \"Sexual Suspect\". At the home, Garp makes several new aquaintences. Among them are the twisted Ellen Jamesians, women who have cut off their tongues in protest of the rape of a young girl named Ellen James - and Roberta Muldoon, a transsexual former tight end for the Philadelphia Eagles struggling with \"being a hopeless romantic in a male chauvanist world\".<br><br>If there is a message in \"The World According to Garp\", it might be that the world is a strange and wonderful place filled with both horror and delight. Garp's world makes you look at your own and realize how wierd it really is, and makes you appreciate the delights of your world a little more.<br><br>Glenn Close, Robin Williams, and Mary Beth Hurt (who plays Mrs. T.S. Garp) are all outstanding in their ability to create likeable characters, and to mellow and age them convincingly. The other standout role is John Lithgow, who plays Roberta Muldoon with touching hilarity and beleivability. There are no bad performances in this film: it is populated with characters that are as solid and quirky as those in real life. The only flaws in the film are that the second act has some draggy slow parts, and there is one gag involving an airplane that tries a little hard for laughs.<br><br>\nIn an alternate universe, \"The World According to Garp\" might be a biographical documentary. It creates a world that is somehow familiar and completely distorted at the same time.","user":"imddaveh","rank":[34,39]},{"title":"Amazingly rare!","rating":9,"date":"14 January 2001","review":"Based on the best-selling novel by John Irving, here is the big screen equivalent of a good read. Robin Williams almost plays it down, but thoroughly shines in the title role as T.S.Garp in this, his first proper feature film(well you can hardly include 'Popeye' in that category!).<br><br>This is an amazingly rare look at a story that evolves around happiness, sadness, heartbreak, love, and all the other natural emotions that this young,up and coming novelist experiences throughout his far from normal existence that culminates in a dark satire on many comical situations.<br><br>Some great moments to be had including a great performance from John Lithgow as the transsexual ex-football player who befriends Garp and his Worldly renowned Women's lib Mother played brilliantly by Glenn Close in her film debut.<br><br>You'll laugh... especially at the way Garp was conceived and to find out what his initials T.S. actually stand for. You'll rejoice... at the moment when Garp finds out he is to become a father for the first time. You'll cry...many times...<br><br>This movie has got to be one of the most underrated masterpieces of the 1980's, and in many ways sustains a cult following as being one of Robin Williams' first major movie projects. <br><br>Don't let this one get away-it doesn't deserve to be missed!","user":"CosmicDwellings","rank":[48,59]},{"title":"One of my favorite movies, period.","rating":27,"date":"27 September 2001","review":"\"The World According To Garp\" introduced me to several things dear to me when I saw it as a child: the Beatles (through the opening credits song), Robin Williams (okay, he's not dear to me, but I like his dramatic stuff) and an early understanding of what \"bittersweet\" meant. To be honest, I have never read John Irving's book. Although I probably will one day, I enjoy the movie too much and right now I don't want my perception of it altered. Beautifully acted, written, and photographed, \"Garp\" just moves me everytime I watch it. To this day, I haven't seen Robin Williams or Glenn Close play better roles than they do here, and John Lithgow is just a hoot as Roberta. Back to the bittersweet thing, I love the way this film will have you moved to tears one minute and laughing the next, just like real life. Obviously, there are a plethora of movies out there that achieve the same effect, this one just happens to be a personal favorite. Dramatic but never heavyhanded, funny but never silly, \"The World According To Garp\" is a simply perfect movie experience.","user":"joeyramone78","rank":[40,56]}]