[{"title":"Send these ,the homeless,tempest-tost to me/I lift my lamp beside the golden door.","rating":9,"date":"18 January 2007","review":"How can you be French and not love this film? First the lead is French;and in a small supporting part,there is Victor Francen,one of Julien Duvivier's (\"La Fin Du Jour \",1939) and Abel Gance's (\"J'accuse\" 1918 and 1937) favorite actors.Plus \"La Marseillaise \" in the final sequences.Plus Olivia De Havilland who has been living in Paris for years.Except for Bertrand Tavernier,most of FRench critics do not speak highly of Mitchell Leisen's overlooked gem.<br><br>This is the kind of superior melodrama I love.Olivia De Havilland is one of the greatest actresses of all time,one of those who never think twice when it comes to playing demeaning parts.She is so moving,so tender and so endearing that beauty Paulette Goddard almost leaves me indifferent.And I wonder why Boyer...<br><br>The very structure of the film is highly original,being a long flashback,the hero telling his story (perhaps too much voice over) to a director to earn money (but we will know why in the last minutes )because he thinks all his trials can make a great film!Truth can be stranger than fiction cause he is in a film himself! The subject of the movie is still topical today when you see so many people leaving their country for the wealthy ones (not only America:in France ,Russians and others are actually fighting to get French citizenship).For that matter,one of the peaks is when Victor Francen declaims Emma Lazarus's poem which is graven on a tablet within the pedestal on which the Statue of Liberty stands.There are subplots and Mitchell Leisen's talent manages to make them as interesting as the three leads .You may remember the lady who wants his baby to be an American and the way she makes her dream come true,maybe more than Boyer/Havilland's honeymoon.<br><br>A honeymoon that takes them to an old Mexican village where they go to mass,with a candle in their hand.A scene that recalls Murnau's \"daybreak\" .<br><br>Emmy (De Havilland) is a woman who has never known love.She really wants to hold back the dawn ,to make her dream longer than the night.She gave all she had and she 's so altruistic she even returns good for evil.When she realizes that she's through with her pursuit of happiness,she simply puts her glasses.<br><br>I had seen Leisen's film when I was still a child.I saw it last night.With the same pleasure.","user":"dbdumonteil","rank":[23,24]},{"title":"Marvelous","rating":9,"date":"9 March 2003","review":"As good a script as Billy Wilder and Charles Brackett ever wrote! Mitchell Leisen directs with some flair too. This film drove Wilder to become a director after Charles boyer had a sequence cut - from then on, Wilder was able to protect his screenplays from such treatment. But any trouble behind the scenes doesn't really harm the film itself, which is a joy. An even more abrasive protagonist than usual, Charles Boyer's gigolo nevertheless builds up colossal sympathy - it's an approach Wilder would replicate in THE LOST WEEKEND to Oscar-winning effect. But EVERYBODY in this film is marvelous, as is the inventive story, inspired by Wilder's own time in mexico awaiting a visa to allow him into the States.","user":"cairnsdavid","rank":[20,22]},{"title":"Three stars shine in interesting romantic drama...","rating":4,"date":"4 April 2001","review":"Charles Boyer, Olivia de Havilland and Paulette Goddard deserve high praise for their performances in this poignant and touching slice of Americana from Mitchell Leisen (who later directed de Havilland in 'To Each His Own'). Basically the story of a European gigolo (Boyer) who wants to get into the United States without a long wait in Mexico. His girlfriend and ex-dancing partner (Paulette Goddard) convinces him to marry an unsuspecting American schoolteacher (de Havilland)in order to gain fast entry before ditching her. Colorful supporting characters come to life--most notably Walter Abel as an immigration officer and Rosemary de Camp as a pregnant woman who wants her child born in the U.S. Boyer narrates the story to a film director (Mitchell Leisen) and we see the story unfold in flashback from his point of view. Excellent work by all concerned. My only complaint is the abrupt ending--which I understand was a result of trouble with Boyer who wanted certain scenes rewritten--a final scene between him and de Havilland would have been preferable to what seems like a letdown for the finale. As it is, it looks like choppy editing before \"The End\" flashes on the screen. Still, a romantic drama with an abundant amount of dry humor and some crackling dialogue by Paulette Goddard who sparkles in her role as \"the other woman\". Her confrontation scene with the schoolteacher is one of the highlights of the film. De Havilland was nominated for a Best Actress Oscar for this, but lost to her sister, Joan Fontaine, for 'Suspicion'.","user":"Doylenf","rank":[23,27]}]