[{"title":"Kubrick--a fully-formed genius in 1957.","rating":10,"date":"7 July 1999","review":"At only 29 years of age and in only his second major studio release, Stanley Kubrick showed the world that he was a force to be reckoned with. By the time he died 42 years later his films were epochal events waited for breathlessly by his large band of devotees who considered him a director without equal. He seldom disappointed them.<br><br>This movie is set in World War I amidst the incredibly destructive and futile trench warfare between France and Germany. Kirk Douglas plays Frenchman Colonel Dax, who is ordered to make an impossible assault on a heavily-fortified enemy position. The only reason this charge is being made is that his commanding general, played by George Macready, believes that capturing the position will earn him a promotion. When the assault does not go forward under heavy enemy bombardment, the general is infuriated and demands that three men be arbitrarily chosen to stand trial for cowardice, an offense punishable by death. Col. Dax defends these men at their court-martial.<br><br>The battle and trial scenes are about as good as have ever been filmed and the high level of tension is sustained throughout the movie. After the film's climax has occurred, Col. Dax goes looking for his troops and finds them relaxing at a cafe. What he and the viewer witness there is possibly the most affecting scene I've ever seen on screen.<br><br>Looking at this film in perspective, it's easy to see Kubrick's trademarks even at this early stage of his career. The attention to the composition of his shots reflects his background as a still photographer and foreshadows his other great films to come. I find myself most impressed today with the way he could handle a dramatic story like this one without any innovative techniques or unusual special effects to hide behind, then turn around and make such totally different films like '2001...' and 'Dr. Strangelove...' Other films like 'The Shining' and 'Barry Lyndon' combined a strong story line with breakthrough film techniques. His versatility astonishes me.<br><br>Adolphe Menjou also stars as the general who convinces Dax's superior officer to risk the ill-fated charge. Ralph Meeker, Timothy Carey and Joe Turkel give strong performances as the men on trial. Turkel turns up 23 years later in another Kubrick film, 'The Shining,' playing the bartender.<br><br>You can take your pick: 'Paths of Glory' can rightly be described as one of the greatest war movies of all, or one of the great anti-war films, or as one of Kubrick's best. Or simply one of the best, period.","user":"Hermit C-2","rank":[206,223]},{"title":"\"Let the men have a few minutes more\"","rating":9,"date":"15 October 2006","review":"Although Kubrick's films are marked by their massive variation of genre and tone, one theme that crops up again and again is a strong anti-war sentiment, and this was never stated more strongly than in Paths of Glory. A relatively early Kubrick picture and, despite coming before what is considered his classic period, it is one of his best.<br><br>In contrast to his previous picture, The Killing, a definite Kubrick style is beginning to emerge now. One notable example is the scene in which General Mireau tours the trenches, walking towards the audience with the camera retreating away from him. This technique would be repeated years later in Kubrick's other war film, Full Metal Jacket. There is also something about the arrangement of objects in the frame, as well the tracking and dollying which hints towards his more familiar later style. His recurring chess motif appears as well, albeit subtly. At the court martial the floor is chequered, and the soldiers on trial are seated with guards standing behind them as if they are pawns about to be sacrificed.<br><br>The light and contrast in this picture is put to good effect. The palatial officers' headquarters is light and airy with few shadows. The trenches are gloomy and cramped. Kubrick was becoming a real master at contrasting locations and getting the look of a place just right.<br><br>The use of music in Paths of Glory is bold and brilliant. The pre-recorded score is almost entirely percussive  all rhythmic sounds with no melody. A weird kettle drum track is used to help build tension in the night patrol scene, while in the climactic scene the funeral march drumming instills a sense of dread, further heightened by having the shots edited in time to the beat. In the emotional final scene we get the complete opposite  a beautiful vocal melody. This has all the more impact after hearing nothing but militaristic drums for the rest of the film.<br><br>The casting is absolutely flawless. While there are no big names apart from leading man Kirk Douglas and the now elderly Adolphe Menjou, there isn't a single weak performance. The despair and resentment of the condemned soldiers feels so absolutely real. In contrast the smugness and fake sympathy of the upper class officers is brilliantly portrayed.<br><br>Throughout his career Kubrick never seemed to be particularly keen on blatantly emotional moments. Paths of Glory is the exception. The later scenes are incredibly poignant and moving, and the final moments in the soldier's bar are what makes it a masterpiece more than anything else  the icing on the cake. However it's quite probable that Kubrick regretted this as an overly sentimental approach, as woolly sentimentalism was a major gripe of his when he worked on Spartacus. Whatever the case, he certainly reined in the stirring stuff considerably after this, to the point where his later films became characterised by their understatement of emotions.","user":"Steffi_P","rank":[83,88]},{"title":"Stands the Test of Time","rating":9,"date":"28 July 2007","review":"An arrogant French general (a superb George Macready) orders his men on a suicide mission and then has the gall to try to court marshal and execute three of them for cowardice in the face of the enemy. A former lawyer turned colonel (Kirk Douglas in his prime) is the voice of reason against gross injustice. This excellently staged and wonderfully acted production is as much an acting showcase for Douglas as it is a directorial masterstroke by a young Stanley Kubrick who adapted this to the screen from a novel based on actual accounts.<br><br>Kubrick displays a great control of sound effects and camera movement in the brief but effective battle scenes that expertly depict the controlled chaos that was trench warfare during WWI. Things get juicier during the ensuing courtroom battle where the deafening disparity between the elite who propagate and profit from war and the common citizens who suffer and die in war is shown with great lucidity.<br><br>Unlike later Kubrick epics, this runs at a crisp 90 minutes, though suffers briefly from a slow and awkwardly staged opening ten minutes before Douglas comes on screen. Ultimately, this holds up very well to modern scrutiny thanks to the flawlessness of Kurbick's craft, the amazing ensemble acting, and the surprising depth of its philosophical and psychological pondering. \"Paths of Glory\" is more anti-arrogance than anti-war, and is unapologetically sentimental and pro-soldier. As such, much can still be gleaned from its message.","user":"WriterDave","rank":[104,114]}]