[{"title":"The ultimate Christmas special","rating":10,"date":"24 September 2000","review":"There are many Christmas specials and movies involving Christmas. Some are good. Some are average. And some are just plain bad. But Rudolph, the Red-Nosed Reindeer shall remain the king of all Christmas specials. All the characters are wonderful and memorable, and Burl Ives is just perfect for the snowman, who sings those unforgettable songs. A must see every Christmas.","user":"pmcollectorboy","rank":[56,60]},{"title":"The Ultimate TV Christmas Classic, and God Bless Burl!","rating":4,"date":"4 August 1999","review":"I've seen and loved all of the great Rankin/Bass Christmas shows, and I have most of them on video, but this first one, \"Rudolph,\" is still the best, and still the one that holds the warmest memories for me.<br><br>In terms of Holiday atmosphere, it can't be beat. The late Johnny Marks' songs are all winners, and \"Rudolph\" and \"Have a Holly Jolly Christmas\" are now firmly established Christmas classics. And holding it all together is Burl Ives' warm, friendly singing and narration. His sincerity and joviality just naturally make you want to \"pull up an ice block and lend an ear.\" I'm now 41 years old, I know all the dialogue practically by heart, and yet I still watch \"Rudolph\" practically every Christmas. And, what's more, I still love it.<br><br>Finally, a word to Julie Landry, of Orlando, on her review. I myself was dyslexic as a child. And yes, I got picked on because of it. But, in deference to your opinion, I see \"Rudolph\" as a story of how even a perceived outsider can fit in. As a successful Senior Librarian today, I'm living proof that outsiders can succeed. But, then, Rudolph proved that long before I did.","user":"BobLib","rank":[49,53]},{"title":"the one we all remember from childhood.","rating":10,"date":"4 January 2006","review":"Directors: Kizo Nagashima, Larry Roemer; Story: Robert May; Script: Romeo Muller; Producers: Jules Bass, Arthur Rankin <br><br>Rudolph is more then a Christmas special, it is a holiday tradition. I always look forward to the special time during the Christmas season when I can watch this. This beloved special is one of the few things that brings back my childhood. Most children today enjoy watching this as much as their parents did when they were little. On the DVD's introduction, producer Arthur Rankin states that Rudolph the Red Nosed Raindeer has been reportedly viewed by over a billion people worldwide. It is perhaps second only to The Wizzard of Oz as being the most viewed programme of all time.<br><br>Rudolph is the first of a line of Christmas specials that were produced by Rankin and Bass and written by Romeo Muller. Some of the others are: The Little Drummer Boy (1968), Frosty the Snowman (1969),and Santa Claus is Coming to Town (1970) as well as Here Comes Peter Cottontail (1971) and Puff, The Magic Dragon (1978). It is hard to imagine all these classic specials being the creation of one man. Mr. Muller is Mr. Christmas! <br><br>The origins of Rudolph the Red Nosed Raindeer stem from the song written by Johnny Marks back in the 1930's or 1940's. A Max Fleischer cartoon short was made in 1948 with Robert May creating its story. However, the Rankin and Bass Christmas special is based on the Johnny Marks song but other than that, it is all the creation of Romeo Muller. Hermey the elf, Sam the snowman, Yukon Cornelius, Claurice, the head elf are all Muller's creations. Even Rudolph's personality is created by Muller. In the 1948 cartoon Rudolph does not talk. <br><br>I have always liked Burl Ives as both a singer and an actor. His part as Sam the Snowman is my favourite by him. All the people behind the scenes doing the voices were all talented. They used stop motion animation with moving puppets just like they did with King Kong. Rudolph is a timeless classic that bring me back to the simpler time of childhood every time I watch it. I hope my small children will enjoy it to.","user":"dav07dan02","rank":[35,38]}]