[{"title":"Special memory for me","rating":19,"date":"19 October 2006","review":"This movie has special meaning for me. I remember being 16 when I took the \"love of my life\" (who was 15) to see it. I had not seen it since...until tonight. For some reason, I had been thinking about this movie lately and looked on EBay and got it yesterday. I watched it tonight and cannot believe the memories it brought back. I was surprised to remember a lot of the scenes and lines throughout. It also made me terribly sad to remember that my \"love\" passed away in a car accident 3 years after we saw it together. The title song gets me every time. I cannot honestly say whether or not this is a \"good\" movie as far as \"good\" movies go. But I can say without a doubt that after watching this tonight for the first time in 25 years, this movie takes my heart to a place it hasn't been to since 1984 and made me remember an unforgettable night in 1981.<br><br>I guess that's what certain movies do, be it \"good\" or \"bad\".","user":"mylarstar","rank":[106,127]},{"title":"If it weren't for the book....","rating":3,"date":"15 April 2006","review":"This film wouldn't seem so awful if the book hadn't been so moving and extraordinary. Zeffirelli said in an interview that he was changing it so the love of the two teens was mutual, and not one-sided, and that I believe was his mistake. The book is not about love at all, it's about obsession. Readers have complained that we don't meet Jade until halfway through the book and she hardly seems to merit all that fixation, but that's the point. It's all in David's head.<br><br>In the book, when they reunite, he's trying to make them have sex exactly the way they did years ago. The opening pages show him looking through their window, feeling banished from this \"wonderful perfect family,\" but he ignores all the clues that they are nothing of the kind: when he sets the fire, they can't cope because they are all on acid, in what the mother later describes as a last-ditch effort to bring the family together. The mother watches her daughter have sex in order to live vicariously, because her own marriage is falling apart. The father sneaks stimulants into his daughter's food because he believes in homeopathy. The brother, we later learn, brought David home as he brought other classmates home, mostly to impress them with how cool and hip the family is and then dump them when he gets bored (we learn later from an old classmate David meets on the plane that the brother did the same thing to him). David is obviously emotionally fragile to begin with, but these horrible poseurs are exactly the people he doesn't need to meet. They exploit him as an audience for their Coolness Quotient and then dump him without regard for what they might be doing to him. He's a psycho alright--but if he weren't, he might see through them, which he obviously hasn't done, even by the end of the book.<br><br>Little of this was conveyed in the movie, which also did not keep Spencer's late-'60s setting, which would have made the Butterfields' boho weekend-hippie aspirations more understandable. A lot of suburban people were trying to prove how groovy they were back then: look at mainstream magazines like Ladies' Home Journal or Newsweek and you'll see articles on open marriages, the pill, and symbolic meanings of Beatles Album covers. The respective talents (or lack thereof) of Shields and Hewitt have been the subject of much debate and jeering, but I don't think much could be done with a script that jettisoned the essential unreliable narrator aspect of the book (i.e., what David *thinks* he's telling us about the Butterfields and himself is not necessarily what we decide to believe after we've heard some of the details). All we have left is the star-crossed lover thing, and that has been done by Zeffirelli himself in R&amp;J, and modernized in West Side Story. Without Shakespeare's words or Bernstein's music, or any novel element or perspective, it's hard to justify doing it again.","user":"violetta1485","rank":[42,52]},{"title":"This movie gave me my first lesson in Love","rating":28,"date":"28 December 1999","review":"I was just a young teenager when I snuck into the theater to see this one.  This was the first \"Love Story\" I really ever watched, and I was touched.  I was snatched away into the world of Jade and David, and seduced by the emotion and feelings.  By the end, when the movie reaches it's climax, I was in tears. My heart was breaking for each of the charactors. Yes, I was young and emotional, but this movie made an impression on me and gave me my first lesson in Love.  I snuck in two more times, just to feel those tears again.  I Loved it!","user":"scoobyg69","rank":[42,57]}]