[{"title":"Peter Watkins' Culloden.","rating":10,"date":"28 June 2004","review":"Culloden (1964) (TV) was a movie that was funded by the B.B.C. They were impressed with Mr. Watkins work on the short Forgotten Faces. He was hired as a B.B.C. staff film-maker. With a shoe-string budget and a troop of amateur actors, Peter Watkins created a very controversial and grim look at the decaying Scottish clan system and the British occupation of Scotland. Whilst during the duration of the film Mr. Watkins takes no side and scathingly shows how both sides of the battlefield are morally and socially corrupt. Prince Bonnie Charles Stuart (pretender to the throne) on the battle field against the superior forces of the House of Hannover. The Jacobites didn't really stand a chance against the World's greatest army. Stupidity and jealousy ruined any chance they had.<br><br>Peter Watkins also showed the aftermath of the battle and the devastating effects the battle had on the surrounding communities. He shot this film in his trademark faux-documentary style. Even with a small budget, Mr. Watkins still manages to create a very important film. One that he spent months on researching and planning. The film also reflects how the media treated combat as we have one the field reports from the attacking army and interviews with the soldiers and their views on the enemy. <br><br>Highly recommended.","user":"Captain_Couth","rank":[22,23]},{"title":"Raw and realistic, but a bit loose with some facts","rating":9,"date":"22 August 2008","review":"This is one of the earliest examples of a \"docu-drama\" and one of the best. It's realism causes the viewer to feel true empathy for the participants---especially for the Scottish Jacobites.<br><br>While it's certainly true that the English and their Scottish allies were better equipped and had a more disciplined, unified command structure, the circumstances of the Highlanders weren't quite as dire as indicated. Many were indeed poor and malnourished, but generally not to the degree depicted in the film, where almost all are dressed in rags and covered in filth. It is also claimed that most didn't have firearms, yet the majority were armed with pistols or muskets of local or French manufacture. Their lack of discipline and cohesive command caused them to rely on the shock tactics that served them so well at the Battle of Prestonpens, and many dropped their muskets and charged after firing a volley. Interestingly, the English tally of captured weapons after the battle contained many more guns than swords. Swords; especially claymores; were expensive, and most of the poorer men without guns carried axes or pikes. <br><br>The contingent of French trained Scots and Irish, equipped and drilled in the same manner as the Redcoats, was larger than shown in the film. And the English forces contained significant numbers of both lowland and highland Scots. Although the English were well provided with artillery, most of their cannons were small three pounders used in urban street fighting or in the American woodlands where they were known as \"grasshoppers\". The standard light field gun was the six pounder. Despite these qualifications, the battle scenes are graphic and realistic.<br><br>Watkins makes it seem as if the Scots were true revolutionaries asserting their ethnic identity, when, in actual fact, Prince Charlie was simply a wannabe monarch seeking to restore the Stuarts, and probably as disdainful of the Highlanders as the Hanoverians were. The modern parallels he tries to draw simply aren't there.<br><br>Despite the above, this is a great movie that should be on every history buff and cinema enthusiast's list.","user":"guanche","rank":[14,14]},{"title":"Incredible","rating":23,"date":"23 September 2006","review":"This is one of the films (even though shown on TV, it absolutely qualifies as cinema) that shaped my childhood, my politics, and my love of film-making and its true potential. I remember being simply blown away, not merely by the intensity of the violence and aggression (I had never seen war filmed like this), but by the passion and the pain of the \"ordinary people\" - the Scots, especially the Scottish women - as they witnessed the English brutality around them. Totally extraordinary to me also, was the fact that the camera team felt so moved as to intercede in the violence - not merely breaking the boundaries of media \"objectivity\" in a way that had rarely, if ever, been done before in 1964, but also breaking the boundaries of time - remember, we are in a war here that is taking place in 1746, and yet it seems perfectly natural and believable to have a camera team pushing into frame, protesting the behavior of the English troops.<br><br>Peter Watkins went on to make many groundbreaking movies, but little can touch Culloden - the closest is Punishment Park, which uses much the same techniques to follow a group of students and protesters in a slightly fictionalized and rather fascist USA, where (as I recall - I haven't seen the movie in years), they are given a \"choice\" between internment or a (loaded) chance to \"run\", with the risk/likelihood of being shot and killed by their paramilitary pursuers.<br><br>A minor personal note: I saw Culloden on TV while I was very young and at school in Britain. It is a hard film to find - at least until the recent DVD - but I came across it again at the Sydney Public Library, of all places, during a trip to Australia in the 1990s, and sat watching it on 16mm, on a Moviola in the library - as stunned and moved as I had been the first time I saw it. It was reassuring to know that its power had not diminished.","user":"tranquilbuddha","rank":[30,33]}]