[{"title":"Stallone's 80's best underrated Action Horror film Cobra!","rating":10,"date":"6 October 2015","review":"My favorite best Stallone action movie. But from the 80's that Stallone made action films is the first stand alone film not meaning Rocky and Rambo. Cobra will never stop been my favorite best action movie horror thriller from the 80's that is out there. It is one of my personal favorite movies. I wish only the movie wouldn't be that short but still it was directed by George P. Cosmatos who directed Rambo this movie was made right after Rambo: First Blood Part II was released. <br><br>Cobra is also a Cannon film and one of the best action horror thrillers that is out there. Cobra simply rocks! And it is a highly entertaining underrated action flick that guarantees the viewer a great show. Cobra is another one of those movies. It's not deep, it has a social message but doesn't really care about it. Its just pure old fun. The night slasher kills people randomly. He targets anyone, anywhere. The police don't have a clue, they can't stop him, all they can do is wait for the next death. But that all changes when Ingrid gets a good clear look at the chief of the gang. Yes, it's not one person, it's a group of killers that have set their minds on hunting the weak of society. Now they'll do anything to kill the only witness, the woman that can finish their 'dream' but they didn't count on one man: Marion Cobretti. <br><br>The movie plays with the idea that murderers use the system to get away with their crimes. It explores the fear in society, the impotence of the courts and introduces Cobretti, a cop who doesn't care about the law only his justice. Although I don't agree with this I still enjoyed the movie since Stallone didn't spend much time making his point, rather went fast for the action.<br><br>YOU'RE THE DISEASE, AND I'M THE CURE!!!!!!!! <br><br>Cobra is a 1986 American action film directed by George P. Cosmatos, and written by Sylvester Stallone, who also starred in the title role. The film co-stars Reni Santoni, Brigitte Nielsen and Andrew Robinson. The film received negative reviews, with much criticism focused on the overuse of genre tropes, yet it debuted at the number one spot on the U.S. box office and became a financial success.<br><br>The film was loosely based on the novel Fair Game by Paula Gosling, which was later filmed under that title in 1995. However, Stallone's screenplay was originally conceived from ideas he had during pre-production of Beverly Hills Cop, whose screenplay he heavily revised. He had wanted to make Beverly Hills Cop a less comedic and more action-oriented film, which the studio rejected as being far too expensive. When he left that project, Eddie Murphy was brought in to play the lead role<br><br>A tough-on-crime street cop must protect the only surviving witness to a strange murderous cult with far reaching plans. The cult and their leader The Night Slasher are killing people all over the town in Los Angeles for believing in their New World so that will the strongest people survived but their is one tough cop that stands in their way and he must protect a surviving witness that cab identify the Slasher. I seriously love this film from the 80'a and I wish there would be more films like this. The Action sequences, the explosion, death scenes are fantastic after Rambo here comes Cobra.<br><br>Is one of my best Stallone Action movies beside Tango &amp; Cash (1989), Rambo, Rocky, Cliffhanger, Demolition Man and The Specialist it is one of my favorite action movies of all time! 10/10 Grade: Bad Ass Seal Of Approval","user":"ivo-cobra8","rank":[102,114]},{"title":"beautiful script!","rating":20,"date":"20 November 2000","review":"I'm very bad in english, i'm from Russia. But I'm fun of Stallone and don't keep silently. This film - classics! It don't have spare! All in it working for result. It's action in last type. In Russia, we have  saying: all genius - simply. It's about this film. \"Cobra\" - as your picture at the wall - nice for your eyes. Sorry for my bad english! Now I'm go to gim - i want to be strong as Cobretti. Arnold and Van Damm, and Sigal - stupid before Stallone! They never made such beautiful script!","user":"senin777","rank":[36,43]},{"title":"SYNOPSIS: It made me want to kick my own *ss.","rating":10,"date":"7 January 2005","review":"YOU CAN'T TELL ME the first time you saw Stallone do a complete 180 in that pimped out ride, hang that sweet lookin' gun out of the window, and knock off a few caps at the bad guy as he drove in REVERSE (!!) that you didn't get a little tingly in your gut in a good way.<br><br>People... I think we need to have a Come-To-Jesus about this movie. I can't believe I actually saw such low approval stats from all age brackets. Lemme just holler and the children of the '80s: what the hell are you thinking? Stallone and Schwartzenegger were bigger than life back then, and there's no love.... Now there's nothing but CGI, bigger explosions, crazier guns, fake boobies, more authentic-looking aliens, all the things I like in movies -- wait a second.<br><br>You know, I realize Stallone will never win Best Actor... I realize Stallone will never die, probably, he's always in such damn good shape... and I also realize that his face will never straighten up so he can talk correctly, but there's one thing I do know... I give this movie a 10, and I hope it feels like the giant peanut butter sandwich you just ate without a glass of milk anywhere in sight! <br><br>I need a glass of rootbeer... BARTENDER!","user":"rootbeerbrains","rank":[170,224]}]