[{"title":"Just enjoy the silliness.","rating":8,"date":"10 December 2004","review":"A hideous mutant baby is born and escapes from the hospital, now it's scared and killing people. They learn that its on its way home, to find protection from its parents.<br><br>A pretty decent low-budget exploitation horror film by writer/director Larry Cohan (Q-The winged Serpent), this film takes the abortion issue to another level. A simple plot that's absurdly fun and silly to watch-but it's the cleverness of the script, that never has a dull moment. <br><br>The make-up effects and the baby puppet was designed and operated by Rick Baker (An American werewolf in London, Men in black, Ed Wood), the design looks decent enough for a low-budget film and one of his first major film designs, but because of Cohen's great direction we see through the eyes of the baby (in double vision) or it's hidden in the shadows and only small snippets of it are shown. We don't see it fully until the end, giving it a much more creepy feel to the film. <br><br>It centers more on the sound effects than the visuals, so there is more of a presence with it's nerve wracking crying and snarling. That actually helps give the atmosphere a dark and bleak feel of depression.<br><br>The performances are top notch from Sharon Farrell as the unstable mother Lenore Davies, James Dixon as Lieutenant Perkins and John Ryan as Frank Davis the cold-hearted father who wants his baby killed, his portrayal really does ground the film and brings an emotional element that sucks you in. <br><br>One the greatest music composers Bernard Herrmann (Citizen Kane, North by North West, Psycho, Taxi Driver, All that money cant buy) comes up with a superb score and a chilling main theme. <br><br>The cinematography is rather good towards to the feel of hysteria and tension, giving it a nauseating aura and good use of the baby's point of view. The film's pace is excellent and leads up to a fine climax. <br><br>It's no great feat of its genre, but it deserves merit. A very good film that's helped by it's excellent performances, script, direction and music score. <br><br>4/5","user":"lost-in-limbo","rank":[41,46]},{"title":"Not too bad","rating":22,"date":"22 October 2003","review":"\"It's Alive\" is one of those cult horror films that I had heard a lot of great things about but didn't get around to seeing until just recently. I have to say that I was bored with it throughout most of the film, but started to catch on to its vibe as it got closer toward the end. I truly support what this movie has to say about the somewhat totalitarian world of medicine, and ended up liking \"It's Alive\" a lot more when I realized that it wasn't just some dumb movie with no real point or scares at all. I still have to admit that the movie didn't scare me at all, but it generated some good, healthy suspense, and the point is such a good one (and is so well done) that I do have to hand this movie some major support. It was more sad than anything else, but it wasn't too bad at all.","user":"one4now4","rank":[23,27]},{"title":"Had the Davis baby been breast-fed, this massacre might never have happened.","rating":8,"date":"16 February 2003","review":"Screw the negative reviews!  If you're into Larry Cohen movies, you will most certainly enjoy this one.  Sure it's cheezy, sure it's unbelievable, but nevertheless, it's fun!<br><br>What few realize is that this film was intended as a spoof of sorts on Roman Polanski's film, \"ROSEMARY'S BABY\".  You cannot watch this, or either of it's sequels, expecting to take things completely seriously.<br><br>John P. Ryan, who plays Frank Davis, is great in this.  Ryan, in my opinion, is a terrific actor and is always worth watching.  Cohen employed the talents of legendary composer, Bernard Herrmann, to score this film.  The score, being one of Herrmann's last compositions, is truly tremendous and gives the film it's essential monster movie feel.  Rumor has it that Herrmann passed on an opportunity to score William Friedkin's mainstream horror film, \"THE EXORCIST\", in favor of this independent project.<br><br>If you're looking for a great exploitation epic from the grand ol' days of '70s cinema, you won't be disappointed.  The sequels, \"IT LIVES AGAIN\" and \"IT'S ALIVE III: ISLAND OF THE ALIVE\", are also worth a look.","user":"johnmorghen","rank":[21,25]}]