[{"title":"Underrated classic","rating":8,"date":"16 August 2007","review":"Vastly underrated mainly because it seems a bit dated now and is very hard to get hold of. My copy distributed by Beauty from China is not the best of transfers and has no extras. Anything by King Hu is worth watching and this has echoes of his earlier classic Dragon Gate Inn. Rebels and the Manch warlord Lee Kahn come together in a remote inn and the tension builds during the period of the Yuan Dynasty where the Han people fought to expel the Mongol invaders. There are many stars in this early film, Roy Chiao, Angela Mao, Lil Lil-hua (brilliant as the owner of the inn), Hsu Feng (as Lee Kahn's sister) and the action choreography (rather limited but effective) is by Sammo Hung. Tin Fung is chilling as Lee Kahn and both the acting, direction and photography (King Hu loved scenery shots) are superior and unusually for films of the period, the female leads are all strong characters. A great genre film well worth watching.","user":"phillip-58","rank":[16,19]},{"title":"Not one of the better Angela Mao movie","rating":5,"date":"28 February 2013","review":"Angela Mao stars as a pre-Ming dynasty (or around that time) restaurant waitress. The restaurant seems to get one bad customer after another while something clandestine is going on with the restaurant. It's being used as communication post for the Chinese rebels. They use coins to indicate that one's an agent. Soon, Lee Khan the Mongol lord himself shows up at the restaurant.<br><br>The production company says it's Golden Harvest, but it looks awfully low budget for a Golden Harvest production. Maybe there was a collaboration between Taiwan movie studios. The shooting style is not like that of Golden Harvest either. There's no dynamic close up shots during the fight scenes like you see in their production. Actors are all Hong Kong actors (except Angela Mao, who's Taiwanese).<br><br>The movie is pretty one dimensional, and although it was shot at the height of Angela Mao's beauty, it didn't capitalize on her fabulous kung-fu skills or on screen presence. It's best to look for other Angela Mao movies to get the best of her actions.","user":"ebiros2","rank":[4,11]},{"title":"enjoyable early hong kong action","rating":6,"date":"25 September 2000","review":"This early hong kong flick is an enjoyable lark.  While the fights and effects are sometimes laughably primitive by today's standards, they are nonetheless well-choreographed.  The story is pretty intriguing, the intentional humor hits the mark, and, the acting is actually surprisingly competent for the genre, which can tend to be hokey and melodramatic.<br><br>All in all, worth seeing for fans of Bruce Lee, John Woo, and \"The Matrix,\" all of whom are obviously influenced by movies such as this.","user":"joshmertz","rank":[7,28]}]