[{"title":"And you have to deal with me, Doug Masters","rating":7,"date":"6 February 2005","review":"I'm sorry, but I just can't help it, I love watching Iron Eagle. Now, do not misunderstand me, I am not saying that this is a great movie. No, rather, I would put it that this is an endlessly entertaining movie. For people who cut this movie to pieces for not being realistic are kinda missing the point. Of course Iron Eagle's plot was ridiculous. But I believe its target audience was kids, and I sure remember finding this cool when I was little. Now I just find it amusing as a guilty pleasure, kinda like Road House. This movie is part of the great pantheon of 80's, kids-taking-on-the-stodgy-adult-power-structure movies. You must remember D.A.R.Y.L, Real Genius, E.T., etc. If you ask me, just watching Doug and Knotcher \"Ride the Snake\" in the beginning is worth the cost of the DVD. That whole sequence was so STUPID! But, at the same time, it was hilarious, funny, totally 80's, all that good stuff. So bottom line, Iron Eagle is a great 80's guilty pleasure. The hairstyles, the dancing, the music, the dialogue, its all funny as hell. I have Iron Eagle on DVD and to me it was totally worth $9.99 at Best Buy. If you love laughing at dated, unrealistic action movies, this one is a must-see. Oh yeah, and I think its plot was only marginally stupider than 1986's other fighter pilot action pic, Top Gun.","user":"scubergmu","rank":[42,51]},{"title":"Spoilers. But you can't spoil this movie!","rating":10,"date":"10 October 2002","review":"Okay, here's the deal. There's this American pilot who's flying along, minding his own business, when suddenly he's outnumbered by evil, cowardly non-American fighter planes (they're Middle Eastern types, but suffice to say they don't like apple pie or Elvis Presley), who proceed to shoot him down. Now this American pilot was doing nothing wrong, but those evil non-Americans didn't care and before you know it he's banged up in a foreign jail and sentenced to death!!<br><br>Now, what would normally happen here is that the US Military would carpet bomb a couple of nearby towns until the pilot was released, but not this time. Those evil peace lovin' types probably got involved and managed to stop any kind of retaliatory massacre. As you can imagine, this doesn't please the pilot's family and the evil foreign dictator has this smug, contented look about him. He'll make those Americans pay, oh yes indeed!<br><br>But He didn't reckon on Doug Masters, the captured pilots 16-year-old son. You see Doug has been able to fly a plane longer than he can drive a car, (which can't be that long) and decides to fly into that evil, foreign country and get his Dad back. So with the help of his friends, Doug and his wingman, retired pilot Chappy' Sinclair, Doug launches a two man air raid on the foreigners. <br><br>Now you'd think that this plan would be bound to fail, but you'd be wrong. Sure, those Middle Eastern types might be all veteran pilots, but Doug's got an ace up his sleeve, he listens to rock music when he flies! After shooting down a dozen or so enemy planes and blowing up an oil refinery, Doug lands at an airport and gets his now wounded dad onboard the plane. Understandably, the evil, not quite so smug anymore, dictator gets quite annoyed at these antics and takes to the skies himself, in bid to shoot down Doug. But the young lad listens to some more rock music and blows the villain out of the sky. HURRAH!<br><br>After Doug and Chappy have shot down 90% of their air force, the foreigners send up their last few planes in a rather poor attempt to shoot Doug down, but in the nick of time, a flight of US F16s turn up and scare them away.<br><br>\nI cannot recommend this film enough. It was the first ever videocassette movie that I brought, and until I was twenty, I kept hoping that my dad would get shot down over a foreign country so that I could rescue him. But he's doesn't like flying, so it didn't happen.","user":"Neonsamurai","rank":[35,44]},{"title":"Very fun movie with a great soundtrack...","rating":25,"date":"25 March 2001","review":"I remember seeing this movie in the theater when it first came out. I think I saw it three or four times. It was the best air combat movie I had seen at the time.<br><br>     I hear this movie compared to Top Gun a lot. In my opinion there is no contest. Iron Eagle is far better than Top Gun. Here's why. Top Gun had very good aerial combat sequences. Some of the best I've still ever seen. However, the plot of Top Gun was AWOL. All I remember of Top Gun is, they practiced, he got the girl, his pal died and he was the hero at the end. Iron Eagle had a good plot. However the aerial combat scenes are pretty fake and tame. Sure it was unbelievable that they could pull it off but there was a plot and a good one. <br><br>     Iron Eagle's fun lies in it's youthful angst and comedy. Louis Gossett Jr. shows his veteran acting skill in this movie as the veteran pilot. Jason Gedrick was good as the young upstart pilot with too much testosterone. They chemistry between the actors was good. There is one scene where they young pilot asks for Chappy's help and he turns him down and Louis Gossett's acting skills become quite evident. One of the best scenes in the movie is the race between the motorcycle and the Cessna with a pounding rock song in the background. It is one of the best done flight sequences I've seen in a move and is not fake like the combat scenes. Another scene is when the kids use their dupe their parents and other military personnel into getting them what ever they want from the base, including two F-16s. But more than these scenes, it's really the soundtrack that makes the movie. There are songs by Queen(One Vision), Dio(Hide in the Rainbow) and The Spencer Davis Group(Gimmie Some Lovin), what a combo! Not only does the music sound good to our young pilot, it also makes him fly and fight better! While I can't say that Iron Eagle is a masterpiece, it is one of my favorite movies of all time.<br><br>     Iron Eagle is out on DVD! Now I finally have and excuse to buy a DVD player!<br><br>\nRayvyn","user":"Rayvyn","rank":[15,20]}]