[{"title":"The boy who refused to grow up","rating":10,"date":"17 December 2006","review":"When Sir James M. Barrie agreed to allow Famous PlayersLasky to make a movie version of his 1904 Christmas pantomime Peter Pan, he laid down some pretty stiff terms. Not only was he to have casting approval, but the title cards were to use as far as possible the dialogue of the stage play; the plot line was to keep to the original Three-Act structure; the characters were to be those of the playnone were to be eliminated and additional characters were not to be introduced; and above all, the characters were to fly realistically. Sir James also insisted on writing a long Preface to the movie in which he made the point that Peter Pan was a pantomime and needed to be accepted as such. <br><br>Unfortunately, he was unaware of the fact that Americans do not know what a panto is, let alone what are its traditions. Luckily, this didn't really matter. The picture was a huge success anyway and catapulted eighteen-year-old Betty Bronson (whom Barrie himself had chosen for the lead) into celebrity status overnight.<br><br>So to really appreciate the picture we need first to understand what a panto is and what Barrie did to change or modify its structure and traditions.<br><br>By the turn of the century, the annual Christmas pantomime had become a very elaborate affair. In fact, every year theatre managements vied with each other to offer presentations even more spectacular than they had staged in the past. (A successful panto didn't just fill the theatre at Yuletide but would run right through Easter). Although largely (and very loosely) based on nursery rhymes and fairy tales, pantomimes had a rigid cast system. The lead role was always the Damea middle-aged woman, enacted by a leading funnyman, the more raucous, the better. Next in line, was the Principal Boy, always played by a very sexy young lady who wore abbreviated costumes to show off her legs. The Villain was usually billed next, and then came the specialty acts. These were vaudeville turns by jugglers, singers, magicians, etc., often used to entertain the audience while stagehands readied the spectacular main set for the next Act, but just as often actually interpolated into the panto itself. Of course, pantos always had plenty of real children milling around the stage, but the leader (who had practically all the lines) was a young adult (even though he or she might be a impersonating a character supposedly ten or twelve years younger). <br><br>Doubling was quite common in the panto. Often it was a matter of necessity, but just as often it was done deliberately. Barrie intended that Mr Darling and Captain Hook always be played by the same actor. Unfortunately, both Brenon and Paramount jibed at this idea and finally convinced Barrie that on a motion picture set, it was impractical.<br><br>The principal change (and it was a brilliant one) that Barrie made to the traditional structure was not to turn the Dame into a dog (Dames had often played comic animals in the past) or even to restrict the Dame's frolics to Two Acts (although top-billed, the Dame's role was often not all that large. In some pantos, he/she didn't even make her entrance until the Second Act). What Barrie did was absolutely startling. He made the Dame silent. He/she doesn't utter a word. The role is all pantomime, you see. Pantomime yetin a pantomime! Brilliant! <br><br>Now we can appreciate the movie for what it is: not just a filmed pantomime but one that goes beyond the restrictions of the stage to make the spectacle more spectacular, and the special effects even more wonderful and startling.<br><br>Also we can now enjoy the way the movie is cast and played. It's a pity Hook and Darling are no longer played by the same man (though admittedly it is just as hard to imagine dull Chadwick, perfect as stuffy Darling, brandishing a villainous hook, as it is to see Ernest Torrence toning down the foam as Wendy's dad). However, super-sexy Betty Bronson makes an ideal Peter Pan (it's important that the character be lasciviously attractive yet act as if she is totally unaware of this factand this Miss Bronson accomplishes remarkably well, no doubt due to Brenon's meticulous direction). <br><br>Eighteen-year-old Mary Brian is also superbly cast as Wendy. Even though her stage age is around twelve or thirteen, she is not only the leader of the children, but a genuine mother figure and is supposed to look just a few years younger than the actress playing her mother, in this case twenty-two year old Esther Ralston. (You're not supposed to be mathematically minded and try to work out how a twenty-two year old can have a twelve year old daughter. Pantomimes are inevitably fanciful). The father figure is usually much older. Forty-five year old Cyril Chadwick fits the bill nicely.<br><br>It's a tribute to Brenon's skillful yet sensitive direction, James Wong Howe's beautiful photography, Pomeroy's fascinating special effects and the enduring charm and cleverness of Barrie's fairy tale that the movie is just as enchanting in 2007 as it seemed to appreciative worldwide audiences in 1925.","user":"JohnHowardReid","rank":[20,22]},{"title":"Notes from my introduction to a recent PETER PAN (1924) screening...","rating":9,"date":"29 September 2009","review":"PETER PAN was directed by Herbert Brenon with a screenplay written by Willis Goldbeck, based on the story by J.M. Barrie. In fact nearly all of the intertitles (the words on the cards that we read to ourselves) are taken directly from J. M. Barrie's dialogue from the original play around 105 years ago! James Barrie was born in 1860, the ninth child of ten. He was a small child (he only grew to 5 feet 3 inches as an adult) and he drew attention to himself with storytelling. He is best remembered for creating Peter Pan, the boy who refused to grow up, whom he based on his friends, the Llewelyn Davies boys. He is also credited with popularizing the name Wendy, which was very uncommon before he gave it to the heroine of Peter Pan. When he died he left the rights to this story and all it's future profits to the Great Ormond Street Hospital for children. This filmed version of Peter Pan, the very first (of eleven so far) opened Christmas week, 1924. Then, like one of the Lost Boys, it vanished into a Never Land of its own. Paramount, like every other studio, looked on its films as disposable product. Films were as ephemeral as the daily newspaper. Why bother to keep a print? No studio, museum or archive could find it, nor any of the private collectors, who could sometimes materialize copies that more legitimate sources could not. It was one of the most important of missing American films. For the children who saw it, nothing else ever compared. William K. Everson, one of the great silent film historians, never tired of rhapsodizing Peter Pan or its glowing star, Betty Bronson. James Card, curator at George Eastman House and one of the great heroes of film preservation, longed to see this childhood favorite with a desperate nostalgia. It was he who, as a young man working for Kodak in Rochester, discovered a fume-filled vault of decomposing nitrate films. Nitrate films are highly flammable, can spontaneously combust and even burn under water because they supply their own oxygen. Card convinced Kodak to call Iris Barry, the visionary film preservationist at the Museum of Modern Art to help save this title. This beautiful tinted print was restored from that one of a kind, surviving nitrate print. It stars beautiful blonde Esther Ralston as the mother Mrs. Darling. One of the best-liked silent movie stars both on and off the screen, Mary Brian plays Wendy. Philippe De Lacy, arguably the silent era's cutest child actors plays Michael. The exotic oriental actress Anna May Wong has a small role as Tiger Lily. And giant Ernest Torrence is evil and menacing as Captain Hook. Tinker Bell is played by an actress named, of all things, Virginia Faire. And the family's pet dog Nana was such a good actor that in real life he was called George Ali. As for the lead role of Peter Pan, it was the author James Barrie who selected Betty Bronson, then an unknown to play the coveted role after he turned down silent superstars Mary Pickford, Gloria Swanson &amp; Lillian Gish. Barrie selected Betty Bronson because she had trained for the Ballet Russe with famed choreographer Michel Fokine and her grace and innocence were unmatched. (And she could fly!) It is surprising when you see how lavish the sets, costumes and special effects are that the budget for this film was only $40,000 and I think this is much better than the 1991 version which cost $70 million dollars to make. I would like to read a quote from the New York Times, from MORDAUNT HALL, one of their toughest critics written Christmas week of 1924 – \"That wonderful ecstatic laughter, tinkling and beautiful, just the laughter that Barrie loves to hear, greeted Herbert Brenon's picturized version of \"Peter Pan\" yesterday afternoon in the Rivoli. Again and again the silence of the audience was snapped by the ringing laugh of a single boy which was quickly followed by an outburst from dozens of others, some of whom shook in their seats in sheer Joy at what they saw upon the screen. It was laughter that reminded one of the days of long ago when one believed in a sort of Never Never Land, when the smiling sun on an early morning made one dance with joy over the dew-covered grass, when the fragrant Spring flowers sent a thrill through one's youthful soul, when one gazed at a real fish in a shallow rippling stream and expected to hook it with a bent pin, when one thought that after all it might be possible to fly. These jubilant outbursts from youthful throats even brought to mind some beautiful anthem one had heard the choir singing in a lofty cathedral. It was laughter that brought a tear of exuberant gladness to our eyes—laughter that makes grown-ups delighted to be alive.\" - Unquote. PETER PAN like the WIZARD OF OZ has helped remind adults of what innocence we all shared back when we were children. So when you are asked during the film to clap if you believe in fairies, you better clap or you may never feel young again!","user":"Larry41OnEbay-2","rank":[10,11]},{"title":"Peter Pan---An Enchanting Silent Film For All Ages","rating":19,"date":"19 December 1999","review":"After watching the Kino DVD of PETER PAN,  I was delighted to have this most charming of silent films finally available in a quality video release.<br><br>The picture quality, which was subtly tinted amber and blue, will disappoint no one, although it looked more like a really good 16mm print than a 35mm to me. Perhaps I'm spoiled because I've never seen the film in any  gauge but 35mm.  A great deal of the magic in PETER PAN was supplied by cinematographer James Wong Howe. Scenes that could have been foolish in other hands became enchantment in his.<br><br>The actors are magically believable in their parts.   Betty Bronson, who convincingly plays a child although we never forget that she's really a grownup woman, gives a performance that is unusually `fey' and she seems to have fully developed every muscle in her face that can cause an adorable look to radiate to the viewer. Ernest Torrence as Captain  Hook will remind everyone of their grandfather while he comically menaces Peter and the Lost Boys, but remains the perfect gentleman with Wendy------complete with courtly bowing and a flourish of his handkerchief .<br><br>\nThe animals in Never-Never Land are children in marvelously expressive fur costumes who look like stuffed animals come to life.  But the largest and most expressive of all is Nana, the canine nurse maid for the Darling Children who will amaze everyone with her anthropomorphic gestures.  She (played by George Ali) is the delight of the film.<br><br>PETER PAN is filled with magical touches that never seem to go too far or become foolish.   Peter's heart to heart talk with the crocodile when they conspire to \"get\" Captain Hook was one of my favorites, as were the mermaids on the beach. The only point that has ever bothered me is at the end when Peter actually stabs and kills two of the pirates.  Somehow I thought this was out of place and brought too much realism to a light hearted fairy tale.  But this is very minor nit-picking of an otherwise flawless silent film.<br><br>Phil Carli's score works perfectly and has a \"turn of the century, concert in the park on a Sunday afternoon\" feel to it.  It wouldn't have worked with many silent films, but for PETER PAN it was marvelous------a  tribute to Carli's ability to match a narrative theme with it's programmatic musical compliment.<br><br>The \"value ads\" are production stills from the film along with a poster and lobby card.  There are also interviews with Esther Ralston (one video and three audio), who plays Mrs. Darling.  The things she has to say about Louis B. Mayer are more than just interesting.<br><br>A title card at the very beginning tells the audience that the acting may seem whimsical to an adult but that \"all the characters are seen with a child's outlook on life.....even to the adults in the story.  Pull the beard on a pirate and you would find the face of a child.\"  So for 102 minutes, clap your hands and pretend you believe in fairies.<br><br>Jay F.","user":"Cinebug","rank":[10,11]}]