[{"title":"Totally insane, one of a kind movie...","rating":8,"date":"19 June 2015","review":"You know what? Sometimes words really aren't enough to do justice to something.<br><br>Roar has to be without a doubt the most insanely unsafe cinematic undertaking I have ever had the pleasure of watching. The unbelievably high level of danger is quite frankly there for everyone to see up on the screen as we watch a group of actors interact with over one hundred big cats with no protection whatsoever! It was inspired by the success of the lion drama Born Free (1966). And you might make the observation that there is fifteen years between these two movies and think this strange, well that's because this flick took eleven years from start to finish! Its production met with all manner of set-backs such as fire, flood and disease; each of which put the film's schedule back. But more to the point, it was as dangerous to work on as it looks on screen. The opening credits state that no animals were hurt in the making of the film, what they could not say with as much confidence was that there were no humans hurt! As it was, seventy cast and crew were injured, including cinematographer Jan de Bont who was partially scalped, Tippi Hedren had her neck bitten, Melanie Griffiths almost lost an eye, Jerry and John Marshall both required extensive stitches, while Noel Marshall was attacked so often it took years for him to recover from his injuries. When you watch Noel in action in this film it is not exactly hard to see why! In fact some of the injuries can be seen happening on screen. It is madness, pure and utter madness.<br><br>But because of this, it makes for highly entertaining and bizarre viewing. Unfortunately, the public back in 1981 didn't seem to agree and Roar was a box office disaster. To be honest, this is not entirely surprising as this feels far more like a cult movie than blockbuster material, given its utter strangeness. For a start it doesn't really have a plot and it boils down to a few events that bring our human cast into contact with the big cats. The story barely makes sense if you think about it very long. But who needs a story when you've got this insanity on screen? The madness and health and safety black hole that the events on screen represent mean that a story needs be no more than an afterthought. For what it's worth, Noel Marshall - wrote, starred, directed and financed it and his wife Tippi Hedren, who was a wildlife activist who campaigned for the protection of big cats, was the big name draw. Hedren, of course, was previously most well-known for her starring role in The Birds (1963) where she was famously mauled and scratched by an assortment of flying fiends. Well, all I can say is that what she experiences on Roar makes the actions of the birds in Alfred Hitchcock's classic seem positively reticent by comparison.<br><br>The actors are all splendidly game and deserve huge amounts of credit for their nerve but the real stars of Roar are the big cats and rampaging elephants. This is the ultimate wet dream for any lover of the big cats in particular and we have the very strange scenario of seeing lions, cheetahs, panthers, leopards and tigers interacting with each other. Watching them violently wrestle is a pretty nerve shredding thing, except if you are Noel Marshall that is, he usually runs in to join them! But on the whole, while there are a few continuity errors and the editing is full-on and sporadic, this is exciting stuff that could never in a million years be described as boring. It truly defines the term 'one of a kind'. With health and safety legislation what it is now, there is no way in hell there will ever be another film like Roar. It's truly unique and I sure lapped it up.","user":"Red-Barracuda","rank":[45,50]},{"title":"The most death defying film I've ever seen.","rating":9,"date":"9 August 2015","review":"And I thought Grizzly Man was crazy. This film made me uncomfortable, bewildered, and astonished all at once. How nobody died during the making of this is beyond me. How ANYBODY in their right mind would even think of committing to this movie for even a fraction of a year is completely and totally insane. For a film with overtones of slapstick comedy, it certainly manages to deliver a feeling of intensity and uneasiness that I've never experienced while watching a movie before. At times, I felt like the novelty was fading away, only to be reminded that THIS FILM IS WHAT HAVING A DEATH WISH LOOKS LIKE. Every so often, you come across a movie that sticks with you for whatever reason. This is one that you won't forget anytime soon. I promise you.","user":"Sleek_The_Wanderer","rank":[15,16]},{"title":"In the belly of the beast they ROAR!","rating":10,"date":"21 December 2001","review":"There's nothing fake about this film.  It's shot beautifully, on real locations.  Tippi Hedren and Melanie Griffith head a talented and fearless cast, who literally throw themselves in the jaws of the beasts over and over again.  The picture has a terrific rhythm and is fun to watch but I couldn't help dwelling upon how dangerous a film it must have been to make. Although there were some poignant and funny moments like the scenes where dauntless John Marshall tries to pull his boat away from the shore but the lion keeps pulling it back or when he hides in a barrel filled with water and the lions begin to drink from it.  The story seems simplistic in structure but is really quite profound in the way Marshall draws sympathy for the animals, brilliantly shot by John De Bont.  The closeups of the dying beasts will bring tears to your eyes.  This is must see for anyone who believes that filmmaking is artificial and safe.","user":"Deepack","rank":[34,41]}]