[{"title":"A Healthy diet of Caribbean scum, school boys and nuns!","rating":5,"date":"10 September 2007","review":"I awarded the first \"Killer Crocodile\" with a rating 5 out of 10. Probably that was way too generous of me, but hey, the film was extremely funny (talking terms of pure cheesiness) and it was damn entertaining! This rapidly put together sequel is oddly amusing as well, even though it features the exact same storyline and re-uses a whole lot of footage of the original. I don't know why, but I just can't hate it! Or perhaps I do  Still early in the film, there came a sequence that instantly made me appreciate this poverty row B-production a bit more! The big titular croc patiently sneaks up on two boats carrying singing school boys and a couple of nuns. All this time you're thinking something or someone will appear and save them, but HELL NO! The ugly over-sized reptile brutally attacks them and extendedly feasts on these poor and unlikely victims! Now, personally, I have a strong admiration for horror movies that dare to kill children on screen and so  even though far from being a good film  I still appreciate \"Killer Crocodile\" for its courage. Naturally, the rest of the film is laughably inept, with an absolute lack of tension, abysmal dubbing and some of the most horrid dialogs you'll ever hear (for example: \"Without my bathing suit, I feel naked\"). The story takes place in the same Caribbean area of the first film, where the rich and corrupt locals still dump radioactive waste in the swamps, and now they're even planning to build a holiday resort there as well. Is the continuous pollution responsible for the new crocodile's gigantic proportions and insatiable hunger for human flesh? The script never really hints at it, but probably. One thing's for sure though: he's one massive fella with enough strength to pull entire sheds into the water. Debra Karr (who really isn't too hard on the eyes) stars as a New York reporter; sent to the area to investigate the questionable politics and to check if the swamps are clean. She's a tough chick, who single-handedly takes on car thieves and toys around with wannabe rapists, but a giant killer croc is too much even for her and she'll need the help of the same Crocodile Dundees of the first film. Ennio Girlami's role is nothing more than an extended cameo, but Richard Crenna Jr. is offered once again the chance to play a heroic part. The script pretty much sucks (the main villain isn't even punished) and the pacing drags occasionally, but there's a lot of cheesy gore and cheap stunts to enjoy. Giannetto De Rossi's (basically a special effects guy) directing is far below average and Riz Ortolani's score is a little too obviously borrowed from John Williams' theme for \"Jaws\". In other words, this film is only recommended to tolerant fans of typical Italian rip-offs.<br><br>NB: If anyone's interested, \"Killer Crocodile II\" does feature one of the most original pick-up lines I ever heard! After surviving a close encounter with the monster, Liza walks up to Kevin and says something like: \"Don't you know that fear and near death situations stimulate and heighten man's reproductive organs?\" There's a line I have to remember! His response is pretty good too, as he says: \"Oh is that true? I guess my dad was right when he said that you learn something new every day!\" Now that's what I call arousing pillow talk!","user":"Coventry","rank":[5,5]},{"title":"A lazy effort.","rating":4,"date":"8 January 2005","review":"\"Killer Crocodile 2\" runs 82 minutes (including credits). About half of those are dead space - like a female reporter's petty bickering with her colleagues back in \"New York\". Roughly 10 more minutes are taken up by flashbacks = footage lifted from the original film (including its ending). That leaves about 30 minutes of pure crocodile-chomping-on-people action, and the croc itself looks good; even if it's stodgy at times, it's still vastly preferable to the computerized crocs of such recent bombs as \"Crocodile\" and \"Blood Surf\". But the script is so lazy that just when the movie looks about to finally get going, we get a stupid climax and it's all over. Anthony Crenna repeats his role from the first film; don't expect any acting awards coming for him anytime soon. Leading lady Debra Karr has (at least in the first half) a self-assured, take-no-sh*t attitude that I quite liked. (*1/2)","user":"gridoon","rank":[4,8]},{"title":"Could Have Used Some Improvement","rating":4,"date":"14 July 2014","review":"Although the gigantic killer crocodile was killed at the end of the previous film, she managed to leave behind an egg that hatches in the same swamp at the beginning of this movie. Meanwhile, a newspaper reporter for the New York Chronicle named \"Liza Post\" (Debra Karr) has been assigned the case involving the illegal dumping in that swamp which has yet to be cleaned up. Sent to help her is the swamp expert by the name of \"Kevin Jones\" (Anthony Crenna) who killed the killer crocodile in the first movie. Now, as far as this film is concerned it certainly could have been much better. The dialogue was substandard and some of the scenes were pretty bad as well. But to be fair the movie was filmed in Italian and dubbed into English so I suppose some allowances should be made. Also on the plus side was the presence of Debra Karr who was absolutely stunning. Still, as I stated earlier, this movie could have used some improvement and even though I enjoyed it, in all fairness I have to rate it as slightly below average.","user":"Uriah43","rank":[1,1]}]