[{"title":"Hidden Treasure","rating":10,"date":"6 June 1999","review":"Phillip Kaufman's loving examination of Anais Nin's relationship with Henry and June Miller is an enthralling journey.  In the film Anais is inspired by Henry and June to descend into a world of debauchery that fuels her erotic writing.  We the audience see Henry and June through the eyes of Anais, which may mean it's not exactly as they really were, but rather a romanticised version of them.  This is NOT a biopic of Henry Miller, which is the foolish mistake that some reviewers seemed to make on the films release.<br><br>The script tends to meander a bit, lacking any real plot.  Each scene lives for itself, some more successfully than others.  But in the torrid climax when Anais' wild ways have finally caught up with her, it all comes together nicely to leave a feeling of completion.<br><br>The cast is first rate.  Maria de Medeiros, despite not having top billing, get's the bulk of the screen time as Anais.  She has a captivating look, and embodies a sense of innocence throughout, despite displaying the most promiscuous nature.  If at times she overdoes the melodrama, she should be commended for managing to purr out some rather flowery dialogue without sounding silly.  Many lesser actresses would have faltered.<br><br>In what is undoubtably the highlight of his film career, Fred Ward instils Henry with some old styled charisma and gusto.  While he gives us a throughly entertaining Henry, I still however have trouble seeing this character as a writer of erotic fiction.  He seems too much like a man's man. The original casting choice of Alec Baldwin would make more sense in this case, but I doubt in the end he would have been as entertaining in the role as Ward.<br><br>Uma Thurman, as June, gives a memorable performance.  It's the most showy character in the film, and Thurman gets the chance for plenty of legitimate scenery chewing.  She uses the full scale of emotions and performs a transformation of the character from menacing seductress to pitiful emotional wreck.  Despite the surprising comments of one of the other posters here, it really is one of the best performances of her young and promising career.<br><br>In support, Richard E. Grant is awkward (probably purposely) as Hugo, Anais' well-hung and faithful husband.  Jean-Philippe Écoffey is adequate as Anais' cousin and brief lover.  Kevin Spacey is amusing in what now looks like a cameo, but then was quite an important role for him.<br><br>Philippe Rousselot's cinematography is beautifully done.  He creates an almost surreal feeling of Paris in the 1930's.  The music is also well placed and adds to this mood.  Kaufman and Rousselot make the numerous sex-scenes things of beauty rather than titillating, they get creative with them.  In fact, the film is surprisingly unarousing considering the amount of sex occurring in it.  Whether this is a good thing or a bad thing I guess you can decide for yourself.  Why on earth it got an NC-17 rating I don't know.  I doubt it would if released today.<br><br>Not everyone will like this film.  It is 'arty farty' so to speak.  It's maybe even a little pretentious.  But I find it to be a fascinating and just plain absorbing trip.  I have managed to find the time to watch it quite a few times, and it seems to improve with age.  I recommend it to any thinking filmgoers.<br><br>9/10","user":"Raskolnikov","rank":[74,86]},{"title":"Maria de Medeiros as Anais = Perfect","rating":7,"date":"10 December 2002","review":"If you're drawn to this film as a Henry Miller fan and expecting the Paris of Tropic of Cancer, you'll be let down.  This film is a character-driven drama and therefore it is not intended to reproduce Miller's vision. Instead, the film focuses on (then) newly revealed excerpts from Anais Nin's diary.  Four characters: Miller, Anais, June (Miller's wife), and Hugo (Anais' husband) complete the love square within which fairly complex relationships play out.<br><br>The film is primarily concerned with Anais' sexual awakening through her relationship with Miller and his wife.  And I have to say, de Medeiros exceeds all expectations in this role.  Not only does she look remarkably like the young Anais, but she also seems to radiate the writer's deep erotic mystique.  If nothing else, watch this film just for this performance-- besides, she's absolutely gorgeous.  Thurman's performance is also quite good, her NYC accent believable and her dirty-girl role works well in contrast to Anais' bourgeois exterior.  Ward as Miller took some getting used to, but Grant's character seemed wooden and artificial.<br><br>Literary and historical references are sparsely sprinkled throughout the film, and although Miller has a few monologues in which he attempts to express the point of his writing, Miller fans will find nothing more than a superficial synopsis.  But again, this can't be counted against the film since its focus is Anais.  As far as the eroticism of the new \"Journals\" goes, the film succeeds fairly well- but the images convey more than the dialog.<br><br>This brings me to my final point: the NC-17 rating.  Historically, this film was the first with that rating-- the MPAA created the rating specifically for this film since they deemed it to risqué for an R.  By today's standards, this film is an R.  If you're looking for softcore, watch \"Emmanuelle\" or something.<br><br>\n7/10","user":"zenlunatic","rank":[30,37]},{"title":"I've done the vilest things - the foulest things - but I've done them... superbly.","rating":8,"date":"29 June 2007","review":"Anaïs Nin is hailed by many critics as one of the finest examples of writers of female erotica. She was one of the first women to really explore the realm of erotic writing, and certainly the first prominent woman in modern Europe to write erotica. Henry and June is based upon her life in Paris around 1931, and her relationship with Henry and June Miller. This relationship strongly influenced her as both a woman and an author.<br><br>Phillip Kaufman (Invasion of the Body Snatchers (1978), Quills, Raiders of the Lost Ark) does a superb job of directing his own screenplay and presents a story that flows smoothly as it presents a picture of bohemian life in Paris that consumed the banker's wife.<br><br>I am not sure they could have found someone better than Fred Ward (Remo Williams) to play Henry Miller (Tropic of Cancer, Tropic of Capricorn, Black Spring). He just seemed to fit right in with the character.<br><br>Uma Thurman (Kill Bill, Pulp Fiction) was fantastic as his wife, June, the bi-sexual who fell in love with Nin. After realizing that she lost Nin to her husband, she left him. What was interesting was that Nin immediately left Miller to return to her husband. You really need a scorecard to figure out who is married to and sleeping with whom.<br><br>Nin was played by Portuguese actress Maria de Medeiros (Fabienne in Pulp Fiction). She was sensational as the woman who fell into the bohemian life and lifestyle.<br><br>There were brief appearances by Kevin Spacey as a lawyer who wanted to be a writer, and the person who introduced Nin to Miller.<br><br>The slice of life in Bohemian Paris in 1931 has to be seen to be believed. It was an exciting time and certainly an exciting place. To see a piece f some of the greatest writers in American erotica, even fictionalized, was also great.<br><br>Henry and June holds the distinction of being the first film to receive an NC-17 rating.","user":"lastliberal","rank":[17,20]}]