[{"title":"Peckinpah expands his horizons.","rating":14,"date":"14 October 2012","review":"In direct response to the controversy which erupted over the unprecedented violence and gritty realism of The Wild Bunch, Sam Peckinpah did what many of the greatest American filmmakers have done over the years. His next project would end up being almost intentionally counter to the previous film.<br><br>The result was The Ballad of Cable Hogue, a small-scale, intimate tale that is equal parts a nostalgic look back to the Old West and a tribute to the kind of man capable of surviving and thriving in such an environment. Jason Robards is touching and firm as the title character, left for dead in the prologue but able to fight through his misfortunes and create his own oasis. Along the way, he encounters a most unusual and shifty man of the cloth and a prostitute with a heart of gold. Stella Stevens is really wonderful as Hildy, one of the best examples of this most ancient of Hollywood screenplay clichés. Her romance with Hogue is both sincere and sad as Peckinpah uses this as a template for how the romantic West quickly found its way into decline and obsolescence.<br><br>Peckinpah may have gotten a lot of flack for The Wild Bunch but this film received almost just as much criticism, ironically for being almost exactly not what he had come to be known for. However, some forty years later, Peckinpah's true vision of men unable to conform to the regularities of society shines through. Gorgeous photography, solid acting, a beautiful score and themes of survival and memory point to this as one of the most brutal Western director's gentlest and personal triumphs.","user":"bobsgrock","rank":[11,11]},{"title":"Peckinpah's lyrical vision of the West provides humour and comfort to director and viewer alike.","rating":9,"date":"4 March 2008","review":"The Ballad Of Cable Hogue sees Sam Peckinpah in jolly form. There is nothing here to trouble the censors, a bit of violence here and there - and some nasty human traits seam through the story, but this is purely a funny and touching movie that again deals with a Peckinpah fave theme of the Old West passing. Only difference is here he has his tongue firmly in cheek as he observes the thirst for finance sweeping across the country.<br><br>Cable Hogue is a prospector left for dead in the desert by his two double-crossing partners Bowen &amp; Taggart. Wandering across the desert talking to god, Hogue collapses during a sandstorm and finds mud on his boot, after digging down for a while he finds the miracle of water (though Hogue badly misspells this on his advertisement). An encounter with preacher Joshua convinces Hogue to go patent his spring and make a killing selling water to the passing stagecoach trail that runs by his newly found oasis. After striking a deal in the town of Dead Dog, Hogue is set up nicely while into the bargain he falls for gorgeous prostitute Hildy. The film cheekily (just like Hogue) has established itself as a fine piece by the time it takes it's dark turn. It seems that revenge is the new found recipe on the Cable Springs Menu.<br><br>This was Sam Peckinpah's favourite film from his own CV, it's his most personal, he apparently saw a lot of himself in Cable Hogue, and with that in mind the film does gain a bit more emotional heart. But strikingly, it's the humour in there that shouldn't be understated, this was the director at one with himself, and the result is lyrical deftness. The cast are great, Jason Robards is wonderful in the title role, Stella Stevens as Hildy shows a fine actress at work. So much so it only makes me lament that she didn't have a great and industrious career post Cable Hogue. Peckinpah faves Strother Martin, L.Q. Jones &amp; Slim Pickens reward their loyal director with impacting shows, while David Warner as the confused preacher Joshua practically steals the film with his hedonistic leanings.<br><br>Don't go into this film expecting a blood and thunder Western and you will be pleasantly surprised at it's heartbeat. Different sort of Peckinpah, but it's also essential Peckinpah. 9/10","user":"hitchcockthelegend","rank":[20,22]},{"title":"Sam Peckinpah's Multigenred Masterpiece","rating":10,"date":"14 April 2006","review":"Fresh off his triumphant \"The Wild Bunch\" and just before his astounding \"Straw Dogs,\" Sam Peckipah made this \"little picture,\" that flopped. However, while \"The Wild Bunch\" and \"Straw Dogs\" are terrific movies, \"Ballad of Cable Hogue\" is the most accomplished of the three. It certainly is hard to categorize \"...Hogue,\" thematically. It includes strong elements of the following genres: o Violent western o Slapstick comedy o Sophisticated comedy o Romantic comedy o Love story o Social commentary o Spiritual film<br><br>With the exception of the rather silly slapstick, director Sam Peckinpah handles all these elements superbly, particularly the social commentary, spiritual elements and love story. Much credit is due to a fine cast, particularly actress Stella Stevens and actor David Warner, who both deserved Oscar nominations. Stevens, as the prostitute, \"Hildy,\" mines the \"...heart of gold\" and hits the mother lode. Hers is one of the all time great performances by an actress. Warner's manipulative preacher, \"Josh,\" manages to be alternately witty, lecherous, noble and profound, without missing a beat.<br><br>The best I can say about Jason Robards as \"Cable\" is, if you loved his character, \"Cheyenne\" from \"Once Upon a Time in the West,\" you love his \"Cable Hogue.\"<br><br>Don't read the plot of this movie. Go in as I did in 1970, not knowing what to expect. You'll be amused, touched, aroused (particularly if your a male) and saddened. It's all here. How many films can you say that about?<br><br>I give \"The Ballad of Cable Hogue\" a \"10.\"","user":"Bob-45","rank":[56,72]}]