[{"title":"We All Live In A Pink Submarine","rating":9,"date":"31 March 2007","review":"In Tony Curtis's filmed tribute to Cary Grant for TCM he made much of his well known idolatry of the man who made him want to become an actor. As a kid growing up in the mean streets of New York, young Bernie Schwartz saw in Cary Grant all he ever wanted to be up there on the silver screen.<br><br>During naval service on board a submarine in World War II he got to see Cary Grant in Warner Brothers Destination Tokyo. As Curtis said, life has a funny way of working things out. What happens; Tony Curtis gets to star with Grant years later in a World War II service comedy that is set aboard a submarine.<br><br>Destination Tokyo was not one of Grant's best films, but Operation Petticoat definitely is. Right after World War II starts, Grant's new ship, the Tigerfish is sunk right in her berth in a remote Pacific Island. Grant persuades Admiral Robert Simon to make whatever repairs he can and try and get the ship back to Pearl Harbor for repairs.<br><br>Among other things Grant gets is a new officer Tony Curtis who hasn't exactly seen much sea duty, but he's quite the operator. The two develop quite an interesting relationship on the voyage.<br><br>And it's one thing after another on that memorable shakedown cruise back to Pearl Harbor. But Cary Grant is as unflappable and charming as ever, though even he seems a bit put out at times.<br><br>There are some pretty hilarious moments in Operation Petticoat, the sinking of a truck, the painting of the Tigerfish pink and then having to leave it that way until Pearl Harbor. And who can forget how they are saved from friendly fire at the climax of the film.<br><br>Operation Petticoat was one of the biggest commercial and critical hits that Cary Grant had in Hollywood. Coming right after North By Northwest it could well be argued this was the high point of his career.<br><br>The film holds up very well today, I think today's audience would laugh just as hard as they did in 1959.","user":"bkoganbing","rank":[45,48]},{"title":"Curtis and Grant at their peak.","rating":9,"date":"9 August 2003","review":"A wry and lighthearted look at the U.S. Navy in 1941. Cary Grant and Tony Curtis shine amongst a wonderful supporting cast in this fictional story inspired by an actual incident that occurred during WWII.  So many war movies are depressing, while others are completely ridiculous.  This film, while full of sexual innuendo and lighthearted humor, still manages to keep it's humanity, with one foot planted firmly in the reality of the Pacific theater.<br><br>A jaunty tale of an injured sub, a few army nurses, a group of lonely sailors, and some pink paint. The direction is above par for the time period and genre, the writing is bright and witty, even for today's standards, and the performances are thoroughly entertaining.  <br><br>This is a recommended must-see for fans of Curtis and Grant. Grab the popcorn and soda and enjoy!  I give this charming 1959 classic a 7 out of 10.","user":"redservo","rank":[24,26]},{"title":"Top talent makes this a winner.","rating":6,"date":"6 April 2004","review":"There's really no reason to expect that this easy-going military comedy should hold up so well after almost 50 years.  While extremely popular as a Christmas release in '59, it then boasted two top box office stars to bring in the crowds, which most critics agreed were the primary attraction supporting some rather thin and predictable material.  But the merits are considerably more than reviewers originally gave credit for, and the film endures as a cleverly crafted entertainment on several levels.  Its uncomplicated premise accommodates humor less derived from incident than from character and situation, making it seem far less pretentious than most films of its kind.  Service comedies of this period tend to follow a pattern set by MR. ROBERTS, which was based on a hugely successful stage play and quite reverent to those origins. PETTICOAT is far more spontaneous, so even if plot threads tend to be a bit familiar, its the delivery rather than the content which holds our attention.  Of course it doesn't hurt to have Cary Grant at the peak of his powers, hitting all the right notes, balancing the role of naval officer with innate dedication combined with his own charismatic charm and seemingly effortless humor, a performance which is both naturalistic and funny.  Curtis, too, had found his groove at this point (he had just completed his tour de force for Billy Wilder, SOME LIKE IT HOT) contributing just the right balance of ingenuousness and star-of-the-month savvy to make his `second banana' role a success.  But the lion's share of the credit must go to Blake Edwards, then in the early stages of his most successful period as a master comedy craftsman, boisterous yet sophisticated, among the last of a breed of Hollywood stylists on the rise at a time when the old studio system was nearing its end.","user":"celluloidrabbit","rank":[34,40]}]