[{"title":"Lacerating Film","rating":9,"date":"17 June 2005","review":"This is a fine example of the breed of excellent Australian films released in the 1970s during the Australian film renaissance (it's interesting to note that virtually all of the directors of these films, including director Fred Schepisi, later moved to the U.S. to make big budget Hollywood films). This tale of a young aboriginal man who eventually turns to violence following one humiliation after another by white settlers in 19th century Australia asks some very uncomfortable questions of the audience such as: Is it morally justified to use violence against a corrupt, racist, violent system in which there are no lawful means to receive justice? Additionally, it is up to interpretation whether the violent reactions of the title character are justified: we are clearly sympathetic to him in the beginning, but once he perpetuates incredible brutality on the settlers, can we remain sympathetic? He is definitely not a monster, but a well-mannered and educated Aboriginal brought up by missionaries. After all, his actions are not simply heat-of-the-moment reactions; he has formally \"declared war\" on the perpetuators of injustice. Does that legitimize what he is doing? The U.S. has been asking itself these exact same questions for the past 50 years: Jimmy is very much a close Australian cousin to Bigger Thomas, the main character in Richard Wright's classic American novel \"Native Son\" - a black man pushed to violence by virtually every aspect of white society.<br><br>However, like Wright, I admired director Schepisi's decision to carefully straddle the line between whether Jimmy can be viewed as a simple societal construct or whether he is a man in control of his own actions. One could easily make a case for either of these scenarios or probably both of them. That makes the movie even more uncomfortable when one thinks about it afterward.<br><br>In many ways, this is a very depressing movie; in the end there is no closure, no justice, and nobody has learned a damned thing, except possibly the audience, if they truly think about what they have just seen. I really respect filmmakers who tackle incredibly difficult subject matter such as this, with moral quagmires and complex characters. My only complaint is that it is very difficult to understand much of the Aussie English, so an American viewer must listen very closely. This is a film definitely deserving of a U.S. audience. Too bad that its controversial (i.e. thought-provoking) nature has probably prevented it from being released on VHS or DVD in the U.S. I understand copies of this are quite rare abroad, as well, so I suggest viewing it if given the opportunity.","user":"Sturgeon54","rank":[38,41]},{"title":"The Best Australian Film?","rating":9,"date":"17 September 2012","review":"Fred Schepisi's 1978 film may well be just that but it's not included in my Australian Cinema 12 disc boxed set and I've never known it to be on TV, here. I became aware of it through my old film 'bible' Halliwells and they rated it very highly, awarding a rare maximum score, citing it as 'one of the greatest achievements in Australian cinema'.<br><br>It's taken me a good number of years to finally find a copy that was on region of DVD I could play and wasn't a silly price.<br><br>The first thing you notice is the sheer authenticity. Language is as brutal as any and is more akin to a Victorian Scorsese than starched collars and stiff upper lips. The language used to describe the aboriginal natives is as coarse and racist as you'll find in any gritty 70's set LA cop show and for that it is both upsetting and rather embarrassing, but at least goes to show the leaps and bounds humankind has largely made on this issue, since.<br><br>Jimmie Blacksmith is a half-cast, a subject that has been visited in a few memorable films, particularly 'Rabbit Proof Fence' and as 'these' were often the result of rape against white women, were seen as worse than the lowest. Jimmie (superbly played by Tommy Lewis) does have an advantage, he's overseen by the local white vicar and is known as a hard and honest worker.<br><br>He soon goes on to work for white farmers, along with his fully aboriginal brother, erecting fences. Miles of them. He does too good a job and they don't want to pay, so he moves on. His relationship with a white girl, then marriage results in a child, that by colour alone, cannot be his. Then, around half-way in, all this pent-up anger boiling up inside the civilised and decent Jimmie erupts. This is when the violence (extreme in its day, now, maybe sadly, average) erupts as he goes on a vengeful killing spree.<br><br>I need not go further than this, except that obviously, he is then a wanted criminal and a fugitive on the run.<br><br>There's a real sense of the epic, with cinematic hints and nods to Nicolas Roeg's 'Walkabout', with the natural geography, fauna and the culture all vividly brought to life, superbly filmed by Ian Baker .<br><br>Thankfully - hopefully, this can now be seen as a historical drama, the like of which can never happen again. It is as hard-hitting and making as powerful a statement on in-bred racism there is and is without doubt a five star classic.","user":"tim-764-291856","rank":[17,21]},{"title":"Brilliant Macabre and violent drama","rating":10,"date":"23 March 2005","review":"Thomas Keneally's THE CHANT OF JIMMIE BLACKSMITH novel works on so many levels - a period piece, as a biting satire and as a wonderfully composed drama. This film of the same name attempts to capture the poignancy and strength of the original classic novel. It achieves this wonderfully. The film is excellently acted and the violence is both well shot and vibrantly enacted. The score is great too. Also the Australian landscape - not to mention its social underbelly, was never shot with as much insight.<br><br>An excellent starting point to understand such great Aussie films like the tracker and rabbit proof fence.<br><br>10/10","user":"thewholebrevitything","rank":[17,21]}]