[{"title":"An excellent film that won't be called 'Great' because it was made by Hammer.","rating":11,"date":"11 October 1999","review":"There are many films like this - brilliant, thoughtful, stylish, inventive, provocative - that are largely forgotten because they were made by Hammer. Scan through the recent list of the BFI's 100 best British films, and there are very few gems like this.  Apparently, its alright to reappraise Ulmer, Lewis, Fuller et al, but we British are above that kind of thing.  If you ever see DEMONS, or something like THE PLAGUE OF THE ZOMBIES, on your TV listings, don't overlook it.  It's always the snobs who lose out. <br><br>\nThis is an astonishing film, a success in every way, a truly thoughtful horror film.  The story concerns an aristocrat who believes his family line is infested with bad blood.  He had married a peasant woman to offset this, but has instead infected the peasantry as well.  He has locked up his son and daughter, and is bleeding them, to stop the rot.  Meanwhile, peasant women are being raped and murdered throughout his estate.<br><br>From such a scenario, ripe for exploitation, is weaved a remarkable series of themes and variations.  The film's first image is of a horse and carriage rushing through a forest, a white hand groping outside, only to be pulled back.  Like THE AVENGERS, the best Hammer films revealed the horrors and insanities lurking behind placid, heritage, British rural life.  On the surface is a gorgeous idyll - a beautiful Big House, a forest, grassy rivers.  Beneath is incest, madness, hysteria, paganism, murder.<br><br>The house, like most horror films, is a metaphor for the mind.  It is literally a prison, but also a labyrinth, mirroring the maze created by the disjointed gazes of the occupants.  There are some amazing long shots of the house's inside, haunting, vastly empty, tilted - a mind off balance.  The family is no longer a site of continuity and order, but discontinuity, inbreeding, misery and chaos.<br><br>But the house also shares the literary association as a figure for the state, and the poisonous madness within affects the peasantry too.  They partake in pagan rituals, follow mad, gibbering priests, who offer destruction, not redemption, and become a terrifying, cross-burning lynch mob, roaming the country.  <br><br>Ironically, the film is set at the beginning of the century, and Freud's contemporary attempts to throw light on the darkness of the mind is alluded to, and compared to the descent into medieval dank of the film's characters. BARRY LYNDON shares many of this film's themes, and it's hard to believe Kubrick never saw it - both feature Michael Hordern and Patrick Magee.<br><br>The creation of an actual world mirroring a psychological world is superbly realised.  The two levels co-exist, intertwine, and some of the film's most extraordinary and beautiful images are visualisations of Freudian symbals and ideas.  Like many great horror films, this is a family saga, but a very mature one.  Its refusal to demonise adds greatly to the helplessness of the terrors.  Its 'closure' is as bleak as ever Hammer dared.  A masterpiece.","user":"alice liddell","rank":[38,43]},{"title":"Sometimes a mess, sometimes very innovative","rating":5,"date":"14 November 2002","review":"Hammer films had by 1972 clearly some problems coming up with new and fresh ideas. Their old style monster movies were beginning to show their age and the formula had been remade too many times (ie. Dracula AD 1972). So some experiments were made. \"Captain Kronos\" is one and this one another. The story moves very slowly in the beginning and what is happening is never really quite clear. The story about one family's inherited madness is intriguing but never fully developed. And those expecting some gory horror movie will be very disappointed, because for the most part, this is a rather slowmoving psychological study with added chilling elements. The biggest drawback here is the pace, which is non-existent for three-thirds of the movie. The final twenty minutes or so are more satisfying in that sense. Robert Hardy is also not a bonus, overacting like mad. But there are compensations. Other performances are very good, like Patrick Magee as the mock-psychiastrist and Gillian Hills as the young and maybe mad daughter of the family. And the basic plot IS interesting! A remake with a revision of the script might do wonders. Arthur Grant behind the camera does a great job too, contributing his usual skill and thereby making everything look more expensive than it really is. The art-director knows what he is doing too and the score by Harry Robinson is excellent (he really was an underrated filmcomposer).","user":"jangu","rank":[16,18]},{"title":"Good Ideas Undone by Hysterical Treatment","rating":7,"date":"7 September 2004","review":"I watched \"Demons of the Mind\" after not having seen it since it originally appeared. My memory of the film was very positive, and there are some interesting ideas in the script. However, there are an overabundance of plot elements that are presented in a haphazard and overly hysterical form by director Peter Sykes. One other reviewer here calls this a free-form narrative, but for me it was a confused jumble.<br><br>Robert Hardy plays (or overplays, as others here have noted) Count Zorn who is convinced that there is madness and other evil in his family's bloodline.<br><br>His wife had committed suicide, so he decided that he needed to lock up his children in case they started manifesting any insanity. Years later he has a controversial doctor (played by Patrick Magee in his usual mannered way) treating both grown kids (Shane Briant, Gillian Hills).<br><br>At the same time there are young women being brutally murdered in the woods and local superstitions are being whipped up, while a wandering evangelical (Michael Hordern) mutters religious dogma and joins with the locals.<br><br>A good director could have woven all these piece together nicely and provided a solid, disturbing thriller. But Sykes is more interested in whipping up a lot of intensity in each scene, which is why there's more overacting than needed and why the film winds up becoming exhausting to watch after a while. Too bad. It had the makings of a fine film. Perhaps the usual rushed schedule that Hammer Films had didn't allow for sufficient care, though screenwriter Christopher Wicking had history of penning horror films that were more interesting in concept than in execution.","user":"baker-9","rank":[18,22]}]