[{"title":"Ignore the Critics on this one. Its great.","rating":11,"date":"11 February 2004","review":"The problem with Woody has always been that everyone takes his movies more seriously than he does. Here, using the tactics of Felini, he makes fools of his detractors including the greatest detractor of all, Woody himself. For many reasons, I rank this among his best. He removes the restraint of plot, and just goes balls out nuts with his usual philosophical angst, and endless worship of beautiful dames. Oddly enough, without the fetters of convention, to me it was actually less pretentious or indulgent I think people like to call it, and a lot easier to understand and empathize with. One thing that I've always found absurd, and ironically what this film dwells on, is the complaints by fans and critics that he should go back to making comedies. Woody cannot not make a funny movie. If he's in it, and he's talking, I'm laughing. Especially back in this era, when his jokes were so fresh. So make no mistake, this film is loaded with comedy. Finally, I liked his choice of women in this. Charlotte Rampling is what I suppose the word breathtaking was originally meant to describe. If you arent touched by the final scenes with her, you got issues.","user":"glgioia","rank":[71,77]},{"title":"Woody meets Federico in the Stardust Hotel","rating":9,"date":"6 October 2005","review":"I was very surprised to find out that Stardust Memories is dismissed by both critics (at least some of them) and viewers as absolutely unwatchable Allen's film, his most chaotic attempt to claim that he can not stand his fans. I found it insightful and witty satire that cleverly (as always; if anything, Woody is a very clever man) fuses the comic and the serious.<br><br>Sandy Bates (Allen, of course) - a comic director who does not want to make funny films anymore \"because there is so much suffering in the world\" (the scene reminds so much of Sturgis's \"Sullivan's Travels\"). Sandy is depressed because his new \"serious\" film is not well received by both critics and public and he is spending a weekend at Stardust Hotel during showing of his films. While there, he reflects upon his life, art, and relationships with three different women. Sounds familiar? Like 8 1/2, anyone? You are absolutely right. Woody meets Federico in the Stardust Hotel. The film is delight in gorgeous black and white. It is funny, touching, angry - all in the same time. The film was made twenty four years ago and I am very happy that Sandy - Woody had realized that to help the world IS to do what you do the best - funny movies. \"The people survived because they laughed\".<br><br>One more thing - Charlotte Rampling is breathtaking.<br><br>9.5/10","user":"Galina_movie_fan","rank":[44,48]},{"title":"Beautiful","rating":14,"date":"14 August 2003","review":"Reading some of the comments listed here, I'm dismayed by some of the narrowness of the criticisms (\"It's shot in black &amp; white for no reason!\" \"The flashbacks are indistinguishable from the present day!\")... as if these were somehow to be construed as mistakes.  Jeez.<br><br>I love this film.  It rambles a little here and there, and sometimes it's so personal I feel voyeuristic watching it.  The montage of Charlotte Rampling towards the end is stunning in how it summarizes Allen's feelings about memory, nostalgia, and the ever-present reality that never seems to allow the past to make sense.<br><br>One cannot deny that Allen has a very keen understanding of who he is, as a person, comedian, and lover.  This is not to say that he is infallible or somehow more evolved than anyone else, but rather - through the retrospective of his \"earlier funny films\" - it's clear that he understands his strengths, and - outside the theatre - the weaknesses of his emotional life.<br><br>A perfect film for a quiet Sunday.","user":"afc-ajax","rank":[48,53]}]