[{"title":"A Turning Point In Film Noir","rating":7,"date":"31 March 2005","review":"There are two styles of Film Noir. Fueled by writers like James M. Cain, Dashiell Hammett, and Raymond Chandler, the first style emerged in the 1940s and was characterized by a cynical, often witty tone; anti-heroes, dangerous women, and assorted criminal elements; and complex plots that emphasized betrayal and moral ambiguity. It was also photographed in a remarkable visual style that combined glossy production values with atmospheric emphasis on light and shadow--and films like THE MALTESE FALCON, THIS GUN FOR HIRE, MILDRED PIERCE, THE BLUE DAHLIA, and DOUBLE INDEMNITY remain great classics of their kind.<br><br>But after World War II public taste began to change. Things that could only be hinted at in earlier films could now be more directly stated, and as audiences clamored for a more gritty realism the glossy sophistication of 1940s Noir fell out of fashion. The result was a new style of Noir--photographed in a grainier way, more direct, more brutal, and even less sympathetic to its characters. And the 1948 THE NAKED CITY was among the first to turn the tide. The sophisticated gumshoe, slinky gun moll, and glossy production values were gone; this film felt more like something you might read in a particularly lurid \"true detective\" tabloid.<br><br>In an era when most films were shot on Hollywood backlots, THE NAKED CITY was actually filmed in New York--and while filmmakers could film with hidden cameras sound technology of the day posed a problem. But producer Mark Hellinger turned the problem into an asset: the film would be narrated, adding to the documentary-like style of the cinematography and story. (Hellinger performed the narrative himself, and his sharp delivery is extremely effective.) The story itself reads very much like a police report, following NYPD detectives as they seek to solve a dress model's murder.<br><br>For 1948 it was innovative stuff-but like many innovative films it falters a bit in comparison to later films that improved upon the idea. The direct nature of the plot feels slightly too direct, slightly too simple. The same is true of the performances, which have a slightly flat feel, and although Barry Fitzgerald gives a sterling performance he is very much a Hollywood actor whose style seems slightly out of step alongside the deadpan style of the overall cast. Even so, the pace and drive of the film have tremendous interest, and while you might find yourself criticizing certain aspects you'll still be locked into the movie right to the very end. Particularly recommended for Film Noir addicts, who will be fascinated to see the turning point in the style.<br><br>Gary F. Taylor, aka GFT, Amazon Reviewer","user":"gftbiloxi","rank":[98,107]},{"title":"Taut, tense semi-documentary style with great location shooting in New York City...","rating":8,"date":"11 October 2006","review":"THE NAKED CITY is like watching a time capsule unfold of New York City in the late '40s--the cars, the subways, the bridges, the people bustling along busy streets totally unaware of filming (scenes were shot from cars with tinted windows and two-way mirrors), and at the center of it all is a rather routine detective story. But the difference is the style that director Jules Dassin gets out of his material, giving the drama a chance to build up the proper tension before the final shootout on city streets and bridges.<br><br>BARRY FITZGERALD is the detective with the very helpful sidekick DON TAYLOR, a young police officer from Queens who helps him track down the man responsible for the death of a pretty blonde in what the tabloids called \"The Bathtub Murder\". Both men are excellent as they follow a batch of clues to get to the bottom of the crime. HOWARD DUFF is also excellent as a man mixed up in the robberies, with DOROTHY HART as his unsuspecting sweetheart.<br><br>TED DeCORSIA, making his film debut, is the athletic villain, working out in his small apartment when detective Taylor finds him--but soon making his escape which leads to the film's most breathtaking moments of a dazzling chase that fills the last ten minutes with high tension suspense.<br><br>The crime itself is not that interesting, but the style used to tell the tale (with a voice-over narration telling us at the conclusion that this is just one story in a city of millions) is what makes it far superior to most detective stories. That and the fact that New York City is given the spotlight for location photography that really hits the mark.","user":"Doylenf","rank":[53,57]},{"title":"There are 8 Million Stories in the Naked City. This is the one that started it all","rating":9,"date":"9 August 1999","review":"There are 8 Million Stories in the Naked City.  This is the one that started it all.  And what a start it was.  While \"The Naked City\" is considered \"Film-Noir\" by many who have seen it, in truth it is simply a routine detective story.  What makes the film as great as it is(and it is a great film)is the Oscar winning photography by William Daniels who shot the film not in a studio but on the streets and in the buildings of \"The Naked City\", New York City.<br><br>From the very opening of the film when Producer-Narrator Mark Hellinger introduces himself and tells you that this film \"is quite different from anything you've ever seen\",  the viewer is hooked. And it is not by the story but by the city.<br><br>Hellinger's cast did not consist of any major players.  Barry Fitzgerald, stars as Lieutenant Muldoon, the head of the Homicide Squad,  Don Taylor is Jimmy Halloran, Muldoon\"s \"leg work\" man.  Howard Duff is the slimy Niles and Dorothy  Hart, a beautiful actress who should have gone on to bigger and better things, was a model.  They were all perfect.  Ted De Corsia in his first screen role, played Willie Garzah the killer.  His death scene at the top of the Williamsburg Bridge is memorable.  He nearly steals the picture but not from the actors, but from the city who is the real \"star\" of the film.<br><br>Hellinger was formerly a New York Newspaper man.  He started his Hollywood career as a screenwriter and among his successes was the 1939 Bogart-Cagney classic, \"The Roaring Twenties\" another film about New York.  The city was very personal to him.<br><br>The sad part of the film is the tragedy of some of the major participants. Hellinger died of a heart attach shortly after the release.  He was only 44.<br><br>Albert Maltz who co-wrote the screenplay was blacklisted as being one of the Hollywood 10, and didn't work for decades.  Jules Dassin the director fled to Europe because of threats of blacklisting.  He later made the classic \"Rififi\" and Oscar winners, \"Topkapi\" and \"Never On Sunday\".  We can only wonder what might have been had this association continued.<br><br>What we do know is that \"The Naked City\" still lives on.  You can see it in nearly every episode of the TV his \"Law &amp; Order\".  And as long as those skyscrapers of New York stand, there will always be a \"Naked City\"","user":"JB-12","rank":[73,82]}]