[{"title":"A documentary look at the world of drugs in the fifties.","rating":14,"date":"14 August 2003","review":"Henry Decoin made an interesting movie dealing with what was  a taboo subject back in 1955.His depiction of the crepuscular world of drugs displays no leniency,and the screenplay often drops the main story and uses documentary vignettes:the little dealers who use the candies machines  in the subway for instance .A sober Jean Gabin does not outshadow the rest of the cast:particularly Marcel Dalio,as a  big shot ,and Lila Kedrova ,as a junkie ,begging for a few more in the impressive last sequence which gathers near all the cast!","user":"dbdumonteil","rank":[15,16]},{"title":"Well Up To Chnouf","rating":8,"date":"25 May 2012","review":"If your interest in French Cinema is peripheral you'll probably recognize the names of Jean Renoir, Jean Cocteau, Rene Clair and then begin to flounder, if you take a closer interest you'll also be aware of Abel Gance, Marcel Pagnol, Marcel Carne and, at a stretch, Jacques Feyder and Julien Duvivier but if you're a real buff you'll be right at home with names such as Pierre Chenal, Claude Autant-Lara, Christian Jacque and Henri Decoin. These men were the backbone of French Cinema in the first three decades of Sound film and any History of the subject that did not include at least a couple of titles from each name would be laughable. Decoin made Razzia sur le chnouf in between the eighth and ninth film he made with Danielle Darrieux and fittingly he made it with her male counterpart Jean Gabin - both began their careers in the early thirties and both became icons of French Cinema. After a brief hiatus following his self-imposed exile in Hollywood during the first years of the war Gabin had forfeited his status as Number One Male Box Office attraction and during the immediate post-war years his career faltered only to be revived spectacularly with Touchez pas au grisbi which allowed him to reinvent himself and move fluidly between gangster and cop in a series of policiers. Here he is reunited with Lino Ventura (who had made his acting debut in Touchez pas au grisbi) in a gritty (for the time) examination of the Parisian drug scene in the early fifties, complete with jazz score a la Bob, Le Flambeur. There's a nice touch that buffs will savor as Gabin drives past a sign noting the city limits of Le Havre; he had, of course, been there once before albeit as a passenger in a lorry in the classic Quai des Brumes. This is well up to chnouf (sorry about that) and highly enjoyable.","user":"writers_reign","rank":[10,11]},{"title":"A really good French film...","rating":10,"date":"17 May 2004","review":"I just saw this tonight on TFO (Télévision française en Ontario) in a pristine black and white print and a very hopped-up fake stereo soundtrack that gives extra presence to the jazz music, the nightclub atmosphere, the dialog and the sound effects. Everything about this little police story is modern: the camera movements, the naturalism of the interpretation, the Paris slang, the art of the narration, the atmosphere of the criminal milieu, the non-judgemental attitudes. You really feel like you are there. The actors are all superb: Lila Kedrova, Jean Gabin, Dalio, Magali Noël... It's films like these that make you realize that the so-called Nouvelle Vague was really a step backward and a failure on every level (especially the intellectual) besides being a monumental bore. The real dream-weavers and the real avant-garde were the so-called traditionalists like Decoin.","user":"benoit-3","rank":[27,35]}]