[{"title":"Great fun, depending on which version you see...","rating":6,"date":"25 March 2005","review":"THE SWARM <br><br>Aspect ratio: 2.39:1 (Panavision)<br><br>Sound format: 4-track magnetic stereo<br><br>A swarm of African killer bees rampage across America's south-west before descending on Houston, destroying everything in their path.<br><br>Contrary to popular opinion, THE SWARM is not the worst movie ever made, and anyone who says otherwise clearly hasn't seen the collected works of Jesùs Franco, Andy Milligan or Woody Allen (just kidding!). Representing the last gasp of the disaster cycle inaugurated by Ross Hunter's big-time adaptation of Arthur Hailey's AIRPORT (1969) and further popularized by the likes of THE POSEIDON ADVENTURE (1972) and THE TOWERING INFERNO (1974) - the latter a bona fide Hollywood classic - THE SWARM encapsulates director Irwin Allen's basic commercial ethos: Big stars, big set-pieces, and big drama.<br><br>Taking its cue from previous small-scale entries like THE DEADLY BEES (1966) and TERROR OUT OF THE SKY (1978), Allen's old-fashioned monster movie revels in the destruction of towns, trains, nuclear power plants and the reputations of numerous high-profile actors. However, Stirling Silliphant's script is so hokey, it's difficult to believe he wasn't poking inglorious fun at the entire project: Michael Caine is so obviously miscast (as a 'brilliant' entomologist), and so clearly contemptuous of the material, his expression never changes throughout the entire film, though co-star Richard Widmark gives it everything he's got as a gruff military type who's eager to quell the threat by bombing everything in sight. Henry Fonda rises above the fray as a dedicated immunologist, and Slim Pickens is quietly dignified as a bereaved father, while Olivia De Havilland forms the centerpiece of a gentle romantic subplot (she's courted by Fred MacMurray and Ben Johnson). Richard Chamberlain, Lee Grant, Jose Ferrer, Bradford Dillman and Patty Duke Astin are featured in supporting roles alongside leading lady Katharine Ross, who seems particularly embarrassed by her ridiculous dialogue (get a load of her hysterical reaction to the death of a sympathetic younger character - if you lean forward, you can almost *smell* the ham!).<br><br>The film exists in two separate versions: The 116 minute theatrical print, and an expanded 'director's cut' running 155 minutes which pads the narrative with pointless dialogue exchanges, turning a tightly constructed disaster thriller into an endless yak-fest. Stick with the original.","user":"Libretio","rank":[47,55]},{"title":"To Bee Or Not To Bee...","rating":7,"date":"28 November 2000","review":"Highly enjoyable (and very expensive) flop from Irwin Allen, the Master of Disaster. Michael Caine, with help from a bunch of other famous actors, fight against a huge swarm of African killer bees and almost destroy the entire city of Houston in the progress. Try to get hold of the longer version (about half an hour longer than the original), which contain more drama and longer action scenes. Considered a turkey among most critics, but this film is far better than many recent box-office hits. Note that the local cinema is showing \"The Towering Inferno\".","user":"Uffe-13","rank":[43,52]},{"title":"I never thought it would be the bees. They've always been our friends.","rating":25,"date":"25 January 2003","review":"Michael Caine should have got his Oscar for uttering that line.<br><br>I was actually scared by this movie on TV when I was young because of the scene of the children being \"swarmed\" at recess. Yet a quarter of a century later, I had to get the DVD because this is one movie guaranteed to cheer me up. It's all been said in other comments - cheese, camp, so bad it's good. Ed Wood would be proud.<br><br>The scenes between Caine's scientist and Widmark's general are all classics. The icing on the cake is the two scenes with Slim Pickens. And the debate between Caine and Chamberlain over whether the bees should be called African or Brazilian. By the way, why does Richard Chamberlain look like he's on a break from a touring company of Victor/Victoria?<br><br>One plus of the DVD version is a half hour behind the scenes feature: \"Inside the Swarm\". You get to see several of the actors talk with utmost sincerity (and straight faces!) about the \"real\" dangers of killer bees.<br><br>The folks who wrote \"Airplane!\" couldn't even make a parody of this -- it's already hysterical.","user":"disgruntella","rank":[32,38]}]