[{"title":"You can smell the diesel and road dust","rating":7,"date":"7 September 2005","review":"This is gritty 70's B-movie action at its best. The CB radio craze was at its height when this movie first came out (I saw it on a double bill with \"Jaws\" at an outdoor)and the country was fascinated by the lives of long distance truckers. There were also a lot of violent films portraying the \"little guy\" sticking up for himself against the powers that be. These concepts coalesce in this fast-paced and tough action movie.<br><br>Carroll Jo Hummer is an independent long haul trucker whose whole life is tied up in two things: his wife and his truck The Blue Mule. He's no angel but he knows corruption when he sees it. When his greasy boss Duane (good ol' boy Slim Pickens) puts the arm on Hummer to deliver illegal cigarettes and slot machines, Carroll Jo refuses to go along. In doing so, he becomes an inspiration to other wildcat truckers looking to buck the system but he also becomes the target of a vicious campaign of intimidation endorsed by the corporate slimeballs in their ivory towers.<br><br>There's fist-fighting, road racing and down and dirty dialog galore as Hummer's war with his enemies escalates to \"Walking Tall\" levels. The concluding image of the Blue Mule smashing the glass emblem of the corrupt corporation is iconic.<br><br>This is a B-movie for sure and no Oscar contender, but the lives of the truckers are portrayed with some grit and realism. There's some breath-taking footage of cross-country journeys, particularly in a snowy Utah, and there's hardly a dull moment. Jan-Michael Vincent does fine as Hummer and it may be one of the best roles of his career (he did all his own stunts).<br><br>And how can you go wrong with a 70's cast that includes L.Q. Jones, Dick Miller, R. G. Armstrong, Don Porter, Kay Lenz, Sam Laws and Slim Pickens? Only obvious signs of sloppiness were a couple of shots where the boom mike or its shadow are visible. That's a minor quibble. If you're looking for a hell-raisin' bare knuckled story that pits a tough man against the odds, chances are this is what you are looking for.","user":"drmality-1","rank":[19,20]},{"title":"One of the best trucker-oriented movies ever made","rating":4,"date":"4 June 2000","review":"This film catapulted Jan-Michael Vincent to stardom level for awhile, and contained a lot of good, exciting action scenes as well as politically correct assessment of some of the problems of independent truckers at the time. Of course, it contained some action and fighting scenes that are somewhat unbelievable, but in the context of the story, they work. Kay Lenz is the believable, not too lovely hero's wife who downplayed her attractiveness displayed in later films. There are lots of eye-pleasing shots of trucks and highway mayhem, and, of course, from a trucker and real-life perspective, lots of technically inaccurate scenes, but, all in all one of the very best trucking movies ever made -- and I've seen 'em all! Good cast, good flick. This $2 million film went on to be a big grosser.","user":"mikeparkhurst","rank":[11,13]},{"title":"Very Watchable- Fast Paced","rating":4,"date":"4 August 2004","review":"This movie gave a slightly glamorized (and dirty) view into the world of the American trucking industry circa 1973-75. Without crossing over into making a film only truckers and their kin would enjoy, they kept the story and the action fast-paced yet clear as to what is happening unseen. It's not a \"CB Fad\" movie. A very \"Americana\" type film which gives a terrific look at the middle American fighting for himself and his ideals. Even though it is a semi-cheesy \"B\" movie by any standard, the characters are easily related to and the storyline is easy to get involved with, and the action is fun without getting too excessive (gee- a trucker who isn't a gravity defying martial artist!).<br><br>Jan-Michael Vincent is at perhaps his best, with Kay Lenz as the perfect naggy whiny trucker's old lady- just cute enough to want to come home to. The musical score is cliché' by today's standards, but dead-on for that time. Some of the old country tunes actually sound pretty good even today (though the twang twang stuff, and the musically reproduced truck horns grew old after while).","user":"vfuess","rank":[12,15]}]