[{"title":"Interesting 70s B-Movie","rating":8,"date":"8 June 2000","review":"I am a big fan of 70s B-movies, especially those of the horror genre. Anyone interested in the early 70s will find this movie a real treat! While not that scary, it does have a number of interesting features, most notably the title song sung by a very young Michael Jackson. The storyline is quite good, not at all boring, and fans of Meredith Baxter Birney (Family Ties) will enjoy seeing her playing the sister of David. As always, I love seeing the funky clothing and interior design of 70s movies, and Ben features lots of great shots of rooms and furniture, fashions, toys, and automobiles of that era. One of the best \"retro\" parts is the supermarket, where very clear shots of early 70s boxes of Kellogg's cereals are plainly seen. If you want to be scared, rent something else. But if you want to see a groovy 70s movie, this is a pretty good pick.","user":"bextra","rank":[22,25]},{"title":"Great!","rating":10,"date":"24 April 2007","review":"Last time I saw this movie I was 10 years old, that is 35 years ago. I loved this movie and that is why I am ordering it. It was made in the 70's, so of course it isn't up to todays movie standards. Even though, I'm sure that kids will still love it. I can't believe what that wet-paint watcher said about it. It is a cult classic and the song \"Ben\" sung by Wacky Jacko at the end is great. I cried and probably will again. His/her comment isn't worth diddly squat. I still reckon it to be a great movie. I think people should judge the movie for themselves, taking into consideration that it is a 70's movie. That way you won't be expecting to see the kind of movie you would see in the cinema today. Nevertheless, this is a great movie for its time.","user":"aceberserker","rank":[31,40]},{"title":"A beautiful touching movie!","rating":14,"date":"14 October 2001","review":"I have pet rats and they are the most sweet and loving creatures. This movie portrayed the love that people can share with rats and it was truly a beautiful movie. Ben was beautiful and Lee was a little cutey too. The lyrics to Ben ring out beautiful and true. This is really a must see for anybody who loves rats or even those who love animals in general. Some people may view this as a horror movie, but it is really soooo much more. A remake of Williard is apparently in the works, so fingers crossed that these wonderful movies will be released on DVD.","user":"Beautiful Rats","rank":[24,31]}]