[{"title":"What Did Papa Expect?","rating":6,"date":"29 August 2006","review":"When this version of A Farewell to Arms came out, Ernest Hemingway hated this film. They turned his novel and put too much emphasis on the romance angle. When Papa Hemingway said that he obviously did not know Hollywood well at all. If he did just knowing Frank Borzage directed this film should have told him something. Borzage did a whole slew of tender romantic stories in the Thirties like Three Comrades, The Mortal Storm, stuff like that. A Farewell to Arms is definitely in keeping with that tradition.<br><br>The one thing that Hemingway did like was the casting of Gary Cooper as the hero Fredric Henry. He and Coop became fast friends right up to when they both died in 1961. He saw in Cooper the ideal Hemingway hero and when Paramount acquired the rights to For Whom the Bells Toll, Hemingway insisted it be done with Cooper or nobody. <br><br>Cooper and Helen Hayes made a tender romantic couple in the Borzage tradition, probably more Borzage than Hemingway. But Adolph Zukor and Paramount also knew what sold movie tickets and Paramount was having a lot of financial troubles at this time. The studio nearly went under during the Depression. But Paramount's saviors turned out to be Bing Crosby, Mae West, and Cecil B. DeMille who returned to the studio he helped found.<br><br>Helen Hayes made several good films in the early thirties, this one and the one she won an Oscar for, The Sins of Madelon Claudet. But she never became a movie box office draw so she returned to the Broadway stage where she reigned as a Queen.<br><br>Adolphe Menjou replete with Italian accent plays Cooper's friend and romantic rival, Major Rinaldi. Menjou was great at playing both American and continental types. Soon he would sign a long term contract with MGM and gain his greatest roles during the sound era.<br><br>Hemingway purists might shun A Farewell to Arms, but those who love their screen romances, soggier the better will rave about this film.","user":"bkoganbing","rank":[36,40]},{"title":"All's Fair in Love and War","rating":9,"date":"4 June 2004","review":"A FAREWELL TO ARMS (Paramount, 1932), directed by Frank Borzage, is the first, so far, of three screen adaptations to Ernest Hemingway's classic 1930 novel. It is a tender love story set against the background of the Great War (World War I) involving two young people, Frederic Henry (Gary Cooper), an American lieutenant and ambulance driver in the Italian unit, and Catherine Barkley (Helen Hayes), a war nurse, who are kept apart by Major Rinaldi (Adolphe Menjou), Frederic's Italian friend, who not only loves Catherine, but doesn't want him to \"lose his head over a woman.\"<br><br>In the supporting cast are Mary Phillips (Helen Ferguson, a nurse and Catherine closest friend who objects to her continued romance with the young American); Jack LaRue (the soft-spoken Italian priest); and Blanche Frederici (the stern head nurse). Adolphe Menjou offers fine characterization of an Italian, convincing, right down to his spoken dialect.<br><br>A highly popular war drama in its day, which concentrates more on the relationship between a lieutenant and a nurse than soldiers on the battlefield, A FAREWELL TO ARMS earned itself an Academy Award nomination for Best Picture of 1932-33, but none for its acting. Director Borzage brings out the tenderness and simplicity of the young couple in love as he had done many times during his career, especially those starring Janet Gaynor and Charles Farrell over at Fox Studios. In fact, had Hemingway sold his novel to Fox, A FAREWELL TO ARMS would definitely have been awarded to the popular Gaynor and Farrell team under Borzage's direction. Yet similarities between Gaynor and Farrell and Hayes and Cooper go by the way of their sizes. Both Gaynor and Hayes were short in appearance while Cooper and Farrell stood very tall, especially opposite their shorter leading ladies. Because of the sensitivity and care as enacted by the central characters, it goes without saying that Hayes and Cooper appear to be far better suited than Gaynor and Farrell had they been offered this assignment. At first glance, Cooper gives the impression of being an odd choice for playing Fredric Henry, considering solid actors as Fredric March or Clark Gable (on loan from MGM) might have made a go of this. For the finished product, the film conveys Cooper to be properly cast after all, ranking this as one of his most finer performances of his career. <br><br>The pace to the story is occasionally slow, with the early portions lacking in underscoring, but does get better during its second half. Other than the character study and battle scenes, the movie offers some fine bonuses in ways of effective camera technique, including the hospital scene where the injured Frederic Henry is being wheeled in the hospital from a platform table where the camera assumes the place of the character, taking focus as to what directly looking down and talking into the camera range as Frederic answers the questions. This is concluded with an extreme close up of Catherine's face with only her right eye in full focus into the camera as she kisses and talks to her wounded soldier. The camera taking the place of the character technique would be used memorably more than a decade later in the \"film noir\" mysteries, LADY IN THE LAKE (MGM, 1946) and DARK PASSAGE (WB, 1947). While these films have used this method to an extent to most of the story, A FAREWELL TO ARMS presents this technique briefly but effectively.<br><br>Remade twice during the 1950s, first as FORCE OF ARMS (Warner Brothers, 1950) starring William Holden and Nancy Olson, and later under its original title in 1957 for 20th Century-Fox starring Jennifer Jones and Rock Hudson, the third, being the better known of the earlier two, might have surpassed the original had it not been so awkward, overlong (two and-a-half hours) and overblown. The original 1932 production, eliminating many key elements from the novel, is better acted and not long enough to cause any viewer lose interest. Because of the remakes in the 1950s, the 1932 original was taken out of circulation, with availability for viewing the original very hard to obtain, and chances of it never to be seen or heard about again. Fortunately, prints did survive, leaving chances of A FAREWELL TO ARMS to surface again. Finally, as early as 1981, the initial version to A FAREWELL TO ARMS made its long awaited rebirth, on public television, initially as part of its weekly SPROCKETS series. Ever since then, television and later public domain video prints presented the original Hemingway drama 10 minutes shorter to its original 90 minutes of screen time, along with occasional poor picture quality, and even worse, the elimination of the original opening and closing credits taken from reissue prints with newer opening title cards and the substitution of the Paramount logo with that of a 1950s Warner Brothers shield, and the elimination of the closing casting credits. When A FAREWELL TO ARMS premiered on Turner Classic Movies on Sunday, February 15, 2004, as part of the cable channel's annual 31 days of Oscar, it became another long-awaited event. Aside from having it shown in its original 90 minute presentation, the Paramount logo that opens and closes the movie has been restored along with the closing cast list, as originally played in theaters back in 1932. <br><br>Has A FAREWELL TO ARMS stood the test of time? Chances are with its newly restored and clearer picture quality presentation currently available on TCM, it may stir up much more interest than the latter remakes. It also gives an incite look to the early film career of famous stage actress Helen Hayes (1900-1993) at her peak. As it stands, A FAREWELL TO ARMS, a poignant love story, which may not stir up as many tears and sobs as it once did way back when, it is, however, a worthy novel to screen offering, ranking this the first, and best, of two remakes combined. (****)","user":"lugonian","rank":[46,53]},{"title":"Impressionism in the Cinema","rating":7,"date":"24 January 2006","review":"The works of Ernest Hemingway have not always translated well to the cinema. The Gary Cooper/Ingrid Bergman \"For Whom the Bell Tolls\" and David O. Selznick's version of \"A Farewell to Arms\", although attractively photographed, are two of the dullest and most slow-moving films ever committed to celluloid. \"The Snows of Kilimanjaro\" is slightly better, but still by no means as good as it should be, given its stellar cast. Howard Hawks's version of \"To Have and Have Not\" is a good film, but that is probably because its plot has very little to do with that of the novel on which it is supposedly based. <br><br>The 1932 version of \"A Farewell to Arms\" was the first time a film had been based on one of Hemingway's works, and there is an obvious difference between it and the 1957 remake; it is only slightly more than half the length, at 80 minutes as opposed to 152. Over the quarter-century between the dates of the two films there had been a change in the way Hemingway was seen. In 1932 he was still an up-and-coming young author; by 1957, although he was still alive and only in his late fifties, he had achieved the status of Great American Novelist, and the film that was made in that year suffers from an over-reverential attitude to his work, treating it like a solemn classical text that needed an equally solemn cinematic treatment to do it justice. <br><br>The film tells the story of the romance between Frederick, an American volunteer serving with the Italian Army as an ambulance driver, and Catherine, a nurse with the British Red Cross. Frederick deserts and crosses the border into neutral Switzerland, to be with Catherine, whom he has secretly married and who is pregnant. <br><br>It has been pointed out that the moral of the film is precisely the opposite of that of \"Casablanca\". In that film Rick and Ilsa give up their chance of happiness together because \"the problems of three little people don't amount to a hill of beans in this crazy world\". What matters is the war, and the Allied struggle for victory. In \"A Farewell to Arms\", however, the moral is that the personal happiness of Frederick and Catherine matters more than the great historical events from which they are escaping. This reversal in emphasis between the two films probably reflects a reversal in public attitudes which took place in the intervening decade between 1932 and 1942. In 1932, a year before Hitler came to power, there was a sense of disillusionment with war, even in those countries which had finished on the winning side in 1914-18; the First World War was widely seen as senseless slaughter. Ten years later, the rise of Nazism and the outbreak of the Second World War had changed attitudes so that it was once again fashionable to talk about a \"just war\" against evil. (By 1957, during the Cold War, the pendulum had partially swung back in the opposite direction; Selznick's film might have been a flop, but there were some very good anti-war films from that period, such as Kubrick's \"Paths of Glory\"). <br><br>Seen from a modern perspective, the film looks and sounds very dated. The sound quality is poor and the action looks jerky. These problems were, of course, common to most films from the early thirties, the very dawn of the sound picture era. (It is remarkable how quickly those problems were overcome, when one compares the likes of \"A Farewell to Arms\" with, say, \"Gone with the Wind\" from only seven years later). In some respects, however, the director Frank Borzage was able to turn the technical limitations of the period to his advantage. Large-scale realistic battle sequences would not have been possible at this time, but Borzage nevertheless wanted to give some idea of the horror of war in order to show what Frederick is fleeing from. In order to do this he resorts to a wordless montage sequence composed of brief shots of the battle, backed by some highly dramatic music. The result is a sort of cinematic equivalent of Impressionism, serving to give as vivid an impression of warfare as a more detailed picture ever could. (This sequence was probably the reason the film won the Oscar for \"Best Cinematography\").<br><br>The film is better acted than the 1957 remake. Helen Hayes was less glamorous than Jennifer Jones, and has an even less convincing British accent, but makes a much livelier and more convincing Catherine. Gary Cooper's Frederick is similarly far more animated than Rock Hudson's stony-faced interpretation of the role, and he receives good support from Adolphe Menjou as Frederick's comrade Major Rinaldi. The action is better paced and the film, even if it looks primitive by today's standards, nevertheless has a vigour lacking from many more polished films from more recent times. 7/10","user":"JamesHitchcock","rank":[33,40]}]