[{"title":"Flawed with fantastic ideas","rating":11,"date":"11 February 2015","review":"Two lovers stationed on a remote moon base of Saturn are intruded upon by a murderous man and his malevolent 8-ft robot.<br><br>Its production issues, changing of directors (one of which was the late great John Barry) and budget cuts aside for a film that was made in 1980 it feels like late 60s/70s. That said, the sets that take a leaf from Alien (1979) are partially effective and the blue ominous lighting works but is sadly used sparingly.<br><br>The late Farrah Fawcett is still a major draw and although there's a cringe worthy age gap between leads it is fitting to the narratives themes. Acting legend Kirk Douglas is a little inconsistent and not on form possibly due to the script or production woes. Harvey Keitel has been unconventionally re-dubbed which is a shame, but he still is effective as the homicidal sociopath, off beat, boorish Earth Captain Benson. Although choppy, there's some great setups with the interestingly designed Hector robot and Elmer Bernstein's score if fantastic. <br><br>It's not purposely ambiguous, but it leaves many questions and loose ends. It's by no means the worst science-fiction movie, John Barry's story offers some great ideas and has clearly influenced subsequent scifi's notably the Matrix (1999) plug-in.<br><br>It's flawed and inconsistent but still worth viewing for the concept alone.","user":"amesmonde","rank":[11,11]},{"title":"An Underrated Sci-Fi Cult","rating":7,"date":"12 October 2012","review":"In the future, Earth is overcrowded and the population relies on distant bases to be fed. In the Saturn 3 station, Major Adam (Kirk Douglas) and the scientist Alex (Farrah Fawcett), who is also his lover and has never been on Earth, have been researching hydroponics for three years in the base alone with their dog Sally. <br><br>Meanwhile, the psychotic Captain Benson (Harvey Keitel) fails the mental test required to travel to Saturn 3 and kills his replacement, Captain James, taking his place in the mission of assembling and programming the Demi-God series robot Hector to replace one of the scientists in Saturn 3. <br><br>On the arrival, the mentally disturbed Captain Benson becomes sexually obsessed for Alex. Then he uses an interface to link his brain to program Hector, but incapable to control his emotions, he transfers his homicidal tendency and insanity to Hector. Now Major Adam and Alex are trapped in the station with a dangerous psychopath robot.<br><br>\"Saturn 3\" is an underrated sci-fi cult from the 80's with a dark story that has not aged. The plot is very simple but creepy and the cast is very well selected: Kirk Douglas very mature but still handsome, convincing that Major Adam is capable to seduce Alex. The underrated actress Farrah Fawcett in the top of her beauty and showing parts of her body, seducing not only the psychopath Captain Benson but ( I believe) most of the male viewers. And Harvey Keitel is perfect as a mentally unstable man with sex drive on Alex. The non-commercial conclusion is also excellent and perfect for the story. My vote is seven.<br><br>Title (Brazil): \"Missão Saturno 3\" (\"Mission Saturn 3\")","user":"claudio_carvalho","rank":[36,43]},{"title":"A little dated but nonetheless very well done...","rating":7,"date":"30 December 2004","review":"I first watched Saturn 3 with my father when I was about 12 years old and I remembered liking it and being creeped out by it as a kid. So I revisited the film again last night. Even though it has been over 15 years since I first saw this film, I still really enjoyed it. I was very surprised to see so many negative comments here on IMDb. All in all, the film is a little dated, but it still contains some very striking visuals and original ideas. The sets used for this film were extremely well detailed and thought out, as were the costumes and props. \"Hector\" is perhaps one of the coolest looking cyborg/robot characters ever conceived. The scene where he is first \"booted up\" and filled with \"cyber-blood\" is just vivid and stunning. After watching this film, it was also *quite* obvious that this movie influenced some of the more modern science fiction masterpieces like Robocop, the (1st) Matrix and James Cameron's Aliens. Several of the reviews harshly criticized the acting and the story, but I however found no problems in this department. Nowadays we seldom see good films with a small cast and a simple story. Not every movie has to be as advanced and as complex as films like Minority Report. And I am sorry, but Mark Hamill and Keanu Reeves can't hold a candle to Kirk Douglas and Harvey Keitel when it comes to acting. I think people are trying to compare this film to all the super budget modern sci-fi movies. Or perhaps this movie is regarded as \"crap\" by many because they think Star Wars is the end all, be all sci-fi movie of all time, which in my opinion, Star Wars is MUCH more cheesy and way too light-hearted to take seriously. If you like serious, dark sci-fi flicks, be sure to check this one out. Don't listen to all those Star Wars nerds who crap on this film. Judge it for yourself. 7/10","user":"bwilkus","rank":[79,106]}]