[{"title":"A real hidden masterpiece.","rating":14,"date":"14 August 2004","review":"I just saw this movie very late the other night, and I must say WOW! Like the rest of you, I saw \"A Face In the Crowd\" on a regular VHS edition, but it wouldn't matter which edition I saw it in because this was one of the few movies recently that made the jaw of this movie snob literally DROP with amazement over how daring, how edgy, and how much mastery this movie had over the film-making craft. <br><br>I'm beginning to realize that in the 1950's there was a short period of time (1955-1960, say) where the world of Broadway and the theater, Television, and Hollywood came together, and the careers of people like Rod Serling, Sidney Lumet, and \"A Face In the Crowd\"'s own Budd Schulberg were started. The best screenwriters in the movie business became innately aware of the increasing importance and influence of the new media form Television, while the best directors (like Elia Kazan), many of whom had directed numerous plays, knew how to cull the talents of Broadways hottest and most gifted performers, and at least for a couple of years, managed to get some awesome performances out of them. That's why I view this movie in the same sort of category as \"The Sweet Smell of Success\", that ever so sour and bitingly satiric parable on the corruption of American glamour and fame, and how publicity is just as much of a curse as a blessing. The performances in that film are like few others in the same era, and I think its no coincidence that \"A Face In the Crowd\" came out the same year as the other film. The main scribes of both those films, Clifford Odets and Budd Schulberg, were experienced with TV work by the time they penned their masterpieces (though Schulberg could also claim as his masterpiece 'On the Waterfront'). <br><br>So anyway, I suggest to all who can hear me and have a love enough for this film to want to see it given the presentation it deserves, that we all write to the Criterion Collection and other DVD distributing companies and ask, no DEMAND that a restored, cleaned up version of \"A Face In the Crowd\", with as many special features as can be rustled up, be released as soon as possible. It's like writing your congressman, except instead of asking for a new factory of national park, we're asking for the wider availability of a piece of art that has gone with far too little acclaim for far too long. Who's with me?!?","user":"syer","rank":[123,137]},{"title":"\"A guitar beats a woman every time!\"","rating":9,"date":"20 January 2005","review":"This film shows what a fine actor Andy Griffith truly is, and what roles he could have mastered had he not chosen the Mayberry path instead. <br><br>Directed by Elia Kazan, the political drama and satire of commercialism \"A Face in the Crowd\" is the story of Lonesome Rhodes (Griffith), a charismatic guitar-playing drifter who is discovered by radio executive Marcia Jeffries (the husky-voiced Patricia Neal) while in jail on a public drunk charge. He catapults to radio and TV stardom under the guise of being an aw-shucks homeboy who loves his fans. In fact, Lonesome Rhodes is a slimy, greedy, egotistical, manipulative womanizer with underhanded political aspirations and nothing but contempt for his gullible audience. The film was far ahead of its time in its theme and telling, and Andy Griffith gives a blazing performance that rivals Burt Lancaster's in \"Elmer Gantry\" (for which Lancaster won an Oscar). That this film wasn't even nominated for any awards is very surprising.<br><br>I also am saddened that it's never been released on DVD; it's one of the best of its kind I have ever seen, and was certainly Griffith's plum role and best performance. With a stellar supporting cast, including Patricia Neal, Walter Matthau, Tony Franciosa and a beautiful Lee Remick in her first film role, \"A Face in the Crowd\" is a must-see film, and should eradicate any opinion you may have that Griffith was only capable of his wholesome TV roles of Sheriff Taylor and Ben Matlock.","user":"ClassicAndCampFilmReviews","rank":[63,69]},{"title":"Just Some Historical Perspective....","rating":1,"date":"1 November 2004","review":"A timeless story,as evidenced by all the allegories to recent personalities here ( Howard Stern, Clinton, etc...)...HOWEVER..the film is based (loosely) on a personality of the mid-50s: one Arthur Godfrey..yes, the IL' Redhead himself. Skillfully wrapped in the cliché of 'country boy makes good' story, the Godfrey story was hot news in 1957,and there weren't too many people back then who missed its allusions For those who do not know: Arthur Godfrey was one of THE hottest things in the country in the early to mid 1950's: he literally had about two or three different TV shows on the schedule, plus a radio show that was among the most popular in the day. Godfrey was JUST like this movie in this respect: on the air, he was America's home-spun hero..telling folksy stories....crooning in an off tone baritone, and presenting pure, CLEAN entertainment. OFF the air,however the legend that is Arthur Godfrey to this day is one of THE biggest control freaks in show biz history..to the point of controlling the lives of all of his 'family'..unfortunately that turned out to be downfall...One Julius LaRosa had been a singer that Godfrey had 'discovered' in the US Navy Band...after he was discharged LaRosa became a singer on Godfrey's nighttime TV show \"Arthur Godfrey and Friends\",where he became an instant star among the bobby sox set. In time, LaRosa started a recording career,and started to have VERY successful records..then suddenly, in 1953, Godfrey suddenly fired LaRosa from his show for the mysterious reason of him having 'no humilty' ...it has been assumed since then that Godfrey was extremely jealous of Larosa's success...Anyways, this exposed the 'real' Godfrey to the public.,and while it didn't happen as quickly or as totally as Lonesome Rhodes' career,Godfrey's career as a superstar was effectively over after that..he eventually was reduced to hosting game shows and such. Writer Schulberg obviously also puts in his 2 cents on fame...politics..the show business...and early television here, but as I said,there wasn't NO ONE in those days who didn't know it was about Godfrey....","user":"lds3359","rank":[171,196]}]