[{"title":"Unfairly Maligned, Often Duplicated","rating":6,"date":"24 May 2001","review":"I saw `Journey to the Seventh Planet' as the lower half of a double bill, with `X-15' (Does anyone remember THAT one?).  At that time, I saw `Journey' sans opening and closing credits.  I thought it was pretty good, but it received atrocious reviews (`Another John Agar trash science fiction movie') Recently, when I read writer-editor-director Ib Melchior's comments in FILMFAX, he crucified the movie (`almost unreleasable).  Pretty strong language from the man that cowrote (with `Journey' director Sidney Pink) and edited the movie.  I recently purchased `Journey' and, I am happy to say, I haven't changed my original feelings about the film.  Certainly, the mind-matter plot wasn't new.  It had been used both in `Forbidden Planet' and `Fiend Without a Face'.  It was also used again in `Twilight Zone,' `Outer Limits' ,  most of the `Star Trek' franchises, and, regrettably, `Sphere'.  However, `Journey' is the first film I recall that used an entity whose most powerful weapon was our own desires and fears.<br><br>The earth, controlled by a world government, sends international space crews on a search for extraterrestrial life.  The searches have come up empty with the first five planets (Mercury, Venus, Mars, Jupiter, Saturn), and our intrepid crew is about to land on Uranus, when they receive a message that Uranus is emitting a strange radiation.  In his criticism of `Journey', Melchior claims this `motive' was deleted; but, there it is, plain as day, a message being read by John Agar.  Could Melchior be guilty of `sour grapes' because Sid Pink gets directing credit?  Since this is a much better movie than two of Melchior's other efforts (`The Angry Red Planet' and `Reptilicus'), one can have legitimate suspicions. Anyway, as the spaceship enters orbit around Uranus, they are possessed by an alien entity, that threatens to control their minds in order to populate the earth with its slaves.  A similar scene is used, to much poorer effect, by Mario Bava in `Planet of the Vampires'.   Awaking from their `trance,' the crew discovers that `two hours' has past.  However, one crew member, Barry O'Sullivan (Ove Sprogøe), who had been holding an apple, discovers the dry, rotted remains in his hand.  `Two hours and HOW MANY DAYS' he asks.<br><br>Arriving on the planet, the crew expects to find a uninhabitable landscape of rock and frozen ammonia. Instead, they find themselves amidst beautiful greenery and gentle brooks. The time lapse decoration of the minature set is pretty good.  Most of the minatures in this film are better than `Total Recall,' while done on a fraction of the budget.  Soon, the crew discovers that the landscape (including people) is created from their own thoughts.<br><br>Excellent sound effects, set decoration and color photography in this movie. Much of the film appears to be shot outdoors, unusual at the time, and quite commendable.  Agar is pretty effective, as is Ove Sprogøe.  The other actors were apparently reciting their lines phonetically. I understand the beautiful `fantasy women' are beauty contest contestants.  That seems very reasonable, considering both their physical assets and acting limitations. The only  subpar elements are some of the special effects and the editing by Melchior.  In the FILMFAX interview, Melchior complains that American International Pictures gave him virtually no money to replace the `horrible' special effects in Pink's first cut.  Nevertheless, Melchior proudly boasts that he improved the effects the best he could.  Yet, if one sees some of the `lobby cards' published by FILMFAX, the `horrible' puppet is much  more frightening looking than the silly-looking stop-motion cyclops Melchior uses.  Also, the most horrifying scene, in which one of the crew is killed, the skelaton of his legs at the burned bottom of his suit, was cut by Melchior, probably deemed too `grisly'.)  That's pretty stupid, considering the explicit gore in many of the British horror films predating `Journey' as well as a few of AIP's own releases (`Earth Vs. the Spider comes immediately to mind). Oh well, at least in one instance Melchior did the right thing in the release print I originally saw.  By cutting the end credits Melchior spared us some really silly-looking minatures and optical effects, money that would have been better spent improving on effects within the film.  Nonetheless, `Journey to the Seventh Planet' is a pretty good film, a `must see' for hardcore space movie fans.","user":"Bob-45","rank":[38,47]},{"title":"Where no man has gone before?","rating":8,"date":"28 January 2004","review":"This film might have had a major influence on the original Star Trek series which followed, as a number of the story's elements would later be used in more than a dozen Star Trek episodes. The entire film had a Star Trek feel to it (sans Spock and The Enterprise). The manner in which a small group of space travelers walk around a claustrophobic set is a technique replicated numerous times on the original Star Trek series. It wasn't a given that Gene Rodenberry would depict alien planets in that same manner. Surprisingly, this is actually a very good little movie. While it may seem silly and amateurish set alongside \"2001: A Space Odyssey\" and \"Star Wars\", for its time it was a nicely produced film.","user":"CelluloidTime","rank":[19,26]},{"title":"Is Uranus surrounded by clouds of poison gas?","rating":11,"date":"11 May 2003","review":"Surprisingly enjoyable bad flickage.  Sid Pink (may he rest in peace), the Danish auteur who served up \"Reptilicus,\" presents \"Solaris\" on the cheap, more than a decade before the USSR's version.  An evil, one-eyed alien brain in a cave on Uranus creates illusions based on what the astronauts are thinking.  They keep thinking of lush forests and beautiful Scandinavian women, so where's the problem?  Long as nobody thinks of Mr. Sta-Puft, they should be OK.  I'm surprised The Duke doesn't show up, since John (\"Look, I'm starring in yet another cheesy SF movie\") Agar, just about the only non-(badly-)dubbed member of the cast, wears an embarrassed look that says: \"I was in 'Sands of Iwo Jima' with John Wayne... SIGHHH...\"<br><br>Now on DVD, double featured with \"Invisible Invaders.\"  Microwave the popcorn and enjoy.","user":"lwjoslin","rank":[17,23]}]