[{"title":"The Neanderthal Man (1953) **1/2","rating":6,"date":"2 March 2006","review":"An ultra-cheesy '50s monster flick in which we get to see Robert Shayne (Inspector Henderson from TV's ''Adventures of Superman'') shamelessly recite hilarious dialogue and feverishly overact, as a dedicated mad scientist who's found a way to reverse the evolutionary process! It's the treat of the film to watch him rant and rave about his idiotic theories without applying the brakes. First he turns a common house cat into a fierce saber-toothed tiger, accomplished by the effects team utilizing close-ups of a fake model; later, he jabs himself with a serum that transforms him into the title character. You've got to get a load of this ape-man's face; it's one of the most ridiculous-looking of all film monsters, obviously an over-the-head mask you'd buy in any Halloween shop, and completely expressionless with a rubber muzzle and painted set eyes that don't move. For his creature, the filmmaker should have chosen to stay with the crude third or fourth stage appliances during the chintzy transformation sequence. <br><br>A real hoot, and a good deal of fun if you go for these types of silly yet entertaining creature features. We also get to see a young Beverly Garland in the cast, although a double for her is blatantly used in a sequence where she dons a bathing suit and models for a photographer. **1/2 out of ****","user":"JoeKarlosi","rank":[15,18]},{"title":"Bigger doesn't always mean smarter","rating":6,"date":"19 August 2004","review":"****SPOILERS**** In the \"Neanderthal Man\" Robert Shayne, Prof. Clifford Groves, plays a somewhat whacked-out scientist who's obsessed in proving his theory of \"Devolution\". In that man has actually devolved not evolved from pre-historic times to today where his brain is about a quarter the size of the brain of the Java Cro-Magnon or Neanderthal Man. <br><br>At the Naturalist Club Prof. Groves is almost laughed off the platform by his colleagues for saying that and in a fit of anger and indignation he tells them that their nothing but a bunch of ingrates and mental midgets and that a man of his brilliance is too good to have anything to do with them. <br><br>Back at his home in the High Sierra Mountains Prof. Groves goes to work in his lab to prove that he's right and make those anthropologists at the Naturalist Club who made a monkey out of him and his theories pay for what they did by showing those fools just how right he was and is. Making a cave women out of his housemaid Celia, Tandra Quinn, with a serum that he developed he next turns his house cat into a large and vicious saber-tooth tiger who breaks out of his lab and causes havoc in the countryside by killing the local farmers livestock. <br><br>All this attracts Dr. Harkness, Richard Crane, a L.A paleontologist who with the insistence of local game warden George Oakes, Robert Long, goes up to the High Sierra and hunts down and kills the big cat. <br><br>Getting Prof. Groves to go with them to identify the tiger it somehow disappeared. Obviously Prof. Groves found the dead saber-tooth tiger earlier that morning and hid it in order not to have his secret experiments exposed.Prof. Groves is so obsessed with his experiments that he completely ignores his bride-to-be Ruth, Doris Merrick, who came to visit him as he buries himself in his work in the study on the size of the human and pre-human brain.<br><br>Later Prof. Groves injects himself with his serum and turns into a Neanderthal Man but instead of getting smarter he gets more wilder and goes out in the range and kills a number of campers and hunters. Prof. Groves doesn't even look like a Neanderthal Man he looks more like an extra from the movie \"Planet of the Apes\".<br><br>Robert Shayne really overdid the mad scientist act and was so off the wall and unstable in many scenes in the movie that it made you wonder why nobody in the film noticed just how insane he was and didn't call the police or park rangers to have him taken away and locked up in a hospital room before he hurt himself or anyone else. <br><br>Later Dr. Harkness enters Prof. Groves lab and sees a number of cats in cages and vials of serum and injects one of the cats with it that it later turns also into a saber-tooth tiger. Prof. Groves is hunted down and shot by a sheriff's posse in the hills but escapes only to be attacked by the tiger who ends up killing him. After Prof. Groves dies he turns back into a modern day civilized human being from the pre-historic brute that he was. <br><br>It's a shame that Prof. Groves had to learn the hard way about his theory of brain size that bigger doesn't always mean smarter.","user":"sol-kay","rank":[12,14]},{"title":"\"I won't be laughed at anymore!\"","rating":6,"date":"1 October 2016","review":"Cranky scientist experimenting on transforming animals and people into their prehistoric selves (sorta), tries it out on himself and becomes a Mr. Hyde-type Neanderthal. Robert Shayne (Inspector Henderson from The Adventures of Superman) plays the would-be Jekyll and he's great fun. His character gets upset with everyone and insults them at the slightest provocation. He's a real bitch and I love it! The rest of the cast is solid, with some interesting character actors like Robert Long and Dick Rich helping to keep things moving. The script doesn't give them a lot to work with but they bring their lines to life with conviction. Richard Crane is a bit annoying as the stiff protagonist and just about every woman in the movie is insufferable, save for the great Beverly Garland in a minor role. Working with an obviously limited budget, director E.A. Dupont and cinematographer Stanley Cortez craft a pretty polished-looking B picture. Of course only so much can be done special effects-wise on a small budget but there is some nice camera-work and a decent level of atmosphere in some of the night scenes. Better than some of the other reviewers are giving it credit for but nowhere near a classic. Worth a look for fans of '50s B horror and sci-fi.","user":"utgard14","rank":[4,4]}]