[{"title":"Albert Brooks at his best","rating":7,"date":"7 February 2000","review":"This film is not for everyone. If you do not already like Albert Brooks, or are only lukewarm on him, by all means stay away from it. I happen to love Brooks and, hence, this film. But I can understand people getting fed up with it because it's not structured or scripted like a normal movie. The biggest complaint I've heard about it is that all the other characters in it besides Brooks, especially the girlfriend, are mere props for him. That's absolutely true. It's as if Brooks would have preferred to do a long monologue (or a stand-up routine) but then decided at the last minute that he did need people to be present every now and again to bounce things off of. Just so you know what to expect: this is not an \"interaction\" movie - this is undiluted Albert Brooks coming straight at you for nearly two hours, with all his smarminess, vanity and doggedness firmly in place.<br><br>What I love about Brooks, at least in his early movies (i.e. everything before Defending Your Life) is that he is not afraid to totally take upon himself the traits which he means to ridicule. He's often been compared to Woody Allen but I think the differences are important. In all his films, Woody Allen takes himself to task, relentlessly analyzes and criticizes himself, shows us his weaknesses and flaws, etc. - but then undercuts it all by playing for our affection with his cutesy physicality and his meant-to-be-adorable one-liners. Brooks doesn't *want* you to love him, he delights in heaping one annoying trait after another upon himself and portraying it to its full, uncensored extent. He doesn't do one-liners or gags - instead, he embodies the personality of someone who would be the butt of such gags or one-liners, and the embodiment is what is meant to be funny.<br><br>For example, in this movie, there is an amazing 15 minute sequence near the beginning where Brooks, having just dumped his girlfriend, putters around his apartment pep talking himself into feeling good and succeeding only in becoming more and more miserable. The delusion and self-absorption on display is monumental, and it's given a kind of grandeur by the amount of time focused upon it - you could almost label the scene  \"The Narcissist's Aria.\" It's annoying as hell, and I couldn't blame anyone for being totally turned off by it.  And yet, that annoyingness is exactly the point, and what makes the scene so hysterical. Brooks' performance here is nothing short of brilliant - the kind which would surely take home an Academy Award for Best Actor in a Comedy if such a category existed at the Oscars.<br><br>Think of Albert Brooks here as George Costanza on \"Seinfeld\" - only with his monomania squared simply from having no close friends to interact with and bring him down to size. If that seems like torture to you, keep right on moving when you see this one in the video store aisle. However, if you always secretly wondered what George would be like if he got his very own show - well, here's the closest approximation of a pilot episode that you're ever likely to find.","user":"krumski","rank":[23,28]},{"title":"lust in America","rating":5,"date":"8 May 2006","review":"I do like Albert Brooks. As an actor. As a writer and director, his movies fall short of funny, happy to be amusing. Modern Romance is par for the course. <br><br>Only in the exchange with Medowlark Lemon does the movie come close to explaining Brooks' neurotic obsession with his girlfriend: she's out of his league. We don't know enough to understand why she's with him; the movie is more interested in his antics. Not only is Brooks' character narcissistic, his movie is too. <br><br>The foley scene, the shopping excursion, the Hollywood party are all deftly handled and expertly underplayed. I truly believe that Brooks can find the humor in anything. But he's satisfied with too little in his movies, and his disregard for structure (in his early films) is both curious and frustrating. It's as if he thinks he can get away with less if he doesn't seem to be trying as hard.<br><br>Essentially, Modern Romance is a 60-minute monologue with some situational humor mixed in. Is he in love with her, or with himself? That may be the point, but that makes me neither marvel nor laugh.","user":"gurghi-2","rank":[10,14]},{"title":"Great comedy","rating":9,"date":"6 October 1998","review":"If you're an Albert Brooks fan already and you haven't seen this one yet, get set to become an even bigger fan once you do.  This ranks with \"Lost in America\" as one of his two best, and in many ways this takes the prize. It's as funny and painful a view of a dysfunctional person as has ever been put on film in the name of comedy.  In other words, it's better than all but the very best of Woody Allen.  And that's saying a lot.  In fact, Brooks's own persona is more likeable and more identifiable than Woody's--and Kathryn Harrold is unbelievably attractive in the female lead.","user":"billy-7","rank":[11,16]}]