[{"title":"\"Next to a battle lost, the saddest thing is a battle won...\"","rating":10,"date":"15 March 2004","review":"Depicting history on film has never been easy. In all cases the history is simplified and events compressed, while historical personalities are often combined or eliminated entirely. This is perfectly understandable given the needs of cramming information into a two, perhaps three hour film, while maintaining some sort of dramatic continuity and structure. Generally speaking, while the political and social currents are painted in broad strokes, costume, make-up and especially art direction can vividly recreate in glorious detail an era, if only on a visual level. The attitudes and speech of the performers play an important part here as well for nothing will destroy the audience's willing suspension of belief in a period recreation faster than a performance or vocal intonation that seem anachronistic.<br><br>Do these films succeed as cinema? \"JFK\" and \"Lawrence of Arabia\" are both great films because they succeed as works of cinema first, however inaccurate or debatable the history they depict. History's depiction in cinema must take a back seat to film ascetics given the limitation of the medium in allowing for examination of an individual or event with anything approaching depth or scope. Sergei Bondarchuk's \"Waterloo\" (1970) was his follow-up to his previous, equally spectacular \"War and Peace\" (1968). Both films recreate the Napoleonic Age on a visual level to a degree of detail that has never been equaled. While the earlier film was based on the celebrated novel of Tolstoy, \"Waterloo\" concerns itself with the events leading up to the confrontation between Emperor Napoleon I and Arthur Wellesley, the Duke of Wellington. Any film dealing with the out-sized figure of Napoleon Bonaparte must confront the problem of a super abundance of source material, the adapting of which would be daunting to a modern mini-series, let alone a film running a little over two hours in length. Obviously simplification is a necessity. Indeed the film opens with a brief written prologue summing up the events of the past twenty years leading up to the battle. Yet \"Waterloo\" is unique in that virtually all the dialogue is taken from historical sources. Very little is made up, and Bondarchuk with co-scriptwriters H.A.L. Craig and Vittorio Bonicelli fashioned a story that is lucid and taut while remaining remarkably accurate to the actual event.<br><br>Bondarchuk was an absolute master of logistics, perhaps the greatest. and \"Waterloo\" places on display his considerable talents. With an eye for detail he and his technicians reconstructed the entire battlefield, complete with chateaus and farmhouses. In addition they installed beneath the earth a watering system allowing them to soak the various fields of wheat and barley as needed. Given the use of a Russian army division of 20,000 men to represent the French, English and Prussian armies, he deployed them-in costume-complete with all the necessary Napoleonic ordinance to recreate the most famous battle in history. And all of this was achieved without the use of CGI and digital effects. It was all done live and the result is incredible; an actual Napoleonic battle recreated on a full scale. With columns of smoke and fire, charging horses, thousands of troops in brilliant uniforms marching in formation, the film as caught by cinematographer Armando Nannuzz has a horrific grandeur. The stirring score by Nino Rota uses music from the period as well as actual martial tunes played by Napoleon's Old Guard as they marched into battle. All the set pieces of the battle are lovingly recreated; the assault on the Hougoumount, the charge of the Scots Greys, the forming of the British army into squares, the final stand of the Old Guard.<br><br>Bondarchuk also wisely focuses on the personalities of the two protagonists. He is well served by both Rod Steiger as Napoleon and Christopher Plummer as Wellington. Steiger is earthy and passionate, a brilliant charismatic leader racing against the rapid decaying of his faculties. Plummer is arrogant, aloof, a disdainful English aristocrat, \"Scum. Nothing but gutter trash and scum!\" And he is referring to his own troops. They are surrounded by a great supporting cast. Happily the film is well served here as well. Dan O'Herlihy as Marshal Ney does a superb job of suggesting a man struggling desperately with some inner conflict. As his British counterpart, Jack Hawkins plays the hard-bitten General Sir Thomas Picton. He is an aristocrat more at home on the battlefield than on the ballroom dance floor. Orson Welles does an effective cameo as the fat, gouty, ineffectual Louis XVIII. Welles does a remarkable job in his few minutes of screen time by actually making the fleeing Bourbon King sympathetic rather than buffoonish. Virginia McKenna does a delicious turn as the worldly Duchess of Richmond in a stunning ballroom sequence that sets Byron's poem, \"The Eve of Waterloo\" to it cinematic equivalent.<br><br>The film was long rumored to run over four hours in the Russian version, and at times it does have the feel of a film that has been cut, but recently the film's Associate Producer and Editor Richard C. Meyer has confirmed that the longest known version ran 132 minutes and that the \"four hour\" version was merely a rough cut never meant for distribution. A quick look at the complete cast list, however suggests otherwise as many never made it to the released film.","user":"GulyJimson","rank":[122,133]},{"title":"Exquisite for its focus alone","rating":9,"date":"17 November 2000","review":"The problem most war movies have, especially if they depict one battle, is the addition of extraneous sub-plots.  I suppose the film makers think a broader audience will appreciate a movie more if there's an ordinary fellow shoved in that we can follow, and a love interest . . . Perhaps this view is valid.  \"Waterloo\" comes dangerously on the brink of that pitfall in an early scene, but quickly backs up and focuses on who we really need to know to understand the battle:  Napoleon and Wellington. Christopher Plummer was born to play Wellington, and he underplays the part beautifully, so that you know what he's thinking by the flick of an eyebrow or the corner of his mouth.  Steiger looks like the older Napoleon, and he tends to chew the scenery, but Napoleon flew into unrestrained rages.<br><br>The movie does an admirable job of doing what so many lesser war movies don't:  it gives you a good idea of what's going on in the field.  If you pay attention, you won't be at a loss for the strategy or tactics. <br><br>\nFurthermore, the way it was shot has kept it from aging.  It doesn't look like a \"spectacle\" from the '50s or '60s -- and though it employs a few of the poor film-making choices of its time that late-sixties film makers thought were so cool but which turned out so confusing and easily dated -- it doesn't seem dated at all.<br><br>The script has a peculiarity that might well have destroyed it:  the writers seem to have excavated every famous quote from Napoleon, Wellington, et al, and shoved them all into the dialogue;  and, amazingly, it isn't a distraction.  <br><br>The worst problem the film has as a whole is its tendency to try to duplicate famous paintings by Meissonier, Lady Butler, and others; sometimes this works, giving the color tones we have come to expect of the period from those very artworks.  Occasionally, it's distracting. <br><br>\nThere are a few very rough cuts that look pretty bad.  But the movie originally was more than four hours long, and the American release suffers from somewhat poor editing and splicing.  Surely it's time to bring a full (and wide-screen) release to home video?<br><br>However, if you like your historical war movies diluted with love stories and fictional characters, rather than having the real brains behind the battles at center stage, you'll probably be bored to tears by it.  If you want as good a recreation of a famous battle as you can probably get, this movie's for you.","user":"vox-sane","rank":[67,73]},{"title":"One of the greatest war-films ever made!","rating":30,"date":"30 June 2002","review":"This film is simply a master-stroke. It depicts one of the greatest military victories in British history and, from the point of view of the French, one of the most disastrous. This battle put an end to the monstrous (but impressive) career of the 'Great Thief of Europe', Napoleon Bonaparte.<br><br>Firstly, as an Briton, I must count the Duke of Wellington as one of my heroes but I should also say that I am a great admirer of the Emperor. Although I stand in awe of his achievements, however, as a patriot, I can't say I regret that he was eventually defeated. Nevertheless, this doesn't stop me from admiring him.<br><br>This film is probably the best film ever made that so vividly depicts the unique relationship between these two exceptional characters: Field Marshal Arthur Wellesley, 1st Duke of Wellington and Napoleon Bonaparte, Emperor of the French, who, between them, were the greatest military minds of that era (along with the great naval genius Rear-Admiral Horatio, Viscount Nelson, who beat the French at Trafalgar, but was tragically killed in the Battle).<br><br>The film has an amazing international cast, which includes Rod Steiger, Christopher Plummer, Virginia McKenna, Jack Hawkins, Dan O'Herlihy and the legendary Orson Welles as King Louis XVIII.<br><br>Steiger plays the Emperor and the film starts with one of his most loyal generals, Marshal Michel Ney, Duc d'Elchingen (O'Herlihy), forcing him to abdicate the French throne. Steiger's portrayal of Bonaparte is electric and he plays the Emperor almost like a tragi-hero. A military genius who lays waste to most of Europe but cannot overcome his own inner-demons. Steiger's portrayal, unlike most depictions of Napoleon, shows both the Emperor's military and political fervour as well as his anxiety, insecurity and mental anguish. The director is mindful of the fact that, although Napoleon was embarking on the definitave military campaign of his life, he was mentally exhausted and destroyed by the absence of his beloved son, who was 'captive' in Austria with his mother. Although occasionally a little too zelous, on the whole, Steiger's performance lights up the screen, giving the viewer a vivid sense of Napoleon's imperfections, his tantrums and eccentricities.<br><br>Christopher Plummer takes on the role of one of Britain's great heroes. Once again, Sergei Bondarchuk has made no effort to romanticise or excessively glorify the 'Iron Duke'. Plummer's performance is beautifully underacted and Plummer chooses to show both Wellington's massive ego and his sharp and witty sense of humour. Like Napoleon, and most English aritocrats, Wellington was also an eccentric (this is most excellently demonstrated by the Duke's response to the discovery that a man from the Enniskillen, whom he \"flogged more than the rest of the army put together\", had stolen a pig - promoting him to corporal). Plummer makes no attempt to sugar-coat Wellington or hide some of the Field Marhsal's less attractive character traits and prejudices, one of his first utterances in the film being \"scum! Beggars and scoundrels the lot of them. Gin is the spirit of their patriotism\" (to the Duchess of Richmond, in reference to his own men).<br><br>Bondarchuk takes the risky but highly effective gamble of packing the script full of actual quotes attributed to the great men themselves. This could easily have been a disaster but pays off beautifully. Even though they never meet, the Emperor and the Iron Duke almost seem to have a bizarre rapour, Napoleon saying of Wellington \"this man has two qualities I admire: courage and, above all, caution\" and Wellington saying of Napoleon \"by God, this man does war honour\". It also reveals a curious phenomenon that existed between Napoleon and Wellington in that Napoleon publicly derided Wellington's skill as a commander but in private admired him a great deal, whereas Wellington always publicly expressed admiration for Napoleon but in private confided that he thought the Emperor a bad strategist and a clumsy military leader.<br><br>Bondarchuk performs a master-stroke of directing. The cinematography is amazing and highly effective, combining clever, well-chosen close-ups with audacious panoramic views of the battlefield. Thrown into this the great performances by Steiger and Plummer and an amazing supporting cast, including the great Jack Hawkins (sadly, due to his having throat cancer, rather badly dubbed) as the curmudgeonly General Sir Thomas Picton, Dan O'Herlihy as the charismatic Marshal Ney and Virginia McKenna as the snobbish closet-Bonapartist Duchess of Richmond, and the result is magic!<br><br>The battle scenes are exceptional (although perhaps not quite bloody enough to give an accurate depiction of the horror and carnage of warfare at that time). Bondarchuk wastes no time using poetic licence, dumbing down or filling every scene with stupid romantic flummery - the characterisation is limited to the two great commanders and those closest around them at the time. Only Ney and Soult and Uxbridge, Ponsonby and Picton are developed much beyond simply who they were.<br><br>The film should also be congratulated on its historical accuracy. One or two minor inaccuracies aside, the film is extremely faithful, especially in terms of the battle itself and the military strategy involved. Sadly, in recent times, especially in America, the Hollywood machine seems all to happy to totally re-write history (e.g., \"Saving Private Ryan\" and \"Braveheart\"). Anyone looking for another \"Titanic\" or \"Ryan\" will not be interested in this film. If you just like watching films that bypass historical fact and depict the U.S.A. single-handedly saving the world then may I recommend \"U-571\".<br><br>This film does none of these things, it shows the French, English, Scots, Irish, Belgians, Dutch, Prussians (Germans), Russians, and all the rest, fighting in a time when war was honourable and wasn't decided by some lab-technician siting three miles under ground in Washington with his finger on a button and where there where military casualties actually outnumbered civilian ones.<br><br>This film is exceptionally impressive, especially given as many of the panoramic views of the army formations were shot using cardboard cut-outs (much more effective than the contemporary practice of simply CGI-ing both armies). The only flaw is the bad dubbing throughout the film and the fact that, like so many de Laurentiis films, the original director's cut was 5 hours long and some soulless corporate hacks slashed it down to just over 2!<br><br>Nevertheless, this is movie-history!<br><br>10/10 - and that's rare!","user":"sa013","rank":[77,91]}]