[{"title":"Much better than you've heard: The Running Man","rating":8,"date":"21 September 2007","review":"Sorely underrated and dismissed at the time of its release, THE RUNNING MAN can now be seen for what it it: a highly effective thriller. Director Carol Reed was said to be shaken after being dismissed from MUTINY ON THE BOUNTY, but it really doesn't show. He conducts us deftly through a nicely conceived intrigue, with no time wasted. If a viewer can forgive a small handful of plot contrivances, this movie delivers in suspense, interesting characters, acting, and pleasing use of locations. The cast is superb: Laurence Harvey might look underfed, but his character is richly drawn he seems to have a great time. Lee Remick has never been better: a woman who sees her husband for what he really is when he assumes a new identity. And Alan Bates, an actor who radiated charm, brings a lot of substance to his part. Watch for Fernando Rey and Fortunio Bonanova (the singing teacher from CITIZEN KANE--\"Impossible! Impossible!\") as a bank manager. The script has a good helping of humor along with the suspense. And William Alwyn's music score enhances the film as well. It may not be THE THIRD MAN, but THE RUNNING MAN is likely to satisfy most fans of thrillers, the director and the estimable cast.","user":"mackjay2","rank":[44,48]},{"title":"Excellent thriller with good twist","rating":8,"date":"9 April 2003","review":"A bitter airline pilot fakes his own death and gets his wife to collect the money. They escape to sunny Europe after committing a perfect crime. But, of course, there's always the dogged investigator to make things difficult.<br><br>\nThis movie is a good afternoon's diversion. It's bright, flashy and pacey. With John Mortimer writing and Carol Reed directing, it has a certain touch of class. It's not an A list movie by any means, but a quick look in any reference book will tell you that it's well respected. Good performances, bright locations and a decent pace make this well worth a look.","user":"Dawnfrancis","rank":[41,45]},{"title":"No classic, but pleasantly diverting","rating":6,"date":"16 July 2003","review":"For those who resent paying their insurance premiums--and who amongst us doesn't--there is Carol Reed's The Running Man, not to be confused with the Arnold Schwarzinator film of the same name. The always dapper but much too thin Laurence Harvey stars as Rex Black, a professional pilot whose insurance claim is turned down by frosty Allan Cuthbertson due to coverage that expired two days prior to an accident. Enraged, Harvey and wife (played by an icily beautiful Lee Remick) launch a scheme to bilk the insurance company of a very large sum of money. Unfortunately, claims adjustor Alan Bates is on the job to complicate matters for the felonious couple. John Mortimer's screenplay is a bit flat and frankly unbelievable at times, but the superb cast more than makes up for it. The film, shot in colour and on location in Spain, looks gorgeous, but Encore is airing a pan-and-scan print that severely compromises the original Panavision framing. At least this print retains a widescreen credits sequence, which features some superb work by Bond main man Maurice Binder.","user":"lexdevil","rank":[21,24]}]