[{"title":"\"You're a reckless man, Rawlins. And I don't like reckless men.\"","rating":8,"date":"16 August 2001","review":"I had really only been familiar with John Payne from his role in the Christmas classic \"Miracle on 34th Street\" and perhaps a forgettable musical or two. Naturally I was amazed at how effective he is in this dazzling, violent noir as a basically decent but brooding and extremely volatile former prize fighter reduced to driving a cab to support his beautiful, cheating wife. His acting is unflinching, unsentimental and completely authentic. He creates nearly as vivid and memorable a hard luck character as Marlon Brando did in \"On The Waterfront\".<br><br>The big city of this film (as presented by the marvelous and criminally under-appreciated director Phil Karlson) is a simultaneous vision of heaven and hell. Frank Faylen, Evelyn Keyes and Eddy Waller are angels, willing to do anything to protect vulnerable Payne (even mislead the police), their faith in his inherent goodness unshakeable despite his tirades and self-destructive tendencies. Brad Dexter, Peggie Castle, Jay Adler and Jack Lambert are devils; selfish, ruthless and evil to the core (although there are shadings to Castle's portrayal of the cheating wife which suggest she does feel some remorse). At one point Payne gets caught in the web of the villainous Adler, who has bigger fish to fry, and explains that he needs to be let go so he can find the man who framed him for murder. \"Well, isn't that unfortunate?\" Adler coldly responds before having one of his henchman conk Payne on the back of the head. <br><br>You'll have a hard time finding a better supporting cast than the one here. One of those rare movies where everyone nails their parts and comes through with a fresh, inspired take. A sly, sturdy, thrilling, consistently surprising picture.","user":"abooboo-2","rank":[52,54]},{"title":"John Payne/Phil Karlson combo makes for potent punch","rating":9,"date":"21 August 2001","review":"The underrated John Payne -- an ideal Everyman -- teamed with director Phil Karlson in a number of 50s thrillers.  All bear viewing, but maybe the pick of the crop is 99 River Street.  Payne plays a washed-up boxer now driving a hack, and the movie opens in a frame-within-a-frame of his watching himself in an old bout on TV. Trying to win back the affections of his couldn't-care-less wife (Peggie Castle), he discovers that she's two-timing him.  Meanwhile an old gal-pal with theatrical yearnings (Evelyn Keyes, and maybe her finest hour) tries to enlist him in a scheme of her own, which backfires.  Next, his wife turns up dead....Karlson keeps the tension high but well-modulated while managing to strike most of the images and motifs on the noir keyboard (including some evocative night footage of the Jersey waterfront).  Overall, this installment in the  cycle (which has never appeared on commercial videotape) remains one of the most satisfying and characteristic examples of noir in the early Eisenhower era -- slightly less spooky than its 40s predecessors, but a bit more brutal, too.","user":"bmacv","rank":[34,36]},{"title":"Payne Against the World","rating":9,"date":"28 August 2002","review":"As in the the previous year's Kansas City Confidential, John Payne is a most put-upon protagonist. Directed by KC Confidential's Phil Karlson, and photographed in gorgeous black and white, alternately harsh and painterly, by Franz Planer, this one has Payne as a washed up prizefighter who must avenge his worthless wife's murder, not because he cared particularly for her but because he is (falsely) implicated in it. Payne has to take on a good number of unsavory characters, and proves himself if nothing else still a most able man with his fists. There's a nice feeling for fifties urban night life in this one, of a less than high class style. Karlson shows an almost Fritz Langian feeling for the traps people fall into, personal and criminal, and like Lang doesn't go much for self-pity. In the Karlson scheme of things guys get framed for things they didn't do every day, affluent crooks wear expensive overcoats and take cruises fairly regularly, while working stiffs get the wrong end of the stick every time. It takes a tough man to survive in this universe. Payne is not only tough he's so resolute and bad tempered as to make the real bad guys look like the respectable businessmen they claim to be. It's Payne Against the World in this one. Or Pain Against the World, as the character Payne plays seems to suffer as much from internal anguish as anything the villains of the piece cook up for him.","user":"telegonus","rank":[31,34]}]