[{"title":"Fun Spaghetti Western With Great Actors","rating":7,"date":"9 October 2006","review":"\"Sono Sartana, Il Vostro Becchino\" aka. \"Sartana The Gravedigger\" aka, \"I Am Sartana Your Angel Of Death\" is a quite humorous Spaghetti Western with a Great Cast.<br><br>Like in all the original \"Sartana\" movies he stars in, Gianni Garko is once again very cool as Sartana, the genre's most well-dressed (anti-)hero. This time, bounty hunter Sartana needs to clear his name after someone robbed a bank dressed up as Sartana and he is blamed and hunted by his fellow bounty hunters. Accompanied by a fellow bounty hunter, the not so well-dressed Buddy Ben (Frank Wolff), Sartana is out to seek those who dared to blame him for their crime.<br><br>\"Sartana The Gravedigger\" is not exactly a 'Comedy' Spaghetti Western, but it's certainly a very funny one. Hot Dead, a bounty killer, fast shot and very unlucky gambler, played by the great Klaus Kinski is one of the ironical characters who make this film so funny. Another funny character is villainous and slightly insane bounty killer Deguejo (played by B-Movie star and regular Spaghetti Western actor Gordon Mitchell), who is, as most of the characters played by Mitchell, very exaggerated, but exaggerated in a good, funny way. The great Frank Wolff is funny in his role, and Gianni Garko is great and epitomizes coolness (as in the other Sartana movies).<br><br>The movie's score is pretty good, although the composers actually just plagiarized the work of Ennio Morricone (Kinski's theme in this movie is basically a lesser version of Cheyenne's theme in \"Once Upon A Time In The West\" and the rest of the film's soundtrack also resembles various Morricone compositions). It's okay to learn from the master, however.<br><br>All things considered, \"Sartana the Gravedigger\" is a good Spaghetti Western with great actors (especially Kinski, Wolff and Garko). Highly recommended to every fan of Spaghetti Westerns. 7/10","user":"Witchfinder-General-666","rank":[10,11]},{"title":"This is what it's all about.","rating":10,"date":"8 September 2000","review":"Nothing short of great stuff here with an excellent cast and a well written script punctuated by some great little moments of humor. Garko is better than usual as the eagle-eyed, razor toungued and lightning fast Sartana and has a wealth of great character actors to support him, including the vastly underrated Frank Wolff. The direction is exceptionally stylish, with numerous POV shots and expressionist angles that add loads of atmosphere to what, in lesser hands, could have been a rather average outing. Great stuff, that may not convert the heathens, but will definitely please the spag aficionados.","user":"Junkie-6","rank":[12,14]},{"title":"A Positive Surprise","rating":7,"date":"16 January 2005","review":"This is the third Sartana played by Garko film I have seen and while I found the first two to be mediocre at best this one hit me positively. Sartana is falsely accused and is searching for the real bank robbers. The evolving story consists of many little entertaining episodes and whenever you think that the real bad guy is already revealed there is one more twist. In his quest Sartana is assisted only by Buddy Ben who is well played by Frank Wolff, the rest of the characters is hunting the bounty put on his head. No problem for Sartana who kills them all, most of them with his Derringer pistol. Kinski with more screen time than usual shines in his role as an addicted gambler. <br><br>The lead characters are having their own and nice scores. Cinematography is above average but I've seen already better. The German budget DVD is OK and has even the original Italian soundtrack.<br><br>7 / 10 (**1/2)","user":"cengelm","rank":[7,8]}]