[{"title":"Portrait of wartime society","rating":29,"date":"29 November 1999","review":"\"In Which We Serve\" is more than a story told for propaganda effect about naval heroism and based on Mountbatten's wartime experiences. As the English film critic Barry Norman has put it: \"Aboard Coward's fictional HMS Torrin there existed forties British society in microcosm. Here everybody knew his place... The one thing they all had in common was the knowledge that each of them, high or low, was expected to show unswerving loyalty and devotion to duty\". The relationships between the men on HMS Torrin and the lives they lead at sea and at home (told through flashbacks) portray a wartime society ordered by class and intentionally defined by the traditional British virtues of duty and sacrifice. It is a society in which understatement and the stiff upper lip reign supreme. Emotions go largely unspoken. They simmer under the surface of the screen in the silences and in the flickering effort of concealment on the faces of the major characters. Personal suffering is borne with quiet forbearance, in the knowledge that it is borne in the service of a higher cause and that to bear it stoically is to set the right example to others. When the ship's chief petty officer is told of the death of his wife and mother in law in the blitz he first congratulates the sailor who brings him the news for becoming a father before going up on deck to bear his grief alone. The clipped style of speech of Captain Kinross played by Coward himself and the slightly shrill upper class accent of his wife played by Celia Johnson heighten the sense of feelings being stripped away from the words. Their conversation is a caricature of communication - the protagonists performing their dialogue in a choreographed ritual. Real communication is only hinted at - the underlying pain understood but never expressed. In \"In Which We Serve\" the captain and his wife are the models to which other men and women must aspire - in monologues they define the notions of duty and sacrifice to which each sex is bound. Both put duty before the pursuit of personal happiness (a theme David Lean and Coward return to in Brief Encounter). When the Captain talks of the need for a happy ship he is not referring to the right of individuals expressed in the Declaration of Independence. Here happiness is a collective duty in the interests of efficiency.<br><br>For the men and women in Coward's vision HMS Torrin is much more than a ship - it is personified as the object of their devotion and jealousy. Above all it is a powerful symbol of the qualities and traditions that unite and must protect their vulnerable island at war. Outdated though this vision may be - part of a world left far behind through post-war socio-economic development and emancipation - it is nevertheless a compelling and entirely consistent vision which ensures the film retains a certain appeal to audiences even today and is a major reason why it can still be so highly rated as a piece of British cinema history.","user":"101774.2246","rank":[55,62]},{"title":"Possibly the best film yet about war's totality","rating":9,"date":"18 April 2000","review":"\"In Which We Serve\" is not only a wonderful pastiche of British society during the second world war, but a complex, yet correct statement of a very simple theme -namely the duty of a country's citizens to defend the system it believes in. The simplicity of the story is one of the movie's key strengths, but the most appealing aspect of the film is, for me at least, the way in which each scene reflects the preceding and suggests the subsequent one. The motivation behind this may have been to demonstrate the unifying elements of the various different characters and their individual stories, but the skill with which this is done makes for a wonderfully satisfying experience. The film is excellently crafted, moving from a semi-documentary style that would have been instantly recognizable to cinema audiences of the forties, with the then common weekly news reviews; and then moving into everything from light-comedy to exciting action and pure drama. It is a film that for many will seem old-fashioned, but only in some of its sentiments, never its techniques or its wisdom. And the \"old-fashionedness\" of some of it -such as the love scene between John Mills and his girlfriend on the bench by the water- has a poignancy that is nevertheless almost painful in its innocence. Above all the film expresses one immensely important concern: dignity. It is reflected in the words and actions of all the characters, and shines through the film with the immense pride the film-makers (Noel Coward especially) put into making this film. It is an important film not least because it is not afraid of expressing loss -for many the thought of a film about a sinking British ship was a shocking risk to take in a time of war. And it is an entertaining film as well, in the best tradition of British cinema. Like the other main Coward/Lean masterpiece \"Brief Encounter\" this film can be enjoyed on so many levels that it demands multiple viewings. And like \"Brief Encounter\" you will discover new subtleties each time...","user":"arbarnes","rank":[66,76]},{"title":"A British wartime classic - and no mistake!","rating":7,"date":"27 August 2003","review":"The story of British Navy Destroyer HMS Torrin, told in flashback by the surviving crew members as they await rescue in the Mediterranean, the ship having been sunk during a battle.<br><br>   This film was something of a tour-de-force for Noel Coward, as he produced, wrote and co-directed it (with a young David Lean). Considering its age, the film stands up quite well today. It obviously seems dated in some respects - the dialogue is quite clipped and stilted at times - but is saved by professional work all round and a clutch of strong performances, namely by Noel Coward himself, John Mills and Bernard Miles. Its also notable for the screen debut of Richard Attenborough (it was screened over the holiday weekend as part of a celebration of his upcoming 80th Birthday).<br><br>   While some may find it presenting an overly romanticised view of the Royal Navy at war, it should be remembered that at the time it was made, in 1942, victory over Germany was still far from certain. With that in mind, it surely must have achieved its aim of boosting the morale of those who saw it. Over 60 years on it remains good solid entertainment and an intriguing glimpse into the mindset of the day.","user":"KEVMC","rank":[45,53]}]