[{"title":"French bedroom farce, American style","rating":6,"date":"11 May 2008","review":"1965's \"Boeing Boeing\" is a dated but mildly amusing film starring Tony Curtis, Thelma Ritter, Jerry Lewis and Dany Saval. Curtis is a swinging bachelor living in Paris who is juggling three flight attendants at one time, all of whom live with him, and all of them are his fiancees. He's able to do this with the help of his able housekeeper (Ritter) and his carefully worked-out airline schedules. Unfortunately, the new fast planes are goofing up the schedules. Adding to the confusion is a visit by his friend Robert (Lewis), a reporter. The two men and an exhausted Ritter try to keep the women from running into one another at the apartment as their arrivals overlap.<br><br>\"Boeing Boeing\" was originally a play that had a very brief run on Broadway in the 1960's and went on to become the mainstay of dinner theaters throughout the U.S. After a very successful run in London, it has recently been revived on Broadway starring Christine Baranski as the maid, Bradley Whitford in the Tony Curtis role, Gina Gershon as an Italian flight attendant and Maureen McCormack as a German one. Not having seen the original play, it's hard to know what if anything in the film was changed from the play. In the current Broadway production, the Jerry Lewis character, done to great acclaim on both continents by Mark Rylance, is totally different - he's a shlub who's never seen a woman before. Lewis would have been perfect playing it that way - instead, in the film, the character of Robert is very against type, quite serious. The handsome Curtis does comedy well and is a perfect playboy. Baranski currently does the Ritter role with a French accent, which wrecks most of the dry humor that Baranski, like Ritter, brings to a role. Ritter is very funny as she changes the photograph on the desk, cooks sauerkraut for the German flight attendant, tosses it when the French flight attendant arrives and makes a soufflé instead and basically wears herself out.<br><br>\"Boeing Boeing\" is pleasant and fun to watch as an example of that great comedy form, the farce.","user":"blanche-2","rank":[17,17]},{"title":"Jerry as a \"second banana\" again - briefly","rating":7,"date":"18 May 2008","review":"Farce is tricky - you need a good cast who are directed to be fast at split second timing, so that the appearance of people just missing each other add to the hilarity. It also depends on translation or state of the script. <br><br>BOEING (707) BOEING (707) is a French farce that became a hit there and then in Great Britain in the 1960s. It was brought to Broadway, but flopped. Still a movie version was made which is unique because it was the only pairing of Tony Curtis and Jerry Lewis, with Lewis playing a more subdued character than in other films. The film's plot is about how Curtis (a foreign correspondent in Paris) has an apartment which he sets up as a private harem with three girlfriends - all flight attendants (back then stewardesses): one English (Suzanne Leigh), one French (Dany Saval), and one German (Christiane Schmidtmer)each from their own nation's airlines (Schmidtmer is frequently referred to as \"Lufthansa\"). The only person who is aware that Curtis has this harem is his maid Berthe (Thelma Ritter). The ladies don't because Curtis has timed their arrivals and departures to the minute so that as two are gone the third is arriving.<br><br>Two disasters destroy the perfect love system Curtis has made - first the announcement of a more powerful airliner all the airlines will be switching to soon. That speeds up the arrivals and departures of the three women. Secondly, Curtis finds that he is being imposed on by a fellow journalist (Lewis) who needs a room for a few days before he can rent an apartment. Curtis and Lewis have a half-friendly and half-unfriendly relationship due to being rival correspondents and rivals with women. But Lewis discovers about the various ladies (all of whom claim they are Curtis's fiancé) and basically blackmails Curtis into putting him up.<br><br>The problems of the earlier arrivals of the three ladies perplex Curtis and Lewis, as their rivalry for the ladies mount. At the same time the one person stuck in the apartment all the time (Thelma Ritter) is getting more and more upset about the set-up which is tiring and thankless...and not as well paid as Ritter would like.<br><br>Curtis was always an adept farceur, but Lewis comes across as an accomplished one too - no geek like \"Nutty Professor\" or accident prone \"Errand Boy\" or \"Disorderly Orderly\" here. Instead we have a smooth operator - a cousin to \"Buddy\", the alter ego of the \"Nutty Professor\". The three ladies are good, particularly the German Ms Schmidtmer who is lovely but formidable (and a lady who dislikes French soufflés, and prefers knock-wurst and sauerkraut - much to the disgust of Ritter, who hates the smell). All the ladies love national styles of food. Ms Saval enjoys soufflés (and detests knock-wurst and sauerkraut). As for Ms Leigh, she loves deviled kidneys in their own juice (the juice, she mentions, is good for the complexion). Ritter dislikes the kidneys too, but always make extra ones for Leigh - she knows Leigh wants seconds.<br><br>BOEING BOEING was a mediocre film at the box office. But it is amusing enough to most viewers. Right now the original play is on Broadway with Bradley Whitford in the Curtis role and Christine Baransky as Berthe. It seems to be a better production than the original one. Baransky has a hard job in her role, but she is one of our finest female comics. The reason is that the best of the performers in the film was Ritter, who gets more and more confused and irritated by the goings on she is witnessing. In the ends she wonders if she really would ever stand for it under any circumstances. For watching Ritter alone the film is worth while. Knowing Ms Baransky from past performances she is certainly worthy to take on the same role.","user":"theowinthrop","rank":[13,15]},{"title":"A delightful surprise","rating":7,"date":"27 October 2000","review":"I first saw \"Boeing Boeing\" almost exactly a year ago when it came on TV, and I must say that I was delightfully surprised. While it was no comedy masterpiece, it still offered many genuinely amusing moments. The pairing of Tony Curtis and Jerry Lewis worked perfectly and it was interesting to see Thelma Ritter (who appeared in Hitchcock's \"Rear Window\") as the over-employed housekeeper.<br><br>Good entertainment, if you can ignore its staginess (the film takes place almost entirely in one apartment).","user":"fletch5","rank":[20,25]}]