[{"title":"good, moody film","rating":7,"date":"26 October 2010","review":"Alec Guinness stars in \"Last Holiday,\" a 1950 British film which was remade years later with Queen Latifah as the star. Though I enjoyed the warmth of the later version, the Guinness \"Last Holiday,\" no surprise, is superior.<br><br>Guinness plays a lower class Brit, George Bird, who is told he is going to die of a rare disease and has maybe a few months left to live. George quits his job, takes his savings, and goes to stay at a ritzy resort. There, he changes, and circumstances change for him. With nothing to loses any longer, he becomes outspoken. He also wins at poker, croquet, and a horse race. He's offered jobs. And there's the possibility of romance.<br><br>This is supposedly a comedy, but it's not an uproarious one. It's more drama, in fact. George Byrd finds that all these wealthy people aren't all they're cracked up to be. He also finds out that when you let go and stop trying, opportunities appear. And he learns the difference between passing the time and doing something with your time.<br><br>Alec Guinness is brilliant as George, timid at first, gaining stature with his new clothes, and asserting himself once he gets to the resort. It's a beautifully layered performance.<br><br>Despite some sadness within the film, this is an excellent story of a man who learns life's lessons in a narrow space of time.","user":"blanche-2","rank":[20,20]},{"title":"Guinness Pure Genius","rating":10,"date":"18 September 2004","review":"An unremarkable man is told he has Lampington's Disease and has only a few weeks to live, so he decides to spend his life savings on his remaining time left living a comfortable life in a seaside hotel. Straight away everything he touches turns to gold and he makes friends easily, gets golden business opportunities and even finds himself lucky in both the gambling and romance stakes.The staff at the hotel go on strike he rallies all the residents together and they fend for themselves, he bumps into the manufacturer of the farming implements he used to sell and tells him how to improve it and gets a partnership for his trouble.He even bumps into Sir Trevor Lampington the man who discovered the disease he's got and that's when our hero's luck changes again.When Sir Trevor tells him he hasn't got Lampingtons disease and it's confirmed, our man goes into deep joy as he's now able to take up all the offers he's received and truly lead a life of comfort. This is a tremendous film and Alec Guinness delivers a perfect performance of George Bird our main character who's luck changes from bad to worse to good to better and back again more than once throughout the film.With a couple of plot twists that you can see coming and a couple that come out of the blue so that the ending isn't obvious this is British film making at it's best. It's got a haunting violin theme also, and I'm not ashamed to say it made me shed a tear or two. This film is top of my list if it's ever released on VHS or DVD.","user":"philmcc","rank":[33,36]},{"title":"One of my favourite films","rating":10,"date":"17 August 2005","review":"I love this film and it's one of the few I've watched time and time again. It's a forgotten jewel and is infrequently mentioned. For me it has everything that was important of it's era. The social comment is mingled into an entertaining story. How the Health Service is expanding but people go hungry. An over worked Doctor making mistakes. George Bird being projected into a world that is not his own. The irony of riches coming his way when he thinks he has little time left. The Union's getting their grip on the country with strike action. How the upper classes view the lower and vice versa. How George Bird is now viewed as upper class because of his new setting. Post war money laundering. How war heroes can't find work. Love and jealousy. And the ironies - how he buys a dead man's clothes. How he swerves a car to avoid a dog that is due to be destroyed and turns into a road called 'Fallow End.' Then there is the acting. Sid James gives one of his great performance. His 1940's and 1950's work was superb. Sadly remembered for his Carry On performances more than the superb actor that he was. He just holds the scenes and in some cases is competing well with Guinness. For Guinness this is an early film. Ernest Thiesiger makes a great appearance along with many others including the delightful Kay Walsh. Esma Cannon's acting is well done - better than her later performances where 'silly' scripts let her down.<br><br>Please do see it if you can. It's a little gem.","user":"steve-2065","rank":[26,29]}]