[{"title":"Among Jarman's best.","rating":9,"date":"3 March 2005","review":"One gets the impression that other reviewers on IMDb have never seen or appreciated Jarman's other films, or any art film for that matter. This isn't for the intellectually inert. One also wonders whether they've taken the time to watch this one more than once -- its conflicted and dense, drawing on mutually contradictory sources for its symbolism, and attempting a synthesis or nexus. <br><br>The main themes are religion, love, oppression, family, and above all, time. Events and elements from every era of recorded human history co-exist together in one time and interact. While much of the film itself is done in the anxious, unsteady, rapid-moving style that Jarman came to be known for, other parts are filmed with graceful panoramic transitions. Throughout all the film, landscapes are replaced with artificial projections, perhaps to give the film an aura of unreality or allegory. It is at once both scripture and pornography, philosophy and nonsense, a gloomy warning and a hopeful swansong. I believe it to be one of Jarman's most un-acknowledged films. Don't let the harsh words of bad reviewers sway you against spending an evening absorbing this film -- its mesmerizing.","user":"pdale","rank":[27,32]},{"title":"Surreal and Dreamlike. A Poetic Tour de Force !!!","rating":8,"date":"6 July 2005","review":"Derek Jarmon films are always interesting. People seem to love his work or despise it. \"The Garden\" takes the persecution that Christ faced and puts it in modern times, or an unknown time for that matter. We have two homosexual martyrs who are persecuted like Christ, by the church. Tilda Swinton plays a modern day Mary who's chased around by ruthless Paparazzis. The film contains many strange visual delights. There is not a whole lot of dialog except for poetic narration. Like Jodorowsky's \"the Holy Mountain\", it's chock full of bizarre religious images. The set pieces and Costumes are extremely avant-garde and colorful. If you enjoy films that are a trip for the mind, you'll enjoy \"the Garden\". I felt that Derek Jarmon was inventive with his camera tricks and imagery. If you like bizarre art-house films with hallucinatory imagery, you must see this film.","user":"NateManD","rank":[16,21]},{"title":"a great movie that deals about real living and hypocritical","rating":10,"date":"23 January 2007","review":"Some people live, and many others are just jealous vultures.<br><br>The pictures and metaphors are made with a edge of a blade. Two kind of life are represented, and the cyclic way of life is very well pictured. I've seen a film on the modern times that have the same intensity is the film by Serge Reggio and Philip Glass (there is no words, pictures speak their selves), it's Koyaanisqatsi. The recurrent anachronisms are well interesting too, because all this theater is eternal. This paradox asks some real questions about the times we are living, and all illusion that suits. The way we lead our life, is the time we give themselves to be free.","user":"gabriel_elekarma","rank":[13,18]}]