[{"title":"HIGH-BALLIN' a bit slow, a bit strange.","rating":5,"date":"24 March 2001","review":"If you think you might be getting into a jovial SMOKEY AND THE BANDIT type film thanks to HIGH-BALLIN's ad art, think again. What the film delivers is a dark, moody piece set in snowy Canada that doesn't seem to know what direction it exactly wants to go in. Reed plays Duke, an independent trucker who just happens to be next on the list of a bunch of local truck hijackers. Fonda is Rane, an old trucking buddy come to visit for a spell and ends up helping Duke take on the hijackers. Is it supposed to be a comedy? Well, there are some funny moments. Hard ass action flick? Well, there are some cool stunts. Romantic drama? Well, yeah, there are some tender moments. For some reason though, there is that aforementioned dark tone that somehow squeezes out any ounce of humanity and replaces it with an ominous aura that lays itself out on the characters and the landscape. Maybe it's 1970's Canada, as I got the same feeling watching Cronenberg's FAST COMPANY. It may sound as if I don't like this film but I do. It's different and odd, especially for it's genre. Definitely worth a look.","user":"blackxmas","rank":[8,10]},{"title":"Good Trucker Movie. We talking' Jerry Reed, Son.","rating":6,"date":"23 April 2012","review":"I can't see why people are downing this movie because it doesn't really fit in a genre like Action or Comedy. This is a movie, it tells a story, and some parts are funny, there is some action, there are some serious moments and it is a little dark. You'll laugh, you'll cry, you'll see some action.<br><br>Overall it's a story about a big trucking company trying to squash the independent truckers out of business with Jerry Reed and Peter Fonda fighting against The Man for all the colorful, CB jive talking' independents out there.<br><br>The main problem with the movie, in my eyes, is the dreary and bleak scenery and Jerry Reed's overuse of \"Son\" as a form of address. There are some parts of the plot that are weak and not well explained, like the female lead \"Pick Up\". She eats at truckstops with the truckers and is on the CB and acts like a trucker but she just drives a pick up truck with exhaust risers and a camper on back. What is her job? Just cruisin' the highways pretending to be a trucker? She almost seems like a trucker groupie/wannabe, a step up from a lot lizard. Also not clear is why the big trucking company wants the independent drivers to quit and start working for the big company. The independents still haul loads for The Man and have to pay his fees. It is never really made clear.<br><br>This movie was entertaining all the way through the only real downer was the scenery. Wherever they are up in Canada is dirty, snowy and downright depressing.<br><br>If you like trucker movies and Jerry Reed, give it a spin. It isn't as awesome as Convoy it still is a good view.","user":"anchovyd","rank":[6,8]},{"title":"Like A Modern-Day Western!","rating":22,"date":"22 December 2000","review":"Peter Fonda and Jerry Reed make a great team in this well-made Canadian-filmed action flick, which is very much of it's era.  Made during the height of the time (late-70s) when movies about 18-wheelers and CB radios were all the rage (you may remember Reed from another HUGE hit of that time, \"Smokey &amp; The Bandit\"), \"High-Ballin'\" plays alot like a modern-day western, with Fonda riding into town after an extended absence to help his buddy and former road partner Reed, an independent trucker, take on hijackers who are trying to run him and other independents out of business and into work for a local trucking kingpin.<br><br>There's nothing too fancy about the straight-forward story, but there's excellent camraderie between Fonda and Reed, as well as good supporting work from Helen Shaver as a saucy female trucker/groupie, and Harvey Jason as the chief henchman of the trucking company kingpin, King Carroll.  It was also interesting to see Carroll played as a man who, while playing a not entirely honest hand, doesn't necessarily want to resort to violence in trying to achieve his means.  There are several impressively staged action sequences along the way, as well as some nice cinematography showcasing the snowy Canadian locations.  Director Peter Carter keeps everything moving at an interesting clip.<br><br>\"High-Ballin'\" is no masterpiece for the ages, but it's an entertaining time-killer and definitely a movie of it's time.","user":"G-Man-25","rank":[9,14]}]