[{"title":"Steve Martin's Affectionate Parody of 1940's Thrillers","rating":8,"date":"11 December 1998","review":"Rigby Reardon, private eye, runs the gauntlet of hoods, femmes fatales and crazed Nazis as he investigates the death of beautiful Juliet Forrest's father.  Who are the mysterious \"Friends of Carlotta\"?  And why does Rigby keep dressing in women's clothes?  And where did Juliet learn to do that trick with her lips? This celebration of the black and white movies of the 1940's and 50's is a very clever and very amusing film.  Extracts from celluloid classics are skilfully spliced into the action (check out the architectural detail on the doorframe in the Alan Ladd sequence). The film is a vehicle for Martin's comic talent and he carries it off beautifully.  Rachel Ward as Juliet is terrific: she can hold her own with the screen goddesses who so liberally populate the film (Bergman, Davis, Turner and Crawford all make inserted appearances). A project like this could easily have come a cropper, but thanks to the brisk direction of Carl Reiner (who has a great cameo) and Steve Martin's ability to dominate the screen, the movie is a resounding success.  It's also very funny.","user":"stryker-5","rank":[62,65]},{"title":"As strong as a cup of my famous java...","rating":7,"date":"16 September 2003","review":"I first saw this in the theater with my dad, at the age of 13, when it was first released - he was a huge fan of classic movies and usually suffered through the stuff he took me to. Not this one - we were both in hysterics, and I'd have to say I owe my huge love of classic Hollywood (and global) cinema to this film. CITIZEN KANE it may not be but no matter - I dug the humor and the atmosphere at the time, and even then was aware of how much work this must have been. <br><br>I still watch this one on occasion, and it is the rare comedy that has held up very well with the passage of time - critics at the time seemed to write it off as a stunt, but I've noted that at least a little reevaluation of DEAD MEN DON'T WEAR PLAID has occurred over the years. The performances - as both a spoof and a love-letter to film noir - are top notch, with Steve Martin at his best here. The dialog gets deep into Raymond Chandler/Dashiell Hammett hard-boiled private-eye stylishness, serving up gumshoe-with-dame clichés just juiced up enough to give Steve something to run with, while still offering an a solid story. The finale is magnificent, Martin and Carl Reiner jousting their way through an avalanche of every two-bit dime-store whodunnit game-over cliché to ever grace the big screen, cheap alibis falling like drunken angels across the naked city as the big heat descends... Or - ahem -something like that...","user":"davidals","rank":[71,76]},{"title":"So they don't","rating":10,"date":"20 July 2001","review":"An incredible achievement. My mind boggles at the amount of thought, time and effort that must have gone into this superb film. The plot is brilliantly and hilariously convoluted, with screen legends from the 1940s making appearances in amazingly edited scenes, and Steve Martin's trademark absurd humour is present almost all the way. Steve and Rachel Ward have remarkable chemistry, and each of their performances are highly impressive. If it weren't for the bundles of humour employed, one would almost think at times that this actually is a film noir from the 1940s, so legitimate and believable is the 'feel' or the atmosphere of the film.<br><br>I cannot believe that some people who commented on this film have said that the plot is merely an excuse to hang old movie clips onto, and not much use at all; and the person who claims that Steve Martin overacts in this movie mustn't realise that this is regarded as one of Steve's more restrained, deadpan comedic performances (the 'cleaning woman!' device turns out to be an important part of the plot and also seems to be a way of using the strangling scene that is taken from the Bette Davis movie - it is also a chance for Steve to get in a very tiny element of his 'wild and crazy guy' persona, which he substituted with a more suitable [for parody] 'straight' performance).<br><br>A rousing and side-splittingly funny success - they don't make 'em like this anymore!","user":"andy stew","rank":[64,70]}]