[{"title":"Like an exquisite vacation!!!","rating":20,"date":"20 November 1999","review":"Every time I watch Anne of Green Gables,  I am transported out of my living room in California in 1999 and into the beautiful colorful time of 1908 and Avonlea,  PEI. It is such a simple yet beautiful story.  As a person who usually prefers movies nothing at all like this,  I am shamelessly admitting that I adore everything about these stories from L.M. Montgomery.  And even if they had put in a special order,  they never could have found anyone more suitable to play Anne than Megan Follows.  No matter what else I see her in, she's Anne Shirley,  and she will always be the only Anne Shirley.  If I'm stressed or upset,  I have only to go to Anne's world.  It's like an inexpensive vacation!!! : )","user":"PeachHamBeach","rank":[52,53]},{"title":"A perfect example of storytelling","rating":10,"date":"30 June 2003","review":"This film is absolutely gem (sequel included). The direction, acting, script and cinematography is spot on. I feel that the casting director should get a special mention as I don't believe you can find a better cast to play out the characters in the book. I feel this is where it mainly succeeded where other versions have failed. Megan Follows is Anne in every way. Excellent performances from Coleen Dewhurst and Richard Farnsworth help bring the story to life as well. A film translation from a book is never better than the book itself. I think this film and it's sequel are an exception.","user":"akthar_c","rank":[49,50]},{"title":"Super Super Super!!","rating":11,"date":"11 April 1999","review":"When I read these books as a child.. I would read an installment and then watch the installment on television.  I have been in love with the stories ever since.  The characters are truly the embodiment of L.M. Montgomery's written word.  She would be proud.<br><br>I grew up wanting Gilbert Blythe to be in love with me and for Diana Barry to be my best friend.  I think that this series was and is excellent.<br><br>If you like this one, make sure to watch the sequel.  It is a little more romantic and a little less adventurous, but aren't we all when we grow up??","user":"Bookends","rank":[37,39]}]