[{"title":"A Hidden Gem","rating":8,"date":"19 March 2004","review":"Hidden from me, anyhow - I'd never heard of it until browsing through my local library's video collection.  Imagine an Ealing comedy as directed by Frank Capra.  All of the acting is first-rate (and Vivien Leigh, pre-\"Gone with the Wind\", was about as beautiful as any woman could be), and the sets are unusually lavish for what must have been a medium-budget film in its time.  The characters are strong yet sufficiently complex to lift the story above the simplistic comic melodrama it might have been - I can't imagine many American films of the time (or of this time) that would allow the \"villain\" of the piece enough courage to face down and walk through a mob that has just publicly humiliated him and is ready to attack him.  The comedy is wonderfully handled, especially during the scene in which a pack of dogs runs rampant through the villain's stately home, and during the climactic courtroom scene.  (The film's funniest line makes sense only in the context of the film:  Ursula Jeans' anguished \"Harold, he called me a woman!\")  \"Storm in a Teacup\" is a genuine delight.","user":"davefrieze","rank":[36,36]},{"title":"An apparent piece of froth hides a satire of Hitler","rating":8,"date":"11 December 2004","review":"Why isn't this excellent comedy better known? More to the point, why is it so consistently misinterpreted? Most commentators view it as an amusing piece of froth about the provost of a small Scottish town (Cecil Parker) ordering that a dog be put down because its owner cannot pay for its licence. There's Vivien Leigh as the provost's daughter and Rex Harrison on top form as the journalist who makes the silly story national news. It's all very funny and delightfully played by all concerned. But underlying this story (adapted from a German play by James Bridie) is a subtle satire of dictatorship as was then current in Germany and Italy. Parker's role is very clearly based on Hitler, a times quite unsettlingly so, and it is in the bold but successfully intermingling of whimsy with dictatorial manners that the film gains its particular power. Cute it may seem to be, but Victor Saville was a wise and quite a subversive soul, and you'll find few other films from this period that so ably blend the dark with the light. Take a look at it again and see what I mean!","user":"kinekrom","rank":[33,34]},{"title":"delightful British comedy","rating":21,"date":"21 August 2011","review":"Vivien Leigh, Rex Harrison, Cecil Parker, and Sara Allgood star in \"Storm in a Teacup.\" Parker plays Gow, an arrogant Scotsman running for public office. As he is being interviewed by reporter Frank Burdon(Harrison), he is approached by a local woman (Allgood) who is near hysterics about her dog being put down because she hasn't paid the license. While talking on one side of his mouth stating that he is for the people, Gow roundly throws her out. Affronted, Burdon turns the incident into something akin to what Watergate was in the '70s. Leigh plays his daughter, who just happens to have fallen in love with Burdon.<br><br>Excellent acting sparks this fast-moving comedy - in a run of the mill ingénue role, the beautiful Leigh sparkles, and a very young Harrison does a marvelous job as a determined reporter. Parker plays a pompous man with guts beautifully, and Allgood in her usual role as a low-class woman, is great. Kudos to Patsy the dog, who is the storm in the teacup.<br><br>Really worth seeing for the very young Leigh and Harrison.","user":"blanche-2","rank":[21,22]}]