[{"title":"How can you not like this movie?","rating":7,"date":"24 April 2004","review":"This is one of those movies that i loved when i was younger so i really didn't know what to think as i watched it again. But to my surprise it is still charming, funny and sweet. Enter Chevy Chase as the last family guy, just wanting to spend time with his loving family. A hilarious journey from Chicago to California to get to an amusement park. You may think, that shouldn't be a problem, but it is. This is one vacation you will never forget. I have always liked Chevy Chase and if you watch this movie you will know why. The sweet caring family man losing more and more of his mind is nothing less than funny as hell. Maybe you will think twice about taking your family on vacation after watching this movie. I rate this movie 7/10","user":"udeaasykle","rank":[43,52]},{"title":"How To Make A Timeless, Original, Hysterical, Satirical Comedy.","rating":10,"date":"17 January 2003","review":"Every summer Chevy Chase takes his family on a little trip. This year he went too far. <br><br> Chevy Chase stars as Clark Griswold, the typical American businessman. Well, almost a basic businessman. He works in food preservatives. Beverly D'Angelo plays his wife, Anthony Michael Hall plays Rusty, his teenage son, and Dana Barron plays his daughter Audrey . This summer, Clark has decided to go all out and take a vacation with his family to \"Walley World,\" a theme park spoof on Disney World, owned by \"Roy Walley\".<br><br>Basically, this film starts out strong and ends strong. There are many gut grabbing scenes, and the film never resorts to gross out humor. The biggest gross out is when Clark bites into a sandwich a dog leaked on, but that's a different story.<br><br>Along the way to Walley World, everything and everything that can go wrong does, and Clark ends up with Aunt Edna (Imogene Coca), who adds more fun to this wallop of a comedy.<br><br>The laughter just escalates more and more as we see Clark's dreams flush down the toilet farther and farther, and I can't tell you how much I laughed at some of the scenes.<br><br>\"Vacation\" isn't typical National Lampoon fare.<br><br>Chevy Chase gives by far his best performance (akthough he acts just as well in \"Christmas Vacation\") as Clark, a real optimist, go get'm kind of guy, who completely snaps toward the end of the film. The rest of the cast does well, and Beverly D'Angelo does surprisingly well as a house wife. The two children, Audrey and Rusy, squawk at each other, but not to the point of obnoxious, which is another good thing about this film.<br><br>Is it no surprise that John Hughes, the king writer/director of the 80's comedy films wrote this, or that Harold Ramis (Groundhog Day, Ghostbusters, Striped, Analyze This) directed the film? <br><br>With cameos by the likes of John Candy, Eugene Levy, Brian Doyle Murray (who played Clark's boss in \"Christmas Vacation\"), and more, \"Vacation\" is a comedic triumph of the eighties that is now an icon of how to make a good comedy.<br><br>4.5/5 stars --<br><br>John Ulmer","user":"MovieAddict2016","rank":[60,75]},{"title":"Just one word: Awesome!","rating":10,"date":"30 July 2000","review":"I have seen this movie many times on TV (the German dubbed version, of course) and I loved it every time...allthough the more often its shown, the more it gets cut on TV.<br><br>Now, for the first time (thanks to DVD), I have been able to watch it in its original language. And it was just awesome! The dialogues were even better and the characters were so much better outlined.<br><br>I swear that I will never see such a great movie in a dubbed version again!<br><br>To any Germans in here: go get it on DVD (even though it is just in Mono) - and delete the video tape if you have recorded it from TV.","user":"Krisko1974","rank":[43,55]}]