[{"title":"Richard Chamberlain is excellent","rating":9,"date":"3 May 2005","review":"Richard Chamberlain had already proved himself a fine actor before starring in this TV production of \"The Man in the Iron Mask,\" but here he truly gives the performance of a lifetime. Performances, I should say, because he plays two different (VERY different) roles: King Louis XIV and his long lost twin brother, Phillippe.<br><br>Louis is a spoiled, infantile (his courtiers know perfectly well to deliberately lose at croquet lest they \"risk another tantrum\") and often cruel man, who lives in splendor while his subjects starve. He treats his long-suffering wife like garbage, openly flirting with and carrying on other women, and at one point he even viciously rips her wig off in public after calling her a \"mountain of sallow flesh.\" Not surprisingly, no one likes Louis all that much; even his mother is hard pressed to say anything nice about him.<br><br>Meanwhile, Phillippe, totally unaware of his relation to Louis, is mysteriously kidnapped from his cozy home and thrown into the Bastille. But it's not what you think -- his kidnappers are the ageing Three Musketeers, who, fed up with their \"water lily\" of a ruler, have a plan to oust him and replace him with his identical twin, Phillippe. (Though Phillippe was born first and is therefore the rightful king, they insist that he rule as Louis XIV because of France's instability.) The Bastille was a \"safe place\" to stash Phillippe, or so they thought; at least two people, upon accidentally seeing Phillippe, are struck by his resemblance to Louis. One of them reports to Fouquet, the king's closest adviser. Upon verifying Phillippe's identity, Fouquet breaks the news to Louis, who, quite rightly fearing usurpation, hatches a cruel plan: imprisoning Phillippe for life in a run down castle in a distant part of France. But even that isn't enough: \"No one must look upon his face,\" Louis tells Fouquet. Hence the iron mask, which is locked upon poor Phillippe in a gut-wrenching sequence.<br><br>The rest of the movie is about the Three Musketeers rescuing Phillippe, telling him the truth, and proceeding ahead with their plans. Meanwhile, Phillippe falls in love with Louise, a pretty lady of the court who the king is also unsuccessfully trying to romance (and as it turns out, Fouquet likewise tried to romance, and when she spurned his advances, he had her father thrown in the Bastille), and there's plenty of wonderfully intricate plotting.<br><br>While the performances are strong all around (except for maybe Jenny Agutter as Louise), it's Richard Chamberlain who carries the entire movie. Phillippe starts out an ordinary person, but his grotesque mistreatment starts to make him almost savage. Not surprisingly, the desire for revenge burns white-hot inside him, and he finally gets to realize it at the end. He also has a remarkable moment when, after having assumed Louis XIV's identity, he meets his mother for the first time: he is so emotional that he can barely get the words out, yet manages to cover it by telling her how beautiful she looks. The queen mother, who of course doesn't know his true identity, beams and says, \"My Louis?\" as if wondering that maybe now she can finally truly love her son.<br><br>Meanwhile, his turn as Louis is admirably restrained. Most actors would not be able to resist chewing the scenery while playing such a vile, decadent character, but Chamberlain instead gives a nuanced, surprisingly subtle performance. Louis is thoroughly despicable, and Chamberlain is clearly having fun playing such a juicy villain, but he doesn't go over the top.<br><br>Patrick McGoohan also shines as the clever, vain, heartless Fouquet. He often speaks in a type of growl that reminds me of Jeremy Irons, and his refined sadism is chilling to watch. It makes it all the more satisfying that, in the end, Fouquet is deceived by a simple seamster -- and that he himself is the one who seals his own fate by incorrectly naming Louis as the pretender.","user":"amidalasky","rank":[19,19]},{"title":"First rate","rating":30,"date":"30 March 2004","review":"Dumas' classic wonderful vivid novel sucks you in with its intrigue at the highest levels, the moral contrasts, the cleverness, the adventure.<br><br>I was very surprised at just how fine this was - the cast is of the highest caliber - Ian Holm, Patrick McGoohan, Ralph Richardson, Louis Jourdan - an extraordinary Richard Chamberlin and a very pretty Jenny Agutter (though her character is rather one note). <br><br>Note the movie is directed by Mike Newell - who would go on to direct Enchanted April, Four Weddings and a Funeral and many other fine movies.<br><br>\nI was also floored by the producers' settings: four chateaus, the real island referenced in the novel, Fontainebleau - this movie (though made for television) must have cost a fortune to produce!<br><br>I think the Frenchman's comment below is a bit sniffy.<br><br>\nFirst, this was not an American production - but an English one.<br><br>\nSecond, this was not a distortion of French history -- Alexandre Dumas pere himself took many (wonderfully imagined) liberties in his novel - does anyone REALLY think Louis XIV was one of identical twins? Come on -this is a novel! <br><br>Thus, the complaint that Louis XIV did not after all remain faithful to this mistress (as one would expect from the movie) is an objection to the historical truth of the novel, not its faithful adaptation to the screen. This movie well captures the flavor and spirit of the novel (except, as one reviewer notes, for the character of Philippe, made far more sympathetic here - but then most viewers (myself included) want a sympathetic central character).<br><br>I also find the reviewer who says this was poor except for the wonderful acting of all the actors - to be a bit strange. They ARE the movie.<br><br>\nThis was very well done, so engrossing and so much fun. Patrick McGoohan is particularly wonderful, as is Chamberlin. Well worth your time - it's efficient, clear, amusing, horrifying, romantic, and gives plenty for those interested in history. <br><br>It's also the perfect exciting family movie (well, except having to explain mistresses serving at the royal pleasure - that could be tricky) with something for everyone.","user":"trpdean","rank":[28,29]},{"title":"Hugely under-rated","rating":8,"date":"2 September 2006","review":"I'm not usually drawn to French historical/3 Musketeer films but I switched over to a movie channel today and this had just started so I thought I would give it a go. Within minutes I was captivated by the wonderful acting and the deviously intricate plot.<br><br>Richard Chamberlain is, here, a revelation. Nothing less. He excels in both of the very different roles he has to play. His depiction of King Louis XIV is quite mesmerising. The scene in which he arrogantly dances a ballet for his court is extraordinary. And, towards the end (I am trying not to spoil) Chamberlain - this time playing the other twin - is involved in another great dance moment, when he dances at a ball with the Queen and they have a private conversation as they dance, which is so well-written and performed that it will have you grinning with delight.<br><br>Patrick McGoohan, Ian Holm, Ralph Richardson and the rest of the cast are also on top form. The sumptuous direction is equally superb. Unfortunately, as it was a TV movie, the quality of the sound and video tape has suffered a little over the years, and I suspect this may be the reason why it has not been shown so often. But the deterioration in the visual quality is overcome by the brilliance of the acting and direction, which really do shine through the primitive technology to make for a truly memorable film experience.<br><br>I felt, watching some of this film, as if I was watching an opera. But if you don't like opera - don't let that put you off! It's the grandness of the story and the unashamedness of the acting/direction that I'm talking about. It is very rare that film-makers just throw caution to the winds and allow themselves to 'go for it' like this. Just watch it and you will know what I mean.","user":"tohu","rank":[16,16]}]