[{"title":"Post 1950 police noir with flashbacks inside of flashbacks.","rating":7,"date":"7 September 2003","review":"This is a perfect example of the typical post-1950 noir which tended to be told from the point of view of the police rather than the criminal so they are less existential than the classic pre-1950 noir. Blame it on the blacklist. Anyway, it retains the noir virtues of a simple story economically told and expressively photographed. Only the garishness of containing a super star and being directed, uncredited, by Raoul Walsh , lifts this film to 'A' status but in fact this is a 'B' picture all the way.<br><br>There are plot holes aplenty, cars which are fifteen years out of date, an unusually high body count and police procedures which would give the ACLU, if not the Supreme Court, apoplexy. That said The Enforcer is a lot of fun and a satisfying little picture. Connoisseurs of character actors will have a field day as the picture contains a who's who of heavies and henchmen.<br><br>THE ENFORCER is one of the few noirs with the hyper classic devise of a flashback inside of a flashback. In fact there are three of them. The body of the film is D.A. Humphrey Bogart and cop Roy Roberts reviewing their notes for a case against a murder for hire racket. During the review they recall the arrest Zero Mostel who tells a story about joining the gang of killers. Then they listen to a dying man who tells a story of a failed hit. In another flashback a man who we already know to be dead tells a story of the organizations first hit. There have been more convoluted flashback structures (there are some with flashbacks inside of flashbacks inside of flashbacks) but at least add THE ENFORCER to the list of noirs with flashbacks within flashbacks.<br><br>P.S. Ted de Corsia should either try to stay away from high places or else get a good pair of sneakers- c.f. THE NAKED CITY.","user":"max von meyerling","rank":[31,35]},{"title":"A Neat Little \"How He Gets Caught\" Plot","rating":5,"date":"5 August 2004","review":"This was one of the last twenty films of Bogart's career. Having finally achieved stardom with HIGH SIERRA (also directed by Raoul Walsh) and THE MALTESE FALCON, Bogie (by 1950) was in a position to pick and choose what films he would make. Artistically his peak was probably THE TREASURE OF SIERRA MADRES in 1948, but his Oscar winning film, THE African QUEEN, was in 1951, and he still had IN A LONELY PLACE and THE CAINE MUTINY in his future.<br><br>Here he returns to Walsh as his director, and leads a bunch of fellow character actors in a nice example of the thriller that is based on the error that undoes the evil criminal - an inverted detective story device that is best seen today in the television series of COLUMBO. <br><br>It is a first rate bunch of character players, led by a superb quartet of evil: Everett Sloan, Ted de Corsia, Jack Lambert, and Bob Steele. Sloan played villains before (he is that nasty customer, Arthur Bannister the great attorney, in Orson Welles's THE LADY FROM SHANGHAI), but his performance shows what he could achieve with so little. He only appears in two scenes in the film (one when he invents \"Murder, Inc.\" before de Corsia's astounded eyes; the other when he is alternately arrogant and panic-stricken in the prison cell he resides in). A normal looking, even dapper little man, he is a human monster. De Corsia is wonderful as the \"Abe Reles\" character, whose fear of Sloan/\"Mendoza\" leads to his death (historically, Reles probably was thrown out of the window of his hotel by policemen who were bribed to do so, although they tied a set of sheets together to make it look like Reles was killed in a stupid attempt at escaping). Listen to the way he describes the unfortunate Tony Vetto, the cab driver who witnessed Mendoza's first murder, by describing his face - a combination of disgust and dismissal in the description as de Corsia reads the line. Lambert is a forgotten character actor, who played many hoods in his films (he could, like De Corsia and Steele, look threatening very easily). But he usually has above-average intelligence(watch him in THE KILLERS - he's the first of Albert Dekker's gang who figures out that the double cross may not be from Burt Lancaster). Here he tries to keep incarcerated as protection from Sloan and De Corsia, only to find he has to cooperate with Bogart to be safely imprisoned. Steele was a cowboy film star, but he appeared with Bogie twice as sadistic gunmen. Here he is Herman, one of the torpedoes of Mendoza's gang. But Herman could be a cousin of \"Canino\", the creep who works for Eddie Geiger in THE BIG SLEEP, and who poisons a (for once) poignantly tragic Elisha Cook Jr. Steele was a good actor, but most people who don't recall his heyday as a cowboy star remember him only as the garrulous Sergeant Duffy in television's \"F-TROOP\" (\"There I was at the Alamo with Davy Crockett...\").<br><br>The most interesting casting of all is Zero Mostel, as Babe, the hapless, fat thug who gets in over his head (but does survive, for all that). Mostel was in several good films in the early 1950s (PANIC IN THE CITY, with Richard Widmark, Jack Palance, and Paul Douglas is another example). He even was in two films with Bogart (this one and SIROCCO, where he played a slightly more evil character). But the black list ended his budding movie career, and forced him into nightclub work, and back to the legitimate theater - to ULYSSES IN NIGHTOWN, RHINOCEROS, A FUNNY THING HAPPENED ON THE WAY TO THE FORUM, and FIDDLER ON THE ROOF. He ended being one of the great stars of Broadway history, with two first rate performances captured on film: FUNNY THING HAPPENED.... (as Pseudolus), and THE PRODUCERS (as Max Bialystok). One can regret the unfairness of the blacklist, and the lost film performances, but then he might have remained a character actor in supporting parts, and not become a star. It is a point for all of us to think about.","user":"theowinthrop","rank":[21,28]},{"title":"Playing to packed houses in Paris","rating":9,"date":"2 March 2003","review":"The Enforcer, whose French title is La femme à abattre, plays often to packed houses in Paris.  More than one French critic has called the film a gem (un joyau) among film noir classics.  Indeed, its popularity in France says lots about pure  plot lines and straightforward characterizations which make the film accessible to non-English-speaking audiences. As many readers know, the French are crazy about American film noir, and it's common to see parents bring their children to see movies like The Enforcer.  I recently sat next to such a family when the film played in March 2003 at the Grand Action cinéma in Paris.  It was almost moving to hear the father explain to his son that they would be seeing a film which, in his words, is a classic with great insights in the American psyche. Hearing them speak made me wonder how many American families use films of decades past to teach their children about the world in which we live.<br><br>By the way, the three cinémas in the Action chain in Paris regularly play American films noirs and other classic American movies, many of them in newly restored versions.<br><br>Don Ediger","user":"Don Ediger","rank":[30,42]}]