[{"title":"Good Film Noir With Fine Cast, Complicated Plot","rating":15,"date":"15 May 2001","review":"\"The Big Clock\" takes some chances with unusual characters, and with complicated and sometimes outlandish plot developments, but it holds together well to produce a generally satisfying, and always interesting, suspense film.  A fine cast makes us both believe in and identify with the characters, and good direction by John Farrow keeps the film moving, and blends together what otherwise could have been a lot of incongruous plot devices.<br><br>Ray Milland is a vital part of the film's success in his role as George Stroud, the editor of a crime magazine who has an amazing talent for tracking down elusive criminals.  Already caught in a conflict between his neglected wife and his domineering employer, Stroud finds himself asked to direct a search for an unknown murderer in a case where, because of a chain of circumstantial evidence, all the clues point back to himself.  What the audience knows, but Stroud does not, is that the real killer is his boss, played with panache by Charles Laughton, who is obsessed with time and whose proudest creation is a gigantic clock that dominates the publishing house that he runs.  The title refers literally to this clock, and perhaps metaphorically refers to the urgency faced by Milland's character as he fights against time trying to extricate himself from his troubles. Milland nicely underplays all of this, and communicates his dilemmas with a lot of credibility.<br><br>The supporting cast is an important part of the film, as they must bring life and credibility to a series of oddball plot elements, and they are all quite good.  Especially noteworthy is Elsa Lanchester's performance as an eccentric artist whose paintings become one of the clues to the crime. Lanchester is simply wonderful in her scenes, and the movie would be worth watching over again for those alone.<br><br>\"The Big Clock\" is a good example of a \"film noir\", and will be most enjoyed by those who are fans of the way films of the genre were made in their heyday.  But it would also be a good choice for anyone who likes crime/mystery stories and who is willing to look at the way such films were made in an earlier era.  After watching \"The Big Clock\", you might want to see more of them.","user":"Snow Leopard","rank":[52,56]},{"title":"This is one to watch!","rating":9,"date":"3 October 2002","review":"Exceptional crime/suspense yarn has Milland as a crime reporter who's accidentally made himself the fall guy for a murder committed by his editor! Laughton plays the manipulative newsman with all his smarmy prowess.  The direction is good, pacing tight, photography excellent.  The supporting cast is also excellent and well directed -- particularly memorable are Elsa Lanchester as a small-time artist whose paintings provide witness to the murderer, and Harry Morgan as (believe it or not) the big boss' muscle. Macready also pitches in as Laughton's right hand man who nonetheless refuses to take the fall for the boss himself.  Very nice continuity of theme of time, great atmosphere.  One of the best of its kind.","user":"funkyfry","rank":[52,61]},{"title":"Terrific","rating":8,"date":"29 January 2009","review":"Remade in 1987 as \"No Way Out,\" the 1948 film \"The Big Clock\" is a wonderful suspense film starring Charles Laughton, Ray Milland, George MacCready, and Maureen O'Sullivan, directed by O'Sullivan's husband, John Farrow.<br><br>Earl Janoth (Laughton), the owner of a publishing empire, is a quiet, enigmatic tyrant who loves clocks and has them all over his buildings throughout the country, including a big one in the lobby of his New York building. The clocks everywhere run together on naval observatory time. <br><br>Janoth's right-hand man, Steve Hagen (MacCready) does his dirty work for him. When Janoth kills his mistress (Rita Johnson), Hagen cleans up the mess. Janoth is sure he saw someone in the hall when he arrived at his girlfriend's apartment, and feeling that the man can identify him, wants him found and eliminated. He orders his executives to get the man, telling them the person they want is involved in a war contract scheme. One man, George Stroud (Ray Milland), who is heading up the investigation, isn't fooled. He knows that he is the man Janoth is looking for -- and why.<br><br>\"The Big Clock\" is a great cat and mouse story, with Stroud ducking people who saw him in various places with the mistress on the night she was killed. He also attempts to leave the building to find a cab driver when someone who can identify him is standing at the exit with security people.<br><br>Milland does an excellent job of being both cool and panicky, and Laughton's underplaying makes the character of Janoth all the more deadly. Maureen O'Sullivan is delightful as the long-suffering Mrs. Stroud, who's never had a honeymoon because of her husband's work. Elsa Lanchester is hilarious as an artist whose painting figures into the story.<br><br>My only complaint is that the ending is a tiny bit abrupt, though very amusing.<br><br>A really wonderful film for suspense-lovers, Hitchcock-like, and highly entertaining.","user":"blanche-2","rank":[31,35]}]