[{"title":"clichéd, but still under valued slasher.","rating":7,"date":"8 September 2005","review":"One of the Halloween follow-ups that would give Jamie Lee Curtis the title of \"scream queen\".<br><br>Children accidentally cause the death of a little girl, now years later they are in high school and getting ready for the prom. However, it seems someone else is planning on getting some murderous revenge on prom night.<br><br>Prom Night is a formula slasher film, with plenty of the slasher trappings, but there are some elements that raise this film above some of the others of it kind. The director gives this movie a truly dark and eerie atmosphere, with the help of Paul Zaza's spooky music score. The plot remains engaging throughout and the creep-factor is kept high. One difference from the slasher \"norms\" is the fact that we ultimately have sympathy and even sorrow for the film's killer.<br><br>While Prom Night is hardly a flawless movie, in fact there are a few scenes where the lighting is way too low and the disco prom dates the film, it does hold it's own. The cast gives good performances, especially Curtis, Eddie Benton, and the late Casey Stevens. There's also a few good rock numbers like \"Prom Night\" and the mellow \"Fade to Black\".<br><br>Worth a look for slasher fans.<br><br>*** out of ****","user":"Nightman85","rank":[30,39]},{"title":"Killer moves on the dance floor.","rating":5,"date":"28 August 2007","review":"Six years ago four kids make a pack to keep a secret, which involved the mysterious death of child Robin Hammond. They thought that were the only ones who knew what had happened, but some else witnessed it to. Now that person strings them along, to eventually plan their revenge during Prom night.<br><br>A real thank-you to the commercial success of \"Halloween (1977)\" and \"Friday the 13th (1980), which saw the influx of slasher films and \"Prom Night\" was one of the first to step up. Too bad that we have here is an unspectacular so-so, if slick looking slasher effort that got caught labouring along with very little happening and providing us with corny school melodramatics. When it came to the crunch, most of the Prom Night sequences was about getting the groove on and listening to funky dory disco soundtrack. Oh it just makes you want to bogey; well it didn't stop Jamie Lee Curtis from strutting her stuff. However when it came to the good stuff, I thought the novel deaths were soundly executed, and there's a certain unpleasantness about them. When the black hooded killer (who's quite fast on their feet and would make for a good shaker too) is tormenting and stalking the victims (from be it to the phone calls or hanging about in the shadowy corridors) there's an ominous air to proceedings, which director Paul Lynch pulls off rather well. It's just too bad that most of the time is used setting this all up with ineffective red herrings and below par, drawn out script. Too many loose ends creep in, even though the premise is quite slight and you can find yourself laughing at its unintentional goofiness and picking up on it predictability. <br><br>Robert New's stunningly vivid camera movements are atmospherically airy and Paul Zaza and Carl Zittrer's sorrowfully twisted musical score gets it cues right. The performances from the cast are acceptable with a likable Jamie Lee Curtis (earning her scream queen tag at the time) proves herself as an upcoming talent. Weak character, but well judged performance. Leslie Nielsen looks awkwardly distracted, and seems to duck off in a phone-in performance and George Touliatos gives the film some solidarity. Anne-Marie Martin is a delight as the scheming sexpot Wendy, David Mucci is perfect as the boorish brute Lou and Casey Stevens is modest as Curtis' prom date Nick.<br><br>This post-Halloween slasher is familiar and slowly plotted, but its competent technical handling helps.","user":"lost-in-limbo","rank":[19,24]},{"title":"Prom Night","rating":5,"date":"14 June 2008","review":"A young girl dies tragically when she falls through the window of an abandoned building upper floor as a result of a scare tactic prank performed by four kids playing a hide-n-seek version of \"I'm going to kill you.\" The kids responsible make a silent pact to keep their actions behind this death secret, with a schizophrenic known child abuser accused of being the guilty culprit responsible. The wrongfully accused man is seriously burned after trying to flee the police with his car turned over in a crash. Breaking free from the asylum imprisoning him, this event coincides with the four kids, now teenagers in high school, receiving creepy phone calls from an unknown psychopath forewarning their up coming meeting at the senior prom. The film shows the days leading up to the senior prom, and the psycho, dressed in black with a ski-mask covering his face, attacking each member of the group responsible(..when they are most vulnerable, away from a crowd of people, alone in some place either inside the quiet abandoned halls &amp; rooms of the school, or just outside the building) for the little girl's death many years ago, on Prom Night.<br><br>More along the line of \"Halloween\" than \"Friday the 13th\", this is a methodical(..some might say..slowwwwwwwww moving)character driven slasher with limited death sequences shown, with most of the killer's murderous activities occurring off screen. I will say that the victims are developed, given exposition before the senior prom so that they gain sympathy from the audience. The only one who might deserve her comeuppance in many viewer's eyes is Wendy(Anne-Marie Martin), the very one who instigated the silence of their misdeeds as children, and the one who causes most of the mischief towards Kim(Jamie Lee Curtis), who is dating her former squeeze, Nick(Casey Stevens). What makes this union most interesting is that Kim's sister was the girl who fell through the window to her death, and Nick was one of the kids responsible for frightening her with that game. We witness the other two girls, now young women either experiencing love for the first time or heartbreak, before meeting their doom at the hands of the mysterious psycho. As is the case in giallo thrillers, which this is closer in spirit than 80's slashers, there are red herrings regarding who the killer might be. Could the psycho be the escaped lunatic seeking revenge for being framed for a murder he didn't commit? Could the killer be Kim's grieving father, Principal Hammond(Leslie Nielsen, handed a very underwritten role)? Could the killer be the peeping tom, alcoholic, sneaky janitor? I'm just not convinced this will work for many slasher fans because the seedy, gratuitous elements which draw such a crowd are not that present here.<br><br>Like a lot of fans of \"Halloween\" from their youth onward, I followed Jamie Lee Curtis' career, looking for other horror films on VHS shelves, and \"Prom Night\" was one of those. Expecting something more visceral, I guess I was a tad bit disappointed. Watching it as an adult, I believe I can see what director Paul Lynch was trying to accomplish..building up these characters looking forward to the future, or dwelling on their own personal dramas and dilemmas(..relationships and growing pains, these teens had in high school), before facing a grim fate they weren't prepared for. He also lenses the film, very soft-focus, giving it an almost dreamlike aura. One of a handful of slashers Curtis would star in during the early 80's before moving on to \"Trading Places\" where she'd hone her comedic chops, she was blossoming into a stunning woman. While I loathe disco with a passion, this film might amuse as a time-capsule film with how Curtis shows her stuff on the dance floor. She even teases her faithful with a lockeroom sequence showing how she has developed wearing a bra, shirt opened. As far as the death sequences, the highlight, of course, is the decapitation where a thug, taking Nick's place after he and his cronies attacked him, tying the kid up in a situation planned by Wendy, gets his head lopped off with it rolling onto the dance-floor walkway. The film's main suspense chase concerns Wendy trying to flee her pursuer through the empty halls of the school as the other teens are dancing. The film's reveal of the killer is really kind of sad, actually, as so many perish because of a childish prank which could've been prevented if the kids responsible had acted civilized.","user":"Scarecrow-88","rank":[9,11]}]