[{"title":"Another Amazing Racehorse","rating":9,"date":"20 December 2005","review":"A good horse racing story - especially if it's based on real life -  usually gets my attention and this is no exception. Phar Lap was a  famous New Zealand race horse. This was another Seabiscuit-type horse  who overcame big odds to achieve greatness. He just never got much  press outside of New Zealand, I guess.  Rob Leibman, as the generally unlikable guy in the film (who does have  a few good moments, to be fair) is the most interesting actor in here.  However, the star of the movie, outside of the horse, is Tom Burlinson,  the best friend Phar Lap ever had and the only likable male in the  film.  The story never lagged and was beautifully shot. I am still waiting for  a DVD of this and hopefully it will be made. It deserves having one and  I was hoping it would ride the coattails of the Seabiscuit publicity  tail, but apparently not.  In summary, a nice story of a horse who triumphs despite a greedy  trainer and owner who overwork the animal....at least according to the  movie. Yeah, I realize there is a good chance much of this was  exaggerated. The film industry tends to fictionalize these \"true\"  stories. Whatever the case, this is a great story.","user":"ccthemovieman-1","rank":[15,16]},{"title":"Before there was Seabiscuit there was Phar Lap","rating":10,"date":"20 October 2003","review":"*****SPOILERS***** True story about the New Zealand wounder horse that nobody wanted at first and that almost no horse could beat in the end. <br><br>Phar Lap ran up a string of victories from Australia to the United States that astounded the racing world then and even now it's hard to believe that such a race horse ever existed, he was just that good. like the saying goes: \"It too good to be true\" but it is. Winning 37 out of 51 races in his racing career with 14 wins in a row between 1930-1931 the only thing that could beat Phar Lap was the crushing weight that local handicappers put on his back to give the other horses racing against him a chance. <br><br>In Phar Lap's last race in 1932 he traveled to the United States to race against the best racehorses in the world at the Agua Caliente race track on the Mexican border. It was there for the first time in his life Par Lap raced on dirt not grass where he ran on in all his races and not only won but broke the track and world record for a mile and a quarter doing it. Tragically a month later Phar Lap collapsed and died in his stable. <br><br>Moving as well as exciting film about the great Phar Lap with Tom Burlinson excellent as Tommy Woodcock, the young stable boy who was the only one who had any faith in the horses ability and brought the best out of Phar Lap when everyone else gave up on him. With top performances from Ron Leibman and Martin Vaughan as Phar Lap's owner and trainer who over the years with him began to see Phar Lap not as a racehorse but almost human.<br><br>One of the most stirring finals you'll ever see in any movie with Phar Lap beating the best there is in the world of horse racing in the Mexican desert at the Agua Caliente race track racing with an injured hoof and carrying a high weight of 129 pounds. Later after the race when Phar lap breaks down and dies the shock and heart felt loss, especially by young Tommy Woodcock, was one of the most touching and moving scenes I've ever seen in any film. You can really see what that horse meant to everyone who had the privilege to be involved with him. Great movie, but what makes it even greater is that the story is unbelievably true.<br><br>P.S One more thing about the movie, the part of Phar Lap was played by a horse named Towering Inferno.","user":"sol-kay","rank":[12,14]},{"title":"TRULY REMARKABLE FILM...WILL MAKE YOU A HORSE LOVER OUT OF YOU!!!","rating":10,"date":"12 April 2000","review":"This is a fantastic movie! The best part about it is that it's based on the true story of a horse named Phar Lap, which means lightning in Chinese. This story tells you about the life of this horse, who was laughed at as a yearling, because of his skinny and scraggly appearance and ugly head and his inability to really \"move\". He was purchased to be a racehorse, and he was from good bloodlines, but he was bought for a mere pittance compared to what a typically good horse would cost. His trainer Harry Telford was about to give up on him and sell him at the owners request, an American named Dave Davis . Harry's assistant and strapper, Tommy Woodcock, begged for them to give HIM a chance with the horse. He had developed a strong bond with Phar Lap and really was attached to him. Given a chance with the horse, Tommy would show them all, as he took over the training. He worked the horse gently and steadfastly. The horse soon grew into a massive, muscular and handsome horse, worthy of anyone's attention. Phar Lap loved Tommy so much that he would do anything Tommy put forward for him to do. He started training and running at lighting speed and before long and was taken to the tracks to race against the two top horses in Australia.....where he won by a landslide! He raced and won the Melbourne Cup as well as many other famous races. He lived only 3 short years but won 30 races in that period. He ran against the best, and had many fans but many foes as well, since he was the fastest horse around. There were threats placed on his life if he were to continue racing. This is how awesome this horse was. He had intimidated the world of racing with his ability to out race all others, even with the heavy handicaps they tried to bring him down with. He proved to be unbeatable, even with the record breaking weight the Australian Horse Racing Association made him run with. He was so good that he was interfering with the odds at the races as no one could beat him. This did not make the bookmakers happy. He mysteriously died after a Huge race in America called the \"Agua Caliente\". He became one of the worlds most famous horses of all time. If you love horses, or you even like them a little, then see this movie and it will change your perspective on horses forever! TWO THUMBS UP, AAA+, and 5 STARS!","user":"chmozart","rank":[9,10]}]