[{"title":"Excellent Short - Plenty of Good Slapstick, & Much More","rating":20,"date":"20 August 2001","review":"\"Behind the Screen\" is an excellent Charlie Chaplin short feature, with plenty of good slapstick and much more.  The setting, with Charlie working as a hired hand in a movie-making operation, lends itself to a lot of good comedy, and there are plenty of standard gags plus a lot of material that creatively uses the props and situations of the setting.  It also works very well as a self-satire of the industry (as suggested by the title), making some subtle and other not so subtle points.  Finally, there is some nice interplay between Charlie's character and his superiors, especially his burly, brutish immediate supervisor, played by Eric Campbell, an amusing actor who was one of Chaplin's best supporting players.<br><br>Most of these earlier Chaplin films (referring to 1914-1916, the years when he made the majority of his short features, making ten or more each year) do not get very high ratings.  It's true that some of them are mostly routine slapstick, but there are also a few gems like this one that combine slapstick with substance.  Most of the movies from these years can be rather hard to watch, because the film often survives in poor condition, and so it's understandable that even the best ones might not always stand out as clearly from the rest.  But this one is a fine film, and definitely recommended for Chaplin fans.","user":"Snow Leopard","rank":[9,10]},{"title":"\"Dressing the scene\"","rating":8,"date":"13 February 2010","review":"Charlie Chaplin sometimes repeated himself when it came to ideas for his comedy shorts, but only when his skill and technique had improved significantly in the meantime. Behind the Screen treads similar ground to Dough and Dynamite (made at Keystone) and His New Job (made at Essanay), being a comical expose on the film-making process itself, but it demonstrates all the development his style had made since those older pictures.<br><br>One major difference is the audacity and satiric bite of Chaplin's comedy by this point. Unlike the earlier examples, Behind the Screen bases most of its jokes on the artificiality of cinema, with \"marble\" pillars being shifted by hand, an \"invisible\" trapdoor that causes mayhem, and eventually the dramatic department having its dignity invaded by errant custard pies from a comedy set. He also has a sly dig at pompous directors and lazy stagehands. All this from an era before the majority of people in the audience wouldn't have really known exactly what went on behind the cameras. Still there is enough broad slapstick here to entertain the viewers who don't get the in-jokes.<br><br>Chaplin's management of the comedy is also now incredibly refined and to-the-point. In the earliest scenes, he shows how he can make himself the centre of attention without necessarily being in the foreground. Whilst everyone else on the set stays fairly still, Charlie bustles about all over the place leaving chaos in his wake. It's funnier this way because we see the little tramp upsetting the order of his environment.<br><br>The comedian had by now also accumulated a regular crew of supporting players – comic actors who were more buffoonish and ridiculous than funny in their own right, thus providing suitable antagonists for the little tramp. Eric Campbell is as usual the burly bully – the tyrant of a small pond who it is satisfying to see knocked down. Henry Bergman, in only his second of what would be many appearances with Chaplin is the perfect awkward fat man. He must have been a real find, and Charlie seems to take every opportunity to knock him down to get that undignified and helpless flailing of arms and legs that Bergman was the master of. And of course he now has Edna Purviance – by now often the only one allowed to be a completely straight actress. Her features are too feminine to be a convincing tomboy, but at least she gets the chance to be involved in some of the comedic action this time round.<br><br>Which leaves me only to give out the all-important statistic – <br><br>Number of kicks up the arse: 7 (5 for, 2 against)","user":"Steffi_P","rank":[8,9]},{"title":"pretty good Chaplin effort","rating":8,"date":"6 July 2006","review":"In 1914 and early 1915, Chaplin did his first comedy shorts. In general, they were pretty awful--with almost no plot and consisting of him mugging it up on camera and hitting people. However, in 1915 he left Keystone Studio and began making better films with Essenay (though there are some exceptions) and finally, in 1916, to Mutual where he made his best comedy shorts. These newer films had more plot and laughs and usually didn't relay on punching or kicking when they ran out of story ideas.<br><br>This film is one of these later Mutual Films and has a pretty decent amount of plot. Charlie is a carpenter's assistant on a movie set and his boss mostly sits around doing nothing--making Charlie do all the work. Later, the crew goes on strike and Charlie gets to act (although in real life, Chaplin's sympathies would have definitely been with the workers). In addition, a lady sneaks onto the set and disguises herself as a male laborer. Charlie realizes this and falls for her, though everyone else thinks she's a guy. I particularly liked the scene where Charlie is making out with the lady and really smooching it up good--and his boss looks on with horror! Overall, this is a pretty typical Mutual film--neither better or worse than the average one and worth a look if you get the opportunity.<br><br>An interesting scene was the one where Charlie picks up the MANY chairs and then the prop piano. This exact same scene was replicated by Syd Chaplin (Charlie's half-brother) years later in THE BETTER 'OLE.","user":"MartinHafer","rank":[7,8]}]