[{"title":"Dark, disturbing and essential","rating":8,"date":"16 November 2013","review":"Digging the pile of low budget horror, I happened to find this piece of pure gold that shines even today. I knew Fred Olen Ray for an actor but with this one, Ray totally grabbed me in. I now salute him for his directorial abilities that gave us this masterpiece. The year is 1983 and like many others who praise the glory of the golden age of untamed slashers, most precisely the early 80s, I am going to sing my praises for 'Scalps'. Despite being a B flick, 'Scalps' is heavy on atmosphere and gore. The atmosphere is creepy and the nostalgic tune that plays during the run time is fairly engaging and makes one feel desolate. It goes along seamlessly with the striking visuals of the desert. People will say that deserts offer no scope for the urban horror where we usually have a killer who wears a mean nifty hat, muffler and a drenched raincoat, murdering the hapless victims to secure their body parts as the trophies of victory. NO! This one is surely different and a twist of supernatural combined with some good locations and a fully functional storyline make 'Scalps' unique among the other entries. The director drags us to the desert locale and shows the enormous amount of horror that is trapped there. Analyze 'Scalps' in the light of Wes Craven's classic 'The Hills Have Eyes' or Alexander Aja's remake of the same film, and you'll certainly understand my point. Deserts are cruel locations and those who have been pampered in the cities will have to learn to live again from the very scratch. Well here our actors aren't just freaked out by the tortures of nature, there is 'something' very strange in the air that's manipulating some of them to murder others and that 'something' doesn't just cease to exist as it has remained there for more than a century.<br><br>'Scalps' begins with an old man with a shovel heading towards the Californian desert. Perhaps a gold digger, the old man falls prey to a possessed Indian artifact that somehow kills him. Now there is a team of 6 archaeologists. They decide to go to the Californian wasteland to dig up a few Indian artifacts. The project guide and museum curator Professor Machen (Kirk Alyn) is assigned a task to submit the inventory of historical artifacts he has in his museum and fails to join the others. As the Californian law prohibits the archaeologists to dig anything from an ancient Indian burial ground (aboriginal heritage), Machen asks the team members to dig the area secretively without letting anyone know. He also advises them to tell others that they are officially going on a field trip. Now a nostalgic and disturbing tune begins to play as we find the team members looking out at the silent dark brown hills that hold a sinister enigma within. We come across some striking visuals from the desert. The wasteland is vast and spooky, the hills seem to be looking at the unfortunate victims-to-be and the vegetation speaks a lot about its lowly and mean nature that doesn't have anything to offer to the detoured individuals. The members embark onto their journey and finally reach near the burial ground. One of the team members DJ (Jo-Ann Robinson) receives a psychic vision and tells her mates that they are in great danger. She tells them that they are in the domain of Black Claw, the infamous native Indian black magician who was buried there a century ago. She further tells that by digging the burial grounds, the team has earned the wrath and curse of Black Claw. Unable to deduce her visions, the others take her for a daydreamer. Unfortunately the mystery deepens for everyone when they hear drums playing several feet under the ground. They also hear tribal ceremonial music and vocals. A team member Randy (Richard Hench) along with his girlfriend decides to find the source of music and gets closer to the burial ground where he and his girlfriend witness a ceremonial fire that has no heat. The ceremonial fire belongs to the Black Claw, who possesses Randy. Randy goes on a killing spree and begins to murder the other team members with neolithic tools. How the others race against time to save their necks forms the rest of the story.<br><br>'Scalps' has ample gore and a few squirmy murder scenes, so it may be a fortune cookie for the gore freaks. The murder scenes are disturbing and dark. Some of the scenes are shot in dark but that's the point Ray wants to make. They couldn't have brought the dark and abysmal side of the desert (both natural and supernatural) so brilliantly If they had used artificial lighting. 'Scalps' is interesting and has some amount of hypnotic quality as well. 'Scalps' has a genuinely creepy and hypnotic score that will live with you for a very long time. Also the tribal music that plays near the burial ground is hypnotic. The visuals are such that they would throw you in the early 80s and you'll be forced to recall those olden days when things used to be so raw, natural and wild. The only drawback here is the editing. Viewers may find it difficult to understand why the day randomly switches to morning, evening and night. Overall 'Scalps' has a strong message behind it. It simply negates the concept of 'The White Man's Burden' showing that there is still something far more advanced than the White Men or the civilized world has ever witnessed. 'Scalps' has impressed me every time I have watched it, so I give it 8/10 for the horror, gore, atmosphere, dark humor and plot.","user":"shuklavinash","rank":[9,9]},{"title":"Perhaps Fred Olen Ray's best film?","rating":8,"date":"4 August 2008","review":"\"Scalps\" is a bloody Native American slasher with a nice supernatural angle.Six archeology students head to the desert to search for Native American artifacts.Despite the warnings of DJ,the students disturb the ancient Indian burial ground and unleash the vengeful spirit of Black Claw.After possessing Randy,Black Claw hunts down the others with an arsenal of stone-age weapons.Despite its crude cinematography and editing \"Scalps\" is an overlooked slasher with some nasty bits of gore.The throat slashing and scalping sequence truly made me squirm in my seat.A combination of desert landscapes and sinister soundtrack gives \"Scalps\" a raw and nihilistic atmosphere of fear and despair.Unofficial sequel \"Demon Warrior\" was made in 1988.","user":"HumanoidOfFlesh","rank":[12,14]},{"title":"Must See Horror","rating":7,"date":"7 September 2003","review":"This movie does have some lighting problems and editing probs, but it is still a great horror movie. Anyone that is a true genre fan should see this movie. It really does have a nice creepy atmosphere and who cares if the make up and effects aren't up to Hollywood standards, this is true 80's horror. The acting is great, the music is great, there is some great gore scenes and a very convincing rape scene. I dont know why this movie has such a low rating, this movie is definately worth the price of the rental and the time to watch it. SEEK IT OUT!!!!!!!!","user":"D_R_A_C_U_L_A1","rank":[19,24]}]