[{"title":"Enjoyable comedy with lots of great scenes.","rating":1,"date":"1 April 2000","review":"Oliver Reed plays an ugly (almost monster like) foot doctor who turns into a handsome from a formula created by a fellow scientist (mel welles), but with violent reaction.  Lots of funny moments and well-written film that should've been a cult classic.  Lots of great supporting stars (which features most of the cast from Griffith's UP FROM THE DEPTH and LITTLE SHOP OF HORRORS), but character actor Dick Miller steals the scenes as a garbage man who talks to himself (Miller told me Jonathan Haze was supposed to be the other garbage man, but couldn't do it, so Dick had to play other roles like a schizo!).  I was surprised Reed did this film at the time, and he did a performance that most people would've never thought he could do.  Maybe if this film was released bigger, more people would've saw Reed can do comedy. Recommended.","user":"Serpent-5","rank":[15,19]},{"title":"Fabulous movie, misunderstood by most dunderheads. Way ahead of its time.","rating":9,"date":"4 February 2005","review":"I'm amazed that this movie was ever made and NOT surprised that it wasn't made my any of the big studios -- they're simply too stupid to understand or appreciate it. Everything about this film defies convention, in a smart, funny and effective way. The people who disapprove of this movie are likely the very people whom it is satirizing. The editing, directing, acting and sound editing are marvelous and refreshing. The dialogue is wonderfully acerbic and sarcastic. I only wish I could find in on DVD. As is, the only copy I have is a VHS taped from commercial TV. If you get the chance to to see it, by all means do. It's a rare pleasure.<br><br>UPDATE: Thanks to modern technology, I have now burned my VHS copy to DVD for preservation. As of February, 2006, the film is STILL NOT AVAILABLE anywhere. The viewer who wrote that he saw it on late night TV with Elvira is correct -- that's the copy of the screening I have, complete with her interspersed comments (and cleavage).","user":"rob-901","rank":[21,31]},{"title":"unexpectedly sweet","rating":8,"date":"19 July 2012","review":"it's obviously not supposed to be \"great\" movie, but for the hilarious horror/comedy it is, one would take this as it is. a breath of fresh air for the over bloated 70s/80s horror movie market. it doesn't make a lot of sense, but it shouldn't have to. viewing this ridiculous movie for what it is, it is a beautiful depiction of a shitty movie made enjoyable through writing and acting. oliver reed does a magnificent job playing both lead roles, even while switching between the two. looking for a well written movie with unexpected plot twists, it is obviously not going to rate very well. it was 1980, why would you make a super deep movie with every opportunity for criticism? while writing this i would obviously assume it's not to be under the scrutiny of every movie buff this side of the Mississippi. take it for what it is, a ridiculous horror movie with a brand new twist on the old, often retold, story of the doctor that creates more than what he meant to create. great for what it is, and hardly a moment wasted. 8 thumbs up.","user":"cknudsen1988","rank":[5,6]}]