[{"title":"Not a great movie, but a very charming and likable one.","rating":1,"date":"1 June 2003","review":"Rating: ** 1/2 out of ****<br><br>I happened to come across Just one of the Guys on TV the other day, and with absolutely nothing else to do that day, I decided, what the heck, why not just give this 80's teen sex farce a shot. At any rate, it was bound to be better than Porky's and I might even get a few cheap laughs in the process. To my surprise, Just One of the Guys turned out to be one of the better teen comedies I've seen in a while, thanks in no small part to Joyce Hyser.<br><br>The premise is gimmicky. Basically, hottie teen Terry (Joyce Hyser) decides to dress up like a guy in order to prove she could get her previously rejected article published if she were a man. Well, she ends up befriending a loner named Rick (the underrated Clayton Rohner, who was so funny in April Fool's Day), but does so while in drag. She thinks it's up to her to help him out by getting him a date for the prom, but whatta you know, she starts to fall for him and the rest can't be hard to guess from there.<br><br>Okay, I realize I just made this movie sound pretty bad, but if you actually give it a shot, you might find it rather enjoyable. Surprisingly enough, there's not that much nudity to speak of (mostly male, though, thankfully, Hyser does give us a quick shot of her breasts) and the humor isn't half as smutty as I'd expected. Rather, the humor we're given is Terry's balancing act between her \"old\" self and this new identity she's created. Not all of the jokes work, but there are plenty of inspired moments that keep the momentum going. Take, for instance, the girl (Sherilyn Fenn) who has a crush on Terry; what could have been a set-up for a cruel and tasteless gross-out is given a little weight, and the way this subplot is resolved is satisfying and actually even a little sweet.<br><br>The film prefers to use its premise not for gross-out gags, but to build a cute love story, and yeah, it does a pretty good job at that. Hyser and Rohner have appealing chemistry, though it's Hyser who gets the lion's share of the work. Having to balance between playing a very pretty girl and a convincing male teen isn't easy, but she pulls it off with flying colors.<br><br>Obviously, the film is going to end with Rick discovering Terry's real identity. That scene is handled rather well, but I found the epilogue a little too abrupt to be entirely satisfying. I found myself caring a lot about these characters; would have been nice to know where they ended up from there.<br><br>But enough with the quibbles. Sure, Just One of the Guys isn't a great movie, not by a long shot, but it takes the time to make us care about the characters and their dilemmas, and while the lack of potty humor might not make it as gut-bustingly hilarious (if potty humor is your preference, that is) as some of today's offerings, the fact that the movie touched me made it superior to just about any other teen comedy I've seen in a long time.","user":"Li-1","rank":[28,31]},{"title":"One of my favs of the '80s","rating":9,"date":"9 January 2001","review":"I got this movie at a rental store in 1985. It had already been out and I guess didn't do well so it went straight to video. We asked the guy at the counter what was a good movie to see. He recommended this one. Good choice. I must have seen it about 25 times now.<br><br>It's a cute movie about a girl who thinks she's a hot shot school reporter but she gets shot down during a school contest. Winner of the contest gets to work at a real paper during the summer. So she gets in drag(?) as a boy and goes to another school to resubmit it there. Still doesn't get accepted. So the teacher tells her to think of another story with an interesting angle. This is how she turns her future experences as a boy at that new school into \"I was a teenage boy for eight weeks\"!<br><br>This has old stars and new ones in it. Old being Leigh McCloskey from \"Dallas\" (as the boyfriend) and Toni Hudson of \"Cross Creek\" and \"Places In the Heart\" (as the girlfriend). The new stars are Arye Gross from TV's \"Ellen\" (as one of the geeks), William Zabka of the \"Karate Kid\" (as the bully), and Sherilyn Fenn of Twin Peaks (as girl who wants the new kid).<br><br>\nClayton Ruhner is very good in his second ever role. Joyce Hyser is cute and funny as the girl/boy. Though her character is a bit stuckup, she changes her view in at the end. After all, beauty has fallen for the beast, er.. I mean geek. The rest of the cast is good and together makes this movie fun to watch. <br><br>Special mention to Billy Jayne as the horny brother who is so desperate to have sex he will try anything to get it. If you get a chance to see it unedited, do it and I know that you will enjoy this cute look at '80s teenage life. Though I don't remember school being like this.","user":"timmauk","rank":[30,34]},{"title":"\"ALL balls itch - it's a fact!\"","rating":27,"date":"27 March 2003","review":"For some reason that line has stuck with me all these years. Maybe that's because I was watching the movie with my mom when she asked me if that was true...<br><br>Anyway, I loved JUST ONE OF THE GUYS, and still think of it fondly. It's a funny teen movie that doesn't rely on vulgarity for its humor, and I also remember how refreshingly non-homophobic the Rick Morehouse character acted when he thought his new \"male\" friend was developing a crush on him (1985's teen movies were strangely queer-friendly, as evidenced here, in A NIGHTMARE ON ELM STREET 2 and ST. ELMO'S FIRE, and with Stephen Geoffreys starring in FRIGHT NIGHT and FRATERNITY VACATION).  Isn't that odd considering that, in the supposedly more tolerant times of today, there are teen movies like SORORITY BOYS that are more homophobic than those made during the Reagan years?<br><br>And then there's William Zabka, whose character in JUST ONE OF THE GUYS  is one of a trio of supercilious cads he played in the '80's. Some enterprising Gen-X DVD producer should release a box set with this movie, THE KARATE KID and BACK TO SCHOOL; I know I'd buy it to revel in the Legend of Zabka.","user":"FeverDog","rank":[26,30]}]