[{"title":"Fresh corpses don't come by to easily.","rating":7,"date":"1 February 2007","review":"Dr Thomas Rock is an unorthodox anatomist who runs Edinburgh's School of Anatomy in the 1800s. Although his associates of the trade see his work as outrageous, as he discards tradition framework of the medical establishment. To encourage such knowledge and to dig a little deeper into his work Rock receives corpses from grave-robbers to make up for the few he only receives. Things take a turn for the worst when the slum of Robert Fallon and Timothy Broom find out there's good money in the job, and go one step further by providing on every occasion a 'fresh' corpse for the unconcerned doctor. <br><br>I couldn't help but be slightly disappointed by this Mel Brooks produced Gothic take on the true exploits of the infamous grave robbers of the 19th century, Burke and Hare. I believe Val Lewton's \"The Body Snatcher (1945)\" and \"The Flesh and the Fiends (1959)\" to be far superior, especially the way they seem to grab you and take you along for the ride. On this effort, I just couldn't get totally involved. The depressingly glum story was shaped off the late Dylan Thomas' rather old screenplay and is very similar to \"The Flesh and the Fiends\" in plot devices. The cerebrally literate script has plenty layers to work around with and genuinely makes some interesting observations on characters' behavioural habits, social status and the moral high ground of science. With the latter, we've heard it all before, but somewhat it still compels. Although some of sub-plots don't seem to gel and feel rather empty or under written (like the romance between Twiggy and Julian Sands and the affair between Rock's sister and wife). There's a dankly realistic and more an old-fashioned view within its martial and visual craftsmanship. <br><br>Directed Freddie Francis competently illustrates the picture with great aplomb and creates a solid period setting that resembles something out of Hammer studios. There's a nitty gritty vibe drummed up on the grimy sets by such gruesome perversion and dread. Where it lingers on it successfully. The dynamic factor of directing the actors and story seemed a little lacking, despite a suspenseful climax and hearty conclusion. This can be really attributed to John Morris' score, which really hangs there in such an mournfully haunting fashion. Focal photography was atmospherically well-etched by Gerry Turpin and Norman Warwick. Now what a cast! Timothy Dalton, Jonathan Pryce, Julian Sands, Twiggy, Stephen Rea and Patrick Stewart. A convincing Dalton is excellent as the work heavily sterile and egotistical Dr Rock. The undoubtedly superb Pryce and Rea are truly disquieting as the scummy lowlifes turned cold-blooded killers, Fallon and Broom. There's a wicked morbid sense of humour running through most of their dialogues. A classy Sands, is simply too one-note and a tailor made Twiggy is quite strong in her part as a prostitute. <br><br>A hot and cold fable that I only wished it could keep me engaged throughout the whole experience, rather than in patches. Well-made and acted, but bleakly weary and flat.","user":"lost-in-limbo","rank":[10,10]},{"title":"The Doctor is in ... desperate need of fresh corpses!","rating":9,"date":"13 September 2006","review":"Unquestionably one of the most fascinating real-life murder cases in the history of mankind is the story of William Burke and William Hare; suppliers of fresh human cadavers for surgeon Robert Knox to study anatomy upon. The facts took place in the late Victorian era, in other words a strictly religious time where scientists could exclusively dispose of the bodies of executed criminals as study material. The lack of serviceable cadavers spawned the malicious business of \"body snatching\". For a good price, lowlife criminals would dig up newly buried corpses at night and deliver them secretly to the doctors' houses. Obsessed with the payments, which increased remarkably if the bodies were fresher, Burke and Hare quickly converted to murder and, even though Dr. Knox damn well knew about this, he didn't object because the bodies he got were perfect to experiment with. \"The Doctor and the Devils\" is no less than the fifth film version of this factual murder case and, for some damn reason, just as obscure and hard-to-find as the other four. Personally, I spent quite a few years finding Val Lewton's \"The Body Snatcher\" and John Gilling's \"The Flesh and the Fiends\" and I still haven't managed to pick up decent copies of \"Burke &amp; Hare\" (1972) and \"The Greed of William Hart\" (1948). Purchasing \"The Doctor and the Devils\" was quite a difficult mission as well but, if you're also intrigued by the story, it's an absolute must-see! The screenplay was completed by poet Dylan Thomas (in the 1950's already), who changed the names of the characters but sticked truly close to the timing, setting and accurate little details of the murders. The whole depiction of the murderers as well as their victims (prostitutes, beggars, ill people and drunks) is depressing and raw, yet amazingly accurate and even truly disturbing without becoming explicit or gory.<br><br>Despite being mainly an American production (with comedy legend Mel Brooks as the unlikely producer) and released during the flamboyant horror period of the mid-80's, \"The Doctor and the Devils\" truly feels like a good old-fashioned and solid British Gothic movie. Pretty much the type Hammer Studios used to be specialized in. Surely this is no coincidence, given the subject matter and the origin of the facts, but this feeling is also largely created by director Freddie Francis and his overall professional British cast. Francis actually did quite a lot of work for Hammer during the 60's and 70's and has some respectable classics on his repertoire, such as \"The Evil of Frankenstein\" and \"Legend of the Werewolf\". The cast, as mentioned before, is pretty great and that only makes it harder to understand why this film is still so under-appreciated. Timothy Dalton is terrific as the ambitious and stubborn Dr. Thomas Rock, constantly battling his superiors and being zealous for the evolution of his profession. But most praise goes out to Jonathan Pryce and Stephen Rea, both playing their roles of greedy and inhuman killers with amazing vigour. Perhaps a bit sad and redundant is the role of Julian Sands (\"Gothic\", \"Boxing Helena\") as Dr. Rock's assistant. His pointless romance with the local prostitute Twiggy is the only weak element in the movie. Other than this, the set pieces are very convincing, the cinematography is excellent and the music is downright enchanting. \"The Doctor and the Devils\" is a great and genuinely chilling movie that urgently deserves to be catapulted out of oblivion.","user":"Coventry","rank":[18,20]},{"title":"The Doctor and the Devils","rating":8,"date":"30 September 2006","review":"\"Up the alley and down the street Fallon and Broom sell bones and meat. Fallon's a butcher and Broom's a thief. And Rock's the boy that buys the beef.\"<br><br>At the film's closing, Dr. Thomas Rock(Timothy Dalton)proclaims that he has become a ghost story that frightens children and questioned how it had gotten so far.<br><br>A revisionist take on \"The Body Snatcher\"(..a marvelous film produced by Val Lewton), this film has Dalton portraying a scientist whose skills in anatomy are unsurpassed thanks to his intense study of dead bodies. The law prohibits Rock from using fresh corpses for his research so all he has to use are rotted corpses brought in by grave robbers or criminals hung or animals. He soon enlists the aid of graverobbers Fallon and Broom(Jonathan Pryce and Stephen Rea)to bring him fresh bodies for proper research not knowing they are supplying him with victims they murder. Julian Sands plays Dr. Murray, Rock's assistant, who falls in love with a prostitute named Jennie(Twiggy)and discovers when he goes to see her how Broom and Fallon get their corpses so fresh.<br><br>The whole business of delivered bodies provides a special moral dilemma within the story(..which worked quite well in \"The Body Snatcher\"). Also, the film is quite an indictment on the plight of impoverished \"squalor\" who lie slowly dying in the streets and alleyways or drift slowly into the abyss of alcoholism. Director Fisher's camera doesn't shy away from the less fortunate as the film seems to show us first-hand their suffering. Dalton's doctor is actually the sympathetic figure in the film in regards to his recognizing the poverty that his colleagues and peers seem to either ignore or just care not to acknowledge. He honestly desires fresh bodies so that he can make a difference in the advancement of the medical profession moving it from the dark Ages to the 19th Century. It's just unfortunate he has to resort to paying graverobbers for specimens. But, the film does recognize(..like in \"The Body Snatcher\")that Rock knew very well that some of his specimens may've been attained beyond reasonable means. Thomas' sister provides a detrimental problem to the furtherance of his work as she believes his ways are the works of the devil. His wife is also seen as immoral by the sister for she artistically portraits anatomical charts of the human body. Others question Thomas' work as well, specifically Prof. Macklin(Patrick Stewart, whose role and character is underwritten)who wishes for his unusual methods to be grounds for dismissal.<br><br>The major moral crisis, though, comes when a deranged Fallon attempts to murder Jennie and is sought after by Dr. Murray where Rock's illegal researching in accepting bodies murdered might soon be discovered. While he only wishes to advance anatomy to save lives, his accepting murdered bodies is indeed considered immoral and unlawful.<br><br>While the material of the film might seem familiar, considering it just really feels like a remake of \"The Body Snatcher\" and is just difficult not to think of the previous film while watching \"The Doctor and the Devils\", Fisher's marvelous direction makes up for it. Unlike his Hammer years, Fisher doesn't have to hold back. He isn't held down by restrictions and can display the cruel realities of life such as the squalor in the streets as the epidemic it was. The period cinematography feels fresh and completely genuine. It is quite grim and bleak which might put off many with no hope seemingly in sight for many in this film. Fisher keeps the film, for most of the way, on the dreaded streets so that we have a hard time looking away from the truth.","user":"Scarecrow-88","rank":[16,19]}]