[{"title":"EVERYTHING comes wonderfully to life in this dead-on Mel Brooks horror spoof  non-stop laughs from beginning to end!","rating":10,"date":"15 May 2001","review":"Mel Brooks' parodies are like your favorite, worn-out couch.  You know it's not the greatest in style, taste and quality, but it just feels so damn comfortable.  Of late, most of Mel's spoofs have been off the mark, his work mellowing into predictability.  In fact, you really have to go all the way back to 1974 to see Brooks at his sharpest.  In that year we were awarded \"Blazing Saddles\" AND \"Young Frankenstein.\"<br><br>Perhaps \"Young Frankenstein\" is not definitive Mel Brooks, although he directed it.  Gene Wilder, who not only stars but co-wrote it with Mel, was the inspiration to make this movie.  And it's his influence, I think, that brings the best out in Mel.  When spoofing a historical era, movie genre or legendary tale, Brooks' satirical bag of tricks always included a hodgepodge of crude sight gags, burlesque schtick and stale Jewish jokes done at rapid-fire pace.  The plot became an after-thought, working around the barrage of unsubtle humor.  In targeting the classic Frankenstein' series, however, Brooks worked in reverse, wisely focusing on plot, tone and atmosphere, then complementing them with clever, carefully constructed bits.<br><br>A rich staple of comedy pros from Brooks' fun factory (Mel graciously did not cast himself here) were employed to wring out the most laughs possible out of the fresh, inventive material.  Gene Wilder plays the frizzy-haired, eruptive college professor Frederick Frankenstein (pronounced FRONK-en-STEEN), grandson of the infamous scientist, who gives in to the maniacal tendencies of his mad ancestor after inheriting the late Baron's Teutonic castle.  His simmer-to-boil antics have seldom been put to better use, while only pop-eyed Marty Feldman, who gets to break the fourth wall as Igor (prounouced EYE-gor), the dim, oddball assistant, could milk a hump for all its worth.  Kenneth Mars too gets a lot of mileage out of his one-armed, slush-mouthed inspector.  In the film's most difficult role, Peter Boyle's appearance as the Monster is jarring at first, looking like a cross between Herman Munster and Uncle Fester.  But he increasingly wins you over, earning even a little empathy along the way.  His character is the most crucial for this parody to work right and he succeeds, figuring in a high percentage of the comedy highlights.<br><br>Representing the distaff side, Madeline Kahn is one cool cucumber, stealing focus whenever she's on camera as the placid, meticulous, hopelessly stuck-up fiancee Elizabeth; Cloris Leachman sinks her teeth into the role of the grotesque Frau Blücher, whose mere mention of her name sends horses into panic; and Teri Garr is delightful as a dinghy Deutschlander who assists Frankenstein in his wild experiments and other things.<br><br>An amalgamation of Universal's earliest and best Frankenstein' movies (\"Frankenstein,\" \"Bride of Frankenstein\" and \"Son of Frankenstein,\" this spoof relies on close imitation and Brooks took painstaking methods to recreate the look and feel of James Whale's original sets, black-and-white photography and musical score.  It pays off in spades.<br><br>Nearly 30 years later, this movie still leaves me in stitches.  Wilder and Garr's revolving secret door bit is still priceless, as is Cloris Leachman's ovaltine' routine and the Wilder/Boyle \"Puttin' On the Ritz\" tie-and-tail duet.  Boyle and the unbilled Gene Hackman in the \"Blind Hermit\" scene ripped off from \"Bride of Frankenstein\" are uproarious, easily winning the award for sustained hilarity in a single sketch.  Add Feldman's hump and Mars' troublesome mechanical arm and what you have is rib-tickling entertainment from start to finish.  Madeline Kahn's post-coital, cigarette-smoking scene with ol zipperneck' who leaves her in a sexual snit must go down in Hollywood annals as the funniest scene ever caught on camera.  Certainly Jeanette MacDonald's puristic rendition of \"Ah, Sweet Mystery of Life\" will never have quite the same meaning again after you've heard Madeline's spin on it.<br><br> \"Blazing Saddles\" indeed has its insane moments but when it comes to toasting Mel Brooks in the years to come, \"Young Frankenstein\" should certainly stand front and center when representing this clown prince of comedy.","user":"gbrumburgh","rank":[113,137]},{"title":"A Track of Laughs.","rating":30,"date":"30 April 2004","review":"Mel Brooks' hilarious \"Young Frankenstein\" is one of those strange films that is so outlandish and makes fun of itself so much that it sucks the viewer into its twisted world and does not let up until the final credits roll. The titled character (Gene Wilder) decides to go to Transylvania and continue the research of a late relative. What follows is a comic joy-ride that involves the assistant (Marty Feldman), the love interest (Teri Garr), the stuck-up girlfriend (Madeline Kahn), the weird house-keeper (Cloris Leachman), the odd detective (Kenneth Mars) and naturally the monster himself (Peter Boyle in a priceless performance). Gene Hackman's whacked cameo as a the blind man who encounters the monster is one of the best sequences during the history of the cinema. A brilliant screenplay and beautiful black-and-white cinematography assist \"Young Frankenstein\" in being the total success that it is. 4.5 out of 5 stars.","user":"tfrizzell","rank":[43,53]},{"title":"Possibly Mel Brooks' Best Film","rating":10,"date":"11 March 2006","review":"Over 30 years later this film still provides a ton of laughs to audiences.<br><br>It's always good to see the late Marty Feldman, whose face was hysterical and perfect for this film. In fact, he, along with the camera-work, really make this film one to watch and enjoy multiple times. Teri Garr was at her best and never looked as pretty as did in here. Add in the great talents of Gene Wilder, Madeline Kahn, Gene Hackman, Peter Boyle, Cloris Leachman, etc., and you have a memorable movie with a lot of memorable scenes.<br><br>Looking at the Frankenstien \"monster\" in a tuxedo or sitting up in bed with a cigar reading The Wall Street Journal are just a few of the outlandish scenes, along Wilder entering the mansion commenting on the \"nice knockers.\"<br><br>Kudos, also, for Mel Brooks having the good sense to film this in black-and- white. It may have been his best film, although \"Blazing Saddles\" would give it a run for its money. My only complaint was Wilder's constant yelling, which becomes abrasive and can give you a headache after awhile! Still, this has to be considered one of the best \"comedy classics\" ever.","user":"ccthemovieman-1","rank":[71,91]}]