[{"title":"Twists and turns in this excellent thriller","rating":7,"date":"27 November 2002","review":"Jean Simmons and Stewart Granger are brilliant in this murder thriller. There are so many twists and turns that you'll never guess what is going to happen next.  I wasn't particularly taken with the film the first time I saw it but after several more viewings it is now a firm favourite.  Simmons in particular shines as the manipulative girl in love with Granger and this is probably their finest teaming together on screen.  See if you can guess how it's all going to end - a clever ending to an enjoyable movie.","user":"Star5","rank":[39,42]},{"title":"Footsteps into legend.","rating":10,"date":"16 September 2000","review":"Forget the alliterative title that was meant at the time for American markets. A story by W. W. Jacobs provides one of the unsung triumphs of moviemaking. To call this a 'British' movie is a misnomer. Yes, it was made in Britain. But with American money and direction- Arthur Lubin. This is important, because a studio-made movie, set in Victorian England, to look convincing for Cinemascope photography takes big dollars. Thankfully, advantageous 1950's American-British exchange rates and tax breaks meant moviegoers were the ultimate winners. From the evocative photography, hauntingly memorable Benjamin Frankel score to the starring of the then 'hot' husband-and-wife team Stewart Granger [ruthless Stephen Lowry] and Jean Simmons [the ambitious above-her-station maid Lily Watkins], there's everything right about this movie. The sexual tension between the two is tangible throughout. The plot is Victorian murder, portrayed with period ambience by a distinguished British cast. Like all great movies the plot, though watertight, is not important. The movie is. Its stentorian elegance dwarfs its audience. They just know that this one was, and still is, a biggie. If you haven't seen it yet- lucky you!","user":"t.mcparland-2","rank":[60,67]},{"title":"A wonderful Victorian thriller","rating":9,"date":"30 May 2002","review":"This movie is certainly one of the best victorian-era thriller melodramas ever made. The atmosphere is perfect (at least according to what we expect victorian atmosphere to be). Both Stewart Granger and Jean Simmons give wonderful performances, each being ideally cast in his/her role. The suspense builds up perfectly, answering the viewers question as to how the katharsis will come at the end. And it is a very satisfying solution - with the exception perhaps of the last words said by Jean Simmons. All in all an excellent movie that deserves much wider recognition than it actually enjoys.","user":"dimandreas","rank":[41,45]}]