[{"title":"It's in the genes.","rating":19,"date":"19 April 1999","review":"This raw look at small town hoods brutally exposes us to a portion of society rarely depicted in movies. Souped-up cars and small time heists are nothing new, but `At Close Range' is really more The Godfather' than `Bonnie and Clyde'.<br><br>Disobedient kids, worthless mom, ineffective stepfather. Every day we hear tell of it on Montel, Jerry Springer, and Sally. Here, we see it, here we live it.<br><br>James Foley does his best work here, you might think it funny to call a film with a lot of 4x8 paneling and muscle shirts stylish' but this film has its own distinctive style, in many ways reminding me of Michael Mann's very stylish `Thief'<br><br>Christopher Walken is nothing short of spectacular. Both the Penn brothers (Sean and Chris) do very strong turns as sons of this verrry badddd man.<br><br>Great story, powerful performances. All too real. Even a bit of a storybook ending doesn't tarnish this one.","user":"Doctor_Bombay","rank":[66,72]},{"title":"Gritty, dark, exceptionally vivid drama","rating":26,"date":"26 December 2000","review":"Sean Penn, who has now effectively established himself behind the camera as a fine director as well, once expressed that he didn't care that much for acting. When one reflects on the more brilliant achievements he's made in his career, and can contemplate how physically and emotionally exhausting his best and most difficult roles have been, it's not a statement that comes across as being that unusual. And nowhere can the toll a role can take on an actor be felt more keenly, than in AT CLOSE RANGE, with his portrayal of ne'er-do-well, small town knockabout Brad Whitewood, Jr.<br><br>The chilling poignancy of the film and the events it portrays are even more stunning (and depressing) when it is revealed that everything is based on true events.<br><br>The direction, photography, editing, scoring and most of all the acting work wonders to convey the ennervating malaise of small-town life in middle America, and how it can affect and motivate people to act or react in ways that propel them into situations that people in more metropolitan areas may smugly observe that they would never find themselves in.<br><br>Brad Whitewood Jr. (Penn) and his little brother, Tommy (Chris Penn in an amazing early performance) don't have that luxury. Caught in the inescapable pull of the dying farming community in which they live, like lost stars drifting near the event horizon of a black hole, they have nothing better to do than cruise the main square, get drunk, get high and get into trouble.<br><br>The one bright spot in their ocean of darkness is their frequently absentee dad, Brad Whitewood, Sr. (Christopher Walken at his best and most frightening). Suave, cocksure and charismatic, Brad Sr. represents a world of fascinating danger and adventure that has his boys enthralled. Brad Sr. runs a black market ring that deals in stolen equipment parts, amongst various other unlawful and unsavory activities, and as it is revealed early on, when it comes to protecting his bottom line, Brad Sr.'s vicious wrath recognizes no allegiance to loyalty or kin.<br><br>To prove themselves worthy of their dad's attentions, Brad, Tommy and their friends (which include future stars John Laughlin, Kiefer Sutherland and Stephen \"Fright Night\" Geoffreys), decide to start their own gang, with disastrous results.  The federal authorities, who have been after Brad Sr. for a long time, decide to use the boys as leverage to nab him, and subpoena them as State witnesses against him. But even they underestimate his capacity for evil, as he demonstrates in one of the film's most graphically shocking setpieces.<br><br>Only an actor worth his mettle can hold a scene with Christopher Walken, let alone take it away from him, and Penn proves to be more than worthy of the challenge. You will find both actors doing some of their best, most gut-wrenching work here. A fun time at the movies this is not, but in terms of acting ability, the efforts on display here are damn near flawless, and should have been recognized at Oscar time.<br><br>Also commendable are subtle turns by Millie Perkins as the boys' mom, who is adamantly against the idea of having her hooligan estranged husband influencing her boys, yet isn't beneath accepting his guilt money every now and then, and Mary Stuart Masterson, who shines like a beacon as Brad Jr.'s inspiration to dream of a better life, even with a menacing threat to her own from his father, whom she defies, with tragic results.<br><br>James Foley's tight direction, the atmospheric and almost surreal lighting and shadows captured masterfully by DP Juan Ruiz Anchia, Nicholas Kazan's sure-handed screenplay, Patrick Leonard's haunting score (the basis for Madonna's hit \"Live To Tell\"), and as mentioned before, the superb acting, make for an experience that you may not enjoy, but it will most certainly stay with you for a very long time...","user":"cchase","rank":[51,56]},{"title":"Overlooked gem","rating":10,"date":"13 December 2001","review":"I saw this movie when it first came out, and it's remained one of the most memorable films I have seen since. Sean Penn &amp; Christopher Walken especially produce very powerful, realistic performances. Walken's evil father is a spot-on echo of a relative of mine - right down to the mustache &amp; body language. &lt;shudder&gt; Sometimes, though, Walken's low-class accent is so thick I couldn't make out just what he's saying.<br><br>The dialogue is just subtle enough to feel realistic. Although the movie moves along at a slow, deliberate pace, the plot still feels nice &amp; tight. And the cinematography is stylish. An instrumental version of the song Live to Tell, that Madonna turned into a hit, is actually used as the main theme running under almost every scene. It's not often that a pop song associated with a film is actually used in the film itself - usually it's just tacked on at the closing credits. But it was used to great atmospheric effect here.","user":"JennyP","rank":[62,71]}]