[{"title":"An unforgettable masterpiece. Finally available on DVD!!!!!!","rating":10,"date":"25 February 2005","review":"American film audiences have rarely had the opportunity to view Bernardo Bertolucci's The Conformist in its original widescreen, non-dubbed theatrical release version. Although a restored print of the film has recently been shown at American film festivals, The Conformist remains unavailable on DVD. Its faded, butchered, and dubbed VHS/laserdisc release is long out-of-print, just about impossible to find, and a desecration not worth viewing in any case. Fortunately, I happened to view (and videotape) a widescreen, non-dubbed print of the film shown some years ago on a cable premium movie channel. No film lover should pass up an opportunity to see this film in any form approaching the director's intentions.<br><br>A comparison of Bertolucci's The Conformist with the novel by Alberto Moravia from which it was adapted illuminates much about the ambitious style and structure of the film. For instance, Bertolucci chose not to follow the novel's omniscient point of view. Instead, he uses the intensely subjective and heavily unreliable point of view of the story's main character, Marcello (Jean-Louis Trintignant), a child of decadent aristocracy who embraces fascism, not from ideological commitment but from a desire to blend in with his social surroundings. Bertolucci also structures the film's plot in a non-linear manner rather than emulating Moravia's chronological narration. This strategy yields a film equivalent of the modern novel's characteristic \"stream-of-consciousness\" technique, whereby the inner workings of Marcello's mind, his desire for \"normality\" at all costs, are plumbed in a fragmented series of recollections held together by psychological association rather than direct cause and effect. <br><br>Bertolucci's approach transforms Moravia's rather conventional, socio-political novel into a much more intimate and complex psychological study of the protagonist. The film's subjective point of view emotionally intensifies the formative and revealing experiences of Marcello's life such as his encounter as a young man with a male seducer, his shamed alienation from his parents, his deliberate courtship of and marriage to a shallow bourgeois young lady, and his ambivalent relationship with his anti-fascist former professor and the professor's liberated, bisexual wife. Two plot alterations from the novel are also worth noting. One is in the manner and location of the assassination of the professor and his wife, which occurs much more matter-of-factly in the novel. Bertolucci changes the setting to an isolated, snow-covered stretch of countryside where Marcello witnesses the execution and, by doing nothing to prevent or protest it, becomes morally complicit in the act. A second change involves the plot outcome for Marcello himself. Whereas in the novel Marcello and his family are killed by Allied bombing while attempting to flee Rome, the film's ending is much more open and ambiguous. <br><br>Technically, The Conformist's indisputably brilliant cinematography, directed by Vittorio Storaro (Apocalypse Now), combines with some of the finest low budget set decoration in film history to poetically evoke a 1930s European setting that seems simultaneously real and surreal. Such scenes as the blind persons' ball, Marcello's meeting with his father in a stadium-like insane asylum, his walk through the Italian fascist government building, and the justly famous low-angle shot of blowing leaves are either hauntingly lyrical or startlingly nightmarish or, often, lyrical and nightmarish simultaneously. Many shots in the first two thirds of the film are skewed by slightly oblique camera angles to suggest that we are seeing a reality shaped by Marcello Clerici 's selective, distorting memory. This visual style radically shifts once the climactic assassination takes place and Marcello's consciousness is absorbed entirely into the film's present time. George Delerue's musical score and other elements of the soundtrack also greatly enhance the wonderfully nuanced mood shifts within and between the complex narrative strains of the plot. Quite simply, The Conformist is an unforgettable masterpiece of the highest order.","user":"EThompsonUMD","rank":[108,123]},{"title":"The Dark Poetry Of Politics","rating":10,"date":"30 July 2011","review":"To be everything is nothing. To go against what you cherish the most is the symbolic gesture of weakness. The brilliant story telling of the young and passionate Bernardo Bertolucci remains as vivid and powerful as the first time I saw it - 15 years ago, when I was 21 - The film is 41 years old now and I can only imagine the effect it had in its day. For me, it became a point of reference and to see it again is a shattering scramble of emotions. Jean Louis Trintignat is extraordinary and Stefania Sandrelli is superb as the mediocre, petite bourgeois wife. The art direction by Ferdinando Scarfiotti and the photography by Vittorio Storaro are, quite simply, without equal. I was very moved by the appearance of Pierre Clemeti as the ambiguous Lino. A film to visit and re-visit.","user":"littlemartinarocena","rank":[53,62]},{"title":"Unique, visually stunning and surreal mix of history and suspense","rating":8,"date":"2 June 2001","review":"Bertolucci's \"Conformist\" must not be missed if it shows up at your local art/independent movie theater.<br><br>Indispensable for its photography and visual style alone -- credit legendary DP Vittorio Storaro, best known for his work on The Godfather films and Apocalypse Now -- the film delivers with a ferocious punch on a remarkable number of levels.<br><br>Dense and often difficult, yet leavened with unexpectedly beautiful and humorous touches, \"The Conformist\" functions primarily as an indictment of Fascism and its adherents.  But deeper threads run deeply through the picture; it is an examination of one man's attitudes towards the value of patriotism, love, family, marriage, sex and death, and, as has perhaps been overstated (by both the critics and perhaps the film-maker) it also explores the ramifications of homosexual repression.<br><br>Bertolucci expertly manages to weave these themes into a hypnotic, occasionally  surreal experience that has served as an inspiration for countless directors.<br><br>Performances are brilliant throughout.  Dominique Sanda is one of the most engaging and sensual women to ever grace the screen.<br><br>See this film, and you will simply wish to see it again.","user":"dcavallo","rank":[70,86]}]