[{"title":"\"They got Blondie!\"","rating":6,"date":"13 November 2006","review":"When I was a little kid, I watched \"Battle of the Bulge\" approximately 58 million times. I thought it was the cat's pajamas.<br><br>But even back then, my young and usually trusting mind could detect a strong whiff of baloney from this movie. I had difficultly believing, for example, that every Allied soldier in World War II was an incompetent nitwit except for the all-knowing, all-seeing Henry Fonda. Throughout the course of this movie, Fonda's character predicts the battle (rather like a psychic, or someone with access to the script), uncovers every weakness in the German plan, and then finally plays a key role in stopping the entire German offensive. What a versatile guy, huh? <br><br>And yes, even my inexperienced child-self found it rather weird that, in this movie, the Americans are depicted as being utterly incapable of fighting the Germans. The film suggests, in a somewhat insulting fashion, that in point of fact the Americans did not win this battle in the traditional way - we only won it because the Germans ran out of gasoline and decided to walk home! What complete rubbish. Anybody with even a vague understanding of the real battle knows that the Americans won simply by counterattacking - what a novel idea! <br><br>Some commentators on this site have argued that the film's historical inaccuracies don't matter, and that only World War II nerds will be offended by the script's tinkering with history. However, I would argue that \"Battle of the Bulge\" is SO inaccurate that such a defense doesn't hold water. And it's not as though the inaccuracies make the film better; in fact, I'm confident that a more realistic portrayal of the battle would have made the film far more exciting, even-handed, and worthwhile.<br><br>And yet... and yet... I still like this stupid movie! The tank battles are fun, the music is great, and the cast is really top-notch. Here's a general rule of thumb that I apply to the film as a whole - the scenes with the Americans are stupid, and the scenes with the Germans are good. For example - Robert Shaw is simply awesome as the (fictional) German commander. He has a fascinating series of moral debates on the nature of the war with his aide, a long-suffering corporal played by Hans Christian Blech; these scenes are a real highlight of the film, and their intelligence makes for a stark contrast with the general idiocy of other scenes.<br><br>There's also a very good scene when Charles Bronson tells Fonda that his men are so angry because of the war that they want to completely annihilate Germany and its people. This somewhat sinister note always gets my attention, but it pretty much amounts to nothing.<br><br>Perhaps the best thing that I can say about this movie is that it got me curious about the real battle, and the war in general. Because it's reasonably cool and exciting, the film is a pretty good vehicle for generating interest in the events it depicts so carelessly. Also, the script is perhaps not quite so inaccurate as some people claim - the early forest battles are somewhat like the real thing, and the general nature and goals of the German offensive are accurately portrayed.<br><br>It's just that too many dumb Hollywood moments spoil the movie for any serious aficionado of history and/or cinema. That's a shame, really. I wouldn't mind seeing a more accurate remake, which presumably would not involve an omnipotent Henry Fonda singlehandedly foiling the last great German offensive of World War II.","user":"dr_foreman","rank":[72,81]},{"title":"Ah yes! The scorched plains of the Belgian desert...","rating":6,"date":"12 October 2002","review":"December 1944. The Germans launch their last major offensive in the west. The plan is to break through the Allied lines at several points in the hilly, densely wooded Ardennes region of Belgium and make an all out drive to recapture the port of Antwerp, thereby cutting the Allied forces in two. The Allies cannot use their air superiority due to dense fog covering the region. The task of stopping the vast armoured advance falls to small groups of US soldiers making a stand wherever possible.<br><br>   I really have mixed feelings towards this film. In terms of historical, geographical and meteorological accuracy, it's an utter shambles from start to finish. All the characters are ficticious (some are obviously composites of real participants in the battle). A fact already well documented is the use of '50s/'60s US tanks to represent the German Tigers and US Shermans. There is no mention whatsoever of the fact that General Patton managed to basically turn the advance of his 3rd Army through 90 degrees, then head north to break through to the 101st Airborne at Bastogne. Finally, to suggest that the Germans ran out of fuel and simply 'walked back to Germany' is plain insulting. The geographical errors are also quite glaring. During the first half of the film these errors can be largely overlooked. However, from the artillery train sequence onwards to the climactic tank battle, the terrain looks more like Arizona than the Ardennes! (vast desert like plains). Then, as if all that isn't bad enough, there's the weather. The winter of '44/'45 was one of the worst in recent history. In the Ardennes that meant deep snow, freezing temperatures and thick fog. Apart from some snowy scenes early on, there isn't much evidence of any of this!<br><br>   Considering all the inaccuracies catalogued above, I should despise this film, but I don't. Taken on its' level, it's quite enjoyable. It has a strong cast; Robert Shaw  and Hans Christian Blech are both very good, Charles Bronson was an old hand at these all star extravaganzas, and Henry Fonda exudes his usual quiet dignity. The script, if a bit hokey, is no worse than others from the period and the cinematography and score are fine. The battle scenes are professionally staged and comparison with modern war films would be unfair.<br><br>   A point worth noting is the fact that this film has been cut in recent years. The missing scenes are briefly:- 1. The introduction of the Germans dressed as US MPs. 2. Shaw inspecting his tanks. 3. A conversation between Fonda and Bronson. 4. A lengthy sequence in Ambleve with a conversation between Shaw and Bronson, followed by an attempt on Shaw's life by a young boy. The boy's life is spared but his father is executed. The missing footage accounts for roughly 10 minutes of running time. The quoted running time on most reference works is 167 mins., which I assume includes the overture, intermission music and exit music. This would seem to be correct, for if my old widescreen VHS copy contained the missing scenes (the music is all present) it would run approx. 160 mins.(running time is speeded up on PAL). But I digress.<br><br>   Overall then, a film with some very major flaws. If you're expecting a film in the same vein as 'The Longest Day' or 'A Bridge Too Far' you'll be terribly disappointed. If you can accept it as a fictional account of the battle however, and can view the complete version, then it's well worth a look.","user":"KEVMC","rank":[88,110]},{"title":"No excuses, this film is the \"Plan 9 from Outer Space\" of all war films","rating":1,"date":"23 December 2006","review":"As the son of a man who fought and almost died in the Battle of the Ardennes (Battle of the Bulge is a stupid name that brings to mind something to do with weight control), I not only think this is the worst action picture I've ever seen, I'm ashamed that Hollywood insulted our veterans with this stinker two decades after the battle in which so many Americans died to turn the tide in Europe. You know it must be pretty insulting to war veterans if Ike himself bothered to become a movie critic and denounce it as demeaning to our soldiers and their memory.<br><br>I try never to say I hate something, but I hate this movie on every possible level. In the war movie genre, it's a zero. In the historical recreation genre, it is a sub-zero. As an action picture, it is unbelievable. Quite simply the only reason anyone should watch this thing is to catalog a list of things you should avoid doing if you ever decide to make a war movie.<br><br>By now, you've already read about the gaffs: The anachronisms like a German reading Playboy magazine in the background. The cheap and silly plastic-models-on-a-tabletop war scenes ala Godzilla, The breathtaking inappropriate location of the filming on the Spanish plains instead of using, if not Belgium, then at least some northern European forest country with snow! I mean, my God, would you film a movie about Eskimos in Venezuela? And some reviewers here struggle to make apologies for all this, saying in essence \"So what? It was a fun war movie.\" Who cares if it was filmed in a desert instead of the Ardennes forest? Who cares if they made the Germans into cartoonish Nazis and the Allies into G.I. Joe and Sgt. Rock comic book heroes? Who cares if almost nothing is as it was during the battle?<br><br>Well then, why bother to make a movie with the specific title \"Battle of the Bulge\" at all? Why not just call it, \"Clash of the Panzers\"? I know, it was the 1960s and it was just meant to entertain and jerk a few bucks out of people's pockets with gimmicks like Cinerama and marquee brand names like Henry Fonda. I know all that.<br><br>But it was an insult to the vets who fought and died there. They said it at the time it was made. I can't get beyond that. I have walked the forests and fields around Bastogne where my father endured such an ordeal he would not ever speak of when he was alive. I've walked among the white gravestones of men who died there. I can't bring myself to get to, \"So what? It's just a movie.\" Neither, apparently could the many vets who decided to take their families to this picture when it was released, and then had to sit there, embarrassed and speechless as this movie made a mockery of their struggle.<br><br>I fully expect that I'll get a negative rating as to how many people found my comments \"useful,\" but that's OK. From what I've seen, people tend not to like criticism of a film based on subjective, rather than objective remarks. In this case however, I don't care if I get a single \"useful\" vote. This movie was a travesty in its day, and worse now with the passage of time. It is truly the \"Plan 9 From Outer Space\" of war movies.<br><br>But ending on a positive note: I'd like to see somebody do a spoof film about the making of this movie and how everybody from the screenwriters, to the director and actors and location scouts to the extras in the background didn't give a flying flip about what they were working on except getting a paycheck. That, I'd watch.","user":"ebonius","rank":[204,281]}]