[{"title":"Ginger Rogers and Peggy Ann Garner Star","rating":8,"date":"1 December 2005","review":"Very impressive cast in a better than OK murder mystery. With touches of All About Eve and Sunset Boulevard, this film moves along at a good clip with only a few draggy scenes.<br><br>Ginger Rogers plays a bitchy stage diva who is married to a mousy man (Reginald Gardiner) and lives in the same apartment building as her producer (Van Heflin) who is also married to an actress (Gene Tierney). While Tierney is away, Heflin attends one of Rogers' big parties and meets a quiet young woman (Peggy Ann Garner) who actually has no real interest in acting or theatre. She is a writer. He invites her out for a real meal and she insinuates herself into his life.<br><br>The party scene is pretty funny with Ginger ripping off several \"Margo Channing\" ripostes at the expense of Bea Benaderet. Heflin is infatuated with the serious young Garner whose only link to the stage is her uncle (Otto Kruger) who is an actor. She also befriends a young brother and sister from Boston (Virginia Leith &amp; Skip Homeier) who are doing the Greenwicj Village beatnik thing.<br><br>Well there is an apparent suicide and that brings in a detective (George Raft) who hounds everyone. When the suicide is discovered to be a murder, things get really dicey for all involved.<br><br>For the most part the acting is solid. I never liked Heflin but he's OK in this film. Rogers plays the diva well and looks great. Tierney gets a few good scenes. Raft is solid as the detective. Gardiner is especially good, but Peggy Ann Garner, a top child star of the 40s is quite excellent as the moody and strange young writer. Oddly, she didn't make a film after this one for another 12 years. She reminds me here of Barbara Bel Geddes. Bea Benaderet as the party guest, Otto Kruger as the uncle, and Leith and Homeier as the beatniks are all good.<br><br>Also in this film are Cathleen Nesbitt oddly cast as a cleaning lady, Mabel Albertson is the bar owner, Hilda Simms plays the sympathetic waitress, and believe it or not, the gangly witness from the movie theater is Aaron Spelling, who would have a major career as a TV producer.<br><br>Worth a watch.","user":"drednm","rank":[50,57]},{"title":"Fading stars breathe life into artificial murder mystery set on Broadway","rating":8,"date":"6 October 2003","review":"No matter how pretentious the cocktail party, never escape by asking another wallflower out for dinner.  That was theatrical producer Van Heflin's mistake when, on the terrace of Broadway diva Ginger Rogers' apartment, he took pity on hopeful young writer Peggy Ann Garner.  Just a few months later, she was found hanged in the bathroom of his apartment.<br><br>It was all very innocent, though.  While his wife, another star on the Rialto (Gene Tierney), was away tending to her ailing mother, Heflin let Garner use his place as a daytime office so she could write in quiet comfort. (Well, not so quiet: She listens to `The Dance of the Seven Veils' from Salome incessantly and fixates on a line from the opera: `The mystery of love is stronger than the mystery of death.')  But when it turns out not only that she was pregnant but that she was murdered, the police sensibly enough find in Heflin their prime suspect.  <br><br>Black Widow, written and directed by Nunnally Johnson, assembles an impressive array of Hollywood luminaries across whose resumés long shadows were beginning to creep.  Along with Rogers, Tierney and Heflin, there's George Raft as a police detective, Otto Krueger as Garner's actor uncle and Reginald Gardiner as Rogers' whipped spouse.  It's an ensemble-cast, 40s-high-style mystery movie, made about a decade too late but not too much the worse for that (even allowing for its color and Cinemascope).<br><br>\nHeflin's technically the center of the movie  the patsy racing around to prove his innocence.  But the meatier parts go to the women, except for Tierney, all but wasted in the recessive role of the elegant but dutiful wife.  Garner makes her abrupt exit early in the movie, but returns in startlingly revisionist flashbacks.  And, as the grande dame (named `Carlotta,' perhaps in homage to another grande dame of the stage, Marie Dressler's Carlotta Vance in Dinner at Eight?), Rogers strides around in big-ticket outfits and fakes a highfalutin drama-queen accent.  For most of the movie it seems like ill-fitting role for the essentially proletarian Rogers, but it's shrewdly written, and near the end she shows her true colors, becoming, briefly, sensational.<br><br>Like Repeat Performance and All About Eve, Black Widow uncoils in a high-strung, back-stabbing theatrical milieu that's now all but vanished  all the money and the glamour have moved west.  (Not to put too fine a point on it, but the tiny part of a struggling Greenwich Village actor is taken by television producer Aaron Spelling, now one of the richest men in Hollywood.)  The movie cheats a little by withholding information essential to our reading of the characters, but it's a forgivable feint; the characters are all `types' anyhow.  There is, however, one baffling omission  there's not a single widow in the plot.","user":"bmacv","rank":[43,49]},{"title":"Well-acted, well-upholstered soap opera/murder mystery...","rating":6,"date":"3 December 2005","review":"Van Heflin gives a striking, forceful performance as a theatrical producer in New York City who befriends a lonely 20-year-old girl at a party; she's a would-be writer hoping for success, he takes a shine to her and offers a helping hand...but then she turns up dead! Curiously mistitled drama really doesn't involve \"a predatory female\". Peggy Ann Garner is intriguing as the youngster who, in flashbacks, is revealed to be scheming and ambitious, somewhat ruthless, but not a black widow. Gene Tierney has a thankless role as Heflin's wife (she looks grim throughout), but Ginger Rogers is fun as a colorful, gossiping actress. The film has some ridiculous passages, red herrings and side-plots (one involving another young woman who appears to be fabricating a wild story just to frame Heflin is never explored), and a slightly anti-climactic finish. The film looks good and has some funny/catty lines in the beginning, but in the end it all seems a bit silly. **1/2 from ****","user":"moonspinner55","rank":[32,38]}]