[{"title":"Talents of Mann, Alton elevate routine thriller about cracking counterfeiting ring","rating":8,"date":"21 February 2002","review":"Whether by fluke or design, joining the talents of director Anthony Mann and cinematographer John Alton resulted in one of the most potent creative teams in movie history  certainly in the film noir cycle whose look and energy they helped forge  (Alton's contributions are so innovative and striking that they amount to co-direction).  Working for Eagle-Lion Studios on Poverty Row, they took a routine agents-in-peril plot packed with propaganda about Our Tax Dollars At Work in Washington and turned it into a memorable film that's little short of extraordinary -- at least at times.<br><br>Treasury agents Dennis O'Keefe and Alfred Ryder get assigned to track down a counterfeiting ring uttering high-quality, almost indetectable paper.  They catch the scent, by means of cigars and Chinese herbs, of a portly gentleman in San Francisco.  Going into deep cover, they get drawn into an increasingly edgy and violent underworld, putting themselves at considerable risk (in one of the film's most morally freighted moments, one of them doesn't make it out).<br><br>Appreciating this film means shutting out the super-patriotic anthem that rings out whenever we catch sight of the Capitol dome and the narrator's portentous drone that accompanies it (actually, more than 50 years later, these laughable gimmicks add a piquant period flavor).  Instead, watch for Mann's syncopated pacing, which always catches you off guard, and for Alton's amazing throwaway effects.  There are shots in this low-budget exercise so complex and evocative that they're models of the cinematographer's craft (Alton did, after all, write the seminal textbook \"Painting With Light\").  Shifting double images in the windows of telephone booths and pizza shops create parallel worlds.  <br><br>The film leaves us with a number of unforgettable set-pieces: Assassin Charles McGraw plying his trade in a Turkish bath, Ryder not being able to acknowledge his new bride for fear of blowing his cover, a murder which one of the agents dares not prevent, or even react to. T-Men looks terrific, keeps us on edge, and deserves its reputation as one of the high-points of the film noir cycle.","user":"bmacv","rank":[38,40]},{"title":"Treasury men","rating":8,"date":"7 June 2006","review":"When counterfeit currency begin appearing in the L.A. area, the Treasury Dept. comes to investigate. The only way to deal with the problem is to have two agents from different areas of the country infiltrate the ring in order to have the ones responsible captured. Dennis O'Brien and Tony Genaro are the two men tapped for the job.<br><br>It takes both men a while in getting to know how the gang operates. Dennis O'Brien gets lucky when he follows the Schemer into a craps game where he passes a counterfeit bill that is soon discovered. O'Brien is the one that is able to penetrate and get to know who are the people involved and is instrumental in solving the mystery.<br><br>\"T-Men\", directed with an amazing style by Anthony Mann is told documentary style, as though what we are watching was an episode, or a re-enactment of the real incident narrated by someone in the Treasury Department. Mr. Mann's direction and his innovative camera placements are about what makes the film watchable. The interesting black and white cinematography by John Alton gives the film a great look that keeps the viewer involved in the story. The background music is by Paul Sawtill and it works good with the action.<br><br>Dennis O'Keefe makes a cool Dennis O'Brien, the T-Man that is smart and is able to solve the puzzle at the risk of losing his own life. Alfred Ryder plays Tony Genaro, another T-man whose cover is blown by a friend of his wife. Wallace Ford is perfect as the oily Schemer, a man who loves to gamble and the steam baths. Mary Meade, June Lockhart, Charles McGraw, are seen in supporting roles.<br><br>The film clearly points out to the talent of a great film director, Anthony Mann, who created a film with a style and a substance that others imitated, but never succeeded.","user":"jotix100","rank":[23,24]},{"title":"Sizzling Semi-Doc","rating":10,"date":"11 October 2002","review":"T-Men is yet another collaboration of director Anthony Mann and cinematographer John Alton, a sizzling semi-doc done in the noir manner, it's the usual fed goes undercover story, and yet made with such verve and energy as to jump off the screen. The larger than life film-making, combined with the sober subject matter, almost tip this one into the realm of the surreal, as Mann and Alton were basically too talented for such mundane material, as essentially the script serves their talents, which are considerable, rather than the other way around. Routine as the story is, this is magnificent film-making.","user":"telegonus","rank":[26,28]}]