[{"title":"They Don't Make 'Em Like This Anymore!","rating":4,"date":"23 November 2000","review":"This is another film I remember from childhood, from the days of regular TV (free, broadcast, and adjust the \"rabbit ears\" for reception), as a crappy but atmospheric British monster picture.<br><br>Now, not only on cable, but on a premium service, I came across it again - and in letterbox format no less.  Well, the film is still basically very flawed, but it really shows how much better crafted films once were.<br><br>While it remains a simplistic lots of onscreen gore effort, this picture is so much more beautiful to look at than many produced today.  The cinematography is consistently superior, and well supported by excellent lighting and generally well scored music. And even though the special effects don't match up to todays films they retain some value in that they have more visual \"weight\" than some of the CGI crap routinely inserted in modern movies.<br><br>Unfortunately the wacky plot and mediocre (well, sometimes bad) acting show through in the end.  It may be that the director was trying for a lot of humor at points but it only worked for me towards the end of the film when one of those fleeing the burning building stops for a snack in the kitchen.<br><br>As for the beheading car mentioned in another review: that particular element is worthy of Austin Powers' \"Dr. Evil.\"  I can see the good doctor in this movie also calling out \"All I'm asking for is for some frickin' sharks with lasers on their heads.\"<br><br>If you've seen this before on broadcast TV, it may be worth a second look on video or DVD for the cinematography and for the sexual elements which explain the plot a little more.  In the TV version I saw as a kid, the sexual theme was not at all evident, and so, the plot seemed even more outlandish than it actually is.<br><br>Still, if you happen by this big-time cable it may catch your interest, but all the way along you'll wonder why any premium channel could have chosen this film from their catalog.  There are quite simply so many more old British shockers which are better than Horror Hospital.\"<br><br>-SCG","user":"- Chumpy","rank":[18,20]},{"title":"Stunning Piece of British Deconstruction","rating":10,"date":"31 October 2005","review":"This film is a wonder. If one was to happen across it one Sunday afternoon, sober and alone, one might struggle to immediately spot its worth.<br><br>However, do NOT pass this film by. Director Balch has here crafted a masterclass in horror/b-movie aesthetic and inconsistency. The gleeful abandon with which the film disposes of continuity and good sense is a constant joy - it impossible not to shout \"REWIND\" every 10mins.<br><br>Robin Askwith's frottage, Dennis Price's priceless mirror speech, the musical motorcycles, the guard Dalmatian, the zombie ticket-man, the slugman escape, the \"sandwich incident\", the hilarious incomprehensibility of Michael Gough's Doctor Storm's central plan, the delectable Judy Peter's, the greatest chat-up line in screen history (sadly unrepeatable here...) and one very fine facial performance after another from the diminutive Skip Martin.<br><br>Please, rent or buy this film, grab a your mates and a crate of cheap beer and keep the remote control nearby - this film, from the same year as The Wicker Man and Don't Look Now, defines the genre with its aggressive deconstruction of horror clichés and sizzling script.","user":"crikeymiles","rank":[22,26]},{"title":"Super 70's horror comedy","rating":10,"date":"22 November 1998","review":"Horror Hospital is an excellent slice of vintage British horror, produced in the early 70's when films were getting gorier (notice the numerous decapitations). Michael Gough is on top nasty form as a doctor who performs brain experiments (sound familiar?) on his young victims, and Robin Askwith is the unsuspecting youth caught up in his evil schemes. Dennis Price has an amusing cameo, and there's even a 70's guy called Abraham with big hair. Lots of comedy action scenes too with motorbike-helmet wearing leather-suited baddies. This is a must see!","user":"Graham R","rank":[20,26]}]