[{"title":"an overlooked gem","rating":10,"date":"11 April 2005","review":"Maybe some people just don't get it. This was made by the team of Zucker-Abraham-Zucker, responsible for \"Airplane\", \"The Kentucky Fried Movie\", and the \"Naked Gun\" series, so who cares if it doesn't accurately reflect society? It's not meant to be a satire, folks, it's a very broad parody! <br><br>I recently watched this again, and I caught something I had never caught before. In the dinner scene at the \"Hotel Gay Schluffen\", Nick Rivers (played by Val Kilmer, and this may be the best thing he's ever done), American rock star, is told that he needs a jacket to eat in the dining room, but the restaurant will provide one. In the next scene we can see him in the background having a jacket tailor-made! The reason it's hard to catch is that there's exposition going on in the foreground (a ZAZ trademark). It's funny, but the amazing thing is that I've seen this movie many times over a period of something like 20 years, and I'd never noticed that before.<br><br>I believe that this is one of the marks of a great spoof, that you can watch it many times and still pick up jokes you've never noticed before. Like ZAZ's other masterworks, this one is packed with hilarious one-liners and sight gags. Watch for the scene in the Swedish bookshop that's filmed backwards, the way the verses to the East German National Anthem keep getting longer and longer when translated into English, and the scene where an unfortunate agent is crushed inside a car (and what happens with him afterwards!). And this doesn't even scratch the surface. If \"Top Secret!\" isn't ZAZ's funniest movie it's only because it has such strong competition. The men were comedic geniuses when they were together.<br><br>Val Kilmer was hilarious as Nick Rivers, and the movie has a strong supporting cast, including Lucy Gutteridge as Nick's love interest Hillary (I wonder how Ms. Clinton would feel if she knew her name means \"She whose bosoms defy gravity\"?), Christopher Villiers as Nigel, her ex-boyfriend (they spent some time stranded on a deserted island together), and Jeremy Kemp as the evil General Streck. Also look out for Peter Cushing, Omar Sharif, and Ian McNiece (hilarious as a spy whose cover is selling souvenirs, novelties, and party tricks). And watch out for the French resistance (who knows what they're doing in East Germany?), each one of whose names is a pun on a French word or phrase (Chocolate Mousse, Deja Vu, etc.)<br><br>The plot? Does it matter? Something about the East Germans planning to take over the world while everybody's paying attention to an international cultural show they're putting on (Nick is the American representative), and the spies who are trying to stop it. But that's not the point, the point is the comedy, and I could go on and on about the many hilarious jokes but I'm not going to; let me just say without ruining anything that the funniest scenes in the movie involve a cow.<br><br>It's usually overlooked, curiously enough, when talking about the great comedies, but there's no doubt about it, \"Top Secret!\" IS one of the great comedies of our time.","user":"the-jerk","rank":[159,179]},{"title":"\"What funny duck poop?\"","rating":26,"date":"26 August 2003","review":"Top Secret is one of the funniest, most off-the-wall movies ever filmed. Featuring a young Val Kilmer, I think Top Secret is the best of all spoof films (Spaceballs is a close second).  This thing spoofs everything, Beach Boy's songs, spy pictures, war movies, westerns, and even Elvis is not safe. It's ridiculous, outrageous, hilarious, and all in the name of good fun. The spit gag has to be my favorite bit.  You've seen it in countless movies: the hero is being verbally accosted by the villain and he spits in his face. This time, however, the hero is on the other side of the room.  Other memorable jokes include the skeet songs, the anal intruder, the \"cow\" scenes, and the backwards bit with Peter Cushing.  There are countless little things like that which make Top Secret a definite cult classic and a certifiable must-see.<br><br>\"Wish they all could be double barrel, wish they all could be double barrel guuuuuuuns.\"","user":"Backlash007","rank":[95,114]},{"title":"I don't understand...","rating":8,"date":"5 October 2018","review":"It's so stupid it's hilarious.\nMy husband and I were laughing nearly the entire movie and I found myself repeating, \"What is even happening?!\" over and over. \nBut yet...it's somehow incredibly entertaining.","user":"illneverforgetu","rank":[16,17]}]