[{"title":"My Blood Diner Nightmare","rating":5,"date":"6 December 2006","review":"I played a zombie in BLOOD DINER and believe me when I tell you, it was such a bizarre and sickening experience that I plan to devote an entire chapter to the nightmare in my memoirs. I have worked on a lot of films, and I mean a LOT, and I can say with all confidence that the depravity of the project, inhuman working conditions and incompetence of the production have been unequaled, and will be fresh in my mind if I die of Alzheimer's disease at the age of 300.<br><br>So many people walked off the set in the middle of production, that they ended up hiring homeless people and crackheads off the streets of Hollywood to fill in the ranks. They probably even gave some of them lines. Half of the female cast were literally called into casting on the basis of spreads in JUGGS magazine. The writer, who later became a good friend of mine (before I knew he had written the thing), had played Mengele in SURF Nazis MUST DIE (one of my favorite, and the most depraved of all Troma films).<br><br>Jimmy Maslon, the producer, has a reputation as one of the cheapest and most thoughtless coke-head producers in Hollywood (he forgot to feed the zombies on so many occasions, that to keep the rest of us from walking off one day, he ran to the store and bought us some generic white bread and baloney, from which we made our own sandwiches).<br><br>And don't get me started about Jackie Kong. \"The Dragon Lady,\" as she was known to all who worked with her, will have a special mention in the book.<br><br>Suffice to say, that she once spent six hours on a 2 minute dialogue scene, while her zombies were sitting around in cheap gel make-up, which had completely melted off our faces by the time we got around to our scenes.<br><br>All that said, it actually is a pretty funny movie. I don't think any of the actors realized it was going to be though. In fact, I don't think anybody did but the zombies, who were all wasted on weed and CLUB margaritas the whole time -hic- ;-)","user":"hazmat63","rank":[40,44]},{"title":"This may be the best film ever made","rating":10,"date":"23 March 2005","review":"This movie is the classic old tale of two men trying to construct an Egyptian goddess for their castrated uncle from the severed body parts of young women.<br><br>This is one of those rare unknown cinema gems that reminds you of what 80's horror/slasher movies were all about and why video cameras were ever invented in the first place. It also contains the best movie line ever written: \"On that night, on this mission, I lost my gentitals and my life.\" And yes, Uncle Anwar really says \"gentitals\".<br><br>The plot of this movie is thrown together as loosely as the body parts used to construct Shiitar. The movie is lightly based on Blood Feast with some horrible special effects and 80's hairdos thrown in.<br><br>There are more classic moments in Blood Diner than there are in most B horror movies combined. You'll be laughing all the way to the blood buffet from the weird stuffed talking dummy in the rival diner to the guy getting his head smashed by a car with hydraulics which causes an onlooker to ask \"hey man, you OK?\". The movie even has token 80's horror flick nudity when the brothers go into a topless aerobics class (don't ask why) and mow everyone down with a machine gun. Hey, it happens. Another epic scene is when a fat guy driving a van and listening to mambo music repeatedly runs over a dude in a failed yet hilarious attempt to kill him.<br><br>If you haven't seen this movie I suggest you quit your job and study it for the next few months. You'll be swinging a meat cleaver screaming SHIIIIIITAAAAAAAR!!!!! before you know it.","user":"rhyatt1","rank":[56,71]},{"title":"The best vegetarian restaurant in town.","rating":11,"date":"11 October 1999","review":"Michael and George, owners of the best vegetarian restaurant in their small city, have an interesting social life.  Where most people go home and spend time with their loved ones after work, Michael and George hang around with their deceased uncle.  That's right, their deceased uncle -- who's actually just a brain and eyes in a jar that's ordering them to rebuild the goddess Sheetar so she can take over the world.<br><br>Sound like the perfect B-Movie?  Well, in a way, it is.  'Blood Diner' is one of those little gems that takes you quite a while to appreciate.  Sure, it's filled with as much low budget gore and cheesy sexist jokes as as Kong could fit into an hour and twenty eight minutes.  And sure, there are members of my high school drama class that are better actors than two of the main characters in this film.  But that's what makes it fun -- the fact that it was not only made to laugh at, but that you have so many chances to laugh at it.<br><br>Rent this movie if you ever get the chance and if you're into black humour and/or horrible but great films.  And make sure to watch out for the biker, wrestling and Vitamin scenes.  If you aren't rolling on the floor laughing at the end of it, never rent another B-Movie again.","user":"b. koski","rank":[13,16]}]