[{"title":"Ad-libbed","rating":7,"date":"23 March 2004","review":"From the very first Road picture Hope and Crosby were known for their ad-libbing. In fact when they guested on each other's shows the two of them would take the script and insert some of their own lines to try and catch the other off-guard. <br><br>In this Road picture I will swear that the moment the boys and Dotty Lamour were washed ashore on the proverbial south sea island, the picture is one long ad-lib. I am sure the director said, here's the plot situation just make it up as you go. It's got that kind of spontaneity.<br><br>Look for 'guest' appearances by Jane Russell, Humphrey Bogart, Martin and Lewis and Bob Crosby in this wacky romp.<br><br>Says Dotty: \"I love you Bob, I love you Bing, my heart's in a real wing ding.\" So do we all.","user":"bkoganbing","rank":[35,36]},{"title":"A movie that's pretty dang funny","rating":10,"date":"8 February 2006","review":"I'm 14, and I'm a huge fan of Bob Hope. I got this movie for Christmas and I loved it. It was so darn funny. Bing Crosby, Bob Hope, and Dorothy Lamour all did a tremendous job. I was laughing my butt off throughout the movie. It was also great seeing Humphery Bogart, Dean Martin, and Jane Russell in cameos. Bob Hope is most funny when performing with Bing. They're a great comedy team. He has delivered lots of funny lines in this movie. It was funny how he made references to being in a movie or how Bing already had an Oscar. Bob Hope is one of the greatest comedians who ever lived and you all know it. Here's to Bob Hope!","user":"ajlposh","rank":[24,28]},{"title":"Look at those girls!","rating":10,"date":"14 June 2000","review":"The jokes just keep on coming in this 'Road movie'. There are so many gags here, you'll have to watch this film more than once to get them all. Although the story is very simple, the sets, the girls and especially the amazing Technicolor is a treat to watch. The Road To Bali is the medicine for a grey day!","user":"Chris-147","rank":[22,26]}]