[{"title":"Corruption in higher places","rating":8,"date":"12 January 2006","review":"Fritz Lang, a man who knew the business like no other, is seen at the top of his craft with this interesting film noir that pays off in unexpected ways. Mr. Lang was a man that believed in total control and who wanted to get the best out of everyone in all his films. \"The Big Heat\" is one of those rare films in which all the elements come together with surprising results.<br><br>Corruption in higher places is the basis of the story. A good police detective who cares enough to keep on probing into the suicide of one of his comrades, is what brings Dave Bannion, not only to the attention of the higher ups in the police department, but to Lagano and the mobsters that work for this evil man. Tragedy finds a way into Dave's home that makes him even more resolved into seeking justice and unmasking the mobsters found along the way that have a grip on the police department.<br><br>The casting of \"The High Heat\" is what makes this film different from the rest of the films of the genre. Glenn Ford made an excellent appearance in the film. He gives one of the best performances of his career. But of course, the film belongs to Gloria Grahame, the bad girl in most of the films of this genre. What a joy it's to watch her! Her Debby Marsh is one of the best roles she portrayed for the movies. Surprisingly, Ms. Grahame and Mr. Ford show a lot of chemistry in their scenes together.<br><br>The others in the film do good work under Mr. Lang's direction. A young Lee Marvin is perfectly creepy as Vince Stone, a man who gets what's coming to him at the end in a memorable sequence playing against Ms. Grahame. Jeannette Nolan makes a valuable contribution as the bad widow of the man that commits suicide. Alexander Scourby, as Lagana has some good moments. Joselyn Brando plays Dave's wife. Also, in a small part we see Carolyn Jones.<br><br>\"The Big Heat\" demonstrates why Fritz Lang was one of the best influences in the American cinema.","user":"jotix100","rank":[66,72]},{"title":"Taut, gripping, vintage cop thriller","rating":8,"date":"22 June 2004","review":"It's doubtful that even Dirty Harry in his most menacing moments could match the smouldering rage that Glenn Ford brings to the screen in this  excellent 1953 Fritz Lang flick. From a modern POV there is nothing unfamiliar here, except maybe the dated hardboiled lingo. The maverick cop, the revenge theme, the underworld characters and heroines. It's just that whereas a modern director would make this into a predictable two hour yawn-fest with slow-motion car accidents and ten minute shootouts with shoulder-launched missiles, Lang's movie clocks in at under 90 minutes, and there isn't an ounce of fat on it. It's lean, fast-moving and engrossing. Not a single camera shot is wasted or unnecessary. The script crackles, the cast is uniformly excellent, and Ford and Lee Marvin in particular are unforgettably intense. Ford, just when he's about to go way over the top, reins himself in, adding to the aura of barely suppressed violence in his character.<br><br>The movie can also lurch from plot exposition to sudden, economical and unexpected explosions of violence which can still shock today and must have been extremely confronting fifty years ago. And from there it can become suddenly, unexpectedly sensitive and moving. <br><br>Nothing is wasted in this movie. Everything is nailed down just right. It's not that they don't make them like this any more; it's more that they've been making them like this ever since, and generally to lesser and lesser effect.<br><br>A strong 8 out of 10.","user":"Lupercali","rank":[111,125]},{"title":"nice attention to detail","rating":8,"date":"24 March 2005","review":"A violent story about a detective working in a corrupt department who investigates the apparent suicide of a fellow officer. Worth seeing for Glenn Ford's prototypical performance and Gloria Grahme's show stealing portrayal of a boozing moll with a conscience. With facial disfigurement and cigarette burns it took violence up a notch from the standard gun play of the past, making it grimmer and more realistic, and giving the story more punch. Grahme's tough and tender role stands out and gives the film a tragic element, while certain of its portrayals of greed and corruption (namely the dead officer's wife) stand out for their attention to detail. In the end, it IS the details that give this formulaic story its clout, and we can thank director Fritz Lang for that.","user":"RanchoTuVu","rank":[42,47]}]