[{"title":"Excellent occult thriller with a surprising end, worth to be seen","rating":9,"date":"19 December 1999","review":"This is one of the best occult thrillers ever made. Direction, acting, cinematography and the music score are superb as is the script based on the Fred Mustard Stewart novel with the same title. Curd Juergens plays a famous concert pianist and Barbara Parkins his adoring incestuous daughter. Wanting to make their illicit love eternal they feel compelled to make ritualistic human sacrifices to Satan. The film aided by an excellent Jerry Goldsmith score manages to create an unsettling and more and more threatening atmosphere as the true nature of these two becomes clearer and a journalist played by Alan Alda gets drawn into their web. His wife, played by Jacqueline Bisset, sees the imminent danger in nightmares. These dream sequences that gradually unveil the shocking truth are extremely well filmed and the music enhances the emotional impact even further. This one is a real chiller with some very frightening moments and a very surprising end. Its many disturbing images will haunt you for quite some time. It proves that elegant filmmaking becomes the horror genre very well. I'd love to see The Mephisto Waltz released on DVD!","user":"Kar-2","rank":[31,36]},{"title":"A memorable horror film","rating":8,"date":"5 October 2007","review":"Quinn Martin Productions venture into theatrical films as opposed to its television work is a tidy little entry in the Satanic genre which the late 1960s and early 1970s were chock full of and it is sad that we do not see such films today.<br><br>The stunning beauty Barbara Parkins and the irrepressible Curt Jürgens steal the show and turn in performances that dwarf the rest of the cast. This is a low budget film and yet without all of today's special effects it is readily more thrilling and frightening than the typical horror film of contemporary American film.<br><br>Thank heavens it is on DVD I saw it originally and now eagerly seek to have it for my collection.","user":"Linda_S","rank":[23,27]},{"title":"He Just Doesn't Seem His Old Self","rating":20,"date":"20 January 2008","review":"Too bad this neglected horror film got lost in the wake of the similarly themed Rosemany's Baby. Modestly successful journalist Alan Alda suddenly becomes a successful concert pianist following a chance meeting with piano virtuoso Duncan Ely (Curt Jergens) and his darkly seductive daughter, Roxanne (Barbara Parkins). His growing involvement with the wealthy family and their strange friends eventually comes between Alda and his loving wife, Paula (Jackie Bissett). As sinister events unravel, Paula is drawn deeper into a web of diabolic happenings until the threads come together in a surprising and oddly gratifying climax.<br><br>The script is tight and well-thought out, with the exception of Dillman's role as Roxanne's ex-husband. After all, if the diabolists are so sexually compelling, how could he divorce her. And though director Paul Wendkos occasionally goes overboard with the camera tricks, the scenes are stylishly done, especially the banquet with its snatches of pretentious banter, and the New Years party with its erotic grotesqueries bound to end in an orgy. And underneath it all lies an undercurrent of evil, even during the brightest splashes of sunlight.<br><br>Though Alda gets star billing, it's actually Bissett's movie, which she carries off in finely shaded fashion. Her scenes with the ominously silent Roxanne (just count Parkins' few lines) amount to an exquisite model of civilized contempt, minus the fisticuffs. Alda too, shines, as he acts out Ely's imperious manner at just the right moments, proving in those pre-MASH days that he was more than the humorously caustic Hawkeye Pierce.<br><br>As good as the movie is, I can't help wondering if it might have been even better had the mystery not been exposed as early as it is. Suppose the script had skipped the transference ritual and simply had Alda take on Ely's characteristics without explanation, such that the audience would have to ponder what's going on, instead of having it handed to them. There may have been good reasons for not taking this mystery route, but at least it's worth considering.<br><br>Still and all, Waltz remains a fine example of movie horror done in both color and sunny surroundings, and with a lot of style and conviction. Too bad, it's slipped into movieland's version of yester-year oblivion. It deserves better. And, if nothing else, the script raises the scary question of whether dogs really are man's (woman's) best friend.","user":"dougdoepke","rank":[16,19]}]