[{"title":"Entertaining action - plus!","rating":22,"date":"22 August 1999","review":"No Tommy Lee Jones fan should miss this outing. While it's not great cinema, it IS great fun. The action is top-notch and the characters are appealing. The relationship between Jones and Hamilton is surprising well-balanced for an 80s action film and some of the lines are definitely ones to put in the memory bank and quote. It has a bit of everything for a fun rent (or purchase) - action, romance, coldly wicked villains, a flawed hero, a strong heroine, humor and a bit of pathos. (Watch the emotions play across Jones' face in his conversation with Keenan Wynn.) It's a favorite in my circle of film fans.","user":"bianca-13","rank":[31,33]},{"title":"Tommy Lee Jones \"rises\" to the occasion","rating":12,"date":"12 September 1998","review":"A typical 80's action film with an anything but typical plot, Black Moon Rising is not only a film with a memorable story but also admirable acting. Jones, as usual,  delivers a great performance, with Linda Hamilton and the always watchable Robert Vaughn backing him up with their immense talent.  Above average stunts, an intriguing score, and a fast-paced and, at times, light-hearted script all combine to form a fun and memorable film.","user":"JBond007","rank":[33,37]},{"title":"Nice little action film.","rating":23,"date":"23 September 2003","review":"John Carpenter wrote the story for this stylish exciting action film from 1986, although the film seems to have a rather low budget, must be because it was made through Roger Corman's old company, New World Pictures. In any rate, Tommy Lee Jones is great in one of his most exciting roles, before he became a major star. Jones plays Quint a man who steals from the government. He steals a certain disc and hides it in a 21st century car built by a former NASA agent. However, the problem is, he is being tracked by government agent Johnson (Bubba Smith) who relies on his famous line \"don't **** with the government!\", which I truly enjoyed. Quint also falls in love with a young woman named Nina (Linda Hamilton) who just so happened to steal the car that has the discs in it. It becomes a fun filled, action packed chase in the end, and the action scenes in the LA skyrise buildings are awesome. The supportive cast is topped off by Robert Vaughn, playing his usual villian role, while Richard Jaeckel, Lee Ving, William Sandersen, Nick Cassavettes and Keenan Wynn occasionally steal the scene. Black Moon Rising is a fun filled little action film, which I liked.","user":"eddy-28","rank":[26,30]}]