[{"title":"A simple Western with powerful scenes and spectacular outdoors","rating":6,"date":"8 February 2010","review":"When a homesteader (Ben Johnson)'s daughter (a gorgeous Lana Wood, Natalie Wood's sister) is abducted by a Cheyenne Indian (Alex Cord), one of the greatest Cheyenne warriors who ever lived , the father launches a search for her recovery . He's is accompanied by an Indian friend (Iron Eyes Cody) and a frontiersman (Jack Elam). They spend time doggedly pursuing his kidnapped daughter when are attacked by a bunch of nasty Indians and then the hard-hearted trapper takes revenge .<br><br>This nice and well-paced Western contains adventure , interesting characters , romance , shootouts and spectacular fights . Action Western is pretty good , stylishly developed , a first-rate story and powerful told too . A great featured-role acting by veteran Jack Elam leads some eye-catching supporting performance along with Ben Johnson and Paul Fix . Appears relevant secondary actor named Iron Eyes Cody , usual player Indian roles (¨Great Sioux Massacre¨, ¨Sitting Bull¨, ¨A man called Horse¨) , though actually of Sicilian origin . Full of wide open spaces with breathtaking landscapes exceptionally filmed ; however it is necessary an urgent remastering because of the film copy is worn-out . The flick was well directed by Charles B Pierce who even appears credited in a brief role . He's an expert on terror genre (¨The Evictors¨ , ¨Boggy Crek¨ I, and II , ¨The town that dreaded sundown¨) and Western (¨Hawken's breed¨, ¨The winds of autumn¨, and ¨Winterhawk¨ realized in similar style to ¨Grayeagle¨). This big-scale adventure will appeal to Indian Western fans because you will find impressive battles and an ending haunting or over-melodramatic according your tastes . Rating : Good , worth a look for fans of Western.","user":"ma-cortes","rank":[17,18]},{"title":"panoramic views with high entertainment value; needs to be watched more than once to be appreciated","rating":7,"date":"14 February 2012","review":"Grayeagle has the makings of a cult film that needs to be viewed multiple times in order to get some of the back story. Written in the late 1970's, it marks something of a transition between the old-style Westerns that don't care a hoot about political correctness, to an increasing awareness that is neither fully-developed yet nor overly strident.<br><br>Most of the key actors are veterans to the screen, with the one exception being Lana Wood who is still a bit of an ingenue here, but enjoyable nonetheless.<br><br>Much of Jaime Mendoza-Nava's music is excellent in the film, though my guess is that a few odd pieces are borrowed from elsewhere, as they come across in sort of a strikingly uneven way in tone, and seem vaguely familiar.<br><br>To the film's credit, attempts have been made toward authentic portrayal of Native culture, although key roles were played by non-Natives. What little of the Native languages are spoken is lovely to listen to. Other authentic aspects include reverence toward elders, interaction between multiple cultures in mutual contact, and Native spirituality, particularly with regard to topics such as dreams and death.<br><br>One of the underlying ironies of the film involves the fact that Grayeagle initially performs the kidnapping out of reverence for the dying wish of his elderly chief (Beth's biological father) who must see his absent child once again or face becoming a ghost. Grayeagle has no thought of himself in the act, but is rewarded richly for his selflessness and self-control by winning the heart of the girl who might have despised him for the deed, and by being endowed by the chief with material wealth.<br><br>Another irony of the film lies in the chief's likely perception of the growing attachment between Grayeagle and the girl, and of the material endowment that he gives Grayeagle functioning as an odd reverse of the Cheyenne custom of Bride Price, which ordinarily would have been paid by the groom's family to the bride's family. Here however, the chief is functioning as both sides of the family, and giving the groom what he needs to win the bride's hostile surrogate white father (who could be doubly hostile when he learns of his deceased wife's infidelity with the chief). The chief is further seeing to the upcoming needs of his daughter, whose aging father and uncle (Iron Eyes) will not always be present to care for her in their isolated prairie homestead existence. One wonders then, if the chief's initial dream of his daughter may have involved much more than just seeing her face to face one more time.<br><br>The fact that this film came out when it did in the late 1970's means that it came out just as the sexual revolution was losing a bit of its initial steam (hemlines were beginning to come down again), but nevertheless was a genie that could never be put back in its bottle. The film is sensual but surprisingly clean for the era, although the viewer may be surprised at the level of tension that is both produced and alleviated by simple physical acts such as hand-holding. An interesting balance is struck between patriarchy of the men in Beth's life, and of the growing strength of her own inner person, which appears to be increasing ironically the more she submits to Grayeagle, who clearly must be a good half-generation older than she (he is graying at the temples a bit), although still young enough to be a more-than-competent defender. Both young people by the end of the film have saved the life of the other twice, further putting the female on an equal footing.<br><br>Some possible sexual symbolism in the film may include the spear and ring game, as well as the entry of Grayeagle into the door of Beth's father's house in the extended final scene as credits are rolling.<br><br>Subtle humor is one reason to view the film more than once, as much of it is easy to miss upon the first viewing. Viewers might want to pay special attention to Alex Cord's easy-to-miss smirks and how they are timed. As mentioned before, the music itself sometimes jarringly moves from serious to comical.<br><br>It would be impossible to come away from this film without a sense of the inter-relatedness of the various humans on the frontier, in spite of racial and cultural tensions that were easily inflamed at the time. Ben Johnson is a Caucasian with an inter-racial household; Cheyenne turn to Shoshone for hospitality; Ben Johnson puts aside multiple justifications for malice and receives the young Cheyenne warrior into his home for convalescence at the end, and probably inter-racial marriage to his daughter.<br><br>Kudos to Paul Fix for being the believable and lovably humble elderly chief; to Alex Cord for overcoming the iron lung in his youth to go on and become a picture of physical health; and to Iron Eyes Cody for being the endearing easy-going uncle who is one of the few characters who know the whole back-story in this film.","user":"rbook41","rank":[8,9]},{"title":"Grayeagle","rating":9,"date":"24 January 2008","review":"I loved this movie and would recommend it as a family picture. I disagree that this is a poor remake of the \"Searchers\" they are not the same at all. Some of the reviewers obviously never really watched the films. I'm a fan of Ben Johnson, Iron Eyes Cody and Jack Elam. I thought Jimmy Clem was so believable in his part of Abe Stroud, though I thought he did a little too much spitting tobacco. Paul Fix was unreconizable as himself in the part of Running Wolf, I would never have guessed it was him. Charles B. Pierce was very convincing as the demented bugler. Lana Wood was very pretty and I think tried to do a good job but she really wasn't a very good actress, at least in this part. Alex Cord was just right in his portrayal of Grayeagle. He really had to carry the scenes he did with Lana. Grayeagle says little because that was the right way to portray a warrior of the day who knew some English but saved it for when he had something to say. Small talk would have been ridiculous for Grayeagle. He used facial expressions and body language very well. Alex Cord was so graceful mounting and dismounting the Appaloosa and rode well centered, it was a pleasure to watch him ride. I always thought Ben Johnson was the best rider I had seen in movies but Alex Cord is excellent. They did a good job picking the horse for Greyeagle to ride, that appaloosa was just the type that would have been ridden in the 1800's not the quarter horse type appaloosa seen in so many movies. Greyeagle's horse looked and moved like the kind of horse a high warrior might ride. Looked like fun to ride if you didn't have to re-shoot too many scenes. I liked the attention to detail of the costumes and blanket for the Appaloosa with the buffalo pictures, meaning kills? I had lots of questions about the meaning of costume items worn by the Cheyenne and customs portrayed in the film. I wish the director could have had Standing Bear tell Beth the meaning of things that went on in the Cheyenne camp so the viewer wouldn't be left with questions about what they were watching. There were a few glaring oops in the film such as the same quilt seen in the Coulter cabin as in Abe Strouds cabin, also the fabrics and colors were all wrong for the period. Shoes on the Indian ponies, though that could be overlooked due to horses used to being shod could come up lame in the filming. I also had the feeling that the Coulter cabin and Abe Strouds cabin were one in the same just changed a little inside. The appearing and disappearing stripes on the legs of the appaloosa, kind of noticeable I think. The music was wonderful and the scenery was beautiful. One of my favorite scenes was Ben Johnson, Jack Elan and Iron Eyes Cody racing across the land shouting to each other and running full out. I think they really had a good time with that scene. Big Oops, Ida Coulter? Trapper Coulters wife was referred to as Maria by the Cheyenne who visited her. The name Ida Coulter was never mentioned. I hope this movie is available to purchase again , I think it's a classic.","user":"MarDendy","rank":[15,22]}]