[{"title":"Enjoyable Contribution To Fifties Western Cycle","rating":5,"date":"4 October 2010","review":"Paramount's PONY EXPRESS (1953) is a reasonably good fifties western. Produced for the studio by Nat Holt - it was made the same year as their pivotal contribution to the genre \"Shane\". And while never reaching the lofty heights of Steven's classic it was competently written for the screen by Charles Marquis Warren. Glowingly photographed in Technicolor by veteran Ray Rennehan and directed with a certain flair by Jerry Hopper it was all played out by a well chosen cast in some handsome Utah locations.<br><br>It is 1860 and Buffalo Bill Cody (Charlton Heston) and Wild Bill Hickok (Forrest Tucker) are sent to California to set up a Pony Express system that will deliver mail from St. Joe. Missouri to Sacramento in the inconceivable time of ten days beating the Stagecoach time by 16 days. Of course the Stagecoach relay station owners are not going to take this destruction of their business lying down and set out to prevent, by any and every means, this \"high speed\" service from ever getting off the ground. Not only must Cody and Hickok fight off many attacks by unscrupulous gangs working for the business men but also must keep the trail free for the express riders from marauding Sioux Indians whose chief Yellow Hand (Pat Hogan) has a long standing feud with Cody. The feud culminates in a fierce Tomahawk fight to the death with Cody being the victor. (This famous duel is not as well depicted here as it was in Fox's \"Buffalo Bill\" (1944) where Anthony Quinn as Yellow Hand and Cody (Joel McCrea) meet half-way across a river to do combat. It was a much more elaborate and exciting sequence.) However I suppose we have to be thankful it was included at all here in this version.<br><br>Performances are generally OK across the board. Heston makes a likable Cody but Forrest Tucker's Wild Bill Hickok is somewhat underwritten and in his mode of dress he looks like he just stepped off the set for a Gene Autry or Roy Rogers B movie. This is really my only crib with the film. Neither leading character looks authentic enough! Cody's hair should have been longer and where was his familiar goatee beard? Hickok's hair is short back and sides which should have been shoulder length and he is without that famous handlebar moustache as well as the three quarter length skirt coat - things the famous frontiersman was known for. However after awhile you get used to the way they look. The female lead is played by the ravishing Rhonda Fleming. An actress of limited talent she really doesn't have much to do except stand around and do what she always did best.....simply look ravishing. Better is Jan Sterling as a feisty gun tottin' tomboy, (obviously loosely based on Calamity Jane) who has the hots for Cody and vies, not very successfully, with Fleming for his attention. The best things about the movie are some good shootouts with baddies and Indians and the exciting scenes of the Pony Express riders racing across the deserted plains.<br><br>A memorable aspect of the picture is the fine score by Paul Sawtell. Sawtell was one of the busiest composers in Hollywood's Golden era. Born in Poland in 1906 he arrived in Hollywood in the forties and started scoring films at RKO Pictures. He had a voluminous output of over two hundred scores which crossed over all genres from Noirs like \"Raw Deal\" (1948) to the Tarzan films of the forties, the Randolph Scott westerns \"Fighting Man Of The Plains\" (1952) and \"Comanche Station\" (1960), war pictures such as \"The Hunters\" (1957) and the science fiction epic \"Voyage To The Bottom Of The Sea\" (1961). His main theme from the TV spin-off of the latter gained great popularity in the sixties. His score for PONY EXPRESS has a splendid main theme. First heard over the titles it is given some spirited variations throughout the picture and excitingly used in the closing scene as Cody, at full gallop, takes off on a mail delivery across a vast open plain. There is also a stately theme to underscore the colourful Indian sequences. Paul Sawtell died in 1971.<br><br>PONY EXPRESS is not by any means a brilliant western but it is an enjoyable colourful oater that is worth watching and remains a fair addition to the genre's fifties output","user":"jpdoherty","rank":[19,23]},{"title":"Forget the History Lesson. Just Sit back and Enjoy...","rating":8,"date":"28 January 2009","review":"Just because \"Pony Express\" is a western and the Indians are characterized as the bad guys, does not mean it is without merit. Certainly viewers who insist that their movies must be politically correct learning experiences or must have educational value like a two hour university lecture will abhor its lighthearted approach and historical inaccuracy. Yet it is precisely this lighthearted approach that makes this movie so much fun.<br><br>The four principals, Charlton Heston (Buffalo Bill Cody), Forrest Tucker (Wild Bill Hickok), ravishing Rhonda Fleming, and hoydenish Jan Sterling serve up a potpourri of good-natured banter (and seem to have a lot of fun in doing so) that makes the running time of 101 minutes and incidental plot just whiz by. If nothing else, this movie serves to remind us that most people do have a sense of humor and that life is not all a funeral dirge.<br><br>California, led by a group of businessmen, wants to secede from the union and become an independent republic, citing the country's general apathy towards it as the primary reason. Eastern businessmen and politicians, on the other hand, feel that, by improving communications between Washington and California, they can discourage the citizens of that remote state from making such an irrational move. To this end they seek the help from Buffalo Bill and Wild Bill Hickok to organize a \"pony express\" which will deliver mail and news from East to West and visa-versa in double-quick time. In attempting to implement the scheme, the two friends must first overcome violent opposition from the owner of a stagecoach line who stands to lose a cross-country mail contract if the plan succeeds, hostile Indians who see the advent of the white man as yet another encroachment to their way of life, and the California businessmen themselves whose interests extend beyond Californian independence.<br><br>Of course, the story is full of historical inaccuracies. Buffalo Bill Cody and Wild Bill Hickok, for instance, barely knew each other. Hickok handled a six-gun much better than Buffalo Bill. \"Pony Express\" riders were mostly teenage orphan boys who had to be \"willing to risk their lives every day\" (Even in those days, businessmen knew how to protect themselves against lawsuits.). But so what? I first saw this movie when I was eight years old and loved it so much that I immediately went to the library to read up on these historical characters and events. Was I upset when I found that so much of the plot had been fabricated? Not in the least. I was grateful that the story was interesting enough to have piqued my interest in this specific chapter of American history. Any movie that induces you to want to learn something more cannot be a bad movie.<br><br>On the plus side, it does have some good action sequences (this was in the days before horses learned to gallop in slow motion), and uses the Indians as enemy only for dramatic effect and not as a source of derision. In fact, the chief, represented by white man, Pat Hogan, is probably the film's most admirable character. \"I have never known Yellow Hand to lie or go back on his word,\" says Cody at one point and it is not without good reason that he shows some remorse after he is forced to kill him.<br><br>It also gives us a look at a young Charlton Heston, before he became a staple of the large, big budget biblical epics. At this point in his career, Heston was still experimenting, trying to find himself as actor by taking on such varied roles as a circus boss, President Andrew Jackson, a South American plantation owner, a soldier of fortune, or a surgeon. Just the fact that he doesn't have to deliver each line as if he were speaking from a pulpit makes his work more interesting, if not necessarily better.<br><br>Best of all, it was here that I saw Rhonda Fleming for the first time. I fell in love with her immediately and wanted to marry her when I grew up. When I watch this movie today, I still think it was a good idea.<br><br>Despite its overall low ratings, I cannot help but like \"Pony Express\". It has amiable characters, snappy dialogue (which emphasizes just how much modern screenwriters have lost their sense of humor) and a plot that moves briskly to its predictable conclusion. If the movie hearkens back to simpler, more clear-cut times, it is at least nice to see heroes who genuinely like each other and who can get the job done while having some fun doing it, rather than today's friendless, dour-faced loners with chips on their shoulders who spend every waking minute searching for \"the truth.\"","user":"gpachovsky","rank":[18,23]},{"title":"Enjoyable Western based on factual account...","rating":8,"date":"12 November 1999","review":"In 1860, Buffalo Bill Cody and Wild Bill Hickok joined their strength to establish a communication route with the East through a fresh and fast relay stations of young riders on horseback...<br><br>Charlton Heston plays the legendary mountain man, buffalo hunter, U. S. Army Scout and Indian fighter and backer of the 'Pony Express' from St. Joseph to Sacramento in only ten days... Forrest Tucker plays his friend Wild Bill Hickok, an U. S. Marshal who brought order to the frontier with many encounters with outlaws among them Michael Moore (Lance Hastings) and Henry Brandon (Cooper) whose plans are to destroy the relay stations and ambush the express riders...<br><br>The film is loaded with action scenes and amusing moments... <br><br><ul><li>When Heston stops a stagecoach and tells the coachman: 'I'm Buffalo Bill Cody.' 'Sure, and I'm Wild Bill Hickok,' replies the driver... Coming alongside and smiling, Heston says: 'Nope, You're not that ugly!'</li></ul><br><br><ul><li>When Heston meets Tucker arriving in town... Their courteous words are replaced by a shooting game, a rare but funny expression of friendship, putting holes in each other's garments including Tucker's nine dollars expensive hat... 'It's fancier than shaking hands,' expresses Jan Sterling to Rhonda Fleming from the window of her hotel...</li></ul><br><br>-When Jan Sterling comes into the presence of the famous 'Pair of Bills,' wishing to increase her impression on Buffalo Bill with a fancy pink dress... Seeing her, Heston notes: 'Why not you go back and put some clothes on!'<br><br>Rhonda Fleming plays Evelyn Hastings, the ravishing wealthy redhead, who falls in love with Heston, leaving alone her brother who never wanted the 'Pony Express' to get through..-<br><br>Jan Sterling plays the sincere pretty blonde who loves so much Buffalo Bill...<br><br>Filmed in Technicolor, this enjoyable Western, based on factual account, is adequately entertaining...","user":"Nazi_Fighter_David","rank":[27,38]}]