[{"title":"Steve Martin Carries the Film to the Top","rating":13,"date":"13 April 2001","review":"Steve Martin's out-of-this-world performance is the main calling card of this hilarious comedy. Martin stars as a moron who has been raised by a poor African-American family. One night after hearing some music on the radio, he decides that it is time for him to go find his place in the world. What follows is a poor man's \"Forrest Gump\". Martin gets into some odd situations and goes from the bottom of the social ladder, to the top, and then to the bottom again. This is a flat-out comedy that is a laugh-a-minute romp. 4 stars out of 5.","user":"tfrizzell","rank":[44,57]},{"title":"Overwhelmingly and brilliantly funny with genius throwaways.","rating":10,"date":"24 December 2003","review":"To enter the realm inhabited by Martin's blissfully original caricatures, you must first be tested for wit, intellect and an innocent revelry in life itself. If you qualify, you will be led on to a rollercoaster of oxygen-sapping gags, stupendously clever motifs, brilliant performances and an absolutely fabulous script. There are gags here so new and surprising that to try and emulate them could only court failure. The joy of true love accompanied by him on the ukelele and on the last stanza by her on the........ trumpet: and a beautiful little song. Is it the humour or the innocence brings a tear to your eye? Don't call the dog \"life saver\", call him \"s***head\"  -  and for evermore, he is. The white man who is distraught to discover that he is not black. The goodbye note and Martin reading bits of words as they are washed away. The seminal \"all I need\" scene which is milked to the point of asphixia. The Jerk is simply the funniest most understatedly clever movie ever produced. There has simply never been anything this good, nor will there ever be. The message is simple and is a very old one: the buffoon as saint. From Bottom in Shakespeare, to Tristram Shandy, to Chaplin, to the genius understatement of Cary Grant, to Norman Wisdom: they have all touched on and come tantalisingly close, but they have all lacked one ingredient, an ingrediant calledSteve Martin. Like Orson Welles and Kane or Frederick Forsyth and the Jackal or Men at Work and Land Down Under, Martin has played his best shot first, unfettered, undisciplined, unconstrained genius. Let us all be better, brighter, cleverer and genuinely funnier by being the jerk. And if that's too frightening, just watch it.","user":"douglasreid-1","rank":[87,119]},{"title":"Laugh so hard, you'll miss half the movie","rating":27,"date":"27 May 2000","review":"I'm glad that I didn't see this in the theatre, because when I watched it the first time on video, I needed to pause the movie several times just to catch my breath from laughing so hard!  Wait a minute...was that the first time, or the tenth time?  Playing Navin R. Johnson, the white son of a black family, Steve Martin leaves home to find \"his special purpose.\"  By the end of the movie, we all know what that was...to entertain his fans the way he has!  As for Navin's special purpose, if you haven't already seen the movie, you aren't going to get any more information than what's here.  It takes intelligence to play a complete idiot, and Steve Martin does the job extremely well.  Also take note of Martin's costar Bernadette Peters, and the cameo appearances by Jackie Mason and Carl Reiner.  Whoever wrote that people who watch \"The Jerk\" will be quoting its jokes for years after was absolutely right.  This was the funniest of Steve Martin's movies!","user":"MIK7x3","rank":[47,62]}]