[{"title":"Lies My Butler Told Me","rating":10,"date":"11 April 2006","review":"Lies, sometimes, are an act of kindness. Many times I hasten to add. The imagination of a lonely child is ignited by a meek man in love. The man, as played by the extraordinary Ralph Richardson, is a mass of contradictions and yet we understand him. Married to a shrew and in love with Michele Morgan no less. Carol Reed is not a director that comes immediately to mind when one lists the greatest directors of all time, but in my book, is right up there with the very best. No other director has been able to bring Graham Green to the screen with its spirit so gloriously intact. Guilt and fear as riveting entertainment. Suspenseful, funny and beautiful to look at. Go try to top that.","user":"seanodartofilm","rank":[84,90]},{"title":"Fallen Idol one of my favorites","rating":9,"date":"22 August 2005","review":"Fallen Idol is a great film, with all actors in fine form, especially Ralph Richardson, and including the boy. Richardon is the embassy butler married to a shrewish, domineering wife. He has an illicit, albeit discreet love affair with a beautiful young embassy secretary - you can't help but feel for them both. When the shrew is found done in by a fall down the ornate embassy staircase, the wonderful gentlemen detective types enter, ever so politely, of course. Fallen Idol is an example of the best of British movie-making: low key, sympathetic, civilized. The boy's pet snake is a nice touch. A gem; a good example of the type of fine film that I wish could be made more available here. A Graham Greene story, directed by Carol Reed - what more could we want. Another great Carol Reed 'lost' film is 'Outcast of the Islands', also with Ralph Richardson.","user":"rkroningi","rank":[49,56]},{"title":"The Fallen Idol: Minor Masterpiece","rating":9,"date":"14 April 2006","review":"Just saw \"The Fallen Idol\" at the Nu-Art in West Los Angeles on the last day of its one week run, with a new crystal clear 35 mm print. The meaning of the title only becomes clear at the film's conclusion, so I won't say much more on that score. From a Graham Greene novella which I have never read, the author drafted the screenplay, so presumably the film remains faithful to Greene's perennial themes: loyalty and betrayal; faith and faithlessness; marriage and divorce. What makes these issues intriguing is that the film largely revolves around the point of view of an innocent, charming young boy called Phillipe, played to perfection by Bobby Henrey. He lives in the London embassy of a French speaking country, which is a sort of purgatory (always the Catholic themes with Greene) which is both in England and not subject to its laws. He is taken care of by a kind valet/ chef de maison called Baines (understatedly played by Ralph Richardson) and his Cruella De Ville of a wife (played as the personification of small-minded evil by Sonia Dresdel). Phillipe has no mother (she has been unwell and away for a long time), and no memory of her. Insteads, he has the run of his own Garden of Eden-the huge Embassy with its lovely views over London, great rooms and sweeping staircases. He even has his own snake- a pet that he hides behind a brick on the balcony and carries around in his pocket. He hero-worships Baines, who indulges him and talk to him and hates Mrs Baines who orders him around, hectors him and threatens him at every turn. The story of the film occurs over a week-end, where Phillippe and the Baines' are left alone in the Embassy as the ambassador has gone to bring back his wife from her convalescence, and revolves how Phillipe understands the love triangle between Mr Baines and Mrs Baines and the lovely Julie (played with cheek-bones high) by Michele Morgan, speaking both French and English.<br><br>Look out for some terrific performances by the main cast (especially Bobby Henrey as Phillipe), but also by a series of supporting characters : two washerwomen, a sharp tongued lady of the night, a kindly bobby, several detectives and a perceptive doctor. The photography bears mentioning. There are shades of the \"Third Man\", as well as a great hide and seek game in darkness under the furniture in the empty Embassy, and a truly memorable run through the empty streets of London in the dark. From a personal point of view I enjoyed several scenes shot on location at the London Zoo, which was all very familiar even from a fifty year vantage point.<br><br>The film won a British Academy award so it's not exactly undiscovered, but it's not been easy to find at revival theaters or on DVD, but it deserves to be. As I said at the top, a minor masterpiece which operates on many levels. (Los Angeles-April 2006).","user":"nmarshi","rank":[63,74]}]