[{"title":"Live-action Disney flick with a splash of animation. Well-made, entertaining, but slightly overlong.","rating":6,"date":"11 January 2005","review":"You can be fairly sure with the animated Disney films that you're going to get something good. But with the studio's live-action films there are no guarantees. On the one hand, you might get something like Mary Poppins or 20,000 Leagues Under The Sea - in which case you'd be plenty satisfied. On the other hand you could get something as terrible as Popeye, in which case you'd need a great deal of willpower to make it to the end. Pete's Dragon is one of Disney's live-action ventures (though it features one animated character in Elliot, the dragon of the title). Though a little overlong and rambling, it is on the whole a well-made and entertaining film, and it is certainly a gulf ahead of the likes of Condorman, Popeye and Herbie Goes Bananas.<br><br>Scruffy young orphan Pete (Sean Marshall) is on the run in the woodland of Maine from the Gogan family, a bunch of abusive rednecks led by Lena Gogan (Shelly Winters), who claims that she owns Pete because she bought him at a market. Pete escapes from them, and sets off for Passamaquoddy, a nearby coastal town where he hopes to find safety. Accompanying Pete is an animated dragon named Elliot, who can make himself invisible and who has come to look after Pete until the kid has got his life sorted out. Once in Passamaquoddy, Pete and Elliot inadvertently cause havoc, including scaring the wits out of lighthouse-keeper Lampie (Mickey Rooney). They hide out in some nearby caves, but Pete is found by Lampie's daughter Nora (Helen Reddy), who decides to take him in. Elliot's job seems done (Pete is now safe and wanted, after all) but then con-man Dr. Terminus (Jim Dale) arrives in town.... and soon he's got his mind set on capturing the dragon.<br><br>Like I said, the film is rambling, and from this synopsis it's clear that the plot wanders around a lot, introducing probably more events and characters than necessary. Nonetheless, Pete's Dragon is still entertaining. Jim Dale as the unscrupulous Dr Terminus, and Red Buttons as his dim side-kick, are genuinely funny villains. The blending together of animated Elliot and the living, breathing actors is very good - especially for 1977 - though in a shipwreck sequence near the end the special effects are utterly dreadful. Kids will find a lot to like in Pete's Dragon as long as they can sit still for over 2 hours, and adults too will find pleasures along the way. It's certainly one of the better live-action offerings to come from the Disney studio at a time when their output was quite indifferent in quality.","user":"barnabyrudge","rank":[20,26]},{"title":"One of the best underrated live-action Disney films","rating":9,"date":"23 January 2008","review":"\"Pete's Dragon\" is an enchanting Disney tale that combines live-action and animation. The dragon is the only animated character, but that doesn't change the fact that this is a perfect combination of live-action and animation. This is definitely one of the best live-action movies produced by Disney. One of my favorites. It's cute and charming.<br><br>It looks dated, but that's not a major flaw. Actually, that's part of its charm (which is timeless). There are plenty of beautiful vistas: a lighthouse, mountains, green places, the endless sea and more. Passamaquoddy is a strange name, but the village is nice.<br><br>The dragon Elliott is cute and lovable. He almost resembles Puff the Magic Dragon and has a funny way to communicate. His sounds are awesome. Elliott is a good and innocent dragon, but big and clumsy. Pete is a cute and lovable kid. I enjoy his friendship with the animated dragon.<br><br>There is a nice cast in the film. Sean Marshall is excellent as Pete - he is a very underrated former child actor. Helen Reddy is great as Nora. Mickey Rooney is funny as the silly but comical Lampie. Jim Dale is priceless as Doc Terminus. Red Buttons is very convincing as Doc Terminus's sidekick Hoagy. Shelley Winters plays well her role (the wicked Lena Gogan, the leader of the Gogans).<br><br>This is an underrated film. Yet, it's a nice old-fashioned one. And nostalgic too because it's a reminder of other times and also of my own childhood.<br><br>There are some cheesy moments, but nothing too serious or enough to ruin the movie. One of the few things I don't like about this movie is Pete's teacher. She is so mean, even more when she does that corporal punishment thing to Pete.<br><br>Hoagy is one of my favorite characters. I don't consider him a villain. He's not a bad guy, he's just a poor devil who chose the wrong friend. He is hilarious even in his name. I don't know why, but 'Hoagy' sounds funny to my ears. Classic humor is another solid point of this movie. Many of Doc Terminus's lines are funny, as well as the fact that he never says \"Passamaquoddy\" correctly.<br><br>About the songs, I like most of them very much. My personal favorites are \"Brazzle Dazzle Day\", \"It's not easy\", \"Candle on the Water\", \"Boo Bop Bopbop Bop (I love you, too)\", \"There's Room for Everyone\" and \"Bill of Sale\". These songs are great. Timeless classics.<br><br>This motion picture is one among many examples of great underrated films. Many times I get more surprised with a less popular and less appreciated film than with one of those films that most everybody loves. It doesn't always happen, but most of the universally loved films end up being overrated and turn out to be disappointing because we create too much expectations on them, while a not so known and valued movie I may not expect that much from it but turns out to be a pleasant surprise. That only makes me respect and admire these less valued movies even more.<br><br>This should definitely be on Top 250.","user":"Atreyu_II","rank":[26,35]},{"title":"Not much to say, other than...","rating":10,"date":"14 June 2012","review":"This is one of the best musicals of all time, right up there with The Sound of Music. Yes, I have a lot of nostalgia as I had this on Betamax growing up and wore it out... but now I'm watching it with my own kids and they love it just like I did. This movie holds up and translates well to all generations.<br><br>The songs are fantastic, but my least favorite is the one it may be most known for (Candle on the water). Lampie... Doc Terminus... they're all just really, really good performances of well written songs.<br><br>It has everything a musical needs. Great acting, great singing, great choreography, great story, and a lot of heart. The live action/animation is really good for the time, so there's no reason to get hung up on that. Plus Elliot is awesome.<br><br>I honestly can't understand how this is under 9 stars.","user":"clm12704","rank":[24,33]}]