[{"title":"Machiavellian, Violent, Amoral and Hypnotic Adventure in the Middle Ages","rating":9,"date":"4 June 2005","review":"In 1501, in the Western Europe, in a period when the black plague is jeopardizing the populations, an army of mercenary peasants leaded by Martin (Rutger Hauer) fights side-by-side with the noble Arnolfini (Fernando Hilbeck) to retrieve his castle, with the promise of a huge reward. However, the band is betrayed by Arnolfini, and decides to pay him back, assaulting and stealing a caravan under the command of Arnolfini and his son and student, Steven (Tom Burlinson). In one of the wagon is traveling the fiancée of Steven, Agnes (Jennifer Jason Leigh), who is accidentally kidnapped and later raped by the group. Agnes becomes Martin's mate, and the mercenaries decide to invade a castle, without knowing that the army of Arnolfini is chasing them.<br><br>\"Flesh &amp; Blood\" is one of the best movies in the Middle Ages I have ever seen: it is a Machiavellian, violent, amoral and hypnotic adventure, indeed very brutal, with the peasants being poor and ignorant people, with dirty clothes, spoiled teeth, living in dirty and muddy villages. Therefore, a vision totally different from Hollywood movies, with fancy castles and villages with beautiful people. The direction of Paul Verhoven is efficient and perfect as usual, and the entire cast has magnificent and very natural performances, highlighting the amazing Rutger Hauer in the role of Martin, and Jennifer Jason Leigh who has one of her best performances, in the stunning role of a young woman that uses her body to fight for survival in a hostile environment. I have this movie on VHS, but I bought the DVD recently released in Brazil by the distributor Continental, and it was a worthwhile investment, since the widescreen image and the sound are excellent. My vote is nine.<br><br>Title (Brazil): \"Conquista Sangrenta\" (\"Bloody Conquest\")","user":"claudio_carvalho","rank":[103,112]},{"title":"i haven't written a review in a long time....had to come back and write up this one","rating":9,"date":"29 January 2005","review":"This is one of the most raw, refreshing and UN-Hollywood movies you will ever see. It's truly a classic, and it stands alone, because nothing like it has been done before. The movie is invariably entertaining throughout, and it contains so many fresh ideas from Verhoeven that it really has you saying 'wow' an awful lot. The rape scenes that everybody freaks out about in their reviews aren't so horrible....they get they're point across but aren't TOO sexually explicit. Whats nice to see if you can call it that, is that the rape is real, and horrible, its not meant to be provocative like it would be in a Hollywood movie, not that i'm a fan of any rape scene, not at all...but at least this is genuine. The performances aren't spectacular or anything, but they are far far from weak. After one viewing this is one of my favorite films, and I recommend it very highly to you.<br><br>This film should also be of interest to the highly religious because of all the imagery in it. Verhoeven is known for religious imagery and this film is full of it. It's very Christian in its themes, not that the characters are big in practice, but the movie has a lot of religious points to make.","user":"chickyfornia","rank":[93,108]},{"title":"\"Flesh\" & \"Blood\": Verhoeven's clever euphemisms for \"Sex\" & \"Violence\", his trademarks. Exceptional.","rating":10,"date":"22 September 2001","review":"Ok, we're talking about a movie that's basically titled Sex &amp; Violence by none other than Paul Verhoeven?! Those of us who know better should know what to expect here. For those of you who don't, know this: the same man responsible for the ultra sexy \"Basic Instinct\" and the ultra violent \"RoboCop\" made his debut (in American cinema, at least) with this masterwork concoction of ultra sex AND ultra violence.<br><br>Set in medieval Europe, the utter savagery of the sex and violence in this film is perhaps more at home than it could have been in any other setting. Depredation and debauchery: to the victor go the spoils, be they women, wealth, or what have you. And just a brief word about the plague: there's been a lot of criticism about the accuracy of its use in this movie. How 'bout the sheer ingenuity of it: the use of plague ridden slabs of dog as biological weaponry. Repugnant. Vile. Ingenious. Priceless, I loved it.<br><br>Rutger Hauer is excellent, this is probably my favorite performance of his. He's a power inflated pillager who is a bit of a tyrant to his followers. He's the devil we expect him to be. Jennifer Jason Leigh is surprisingly good in her youth as a sexually curious, devious little wench whose loyalties sway with the wind. She's a survivor. <br><br>Who this movie is NOT for: Those who have to think too hard about every movie they see, who demand a certain level of intellectuality (which is commendable). Plot holes? Are you kidding me, what plot? This isn't English Patient, its Sex and Violence. And for those with inhibitions about film content, who demand a certain level of decency (which is understandable), again, Sex and Violence, this movie is certainly not for you.<br><br>One of the few films I would call a masterpiece. But that's coming from someone who thinks Apocalypse Now is the finest cinematic experience ever realized, so take that for what its worth. RoboCop, I would call a masterpiece. U Turn, I would call a masterpiece. Big Lebowski, I would call a masterpiece. Flesh &amp; Blood I would call a masterpiece.<br><br>10/10 easy","user":"Kill-Gore","rank":[98,121]}]