[{"title":"Tense, Atmospheric Thriller","rating":14,"date":"14 May 2001","review":"\"Sabotage\" is one of Alfred Hitchcock's least known features, but it is part of a string of fine films he made during his last few years in England, and is well worth watching for any Hitchcock or thriller fan.  The picture is based on a classic novel by the great Polish-English writer Joseph Conrad.<br><br>This is a tense, atmospheric thriller, without much humor.  It is more like \"Vertigo\", \"I Confess\", or \"The Birds\" than \"North By Northwest\" or \"The 39 Steps\".  Instead of humor, Hitchcock concentrates this time on carefully constructing the world of the Verlocs, the family at the center of the film. The setting, in a movie theater where the family works and lives, is an important part of the themes and questions explored in the film.<br><br>\nThe characters are constantly walking in and out of the theater while movies are in progress, or discussing the movies being shown as they go about the main actions of the (actual) film.  The obvious themes of appearance and reality parallel the lives of the Verloc family, and especially Mr. Verloc (Oskar Homolka) whom we know from the beginning to be a terrorist, albeit an amateurish one, and not the mild-mannered family man he appears to be. The settings of Verloc's meeting with his co-conspirators, an aquarium and a bird shop, are also carefully chosen to demonstrate the contrast between the everyday appearance of the terrorists and their actual agendas.  Besides the obvious implication that such persons may be those we would not suspect, there is also the strong suggestion that these conspirators do not themselves realize the serious nature of the game they are playing. Certainly Verloc himself quickly realizes that he is in over his head, and he tries desperately to get out of the fearsome responsibilities he has accepted.<br><br>Hitchcock buffs will enjoy watching the film repeatedly to catch all of the carefully crafted detail, and to enjoy the trademark Hitchcock touches. There are two particularly riveting sequences.  One occurs when Verloc sends his wife's young, unsuspecting brother on a dangerous errand, leading to a sequence of excruciating tension.  Hitchcock later said he should have ended the sequence differently, and many viewers might agree, but what happens is in keeping with the themes and plot of the movie, and the suspense sequence is also masterfully done.  Also well-known from \"Sabotage\" is the sequence when Mrs. Verloc (Sylvia Sidney) learns the truth about her husband's activities, and the awful consequences of his latest plot.  There is first a touching sequence in the theater, when the Disney movie playing on the screen first provokes Mrs. Verloc to involuntary laughter, then to deepened sadness when it too closely parallels her own experience.  Then there is a tense, famous scene at the dinner table, filmed as an absolutely masterful montage by Hitchcock.<br><br>These scenes, and the finely crafted atmosphere of \"Sabotage\", make it worthwhile despite a few small faults, and despite the possibility that many viewers will not be comfortable with some of the plot developments.  Watch it at least once if you are a Hitchcock fan, or if you like spy stories or thrillers.","user":"Snow Leopard","rank":[47,53]},{"title":"A Great Sylvia Sidney Vehicle (before \"Beetlejuice\")","rating":9,"date":"11 February 2005","review":"Like most Hitchcock films, \"Sabotage\" is a great thriller directed with a fluid, self-assured style. But given its thriller genre what makes \"Sabotage\" unique is that moments into the movie we know the identity of the saboteur, we know who is the undercover detective, and we know that the police have all but solved the case. So Hitchcock's suspense must come from somewhere else and in the meantime he must entertain us with character development. And that task falls to his heroine. Hitchcock had an uncanny ability to cast actresses who were a perfect fit (at that exact point of their career) to play a particular heroine. Fortunately he again makes the right choice and we are treated to a fine performance from Sylvia Sidney (imagine an expressive Sasha Cohen without ice skates).<br><br>The film is essentially a Sylvia Sidney vehicle as she plays a woman who slowly realizes that her husband is a monster. She is a young American woman who married an older European (nationality unknown) man who apparently showed kindness to her and her young brother Stevie (played by Desmond Tester) when they were down on their luck. They moved to London to run the Bijou, a struggling movie house.<br><br>Among the notable scenes is the meeting between Sidney's husband (played by Oskar Homolka) and a spy contact at the London aquarium; to the backdrop of a huge turtle swimming in an illuminated tank. The tank cross-dissolves into Piccadilly Circus as it is demolished in his imagination.<br><br>Another is late in the film when Sidney sits in the theater in numb shock, watching a Disney cartoon ( ( \"Who Killed Cock Robin ?\" )). There is not a word of dialogue but her eyes and expressions subtly convey an emotional cavalcade of stunned realization, immense sadness, and barely suppressed hysteria that will stay in your memory forever. It is a rare example of the visual power of film and an illustration of what acting for the camera is all about.<br><br>And perhaps most amazing is the long and unbearably suspenseful journey of young brother Stevie across London, unaware that he's carrying a ticking time bomb.","user":"aimless-46","rank":[59,68]},{"title":"Sabotage holds up much better than some of Hitchcock's later films","rating":10,"date":"3 November 2005","review":"What an opening. The power goes off all over London as the camera gives the viewer a sweeping panorama of the situation, light, shadow, blackness, panning throughout the city with emphasis on historical sites. Then one word utterances from several different persons in charge of keeping the power up and running. This beginning grabs the audience's attention better than any other film this side of \"The Letter\" and Hitchcock's own \"Rebecca.\" But unlike \"The Letter\" where the opening is the high point of the entire film, \"Sabotage\" keeps getting better and better. The opening is truly just the beginning of a cinema masterpiece. Hitchcock uses old film techniques such as cross cutting in novel ways. One of the best scenes takes place in a zoo aquarium where water creatures are compared with the human creature. Listen to the dialog between the two saboteurs as the camera zooms in on the sea turtles. Later the bomber thinks of the fish swimming in the tank and then sees motor cars filled with passengers speeding along the streets. An explosion. Suddenly the fish in the tank again flash through the bomber's head. To savor this splendid moment of cinematic brilliance, the viewer may need to zip back and watch and listen as the scene is repeated.<br><br>What a wonderful acting job Sylvia Sidney does. Hitchcock used all his influence and bargaining power to have Sidney play the part. Unfortunately Hitchcock and Sidney did not jell. Their personalities clashed. So the gifted actress refused to have anything else to do with the masterful director. Such a great loss for each.<br><br>The way Hitchcock handles the delicate situation involving the cute boy, Mrs. Verloc's (Sylvia Sidney)little brother, riding the bus with a time bomb in a package under one arm while petting a fluffy puppy with his free hand is necessary for what happens at the end of the film. For once, however, Hitchcock misread his movie patrons who were outraged. Never again would he make a similar mistake.<br><br>An interesting feature of this Hitchcock outing is a cinema owned by the bomber (Oskar Homolka) and his wife (Sidney) where clandestine meetings among the saboteurs occur. Several features are shown in the background from time to time during the film but one stands out, \"Who Killed Cock Robin,\" a Disney short from 1935 featuring a parody of Mae West among others. Hitchcock skillfully blends the clip from \"Cock Robin\" into his story of \"Sabotage.\" Mrs. Verloc deeply depressed and confused following her brother's death hears the laughter coming from the audience. She sits down and joins in with the gaiety. When the arrow is loosed and strikes poor Cock Robin, the laughter on her face changes to an expression of agony and terror. Reality replaces fantasy and make believe. Now she fully realizes what a monster her husband truly is, not the noble sensitive caring man of her dreams. One is reminded how a later director/writer Preston Sturges would use a similar technique with a Mickey Mouse cartoon in his classic \"Sullivan's Travels.\"<br><br>There is also a clear message by Hitchcock on sabotage, today terrorism; those so-called martyrs for a cause are in reality misguided devils who end up killing the innocent and helpless instead of the ones their feeble minds believe to be the deceivers and exploiters of the human race.","user":"krorie","rank":[35,44]}]