[{"title":"A Sentimental Favorite","rating":6,"date":"9 September 2006","review":"THE WIZARD is a sentimental favorite for anyone who raced home after school to turn on their gray and black Nintendo Entertainment Systems. For this set, born in the late '70s and early '80s, the excitement in the air was palpable when previews for the film appeared on TV. It not only combined our two favorite entertainment vehicles -- Nintendo and movies -- but also provided a thrilling sneak preview of the year's most anticipated game, Super Mario Bros. 3. NES geeks (of course they weren't geeks back then... Nintendo was cool) thought they'd died and gone to eight-bit heaven.<br><br>When we finally got mom and dad to take us to the theater or pick up the video, THE WIZARD was every bit as good as we'd hoped. Critics almost universally panned it as a 90-minute Nintendo commercial, but young viewers were enthralled. (Besides... a 90-minute Nintendo commercial wasn't exactly an awful thing!). The film combined very human storytelling with hardy laughs and wide-eyed exhilaration. It gave us playground catchphrases (Lucas with \"I love the Power Glove. It's so bad\" and Jimmy with \"Calli-forn-ya... Calli-forn-ya!\") Sure the highlight was all the cool video game-related stuff, but video games were a big part of our lives, one that our parents just didn't understand. The people who made this movie, whatever their intentions, did.<br><br>Most eight- or nine- or ten-year-olds who caught THE WIZARD upon release would give it two big thumbs up, if not the Oscar for Best Picture of All-Time. Of course we're not eight or nine or ten anymore, and THE WIZARD, in hindsight, is not actually a cinematic masterpiece. But nor is it the sort of mindless junk that stuffy critics would have us believe. The film is actually a sweet, harmless cross-country adventure. It has laughs (who could forget Haley's scream of \"He touched my breast!\" to ward off the hapless Putnam?) and emotion (Jimmy's reflections of his late sister are undeniably heartbreaking). And the video game competition finale holds up surprisingly well even with the novelty of the Super Mario Bros. 3 footage long worn off.<br><br>Beyond that, THE WIZARD carries deeper meanings that children can pick up on. Jimmy, the autistic video game prodigy, demonstrates that all of us, regardless of our limitations, possess marvelous gifts. Putnam, the cold-hearted family services worker trying to take Jimmy away, helps illustrate that families are what matter. And the villainous Lucas is an example of how we should treat our enemies: with dignity and by letting our actions speak louder than our words, as Jimmy does. Okay, it's not exactly Nietzsche, but it's not total fluff, either.<br><br>THE WIZARD is not the greatest movie of all-time. It's probably not even a great movie. But it is a special period piece, a reminder of a simpler time when our only worry in the world was passing math and knocking off goombas. It will forever hold a special place in the hearts of many.","user":"ReelCheese","rank":[63,69]},{"title":"You got 50,000 on Double Dragon?!?","rating":10,"date":"8 August 2001","review":"If you were born between the years 1974 and 1984 and were as obsessed as most of us were about Nintendo games, you will enjoy this movie.  Yes, the plot is predictable and cheesy and the writing leaves a lot to be desired, but I guarantee if you fall into the above group, you will enjoy regressing back to 1989 where having \"all 97 games,\" and \"the power glove (it's so bad...)\" were major status symbols.  If you don't fall into this group, or couldn't really care less about old video games, then you should probably pass on this film.  But for the rest of us, (I used to watch the commercial for this film just to get a glimpse at Super Mario Bros. 3) watch it and enjoy it time after time.","user":"mattdvs","rank":[51,57]},{"title":"What can I say? This was My Childhood","rating":10,"date":"12 January 2009","review":"Well, not really. My life story doesn't resemble that of the characters in any way except for our collective love of video games. That said:<br><br>I watched this movie so many damn times as a kid it'll make your head spin. What can I say about this movie that you don't already know yourself? Fred Savage. Beau Bridges. Christian Slater. The chick from Rilo Kiley. Spanky.<br><br>And then Jimmy brings it all home.<br><br>First of all, I want to say that whatever pills the video game contest host was on, I want me some of that. Two, they should bring back the Powerglove. And three, road trip movies will never, ever die.<br><br>From Double Dragon to Ninja Gaiden or the nostalgic dinosaur park in the middle of no where, this movie will always remain a classic for me.<br><br>\"Gimme, gimme, gimme...Jimmy...Woods!!!\"","user":"TheOliveBranch","rank":[16,17]}]