[{"title":"Inferior production about racism with lots of violence, rape and unpleasant issues","rating":4,"date":"13 August 2009","review":"Hard-edge social drama centers around racial conflicts and is one of the most strange cinematic forays in this theme. The film begins with a bill captioning : ¨Drive carefully you are in Wallace County¨. This is the tale of a sheriff (Lee Marvin) in an US Southern town and a rich owner (Richard Burton) who protects the black men. Marvin receives a huge amount of hostility from the non-tolerant white establishment making his job very hard and every around has to decide the values really lie. The Ku Klux Klan (comes from Greek, Ku Klus that means band or circle and Klan that means family) pursues and mistreats the black people and the sheriff attempting to keep peace on racial tensions. When a young woman has been violently raped (Linda Evans), the white men immediately declare the culpability an African-American named Garth (O.J.Simson). He flees to the backwoods and wishes revenge. Meanwhile the Klansmen form some lynching party hunts and pursue him. The young on the run because the violent group seek to destroy him. But the racist posse kidnaps a beautiful African-American (Lola Falana) and rape her.<br><br>This is a horrifying story of racial violence and xenophobia with countless shots of violation , burning crosses and frequent bad taste. Unfortunately, this is another example of a serious movie about xenophobia and racism in which white roles predominate and African-American characters provide background. Terence Young treads a brutal, gory path in this low-powered look at warped , evil white inhabitants of an American town , and the comparatively clean role played by Richard Burton. Big-name cast is wasted as Cameron Mitchell,Linda Evans, Luciana Paluzzi, David Huddleston as the Mayor, they only partially shine. Rumors circulated about Lee Marvin and Richard Burton , both of whom utterly drunk during the shooting. Even the all star cast can't save this movie because is a nightime Soaper and an exploitation story. Lousy cinematography by Lloyd Ahern and Aldo Tonti, as is necessary an urgent remastering. Furthermore notorious conflicts among producers, director, screenwriters (Sam Fuller, Millard Kauffman) and actors made a real flop. Mid-budget production, and the producers would like to thank the citizens of Oroville for their enthusiastic help and cooperation in the making of the film. The picture belongs a period in which made stories is similar style concerning on racial problems , such as ¨Hurry Sundown¨(1967, by Otto Preminger with Michael Caine, John Philip Law, Jane Fonda), ¨The liberation of L.B. Jones¨(70, by William Wyler with Lee J Cobb, Roscoe Lee Browne and again Lola Falana), ¨Tick, Tick¨ (70 by Ralph Nelson with George Kennedy, Jim Brown), and the Oscarized ¨In the heat of the night¨(by Norman Jewison with Sidney Poitier). And in the 8os stands out ¨Missisipi Burning¨ (by Alan Parker with Willem Defoe and Gene Hackman). Rating : 4,5, below average.","user":"ma-cortes","rank":[16,18]},{"title":"Incredibly brave or incredibly reckless?","rating":6,"date":"5 January 2003","review":"The Klansman could be one of two things. It is either a brave exploration of racial hatred and violence in the US Deep South. Or, it is a reckless film which is trying to generate entertainment by exploiting racial tension. I don't agree with the majority of critics who say that this film is violent and trashy rubbish.... in my eyes, it poses enough interesting questions and pushes the audience out of their comfort zone sufficiently to be a worthwhile film. I wouldn't say that it's a great, misunderstood masterpiece, but it is definitely a film that needs reappraisal.<br><br>The story is set in Atoka County, Alabama, where race relations are balanced on a knife edge. The rape of a white woman by a negro triggers off a campaign of Ku Klux Klan violence, including the castration of a black youth, which in turn leads to retaliation by black extremists such as O.J. Simpson. Thrown into the struggles are Lee Marvin (the town sherriff who knows that racism is bad but tolerates it in order to cling to a degree of order) and Richard Burton (a landowner who sympathises with blacks, but is haunted by memories of what the Klan did to his grand father).<br><br>The film contains at least one unwatchable rape scene and some tasteless dialogue. It also  suffers because Burton is so clearly miscast as a southern sympathiser (his accent is dodgy and he seems disinterested in the story). However, it takes a highly chraged theme and deals with it interestingly and provocatively. The violence jolts you out of your chair and forces you to think about the two sides of the argument. The climax is memorable and leaves you feeling empty and sick, especially at the waste of life caused by the single-minded, lethal actions of racist extremists.<br><br>\nA decent film, then, worth seeing for yourself. The critics got this one wrong. Give it a go.","user":"barnabyrudge","rank":[24,29]},{"title":"Nowhere near as bad as some people claim! Muddled, but still watchable.","rating":12,"date":"12 April 2003","review":"I'd heard a lot ABOUT 'The Klansman' but had never seen it before, and hearing the behind the scenes stories (original director an co-writer Sam Fuller walking off set, stars Lee Marvin and Richard Burton both being allegedly so drunk they couldn't remember making it!) I imagined that it was going to be one of the worst movies ever made. It isn't. Now it isn't all that good, mind you, but it's watchable b-grade trash, and Marvin puts in a good performance, drunk or not. Burton's accent is I agree not too good but he is okay, especially if he like Marvin was as drunk as they say he was. The rest of the cast includes the notorious O.J. Simpson as a one man black revolutionary with a gun and an attitude, 'The Big Lebowski's David Huddleston is a racist mayor, and legendary character actor Cameron Mitchell ('Hombre', 'Ride In The Whirlwind', 'The Rebel Rousers',etc.) as the wonderfully named Butt Butt Cates, the later two both being members of the KKK. Linda Evans also appears as a rape victim who sets off a chain of events which end off in violence and tragedy. The main problem with the movie, and this is most likely because of the drama off camera, is that the movie can't decide whether it's trying to be a serious message movie or an exploitation film using racism as an excuse for some sensationalistic thrills. 'Mandingo' made the following year (and its sequel 'Drum') managed to juggle both approaches with a little more success, but 'The Klansman' suffers for its lack of a clear direction. Even so, this movie is nowhere near as bad as many people claim (people who I imagine have never actually WATCHED it) and is still reasonably entertaining, especially if , like 'Reservoir Dogs' Mr Blonde, you are a big Lee Marvin fan.","user":"Infofreak","rank":[17,20]}]