[{"title":"WAY better than expected!!","rating":9,"date":"5 September 2004","review":"I don't like Japanese anime most of the time. In fact, the only anime I genuinely love comes from Miyazaki and Studio Ghibli. Now, I knew this movie was a Miyazaki film, but the fact that I'd never even SEEN or READ Lupin the series made me veeery hesitant to check this movie out. I'd seen it at the Library movie section but wasn't willing to fork over the one dollar to rent it. <br><br>I finally saw it yesterday, thanks to my sister, and MAN! was it awesome! I didn't expect it to play out like a regular Miyazaki film, but it did in every aspect I can think of: the animation style, the facial expressions, the plot, storyline and script, and the overall feel of the movie screamed Miyazaki. By the end, I even learned to love Lupin and the whole cast of characters who were all strangers to me at the beginning of the movie. <br><br>Aside from the corny 70's music, this movie was fun every step of the way. It was funny, romantic, dramatic, action-packed: everything! So I guess that sums it up well. I'm sorry I didn't watch it before, so now i'm telling you--GET THIS MOVIE! I'm sure you will find at least something in it that will entertain you.","user":"princesszandra","rank":[46,51]},{"title":"Worthy of respect it's denied","rating":10,"date":"16 January 1999","review":"Hilarious comedy, tasteful romance, intense action, and colorful characters.. . No one who sees this movie would believe it was a low-budget 1979 flop. With world name director Miyazaki (few of his movies rank under 9 even on this database), the highly successful Lupin cast and the angelic Shimamoto as Clarisse, who WOULD believe it failed?  This movie is the most underrated movie of all time.<br><br>Just make sure you acquire a GOOD translation, if one exists.  Carl \"the Butcher\" Macek's Streamline Pictures release got horrible ratings due to his unchecked editors, unfaithful translators and third-rate voice actors. Fan-made subtitled copies are far more enjoyable, but quality is still not guaranteed.  Good luck hunting; this movie is gold.","user":"Ryuji-2","rank":[60,68]},{"title":"The grand debut of the master of anime","rating":22,"date":"22 February 2004","review":"\"The Castle Of Cagliostro\"(TCOC) from 1979 is the grand debut Hayao Miyazaki, one of the world`s finest filmmakers and a master of anime. TCOC is a movie that has it all; action, adventure, romance, comedy. It is a superb movie that appeals to everyone. The main character is Lupin, the master thief, who you may know already if you have read the manga which this is based upon. Lupin travels to a European country called Cagliostro, where he intends to uncover the secret of The Castle Of Cagliostro.  This is a must see, and it is also my favorite of all the Miyazaki-films. <br><br>10/10","user":"action-6","rank":[23,25]}]