[{"title":"Better than it gets credit for, but then I'm prejudiced","rating":7,"date":"28 July 2000","review":"Let me confess at the start that: 1) I'm definitely fond of dinosaurs and paleontology in general. This interest LONG predates \"Jurassic Park\".  If a paleontology major had been available in my college, in the early 60's, that would have been my choice. 2) I've also ALWAYS been a big fan of animation and related effects, such as the dinosaurs.  This movie had by far the best dinosaur effects of any prior to \"Jurassic Park\", even better than in \"The Valley of Gwangi\". The baby brontosaurus (actually apatosaurus) was perhaps a little too cutsey with its blinking eyes but otherwise the film captured details of movement, including musculature and skin, very well.  This was at its best when the mother dinosaur was chasing the bad guys in their vehicle. Needless to say I was very sympathetic with the efforts of the paleontologists to rescue the dinosaurs.  I also enjoyed some of the people \"antics\" such as the natives spitting out the granola bars (hippy food) from the sides of their mouths while pretending to like it.  An enjoyable movie if a little saccharine.","user":"dcorr123","rank":[27,36]},{"title":"The ET of dinosaur films","rating":19,"date":"19 May 2004","review":"This is an almost totally entertaining flick which never flags; not in its tongue in cheek dialogue; not in its plot sequences; not in its amazing technical achievements (for its time) in getting the dinosaurs up and running. Sure the acting is pretty much black and white with Patrick McGoohan dispensing villany on the order of Gengis Khan on a bad day and William Katt and Sean Young surmounting all obstacles with a brio and dispatch that would have Arnold panting. There is also Baby herself, consistently endearing though up to, never over, the line. But one doesn't expect a movie about dinosaurs to take time out for character development. What there is of it is in the overly graphic scene of the female dinosaur mourning her slaughtered mate, a transcendent sequence that almost rips the fabric of the piece apart. That it manages to gets back to fantasy after this is a tribute to director B.WE.L. Norton and the frenetic pace he generates throughout. If you never had a dinosaur as a pet, you may be on the lookout for one after seeing Baby.","user":"sisen","rank":[18,24]},{"title":"Does Not Need an R Rating","rating":10,"date":"26 January 2005","review":"Some people are so obsessed with breasts. GET OVER IT! African women don't wear shirts, so why should movies that represent that culture shield anyone from it? Why is this country to sensitive to ethnic nudity? If you think it's too much for your children to see, then don't let them watch it, and most certainly keep them away from the Discovery channel, or any other channel that may deal with cultures in which nudity is seen as a sign of beauty and is perfectly natural. People need to stop being so sensitive. Get over it. As far as the movie goes, it's a wonderful story, and it will teach children about good and bad. Kids need to learn that the hero doesn't always rescue the damsel in distress and live happily ever after. It's easier to show them that through movies, that way when something in real life happens that they're not used to, they will be better equipped to handle it.","user":"AH825-1","rank":[32,53]}]