[{"title":"A Right Little Charmer!","rating":8,"date":"22 March 2012","review":"The Maggie. An underrated, gentle little comedy, the sort of which Ealing are associated with. The storyline packs quite a punch on American capitalism as a tycoon gets to believe that, after cutting corners and underestimating the crew of the 'Maggie', he can buy out his mistake with dollars alone.<br><br>Great cast that play a Clydeside crew, that quietly and cannily let things gently take their course. The scenery is more Whisky Galore than the East-end that is the more usual home of Ealing and the nice black and white photography suits the subject well. Pacing is a far cry from the frenetic of The Lavender Hill Mob and lets it story breathe quietly.<br><br>It's one of my favourite Ealings. If you haven't seen it, give it a try, you might add it to yours, too!","user":"tim-764-291856","rank":[17,17]},{"title":"Update on Tommy Kearins","rating":10,"date":"6 July 2001","review":"At 5th July 2001. Further to my previous review of \"The Maggie\" Tommy Kearins, Dougie the wee boy in the film, is alive and well and living in retirement in Scotland at age 63. He tells me that he was selected for the role after being spotted in the Scouts \"Gang Show\" working backstage. After being interviewed by Ealing he spent 3 months making the film in 1953 and recalls he was paid over 3 times what his father made in the Clyde shipyards. He still takes a keen interest  in the old \"puffers\"  like \"The Maggie\" and hopes to attend a  get- together of enthusiasts at the crinan canal in a few weeks time. The Maggie was actually two boats in the film, the \"Boer\" and the \"Inca\". Phil Hatfield.","user":"philiphatfield","rank":[31,33]},{"title":"A vintage comedy - one of the best.","rating":10,"date":"30 March 2004","review":"I remember vividly the first time I saw this film. It was a grey afternoon, spirits were drooping and I felt as dull as the tupperware sky outside. With no great relish, I turned on the afternoon movie - The Maggie - and gently let myself become enchanted. The word \"gently\" says it all, for this is an uplifting movie, full of charm and the odd brush stroke of pathos. Giggles transform into laughter with this one.<br><br>It's an old tale of local knowledge taking on a Corporation - though in a private capacity as Calvin B Marshall is anxious to deliver some domestic appliances, including 4 baths (\"What all on one island?\" asks the incredulous Wee Boy), to a Scottish retreat, part of his plan to save an ailing marriage. The cargo unwittingly falls in to the hands of the motley crew of a puffer - The Maggie - and then begins a comic chase which is a delight to behold. Once Mr Marshall gets involved in a hands on way, he embarks on a journey of self-discovery. The lessons may be homely and somewhat prissy now, but it's pleasant to wallow in a social world that could never be. More's the shame for us. Still, it remains a wonderful wish-fulfillment world, touched by the gentlest of humours. A marvellous tonic for escapists.","user":"nmorris-2","rank":[22,24]}]