[{"title":"Very high quality adaptation of book.","rating":7,"date":"17 November 2004","review":"I have recently seen this at a museum showing of the film. It is a very well made adaptation of the famous Astrid Lindgren book, Madicken.<br><br>The movie itself is very episodic. There is no real plot as the story really just follows Madicken, a 7-9 year old girl, and her various adventures in the small village where she lives.<br><br>It appears as if the film was originally filmed as a TV series and this film, is just a series of TV episodes edited together to form a complete film. The story is very engaging, as it addresses issues of class, alcoholism, and poverty in a manner that is appropriate for young children. Madicken, herself, is much more of a sweetheart in the movie than in the book, where she is a bit of a troublemaker.<br><br>All aspects of the production are very expertly done. The costumes are extremely authentic looking and beautifully crafted. It is filmed on location in a real Swedish village, so the production feels extremely authentic.<br><br>While it isn't the most serious film ever. The high quality of its content makes this a very worthwhile film to track down for anyone curious in seeing a snapshot of traditional Swedish life in the countryside.","user":"konky2000","rank":[22,23]},{"title":"You are crazy, Madicken.","rating":10,"date":"21 April 2007","review":"I watched this movie several times before I got to the stage where I wanted to know what everyone was saying. Firstly I worked out the title (as I have written it above), and then a friend who speaks fluent Swedish offered to help me translate the entire dialog. I have spent more than 30 hours creating English subtitles for this movie.<br><br>Due to copyright laws however, I am unable to distribute the movie, with the subtitles. Still, I enjoy watching it and being able to know what is being said. Madicken is truly a little sweetheart, as is her sister Lisabet! I would be proud to call either one of them mine! <br><br>As for the nudity, this is normal in that part of the world (and should be in ALL parts of the world). It has NOTHING to do with porn or pedophilia. People who see it as such are narrow-minded and uneducated. Being naked is natural, especially when you are a child. I don't think the movie would be the same without it.<br><br>The more I watch this movie the more I am inspired to continue learning the language. It's a production that takes you to another place and time. The continuity and attention to detail is first-rate. The scenery is magnificent.<br><br>If you can find a copy of it, I would thoroughly recommend it to anyone - young and old alike. Sadly, if you don't understand Swedish (or German if you have the dual-language version) then it probably won't have the same interest.","user":"cabinbread","rank":[16,20]},{"title":"A movie based on Astrid Lindgren's novel \"Madicken och Junibackens pims\", which is about two sisters and their adventures in 1910s Sweden.","rating":10,"date":"19 February 2006","review":"First of all, I'm very surprised to find this movie at this site. I hardly expected any Swedish movies at all.<br><br>Of course, I'm Swedish, but I'm afraid this book doesn't appeal to people of other countries as much as it does to my people. The reason why Pippi Longstocking, or Pippi Långstrump, as I like to call her, since it's her Swedish name, is much more popular outside Sweden than Madicken, is of course that Pippi can appeal to other people too. Madicken lives in a very realistic world, in a small town in Sweden in the 1910s, while Pippi Longstocking, who grew up with pirates, is strong enough to lift up a horse on her hands, and has a suitcase full of gold cons, is almost like a fairy-tale and far more international. However, Pippi is one of the most popular Astrid Lindgren characters within Sweden too, while \"Madicken\" never gets the same kind of admiration. I prefer \"Madicken\" though, and the stories about her are by far my favorites in the Astrid Lindgren production.<br><br>I don't think anyone outside Sweden can understand the status Astrid Lindgen has within our country. When she died in 2002, all other TV shows were cancelled to be replaced by specials about Astrid, and her funeral was shown on TV too. And still, she wrote hardly anything but children's books! However, Swedish children have been brought up with Astrid Lingdren for 60 years.<br><br>I must also explain, that child nudity is much more accepted in Sweden than in America. Of course, child porn is not accepted, but back in 1979, when no one really knew there was such a thing as pedophilia or child porn, there was no problem with showing children naked in a movie as they got dressed or went for a swim. But I actually think there would be more problems, if a movie was done this way today, because nowadays, child porn unfortunately is a well-known issue.<br><br>And I also must agree, that the \"Madicken\" TV series and movies really have nailed what it was like here in Sweden back in the 1910s. Everything about them, especially the clothes and hairstyles, are very authentic. And we're reminded of how much social classes still mattered back then.","user":"furienna","rank":[18,26]}]