[{"title":"Whoa, long trip back!","rating":6,"date":"6 April 1999","review":"I remember watching this film when I was thirteen and just loving it: gorgeous naked women, gorgeous naked women, gorgeous naked women!  Now my thoughts would be: 80s! 80s! 80s!  AAAAGGGH!  Okay, the 80s weren't so horrible, and I have fond memories of them, and this completely trashy teen sex flick (pretty much the quintessential movie of this quintessentially 80s genre) will zoom you back there so fast, you'll get whiplash and snap the flourescent strap on your sun glasses.  Oh, the naked women are still gorgeous, but this thing never can have the same sort of fantastic appeal it did when you were 13 and  afraid your parents would walk in the door while you and your buddies were watching it.","user":"Ryan-77","rank":[25,27]},{"title":"Epitome of a good breast movie","rating":7,"date":"16 April 1999","review":"Before sitting down to watch Hardbodies, decide what you are looking for out of this film.  Do you want a well-written movie with an engaging plot, Oscar-worthy performances and beautifully-written dialogue?  Then stay away from this movie.  Do you want to see a fairly entertaining movie centered around fitting as much gratuitous shots of topless women as possible?  Then you've found what you're looking for!<br><br>Hardbodies is a cheesy, 80's teen sex movie.  But if you like cheesy, 80's teen sex movies, it's actually pretty good.  It's better than any of the other ones out there.  Some funny, quotable lines.  A few entertaining characters.  And many, many hot naked women.  I mean, really -- how can you go wrong when there's bikini tops flying off before the opening credits even end?","user":"FFT5305","rank":[17,18]},{"title":"if you dont like it, you dont know what the 80's are!","rating":10,"date":"2 April 2001","review":"This was a funny movie! true it was medicore acting, but hell that is what the 80's comedies were like.  I laughed, i enjoyed the music, this is what it is about. oh yeah, i liked the hardbodies too! btw yes there was plenty of nudity, but heck such is life that is why it is rated R anyways, keep the kiddies out of the room and quit complaining!","user":"the_advenger","rank":[12,14]}]