[{"title":"Interesting Civil War melodrama that helped inspire Keaton","rating":17,"date":"17 November 2001","review":"The DVD \"Civil War Films of the Silent Era\" has three Thomas Ince productions on it-- the highly successful 1915 feature The Coward, starring Charles Ray and Frank Keenan (Keenan Wynn's grandfather, incidentally, and at times you can definitely tell), plus two shorts from 1913, Granddad and The Drummer of the 8th.  The former is directed by Reginald Barker, who I daresay is the only director most of us could associate with Triangle (he directed The Italian, Civilization, several Hart westerns, etc.)<br><br>It's pretty tough not to compare a 1915 film about the South to a certain D.W. Griffith film, and on the evidence Barker was highly capable and in some ways more fluid in his storytelling than Griffith, but didn't have Griffith's eye for the iconic actorly gesture that summed up character in a flash.  There's nothing flashy about the on-screen agonizing that represents the delineation of character here, which is well acted for the period but takes literally a third of the movie to get across a fairly simple setup-- Dad (Keenan) is a proud Suthanah and gennelmun, Son (Ray) is a weakling who runs away from the enlisting office, and Dad orders Son to sign up and remembah that he is a Winslow, suh.  There's a lot of knuckle-biting to get to that point.<br><br>Once Ray deserts the movie picks up noticeably, and the action scenes are very nicely handled-- the manner in which Ray eludes capture in his own house is ingenious and nicely in character for someone who was a boy in the home, for instance.  Watching it there are enough echoes of The General-- the enlistment opening, spying from beneath a table, etc.-- that you have to think that Keaton was drawing on memories of it, even if unconsciously.  The battle scenes are fairly brief but impressively scaled (especially next to those in the shorts-- it's much like the difference in scale between the battle in The Battle of Elderbush Gulch and The Birth).<br><br>But perhaps most interesting is what's missing-- The Birth's racial attitudes.  This is much closer to Gone With the Wind's benevolent-paternalist view of master-slave relations, and while a definite air of Old South nostalgia/apologia fills the film, it feels right, for instance, that when Ray first sneaks into his home as a deserter, it's the servants who probably really raised him who take him in and try to ease the discovery of his action by his parents.  (Of course, they may also have approved of desertion from the Confederate army...)","user":"mgmax","rank":[17,17]},{"title":"Likable Early Silent with an Appealing, if Now Forgotten, Star","rating":7,"date":"29 January 2006","review":"The simple and, by now, oft-told tale of a son who fears that he cannot live up to the high standards of his father may have been fresher in 1915 than it seems today. However, viewers of early silent films should put themselves into the perspective of the times and relish a Civil War story that was filmed while many in the audience could still remember the actual war. The Civil War took place only 50 years before \"The Coward\" was made, which is approximately the same time span between World War II and \"Saving Private Ryan.\" A fresh-looking Charles Ray portrays Frank Winslow, the son of a proud and unyielding Southern gentleman, and his performance is the most naturalistic of the small cast. A handsome young man with an appropriately innocent demeanor, Ray manages to convey his ambivalence about resisting enlistment in the Confederate Army, a move that will alienate him from his stern father, who insists that his son uphold the family honor. Bowing to his father's orders and threats, the young man joins the army, where he makes a fateful decision. Although subsequent events play out as anyone could predict, viewer interest never lags because the film is tight and decently paced.<br><br>Unfortunately, much of the cast, especially Frank Keenan as the father, are either stiff or overly emotive in their roles, which makes Ray that much more appealing in contrast. Characteristic of the times, white actors in black face play the two household slaves. While the condition of the print makes evaluation of the cinematography difficult, the interior scenes for the most part betray the flimsy sets that were used. However, the exterior shots, especially the brief battle scenes, are convincing and effective.<br><br>\"The Coward\" is an amiable film with a well-worn plot and is likely typical of silent films that were produced prior to the 1920's. While neither a work of art nor even the best of its era, the film offers an interesting glimpse of what entertained moviegoers during the years before World War I.","user":"dglink","rank":[13,13]},{"title":"Interesting Period Melodrama","rating":6,"date":"6 February 2006","review":"This interesting period melodrama ties together several themes, and generally succeeds in examining them during the course of the story. Neither of the most prominent characters (the father and son) are especially sympathetic, and yet the story is such that it involves your emotions for both of them, even when their actions are discreditable.<br><br>The 'coward' of the title is the son of a retired colonel, whose father insists that he enlist in the Confederate Army when the Civil War begins. \"The Coward\", like an earlier Thomas Ince feature, \"Drummer Boy of the 8th\", depicts the unfounded mass excitement that accompanied the outbreak of war, this time on the other side. Here, the son is practically the only one not filled with enthusiasm for the South's war effort. The crisis comes later on when the 'coward' is the only one who knows a piece of vital information.<br><br>The story that develops features several interesting turns, and it brings out various points not only about bravery and duty, but about family relationships and other themes. Some aspects of its perspective may seem a little odd now, but it presents its ideas believably and without overstatement.<br><br>Both the action sequences and the confrontations between father and son are often given Ince's attentiveness to detail and composition. Whether intentional or not, in a number of the family scenes the characters' movements are particularly deliberate, with the effect of drawing out their sometimes uncomfortable conversations, and thus increasing the tension. There is also quite a contrast established between the very civilized study in which the father repeatedly lectures his son, and the brutal tactics that he uses to get his son to do his bidding.<br><br>Civil War features were quite popular in this era, and there are others that are better remembered, but this movie has several strengths, and it provides a slightly different perspective of its own.","user":"Snow Leopard","rank":[6,6]}]