[{"title":"Joffe's best work to date","rating":10,"date":"22 January 2003","review":"Based on the Khmer Rouge revolution in Cambodia, this is an excellent tale of hardship and friendship. Basically director Roland Joffe` did an wonderful job in exposing the detailed facts so simply in the film that you believe that you are in that time in person. The two actors, Sam Waterson and Haing Ngor both displayed godlike pieces of acting. It's unfortunate Waterson couldn't join Ngor in Academy Awards. In addition, the director's credit is to highlight both the characters' points of view. That's why the movie became so interesting to watch. John Malkovich brought out a fine performance as a photographer. <br><br>In the course of the story of adventures of the two men, the film also has vivid descriptions of the public life during the war. Several detailed scenes of war violence are presented here so indifferently that you are bound to be convinced about its historical accuracy. Here we find the magical cinematography of Chris Menges. Again, during the time of Dith Pran's suffering, it never seemed that the director is showing too much.<br><br>One of the most important, and my favorite, aspects of the film is its ending. You cannot imagine of a better alternative of this happiest ending possible in a war drama. And with the fantastic use of Lennon's \"imagine\", it has got to an enormous height of perfection. 5/5.","user":"shanfloyd","rank":[57,65]},{"title":"Thrilling story about loyalty , friendship , political intrigue and love during the horrible war in Cambodia","rating":9,"date":"23 August 2010","review":"Thought-provoking war-drama based on the memoirs of N.Y. Times correspondent named Sidney (Sam Waterston) and his relationship to journalist assistant and guide named Pran (Haing S Ngor ) . Extraordinary feature debut for Ngor who won Best Supporting Actor Academy Award . Haing S. Ngor a real-life doctor who had never acted before and who lived through the deeds depicted at the movie , he became the first Southeast Asian ,and the first Buddhist, to achieve an Oscar ; furthermore also first film for John Malkovich who makes an awesome portrayal as intrepid photographer . Ngor's own experiences ( in real life he lived Cambodian war ) echoed those of his character and usually played Vietnam roles ( Tortures of war, Heaven and Earth,In love and war, Vietnam Texas, Eastern condor) until his violent death by an Asian band . This exciting story depicts the war chaos , Cambodian turmoil and primal bloodletting but most of the movie is a shattering re-creation of hell on Earth . Marvelous cinematography by Chris Menges who also deservedly won Oscar and filmed in Phuket, Railway Hotel, Hua Hin, Thailand and Royal York Hotel, Toronto, Ontario, Canada . Screeching and sensible musical score by Mike Oldfield that accompanies perfectly to the film . Roland Joffe's direction shows a generally sure-hand with a bit of melodrama at the end . Alain Resnais's seminal documentary ¨Nuit et Brouillard (1955)¨ was a touch-point for both director Roland Joffé and prestigious producer David Puttnam when they were preparing this magnificent movie. <br><br>This excellent movie contains a relentless criticism to Pol Pot regime , but also US and an exact description about historic events . In power, the Khmer Rouge carried out a radical program that included isolating the country from foreign influence, closing schools, hospitals and factories, abolishing banking, finance and currency, outlawing all religions, confiscating all private property and relocating people from urban areas to collective farms where forced labor was widespread. The purpose of this policy was to turn Cambodians into \"Old People\" through agricultural labor. These actions resulted in massive deaths through executions, work exhaustion, illness, and starvation. In Phnom Penh and other cities, the Khmer Rouge told residents that they would be moved only about \"two or three kilometers\" outside the city and would return in \"two or three days.\" Some witnesses say they were told that the evacuation was because of the \"threat of American bombing\" and that they did not have to lock their houses since the Khmer Rouge would \"take care of everything\" until they returned.Money was abolished, books were burned, teachers, merchants, and almost the entire intellectual elite of the country were murdered, to make the agricultural communism, as Pol Pot envisioned it, a reality. The planned relocation to the countryside resulted in the complete halt of almost all economic activity: even schools and hospitals were closed, as well as banks, and industrial and service companies.During their four years in power, the Khmer Rouge overworked and starved the population, at the same time executing selected groups who had the potential to undermine the new state (including intellectuals or even those that had stereotypical signs of learning, such as glasses) and killing many others for even breaching minor rules . The Khmer Rouge forced people to work for 12 hours non-stop, without adequate rest or food. They did not believe in western medicine but instead favoured traditional peasant medicine; many died as a result. Family relationships not sanctioned by the state were also banned, and family members could be put to death for communicating with each other. In any case, family members were often relocated to different parts of the country with all postal and telephone services abolished. They committed crimes against humanity , the Khmer Rouge government arrested, tortured and eventually executed anyone suspected of belonging to several categories of supposed \"enemies\". Today, examples of the torture methods used by the Khmer Rouge can be seen at the Tuol Sleng Genocide Museum. The museum occupies the former grounds of a high school turned prison camp that was operated by Khang Khek Ieu, more commonly known as \"Comrade Duch\". Some 17,000 people passed through this centre before they were taken to sites (also known as The Killing Fields), outside Phnom Penh where most were executed (mainly by pickaxes to save bullets) and buried in mass graves. Of the thousands who entered the Tuol Sleng Centre (also known as S-21), only twelve are known to have survived.","user":"ma-cortes","rank":[19,20]},{"title":"The best war film ever made.","rating":7,"date":"7 November 2002","review":"Rating: **** Out of ****<br><br>Hard to say, but I believe when it comes to the war genre, The Killing Fields manages to edge out even Saving Private Ryan, and without a doubt, there's no better war film out there that's done a better job of capturing the realistic details and emotional loss of the time period (that being, the 70's in Cambodia/Vietnam).<br><br>Thus, I've always considered it a little odd that no one I know has even heard of this film. When lists of the greatest war films are decided, I don't believe I've ever seen this film crack any list. And the reason is simple: The Killing Fields is often ignored because it doesn't come from a soldier's point of view, and neither does it feature any adrenaline-pumping battle sequences. The fact that a strong portion of the film (about 2/5's) comes entirely from a Cambodian man's viewpoint might throw off a few viewers here and there. And yet, the film does just as fine a job as any anti-war film in creating a frightenining, chaotic world.<br><br>The performances all around superb without exception. Haing S. Ngor, who was tragically killed a few years ago, delivers a riveting, emotionally wrenching turn as the guide who is trapped in Cambodia and forced to fight for his life. He deservingly won the Oscar, though it's a shame he was snubbed for the best actor award. Inarguably, he's the film's central character and he also has more screen time than top-billed Sam Waterston. Despite my complaint on that matter, Waterston is also excellent as the journalist with a guilty conscience.<br><br>The Killing Fields is a suspenseful and exhilarating experience, a journey through an apocalyptic landscape that features one shocking image after another. Watch, and you'll see why the film is so acclaimed.","user":"Li-1","rank":[121,146]}]