[{"title":"Second Only To \"Bullitt\"","rating":10,"date":"6 February 2000","review":"I was about thirteen when this movie came out on television. It is far superior in action than most movies since. Martin Sheen is excellent, and though Nick Nolte has a small part, he too provides excellent support. Vic Morrow as the villain is superb.<br><br>When Sheen \"tests the water\" in his '34 Ford (COOL) along the mountainous highway it is spectacular!<br><br>The ending is grand.<br><br>I'm disappointed in the low vote this received. I figure the younger generations have more interest in much of the junk that is coming out these days.<br><br>Good taste eludes the masses!","user":"jesselim","rank":[23,25]},{"title":"The car is the real star of this movie.","rating":9,"date":"15 June 1999","review":"Martin Sheen, Michelle Phillips, Stuart Margolin and the late Vic Morrow are the human stars of this movie about a young man looking for answers about his brother's death.  Mr. Sheen, Mr. Margolin and Mr. Morrow all turn in first rate performances in their respective roles; Ms. Phillips has the slightly less than enviable task of trying to spice up a made-for-TV movie (twenty-five years ago), by supplying the \"sex interest\" in an otherwise sexless film.  The real star, however, is the \"California Kid\";  a 1934 Ford coupe, borrowed from \"Jake\" Jacobs, put before a camera and given a workout that'll leave the viewer panting, gasping and holding the edge of the seat with breathless anticipation.<br><br>The action scenes are spectacular, (although some of the dialog is a bit lame) making for a fine evening's diversion. This is how all \"car movies\" should be made.<br><br>Try to catch this one on the late movie channel; it's well worth the missed sleep.","user":"Kiffin","rank":[17,18]},{"title":"A movie as lean and mean as the car who's the star","rating":7,"date":"12 May 2005","review":"In 1958, Clarksberg was a famous speed trap town. Much revenue was generated by the Sheriff's Department catching speeders. The ones who tried to outrun the Sheriff? Well, that gave the Sheriff a chance to push them off the Clarksberg Curve with his Plymouth cruiser. For example, in the beginning of the movie, a couple of servicemen on leave trying to get back to base on time are pushed off to their deaths, if I recall correctly. Then one day, a stranger drove into town. Possibly the coolest hot rodder in the world. Michael McCord. Even his name is a car name, as in McCord gaskets. In possibly the ultimate hot rod. A black flamed '34 Ford coupe. The colors of death, evil and hellfire. He gets picked up for speeding by the Sheriff on purpose. He checks out the lay of the land. He is the brother of one of the Sheriff's victims. He knows how his brother died. The Clarksberg government is all in favor of the Sheriff. There's only one way to get justice served for the killing of his brother and to fix things so \"this ain't a-ever gonna happen again to anyone\": recreate the chase and settle the contest hot-rodder style to the death. He goes out to the Curve and practices. The Sheriff knows McCord knows. The race begins... This is a movie to be remembered by anyone who ever tried to master maneuvering on a certain stretch of road.","user":"lightninboy","rank":[13,14]}]