[{"title":"The cast clearly had a whale of a good time","rating":9,"date":"1 October 2003","review":"Nudity in a movie can be mere eye candy, no different to looking at the images on one of the magnificent ceilings painted by artists such as Fragonard, or it can be presented with a sexual significance. It can be shown in various ways, as a totally natural incident appropriate to the scene being sceened, as pure fun, as erotic stimulation, as downright dirty comedy, or as explicit sex - although this is generally regarded as making the film pornographic. It can also be presented musically, and with so many possibilities it is hardly surprising that many filmgoers will enjoy some, but not all, of these forms of presentation. All such material will however usually result in the film in question being classified as for adult viewers only. Back in the 1970's three films incorporating such material were released under titles commonly associated with children's literature. These were \"Alice in Wonderland\" (1976), \"Cinderella\" (1977) and \"Fairy Tales\" (1979). It is therefore particularly important that reviews of these films should make their contents quite clear, as there are reported to have been instances of video hire firms who were sued by irate parents inadvertently borrowing these films for their offspring's entertainment.<br><br>\tBoth Cinderella and Fairy Story have been released through the same distributors (Astral) and can best be described as musical comedies for adults which makes liberal use of nudity in fun sequences; they do not fall into the dirty comedy category and, since many of the songs are more humorous and less suggestive than those often encountered in music videos, they are not likely to offend many of the viewers who know what to expect. Some of those who have commented on these films in the Imdb data base have expressed a preference for Cinderella, but I personally preferred Fairy Tales. Both these films are very similar in style, and choosing one in preference to the other is essentially a matter of taste. My preference is largely based on the impression that Fairy Story provides more variety, with new characters drawn from classic children's stories appearing at regular intervals throughout the film. By contrast the story of Cinderella is very well known and even when retold in adult form some of the element of surprise, which is important for films of this type, is lost.<br><br>\tThe music and songs in both films are excellent and are such fun that it would be hard not to enjoy them, a sequence in Fairy Tales where Snow White is set upon by her seven little dwarfs is particularly enjoyable (probably it could not even be filmed today as the Society of Dwarfs, or some similar body, might protest forcibly about unflattering representation of those handicapped individuals which it represents), and the presentation of the house in a shoe as the local house of ill fame, with Robert Staats as a copybook ponce, is hilarious. Ultimately I usually find that the success of a film of this type is assured whenever it is very clear that all the cast had a whale of a good time whilst creating it. This is certainly the case here, and I have no hesitation in strongly recommending this film to anyone interested in seeing it. For a film of its genre I would rate it at 9 out of 10.","user":"bbhlthph","rank":[34,35]},{"title":"Looks horrible but very good OF ITS TYPE!","rating":7,"date":"6 March 2002","review":"Basically a R-rated spoof of fairy tale characters.  Naturally all the woman are young and beautiful and take off there clothes for no real reason; there's no male nudity (unfortunately); the songs are actually funny and well-done (the \"Snow White\" number broke me up) and there's no real sex or anything.  Tons of female nudity but done very innocuously and in a refreshing matter-of-fact manner.  It's silly, brezzy and entertaining. The low budget is obvious but it actually doesn't hurt the movie--I mean, who expects high production values from THIS?  So very good for an R-rated adult spoof.  Not \"Citizen Kane\" but fun.","user":"preppy-3","rank":[22,24]},{"title":"Fairy Tales: A deftly crafted comedy/musical.","rating":10,"date":"21 September 1998","review":"I fell in love with this \"soft porn\" turn at first viewing. It could have been just another slipshod \"peepshow\" as is the case of most T&amp;A features.  Instead, Hurwitz and Perilli decided that anything worth doing is worth doing well.  The music is absolutely splendid and memorable and wickedly tongue-in-cheek (I am quite partial to \"Beat Him Daddy A to the Bar\" and \"Little Bo Peep\".  All of the characters are well realized and fleshed out (so to speak) given the genre.  Being an actor myself, I can tell when performers are having fun with their roles...a mainstay of successful comedy.  They seem to have been having a blast. Anyone who can get through Tommy Tucker's (Robert Staats)scenes without a hearty belly-laugh (to say the least) is likely dead, humorless, or made of stone. Well done all around.  I give it a \"10\".    Highly recommended.","user":"RAVEN-27","rank":[17,19]}]