[{"title":"great 70's teen-sex comedy","rating":9,"date":"12 April 2005","review":"in the tradition of drive-in teen flicks, Hollywood High hits bullseye. If you enjoy corny plots, or no plots, like Gas Pump Girls and The Cheerleaders, then you should search this one out at your local Mom &amp; Pop video store. The four lead girls are hot. And w/ bikinis or less 80% of the time. They have four beach bums/gang members(yeah right)with the girls and all they do is frolic and practice the joys of love, in a van, in a tent, and always together, forget about privacy. There's an old movie startle thrown in the story, just so she could enjoy the young bucks AT THE THE SAME TIME. This is a true masterpiece of sexual taboo mixed with an innocence that could only come from the 70's.","user":"vanvicjay","rank":[8,8]},{"title":"It's one of the best!","rating":9,"date":"15 November 2001","review":"For years, I loved this movies even though I only saw the crappy USA Up-All Nite version. When I recently saw this uncut on video, it was like going back into time. For a movie about a bunch of girls just trying to enjoy their teenage years and sexuality, this film has taken a lot of hits, but it still ranks up there as one of the best boobie flicks I have ever seen. Highly recommended, for those of you that like cheesy, soft-core flicks that are supposed to be silly.","user":"dr_midnight32","rank":[6,6]},{"title":"Luis Bunuel Meets Bob Clark!","rating":10,"date":"22 February 2009","review":"A bizarre, surreal, and dreamlike \"teen\" sex romp as only the 1970's could produce (and yes, that is a compliment!) <br><br>Four Southern California girls (one of whom is named \"Jan\", and who bears an eerie resemblance to Eve Plumb) and their boyfriends, including a memorable Fonzie/Barbarino-like hybrid, encounter varied adventures in their constant search for more private places to... uh... rendezvous. At repeated points along the way, they butt heads with a brainless cop, whose portrayal ought to have earned the actor an Oscar. <br><br>After a dwarf-ravaging sequence and a primal regression scene involving food that has to be seen to be believed, the teens think they may have finally found a coital refuge in the large mansion of a faded former silent movie star, but things don't go quite as planned....<br><br>Ignore the grouchy, humorless idiots who denigrate this unjustly forgotten masterpiece and see it today! It really does contain powers of rejuvenation!","user":"rhages","rank":[9,11]}]