[{"title":"Groovy hep catfight","rating":6,"date":"30 August 2005","review":"Inter-racial marriage, dope smoking...that's the sex and drugs. No rock-n-roll I'm afraid, just Elvis Costello's grandpappy playing some cool jazz tunes on the old joanna. Richard Atenborough sheds no tears while ex-Rank glamour boys Keith Michel and Patrick McGoohan get together one more time to play the good and the bad.<br><br>McGoohan plays the scheming drummer trying to start his own band. He has become squeezed by his potential backers who insist he must get Marti Stevens as his singer. Unfortunately for him Marti has fallen for the hulking Paul Harris. This white chick / black guy relationship proceeds with absolutely no comment from anyone, a refreshing change from the Hollywood routine of forcing Poitier to have to justify such things! To be truthful it is difficult to see what Marti sees in the guy, who is a real chauvinist, but such is love! He is the leader of a popular band but he has insisted his wife ended her singing career when they married.<br><br>McGoohan's plan then is to split the couple up. His main weapon in this regard is Keith Michel playing a reformed dope fiend who, as an old friend, Harris has kept on as his manager. McGoohan passes Michel a bizarre-looking spliff in a quiet moment to try and get him hooked-up again. This forms part of McG's scheme to create the illusion to Harris that his wife is 'playing away' with Michel.<br><br>The plotting becomes quite complex, with the inclusion of some incredible tape-to-tape equipment owned by the rich, upper-crust, but groovy cat: Richard Attenborough. McGoohan performs some sound engineering work worthy of a Danger Man episode to set up his final proof to Harris that Marti is unfaithful.<br><br>Throughout all this Dave Brubeck and the dudes flesh out some jazz while everyone clicks fingers as they get hep! The film has become mainly famous because of the capture of these guys on celluloid.<br><br>Aside from McGoohan, my favourite aspect of the movie is the fact that it was 1961, Mississippi was yet to start burning, yet the movie is impressively colour blind. The portrayal of the marriage of Marti and Paul and the sub-plot involving Michel fretting over whether to marry his black songstress girlfriend all proceed without skin colour even being mentioned.<br><br>The final scene is the best of the whole film. Betsy Blair and McGoohan play out a powerfully cruel dismemberment of their life together while McGoohan makes your hair prickle as he rips his own personality to shreds and then stamps on it. While you are still shuddering at his dysfunctional alienation the movie fades out with him slaying his drum-kit, alone in the emptied warehouse-apartment.","user":"Moor-Larkin","rank":[27,29]},{"title":"Jazz Othello","rating":7,"date":"10 April 2009","review":"I had never heard of this film, so I didn't know what to expect. I figured that anything featuring Attenborough and McGoohan had to be good...and I was right.<br><br>The film begins with preparations for a big jazz party honoring Rex and Delia's first anniversary. When they walk through the door, we get a big surprise: Rex is black and Delia is white. (Mixed-race couples were rare on screen in 1962, although they're now \"de rigeur\" in British TV and film.) When McGoohan's character started his scheming, it finally dawned on me that I was watching OTHELLO in a warehouse!<br><br>The screenwriters did a decent job of condensing Shakespeare's play into 90 minutes and bringing it up to date, but they chose to change the ending, which may disappoint die-hard fans of the Bard.<br><br>What makes this movie stand out is the cast of supporting characters: great jazz players of the early 1960s. The three headliners are Dave Brubeck (playing \"Unsquare Dance\"), bassist Charles Mingus, and sax player/bandleader Johnny Dankworth. But there are many second- tier players who contribute to the swinging atmosphere.<br><br>This film would be of interest to students of Shakespeare, or lovers of jazz. And if you like the idea of a \"jazz summit\" in a film, also check out A SONG IS BORN, a Danny Kaye comedy from 1948. The jazzers outshine the actors in that one; in ALL NIGHT LONG, it's a dead heat.","user":"LCShackley","rank":[10,10]},{"title":"Interesting jazz soap-opera...","rating":6,"date":"17 November 2007","review":"1st watched 11/17/2007, 6 out of 10(Dir-Basil Dearden): Interesting jazz soap-opera played out with many actual jazz superstars of the day is amazingly watchable despite the lack of acting talent on-hand. According to my cable on-demand info, the story is a re-telling of Shakespeare's Othello(a story that I'm not familiar with I'm sorry to say) and is played out effectively by everyone involved. The setting is a 1-year anniversary for a hot couple in the jazz world(Rex and Odelia) at a rich man's swank hideout that he uses exclusively for parties of this type. The rich man is played by Richard Attenborough, who is always good in his acting stints and this one is no exception. Everything appears peachy as the couple enters the scene, but there is a hint of scandal as his drummer schemes to start his own band trying to lure away his new wife to be a vocalist in it, although she doesn't appear initially to be that interested. The tangled web is weaved thicker and thicker as the night goes on as the believable antagonist plots everyone against each other for his own gain. This role is played very well by Patrick McGoohan as we can see the evil lurking behind his eyes and it is revealed increasingly as the film goes on. Behind all this is some of the hottest jazz musicians playing original tunes providing a very unique background to the storyline as individuals move in and out of the jam session providing them a break from the drama and being kind of an exit door for the characters in the play. All in all this is a very satisfying unique movie experience that is played out well and provides good background music as well. It is definitely, cool baby!!","user":"dwpollar","rank":[16,18]}]