[{"title":"Whatever Happened to Annette Benson?","rating":10,"date":"1 April 2016","review":"Superb silent film that offers a \"backstage\" look at filmmaking in Britain at the end of the silent era. Story centers on a married couple who are starring in \"Prairie Love.\" He (Brian Aherne) is a rather dopey leading man who is totally unaware of his wife's (Annette Benson) bitchy temperament or her affair with a low-comic movie star (Donald Calthrop).<br><br>When Aherne is scheduled for some on-location filming, Benson wastes no time to giving Calthrop her apartment key. But the shooting schedule is changed. When a stunt double is killed on another on-location shoot, Benson assumes her lover is dead, but....<br><br>After Benson (as Mae Feather) finally gets her comeuppance and loses her contract to go to Hollywood, there's a powerful and bittersweet ending with Benson as a lowly extra and Aherne as a powerful director.<br><br>Filled with astonishing lighting and camera work and boasting excellent performance by Benson and Aherne, this film gets progressively mesmeric as it spins its story. Co-stars include Chili Bouchier as Winnie and Wally Patch as the prop man.<br><br>In a bizarre parallel to this film's ending, Annette Benson would herself disappear after two failed attempts at talkies in 1931. There is virtually no biographical information available on this star actress.<br><br>BFI recently issued a BLU/DVD restoration of this superb film.","user":"drednm","rank":[18,18]},{"title":"You could have heard a pin drop...","rating":9,"date":"15 February 2004","review":"I can't answer for the rest of the audience; but I went into the screening anticipating a silent comedy that was a satire on contemporary Hollywood formula drama, 1920s cinema laughing wryly at itself. And at the start of the film, that was just what we got. Ripple after ripple of laughter rolled around the auditorium, from the opening moments as the languishing heroine of the film-within-a-film attempted to kiss a dove, got roundly pecked, and swore like a trooper. (One suspects lip-readers would have a treat at this point...)<br><br>It's hard to put a finger on when the audience stopped laughing. The change is very subtle; and if, as I was, you are not expecting it, the effect is gradually almost overwhelming.<br><br>The basic plot is the stuff of comedy, or of broad melodrama -- cuckolded husband, vain and silly wife, mistaken identity, unexpected return, and a gag involving a lipstick and, of all things, a shotgun cartridge. If it were a film -- which is to say, in one of the ridiculously bad films-within-the-film -- it would be played for laughs, inadvertent or otherwise. It is, I think, a very great tribute to both the actors playing actors, and to the director of \"Shooting Stars\" itself, that it comes across instead as contrasting real life with celluloid performance.<br><br>What starts off as slapstick becomes, by the end, desperately unfunny. Humour and double meanings have turned to the bitterest irony. Lines that once would have raised a laugh -- \"I never knew Mae had it in her,\" says the director admiringly as his lead actress collapses on set in guilt and horror that are all too real for the scene -- now come closer to wrenching out a twisted sob. There are two different allusions even in the black wordplay of the title.<br><br>The film walks a very fine line between comedy and tragedy. Perhaps this, above all, is what I admire most -- Julian's cheerful ignorance as Mae faints, the empty, swinging chandelier, the alluring professional smile that drains from Mae's face as she turns to wave to her celluloid lover and witnesses her real lover's approach... By the end, comedy is now longer used for laughs. It is used to point up the sting of the tragedy by robbing it of melodrama.<br><br>I think the last actual laugh among the audience came when Mae runs to forestall the owner of the approaching footsteps, only to encounter an elderly an innocent clergyman. After that, there was nothing but gasps and silence until the last frame of the film. Judging by the outbreak of coughing and seat-backs that followed -- not to mention applause -- I wasn't the only one to have been sitting frozen, holding my breath. You could have heard a pin drop.<br><br><br><br>I felt particular credit should have gone to Brian Aherne, giving a wonderful performance as matinee idol Julian in what could have proved an utterly thankless part. Julian is essentially playing straight-man to his two co-stars, as open-hearted and naive as the stereotyped cowboy hero he is being asked to act, but without audience sympathy for him his wife's antics would be little more than a harmless bedroom farce.<br><br>Aherne makes us care about Julian -- makes us genuinely like him, and wince to see him hurt. The young man finds excuses for Mae's behaviour on-set, and for her sake laughs off being trailed like luggage in his wife's wake to Hollywood; and when he wishes that Mae's tenderness when they star together could correspond more closely to their off-screen married life, it is not farcical but poignant. When we smile at his childish vanity as he cheers himself on while watching his own film, just like the two schoolboys in the neighbouring seats, it is with amused affection.<br><br>Yet Aherne can also use his height and classic good looks to startling threatening effect, as we discover in the scenes where Julian learns the truth. By the end of the film, the character has grown; and Aherne gives him well-deserved authority to hold the role.(","user":"Igenlode Wordsmith","rank":[14,16]},{"title":"Try it, even if you don't like silents","rating":7,"date":"4 January 2003","review":"This was the first full-length silent film I saw and I must say it took me quite by surprise.  For a start it does not feel like it was made almost eighty years ago.  The technical staff of the 'film-within-a-film' would not look out of place in the '40s and '50s.  The leading players are rather heavily made up with the lips in particular looking rather odd, especially on the male characters.  Brian Aherne looks almost contemporary but one could that down to his classical good looks (he is rather reminiscent of Matthew McConnaughey).  The acting, too, was a surprise.  Being a silent film you have to expect a certain amount of gesturing with the hands to make up for the lack of dialogue; the actors must have some means of expression. In close-ups, however, the acting is good.  When Julian discovers his wife's adultery, and when he watches himself in the cinema, his reactions are fabulous to behold.  The film's theme is an age-old one: the love triangle. When one of these three is a murderously ambitious wife it becomes heady stuff.  Personally I think the coda should have been omitted, despite the fact that Mae's slow walk off the set is one of the best shots in the entire film.  Considering the basic technical and narrative advances that have been made since 1928 are few it is remarkable that this film was made only 30-odd years after film had really been invented.","user":"DanielKing","rank":[11,13]}]