[{"title":"Lurid fun and has aged well.","rating":6,"date":"22 November 2005","review":"Back in 1983, the remake of Jean-Luc Godard's \"A Bout de Soufflé\" was savagely attacked by critics. It was understandable at the time. Today, I'll bet many of the critics probably feel the film is much better compared to today's bottom feeder cinema (many of which top the box office).<br><br>Richard Gere's Jesse LuJack does the rare feat of being both repulsive and likable. Early in the film, you despise the reckless, cocky, S.O.B. of a criminal that he is but as the film wears on you suddenly find his character extremely appealing. Once you warm up with him, you realize how much fun Gere is having playing LuJack. His traipsing in L.A. becomes very entertaining in a video game sort of way. Singing to Elvis and Jerry Lee Lewis, disrupting his girlfriend's exam, and his role as The Fugitive makes the film so compelling and fun to watch. He embodies coolness while being hip; which can be hard to do.<br><br>As for Valerie Kapinsky, I have seen some of her soft-core films from Europe and she is tremendously sexy. She has sex appeal and looks delicious in virtually every scene. Her acting here gave her an undeserved rap. She's supposed to be playing a French exchange student. I think she did the best job possible by playing herself. I would take Kaprinsky over some American actress faking a French accent. There could have been other French actresses out there that could have taken the part but she fit in perfectly for the role IMO. She probably didn't object to the nudity required.<br><br>The film also delivers some steamy situations. Making love in front of a huge screen showing an old movie (I think Judy Garland was in it) while being on the lam in L.A. just sounds so dreamy. Makes me want to do the same with my girl; only I won't have an arrest warrant on my head LOL! <br><br>So yes, the movie isn't a classic and it isn't Casablanca but the film is much, much better than the turkey it received in 1983. It's definitely worth seeing.<br><br>Interestingly enough, Jim McBride would later direct a biopic of Jerry Lee Lewis in 1988 called \"Great Balls Of Fire\" so his interest in late 50's rockabilly was apparent here regarding the great soundtrack.","user":"BlackJack_B","rank":[27,32]},{"title":"A Pelvic Thrust of Zen","rating":16,"date":"16 July 2011","review":"Okay, so the idea is to achieve emptiness so that we may be actually informed by what it is we see. To train an eye for details that doesn't react or classify or evaluate but instead grasps effortlessly the totality of what a film means to us. In this process, naturally we have to discard our preconceptions and routine streams of thought; who made the film, is it art-house, does it belong in a list of masterpieces.<br><br>A bunch of those here; a remake of a well known French film, the presence of Richard Gere (usually signifying fluff), the very idea of a film that never made much sense to begin with. Who needs a Breathless remake, much less the Hollywood version? But we got it, so what about it? The Godard film was about young people coming to discover for the first time the struggle with important things, about love and meaning dealt with in the pretentious, silly, superficial ways of youth. What tied the struggle together was a boyhood fantasy about movies. We had a protagonist acting out an imaginary gangster part and the reality of the film arranged around him as a movie plot in which to act the part. It was about the safe distance provided by the fictional as conflated into the emotional distance between two people.<br><br>Now watch how the remake transcribes this. Richard Gere is the Michel Poiccard character but instead of Bogart he is a Clark Gable. A movie hunk 'exhuding studly scent' as another reviewer aptly puts it. Recklessly oblivious to anything but the present moment and what it has to offer, he is the very dream of movies. A doofus at first sight but who instinctively seems to have grasped the essence of life by the balls. As much a target of ridicule as admiration. We see him empathize with utmost seriousness with Silver Surfer comics! Something akin to a destiny for him.<br><br>But we're not inside him, we're siding with the French girl who's come to LA to study architecture. The girl who plans, thinks, wants the buildings she will create to last. The perfectly logical human being who (along with us) is swept away by the irresistible allure of an existence without bounds, centered in the 'now' and radiating outwards. Valerie Kapriskie is a perfect match here, an Ali McGraw to Steve McQueen; she's great because she can't act to hide what seems a genuine infatuation with Gere's adolescent antics (mixed with genuine frustration).<br><br>We travel with them through a fetish dream of LA. Cars are fire-engine red Thunderbirds, summer dresses and even telephones pink. I've been going this month through a phase of cinematic vacation in Los Angeles, and this one has the best sense of place of anything I've seen yet. The dark joint with the jukebox, the empty streets blowing with hot summer wind.<br><br>But it's more than a ride of pure, exhilarating movie pleasure, there's something to talk about here.<br><br>It's peppered throughout, but centered in a scene by a pool. The girl wants to know what is behind the man's face, what kind of nothingness. He blurts something about love, no doubt cribbed from some magazine. A little later an aging architect, who no doubt has been where she is and has come to understand the world, tells her that nothing that is built lasts.<br><br>And the best part, taken from the pages of a Silver Surfer comic. I won't go into details, but it says something about us, the sentient beings narrating our story, removed from our heart yet discovering it in every reflection. It makes for perfect Zen.<br><br>So we have this hip-swivelling, rock'n'roll Zorba the Greek, who is empty inside in the best sense possible, so that he is filled with everything. Like only a blank sheet of paper can be clearly written on.<br><br>And he's on the run for a fateful mistake of shooting a cop. How the scene is edited is important; we see a windshield shatter, then Gere looking with astonishment at the pistol in his hand. Elements crucially missing from the edit (the action itself) reveal the emotional state; how many mistakes can we look back on and be perplexed how we let them happen? <br><br>There's more to it. There's a marvellous love scene in a movie theater playing Gun Crazy (which the film is reversed from). The two lovers roll around as behind them loom huge footage of the fictional couple in Gun Crazy discussing what pertains to the two lovers.<br><br>And before the climax, we ride all the way up to a property overlooking the LA nightscape. Errol Flynn's as we find out, again movieland.<br><br>It is better than the Godard film, miles better. It's as much about the old tropes of sex and violence as that film, except it's filled with actual heart. It is about kitsch elevated into noble gesture, about reality dismantled into fiction and the opposite. Novice film buffs discovering a sense of importance with Tarkovsky and Malick will find little in this simple film to appreciate; but those who've done their rounds and are looking for specific things may be strangely fulfilled by this.","user":"chaos-rampant","rank":[37,46]},{"title":"Mehico! Mehico! Mehico!","rating":14,"date":"14 March 2004","review":"I got tired of watching my censored taped-from-TV version of this film, so I finally bought the DVD. I am one happy hombre. In addition to the superior video and audio quality, one gets several unobstructed views of the object of Gere's love/lust -- and that's no insignificant treat.<br><br>One reviewer aptly referred to this film as Gere doing his \"early-80s cheeseball riff on the sexiest man alive.\" I concur. \"Breathless\" could be seen as an expansion of his minor role as Diane Keaton's dangerous pretty-boy in \"Looking for Mr. Goodbar\" -- transposed from wintery Chicago to sultry L.A.<br><br>I won't analyze this film. It doesn't hold up under criticism, and certainly there is plenty to dislike, starting with the relentlessly sociopathic behavior of its protagonist. Rather, in the spirit of the film's love-almost-conquers-all theme, here's just a partial list of what I love about \"Breathless\":<br><br>1. Kaprisky in her see-through swimsuit. Rowrrrr! The rest of her wardrobe is pretty damn sexy, too. (The jury's still out on Gere's blue 'soot.')<br><br>2. The kiss at the diving board. It has to be one of the best in cinema history. Kaprisky is a goner after that.<br><br>3. Gere's line: \"I think maybe I was rolling dice when I should have been rolling you.\" Cheesy, sure, but look at her face when he says it.<br><br>4. The shower scene, together. Kaprisky running hot and cold. \"Jesse, you're crazy.\" ... \"So what?\" ... \"It's OK. I like it.\"<br><br>5. Gere turning female heads wherever he goes, as he exudes his studly scent.<br><br>6. Los Angeles as The Place to Be. I lived and loved in L.A. during the early/mid-80s, and can vouch for the intoxication of being young and on the go in the City of Dreams. It's one big-ass place. McBride and veteran lensman Richard Kline do a superb job of capturing its heat, light (L.A. sunsets put a glow over the whole city), and diversity -- from the downtown hotels and office towers, to the industrial sections, to the Hollywood hills, to upscale West L.A., to the beach communities (where we see what must be every mural in L.A.).<br><br>7. The amazing ending. Gere taking his \"all-or-nothing\" motto to the wire. In what other movie will you see a dude dancing and singing to his woman while the cops have their guns drawn on him?<br><br>\"Breathless\" is Gere at his best. Maybe Kaprisky, too, for whatever that's worth. Don't think too hard about it. Just enjoy the ride.","user":"huckfunn","rank":[42,56]}]