[{"title":"A clever,disturbing masterpiece of exploitation cinema","rating":21,"date":"21 March 2005","review":"Cannibal Holocaust is nasty,sometimes VERY hard to watch,arguably sick,horrible,you name it. It's also a near masterpiece by it's director Ruggero Deodato {who never came near the quality of this film again}. It's a horror film in the most literal sense. It's not scary in the slightest,it doesn't attempt to make you jump. Despite it's scenes of horrendous violence,it's not even a simple 'gross out' a la Braindead. What Deadato attempted with this film is to disturb the viewer, provoke a reaction and make him or her THINK. The film has a powerful message about man's cruelty and violence,and Deodato just tackles it totally head on. This,and the fact that it is so well made{lets face it,some of the so-called 'video nasties' seem laughable now}are probably why the film has had so much censor trouble. Even if you hate it,it sticks with you,it's horrifying images staying in the mind for ages.<br><br>And they are indeed many. People being ripped open and eaten,including even a penis being partially torn off. A woman having a foetus torn out of her and it buried in mud. Another woman raped with a dildo and than having a mudball with nails on thrust between her legs too. A brief fake documentary showing disturbingly realistic executions. The list goes on. You would be forgiven for thinking that this is just exploitative nastiness. However, {and this is just one of the many things that separates this film from the many other films of the cannibal subgenre],we are being shown this stuff to get us to think,not just about mankind's violence to each other and his ignorance of other races but also about violence in the news {and oddly enough,the glut of 'reality'shows on TV today also make the film pertinent}. And it also toys with our sympathies in a devilishly clever way. Cannibalism seems horrible to most of us, but at the end aren't we almost pleased to see the protagonists eaten by the natives when they have spent the previous half hour mistreating and abusing them?<br><br>The film is oddly structured,with the second half being basically the 'film' which the characters in the first half of the film find. The second half has the most power,even if there are shots which couldn't actually have been taken by the filmmakers. Deodato actually shows great skill in many of the gory effects scenes by showing just enough of the effects to be effective but not dwelling on them so the fakery starts to show,and the climatic orgy of cannibalism is all the more shocking because much of it is only partially glimpsed,making more of an impression. Riz Ortolani's often bleakly beautiful score is superb and even the dubbing of the {good if not great}actors is not bad.<br><br>The one thing about the film that is hardest to defend is the animal cruelty {unless you see the UK DVD,which removes it}. In one particularly notable scene a large turtle is dragged out of the water and in what seems like real time is disembowelled. It probably is sickening that animals were killed for a film,yet this IS how the natives of many places survive,by killing animals and eating them,and is this really any more sickening than the way chickens are couped up in factories, stuffed with food and basically bred to die? Answers on a postcard please.<br><br>Cannibal Holocaust is quite simply essential viewing not just for fans of extreme cinema but for adult fans of cinema full stop,as long as of course they can stomach it!","user":"DrLenera","rank":[207,251]},{"title":"A disturbing and damning portrayal of civilised society.","rating":7,"date":"7 September 2003","review":"Professor Harold Monroe (Robert Kerman aka porn star Richard Bolla) travels into the jungles of South America to try and discover what happened to a group of three documentary film makers who have been missing now for some time. After locating a primitive tribe Monroe manages to strike a deal and salvage what is left of Alan (Gabriel Yorke), Faye (Francesca Ciardi) and Jack (Perry Pirkanen).<br><br>They say there is a fine line between genius and insanity and I think in Cannibal Holocaust' director Ruggero Deodatto made that line as thin as possible. To call this movie depraved and sick would only give it half the credit it deserves because Cannibal Holocaust' is meant to be sick as it shows how sickening our own society is but in the most morally corrupt way imaginable. Featuring numerous repulsive acts such as a real live turtle flaying, a foetus being ripped from a woman's body, rape, castration and impalement the film sets about to portray the `civilised' documentary filmmakers as no better than the primitive cannibals. Even though the actors are barely competent enough to do their job it becomes almost enjoyable (in a very sadistic way) to watch them suffer at the hands of those they have wronged. However, from a moralistic standpoint even watching this movie is wrong. <br><br>I don't think this is the type of movie you either love or hate on an entertainment basis but you either agree or disagree with how it presents its case. Cannibal Holocaust' is certainly nothing short of an endurance test in viewing as the senses are raped by the foul imagery constantly portrayed within. Filmed on a shoe string budget with virtually no production values evident, Cannibal Holocaust' has a disturbing realistic grittiness that is almost unparalleled by any other movie and a huge influence for The Blair Witch Project' almost twenty years later. I feel that because the movie is so badly made and the very fact it was produced is more damning to society than the events portrayed within many people feel that it is nothing more than a senseless bloodbath with no redeeming features and a hypocritical storyline  and to an extent they are probably right! Whether the viewer appreciates or despises this movie is totally dependant on the viewer and it is unfair for anybody else to make judgements on that person based on their opinion of this movie. <br><br>Cannibal Holocaust' is not about a sharp storyline, great acting or superb special effects (though the unsimulated effects are generally good). Instead it is about humanity in general. If you believe you can cope with violent and repulsive imagery and scenes of unbelievable cruelty then go ahead and watch it but otherwise it is certainly one to avoid. Some people will probably find the moralising over such repulsive subject matter offensive and I can't say that I blame them. However, there is a message there and this movie makes an extremely bold statement. The question is though whether it was right to make the statement in this way? From an artistic standpoint it holds no real value but remains an interesting movie. My rating for Cannibal Holocaust'  6/10.","user":"Snake-666","rank":[139,176]},{"title":"Not the campfest I expected","rating":8,"date":"22 July 2004","review":"\"Cannibal Holocaust\" is not the campy little horror flick I expected. It's a \"serious\" and well-made movie and it's an experience you'll hardly ever forget. According to IMDb's trivia section the movie can \"only be seen completely uncut in the EC-UltraBit DVD\", which means that I've seen a tamed down version and that, my friends, is insane! \"Cannibal Holocaust\" is easily one of the most graphic movies I've ever come across. The violence is incredibly realistic. It's no wonder that director Ruggero Deodato was taken to court to prove that he hasn't slain real people for his motion picture. (I still think the real animal slaughtering in the movie was unnecessary. Screw you for that, Deodato!) It's hard to tell if there really is a message or if the \"moral\" is just an excuse for all the gore. In a strange way the violent scenes somehow speak for themselves and do deliver some kind of message, but that's open for discussion.<br><br>If ever a movie deserved the label \"disturbing\", it's \"Cannibal Holocaust\". It's controversial, but totally worth watching, if you can take some seriously sick images.","user":"Superunknovvn","rank":[178,233]}]