[{"title":"Very interesting psychological thriller","rating":7,"date":"2 July 2002","review":"Footprints is a very interesting movie that is somewhat difficult to categorize. \"Psychological thriller\" is the most appropriate description I can think of. The female protagonist, Alice Cespi, discovers that she doesn't remember anything of the last three days. The only clue she has is a torn photo of a hotel. She is also haunted by a recurring, very vivid, dream about a science fiction movie that she believes she saw many years ago. In her pursuit of the truth behind her amnesia she doesn't trust anyone, but little by little it becomes obvious that she has visited the town where the hotel is located before. This is an exciting flick whose main virtue is that it is virtually impossible to predict how the events will unfold, and particularly, how it will end. The unusual loneliness of the main character and the unreliability of everyone else ensure that the good old paranoid feeling is present throughout the film, whereas beautiful colors and some spectacularly filmed sequences make this a visually attractive movie as well. The important part of the one and only Nicoletta Elmi, everyone's all time favorite redheaded obnoxious child star of Italian horror, is an extra bonus.","user":"Industrious","rank":[23,29]},{"title":"Highly recommended","rating":16,"date":"16 July 2006","review":"This is why I love Italian gialli. Despite the somewhat true but nevertheless very tiresome claims that the Italian filmmakers are just rip-off artists, this one loose genre that only really had its heyday for a few years in the early 70's displays more originality and creativity than mainstream Hollywood films have in the last 20 years. (And some American fanboy directors like Quentin Tarantino have largely made their career by ripping THEM off).This film is not only unlike any other gialli; it's unlike any other movie I've seen. A woman (Florinda Bolkan) is haunted in her dreams by a long ago television show she saw of astronauts being left stranded on the moon. To relax she goes to an eerily deserted seaside resort town where she thinks she's never been , but where everyone seems to remember her visiting the week before. She gets more and more paranoid and confused. Meanwhile strange men in astronaut suits keep appearing. . . <br><br>Unlike the typically hysterical-from-the-get-go gialli, this movie gradually creates a sense of paranoia and unease. It mixes dream, reality, memory, and the media (television) to the point where the viewer is left as disoriented as the troubled protagonist. The end is bound to be a little disappointing after the build-up, but it's pretty memorable too.<br><br>While most gialli have an overabundance of characters, this movie is largely carried by Bolkan. Fortunately, she is more than up to the task. Bolkan was a Brazilian actress who, like Austrian beauty Marissa Mell, had a career that was often overshadowed by her personal life (and she probably didn't help this with her lesbian affairs and public claims of having been JFK's last lover). Unlike Mell though she was much more than just a pretty face and her talent can readily be seen in movies like this, Fulci's \"A Lizard in Women's Skin\", and the nunsploitation classic \"Flavia, the Heretic\". Klaus Kinski and the Ida Galli also put in brief cameos in the movie, and unfortunately so does young Nicoletta Elmi (who was kind of the Dakota Fanning of 70's Italian films--not a terrible actress but one that appeared in so many films you start to look forward to seeing her on the back of a milk carton).<br><br>Director Luigi Bazzoni's first giallo \"The Fifth Cord\" just came out on DVD. Hopefully, this one won't be far behind. Snap it up if you like gialli or if just enjoy unique, well-made movies. Highly Recommended.","user":"lazarillo","rank":[25,33]},{"title":"Very Good Surreal Mystery","rating":8,"date":"30 September 2005","review":"This is actually a very good surreal mystery movie, despite the description that tries to sell it as a Sci-Fi movie. Balkan stars as a woman haunted by mysterious visions and lost memories that she is trying to piece together. She spends the majority of the movie trying to make sense of her visions. Very atmospheric and effective. It is true that Kinski does not appear very much in this film, but the staring actors are very good. There is only an English dubbed version available in the US, and the dubbing leaves something to be desired, but the actors do a very good job. The cinematography, by Academy Award winner Vittorio Storaro is excellent. An earlier Giallo by director Bazzoni, THE FIFTH CORD, is also excellent, and also lensed by Storarro.","user":"novax67","rank":[11,13]}]