[{"title":"These people are not exaggerating","rating":10,"date":"17 December 2004","review":"Amazingly for those who haven't seen it (and usually neither heard of it), this unknown animated masterpiece regularly makes it into the shortest short-list of best films of those who have - and i don't mean list of animated movies, but movies in general. Uncomparable to anything else - much like Twain himself - it's every aspect is just amazing. It will feast your eyes (as much as any claymation can), fill your heart (with a both joy, sorrow, warmth and eeriness), boggle your brain, and make your jaw hurt. And you'll still have to find time to enjoy acting (yes, _acting_ of the clay figures here is just amazing) and clever solutions. For example, Mysterious Stranger is the best visualization of Devil(?) i ever saw in film.<br><br>Some have pointed out that it is \"not necessarily a kids movie\"; Not AT ALL a kids movie, i'd rather say.<br><br>Nobody forgets seeing it, and as soon as one remembers it later, one starts to look for it. Alas, it is extremely hard to find - at least i never succeeded. I saw it only twice, on TV, no less than 10 and 14 years ago, and my filmometer jumps high every time i think about it.<br><br>Find it. See it. Enjoy the ride. Copy it. Copy it again, for your grandchildren, and save the copy somewhere safe till they grow up.","user":"karo-6","rank":[37,39]},{"title":"Thoughtful, fun, and dark","rating":9,"date":"22 May 2002","review":"I must have seen The Adventures of Mark Twain for the first time over twelve years ago, and for over a decade it had haunted me... rarely, if ever, rebroadcast, I was left only with vague memory of what I remembered as one of the most vibrant pieces of visual art and storytelling that I was exposed to as a youth. I recently purchased it directly from the studio that released it, and got to return to it for the first time in a long time.  Of course, when returning to childhood films, you always run the risk of being disappointed by the film being worse than you recall. Luckily, I was not disappointed at all.  The story is of Mark Twain's characters Tom Sawyer, Huck Finn, and Becky Thatcher as they stow on board an airship created by Mark Twain himself.  Through the course of their journey across the world to meet Haley's comet, we are invited to retellings of Twain stories and meet all sorts of different characters.  The humour is intelligent and dry, but not over the heads of children.<br><br>Visually, this piece is stunning.  There is something vivid and tactile about stop-motion animation that will always appeal to me more than any CGI creation.  Will Vinton outdoes himself with this piece.  From the grandeur of Twain's airship or the Garden of Eden, to the detail of Twain's parlour/billiard room and the simple, truthful human expressions that the animators manage to create on the characters' faces, the film is impressive from first to last.<br><br>What surprised me the most is how this film, which I remembered as a children's or family film, is in fact quite dark.  It deals with aspects of life, death, evil, and human nature that one would never expect in a so-called \"family\" film.  But while the outward darkness, and, at times, even morbidity of individual aspects may seem inappropriate for family viewing, it comes from the sane and grounded perspective that Twain himself seems to have been known for.  Like in any good storytelling, the dark side of humanity is not spared from the viewer just because of the potentially youthful audiences. <br><br>By way of criticism, the film could definitely move at a faster pace. The humour, while clever and dry, as I said, could have been pushed farther.  There were many times the film set us up for quite a punchline and then didn't deliver, instead settling for a consistent level of pleasant amusement.  And I wish the episodic structure had been more fully taken advantage of, and had been extended into even more stories.  But that may just be me wishing the movie was longer than 86 minutes.  You can't have too much of a good thing.<br><br>I give the storytelling an 8 out of 10, and visuals a 10 of 10.  Overall, a 9.  There aren't too many of those, as far as I'm concerned. <br><br>And even if you didn't like this movie, you gotta admit, it's one of a kind.","user":"imlanglois","rank":[30,32]},{"title":"best unknown movie ever","rating":10,"date":"13 March 2003","review":"I know this is going to sound like hyperbole, but this makes my list of the ten best movies EVER.  What a shame it's so obscure.  Highly recommended, for older kids and adults.  A bit dark and scary for younger kids.<br><br> The script draws in some of the more obscure Twain works such as The Mysterious Stranger and Tom And Huck Abroad, and does so seamlessly.  The claymation is excellent.  It really gives you sense of both the humor, darkness, and humanity of Mark Twain.  Just a great, great movie, and an excellent overview of Twain and his work.<br><br> BTW, I believe that there is a later live-action movie with the same title (The Adventures Of Mark Twain), so don't get the wrong one.","user":"democracys-1","rank":[24,26]}]