[{"title":"Underrated Hitchcock swansong (possible spoilers)","rating":9,"date":"21 July 2002","review":"`Family Plot' is generally regarded as a disappointing entry into the Hitchcock canon, further burdened by the fact that it became his final film  whereas other lighthearted Hitch pictures like `The Trouble With Harry' (another underrated gem) could be accepted for what they were, `Family Plot' buckles under the critical weight and expectation of what should constitute the final film of a cinema master.<br><br>Once you throw all that in the bin, however, `Family Plot' is a marvellous, light-hearted comedy/thriller.<br><br>Hitchcock had begun, in his later films, to cast lesser-known actors because (a) having been established in the era of the studio system, he saw no need to pay exorbitant sums for actors whom he viewed as just as important in the film-making process as technical crew who were paid less and (b) he  wanted to avoid the audience making assumptions about character based purely on who had been cast in a role.<br><br>The performances of the four leads in `Family Plot' are consistently excellent. Barbara Harris is hilarious, showing touches of Madeleine Kahn in her role as fake psychic Blanche, Bruce Dern is endearing as her flakey sidekick Frank McBride, Karen Black brilliantly plays it straight-down-the-line (despite the silly disguises she wears) as a partner in crime to kidnapper-jeweler Arthur Adamson, played with deliciously subtle menace by William Devane.<br><br>The music, provided by John Williams in a first-time collaboration with Hitchcock, works a treat, avoiding the bombastic overtones of some of his worst Hollywood-esque scores and harking back to the classic days of Bernard Herrmann.<br><br>Being drawn into the web of the intricate plot that sees these four characters being drawn together, and seeing the sparks fly in the witty dialogue (penned by `North by Northwest' screenwriter Ernest Lehman) is enough  but the set pieces (a rollercoaster ride in an out-of-control car in the mountains, the kidnapping of a priest in the middle of a service, to name a few) elevate this film to a delightful popcorn experience that you will want to return to again  there are subtleties and layers in the performances that will be guaranteed to keep you coming back for more.","user":"christopherbanks","rank":[46,48]},{"title":"Gets a bad rap","rating":9,"date":"9 September 2005","review":"This film gets a bad rap because it was not a suspenseful blockbuster in the vein of \"Psycho\" and \"The Birds\". The fact is, is that after Rod Taylor and Tippi Hedrin did battle with seagulls in 1963, Hitchcock never again approached the heights of a major director and he dramatically slowed down his film output.<br><br>Still, this movie, along with 1964's \"Marnie\" and '72's \"Frenzy\" represent a decent effort by Hitchcock to stay current and hip with modern audiences. That he was still directing films at all in the 1960s and 1970s is quite remarkable for a man whose film work began in the silent era.<br><br>\"Family Plot\" is a fun, neat little comedy-thriller much akin to the NBC Mystery Movies of that era... i.e., \"Columbo\", \"McMillen and Wife\". Blanche is a phony psychic who, along with her reluctant boyfriend Frank, played hilariously by the underrated Bruce Dern, run afoul of big time crooks Karen Black and William Devane.<br><br>The plot does get a bit convoluted, but Hitchcock was smart enough to lay off the heavy-handed dictatorial directorship that categorized his earlier work and let the actors and their characters move the plot along. Unlike Cary Grant's Thornhill in \"North By Northwest\", we care about Blanche and Frank because they really are like us, the viewer. As much as we all adored the women in Hitch's films... Grace Kelly, Tippi Hedren, Kim Novak, and wanted to be like the men,Cary Grant, Jimmy Stewert, Ray Milland, Rod Taylor, Farley Granger, etc., none of these characters were remotely like US, and in his dotage, Hitchcock was still keen enough to realize that Cary Grant in 1956 was an admirable figure walking down the street... in 1976 he was apt to be pointed at and laughed about. Hitch knew INSTINCTIVELY that the gray suit and slicked back hair era was gone forever. In this film, it doesn't even look like Dern showers.<br><br>That's part of the charm and why it was so refreshing, at this late date, to go into the movie theater and enjoy an Alfred Hitchcock film without having to sigh that it was all about nostalgia. This film, in his humorous approach has much in common with \"The Trouble With Harry\" than \"Psycho\" or \"Shadow of a Doubt\". <br><br>Hitch didn't go out with a classic, that's for sure, but he went out with a modern film that showed he could still produce an entertaining flick. That was all he was ever about anyway. No higher praise is needed.","user":"crashpoint1","rank":[73,85]},{"title":"Murder Mystery as Comedy: last Hitchcock Film","rating":9,"date":"17 November 2005","review":"Get ready for the tricks and suspense you've seen in other films, but be sure to get the commentary on DVD. Barbara Harris looks just like Hitchcock's daughter, as you'll see from the interview, just a younger version. A extra lesson: You will never get a facelift once you see the interviews with Karen Black. If she had allowed herself to age naturally, she would have been so much more attractive than the gargoyle you'll wince at seeing.<br><br>Here's a treat: the winding mountain road and no brakes scenario as never you've seen it. I loved the comic touches and the risqué language. It is indeed a unique film. If you happen to love the mountain of California and San Francisco, you'll also love the cinematography. The stills are mostly of Hitchcock in the graveyard, which makes you wonder if he wasn't a little clairvoyant himself. The whole movie centers around a phony psychic and her attempt to cheat an old woman out of her money.<br><br>In our cynical world of today, you'll expect them just to dress Dern up as the missing heir, but nope, they play it straight. Having read of Hitchcock's misogyny, you'll appreciate the cuts and slices between the lovers. Both pairs of grifters have their own love thing going. Rather touching to see the fidelity among the crooks. Inspired writing, indeed.<br><br>Hitchcock did have a pacemaker installed while this movie was being made, so you have to wonder if his own thoughts of his impending death might have caused as much concentration on the graveyard scenes. Buy the DVD; the added features will make the movies itself 3 times more interesting.","user":"alicecbr","rank":[35,39]}]