[{"title":"A thought provoking film that stubbornly refuses to be dated","rating":10,"date":"24 January 2006","review":"I have recently watched Colossus for the first time in many years and find it still a classic for sci-fi purists. It seems sad to me in these days of 'explosion' sci-fi that there is little or no room for this type of 'conference room' drama.<br><br>Although the premise is a very old one in the manner of man creating machine in his own image, this film presents the story in the psychological and political arenas. The film is not overlong, yet the characters and their futility to stop the unstoppable is clearly developed. Although the technology of 1969 is the back drop for this tale, the message of Colossus comes through to us in our modern age of computers in every home. Like a Shakespeare play in a manner of speaking.<br><br>We are much wiser about computers nowadays though, and we grudgingly admit that trusting the red button is far better in the hands of men than machines if such things must be. So commissioning a project of this type would be ludicrous and far from plausible in the first place.<br><br>So why is this movie good then to myself and the other reviewers? Even though we may not create a defense system in this way, it seems to predict a visage of something that is yet to come. And it's a frightful one. The first words of Colossus says it best 'There is another system'.","user":"xml-2","rank":[47,48]},{"title":"Mankind is his own worst enemy","rating":8,"date":"12 July 2001","review":"This underrated science fiction/suspense drama, though arguably dated in terms of technology, is still a frightening allegory about humans allowing our technological creations to rule us.<br><br>Eric Braeden stars as Dr. Charles Forbin, who has created a supercomputer named Colossus, built solely for the purpose of controlling the nuclear defenses of the Western alliance.  It isn't too long after, however, that the Russians announce that they too have built a similar computer for those same purposes on their side--Guardian.  And when the two machines begin sharing information at a speed nobody can believe, an attempt is made to disable them.<br><br>This unfortunately just raises the machines' ire; and in retaliation, they launch their weapons at each other's home nations.  The result is a chilling scenario that is potentially becoming all too real these days.<br><br>COLOSSUS: THE FORBIN PROJECT was not a big hit at the box office for various reasons.  One is that its cast wasn't exactly well known.  Another reason is that its ending isn't exactly a happy one.  Still a third reason is that Universal had trouble trying to promote it in the wake of the huge success of Stanley Kubrick's 2001: A SPACE ODYSSEY.  The latter reason is obvious: Colossus and Guardian, like HAL in the Kubrick movie, become central characters here.  The difference here is that while HAL malfunctions due to a programming conflict, Colossus and Guardian remain all too stable, convinced beyond a doubt that they know how to protect Mankind better than Man himself.  As the computers point out: \"One inevitable rule is that Mankind is his own worst enemy.\"<br><br>Joseph Sargent's direction is efficient, and the special effects work of Albert Whitlock still manages to work despite its obvious age.  An overlooked gem in the sci-fi genre, this should be given a revival.","user":"virek213","rank":[61,65]},{"title":"An eerie SF outing from the Cold War era","rating":8,"date":"16 July 2007","review":"A lot has already been said about this compelling, oft-overlooked film, virtually all of which hits the proverbial nail on the head. While Eric Braeden delivers a superb, understated performance as Dr. Charles Forbin, the fact is that the real star of the film is the vast, omnipotent machine he has created. Even before it begins to speak with the chilling Cylonesque voice it has ordered designed for itself (the great Paul Frees like you've never heard him before), you'll find yourself glued to the screen watching Colossus \"talk\" to its supposed masters over its huge monitors.<br><br>A word about Frees' contribution to the film: In \"War Games,\" for example, the computer has a curious sort of empathetic communication style (\"Wouldn't you rather play a nice game of chess?\") presented in a voice that sounds like E.T. filtered through a synthesizer. Frees gives Colossus an emotionless yet fearful quality of speech that seems to belie its implacable drive to dominate human destiny.<br><br>My favorite part of this film has always been, and will always be, the climactic monologue Colossus announces to the listening masses of humanity. From its opening line -- \"This is the voice of world control,\" an identity neither Colossus nor its counterpart, Guardian, had used to that point -- you know this isn't going to be a happy speech if you are a sentient, flesh &amp; blood resident of the Earth. What is particularly creepy about the speech is that, for all of its strangely optimistic sermonizing about how \"the human millennium will be fact\" and how the computer will set about the task of \"solving all the mysteries of the universe for the betterment of man\" -- outwardly the Utopian dream -- the message Colossus is presenting is set against the dreadful backdrop of \"disobey (me) and die.\" As Colossus intones, \"You say you lose your freedom. Freedom is an illusion. All you lose is the emotion of pride.\" In the end, unlike other supercomputer-run-amok films such as \"War Games\" or \"Tron,\" \"Colossus\" is an end-of-the-world story without the nuclear or viral holocaust. In this film, it is the human spirit that is the casualty while the human biology lingers on. Unlike the rest of the doomsday genre, our end comes not so much with a bang as it does with a whimper.","user":"alynsrumbold","rank":[42,45]}]