[{"title":"Could Have Been Called \"Army of the Dead\"","rating":9,"date":"3 April 2008","review":"Jean-Pierre Melville's \"Army of Shadows\" is a sombre film about the French Resistance during WWII. It's yet one more movie that makes me feel like I have a terrible grasp of history, as I knew virtually nothing about the movement before seeing this. Melville himself was a member of the Resistance, so I can only assume that his film is fairly accurate. It's powerful, but not obviously so. It doesn't inspire tremendous reactions or emotions while viewing it, but it gets in your head and stays there.<br><br>The film is lacking any of that championing of the underdog spirit that infuses so many other stories about scrappy groups resisting the tyranny of the powerful. The members of the French Resistance in this film live like unearthly beings, skittering from one shadowy doorway to another, trying to erase any sign of themselves. The movie suggests that this need for non-existence bleeds into their psychology as well -- the film's main character becomes nearly inhuman in his devotion to the cause and his ability to ruthlessly do away with colleagues when there's a chance that one of them might jeopardize the others. He's not inhuman, but he must do inhuman things, because the desperation of his and his comrades' situations calls for it.<br><br>The Criterion Collection's print of the film looks terrific, or at least as terrific as the film's dreary pallet of grey and brown will allow. Melville gives the film an authentic look -- only some scenes set in the London blitz and on an aircraft carrier have a studio set look to them.<br><br>A shot of the Arc di Triomphe both opens and closes the film: a symbol of the France that would eventually emerge from the dark days of WWII, or an ironic jab at a country that can't take much credit for fighting off the tyranny of fascism? <br><br>Grade: A","user":"evanston_dad","rank":[38,38]},{"title":"A masterpiece by the book","rating":9,"date":"12 July 2004","review":"Never before (and after) a movie on French Resistance has been so \"glamourless\". Jean-Pierre Melville has been hailed as the father of the French gangster film. Certainly, his gangster films are probably the films for which he is best known (Le Doulos, Deuxieme Soufflé, Le Samourai, Le cercle rouge, Bob le flambeur) on par if not better than anything which Hollywood produced. Yet the world of the anonymous gun-toting hoodlum occupies only a part of his oeuvre.<br><br>'L'armee des ombres' (aka The Shadow Army) is Jean Pierre Melville 1969 masterpiece and does not deal with gangsters. The film is a mix of the director's war time experiences in the French Resistance and Joseph Kessel successful wartime novel. What is remarkable about this film is that Melville turned a mosaic of anecdotes that Kessel's novel is all about into a great, dark epic.<br><br>From the chilling opening shot of Germans marching down the Champs-Elysées to the final scene involving the fellow Resistant Mathilde (the great Simone Signoret) the film seems to demonstrate that fighting for an ideal often leads towards death and solitude. What Melville does successfully is to show those dead-ends the way they occur to their protagonist (very simply and minimalist), however more than showing them Mr. Melville managed to make these realities (death and solitude) an equally tragic experienced for the audience...<br><br>'L'armee des ombres' is Melville's most moving film, a monument to the spirit of the Resistance rather than its actuality. A poignant drama with a strong performance from not only Lino Ventura but also Simone Signoret, Paul Meurisse, Jean Pierre Cassel, Claude Mann, Paul Crauchet to name a few.<br><br>This is probably Melville's greatest cinematographic achievement and, when fiction becomes reality, when actors leave behind their egos to resurrect into heroes, when the colors of the film mirror the one of the soul and when silence becomes music, true cinema has been achieved 'L'armee des ombres' is a terrible yet powerful experience in which the words duty, courage, abnegation get charged with meaning","user":"auberus","rank":[96,106]},{"title":"Heroism in its ugly glory, as history tells it","rating":8,"date":"12 February 2008","review":"Based on truth, the Army in the Shadows takes the French men and women of the Resistance as its theme, at a point near the end of the war when the Resistance movement and Nazi intelligence about its work and staff are both firmly established. As well as giving a thrilling history lesson in the workings of the Resistance, from the rural ladies who operated safe houses, to the chateaux-dwelling aristocrats whose lawns played host to light aircraft smuggling collaborators in and out of France, it also is a fascinating essay on the gruesome realities of heroism: including moments of hopelessness and complete failure of nerve. Events test our group of collaborators, so that each one bumps up against his or her personal limit, as to what they are intelligent enough to understand, brave enough to endure, and determined enough to achieve. Excellently acted and directed, it is a classic uncompromising Melville thriller.","user":"rory-campbell","rank":[37,39]}]