[{"title":"A Tale of a Mutant Born on a Bayou","rating":6,"date":"2 August 2011","review":"From the mastermind behind such disturbing horror classics as \"The Hills Have Eyes\" and \"Last House on the Left\" comes a new dimension in terror \"Swamp Thing!\" <br><br>Yes, \"Swamp Thing.\" For real. Wes Craven really directed a \"Swamp Thing\" movie.<br><br>Showing the world that he was capable of handling more than just mutants and lowlifes, Craven set to adapting the comic series of the same name to film. The results? Well, let's just say there's some mutants, some lowlifes and a topless Adrienne Barbeau. Not a bad mix if one may say so.<br><br>Meet Dr. Alec Holland. Holland, played by the great Ray Wise, is a scientist who likes spending his free time bogged down in the swamp. On the verge of an ecological breakthrough, he is tragically transformed into a hideous yet unstoppable mutant. Treading water and stomping through the bayou, it's up to him to help save a beautiful colleague (Barbeau) from certain danger while trying to come to terms with his rubber suitI mean his new body.<br><br>The film is mostly harmless fluff. Craven has his heart in the right place, and even when the film misfires (as it so often does) it's hard not to love it regardless. Barbeau absolutely steals the show and runs with it, although it must be noted that in the short time he spends on film, Ray Wise delivers a charming and wholly human performance. David Hess also pops in to do what he does best: playing a merciless thug. There's also a score by Harry Manfredini at hand that evokes images of Crystal Lake, but for the purposes of this film, let's just call it Crystal Marsh. Also, look out for a cameo from the elusive Manbearpig towards the end of the film.<br><br>In the end, \"Swamp Thing\" is far from the finest comic adaptation, but then again, it's not the worst either. Fact of the matter is that it's a harmless and enjoyable affair, provided one is in the appropriate state of mind. Filled to the brim with oddball characters (Jude deserves his own spin-off) and goofy monster antics, \"Swamp Thing\" is an odd creature that you can't help but adore.","user":"Minus_The_Beer","rank":[9,9]},{"title":"A Fun, Class B Flick","rating":7,"date":"20 August 2006","review":"This reminded me of the 1950s science-fiction/horror films with its primitive dialog, hokey action scenes and laughable makeup for the monsters. Oh, man, does this look bad as time goes on and we have been treated to 25 years of great special-effects since this was made.<br><br>What makes this more attractive to watch than those '50s films, however, are great swamp photography, Adrienne Barbeau's body and a story that moves fast. Barbeau, as she was prone to do, appears to be only this is to show off her massive chest. However, it's pretty harmless fun, very tame compared to the horror movies of the past generation regarding gore and profanity. It's also pretty tame for a Wes Craven-directed film.<br><br>In the end, it's a good Class B film, usually fun to watch for a number of reasons.","user":"ccthemovieman-1","rank":[31,40]},{"title":"\"Swamp Thing\" is a bust - Adrienne Barbeau's, specifically","rating":8,"date":"10 January 2013","review":"Usually when I write a review, I try to make it as professional as possible. But when it comes to Adrienne Barbeau, all decorum goes out the window, and I reach for the drool bucket.<br><br>Purists will tell you that SWAMP THING is based on a DC comic, it's about a scientist who accidentally gets a potent chemical spilled on him and he becomes the title character, etc., etc. But look at the cover photo for this movie. Is the Swamp Thing the first thing your eyes are drawn to? Admittedly, the movie is kind of fun on its own terms. It's rated PG, so the violence and language isn't terribly off-putting. And the romance between Alice Cable (Barbeau) and the Swamp Thing is actually kind of sweet.<br><br>But all that aside, writer-director Wes Craven realized that when you're shooting on a minimal budget, you go for whatever special effects you can muster. And in this case, he had the mother lode of natural special effects. In the pre-cable-TV 1970's, how many teenagers got through puberty via their weekly viewing of Adrienne Barbeau bouncing across the set on \"Maude\"? Lest you think I have lapsed into tastelessness, be warned that I am not the only one to ga-ga over La Barbeau. Twenty years after the movie's premiere, I still recall The Village Voice raving, \"Adrienne sloshes through the swamp, arms flailing, wet T-shirted breasts bouncing.\" And Joe Bob Briggs devoted an entire evening to his comments about Adrienne's pneumatic qualities when he showed the movie on TNT.<br><br>So let's cut to the chase. Adrienne spends most of the movie in tight-fitting T-shirts (wet whenever possible), a low-cut evening gown, and even, in a lingering but discreet shot (again, this is PG), topless.(If you're lucky enough to rent the European version, Barbeau's uncovered bosom is displayed on-screen for about a minute.) Her natural assets (and that includes her acting) have never been shown to such advantage in any movie since this one.<br><br>So dads, rent the movie for your kids. It's harmless enough that they'll think it's mindless sci-fi. Only you will know the truth.","user":"busterbuff61","rank":[9,10]}]