[{"title":"Watch it and try not to compare...","rating":8,"date":"15 July 2006","review":"If your approach to reviewing this movie is to compare it with Hitchcock's usual style, Under Capricorn will surely not compare. If, however, you can suspend your expectations and view it with an open eye and mind, you might see that, in its own right, it is an excellent film of the type I refer to as the \"Victorian soap opera.\" Being an aficionado of this \"genre\", perhaps I'm biased; but I enjoyed immensely the leisurely pace, extended dialog (which unlike other reviewers, I found to be intelligent, graceful, and poetic). I found it to be gently suspenseful, never really being sure who would get the girl in the end, or even who might survive to the end.<br><br>Joseph Cotton was appealing, even though his character throughout much of the movie seemed to be villainous, and his reasons for being that way were quite apparent by the end of the film. My suspension of disbelief centered around Bergman's casting as an Irish aristocrat: once in awhile she managed to say a word that had an Irish flavor, but mostly she just sounded Swedish. However, that did not detract at all from her usual thoughtful performance. Michael Wilding irritated me a little with his foppish ways, yet even he managed to come off as a human being with faults and virtues...just like the rest of us. Leighton was superb and she, like Cotton, seemed to be a treacherous yet sympathetic character. I think it was the portrayals of complicated people with no one being painted as totally good or bad, the nuanced characterizations that I found so artistic yet real.<br><br>If you approach this movie without preconceptions, you might be drawn into it and appreciate Hitchcock's genius in an entirely different way.","user":"indrasnet","rank":[44,54]},{"title":"An lesser-known and underrated Hitchcock masterpiece!","rating":6,"date":"6 May 1999","review":"It's a real shame (and also rather difficult to believe) that this film is so little-known and difficult to view.  Even though it was directed by the famous Alfred Hitchcock (in my opinion, the most brilliant film director who ever lived), it has too often been dismissed as one of his \"lesser works.\"  To each his own, I suppose, but _Under Capricorn_ boasts some of the most beautiful photography and eloquent, literate dialogue to be found in any Hitchcock film.  Although the plot and structure of the film are familiar (the quintessential love triangle, ala _Wuthering Heights_), Hitchcock's treatment raises it above the ordinary.  The costumes and sets are actually quite lavish, and pay particular attention to the unique musical score! Hitchcock's experiments with the \"ten-minute take\" (with which he experimented in his previous film, _Rope_) also add to the film's interest. The film is not, of course, an artistic triumph for Hitchcock alone. Ingrid Bergman and Joseph Cotten (to name only two) are stars of the caliber that one just doesn't see anymore, and they give worthy performances. Casting Ingrid Bergman as an Irish noblewoman is, of course, rather bizarre casting against type, but this great actress makes it work.  Joseph Cotten possesses the rougher qualities that his part demands, but his performance also elicits sympathy from the viewer (such as the scene where he is going to present his wife with a collar of rubies but then decides to hide his gift when she and Charles Adair comment that it wouldn't go with her gown). The other actors, mostly little-known to American audiences, fill their roles well more than adequately and the very fact that they are unfamiliar makes them easier for the viewer to see as the characters they play rather than as \"stars.\" All in all, _Under Capricorn_ is an underrated masterpiece that is surely one of the best \"costume\" pictures of the 1940s.  It is not for anyone seeking vicarious thrills or shocks, but for discriminating viewers who demand a coherent storyline, color photography that is aesthetically pleasing, literate dialogue and interesting casting, _Under Capricorn_ will fill the bill.  I recommend it enthusiastically!","user":"George-n-Kansas","rank":[53,70]},{"title":"An Odd Misfire From A Great Director","rating":13,"date":"13 October 2004","review":"With a great director, a good cast, and a relatively interesting premise, it's surprising that this doesn't work better than it does. The Australian setting has potential, as does Joseph Cotten's character and the tangle of relationships in his household. But, despite some good scenes, it never really comes together, and even when things start to happen, it never feels as if it has hit its stride.<br><br>There's little fault to be found with the settings, which are convincing enough. Some of the characters never really come to life, but there is still an interesting mix of them. The pace is one area that definitely could have been improved, and the pre-occupation with the long takes certainly doesn't help at all. The technique worked very well in Hitchcock's \"Rope\", because it meshed with the setting and the subject matter. It doesn't fit so well here in \"Under Capricorn\", and it often dilutes the suspense rather than increasing it.<br><br>By no means is it a total clinker - the story does have some interesting parts, and with a different approach it could have been suspenseful, even memorable. Hitchcock's technical skill is still present in many respects, and even Hitchcock's lesser achievements are still worth seeing.<br><br>The movie's overly-polished feel is consistent with the approach that was chosen. It's at least one case where the more familiar, less affected Hitchcock style would have resulted in a much better film.","user":"Snow Leopard","rank":[38,50]}]