[{"title":"Is This All We Are, Is There Nothing More?","rating":6,"date":"25 January 2016","review":"I've heard George Lucas talk about the change of pacing between films of the 1970's and of films now. He talked about how the pacing of the first Star Wars film was considered rapid at the time but by today's standards, pretty slow. I feel the same can be said about the first Star Trek film (The Motion Picture). The first hour of this film is quite a drag. The special effects are dated, but sometimes that can be forgiven if the story around it is epic (Original Star Wars). The story for this film is embroiled in mystery as we don't even know who or what the villain is for close to an hour and a half. <br><br>Overall, I think I can say I enjoyed watching Star Trek: The Motion Picture as it brings back all of the same characters and dynamics from the original series, but the story dragged and I don't feel like this was the particular plot they should have revolved the first feature film around.<br><br>The enterprise this time is investigating an alien spacecraft that gets mysteriously close to earth, known as V'Ger. Captain Kirk returned back to his position as head of the Starship Enterprise. Kirk replaced the new head of the enterprise, Decker. Obviously, you know that the dynamic between the two will have plenty of tension knowing there's two captains in the same ship, but it doesn't go to the extent that a normal Hollywood film would do.<br><br>Yes, the tone and feel of the film is the same as the series but I think it was lacking the magic. There's a lot of time in the film spent on showing the numerous special effects shots and set pieces they created for the film. With that said, I don't feel like there was enough time spent on character development for people who didn't know the characters from the TV show. <br><br>It's not that Star Trek: The Motion Picture isn't a good entry in the series, it's just that there's merely nothing special at all about the film. Its constantly told to us that this mission is to save the entire human race and has a huge scope, but we don't really see that being played out. I liked the ending reveal involving V'Ger, but it didn't save the film from being an average entry in a history franchise.<br><br>+Same feel as the series<br><br>+Cool reveal<br><br>-Don't get a sense of the scope they were going for<br><br>-Too much time spent on establishing shots and showing off average special effects<br><br>6.3/10","user":"ThomasDrufke","rank":[17,19]},{"title":"It's Continuing Mission","rating":8,"date":"29 December 2010","review":"Star Trek: The Motion Picture has its unique place in cinema history as probably the first television series to get a big screen motion picture. Completely due to its special fan base, the like of which has never been seen before or since.<br><br>In order to keep the phenomenon going Gene Roddenberry knew he had to have something special to offer and he did. The continuity from the television series was accomplished effortlessly, in fact one of the new characters Commander William Decker is the son of William Windom who was another starship captain in an episode. More I can't say less I give the plot away.<br><br>In fact Decker played by Stephen Collins would be commanding the newly fitted Enterprise if it were on a routine mission. But with the threat of an immense alien being on a direct path to earth now Admiral James T. Kirk takes command of the starship himself and with Decker reunites all the old crew from the TV series to meet the threat.<br><br>Fans of the original series will also see the similarities in plot between another episode involving the Enterprise meeting up with an old space probe that now has taken on some new functions. The same idea forms the basis of this film's story although in every way it has been expanded and a new ending conceived. Here's a hint, a budding relationship between Collins and new ship's lieutenant Persis Khambatta is what ultimately saves the earth.<br><br>Just as you remember them William Shatner, DeForest Kelley, Leonard Nimoy, James Doohan, Nichelle Nichols, George Takei, and Walter Koenig are all back and completely in character as you remember them. The new people Collins, Khambatta and the rest are integrated nicely into the story.<br><br>Star Trek: The Motion Picture received three Academy Award nominations, for Best Art&amp;Set Direction, Best Visual Effects, and Best Musical Score. The special effects never overwhelm the telling of a good story which is the primary mission and best asset of the original television series and its successors. <br><br>If you're not a Trekkie before seeing this film, you may be come one upon viewing.","user":"bkoganbing","rank":[20,24]},{"title":"Who is 'VGER'?","rating":8,"date":"5 March 2000","review":"Star Trek: The Motion Picture is the first film in the Star Trek series, the most successful series in movie history.  After all, the fact that a movie series can hold the public's interest for 21 years (and nine films) and that the whole Star Trek concept is alive and well after over 30 years says something about the genius of Gene Roddenberry, Star Trek's creator.<br><br>People seem to cricitize this film heavily.  Some of the criticisms of the film that I have heard in my discussions with people include phrases such as \"frightfully boring,\" \"way too long,\" and \"chronically lacking in action.\" However, if that is all you saw in the film, then you clearly missed out on the film's beauty.  This film is not about guns, explosions, blood, or machismo.  It is about the philosophical relationship between logic and emotion.<br><br>The film is masterfully directed by Robert Wise, the academy award winning director of \"The Sound of Music.\"  The film reunites the original cast of the Star Trek series with a few new faces ... Stephen Collins as \"Capt. Decker\" and Persis Khambata as \"Lt. Ilia\".  It also recaps the events that have transpired in each original series character since the television series in the late 60's with a sensitivity to newcomers to the Star Trek universe.  It effectively introduces newcomers to Star Trek without insulting the intelligence of those of us who are thoroughly familiar with Star Trek.<br><br>The plot features an intelligent, logical entity that calls itself VGER. VGER is an innocent entity with one mission ... \"learn all that is learnable... transmit that information to the creator.\"  VGER in its incredible journey has in essence gained knowledge that spans the very essence of the universe.  VGER now has set a course for Earth in an attempt to share its knowledge with its creator.  VGER believes that its creator is on Earth.<br><br>VGER becomes a threat to life on Earth when its destroys three Klignon vessels and a Federation space station with incredible destructive power. To counter this threat, Admiral Kirk takes command of the Enterprise and leads the Enterprise in an intriguing battle with this alien entity.<br><br>While battling this alien entity, Admiral Kirk, Spock, and the rest of the crew learn about the relationship between human logic and emotion.  They explore philosophical issues such as \"Is this all that I am?\" and \"Is there nothing more?\".  I believe Spock summarizes the quest for answers to these questions by his statement about two-thirds of the way into the film that indicates that \"logic alone is not enough\".  They eventually learn to appreciate the unique attributes that make us human ... \"our weaknesses ... and the drive that compels us to overcome them.\"<br><br>In conclusion, this film has a great plot, great special effects, and excellent music and cinematography.  Definitely see it if you are truly interested in taking a philosophical journey into the essence of what makes us human.","user":"whitepe","rank":[155,231]}]