[{"title":"De Palma's first Hitchcockian thriller, and still one of his best.","rating":8,"date":"8 January 2003","review":"Brian De Palma is often unfairly dismissed as \"that guy that rips off Hitchcock\", a statement that overlooks the variety of his output. Of his twenty-odd full length movies only a handful have been thrillers, in fact before 'Sisters' he was best know as a maker of quirky comedies like 'Greetings' and 'Get To Know Your Rabbit'. 'Sisters' was De Palma's first foray into Hitchcock territory, and I think his subsequent stereotyping shows just how impressive he was in this genre. He has made several more famous and successful movies subsequent to this one, but it still remains one of his most entertaining works. Margot Kidder, a few years prior to her fame as Lois Lane, is brilliant as troubled separated siamese twins with a secret.  Jennifer Salt ('Midnight Cowboy') plays a spunky newspaper columnist who believes she has witnessed one of the twins commit a murder (a deliberate nod to 'Rear Window'). She cannot get the police to believe her and begins to do her own investigations, helped by a small time private eye Larch (Charles Durning - 'Oh Brother, Where Art Thou?'). She finds out that there is a lot more to the sisters' than meets the eye, and vows to find out what is really going on. Kidder is of course the star of the movie, but equally memorable is De Palma regular William Finley ('The Phantom Of The Paradise', 'Eaten Alive') in a wonderfully creepy performance as one of twins ex-husband. Kidder and Finley and De Palma's assured direction, which includes a brilliant murder sequence and cool use of split screen in another, make this a thriller that won't easily be forgotten. Highly recommended.","user":"Infofreak","rank":[61,71]},{"title":"De palma's best Thriller","rating":10,"date":"10 June 2005","review":"I was a very young 13 years of age when I first saw Brian De Palma's 'Sisters' when it first arrived in theaters in 1973. I was captivated and intrigued by the warning included on the theatrical poster outside of the movie theater. The caption within an inset box read-\"No one will be seated during a special 'shock recovery' period\". Of course this had me feeling ill before I even entered the auditorium in nervous expectation. Well from the very opening of the film we find our leading man lisle Wilson the unknowing subject of a surreal game show 'peeping toms'. The lead in music by the always brilliant Bernard Herrmann creates an unsettling and frightening mood. You can almost taste the psychologically evil direction of the film from the very beginning. Further through as we are introduced to our two main characters played by Wilson and Margo kidder we are carried through this with a very smooth dreamlike and creepy feel thanks largely to the incredible soundtrack Herrmann had created here. Once the terror hits us we are not exactly clueless that it is going to take place. But certainly de palma created the the first murder sequence this way intentionally. We know it is going to happen but we pray it doesn't. Well it does- and to terrifying results. The murder of our short lived leading man has to be one of the most shocking scenes ever filmed. The violent and relentless way in which this demonic 'alter ego/other sister' perpetrates murder is to suggest that the way in which she murders her victim is without any restraint and completely sadistic. This scene is certainly carried to terrifying depth through Bernard Herrmann's electrifying score, and now we see the ranting, jerking of the insanity of a serial killer... At only 13 I thought my heart was going to stop, I was mortified. De palma still leaves plenty for us as the audience to think about. Is the other half of these separated siamese twins real or imagined? Is she dead or is she perhaps possessing the body of her sister that is still living? These are questions that give us the mystery we are looking for. The always mystical and beautiful jennifer Salt (daughter of writer and producer Waldo Salt) portrays a reporter named Grace Collier, who witnesses this murder. The police are at odds with her, and for reasons that are quickly revealed. They have reason to question if her claims of a murder in the apartment across the way are real or some scheme grace has cooked up. For the rest of the film Grace plays the part of detective to attempt prove that the murder really did happen aided by a private eye (Charles Durning). What Grace finally finds out is truly terrifying. 'Sisters' is filled with plenty of good scares, creative split screen sequences, and plenty of dreamy nightmarish images. And then there is de palma's ala- hitchcock, which at times is more hitchcock than hitchcock. Bill Finley is especially superb as a quirky and creepy ex-husband. I can hardly understand why some people didn't care for this movie. 'Sisters' may have lost some of it's freight factor after 32 years, but it is still one of the best psychological thrillers ever made despite some moments that are less than perfect. I highly recommend this scary masterpiece. I highly recommend 'Sisters'","user":"childrenwithknives","rank":[25,28]},{"title":"takes cues from Hitchcock and then takes a leap forward; De Palma's best, most bizarre comedy/thriller","rating":10,"date":"11 March 2006","review":"I'd have to say that this film, though sometimes just shamefully manipulative for audience reaction (and I say that sort of as a compliment), is one of De Palma's very best films, both artistically and just in sheer entertainment value. It's got the low-budget quality of an AIP production, but set apart from Roger Corman's films or other films from the company. It's got such a strange, occasionally off-the-hinges, but dedicated wit that it's hard to ignore. In fact, this wit, and a good number of tight, screwed-up close-up angles, special point of view takes, and some of De Palma's trademarks (split-screen, ambiguous villain, women in trouble, etc) are what set it apart from being a complete Hitchcock homage. <br><br>It's no doubt that the director is so in love with the Master's style that, apparently, he even times his edits and shots to go with Bernard Herrmann's music. But what sets Sisters apart from even the more macabre Hitchcock films is that since De Palma is working in a low-budget, under-the-radar, with actors with not much credit to their names, things can be taken further than usual in dealing with the psychological 'whoas' of what goes on. This is possibly one of the most morbid tales to be told in 70's cinema.<br><br>Another important aspect to Sisters and its success is the faith that De Palma has in his actors/friend Margot Kidder and Jennifer Salt. They fit their roles so well one can't imagine big-name actors doing them any better (though Salt, up until the last act, is playing it all appropriately one-note). Kidder's Danielle/Dominique is quite a character too, one with so much complexity her story becomes like some wild ball of string that gets unraveled with little blood-laden marks along the road. Danielle brings home a truly nice guy, Phillip (good character actor, Lisle Wilson), sleeps with him, and then goes ape when she doesn't get her medicine...or is it her sister, Dominique? This first half hour is like some kind of satirical, sincere kind of film-making that could make just a great, open-ended short film. But with the addition of De Palma's split screen (possibly the best he's used it in any of his films), the story spins off into Grace, a reporter who gets on the case on her own to find out what happened to the body. This leads her into a very dark place, one that leads her into something so bizarre I dare not mention here.<br><br>But those last fifteen-twenty minutes or so are where things become a kind of make-or-break test in a sense for the audience; how far can one push this overtly surreal quagmire of a scene where the 'doctor' is present in front of our two main actresses? The 'doctor' himself is played by William Finley, and it would be arguable that his is such a toweringly creepy, scary performance of a villain that it becomes almost too uncanny. In this climax one has to wonder how far it will go, and then it becomes clear that it's almost the point of the story to go over the edge like this. We're dealt with an already peculiar premise of two Siamese twins, one of whom may or may not be alive, and how they're let loose onto the world. Early on it seems like this might just be an off-beat, funny noir kind of story, but by the end it becomes a bit more. <br><br>It takes originality to pull off some of the scenes here, or at least faith in what's written will work on screen. In a way this is the best place to see the bridge of De Palma's early black comedies (Hi Mom, Greetings; the neat opening TV show scene brings this to mind) and the hit or miss thrillers that have dominated his long career. Basically, for me, this was a hit, and that it was manipulative, sordid, and left the viewer still wanting some answers, makes it as successful a wink (if not homage) to Hitchcok that the filmmaker has done.","user":"Quinoa1984","rank":[43,52]}]