[{"title":"A great movie, but the dancers get no respect","rating":10,"date":"11 April 2006","review":"Since I'm a Newbie and go into detail on some the dance routines, I'm stating that there may be spoilers here just to cover myself.<br><br>Being afflicted with little coordination or a reliable short-term memory, I've developed a great respect, if not admiration for anyone who is or aspires to be a dancer, since those qualities are essential.<br><br>I used to attend the Solid Gold shows and marveled at how those dancers were expected to pick up complicated steps on the first take, repeat the routine time and time again until the director was happy, and then show lots of first-take energy. One dancer told me they always had swollen and sometimes bloody feet after the show. But at least they were always properly credited. I have no doubt that it's the same for the stage and screen dancers except that in so many cases they are treated as a throwaway commodity when it comes time to the credits.<br><br>Although \"Oklahoma\" is one of my all-time favorites, it is a classic example of the latter. In earlier viewings, I had noticed/liked/wondered about that perky little blonde dancer who has a crush on Will (Gene Nelson) and her almost-prominent presence in all of the dance routines. Being laid up with a broken foot gave me time to scan IMDBs comments and message board quotes for this movie, which prompted me to take a detailed, and in some cases a frame-by-frame look at this dancer's performances. <br><br>Well, leisurely dissecting her work in freeze-frame and slo-mo, you suddenly discover what a talented little gem this girl is (apparently Jennie Workman, but how can we be sure? - Updated 07/24/06 - Nope, it turns out she's Lizanne Truex). She first appears, and immediately establishes a stand-out presence as an infatuated-with-Will teenager in \"Everything's Up To Date In Kansas City\". At one point in the \"ragtime\" routine, she kicks so high she knocks off Will's hat -- and he is not a short guy. I thought he used the old trick of snapping his head back, but no, that little gal kicks her foot up as high or higher than her head with a disciplined precision (how many takes for that one?). Her disapproving look at Will's horse (who nuzzled him) typifies a little girl pique. Check out her adoring looks at Will while dancing with him as compared to her partner, who seemed concentrating on the steps. When the girls race with Will to the train, her arm-swinging energy makes it look like the start of a 100-yard dash. Freeze-frame caught her extra little toe-heel-toe step just before she jumped on the train  a nice professional flourish that I don't think was choreographed as her partner, who usually danced in unison, didn't perform.<br><br>Then there was her performance in \"Many a New Day\". First it was a how-can-I-fix-my-hair primping before a mirror followed by a hair-fluffing attention-getter and a dreamy head-in-arms swoon that personifies a young girl in love. At the end of the routine, when the dancers all fall to the floor around Laurey, she assumes a contorted position with such a fluid and graceful movement that you wonder if she has any bones.<br><br>In the early part of Laurey's (Shirley Jones) dream sequence, she shyly presents a bouquet of flowers to Dream Curly (James Mitchell) and when he accepts, she flashes such a winsome smile that it squeezes your heart. Dagnabbit, I'm in love -- and with a 50-year-old image at that! Follow her around in the \"Farmers and Ranchers\" bit and notice how she's not just acting, but having REAL fun -- by-God-enjoying every minute of it and probably thinking \"And to think they're paying me to do this!\"). There's a notably cute bit where she bounces up on Will's hip, seemingly light as a feather, and then rewards him with a very ladylike curtsy.<br><br>In \"All er Nuthin\" she and her partner come out and do some fancy high-stepping and strutting around Will and when he gives her girlfriend a peck on the lips, she does a great arms-akimbo pouting look of HMMMPH! This little lady consistently gives a great professional account of herself throughout the film both as an actress and a dancer. She has spot-on timing and always seems to kick a little higher and express a little more verve and elan than the others.<br><br>And for all this she gets a generic \"Dancer\" in the film credits!!! They could at least have said \"Perky Little Blonde Teenager\" or \"Foxy Teenage Blonde Infatuated with Will\". Heck, I'd even settle for \"Young Girl No. 1\". At least you would have been pointed in the right direction. Shame on whomever was responsible, for this little lady had lots of potential and in my opinion, her subsequent absence was a loss to the trade. Evidently this was her only film and biographical info on her is non-existent. All the other Internet movie references for her appear to be taken from IMDBs database. Perhaps she was so disgusted at the lack of recognition that she quit the business. Then again, I'd like to think some smart (as in lucky) guy married her soon after and by now she has lots of grandchildren.<br><br>In any event, I pass on a \"Well Done and I wish I could have seen more of you\" to her, wherever she is. It's the least I could do for someone who owns part of my heart. In keeping with IMDb's restriction on URLs, check out my tribute to her by clicking on nevkid12's name in the message board's reply to \"Who are the 2 dancers?\".","user":"nevkid12","rank":[41,46]},{"title":"Much Ado about Gloria Grahame","rating":10,"date":"27 January 2006","review":"There are many moments in \"Oklahoma\" when you want to jump out of your seat and shout for sheer joy,Gordon Macrae singing \"The corn is as high as a elephant's eye\" with magnificent disregard for the indefinite article,a daringly cast Rod Steiger intoning \"Poor Jud is daid\",\"Everything's up to date in Kansas City\",\"I'm just a girl who cain't say no\",I'm in danger of turning this into a list of songs but the film is so much more than a hook to hang the music on. Agnes de Mille's choreography makes use of stylised \"western\" dancing as its starting point then adds athleticism and grace in an exhilarating mix. Its great strength is in its apparent spontaneity,the sure sign of months of hard preparation.If there is a better choreographed scene than \"Kansas City\" in any movie musical I have yet to see it. Gloria Grahame,more usually cast as a gangsters' moll or a good-time girl has just the proper air of bruised innocence for Ado Annie with her wide eyes and slight lisp.\"I wanna say come on let's go just when I oughta say nix\" is a brilliant marriage of words and music and she interprets it as if she was genuinely confused by her mixed feelings. A wonderful performance and the benchmark against which every subsequent Ado Annie should be measured. The young Shirley Jones brings an unprecedented freshness and joie de vivre to the role of Laurey at the start of a long and distinguished movie career.Her peaches and cream beauty graced the big screen for another 40 - odd years but never to better effect. I have reservations about the ballet which I daresay was avant garde at the time of the first stage production in 1943 but nowadays judged within the context of the whole movie seems out of place .Perhaps it was initially conceived as a sop to the culture commissars of the day in order to boost the film musical's attempt to be recognised as \"art\". It became a bit of a vogue for a short while in the mid - fifties but thankfully a rather brief one as neither balletomanes nor musical fans were entirely happy with the hybridised product. In an era when the word \"great\" is so over used as to become virtually meaningless,it is no longer sufficient to say that Rodgers and Hammerstein wrote some great musicals.You have to say that they wrote some superlative musicals. And \"Oklahoma\" was arguably the most original innovative,tuneful and influential of them all. I am grateful to all the considerable artists concerned in its production.","user":"ianlouisiana","rank":[10,10]},{"title":"Kudos, comments, and a Grail-like search","rating":10,"date":"5 April 2006","review":"I've just hopped, skipped and jumped through seven pages of back-to-back kudos and other favorable comments on this great movie, and can do little but add mine to the chorus. Therefore, I'd like to focus on some minutiae.<br><br>The outstanding actress, among the many, is Gloria Grahame. In my humble opinion, she LIVED the part of Ada Annie. Watch her facial expressions during \"I caint say no\" and \"All or Nuthin' \". The woman radiates sensuality with every line. <br><br>In the version shown recently on TV (04/03/06), it appears some lines were cut from \"I caint\". Unless I'm hallucinating, I remember her singing the following lyrics: <br><br>\"Cain't seem to say it at all - I hate to disserpoint a beau When he is payin' a call! - Fer a while I ack refined and cool, - A settin on the velveteen setee - Nen I think of thet ol' golden rule, - And do fer him what he would do fer me!\" <br><br>and at that point she starts idling her hips and flashes a grin of triumph that just REEKS sensuality. Anybody else remember this?<br><br>Another subplot(?) rarely mentioned is those two young girls who have a crush on Will and show up in every dance routine. I was enchanted by that little blonde pixie and have been going nuts trying to find out who she was. I suspect she is \"Jennie Workman\", the first credited dancer (she had one line in \"Kansas City\"). If so, sadly, she has only this one movie to her credit. If anyone has info on this little charmer, please email me.<br><br>I saw this movie soon after it's release in 1955, and was floored by the brilliance of the lyrics, actors in out-of-part roles doing a fantastic job, and the innovative dance routines, including the surreal barroom scene - it IS a dream after all. Fifty years later I still get the same WOW! reaction despite viewing this movie on an almost weekly basis this past month (that darned pixie has got me hooked!).<br><br>I wish some local theaters, facing declining audiences and the \"home theater\" threat, would feature a weekly \"Classics Night\" and show films like this again. Even a 52\" HDTV pales in comparison to the Big Screen impact of some of these old movies, and this one would knock the socks off not only the current generation, but old geezers like myself who remembers when GOOD movies were the norm.","user":"borg1005","rank":[21,24]}]