[{"title":"sick, creepy, comedy-horror!","rating":26,"date":"26 November 2003","review":"If I had not seen BEWARE!THE BLOB as an impressionable youth, maybe I could look at it as a cheezy, poorly acted, uneven special effects, campy movie. But there is something sinister going on in this flick, and untill I read a mini revue in CULT MAGAZINE I thought maybe I was just being sensitive. A follow-up to the famous original about a man eating jello from outer space, most critics said something to the effect that BEWARE! THE BLOB doesn't know if it wants to be a horror movie or a comedy, so it fails at both, but I don't agree with that sum-up. I think Larry Hagman (and, or the writers)did something unlike anything done before. In a Horror-comedy, the humor is there to relieve the horror. HERE they got it backwards! We see characters doing goofy sit-com type things, and then they get eaten by the blob! I find the mix of styles very disturbing. This movie gave me nightmares as a kid, and I still can't shake it off! I think Hagman also had a lot of contempt at the time he made this flick. The characters are usually stupid and brain dead to their surroundings, making them easy prey (they are all self-absorbed before being blob-absorbed!). I find the bowling ally attack to be very effective despite the uneven special effects. I know some of you may think I'm taking this silly movie way to seriously and, okay, maybe I am.. But now when you go to a bowling ally, or to the barbers, or sit back in your easy chair just like Godfry Cambridge did, you may just think twice.. BEWARE!","user":"googlemorf","rank":[24,26]},{"title":"A Campy, Corny, Comic sequel to the original.","rating":31,"date":"31 December 2001","review":"More of a comedy than a horror flick with an all-star cast in this rarely seen 1972 sequel to the original 1958 \"The Blob\". This version starts out as a mysterious substance in a sealed container that reads \"Specimen--keep frozen\", which a man brings home and puts in the freezer. Then his wife, not knowing what's inside it, leaves it out on the counter where it escapes and begins to grow and reak havoc across town. Two teenagers set out to try and warn people of it's approach, but nobody, including the local police, wants to take them seriously, until they see it swallowing up everyone and everything in it's path. Starring Larry Hagman, Burgess Meredith, Shelley Berman, Dick Van Patton, Carol Lynley &amp; Cindy Williams.","user":"nokomis67","rank":[10,11]},{"title":"Not the BEST horror movie ever made, but certainly not the WORST....","rating":24,"date":"24 June 2005","review":"OK, I don't know why people knock this movie. I saw this when I was a kid, and it genuinely scared the crap out of me. I watch it now, and it still gives me the creeps in some scenes, the hippie getting his (final) haircut, for example.<br><br>I think Larry Hagman made this movie just to have some fun, and it clearly shows. I mean come on, where else are you going to see Burgess Meredith (God rest his soul) as a hippie? Some of the scenes were just plain hilarious, such as the scenes with Dick van Patten and the Boy Scouts, for example. Watching him talk to Lisa in the beginning, and getting annoyed at the scouts because of the \"Kerbangers\" later on, were terrific. I would have liked to have seen what happened to his character, but I guess we can figure it out for ourselves, eh?<br><br>Like I said, it looks like Larry and company had a lot of fun.<br><br>Give it a chance, and check it out. You won't be disappointed.<br><br>Kevin","user":"kman0072","rank":[14,17]}]