[{"title":"Beautiful film, giving hope to all those seemingly unrequited loves.","rating":9,"date":"16 October 2002","review":"Can you beat some of the lines in this film? As a guy, which I am, I identified with Harry's lines so much, and you can't help but side with him. The chemistry between the two actors, Billy Crystal and Meg Ryan is superb, and you believe in them when they talk, you feel for them when they look at each other. Even the friends are well casted, Carrie Fisher and Bruno Kirby. It's such relaxed acting and filming that you do nothing but watch these people fall in love, and pretty soon you feel like you're involved as well. With a fantastic soundtrack, direction, script and acting, it's a great film.","user":"Rich B","rank":[85,93]},{"title":"One of the best romantic comedies ever!","rating":10,"date":"1 August 2002","review":"Not too long ago I finally got around to seeing this film, I'd heard so much about it that I had to see it. After seeing it the first time I thought it was good, but I have to say that I liked it even more on my second viewing. The film is absolutely wonderful! The story is very amusing and keeps you interested in the characters from start to finish.<br><br>I literally couldn't wait to see what would happen in the next scene. This is one of those movies that goes by very quickly. I think that's a sign of a good movie, when you just can't believe that you're already an hour or so into the movie. The story really flows nicely from scene to scene.<br><br>The cast is great in the film as well. Billy Crystal pulls off one of his best performances, and has a slew of great jokes throughout the film. Meg Ryan looks as beautiful as ever and has such a cute way about her. Bruno Kirby and Carrie Fisher definitely deserve a great deal of credit too, they both did superb jobs as well. Director Rob Reiner did a great job with the film, keep up the good work Rob.<br><br>If you're into romantic comedies, then you definitely should see this film. Even if you aren't really into the whole romantic part of it, the comedy is great and worth seeing. I would most definitely recommend seeing this film.<br><br>I hope you like it. Thanks for reading,<br><br>-Chris","user":"LebowskiT1000","rank":[155,177]},{"title":"An Icon","rating":14,"date":"14 September 2002","review":"This movie grows like a good wine. I really didn't get it when it was first released; I avoided it like the plague. But people have a curious tendency to mature and change their POVs with time, and so was it with me. This movie opened me up to a lot of things - believe it or not, I didn't get the 'Call Me' sequence at first: I was lost, and admit it. But I am not lost now, and this movie is partly responsible.<br><br>Meg might be the reason guys want to see this movie, again and again, but after a while you begin to appreciate the contribution Crystal made to the film. The dialogue has his name all over it. The dialogue in this film is at times simply amazing - check the memorable quotes here if you've seen the movie and have forgot.<br><br>I would not pick this movie out of a barrel as most likely to be so influential, but it's a fact that it is, and rightfully so. Great support from Kirby and Fisher. Today it's Hanks and Ryan who are paired, thanks undoubtedly to Sleepless in Seattle, but one wonders why no one has tried to get Crystal and Ryan back together again. They're fantastic.<br><br>This is one of the all-time best movies ever made. All-time 10? Or 20? or 1000? I don't know; it's just one of the best - it has that quality about it. Keeper.","user":"UACW","rank":[101,121]}]