[{"title":"War of the Mines!","rating":7,"date":"1 February 2016","review":"The Yellow Mountain is directed by Jesse Hibbs and collectively written by George Zuckerman, Russell Hughes, Robert Blees and Harold Channing Wire. It stars Lex Barker, Mala Powers, Howard Duff, William Demarest, John McIntire and Leo Gordon. Music is by Joseph Gershenson and cinematography by George Robinson.<br><br>The yellow mountain of the title is in Goldfield, Nevada, and there is gold up there in that thar mountain. There are two local factions in opposition for mining superiority, something is clearly going to have to give...<br><br>She thinks I'm a philanthropist.<br><br>Lovely tidy Oater this one, it's for the discerning Western fan who has a love for the 1950s boon of the genre. It begins with a fun punch - up as Barker's Andy Martin arrives in town and renews his fremeny relationship with Duff's Pete Menlo, and of course the presence of the gorgeous Nevada Wray (Powers) muddies the testosterone waters still further. Uneasy alliances will be formed and director Hibbs slots in some Western staples (chase/fights/stare-downs etc) as the story progresses, with some very nifty stunt work into the bargain.<br><br>Technical credits are way above average. Barker has left Tarzan behind and is playing cowboy, and he's OK, but more of a presence than a fleshy character. Main problem for Barker is the strength of the supporting cast who outshine him. McIntire and Gordon are the weasels, which is always a bonus for Western fans, while Duff and Demarest, the latter of which owns the film, give great character driven turns. With nice outdoor scenery photographed around the Mojave Desert and appealing costuming on show, production is as safe as a brick out-house.<br><br>Stoic fans of Westerns will know exactly where it's all going to end up, but formula is fine if the journey is fun and engaging, such is the case here. It isn't going to make anyone's top 100 Westerns list, but genre fans should catch it if they can. 7/10","user":"hitchcockthelegend","rank":[9,9]},{"title":"Decent B Western","rating":6,"date":"16 September 2018","review":"Watched a HDTV copy of it. It is a pretty decent b western with good action. Barker, Powers, Duff and supporting actors are fine. Recommend watching it if you're a fan of westerns.","user":"gtroup","rank":[5,5]},{"title":"A pretty good Universal western","rating":29,"date":"29 March 2008","review":"Once more, I am surprised that little western has not be commented yet.<br><br>I think it's a pretty good one, colorful, action packed, with famous actors such as Lex Barker, Howard Duff, John Mc Entire as good as ever and Leo Gordon, the bad guy, of course, the \"heavy one\".<br><br>Gunfights, fists fights, mine scenes, ...This little movie was a really good surprise to me.<br><br>Its the rarest Jesse Hibbs western available. Because there is not Audie Murphy in it? <br><br>Anyway, this feature doesn't deserve to be ignored. Not at all.<br><br>I saw it from a 16mm print, perhaps no TV broadcast has aired it yet...","user":"searchanddestroy-1","rank":[7,9]}]