[{"title":"Great adaptation of superb anti-war classic","rating":8,"date":"16 November 2006","review":"The made for TV and 'remake' labels have tended to devalue All Quiet on the Western Front. With successors like Das Boot and Saving Private Ryan, it also seems less visionary now. However, All Quiet on the Western Front is a superb adaptation of Erich Maria Remarque's classic novel. The novel, published in 1929 by the 31 yr old Remarque was an instant classic. I remember reading it nearly two decades ago and its still one of the best books I've ever read. The Hollywood adaptation starring Lew Ayres - director Lewis Milestones greatest achievement - was very good as testified by its IMDb status. The remake is better! The remake is more intelligent, the cast is great and the period detail is extraordinary. The director - Delbert Mann - is an experienced veteran with classics like Marty to his credit. All Quiet is his magnum opus, released on TV because theatre owners didn't see it making any money. Naturally very few people watch message movies. Fewer still would make the effort to rent a \"made for TV\" film. Hardly anyone would watch this when they can see the original instead - a film with a more famous pedigree.<br><br>This adaptation is very faithful to the novel. Even with minor changes in the ending, the basic spirit of the book is retained. The cast is uniformly excellent with Richard Thomas playing the central role of Paul. Donald Pleasance, Ian Holm and Ernest Borgnine all give uniformly good performances in character driven and memorable roles. It could be said that Ernest Borgnine is too old and too fat to be a corporal. True, but on an emotional level be fits brilliantly into the role and his physicality really lends an element of humanity to him. The war scenes would rank very high in anyones list but for Saving Private Ryan's gritty realism. I loved the old German town from where Paul and his friends come. It looks straight out of the 1910's. All the period details are top notch. I strongly recommend watching this unheralded classic.","user":"faraaj-1","rank":[32,32]},{"title":"Excellent remake of the Lewis Milestone classic","rating":25,"date":"25 December 2001","review":"It is difficult to go wrong with such a magnificent story, one of the most affecting literary anatomisations of the tragedy of young men destroyed by war. And yet, this 1979 television remake of the Lewis Milestone original adds many elements to cherish of its own. Most notably, the casting of Richard Thomas, best known for being John-Boy Walton, in the role of Richard Baume. His characterisation is wonderfully profound, and poignant, and the scene in the trench with the French soldier is a virtual masterclass of compassionate acting. Thomas has never become a superstar; and for this reason he is one of an evergrowing army of neglected romantic leading men. The battle scenes are breathlessly exciting; and yet they do not dwell on carnage, and it is to their credit...and yet still they elicit pity and horror from the viewer. The music is magnificent, the structure craftmanlike, the acting (by Thomas, Borgnine, Holm) superlative, and the work itself suffused through with compassion.......","user":"Carl Halling","rank":[23,24]},{"title":"Very good","rating":8,"date":"5 February 2005","review":"This is a very good anti-war movie. It shows how the young and naive are being brain-washed to think that somehow it is their duty to kill and die. Big words like Fatherland, Kaiser, God, Patriotism. But it is always the young generation that does the dying, whilst the old men discuss strategy over a beer. War has lost whatever legitimacy it ever may have had when the leaders left the front line to lead from the back, safe in their headquarters miles away from the killing. Sending young boys to their death whilst claiming it is eventually for the Good is the ultimate cowardice. Some get their come-uppance, such as Cpl Himmelstoss, but most live their lives in the comfortable cocoon of their self-righteousness  the school teacher, the father, the Kaiser himself.<br><br>But sometimes a young soldier sees through the scam, as when Paul kills a Frenchman by sheer instinct, only too late realising what he has been forced to do to someone who might have been his brother. But even then the cultural impregnation is too strong for him to follow his true human feelings and draw the only logical conclusion. And of course in the end he pays the price himself. Destroyed - for what?<br><br>That is the lesson that we all should take to heart, to this very day.<br><br>A very good film based on an exceptional book.","user":"fadedGlory","rank":[50,56]}]