[{"title":"Life in the Last Lane","rating":10,"date":"18 February 2008","review":"René Clément's \"Gervaise\" is an adaptation of Emile Zola's \"L'assommoir,\" (1877), and part of the long series of novels, \"Les Rougon Macquart,\" the natural and social history of a family under the Second Empire of Napoleon III. Gervaise-Macquart is the heroine in one of these novels, \"L'Assommoir,\" which examines the milieu of the working class and the plague which is alcoholism.<br><br>However, Clément did not simply condense this monumental novel into a one and one-half hour film, which in the process would have only betrayed Zola's masterpiece. Clément, while scrupulously respecting the work of Emile Zola, makes a film centered on one character, Gervaise, a poignant and incredible picture of that period. Clément's choice resulted in \"L'Assommoir,\" the novel, becoming \"Gervaise,\" the film. In this film, he follows Zola's naturalistic approach, which at the limit becomes a stylized realism, a vision whose blackness takes on epic proportions. Clément represents very real emotions until they are reduced almost to abstractions. The result of such representation would seem to be the very opposite of realism and of naturalism. But his cruelty, which carries him until the end of a particular situation, sometimes even too far, merges with Zola's exacerbation of the situation (although Zola's clinical details are mixed with a resonant lyricism). With Clément, we do not end up with caricatures but with an authentic naturalism, which although refined is not less cruel.<br><br>A first-class group of actors was assembled to breathe life into Zola's words. Maria Schell (1926 - 2005), Francois Périer (1919 - 2002), both received prizes for their interpretations. Armand Mestral (1917 - 2000) and Susy Delair are outstanding in their respective roles.<br><br>René Clément shows his virtuosity in the cutting and editing of his work. The linkages give his film its extraordinary wholeness of form and its fluidity. The dissolves, when not passing directly from one scene to the next, are almost seamless, and most often they are accompanied by voice over comments. Clément exploits the lighting changes to reinforce the story. Many sequences open with a clear, pale luminosity, ending in a night-time. This, in fact, gives a kind of symbolic lighting to the film.<br><br>The camera motions are primarily tracking-pan shots, with the camera constantly following the actors in occasionally long, or sometimes infinitely short, motions, but always moving. In opposition, long motionless shots reinforce the main dramatic scenes. There are numerous series of close-ups, which serve either to emphasizing the psychology of the characters, or because the overall composition of a shot has a precise psychological significance.<br><br>Much of the dialogue is taken verbatim from Zola's novel. Discrete commentaries in voice over by Gervaise link certain scenes and remind us that \"L'Assommoir\" has become the history of this woman. Little by little, Gervaise's commentaries diminish in frequency with the film progression, as she becomes more and more tired and despondent, eventually disappearing completely, replaced by the sound effects.<br><br>The music is by the renowned classical composer George Auric, a member of \"le Groupe des Six.\" Clément's choice of Auric to write the music for this film was not arbitrary. The credo of the \"Six\" was a music based in everyday life, on vulgar spectacles (circuses, fairs. music halls, street songs), to confront us with the \"real life.\" Auric's music is discreet and used sparingly.<br><br>At the time Zola wrote the novel, he was strongly criticized for using such powerful material, as well as for presenting opinions of the lower classes. \"Gervaise\" is above all an historical document of the life in the middle 1850s, in the working class milieu in Paris. The daily, unbearable workers' conditions are remarkably well-portrayed in this film, without editorial comments. In those days, a work-day for a man, woman, and child was 15-18 hours; strikes were practically unknown and when one happened, it was violently repressed and their leaders severely punished. There were no social security or retirement plans, and aging without children to help in old age was literally an early death sentence. The salaries were extremely low, and an accident or a sickness would irremediably throw a family into dire, abject poverty. There was no escaping from this reality. The only form of entertainment other than an occasional visit to a \"Caf'conc\" (\"Café Concert\"), a kind of musical show, was \"l'assommoir\" (a bludgeon), the term for a low-class tavern, where men and women were easy prey to alcoholism. Clément shows us the irremediable descent of Coupeau into the alcoholic hell, and all the consequences to his loved-ones. Soon after, Gervaise will follow.<br><br>René Clément tells us the story of Gervaise, a woman subjugated by the men she loved, captive of society, her social background, and social condition, who tries to escape her proletariat status. But external and internal conditions frame our lives, against which our will has no control, and Gervaise's revolt against her condition, her desire to possess her own shop, rising above her station, may have also brought her downfall. A Hindu person would say the she violated her \"Dharma.\" But who knows? Maybe she would have ended up in the same place, but at least she got the satisfaction of having chosen her own instrument of torture.<br><br>One of the three important men in Gervaise's life is Goujet, and with him Clément introduces a sub-theme-- a political one. The 1850s saw the democratic ideals of the first French revolution of 1789 logically progressing toward a budding Socialism, coming in as a reaction against the new slavery of the industrial revolution, Capitalism. Goujet, the blacksmith, represents the ideal socialist revolutionary, a hard-working, honest laborer, just asking for justice and his deserved place \"at the table.\" He is ready to sacrifice himself for the benefit of a better life not only for himself, but also for his fellow workers.<br><br>René Clément's adaptation of Emile Zola's novel \"L'Assommoir\" is widely regarded as one of his best films and it is unquestionably one of his most poignant and intense works.","user":"tintin-23","rank":[20,21]},{"title":"GERVAISE (Rene' Clement, 1956) ***","rating":7,"date":"21 November 2007","review":"Acclaimed film from Emile Zola's \"L'Assomoir\": typical of French art-house cinema, it's meticulously-detailed, technically proficient and splendidly acted  however, the main plot of a crippled woman whose ambitions to open her own laundry business are hampered by a complex love life isn't exactly thrilling. Still, one can certainly understand the multitude of international prizes the film won or was nominated for at the time of its release.<br><br>In fact, Gervaise (German actress Maria Schell in a luminous performance) is involved throughout with a philandering ne'er-do-well (who fathered her two elder children), her husband  splendidly portrayed by Francois Perier  who loses his job after falling off a roof and subsequently takes to drink (with whom she has another kid) and a young political activist (who gets thrown into jail)! The woman has a similarly ambivalent relationship with her husband's family and the neighbors in the poor quarter where she lives  especially the sister (played by a reptilian Suzy Delair) of the woman with whom her first lover eloped. They have a big fight in the washing centre of town (which even involves some surprising split-second nudity) but, when they meet again, both are willing to bury the hatchet (Delair having married the local police constable)...that is, until the lover himself reappears! Ironically, Perier and his rival become friends (they even look alike!) and the former eventually contrives to have the latter lodge with them!! <br><br>Ultimately, though, Perier's drinking problem escalates to the point where he becomes an embarrassment to his wife (admirably, the director does not shy away from showing his vomit-soaked pillow at one point!) and, in a fit of rage, destroys her shop; this harrowing sequence culminates in him being taken away by hospital attendants bruised and raving (in fact, he dies shortly afterwards). Equally depressing, however, is the ending  which finds Schell destitute (having sold the shop to Delair, now in cahoots with her former lover) and herself a frequent customer of the local tavern!; no longer able to care for her youngest daughter, the latter is forced to look out for herself  which she does with naïve optimism.<br><br>I have two more titles by the underrated Clement in my unwatched VHS/DVD pile  JOY OF LIVING (1960) and IS Paris BURNING? (1965)  as well as another highly regarded French film starring Maria Schell  Alexandre Astruc's UNE VIE (1958; though available only in its original language)...","user":"Bunuel1976","rank":[7,7]},{"title":"A Classic of French Cinema - L'Assommoir by Emile Zola","rating":20,"date":"20 May 2002","review":"This as far as I know is the only film version of a very famous story by a French Novelist called Emile Zola. It is \"L'Assommoir\" and is the story of how drink and alcohol can ruin lives and kill. The film is extremely well acted but seems a bit \"short\" compared to the book which has far more lurid details concerning the downfall of each of the characters. The story takes place behind the Gare du Nord in the Northern Sector of Paris in what is called today the \"Quartier de la Goutte d'Or\". Unfortunately that area today bears absolutely no resemblance to that portrayed either in the book or the film and is extremely dangerous and violent - any visit of it is strongly advised against. Anyway the story is very moving but be warned the outcome is not a happy one. One other thing, the book is one of a series written by Zola about a family called \"Les Rougon-Macquart\".  The series also includes the book \"Germinal\" which has several times been made as a film. But of all the films of Zola's books I have see, L'Assommoir (Gervaise ) is my favourite !","user":"nicholas.rhodes","rank":[14,16]}]