[{"title":"Capra Remakes Himself","rating":9,"date":"1 January 2008","review":"With \"Pockeful Of Miracles\" Frank Capra remakes his own \"Lady For A Day\" with Capraseque results - that means a mix bag with mostly delightful stuff in it - The major problem here is Glenn Ford, not as an actor but as a producer. There is too much dedicated to Ford's character's businesses, moving away from what really matters - Apple Annie and her predicament. Bette Davis was one of the major supporters of Glenn Ford at the beginning of his career - A Stolen Life, did for his career what \"Thelma and Louise\" did for Brad Pitt's and one should remember that Davis sort of \"imposed\" Ford for that role. Now Glenn Ford bills himself above Bette Davis. That should tell you something. The film, however, more than survives the petty egos and comes out as a wonderful swan song for the extraordinary Frank Capra. Bette Davis herself confessed to have found enormous difficulty at being faithful to Apple Annie in those gorgeous gowns post-makeover, but this is, was and always will be a fairy tale and as such it succeeds beautifully. The entrance of Davis after the make-over scored with the Nutcracker suite, it's one of my most cherished movie memories as are Davis's eyes as she witnesses the \"miracle\" in first person. A collection of wonderful character actors: Thomas Mitchell, Ellen Corby and in particular Edward Everett Horton makes the whole thing a smashing pleasure. Beautiful Hope Lange is terrific and Peter Falk wears a coat that makes his character a shady relative of his future \"Colombo\". If you're not made of stone and/or your levels of cynicism have not reached inhuman stages, you're going to enjoy this very much. I certainly did.","user":"giorgiosurbani","rank":[59,72]},{"title":"Remake edges out original with comedy and different slant","rating":9,"date":"28 June 2017","review":"The source for this movie is a Damon Runyon short story, \"Madame La Gimp.\" It was first made into a movie in 1933, entitled \"Lady for a Day.\" Frank Capra directed that film, which received four Academy Award nominations for the then second-tier Hollywood studio, Columbia. Here, Capra produced and directed the remake with an independent company set up for that purpose. \"Pocketful of Miracles\" received three Oscar nominations. <br><br>This movie has a lot of history behind it – Capra's desire to remake it, different scripts and studio interests, different casting, conflicts between stars, etc. Some of the reviews I've read seem to have been influenced more by that history than by the product itself. I've read much of the background. I've watched and enjoyed very much the original \"Lady for a Day.\" I was in the Army when this film came out, and we didn't get to see movies until long after they came out. So, it was some years later before I first saw \"Pocketful of Miracles\" on TV. I now have it on DVD in my film collection. <br><br>I think I can see why Capra wanted to remake the movie – and in its original setting and time, the 1930s. \"Lady for a Day,\" was a very good film. But Capra was only director – he didn't have control over the script or some of the casting. In \"Pocketful of Miracles,\" Capra was in charge from the beginning. Glenn Ford was his partner in producing the film and had the male lead. But it was Capra's baby from the start. It's too bad that there were personality conflicts between some of the actors, and that Capra had to endure the infighting. But, it's as much an accolade to Hollywood and the acting profession that we viewers don't see any of that in the finished product. Instead, what we see is a delightful, whimsical, fairy-tale of a story. <br><br>Capra has changed the tone and mood of the original film so much that we see here a completely different story of an almost identical plot. Mary Robson was wonderful as the first Apple Annie. She seemed to be a pathetic character, a product of misfortune and the times. Bette Davis, on the other hand, while a product of the times seems to relish her position in society. She puts a little more life into the character – very appropriate for this second film version. Warren William is good as Dave the Dude, but we don't know what the big deal is that distracts him once in a while. And, he and his gang are wont to use the artillery from time to time. Very believable for the times, I think. Glenn Ford's Dave the Dude is much more a man of pride who's gang doesn't wield guns so much as muscle. He has connections, and Ford gives a bravado to the character that fits beautifully into the comedic role. <br><br>Anyway, the entire cast is superb in this film. And it's a cast of many notable actors. This is an entertaining film all around, and one the whole family should enjoy.","user":"SimonJack","rank":[11,12]},{"title":"Smart and Joyfull, made in Capra","rating":8,"date":"19 February 2006","review":"I used to watch this movie once and again when I was a child. Didn't even know who Bette Davis or Frank Capra were, but already loved the film. The story is a remake of one of Capra's films of the 30's. Easy to follow, filled with smart humor and better acting. I admire the transformation of Bette Davis, great work along with wardrobe and make up departments! Last Capra's film, it has the typical characteristics of his career. The importance of emotions, the rhythm, the magic and the happy ending. It was the beginning of the future sex-symbol Ann Margret in a great and extensive cast. It's a great movie to watch with kids, or for cinema addicts looking for a rest.","user":"poliminia","rank":[24,31]}]