[{"title":"Another Great Unavailable Noir.","rating":7,"date":"11 May 2010","review":"For about the first 30 minutes of Paramount's THE FILE ON THELMA JORDAN (aka \"Thelma Jordan\") you get the impression that it is going to be another love triangle with unhappily married District Attorney Cleve Marshall (Wendell Corey) having the hots for 'ready for a fling' Thelma Jordan (Barbara Stanwyck). But then the movie begins to find its purpose and turns out to be a splendid noir thriller. Produced for the studio by Hal Wallis in 1949 it was beautifully written for the screen by Ketti Frings and sharply photographed in monochrome by George Barnes. Adding greatly to the picture is the marvellous atmospheric score by the great Victor Young and the whole thing was masterfully directed, in his best noir style, by Robert Siodmak. Siodmak was a exceptional - but inconsistent - director. In 1945 he directed \"The Spiral Staircase\" one of the finest suspense thrillers ever made. Followed the next year with one of the best noirs ever produced the unequalled \"The Killers\". But he was prone to surprising diversity too! He could go from these supreme thrillers to directing such things as the entertaining but clownish swashbuckler \"The Crimson Pirate\" (1952) and the stiff and clunky western epic \"Custer Of The West\" (1967). Nevertheless he is best remembered today for his ingenious noir efforts.<br><br>The plot of THE FILE ON THELMA JORDAN has Thelma Jordan (Barbara Stanwyck) being accused of the killing of her aunt (Gertrude Hoffman) and robbing the safe in her grand mansion. Pleading innocence, she sends for her lover Cleve Marshall (Wendell Corey) to help her. He arrives and commences to divert any blame for the murder away from her. But to no avail she is arrested anyway for the killing and charged. Cleve, as the District Attorney, now plans to prosecute her in court and purposely lose the case so that she will be acquitted. The plan works but to Cleve's chagrin it turns out that she did, after all, murder her aunt and not only that but she also has a husband (Richard Rober) with whom she had planned the whole thing from the beginning. With Cleve now totally dispirited and his career in tatters Jordan, with her husband, go away together to start over but with a change of mind and heart she deliberately causes the car they are in to crash and explode into flames.<br><br>One of the most tangible aspects of the picture is the musical contribution from the great Victor Young. The main theme first heard over the titles is a gorgeous sweeping melody that becomes a ravishing love theme later. It is one of the composer's loveliest melodic inspirations and gives the lover's early scenes together a tender romantic aura. Then there is the exciting martial cue for the film's terrific set piece as Jordan is being walked hurriedly from the Jailhouse across the street to the Courthouse, flanked by milling press and public, to hear the jury's verdict. The entire pace of this sequence is achieved through the brilliant use of music.THELMA JORDAN is Young's best noir score!<br><br>Performances are excellent! Stanwyck has rarely been better, doing her powerful devious Femme Fatale bit just as good as anytime before. Excellent too is Wendell Corey! The only actor I know who can deliver lines without moving his lips. An actor who usually played second male lead Corey had heaps of screen presence but was never the ideal leading man. Stanwyck who could be overshadowed quite easily by a stronger male star such as Holden or Ray Milland probably chose Corey for that very reason. She chose him again the following year to play opposite her in Anthony Mann's \"The Furies\".<br><br>THE FILE ON THELMA JORDAN is a classic film noir but isn't it a shame that it is not available on DVD. It was on VHS at one time but now I think its about time Paramount gave serious thought to a DVD presentation.","user":"jpdoherty","rank":[34,36]},{"title":"Turns out she was a Dame with a conscience","rating":7,"date":"12 December 2008","review":"From her first entrance, Stanwyck kept me captivated by her performance in this film. There is something about her that draws you in and holds you. You know there is more to her than meets the eye - but you're not sure what exactly. <br><br>I have always admired Stanwyck. She was born Ruby Stevens, a Brooklyn girl that worked for a phone company and then became a chorus girl, before finally going to Hollywood to chase her dreams. She was nominated 4 times for an Oscar for Best Actress (\"Stella Davis\", \"Ball of Fire\", \"Double Indemnity\", \"Sorry ,Wrong Number\") but never won - except for an Honorary Oscar near the end of her life. She was considered a gem to work with for her serious but easy going attitude on the set (unlike many of her contemporary peers). This makes me like her even more!<br><br>I thought the cinematography in this film was outstanding. I loved the elaborate sets and and set decorating.<br><br>The plot kept me intrigued as well. Corey plays the perfect fall guy for Stanwyck. His average looks and dull exterior tend to make you feel sympathetic for this guy. Some have commented that they didn't have much chemistry together. I agree that they are an unlikely couple, but it helps you see how he could get so caught up in her and be willing to sacrifice so much. She was obviously outside his league.<br><br>There are some nice twists and turns in the plot that will keep you interested - especially at the end. It's worth a watch.","user":"PudgyPandaMan","rank":[10,10]},{"title":"I don't think of him anymore because of you.","rating":8,"date":"15 November 2013","review":"Wendell Corey had a long career in film and television. In this film he plays Cleve Marshall, an assistant DA who is staying late at the office to avoid going home on his anniversary because his father-in-law (Minor Watson) is there.<br><br>While he knocking back shots as fast as he can pour them, in walks Thelma Jordan (Barbara Stanwyck) looking for help. Now, one would certainly be suspicious if a beauty like that immediately began a relationship, but our intrepid hero is too drunk to notice, and, after all, he wants to go out and find a dame. <br><br>He is no better the next day when his wife (Joan Tetzel) takes the kids to the beach house, and leaves him alone during the week.<br><br>As one would expect in film noir, everything is not as it seems. Cleve gets himself into hot water and uses all his wits to get out. <br><br>I have to admit the ending was a big surprise.","user":"lastliberal-853-253708","rank":[9,9]}]