[{"title":"I loved it, and I'm proud to be Swiss","rating":8,"date":"20 August 2003","review":"This Film is very funny, it presents all the good and bad things of Switzerland: banks, watches, kindness, be neutral, be a bit closed minded and with a great attaccement to the traditions. The Story is very simple, we follow 2 people that must decide if some stranger can get the Swiss nationality. Full of amusing situation, with a strange love story, and full of \"clichées\" about swiss, italian, german,... people that can always bring a smile on the audience. It's the most popular Swiss film ever made, with about 1 Million visitors, it's a little number for the world movies, but very big for our country. Very amusing for all who knows a bit of the european culture or Switzerland","user":"Ilde","rank":[25,29]},{"title":"A wonderful Swiss film","rating":8,"date":"29 December 2006","review":"A very nice Swiss film, a comedy with genuine Swiss characters. The film proves in a wonderful way the opposite of the cliché about the Swiss humour.<br><br>The film is nowadays, nearly 30 years after its production, more actual than ever, disclosing a lot of the hidden intolerance of our Swiss mainstream community against everything which does not fit into what this community expects to be \"Swiss behaviour\".<br><br>The story is about how people can get Swiss citizenship. It is not exaggerated at all! (I as well had to enjoy this procedure few years ago, with the local police officers, coming into our house, checking what we where eating, asking us what we think about the Swiss Army, where do we go for shopping, talking to the neighbourhood, etc.).<br><br>I love this film.","user":"zozon-1","rank":[11,12]},{"title":"Fantastic movie !","rating":10,"date":"2 November 2006","review":"For anyone who lives in Switzerland, this is a must-see. <br><br>It's true although exaggerated (sometimes !), very funny, touching, and just well made. <br><br>It brings to the fore all the foibles of the Swiss, strengths and weaknesses, and it's just a great movie to watch. <br><br>It's romantic too ! <br><br>I highly recommend it to anyone who lives in or has lived in Switzerland, including all Swiss !!!<br><br>Emil is wonderful in it too, and I wish he had made more films, he is perfect in this role.<br><br>I sometimes have a hard time buying it since it's getting old, but I've found it a few times and given it to friends.<br><br>Get your copy now, if you can.","user":"annehs","rank":[4,5]}]