[{"title":"Another triumph for black and white British horror!","rating":9,"date":"6 April 2004","review":"I've just watched this obscure little British horror. The only name I recognised in the credits was the writer Richard Matheson. But it turns out that the director was Sidney Hayers, who also directed Circus of Horrors, before he went on to direct a lot of television, including The A Team, The New Avengers and Manimal (does anyone remember that?).<br><br>The plot is a little haywire, but this is a great film. It fits into the horror sub-genre \"Housewives and school teachers who get into witchcraft\", along with Horror Hotel, Hammer's The Witches, Romero's Season of the Witch and many others, probably. It's got some great visuals, partly due to the very dark black and white photography, it has genuine moments of suspense and the special effects are incredible for a film of its age and low budget. It's also known as Burn, Witch, Burn, which gives it a sensationalist twist that it doesn't really need. Night of the Eagle is a much more appropriate title. I highly recommend this if you can catch it on TV or DVD!","user":"trouserpress","rank":[41,43]},{"title":"Eerie, spooky, and generally terrific","rating":9,"date":"27 January 1999","review":"This is a really excellent black and white spooker with an engaging story and some really creepy moments.  The production values are excellent, the acting is very good, and the story and script are both top-notch.  Plenty of twists, even if the identity of the villain is a bit obvious, and enough tension to really keep you on the edge of your seat.","user":"ric-29","rank":[30,31]},{"title":"Classic chiller with a great leading performance","rating":10,"date":"22 August 2000","review":"This has always been one of my favorite horror movies. A lot of its force--notwithstanding the good solid script and direction--is due to Peter Wyngarde's performance as the husband of the title witch. At first he shows us the man's skepticism, a disbelief so fervent and so confidently scornful of opposition that it persuades his wife, even in the face of the sinister atmosphere that's growing all around them--this being painted in with that easy skill that only Britons seem able to command. As the story progresses, Wyngarde shows us, one unnerving step at a time, the man's loss of his lack of faith, to the point of absolute belief (which the film points up with an obvious, but very satisfying, joke) and absolute terror. Except for Fay Wray writhing and screaming between twin pillars in anticipation of her sacrifice, I can't recall another victim whose fear I've felt along with him so completely. In my opinion Wyngarde's is one of the great performances in horror films, and the film itself is one of the last of the classics.","user":"galensaysyes","rank":[42,45]}]