[{"title":"A Roger Corman 60's freakout, recut by its studio","rating":26,"date":"26 May 2000","review":"In Roger Corman's autobiography, he says that this film, GASsss, was a deciding factor in his leaving the employ of AIP. The film, as it stands, is a valiant effort at a counterculture comedy, and although the jokes are mostly dated today, the film is an interesting bit of drive-in history.<br><br>We open in 1968, which was the current year when this was made. A hippie is running from cops, and hides in a church.The hippie dresses as a priest,and dodges the cops. While sitting in the confessional,he meets a young female scientist on the run. She can tell he's not a real priest, because he uses the F word.<br><br>The hippie learns what the scientist is running from. She had left an experiment station where a chemical gas was escaping. The gas supposedly kills everyone over 28 years old, so, in essence, the older generations would be wiped out.<br><br>This leaves the world in shambles. The hippie and his now-girlfriend scientist make a trip south, to try to locate a commune/pueblo that is setting up to shelter those who have survived.<br><br>I don't want to give much else away, except that there are several characters the two meet on their journey south. Ben Vereen and Cindy Williams(pregnant) play a hip couple, and some football players show up. There's also bikers on golfcarts (hippie: \"Who are you?\" , biker:\"Don't get metaphysical.\")and assorted failed gags, and some funny ones. I especially liked the more obnoxious characters.<br><br>But my girlfriend hated the whole film. She disliked all the whole free-love jive, and she just didn't get the jokes. I got the jokes, even the bad ones. But I enjoyed it, and she didn't. I tried to argue that Corman was talented.<br><br>In fact, until Corman set up shop with New Horizons some twenty years ago, he was consistent in making films that were not always good, but usually fairly intelligent and provocative. When Corman was hot, from the mid-50's to the late 60's, he was good.<br><br>GASsss is the tail-end of that streak.He directed one more film after this, the dull VonReichtoven and Brown, and retired to be a producer. The only other flicks I've seen him do(Frankenstein Unbound and The Phantom Eye) have been unworthy ventures.<br><br>So, my point is that GASsss was Corman's last film as director that really succeeded to entertain. Yes, the cuts that AIP imposed on some of the chancier jokes do hurt the film.(who knows how funny it would've been to hear God narrate the story with a Jewish accent? Or how breathtaking the final shot would have been, a tracking shot that Corman says was the best shot in his career, left on the cutting room floor). Then again, I'm not sure if the film would've made much more sense than it does now.<br><br>Yes, GASsss is a failure, but an interesting one. If you're feeling patient one night for a 60's time capsule, and you like Country Joe and the Fish, this the film for you.","user":"silentgpaleo","rank":[25,26]},{"title":"Nutty psychedelic sci-fi comedy.","rating":8,"date":"8 June 2002","review":"The late 60s/early 70s saw a handful of genuinely odd pseudo counter-culture movies released by American studios, including cult classics like 'The Trip', 'Greetings', 'Psych-Out', 'Cult Of The Damned', 'Beyond The Valley Of The Dolls', and 'Zachariah'. Whether they were \"genuine\" of just plain exploitation is open to debate, and also a moot point all these years later. Fake or not they are a lot of fun now for 60s buffs. You can add Roger Corman's 'Gas-s-s-s' to that list. The movies premise is that a gas has been accidently released that kills everyone over the age of twenty-five. A hippie on the run from the police (Robert Corff) teams up with a scientist (Elaine Giftos), and the two go on a road trip to New Mexico, trying to find a rumoured hippie Utopia. Along the way they hook up with two couples - revolutionary Ben Vereen ('Roots') and his pregnant rock'n'roll fanatic girlfriend Cindy Williams ('Laverne And Shirley'), and their weirdo pals Bud Cort ('Harold And Maude') and Talia Shire ('Rocky'). The six companions come across many strange situations on their journey, including a militant dune buggy riding football team, Country Joe and The Fish on a golf course, and Edgar Allen Poe, Lenore and The Raven riding a motorbike. Yup, it's one of those kind of movies! Silly, self indulgent, with a lot of half baked (pun intended) jokes that aren't entirely successful. Even so quite a trip if you are in the right frame of mind. Nowhere near as good as Corman's 'Bloody Mama' (released in the same year), but it's probably his most overlooked movie, from a long, varied and consistently underrated career. One day he will receive the recognition he deserves, both as a producer/director, and for getting many important actors and film makers their first breaks.","user":"Infofreak","rank":[24,26]},{"title":"Interesting, but flawed Corman curio","rating":13,"date":"13 July 2003","review":"This is the film that Roger Corman says was his final straw with AIP. After mildly editing WILD ANGELS and THE TRIP, their virtual elimination of \"God\" and the obliteration of the original ending led him to form New World Pictures.<br><br>Seeing this film at the American Cinemateque in a striking new print shows both its virtues as a one-of-a-kind (well, at least for anybody BUT Corman!) oddity as well as a failed attempt at counter-culture comedy. It's hard to see how even the original Director's Cut (if it exists at all) would really be that much of an improvement. What is on the screen is still probably about 90% of what Corman shot, and it's a scattershot affair. The Cinematography and Music stand out, as well as bits of the acting, particularly by Elaine Giftos.<br><br>Roger Corman spoke after the Cinemateque screening.<br><br>Corman said that he hadn't seen the movie since its release in 1970. It was edited before its theatrical release by AIP. Most significantly was the almost complete elimination of the voice of \"God\". Corman speculated that since AIP had gone public (stock market) around that time, that they were concerned that the \"Jewish comic\"-type voice would be considered sacriligious! Then, AIP cut the most elaborate shot in the entire film. The original ending! Elaine Giftos and Robert Corff were to \"walk off into the sunset in the most cliched ending possible.\" This was shot in a big panaroma shot \"with marching bands and the whole cast included.\" Corman said that it STILL bothers him that as released, the film \"has no ending.\"","user":"gortx","rank":[15,17]}]