[{"title":"From the four winds four brothers came Their eyes smoking and their fingers itching","rating":7,"date":"20 April 2008","review":"Katie Elder bore four sons The day she was buried they all return to the Texas town of Clearwater to pay their last respects <br><br>John (John Wayne) is the oldest, the toughest, the gunfighter Texas, its bigness and its violence echoes in his empty soul Tom (Dean Martin) is a different breed of hombre He is good with a deck of cards and good with a gunwhen he has to be Matt (Earl Holliman) is the quiet one Nobody ever called him yellowtwice Bud (Michael Anderson, Jr.) is the youngest, but he is the rebel one...<br><br>At the funeral are Sheriff Billy Wilson (Paul Fix) and his grim young deputy, Ben Latta (Jeremy Slate) who's real conscientious about his job Also at the burial, in addition to many townspeople, is the young Mary Gordon (Martha Hyer), the woman who tries the impossible<br><br>Mary visits the four brothers, brings them food, and is sardonic about their desertion of their mother Only Bud, who has been going to college, shows a possibility of becoming a fine, respecting young man<br><br>As the brothers investigate into the past and present circumstances of their mother's life, they find the old place is no longer hers and that she was penniless <br><br>John discovers that his father supposedly gambled away the ranch when he was pretty drunk and that on the same night he was shot in the backThe only witnesses are Morgan Hastings (James Gregory) and his son Dave (Dennis Hopper) The sheriff warns the Elders to stop digging around and to stay out of trouble<br><br>Realizing that the only tribute to Ma Elder would be for Bud to finish college, the brothers pledge themselves to that cause Yet they feel the loss of the ranch was under peculiar circumstances, they decide to find out the truth<br><br>Henry Hathaway was one of the great versatile directors whose Westerns have been as variable in quality as his other films<br><br>Hathaway's strong points were atmosphere, character and authentic locations In \"The Sons of Katie Elder\" he took particular care with locations, proud of the fact that he is one of the few directors who handle their own second-unit work, and when this element combines successfully with the other two the result can be impressive indeed","user":"Nazi_Fighter_David","rank":[41,48]},{"title":"Getting Katie A Monument","rating":7,"date":"1 August 2006","review":"Feisty Katie Elder has passed on and her sons have arrived in Clearwater, Texas for her funeral. Katie's four sons are played by John Wayne, Dean Martin, Earl Holliman, and Michael Anderson, Jr. and three's a certain amount of hostility directed towards them from some quarters. And a bit of fear evident in the town's people. It also turns out that their father had been murdered a few months before that and their ranch now belonged to James Gregory. When questions are asked, trouble starts.<br><br>One thing is clear though, none of her kids has quite turned out the way she hoped, but the three oldest are going to see that young Anderson becomes some kind of success in life. <br><br>Despite some glaring plot weaknesses The Sons of Katie Elder is a film that is sold by the sincere playing of its leads. I'm not quite sure why the Elder boys didn't come back with the news of their father's death and settled things back then. Or why Michael Anderson was so resistant to some higher education.<br><br>This was a special film for John Wayne, the first post cancer operation film he made. And he did it and all his subsequent films with essentially one lung. One thing about Duke was that he really loved MAKING movies. I've always thought on some level he wanted them to make money because that way he could make more of them. Wayne just loved being out on location, working all day and partying all night, this was him. Although his health gradually deteriorated and he became more testy and irritable and he had more and more need of an oxygen tank as years past, he wouldn't give it up until he HAD to. For John Wayne it really was a labor of love.<br><br>Wayne surrounded himself with a good cast of familiar players for the most part. This was his second film with Dean Martin who after completing this film started on his highly acclaimed variety show. And his guest on his first show, John Wayne to plug the upcoming release of their film. They are an interesting pair of older Elder brothers. Wayne who lives by a strict code and Martin who gets by on his wits and a larcenous streak. Still the affection the two had for each other in real life comes forth on the screen.<br><br>Dino has a real moment to shine when he sneaks out and brings Dennis Hopper back to the stable where Wayne and a wounded Anderson are holed up. One of his best acted scenes from any of his films.<br><br>George Kennedy plays a menacing gunman that James Gregory hires and he also gets quite a clout from John Wayne with a two by four after Kennedy was bullying John Doucette. It's a great cinematic moment from a Wayne film, but afterwards you can't find any trace of injury on Kennedy for the rest of the film. I remember in Joe Kidd when Clint Eastwood gave Don Stroud a similar clout, Mr. Stroud looked every bit the injured party for the rest of that film.<br><br>Though we never see Katie Elder we get quite the picture of the uncomplaining pioneer mother through the townspeople that knew her and their sons. I'm still also not sure though why Earl Holliman was supposed to be such a bad role model, he's a hardware merchant in another town. Still the other three Elder boys want Anderson to aim higher than that.<br><br>Elmer Bernstein's musical score is one of the best that is featured in a John Wayne film. Wayne films were always distinguished by good use of music, something the Duke learned from John Ford. Bernstein and the Duke first worked together in The Comancheros and this one is every bit as good as that rousing score.<br><br>The action sequences are the best part of the film and the last half hour with the ambush on the bridge by Gregory's men right up to the explosive climatic battle with Wayne and Gregory, the excitement doesn't let up for a New York minute. No western fan should miss it.","user":"bkoganbing","rank":[37,44]},{"title":"Good, well made Western, traditional and enjoyable","rating":19,"date":"19 September 2002","review":"Beset by production difficulties and largely ignored by critics upon release, this is a film that, like its star, has grown better with age. Director Hathaway's open-air style perfectly suits the expansive nature of the material, which by today's standards seems almost leisurely. In fact Sergio Leone acknowledged this fact when he greatly reworked the opening station scene as the beginning of Once Upon a Time in The West/C'era una volta il West (1969). (He also had his heroine arriving at his own Clearwater station later.) Elmer Bernstein's score is a standout, recalling his achievement on The Magnificent Seven (1960). There are several scenes which gain immeasurably from his masculine music, which ranges from the grand celebratory mode of the main theme to some suitably subdued and menacing cues for the final showdown.<br><br>A convalescent Wayne plays the returning gunfighter John Elder, summoned by the death of his mother. Bewigged, paunchy, and slightly wheezy, the recently de-lunged actor still acts an imposing head of the Elder clan. He finds himself leading a dysfunctional family, united at first by grief, then the clumsy depredations of Morgan Hastings (an excellent James Gregory) who has swindled his way into possessing the family land. Together with memories of the late Katie Elder herself, like an American monument, Wayne's presence dominates the film. Recognising this, Hathaway uses it to great advantage with the first view of his star, perhaps Wayne's most impressive screen entrance since that in Stagecoach of 26 years earlier. As Katie is buried, in long shot, we take in an overview of the cemetery with its cluster of mourners, A massive rock formation overshadows the land. After a few seconds, a small detail catches the eye high up in a cleft. The camera cuts closer, and we think we recognise the figure. Cut again, and it is shown to be the watching John, irresistibly solid and still. At this stage in his career Wayne so easily assumes the permanence and grandeur of landscape that the iconic nature of this moment is accepted by the viewer without question.<br><br>This is last time in his career that Wayne is so emphasised. Twice in Katie Elder the director takes the opportunity to film his star 'doing the walk'  his tall frame strolling purposefully towards the camera, intent on action. In later films (such as Hathaway's own True Grit (1969)) such virile ruggedness is replaced by hard-bitten cantankerousness, more in keeping with the actor's advancing age. It was more the rule too, in Wayne's later career, for seriousness to be replaced by knockabout humour, reaching a zenith in the boisterous McClintock! (1963). In Katie Elder, many of the interior scenes between the brothers are marked by such elements of genial horse play, culminating in a fist fight in which John Elder crashes through a door. Outside they present more of a unified force, optimistically dubbed by Hastings 'the Elder Gang'. Showing this is more difficult than it seems, and fortunately Hathaway keeps matters under control. Moments of broad comedy, like Tom (Dean Martin) auctioning off his glass eye, are not too distracting and often provide a contrast to more serious moments (Curley threatening Matt with gunplay). The banter between the Elder sons also serves to unify the siblings in the most natural way, and establish relationships, even if some of the camaraderie is hard won. In particular one wishes that the two older brothers had more to say to each other, or shared some scenes alone - especially given the on-screen rapport Martin effortlessly created a few years earlier when he worked with Wayne in Rio Bravo (1959).<br><br>As the villain of the piece, Hastings has an emphasised affinity with a special firearm. His armament enthusiasm recalls some of the baroque arsenals appearing in some spaghetti Westerns of the time, where the traditional six shooter was replaced by ever more fancy weapons. At the start of the film Hastings has already hired Curley, a heavy dressed all in black in very traditional fashion. This range thug is played well by George Kennedy, and the scene where he is clubbed in the mouth by Wayne is often cited by viewers as one of the most memorable. In fact, so effective is Curley's suggested brutality that one wishes more could have been made of a man who says ominously 'I don't care what I have to do, as long as I get my money'. Curley and Wayne needed more of a showdown to make their moral antipathy pay dividends, and the viewer is disappointed that this doesn't eventually occur. It is one of the weakness of the film that the villain meets his demise so casually, a victim of crossfire rather than a deliberate showdown. As Hasting's son Dave, Dennis Hopper performs adequately. One feels he would have been better cast as the younger Elder brother, with more to do. In contrast to Kate's oft-stated warmth towards her absent sons, Hasting's treatment of his sibling is cold and uncaring. If the less experienced face of Jeremy Slate had been cast as his son, the gun lover's cruelty would have been even more damning. As it is, Hastings' attitude towards Dave is left largely unexplained, although predictable enough.<br><br>Apart from the casting and music, much of the pleasure of the film springs from the mise-en-scene familiar to those who enjoy the big 50's and 60's Westerns. The geography of Clearwater for instance, so effortlessly established in the early scenes; the interior of Katie's pioneer cabin, or the gunfight by the river. It is also a reminder of a lost time in Westerns, when an ever reliable Wayne confronted frontier trouble, with none of the moral complications suggested by the contemporary work of a Peckinpah or Leone. Like the simple pleasures Mrs Elder found in her beloved rocking chair, this is a production which has been continually revisited by fans since the initial release, and will continue to be so.","user":"FilmFlaneur","rank":[53,66]}]