[{"title":"Charming","rating":7,"date":"4 February 2004","review":"Look Who's Talking is such a great classic, one of my great memories of childhood, every weekend when I would go to my grandparent's place, they would let me pick a movie and we would watch it together, very often I would pick Look Who's Talking or Look Who's Talking Too, they were just such fun movies to watch and laugh at. When I grew up, I realized I hadn't seen the movie in so many years, but it was on TV the other day and I figured I would have a little blast from the past and watch it. You know what's strange about this movie? It's actually more for adults rather than the kids, but this became such a family friendly movie, but that's why many people say they don't make them like they used too, because writing where it is more aimed at the adults but it ends up being something that every age can enjoy is clever and this is one of the most fun movies of the 90's.<br><br>Mollie Jensen is an accountant living and working in New York City. The latest client she has been assigned by her firm is a charmingly-handsome but shallow womanizing executive named Albert who seduces her and although married embarks on an affair with Mollie, promising to leave his wife for her. Mollie becomes pregnant with his child. After realizing she is pregnant she informs Albert who takes the news well and again promises to leave his wife and raise the baby with her. Mollie continues her relationship with Albert as the pregnancy develops, however he's seeing another woman. Later when Mollie and her best friend Rona are shopping Mollie finds Albert in a clinch with the other woman. Angry and upset, a heart-broken Mollie storms off in a rage while the fight causes her to suddenly go into labor. When she hails a cab the driver James Ubriacco realizes the seriousness of the situation and speeds off to the hospital. Upon reaching the hospital, the nurses' confuse him for being the father of Mollie's baby and he feels inclined to stay. Mollie gives birth to a son she names Michael. A few days after \"Mikey\" is brought home, Mollie receives a visit from James, where he returns the purse she left behind in his taxi. James meets Mikey, and they seem to enjoy each others company. Mollie starts dating again, but quickly realizes that none of the men she has been seeing are good enough for Mikey and one night she lets her guard down and almost sleeps with James; however after imagining what life would be like if she married him, she asks him to leave, despite James telling her he loves both her and Mikey.<br><br>Look Who's Talking is a charming movie that I'm sure won't disappoint you, it's cute, romantic, funny, and has a great cast. It's a realistic look at what happens with unplanned pregnancy and John Travolta's character, James, becomes the ultimate and unexpected hero of the movie. I hope that I meet a guy like James one day, he was just so lovable. I also adored Bruce Willis' voice, he was a perfect fit for Mikey. Kristy Alley, she plays the crazy mother, but you see all that her character goes through and you just feel awful for her. This is such a great movie, I highly recommend it if you get the chance to see it, it's a great classic.<br><br>7/10","user":"Smells_Like_Cheese","rank":[26,30]},{"title":"Well I'll be damned...surprisingly good!!","rating":8,"date":"24 January 2005","review":"This is certainly not my sort of film, but after my girlfriend began complaining we always watch my movies, I prepared myself for 90 minutes of fake laughter and smiling to keep her happy, after all who else was I gonna take to see the new 'Clint' movie out.<br><br>However the opening scene with the tadpoles set the way for 90 minutes of top notch comedy, not exactly a laugh a second sort of comedy like Scary Movie or The Naked Gun, but a more all round sort of comedy where most gags hit the mark, certainly a major difference to Scary Movie! The casting is spot on, one of the major differences to the sequel. Bruce Willis is a great choice to play the voice of Mikey, and John Travolta is fantastic. But for me it was George Segal who stole the show for me, playing Mikey's real father, who in his words is going through a 'selfish phase'.<br><br>Sadly the sequels are simply terrible, but this movie is one of the best comedies I've seen in a long time, and I gave it 8/10.","user":"smoothgroove16","rank":[17,21]},{"title":"Defines the category \"bumblebee film\"","rating":8,"date":"20 May 2015","review":"As any engineer will tell you, bumblebees are not aerodynamically sound, they should not be able to fly. But they do.<br><br>This film is a single-premise, hi-concept, logline: the smartest person in the room is the newborn, and he \"talks\" to the audience.<br><br>The reason why this is a classic (yes it is!) is the talent: Amy Heckerling, at her peak, when she was the \"next big thing.\" Kirstie Alley, also at her peak, before she disappeared from theatrical releases and reappeared as a spokesperson for Weight Watchers Travolta at the peak of his \"first career\" (he had a second career 5 years later with Pulp Fiction, a second career that carried him into the next century, literally) And -- my fave -- Bruce Willis just before he exploded onto the big screen. If you do the \"Hollywood math\" (inside joke) you will conclude that this deal was cut and signed before the box office results of Die Hard were known. Die Hard of course sent him into the stratosphere and voice work would be secondary for him from this point on, EVEN THOUGH HE WAS GREAT AT IT. In fact one of my top films of all time, OVER THE HEDGE (2006) has Bruce in it.<br><br>Fun flick. Much better than it sounds. MUCH","user":"A_Different_Drummer","rank":[9,10]}]