[{"title":"The Dilemma","rating":7,"date":"22 April 2016","review":"In Los Angeles, the gorgeous Marjorie (Farrah Fawcett) stops her car after-hours in a parking area to buy an ice-cream. However the store has just closed and when she returns to her car, a masked stranger attacks and attempts to rape her using a knife. Marjorie succeeds to flee, but the man keeps her purse with her documents. She goes to the police to report the assault but the female officer tells her that there is no evidence and no case since it is her word against the rapist's word. A couple of days later, the rapist breaks in Marjorie's house while her roommates Patricia (Alfre Woodard) and Terry (Diana Scarwid) are not at home. The cynical Joe (James Russo) submits Marjories to sadistic abuses and humiliations preparing to rape her. Out of the blue, Marjorie sprays insecticide in Joe's eyes, reverting the situation dominating Joe and then she ties him up. She decides to bury Joe alive in a grave in her garden since she does not have evidence to keep him in prison and he had promised to return to kill her. But Terry and Patty arrive and try to convince Marjorie to call the police and think about the consequence of her intention. What will she do?<br><br>\"Extremities\" is a film with a dramatic story and a great dilemma. Farrah Fawcett has one of her best performances in the role of a woman abused by a stranger that she finally subdues. His first intention is to kill the man but there is a debate with her roommates and the film has a moralist conclusion. James Russo is impressive in the role of a sadistic rapist. My vote is seven.<br><br>Title (Brazil): \"Seduzida ao Extremo\" (\"Seduced to the Extreme\")","user":"claudio_carvalho","rank":[7,7]},{"title":"An Intense Drama Featuring a Gritty Performance from its star...","rating":8,"date":"2 May 2007","review":"EXTREMITIES is the disturbing, yet riveting screen version of a play by William Mastriosimone (who adapted his own play for the screen) about a woman who is attacked in her car one night by a would-be rapist on her way home and is terrified when she realizes the man got her purse and knows where she lives. After her roommates leave for work the next day, the guy shows up at her home and attempts to rape her. The story takes a surprising twist when, at one point, the woman turns the tables on the man and is able to overpower him; but when she realizes there is no way that attempted rape can be proved and if the man is arrested, he will just get off, she decides to keep him prisoner in the house until she can get a confession out of him. Far-fetched? Maybe. Disturbing? Definitely, but there's a wonderfully claustrophobic feel about this film, especially the middle with just the woman and her attacker, that you can't help but feel completely a part of what's going on. I did not see the play on Broadway, but I would imagine a piece like this works better onstage, but that doesn't make this film any less riveting an experience. Farrah Fawcett, one of the last actresses to do the role on Broadway, was awarded the role of Marjorie in the film version and delivers a taut and deeply moving performance as the victim who refuses to be a victim. Many critics found Fawcett's performance to be one-note, but for me, Marjorie is a woman completely numbed by what she has been through and the performance works for me. James Russo, in the performance of his career, is slimy and menacing as the would-be rapist who finds Marjorie to be much more of a challenge than he assumed. Alfre Woodard and Diana Scarwid co-star as Marjorie's roommates, who come home after Marjorie has overpowered the guy and has him tied up and stuffed in their fireplace upon their arrival. And it's the arrival of the roommates that take the story to an unexpected level because they didn't see what we saw Marjorie go through and therefore, think she should call the police and let them handle the guy. Not for the faint of heart, but if you can stand it, a gripping film experience anchored by a lead performance that will surprise you.","user":"Isaac5855","rank":[16,19]},{"title":"Another good message film, with Fawcett excelling...","rating":8,"date":"8 April 2009","review":"Kudos to Fawcett to taking on roles that, at the time were considered controversial. To my recollection, rape was still a taboo subject in the 1980's, and women's rights and emotions were rarely so deeply examined during that time.<br><br>Fawcett is simply a woman who is followed, then stalked by actor James Russo. He is adequate as the obsessed psychopath, but at times a bit transparent.<br><br>Diana Scarwid has a bit role, as does Alfre Woodard as the house mate. Woodard worries about the legal consequences when Fawcett, the rape victim, takes revenge on the culprit. The scene where she throws a frying pan of hot oil at Russo is classic, and as the rapist he deserves it. She then keeps him in bondage, and the consequences must be faced.<br><br>A very real story reflecting the emotions and rage of rape victims who have been violated, physically, and mentally. Highly recommended. 8/10.","user":"MarieGabrielle","rank":[15,22]}]