[{"title":"A Relevance Unmatched","rating":10,"date":"28 June 2005","review":"I don't recall a film which so deftly shows the emotional destruction of war, as mirrored in one single marital relationship. The focus of the film is the union between Ullman and Von Sydow--the two are in every scene. Through the course of the film, they experience a role reversal--one has the strength of survival and the other is reduced to emotional escapism through dreams. Both will lose a measure of humanity, but one to a greater degree than the other. The characters and the viewer go through periods of fluctuation in regards to closeness--the camera pulls out and away, sound disappears, words are lost, only for the camera to return to painterly closeups of its facially expressive stars. The confusion and fluctuation may make this film hard for some viewers, but this is all purposeful under the master hand of Bergman. I think the use of a \"fake\" war makes the film timeless, as relevant today as ever before, and by focusing on the human relationship through war, makes the film relevant to everyone. The pair could be anyone. The film is not grounded in place or time, but rather in emotion. A unique and effective war film, unlike any other. Bergman's films are virtuosic in presenting human relationships--that he would bring this to a war film is masterful.","user":"purban","rank":[34,35]},{"title":"Beautiful and ugly","rating":17,"date":"17 July 2005","review":"\"Shame\" (\"Skammen\") (Swedish, 1968): Definitely one of Ingmar Bergman's masterworks, with cinematography by Sven Nyquist (who did most of Bergman's, and some of Woody Allen's films). \"Shame\" is less symbolic than some of Bergman's works, and, an intense, psychological study of a married couple, Jan and Eva, (Max von Sydow &amp; Liv Ullmann) who have their personal problems like anyone else, but suddenly find their otherwise quiet Swedish island life completely upset by a civil war. Faced with increasing losses and degradations, we watch them struggle not only against circumstances, but their own psyches. The number of \"shames\" depicted is huge. This story may have influenced Lina Wertmuller's film \"Swept Away\". Just a guess. \"Shame\" is an ULTIMATE in gorgeous b/w photography, and ugly psychological horror.","user":"futures-1","rank":[19,21]},{"title":"PASSING ON IGNORANCE","rating":9,"date":"7 December 2002","review":"When Liv Ullman's character says, \"I feel like I'm in someone else's dream and they're going to be ashamed when they wake up,\" she is referring not only to being an  unwilling player in society's war games, she is referring to being an ignorant participant in life itself. At the film's end, when she says that she had a dream that she had a child and she was trying to take care of it, but she forgot something else, the implication is that she has forgotten what she has learned in the war she's just survived, that like her own mother before her, she will be unable to pass on any vital lessons to her own child. And, therefore, the cycle of the shame of ignorance will continue...ad infinitum...","user":"Norwegianheretic","rank":[51,65]}]