[{"title":"When Jack went home!","rating":10,"date":"3 January 2015","review":"Get Carter, not just one of the finest exponents of British neo - noir, but one of the greatest British films ever, period. Michael Caine stars as Jack Carter, a tough no nonsense operator in the London underworld who returns to his home town of Newcastle Upon Tyne when his brother turns up dead. <br><br>Directed and adapted to screenplay by Mike Hodges from Ted Lewis' novel Jack's Return Home, Get Carter is a bleakly atmospheric masterwork that takes the period setting of the time and blends harsh realism with film noir sensibilities and filters it through an uncut prism of doom.<br><br>Jack Carter as created by Caine and Hodges is the quintessential film noir anti-hero. He smokes French cigarettes and reads Raymond Chandler, there is no hiding the respect and homages to classical noir pulsing away as Jack goes on his not so merry way. He's a vengeful angel of death, but sexy as hell with it, he even has humorous pearls of wisdom to spout, delivered with relish by Caine who is at his snake eyed best.<br><br>In a strange quirk of the narrative, Jack is home but he's a fish out of water, he's a suited and booted Cockney lad moving amongst the flotsam and jetsam of North Eastern society. It's a crumbling landscape of terraced houses and coal yards, of seedy clubs and bed and breakfast establishments where, as Jack wryly observes, the beds have seen untold action.<br><br>Jack Carter is a hard bastard, borderline psychotic once his mind has tuned into the frequency that plays to him the tunes of mistrust, of double-dealings, liars and thieves, of pornographers and gangsters who thrive on gaining wealth while the society around them falls into a depression. It's Fog on the Tyne for sure here. Yet Jack is not devoid of heartfelt emotion, his family ties are strong, and there is a point in the film when Jack sheds a tear, it is then when we all know that all bets are off and there will be no coming back from this particular abyss.<br><br>Hodges and cinematographer Wolfgang Suschitzky strip it all back for maximum impact, so much so you can smell the salt of the murky sea, feel your lungs filling up with chimney smoke, the whiff of working class sweat is all around, and all the time Roy Budd's contemporary musical score jingles and jangles over proceedings like a dance of death waiting to reach its operatic conclusion. And with Caine backed up by a roll call of super working class character actors, Get Carter just gets better as each decade of film making passes.<br><br>Like its antagonist/protagonist (yes, Jack is both, a deliberate contradiction) it's a film as hard as nails, where home format releases should be delivered through your letterboxes in a metal case. No lover of film noir can have an excuse to have not seen it yet. Funny, sexy, brutal and not without a ticking time bomb of emotional fortitude as well, Get Carter is the \"A\" Bomb in Grey Street. 10/10","user":"hitchcockthelegend","rank":[52,56]},{"title":"Cold, Hard, and Glistening","rating":30,"date":"30 April 2012","review":"The movie's an ice-cold exercise in revenge, with a no-nonsense script and a first-rate turn by Caine as the heck-bent avenger. Someone killed his brother and, by golly, they're going to pay along with anyone else who gets in his way. The idea's not new; what's different is that Carter (Caine) has almost no redeeming qualities. He's about as cold blooded as the worst of the gangsters he confronts. Rooting for him is like rooting for a stomach pain over a headache.<br><br>Then too, Caine's ice-blue eyes are put to good use in sizing up his targets. And catch that gear shifting in the fast car timed to coincide with Carter's fast action on the bed. At last the subtext of all those sleek auto advertisements is revealed, this time in high octane. I just wish we saw more of Ms. Ekland, both literally and especially figuratively. And if that's not enough, catch that great ending. It's a marvel of imaginative staging and a perfect cap to what's gone before. Anyway, the movie reminds me of a polished piece of glass-- just about as cold and shiny and needing no depth. I couldn't stop looking at it.","user":"dougdoepke","rank":[16,16]},{"title":"Mike Hodges and Michael Caine have made a timeless film.","rating":9,"date":"9 August 2010","review":"Jack Carter, the reserved London gangster, travels north to Newcastle, his home town, to find the cause of his brother's death. He's warned by his bosses not to go, but refuses to obey them. We, and he, discover the reasons for the warning, which are intertwined with the details of his brother's fate, and watch Carter's quest for revenge reach its logical conclusion. The underworld life sets a kitschy vision of glamour - music-box decanter sets, flashy bespoke suits, and garishly decorated villas - against the grotty reality of arcade slot machines, pornographic 8mm films, and the claustrophobic grubbiness of Newcastle's industrial tenements. Carter, who prides himself on a style of detached shrewdness, navigates both worlds, until he discovers that they're intertwined, sickeningly. The corruption which provides him his living has tainted his own family. I think the centre of the film is the brilliant moment when Carter sits in bed in the flickering light of a projector, discovering the truth about his world. He weeps, silently, knowing what he must now do. But vengeance is all he knows, and it consumes him. <br><br>This story captures with great subtlety the coarse truths about poverty, and crime, which are as true today in Canada and the US as they were forty years ago in England. There's no heroism, no loyalty, no glamour. We feel a kind of sorrowful revulsion at the squalid reality of Carter's world, even as we fear the intensity of his quest for his brother's killers. And we realise we've seen a perfect film of its kind - exceptionally skillful acting, cinematography and editing, bringing to life a taut script. Never again will we fall for the false romanticism of crime.","user":"malcolmi","rank":[18,19]}]