[{"title":"Solid western with enjoyably dark undertones","rating":11,"date":"11 December 2005","review":"Clint Tollinger arrives in a small western town looking for his estranged wife, who left him and now runs the local show saloon. His presence is greeting by suspicion but when the town leaders discover the nature of Tollinger's business they propose that they employ him to clean up the town of the problem of Dade Holman's violent influence. The solution may be just as bad as the problem but they take the risk.<br><br>With a nice dark character with a lot of anger and pain in the front of the film this western is enjoyable tough. Although the plot is fairly typical of a western b-movie, the tone and edge to it means that it comes over as much more. The basic story sees Tollinger taking on the rule of Holman but it has undercurrents of pain and anger as the lead confronts his wife. We meet Tollinger as a gentle, quiet man but gradually we see him to be violent, heartless and full of bitterness; it is solid development that is at the heart of the film's dark tone. Of course it still follows the genre traditions and will appeal to fans of such while also having enough else going on to make it differ from the Technicolor westerns of the same period.<br><br>Wilson is responsible for the dark tone as both writer and director; shot is stark black and white he frames some interesting shots and is not afraid to be aggressive or shocking considering the period. Mitchum takes to his character well and always seemed to enjoy the darker more complex characters that some of his westerns would serve him up with. Sterling does well with her firm character until near the end where she becomes more of a genre staple. Support behind these two is roundly good but the film is very much Mitchum's and he knows it.<br><br>Overall it is a solid western that gradually gets down to just going where you expect it to. However for the vast majority it has a dark tone and feel to it that makes it much more interesting and more likely to appeal beyond the limitations of those that like the colourful b-movie westerns of the period.","user":"bob the moo","rank":[38,40]},{"title":"Compelling tale of a drifter hired by townspeople to protect them from revenge-seeking outlaws","rating":7,"date":"28 October 2009","review":"In the Old west there are always the men who live breathe violence and the women who hold their breath. A famous ¨town tamer¨ named Clit Tollinger(Robert Mitchum) comes hired by the citizens to rid the gunslingers ( Leo Genn, Claude Atkins, among others), Baronland's hoodlums. There he meets the blacksmith (Emile Meyer) , his daughter (Karen Sharpe), her boyfriend(John Lupton), the marshal(Henry Hull) and the Saloon owner (Ted De Corsia). Clint as lawman is appointed deputy to bring peace and puts some cartels saying the following : ¨ Warning , wearing of guns or other weapons in town is banned. Check all hardware at the marshal's office ¨. Clint finds his ex-girlfriend, a local madame (Jan Sterling) in charge of the Saloon girls( Angie Dickinson, Barbara Lawrence, among them). But the town council afraid the raw methods carried out by Clint . At the end the kingpin landowner appears and attempts to murder Tollinger with his own hands.<br><br>This is a tremendously exciting story of a sheriff-for-hire who had only one more killing to go. It begins as a slow-moving Western but follows to surprise us with dark characters and solid plot. The tale is almost grim , a pacifier comes to a town just in time to make sure its citizenry but later the events get worse . The highlights are the burning at Saloon and the climatic showdown at the ending. Phenomenal and great role for Robert Mitchum as avenger angel and bitter gunfighter, he's the whole show. Vivid and lively musical score by Alex North (Spartacus, Cleopatra), Atmospheric cinematography in black and white by Lee Garmes. The motion picture is stunningly realized by Richard Wilson (Al Capone , Three in Attic) who made good Western as ¨Invitation to a gunfighter and ¨Zane Grey¨ episodes. Watchable results for this offbeat Western.","user":"ma-cortes","rank":[13,13]},{"title":"Dark, intense, violent, brilliant Mitchum Western.","rating":9,"date":"17 August 2001","review":"there should be a sub-genre in the Western called 'the Robert Mitchum Western'.  Mitchum's brilliant, idiosyncratic, usually undervalued Westerns import his film noir persona to etch some compellingly dark character sketches, and bring an elegiac world-weariness more familiar from the films of Sam Peckinpah.  'Man with the gun' is one of his best.  Directed by Orson Welles protege Richard Wilson, it is a stark, monochrome beauty, full of chilling silhouettes and terrifying outbursts of savage violence, as Mitchum comes to tame a town terrorised by a monopolist with a private army. Mitchum's regression from soft-spoken stranger to deranged murderer, with a host of dark emotions in between, is a marvel of expressive, physical acting.","user":"the red duchess","rank":[33,39]}]