[{"title":"Genuine horror","rating":10,"date":"30 July 2005","review":"This seems to be one that divides fans of the master, but I loved it. It's easy to see why people see this as being a bit of an odd-one-out in Bergman's output: it's very direct in it's depiction of disturbed states of mind, directly illustrating hallucinatory states rather than just hinting at them. Others have pointed to references to other films of the horror genre, which seem undeniable.<br><br>Not that you'd mistake this for a film by anyone but Bergman. It's rich in connections with other of his films and autobiographical references (such as the terrifying description of being locked in a cupboard as a child). It can be reasonably thought of as Bergman's 'horror film' but he takes on the genre very much on his own terms.<br><br>It's a film that lingers long in the mind, with many unforgettable scenes (including the amazing Magic Flute scene) aided by Sven Nykvist's wonderful chiaroscuro photography. The use of music is (as ever with Bergman, the most musical of directors) extremely intelligent: the scene with the boy is set apart from the rest as much by the music as the photography.<br><br>Given the quality of the cast, you'd expect superb performances. As ever, von Sydow and Ullmann are excellent, with equally good supporting performances.<br><br>At times I was reminded of Rilke's only novel, The Notebook of Malte Laurids Brigge. If you don't know this, I urge you to seek out a copy: there's a distinctly Bergmanesque atmosphere to the whole work, but there are specific images that seem to link to this film.<br><br>This is a film that repays repeated viewings. Despite it's extremely disturbing subject matter, to me it's not as emotionally draining as many of Bergman's other films (such as Shame or Winter Light), in spite of (or perhaps because of) the visual horrors on display. Still, I recommend it very highly.","user":"neil-313","rank":[95,105]},{"title":"one of bergman's best","rating":7,"date":"7 November 2001","review":"a lot of even of the most loyal bergman fans claim that they came away from this one confused and irritated, and found it lacking in meaningful symbolism. i wonder if they watched the same movie i did?? this is just about one of the most intriguing, imaginative horror movies i've ever seen, and it is indispensable for those who enjoy the occasional dip into the proverbial pool of cinematic madness and mental derangement. i'm not in uncritical praise of everything bergman made, and some of his movies are admittedly a bit heavy handed and depressing, but i see this one as an example of what he could do when he decided to go all out. johann (max von sydow) and alma (liv ullmann)are husband and wife, and sydow's character is basically a tormented artist who has moved to the deceptively serene and quiet island with his wife to collect himself and try to escape his personal demons. to say the least, it doesn't exactly pan out that way. i believe the constant darkness and atmosphere of chaos and fear in the film is a metaphor for the human condition, because when you really reflect on it, we can never tell if the impressions we get and the ideas we have are projections of our imaginations or have some basis in reality, just as johann and his loyal wife cannot tell if these superficially amiable but suspiciously odd people are really there or are illusory creations of his mind. lindhorst, 'the birdman', is a particularly chilling character, and i would venture to say that the scene in which he puts on a puppet show for the couple and the rest of the socialites/demons is the key to the film. lindhorst creates a scene from mozart's \"the magic flute\", and recites (during a truly haunting close up), the dialogue from a scene crucial to the meaning of the symphony. one of the crucial characters, tamino (and anyone into mozart will understand what i'm talking about)collapses in the *palace of wisdom*, that is, a terrible place where he has discovered the tragic truth about human life and it's meaninglessness, and asks desperately \"when will mine eyes the daylight see?\" lindhorst is quick to recite the reply:\"soon, soon fair youth..or never.\" he then goes on to talk about how mozart was terminally ill at the time of it's composition, and i would not be surprised if this entire scene was a metaphor for the artists' struggle with the fact of death and it's crushing finality:how can the creative individual, more sensitive to the issue of ultimate meaning as regards the human condition, be content or happy with anything when he knows that the world just might be and probably is what thomas carlyle called it, \"an uncaring hall of doom\"? how can we be sure of our meanings, when they could be wishful projections of our own minds, when the beliefs we have about ourselves and others cannot be purely objective or subjective? if this is the case, don't we necessarily live in a shadow house of illusions and absurdities?  anyone with half a brain can see that there IS existential symbolism in this film.  rich, unbearably tense, masterful horror and surrealism at it's finest.  buy it.","user":"reasonbran234","rank":[119,137]},{"title":"Depressing but Captivating","rating":10,"date":"23 October 2001","review":"I don't know why I'm so fascinated with Ingmar Bergman. When I was in college, I went to a film society screening of this film. I hadn't seen Wild Strawberries or The Seventh Seal at the time and this was a real mind blower. There are all those shades of darkness. There are those depressed looking people, haunted by those personal demons. There is Bergman's island, so lonely, so cold. The other inhabitants always seem so threatening. The artist, writing about affairs, assaults, murder, and we don't know whether any of it is true. I suffer through the party with all those pretentious people and their angst. This party is only eclipsed by the one in Alice in Wonderland . The people are truly beasts. Bergman is about bad dreams. The camera pulls us through our deepest fears and dumps us in that dark, evil swamp. I know this is often seen as one of his minor films, but his getting ready to meet his former lover, putting on that makeup to look younger and recapture his past virility, is so gut wrenching.<br><br>This is a depressed feast for the eyes and it puts mental illness into corporeal form.","user":"Hitchcoc","rank":[69,85]}]