[{"title":"Underrated and unappreciated excellent sequel in the horror genre - I love it!","rating":9,"date":"23 October 2016","review":"This is underrated, unappreciated excellent sequel in the horror genre from the 80's, that almost no one talks about it. It is directed by Tommy Lee Wallace who also directed Halloween III: Season of the Witch (1982) and It (1990). It is definitely one of my favorite sequels and I love it so damn much. What I mean with no one talks about it: This movie like disappeared I heard about the first movie and watch it on TV, but I never saw the sequel in Slovenia on TV I don't know why this was banned and was never released in my country. Anyway I am a huge fan of the first movie Fright Night (1985), which is my favorite vampire horror movie of all time. While this one is a low budget unappreciated a step down sequel from the first movie. I love horror movies from the 80's and the vampire movies beside Fright Night Part I and II I only love The Lost Boys (1987) that come out 2 years later after the first Fright Night come out. I love Part 2 and this movie is damn good to watch at least better than remake tough I love remake too. I wish I could get this movie on Blu-ray or DVD but it is impossible to get it, so I am keeping the downloaded film on my computer.<br><br>Fright Night Part 2 isn't good as the original film was or that great like was the first movie, but it has elements that movie works. William Ragsdale and Roddy McDowall did return from the first movie and that was good enough to watch this movie. Roddy McDowall is as always terrific and excellent in his role as Peter Vincent. William Ragsdale as Charley Brewster is good but his character is really messed up. Traci Lind is a hot sexy beautiful babe in this movie, I was happy that she was Charley's love interest. I know the actress from 21 Jump Street (1987) Season 1 Episode 3 and Class of 1999 (1990). I am happy she was in this movie, she was excellent and I love her character Alex she was fantastic! I miss the actress so damn much! William Ragsdale and Roddy McDowall were both excellent I love them so much. Tommy Lee Wallace did an excellent job writing and the directing this movie I love it so much. It is also one of my favorite vampire movies you even have a werewolf in here and a vampire who etas bugs and one vampire who roller skates.<br><br>Plot: Charley Brewster and Peter Vincent must face more vampires which are out for revenge.<br><br>Welcome to FRIGHT NIGHT PART II. Peter Vincent (Roddy McDowall, \"The Great Vampire Killer,\" and Charley Brewster (William Ragsdale) are back in the long-awaited sequel to the box office smash hit Fright Night. And so are the bloodthirsty creatures of the night.<br><br>This is a revenge film about Julie Carmen as Regine Dandridge, Jerry's sister who want's revenge on Charley for killing her brother. Julie was outstanding, terrific and scary as the leader vampire. Brian Thompson as Bozworth as Regine's chauffeur and a vampire who only eat bugs and he know all their names is interesting, terrific and scary in his role. Russell Clark as a Vampire on a roller skates is excellent, but I still don't know was he a guy or a girl?. Jon Gries as Louie a werewolf was awesome, he was the only werewolf in the whole film, who can transformers in to werewolf anytime he wants. John Gries also did play a vampire in Bram Stoker's Dracula by Francis Ford Coppola, you'll remember when Dracula turns into a hairy wolf beast and has sex with the red head. I think he was supposed to be a Vampire modeled after this creature seeing as they mentioned stuff from the original Dracula book in this movie.<br><br>I love the horror in this movie: Peter Vincent try's to kill Regina on movie set, but he get's arrested and thrown in to mental institution that is awesome. Alex try's to rescue him and in mental institution a patient Josh Richman as Fritzy helps them, to escape from the hospital I love this scene to death.<br><br>Peter and Alex prepare to rescue Charley from Regina and they took all the weapons against the vampires - bad ass scene!<br><br>The elevator scene where Regina burns from the sun light is fantastic epic scene while Peter is reflection a mirror on her and Charley holds her. That is my favorite another bad ass scene, pretty much the death scenes are awesome. <br><br>I love the rescue mission on this movie. it is awesome how gorgeous Alex and Peter are rescuing Charley.<br><br>R.I.P. - Roddy McDowall (1928 - 1998), Russell Clark (1949 - 2002) and Merritt Butrick (1959 - 1989). May all of you rest in peace your not forgotten. <br><br>Fright Night Part 2 is a 1988 American horror comedy film directed by Tommy Lee Wallace and starring William Ragsdale, Roddy McDowall, Traci Lind, and Julie Carmen. It is the first and only sequel to Fright Night (1985), with Ragsdale and McDowall reprising their roles. Composer Brad Fiedel also returned with another distinct synthesizer score.<br><br>I am giving an 9/10 -- a good score it has problems with the Charley character not believing in vampires, pacing, the humor in this movie and the scrip it could have been better. It is still a scary movie and I would definitely love to have DVD or Blu-ray.","user":"ivo-cobra8","rank":[42,44]},{"title":"A Sequel That Works","rating":7,"date":"22 December 1998","review":"There are so few sequels that do work, and have something a bit more to say from the original.  Fright Night 2 is one of those.  It has more to say on the idea of the supernatural in real-life (Charlie's inability to deal with the events of the original movie, Vincent's trying to avoid the whole thing), and gives us a decent follow-up to the original with Dandridge's sister on a revenge kick.  There are more nods to Stoker and the original vampire mythology (the reference to wild roses, for instance), and the new vampire's sidekickers are equally as weird as Jonathan Stark's Billy Cole in the original.  See it if you can:  it doesn't seem to be a movie that shows up very often.","user":"Gislef","rank":[28,31]},{"title":"Totally worths the bite! Great sequel that doesn't tries to imitate the original.","rating":8,"date":"23 December 2004","review":"McDowall, Ragsdale and company join again for more vampire fun. Thanks Mr. Tom Holland for creating these movies. <br><br>The sequel to one of the most important vampire movies of the past 20 years delivers expectations by entertaining and making the audience laugh. The charm of the original is present but just in half. We still enjoy the Roddy McDowall - William Ragsdale duo now in better shape. Although the Jerry Dandridge character is not present, it's present through all the movie because he's mentioned and remembered.<br><br>Four years have passed since the frightening events that led to the death of 10,000 year old vampire Jerry Dandridge. Charlie Brewster has a hot new girlfriend, Alex and now he attends college and isn't a geek anymore. Things seem to be perfect for him. Through therapy, Charlie tries to forget what happened and tells to himself that everything came out from his mind. Nothing really existed to him. Peter Vincent still hosts \"Fright Night\" and his life is also good. <br><br>Harmony abruptly breaks when Charlie believes in vampires again. He still has vampire related nightmares, his mind plays tricks on him and one of a sudden, the events of the original \"Fright Night\" happen again. Regine Dandridge (yes, Jerry's sister) finds Charlie and Peter Vincent and swears to take revenge for her brother's death. This time the vampires are more and will do everything possible to torture Charlie for eternity and kill Peter Vincent. Once again the Brewster-Vincent duo teams against the blood sucking gang in a fierce battle that will make you want more of Fright Night!<br><br>I truly LOVE the original \"Fright Night\" and to me, none sequel or vampire flick will match it's coolness. \"Fright Night part II\" is the vampire movie that I was looking for. The movie is filled with horror, action, cool f/x, great acting, sensuality, gore, black humor, and a good soundtrack. What else could you ask for in a horror movie from the 80's?! Part II does the things correctly and almost tops the original.<br><br>ACTING. Roddy McDowall and William Ragsdale are my favorite duo in horror movies. Both actors are at their best in this sequel. Seems that both enjoyed acting together and fighting vampires. McDowall gives a strong performance based on his maturity and fine humor. He's the man! No one like him can challenge vampires. Ragsdale improves his performance from the original and gives a great performance. Julie Carmen (Regine) could fill the great Chris Sarandon's shoes in the role of the lead vampire. Her performance totally hypnotized me and I enjoyed it. Vampires were never this seductive and hot. I praise her for wearing tight and short outfits. She's super hot and gives a great performance. She was mean she it was necessary, she was sensual every time. Carmen is a hot women and my favorite vampire female character. Tracy Lin (Alex) gives another strong and believable performance as Charlie's (lucky bastard) radiant new girlfriend. She was very cute and hot. She knew how to display a strong woman that looked very tender. I love this woman. Is it me or she looks a lot like Anna Chmulsky (from \"My Girl\" fame)? What a beautiful woman. Yum. The other supporting cast members are very good. Brian Thompson (Bozworth deserves special mention. The other vampire gang members were perfect! Cool designs. The tranvestie roller skater vampire is insane! A creepy character. The werewolf worked perfectly as the Evil Ed of the movie. Still we miss a lot Evil Ed. I enjoyed Ernie Sabella's performance as Dr. Harrison. He was insane! Also, the patient in the mental asylum that helps Peter Vincent to escape is groovy. I truly enjoyed his performance a la Jay and Silent Bob. A great cast that worked perfectly for a horror comedy.<br><br>DIRECTION. Tommy Lee Wallace did a wonderful job. He sets a creepy atmosphere getting hand from action and comedy. There are some impressive camera angels that make the movie look classy. For example the scene where Peter Vincent uses the broken mirror against Regine in the final battle looks great! A difficult scene that went perfect. \"Fright Night II\" looks impressive for being a horror movie. Obviously the budget here is huge. <br><br>F/X, CINEMATOGRAPHY, SOUNDTRACK. The f/x improved the original's. Visually stunning effects again. I loved the tranvestie vampire's death and the maggots coming out from Bozworth's stomach. Candy for the eye! Thanks. The cinematography is great. Part II is visually stunning also. Metal Pop tunes, vampiresque melodies, organs, and rock make a great soundtrack. Not as good as the original's but still works.<br><br>FRIGHT NIGHT PART II has many things to bite: -Regine telling Charlie and Peter \"welcome to Fright Night!\". A scene that sent chills to my bones! A new classic moment for me. -Regine threatening Peter Vincent and then tells him that Charlie's punishment will be worse. -Bozworth's explicit death. -The scene where a looney helps Peter escape from the mental asylum. A hell of a funny scene! -The final battle between Charlie, Peter and Regine. I loved the way Peter used the broken mirror. The scene is very memorable because it's the last time that the team win a battle against vampires. Everybody misses Roddy McDowall a lot... -Dr. Harris's death. -The scene where the skate roller tranvestie vamp. comes at high speed against Charlie. A truly creepy moment with the 80's craziness. The clothing, the hair, the music, the scary looks. I love it.<br><br>Take my word, \"Fright Night Part II\" is a great horror comedy movie. Not as great as the original but still delivers and overpasses expectations. This is one of the best sequels ever to a horror movie. The Fright Night movies will always work. Time seems to make no harm to them. <br><br>8.0/10 Fun, gory, entertaining, well directed and acted. Part II is a sequel to bite!","user":"insomniac_rod","rank":[35,40]}]