[{"title":"A Few Gems Amid the Burlap","rating":6,"date":"26 March 2008","review":"Just a year after his triumph in \"Becket\", Peter O'Toole is almost unrecognizable but does high class work as the Angel of the Lord--he's **trium in uno**--opposite Abraham and Sarah as portrayed by Ava Gardner and George C. Scott. These two great but very different actors play wonderfully off one another--Scott's earthy energy against the elegant tones and sorrowful eyes of O'Toole--who is on his way to destroy the sin cities of Sodom and Gommorah with all their inhabitants.<br><br>The other fine portrayal is of Nimrod, \"a mighty hunter before the Lord\", by the late actor Steven Boyd. In a single, four minutes scene he captures all the kingly hubris of this biblical figure-- the first in the book of Genesis who does not represent a nation. He who built the Tower of Babel, and saw it destroyed.<br><br>Children would be entertained by the carnival of the animals sequence depicting Noah and the Ark.","user":"kayaker36","rank":[21,25]},{"title":"Decent Telling of the Book of Genesis (Spoiler for those who do not know the Bible)","rating":6,"date":"20 April 2004","review":"\"La Bibbia\" or \"The Bible\" is director John Huston's attempt to bring the stories of the book of Genesis to life.  His movie, while not compelling, is interesting and holds the viewers attention.  Many big names, including Huston himself, are featured.  The movie begins where the bible begins, with the creation of the world.  Michael Parks and Ulla Bergryd exude child-like innocence as Adam and Eve.  After their fall and banishment from Eden, they are cursed by God to suffer for their disobedience, although it quickly becomes clear that they have not been abandoned by him.  They have children, Cain and Abel. Richard Harris and Franco Nero play the famous brothers (they would go on to play best friends a year later in \"Camelot\"), although it is Harris who steals the scene by quickly dispatching his brother.  Stephen Boyd brings his signature good looks and booming voice to the role of Nimrod, although the story of the building of the Tower of Babel is fairly short, and Boyd's role limited.  <br><br>By far the most charming part of the film features Huston as Noah.  Huston brings humor to his role, and the segment is a delight for any animal lover.<br><br>The movie concludes suitably with the story of Abraham and Sarah, the biblical patriarch and matriarch of the nation of Israel, although there is a detour to cover the story of Lot and the destruction of Sodom and Gommorah by the Angel of God.  The legendary figures of Abraham and Sarah are played appropriately enough by two legendary actors, George C. Scott and Ava Gardner.  Of the two, Scott offers the more compelling performance, although Gardner holds her own.  They are visited by Peter O'Toole, whose appearance in the film is more along the lines of a cameo. <br><br>An honorable mention must go out to little Alberto Lucantoni, who injects feeling into his role as Isaac, particularly in the last scene of the sacrifice.  This is quite a feat for a child actor.<br><br>In conclusion, although this is not the best biblical film I have seen, it is by far not the worse, and worth at least a rental from your local video store.","user":"artemis_5","rank":[22,28]},{"title":"The Film Deserves Better Recognition","rating":24,"date":"24 May 2000","review":"I've always noticed an interesting trend among critics when they review a Biblical movie.   Since most critics are of a skeptical nature, they usually carry with them the bias that unless the movie deviates from a traditional telling of what the Bible says it is somehow dull cinema.   That somehow there can't be anything compelling in seeing the stories of the Bible dramatized in a straightforward manner with no inane attempts to \"humanize\" the tales through the lens of a modern, secular society.<br><br>Well, I make no apologies for being one of the devout and saying that I prefer my Bible stories straight, without any modernistic elements that are meant to make hidden slams at why the stories are important to begin with. For me, \"The Bible\" is one of the best Biblical epics precisely because it takes its subject material seriously and only alters a few details (Nimrod for instance is not identified as the king at the time of the Tower of Babel) to get a coherent cinematic presentation in place.   Christopher Fry, whose uncredited rewrite of \"Ben Hur's\" screenplay helped make that film a literate masterpiece of cinema brings the same touch here.   And Huston does a fine job of directing.<br><br>Those who bash this film, much like those who are given to bashing movies like \"The Greatest Story Ever Told\" while praising garbage like \"The Last Temptation Of Christ\" are often saying more about themselves than they are about the film they've just reviewed.   What they regard as \"boring\" I regard as a noble effort to give a visual understanding to the events of the Bible.   And \"The Bible\" despite only covering the first half of the book of Genesis succeeds brilliantly at it.","user":"Eric-62-2","rank":[67,97]}]