[{"title":"Not for everyone but definitely original","rating":10,"date":"10 February 2006","review":"Here is a movie that cannot be classified in any subcategory. Many viewers of now and then seemed to be disturbed by its lack of evident meaning or message. Starting more or less like a gangster flick, it abruptly turns halfway through into a psychedelic trip, where Mick Jagger appears, in one of his rare screen roles, as a retired rock star. <br><br>No doubt, \"Performance\" doesn't do much effort to be easily understood. If you like stories with a clear plot, well defined characters and a happy ending, then skip this one. In order to enjoy that movie, you should better give up your rationality for a while. There are many interpretations one can have about it, but they will most likely come in the second run. Like a dream, \"Performance\" is a visual and mental shock where nothing comes as expected, and it lets you wake up dazed and confused by its so peculiar atmosphere. <br><br>What I find most puzzling about it is how far ahead of its time this movie was in every aspect. It was shot in 1968, but released only two years later because the distributors were obviously not prepared for this kind of \"performance\", and had not seen anything alike before. Western society was undergoing incredibly fast and drastic mutations, and the culture shock that happened in those days is at the very heart of the picture. It was \"time for a change\". Just like the main character, the western world would never be the same again afterwards.<br><br>Interesting fact : a mere five years before, the lead actor James Fox had played in \"the Servant\", a film based on a play by Harold Pinter with a story that has a lot in common with \"Performance\". \"The Servant\" appeared highly controversial by then because of its allusions to seedy sex, but it was shot in black and white with very conventional filming, editing and acting, and a very outdated jazzy soundtrack. Hard to believe it takes place in the same city (London) with the same lead actor within just a five year gap.<br><br>Nothing about \"Performance\" is conventional. It takes off immediately into a hectic pace, flashy colors, haunting music, and very graphic sex and violence. The London crime world is photographed with a rare accuracy. Actually, one of the guys playing the gangsters happened to be a real life gangster. Then suddenly, by a random twist of fate, the cockney villain (no heroes here) is propelled into another completely different underground scene, where \"nothing is true, everything is permitted\". He meets his alter ego as a has-been pop musician living secluded in a red-walled mansion covered with mirrors, together with a duet of intriguing women. Hallucinogenic mushrooms are casually served at breakfast, notions of time and space fade away, while gender, identity and truth get blurred. The two main characters gradually merge together and though both of them seemingly get doomed by their fate in the end, you don't know by then which of them is whom anymore.<br><br>I don't know of any other movie where you see a Rolls Royce burning down in an acid bath, gangsters performing a strip-tease show, or a plunging view inside a skull as a bullet is shot through it, least all of them together. Besides, the recurring use of mirrors all throughout the picture, the constant play with colors and the superimposing of faces and images don't have many parallels either in film history. <br><br>Of course, if you are a Rolling Stones fan, this movie is a must-see, but then you probably have seen it already. Like the main character, the Rolling Stones began as English street kids, and came to explore a world of sex, drugs and rock&amp;roll where one of them actually lost his life. In \"Performance\" , an androgynous long-haired Mick Jagger with pouting lips is at the acme of his character, while blond and foxy Anita Pallenberg, who had affairs with three members of the band, and freckled boyish Michèle Breton fit perfectly into the scenery .<br><br>If there was to be a \"pop-art\" movie, that would be it. You may love or hate this film, but for sure, it is daringly creative and experimental, and anything but ordinary. To quote the character played by Jagger : \"the only performance that makes it, that really makes it, is the one that achieves madness\".","user":"francheval","rank":[89,98]},{"title":"You shoot too much of that s***, Pherber.","rating":10,"date":"17 February 2004","review":"This film operates on multiple levels and in cultures that we barely knew existed in 1970. The East End London mobster culture being one and the London counter-culture of drugs and music another. To further lend a surreal air, Nicolas Roeg and Donald Cammel (who co-directed the film) present metaphors and psychological homologies- sadism, homosexuality, hierarchy in gangs and organizations- all stemming from central psychological needs for power and dominance combined with and expressed through sexuality. The first half of the film seems to anticipate Guy Ritchie- a glimpse into Cockney gangsters and \"poofs\" and then, Chas steps into Turner's lair and the film alters along with our consciousness. Suddenly, underneath the gangster/rockstar theme another, more deeply embedded theme emerges about identity and the part of others that we share in common(the deeper motivations and identities). Turner and Chas sense it in each other's \"performance\", all four main characters (arranged on a sexual continuum from the very female Pherber through 2 personae of androgyny to the very male Chas) explore their other parts as when Pherber puts a mirror, reflecting her breast on Chas. The shared motivational part comes from the \"performance\" of violence or art that Chas and Turner are fascinated by in each other. Add in some very strange camera angles and you have one of the very few films that ever did the impossible- represented altered consciousness to an audience (mainly) in straight consciousness. That last part depended on what year you saw it in theatres. In all, a very profound movie. Donald Cammell was a genius who never got his proper due.","user":"dondutton","rank":[44,50]},{"title":"Psychedelic Borgesian masterpiece!","rating":30,"date":"30 November 2001","review":"Thirty years after its release 'Performance' still remains one of the most controversial movies of the 60s/70s. For many it is an arty pretentious bore that is only worth remembering  for being a mother lode of imagery that has been mined extensively by MTV \"talents\" over the last twenty years. (Cammell/Roeg must be up there with Bunuel and Kenneth Anger as the most plagiarized source for rock video!)<br><br>For the rest of us 'Performance' could well be THE great movie of the psychedelic era, rivaled only by Antonioni's 'Blow Up' and Jodorowky's 'El Topo'. 'Performance' merges the hard boiled Cockney gangster world of the Kray twins (exemplified by James Fox's brutal Chas) with the freaks of the rock/drug world (Jagger's enigmatic Turner) and shows they have as much in common as they differ. Reality and fantasy blur, gender and personas get confused, and Chas and Turner become increasingly hard to tell apart.<br><br>\nAll of this unfolds to an ultra-cool soundtrack of The Last Poets, Randy Newman, Jagger's lost classic 'Memo From Turner' and former Spector/Stones/Crazy Horse collaborator Jack Nietsche's Moog. Add to this plenty of sex, trips and Jorge Luis Borges references, and you've got yourself a mind-blowing movie experience!! Highly recommended to Grant Morrison fans.","user":"Infofreak","rank":[56,65]}]