[{"title":"\"But it's Thanksgiving. Yeah to you, but to me it's Thursday.\"","rating":10,"date":"17 December 2004","review":"It's hard to explain what this movie means to me. Words could never. I remember when I was a kid, I never liked the first Rocky, was too obsessed with III and IV. It happened when I was 11 and I went to see V in the theater. I never been to a movie like that before. People were screaming and cheering. Shook the whole damn place. They were dancing in the isle's and celebrating. It was then I realized the true power of Stallone's vision. The realization that only the original would ever really matter.<br><br>Rocky to me is so many things. I had to beg my girlfriend to see it. She said she doesn't like boxing. I almost dumped her right there. If she wasn't so hot, I probably would have. I was crushed that someone could think that this movie is about boxing. To me it was never that. It's about a guy, much like you or me, who's down on his luck and everyday feels like Sunday. He's pushing 30, single and broke. I'm sad to say that at this moment it almost reminds me of myself. Every minute more another reason. <br><br>It's hard to pick my favorite scenes from the movie. I love the chemistry between Rocky and Adrian (Shire). When he's talking to door and she finally comes out and then stops to look in the mirror. It's a thing of beauty. Or when Mickey (Meredith) goes over to Stallones apartment. Rocky gets upset and punches his shitty wall, then goes to hide in the bathroom. The look on Stallone's face when he comes out to find Mickey still there is priceless. I heard it wasn't in the script or directed, just happened. But the one that does it for me is when he comes home in the opening scene after the chapel fight. He turns on his record player and goes for a beer, but it's empty, like everything else in his life. Talks to the turtles and his fish, why because the Rock is lonely. Goes to the mirror and practices a joke for his love. Looks at a picture of himself and realizes he's wasting his life. It's more than beautiful or real.<br><br>It's safe to say that I have seen the original more than 100 times. I still feel all the emotion. I love this movie more than any other film. I hope one day, with God's help, to show it to my kids and have them feel the same way. I think if I ever got the chance to meet Stallone, I'd want to thank him. Tell him how he changed my life. But in reality, he probably wouldn't care. Because, \"I'm at least half a bum.\"","user":"JFHunt","rank":[418,459]},{"title":"His whole life was a million-to-one shot...","rating":10,"date":"28 December 2003","review":"When I was a kid there were only three major things in my life: food, wrestling and `Rocky'. My brother and I followed the numerous Rocky Balboa struggles religiously, and even today, there is no exception. Although the latest efforts of Stallone have been pitiful, the movie that made his career is the 1977 Academy Award Winner for Best Picture, `Rocky'. On top of that, `Rocky' also earned two more Academy Awards for Best Film-Editing and Best Director (John G. Avildsen).<br><br>This movie is unlike any other ever put on film. It's films like this that remind us of the beauty that is going to the cinema, and if only I was around during that year when such films as `Close Encounters of the Third Kind', `Jaws', `Saturday Night Fever' and `Network' were all playing in cinemas. The storyline takes place in Philadelphia, where Rocky Balboa (Sylvester Stallone) struggles to make a living as both a small-time boxer, and the brawn of a loan shark. Until one day, a sudden opportunity is handed to Rocky to compete for the World Heavy-Weight Title against the champion, Apollo Creed (Carl Weathers), a charismatic and flamboyant fighter labelled as `The King of Sting' and `The Master Of Disaster'. Attracted to Rocky's reputation as \"The Italian Stallion\", a match between Creed and the unknown boxer is set, which is subsequently advertised as a fight where a \"nobody\" can become a \"somebody\". Mickey (Burgess Meredith), is the owner of the gym where Rocky trains and later becomes Rocky's manager. Mickey is passionate about the world of boxing, and believes that Rocky has the potential to go the distance, instead of being `a cheap second rate loan-shark'. However, the central character in Rocky's life is Adrian (Talia Shire), a shy pet-store clerk, who acts awkwardly when Rocky even breathes in her direction. However, these almost completely distant outcasts are strangely drawn to each other. While one `didn't have much of a brain', the other `didn't have much of a body', so they worked on their opposites, only to end up together. The legend of this film when it was first released in the mid-70's was: `His whole life was a-million-to-one shot', but what Stallone did was prove to the world that `Rocky' is one-in-a-million.<br><br>Seeing `Rocky' is both a cinematic experience and a religious experience. When first released, the film appealed to the widest audience, and all felt the emotion and intense passion which passed from the film, to them. The film's possession of realistic acting, superb dialogue and the most phenomenal music score by Bill Conti to date, indeed transformed the face of cinema. Stallone's wholesome performance of his own screenplay is electrifying as the film celebrates of the underdog battling to beat the odds. Fans of cinema aren't manipulated into thinking that the inevitable will happen as it does in every other tedious hero drama.<br><br>Over 25 years on, `Rocky' still manages to let the audience's emotions explode; Rocky's blossoming relationship with Adrian, the seedy worlds of Mickey and Adrian's alcoholic brother, Paulie (Burt Young), and the affirmation of Rocky's inability to overcome Creed. And who could forget the excruciatingly compelling Balboa / Creed confrontation? Rocky's determination overturns the boxing fraternity, and supplies cinemaphiles with one of the greatest moments in cinematic history, as a body of spectators both on-screen and off applaud and chant for Rocky in unison. The following four Rocky sequels attempted to deliver the same magic as the original, however failed to convey it's message. `Rocky' illustrates how life itself is stifling and perplexing, but sometimes when you lose your way as well as your original intentions, you may just find something better.<br><br>Simply put, if anyone has a free Friday / Saturday night, this is the film to go out and borrow from the local video store. It's unbelievable that this film was only voted in at #78 on the AFI Top 100 films of all time, and worse yet, was voted in at the SECOND best sports film of all time (the first went to `Hoosiers', starring Gene Hackman). C'mon people, be you black or white or brown or any other skin colour we have yet to discover, get out there and be inspired by Stallone's masterpiece, `Rocky'.","user":"TheSixthChild","rank":[176,206]},{"title":"One of the greatest movies of all time.","rating":10,"date":"26 February 2003","review":"I don't remember exactly when I first saw this film, but for a long time I thought that the second of the series was my favorite.  Well, I recently bought the DVD box-set and after I watched the first movie again I knew that it was definitely the best in the series, and also one of the best movies ever made.  Rocky is very much more than just a boxing movie.  It's a movie about the unbreakable human spirit, determination, and the will to \"go the distance.\"  Rocky(Sylvester Stallone) is a second rate club-fighter and a debt collector for a loan shark(Joe Spinnell).  He becomes involved with a shy girl working in a petshop named Adrian(Talia Shire), and also becomes friends with her brother Paulie(Burt Young).  Rocky's life really isn't anything of interest - until the World Heavyweight Champion Apollo Creed(Carl Weathers) gives him an unexpected shot at the title.  An old boxer-turned-trainer named Mick(Burgess Meredith) offers to be Rocky's manager.  Although the whole film is outstanding, what follows are some of the greatest and most memorable movie moments of all time.  Rocky striving to go the distance in the training scene, the final fight, and the closing moments of the film are so emotional and inspiring that they perfectly demonstrate the human spirit and can bring out the will to win in anybody. Add to this an excellent music score and you have  a classic and unforgettable movie.  Without a doubt deserved the Best Picture award in 1976.   Exceptional performances by all the cast members, notably Burgess Meredith and Sylvester Stallone.  **** out of ****","user":"Obi-Wan Wilson","rank":[242,288]}]