[{"title":"Classic movie for Miami Vice themed fans","rating":10,"date":"16 February 2005","review":"I found this movie in a video store shelf when I was 14. At the time, this movie was phenomenal. This movie gives you a very nostalgic feel of what the 1980's would be like in Miami. I am a very big 80's buff so this was a definite for my collection. I am very pleased to see they released it on DVD. What really makes this movie neat is that at the time, almost all of the actors were unknown, with the exception of James Remar. This movie is based upon the many programs that were employed to straighten up troubled minors and make them realize the value of life. Unfortunately, many of those programs were cut because of mismanagement, lack of funding, or were bogus boot camps run by abusive individuals. I do believe with the right people, a program like this can work, and that is what this movie portrays. Although this plot is fictional, it still leaves you with that feeling of \"Wouldn't it be great if this actually worked\". This movie was one of the first '80's films I can recall to touch racism, drug trafficking, assault weapons, gang warfare, and the effect it had on the youth at the time and put a positive spin on the outcome. One more thing, Bob Dylan and the Heartbreaker's (from Tom Petty) recorded a song for this movie specifically that cannot be found anywhere else. It is called \"Hell Time\" and it is pretty awesome. The rest of the soundtrack could use some work as they did not include Mr. Mister or Prince. If you enjoyed the Miami Vice series or if your a big action packed '80's buff, I highly recommend this movie whether you rent it once or add it to your collection as I did.","user":"djslammm","rank":[19,19]},{"title":"Perfect cheezy 80's flick.","rating":26,"date":"26 April 1999","review":"This is one of those movies that you had to see when it first came out.  It also helps I think if you were the same age as the kids in the movie.  The locations were magnificent.  And some of the performances were not too shabby either I might add.  This was an atypical 80's movie, set in Florida (do you think that a Miami Vice relation was intentional?).  When I was a kid I loved this movie, and upon watching it again recently, I didn't even remember how cheesy it was.  I just remembered these 5 deadbeat kids, forced to work as a group to survive, and everyone thinking that it would never work.  Even now that I've seen it and know how cheesy it is, I still just remember it the way I used too.","user":"nos4a2-2","rank":[11,11]},{"title":"Ultimate fantasy for 15-year-olds in the 80s.","rating":14,"date":"14 January 2004","review":"The people who rag on BAND were probably the same who bought Don Johnson sport coats in the 80s and are now ashamed.  You trendy-then now-pretentious fools, it's not supposed to be freakin' Shakespeare! BAND is a stylish 80s flick with plenty of heart, action and coolness.  It's the ultimate fantasy for 15-year-olds.  Five troubled 'yoots' are sent to an experimental last-chance program in the Everglades run by Joe, a mysterious Miccosukee Indian/Nam Era elite commando.  (See?  Already off to a good start)!  Joes lays it down:  learn to live in this wilderness or die. The 2nd half of the movie (and 'program') takes place in a Miami ghetto run by local drug lord LARRY Fishburne, replete with cute lil' lines buzzed in the sides of his high-top fade.  (There's also an underaged Lauren Holly to consider, long before that drooling idiot Carey came and went).<br><br>War ensues in the hood as Joe trains the yoots to fight.  Purists and prudes can shove it...when Dorcey's machine gun lights up the street from the roof of the feel-good 80s pastel renovated crackhouse it's a spinal moment.  The characters don't have to be 'deep' cause they're all the way likable and automatic gold star for the guest appearance of a vulcan cannon (aka \"that's a goddam minigun!\")  If you don't dig this flick, YOU'RE OUT OF MIAMI!","user":"skintwinkie","rank":[22,26]}]