[{"title":"A Scot's Theme Park","rating":7,"date":"20 February 2007","review":"I'm sure that when Gene Kelly and Van Johnson wandered into that quaint Scottish village called Brigadoon they must have thought they were entering a Scottish theme park. Certainly no modern conveniences around and everyone dressed in costume. But there's a reason for it, a most enchanting reason, the heart and secret of Brigadoon.<br><br>Brigadoon ran in the 1947-1948 season on Broadway for 581 performances in the initial production. It was Alan Jay Lerner's and Frederick Loewe's first really big Broadway success though it was their second collaboration. MGM bought the property for the Arthur Freed unit and it lay dormant for a few years while a lot of creative and financial differences got worked out.<br><br>Gene Kelly curiously enough had the reverse problem with this that his Broadway hit Pal Joey had. The original production of Pal Joey was his first big musical hit and he never went back to Broadway after. But when the film for Pal Joey finally got made it was with Frank Sinatra in the lead and the part was changed to a singer's as opposed to dancer's role.<br><br>Similarly the original Broadway Tommy Albright was a singer named David Brooks and Fiona was played by Marion Bell both pretty good singers. Kelly who could carry a tune had a whole lot of trouble with some of the songs, in fact he himself asked that his version of There But For You Go I be cut from the final film. <br><br>Changing over to dancing leads, Kelly got Cyd Charisse as his partner and as was usual, Cyd's singing was dubbed with Carole Richards's voice. They did do some mighty nice dancing though, especially The Heather on the Hill ballet and Kelly's lighthearted romp to Almost Like Being in Love which was the big hit from Brigadoon.<br><br>Kelly wanted to shoot the film on location in Scotland, but MGM eying budgetary problems and director Vincente Minnelli's desire to do it on their sound stage the film was shot indoors with Brigadoon recreated at Culver City. <br><br>One of my favorite numbers from Brigadoon is My Mother's Wedding Day which the character Meg Brockie sings. It was eliminated by the Breen office censors would you believe. They thought it inappropriate for drunken Scotsmen to be cavorting about on a solemn occasion like a wedding. As a result the character of Meg Brockie was cut down to nothing. A pity because Pamela Britton won rave reviews for her Broadway performance and Dody Heath is left with next to nothing in the role.<br><br>Still there's enough of Brigadoon for audiences to still enjoy and dream about an enchanted Scottish village we might all like to escape the travails of the world to.","user":"bkoganbing","rank":[36,39]},{"title":"Surprisingly Enjoyable!","rating":29,"date":"29 May 2000","review":"I have adored Gene Kelly ever since I saw Singin' in the Rain when I was about 10, but I had never seen Brigadoon until renting it a couple of days ago.  Yes, the story is far-fetched--but somehow it works.  Yes, the scenery looks like it is from a high school play, but I became too caught up in the story (yes, there IS a story) to care.  In reading the other comments, I'm SO glad that the Keel/Grayson team wasn't used.  Keel is too macho and gruff and Grayson is too sugary.  I think Gene Kelly and Cyd Charisse gave their characters the necessary gentility and earthiness.  My only complaint is that I wish the director let the viewer linger with the closing scene for a few more seconds.  It ends a little too abruptly and with a few unanswered questions about Van Johnson's character. Despite that, it was very enjoyable and even ponders some deep points, especially in the line \"Sometimes things you have faith in become more real to you than the things you can see and touch.\"  Watch it with a light heart and you won't be disappointed.","user":"Curly-27","rank":[28,30]},{"title":"When You Love Someone, Everything Is Possible, Even a Miracle","rating":7,"date":"12 February 2012","review":"The New Yorkers Tommy Albright (Gene Kelly) and Jeff Douglas (Van Johnson) travel in a hunting trip to the highlands of Scotland. Tommy and Jeff are best friends and Tommy is taking a break from his engagement with his fiancée Jane Ashton (Elaine Stewart).<br><br>Tommy and Jeff get lost on the hills and out of the blue, they see a small town that is out of the map. When they arrive in town, Tommy meets the local Fiona Campbell (Cyd Charisse) and they learn that the place is called Brigadoon. Further, it is the wedding day of her younger sister and they are invited to stay to the party. Meanwhile Tommy and Fiona fall in love with each other. <br><br>Later Tommy and the skeptical Jeff discover that a local preacher had prayed to God on the Eighteenth Century asking for a miracle to protect Brigadoon from witches that lived in Scotland. From that day on, when the locals go to sleep in the night, they wake up 100 years later. However, if a dweller leaves Brigadoon, the town and the citizens would all disappear forever. But an outsider could stay forever in Brigadoon provided he or she loves someone in the enchanted town.<br><br>\"Brigadoon\" is a fairy tale that combines \"Lost Horizon\" with \"The Sleeping Beauty\". The plot is silly and the songs are dated, but the romantic story and Cyd Charisse are delightful and the final message (\"when you love someone, everything is possible, even a miracle\") is very beautiful. My vote is seven.<br><br>Title (Brazil): \"A Lenda dos Beijos Perdidos\" (\"The Legend of the Lost Kisses\")","user":"claudio_carvalho","rank":[16,17]}]