[{"title":"General Bullmoose meets The Lobster Lady","rating":8,"date":"25 October 2005","review":"It Happened to Jane presents Doris Day as a woman on a mission. She's inherited a lobster business from her late husband and due to some cost cutting on the railroad that President Ernie Kovacs has put through, her lobsters were dead on arrival at their destination. <br><br>I'd be burned up as well and Doris and lawyer Jack Lemmon sue the railroad. They win a nominal sum, but that ain't good enough. They both carry on the fight and she becomes a media star. Kind of like a Fifties version of Erin Brockovich.<br><br>Of course all of this is done at the incredible stupidity and abominable sense of public relations that Ernie Kovacs has. His character is yet another version of Al Capp's General Bullmoose. And that character was a satire on Eisenhower's first Defense Secretary Charles E. Wilson. Wilson at his confirmation hearings uttered that never to be forgotten phrase that he had always operated on the principle that what was good for General Motors was good for the USA. Wilson was a fatuous sort of gent, just like Ernie Kovacs here. I'd have to say Kovacs was having a whale of a good time in this part.<br><br>The movie had some nice location shooting which definitely helped. And I completely agree with the previous reviewer who said that Lemmon and Day meshed nicely together as a team. It is a pity they weren't ever teamed again.<br><br>A favorite character part in the film for me is Russ Brown who plays Day's uncle and a former railroad engineer, a fact that comes in handy during the climax of the film.<br><br>It's a nice family film, but it also gets in a few good satirical shots at American business types.","user":"bkoganbing","rank":[29,32]},{"title":"Last New Haven RR steam locomotive is the real star!","rating":10,"date":"2 February 2005","review":"The picture was filmed in 1958, mostly in Connecticut (Essex, Deep River, Hartford, etc.) along the rails of the New Haven RR. The producers used that railroad's last surviving steam locomotive which had been held for 4 years since the end of regular steam use on the railroad in 1954. It was used in the winter for snow melting service. After the film was completed, the locomotive was offered to anyone/community who wanted it. The town of Essex debated the idea but turned it down as not \"fitting in\" to the quaintness of the community. So the locomotive was sold for scrap and moved to a dismantling yard in Pennsylvania. A short while later the Danbury Fair Ground called the railroad and asked if they could have the locomotive, but a quick call to Pennsylvania brought the sad news that the locomotive had already been cut up. Too late. No New Haven RR steam locomotive survives today. At least we get to see \"old 97\" go out in a blaze of glory on the screen (real number was 3016, I believe). She was a 2-8-2 wheel arrangement, known as \"Mikado\" types... a very common type of freight locomotive of the early 20th century.<br><br>The shots of Day and Lemmon yelling back and forth over the top of the coal tender are priceless. They were really there, getting all covered with soot and coal smoke. The actual railroad fireman who did the work with Lemmon said he enjoyed his stint bailing in coal, and the dirt was real, not applied makeup.<br><br>A great flick!","user":"richard-w-symmes","rank":[45,53]},{"title":"Wonderful Team Effort By Doris Day and Jack Lemmon","rating":10,"date":"6 August 2001","review":"After watching this film several times -- one wonders why the natural talents of Doris Day and Jack Lemmon weren't paired more often.  Their totally believable portrayals really hold the viewer -- one can't overlook the fact that these two were at the top when it came to natural talent on the screen.  Day's fight with railroad magnate (Ernie Kovaks fits his role like an old shoe) brings to the fore \"corporate/community greed\" vs. \"human rights\" as the townfolk and eventually the \"nation\" get behind Doris' quest to save her lobster business in Maine.  The humor is mixed with some thought-provoking questions.  In 2001, the film is almost a glimpse at the last vestage of the \"town hall meeting\" government.  The supporting cast is fine (Mary Wickes, in particular adds great comic touch) -- but it's Day and Lemmon together that make this film a must see.","user":"sobaok","rank":[25,28]}]