[{"title":"The Best Film based on one of Shakespeare Best Works. This Masterpiece is recommended for anyone that loves movies . Truly one of the Greatest Films of all time!","rating":10,"date":"19 August 2010","review":"Akira Kurosawa's 1985, Ran, is based one of Shakespeare's greatest works, King's Lear. The Film proudly stands along with his other classic such as Seven Samurai, Yojimbo, Roshomon, Sanjuro and the Hidden Fortress. He is a master in the art of filmmaking, no one can film an epic battle scene quite like Kurosawa. This is recognized as the most expensive film ever made by Akira Kurosawa, it was at that time, Japan's most expensive film ever. Being at the age of 75, he still showed us, he's one of the best in the business.<br><br>This movie is about an aging lord, head of the Ichimonji family, decides to retire and to pass the power to Taro, the eldest of his three sons. He will however have to banish Saburo, the youngest one, who dared to speak the truth to him. Soon, the former lord is chased away from the castles of his sons and becomes mad when he understands that one of his sons is trying to kill him. The three brothers are fighting for control of the Kingdom, as their lust for power grows every day. Four armies are facing each other on the prairie. Lord Ichimonji's former peaceful kingdom is nothing but a distant memory.<br><br>Akira Kurosawa redefines what an epic film is, with astonishing story telling, entirely believable characters and real life battle scenes without the use of Special effects/CGI. He retells the story of King Lear in his own way and no one would recognize that it was actually a adaptation beforehand. But just like Shakespeare, there is humor, irony, death and not a happy ending. Everyone who played a part in the production of this film, deserves some kind of recognition. The acting is pretty much excellent and certainly believable.<br><br>10/10 Kurosawa is a Genius","user":"Loving_Silence","rank":[176,196]},{"title":"The Greatest Shakespeare Film","rating":10,"date":"31 March 2004","review":"Throughout his career Kurosawa strove to achieve what he called \"real cinema\", proclaiming that \"in all [his] films, there's [only] three or four minutes\" of such quality. Many would argue that he was his greatest critic. For if not in \"Seven Samurai\", then definitely in \"Ikiru\" and if not in \"High and Low\", then definitely in \"Rashomon\" he must have achieved this plateau of greatness. Well, if not in any of his other films, then definitely in \"Ran\" Kurosawa finally came to the apex of cinematic artistry. With the both lyrical and grandiose tone of its craft, its beautifully spare imagery, its haunting score by Toru Takemitsu, and its lead Tatsuya Nakadai's masterful understated performance, \"Ran\" is perhaps the most fully realized epic ever made.<br><br>The tale, which is an adaptation of Shakespeare's \"King Lear\", begins as Lord Hidetora Ichimonji and his court are out hunting. During a break in the hunt, Hidetora proclaims his adbication from the hight seat of the Great Lord and bestows his lands unto his three sons, dividing them up equally. He declares his oldest to be his successor in power. When his youngest son and one of his faithful nobles, express their concerns on this idea, Hidetora foolishly banishes them both, mistaking their advice as insolence. With this opening scene, the peaces are aligned and soon 'chaos' as the film is aptly named will break out throughout the land. From here, we see the downfall of Hidetora and all those who surround him. The film retains all the themes of the original play, but also thanks to Kurosawa's own input addresses a slew of even more varied ideas. Like Shakespeare, Kurosawa is greatly interested in the responsibility of the leader and the hypocrisies and ironies of an autocratic system. The most obvious though not the central theme in the whole film is war, and Kurosawa explores this theme to its full extent throughout the film. In perhaps the most grandiose battle scene every filmed, he demonstrates the destructive consequences and the paradoxical beauty of conflict.<br><br>Here, Kurosawa implements the camera with masterful skill not once employing the editing/photography tricks and gimmicks so often seen in films (even the good ones) today. This director has an awareness of the past and the history of film, but also the creative spontaneity of a true genius. In \"Ran\", he focuses on the more methodically simple yet artistically complex montage of Eisenstein, and on the strict compositions of Ozu. He employs the most basic and yet most artistic of techniques. Each shot is planned to precision, and each cut is made for a purpose. The coreagraphy and blocking of each scene is simple and powerful, and Kurosawa allows the actors to play out these scenes without the intrusion of the camera or the editor. Thus, the director prevents the style from eclipsing the already powerful material he has to work with. Simply put, \"Ran\" is a masterpiece that flows and develops like an opera, from its forebodingly peaceful ouverture to its bloody Shakespearean heart until its final, quietly subdued, and sorrowful denouement.","user":"Elendil87","rank":[138,161]},{"title":"RAN - A Classic Of Its Time And For All Time","rating":10,"date":"30 December 2004","review":"Based on Shakespeare's King Lear, this film follows the story of the aging warlord Hidetora who, in an attempt to restore peace, divides his kingdom between his three sons - Taro, Jiro, and Saburo - and retires from his duties. However, one of his sons sees this as unwise and is banished by his father, leaving his two brothers in charge of two of the three castles left in their hands. It isn't long before they are overtaken by greed and eventually betray their father, leaving him in the hands of a philosophical jester and a loyal retainer. This betrayal ultimately leads to war, dividing the family and driving Hidetora insane.<br><br>The remarkable script, which contains many of my favorite lines from any film, still manages to break its way through the confinement of subtitles and reveals itself to be one of the richest Kurosawa ever wrote. He has obviously worked equally hard on the look and feel of the film - the cinematography being excellent (example: the long, continuous shot of Saburo's men charging on horseback across a river).<br><br>There's also something rather frightening about it that I can't quite put my finger on. The first battle, which is the film's turning point, is the most horrifying, yet strangely beautiful, battles ever filmed. A good effect used is the loss of sound, with only Toru Takemitsu's haunting score to be heard. The entire battle lasts less than ten minutes and there is no uplifting or bombastic music to be heard, but in my opinion, it's Ran's finest scene, and thus the finest scene ever.<br><br>What Kurosawa managed to get rather than give though was excellent performances from his actors, none more brilliant than Tatsuya Nakadai's Hidetora, Mieko Harada as Lady Kaede (a woman similar to Lady Macbeth but with a different hidden agenda), and the strangely-named Peter as Kyoami.","user":"O_L_D_B_O_Y","rank":[113,133]}]