[{"title":"Aesthetic Pantomime","rating":8,"date":"12 March 2003","review":"The essence of childhood. All moral codes, conduct and courtesy as standard. Language no barrier the visual story is timeless. A must for all children. The German version of 'Beauty &amp; the Beast' (a French tale).<br><br>As a small child I saw the broken up dubbed version in the late 1970's over a 5 day period on BBC tv. It cast a spell, which I never ever forgot and spent my life searching for. Now in my early 30's I tracked down a subtitled copy of the 1957 71ms film. Not what I remembered, but far more beautiful and artistically adventurous than I could have appreciated as a child.<br><br>As an adult the hard hitting message is obvious, as are the lack of special effects, so this film's use of theatrical staging (scale models) is slightly overt in modern context. This film is perfect for young children who are not yet desensitized by modern graphics, yet can still be touched by moral lessons. Nostalgic adults will love this film, but anyone who has never experienced 50's, 60's European Fantasy cinema will find this film too primitive.<br><br>This film is a story book come to life. Be it Hans Christian Anderson or the Brothers Grimm, it is pure 50's Technicolor magic. Very moral and sound, yet beautiful to look at time and time again forever. Moving Art.<br><br>It may not live up to my childhood memory of it, but I am so glad to have found the tape, purely because it is such a superior piece of film making that I know I will enjoy watching it over and over again. So much art in it to appreciate. In my extensive movie collection I have no other film that is Directed, Produced &amp; shot quite like it. It is a valuable asset to the film collector. I fully intend to acquire other films in the 'Tales From Europe' series, as I detect that they are highly collectible. This is a big tip! Enjoy! :)","user":"Aberlass","rank":[15,16]},{"title":"Its even better than I remembered in the late 60s","rating":2,"date":"2 March 2001","review":"This film was bought by BBC Children TV,  dubbed in English and serialised in the late 60s which is where I originally saw it.  You can buy a restored, German language with English subtitles which I did to see if my memory had played tricks  on me - was it as good as I remembered?<br><br>I'm glad to say that its even better than I remembered,  the stylish production,  imaginative sets and performances enthralled me and my two you daughters again (the German language bit didn't seem to bother them at all!).  I remembered the story but what passed me by on my B&amp;W TV in the 60s was the imaginative and beautifully shot images.<br><br>Much recommended!","user":"mark.dixon","rank":[8,8]},{"title":"Still needing therapy !","rating":5,"date":"5 May 2003","review":"Wonderful and fascinating as The Singing Ringing Tree is, myself and my contemporaries were totally traumatised by its images as young children. The man dressed as a bear and the dwarf terrified me and the fish at the waterfall made me very uneasy. The very nature of the theatrical effects and make-up was what I found disconcerting as a 7 or 8 year old. I watched it in a local cinema as an adult and thought that my demons had been exorcised but recently I saw a TV programme which featured a \"mechanical\" fish and my childhood trauma came flooding back instantly ! No film however violent or scary has ever had this kind of effect on me before or since, but please don't let me put you off from watching The Singing Ringing Tree !!","user":"bouncy-babe","rank":[9,10]}]