[{"title":"A stirring little gem with an unbronsonesque Bronson","rating":8,"date":"9 August 2005","review":"This modest little gem is a humorous, funny, melancholic movie about what you can encounter if you fall in love with a romantic woman - you can end up bigger than life, and that can get you into serious trouble! Bronson - far from his usual he-man cliché roles - delivers a very nice, humorous performance; and so does Jill Ireland. Just watch it, even if you are far from being a Bronson fan - this droll flick is enjoyable for everyone!<br><br>To tell you more, and make you understand, one cannot avoid spoilers; so here's the plot:<br><br>***** SPOILERS *****************************<br><br>Graham Dorsey (Bronson) is a member of a gang which is on their way to rob a bank. Being frightened of the job, he takes the chance to stay in a house by the road until his buddies come back from the job.<br><br>The lady of the house, Amanda (Ireland), a young, attractive widow, is alone in the house. Graham manages to get her to bed with him. They fall for each other (he pretends to be somewhat more noble than he really is), and share some hours of love and bliss - until a posse comes to catch him (the robbery had failed). He tries to flee (telling Amanda he goes to free his accomplices). But he ends up in jail, sentenced for another man's frauds, while the other man is erroneously shot in his place. So Amanda gets word that Graham is dead.<br><br>Amanda, formerly an honorable widow, now looked upon as a bandit's mistress, is alone in her grief. She writes a book about the story; but Graham having overstated, and Amanda having a strong tendency to romanticize and idealize her feelings, she describes the whole story much bigger than life. The book becomes a best-seller; not only locally, but all over the world. The tale gets a huge hype. <br><br>So when Graham is free again after a year in jail, and comes back into town (in disguise) for Amanda, he finds, to his surprise and growing amusement, some sort of \"Graham Dorsey Disneyland\" at the place, built around the book's tale. And Amanda's house has turned into a GD museum, visited by loads of tourists guided by Amanda who tells them \"her story\". He, too, enters, asking for a tour. He gets it; Amanda does not recognize him - not even when he takes his masquerade off: she simply does not believe him - she believes her book, and in her book, he is bigger, more beautiful, and better in any respect! (very funny scene)<br><br>Finally, he succeeds to make her believe him. But to his big surprise, Amanda does not want the real GD - she prefers to live for the legend! She tells him that formerly, it was a matter of just the two of them; but now it has become a matter of the feelings of all the world, which she would not hurt by destroying the myth. Even when he tries to apply force, she just steals his gun and demands that he leaves forever. He refuses. When she sees no more way to change his mind, she even shoots herself before his eyes.<br><br>On his following lonely odyssey, he meets the Graham &amp; Amanda hype everywhere, ad nauseam: and whenever he gets up to protest against the lies, saying that HE is GD, he is laughed at, shouted down, or even threatened for his \"fraud\". Irony of fate: it is only in the end, when he is put in an asylum for his \"lunacy\", among the lunatics, that Graham finds people who believe him and accept him, and finds his peace of mind.<br><br>*********** END OF SPOILERS *******************<br><br>So this movie, though playing in a western milieu, is at its core a story of the fate of an unusual love. It is very unpretentious (far away from roaring schmaltz like \"Gone with the wind\" or \"Titanic\"; lightyears away from that big-mouthed, stylish soulless crap that we have to endure since the eighties), just a humble, bittersweet little (tragi)comedy with moments of the grotesque, about life's pleasures and grief, about becoming a culprit and becoming a victim; about the value and the cost of idealizing and true life. If it wouldn't be for Bronson and Ireland starring, you might call it a B-film. But Charles Bronson - surely not being the king of actors - delivers a very nice, humorous performance here in a very unbronsonesque role, together with his excelling real life wife Jill Ireland. It's a pity that the direction is wooden sometimes. And, fitting superbly to its old-fashioned style, the movie has a nice catchy melancholic little waltz as a theme song (\"Hello and Goodbye\"/Elmer Bernstein/Alan and Marilyn Bergman, sung by Ireland), dealing with the elusiveness of love.<br><br>Give it a chance! You will come out of it thoughtful, I guess; and about how many Hollywood films can you say that?<br><br>Valuation: I would spontaneously give it a good 7 out of 10 - but I spontaneously tend to judge relating to an IMDb average valuation of below 5, as it should be; but the actual average being near 7, it should get an 8 (though this is unfair to the comedy masterpieces like Lubitsch's \"To be or not to be\", or Chaplin's \"Modern times\"; or Tati's \"Jour de fête\" - those should have at least a 12, then! :-) )","user":"yuggoth-1","rank":[43,48]},{"title":"Unreservedly Recommended.","rating":8,"date":"30 November 2006","review":"I'm shocked to learn that only 17 comments were written in the IMDb so far. I've seen this movie 20 years ago and for a second time last week. I still feel this is a great movie.<br><br>Full of inspiration and transpiration, with excellent script and directing, not to mention the great performance by the 2 leading actor and actress, both exhibiting masterpiece achievements for their professionalism.<br><br>It was a low cost production, but great film doesn't necessarily cost much. It's a complete waste of movie resource that so little people had seen this masterpiece.<br><br>Probably Bronson's only comedy, I strongly and unreservedly recommend it to anyone!","user":"dcheng-7","rank":[25,28]},{"title":"A wonderful love story with a twist","rating":10,"date":"29 November 2006","review":"This is my favorite Charles Bronson and Jill Ireland movie. Great writing, directing, photography, and film editing. The casting was perfect. Douglas V Fowley was perfect as the bank robber gang leader. The way Jill is seduced and falls in love with Bronson is fantastic. But alas their love was not destined to last. This is Jill's best and Bronson showed his versatility in a different kind of role. I had hoped that when Bronson returned to her from prison, their love would have reignited and they would have lived happily ever after. But life is not like that. At least they had those beautiful hours From noon till three. I know you will enjoy this movie. I could see it over and over.","user":"elmer_klump","rank":[21,24]}]