[{"title":"bread and butter 70s drive in horror","rating":13,"date":"13 July 2004","review":"When I say the \"bread and butter\" of 70s drive-in horror, I mean movies like this one came and went, forgotten and/or never seen by the majority. But it was films like this that kept drive-ins and smaller movie houses in business. I am so<br><br>thankful for the age of the DVD. With the DVD era, companies such as Anchor<br><br>Bay, Something Weird Video (Image), Blue Underground, Shriek Show, and<br><br>many others have brought back lost cult classics (and not so cult classics) so that new generations can discover them, and the older generations can<br><br>rediscover them. <br><br>\"The Child\" has all the right ingredients for a b-horror movie. A little bit of homemade special effect gore, a soundtrack that gives you the creeps, zombies, and it set in the countryside. It may have it's slow parts, but the final 20 minutes or so deliver the goods in fine 70s b-grade fashion. You will be getting startled one minute, then laughing the next (unintentionally of course).","user":"ericdetrick2002","rank":[25,27]},{"title":"Fun and Obscure","rating":26,"date":"26 April 2003","review":"This overdubed, somewhat disjointed horror film is probably more of a late to scene \"Omen\" rip-off than a zombie film; but if you are in the right mood you may find it creepily effective.   There is an excellent scene about a half hour into the film where the old creep grandfather starts laughing at a horrible accident and the kid joins in. The other two don't know what to do, haven't we all been there?   The disjointed sound actually may work in the film's favor, though you wonder if you are listening to the same people you are seeing on  the screen. So it's hard to fault the performers too much. It's the kind of thing you might have seen at a faraway drive-in or late one night on cable and never quite shook. The Something Weird DVD gives you a chance to live it all again.","user":"rufasff","rank":[19,21]},{"title":"You have to love these rarely seen obscurities","rating":31,"date":"31 May 2003","review":"`A powerful combination of the evil-child subgenre and the Zombie Movie' Aurum Encyclopaedia of Horror<br><br>`Zombie Child has it all: Murderous kids, cannibal zombies and lashings of gore. Another unbelievably ghoulish offering from the legendary Harry Novak.'   David Flint. Divinity<br><br>To sum up Zombie Child in two words, cheap and weird. What do you expect from producer Harry Novak? For those who are familiar with the 혩Sultan of sexploitation's work, you may remember his other horror productions, Axe, Mantis in Lace and The Mad Butcher. Don't let this put you off. Zombie Child does have the occasionally atmospheric scene or effective sets to redeem it.<br><br>Alicianne Del Mar (played by the lovely Laurel Barnett) arrives in the heart of the forestry to look after the difficult child, Rosalie. Her has broken down and she is now stranded. What are those creatures wandering around the grounds at night? Why does everybody act so strangely? It transpires that Rosalie's mother has recently died and ever since her departure, her only daughter has found comfort visiting the nearby graveyard at night. She admits that the 혩things' in the woods don't scare her because they are her 혩friends'. Alicianne soon realises that these 혩friends' are the murderous zombies who have killed everyone that have, in some way, annoyed the spoilt little girl. The climax involves the old favourite boarding up every possible entry as the horde of ghouls gather around an old mill to get at Alicianne.<br><br>Zombie Child is so peculiar, not to mention obscure and hard to find, you end up liking the film. The eerie misty cemetery scenes and some of the murders are quite well executed for a film whose low budget is obvious in every shot. You even begin to appreciate the silly looking zombies who appear like they've wondered in off the set of the terribly cheesy Astro-Zombies (Ted V. Mikels, 1969).<br><br>If you manage to find this old gem, I recommend you check it out. Just wait until you see the acting of the nosy neighbour. Especially in the scene preceding her death. I wonder what was her motivation...","user":"Krug Stillo","rank":[12,14]}]