[{"title":"Absorbing 70's bizarre","rating":8,"date":"18 February 2007","review":"Film maker José Sirgado (Poncela) gets to know amateur film director and freak Pedro though an acquaintance of both. Pedro's bizarre movies and José's personal problems and drug addictions act as the glue that forges a master-pupil relationship, especially when José makes a technical improvement to Pedro's camera that allows interval shooting. All this with some undefined gay twist to their relationship.<br><br>After the relationship is put to sleep and José is back to his gloomy apartment in Madrid and his drug-driven love relationship with Cecilia Roth, he is surprised to receive a package from Pedro one day. And inside the package, a film and a cassette tape seem to indicate that a vampire lives inside Pedro's Super-8 camera, a vampire that absorbs people and makes them disappear when they are filmed.<br><br>Could it be true? Or is it just a result of too much drug intake? The story becomes then a vehicle for theorizing on the creative process in arts, the relationship between the artist and his product, and finally the fascination with cinema in our lives (\"Arrebato\" can be translated as \"raptum\" and refers to the impact of certain artistic clichés -- King Solomon's mines for Sirgado, Betty Boop for his girlfriend-- in our feelings)<br><br>As a very thin backdrop to the story, Zulueta portraits an sfumatto of the Spain of the late 70's: a society that used drugs liberally, craved for freedom, and made the way of sexual liberation while challenging the statu quo of decades of dictatorships.","user":"sansox","rank":[11,15]},{"title":"Little known masterpiece","rating":9,"date":"7 August 2004","review":"Get hold of it if you can. Best vampires movie ever without even showing any teeth...<br><br>If you thing you are committed to your work, see the protagonist of this movie.<br><br>The director had to adapt to stern constrains in number of characters and locales and still he came up with a modern classic, catching the spirit of the \"movida madrileña\" ( a musical an cultural boom in Madrid eighties) and providing a metaphor for the trail of wasted talent this outburst leave, because of drugs, diversion and basic human frailty. In my personal top 5 Spanish movies of all time.","user":"Chalimac","rank":[19,29]},{"title":"An extraordinary, oblique, and disturbing celluloid nightmare!","rating":10,"date":"23 January 2014","review":"Extraordinary, oblique, disturbing, and somewhat rare Spanish feature from 1979. This stylish piece documents the gradual subversion, and inexorable collapse of a young, dope-addled, wholly jaded filmmaker's life. A dark, surrealist nightmare about the apparently vampiric properties of a hypnotic, phantasmagorical super-8 film that once seen is not soon forgotten! (including the viewer and main character alike!) 'Arrebato' is a strikingly lucid and fiercely imaginative work of pure cinema that includes some genuinely unsettling sequences; the narrative enigma grips right from the terse opening gambit, and swiftly immerses the giddy viewer in its unrelenting maelstrom of hallucinatory strangeness.","user":"Darkling_Zeist","rank":[8,11]}]