[{"title":"Great things are about to happen...","rating":8,"date":"19 October 2006","review":"ej's kung-fu capsule review for films of the chop-socky old-school - <br><br>1. basic plot type - Clan vs. clan; special styles clash; young man comes of age learning kung fu from older master.<br><br>2. plot construction - Pretty strong, and easy to follow. Director Yuen adds some very nice touches, such as when Chan introduces the old master to his only friend - a cat.<br><br>3. dramatic - Occasionally, in its emphasis on the relation between the old master and his young student.<br><br>4. funny - Occasionally - this is still early for Chan, but he is already playing his role with a bit of light irony.<br><br>5. dialog - competent but no shocks here.<br><br>6. cast performance - Strong all around.<br><br>7. crew performance - Seem to be aware that they are on the verge of a technical breakthrough in 'fu film-making, but this isn't quite it. (\"It\" is the later \"Drunken Master\", of course.) <br><br>8. amount of fighting - Lots.<br><br>9. quality of fighting - Over-all, really darn good.<br><br>10. special any cast or crew notes - After years of effort, the success of this film at last made Chan a star in Hong Kong's film market, and brought to a head the tensions between Chan and the producer to whom he was contracted, Lo Wei. Although Lo would always insist that he 'discovered' Chan, all he really wanted was a capable and charismatic young fighter he could mold into another Bruce Lee. Lo hated this film, and all other early Chan attempts to change the traditional chop-socky formula. But this film shows that Chan was very much his own man with his own vision; while the plot is pretty standard for this genre, Chan's performance is refreshingly new. <br><br>Fortunately, Chan's ties with Lo would soon be severed, allowing the development of the Chan we've all come to admire.<br><br>Chan is also aided here by the early effort of Choreographer/ director Yuen Woo Ping. Yuen's direction waffles a bit in spots, but this is clearly because he has a sense that there can be more to a martial arts film than we see in many chop-socky films of the era; he's still learning to articulate that.<br><br>Besides countless imitations, the film spawned two direct sequels; one (SiES II) was produced by the same production company and starred Wong Tao; it is interesting in a quirky, eccentric way thanks to the supporting actors; but Wong Tao is no Jackie Chan. The other sequel, known as \"The Jade Claw\" appears to have been put together by the Yuen Clan to continue the developing reputation of Simon Yuen. Unfortunately, the elder Yuen died before the film was finished, and the continuity is terrible. Still, Billie Chong, star of that film, does a lot better as a Jackie Chan imitator than Wong Tao ever could.<br><br>Chan himself refused to revisit this story for a sequel, and I think the decision wise - this film is genius in the making, all around; but the genius isn't made yet - that would appear later, and with much greater impact, in Drunken Master.<br><br>11. big positive - Simon Yuen's most credible performance as the old master.<br><br>12. big negative - The cat's-claw style Chan develops in this film is not all that impressive; that creates a weakness in the finale. There are also allusions in the dialog to plot threads that never show up.<br><br>Bottom-line - who should see this movie - Chan fans; Martial Arts fans; chop-socky fans; Yuen clan fans. Its a solid action film, but may be too much a part of its genre for more general audiences.","user":"winner55","rank":[15,15]},{"title":"Jackie's First Success","rating":8,"date":"18 August 2005","review":"I believe this was Jackie Chan's first widely successful movie freed from the constraints of Lo Wei and working with a different director allowed Jackie to move into a different direction and stop trying to be the new Bruce Lee (as if anyone ever could be!).<br><br>Surprisingly the humour translates pretty well and both Jackies cruel martial arts school employer and the kindly martial artist he meets and befriends are well drawn comedic characters. The sometimes bizarre fighting styles all named after animals are a joy to behold and Jackie and all the other martial artists involved show just how skillful they are with some truly memorable twists on the old school kung-fu style fighting. Many of those in this film came together again a year later to make the equally excellent Drunken Master.<br><br>I would recommend this film to any martial arts fan as a must see, it's also an excellent entry point if your interested in looking into martial arts action films in general. 8/10","user":"no-skyline","rank":[14,14]},{"title":"The One That Started It All.","rating":8,"date":"26 February 2000","review":"Jackie's first big hit. It's easy to see why it was so popular when it was first released. Nobody had ever seen comedy and kung fu mixed together before. And if it wasn't for Jackie, we might have never have. Good and plentiful fights easily make this a kung fu classic that still entertains over 20 years later.","user":"magilvilla","rank":[13,14]}]