[{"title":"Eastwood gives his best screen acting to date...","rating":8,"date":"15 June 2003","review":"In the 29 years of Alcatraz's existence, and despite the strict measures, 39 captives tried to escape from America's premier maximum-security prison during its existence... Thirty six of whom failed... This script is about the other three, of whom nothing is known... They may have drowned in San Francisco Bay, or they may have got away...<br><br>Morris (Clint Eastwood) was a loner, a rebel against society, the perfect hero that Siegel loves... Lee Marvin in 'The Killers', Steve McQueen in 'Hell is for Heroes', and Richard Widmark in 'Madigan' were all similar types in films which he had directed..<br><br>In 'Escape From Alcatraz,' Eastwood gives his best screen acting to date... It is a charismatic performance that is so idiosyncratic, persuasive, and powerful... Eastwood, gave Morris the rough, intelligent aspect that is immediately palpable...<br><br>The first few minutes of the film consist of Morris being brought by boat to Alcatraz, inspected by a doctor and thrown into a cell... Throughout this, Eastwood does not speak... But already the audience feels it... They know the character... He has been through this before... He tries to control his mind... He builds a barrier between himself and his surroundings... He holds back his fear but he's not so foolish as to appear brave... Behind his impassivity, his mind is calculating... He is studying everyone... Everyone knows, prison guards and fellow prisoners alike, that this is not a man to be intimidated with easily...<br><br>But Siegel wasn't making a film about penal cruelty or miscarriage of justice or anything like that... He was presenting a meditative study of the inflexibility of human spirit, with a star strong enough in himself to join one sequence to the next... Both Siegel and Eastwood are known for violence, but there's relatively little of it this time...<br><br>This is not to say that Siegel has no interest in character... Stereotype characters, such as Doc and Litmus, make the film more entertaining... A further example is the inevitable homosexual Wolf (Bruce M. Fisher), who points out that Morris is a potential victim but realizes he has met his match when he approaches him in the showers one morning and gets three unexpected blows in the groin and a bar of soap in the mouth for his harassment... Another familiar type of character is English (Paul Benjamin), the leader of the Black mafia, who sits in the yard far away from the white inmates... English proves to be a nice guy..<br><br>But the biggest stereotype of them all is the cold warden, although Patrick McGoohan tries as hard as he can to provide Morris with some individual personality... Apart from the flower-crushing and constant attention to his nails, he is permitted by the scriptwriter merely to recite phrases that might have come from the prison handbook: 'No one has ever escaped from Alcatraz alive. Alcatraz was built to keep all the rotten eggs in one basket. I was specially chosen to make sure the stink from that basket doesn't escape.'<br><br>But two elements in the film are absolutely real: one is the central character, which will be considered in a moment, and the other is 'The Rock' itself...<br><br>Siegel's overwhelming achievement is to send the audience to infamous prison for two hours... The claustrophobia, the implicit suppression of any joy, the barbarity of being caged in isolation cells, all these suffocating atrocities come across with such reality that one experiences a total sense of relief when the camera moves into the recreation yard for the clear bright light of every early morning... Siegel's technique in this respect is unique...<br><br>Siegel's film style seems almost a cinematic interpretation of Eastwood screen persona: lean, clean, and harsh... Here is one example: When the incorrigible psychopath is out to finish Eastwood, his one chance is in the exercise yard... When he enters the yard, he is in need for a weapon... He has none! He slowly advances into the yard toward his victim... The camera goes down to the man's right hand as he walks... After a moment, another man puts a knife in that hand... The camera stays on the hand as he keeps moving... After another moment, another hand reaches in and grabs the con's arm.... The whole brief sequence is loaded with surprise and suspense... It is in two words: pure cinema...<br><br>Siegel's movie follows the known facts of the escape constantly, permitting itself only one act of poetic license at the very end... Throughout the film, Siegel uses a yellow chrysanthemum as a symbol of 'heart', to indicate that although the brutal system may have removed everything from the inmates save the questionable privilege of remaining alive, in some men at least their spirit survives... <br><br>'Doc', an elderly inmate who has spent twenty years there but who is permitted to paint and cultivate chrysanthemums, introduces the concept...","user":"Nazi_Fighter_David","rank":[128,144]},{"title":"Interesting and underrated.","rating":10,"date":"10 November 2004","review":"Some people complain that this movie is \"boring.\" It's true it is very quiet and low-key, but this isn't necessarily a bad thing. It has a distinct realistic feel to it, and it manages to be extremely suspenseful without using over-the-top action or an overblown soundtrack. There were several moments that actually had me on the edge of my seat.<br><br>Fans of Eastwood and McGoohan, who both give fantastic performances, should love this. Fans of prison movies should love this. Fans of suspense movies in general should love this. It is a top-notch movie with good performances all around, and I'd highly recommend it.<br><br>10/10 stars. Pure, solid entertainment.","user":"Chromium_5","rank":[136,155]},{"title":"Rock hard","rating":8,"date":"2 June 2004","review":"Alcatraz was America's toughest high-security prison, and has been much beloved by film-makers since it closed and became available as a set. Don Siegel's film is based on the true story of an attempted escape. Some aspects are clichéd (the psychopathic homosexual, for example) and by concentrating on the brutality of the regime the film gets you on the side of the escapees at the price of suggesting that prison break-outs are actually a good thing. But in general, this is a successful film that has aged well, with no sickly sentiment or overdone melodrama; by concentrating on the unadorned details of the story, the film allows each one to count. A strong, uncompromising movie, gripping even if you know the ending before it starts.","user":"paul2001sw-1","rank":[69,83]}]