[{"title":"Solid sequel in \"Back to the Future\" trilogy dosen't deserve the hate my favorite time travel movie","rating":8,"date":"4 March 2018","review":"Back to the Future Part II is an solid sequel to the first one which Back to the Future (1985) is a masterpiece. This is a fun travel science fiction comedy in the trilogy. It deals with paradox past traveling. From traveling with Time machine Car \"DeLorean\" in to the future and back to the past again. This film is a 8 in my opinion it doesn't deserve the hate, like mostly viewers stated. I love \"Back to the Future\" trilogy it is one of my all time favorite trilogy's of all time. I grew up with this trilogy I have seen the first one on VHS as a kid. Years later I have seen the sequels on TV. I love this movie to death and it is my third favorite film in the trilogy. Don't get me wrong but I have enjoyed Back to the Future Part III more than part II and think the third film is the most underrated film in the trilogy and unappreciated. This film does have the comedy and the humor in it.<br><br>I Love, Love this film so so so much, it is a great direction from Robert Zemeckis and brilliant writing from Bob Gale. Back to the Future Part II was nominated for an Oscar. I really did missed 21st October 2015 an important event date from this film in the trilogy that reached 30 year anniversary in the year 2015 when the trilogy come out respectfully on a Blu-ray. <br><br>Back to the Future Part II (1989)<br><br>The story continues when Doctor Emmett Brown, Marty McFly and Jennifer traveling in to the future 2015 to fix Marty's and Jennifer's future in which Marty has to save his son from been jailed. His arch enemy Biff Tannen steals Marty's idea and steal's Gray's Sports Almanac only to travel back in to the past November 12, 1955 to change the alternative time line paradox in which Biff creates the timeline in the year 1985. The same alternative timeline and paradox was also used in The Flash Season 3 Episode 1 Flashpoint. <br><br>Than the story sets Marty and Doc on the hunt for a Gray's Sports almanac from Biff in the year 1955 in which Biff is a teenager. The chase and a race on the road in which Marty is in Biff's car try's to get the Almanac back and Biff crashes with his car in the truck of manure is my favorite scene in the film. The Hoverboard scene in the future in which Griff chases Marty in the year 2015 and Marty outsmart them in which Griff and his gang lands in the court in the opening scene is also my favorite scene in the film.<br><br>Michael J. Fox and Christopher Lloyd are excellent in their performances. Michael J. Fox plays more than just one character, he even played Marlene McFly future daughter of Marty.<br><br>Things I really didn't like about the film and that is why it hurts the film: the dark future created I didn't liked. I hated Thomas F. Wilson's character Biff trough in tier film he was irritating awful person. I didn't like the death of George McFly. I didn't like Biff marrying Loraine. Half of the film was more focusing on Biff than Doc and Marty I hated that idea. I did not like the filmmakers repeat the first movie again in the year 1955. They copied the first film I did not like that idea so sorry. I still hate Biff Tannen in this movie so damn much! I did not like the ending in which Doc was hit by a lightning with \"DeLorean\" and sent back 100 year in the past. The film didn't had a satisfying ending or a happy ending that we wished for. I didn't like older Marty McFly he acted like he is stupid in the movie that is why I prefer III over this film more. Claudia Wells and Crispin Glover did not return to reprise their roles. I am surprised that actress Elisabeth Shue accept the role of Jennifer but she declined the role for The Karate Kid Part II weird. <br><br>This film get's 8 \"Back to the Future\" is my favorite trilogy of all time and I love this movie to death. I hope they don't make Part IV because it will be disaster. It is rated PG for language throughout, some suggestive content and violence. I miss movies like this they don't make em' like this anymore.","user":"ivo-cobra8","rank":[90,105]},{"title":"From the present, to the future, back to the present, then back to the past. One great ride!","rating":10,"date":"21 March 2004","review":"When Back to The Future was initially conceived, director and writer Robert Zemeckis and writer Bob Gale had no idea how much notoriety it would eventually achieve, nor of the big box office records it would break.  They were happy just to see their project come to fruition. When they wrote the original film, the ending they had written was supposed to be the end of it. Because of it's success, however, and Hollywood being Hollywood, there had to be the inevitable sequels.  The problem was that with the original ending, they had painted themselves into a corner as to where they could go with the sequel.  What they finally came up with in Part II, is a film that is every bit as whimsical as the original, yet moves along at a pace that will leave you breathless.<br><br> For part II the cast is pretty much intact from the original film.  The exceptions are Crispin Glover as George McFly has been replaced by Jeffrey Weisman and Claudia Wells has been replaced by Elizabeth Shue as Marty's girlfriend Jennifer.  George McFly's role in the sequel is more talked about by other characters than his actual on screen time, and Jennifer's time on screen is quick and brief also (although she has one great scene that takes place in the future)so neither casting change is of any consequence.<br><br> The original film dealt with how Marty had threatened his own existence because of changes he had accidentally initiated in the year 1955.  For Part II, we learn what happens when the interference is of a much larger scale and consequence. As you recall, the original film ended with Doc Brown(Christopher Lloyd)whisking Marty (Michael J. Fox)and Jennifer away with him to the year 2015 to straighten out their kids.  For all his harping about messing with historical events, Doc is not above initiating a bit of interference himself.  In their attempt to rescue Marty's future offspring, an aged but still obnoxious Biff Tannen (Thomas F. Wilson), steals the Delorean to transport himself into the past and to bestow upon himself a Sports Almanac book that contains the results of sporting events for years to come.  Shortly thereafter, Doc and Marty return to 1985, only to find that not only is Hill Valley not what it used to be, their own lives are in pretty sad shape and far different than what they had been before.  And the changes aren't good ones, or as Doc puts it \"I can't imagine Hell being much worse.\"<br><br> What makes the Back To The Future series so terrific, is that Zemeckis and Gale took the time travel concept, applied a little originality to it, then let their imaginations run wild. In BTTFII, we get a story that moves along like a runaway freight train.  Not content to give us what the year 2015 may be truly like, since making such predictions are usually wrong anyway, they decide to let it all hang loose and just have fun with it.  There are holographic theaters, Cafe 80's shops, antique stores that sell dustbusters and other things, skateboards that hover, paying for cab rides with thumbprints, etc. etc.  Yet, for all the glossy, multi-colored stores and goofy concepts, we still recognize it as the same old Hill Valley. Something else Zemeckis and Gale do is to take some events from the first film, and replay them in 2015 Hill Valley.  Usually, things like this would be seen as the lack of an idea, but in this case its simply Zemeckis having a little fun and letting us in on it.  It works perfectly.<br><br> Likewise, the alternative version of 1985 Hill Valley is an exercise in how far one's imagination can go.  Instead of a quaint peaceful town and suburbs, Zemeckis and Gale do everything in their power to give us the equivalent of an opposite. To go into too much detail here would undermine your own viewing experience and give away a bit too much of the plot.<br><br> Then to add fuel to the fire, we once again revisit Hill Valley in 1955, where things really go berserk what with two Marty's and two Docs inhabiting the same year.  Zemeckis does a great job of cutting new scenes into footage from the original film with different angles and different perspectives of previous seen activities.<br><br> As for the cast, Fox and Lloyd keep their characters of Marty and Doc on the same entertaining level as before.  Fox is also given the chore of playing his nerdy son of the future, Marty as a middle aged man and even his daughter of the future.  He is pretty much successful except I do think playing his daughter was a bit much.  Lea Thompson, again has the difficult chore of bringing Lorraine Mcfly to us in three different characterizations, and as before handles it admirably.  Her 1955 Lorraine will always be her most memorable characterization in these films, but the others are equally well done.  As for Thomas F. Wilson as Biff, Biff is biff, no matter how old, how young, or how powerful he may be, and his consistence of performance is also noteworthy.<br><br> Some have complained about being able to follow Zemeckis and Gale's storyline.  If you have seen the first film, you'll have no trouble in that regard.  I sure didn't, and for me it was one heck of a comedic thrill ride from beginning to end.  If you don't have fun watching Back To The Part II, then the only thing I can think of is that your as much of a curmudgeon as old Biff from 2015.  It's not often that a sequel can live up to it's predecessor, but when it does, and introduces some originality along the way you get my grade, which for Back To The Future is an A.","user":"clydestuff","rank":[86,103]},{"title":"Best time travel adventure!","rating":10,"date":"29 March 2005","review":"As a huge BTTF fan, I have to admit that this is the best BTTF flick ever made. It has all the ingredients to please all audience of any age. I personally like the 50's stuff in it, but I am also a huge 80's fan (the present in the movie) and the future is just hilarious. Of course...it has been almost two decades since this movie came out, and now we know that the future that is shown in BTTF 2 is a bit funny, but hey...do you remember Total Recall? Now THAT is also a future that would never see daylight, but at least the BTTF 2 future is amusing.<br><br>I have seen this movie over a dozen times, and I tried to find things that don't match, movie mistakes etc. (yes..I am a pain in the ..)but the thing is, I KNOW that there are mistakes (like reflections in window glass) but this movie keeps your mind drifting away, enchanted by the great story and great moments. Of course Spielberg never intended to have more ingredients then the past (50's), the present and the future. But almost 20 years later...it is also a (another) great movie to see what the 80's were all about. (so another great moment for people of my age, born in the late 70's)<br><br>I recommend this movie to ANYONE, but watch BTTF(the first movie) first, because you can't watch part 2 or 3 without watching it in the right sequence.<br><br>Have fun! (I recommend the trilogy box, you can purchase it anywhere)","user":"b-de-water","rank":[84,110]}]