[{"title":"A Definite \"Thumbs\" Up.","rating":8,"date":"28 May 2005","review":"Thanks to modern technology, another film noir classic has escaped from Hollywood's vault of too-often-overlooked or forgotten films. Albeit a minor classic, \"The Hitch-Hiker,\" directed by Ida Lupino, is a taut drama notable for it's realism, as well as a haunting performance by William Talman.<br><br>Reputedly based on a true incident (\"Penned from the headlines\"), the story traces the movements of a hitch-hiker, Emmett Myers (Talman), who repays his highway hosts by robbing and murdering them. Initially, we are shown mere glimpses of Myers and his victims, which successfully sets the stage for the introduction of Roy Collins (Edmond O'Brien) and Gilbert Bowen (Frank Lovejoy), two friends on their way to a fishing trip in Mexico, when, unawares, they pick up Myers.<br><br>What follows is a realistic depiction of what most likely would transpire when ordinary people are suddenly faced with such extraordinary circumstances. And the strength of the film lies in the fact that when Collins and Bowen are kidnapped, held at gunpoint and forced to do the bidding of their captor, they react and behave in a manner that is both consistent with their current state of affairs and believable. There are no feigned heroics or superhuman contrivances that allow the two captives to effect an escape; instead, the story plays out in much the way one would, in reality, expect in such a situation, which, when extrapolated, effectively drives home the true horror of Collin's and Bowen's circumstance.<br><br>The lion's share of the credit for the success of this film must go to director Ida Lupino, whose almost documentary-style approach to the story lends it the necessary grit and intensity. She scores double points, as well, for not only delivering a memorable film, but doing so at a time in which few women were afforded the opportunity to perform at such a level behind the camera. Lupino's success no doubt helped pave the way for the likes of Jane Campion, Jodie Foster, Gillian Armstrong, Allison Anders and a host of other women who have since proved that gender alone does not equate to excellence and ability in the director's chair.<br><br>In arguably his best performance, character actor William Talman turns in a memorable performance as the sociopath, Myers. Forget your Freddys and Jasons; Talman's portrayal creates the kind of character that nightmares are really made of. Myers is a guy you could pass on the street, or-- yes, even give a lift to if you saw him with his thumb out on the highway-- without giving him a second thought. And that's what makes him so scary; his disguise is that he doesn't have a disguise, and it's so much more effective than having a hockey mask or hands with steel fingers could ever be.<br><br>O'Brien and Lovejoy also turn in credible performances, creating characters who, like Talman's Myers, are real. Watching them, you believe that Collins is, indeed, an auto mechanic, and Bowen a draftsman; two friends off together to do some fishing.<br><br>The supporting cast includes Jose Torvay (Captain Alvarado); Jean Del Val (Inspector General); Clark Howat (Government Agent); and Natividad Vacio (Jose). The 71 minute running time is perfect for this film; rather than resort to superfluous filler, Lupino stays on task without ever straying, and in the end makes \"The Hitch-Hiker\" a ride that will leave you wondering what you would do in a like situation, and hoping that you'll never have to find out. It's the magic of the movies.","user":"jhclues","rank":[79,86]},{"title":"Fascinating thriller with a terrific performance from William Talman.","rating":25,"date":"25 August 2003","review":"Supposedly the only Film Noir directed by a woman (Ida Lupino of 'High Sierra' and 'On Dangerous Ground'), 'The Hitch-Hiker' is a fascinating thriller that holds your attention from start to finish. Edmond O'Brien ('D.O.A.') and Frank Lovejoy ('in A Lonely Place') play two buddies on a road trip who pick up a hitch-hiker (William Talman, best remembered as Hamilton Berger on the old \"Perry Mason\" TV show). BIG MISTAKE! He is actually notorious psycho killer Emmett Myers. Talman gives a terrific performance as Myers, a real nasty piece of work with a bum eye so you never know if he's asleep or awake. He holds the men hostage, bullies and provokes them, even uses them as target practice. We've seen many similar plots over the years but I thought this was a fresh and unpredictable. Lupino's direction really suits the material, the tension builds throughout, and Talman is unforgettable. If you like thrillers track this one down. Highly recommended.","user":"Infofreak","rank":[51,56]},{"title":"Gem of a B-film-- brutal & creepy","rating":16,"date":"16 September 2000","review":"THE HITCH-HIKER is based on a true story, which makes it all the more creepy. Well-directed by Ida Lupino; it was powerful without a lotta trappings. Simple story, inexpensive exterior shooting, and tight acting. Starred William Talman (the bungling D.A. of Perry Mason), Frank Lovejoy, and... Edmund O'Brien.<br><br>Never was much a fan of the early O'Brien-- he doesn't pull off the toughness he tries for, so I was on-guard for some over-acting from him. No worries this time, for the most part. But TALMAN was the great surprise! Wow! What happened to his career after this film?? He was terrific in this role.<br><br>His villain wasn't one of those super-intelligent, epitome-of-evil psychos. He's not an exotic, like Hannibal Lecter. Nor did Talman act like one of those oh-so-polite sorts. (As if it makes them more menacing to have nice manners when they threaten you. Think \"Goldfinger\".)<br><br>No, Talman was effective as a more true-to-life sort.. the kind that seems more menacing to me as a viewer, because you really might run into this bastard.  The only politeness he showed to his victims was to offer them a cigarette. And when he was feeling pleased with himself for nearing the end of his escape, he bought them a beer.<br><br>Talman's character was a pushy sadist, but never tried to spice it up by pretending to be nice. His ugly game of target practice was evil-- he held one guy at gunpoint and made him shoot a rifle at his friend, who was forced to hold up a tin can. (I don't think this is too much of a spoiler.)<br><br>He wasn't a Brainiac, just had a talent for staying in control, keeping a never-closing vigilante eye (his creepy-looking right eye wouldn't close when he slept, so his hostages never knew when to try anything). He invested all his energy into avoiding capture.<br><br>Lovejoy and O'Brien worked well together as the Normal Joes who happened to pick up the wrong guy.  Again, because they're more true-to-life, you can identify with them better than a hard-boiled detective.<br><br>Realistic location shooting also makes this simple story more powerful. Lupino deserves credit as a film-maker, and I'm glad she's being recognized more and more.","user":"IndieVisibleMan","rank":[31,33]}]