[{"title":"Orca has a particular charm to it that is often overlooked","rating":3,"date":"3 September 1999","review":"Most of the reviews about Orca that I have seen say that, essentially, it belongs in the garbage can, with an unrealistic plot and terrible acting. Yet I must confess I quite enjoyed this film.  It's been a number of years since I saw it, and I've actually forgotten most of the violent scenes. Probably what held much of the attraction for me was the theme of moral uncertainty which it maintains until the very end.<br><br>This is a much more humanely stimulating movie than Jaws.  In this film there are no real bad guys, either human or otherwise, and we feel compelled to feel pity for both the orca, and the character Nolan.<br><br>The \"We are One\" song, the music of which features throughout the movie, is one of the most beautiful songs I have ever heard, and the scenes which show the orcas slowly swimming together to this music are quite entrancing.<br><br>The chilling scene in which the female orca aborts her unborn foetus is, of course, unforgettable, and it is this scene that begins the tragic theme of the story.  This is a different movie altogether from Jaws, and the dramatically different endings of the two films perhaps show this difference most of all.<br><br>Watch Orca - you won't regret it.","user":"Fiver-7","rank":[27,32]},{"title":"Grim? Perhaps not. Entertaining? Absolutely.","rating":8,"date":"26 October 2002","review":"I've seen this movie at least a dozen times since it's release.  The first time I saw it, I was very young, perhaps 8 or 9, and while I found it upsetting and sad at parts, as an adult I can look back and say it speaks so much more to me than say, \"Free Willy.\"  The movie follows the events in a fisherman's life following the capture of a killer whale.  On the surface, it can appear grim and gory, but underneath there is a stirring tale about a man who has lost everything he held dear, has given up all feeling because of past events and leads an almost hostile towards life existence and then gradually comes to understand that because he was hurt, does not give him an excuse not to feel.  Yes, the premise does dabble in the fantasy world, however the point isn't whether this could happen but the growth of the central character. Not once have I been able to watch this movie and not been moved by it.","user":"Maeve72","rank":[42,53]},{"title":"Harrowing but powerful.","rating":6,"date":"14 September 2006","review":"A somewhat cheesy tale of man versus beast. Leave your sad pills alone, because this film will do it for you. The photography is perplexing: at times we see troubling \"cheap\" shots detailing bloody scenes and wounded creatures (reminder: \"Jaws\" was released two years earlier) but the overall cinematography is captured quite nicely, showing the vast, cold maritime coastal region that provides the both the setting and the mood. The disturbing theme song is unforgettable, as it mimics some of the sad, vocal tones emitted by the orcas themselves. The story line is somewhat juvenile (think \"Road Runner\" cartoons) but where the film grabs us is that rarely has a \"man versus beast\" tale been told with such tragic emotion. Most of us are aware of the high intellect of the killer whale, but very few have dared to show their emotional side. Sad, gripping, and difficult to watch, this film's reward is to become more acquainted with these amazing sea mammals.","user":"lddobbi","rank":[23,28]}]