[{"title":"A stunning thriller from the master of suspense","rating":8,"date":"16 September 2004","review":"Alfred Hitchcock has made many brilliant thrillers, and many of them have gone on to be hailed as some of the greatest films of all time. One film that tends to get somewhat lost under the Vertigo's and the Psycho's is this film; Strangers on a Train, the most compelling film that Hitchcock ever made. The story follows Guy Haines, a tennis player and a man soon to be wed to the Senator's daughter, if he can get a divorce from his current wife. One day, on the way to see his wife, he meets the mentally unstable Bruno Anthony aboard a train and soon gets drawn into a murder plot that he can neither stop nor stall; and one that could ultimately cost him his life.<br><br>The conversation aboard the train between Bruno and Guy is one of the cinema's most intriguing and thought provoking of all time. What if two people \"swapped\" murders, thus resolving themselves of all suspicion of the crime, and rendering their motive irrelevant? Could this truly be the perfect murder? What makes this film all the more frightening is that the events that Guy is lead into could happen to any, normal everyday person. Everyone has someone they'd like to get rid of, so what if you met an insane man aboard a train that does your murder for you and then forces you to do his? The chances of it happening are unlikely, but it's the idea that anyone could be a murderer that is central to the message of Strangers on a Train; and in this situation, anyone could. <br><br>Is there any actor on earth that could have portrayed the character of Bruno Anthony any better than Robert Walker? The man was simply born for the part. He manages to capture just the right mood for his character and absolutely commands every scene he is in. The character of Bruno is a madman, but he's not a lunatic; he's a calculating, conniving human being and Robert Walker makes the character believable. His performance is extremely malevolent, and yet understated enough to keep the character firmly within the realms of reality. Unfortunately, Robert Walker died just one year after the release of Strangers on a Train, and I believe that is a great loss to cinema. Nobody in the cast shines as much as Walker does, but worth mentioning is his co-star Farley Granger. Granger never really impresses that much, but his performance is good enough and he holds his own against Walker. Also notable about his performance is that he portrays his character as a very normal person; and that is how it should be. Ruth Roman is Guy's wife to be. She isn't really in the film enough to make a lasting impression, but she makes the best of what she has. Alfred Hitchcock's daughter, Patricia, takes the final role of the four central roles as Barbara, the sister of Guy's fiancé. She is suitably lovely in this role, and she tends to steal a lot of the scenes that she is in.<br><br>Alfred Hitchcock's direction is always sublime, and it is very much so in this film. There is one shot in particular, that sees the murder of the film being committed in the reflection of a pair of sunglasses. This is an absolutely brilliant shot, and one that creates a great atmosphere for the scene. Hitchcock's direction is moody throughout, and very much complies with the film noir style. The climax to the film is both spectacular and exciting, and I don't think that anyone but Hitchcock could have pulled it off to the great effect that it was shown in this film. It's truly overblown, and out of turn from the rest of the movie; but it works. There is a reason that Hitchcock is often cited as the greatest director of all time, and the reason for that is that he doesn't only use the script to tell the film's story, but he also uses to camera to do so as well. Strangers on a Train is one of the greatest thrillers ever made. Its story is both intriguing and thought provoking, and is sure to delight any fan of cinema. A masterpiece.","user":"The_Void","rank":[106,140]},{"title":"Magnificent absurdist fantasy.","rating":10,"date":"29 September 1999","review":"One would have expected Hitchcock's return to major studio filmmaking to err on the side of chastened caution.  Surely few expected his most riotous, unrestrained film, a gleeful melange of vicious black comedy, exciting suspense, mocking manipulation, and astonishing flights of fancy.  But that is precisely what they got: STRANGERS ON A TRAIN.<br><br>What is remarkable is how much Bruno's transgression disrupts the world of the film.  Much has been made of the masterly crosscutting motif, but its immediate effect is to completely obstruct the straight line of progress Guy is making of his life, and hence the society he represents or is eager to join.  Guy is the archetypal American, the working-class boy made good, moving in influential circles, athletic, successful, handsome.  Bruno is his destructive opposite, gay, decadent, 'European' (he lives off his father, in a Big House, and just lounges about dreaming of murder).  Bruno's life is one of repetition, circularity, whereas Guy moves straight ahead.  It is Bruno's achievement to move Guy into his realm (represented by the merry-go-round) and force HIM to transgress (break the law, hope for murder (Bruno's)).<br><br>Bruno is quite literally fighting patriarchy.  All the authority figures in the film are criticised - Bruno's father, a man whose brutality we get a glimpse of, but the true horror of which is constantly alluded to in the film (especially in Aunt Clara's paintings - that incredibly intense negative energy must come from somewhere); Anna's incredibly Machiavellian, self-serving father; the insensitive judge who thinks nothing of lunching after an execution; the tennis commentator whose smugly authorative comments are always mistaken.  Far from being the mother-hater of legend, Hitch, as Robin Wood perceived, is deeply hostile to fathers and patriarchy.<br><br>Bruno's transgression turns the world topsy-turvy.  This is Hitch's most surreal film.  Whenever Guy is in his plot, he is filmed straight, with conventionally romantic music.  But whenever Bruno intrudes, the atmosphere becomes carnivalesque, bizarre, much more fun.  This is Hitch's first truly American film, revelling in the primitive detritus of Americana.  Grown men puncture little boys' balloons, or try to throw them off merry-go-rounds. Distinguished professors of mathematics sing about goats on trains.  Elderly society matrons are strangled at elegant soirees.  Washington is filmed like a series of spare lines in a vast desert under a huge sky, like a haunting Dali painting.  There is one of the greatest, and funniest, scenes in all cinema when we see a motionless, smiling Bruno in a sea of turning heads at a tennis match, an image worthy of Magritte.  Just look at any scene with Bruno in it, and watch it derail into the bizarre.<br><br>Phalluses abound in the most ridiculous permutations - check all those balloons (Hitch had obviously just seen THE THIRD MAN) - as well as in more staid environs: Washington will never look the same again.  STRANGERS is also, VERTIGO notwithstanding, Hitch's most overtly sexual film - as well as the phalluses, there is the sustained homoeroticism, the remarkable play with 'riding' horses; the gobsmacking fellatio joke when Hitch's daughter spills powder over the policeman.<br><br>And yet Hitch doesn't stint on good old suspense.  In the very proper endeavour to show what a great artist he was, critics tend to overlook what made him famous in the first place.  Much has been made of Bruno as a prototype of Norman Bates, and Hitch plays merry havoc on audience identification, willing Bruno into murder.  There is a hilariously painful sequence where Bruno loses the lighter with which he intends to frame Guy down a drain.  The gasps of tension and sighs of relief on the part of the audience I was a part of in support of an insane murderer is inherently funny, slightly disturbing, and highly revealing about our true reactions to conformity and success.  And Hitch milks it with callous glee - listen to the mocking music and exagerrated compositions, and kick yourself for taking it all so seriously.<br><br>STRANGERS is one of Hitch's five best films, and therefore one of the greatest things in cinema.  The dialogue is so strange and brilliant, I can't believe it wasn't written by Chandler.  Patricia Hitchcock is a wonderful imp, standing in for her cheeky father as she taunts Guy.  The fairground finale is a remarkable, dizzying fusion of exciting, tense set-piece, black comedy and symbolic site.  If Bruno's final words condemn him to hell (according to the Catholic precepts Hitch is supposed to embody: compare with a similar ending in THE KILLERS), we applaud his integrity, infinitely preferable to Guy's debased serving of self.","user":"alice liddell","rank":[172,234]},{"title":"One of Hitchcock's finest achievements","rating":15,"date":"15 August 2006","review":"\"Strangers on a Train\" is a brilliant example of what Hitchcock could do best, continually develop his plot and characters in an atmosphere both creepy and humorous. The film has great dialogue, superb characters, good acting, and naturally superb direction from the master of suspense who is truly at his best here. Robert Walker's Bruno Anthony is a character few will forget; he is creepy, psychopathic, and as M. Night Shyamalan says on one of the DVD's special features it is the fact that he has moral standards, however unconventional and disturbed they may be, that makes him such a dangerous man. <br><br>Strangers is a truly involving film, one that takes you on a ride you won't forget anytime soon, it has one of the best examples of buildup you could find on film, and as soon as it ends the film takes you on a journey that entertains and terrifies and even makes you laugh. This is a truly brilliant example of film-making, every shot is drenched in suspense, every cut is masterful, every detail important, every second exciting, it never lets go till the very end, and what an ending that is, a delicious bit of humor that is perfectly in tone with the rest of this delightful masterpiece.<br><br>Some have criticized Farley Granger's performance as Guy Haines, but it really is quite perfect; he delivered all his lines well and makes us feel honestly sympathetic towards him. Robert Walker is simply genius as Bruno Anthony, a great character that wouldn't have been nearly as memorable without Robert Walker's devilishly evil portrayal of him. The supporting cast are good, Ruth Roman, Leo G. Carroll, Kasey Rogers, Howard St. John and Patricia Hitchcock all deliver good performances that enhance what was already a good film and make it a great film. Alfred Hitchcock's direction is, as always, sublime.<br><br>What makes \"Strangers\" so good is the simple plot. It isn't a complicated story, two strangers meet on a train, and one comes up with a crazy plot: \"You do my murder, I do yours.\" One takes it as a joke and shrugs it off, but the other takes himself seriously and goes on to commit the murder he offered to, getting the 'good guy' into huge trouble. The script is adapted superbly well by Whitfield Cook from a novel by Patricia Highsmith.<br><br>This is really one of Hitchcock's most interesting films from a technical perspective while also providing more than enough laughs, suspense, and thrills to keep just about anybody engaged.<br><br>10/10","user":"ametaphysicalshark","rank":[48,61]}]