[{"title":"Charming romantic comedy...with time travel weaknesses...","rating":6,"date":"6 March 2004","review":"If you can accept the totally ridiculous premise of KATE AND LEOPOLD and enjoy romantic fantasies of this sort, you'll find yourself drawn into the plot because of the very charismatic HUGH JACKMAN. He is the main reason for watching and carries the film on his sturdy shoulders, so adept is he at being a \"knight in shining armor\".<br><br>As for MEG RYAN, she is giving her usual Meg Ryan schtick--a sort of slightly brighter version of Goldie Hawn--but here it doesn't matter because Jackman manages to steal every scene he's in.  BRECKIN MEYER is excellent as her boorish brother who learns a few things from his 18th Century friend about manners and etiquette. But it's the time travel aspect of the story that is its weakest link.<br><br>Highly recommended as a romantic comedy that owes much of its charm to the performance of its leading man--an actor of remarkable skill whose hunky presence dominates much of the movie.<br><br>It's the sort of romantic fluff that would have starred JEAN ARTHUR and GARY COOPER had it been made in the '30s. The New York location photography is excellent.","user":"Doylenf","rank":[64,75]},{"title":"Fine movie...could have been better though","rating":8,"date":"16 February 2005","review":"I'm a fan of Meg Ryan and think that she's one of the best there is in Hollywood right now. Yet, I believe that it was HUGH JACKMAN who stole the show in this movie. He is so charming and charismatic that you can hardly resist falling head over heels for him! Leopold is a duke from the 18th century who mistakenly lands up in the 21st century one day...and is obviously bewildered with everything he sees. He stays with the man who got him there at the first place, Stuart,Kate's (Meg Ryan) ex-boyfriend. Predictably, Leopold falls in love with Kate and she retaliates. Yet, he has to go back where he came from, and that poses a problem for their relationship. It's a cute movie, yet, I couldn't agree with the ending, though it was predictable. I just couldn't see eye to eye with the reasoning they gave us for the step Kate took. Okay movie...great if you have nothing else to do and like chick-flicks. That's exactly the reason I watched it. I liked it..but I've seen better by Meg Ryan.","user":"tnkcool","rank":[41,48]},{"title":"Cinematography and writing drew me in","rating":8,"date":"26 November 2002","review":"Honestly, my wife rented this and I wasn't planning on watching - but the luscious cinematography and some interesting writing drew me in.  Hugh Jackman sealed the deal with his totally straight portrayal - this guy's earning power can only go up!  Looking for some fluff and a laugh? It's better than most of the romantic comedy crap out there.  Not a waste of time if you are in the mood to have something wash over you.","user":"gorwell777","rank":[50,61]}]