[{"title":"Decent comedy","rating":7,"date":"15 September 2005","review":"Arnie plays a bad ass cop who disguises himself as a kindergarten teacher in order to track down the ex-wife of a drug sleazeball to finally lock him up.<br><br>Arnie in a comedy. Well, it worked in Twins so why not do it again? Actually this time around he fares very well, balancing quite nicely his tough guy side (which we all love) and also his comedic side. His interaction with the children are hilarious and somewhat touching at times. Supporting cast do a nice job, particularly Reed as Arnie's partner and Hunt as his kindergarten supervisor.<br><br>Many critics found the level of violence to be a little excessive considering it's listed as mainly a comedy, but I don't agree. Sure, there's some violence near the end, but it's relatively toned down. I'd say this is good family fun.","user":"ODDBear","rank":[30,32]},{"title":"Wasn't expecting it to work, but it did...","rating":8,"date":"5 March 2011","review":"Kindergarten Cop was a surprisingly good film. I was not expecting it to work, and it worked so much better than I expected it to. Kindergarten Cop is a little overlong and the villains are perhaps a little too pantomime. However, the film does look lovely, and the score and soundtrack gives it its heart-warming sentiment.<br><br>The script also worked. It was funny, it was poignant and it was well-meaning, while there is also a heart-warming story, good direction and pacing and the action while sometimes intense is well-handled.<br><br>I was very surprised by the acting. Kindergarten Cop is not Arnold Schwarznegger's best film, but it does show that he can do comedy, and here he does do it well. He is suitably low-key and avoids being wooden as well. Penelope Ann Miller gives good support as well, and the chemistry between the two is convincing without taking over the film too much. The characters could have easily been stereotypical and unlikeable, but they aren't, instead they have a certain warmth to them, and this is including the kids.<br><br>Overall, not a comedy classic, but it works far better than it should have done. 8/10 Bethany Cox","user":"TheLittleSongbird","rank":[13,13]},{"title":"Arnie takes on comedy and wins!","rating":10,"date":"17 June 2006","review":"Kindergarten Cop is a great film. It contains some of Schwarzenegger's best work showcasing his innate likability and comic timing in a piece which allows them to accentuate his more often seen action star persona. The lightening of this persona works in the film allowing us to follow Arnie's Kimble into what could easily be a weak and twee concept. Fortunately Arnie doesn't lose his balls in the transition and Reitman directs the action very well as well as showing the same skill in comedy as he did with previous hits such as Ghost Busters. Ricky Tyson makes a brilliant villain not in his being an equal to Schwarzenegger but in his portraying a drug dealer with a grudge as a three dimensional character who will stop at nothing to get his son back. Schwarzeneeger also gets to get have some romance and although he at times looks ready to kill his very beautiful love interest (Penelope Ann Miller) he manages to be a very charming lead who the audience are helpless but to root for. The screenplay by Salem, Harris and Weingrod is both touching and funny with memorable lines such as the deadpan interrogation scene \"Who is your daddy and what does he do?\". The kids also are great featuring a diverse group who almost steal the show with lines such as \"Boy's have a penis, girl's have a vagina\". The film also contains some classic Arnie one liners such his \"I'm the party pooper\" kiss off before shooting down some low lives. Such lines refer to Arnie's tough guy persona and shows that he is not afraid to poke fun at himself. The difference in Kindgarten Cop is that he is playing a vulnerable human character and the audience does not want him to be hurt not just because he is the hero but because they like him. The score too is exceptional being appropriately sweet and upbeat as well at sometimes hitting darker more sinister tones. They truly don't make them like this anymore, just see awful modern examples such as Vin Diesel's The Pacifer for proof or rather don't see them, watch Kindergarten Cop again and see a great action star and comedy director team up to make a most enjoyable work.","user":"ut1am","rank":[49,58]}]