[{"title":"good family comedy","rating":29,"date":"29 August 1999","review":"Keatons first lead role after his successful \"Night Shift\" debut in 82 was this family comedy about a laid off auto worker who takes over at home as his wife (Garr) goes back to work.  It is a bit unbelievable that Keaton, after years of having a family, would not know how to operate the washing machine or vaccuum cleaner.  But he was so perfect at being silly I had to let it slide.  Its a little like a fish outta water story as he has to go to the unfamiliar market, do numerous chores around the house and learn the right way to drop off the kids at school in the morning (\"South to drop off, moron!\").  Plenty of good moments from a comedic and dramatic standpoint, as Keaton and Garr deal with her being away from home so much.  Mull becomes a foil for her as her new boss, having a case of the major league hots for his star employee.  Im sure Keaton will always be remembered as Batman, but this will always be my fave of his in one of John Hughes (\"The Breakfast Club,\" \"Ferris Buellers Day Off\") more unknown works.  Good, harmless fun.","user":"mcfly-31","rank":[17,20]},{"title":"One of my family's all-time favorities","rating":13,"date":"13 August 2004","review":"Of all comedies that I have seen in my 23 years, \"Mr. Mom\" has got to be one of the best and funniest of them all. I have been a fan of this movie since I was about 4 years old! To be exact, I think I taped three different copies on cable and network until I bought it on video and finally on DVD! <br><br>\nMichael Keaton plays Jack Butler, who, along with several co-workers, loses his job at an auto plant due to layoffs. To make ends meet, wife Caroline (Teri Garr) gets a job at an advertising agency, and he stays home with the kids. Easy, right? Absolutely not! From out of control vacuum cleaners, washing machines and toasters, to the neighborhood ladies, including Joan (Ann Jillian), who has her eye on Jack, running the household is horrendous. On top of this, Caroline is climbing the corporate ladder. But success comes with a price in the form of long hours, travel, and persistence from boss Ron (Martin Mull), who sets his sights on Caroline. Can Jack and Caroline keep the family together despite these woes?<br><br>It is my belief that \"Mr. Mom\" is one of the best comedies of all time, and features Michael Keaton and Teri Garr at their best. People of all ages should see this movie. It shows how successful familial role revearsals have the power to be, and demonstrates how to challenge previous stereotypes about career and family. A great film not to be missed!","user":"bppihl","rank":[21,26]},{"title":"Housekeeper by Need","rating":7,"date":"10 April 2019","review":"The family man Jack Butler (Michael Keaton) is happily married and lives with his beloved wife Caroline Butler (Teri Garr) and their children Alex, Kenny and Megan in a suburb of Detroit. Jack is an engineer that works in an automobile factory with his friends Stan (Tom Leopold) and Larry (Christopher Lloyd) and they go to the work in car pool with their boss Jinx (Jeffrey Tambor). When Jack loses his job, Caroline looks for a job and finds in the advertising agency that belongs to Ron Richardson (Martin Mull). Soon Caroline succeeds in holding an important account in the agency and climbs positions and responsibilities. Meanwhile Jack learns how hard the household chores and childcare are.<br><br>\"Mr. Mom\" is a funny 1983 film made in the period of the 1980´s recession and foresees the beginning of the decline of the Detroit´s automobile industry. The plot has many clichés but is entertaining and hilarious. Michael Keaton and Teri Garr show chemistry and have great performances. My vote is seven.<br><br>Title (Brazil): \"Dona de Casa por Acaso\" (\"Housekeeper by Chance\")","user":"claudio_carvalho","rank":[6,6]}]