[{"title":"Deborah Kerr's first starring role","rating":9,"date":"6 May 2012","review":"This 1941 British film was believed lost for decades. Where a copy was finally found I have no idea. But let's be thankful this grim and gritty film survives for 2 reasons: it's Deborah Kerr's first starring role in a film, and the chronicle of slum-life outside Manchester in 1930 is beautifully done.<br><br>Kerr plays Sally, a teenager who lives with her parents and her 17-year-old brother (Geoffrey Hibbert). The family makes do as the Depression goes along with the kids more worried about love and marriage than earning a living. But then the father's work week is cut to 3 days and the son is let go after he finishes his apprenticeship.<br><br>Kerr's idealistic boyfriend gets killed in a street riot when the government starts cutting back on unemployment checks and welfare. The son's girlfriend gets pregnant but no one can afford to feed and care for the youngsters.<br><br>As things gets worse and worse, Kerr finally gives in to a wealthy bookie (Frank Cellier) and becomes his \"housekeeper\" with a promise to get jobs for her father and brother. Kerr is shunned by the neighbors, her reputation is ruined, but the family survives.<br><br>Amid the grim surroundings are some wonderful vignettes. The son wins some money on a horse race, but instead of saving it he does as his father suggests and blows the money on a trip for him and his girl friends to Blackpool. As the father says, it'll give him something wonderful to look back on all his life.<br><br>Another subplot concerns a gaggle of old ladies, led by an agent for a pawn shop who measures out sharp advice along with shots of booze at threepence a drink. They serve as a sort of Greek Chorus, making comments on everything that happens in the neighborhood.<br><br>Kerr, at age 20, radiates warmth despite the harsh story. Hibbert is also excellent as the stoic brother. George Carney and Nary Merrall score as the hapless parents. Clifford Evans plays the doomed boy friend. Marie Ault, Marjorie Rhodes, Maire O'Neill, and Iris Vandeleur are terrific as the old ladies. The final speech, given by Merrall is a high point of the film. Joyce Howard is the pregnant girl friend.<br><br>I suppose there are many similarities between this story and Steinbeck's GRAPES OF WRATH. What struck me, however, is how the political story of the working poor in 1930s England has so many parallels to our current recession.<br><br>This is one to search for.","user":"drednm","rank":[23,24]},{"title":"Just getting by","rating":7,"date":"27 August 2013","review":"Love On The Dole was Deborah Kerr's third film and the second one where it was British social inequality. I have to say this film completely took me by surprise. Given the title I was expecting some frothy comedy about young people in love trying to make ends meet on public assistance with a happy ending. This film was anything but what I described.<br><br>Kerr starred in this coming off Major Barbara which took a less intense view of some of the same issues. Love On The Dole wasn't exactly peppered with Shavian type wit. It makes its points in a far more serious vein.<br><br>Not only did the title throw me for a loop, it is one of the most depressing pictures you'll ever see. It's about the United Kingdom during the Depression, set during the early Thirties. The Hardcastle family with father George Carney, mother Mary Merrall and grown children Deborah Kerr and Geoffrey Hibbert are just getting by. Father gets laid off and they go on the dole.<br><br>Not after a taste of the good life when Hibbert wins on a longshot bet with bookmaker Frank Cellier and he takes his girlfriend Joyce Howard to the resort in Blackpool and Kerr and her young man Clifford Evans comes along as well. Evans has all kinds of ideas that would find a home in the very left part of the Labour Party and he'd like to marry Kerr, but finances are against it.<br><br>In the end Kerr makes a critical decision to take her out of her slum neighborhood and the drab life she can look forward to. Believe me this is a decision you would never see in any American film of that era.<br><br>Love On The Dole is as drab as the area and people it portrays. But by no means is it bad. In fact it's one of the most realistic of films you'll ever see.","user":"bkoganbing","rank":[6,6]},{"title":"A look at life in North West England in the Depression","rating":8,"date":"27 March 2006","review":"Love On the Dole gives you an idea on what life was like in the North West in 1930, during the Depression. This is quite a good movie.<br><br>It focuses on a family of four where the dad works in a coal mine. The daughter works in a mill and falls in love with a factory worker, but is killed after getting involved in a fight during a demonstration. She then meets someone else and she gets him to give jobs to her dad and brother, who have both been made redundant.<br><br>This movie reminds me of early episodes of Coronation Street that I've seen, even though it was made long before that soap was first broadcast (and both long before I was born!).<br><br>The cast includes Deborah Kerr and Clifford Evans.<br><br>If you like old British movies, this is recommended.<br><br>Rating: 3 and a half stars out of 5.","user":"chris_gaskin123","rank":[14,17]}]