[{"title":"\"Put it out!\"","rating":7,"date":"11 August 2006","review":"I thought \"Son of Dracula\" was the pits when I was a kid. I simply found it slow and tedious and lacking in the kind of mesmeric atmosphere that makes the best vampire entertainment really tick. But, reviewing the film recently, I found myself enjoying it thoroughly. Go figure...<br><br>It's still no masterpiece, of course. Shoehorning Count Alucard/Dracula into a Louisiana swamp-and-plantation setting has always struck me as a weird and arbitrary move. (Though Dracula does get some interesting dialog about how he's attracted to America because it's a youthful and vigorous land.) And the human protagonists are too drippy for my tastes. The supposed hero is Frank Stanley, but his character is too thinly developed to be truly sympathetic. In fact, in an early scene he expresses a sort of jerky glee when the local voodoo woman drops dead of a heart attack, so I suppose you could say he's aggressively unsympathetic! <br><br>As usual, the vampires stand head and shoulders above the boring humans. Some people are critical of Chaney's performance, but I think he's pretty good. He's definitely a different sort of vampire from Lugosi - he's less ethereal, and more aggressively powerful. You could say he foreshadows Christopher Lee's forceful portrayal of Dracula in the 1950s-70s films from England's Hammer Studios. Louise Allbritton is even more effective in her role as the female vampire, and, in an interesting twist, she's allowed to have a set of motivations and ambitions that are totally different from Dracula's. In fact, in many ways she's the main character.<br><br>In the end, then, I think this movie stacks up pretty well to other films in the Universal series. It's not as eerie as \"Dracula\" or \"Dracula's Daughter,\" probably because it's a more modern and technologically advanced film. (The primitiveness of the early entries in the series actually makes them scarier!) But it's certainly easier to watch than its predecessors, thanks to its more glossy look, full music score and occasional nifty special effects. You gotta love that mist stuff...<br><br>On a side note, I do think that Cheney is playing Dracula's son, and not the original Dracula himself. I'm surprised to see so much controversy about that point on this site. The film is called \"Son of Dracula,\" after all, and J. Edward Bromberg identifies Alucard as a \"descendant\" of Dracula. Sure, Alucard admits to being a \"Dracula\" at one point, but not necessarily THE Dracula. As father and son, they would have the same surname - right? Oh, never mind, this is giving me a headache! <br><br>One more odd matter of continuity. Bromberg's character says at one point that Dracula was destroyed \"in the 19th century.\" But, since the Universal films had a contemporary setting, wasn't he destroyed in the 20th century in this particular universe? Just thought I'd mention that.","user":"dr_foreman","rank":[29,31]},{"title":"Dracula: Father, Son and Evil Spirit","rating":8,"date":"7 March 2003","review":"\"Son of Dracula\" (Universal, 1943), directed by Robert Siodmak, from an original story by Curtis Siodmak, the third in the cycle of Universal thrillers to center around the Dracula legend, and the first of the 1940s, ranks one of the best in the series. Its star, Lon Chaney Jr., famous for his previous role in the horror cycle as Lawrence Talbot in THE WOLF MAN (Universal, 1941), which would be followed by some more sequels throughout the 1940s, might have seemed an unlikely choice in playing the blood- sucking vampire, but on the contrary, Junior Chaney brings new life into the old vampire, sporting the usual black cape and an added touch of a mustache. Overlooking the hypnotic glassy eye stare created at best by Bela Lugosi in Dracula (Universal, 1931), he very well has proved himself as the fine horror film actor, for the time being anyway.<br><br>Unlike the previous Dracula outings (Dracula and Dracula'S DAUGHTER), which had taken place either in Transylvania or England, SON OF Dracula is set on American soil and stays there. It begins somewhere in the South where Frank Stanley (Robert Paige) and the family physician friend, Doctor Harry Brewster (Frank Craven) are at a train station awaiting for the arrival of an honored guest to Katherine Caldwell (Louise Allbritton), Count Alucard, whom she had met previously while visiting in Budapest, and is to be driven over to the Caldwell estate, but all they find are his crates and boxes (some of which consists of his native soil). That very night after a gathering in her home, Katherine's father (George Irving) mysteriously dies, with Dr. Brewster examining the body and finding two marks found on the late colonel's neck. Having noticed earlier on one of the crates that the name of Alucard spelled backwards is Dracula, Brewster decides to telephone Professor Lazio (J. Edward Bromberg), the well-known authority of the Count Dracula legend, who, after learning telling him all the details, warns Brewster that Katherine is in great danger, and intends on leaving Memphis to pay Brewster a visit to see what can be done. But it's too late. Katherine, who has a morbid fascination with death and eternal life, has already abandoned her fiancé, Frank, whom has loved her since childhood, to marry Count Alucard. They ghoulish couple obtain a honeymoon cottage in an old house at Dark Oaks. Frank follows them there to get Katherine back and threatens Alucard to leave town. Ignoring his threats, this leaves Frank to take out his revolver and shoot Alucard, but in turn he has killed Katherine, who was standing behind her husband. Finding that the bullets have gone through Alucard and into Katherine, Frank rushes out of the house to tell Dr. Brewster what has happened. Brewster comes to the cottage to find Alucard, and much to his surprise, sees Katherine very much alive. When Frank arrives with the authorities, they find Katherine dead in her coffin. After the arrival of Professor Lazio, more dark secrets are eventually revealed.<br><br>Reportedly dismissed as just another horror film upon its release, SON OF Dracula does have its share of bonuses that would have made the 1931 Dracula a visual experience had such advanced technology in special effects been available, along with some real clever touches, including the visiting count using an alias by spelling his name backwards; a very creepy musical score, compliments of Hans J. Salter, dark atmospheric background and fine effects ranging from a cloud of vapor forming into the presence of Dracula, to his transformation from bat to human figure, etc. Aside from Lon Chaney's carnation of Dracula, Louise Allbritton stands out a close second with her creepy appearance, ranging from her unusual dark and gloomy hairstyle to icy facial expressions. Even before she becomes the wife of the mysterious Count, her Katherine is already obsessed by the supernatural. Her sister, Claire, played by Evelyn Ankers is the logical half of the Caldwell sisters, and although she doesn't get to belt out a scream or two as she did in the aforementioned films, her presence adds to the story, as does J. Edward Bromberg's Professor Lazio, the authority of the Dracula legend. Bromberg's role could have very well been Professor Van Helsing (as previously played in the first two Dracula films of the 1930s), but instead, his role was inspired by him. Robert Paige, another Universal contract player, does well with his Frank Stanley performance, rising above the usual mediocre love interest-types of the day. <br><br>The supporting cast includes Samuel S. Hinds (Judge Simmons); Etta McDaniel (Sarah); Patrick Moriarty (The Sheriff); and Adeline De Walt Reynolds as Queen Zimba, the fortune telling gypsy, who after warning Katherine of her destiny and danger in marrying a corpse, she is met with a destiny of her own when encountered by a vampire bat that puts an end of her fortune telling forever. Reynold's brief bit as the fortune telling old hag is reminiscent to the kind of role Lucille LaVerne (of silent and early talkies) that made her famous. <br><br>Regardless of the misleading title, Count Alucard is never mentioned as Dracula's son, but as Count Dracula himself. SON OF Dracula, at 78 minutes, is the last really good and near original Dracula film of the 1940s. Before Bela Lugosi would do one more encore as Dracula in 1948's ABBOTT AND COSTELLO MEET FRANKENSTEIN, the Dracula character would be revived again in two quickie installments (HOUSE OF FRANKENSTEIN in 1944; HOUSE OF Dracula in 1945) with John Carradine taking over as the Count, but only minor secondary performances. <br><br>SON OF Dracula, which played on the cable television's Sci-Fi Channel, American Movie Classics, and Turner Classic Movies (TCM premiere: October 1, 2017), as well as availability on both video cassette and DVD, is recommended viewing for a dark and gloomy Halloween night, or any night for that matter, particularly for classic horror movie fans. (***)","user":"lugonian","rank":[24,27]},{"title":"Brilliant sequel to Universal's classic!","rating":8,"date":"15 August 2006","review":"Producer Carl Laemmle Jr changed history of horror cinema when he hired director Tod Browning to make the first official adaptation to Bram Stoker's classic novel \"Dracula\". This was the beginning of Universal Studios' tradition of Gothic horror that reigned triumphant through the 30s and early 40s. Robert Siodmak's \"Son of Dracula\", an alternative sequel (it doesn't make any reference to the earlier \"Dracula's Daughter\") to Browning's classic, is probably the last classic in the long line of films Universal produced about the monsters they gave life in the 30s.<br><br>\"Son of Dracula\" takes place decades after the first film, when the Dracula's story is now considered a mere myth. The story begins with the arrival of Count Alucard (Lon Chaney Jr.) to America, as the mysterious Carpathian noble has been invited to the country by Katherine 'Kay' Caldwell (Louise Allbritton), a young rich woman with a morbid interest for the supernatural. Soon Kay finds herself in love with the strange Count, something that worries her boyfriend Frank (Robert Paige) and family's friend Prof. Brewster (Frank Craven), as they suspect that there's something wrong with the strange foreigner.<br><br>Director of many B-Movies before this job, Robert Siodmak would become Universal's most important exponent of the noir style and \"Son of Dracula\" definitely forecasts his brilliant future in the genre. The film shows his great talent to combine haunting and atmospheric visuals with a great screenplay (by his brother, Curt Siodmak), and it moves away from the series' roots in German Expressionism to what would be called Film Noir, creating what seems to be the missing link between Universal's horror films and their subsequent Noir movies.<br><br>While Robert Siodmak's talent is almost unquestionable, the films owes a lot of its success to Curt Siodmak's cleverly written script. Just like in his previous \"The Wolf Man\", the story is charged with a dark pessimistic feeling of dread that gives the film a unique feeling (contrary to most Universal horrors, there's almost no comedy) that rather than making the film dull or boring it enhances its captivating charm. With clever plot twists and a good dose of suspense, Siodmak's plot also feels like horror themed hard-boiled fiction.<br><br>Many has been written about Siodmak's choice of Lon Chaney Jr. to play the Count's descendant, but while there's no doubt that he was not the best choice for the role, he wasn't really too bad in it. Sure, Chaney's appearance suits better the bulkier monsters but he gets the job done and his sad face suits the dark theme of deception the movie has. Robert Paige as the film's \"hero\" (for lack of a better word) is very effective and his usual co-star Louise Allbritton makes a great femme fatal. Frank Craven and J. Edward Bromberg are brilliant as the vampire hunters and it could be said that despite the miscast of Chaney the whole cast makes a great job.<br><br>\"Son of Dracula\" is a top-notch film considering it was conceived as a B-movie. Robert Siodmak makes great use of his resources and the film rivals the first film in quality and overall composition. One of the better sequels of the Universal Studios' films, it's main flaw may be that those expecting a typical Universal horror may be disappointed by its dark Noir theme and its pessimistic tone.<br><br>Often forgotten among the many other films in the series (not unusual considering that the first two Frankenstein sequels were masterpieces), \"Son of Dracula\" is a worthy sequel to Browning's classic and definitely superior to the previous \"Dracula's Daughter\". A must see for fans of Robert Siodmak who will find the roots of his style deep in this film. 8/10","user":"jluis1984","rank":[31,36]}]