[{"title":"Sal dances!","rating":7,"date":"22 July 2001","review":"Very much ahead of its time - this cult film vanished almost without trace after it was released, and it's very hard to find copies of it nowadays. So I consider myself fortunate to have been exposed to this sleaze-ball of a movie.<br><br>The highlight for me was in one of the final scenes where Sal Mineo and Juliet Prowse shimmy to one of the sassiest, silliest 60s dance tunes ever invented. Sal's wearing a little cut-off shirt and as he freaks out, more and more of his midriff is exposed. Sal's a long way from Rebel Without A Cause here, and looking all the better for it. This scene is worth the entrance fee alone. The title sequence is also hilariously evocative.<br><br>Full of weird characters, almost EVERYONE in this movie has a dirty little dark side waiting to be shown.","user":"bakerjp","rank":[22,22]},{"title":"A Masterpiece of Sleaze!","rating":10,"date":"16 July 2001","review":"This film is truly a work of art of the highest magnitude and no, I am not kidding. Shot in glorious, high-contrast black-and-white, it reeks of exploitation from the note of the cheesy theme song all the way through the strobe-cut ending and every horn-blaring, high-heeling, hip-grinding moment in between. Sal Mineo plays a busboy obsessed with aspiring actress/club DJ Juliet Prowse (and Prowse is at her foxiest in this one, with her pencil skirts, kitten heels and cat eyes), coming off like a perverted puppy dog.<br><br>The obscene phone call bits--all heavy breathing, bulging tighty whiteys and sweat--will make you want to leave the theatre and take a shower. Or, if that isn't nasty enough for you, how about the scene with bulldyke Elaine Stritch fondling Prowse's fur (so to speak), or the retarded kid sister locked in the closet or the policeman obsessively playing audio tapes of various twisted criminal's confessions as his daughter listens wide-eyed from the other side of the door? Or how about the \"twist lesson\" that brings the film to it's climax (no pun intended)? Another asset of this great piece of cinema are its New York City location shots, especially when Mineo goes walking the city at night, looking for filth in scenes that must've influenced \"Taxi Driver\" (also love the W.S. Burroughs titles in the window of the \"dirty bookshop\"). I cannot recommend this movie highly enough. It's not available on video (Curses!), so if it's ever screened at the theater or on TV in your area, be there.","user":"scorpio-x","rank":[31,32]},{"title":"Who Killed Teddy Bear, Sal Mineo shines in a brilliant performance ahead of its time, in an ignored masterpiece","rating":10,"date":"18 January 2006","review":"Hard to believe and very sad to realize that we are coming close to the 30th anniversary of the death, in February-1976,of the brilliant, beautiful, enigmatic, and influential talent of Sal Mineo. He was one of the original 50's heartthrobs who debuted with his poetic performance in the now legendary James Dean classic, Rebel Without a Cause. Later, Mineo became known for his talent and his courage in his art and in his life. He would tackle much more difficult roles and become the first actor to declare his homosexuality, unapologetically. Teddy Bear is Mineo at his most brilliant, most haunting, most daring and most heartbreaking. Coming at a time in his career when he was frustrated with very little roles to choose from, came this harrowing film from director Joseph Cates. It is important to note, and upsetting to say that Teddy Bear is mostly regarded as a \"cult classic\" and sometimes viewed as a late night schlock/camp film. Nothing could be further from the truth. Here is a film that was not only ahead of its time in subject matter, as well as actors pushing the envelope, but also influencing Martin Scorsese's Taxi Driver(1976) and Alan J. Pakula's Klute (1971).First, it is important to note how much \"Teddy Bear\" resembles the great Italian films from the late '50's, early'60's. Another great feat for Joseph Cates, is showing the remarkable influence from Michaelangelo Antonioni's L'Eclisse. This is another film dealing with the issues of disillusionment with life and society. Antonioni films Italy as though the surroundings of the characters are being consumed by their environment, a constant theme in Cates' Teddy Bear. Even more remarkable, one can see similarities between Monica Vitti in L'Eclisse and Sal Mineo in Teddy Bear. Both actors never indicating, but truly feeling the confusion, the sadness, and despair with their lives and what they have amounted to. Cates is the one director who beat all others to the punch before imitation of Italian cinema in America became the norm. Joseph Cates dared to show New York as it sadly sometimes can be, a dark, hedonistic, and self absorbed web of sex, self satisfaction and ultimately personal confusion turning to crisis. And he found the perfect actor to personify this as well in the form of the lead character. Mineo never compromises from film's beginning to end. It is a performance of the kind James Dean would have probably played had he lived. And Mineo plays it with all of the same courage, energy and longing that James Dean himself did in Kazan's East of Eden. Alas, Mineo himself had surpassed Dean in some ways with this performance and still, it is ignored. By watching Mineo in this performance, one sees the influence for Robert De Niro's historic Travis Bickle character. A decade earlier Mineo created a character who becomes a victim of an uncaring society, sexual disfunciton and a New York spiraling into hell. Mineo's character certainly would have made movie legend, like DeNiro had done with Driver, if Teddy Bear had been accepted by theatergoers in the first place. Joseph Cates' brilliant directing is overlooked as well. One is reminded of Scorsece's Taxi Driver throughout. The parallels are very easy to see. Cates had made the first movie to address some very upsetting and complicated issues that apparently no one wanted to see on the screen in 1965. Cates treats each character it seems as though they have lost all sensiblility in some cases and are detached from any kind of emotion. Sadly, when each character comes close to any kind of connection, they become even more bitter or face a confusion they can't comprehend or would even want to. Cates also did a brilliant job in creating the other characters through through the other actors in the film. Juliet Prowse as a jaded but still hopeful actress who desperately seeks independence. Jan Murrey as a soul sick cop. And last but not least, the stunning,incandescent Elaine Stritch who steals every scene that she's in and showing a vulnerability and human frailty that would still surprise people in 2006. Teddy Bear has yet to be available on DVD in wide release. It is the last in a series of insults to Cates' vision and Sal Mineo's heartbreaking talent. How soon we forget and overlook an actor of such talent, grace and beauty as Sal Mineo. After seeing his shattering performance in Who Killed Teddy Bear he will be even more greatly missed.","user":"jpbrinkman206","rank":[41,44]}]