[{"title":"A delight in sight and sound...","rating":9,"date":"27 December 1999","review":"\"The Brave One\" is about a peasant boy who runs away to Mexico City to save his brave bull, Gitano... Irving Rapper directed the beautiful simple story of Leonardo and his attachment to his pet bull with understanding...<br><br>\"The Brave One\" has an authentic look in the bullring, on ranches and in Mexican streets...<br><br>\"The Brave One\" has humor: When Gitano, becoming a remarkable bull with a fine physical construction, proves his spirit to Carlos Navarro's red car...<br><br>\"The Brave One\" has strange attachment: The charge of the noble bull against a ferocious jaguar to protect Leonardo's life...<br><br>\"The Brave One\" has determination: In front of the Monument of Mexican President Benito Juarez, the persisting and exhausted boy got a great idea to go and meet the President, the only authority that could save his bull...<br><br>\"The Brave One\" has bravery: Gitano offered to the public a magnificent spectacle of skill, grace and courage...<br><br>\"The Brave One\" has suspense: When the 'moment of truth' is at hand, the little Leonardo, all anguished, couldn't see Gitano in front of his 'Hour of Truth.'<br><br>\"The Brave One\" has a terrific climax: Clamorous screams from the public are heard stronger and stronger... Handkerchiefs are moving in the air with a petition to the president of the bullring...<br><br>The film covers many highlights as the weaning and branding of the bulls and how they are tested in the open fields; la Fiesta Brava filling resplendently in the gold and pink brocades of Mexico, mixing with the elegance of swirling capes; the father of Leonardo (Rodolfo Hoyos) trying to make Leonardo understand that the pet bull is born to die in the ringthe reason of his life...<br><br>With a tremendous score and an outstanding color photography of exceptional beauty, Jack Cardiff realized the most beautiful and expressive scenery of the Mexican landscapes... His movie had the flavor of the bullfight game and its devotees and hangers-on...<br><br>As a little boy, I loved everything about this passionate film superbly directed and acted... Such emotion as I remember seeing it for the first time with my dear parents and brothers a long time ago in Beirut, Lebanon...","user":"Nazi_Fighter_David","rank":[47,52]},{"title":"Inspiring story of a boy and a bull","rating":10,"date":"27 April 2006","review":"This has been one of my ten favorite films of all time. I showed a copy of it to the children of friends in Guadalajara. None of the children had ever seen or heard of it. They all loved it, and cheered with joy.<br><br>The children asked if they could invite all their friends in for another showing of \"The Brave One,\" so, soon, the entire room was full. Standing room only.<br><br>Adults and kids alike saw the faith, hope and inspiration in this outstanding movie.<br><br>Some teachers show the film in classes studying other cultures, and it always goes over very big, as it should.<br><br>No remake can ever come close to this version..","user":"maggie-122","rank":[29,33]},{"title":"The Shield of Love","rating":9,"date":"25 August 2005","review":"The Brave One was beautifully crafted in 1957 by blacklisted author Robert Rich and immediately established itself as a superb classic. The tale is of a small Mexican boy and his enduring love for his courageous pet bull. Set in Mexico, a boy discovers a cow has been killed after delivering and orphaning a male offspring. Naming the calf Gitano, The boy become it's friend and caretaker. Realizing the boy's loneliness, the parents encourage the bond, but fail to emphasis the eventual fate of the animal. Throughout the Calf's life the boy's love inexorably growing unaware of his parent's financial responsibility to the bull's true owner. By the time the animal has grown to market size and becomes a cash commodity, the boy's parents are torn between their son's love and their duty to the Patrone. Using subterfuge, the parents separate the two. Returning from a fool's errand, the boy discovers his best friend and lifetime companion has been sold for the purpose of bull fighting and its eventual destruction. Despite the frantic warnings of his parents that it's too late to save the animal, the small boy adroitly played by Michel Rey, sets off to save his courageous friend from certain death. The boy visits everyone from the Patrone to the Governnor of Mexico in a vain attempt to alter the fate of his pet. The film culminates with the boy's magnificent bravery before an arena filled with spectators. True love for any animal has never had a more poignant test of love and courage. For any viewer with a human heart, this tear-wrenching film will leave you joyfully weeping. ****","user":"thinker1691","rank":[30,35]}]