[{"title":"An invigorating exploitation flick.","rating":8,"date":"16 February 2012","review":"Fast paced, compelling chase thriller casts the lovely Yvette Mimieux as Dinah Hunter, who decides within the first few minutes of this story to head back to her old advertising job in NYC. She makes a couple of fateful decisions, however (starting with deciding to make the trip from LA to NYC by car), that land her in one unfortunate situation after another. Sadly, these circumstances are all too believable, and it's hard not to feel an immense amount of sympathy for her as she ultimately ends up a fugitive from justice, having killed a lecherous deputy after he forced himself on her in her jail cell. She's assisted by a natural born outlaw by the name of Coley Blake (Tommy Lee Jones); even while existing outside the usual legal boundaries, Coley is a man of some integrity and softly educates the somewhat naive Dinah on some of the cold, hard realities of their predicament. In fact, Coley is far more likable than the majority of the other characters; Jones, in his first substantial film role, displays a great deal of quiet charisma. And Mimieux remains feisty and likable throughout, as she's forced to deal with one rotten lowlife after another: a chauvinistic executive (Cliff Emmich), her unfaithful boyfriend David (Howard Hesseman), a sneaky waitress (Betty Thomas), a young pair of robbers (Robert Carradine and Nancy Lee Noble), a lecherous bar owner (Britt Leach), and, the real kicker, the rapist (Fredric Cook). The flavourful music score by Loren Newkirk is fine accompaniment for a straightforward story, written by Donald Stewart and directed with maximum efficiency by Michael Miller, who keeps the action flowing smoothly. Solid performances from a cast full of familiar faces helps, also featuring cuties Marcie Barkin and Patrice Rohmer (as the girl in the restaurant and Cassie Anne, respectively), the very amusing Severn Darden as the folksy sheriff, and the always welcome Mary Woronov as Pearl, one of Coley's associates. Look also for stuntman turned director Hal Needham as the Fallsburg police chief. The movie is exciting and involving all the way. What really makes it work is the interplay between the two leads, as highly unlikely outlaw Dinah gets to know Coley and care for him no matter how little time they actually spend together. The sequence where they have some down time before the climactic action kicks in is sweet and subtle, and is definitely the best. But trash lovers will still be reasonably satisfied with the level of female skin displayed and entertained with the standard unflattering depiction of the rural types / antagonists. The downbeat, violent ending is right in keeping with the ethos of the entire decade, with beautiful, melancholy music to follow it and play along with the end credits. Good fun overall; Miller remade it for TV two years later as 'Outside Chance' and it would be remade again as \"Macon County Jail\" in 1997. Eight out of 10.","user":"Hey_Sweden","rank":[10,10]},{"title":"B-Movie, 70's Style","rating":8,"date":"8 May 2011","review":"Fast, tough, and unsentimental. Sure, a potboiler like this is not going to win any awards, but it's got more sheer pluck and energy than twenty A-productions of the time. Pity poor Dinah Hunter (Mimieux). One minute she's a bigshot ad executive in Hollywood; the next, she's ducking cop bullets somewhere in fly-over country. It's a yuppie nightmare all the way for poor Dinah, a steady downhill once she tries a cross-country car ride. On the way she meets homicidal kids, a chiseling waitress, a righteous cop, and a prison guard from heck. No wonder she's on the run with cool dude Coley (Jones). How else can you deal with a cross section of Roger Corman's rural America. Next time she better take the plane like other bi-coastal types.<br><br>Corman really hit pay dirt with hillbilly epics like Boxcar Bertha (1972), Big Bad Mama (1974), Crazy Mama (1975), and this one. One look at these and you'd think rural America is just as bloody and hormonally driven as big city America. But these epics are also in the great tradition of the American B-movie, those cheap productions that show guts, energy, and style. Sure, a flick like JCJ is also what some might call vulgar and exploitative, which it is. Still, there can be a lot of truth even in exaggerated crowd pleasers. Besides, these drive-in specials are generally entertaining as heck, just like this one.","user":"dougdoepke","rank":[15,16]},{"title":"A superb 70's \"don't go down to Dixie\" Southern-fried drive-in exploitation gem","rating":10,"date":"18 April 2006","review":"Eternally entrancing firebrand actress Yvette Mimieux scores her best, strongest, most commanding and effective role to date as a smart, classy, fiercely self-sufficient no bulls**t Los Angeles businesswoman who runs afoul of psycho hicks and rapist redneck cops when she goes down South during her cross country trek from California to New York. Poor Yvette has one of those days which justifies the age-old cliché \"sometimes it's better to stay home in bed\": her car is stolen by a creepy backwoods hick nutjob (an intense, jittery Robert Carradine, who's genuinely frightening in a rare full-blooded sicko fruitcake part), she's wrongly put in the hoosegow by the local yokel cops after loutish bartender Britt Leach tries to sexually assault her, kills one particularly unpleasant hillbilly fuzzball after he brutally rapes her (the rape scene itself is quite graphic and upsetting), breaks out of jail and subsequently goes on the lam with tough, but tender-hearted career criminal Tommy Lee Jones.<br><br>\"Jackson County Jail\" qualifies as one of those great legendary rarities: it's a 70's redneck drive-in exploitation movie that not only delivers the goods and then some, but also the kind of gritty, top-notch, fairly plausible flick that both wholly earns and completely lives up to its killer cult status. Mark Miller's remarkably artful and assured direction plays a key role in making the film the grind-house classic that it is: the quick, unrelenting pace never let's up for a minute, the action scenes are rousing and marvelously choreographed, and the solid, pretty complicated and arresting narrative hooks the viewer from the get-go. Moreover, the film's astute depiction of the relative differences and similarities between cops and criminals is wickedly subversive: The crooks for the most part are loyal, honorable and compassionate folks while a majority of the police are total a**holes. This deliciously amoral masterstroke, a typically twisted piece of 70's B-movie nihilism which boldly bucks convention, lifts \"Jackson County Jail\" well above the rut of your standard-issue by-the-numbers formula drive-in fare.<br><br>However, that's not to say that \"Jackson County Jail\" fails to hit the bull's eye in other departments; it's an across-the-board winner in every conceivable way. The uniformly excellent cast alone testifies to this: Severn Darden as a prissy, kindly, quirky sheriff, Howard Hesseman as Yvette's faithless smarmy husband, Mary Woronov as a butch lesbian outlaw gal, \"Revenge of the Cheerleaders\" 's adorable lead bimbo Patrice Rohmer as Jones' jealous ex-girlfriend, Cliff Emmich as a loathsome male chauvinist CEO Yvette tells off at the start of the movie, and future \"Hill Street Blues\" TV series regular Betty Thomas as a saucy, outspoken greasy spoon waitress who tries to fleece Yvette out of ten bucks. Loren Newkirk's melancholy, harmonica-heavy, nicely down-home country score, the often razor-sharp dialogue (when Yvette tells Jones to be careful when he faces off with the pigs at the film's thrilling conclusion, Jones responds with this choice fatalistic retort: \"I was born dead anyway\"), the unsparingly bleak and harsh downbeat nightmarish tone, and especially Bruce Logan's agile, polished cinematography (the use of hand-held camera for Jones' climactic face-off with the law really does the stirring trick) are all also highly impressive. Gripping, suspenseful and exciting in comparable measure, \"Jackson County Jail\" stands tall as a sterling example of 70's hayseed exploitation cinema at its tense, tantalizing zenith.","user":"Woodyanders","rank":[18,23]}]