[{"title":"Douglas Sirk's Visual Extravaganza","rating":9,"date":"11 July 2005","review":"At times, the aesthetic appeal of a film is so overwhelming, it surpasses the draw of the big-name stars and plot. And \"All That Heaven Allows\" is one of those rare examples. Anyone familiar with Douglas Sirk-directed projects knows his grandiose style. And this 1955 masterpiece sums up the best of Sirk drama, with the surface sheen, thundering music, noted stars and biting social commentary. This film, in fact, is so beautiful, that it requires repeated viewings just to be able to take it all in.<br><br>Jane Wyman and Rock Hudson re-team from Sirk's inferior \"Magnificent Obsession\" that was such a hit the year before. In this story, Wyman plays a wealthy widow bound to the claustrophobic confines of her uppity New England town. Her friends and two grown children do their best to convince her to marry Harvey, a stuffy and older neighborhood bachelor. But Wyman wants more. She ends up falling for her younger gardener, played by Hudson. After bonding over the virtues of the silver-tipped spruce, they embark on a love affair which is rejected by the community and Wyman's own children. They feel she is far too upstanding to be with a gardener. The reluctance of those around her to accept this relationship cause Wyman to have to choose between love or respect from her town.<br><br>Sirk takes what is a sappy, predictable tale and turns it into a visual feast. This is true eye candy for film buffs. Sirk sets the stage for this story against a heightened background of the reds, golds and yellows of a New England autumn. Every detail from Agnes Moorehead's red hair to sunsets to Wyman's lipstick and even the cars is given the Technicolor treatment to the max. Sirk's knack for visual irony is also heavily present throughout. The film opens with a shot of the town's clocktower with pigeons roosting. The pigeons are divided into two groups - a gaggle of black pigeons representing the townspeople on one end, and on the other are two white pigeons nuzzling, representing Wyman and Hudson and the division they face in this community. This is just for starters. Other stunning examples are when Sirk uses shades of blues and greys and reds to convey character's feelings of sadness or anger. And of course there is the famous television set scene. And through all of this emotion and cotton candy extravaganza is Frank Skinner's lush score that soars in all the right places. \"All That Heaven Allows\" is a first-rate classic that is a must for fans of Sirk or anyone who are devotees of lush melodramas from the studio heyday.","user":"Michael27-1","rank":[83,93]},{"title":"Wyman and Hudson re-team for this classy melodrama","rating":9,"date":"17 February 1999","review":"Due to the success of 1954's \"Magnificent Obsession\", Universal once again called on Jane Wyman, Rock Hudson, Agnes Moorehead, and director Douglas Sirk for this passionate, heart-gripping look at the hypocrisy of small-town America.  Wyman, a rich widow in this well-to-do New England town, falls in love with her gardener (Hudson) and all hell breaks loose. Her community ridicules her and her grown children are horrified by her. She finds herself having to choose love or the respect of those around her.<br><br>The cinematography is beyond extraordinary, the score by Frank Skinner is unbelievably moving, Wyman is exquisite, and Sirk gives some of the best direction of his career. A really classy melodrama and completely worthwhile.","user":"sabby","rank":[32,34]},{"title":"Disney was never so magical - Sirk polishes weepy romance to an exquisite gloss","rating":9,"date":"17 January 2004","review":"Douglas Sirk's All That Heaven Allows could stand as a lesson about how, in gifted hands, movies can surmount and surpass their source material, elevating the routine into the rhapsodic.  And that's more than a matter of just fleshing out the roles with appealing talent or supplying de luxe production values.  It takes a sensibility that can suggest the complexity under the commonplace and spot the verities hidden beneath the clichés.<br><br>\nIt's an alert sensibility that many emigrés from Europe, apprenticed in the artistic ferment between the wars, brought with them to Hollywood (among them this Dane, born Detlef Sierck).  Hollywood gave them more money and security than they'd probably ever known, and when it also gave them hackneyed and meretricious scripts to capture on film, they devised new ways to freshen them up and, against all odds, make them work.<br><br>On its surface, All That Heaven Allows is little more than polite fiction from women's magazines circa mid-20th-century (and would today be a romance paperback with a beefcake cover).  Youngish widow Jane Wyman starts keeping company with free-spirited Rock Hudson, her much younger gardener; despite wagging tongues among her country-club set and clucks of disapproval from her grown children, she finds, after many a twist and turn, true love.<br><br>\nBut from his opening shot Sirk creates a dreamy, storybook world, so Disney-pretty that he might as well have started with `Once upon a time....' Swirling downward from a church steeple in a New England autumn, he shows us an affluent enclave just a commuter-train trip away from New York. Luncheons are taken on patios, station wagons the approved mode of travel and martinis the drink of the evening - the kind of town New Yorkers played by Bette Davis or Barbara Stanwyck meant when they referred to their `country' places in Connecticut.<br><br>In this idyllic bower, Wyman has resigned herself to a stately and well-appointed widowhood; she half-heartedly resists friend Agnes Moorehead's lures to put her back on the market (women without men, by choice or circumstance, just don't fit in).  But Wyman's too classy for the boozed-up louts and gossipy shrews in her former set, and still too vital to succumb to valetudinarian Conrad Nagel's proposal for tepid `companionship.'<br><br>\nAnd that's when Hudson, come to prune the branches, catches her eye - and, somewhat less probably, she his.  He whisks her out to see his tree farm, and they explore an old mill on his property (`I love to poke around old buildings,' she explains).  When she suggests he fix up the dump and live there, it's to the horn theme from the last movement of Brahms' 1st Symphony.  No wonder she ends up staying the weekend.<br><br>\nHere Sirk introduces a subtly subversive element: Hudson's friends, in discordant counterpoint to hers (who dismiss him as `nature boy' and a `good-looking set of muscles').  His are an amiably casual network of all ages and backgrounds who have opted out of the rat race or never cared to enter it (the `quiet desperation' passage from Thoreau's Walden screws the point home).  Though their style of merrymaking brings to mind Old World folk festivals, they represent a segment of society rarely if ever seen in films of the era: Low-profile, thoughtful rebels against the smug status quo - post-war pioneers of the voluntary simplicity movement inflamed with a touch of ecological consciousness ( now laughed off as tree-hugging). It's a startling glimpse into a below-the-radar counterculture that must have been around even in the mid-'50s (and there's not a beret, goatee or bongo drum among them - they're presented without a hint of condescension or marginalization).<br><br>Hudson proposes, Wyman accepts.  Even her children (Gloria Talbott and William Reynolds) are thrilled, so long as they assume her remarriage will be to stuffy, respectable Nagel.   When they're told that their new stepdad will be the stud who cleans up the yard come spring and come fall, they go rigid with upper-middle-class snobbery.  (And the specter of Mrs. Grundy floats in when Moorehead asks if people will think Wyman and Hudson were keeping company when Wyman's husband was still kicking.)   Stranded between her familiar past and an uncertain future, Wyman begs for more time; Hudson, hewing to his mantra `to thine own self be true,' delivers an ultimatum....<br><br>Abetted by director of photography Russell Metty, Sirk paints this soapish weeper with a gorgeous palette of hues and tints (a feat that Todd Haynes emulated in his Sirk hommage Far From Heaven, for which this movie served as template).  Now and again, he washes half the screen in an autumnal green-gold, the other in an enchanted-night mauve, situating characters at cross purposes in their respective halves.<br><br>Of course, splitting or doubling the screen, through barriers or mirror shots, is one of Sirk's signature tropes, reaching its apex when Wyman's hangdog face stares back from a newly delivered television set, a Christmas present from the kids (`Here's all the company you need.  Drama, comedy, all life's parade at your fingertips,' goes the spiel.)   Pointedly, the set never gets turned on; it's seen but once again, reflecting flames from the fireplace, the focal point of simpler, less sophisticated times, and the values Hudson embodies.<br><br>Sirk takes this unlikely June-September romance and buffs it to the highest possible gloss, using his exquisite eye to enrich and deepen every frame. It's lush and sensuous - almost candified (at times gluttingly so) - and all but impossible to resist.  When, at the close, a deer gambols up to nuzzle some snow off the windowpane in the mill Hudson has turned into his - their - home, it's an embarrassment of perfection.  Never was Disney so magical.","user":"bmacv","rank":[53,62]}]