[{"title":"This film deserves to be better known","rating":8,"date":"28 April 2006","review":"This British film recreates a true story (commonly known as the West Port murders) about two infamous Irish body-snatchers in early nineteenth century Edinburgh, a city which at the time was home to what was probably the most highly respected medical school in the U.K.. During this period the supply of corpses for anatomical teaching or research was limited by law to those of executed criminals, and this led to a great shortage. Unofficially the teachers of anatomy were recognised as prepared to buy additional bodies - no questions asked; and this led to a developing practice of criminally snatching bodies from new graves in cemeteries. In response some Edinburgh cemeteries, particularly St. Cuthbert's, constructed high walls with watchtowers and railings which can still be seen today.<br><br>In 1827 Hare ran a disreputable boarding house in which Burke was one of the residents. When another resident died a normal internment was arranged, but instead Burke joined Hare in replacing the corpse with a sackful of bark that was solemnly buried, and later selling the corpse to the highly respected surgeon Dr Knox. Realizing this could provide an ongoing income it is commonly believed that they subsequently took up dissension from graves, although Burke always denied this, and I believe it has never been proved. What is known is that when another resident in the boarding house was expected to die imminently, they decided to sell the body instead of burying it. Then as the death took longer than expected B &amp; H decided to speed up the process by suffocating the victim so that the body was not marked by violence. From this point on the sky became the limit and everyone who stayed in the boarding house began to be looked upon as a potential source of wealth. Once easily identified local characters began to disappear the end was near; Burke and Hare were arrested, Hare was offered an amnesty in return for providing evidence against Burke and the latter was executed. An almost immediate consequence of these crimes was the regulation of the supply of cadavers to medical schools which commenced with the passing of the U.K. Anatomy Act in 1832.<br><br>The film tells this story, and recreates the atmosphere of old Edinburgh with reasonable accuracy. Even today Old Edinburgh has many narrow alleys and tall stone buildings with small barred windows which can be quite eerie when it is cold and foggy, so it still provides plenty of atmosphere for filming this type of story. Probably unfortunately, the film makers decided to couple the macabre story above with an attempt to provide something of a social documentary of life in early nineteenth century Scotland, and this was not received well by most of the critics who felt these two very different themes did not meld well. The situation was made worse a year later when Derren Nesbitt, the actor who played the part of Burke, was convicted on a charge of assaulting his wife. I missed the film when it was first released but found it was being revived in a local cinema when I visited Edinburgh many years later, and took the opportunity to see it then. Perhaps the facts that I was working in a medical school, and was watching this film in the place where the grim events portrayed had actually taken place, numbed my critical faculties; but I remember being totally engrossed by the film at the time. More recently I have been trying to purchase a home video copy and view it again, but it has not been released as a DVD and is now hard to find. Surprisingly I have never seen it presented on TV. I have rated it at 8 stars, this is not based on detailed recollections of the acting or dialogue, but reflects my fascination with the great sense of the period that I experienced from it at the time I saw it. Be warned that many critics would probably regard this as a totally unjustified rating The story of Burke and Hare is a natural one for presentation on film and I am surprised that this 1972 film has not yet been re-made. (A modern day version, based on a script by Scottish writer Irvine Welsh and tentatively titled The Meat Trade is to be filmed in Edinburgh this year. In this bodies are used to provide organs for transplant not cadavers for the medical school - such a fictitious work is unlikely to appeal greatly to me.) An earlier film of the original historic story was made in 1948, but at this time the British film censors set very high standards for films regarded as documentary and, although the film was based on the actual story, they would not allow the title Burke and Hare to be used. Instead it was released as The Greed of William Hart. Ironically, this earlier version has been released as a DVD which is still listed.","user":"bbhlthph","rank":[25,28]},{"title":"BURKE & HARE (Vernon Sewell, 1972) **1/2","rating":6,"date":"27 January 2011","review":"Fairly maligned but, in retrospect, reasonably enjoyable version of the notorious body-snatching double act – played here by Derren Nesbitt (a regular in director Sewell's work) and Glynn Edwards (surprisingly, for a title role, played by a prolific character actor rather than a star or even a familiar face); both men are now married and their spouses get wind of their nefarious activities before long. The end is also closer to the truth, with Hare turning State's Evidence (eventually dying blind and destitute), leaving Burke to hang alone, and Dr. Knox (a typically full-blooded Harry Andrews, with an eye-patch over his right eye and given to cracking dirty jokes for his colleagues' amusement!) – the eminent surgeon they sold the bodies to – being expelled from his profession but subsequently setting up a traveling medicine show! Oddly enough, the rivalry between Knox and the other surgeon-lecturers is all but inexistent here! <br><br>The style is agreeably redolent of Hammer Films (nicely book-ended by recreations of period illustrations dealing with the case), though like the brand-new John Landis rendition, the tone is bawdily comic rather than the sleazy seriousness adopted by two more British treatments of these events (unfolding in 1820s Edimburgh) by notable directors – John Gilling's THE FLESH AND THE FIENDS (1959) and Freddie Francis' THE DOCTOR AND THE DEVILS (1985), both of which I had reviewed soon after their first viewing. For the record, the screenplay is the handiwork of Ernle Bradford; his major claim to fame was penning the bestselling chronicle of The Great Siege of Malta of 1565 and, not only is a street in my hometown named after him, but he was to die on our shores in 1986!<br><br>The brothel scenes (ostensibly demonstrating Knox's students' leisure time, as well as provide convenient victims for the titular duo, but all-too-obviously mandated by the new-fangled permissiveness) feel rather like padding – incidentally, former Hammer starlet Yutte Stensgaard appears briefly as one such prostitute (which she unconvincingly plays drunk much of the time!). One unexpected asset, however, is a rollicking folk-tune sung by The Scaffold during the film's opening and closing titles.<br><br>I do not know if the copy I acquired is culled from the film's DVD edition (through Redemption) but it came accompanied by an interesting 12-minute 'lecture' featuring an unusual-looking (displaying tattoos and piercings galore!) female Professor who, amongst other things, parallels the real-life Dr. Knox's dabbling in body parts so that others may live with the literary figure of Baron Frankenstein attempting to re-animate composites of dead tissue (especially since both came by them illegally).","user":"Bunuel1976","rank":[10,10]},{"title":"Not great, but definitely underrated film-version of a fascinating historical case.","rating":6,"date":"27 October 2006","review":"This is the fourth in a total of five film-versions revolving of the factual Burke &amp; Hare murders and, although certainly not as mesmerizing and memorable as \"The Flesh and the Fiends\" (1959) or \"The Body Snatcher\" (1945), Vernon Sewell's interpretation of this macabre page in Scottish history is still a truly engaging and at times even frightening movie. It's actually unfair to compare this version with the aforementioned titles, as both those films starred famous names and perhaps even had a bit more financial means to work with. This is clearly a low-budgeted film with a very limited amount of set pieces and make-up effects, and relies mainly on atmosphere and a sinister choreography. To those that aren't really familiar with the story yet, William Burke and William Hare were two poor immigrants in Victorian Edinburgh that discovered a rather unorthodox way to get rich really fast. As cadaver-suppliers to the eminent anatomist/university professor Dr. Knox, they specialized in delivering the \"freshest\" corpses of all body snatchers. Of course, to keep assuring this service they quickly had to turn to murder. The main reason why \"Horrors of Burke and Hare\" is weaker than the other versions is because the story contains too many irrelevant elements and doesn't focuses enough on the known facts. Numerous sequences inside the fancy brothel are pretty redundant (albeit entertaining), whereas other very important aspects are seemly ignored. Like the actual interactions between Dr. Knox and his corpse suppliers, for example, or the men's dangerously increasing greed and immorality. Also, and this for the very first time, the wives of Burke and Hare are involved in the murders and I can't remember having read anything about this being the case. There's quite a lot of sleaze and gorgeous female nudity on display, which make the inaccuracy so much more endurable. Particularly the unearthly beautiful Yutte Stensgaard (the blond prostitute) and Françoise Pascal (the brunette) deserve a special mentioning. This film has its very own and totally unique title-song and that's arguable the greatest thing about it! It's an uncanny song, rather vulgarly sung and warning us all to BEWAREof Burke &amp; Hare. Perhaps not the best movie ever made, \"The Horrors of Burke and Hare\" is certainly on par with most contemporary British horror films (and actually better than Vernon Sewell's other films \"The Curse of the Crimson Altar\" and \"The Blood Beast Terror\") and it honestly deserves a wider distribution. One more film about the case came out during the mid-80's, namely \"The Doctor and the Devils\" starring Timothy Dalton, Jonathan Pryce and Stephen Rea.","user":"Coventry","rank":[7,7]}]