[{"title":"Suspenseful, Wonderfully Straightforward Thriller","rating":9,"date":"17 August 2007","review":"1963, France. French President Charles De Gaulle (Adrien Cayla-Legrand) has decided, after a popular referendum, to allow the North African nation of Algeria independence from France. This action leads to the death of hundreds of French residence in Algeria and bloody conflict which extends to Europe, as disgruntled French army officers form the OAS, a terrorist group which strives to assassinate De Gaulle. After a failed attempt on the President's life, the leaders of the OAS are tried and executed, and the organization is in tatters. The surviving leaders of the OAS hire a professional assassin (Edward Fox), codenamed the Jackal, to assassinate De Gaulle. Using a bewildering array of disguises, false passports, and other tricks, the Jackal works his way through Europe, being tracked by a frantic French bureaucracy led by milquetoast Police Commissioner Lebel (Michael Lonsdale). It's up to Lebel to find and stop the Jackal before August 25th, Liberation Day, when the assassin will make his move.<br><br>Based on the gripping if very long novel by Frederick Forsyth, Fred Zinneman's \"Day of the Jackal\" is one of the best of its genre. It succeeds largely because, as Roger Ebert said, \"it knows exactly what it's talking about\". Though fictional, the film's look and feel gives it an air of authenticity that few, if any, other thrillers could hope to match. The film has an almost documentary air about it, which is one of the major reasons it is so successful.<br><br>Much of the credit is due to director Fred Zinneman. Despite having a lengthy career making such classics as \"High Noon\", \"From Here to Eternity\", and \"A Man for All Seasons\", Zinneman is generally overlooked when it comes to great directors. Certainly, it's understandable why. Zinneman's films typically do not contain much in the way of flair or flash, at least when it comes to photography. Zinneman's direction is straightforward, unpretentious, with no fancy camera angles: he allows the script, sets, actors, and action on screen to do the work. This might not be the accomplished method of film making, but it works wonders in Zinneman's best films, particularly here. The lack of stylization creates the aforementioned feel that this story could happen in real life.<br><br>Other elements contribute to the film's success. The lengthy, in-depth, and almost labyrinthine source novel is reduced by screenwriter Kenneth Ross into succinct, economic dialog which conveys as much information with as little verbiage as possible. Georges Delerue's score functions much the same as his work in Zinneman's \"A Man for All Seasons\". There is little actual music, other than diegetic music from marching bands or street musicians, which adds immeasurably the look and feel of the movie.<br><br>What makes or breaks the film, however, is the cast, and this film is truly unique in its acting. The film recruits a huge, very talented cast of actors from both sides of the English Channel, and every performance is wonderfully understated, free of histrionics or theatricality, which makes the film all the more believable.<br><br>Edward Fox is marvelous in the title role. He plays the assassin as the ultimate detached professional; unconcerned about politics or individuals, he simply does his job and does it well. He can be counted on for results. He is neither arrogant nor cocky, just an expert who knows what he's doing and will go any length to achieve it. Fox is completely, utterly, and chillingly believable as the Jackal, and one is torn between rooting for him to succeed or for him to get caught.<br><br>Also fantastic is the Jackal's nemesis, Commissioner Lebel, who is played in an equally understated performance by Michael Lonsdale. Lebel is not an action hero, nor particularly exciting; he is a no-frills, straightforward police inspector who uses his brains, intuition, skill, and more than a bit of luck to track down the Jackal. Lonsdale and Fox give two of the most utterly believable performances ever captured on film, a testament to both actors.<br><br>The rest of the cast follows suit, although few of the other characters have as much screen time. Cyril Cusack plays the charming gunsmith who builds the Jackal's perfect weapon; Delphine Seyrig is a middle-aged Frenchwoman who begins an ill-advised affair with the assassin; Derek Jacobi is Lebel's dedicated assistant; Tony Britton as the crusty Scotland Yard investigator who gives Lebel his first break in the case; Jean Martin and Eric Porter play the desperate OAS members forced to hire an outsider to do their dirty work. These are just a few of the many fine performers in the film, and all give well-rounded, believable performances.<br><br>\"The Day of the Jackal\" is a brilliant thriller that still holds up well almost 35 years later. By capturing the essence of 1960's France, and by creating a completely believable atmosphere, Zinneman draws the viewer into the film. It is unlikely that the viewer will be able to lose interest as the plot moves along. A brilliant thriller, and a masterpiece for all time.<br><br>9/10","user":"Hancock_the_Superb","rank":[30,30]},{"title":"One of the finest thrillers ever made","rating":9,"date":"15 May 2001","review":"The opening five minutes of the film are a marvel. Almost completely devoid of dialogue the scenes portray visually more story than most modern thrillers can fit into two hours. This is about the best book-to-film conversion I've ever seen. The cuts, where they are made, are logical and some locations are combined. From Forsyth's first, and probably best book (written in less than 5 weeks) this film contains nothing that does not drive the story forward. The character of the Jackal is brilliantly finely drawn. He doesn't contain any of the cliches that you would expect to see in a film written in the last twenty years (he doesn't display mental instability, or have flashbacks to some event in his past). He never tries to justify his pernicious occupation to anyone yet, strangely, doesn't come across as an evil man. Simply as a professional doing his job. The French police inspector is wonderfully underplayed and is as far away from the he-breaks-the-rules-but-he-gets-the-job-done cliche as you can possibly imagine. He is first seen attending to his pigeons and upon being told he is being put on the case simply says \"Oh God...\"....<br><br>Zimmemann's direction is great and the scenes are beautifully photographed - particularly in Paris.<br><br>This is an all-time great film. Definitely in my top ten. I suppose I must put something in negative so it makes for a balanced review so errr.... I think the French minister is wearing a very bad wig. Beyond that -marvelous.","user":"dgriffiths","rank":[200,218]},{"title":"How did he miss?","rating":10,"date":"13 November 2005","review":"Some movies just ooze with class and \"The day of the Jackal\" is an example of such a film. It's one of those movies that you never seem to get bored watching. Even if you know what's going to happen and the the thrill and tension is taken out, it's still a fascinating watch. The documentary style format and no music score (which is so important in many movies) does not in any way detract from the atmosphere that is created by Zinnerman.<br><br>The casting of Edward Fox was a crucial decision because he was believable as the Jackal who effortlessly portrays himself as very thorough, cool, methodical, professional assassin who is never flustered. Yet he is also a ruthless cold blooded killer who has no problem disposing with anybody who appears to get in his way, might compromise his cover or is simply just in the wrong place at the wrong time - - - you see it's nothing personal! From the slimy forger right up to the French police officer at the end I counted five murders ( I'm presuming the old woman he karate chopped at the end was killed).<br><br>In addition he does not appear threatening nor intimidating to anybody, he just blends and does not draw attention to himself.This would explain why he is able to take people into is confidence. (unlike Bruce Willis who has assassin written all over his face in the 1997 version). The Jackal looks relaxed and classy as Caltrop, an irritated tourist as Duggan, a nervous limp wrist-ed school teacher from Denmark and a very tired WWW I cripple. All of them are believable characters which he plays during the film and none of them look like assassins.<br><br>The movie moves at a good pace and in all honesty defies it's two and half hour status, the atmosphere is created by the back ground noise of the environment not the music score and of course that changes from England, France and Italy which of course provides great cinematography throughout the movie.The support cast are also very good in their respective roles but particular praise has to go to the Jackals arch nemesis Lebel played by Michael Lonsdale ( who was Drax in the Bond Movie Moonraker) who despite some near misses and some gut wrenching setbacks eventually corners the Jackal. He is not fooled by a war veteran who appears to be a cripple. <br><br>This is an interesting point because what the movie does well is show how difficult it was for a lone assassin to elude various agencies and law enforcement authorities from interpol when the word is out to apprehend him. This would be particularly prevalent in post WWW II France and continental Europe where identity papers are compulsory and the power of the state far more intrusive than in other countries. Today with Email, cell phones, internet, satellite surveillance and CCTV cameras which are everywhere today it would make the work of the jackal that much harder to pull off.<br><br>The Jackal had a chance to bail out when the mission was compromised but decided to push on despite knowing that the odds were increasingly being stacked against him. ( In theory he did pull it off, if he had not been careless with his shot on DeGaulle, although he would not have got away). Lastly, the ending had a nice touch , the viewer did not know who the Jackal was, he was not Caltrop, the irate flat owner at the end, he certainly was not Duggan we knew that  where did he come from? He was laid to rest in an unmarked paupers grave. A mystery for the viewer at the end!","user":"dgrahamwatson","rank":[92,99]}]