[{"title":"oldie but goodie","rating":7,"date":"6 October 2018","review":"Elliott Gould, Christopher Plummer, and Susannah York star in \"The Silent Partner.\"<br><br>Gould plays Miles Cullen, a bank teller, who finds a discarded deposit slip with words on the back indicating someone has a gun and is going to rob the bank. When he sees a nearby Santa Claus collecting money, he notices the printing is similar to what was on the note.<br><br>Miles figures Santa will be back, so he steals the money himself and, when the bank is robbed, Santa (Christopher Plummer) is distressed to find that he didn't get anything. He zeroes in on Miles and starts threatening and harassing him. He doesn't realize that Miles is as smart - or smarter - than he is.<br><br>Really good film, with Susannah York on hand as a bank employee whom Miles falls for. Plummer is excellent, meaner than dirt, as a ruthless crook who will stop at nothing to get his money.<br><br>HIghly recommended. Very absorbing and clever.","user":"blanche-2","rank":[13,13]},{"title":"Sleeper crime thriller -- an 8.","rating":8,"date":"13 June 2000","review":"I first saw this movie about 15 years ago and watched it again the other night. What I once considered a very good film I now consider a borderline great film due to how movies in general keep regressing.  It was so nice to see a movie with adult protagonists and a well-written, clever script that doesn't resort to explosions and mindless action stunts to cater to the MTV crowd.<br><br>I won't give anything away at all -- if you like clever, twisty thrillers like The Usual Suspects, then check this one out. The acting is excellent and the script is too. Note that Curtis Hanson (Bedroom Window, LA Confidential) wrote this one 22 years ago!","user":"timtindy","rank":[36,40]},{"title":"Outstanding thriller, one of the best Canadian films ever","rating":11,"date":"11 November 2001","review":"Anders Bodelson's Danish novel \"Think of a Number\" has been transplanted to Toronto, intelligently updated by screenwriter Curtis Hanson, and directed by Daryl Duke in brilliant fashion.  What makes this film so special, I think, is that you wind up rooting for Elliot Gould, a bank teller turned thief, to best Christopher Plummer, a sadistic bank robbery, even though Gould's character is basically amoral.  This is that rare thriller that works on every level.  The plotting feels free of contrivance, Gould and Plummer have never been better, chilly Toronto looks spectacular, and there's a wonderfully evocative, jazzy soundtrack by pianist Oscar Peterson. <br><br>Coming as it did out of Canada in 1978, this film, despite its high quality, was almost immediately forgotten, but it is surely deserving of rediscovery. Check it out.  It's one of the very best thrillers you'll ever see.","user":"cfisanick","rank":[33,37]}]