[{"title":"Masterpiece","rating":10,"date":"5 October 2016","review":"Movie about the beginning of Islam.<br><br>I am Orthodox Christian, but I must acknowledge this masterpiece.<br><br>Allegedly, this film is historically precise, and if it really is, then there's no essential difference between Christianity and Islam. Trouble does not lie in opposition of two religions, it lies in existence of greedy, blood thirsty politicians who incite religious fanaticism and abuse basically peaceful religions to accomplish their political and economical goals.<br><br>Anyway, if you're not Muslim, you just have to put your prejudice aside (if you have any) and you'll enjoy this excellent piece of cinematography.","user":"Bored_Dragon","rank":[91,108]},{"title":"great film, visuals and acting","rating":8,"date":"4 December 2004","review":"This is a great film. I'm a history major who took several courses in the history of the Middle East and Islam, so nothing is going to be good or accurate or trivia filled enough for me, but it certainly didn't contradict anything I'd learned (for cinematic purposes or otherwise), and that's more than I can say for any historical epic I've seen in several years.<br><br>This film starts with Muhammed receiving the Koran from the angel Gabriel and ends at his death. It was filmed in accordance with Islamic political correctness, so The Prophet himself is never depicted, visually or vocally. While this is well affected, it unfortunately removes him from a lot of the story. I would like to have known a lot more about his life from the film, not his mannerisms or speech as depicted by a particular actor, but at least the major events of his life, his children, his wives, and so on.<br><br>Having said that, however, the film is still a very good depiction of the birth of Islam. The plot focuses on the historical events rather than the Koran itself, which contains almost no history from its own period, and is therefore different from a lot of Biblical epics which present the historical events IN the Bible. It's accurate in that it tries to present the birth of Islam as most people today probably learn it. Definitely not a propaganda piece, but it's not a movie filled with facts, truth or fiction, more a movie of character and tone. It's more similar to Braveheart than it is to Ben Hur or the Gospel of John. The movie presents a decent snapshot of the times and the attitudes and lifestyles under which Islam developed.<br><br>The acting is fantastic, the music is good (won an academy award), and the cinematography, filmed in Morocco and Libya, is beautiful. Costumes are cool, and there's a few scenes with a set of ancient bagpipes for you Celtic history buffs.","user":"ShimmySnail","rank":[155,191]},{"title":"The message of truth","rating":17,"date":"17 October 2001","review":"I was assigned to view this movie for class.  From what I have learned thus far, this movie is the best representation of the truth about Islam. With all that is going on in the world today and many people's misconceptions about Islam this is a must see for all.<br><br>Not only is it an educational masterpiece...  The Message has a brilliant musical score, beautiful cinematography, a wonderful script, and terrific acting.  If your video stores do not carry it, order it from Amazon.com and learn the truth about the origins of the worlds fastest growing religion and what it stands for.","user":"spae0024","rank":[257,334]}]