[{"title":"British film-making at its best.","rating":9,"date":"19 November 2001","review":"Camden, 1969. Two unemployed actors, Withnail (Richard E Grant), and I (Paul McGann), are facing up to the reality of an empty wine cellar and a harsh comedown following a speed binge. Squalid living conditions and the prospect of life on the poverty line leads 'I' (otherwise known as Marwood), to suggest a rejuvenating break in the Lake District. After Withnail manages to persuade his bizarre uncle, Monty (Richard Griffiths) to part with the keys of his dilapidated cottage, the take the Jag north for a taste of country life.<br><br>Adapting to such an alien environment is an initial challenge to the highly strung Withnail; his predicament is significantly worsened following an altercation with poacher Jake (Michael Elphick). Meanwhile, Marwood is forced to concentrate his attentions to fending off the advances of the lecherous Monty, who has inconveniently come to stay.<br><br>Following an awkward evening, the pair hurriedly return to London and, after a run-in with the Metropolitan Police, return to find Danny (Ralph Brown) has made himself at home. Drugged rodents fill the oven while Presuming Ed fills the bath and Marwood is rescued from the mire - it seems he will crack the boards after all. \"Congratulations\", Withnail says emptily, as he begins to contemplate life without his straight man. <br><br>Bruce Robinson deserves high praise for creating a rich, debauched world of weird thumbs, phenodihydrochloride benelex, old suits, uncontaminated urine and the Camberwell carrot. WIth a the tightest of budgets, he brings the late 1960's to life. The script is incredibly witty and eminently quotable. Both Mary Selway (casting director) and Bruce Robinson succeeded in bringing dialogue to life with an impeccable choice of actors. Richard E Grant has never come close to his performance as Withnail - his drunken performances are remarkable. Richard Griffiths is as camp as a hat as the overbearing, exuberant Monty, and Ralph Brown is frequently hilarious as the dangerous but lovable Danny.<br><br>This is a film that will never be tarnished by age, and neither is it limited by repeat viewings. It is a very accessible film, despite its largely English humour, and 'Withnail' remains one of the best films about friendship. Certainly a one off, 'Withnail' is a must see film that will not disappoint.","user":"pjcarline","rank":[123,142]},{"title":"A Journey back to the 60s with George Harrison","rating":10,"date":"29 August 2004","review":"Withnail and I is set in an old, run down student flat in London's Camden Town at the end of the 1960's. Withnail and I are a couple of unemployed actors from different ends of the social spectrum.<br><br>Withnail is a Harrow educated dilettante, and rather upper crust; his flatmate Marwood is a grammar school boy with a slightly more realistic outlook on life. To escape from the squalor of their grim, unemployed, existence in Camden Town, soaked in a near lethal cocktail of alcohol and drugs, the desperate pair call upon the generosity of Withnail's uncle Montague and secure the use of his cottage in the country for a weekend.<br><br>Uncle Monty is an eccentric middle-aged homosexual, who prefers vegetables to flowers. He considers that 'flowers are essentially tarts - prostitutes for the bees', and wears a radish in his buttonhole in preference to a flower. He grows vegetables in pots in his Chelsea house, and makes suggestive references to 'firm young carrots'.<br><br>Withnail (excellently played by Richard E. Grant), persuades Uncle Monty (a superb Richard Griffiths) to lend Marwood (a convincing Paul McGann) and him his cottage in the country for the weekend.<br><br>Their exploits at the cottage, and in Penrith where they spend their Wellington boot money on booze and try to sober up in a gentile tearoom are memorable, witty and entertaining. The incongruous uncle Monty reciting Baudelaire in the Cumbrian hills, seeking carnal knowledge of Marwood (apparently coerced by the cowardly and treacherous Withnail), are testament to the writing skills and humour of author and director, Bruce Robinson.<br><br>The film's soundtrack brings us 'A Whiter Shade of Pale', played by King Curtis on the Saxophone, 'My Friend' and 'Walk hand in Hand', performed by Charlie Kunz, 'Schubert's Piano Sonata in B Flat Major' performed by Leslie Pearson, 'All Along the Watchtower' and 'Voodoo Chile', by Jimi Hendrix, 'Hang Out the Stars in Indiana', performed by Al Bowlly, and 'While My Guitar Gently Weeps', by the late lamented George Harrison, who provided much of the financial backing for this memorable film.<br><br>This is a thoroughly entertaining 108 minutes of humorous entertainment, a few too many drinks, a convincing 60's atmosphere, superb performances from the excellent cast, and music to make your heart, and your guitar, gently weep. Thank you, George Harrison.","user":"johnsw","rank":[112,131]},{"title":"Who says a comedy can't be intelligent, sad AND laugh out loud FUNNY?","rating":20,"date":"20 September 2003","review":"The first time I watched 'Withnail and I' in the late 80s I thought it was pretty good, but that's about it. Over the years, and a few more viewings, it really started to grow on me, and recently rewatching it on DVD for the first time I was struck at how brilliant and unique it is. It's a very subtle film really, and most comedy is admittedly a matter of taste, but if this movie clicks with you you'll most likely end up putting it in amongst your all time favourites. To me it's one of the greatest comedies ever. It's intelligent and sad and genuinely laugh out loud FUNNY, something you rarely see these days. The movie is episodic and seems to ramble on, but it's much more than a shaggy dog story, there's an underlying depth and melancholy to it that makes it something special. Richard E. Grant has never been better than this. Playing Withnail and writing his wonderful autobiography cement his place in film history as far as I'm concerned. Paul McGann is also excellent, and there are lovely performances from Richard Griffiths, Michael Elphick and Ralph Brown. EVERYONE is good in 'Withnail' but it's still Grant's movie all the way. He is just utterly brilliant! 'Withnail and I' is one of THE great British movies, and comes with my highest recommendation.","user":"Infofreak","rank":[100,118]}]