[{"title":"Likeable....","rating":15,"date":"15 June 2002","review":"As it goes with most 70's Disney fare, this is an acceptable family movie. Most of their live action flicks of this period are best described as \"hit or miss\". Where, say, that \"Pete's Dragon\" is a \"MISS\", \"Apple Dumpling Gang\", is a solid \"HIT\". One wonders where Disney's creative minds were in this period, as some of the films of this period are just a little \"off\". As in seeming \"out of date\", and \"stale\". I guess they were all working on getting Disney World, and EPCOT off the ground in Florida, and gearing up for the much anticipated animated movie \"The Black Cauldron\". I have a book about Disney, that a relative got for me in 1975, that goes into a good amount of detail on that movie, even though it would be a decade(!) before it was released.<br><br>\n\"TADG\" has just the right amount of excitement, comedy, cute kids, and bumbling to be watchable by almost anyone. Bill Bixby does a good job as the lead, and Susan Clark is quite watchable. The kids are not as \"whiney\" as most live action Disney kids, and David Wayne and Harry Morgan are most welcome.  And then there's Don Knotts and Tim Conway! I usually get tired of \"the bumbling duo\" act, but there is just the right amount of screen time for them, to not become annoying.<br><br>I'd suggest this to any parent who has to sit and watch along with the wee ones. I usually grab a magazine to read, but I found myself actually enjoying this warm hearted film.<br><br>Miss some of the stinkers like \"Pete's Dragon\"(I hate that kid!), and enjoy this kind hearted little movie from Disney.","user":"jwrowe3","rank":[14,17]},{"title":"Funnier Than Most!","rating":27,"date":"27 June 2000","review":"In the 1970's, Disney churned out cheap film after cheap film meant to draw children in without spending much money. They had mediocre acting, mediocre laughs and often obscure and pointless plots.<br><br>Out of all these films, The Apple Dumpling Gang is one of the few that succeeds in capturing the audience. This is entirely due to the splendid performances by Don Knotts and Tim Conway. These accomplished comedy actors give perhaps the most hilarious performances that Disney has delivered to date.<br><br>The plot is pretty pointless, most of the acting is only okay, but the dialogue and action, especially from Knotts and Conway, is hilarious. Catch this film if you just want to laugh.<br><br>You can also see the sequel, which delivers quite a few laughs but is a little too weird and pointless for my taste.","user":"Anya-fan","rank":[14,18]},{"title":"A sweet family picture","rating":10,"date":"29 April 2003","review":"I've always enjoyed this movie. Don Knotts and Tim Conway should have done a hundred more movies together. Just imagine what they could have done in the 1960's when both were very hot? It would have been something special. Rent this and share it with your family. You'll enjoy it.","user":"wmattifo","rank":[10,13]}]