[{"title":"A surprisingly endearing film","rating":1,"date":"1 February 2001","review":"Having fallen for John Cusack's engaging performance as Rob in 'High Fidelity', I jumped at the chance to watch one of his earliest films, 'The Sure Thing'. And, despite a life-long hatred of \"girly\" films and all things romantic comedy, this slice of 80s college cheese surprisingly hit the spot.<br><br>The story is nothing new: boy (an effervescent Cusack as Walt Gibson) meets girl (Daphne Zuniga), and an antagonistic relationship is formed. He hates her studious, organised approach to life; she frowns upon his laddish, devil-may-care attitude. Inevitably, they are soon thrown together - namely by Gib's trip to California on the promise of a blond, beautiful \"sure thing\" from best friend Lance (Anthony Edwards) coinciding with her journey to visit her boyfriend - and opposites begin to attract.<br><br>Yet to complain that the plot is predictable would be to miss the point. You know the ending within the first five minutes: it is the journey there which is important. Director Rob Reiner handles the script with a necessarily light touch, and allows the humour to be more character-driven than situational. To the writers' credit, even the film's most obvious scenes are always relieved through it's witty and eminently quotable dialogue.<br><br>What elevates 'The Sure Thing' above the ranks of its genre contemporaries is Reiner's deft hand with a character; in particular his ability to transcend stereotypes yet create instantly recognisable, believable people, a feat he later put to effective use in 'Stand By Me'. This is underpinned by Cusack's energetic performance, showcasing what has become his staple character: the spikily droll male whose shining qualities just avoid being undermined by his easily discernible flaws.<br><br>'The Sure Thing' is also notable for its treatment of - and fondness for - the minor characters, few of whom suffer from the \"obvious spare part\" phenomenon of so many high school based films. Particularly commendable are Tim Robbins' disappointingly brief turn as one half of the cutesy couple from hell, and a remarkably young-looking Anthony Edwards in the long-term buddy role (notable especially for what must be one of the worst 80s fashion statements since Vanilla Ice decided on baggy trousers - see the pool scene featuring Lance's phone call from California).<br><br>Despite its premise, this film always endeavours to be about love rather than sex. A refreshing angle on a well-worn tale, 'The Sure Thing' provides a welcome escape from the 'American Pie' view of teenage romance. With consistently endearing performances from both Cusack and Zuniga, this is one romantic comedy I would happily give a second viewing.","user":"indiegirlfrommars","rank":[64,66]},{"title":"My favorite 80's movie, one of the best ever!","rating":12,"date":"12 April 2004","review":"This movie has GOT to be the most underrated movie of the 80's if not of all time.  When you consider the relatively young age of the actors, Daphne Zuniga was 22 and John Cusack was only 17, and it was only Rob Reiner's second film, it makes this film that much more of a milestone. Maybe the storyline is predictable, so what. The acting by Cusack and Zuniga is perfect. They make this movie seem real and honest.<br><br>What makes this movie so enjoyable and memorable is the feelings it provokes. Remember the rush of emotions when you first meet someone who makes your heart beat out of your chest and feel lightheaded? Acting like you really don't like someone when deep down inside you would give anything to be with them? Going to a party and flirting with other people hoping that they would see you and get jealous? That's what this movie does for me. It makes me realize just how much I miss the innocence, passion and emotion of those days. The acting is wonderful and you really get drawn in to their plight as they make their way across the country to be with the one they \"think\" is their own \"sure thing\". The great thing about this movie is that every time it looks like they are finally going to get together, something pulls them apart. While there are many funny lines and memorable scenes in this film, by far my favorite is at the end when Gib's essay is read aloud. Allison's facial expressions let you know just how painful it is for her to hear it. The final scene is wonderful. I tear-up whenever I see it, and I'm a guy.","user":"nuwave88","rank":[57,61]},{"title":"Stands up to time pretty well, actually...","rating":10,"date":"21 February 1999","review":"Just for the heck of it, I pulled out my copy of The Sure Thing and watched it again. It's held up well since I first saw it on video in 1986. Yeah, the music is a little old, and Jason, Alison's boyfriend, still grates on me because I looked like him, but in all other respects it has held up well. What carries it is that it's the classic John Cusack Movie, where Cusack is just being... John Cusack. Totally real, totally unpretentious. You can see it in everything else he's done, even things of totally different style, like \"Eight Men Out\" and \"The Grifters.\" He just rules the screen and the production ends up recalling pictures like \"His Girl Friday\" and \"It Happened One Night.\" This has stood up to nearly fifteen years of viewing pretty well. Compare and contrast other stuff of that era, like \"St. Elmo's Fire,\" and \"Fast Times At Ridgemont High.\" Or any Tom Hanks movie of the period.<br><br>I've now come back five years after originally posting this review (it's now May, 2007) and I say, this film STILL stands as a classic Cusack, even after I have (in the interim) loved \"Pushing Tin,\" \"Being John Malkovich\" and of course the amazing \"High Fidelity.\" And to this day, I have been known to say, in bars, \"BARKEEP! Bring this man...a TROUGH... of spritzer!\"<br><br>And just remember...<br><br>\"Credit cards work on a completely different kind of lock!\"","user":"Turtle-20","rank":[47,50]}]