[{"title":"Dressed To Scream","rating":8,"date":"27 October 2007","review":"I've loved Doris Day in her most famous comedy roles, I loved her \"Calamity Jane\" and always though she gave real depth to her American wife and mother in \"The Man Who Knew Too Much\" But Doris in \"Midnight Lace\" is something else. The suspension of disbelief that the film expects from its audience is totally achievable because of her. She goes through it for real and manages to involve us and to actually care for this rich American lady. Her anguish rings true and that's all we need to get involved. There is not a single moment within the preposterous plot in which we catch her acting, that in itself lifts this yarn to unexpected levels. Terrific fun. Rex Harrison plays Professor Higgin's brother with the same kind of aplomb. Myrna Loy is a hoot. John Gavin , beautifully wooden as usual, Roddy McDowell is a creepy delight and Hermione Baddely creates something with her seconds on the screen. Thank you Doris for a surprising thrilling fun ride.","user":"claudiaeilcinema","rank":[58,61]},{"title":"Superb performance by Doris Day.","rating":8,"date":"28 July 2001","review":"After watching most of her other films, with Rock Hudson, and<br><br>James Garner, this is a major departure for Doris Day. Midnight<br><br>Lace, requires an actress of considerable ability, but Day proves<br><br>up the task. Her performance is one of the best  that I have every<br><br>seen. She plays the wealthy wife of Rex Harrison, who is having<br><br>financial problems, running the family firm. After receiving several<br><br>phone calls, threatening her life, she has problems proving to the<br><br>police, and Harrison, that the calls really took place.<br><br>Other threads of the story,including Roddy McDowall as the<br><br>penniless son of Day's maid, Herbert Marshall as a gambler with<br><br>money troubles, and John Gavin,as the builder, with flashbacks<br><br>from the war, there is no lack of possible suspects,who may be<br><br>threatening Day. This film has the same look and feel as Dial M for Murder' so that <br><br>is as good a recommendation as anybody could want.  8 out of 10.","user":"MIKE-WILSON6","rank":[27,30]},{"title":"Glossy and totally unbelievable but entertaining","rating":8,"date":"21 May 2005","review":"American Kit Preston (Doris Day) lives in London with husband Anthony (Rex Harrison). She starts being stalked and getting phone calls by a man saying he's going to kill her. But nobody else is around when he calls. Is he real or is she going crazy? <br><br>A VERY loose remake of \"Gaslight\". The film is far-fetched (especially at the end) and full of obvious red herrings. Also there were one or two plot threads never adequately explained at the end. Still, this was entertaining. It's very glossy with breath-taking sets and 17 costume changes (!!!) by Day--but this IS a Ross Hunter movie (he did \"Imitation of Life\" which had the same kind of treatment). So, even when the movie slows down there's always something to look at.<br><br>There's mostly solid acting by the entire cast. Harrison was just so-so as the husband but everybody else was fine. John Gavin pops up a few times just being incredibly handsome but actually isn't that bad. Myrna Loy steals the show as Aunt Bea in every scene she's in--and check out the incredibly ugly yellow hat with green sash she wears at one point! Best of all is Day. You might think she would be terrible in a straight dramatic role but she's actually quite good. Her terror at what's happening is totally believable and there's an incredible scene where she has a complete nervous breakdown. She hated making this film because it emotionally wore her down--she vowed never again to do a thriller. That's too bad--she was so good here.<br><br>So it's not believable but is still worth watching. Recommended.","user":"preppy-3","rank":[58,70]}]