[{"title":"Boris Karloff, Christopher Lee AND Barbara Steele - Can One Ask For More?","rating":6,"date":"16 April 2008","review":"Three of all-time's greatest Horror icons in one movie - which true horror fan would not love a film like that? Vernon Sewell's \"Curse Of The Crimson Altar\" of 1968 may not be a particularly memorable example for British Gothic Horror from the late sixties. More precisely, it is often extremely cheesy, and far from being a masterpiece, but the brilliant casting of Boris Karloff, Christopher Lee and the wonderful Barbara Steele makes this a must-see for every lover of Gothic Horror.The story is apparently loosely based on H.P. Lovecraft's \"Dreams in the Witch House\". The film bears little resemblance to the short story by Lovecraft, however. It does, however, resemble several other Horror films from the 1960s in many aspects, especially the brilliant \"City Of The Dead\" of 1960s, which also starred Christopher Lee (even though it comes nowhere near its brilliance, of course).<br><br>After his brother has gone missing, Antiques dealer Robert Manning (Mark Eden), travels to the village of Greymarsh, where his brother was last seen in a huge mansion. Manning is kindly welcomed by the mansion's owner Mr. Morley (Christopher Lee), a descendant of Lavinia Morley (Barbara Steele), a 17th century witch, who, before being burned at the stake, put a curse on the people of Greymarsh. Manning, who has no clue of where his brother is yet, gets along very well with his guest-keeper's beautiful niece Eve (Virginia Wetherell). Somehow, however, the area still seems to be under the menacing spell of Lavina...<br><br>The film is, of course, particularly worth watching for its three stars. Christopher Lee is, as always, great and the incomparable Boris Karloff shines in one of his last roles as an eccentric old witchcraft expert who collects 'instruments of torture'. The greatest treat is the wonderful Barbara Steele (one of my favorite actresses and the greatest female Horror-icon ever) in the role of the green-faced witch Lavina wearing a bizarre horned crown. The supporting cast includes two other memorable British actors, Michael Gough (\"Horror Of Dracula\"), who plays a butler, and Rupert Davies (\"Witchfinder General\"). Beautiful Viriginia Wetherell fits well in her role as Eve, and also grants a peak at her lovely backside. The film is practically blood-less, but it is partly quite atmospheric, and occasionally quite weird, as several scenes seem quite bizarre and feature weird S&amp;M style costumes. All things considered, the film is great fun to watch. It is certainly not highly memorable in any aspect except for the cast, but what a cast that is! No true lover of Horror can afford to miss a film starring Boris Karloff, Christopher Lee and Barbara Steele. Steele alone makes this a must for Horror fans in her green make-up! Recommended.","user":"Witchfinder-General-666","rank":[22,23]},{"title":"Why do I like this movie?","rating":10,"date":"26 September 2007","review":"Well it's not the great story; it's certainly not the curious nearly S and M moments, although I probably found them interesting as a kid, and it's not the technical brilliance although I must say that cinematographer Johnny Coquillon does an excellent job of lighting and utilising the interiors of the delightful Grims Dyke manor where the majority of the movie was filmed, and it's definitely not the annoying Mark Eden. So just what is it? Well, first and foremost there's the wonderful pairing of Boris Karloff and Christopher Lee, both of whom give performances way above the level of the product they were working with, and there's the lovely Barbara Steele portraying the green skinned witch Lavinia. On top of that there's the very 'Britishness' of it all it's like a mad little time capsule; the sophisticates chasing a cat suit wearing girl through the forest, explaining to the hero that 'it's a rather sophisticated kind of hide and seek' (what?) and the anything goes swinging sixties party blend wonderfully with the slightly psychedelic hallucinations experienced by Robert Manning. Then there are little moments like the gas station attendant (Ron Pember) actually filling the car ('Craxted Lodge', he says, 'oh, yeah, I know Craxted Lodge' in a slightly sinister and loaded way); when was the last time that happened? And the cost, the total for petrol is 1 pound, 7 shillings and six pence (about 90 pence in new money)! On top of that there is a nice feeling of the 'village where something is not quite right' and the useful device of having the world's foremost expert on witchcraft, Professor John Marshe (Boris Karloff) as a resident and his friendship with a descendant, Squire Morley (Christopher Lee), of the notorious witch Lavinia (Barbara Steele) whose burning at the stake is commemorated in an annual festival which just so happens to be occurring just as the hero, Robert Manning (Mark Eden), arrives on the scene in search of his missing brother Peter (Denys Peek). In a knowing nod to the genre Manning, commenting about the house, says at one point that you expect Boris Karloff to pop up any minute and, of course, he does. Add to this the slightly sinister man servant Elder (Michael Gough), the romantic interest Eve Morley (Virginia Wetherell), and a wonderful old house and what you get is a really nice little movie, but one whose parts are, unusually, better than the whole. Incidentally I stayed at the house back in the 80s and it really is a lovely place, loaded with atmosphere and I was genuinely thrilled knowing the movie was made there. Of course, there are downfalls. Tigon have been accused of taking a rather crude and exploitative approach to horror, although at least two of their films, 'Witchfinder General' (1968) and 'Blood on Satan's Claw' (1970) are, in their own ways, outstanding, but the script here is rather weak and fails to flow from time to time which is not helped by the somewhat pedestrian direction. It would be pointless, however, to attempt a dissection of this movie's technical merits, if you want to do that, take a look at the same year's 'Rosemary's Baby'. If, on the other hand, you just want a great, if somewhat silly, old British witchcraft movie, then look no further than this.","user":"futes2-1","rank":[35,39]},{"title":"Muddled Script, but what a Cast!","rating":5,"date":"8 October 2008","review":"This movie was one of the very last accomplishments of the legendary Boris Karloff (not quite sure if those Mexican junk movies were shot before this one but they definitely remained shelved until after his death) and reportedly he got really ill shortly after  or even during  the shooting of \"Curse of the Crimson Altar\". If this is a true fact, it definitely gives the film some sort of sour aftertaste. With a career like his, Boris Karloff should have enjoyed a well-deserved retirement instead of catching pneumonia on draughty film sets at the age of 82. On the other hand, of course, \"Curse of the Crimson Altar\" wouldn't have been half as good if it weren't for him. It already isn't much of a highlight in the genre, but Karloff's presence (along with three others horror veterans) provides an extra dimension of horror greatness.<br><br>This is one of the Tigon Production Company's more mediocre efforts  completely incomparable to \"The Witchfinder General\" and \"Blood on Satan's Claw\"  but still a remotely entertaining Brit-horror flick containing all the traditional ingredients, such as witchery, torture devices, old mansions with secret passageways, ritual sacrifices and psychedelic hallucination sequences. The plot revolves on an antique dealer (and ladies' man!) who heads out to the countryside in search for his mysteriously vanished brother. He arrives in a remote little town during the annual memorial of the legendary witch Lavinia Morley's burning. Mr. Manning is exaggeratedly welcomed at first, but he gradually senses something strange and sinister has happened to his brother in the mansion he's staying. When he then begins to suffer from vivid nightmares involving Lavinia herself, he realizes his name is historically linked to the witch and that he's been put under a sardonic curse.<br><br>Apart from the cast, \"Curse of the Crimson Altar\" benefices the most from its occasionally very moody atmosphere, the eerie scenery and the impressively staged witchery sequences. Even though these scenes might appear a little silly overall (what with the bodybuilders wearing leather S&amp;M outfits), but they're still definitely a joy to watch when you're a fan of old-fashioned Gothic horror. Barbara Steele is underused and extremely typecast as the malignant Lavinia, but what the heck, even with her face painted green and ridiculously over-sized goat horns on her head, she still remains a luscious beauty. Boris Karloff and Christopher Lee (in their second teaming after \"Corridors of Blood\") are wonderful together, but the still heavily underrated Michael Gough shines as the weird and mentally unstable Elder. Unfortunately, however, the shoddy script contains too many holes and improbabilities, and director Vernon Sewell lacks the talent and horror knowledge to cover these up.<br><br>One last and perhaps interesting little trivia detail; although entirely devoid of humor otherwise, \"Curse of the Crimson Altar\" features one intentionally wit and unsubtle inside joke. Whilst talking about the old and secluded mansion, the main character mentions something in the lines of \"I expect Boris Karloff to walk in at any moment\" and  in fact  he does only a couple of minutes later. He rolls in, to be exact, since he plays a wheelchair bound character.","user":"Coventry","rank":[12,12]}]