[{"title":"favorite childhood movie","rating":10,"date":"22 July 2005","review":"It seems that everyone who gives this movie a low rating comments on the same problems, poor animation, poor adaption from the book, etc. However it seems to me that they are forgetting three very important things: 1. This movie was made for TV, so it had a lower budget than it would have in Hollywood, 2. It was made in 1977, so it has a lower quality animation than we are now used to now, and 3. It is a children's movie, they had to make it child friendly.<br><br>I remember spending a whole summer of my childhood watching this movie over and over again, nearly wearing out the tape. I have since read the book and still love and own the movie. In fact, to this day every time the subject of LOTR comes up I start humming \"the greatest adventure...\".","user":"mcgreenergirl","rank":[45,48]},{"title":"As a Tolkien Fanatic...","rating":7,"date":"24 December 2001","review":"I must say that I actually remember this movie with fondness.  I've read comments that slam the film for either technical faults or the fact that it has left out a number of things.<br><br>All these things are true, of course.<br><br>Though I thought the artwork itself was quite good, the animation could use some work.  Certainly things were left out.<br><br>Come on people!  Certainly the film is no ten, but it is a decent version, given the fact that to fit the book into a film at all some liberties will be taken.  Especially when it seems apparent that the film is aimed at children.<br><br>If you can't unwind a bit and just sit back and watch the film without always pointing out every little omission or alteration, then this film will disappoint.  But if you can, then give this film a chance.","user":"Odysseus-5","rank":[46,53]},{"title":"Rankin-Bass's best ever production...","rating":9,"date":"30 January 2005","review":"They pulled out all the stops on this one. A glorious ensemble of voices including the legendary John Huston and Otto Preminger gave life to Tolkien's creation while the outstanding folk and fantasy score illuminates the story.<br><br>You'll see why Frodo was supposed to be an actor in his 50's for the LOTR trilogy (though Peter Jackson's opus was well cast anyway in every position).<br><br>This will whet your appetite until \"Hobbit\" is a full-length feature in theatres (fingers crossed) and no doubt, Mr. Jackson and his screenwriters will pull visuals and more from this timeless adaptation.<br><br>The only shame of it is annually, Rankin-Bass's Christmas offerings are still aired while The Hobbit and its sister production of Return Of The King (starring Roddy McDowell as Samwise The Brave!) aren't.<br><br>Catch that feature too as it picks up where the Ralph Bakshi stab at The Fellowship Of The Rings/Two Towers left off. -Matt Sherman","user":"ms-34","rank":[18,20]}]