[{"title":"more fun than a barrel of snakes and cranes","rating":7,"date":"27 July 2006","review":"having just about butchered more old Hong Kong action films than i care to mention, Columbia-Tristar actually did something right with the DVD re-release of this film - they restored a brief snippet towards the end that had long been lost to the standard American video release of it. The snippet is only about a minute of film, but it explains the emotional upheaval shown by one of the characters, and why he decides to aid Jackie in the final battle.<br><br>This is one of the better pure chop-socky 'fu films of Chan's early period, while still under contract to Lo Wei. Chen Chi Hua is really only directing a typical chop-socky, but he does allow Jackie to try out some mugging for the camera as well as some shtick. most of the actors are quite up for their supporting roles, and although the script is pretty standard fair, Chen and Chan rarely let it get beyond their capacity to have a good time, and to share this with the audience.<br><br>By no means a classic, but a thoroughly entertaining 'fu film.","user":"winner55","rank":[6,6]},{"title":"Jackie Chan is pigtailed wanderer","rating":4,"date":"4 June 2002","review":"When the Eight Steps of the Snake and Crane manual disappears along with the Shaolin masters who devised it, the martial arts world is said to be in disarray. Hsu (Jackie), a pigtailed wanderer (you know the sort), claims he possesses the coveted book and summarily every goddamn scoundrel wants a piece of it, and a piece of Hsu. That's more than enough to go on in this rather tame yet fulfilling chopsocky. The most redeeming factor: a straight Chan performance that's convincing and barely pretentious, featuring some of his best traditional choreography ever put on celluloid. Back in reality, though, the movie proved yet another major flop for the Lo Wei Motion Picture Co.","user":"abentenjo","rank":[5,5]},{"title":"\"Your technique; it's very strange.\"","rating":10,"date":"27 March 2001","review":"The very best old school kung fu movie, period. <br><br>Never a dull moment in this film with the action happening right from the beginning. The fight sequences are probably the best I have ever seen - and I've seen a fair few! Chan is completely convincing as a kung-fu master, he is incredible.<br><br>Take the opening sequence alone for example - Jackie showing of his skills with various weapons - absolutely amazing, it surely must have taken ages to produce, and more than a dozen band-aids.<br><br>As for the rest of the film, see it for yourself, the characters may be strange, the dubbing hilarious (adds to the charm) but if you like a good kung fu flick with action on overload, starring the greatest (in my opinion) martial artist movie-star of all time, then this simply must not be missed.","user":"KillMe666","rank":[10,12]}]