[{"title":"Fury is really on song","rating":9,"date":"24 March 2006","review":"In 2003, I was responsible for having the one remaining print of this film repaired and shown in a full-scale, traditional cinema for the first time in about 35 years - appropriately the screen backed a stage on which Billy Fury actually performed twice. It is true that many very poor pop music films were produced in Britain in the early 1960s. Play It Cool is not, however, a poor film. It has a charm, drive and integrity that singles it out from the dross. Billy Fury never claimed to be a natural actor. In interviews, he said repeatedly that he was keen to take cameo roles that gave him the opportunity to focus with intensity on his character. However, Play It Cool placed on his shoulders the responsibility of accepting the entire focus of the plot, and he brought energy and imagination to the role. Michael Winner has often remarked on the respect he felt for Billy Fury in accepting a star role in a medium that was so foreign to him, and in delivering such an authoritative performance. I am more than happy to simply endorse Mr Winner's verdict.","user":"hlw-3","rank":[30,31]},{"title":"A piece of British Rock N Roll History","rating":10,"date":"23 March 2006","review":"I have watched Play it Cool and like ALL \"Pop\" movies including Elvis films, the plot is very weak............but Billy Fury makes up for the weak plot with his fantastic vocals throughout the film. Certainly a film to purchase as there aren't many films or footage around of Billy Fury singing. Billy Fury was not an Elvis copycat although he idolised him, he was the first Rock N Roll Star to ever pen his own songs and was the first ever person to produce an album completely written by himself, an album that is still today regarded as the greatest rock n roll album ever! The album's name.....The Sound Of Fury... need I say more!?! Play it cool,although \"corny\" is a part of British rock n roll history.<br><br>A must for all you Rock N Rollers and sixties fans!!!","user":"fiftiesfury","rank":[16,18]},{"title":"Not the Best but still great","rating":6,"date":"23 March 2006","review":"Its shameful how people can just write off Billy Fury OK the film itself wouldn't earn an Oscar for being original or clever but as a snapshot of what was going on in the British music screen it has an English charm OK the acting is not up to par ( although directed by the now acclaimed Michael Winner - his first feature film here ) however BILLY FURY at that stage in his career WAS NOT a copy of Elvis and definitely not a --SPASTIC BOBBY DARIN - NO WAY<br><br>he was an established artist a singer with great sounds / voice and stage presence and was just doing what every star of there day - including Elvis with his many a same plot film - going onto the big screen.<br><br>Helen Shapiro was OK ,and like Bobby Vee in 2006 still going strong . <br><br>the film PLAY IT COOL is a piece of little history and should not be dismissed neither disrespected of the late great BILLY FURY<br><br>keep on rockin","user":"sounds-magic","rank":[12,13]}]