[{"title":"It's Clouseau, Once Again...","rating":8,"date":"8 January 2001","review":"Peter Sellers returns as Chief Inspector Clouseau in this fifth and final installment of the `Pink Panther' series, in `Revenge Of The Pink Panther,' directed by Blake Edwards.  This time around, Clouseau becomes the target of a drug lord, Douvier (Robert Webber), who finds it necessary to prove to colleagues that he is still `strong.'  When the assassination attempt is summarily pronounced successful, it affords Clouseau the edge of pursuing the criminals through the use of disguise and the deft application of stealth as only Clouseau could effect.  Meanwhile, former Chief Inspector Dreyfus (Herbert Lom) is pronounced fit, and returned to his position at the department.  And, as would be expected, it all adds up to a bad time for the criminals, as well as the hapless Dreyfus. \tEdwards does a good job with this film, though it's not on a par with the previous outing, `The Pink Panther Strikes Again,' which was arguably the best (and funniest) of the series.  There are scenes involving behind-closed-door meetings of the criminal element that seem to bog things down a bit, but with Sellers on hand they seem almost insignificant, for as soon as Clouseau arrives on the scene they're up and running once again. And Sellers has some classic moments in this one:  Trying on new disguises at the establishment of Dr. Auguste Balls (Graham Stark), a veritable haberdashery for undercover surveillance; posing as a rotund `Godfather' and insinuating himself into the mob; and a foray as a peg-legged pirate with an inflatable parrot on his shoulder.  The story line in this one may be considered thin-- Edwards gives it just enough to serve as a setting in which to showcase the talents of his star-- but there's nothing wrong with that; it's funny stuff, and watching Sellers work is worth the price of a ticket alone.  One of the most memorable moments in the film, however, is courtesy of Herbert Lom, as Dreyfus gives the eulogy for the `late' Chief Inspector Clouseau and can barely contain his mirth, with his tears of joy construed, of course, as grief.  And for the first time in the series, Clouseau's faithful manservant, Cato (Burt Kwouk) accompanies the Inspector during his investigation, which adds to the merriment, but is not necessarily a boon to getting the case, as Clouseau would say, `solv-ed.' \tThe supporting cast includes Dyan Cannon (Simone Legree), Robert Loggia (Marchione), Tony Beckley (Algo), Andre Maranne (Francois), Charles Augins (Vic) and Douglas Wilmer (Police Commissioner).  With  \"Revenge Of The Pink Panther,' Edwards delivers an above average comedy that is good for a lot of laughs, and he finishes it off with an extended, slapstick finale that really gives some sock to the overall movie.  What will stay with you forever, however, is the image of Clouseau, and recalling his antics will provide you with some chuckles for a long time afterwards.  In the end, this film stands a tribute to the great Peter Sellers, as proof positive that NOBODY does it better.  I rate this one 8/10.","user":"jhclues","rank":[25,30]},{"title":"Back In The Pink","rating":9,"date":"4 February 2006","review":"Peter Sellers' final performance as Inspector Jacques Clouseau is also one of the best.<br><br>Looking for a way to restore the Godfather's faith in him, a mobster (Robert Wbber), sets out to eliminate the greatest enemy of the French underworld: Clouseau, whose dumb luck has allowed him to accidentally bust crime again and again! Through a strange turn of events and a case of mistaken identity, the mobster thinks he has succeeded in killing Clousea.<br><br>The Pink Panther was originally a diamond in the first film in this series, but at this point the name has become synonymous with Clouseau. The presumed dead Inspector teams up with the villain's ex-girlfriend (Dianne Cannon) and seeks out to solve his own murder and get his \"revenge.\" There are now glaring inconsistencies in the continuity of the series. Chief Inspector Dreyfus (Herbert Lom), who tried to take over the world and was disintegrated in the previous film is now not only alive and well but is reinstated to a position of responsibility in the police force.<br><br>But the Pink Panther series isn't about continuity, anyway. It's about humor. And Sellers and crew serve it up in generous quantities. While some routines are recycled from previous films, there are a few new bits that make the movie worthwhile.<br><br>There are two especially hilarious scenes. One is a trip through the insane asylum during which Clouseau has a run-in with a jealous \"Hercule Poirot\" (you'll see). It's subtle, clever, and very funny. The second is a sequence in which Clouseau finds out his manservant Kato (Burt Kwouk), believing Clouseau to be dead, has turned the detective's apartment into an Oriental brothel.<br><br>Then there's wacky disguises, Clouseau's ridiculous accent (crazier here than ever), and the comic \"action\" scenes involving shoot-outs and car chases. Kato is given a bigger sidekick role than usual here, and Sellers' final moment as Clouseau is perfect: walking off into the moonlit night, arm-in-arm with a beautiful woman, explaining what made him decide to become a policeman in the first place. This film was truly the end of an era.","user":"SylvesterFox007","rank":[10,11]},{"title":"Fair at Best, but with One Phenomenally Funny Scene","rating":5,"date":"14 March 2005","review":"Is it possible that one of the weakest entries in the PINK PANTHER series contains one of the funniest scenes ever committed to celluloid? And is it possible that it's a scene in which Peter Sellers does not appear? Believe it or not, yes.<br><br>As you may or may not know, the premise of REVENGE OF THE PINK PANTHER is that Inspector Clouseau (Sellers) is believed to have been killed, but has survived the attempt at his life. He is now investigating the case \"under the covers,\" as he says.<br><br>The movie has its share of great comedy moments, but is much more uneven than any of the previous entries. Some of the jokes are fall-off-the-chair funny (such as Sellers donning a pirate disguise and getting his peg-leg caught in a hole, or his schtick as a phony mafia \"Godfather\"), but others are shockingly flat. The movie has a rushed, sloppy feeling to it, as if neither director Blake Edwards nor Sellers's hearts were in it, and they simply hurried to deliver another movie to satisfy the public's demand. There are many moments when Sellers appears to just be going through the motions. To be fair, however, his performance does shine occasionally.<br><br>But the real star of this movie is Herbert Lom as Chief Inspector Dreyfus. Lom's half-crazed quirkiness and barely contained mania is side-splittingly funny throughout. And Lom also delivers what is not only the movie's funniest scene, but the funniest scene in all of the series.<br><br>Lom is talked into giving a eulogy at Clouseau's funeral. He doesn't want to, because he hated him so much, but the speech was written by a high-ranking politician's wife, and he finally succumbs. At the funeral Lom struggles to get through the speech, but repeatedly breaks into laughter. The scene is painfully hilarious.<br><br>Overall, REVENGE is far from the best of the series. It's better than the ghoulish TRAIL OF THE PINK PANTHER, and about on par with the post-Sellers CURSE OF THE PINK PANTHER, but it lacks the spunk of the earlier movies. Definitely recommended for fans, others should check out RETURN OF THE PINK PANTHER or THE PINK PANTHER STRIKES AGAIN.","user":"squeezebox","rank":[11,13]}]