[{"title":"Psychedelic Head Games - Magnifique!","rating":28,"date":"28 August 2003","review":"Opening with the most eerie and perverse credit sequence you are ever likely to see, HG Clouzot's final film veers from claustrophobic mind games to swooning romance to 60s Pop Art psychedelia - without ever once losing the iron grip that was its director's trademark. It's Clouzot, and not the prolific but overrated Claude Chabrol, who deserves to be called 'the French Hitchcock.' Yet Clouzot, uninhibited by the demands of Hollywood 'box office,' was able to plumb depths of misanthropy and depravity that Hitch could scarcely dream of.<br><br>In La Prisonniere, he achieves the complete emotional and moral annihilation of all three protagonists. A young wife (Elisabeth Wiener) grows bored with her philandering artist husband (Bernard Fresson) and falls under the spell of a voyeuristic gallery owner (Laurent Terzieff) - who dabbles in kinky S&amp;M photos on the side. If that sounds like a recipe for disaster...well, it is - but never quite in the ways we predict. The flamboyantly deranged Terzieff may, in fact, be the sanest character in this twisted triangle. So how crazy are the heroine and her hubby...?<br><br>Suffice it to say that, having produced an erotic and psychological thriller that outclasses any of Chabrol's more famous efforts of the late 60s, Clouzot then enters the tormented mind of his heroine - in a psychedelic 'head trip' to rival Kubrick's finale to 2001. A pity that Elisabeth Wiener (a forgotten 60s beauty in the style of Charlotte Rampling or Marianne Faithfull) never quite suggests the depths of anguish her role demands. Still, the magnificent Terzieff supplies angst enough for the whole cast. And he's not even the mad one...<br><br>David Melville","user":"dwingrove","rank":[26,30]},{"title":"The final thrust .","rating":8,"date":"21 July 2003","review":"HG Clouzot whose best works (\"diabolique\" \"salaire de la peur\" \"le corbeau\" and \"quai des orfèvres\" ) rank among the best French works of all time,had health problems after \"la vérité\" (1960).Hence the eight -year gap, between that latter movie and his final opus \"la prisonnière\". Between,there was another film \"l'enfer\" ,starring Romy Schneider and Samy Frey but it was never finished .Claude Chabrol would take on the screenplay about thirty years later with Emmanuelle Béart and François Cluzet with startling results.<br><br>In fact Claude Chabrol is HGC's closest relative.No matter if Chabrol sprang from the nouvelle vague and Clouzot was part of their \"enemies\":Chabrol was (and is ) closer to Clouzot than any other new wave directors ,be it Truffaut or Godard .Were \"la prisonnière\" labelled a Chabrol's film,it would not enjoy ,so to speak,such a low rating.<br><br>\"La prisonnière\" is HGC's only color film and it remains a disturbing intriguing work.In \"quai des orfèvres\" ,a lipstick lesbian was taking photographs of models ,and thus sublimated what she probably thought was a sin (it was 1947!).In \"la prisonnière\" a young man (Laurent Terzieff a very earnest thespian)takes photographs of humiliated women .A young bourgeois girl(Wiener) married with a straight-in every senses of the term- husband (Bernard Fresson)discovers his secret by chance ,and wants to take a walk on the wild side.She won't escaped unharmed.Like Catherine Deneuve in Bunuel's \"Belle de Jour\" she is at the mercy of her fantasies:but whereas Severine,Bunuel's heroine,lived in a fantsy world,Josée ,HGC's girl, works as a TV editor and the films about which she works deal with women's sex and violence problems.<br><br>Although dated ,but not more than Bowman's final journey in \"2001\",the psychedelic effects are used masterfully.Although by no means a \"nouvelle vaguesque\" director ,HGC experiments here and the heroine's dream in the hospital is still impressive today.\"Everyone's a peeping tom\" the young man says,\"some pose,the others buy the photographs\".Clouzot's misanthropy persisted till his last breath.","user":"dbdumonteil","rank":[18,21]},{"title":"Old-school Clouzot understood modern society more than any of the 'New Wave' know-it-all...","rating":8,"date":"3 July 2016","review":"For all its novelty and surprisingly revolutionary design coming for an old-school director, \"Woman in Chains\", Henri-George Clouzot's final film, was a critical flop. But one should question the value of critics when a film like Melville's \"Army of Shadows\" could be criticized because of its sympathy for De Gaulle, so untimely with the rebellious wave that any artistic creation was supposed to embrace. Clouzot, like Melville, belonged to a dying breed, men who were men during the War and grew up with noir and pessimistic detachment, Camus' heirs rather than Sartre's.<br><br>But Sartre disciples were leading the show in the 50's and the existentialist wave paved the way to a libertarian and hedonistic vision of life that inspired stories about misfits and artificial rebels basking in an ocean of un-cinematic idleness, a state of mind that was slowly becoming the norm while Clouzot's previous film \"The Truth\", where Brigitte Bardot attempted a suicide out of love for her man, was deemed as too melodramatic. No wonder \"woman in Chains\" was panned who would want to see a beautiful journalist (Elizabeth Wiener) who could have any good-looking gentleman in a snap of finger, being fascinated by Stan, an art gallery manager (Laurent Terzieff) who specialized in taking pictures of women in submissive poses? But the deviance of \"Woman in Chains\" is in its defiance toward the liberal bourgeois mentality, Clouzot has never been tender with any social class anyway. <br><br>So Josée, that's her name, feels like a mix of fascination and repulsion and whenever she'd feel reluctant to try, Stan would tell her 'you're just a bourgeois' meaning 'you're a precious stuck up girl'. But Stan is a bourgeois as well, he makes money by making art paintings that could appeal to the masses and be produced in series, having understood that all the classes should have access to the treasures of liberalism, and he pays women for photographing them in these humiliating positions, one of then (Dany Carrel) represents the blue collar mentality, she needs money for her studies so the ends justify the means. Liberalism implies that anything can be paid, the body as well. This is the whole hypocrisy of a society that condemns prostitution out of morality while pushing women to become sexual objects by exercising freedom. And after fifty years, you realize the film is almost too benign when compared to reality. In the pornographic era, women benevolently offer their body or humiliate themselves, just for kicks. Even Clouzot couldn't predict that.<br><br>But Josée is more idealistic in her mind, and we can feel Stan tries to be gentle with her. She's not afraid or prudish, she's just fascinated by the relationship made of domination and submission. She feels ashamed first, but as Stan says, it's part of the appeal. Josée lives with a brutish guy (Bernard Fresson) who openly cheats on her because they're a free couple like they say, and somewhat, she wishes she could belong to a man who'd deserve her more, and this is why she's attracted to Stan and she's ashamed of this attraction. The film would certainly make feminists cringe but I think there's one underlying truth about it: many women like Josée, pretty, employed, independent, pretend to be free and sensitive about their rights, wanting to be respected by men and so forth but they do fantasize on powerful men and admit that's their type.<br><br>And again the pornographic world is the perfect mirror of our society, you really see corporate or executive women playing games with thugs or hoodlums, women love bad boys and powerful guys, like driven by a form of bestial quest toward the roots. And this is what explains Stan's shame during the last scene because he knows he's loved for a power he doesn't have, he's impotent, so in a way, he's a fraud, he who despises the fraudulence of society like any character from a Clouzot's film, can't stand himself, and it makes sense once we get it. And this is where the genius of the film lies, it denounces the many hypocrisies of a society that imposes conventions only to conceal real truths and feelings, it's all lies, Clouzot gives a huge thumb nose to a decadent and hypocritical society by confronting it to its own limitations and contradictions.<br><br>And to make its point sharper, or try to, he even uses the very weapon of his detractors, by impregnating the film with the post-68 psychedelic colors, from the pop art design of the gallery to the climactic sequence where the special effects were a bit overplayed but it was Clouzot's take on avant-garde cinema, a way to show that even the old maverick could do the same, but not for aesthetic purposes, but to make a point about it. He who couldn't finish his previous film with Romy Scheneider 'Hell' hence missing the opportunity to shock and surprise French audience before anyone else, he finally did his \"Woman in Chains\" and expressed his disgust to the fullest even at the expenses of his reputation as the French response to Hitchcock. But I'm convinced that it's one film Hitchcock would have been proud to make, albeit differently, the Master didn't mind using explicitness in his later work anyway. <br><br>It's very fitting that Clouzot's penultimate film would be a little V-arm gesture to the existential new Wave, the know-it-all \"Cahiers du Cinema\" mentality that would relegate him to old-school cinema while he provided some of the most memorable movies during two decades. After that, he would retire and die in 1977, survived by one director who admitted not caring for his work; Jean-Luc Godard. I heard Godard became a film-maker as an extension of his work as a critic, well he might have been a good filmmaker but not much of a critic.<br><br>On the other hand, Clouzot was one hell of a filmmaker, storyteller and maybe the sharpest critic of all.","user":"ElMaruecan82","rank":[10,11]}]