[{"title":"\"King of the Pig People!\"","rating":7,"date":"13 December 2003","review":"I suppose all gay men must have a reaction to BITB one way or another. It must be respected for being incredibly daring when it came out: the first play to focus exclusively on gay characters and show us as average men with basically normal lives. (As late as the 60s few plays, &amp; far fewer films, even acknowledged gays existed; those that did used gays as symbols of abasement or decadence. 'Different from the Others'-1919 and 'Victim'-1961 were isolated exceptions.) The sexually frank dialog was also a groundbreaker. A gay friend who saw the original stage production remembers being astonished by Harold's line, 'Your lips are turning blue. You look like you've been rimming a snowman!' Crowley wins laurels for being the first playwright to present our community without apology.<br><br>That said, I admit I found the film dated when I first saw it in the 80s, when I was in my 20s. Watching it now, I have a different reaction. For one thing, I adore the brilliant dialog. What an inspiration to write a comedy of manners set in the archly mannered world of New York gays! There hasn't been a screenplay with this many epigrams per inch since 'All About Eve.'<br><br>The first act is funny and marvelous. The second act teeters into melodrama, stealing the device of all-night boozing and humiliating party games to 'strip characters bare' from 'Who's Afraid of Virginia Woolf?' Michael, the host and game emcee, is such a bitch that we can't feel sympathy when Harold confronts and effectively destroys him. Kenneth Nelson's performance as Michael doesn't help: it's like an acting class exercise, all shrieking and hysterics.<br><br>While the ensemble as a whole is strong, Leonard Frey's brilliant, definitive Harold enables him to walk off with the film. The straight Cliff Gorman does fine work as the flaming, ultimately touching Emory; Keith Prentice is very good as the one well-adjusted party goer, the happy sensualist Larry; and Reuben Greene and Frederick Combs make the best of underwritten characters (Combs get lots of chances to show his rear end to great advantage, including a gratuitous nude shot).<br><br>Besides good acting, the film has other points to recommend it. The film's 'opening up' of the play is never intrusive or contrived. Friedkin's camera never seems trapped, though almost the entire picture is shot in one apartment, and he keeps the story moving swiftly along. And Crowley shows courage in leaving the question of Alan's sexuality somewhat ambiguous, despite his affirming his wife as the person he truly loves, thereby rejecting Michael as a gay man and precipitating his collapse.<br><br>The themes of love, truth, self-loathing, friendship and relationships speak to audiences gay &amp; straight. They are dealt with in a well made film and a script crafted with wit and humor. While the 'if we could just not hate ourselves so much' viewpoint does date the movie, it has more skill and substance than 75% of the films on the market-and (I agree with other posters) 99% of the 'gay' films out there now.","user":"rrb","rank":[70,72]},{"title":"Not as dated as it is supposed to be...","rating":21,"date":"21 October 2000","review":"I know I'm walking into a minefield by writing this, but here goes:<br><br>To begin with, I should say that I was born one month before the Stonewall riots and, of course, entirely missed the era this movie portrays.  I have read countless reviews insisting that this is a dated film, and a time capsule of a long gone age of self-loathing.  But, speaking as a single gay man living in Manhattan now, all I could think was that this movie hits closer to home than a lot of folks would like to admit.  For every character in the movie, I could think of at least one acquaintance of mine of my age who could easily step into those shoes.  I have met numerous \"Michaels\" who shrug responsibility, live off credit cards and (try to) drown their insecurity in endless parties; Walk into any bar in Chelsea and you'll see at least a dozen snide, contemptuous \"Harolds\" skulking around radiating disdain for everyone around them; and let's not get started on the legions of airhead pretty boy \"Cowboys\" out there!<br><br>This is not to say that all the gay men I know are like this.  I certainly don't share the P.O.V. of Michael, Harold, etc. In fact, I know just as many well-adjusted, happy and likeable gay guys, and I'd bet money there were similar folks like that in 1968, when the original play came out (no pun intended).  But it seems very p.c. to write this movie off as a history lesson and I can't.  The whole tone of the movie, the suppressed anxiety the characters feel about themselves, and the bitterness they feel towards each other, the resentment the gay men feel for the (possibly) straight guy, and above all the need for the characters to bury their self-esteem problems by getting drunk and partying with abandon happens too often among people I know to dismiss as long ago and far away.","user":"joconnell","rank":[113,123]},{"title":"Alternately frank and uproarious landmark film still stands boldly thirty years later - a potent, worthy emblem of gay pride.","rating":10,"date":"2 November 2001","review":"I was 20 years old when this pre-AIDS movie came out.  It meant nothing to me.  I was still in the closet and would be for another seven years.  But striking a deep chord the first time I saw it (about a year or two after coming out), I invite myself to rewatch it every so often just to show myself where I am, where I was, and the strides I've made.  In some ways, incongruous as it may seem to some, this movie has become my `Schindler's List.'  It allows me to never forget the past and try to change the future. `Boys in the Band' was an aggressive turning point in gay awareness - a huge, sure-footed step.  It was both a sweet and bitter pill to swallow in its self-examination.   Admittedly dated in certain aspects, the overall power of it cannot be denied.  Interesting enough, the play was first performed a year before the 1969 Stonewall Inn riots.  The movie version came out a year after.<br><br>The stage play was a surprisingly huge hit and fearless playwright Mart Crowley had the know-how, the resources, and keen sense to keep his talented stage cast together when it transferred to film, knowing the importance of a tight ensemble.  In short, a festive NY chic birthday party involving eight gay men turns sour and savage when a ninth man (married, but questionable) inadvertently intrudes on the proceedings.  Landmark in that it presented homosexuals as thinking, feeling human beings and not caricatures set up merely for ridicule or a chuckle, director William (`The Exorcist') Friedkin zeroes in on the whole gay package - the good, the bad, and the ugly.<br><br>\nKenneth Nelson as the acerbic, vindictive, persecuted Michael first impressed me with his beautiful singing voice as the original Matt in the off-Broadway musical `The Fantasticks.'  This was his film debut and what an auspicious debut it was.  Had it been a straight role, he could have launched an enviable film career that might have lasted decades.  Nelson's character lashes out with such alarming rage and self-hatred.  The nice, obedient, church-going `yes man' lost in a straight world, who takes society's scorn and repulsion and turns it back on himself and anybody else within a close proximity.  Living a lie outside his apartment door, he punishes himself for it while inside.  I could never go where Michael goes emotionally, but there is an identification factor to his anger and his anguish.   Frederick Combs' effectively underplays Donald, Michael's good friend and polar opposite, a man who solves his own problems with a joint, pills and as little hostility as possible.  A walking failure, he rather retreat than confront.  The self-imposed pacifist with little drive and even less direction, Donald concerns himself with just making it through the day with as little pain as possible.<br><br>The exceptionally handsome couple of Keith Prentice (Larry), the man who's feeling the chains of his relationship, and Laurence Luckinbill (Hank), who prefers a  monogamous home life, gave me my first connection to what a mature but complex gay union could be like.  Despite their serious problems, I actually saw two, non-stereotyped gay men trying to make a go of it while dealing with the many pressures - one still craving an exciting night life of promiscuous sex and the other striving to overcome the guilt of leaving his wife and children.<br><br>While Ruben Greene as the more centered but embittered Bernard puts a mild black perspective on the turbulent gay lifestyle, Cliff Gorman's Emory comes equipped with a ferocious swish and campy, razor-sharp quips to handle his hostility and self-loathing - sure to be the center of attention as a life-of-the-party diva.  Birthday boy Harold, the 'pock-marked Jew fairy', and played with bold, captivating flamboyance by Leonard Frey, is an inspired cynic and wit, supposedly insured with a thick skin and quick tongue, but actually frayed by massive, self-destructive insecurities. Harold's `birthday present' in the form of Cowboy, well-played by Robert LaTourneaux, eeks out a nowhere life for himself playing dumb, icing-on-the-cake stud boys, using body muscle and not brain muscle to get by.  Forlorn-looking Peter White as Alan, Michael's gloomy, married friend who unwittingly sets off the party fireworks, makes the most of his character's uncertainties, keeping the guessing game of his sexuality a constant intrigue until the end.<br><br>Nobody's character gets off easy here.  Although Nelson, Gorman and, especially, Frey have the flashiest roles, the rest of the ensemble finds opportune times to expose their heart and heartache. Depressing as much of it may appear with its vituperative `Who's Afraid of Virginia Woolf' style of game-playing and raw confrontation, it also shares that movie's agility in delivering potent, poetic dialogue with much-admired gusto.  `Boys in the Band' will leave you just as exhausted as `Virginia Woolf' did and will stay with you long after the explosive climax.  But, just as importantly, while it succeeds as a bitter commentary, it also triumphs as a devilishly funny campfest.<br><br>It is important for me to address Babe Hardy's thoughtful but highly naive July 15, 2001 comment that the entire cast of `Boys in the Band' was made up of straight men.  She couldn't BE more wrong.  As of this date, more than half of this brilliant cast succumbed to AIDS.  In death, however, Robert LaTourneaux (1986), Leonard Frey (1988), Keith Prentice (1992), Kenneth Nelson (1993), and Frederick Coombs (1993) have left a life-affirming legacy with brave, uninhibited performances way ahead of their time.  True, Larry Luckinbill is straight, as is Cliff Gorman, who, ironically, plays the über-queen Emory, but the rest?   You ain't got the facts STRAIGHT, ma'am.<br><br>Unlike the gay comedies of today that are softened to appeal to a more mainstream audience (this is not a bad thing), `Boys in the Band' will be too bold in its observance to attract many outside the personal freedom fort.  Me?  I am thankful and rejoice in its honesty and intent.","user":"gbrumburgh-1","rank":[86,93]}]