[{"title":"The dream girl in the House of Dreams","rating":26,"date":"26 August 2008","review":"The early 70s were the stage for many experiments. Barriers were being broken and the boundaries were expanded. In the cinema, taboos were challenged and defeated. It was a time for change, a time for improvisation. It was in the spirit of those times that Polanski made \"What?\" \"What?\" could be defined as a surrealistic modern \"Alice in Erotic Land\".<br><br>An innocent young and beautiful American woman, Nancy (Sydne Rome) - She is hitchhiking in Italy. The three men that gave her a lift try to rape her, but they are in such a hurry and are so clumsy, that one of them, having lost his glasses, begins to sodomize the other. A verbal fight ensues among them and in the confusion, Nancy runs away. One of them runs after her. In her flight she sees a funicular waiting there for her as on purpose. The funicular takes her to a white villa.<br><br>This villa is peopled by very bizarre characters. Nancy, running away from the cruelty of the world, has landed in the house of dreams. Is this her dream, is she a dream dreamed by other people, or both? This luxurious white villa located by the beautiful tyrrhenian sea seems very remote from everyday life. Among the characters there is a former pimp, Alex (Marcello Mastroianni), two french lesbians, a priest that watches everything with disapproving eyes, the paraplegic patriarch of the house with his serious-looking Nietzsche-reading German nurse, and even Polanski is present, as Mosquito, that has no love left for Alex, the pimp, with whom he's always arguing.<br><br>Nancy, interpreted by the gorgeously beautiful Sydne Rome, will be the object of desire of every male (excepting maybe the priest) inhabiting the villa. Even the growling dog falls under her charm, and the same happened to me.<br><br>Sydne Rome, in an interview in the DVD (released in Italy), defined \"What?\" as an erotic dream. This is exactly what I think.<br><br>Alex, the pimp (Marcello Mastroianni), will persuade her to engage in kinky sexual games. But don't you expect the sleaze displayed by other Italian films of the time - by these standards \"What?\" can be considered tamer than its Italian brothers. Still in some scenes Sydne Rome is shown in the nude, and in many others she's wandering around the house semi-naked. In the strange sexual games that happen between her and Alex, Sydne Rome has her clothes on. But believe me, these scenes are very sensual. The beautiful Sydne Rome, with her angel face and her large innocent eyes, and Marcello Mastroianni, wearing either a leopard skin or a Napoleon costume... well, it's something to be seen and enjoyed! <br><br>As Polanki has worked with a tight script and hasn't given much way to improvisation, \"What?\" seems sometimes more a theater play than a film. The characters are like dream figures and the conversations are surrealistic/symbolic. \"What?\" is a surrealistic comedy which is based mainly on the actions and words of the characters, as it happens in any good theater play. But don't get me wrong, \"What?\" is a film and feels like a film. It's just that the words in \"What?\" seem to weigh more than necessary and stifle somewhat the spontaneity of the acting. Apparently the actors in the film were not given the freedom to improvise and this spoils the fluency and the dreamy atmosphere of the film.<br><br>Take another Italian film made at the time - \"L'Occhio nel labirinto\" (Blood) by Mario Caiano. The script was probably hastily written. The characters are somewhat poorly developed, the film is a giallo that has psychoanalytical motives - a labyrinth, a killing, loss of memory, a white villa by the sea (yes!). It has flashbacks, fast hand-held cameras following the characters and unveiling the landscape. The story may seem to some a patch-up work - sex, crimes, psychoanalysis, the beach and the sun mixed together - but the film is entertaining and intriguing, even if it was made to earn a fast buck. The same cannot be said for \"What?\".<br><br>Polanski with \"What?\" wanted to make a sunny, dreamy and sexy film, and, in a way, he almost got there, but if he had let himself really go and had given the actors more freedom .... \"What?\" could have been something! As it is, \"What?\" is a half-successful psychedelic film, intellectual and slightly theatrical.<br><br>In spite of all, I think that \"What?\" is an interesting film - theatrically dreamy and psychedelic, and very, very sexy.","user":"andrabem","rank":[20,23]},{"title":"The Name Says it All","rating":7,"date":"11 December 2000","review":"While this is certainly not one of Polanski's finest, it is admittedly a damn funny effort.  As a warning, don't expect any real substance to this film.  It's ridiculous and trivial, but there are laughs throughout.  \"What?\" fills the gap for those who get a kick out of 70's porn plots, but get bored during the sex scenes.  This being said, know that it can easily offend.  Expect a movie that will get giggles out of a rape scene.  It is a no holds barred comedy that breaks ground that \"Happiness\" will sweep in to master.<br><br>Polanski combines his psychedelic absurdity of \"The Magic Christian\" with the stark strangeness that he would later delve into in \"The Tenant.\"  It is a valiant attempt to create a surreal sexual comedy. For most films, the lack of any depth to the characters will turn away even the most devoted viewer; but \"What?\" creates entertaining caricatures that bobble and bump into one another, with surprisingly charming results.  It is difficult to say whether this is a good film or not, albeit it is shot beautifully, and leaves the viewer with many a chortle, but compared to the brilliance of his other films it seems a bit empty.  The film can be best likened to a scarred and matted alley cat that loves to come and visit.  It is rough on the edges and not nice to the touch, but the affection it gives leaves the soft spots all the more appealing.","user":"sisteray","rank":[28,34]},{"title":"\"Do I LOOK Like I'm Joking?\"","rating":17,"date":"17 June 2004","review":"If you've ever longed to see Marcello Mastroianni being flogged in a tiger skin, What? is the film for you. He plays Alex, a smarmy ex-pimp who lives in one of those terminally fabulous villas that only seem to exist in Italian movies. He gets his other kicks by dressing up as Napoleon or crushing ping-pong balls with his feet.<br><br>Among the villa's other denizens are an arthritic pianist, a clutch of sex maniacs, an American husband and wife who bicker endlessly about time zones, a stone-faced German nurse who reads Nietzsche, a pair of sun-bronzed lesbians and a dying millionaire who expires with a blissful smile on his face - after getting a glimpse of the heroine's private parts. Sounds like a normal weekend round at my house...<br><br>Into this dislocated universe steps a wide-eyed, Henry James-ian innocent abroad. Sydne Rome plays a backpacking American hippie chick who escapes from an attempted gang rape on the Italian autostrada. (In their impatience to get at her, the would-be rapists get confused and start raping each other by mistake.) She hitches a ride to the villa in a giant metal cage, only to become the sexual plaything of all and sundry.<br><br>What? is one of those few movies to play on the obvious notion that 99% of all pornography is just plain silly - hence unwatchable to any viewer with even an elementary sense of the ridiculous. Its 'parody porn' screenplay reads like an LSD-fueled collaboration between Escher, Borges and Lewis Carroll. Not only is it far and away Roman Polanski's funniest film. It is also, quite possibly, his most stylish.<br><br>A well-timed revival of What? might do wonders to rescue Polanski from the Oscar-winning solemnity in which he has lately become mired.","user":"dwingrove","rank":[38,48]}]