[{"title":"(Almost) completely forgotten Broadway musical genius !","rating":5,"date":"5 April 2006","review":"If you doubt the summary comment, ask a few of your friends under the age of 55 if they've heard of Sigmund Romberg (Sigmund who)? Since I took piano lessons as a kid - I did - yet when I stumbled upon this film in my local library I thought \"when did this come out\" (I was in the service overseas at the time). I was totally blown away by the musical score and the performances. By the way, this is about the only musical film I've seen structured as a Broadway musical play - overture through finale. The last number of the first act, so the speak, was Jane Powell and Vic Damone singing \"Will you Remember\" from \"Maytime\". This show was such a success a second company opened across the street - only time in Broadway history!<br><br>See for yourself, then try to find \"The Student Prince\" and watch that - and listen. He composed about 600 or 700 songs for Broadway. By the way, did you know Gene Kelly had a song and dance man brother? You'll see them together the only time in \"Deep in my Heart\"","user":"gloandwar","rank":[26,26]},{"title":"Uneven (like most bios), but not without its rarities.","rating":15,"date":"15 April 2005","review":"This film is a curiosity more than anything else. Like most of MGM's alleged composer biographies, it distorts the details of the composer's actual life (in this case Broadway operetta composer Sigmund Romberg), but hangs all of his magnificent songs on an all-star coat rack. And there lies the attraction: seeing Gene Kelly in his only on-screen appearance with real life brother Fred; Jose Ferrer performing with real life bride Rosemary Clooney (in all of her stunning beauty); and his friend and business compatriot Helen Traubel trilling away-- most effective in the beautiful and uncluttered \"Softly\" and the lush \"Aufwiedersen\" for the ears of a dying Merle Oberon (was librettist Oberon supposed to have a crush on composer Ferrer?). Also choice is Ann Miller's Charleston tap dancing (and she looked great in that red dress); and super-babe Cyd Charisse in an 'Arabian Nights' ballet with James Mitchell (maybe the single most erotic dance performed on film): \"One Alone--\" in an incredibly sexy, nearly all-lace gown.","user":"movibuf1962","rank":[21,22]},{"title":"The trouble with songwriter biographies is..................","rating":8,"date":"18 November 2004","review":"Way back in the day when the big studios did biographical pictures about composers and songwriters all they were was an excuse to do a lot of musical numbers by that composer. The real lives of the composers were either too dull like Jerome Kern or like Cole Porter way too naughty to be discussed in earnest.<br><br>Sigmund Romberg hardly had a dull life and I wish that some of it would have been shown. Watching this film you would never know he was Jewish and came to this country to both escape the draft for the Hapsburg army and because of the vicious anti-Semitism in Vienna as typified by Vienna's mayor, Karl Lueger a precursor of Hitler. I think that's a theme that should have been explored and is crucial to understanding him.<br><br>The real Romberg who wrote those wonderful Viennese schmaltz melodies was a lot like the Jewish peddler in Ship of Fools, celebrating that culture which discriminated against him. Remember he was proud and rightly so of the Iron Cross he won in World War I. Romberg fortunately for him and the world of songwriting was not half the fool that the peddler was.<br><br>That being said, Romberg is delightfully essayed by that most castable of players Jose Ferrer. Ferrer with that impeccable diction, courtesy of the Triangle Club at Princeton, played every kind of nationality in his screen career and he's great here. He has a great monologue in this where he's describing a current project where he plays all the parts in the musical he's writing at the moment. <br><br>Merle Oberon rings true with her portrayal of Dorothy Donnelly who collaborated with Romberg on Student Prince and My Maryland. She was crushing on Sigmund big time, but Ferrer only had eyes for Doe Avedon who played his beloved Lillian Harris.<br><br>Operetta plots are so silly that productions are hardly ever done today. Criticism of such work as Maytime, Student Prince, Desert Song and New Moon rightly belong in those films, but speaking as someone who likes good melodies, Sigmund Romberg certainly composed them in abundance. MGM dragged out a good group of performers to do them. A particular favorite here is Tony Martin singing Lover Come Back to Me from the New Moon.<br><br>One of the reasons that this film came out in 1954 was also because Romberg had a posthumous hit running on Broadway at the time. The Girl in Pink Tights opened that year with lyrics done by Leo Robin to some unpublished melodies that Romberg had written. <br><br>My parents when they were alive remembered seeing Sigmund Romberg in concert. The film at the end gives a glimpse of Romberg conducting an orchestra as he did often in the last 15 years of his life and Ferrer does ring true with Romberg the performer. Also performing was Helen Traubel, Wagnerian soprano who was also enjoying a good run as Jimmy Durante's, Margaret Dumont. MGM took advantage of her small screen popularity by casting her in Deep In My Heart.<br><br>Don't expect the life of Sigmund Romberg here, but be prepared for a great melodic treat.","user":"bkoganbing","rank":[33,37]}]