[{"title":"Triumphant Conclusion to Cavalry Trilogy!","rating":21,"date":"21 April 2003","review":"'Rio Grande', the last of director John Ford's 'unofficial' Cavalry Trilogy, has often been unfairly judged the 'weakest' of the three westerns. Certainly, it lacks the poetic quality of 'She Wore a Yellow Ribbon', or the revisionist view of a thinly-disguised reworking of the events surrounding the death of George Armstrong Custer ('Fort Apache'), but for richness of detail, a sense of the camaraderie of cavalrymen, an 'adult' (in the best sense of the word) love story, and a symbolic 'rejoining' of North and South conclusion that may have you tapping your toe, 'Rio Grande' is hard to beat!<br><br>It is remarkable that 'Rio Grande' ever got to the screen; Ford hadn't planned to make it, but in order to get Republic Pictures to agree to his demands for 'The Quiet Man' (he wanted the film to be shot on location in Ireland, and in color), he had to agree to do a 'quickie' western that would turn a quick profit for the usually cash-strapped studio. This is, perhaps, a reason why the film is held in less esteem than it deserves. 'Rio Grande' may have not been born with high expectations, but with John Ford in the director's chair, and John Wayne and the Ford 'family' in the cast and crew, the potential for something 'special' was ALWAYS present!<br><br>A few bits of trivia to enhance your viewing pleasure: Yes, that IS Ken Curtis, singing with The Sons of the Pioneers, in the film...while uncredited, he made a favorable impression with Ford, and soon became a part of his 'family'...Ben Johnson, Harry Carey, Jr, and Claude Jarman, Jr, actually did their own stunts while performing the 'Roman Style' riding sequence (Carey said in interviews that they were all young, and didn't think about the danger of it; a production would lose their insurance if they 'allowed' three major performers to do something as risky, today!)...Did you know that O'Hara, playing Jarman's 'mother', was barely 14 years older than her 'son', and was only 29 at the time of the filming?...Harry Carey barely had any lines in the script; most of what you see in the film was ad-libbed!...the popular ditty, 'San Antoine', sung by Jarman, Carey, Johnson, and Curtis, was, in fact, written by Mrs. Roy Rogers, herself, Dale Evans!<br><br>Whether you're viewing 'Rio Grande' for the first time, or have sat through many viewings, the film has a richness and sense of nostalgia for a West that 'may never have existed, but SHOULD have'. It would be a proud addition to any collector's library!","user":"cariart","rank":[74,87]},{"title":"The most sentimental of Ford's movies...","rating":8,"date":"5 August 2001","review":"Ford's cavalry trilogy is, in its way, just as much Victor McLaglen's trilogy, for he appears once again in 'Rio Grande', still superbly filling the tough-soft sergeant part, still providing the Ford horse-play comedy element with just a touch of parody, still, one might add, probably fulfilling Ford's own particular vision of revering the heroes who have helped conquer the West... <br><br>The McLaglen sergeant seems drawn on the spreading of lines, but in retrospect, one realizes that somehow, paradoxically, he has inspired a remarkable degree of realism into the three motion pictures... (They would be not the same without him.)<br><br>'Rio Grande' has a very strong domestic flavor... <br><br>John Wayne - a casualty of the Civil War - is a cavalry officer, under strict orders, with great family problems... He's a northerner who, not surprisingly, has left his wife, a southerner, because he obediently did his military duty and burned several southern plantations - including the one owned by his wife's family... Maureen O'Hara - bringing a fitting maturity to her stereotyped assignment in the film - never forgives her husband for burning her plantation, and abruptly takes their son and goes away, effectively ending their marriage...<br><br>Fifteen years later, Wayne, promoted to the rank of Lieutenant Colonel, U.S. Cavalry officer, attempts to maintain the truce calm at his southwestern post, which is besieged by marauding renegade Apaches who are continually using the border with Mexico as an escape route after their raids, a lost cause since the U.S. and Mexican governments agreed that their military forces will not cross the Rio Grande under any circumstances...<br><br>He hurries to put down an Indian uprising when his past and his wife cross his path again... He is confronted by a new recruit: his West Point dropout son (Claude Jarman Jr.) and, later, the arrival of his frigid wife, desperate to buy her son out of the cavalry...<br><br>Everything, domestically and militarily is, of course, resolved successfully and, indeed, predictably, but it is the texture of the film that gives it its enjoyment - the gentle study of the reconciliation of a colonel and his estranged wife; the interplay of a father compelled to send his son on a dangerous mission; the peculiar supporting contributions of the 'beloved brute sergeant,' or the cavalry side-kicks, Ben Johnson and Harry Carey, Jr. <br><br>The three films (even considered singly) give a feeling of frontier military life, however colored by a director's highly personal viewpoint, that has hardly been approached, let alone surpassed...<br><br>There's a beautiful scene in which Wayne and Maureen are serenaded by soldiers of his troop... We can observe a husband meditating about all that went wrong with his marriage, and watch the inclination and desire that exist in his longing sideways brief look at his wife...<br><br>With first rate acting and lushly sentimental score, 'Rio Grande' can never be missed... It is the last of John Ford's cavalry movies and the most sentimental...","user":"Nazi_Fighter_David","rank":[32,38]},{"title":"Sentimental, psychological, classic movie, very unique for its genre","rating":8,"date":"24 July 2005","review":"Although I am not particularly fond of westerns, I saw this movie since I had heard much about it from many people. It is true that a lot of westerns show the wild lives of cowboys overdoing with cruelty. RIO GRANDE, however, is a different story. It is not only a western but a highly educational movie which combines all precious values in life, some of which do not necessarily go in harmony, including honor, love, the feeling of duty, grandeur, and psychological reflections. Moreover, as a film, it is supplied with highly prestigious cinematography, memorable music, and, most importantly, great cast. But there is something more that makes Ford's film really memorable - the characters presented very clearly. But why such a title? While watching the movie, one clearly notices that the title RIO GRANDE does not only refer to the famous river that separated the cavalrymen from Indians in Mexico, but has wider metaphorical extensions.<br><br>The characters are very well developed throughout. Lieutanant Kirby Yorke (John Wayne), a northerner, lost the family 15 years earlier but never gives up finding a chance to rebuild the old relationship with his southern wife, Kathleen (Maureen O'Hara) and their son Jeff. His \"rio grande\" is duties and strict orders that make a barrier for a happy life within the family. Kathleen Yorke tries to get her son out of the cavalry; however, Jeff decides to protect honor rather than his comfort. She also aims at rebuilding the family ties with Kirby but is aware that it requires much sacrifice. Their relationship is built upon a high respect for the freedom of both and a very delicate love between a man and a woman. Jeff (Claude Jarman), their son, attempts to do right and seeks for the honorable deeds. The blink of ambition in his eyes is noticeable in every scene with him. There are also other characters that the movie shows in a very psychological light (consider Travis Tyree played by Ben Johnson).<br><br>The cast give memorable performances but the pair of John Wayne and Maureen O'Hara shine above all. Wayne seems to have been born for the role and, although he played in two previous parts of John Ford's cavalry trilogy (FORT APACHE and SHE WORE A YELLOW RIBBON), he gives his best performance in RIO GRANDE. Wayne wonderfully emphasizes grandeur, feeling of duty and a husband who reflects on his past mistakes in marriage. Maureen O'Hara has something aristocratic in her behavior as well as in her appearance, which helps her portray a southern lady who used to live a rich life on a plantation. She also stresses her attempts to rebuild the past mistakes; however, she seems to be driven by completely different factors.<br><br>Music is absolutely wonderful for this genre. The ballads supply the movie with sentimental mood. Yes, they are deadly sentimental, but they in no way make you sad but rather lifted to high emotions. Here comes to my mind a very poetic scene when Wayne and O'Hara are serenaded by troop soldiers on one moonlit night. Their faces strongly express profound emotions and nostalgia for the better life together. This is so well played that anybody who sees the pair will be able to deduce some reflections from their faces.<br><br>Some people said that the Apaches are showed as real monsters in RIO GRANDE. It is important to state here that they are showed exactly in the way they were perceived rather than what they were really like. These were very \"wild\" tribes in the eyes of the white people and that is what the film shows. As a matter of fact, both the Apaches and the cavalrymen defended their values and John Ford did not forget about it.<br><br>And coming back to the thrilling atmosphere of the movie, there is one more aspect that needs to be mentioned - the locations. The Monument Valley supplies the scenes with authenticity as well as drives viewers into a wonderful mood. It simply leaves an unfading trace in memory as do the cast, the content, and everything about RIO GRANDE.<br><br>What to say at the end?... The last part of Ford's cavalry trilogy, though 55 years old, is a classic attempt to bring all that is valuable onto screen - HISTORY MEETS SINGLE INDIVIDUALS! Aren't our lives constructed in such a way that we all have our own \"rio grande\", such a barrier that closes us from happiness? I leave this universal question open to every open minded reader as John Ford implicitly did more than 50 years ago to every open minded viewer. Anyway, the film is unarguably worth seeing!","user":"marcin_kukuczka","rank":[49,61]}]