[{"title":"A genre movie unlike any other.","rating":8,"date":"5 June 2006","review":"When I worked in a psychiatric hospital I noticed that one or two of the patients had a peculiar tendency to stand up, start walking purposefully across the ward, stop and look around, then begin walking just as purposefully in another direction, then sit down again. A kind of ambulatory non sequitur.<br><br>This whole movie is like that. I mean that to be a compliment. People break up the interactive script they've initiated and do something completely unpredictable. I'll just give one example. Walker (Marvin) and his companion (Angie Dickenson) have an argument and she begins whacking him across the head with her purse. At first he guards himself with his arms but then lowers them and stands silently and without any expression as she beats him, slaps him, and pounds his chest, finally slumping to the floor exhausted. At that, he strides wordlessly to the couch, plops down, turns on the TV and begins surfing the channels.<br><br>It's a neo-noir film if there ever was one. There is betrayal, a false woman, suicide, multiple double crosses, revenge, an urban setting, and an ambiguous ending.<br><br>So, although it is a genre film, it is nevertheless unique. Everything comes together. The production designer gives us sterile urban vistas, featuring bland cement boxes and the Los Angeles River, without which no noir would be complete. The apartments these people live in look like ordinary arid gray middle-class bourgeois digs. Wardrobe, too, has fitted these performers out in ordinary suits and ties, and the women are always rather chic looking.<br><br>The direction and editing are splendid. I'll give an example of what I mean here, too. Lee Marvin throws John Vernon out on the roof of his penthouse, wrapped only in a bed sheet. Vernon begins to tumble over the edge, Marvin grabs for him but winds up holding only the sheet while Vernon plunges some dozen floors to the street below. (His body winds up impossibly intact. A cat might have survived such a fall but a full-grown man would have splashed.) In an ordinary movie, we'd get a cut from the body hitting the street to Marvin staring down at it over the railing. But here, Marvin is still holding the sheet. Not only that but it's WINDY on the fourteenth floor roof and the wind is whipping the sheet up into billows around Marvin, like some demonic object with its own malevolent life force, before he is finally able to unwrap himself and fling it away.<br><br>The editing gives us a couple of brief flashbacks, but not just to evoke a mood. They are instrumental in letting us know what Marvin is thinking. Marvin is holding a gun to his ex-pal's, Vernon's, face and the poor guy faints until Marvin slaps him awake, and then he begs Marvin to trust him. A flashback lasting only a few seconds reminds us of an earlier scene in which Vernon begged Marvin's help in carrying out a heist and shouted at him, \"Walker! Trust me!\" The editing is so precise that in this -- and in a dozen other scenes -- a few seconds more or less would drain them of their impact.<br><br>The score is by Johnny Mandel, an arranger and composer whose work I've admired for years. He was a child prodigy, played both trumpet and trombone with Tommy Dorsey's band before turning to composing and arranging. He's never edgy or irritating. His music is smooth and melodic and sometimes strangely orchestrated. Here he suits his talents to the demands of the scene. When a man is trying to seduce a woman, a romantic piano melody tinkles behind them. At other times, again depending on the context, the score glides from Henry Mancini to Gil Evans. Nicely done.<br><br>So is the acting. Marvin has been this good in other films but never better. The plot has to do with his regaining $93,000 that \"the organization\" has cheated him out of. (There is no mafia-ness to the movie. The only foreign language we hear is Portugese.) And $93K was a lot of money then. You could find gas at 29 cents a gallon. Marvin more or less kills his way up the ladder searching for someone in a position to \"pay me my money.\" He finally gets to Carrol O'Connor who explains to him that in a huge corporation like this, nobody ever handles any money. O'Connor has got maybe eleven dollars in his wallet. And Marvin, holding a gun on him, hesitates and looks genuinely put out -- puzzled, the way a child might be puzzled by a disappointing reply. (\"No, there's no Santa Claus.\") I think I'll leave it at that before I run out of space. I've pretty much skipped the plot but that must be adequately covered elsewhere. Besides, the plot is either extremely simple or very complicated indeed, depending on how far you want your conjectures to dig. (Is the whole movie nothing more than the fantasy of Marvin as he lies dying on Alcatraz after being shot at the beginning of the story? See what I mean?) Don't miss it.","user":"rmax304823","rank":[73,87]},{"title":"Point Blank is one of the most influential films of the 1960's","rating":9,"date":"12 June 2004","review":"Point Blank is one of those lost gems from the 1960's. It got buried because it was released around the same time as Bonnie and Clyde. This film combines all the great elements of the American action film with flourishes of European art house cinema. John Boorman's direction is excellent, and not enough can be said about Lee Marvin's performance. This is without question one of Lee's best tough guy performances. I don't understand how the previous reviewer can say this film seems \"dated\" and \"funny for all the wrong reasons\". It is as fresh and interesting as it was back at the time of its release. Those looking for it on DVD may want to know that the widescreen format version appears on TCM occasionally. You may want to pop in a tape the next time it is on until the DVD finally comes out.","user":"kyle-garabadian","rank":[95,116]},{"title":"Point Blank contains inspiring visuals, a haunting soundtrack and some stunning acting. Fabulous, groundbreaking cinema.","rating":15,"date":"15 December 1998","review":"In the wake of his Cannes Best Director award for The General, Boorman's stunning debut has been released with a new print. Unrelentingly downbeat, this stylish crime thriller made in 1967 seems to have fuelled virtually Elmore Leonard novel.<br><br>Steely, panther-like hitman Walker (marvellous Marvin) has been fitted up, shot at and had $93,0000 stolen from him all because of ex-pal Mal Reese (John Vernon). A tad upset he decides to resurrects himself, with the help of the shadowy Yost (Keenan Wynn) for revenge and his payment.<br><br>Boorman greets us with a five-minute sequence that is crammed with curious camera angles, fractured time-lines and carefully constructed compositions. We're bombarded by a montage of piercingly violent images blended together with fragments of a failed heist on Alcatraz Island and a pair of slugs ripping into Walker's body. We're only privy to these flash snippets of information, but they're still enough to help us empathise with Marvin's masterly obsessive.<br><br>A year or two later Walker is on a tourist boat trip to Alcatraz, being propositioned by Yost. The creepy Yost knows where Mal and his Walker ex-wife Lynne (Sharon Acker) are and is willing to reveal this to him, just as long as he receives some information on a shadowy body called \"The Organisation\". Walker simply nods. His dialogue is minimal, his obsession is reflected through his curt questions, his sudden movements, his eyes and the flashbacks that haunt him.<br><br>When he catches up with his cheating ex-wife he allows her to talk uninterrupted in a desperate, forlorn monotone - \"He's gone. Cold. Moved out,\" she says. Walker barely takes it in, all that motivates him is the thought, \"Somebody's gotta to pay.\"<br><br>While others flounder, Marvin appears impenetrable like one of Sergio Leone's cowboys. Only Clint Eastwood never conveyed this much emotion in his movements.<br><br>Boorman's seminal film preceded the spate of fabulous paranoia flicks that enriched 70s American cinema  The Conversation, The Parallax View, All The President's Men  where a shadowy \"Organisation\" pulls the nation's strings. Tarantino has since appropriated this organisation theme on a small-time level, plagarising the black suits and the unwavering professionalism of the violence. De Niro's ex-con in Jackie Brown is based on Marvin's Walker, as are countless other performances.<br><br>Even Angie Dickinson, playing Lynne's sister Chris, leaves him cold. In a remarkable scene she resorts to repeatedly slamming Walker's immovable slab of a chest. He remains impregnable, emotionally void. She keeps on punching until she finally collapses on the floor in a heap. They finally make love, only for the isolation, the loss of identity, to continue. Is he an avenging angel? Is he there at all?<br><br>\"Hey, what's my last name?\" asks a post-coital Chris. \"What's my first name?\" he deadpans, answering a question with another question. Always seeking answers, never providing them. No love left in him, only a need for payment.<br><br>Point Blank contains inspiring visuals, a haunting soundtrack and some stunning acting. Fabulous, groundbreaking cinema. --Ben Walsh","user":"walshio","rank":[103,127]}]