[{"title":"Comedy to aid the sick!","rating":13,"date":"13 March 2003","review":"So there I was, in my sick-bed when this film comes on. I start to watch, having never seen it before, and to my surprise, find myself laughing...out loud. <br><br>I have never really been a fan of either Doris Day or Rock Hudson, but I did enjoy this piece of fluff. And in our modern times when comedies currently released in the cinema can hardly raise a smile, let alone a laugh, I found this a pure delight. So the sexual politics maybe a little outdated, but there were some beautifully timed comedy set-pieces: The moment Doris Day discovers the real identity of Hudson's character has one of the best use of music I have seen in a movie since the Warner Bros cartoons!<br><br>A film that I didn't think I would enjoy, but was completely bowled over by.","user":"wrenster","rank":[67,76]},{"title":"In spite of what we know now","rating":9,"date":"2 December 2005","review":"In spite of what we know now, Rock Hudson still convinces as a woman-chaser!! He was never considered to be a great actor but he convinced the public for years- so what dom the critics know? This movie is brilliant in every respect-script, plot , performances and the look of the whole thing. How can Doris Day be so sexy and virginal at the same time? Rock Hudson showed a real flair for comedy in this film and it is no wonder that every romantic comedy has been judged against the \"Rock Hudson/Doris Day\" movies. Even the Doris Day movies NOT starring Rock Hudson were called \"Rock Hudson/Doris Day\" !!! Doris Day was/is one of the most underrated actresses of the last 50 years. She could play comedy with perfect timing, but convince totally in dramas (check out \"Love Me or Leave Me\"-fantastic performance.) I must have watched this movie dozens of times and it is still true entertainment. If you have never watched one of her movies then make a point of doing so-yes they have dated, but what has not? Real talent not hype is what true stars have. By the way the 9/10 is because of the dated plot.","user":"beresfordjd","rank":[28,31]},{"title":"The wildest behind in New York City!","rating":9,"date":"22 May 2001","review":"A party-line turns an interior decorator and a songwriting ladies' man into enemies--that is, until he gets a look at her. When Doris Day is forced into a nightclub by a junior-suitor, she makes the best of it and does a shimmy on the dance-floor in a tight white dress--you can't blame Rock Hudson (at a nearby table) nor the cameraman for zooming in on her derrière, which wiggles seductively and comically. This businesswoman is really a closeted gal-about-town, and Day gives one of her freshest, funniest performances here. I also liked the tinkly background score and the handful of songs (the title cut, \"Roly Poly\" and \"Possess Me\"), but apparently Doris didn't. In her autobiography, she scathingly dismisses all the music from her '60s bedroom comedies as \"mediocre\", blaming her skinflint husband for bypassing top-rank composers like Henry Mancini for \"a bunch of no-names\". Why Doris!!<br><br>***1/2 from ****","user":"moonspinner55","rank":[28,31]}]