[{"title":"Late-Fifties Chic...","rating":12,"date":"12 April 2003","review":"Helen Rose, MGM's Oscar-winning fashion guru, suggested the idea for this bit of fluff and the original casting was supposed to have been: Grace Kelly (eventually, Lauren Bacall), James Stewart (then, Gregory Peck), and Cyd Charisse (finally, Dolores Gray). George Wells won an Academy Award for his witty script and the production values were about the best that MGM could muster. Bacall gives a sly and glamorous performance, probably a little difficult for her since her husband, Humphrey Bogart's health was becoming a very serious concern while this film was in production. (Humphrey Bogart died in January of 1957.) Peck matches Bacall with a humorously masculine presence that was right-on. Dolores Gray tosses off a couple of jazzy production numbers (with the emphasis on her singing...presumably Cyd would have unfurled those legendary legs and would have been dubbed had singing been required.) And Mickey Shaughnessy provides a bit of cruder comic counterpoint as a punch-drunk boxer (\"I'm makin' a comeback!\") Minnelli, as usual, uses Metrocolor and CinemaScope to creative effect and Andre Previn contributed a main title theme that's instantly memorable.<br><br>The DVD now available restores the widescreen ratio and there's a curious \"Behind-the-Scenes Minidocumentary\" featuring costume designer Helen Rose, shot in black-and-white, in which she seems to be responding to questions posed to her by an unseen person whose questions were not actually recorded on the soundtrack! Wonder why they didn't fix that omission for its inclusion on the DVD version. Anyway, it's fun and worth a look.","user":"gregcouture","rank":[33,34]},{"title":"Light and amusing","rating":7,"date":"11 April 2005","review":"Who would have possibly realized in this bubbly and frothy romantic comedy, behind the scenes was a looming tragedy. While shooting this film with Gregory Peck by day, Lauren Bacall was nursing dying husband Humphrey Bogart. It was quite an ordeal for her.<br><br>Fortunately she's called on to be a fashion designer, beautiful and chic and Lauren Bacall can do that in her sleep. I'm sure working on this film took her mind off what she was dealing with at home.<br><br>As has been said, this borrows heavily from Woman of the Year. And like in Woman of the Year, the male lead is a sports columnist. He's also doing a bit of crusading journalism going after racketeers in the boxing game. Which, by the way, in real life was also going on, giving Designing Woman a certain current topicality.<br><br>Gregory Peck may be reprising Spencer Tracy, but I think he's poaching here on Rock Hudson's territory. Still he does have some good moments as Mike Hagen, sportswriter and would-be Bob Woodward. His best moments are with Dolores Gray, his jilted girlfriend who dumps a plate of ravioli in his lap at a posh restaurant and later in her apartment hiding from Bacall and wrestling with Gray's pink poodle for his shoe which the dog appropriates for a chew toy.<br><br>The rest of the cast nicely fills out their roles. Two standouts for me are Mickey Shaughnessy as a punch-drunk ex-pug who is Peck's appointed bodyguard. It seems like Mickey Shaughnessy was in about every good film in the 1950s and worked with everyone. The second is Jack Cole, choreographer who plays a choreographer in a show Bacall is designing costumes for.<br><br>We've certainly come a long way from 1957 when you had to hide the fact a character was gay. If Designing Woman was made today Jack Cole would be openly gay and no nonsense about it. Let us say his presence in the mad finale is absolutely crucial to Peck's and Bacall's life and marriage.","user":"bkoganbing","rank":[42,47]},{"title":"Bright, Well-Written and Adult Romantic Comedy; Peck and Bacall in Top Form","rating":8,"date":"30 July 2005","review":"\"Designing Woman\", a title which is a word-play on a female's desire to obtain a worthwhile husband and on the profession followed by the female lead, is what used to be known as an engaging comedy. A 'designing woman' is exactly what she is not; nor is the sportswriter she falls in love with in any way naturally conniving. But circumstances in this undeniably charming, situationally humorous and dialogue-rich film force her to become (naturally) suspicious and him to mislead her. The couple are portrayed by Lauren Bacall and Gregory Peck who have said they had and appear to have had great fun in making this New York-based comedy of manners. There were a number of male-versus-female films made in Hollywood between 1939 and 1973, the Golden Age of physical production there; while most of the writers took a reactionary anti-feminist position, the author of this film, George Wells, instead, here championed a mutually-desired and mutually-agreed equality between the two protagonists. Peck is the central character; but Bacall is the focus of much of the plot. In fact the opening sequences of the film take place on the West coast; Peck awakens to find himself befriended and his story filed by Bacall, after he had had a bit too much to drink. They begin an affair and swiftly decide to wed. But going back home to New York, they discover that \"happily ever after\" is harder than \"I do\". Abandoning his smaller bachelor digs for her luxurious apartment, they discover that their lifestyles, acquaintances and pursuits hardly match. One famous scene involves his rough-hewn card buddies trying to hold their regular game in her apartment. Also, Peck had been dating a pretty model , played by Dolores Gray, and has to hide the relationship, explain it away and generally engage in fancy footwork on several occasions; having her creative friends do their work while his card game buddies are present, pretending he does not know Gray, on whose musical designer Bacall is working when they meet at a fashion show; this is only the beginning of the story. Because Peck is also under a death threat from gamblers, he has to pretend to be away covering road baseball games while he's really holed up with a punchy ex-prizefighter bodyguard played by Mickey Shaughnessy. Of course, when Bacall discovers his old girl friend was Gray and that Peck has been lying about where he is, she assumes he has been cheating on her. The gangsters after Peck is played by Ed Platt and Chuck Connors, while Peck's helpful editor is Sam Levene. Under Vincente Minnelli's solid direction, the pace of this fast-moving comedy that only sometimes slows down for smart dialogue never flags. The fine cinematography was done by Gene Alton, set decorations by Edwin B. Willis and Henry Grace. Costumes were the work of veteran Helen Rose, with original music by Andre Previn. The bright art direction was by E. Preston Ames and William A. Horning, In the cast supporting the principals are Tom Helmore, Alvy Moore, Jesse White, Carol Veazie and Jack Cole. Bacall shows intelligence and toughness as the designer while Peck is more nuanced. This is a well-remembered and critically favored comedic effort, with a surprisingly satisfying ending. The screenplay won an award in 1957. Catch it when you can.","user":"silverscreen888","rank":[26,32]}]