[{"title":"Cheesy but Enjoyable Sci Fi Adventure!","rating":20,"date":"20 March 2004","review":"I feel a bit guilty, reading some of the other reviews posted, but I liked MASTERS OF THE UNIVERSE! Perhaps because I was never 'into' the cartoon series, I am more forgiving of characters or plot devices left out, and I certainly recognize that it is derivative of both STAR WARS and FLASH GORDON (particularly in Bill Conti's bombastic musical score), but there is so much energy in the film, such abundant confidence in the ultimate victory of Good versus Evil, and such a wonderfully campy performance by Frank Langella as rubber-masked Skeletor that I get a kick out of it, whenever it airs.<br><br>Physically, no actor could be more perfect as the hero, He-Man, than ROCKY 4's Dolph Lundgren. At 6'6\" (that's two inches taller than JOHN WAYNE, trivia fans!), with flowing blond hair and blue eyes, the 30-year old Swedish actor combined a Herculean physique (if Marvel Comics' \"The Mighty Thor\" is ever filmed, he would be perfect as the Thunder God), with a knack for weapons that would earn him the future title of 'King' of 'B' action flicks. True, his English was so poor at the time of filming that his dialog was kept to a minimum, but who watches this kind of film for dialog, anyway?<br><br>Supporting Lundgren's He-Man is crusty veteran soldier, Duncan (Man-at-Arms), played by character actor Jon Cypher, who makes up for He-Man's taciturn nature by reminiscing constantly about a life in the military (with observations EVERY soldier has made, through history), and his daughter, Teela (pretty Chelsea Field, one of the busiest actresses of the decade), serving as a \"Xena Lite\" for the proceedings.<br><br>Opposing the Forces of Good with the irreplaceable Langella is one of my favorite actresses, Meg Foster, as the sublimely wicked Evil-Lyn, using her piercing green eyes and barely suppressed sexuality to great advantage. With an array of the cartoon's more colorful villains in support of Skeletor and Evil-Lyn, He-Man has his hands full!<br><br>The plot involves a tonal 'key', created by a dwarf, Gwildor (screen legend Billy Barty, in an initially irritating, but eventually endearing role), that can transport individuals wherever they desire. Stolen by Evil-Lyn, Skeletor uses it to capture He-Man's Castle Greyskull and it's resident Sorceress (\"St. Elsewhere\" alum Christina Pickles). With a hidden prototype 'key', Gwildor leads our heroes into the castle...where they are nearly captured by Skeletor, before the dwarf throws together some random numbers, and transports our heroes...to Earth.<br><br>The 'key' is lost, as the four arrive on our planet, to be found by aspiring musician Kevin Corrigan (\"Star Trek: Voyager\" star Robert Duncan McNeill) who thinks it's a Japanese musical instrument! With girlfriend Julie Winston (future \"Friends\" superstar Courteney Cox, looking young and gorgeous), the pair are astonished by the musical complexities of the device, unaware that each time it is 'played', Skeletor is getting a better 'fix' of it's location. Eventually, our planet is pinpointed, and Skeletor leads an army of villains to subdue us, and capture He-Man. <br><br>With great comic support by bald character actor James Tolkan (BACK TO THE FUTURE), as a bewildered police detective, some spectacular 'set' pieces (Skeletor's invasion force, backed by 'Darth Vader'ish music, is a highlight), and an ending that concludes that \"ANYTHING is possible\", MASTERS OF THE UNIVERSE is great cheesy fun! <br><br>Certainly, the film is not a classic, but if you accept it on it's own terms, I think you might find it to be a lot of fun!","user":"cariart","rank":[66,75]},{"title":"Perfect example of low-budget sci-fi goofiness but holds a certain charm","rating":7,"date":"8 October 2012","review":"Despite being an epic failure in the eyes of Cannon Films, the live- action \"Masters of the Universe\" movie has built a cult following over the past 25 years. Although it's the perfect example of low-budget sci- fi goofiness, it does hold a certain level of charm for lovers of the Mattel toy line. You have to give director Gary Goddard credit for doing what he could with the money he was given to work with. What can you do when there's not enough cash to throw at fantastical otherworldly sets? You take the fantasy characters and put them on Earth in practical locales that don't cost as much money to build. That's what we get with \"Masters of the Universe.\"<br><br>He-Man (Dolph Lundgren) and his band of warriors are accidentally transported to Earth by a powerful key which will give Skeletor (Frank Langella) the ultimate power to rule Eternia. Skeletor sends his evil henchmen and army to find the key before He-Man does. Things get more complicated when the key is found by two teenagers (Courteney Cox and Robert Duncan McNeill) who think it's a musical instrument. They soon find themselves in the middle of a universal battle between good and evil.<br><br>http://contributor.yahoo.com/user/849014/eric_shirey.html","user":"ersinkdotcom","rank":[12,13]},{"title":"Silly but Entertaining","rating":5,"date":"18 June 2017","review":"On the planet Eternia, Skeletor (Frank Langella) and his dark army overthrow the Sorceress of Castle Grayskull (Christina Pickles) expecting to acquire her power. He-Man (Dolph Lundgren), his old friend Duncan \"Man-at-Arms\" (Jon Cypher) and his daughter Teela (Chelsea Field) are attacked by Skeletor's soldiers and they defeat them. They also rescue their prisoner, the inventor and locksmith Gwildor (Billy Barty). He explains that he was lured by Evil-Lyn (Meg Foster) that used his invention Cosmic Key to open the gates and seize the Castle Grayskull. He-Man and his friends retrieve the prototype of the Cosmic Key trying to release the Sorcereress but they are defeated by Skeletor and his army and Gwildor uses his key to open and portal for them to flee. They come to Earth but lose the key. Meanwhile Julie Winston (Courteney Cox), who grieves the loss of her parents in a plane crash, and her boyfriend Kevin Corrigan (Robert Duncan McNeill) find and activate the key, believing it is a foreign musical instrument. On Eternia, Evil-Lyn locates the Cosmic Key and Skeletor sends her with a group of mercenaries and soldiers to vanquish He-man and his friends and bring the key back. Will they succeed?<br><br>\"Masters of the Universe\" is a silly but entertaining fantasy adventure film. The movie is a ripoff Star Wars, with the introductory credits rolling on the screen, the score and Skeletor's army, and Conan, with the strong Dolph Lundgren. The plot has silly moments, like Julie delivering the Key to her deceased mother or the comic attitudes of Detective Lubic. But \"Masters of the Universe\" is cult and entertaining for the fans. My vote is five.<br><br>Title (Brazil): \"Mestres do Universo – O Filme\" (\"Masters of the Universe – The Movie\")","user":"claudio_carvalho","rank":[14,16]}]