[{"title":"fun trash with an all-star cast","rating":6,"date":"6 May 2002","review":"\"Evils of the Night\" involves two extraterrestrial women (Tina Louise and Julie Newmar) who hire a couple of idiot rednecks to kidnap and kill 'teens for them, so that they can use the blood to prolong their race (or something like that).  I saw this movie in a theater by a fortuitous accident when it was released in 1986:  the print of the just-released \"Nightmare on Elm Street\" had failed to arrive, so the theater owners were showing \"Evils...\" in its place.  My friends and I laughed the whole way through, and were delighted by the many familiar faces in the cast - we never thought we'd see Julie Newmar again!  If, like myself, you enjoy following the careers of grade-B stars, you'll get a kick out of this obscure piece of low-budget gore/horror schlock.","user":"junagadh75","rank":[26,28]},{"title":"Even though Gilligan bungled every rescue, did Ginger prefer this? Oh well. Thanks for everything, Julie Newmar!","rating":10,"date":"21 December 2005","review":"My 10/10 rating of course only applies to the sorts of people who've decided that they like this movie even before they watch it (like me); for anyone else, this movie is a total zero. \"Evils of the Night\" has some aliens seeking human blood as the key to eternal life. And what luck! There's a bunch of horny teenagers camping out near a lake! When I saw the box in Movie Madness, it mainly caught my eye due to the casting of Tina Louise; after all, what man wouldn't want to be stranded on an island with Ginger Grant? Anyway, here she plays one of the aliens, and Julie \"Catwoman\" Newmar plays another. As for the horny teens, they're the kind of characters who horny teens are supposed to be in horror flicks: the boys are a bunch of sex-starved goof-offs, and the girls all have giant breasts. Will your sex drive get going while watching \"Evils of the Night\"? Let me put it this way: aside from making one think about Ginger Grant, probably a quarter to a third of the movie shows people having sex. And those girls were hot! Hubba hubba...<br><br>Some people may think that these kinds of movies are completely worthless, but I must disagree. \"Worthless\" in my opinion means that it pretends to be important but doesn't actually amount to anything. This movie doesn't pretend to be anything but nice, silly fun. Cool.","user":"lee_eisenberg","rank":[29,34]},{"title":"Another treasured discovery...","rating":3,"date":"3 February 2004","review":"Right from the opening, depicting something resembling a customized mobile home floating through space, you know this is something special. A low budget space ship lands in the middle of the woods - this contains alien scientists John Carradine, Julie Newmar, and Tina Louise. Using a hospital as a base of operations, they set out to fulfill their mission; to gather blood platelets from young Earth people and send the stuff back to their home planet. Platelets, it seems, are the key to eternal life. They hire two mechanics (Aldo Ray and Neville Brand) to handle the dirty work of capturing unwilling donors. And what luck - nearby there are a group of perfect specimens on a camping trip...<br><br>First of all, the cast is amazing. Carradine and Newmar - no strangers to this terrain - actually manage to pull their roles off with style and dignity. Aldo Ray was probably used to this kind of movie as well, having already appeared in such things as Mongrel and Biohazard - while Tina Louise was `Ginger' on Gilligan's Island. Neville Brand had a distinguished record in World War 2, and afterward found his way into a major Hollywood career, specializing in westerns during the fifties - and notably played Duke, the embittered POW in Stalag 17. In this, his last film, he plays the role of Ray's lackey - and actually appears to be enjoying himself, even while unpleasantly ogling and pawing his captured female victims. Also worth mentioning is the fact that the victims and potential victims are not just cardboard cut-outs, and you actually like them.<br><br>Is this movie any good? Well, let me put it this way - it's dumb and cheap and sleazy - but that's exactly what it's intended to be. It would have been a perfect feature on the late, great USA Up All Night, as it's very much in that \"style\". For the people who consider that a recommendation, dive right in.","user":"Sanguinaire","rank":[32,38]}]