[{"title":"One of my all-time favourites.","rating":10,"date":"25 March 2004","review":"Surprisingly, Roald Dahl (author of Charlie &amp; The Chocolate Factory, on which this film is based) reportedly hated this big screen version of his book. There's no denying that the book is sheer genius, but in all honesty this film adaptation is exceptionally well made too. In fact, it comes high up on my list of all-time movie favourites.<br><br>The Wonka Chocolate Factory is an amazing building from which some of the most scrumdiddlyumptious sweets are delivered to the world's candy stores. Wonka-mania hits the world when five golden tickets are hidden inside packs of Wonka bars - for the winners will be granted a tour of the top-secret factory. Young Charlie Bucket, a poor boy whose family cottage lies within sight of Wonka's factory, dreams of becoming a winner - but with barely a penny to his name, does he have a chance?<br><br>What makes Willy Wonka and the Chocolate Factory such a success is the way it skillfully blends entertainment and a serious underlying moral. Each winning child is exposed as being rotten-to-the-core, then dealt with harshly and dismissively by Wonka. Seeing these awful brats get their come-uppance is hilarious, enjoyable and - on a serious level - quite eye-opening (it's as if parents in the audience are being told how to prevent their children from turning bad). Gene Wilder was simply born to play Wonka (every eccentric phrase, every bemused expression, and every mischievous glance is judged to perfection). The film's set design is fabulous, with particular high-spots including the chocolate room, the egg room and the wacky corridor which gets smaller and narrower the closer you get to the end. Willy Wonka and the Chocolate Factory is simply magic - a film that everyone must see, especially parents whose kids are just becoming that bit too big for their boots!","user":"barnabyrudge","rank":[124,146]},{"title":"Timeless.","rating":10,"date":"30 September 2001","review":"Willy Wonka and the Chocolate Factory is a truly magnificent piece of filmmaking and remains one of the most fascinating and wonderful adventure films ever made. One of the things that makes this film so intriguing is that it could have been made at any time. I mean, just from watching it, you can't really tell when it was made. It has been one of my favorite films for almost 20 years now, and it wasn't until today that I actually realized when it was made. Watching it again last night, I had convinced myself that it was made sometime in the early to mid 80s, and I was shocked to find out that this year is the movie's 30 year anniversary. Until now, pretty much the only movie I associate with 1971 is A Clockwork Orange, and it's just strange for some reason to find out that this classic movie was made so long ago.<br><br>At any rate, Willy Wonka is a tremendously imaginative and inspiring film. It's a family film, but one of the most important aspects of a family film is that it has to be enjoyable for a variety of ages. This is what makes movies like Toy Story and Shrek such huge successes- the adults will love it just as much as the kids are sure to. Hence: `family' film. On the other hand, this is also the downfall of such other movies that are strictly for a much younger audience, like Cats &amp; Dogs. The makers of Willy Wonka and the Chocolate Factory understood this very well, and you can see that just by the way that the cast is divided. Here are all of these kids (funny how it was only kids who found those golden tickets) who were at this candy factory, and they had each elected to bring one of their parents with them as the one admissible member of their family who was allowed by Wonka to accompany them to the factory. <br><br>One of the best elements of this film is the excellently written script and, even more, the songs. These are some of the best songs in any movie ever made, rivaling even the best of the songs from Disney's films (hey, some of them are really good). There are, of course, some exceptions, such as `Cheer up, Charlie,' which I have been fast-forwarding through for as long as I can remember, but for the most part, the songs are fun to listen to and they pertain to life outside the movie. They are not just songs about the candy-making genius of Willy Wonka or the excitement of being able to tour his mysterious factory, but they are about life in the real world. They're about believing in yourself and being motivated in life (`Anything you want to, do it. Want to change the world, there's nothing to it'), but there are also some that have to do mostly with the movie but are still just as enjoyable, such as the classic song that Wonka sings in the tunnel on board his boat (curiously named `Wonkatania'), which was creepily covered by Marilyn Manson a couple of decades later. <br><br>The dialogue in the film contains some of the most interesting little tidbits in the entire movie. Wonka's lines, in particular, are wonderfully strange and amusing (`A little nonsense now and then is cherished by the wisest men.'). He is a truly eccentric and fascinating man, and Gene Wilder captures the character flawlessly, as he delivers the lines from the brilliantly written script. Willy Wonka and the Chocolate Factory is one of those rare movies that comes along and completely changes the way that fantasy films are made. It's all about having fun in life and being hopeful against all odds and, most of all, being able to have fun in life. There are times when you have to let things go for a while and just act like a kid. Eat candy, run around and play, steal fizzy lifting drinks and bump into the ceiling that now has to be washed and sterilized, it doesn't matter as long as no one's looking. That's such a trivial little quirk of Wonka's (who sterilizes their ceiling?) that it becomes obvious that the movie is trying to say that it's okay to break the rules every once in a while. Have fun in life. <br><br>Besides being absolutely mouth-watering (to this day, I still fantasize about sinking my teeth into one of those gigantic gummy bears), the movie is an uplifting adventure that warms the heart and sends people of all ages away with fairy tale candies dancing in their heads and wonderful songs just behind their lips. It is an always-welcome vacation from reality for people of all ages, and it should always be remembered and loved for that. This movie will ALWAYS be a must-see.","user":"Anonymous_Maxine","rank":[137,162]},{"title":"Gene Wilder revealed...","rating":9,"date":"20 May 2005","review":"Most excellent works in the arts are seen and enjoyed at a variety of \"levels.\" That is true of this movie in general and of Gene Wilder in specific.<br><br>Wilder has been known in the circles of movie creators as a creative genius for many years. Here, his acting ability showcases that genius. To be sure, at the level of good fun for kids and Moms and Dads, he comes through. But writers must have loved his work. Watch for the \"look\" in his eyes. You will see \"changes\" in them as he speaks or as he listens to the kids. Those unheard, barely seen changes can be read many ways. And that is the genius. They put more into the lines than the words themselves.<br><br>Art should be clearly and quickly understood. It should also be the tool used to make us wonder a bit. Think a little. Or find meaning we didn't see at first look. <br><br>In this movie, Gene Wilder's almost imperceptible nuances speak volumes.","user":"brundage3","rank":[128,152]}]