[{"title":"Long, Absorbing Drama","rating":8,"date":"28 September 2010","review":"A rich and powerful landowner tries to make a man out of his tenderfoot son while dealing with an illegitimate son and an estranged wife. This is perhaps the finest drama Minnelli ever made, as he elicits terrific performances from his stars. Mitchum is perfectly cast as the hard-drinking womanizer who has some regrets. Parker occasionally goes overboard but is otherwise fine as his estranged wife. Peppard turns in arguably his best performance as Mitchum's son from a dalliance with a maid. Even Hamilton does well in a role that seems to be tailor-made for Anthony Perkins. This long and absorbing drama is marked by good cinematography and score.","user":"kenjha","rank":[21,21]},{"title":"George Hamilton Leaves Home","rating":8,"date":"19 December 2010","review":"In 1960s Texas, real estate tycoon Robert Mitchum (\"Captain\" Wade Hunnicutt) is wounded, by the husband of one of his many feminine conquests, during a hunt. Young handy-man George Peppard (as Raphael \"Rafe\" Copley) comes to Mr. Mitchum's aide. Nobody talks about the fact, but Mr. Peppard is Mitchum's 22-year-old illegitimate offspring. Mitchum employs Peppard, but does not officially recognize him as a son. Mitchum's \"legitimate\" son and heir is gangly good-looking 17-year-old George Hamilton (as Theron Hunnicutt). Peppard chain-smokes, swings a rifle, and does other manly things. Mitchum beds women.<br><br>But, young Mr. Hamilton is known as a \"mama's boy.\" He gets his main nurturing from mother Eleanor Parker (as Hannah). Though still sexy, Ms. Parker keeps her bedroom door locked. The film top-bills Mitchum and Parker, but deals mainly with the \"coming of age\" story concerning Hamilton's character, how it effects others in the cast, and uncovers buried emotions. Described as \"wet behind the ears,\" Hamilton is taught how to hunt \"like a man\" by brotherly Peppard. Then, he is encouraged to ask pretty Luana Patten (as Elizabeth \"Libby\" Halstead) out for a date. Hamilton figures out what to do with her on his own...<br><br>Beautifully adapted by Irving Ravetch and Harriet Frank Jr., from a William Humphrey story, \"Home from the Hill\" is a surprisingly effective indictment of illegitimacy. Director Vincente Minnelli manages the material exceptionally well, bringing the characters and situations to life; this is absolutely necessary, since the basic story is very often told. Known mostly for his musicals, Mr. Minnelli received award nominations from the \"Director's Guild\" and \"Cannes Film Festival\".<br><br>His theatrically poetic performance won Peppard a \"Supporting Actor\" award from the \"National Board of Review\". This group placed the picture at #7 for the year and gave Mitchum a combined \"Best Actor\" award for \"The Sundowners\" and \"Home from the Hill\". Peppard was also nominated by the British Academy and \"Film Daily\" in supporting and newcomer categories. The later noted Ms. Patten in the juvenile category, but \"The New York Film Critics\" polled her at #8 as \"Best Actress\".<br><br>In the critics' mind, Hamilton seemed to be playing second fiddle to Peppard, but he had just received similar accolades, for \"Crime &amp; Punishment, USA\" (1959). Hamilton makes you believe he is the naive teenager he is playing. Watch Hamilton in the scene he plays with mother Parker, after several hours on a picnic with girlfriend Patten. From the moment he walks in the door, Hamilton leave you with no doubt about what the couple has been doing. Now, that's \"method\" acting.<br><br>******** Home from the Hill (3/3/60) Vincente Minnelli ~ George Hamilton, Robert Mitchum, George Peppard, Eleanor Parker","user":"wes-connors","rank":[16,16]},{"title":"very underrated","rating":10,"date":"10 May 2000","review":"I think this is Vincente Minnelli's great unsung film and may in fact stand as his best. It features one of Robert Mitchum's most perfect performances. The movie is provocative in terms of its ideas of manhood(some of its themes, particularly those concerning hunting, are very Hemingway-ish)This movie also presents a way of living that is today becoming increasingly anachronistic and unpopular. It is for this reason also that it is so fascinating - it presents a window to an ever diminishing way of life. Of course it is first and foremost a melodrama, but this aspect I found to be often overshadowed by the secondary themes and the little details, like Robert Mitchum's den (was there ever a room that defined machismo the way this one does?).","user":"A-No.1","rank":[44,48]}]