[{"title":"Like a dream, some things can only be experienced to understand","rating":9,"date":"24 November 2000","review":"This film has some of the most beautiful imagery and haunting music ever. (Not to overstate it or anything) A three hander set in a post apocalyptic Oz outback (but one which is wildly more fantastical than Mad Max), Spirits of the Air tells the story of Smith, a stranger on the run who happens upon Felix and Betty, far into the desert.<br><br>All around them are amazing images of cars buried into the ground like totems, huge flags blowing madly in the desert wind and their house itself is of the old oz pioneer style but decorated everywhere with crucifixes. Felix is an inventor obsessed with flight and making a glider, an obsession which has already left him in a wheel chair. Betty is one of the truly great film characters, just an absolute tripper - I can't describe her but the performance is a delight.<br><br>This is not a fast film, it is not action packed but is intense - the imagery and art direction are beautiful, the writing is distinct and very Australian but still universal, the soundtrack is haunting (a lot of windsound montages with a simple tune used to great effect) and the performances are both real and surreal.<br><br>Until you see this film (and for those who have enjoyed the increasingly brilliant work of Alex Proyas, you really should) you won't know what you are missing.<br><br>(By the way, to the @$#%ing mongrel who stole my Japanese import copy of the soundtrack on CD may you be locked in a room with Betty for a very long time)","user":"colsim","rank":[35,39]},{"title":"DP & Editor & Art Director","rating":10,"date":"16 December 2007","review":"Director of Photography : David Knaus - ACS,<br><br>Editor : Craig Wood,<br><br>Art Director : Sean Callanin,<br><br>Sound design : Peter Miller,<br><br>Producer : Andrew McPhail. Shot on location around Broken Hill, Australia, this film was the first feature length film by director Alex Proyas after he completed film school. Filmed at more or less the same time as the music video 'Kiss the Dirt\" by INXS with the same film crew and equipment. 'Spriits of the air gremlins of the clouds' is better known as simply \"Spirits\". Spirits was produced on a super low budget, but none the less the crew did get the minimum wage, and it was much fun to shoot. It was shot on 16mm,and all of the special effects were shot in-camera, including a night scene where a flock of Bats fly past the full moon. Actually tea leaves floating in a fish tank, shooting into a light as the full moon.<br><br>Worth watching.","user":"davidknaus1","rank":[27,33]},{"title":"Simply my favorite film","rating":10,"date":"9 March 2006","review":"Not everyone is likely to appreciate this quirky piece of art to the extent that I do, but in my opinion it is one of the most unique and beautiful celluloid creations to come out of the Southern Hemisphere since the 80's. It's the closest I've come to feeling like I'm watching a live play and yet the surreal panoramic desert scenes open the stage up in a way that could never be achieved in a theater. The characters are absolutely charming in their eccentricity, and despite the fact that they are, (on purpose I expect) slightly caricatured, it seems to fit in totally with the alternately gaudy and melancholy feel of the environment. The score is a haunting blend of inspired minimalist electro pads and creaky violin, that conjures up perfectly the sun-bleached skulls, the tumbling weeds and the pathos of the two characters caught in their own cycle of madness and humanity. Some of the dialogue also happens to be vastly funny in it's own nutty way. A circus of the grotesque, simple and amazing. The simple plot which speaks of broken dreams and desperate hope is childlike and touching. I don't claim to be an experienced film reviewer, just an enthusiast who loves this one.<br><br>I like all Alex's films, with the possible exception of The Crow, but I think this early piece is the one that touches my heart the most. Yay for the guts to be original... Please when can I get it on DVD?","user":"drella-3","rank":[21,25]}]