[{"title":"The voice of innocence whispers in our ears...","rating":10,"date":"4 February 2005","review":"Is it really possible that this luminous masterpiece is a first feature film? It is as though Mozart had started his career in composition with one of his mature symphonies. What is totally special about 'Badlands' is the visual control that Terrence Malick applies to the story, and his use of fabulous music to embed his amazing images in our mind. The 'Bonnie &amp; Clyde'-ish story could have been turgid, but Malick turns it into a mythic journey.<br><br>At the heart of Malick's method is the fabulous interior monologue by Holly explaining and ironically commenting on the story. \"Kit made me take my schoolbooks so I wouldn't fall behind with my studies...\". This has been characteristic of each of Malick's films - Linda in 'Days of Heaven' and Witt in 'The Thin Red Line' have somewhat similar monologues - and 'New World' is monumentalised by the haunting monologue/montage with which it ends. Here it totally sucks the viewer into the story and makes the montages that it accompanies into, just about, the high-point of seventies cinema. <br><br>Alongside this, Malick uses some of the most haunting music in existence. Whether it is Carl Orff or Nat King Cole, Malick transports us with fabulous romantic imagery that perfectly balances it.<br><br>I started on this comment determined not to use the word 'poetry', but I just can't avoid it. With nearly all filmmakers, including very great ones, the style that they present is very much prose - great prose, perhaps, but firmly rooted on the ground. With Malick, we are taken, emotionally, to the stars by the lyric magnificence of the totality of his vision.<br><br>It is said that Welles learned cinema by watching John Ford's 'Stagecoach' before embarking on 'Citizen Kane'. Every young filmmaker should watch this amazing masterpiece again and again and again and inform their work with Malick's matchless sense of true cinema.","user":"Balthazar-5","rank":[154,194]},{"title":"Badlands, you gotta live it everyday...","rating":9,"date":"28 November 2004","review":"It's really a shame that Terrence Malick didn't have the brilliant career he deserved at Hollywood. Shot with a nearly shoestring budget, \"Badlands\" remains one of the most dazzling debut movies of all time. Malick's legend based on his (long) absence has helped it to become a cult-movie. Inspired by a tragic short news item which took place in 1959 (a young couple who decides to commit a series of free murders to leave a mark in history), the odds are that Malick's first feature-length movie inspired Oliver Stone and Quentin Tarantino for their dangerous and irresponsible \"Natural Born Killers\" (1994). Concerning Tarantino, I read an interview about him in which he expressed his admiration of Malick's work. It shows that the author of \"Pulp Fiction\" (1994) has a great esteem for this talented and mysterious film-maker. At the same time, we can also note down that Malick's work inspired Bruce \"the Boss\" Springsteen two songs: \"Badlands\" on his \"darkness on the edge of town\" album (1978) and \"nebraska\" on the eponymous LP(1982).<br><br>An American journalist had written that \"Badlands\" was the best mastered movie in the history of cinema since \"Citizen Kane\" (1941) by Orson Welles. One can judge this affirmation as exaggerated but it is nevertheless indisputable that Malick's opus strikes on numerous aspects: an assertive and opaque story, a fluid making, a relevant screenplay, an original photography which gives to the landscapes an image of desolation and lost paradise perturbed by a free violence. The work is also strongly steeped in a certain poetry.<br><br>Concerning the two main characters, a French critic had written that it was difficult to feel liking for these two irresponsible. I think that this critic badly analyzed the film. Terrence Malick doesn't try to make them likable to us. He describes them without kindness and condescension. They haven't got an imposing personality and live only through an intermediary myth. It is particularly obvious for the young man (Martin Sheen) who is obsessed with James Dean. One can also say that Sissi Spacek's voice-over which tells this dramatic story is of an amazing neutrality. Then, unlike many criminal lovers, Sheen and Spacek will live at the heart of this violence and the latter won't bring them together or take them away.<br><br>With \"Badlands\", Malick was judicious for the choice of the actors. In a way, his first movie enabled to put Sheen and Spacek on the map and it also launched their respective careers. Then, what happened to Terrence Malick after this sensational debut movie? A second movie, \"Days of Heaven\" (1978) starring Richard Gere as successful as \"Badlands\". After that, for twenty years, nothing. However, in 1998, Malick made a rather successful come-back with \"the Thin Red Line\" (1998). According to the latest news, he would currently shoot a movie about the first years of America's colonization in the beginning of the seventeenth century. If my memory serves me well, the movie will be released next year. Let's hope so...<br><br>Like this?try these....<br><br>\"gun crazy\" ,Joseph H.Lewis ,1950<br><br>\"you only live once\" Fritz Lang,1936<br><br>\"Bonnie and Clyde\" Arthur Penn,1967","user":"dbdumonteil","rank":[128,168]},{"title":"Landmark film. One of the best directorial debuts","rating":10,"date":"3 June 2005","review":"Kit is a garbage man, Holly just a teenager living with her father. Kit and Holly get together and Holly's father disapproves. Kit kills Holly's father and together they go on the lam and a few others get killed in the proceedings.<br><br>This 1973 landmark film was the directorial debut of one Terrence Malick. It's been described by many as one of the most mature debuts in film history. The numbness of Sheen's and Spacek's characters is haunting and makes a very strong point and it's very hard to swallow. Spacek's voice-over, which tells how she experiences life with Kit, is disturbing and yet, poetically beautiful. The sheer innocence of her character, her bright-eyed view of the world, her acceptance of Kit's explanations make a stronger point in the examination of two completely alienated individuals than any other movie I can think of.<br><br>Martin Sheen has never been better than here. His Kit, obsessed with James Dean apparently, is one of cinema's coldest villains. His utter detachment in all the proceedings is a wonder to behold. He's completely numb and that's more haunting than any outburst of rage. He's a flawed product of society. He doesn't feel evil, he just doesn't feel anything. Sissy Spacek is also wonderful in her role, giving a very memorable performance as Holly.<br><br>Terence Malick's direction is superb. The cinematography by Tak Fujimoto is beautiful, every frame simply looks stunning and he captures the era wonderfully. It's hard to believe this film is over 30 years old. The music is also very good, with a catchy melody which seems to go well the innocence portrayed in Spacek's character. This almost feels like a children's tune.<br><br>This film is considered to be loosely based on the real life killing spree committed by Charlie Starkweather and Caril Ann Fugate in 1958. Starkweather was executed and up until his last day alive, he said that Caril was just an observer but finally said she was as guilty of the killings as he, even initiating some herself.<br><br>Badlands however says in the end credits that the story is fictional.<br><br>One of the best films of the 1970's.","user":"ODDBear","rank":[86,114]}]