[{"title":"Influential Silent Classic","rating":8,"date":"22 March 2005","review":"Although this 1920 German silent does not really rank alongside the truly great silent films, it remains a fascinating oddity. Based on European Jewish folklore, it tells the story a Jewish community in Prague which is threatened with expulsion from the city. In an effort to protect his people, Rabbi Loew creates a man-like creature made of clay and uses it to impress the Emperor. Unfortunately, the magic backfires, and when the Golem falls into the hands of the Rabbi's perfidious assistant disaster results.<br><br>Much of the film's charm is in its visual style. The sets by Hans Poelzig are a strange but cohesive mixture of medieval, nouveau, and surrealism, and the cinematography by legendary photography Karl Freund uses high contrast black and white to truly remarkable effect. The Poelzig-Freund combination would cast an extremely long shadow, and THE GOLEM would influence not only such German films as Fitz Lang's METROPOLIS but the entire cycle of 1930s American horror films that began with the 1931 Bela Lugosi Dracula.<br><br>Several plot devices and the look of the Golem, as played by Paul Wegener, would also prove particularly influential for director James Whale's famous 1932 FRANKENSTEIN. Whether or not Boris Karloff or make-up artist Jack Pierce knew the film is uncertain--but Whale, who was fond of German cinema, certainly did, and traces of THE GOLEM can be seen throughout his most famous works.<br><br>Over the past several decades a number of film historians have attempted to reinterpret THE GOLEM in light of the Holocaust. There may actually be a certain validity to this, for although the Jews are portrayed sympathetically they are very clearly outsiders, and their religion seems less like religion than witchcraft--and indeed Rabbi Loew might be said to practice black magic in bringing the Golem to life. This sense of social estrangement and religious stigmatism does seem indicative of the anti-Semitism that will ultimately explode into furnaces of Nazi Germany. All the same, it is worth noting that THE GOLEM is a fundamentally Jewish story to begin with, and it is perhaps best to think of it in those terms instead of using hindsight to impose modern meanings upon the film.<br><br>There are several home market releases of the film. While I have not seen it, I am told the Timeless Studios VHS release is weak; I have, however, seen the Gotham DVD release, and although there are some quality issues this inexpensive DVD is not at all bad. Still, my preference and recommendation is the Kino DVD. Unlike many Kino editions, it does not have anything significant in the way of bonuses, but the overall presentation is very fine and likely represents a best-possible presentation short of full digital restoration.","user":"gftbiloxi","rank":[44,49]},{"title":"A different kind of German silent horror film.","rating":8,"date":"26 January 2001","review":"At the beginning of the DvD's \"scrapbook\", there is a quote from Paul Wegener that says he never thought the Golem was an expressionist film. Watching it right after seeing Nosferatu, that statement becomes believable. Despite amazing sets that would have been at home in Caligari, in story, in acting, and in overall tone, The Golem is a much more naturalistic film. Watching it with my son, who is 16, he was struck by its uncomfortable prefiguring of Jewish persecution.  I was impressed by the the scarcity of romantic cliches in the story.  The golem itself is clearly the ancestor of the Frankenstein monster.  Full of wonderful images and interesting as a predecessor of the Universal monster films, The Golem is also very entertaining as a story and as a piece of dramatic film making.  Highly recommended.","user":"austex23","rank":[26,28]},{"title":"A Gothic Classic","rating":8,"date":"4 August 2005","review":"When I see these old attempts at what amounted to a horror film back then, before my time and I'm an old duffer, I'm always struck at the marvelous Gothic quality wrought by the twisted buildings, the gnarled stairways, the open balconies and the weird angles of things such as doorways, arches, street, bridges and the like. The monstrosities are stark, hardly terrifying by today's CGIs and often terrifying their victims in an almost comical, stylized way. This marvelous film together with Nosferatu and The Cabinet of Dr. Caligari are marvelous pieces of art. There is an ageless quality to them that transcends the hoary and often corny plots and acting. Each must be taken as a whole because that product is always greater than the sum of their parts. Compare the magical Indian Love Call of Nelson Eddy and Jeanette MacDonald, two rather mainstream singers whose voices blend into something greater than either of their individual talents. So too it is, I contend, with these old Gothic classics. Horror? Hardly. But, their starkness and darkness with its twisted surroundings are still eerie and provoking.","user":"artzau","rank":[34,38]}]