[{"title":"Better than average","rating":8,"date":"4 April 2003","review":"'Ma yong zhen' or 'Boxer from Shantung' in the dubbed videocassette version I viewed is a long film but engrossing, showing the rise of Ma Yung Chen from lowly labourer to gang boss.<br><br>The film has a strange melancholy air, ending with some of the characters fleeing from Shanghai as war approaches. The music has also a sad feel to it. Avarice is the main driving force of most of the characters as they go about their business but over all there is a doomed air.<br><br>Kuan Tai Chen who plays Ma Yung Chen (very well) has a pleasant appealing smile but there is something sad in him too. His yearning to be somebody is touching. He is plausible in the fight scenes too, particularly the tremendous gory fight at the end, which seems to go on endlessly like a nightmare you can't wake up from. David Chiang as usual is great, though not on the screen long enough. The 'four champions' in the film include the Shaw Brothers regular Feng Ku who is always good value.<br><br>I believe John Woo worked as an assistant director on the film and is a fan of the director, Cheh Chang. Compare the end of this film with the end of Woo's 'The Killer'.<br><br>There is a lot of combat in this film but it sits well with the narrative and the characters. Some martial art films are all fighting and no plot but 'Boxer from Shantung' has both in equally good measures.","user":"henry-girling","rank":[7,7]},{"title":"Gangsters meet kung fu in the streets of Shanghai","rating":8,"date":"8 May 2001","review":"BOXER FROM SHANTUNG (aka KILLER FROM SHANTUNG, 1972) successfully combines gangster and kung fu genres to create a compelling two-hour rags-to-riches tale of a poor drifter in early 20th century Shanghai who rises up in the local mob by virtue of his kung fu skills. Ma Yung Chen (played by Chen Kuan-Tai) so impresses the local bosses that he is quickly given his own teahouse and protection racket, yet he remains loyal to his friends, including a hapless little sidekick, and friendly to the poor. He has a run-in with another local gangster, Tan (David Chiang in an extended cameo), but they soon develop mutual respect.<br><br>The kung fu comes in when Ma is confronted by rival gangster Yang, whose henchmen consist of the Four Champions. When Ma beats three of the Champions in their very first encounter, an enmity develops that finally culminates in a massive brawl at a neutral teahouse where Ma takes on dozens of Yang's thugs. In this remarkable fight scene, Ma is hit with an ax but continues to fight up and down the two stories of the building with the ax imbedded in his stomach. It's all shot in the Shaw Bros. studio and backlot in Hong Kong, with some additional work on HK locations familiar to kung fu fans.<br><br>Chen Kuan-Tai (EXECUTIONERS FROM SHAOLIN) was bigger and stronger-looking than most Shaw Bros. kung fu stars and carries the right air of brute force and intimidation in what is essentially the role of a petty gangster. Yet his broad smile, outgoing manner and protective nature give his rough-hewn character a likability that attracts audience sympathy. Ma is not just a standard vengeance-seeking kung fu student forced to learn new styles to beat a more powerful opponent. He is more at loose ends, trying to find his way in the world and not necessarily on the straight and narrow path.<br><br>Aside from Chen and David Chiang, the few familiar kung fu faces in the cast include Cheng Kay Yeh (as Chen's sidekick), Ku Feng (as one of the champions) and Wang Ching. Top-billed actress Ching Li co-stars as Chen's love interest, a singer in the restaurant he runs, although her role is less significant than the billing would indicate. The film was directed by kung fu specialist Chang Cheh, with Pao Hsueh Li given a co-directing credit. The action directors are an impressive lot and include Tang Chia, Liu Chia Liang (Lau Kar Leung), and Liu Chia Yung.<br><br>ADDENDUM: A follow-up of sorts is the similarly-styled MAN OF IRON (1972), also reviewed on this site, which also co-stars Chen Kuan Tai and Ching Li, but gives Ms. Ching a larger, more interesting role. QUEEN BOXER (1974), also reviewed on this site, is an unofficial non-Shaw sequel to SHANTUNG and focuses on the sister of Ma Yung Chen as she arrives in Shanghai and begins a quest for vengeance. She is played by the phenomenal kung fu diva, Chia Ling (billed as Judy Lee).<br><br>In December 2003, Celestial/IVL released a restored, remastered, letter-boxed, subtitled Region 3 DVD of BOXER FROM SHANTUNG. That's the one to see.","user":"BrianDanaCamp","rank":[7,7]},{"title":"Shaw Brothers Mania: The Boxer From Shan Tung","rating":10,"date":"28 May 2004","review":"The Boxer From Shan Tung (1972) is a rags to riches story about a country bumpkin who aspires to become the greatest gangster of his era. Ma Yong Zhen makes a name for himself from the ground up by getting the poor and the down trodden to become a part of his \"empire\". But like all fast rising gangsters they have to fall sometime. The battle in the Tea House has to be the single greatest piece of action film-making I have ever seen. The usual Shaw Brothers players can be found in this two hour plus epic of bloodletting proportions. Kuan Tai Chen stars as Ma Yong Zhen. As usual he makes a great lead actor. He always sports a smile and never let his personal situations bring him down. Kuan also makes a credible butt kicking fighter. David Chiang has an extended cameo as Tan Si, a fellow gangster who becomes a mentor/friend to Ma. Feng Ku co-stars as one of the 4 Champions of Shan Tung, Wang Chung and Hark-On Fung have small roles as Tan Si's henchmen. Ching Li co-stars as the Tea House singer who falls for the mack-daddy charm of Ma Yong Zhen. <br><br>Check out the remastered print from Celestial Films. Not only is the film restored to it's original running time but the picture is in pristine condition and the English subs are excellent. Get ready for some action packed, bone crunching excitement!! Another winner from Chang Cheh and the Shaw Brothers!<br><br>Highest recommendation possible.","user":"Captain_Couth","rank":[12,14]}]