[{"title":"Creepy good vs. evil horror with some great special effects","rating":8,"date":"5 March 2007","review":"I love 80's horror movies but they usually don't scare me; i mostly watch them for gore/special effects/monsters/nudity, etc. you don't find in the watered down PG-13 crap that passes for horror today. I gotta admit this movie actually creeped me out pretty good. THE UNHOLY involves an evil demon that takes the form of a major babe in order to seduce priests so it can claim the innocent for Satan or something like that. It reminded me a lot of the Italian horror movie THE CHURCH which i also enjoyed. Both take place mostly in big Catholic churches and are filled with satanic hallucinations.<br><br>I won't give it away but the opening scene is simply awesome. The movie slows down in the middle but remains stylish with music that almost gives it a similar feeling to the THE LOST BOYS. It also has lots of cool blue and red lighting which makes it look very 80's. (I mean that in a good way, not that the film looks too dated or anything.) It picks back up towards the end and was actually starting to get scary until a couple of cool but funny looking demons show up. There is some sweet gore scenes, cool slimy monster effects, and even some nudity. The pace coulda been a lil faster but the awesome finale makes it well worth it. If you like this i would also recommend THE CHURCH and vise versa.","user":"epeteet","rank":[11,11]},{"title":"Exploding demon midget!!!","rating":6,"date":"15 May 2008","review":"This movie was very entertaining and had some really cool 80's special effects(my favorite). I also watched this on Fear.net for the first time(as a poster stated). I was really wrapped up in the story but when the demon midget exploded I almost wet myself. I don't know why but it caught me off guard. I still chuckle when I think of the scene but it didn't ruin the movie for me. I didn't watch this movie as a kid like most of my favorite horror movies from the 80's but I really enjoyed it. I guess I somehow missed this movie as kid, as I have no memory of it. I don't even remember it on the shelf at my local video store and Southtown Video had a ton of horror movies. Oh well, I guess it was a small town video store after all. I recommend it to any horror fan and especially to 80's horror fans.","user":"avlehs-1","rank":[8,8]},{"title":"Perhaps the only movie featuring a live phone call from Hell.","rating":6,"date":"15 December 2001","review":"\"The Unholy\" is a typical two-star horror effort: serious-minded and with many positive points, but still somewhat disappointing. It has a good basic concept, good (if rather sparse) special effects and a surprisingly distinguished cast (even Trevor Howard, who died the same year, has a small but pretty important role). BUT... it moves kind of slowly, the direction is too often choppy in the wrong places, and when the demon appears at the end, he (or \"it\") seems childishly conceived (although it's technically well-executed) and doesn't fit in an otherwise very serious movie. Anyway, most horror fans WILL probably find this worth a (single) viewing.","user":"gridoon","rank":[16,19]}]