[{"title":"Great Fighting - not more not less","rating":9,"date":"11 October 2006","review":"Yeah, it's a little cheesy, it's a typical Bruce Lee Clone Movie and the story isn't really mentionable (although it's there and even kind of logical.. in the most part). The quality is OK for this time even if there are some bad cuts..<br><br>But if it comes to fighting this one is one of my favorite movies.. I like this \"defeat the Master of one Stage after another\" thing, there are many different fighting styles and one arrogant master after the other plus there's good old Bolo Yeung in his prime role as Executioner of the bad guy - what do you want more ?<br><br>So if you get a Copy and like just plain fighting - enjoy it.","user":"heretic369","rank":[9,10]},{"title":"Enter the Way of the Fist of the Game of Death.","rating":7,"date":"14 February 2019","review":"As its clumsily concatenated title suggests, this film is 100% Brucesploitation, with a role for Enter the Dragon baddie Bolo Yueng and a finale that takes place on the many levels of a tower, as in Game of Death. Star Bruce Le (just the one 'e') even dons a Game of Death yellow and black tracksuit while doing his best impression of Bruce Lee (two 'e's).<br><br>But even though this is derivative stuff designed to cash in on Lee's fame, it's not without merit: Le's martial arts are impressive, his many Lee mannerisms (high pitched squeals, shuffling footwork, brushing his nose etc.) are fun to watch, and there's just enough silliness to ensure that things don't become too monotonous.<br><br>The film quickly gets the plot out of the way in order to concentrate on the plentiful fighting: Chang (Le) accepts a mission to find a secret document before it falls into the hands of the enemy. This leads him to battle a variety of foes, with the highlight being his ascent of a pagoda, each floor guarded by a different fighter.<br><br>Particularly amusing is Chang's battle with a white-haired old man in a room full of snakes, who not only does snake style kung fu, but also does kung fu with snakes ie., he uses the reptiles as weapons, throwing them at Chang and using them like nunchakus. At one point, he bites the head off one of his snakes, spits it out, and sprays blood from the stump at his foe.<br><br>Also rather entertaining are a tussle with a guy who can only fight in red light, the level four fight with Hagrid, several very short altercations with assorted black dudes and Westerners (non-Chinese are clearly inferior warriors), and the inevitable showdown with burly Bolo. In the end, Chang saves the day for China, with a little help from a couple of sidekicks and plucky beauty Lisa.<br><br>While Le certainly isn't on a par with Lee, the almost non-stop fighting from start to finish means that the film should delight martial arts fans, most of whom were probably expecting something far less enjoyable.","user":"BA_Harrison","rank":[2,2]},{"title":"One of the better Clones of Bruce Lee\"-movies","rating":7,"date":"25 April 2013","review":"Must admit that I have been a sucker for martial arts films since a very early age; especially films that would feature Bolo Yeung or a Bruce Lee-clone. If you're familiar with the matter, then you'll know of course that there was a virtual army of Bruce Lee-look-alikes, among them Bruce Le, Bruce Lei, Bruce Lieh, Dragon Lee (there was even a Charles Bronson / Bruce Lee cross, namely, you've guessed it, Bronson Lee) – in other words: enough Bruce Lees to fill a telephone book; making them the Hong Kong version of Elvis-impersonators. <br><br>Most were somewhere between \"laughable\" and \"embarrassing\", but Bruce Le was among the most \"authentic\" of all. He mimics Lee's movements, choreography and characteristic grimacing (the fans may forgive me for my choice of words) to a tit, compensating for an obvious lack of acting talent. <br><br>The story itself is based on Lees final, partially finished \"Game of Death\" and – considering that the original ended up a pure cut&amp;paste job and hence rather dodgy – I dare say, quality-wise it even beats \"Game of Death\". The martial art is hardcore, rough and brutal as they come. <br><br>Bolo, as villainous a henchman as ever, seems to be ever more muscular than ever and to my knowledge it's the only time he ever got to play Japanese (in other words: he's wearing a kimono). Robert Kerver as a Bob Wall carbon copy is a little wasted and Michael B. Christy makes a suitable slimy diplomat-cum-secret-agent, making the audience root for Le(e) to beat the becheesus out and then dispose off unceremoniously. <br><br>And as a bonus: the movie contains one of the three questions that will probably never be answered: was the black fighter in the last half the late, great Steve James or not? I've seen the movie many times and I give it a 50/50 chance – IMDb lists him as \"Black Martial Artist\" but there is also the distinct chance that somebody mistook him with Samuel Walls. <br><br>(The other two questions, by the way, concern Mona Lisa's smile and that thing with the chicken and the egg). <br><br>Compared to 90 percent of the other Lee-Clone-films that I have seen (trust me: there are hundreds), I'd give it a 7/10.","user":"t_atzmueller","rank":[2,2]}]