[{"title":"This used to be one hell of a town, officer.","rating":7,"date":"4 March 2008","review":"Earthquake is directed by Mark Robson and written by Mario Puzo and George Fox. It stars Charlton Heston, George Kennedy, Ava Gardner, Geneviève Bujold, Lorne Greene, Richard Roundtree &amp; Marjoe Gortner.<br><br>A catastrophic earthquake hits Southern California and begins to level Los Angeles...<br><br>\"It's not a negative to have heart in the disaster genre of film\"<br><br>Take yourself to 1974, are you there? Good, now maybe you can appreciate this film a little more? Maybe? Earthquake does suffer from old age, it's a statement we see and hear a lot, but it's a fact that some film's stand the test of time whilst others do not. In this desensitised computer age, it is easy to forget that not all the tools available in film making today were available back when film's like this were being made. So as is my want, I firmly judge this as a 1974 offering, to which it delivers enough entertainment to fully satisfy my genre leanings and entertainment persuasions.<br><br>The main complaint of many is the long build up of the characters, cries of boring can be read across internet forums and critics blogs. I just don't see it that way, yes we want the quake and the mayhem destruction that will follow it, because really this is a disaster film after all, but is it so bad that the film has heart to go with the crash bang wallop? After the build up of characters, where relationships and character traits are formed, the disaster strikes and it doesn't disappoint, utter destruction as effects and noise fill the eyes and ears, where those with a good home cinema system finding it literally does rock the house. We are then treated to a series of sequences that hold and engage our attention, upsetting passages of human sadness, punctured by heroic surges as Heston and the fabulous Kennedy set about saving life, hell! saving the town even. Then it's the film's fitting finale, where there are no cop outs, the makers choosing to go out with a darker edge than the detractors give it credit for.<br><br>Some can scoff at a blood splat effect, or rant about some of the acting on show, but Earthquake achieves two important things. One is that it entertains as a visual experience, the other is that it doesn't soft soap the devastating effects of an earthquake. As the camera pulls away from a ravaged L.A. the impact is sombre, where reflection is needed and most assuredly surely gotten. 7/10","user":"hitchcockthelegend","rank":[39,49]},{"title":"Classy disaster of the 70s with big name cast and decent special effects","rating":6,"date":"25 May 2019","review":"Ordinary catastrophe movie in soap opera and vintage style with all star cast dealing with a huge earthquake outbursts at a noisy city. It has a long prologue presenting Charlton Heston, his drunk wife, Ava Gardner, and his lover, Genevieve Bujold. As well as other characters as a spectacle motorcycle rider, Richard Roundtree, a drunken man, Walter Matthaw, an avenger military, Marjoe Gortner, a besieged beautiful girl, Victoria Principal, and several others. As an earthquake causing death, destruction and wreak havoc. This impressive quake has an awesome and destructive power enhanced by the sensorround sound.<br><br>Acceptable disaster movie paced in fits and starts with a great cast, though a little wasted. The impressive cast cannot save this passable film , at all. It lacks deep characterization , displaying some boring moments and a tiring script that was presumibly well paid . This was a successful catastrophe movie that belongs to disaster movie genre of the 70s and 80s such as Towering inferno, Poseidon, Beyond Poseidon, The swarm, Avalanche, The Russian rollercoaster, Avalanche express , Airport I, II, III.. and whose main representative was producer Irwin Allen. It packs primitive and traditional special effects by LB Abbott , with no computer generator effects .\nIt contains an atmospheric and adequate cinematography by Philip H. Lahtrop. And a sensitive and enjoyable musical score by the always great and incombustible John Williams. Main cast is pretty well, giving understanding interpretations as Charlton Heston, Genevieve Bujold, Ava Gardner and Lorne Greene. Support cast is frankly excellent such as Lloyd Nolan, Victoria Principal, Barry Sullivan, Pedro Armendariz Jr, John Randolph, Scott Hylands, Donald Moffat, brothers Jesse, Alan Vint, Walter Matthaw, George Murdock and usual in catastrophe movies, George Kennedy, among others.<br><br>The motion picture financed by Jennings Lang who produced Airport series was professionally directed by Mark Robson. He was a classical director. Robson had a prolific career, delivering classic movies, as well as hits and flops. He directed some classy terror movies as Ghost ship, Bedlam, The seventh victim ,Isle of dead, all of them produced by Val Lewton. Subsequently, he directed all kinds of genres in films as Peyton Place, The harder they fall, Edge of doom, Champion, Bright victory, Trial , Bridges at Toko-Ri, Return to Paradise, The inn of the sixth happiness, Valley of dolls, Von Ryan express, Last command , The prize, From the terrace, among others. Rating 6/10. Acceptable, passable and decent disaster movie.","user":"ma-cortes","rank":[6,6]},{"title":"\"Earthquake\" of the human mind.","rating":9,"date":"29 May 2005","review":"\"Sometimes, earthquakes bring out the worst in people.\"<br><br>Thus is a line spoken by Sgt. Lew Slade in the last reel of the film \"Earthquake.\" The earthquake(s) in this film are not so much metaphysical, as they might appear to be, but rather in the mind of the average human being in society as we know it today. The human mind is a fragile, and intricate creation, and we as a society must do our best to bring the human living standards to punctilious means.<br><br>L.A.: A high place for society and people of all types, and a place for the danger! The story begins with a high profile roster, starting with Stuart Graff(Charlton Heston) who is a top-of-the-food-chain executive in engineering and constructing \"monstrosities\" in Los Angeles. He is in a desolate marriage to Remy Royce- Graff(Ava Gardner.) He is carrying a friendship-and nothing more-with beautiful actress Denise Marshall(Genevieve Bujold), who lives near Sgt. Lew Slade(George Kennedy) who is being hassled by work and former charges Miles Quade(Richard Roundtree) and Sal Amici(Gabriel Dell) and his sister, Rosa(Victoria Principal.) All people are living frivolous, and in some ways, inspiring lives, of daredevil antics and blithe lifestyles. Then, as the title so perceptively puts it, an earthquake hits L.A. causing reckless mayhem to the buildings and petrifying danger to city inhabitants. But the story doesn't stop there. There are many quakes, and plenty of danger to go around, and that is where the story takes flight. The focus of this film is not the quake itself, but how it affects the people of L.A. <br><br>The film, being extremely Hollywood driven(note: the all-star cast; menacing \"sensurround\" effect) might appear to be presented as a top of the league disaster film of the trend which was popular at the time, and special effects driven, and it might have been, but there are also many artistic qualities to be found here. One has to examine it first. The scariest thing about this film is that it is plausible, though not probable. The other disaster films at the time were all man made disasters(boats upside-downing; Fire spreading through out a sky- scraper) but \"Earthquake\" was the first disaster film to show a disaster that might actually happen, and present characters that people can relate to, in such a treacherous situation. These are real people, and most of them are affected in ways beyond psychological apprehension. But director Robson still manages to make it a fun and enjoyable film without making the situations seem too grim.<br><br>The characters could all be discussed in a psychology class, to be analyzed even, as each one has his/her own story to tell. However, one of the main characters, the \"quake\" itself gets credit too. As there are two jolts, the big quake, and then an unexpected aftershock to boot, there is more than enough rumble to go around. The \"rumble\" though, is lasting through out the characters minds, as each one goes a little crazy after the shake, be it irrational, or rational, as there are many different types of people in society. There is parallel destruction going on as well. As the city is torn apart, so are these people and the way they view life, as one character loses it and blows away some fellow roommates who have mistreated him, while others are healed, as a Sgt. who is a drunk and louse, who shapes up and becomes really responsible after the quake. These specifications may or may not be apprehensive to the average audience, and true, opinion is opinion, but \"Earthquake\" is a good film that demonstrates how we as a society have allowed for far too long the deterioration of our world and all that affects it. This world is not a toy, it needs to be taken care of, and when we as a society are mean to it(and each other for that matter) mother nature strikes back at us.<br><br>Be it a big Hollywood Blockbuster, or social commentary, which ever you choose, this film is a great, and overlooked gem in Hollywood history, and an interesting one to read up on(the special effects were outstanding and won a well deserved Oscar) and study in film classes. Great performances by all as well. Mario Puzo wrote the precursor to the \"Superman\" earthquake with this one, and Mark Robson has a guilty pleasure tone to his directing. <br><br>Great fun.","user":"TruPretender","rank":[45,67]}]