[{"title":"Funny movie.","rating":1,"date":"1 May 2001","review":"This movie is consistent with it's humor throughout.  So many 80s films start out with an original idea but seem to lose site of it halfway through as it becomes a love story.  Not this film, Brewster is trying to spend that money right up until the clock chimes midnight.  One of my favorites by Richard Pryor.  John Candy only added to it's hilarity.","user":"magellan333","rank":[17,17]},{"title":"Great Comedy","rating":7,"date":"28 December 2006","review":"Montgomery Brewster (Richard Pryor) is a down and out baseball player in the lower leagues along with his best friend Spike Nolan (John Candy). Out of the blue he inherits 30 Million Dollars that he must spend in 30 Days and have nothing to show for it, so he can get his real inheritance of 300 Million Dollars; oh yes and he he can't tell anyone why he has to waste all this money.<br><br>This excellent and hilarious story is played out brilliantly by Pryor and Candy, and it takes us on a spending spree that has its up and downs for poor Mr Brewster. Because of the nature of the movies theme, Brewsters millions is quite firmly rooted in the 80's when it was made, but it still entertains with ease and is well worth watching.<br><br>7/10","user":"mjw2305","rank":[27,30]},{"title":"Comedy Gold","rating":8,"date":"24 November 2005","review":"I cant understand the low IMDb rating for what is a very funny film with two great stars in Richard Pryor and John Candy. Even though its a re-make and very much of its time (the 1980's) there is till plenty of entertainment to be had. Some of the areas of the film are still very relevant if you really could vote for none of the above isn't that a better vote than many of todays politicians? In tone this film is very similar to another 80's comedy - Trading Places, although this is the slightly lesser film it's still very enjoyable with plenty of comedy highlights. Pryor is outstanding and with the talented John Candy in support the film certainly doesn't lack laughs. There is even a message attached in places about the perils of greed and money but the ending feels quite abrupt and it would be nice to see the other characters re-action to the outcome.<br><br>8/10 - A bright and breezy comedy.","user":"no-skyline","rank":[22,24]}]