[{"title":"Not terribly audience-friendly, but smart and very, very cool.","rating":10,"date":"10 March 1999","review":"This isn't your average James Bond knockoff spy thriller; the fact that the screenplay is by playwright Harold Pinter is the first clue.  It's a bit strange to see such exquisitely Pinter-esque dialogue (the laconic, seemingly innocuous sentences; the profound silences; the syntax that isn't quite how real people actually talk) in a spy movie, but it really works.<br><br>Quiller isn't your average spy.  He's played by George Segal with a cool superficiality that works very nicely; he doesn't go charging in with guns blazing -- he doesn't even carry a gun -- and the one time he does try to fight his way out of a sticky spot, he gets pounded. The other standouts in the cast are Alec Guinness as Quiller's controller, and Max von Sydow as the leader of the neo-Nazi cell that Quiller is attempting to crack.<br><br>At first glance, the movie is deeply frustrating, and the script appears full of holes, but in fact, it's so smart that it assumes the audience is bright enough to pick up on the breadcrumb trail of clues that it's actually leaving.  All in all, I recommend it, but with reservations.  If you like tidy conclusions and have limited patience with extreme subtlety, this may not be to your taste.","user":"Zerzura","rank":[63,76]},{"title":"They Don't Make 'Em Like This Anymore","rating":6,"date":"28 November 2004","review":"THE QUILLER MEMORANDUM (3 outta 5 stars)<br><br>The 1960s saw a plethora of two kinds of spy movies: the outrageous semi-serious James Bond ripoffs (like the Flint and Matt Helm movies) and the very dry, methodical ones that were more talk than action (mostly John Le Carre and Alistair MacLean adaptations). This is one of the better examples of the talky thrillers. Not that the movie is boring... there is lots of good, cat-and-mouse dialogue courtesy of playwright Harold Pinter. George Segal plays the hero, an undercover spy who goes to West Berlin to find out who killed his predecessor... who was on the trail of modern-day Nazis. Segal has surprisingly little difficulty in finding himself right in the thick of things... being captured and drugged by the baddies... and even having time for a romance with a German schoolteacher who may know more than she lets on. Parts of the movie reminded me a lot of the classic \"The Third Man\"... which I think the director was trying to emulate at times. Well, this is not quite a classic of that caliber but it is a very well-written and smoothly-paced \"old school\" thriller. Segal makes a very cool lead... witty and sarcastic, yet with a vulnerable side, too.","user":"hokeybutt","rank":[61,76]},{"title":"In Berlin during filming","rating":5,"date":"5 October 2002","review":"This film has special meaning for me as I was living in Berlin during the filming and, subsequent screening in the city.  Mind you, in 1966-67 the Wall was there, East German border guards and a definite (cold war) cloud hanging over the city.  I loved seeing and feeling the night shots in this film and, as it was shot on location, the sense of reality was heightened for me.  Very eerie film score, I believe John Barry did it but, I'm not sure.  George Segal was good at digging for information without gadgets.  A bit too sardonic at times, I think his character wanted to be elsewhere, clashing with KGB agents instead of ferreting out neo-nazis.  I feel this film much more typified real counter espionage in the 60's as opposed to the early Bond flicks (which I love, by the way).  Senta Berger was gorgeous! And, the final scene (with her and Segal) is done extremely well (won't spoil it for those who still wish to see it...it fully sums up the film, the tension filled times and cold war-era Germany).  Also contains one of the final appearences of George Sanders in a brief role, a classic in his own right!","user":"MChittum-California","rank":[42,52]}]