[{"title":"What you people don't know would fill a book!","rating":8,"date":"14 April 2005","review":"Many of the posts here are so filled with diatribes and inaccuracies that I had to laugh! One poster complained that the Flying Tigers actually were only flight trainers for the Chinese Air Force, and only lost three pilots in combat. At least two complained that John Wayne was a draft dodger. One stated that the Tigers were in combat two years before Pearl Harbor. One stated that the Japanese were unfairly treated as bad guys in the film. One declared that the Flying Tigers were up against a superior plane in the Japanese Zero....<br><br>First off, the Flying Tigers started training in September of '41 and were disbanded in July of '42. In that roughly ten month period they shot down 286 CONFIRMED kills for the loss of 12 Flying Tigers. They were not \"Chinese Air Force flight instructors!\" Their kill-to-loss ratio remains one of the finest in aviation combat history. Secondly, the Tigers never encountered the Zero in Combat. Their foes were primarily J.A.A.F. pilots, and the Zero was a Navy plane. Third, the Japanese indeed DID SHOOT AT PILOTS in parachutes and in life rafts, whenever possible, because they were taught that the enemy must be killed at all costs, lest he survive to fight you another day. Fourth, the Japanese committed the most UNSPEAKABLE horrors against the Chinese people during WW II, as the book, \"The Rape of Nanking\" can testify to. Fifth, John Wayne was NOT a draft dodger. He had a bum ear due to an infection which rendered him physically 4-F. Sixth, the outdoor sequences of \"The Flying Tigers\" were not filmed in Northridge, California, but rather in the high desert area around Santa Fe, New Mexico, in the (successful) attempt to give the foliage a more \"foreign\" look.<br><br>As to the film itself, I would suggest you go to the Fighter Museum in Phoenix, AZ, or the Air Force Museum in Dayton, OH, and find out just how close the film was to reality. The Tigers WERE usually outnumbered about 8 to 1 in combat. The 3 squadrons of the Tigers DID USE outdoor facilities as shown in the film. The Tigers were indeed mercenaries, paid by the kill, as well as by the month. The Tigers WERE frequently short of spares and fuel. The Tigers DID have nicknames, like \"Tex\" (David Lee Hill) and \"Pappy\" (Gregory Boyington). The Tigers DID have a few beautiful nurses on station. (In fact one of them, Jane Foster, ended up marrying a Tiger, who was subsequently shot down and killed a week before they were to leave for the States.) Truthfully, the only real overt fiction in the film is the pre-Pearl Harbor combat, as in fact, the Tigers did not start combat operation until after Pearl Harbor, (being in training prior to that.) Why is the film so accurate? Because two guys who weren't able to cut it as Tigers decided to take the story of the Tigers to Hollywood to sell it. They were the \"technical advisers\" for Republic, which was able to glean much about the unit from them.<br><br>Leave your politics at home and take a second look. This is actually an excellent depiction of the organization and the men, backed up with a superior special effects unit and a great score. (Both nominated for Oscars.)","user":"markystav","rank":[104,109]},{"title":"Wayne Goes To War","rating":7,"date":"8 June 2006","review":"John Wayne's first war film was one of his best, a solid actioner with Wayne giving great presence as the leader of a fighter squadron doing battle against the Japanese invader over the skies of China in the dark days before the U.S. entry into World War II.<br><br>Wayne plays Jim \"Pappy\" Gordon, a variation on the many flinty-commander-with-heart-of-gold characters he would play in films to follow like \"Sands Of Iwo Jima\" and \"Fighting Seabees.\" Gordon is less flinty than most of them, maybe because his men are volunteers or maybe because his girlfriend Brooke (Anna Lee) is stationed on the same airbase. While the Japanese take their toll on his men, Gordon's toughest job may be keeping peace in his squadron when smug gloryhog Woody Jason (John Carroll) arrives.<br><br>When I first saw \"Flying Tigers\" as a boy, the on-screen gore made the strongest impression. In those days, before pay television, it was something to see a Japanese pilot grab his face, blood oozing through his fingers. Times have changed, of course, but one is still impressed by the well-rendered dogfight sequences, for which Ted Lydecker was nominated for an Oscar. Though it's troubling to be entertained by what amounts to real images of people getting killed, director David Miller manages to incorporate actual combat footage very well into battle sequences that alternate with Lydecker miniature work and shots of actors in their cockpits, better than the more acclaimed director Nicholas Ray later did in another Wayne air war film, \"Flying Leathernecks.\"<br><br>\"Flying Tigers\" contains one key historical inaccuracy: While assembled in the months before Pearl Harbor, the Tigers didn't see action until December 20, 1941. This is an important caveat, but the inaccuracy allows for one of the very first and best examples of that classic movie cliché, where a dramatic scene ends with a glimpse of a desk calendar showing the date \"Dec. 7.\" The scene that follows is one of those Wayne moments that resonated especially in theaters in 1942 and still packs a punch now: Pappy alone by a radio, standing expressionless while a cigarette smolders in his fingers, listening to President Roosevelt declare war.<br><br>Neither Wayne's iconographic stature or final victory against the Japanese were sure things when \"Flying Tigers\" came out in 1942; we tend to take more for granted and give films like this less credit. Wayne was 35 and not a real soldier, yet he came to define the war effort for many. Judging from the way some comments here attack him as a straw dog for present U.S. war policy in Iraq, Wayne's potency as a symbol remains undimmed.<br><br>Climbing off his P-40 after an early mission, Wayne is shown a row of bullet holes on his fuselage. \"Termites,\" he says laconically, before striding away.<br><br>I give a lot of credit here to Miller, who knew what he had in Wayne before anyone else did, and uses the actor's terse authority to great effect. Miller was making propaganda, yes, but effectively and sensitively: We see Chinese children victimized by war, including one shot of a wounded child crying after a bombing clearly modeled on a famous war photo of the period. Unlike other wartime films which went heavy on ethnic stereotyping, the Japanese are seen as skilled, ruthless adversaries who require resolve to face down.<br><br>The film does lose altitude at the end, when Wayne goes off on a hare-brained bombing mission and Carroll has a \"why-we-fight\" epiphany that rings rather hollow. Maybe it's because he's playing a heel, but I find Carroll hard to take, with his Clark Gable mannerisms and the way he seems to always play to the camera rather than the other actors. There's also a little too much melodrama between Wayne and Lee that feels out of place in a war film.<br><br>But \"Flying Tigers\" has weathered the years better than most films of its kind, and is a historic landmark both for its effective action scenes and its pioneering use of Wayne as cultural touchstone. More than 60 years later, it still packs a punch.","user":"slokes","rank":[29,29]},{"title":"Volunteering for China","rating":7,"date":"24 September 2006","review":"The Flying Tigers and God Is My Co-Pilot are the two films out of World War II which are dedicated to the American volunteers who flew for the nascent Chinese Air Force both before and after America officially got into World War II. <br><br>Though this film is based on fictional people it holds up a lot better than God Is My Co-Pilot because it avoids the racial stereotyping of the Japanese. The Japanese are seen, but only in aerial combat shots with no dialog. And it's true they did have a nasty habit of machine gunning fliers while they were parachuting down, no avoiding that.<br><br>The main plot of the film is John Wayne as the disciplined leader of this particular squadron of Flying Tigers based somewhere in western China and an old and rather undisciplined friend John Carroll in a rivalry over nurse Anna Lee. Carroll's irresponsibility causes the death of one man and maybe another.<br><br>Still he's not a bad sort, just an overgrown kid. Carroll actually has the best moment in the film consoling Mae Clarke the widow of one of the Flying Tigers.<br><br>Some nice aerial combat shots are in this film and it really should be seen today to explain some of the Chinese attitudes towards the Japanese today. We got into World War II on December 7, 1941 which in fact the men in Wayne's squadron hear about in the film. The Chinese were essentially at war with Japan starting in 1931 with the Japanese invasion of Manchuria. It was a longer struggle for them than for any other country.<br><br>Other performances of note are Paul Kelly as Wayne's second in command and Gordon Jones are Carroll's sidekick. Check it out if it is shone on TCM.","user":"bkoganbing","rank":[25,27]}]