[{"title":"Good Cast in a Watchable Product","rating":6,"date":"20 September 2006","review":"Blowing Wild is some sort of modern times western, unpretentious but interesting.<br><br>Ruined friends Jeff Dawson (Gary Coooper) and Dutch Peterson (Ward Bond) are stuck in a small South American city after bandits blow to pieces their only oil well. As they wonder around they run into wealthy Paco Conway (Anthony Quinn) a former close friend of Dawson who is in the oil business and hires him to give him a hand. Dawson takes the job just to raise the money that will bring him and Dutch back to the United States. Paco's wife Marina Conway (Barbara Stanwyck)has had something with Dawson in the past and she seems willing to revive it. Bandits are also around menacing Paco's oil wells. Circumstances mix up and the plot turns out interesting as it shows the disturbing relationship between Jeff, Paco and Marina.<br><br>The film was shot in black and white by Argentine director Hugo Fregonese who makes a good job here in a story about friendship, ambition, passion and murder. Frankie Lane sings the adequate title song.<br><br>Cooper is very good as the straight minded Dawson as also is Anthomy Quinn as the self made man that really loves his wife. Barbara Stanwyck's character is the center of the plot and she renders an outstanding performance in another of her many \"mean woman\" roles. Ward Bond and Ruth Roman -Jeff's romantic alternative- are a strong support. There's also Ian McDonald playing one of his usual unsympathetic characters and meeting Cooper again after High Noon (1952).<br><br>Blowing Wild is an acceptable product in its kind. You won't miss a great movie if you don't see it, but you'll enjoy it if you do.","user":"ragosaal","rank":[22,23]},{"title":"Great early 50's movie","rating":9,"date":"4 January 2007","review":"I remember seeing this as a14 year old in England when it was first released. It has stuck in my mind ever since. The combination of Gary Cooper's world weary persona, Dimitri Tiomkin's evocative score, the great rendition of the title song by Frankie Laine and the powerful sense of loss and what might have been all combine to make a fantastic couple of hours. One thought did occur when I watched it again last night was how old the characters all were... We take it for granted today that most roles are played by 25-35 year old actors (and actresses)that to see Cooper, Stanwyck, Quinn, Bond etc. brings one up with start. Lovely film, though, and I look forward to seeing it again.","user":"Terry Weldon","rank":[18,19]},{"title":"Magnificent Cast in a Reasonable Film","rating":6,"date":"28 January 2010","review":"In a hypothetical country in South America, Jeff Dawson (Gary Cooper) and his partner Dutch Peterson (Ward Bond) have invested all their savings in a lease contract to explore oil. However, their expectation ruins when bandits blow the derrick of the oil well with dynamite and they get stranded in the town without any money. In despair, they accept the risky transportation of nitroglycerin to raise US$ 800.00 and Dutch is shot in the leg by road thieves; but Jeff discovers that their employer is a trickster and they area not paid for their job. When their former friend Paco Conway (Anthony Quinn) meets them, Jeff finds that he is a local tycoon and is married with Marina Conway (Barbara Stanwyck), who had a past with him. Paco hires Jeff his foreman to help him with his eighteen oil wells while Dutch is recovering in the hospital. Meanwhile the criminals press Paco to pay US$ 50,000.00 otherwise they will blow his wells and Marina revives her love and desire for Jeff, leading the trio to a tragedy. <br><br>\"Blowing Wild\" is a reasonable film with a magnificent cast. The writer is visibly inspired in \"The Treasure of the Sierra Madre\" and \"Le Salaire de la Peur\" and combines with elements of film-noir, with Barbara Stanwyck performing a \"femme fatale\". The idea of a hypothetical South American country is silly and dull. In the end, \"Blowing Wild\" is an entertaining little flick that wastes the huge potential of a dream cast. My vote is six.<br><br>Title (Brazil): \"Sangue da Terra\" (\"Blood of the Earth\")","user":"claudio_carvalho","rank":[11,13]}]