[{"title":"An under-appreciated film","rating":10,"date":"25 June 2007","review":"It's amazing when a film is disliked and misunderstood when released, and is then praised and labelled as a masterpiece decades later. Ingmar Bergman's 'Sawdust and Tinsel' is one of those films. I'm not exactly sure why the film was regarded so lowly, but thankfully, it is now recognised for what it is.<br><br>The film isn't quite Bergman's best, but it is certainly close. 'Sawdust and Tinsel' is a pessimistic, yet truthful study of human nature in relationships. The film's central character, Albert, is a ringmaster of a travelling circus, and is passing through the town where his wife and children are living. The pair have been separated for some time and are clearly dealing with the situation in different ways. His wife Agda has moved on. Albert is still affected and has been unfaithful to his wife, as he is travelling along with his mistress. What unfolds is an interesting character study that looks at human insecurity, disloyalty, selfishness, unhappiness and emotional strain.<br><br>It's no wonder that Ingmar Bergman is titled 'The Swedish Master'. 'Sawdust and Tinsel' is full of insight and certainly shows Bergman's talent. He does some excellent things with mirrors in certain shots and creates a lot of mood throughout the film. The highlight is, without question, one of the first scenes in which Frost, the circus clown, comes to collect his wife Alma from the ocean, where she is swimming with an army regiment. Every element works and Alma's selfishness and Frost's pain are clear in the scene, adding to the effect. Practically everything that Bergman has done in this film is excellent. The only point of criticism though, is that the cinematography is a bit hit and miss, as some scenes are too bright, giving them an overexposed look. Then again, it could be that the film has just deteriorated with age.<br><br>This is an under-appreciated film that is certainly worth viewing. It is quite hard to come by, but maybe one day, someone will do a proper release on DVD.","user":"TheMovieCritic_83","rank":[29,32]},{"title":"There is not a wasted frame","rating":10,"date":"19 March 2008","review":"I first, and probably, last saw this wonderful film over 40 years ago. It has not been easy to catch again and then I think that when the time since you have last seen a favourite gets too long you begin to have concerns as to whether it will live up to your memory of it. There was particular concern here because, although in the 60s and 70s I would bore people by going on about this film whenever talk of Bergman's more well thought of films came up, this was never considered to be one of his best. Having just watched it again I am blown away all over again. I cannot believe how much of the fantastic visuals I remembered and the extent to which the power of the film is still so affecting. There is not a wasted frame, this is pure cinema throughout. The acting is stupendous, the cinematography outstanding and the bitter sweet tale so seemingly simple, yet so devastatingly all consuming. I know Bergman has made more poetic films and more profound ones but I still think this one is hard to beat for so eloquently presenting those basic issues that matter to everyone.","user":"christopher-underwood","rank":[20,24]},{"title":"has gained a reputation as a triumph of Bergaman's pre 'Seventh Seal' period; rightfully so","rating":10,"date":"17 December 2007","review":"Sawdust and Tinsel- or The Swedish Master, or The Naked Night, take your pick on a title- is about a man who can't stand himself in his profession, but loves it so much at the same time: the low-brow sensibility of it, the wildness, the freedom to cut it loose with drink or with mad gimmicks during a show, and abandon of the rules when confronted with the law. But he also has a love whom he has his problems with, and her with him as well, leading to an infidelity drama that plays out harshly. Ingmar Bergman said this was a personal film for him, in a big sense, because of the connection to the excitement of the profession being played out against personal turmoil and trouble in professional terms (Bergman even said it was easier for a scrawny director to have a \"fat actor\" play the part of Arthur). It was reviled by critics and a box-office flop- one of the more expensive films, relatively to others, Bergman made up to that point.<br><br>It's a film that, seen years later now through the prism of Bergman as one of the world's true artists in the profession, also is deceptively high-brow about the world of low-brow, where experimentation filters in early on and Bergman makes one of his more distinctive marks as a director more-so than a screenwriter (usually, however much Bergman is always an absorbing and challenging director of scenes, writes like no other). The opening scenes, with the story of the sad/pathetic clown Frost (could be a distraction if overdone, but it's an interesting side-not throughout the film as a reminder of true melancholy), are shot like some crazy silent movie, where all we hear are sounds of laughter and little sound effects, brightly lit, shot and composed like some manic tale of desperation and defeat and humiliation, stylized so highly one might think a mad German too control of the reins and made it his own. It's not something all of Bergman's fans will like, but it shows him, even in 1953, trying new things, letting himself be free with the material as he sees fit.<br><br>Then, after this, we get into the \"typical\" Bergmania; a sort of square-block played out between Arthur, who is meeting his ex-wife in the town he's at for the circus performance (the actress playing his wife, I forget her name, is brilliant at displaying just enough pragmatism to show her as the most sane of anyone in the film), and Arthur's current beau Anne is somewhat attracted to a sneaky actor named Frans, who plays a wicked game of arm wrestling and leading to a somewhat Albert and Anne, and how this casts a dark shadow on the rest of the proceedings- including through the circus performance, which becomes a daring act of do by Bergman where he makes things effective once squaring in on the 'duel' between Arthur and Frans. For those that love Bergman doing relationship drama, this is solid, if not exceptional, stuff on display. And the ending, truth be told, might just be one of the most engrossing, and completely bleak (if you could imagine that Bergmanites) that he ever made (who doesn't cry with the scene with the bear?) <br><br>It might sound like Bergman has made a depressing little tome on circus life, the sorrows of living with the filth and lice and reckless frivolity of life as vagabond entertainers. But it's also a lot of fun, as the low-brow material displays another side to Bergman, which is something close to weird, comic excess. Sometimes Bergman even mocks his own world; a scene with Albert asking Gunnar Bjornstrand's theater director (the latter always shown in low-angle, a smart choice) makes the theater come off satirically compared to Bergman's more serious treatments of the profession in his films. And, seriously, where else will we get a dwarf tossing in a work by this filmmaker? And meanwhile, he also has a great turn from his would-be Emil Jannings in Åke Grönberg, who is big and over-emotional and strung-out on his excesses of anger and resentment, mostly with himself (watch for that gun!) And Andersson, of course, is ravishing as she was- if not erotically as such- in Monika, filmed the same year.<br><br>Now finally available just a bit easier than previously thanks to Criterion, Sawdust and Tinsel is a fine spectacle of a director branching out stylistically (if not to the spectacular Felliniesque aspirations it might have as a pre La Strada or The Clowns), while keeping his feet tethered to his personal cinema. Not quite in my top 10 of Bergman's, but considering how many great films he made it's close.","user":"Quinoa1984","rank":[14,16]}]