[{"title":"Standing the test of time","rating":29,"date":"29 September 2004","review":"Thank God that Audrey Hepburn made this film before slipping off into an extended temporary retirement. Was she too old for this movie? Not for the segments that deal with the latter part of the married relationship. The movie spans eleven years and, yes, it is a bit of a visual stretch to see a 37 year old Audrey portraying a 22 year old college woman, but her performance throughout was nothing short of brilliant. This film was a tremendous departure for her. In Two for the Road she does not play the part of the doe-eyed delicate creature of her earlier movies. She even abandoned, reluctantly, her trademark Givenchy wardrobe to sink her teeth into a gritty, visceral part. Many critics of the time remarked on its art house appeal, due in large part to the back and forth sequence editing and the clever juxtaposition of similarities, parallels and contrasts in scenes spanning eleven years. The film must have been incredibly fresh and jarring in its day, abandoning a linear narrative approach to the history of a marriage. Even today it comes across as very \"contemporary.\" Albert Finney delivers an equally strong performance. There is genuine chemistry between Finney and Hepburn. The viewer sees all that is wonderful and horrible about the dynamics of a couple that comes to realize that despite mutual infidelity they still love each other and belong to one another.","user":"mroselli","rank":[55,62]},{"title":"wonderful","rating":10,"date":"4 May 2003","review":"This is my favorite movie of all time. I just saw it 2 weeks ago, and I've already watched it about 7 times. The way that Mark and Joanna's relationship is displayed through the time changes is excellent, and while you'd think that keeping track of the time would be difficult, it's actually quite simple if you look at the hair and the attitudes of the couple. Audrey Hepburn is magnificent, one of her best performances ever, and Albert Finney is charming as her workaholic husband. The Maxwell-Manchesters are hilarious, especially the little girl Ruthie. Audrey is the bored wife, trying to save the 12-year marriage, while Albert is the overworking, bad tempered husband. The movie takes you through their three trips, the first when their love affair began, the second when she is pregnant with their first child, and the third when their marriage is beginning to fail. Their love is displayed wonderfully, and anyone can see that Hepburn and Finney were in love in real life, too. The music is beautiful, I love how it's played all throughout the movie. I think that it's one of the best parts of the whole movie, but there wasn't a moment when I wasn't completely wrapped up in what was going on. This is a classic, and I can't believe I'd never heard of it before I accidently picked it up at the video store. Anyone who is married (or who's looking for some laughs) should definitely watch this movie, it's a must-see.","user":"iluvcrayons07","rank":[65,75]},{"title":"Beautifully Rendered Postcards With a Peerless Audrey","rating":10,"date":"16 December 2005","review":"I read in Danny Peary's \"A Guide for the Film Fanatic\" that some people have formed a strong emotional attachment to this 1967 film. I am one of them. From the opening notes of Henry Mancini's evocative score (personally I think it's his best work) to the end where the main characters drive off into Italy after some verbal sparring, this movie still provides the same pleasure it did when I first saw it on TV in the early seventies. \"Two for the Road\" is a time capsule of Carnaby Street fashion and French new wave scene juxtaposition, but it remains timeless in its emotionally piercing view of marriage and in the beguiling presence of Audrey Hepburn. There will unlikely be an actress with more style or grace on screen, and never has she seemed more sexy, playful or innately human. It's a shame she never played a role as rich in texture as Frederic Raphael's script provides here. His dialogue is sharp and insightful, as he has the main characters often repeat one another for the sake of getting a different meaning from the same line of dialogue.<br><br>As Joanna and Mark Wallace, Hepburn and Albert Finney get to live out more than a decade in their characters' lives from initial meeting to near-divorce. What makes the evolution more impressive is that the story is not a linear narrative but rather a series of five road trips that volley the viewer back and forth in the relationship. Finney provides a formidable match for Hepburn, and he plays with the right mix of roguish insouciance and insecure ambition that doesn't make his character always likable but certainly believable. Their chemistry is palpable, especially in the early days of their courtship as the movie makes hitchhiking the most romantic of adventures with the couple cutting through the entirety of France in various vehicles in record time. Only in the movies. The episode with the pretentious American tourist couple and their bratty daughter provides some biting and funny moments...ironically, the actress portraying the wife, Eleanor Bron, is British. Not surprising that this movie was not such a huge hit stateside since the four Americans in the movie are portrayed in such an unflattering light.<br><br>Regardless, credit needs to go to director Stanley Donen (himself an American), who somehow pulls all these disparate elements together and uses his extensive Hollywood experience to bring a nice glossy sheen to the whole film. His third collaboration with Hepburn (after \"Funny Face\" and \"Charade\") really turns into a tribute to her as she makes a remarkable transformation from naïve choirgirl to jaded jet-set housewife that goes well beyond the changing hairstyles and clothing. This is one to treasure.<br><br>This wondrous film has been lovingly restored for its much-delayed DVD release. The print quality has been significantly improved over the VHS tape I've had for over a decade. A nice bonus feature is a split-screen before-and-after short that shows the visual improvement. Best of all, there is finally an audio commentary track to accompany the film, and Donen provides illuminating insight on the elliptical narrative structure and the non-chronological juxtaposition of the scenes. He explains that the characters are reliving their memories by association with the feelings they are having in the present. His adoration of Hepburn is pervasive and understandable, as he claims rightfully that this was her best performance (they worked together three times). I just wish Finney was available to add his perspective. Moreover, if you ever wondered why the young Jacqueline Bisset's voice doesn't sound like her at all, he admits she was re-dubbed by another actress due to the blaring noise of generators during the location shooting. She apparently had already moved on to shoot her first Hollywood film. For those like me who adore this film, the DVD is a must-buy.","user":"EUyeshima","rank":[69,80]}]