[{"title":"Kissed by a Muse","rating":10,"date":"8 August 2005","review":"Out of all the movies that I loved from my childhood, none of them entranced me more as Xanadu starring Olivia Newton-John. I was four when it was released in theaters and being that age, music and visuals are a really big thing to a kid. That is something that Xanadu definitely had! Even if the music and special effects are out of date now, the style of the film is truly inspiring. I wont waste my time with the Xanadu haters.... But the people that love the film know what I'm talking about. Yes, it's not Oscar worthy material but who cares? There is an entire generation of fans that love it for its simplistic magical wonder. The soundtrack is one that I've always rocked out too... I've owned it on record, tape, CD, and even 8-track!! You cant go wrong with the talent of ONJ or the creative ethereal sounds of the Electric Light Orchestra. The film has entertained me now for 25 years and it will for the rest of my life. It's movies like this that bring back great memories and take you back to a time when innocence wasn't such a bad thing. XANADU FOREVER!","user":"mpact75","rank":[47,49]},{"title":"Give XANADU a Chance!","rating":13,"date":"13 September 2003","review":"XANADU is one of the most critically and commercially panned films in Hollywood history, a 'Nouveau Art' musical with Art Deco themes, a weirdly conceived animated interlude, and performances of such widely varying caliber that a viewer might wonder if the actors were all reading from the same script! But all that being said, I would like to offer a minority opinion, and say that I didn't find the film THAT terrible, and there are some aspects of it I actually enjoyed...<br><br>First and foremost, it offers the legendary Gene Kelly, in his last musical, as charming and wonderful as ever. As retired musician/businessman Danny McGuire, Kelly has the film's best moments, including a 'classic' song-and-dance scene with Olivia Newton-John and some silly but endearing 'post-disco' routines with the talented young dancers of the cast (including future CONAN star Sandahl Bergman). Seeing him on roller-skates again, leading everyone around the club he builds, to the music of the Electric Light Orchestra, makes one realize just how irreplaceable he is. Kelly could do it all, and with style!<br><br>The premise of the film, of a Muse coming from Olympus to inspire an artist, is far-fetched, but had been done on film several times in the past (ONE TOUCH OF VENUS, with Ava Gardner and Robert Walker, and DOWN TO EARTH, with Rita Hayworth, are the examples most often cited), and while Olivia Newton-John is oddly cast in the role, she tackles it gamely, with a smile and a wink, and isn't THAT bad. On the other hand, Michael Beck, best-known as the gang leader in cliched but powerful THE WARRIORS, is totally miscast as the artist she falls in love with. An actor with limited range and no singing or dancing talent, Beck lacks the charisma to pull off the role (one wonders why British pop star Cliff Richard, who voices Beck's animated duet with Newton-John, 'Suddenly', wasn't utilized to play the part).<br><br>While the film often veers off in bizarre directions, the 'Battle of the Bands' scene between popular 80s rockers, the Tubes, and a 'Tommy Dorsey/WWII'-style orchestra (as Beck and Kelly envision what the 'look' and 'sound' of their club, XANADU, should be), actually works, and is fun to watch. The entire score, by Barry De Vorzon and John Farrar, and Jeff Lynne (with ELO) is terrific (and made the soundtrack album a hit).<br><br>Sure, the ending is hokey, but it was also the same ending of ONE TOUCH OF VENUS and DOWN TO EARTH, so XANADU can't be totally faulted!<br><br>All in all, XANADU isn't the WORST film ever made, and if you give it a chance, you might find it a guilty pleasure!","user":"cariart","rank":[148,166]},{"title":"I have a confession to make. I think this movie rules.","rating":10,"date":"28 July 2001","review":"I'm sorry.  I'm so sorry.  But, you know what, that's my opinion and I don't think I should have to feel ashamed of it so there!<br><br>On to the review.<br><br>No true connoisseur of cheesy movies can die happy withought feasting their eyes on the Miracle That is \"Xanadu\".  There are so many things wrong with this movie I don't know where to begin, but somehow they all fit together in a final form that is remarkably endearing.  It's best to watch it withought the vaguest idea of what it's about, but I will say this:<br><br>This is exactly what \"Willy Wonka and the Chocolate Factory\" would have looked like if Willy quit the candy business and decided to turn the factory into a disco.","user":"La Gremlin","rank":[126,145]}]