[{"title":"Quintessential James Bond 007 Sean Connery's best film my favorite","rating":10,"date":"9 November 2017","review":"Goldfinger (1964) is Quintessential James Bond 007 it is my number one all time favorite James Bond 007 film from Sean Connery. This one, You Only Live Twice and DR. No from Sean Connery are really my top three all time favorite James Bond 007 films. This was originally the first James Bond film I saw as a kid. Goldfinger was also my dad's favorite James Bond film and in years it become a cult classic. Even for 53 year old movie it still a classic the best 007 flick. I love it to death, I am enjoying it and I have so much fun watching it. <br><br>This movie has so much action, action, action and more action. Sean Connery does an excellent performance as James Bond 007 I'm a hard-core James Bond fan. I make no apologies for believing that even the late Sean Connery is the closest thing we've seen to IAN FLEMING's James Bond. Everyone who watched this movie know is a really good Bond movie.<br><br>The reason why is this movie so good: - James Bond has new cool car Aston Martin DB5 build with smoke screen in which can throw a co driver seat out of the car and the revolving licence plate. The car also has other applications such as: 30 calibre machine guns, Tire-shredding blade, Oil smoke and water emitters. Actress Shirley Eaton as the murdered Jill Masterson-\" is one of the most enduring images in cinematic history. The girl is painted with gold and dies. Memorable and cool villains like are: Auric Goldfinger and Oddjob ( Goldfinger's second henchman.) Oddjob wears a Sandringham hat with a sharpened steel rim, he is using it as a lethal weapon in the style of a chakram. The movie has great sexy beautiful girls like Honor Blackman as Pussy Galore, Shirley Eaton as Jill Masterson and Tania Mallet as Tilly Masterson. Cool dialogues I love it so much.<br><br>\"Do you expect me to talk? No, Mr. Bond, I expect you to die!\" <br><br>This was directed by director Guy Hamilton it was his first James Bond 007 film the first two films were directed by Terence Young in which he directed Thunderball next Bond movie after this one. This movie also didn't evolve around SPECTRE this time like was in the first two film it was about a brilliant mastermind criminal in which he planed to blow off Fort Knox to get more profits for his Gold brilliant! It has beautiful great music score by John Barry I love it. The car Aston Martin DB5 James Bond 007 was driving was so cool, it has so many accessories it was beautiful to watch it.<br><br>Investigating a gold magnate's smuggling, James Bond uncovers a plot to contaminate the Fort Knox gold reserve.<br><br>This movie has so much impact it is well acted it has great brilliant plot.<br><br>Gert Fröbe R.I.P was brilliant and excellent as Goldfinger the original villain. He gave his powerful performance as the bad guy from the title of the movie. I love him in this movie.<br><br>Harold Sakata R.I.P. as Oddjob was great villain just like Goldfinger, he was really strong and excellent in hand to hand combat. Oddjob and Jaws are two great Bond villains.<br><br>Honor Blackman is the first of a long line of James Bond females with patently sexual names And ho could ever forget Shirley Eaton's introduction in the film? She is lying on a chaise longue on the balcony of Goldfinger's Miami Beach hotel suite, attired in black bra and panties, while she observes Mr. Simmons' (Austin Willis) gin hand through binoculars.<br><br>What more could you ask for? Well, how about a film in which Bond actually *does* something? For the whole 2nd half of this movie he's just a prisoner who fails every attempt to escape, signal his superiors or even deactivate the bomb himself. Even killing Oddjob at the end is ultimately meaningless as he's still trapped in the vault with a bomb he can't disarm until the Army rescues him.<br><br>Goldfinger is a 1964 British spy film and the third instalment in the James Bond series to be produced by Eon Productions, starring Sean Connery as the fictional MI6 agent James Bond. It is based on the novel of the same name by Ian Fleming. The film also stars Honor Blackman as Bond girl Pussy Galore and Gert Fröbe as the title character Auric Goldfinger, along with Shirley Eaton as the iconic Bond girl Jill Masterson. Goldfinger was produced by Albert R. Broccoli and Harry Saltzman and was the first of four Bond films directed by Guy Hamilton.<br><br>10/10 Goldfinger and The Spy Who Loved me has such a great villains and they are both in my top 10 James Bond favorite films. I just love and enjoy watching this film. Goldfinger in my opinion is MILES way better then Daniel Craig's last three films he did. This movie deserves a cult classic status movies like this will never be so good like was Goldfinger. It is quintessential James Bond 007 action cult classic film I love this movie to death it is my number one favorite Sean Connery's James Bond 007 film.","user":"ivo-cobra8","rank":[97,108]},{"title":"The Blueprint For the Franchise","rating":8,"date":"21 July 2003","review":"Goldfinger was the third Bond film and, on its release in 1964, proved itself to be the first blockbuster of the series, firmly establishing OO7 in the public imagination. Dr No and From Russia with Love had both been successful, but Goldfinger outperformed both at the Box Office, and in the process laid down the guidelines for nearly every Bond film that has followed since.<br><br>There is undoubtedly much to admire about the film, not least the memorable Shirley Bassey theme song, still one of the best. Guy Hamilton directs with impressive assurance, the locations are excellent and  Sean Connery is once again the epitome of cool as Bond, although he is not as menacing as he was in the first two films. He is, however, still a believable character and finds himself in genuine danger during the film, having to rely on his wits to survive.  Goldfinger is one of the great Bond villains, played with real bonhomie by Gert Frobe, who succeeds in making him a more fleshed-out character than many of the one-dimensional baddies of later films. The wonderfully-named Pussy Galore, meanwhile, is one of the best Bond girls. Honor Blackman plays her as a woman with real spirit and intelligence, and it is a pity she does not get more screen time.<br><br>Goldfinger also introduced several elements which have since become cliches of the Bond series. For the first time Bond visits Q's workshop to pick up his equipment, and for the first time he receives some fancy gadgets, packaged up in the famous and stylish Aston Martin. The film is also injected with a lot more humour than its predecessors, with OO7 throwing out one-liners more frequently and a somewhat camper tone being introduced to proceedings. As Oddjob, Howard Sakata is the first in a long line of totally silent but lethal henchmen. He is not as good as Red Grant in From Russia with Love (who spoke), but his deadly hat is memorable, and he is a formidable opponent for Bond.<br><br>Good as it is, however, it could be argued that Goldfinger had a malign influence on many of its successors. Because it was so successful, the Bond producers became convinced that later OO7 releases should follow the same gadget-led, tongue-in-cheek style, but on a grander scale. As a result, Goldfinger began the shift away from the relatively serious, hard-edged tone of the first two films towards the light-hearted visual spectaculars that would come to dominate the franchise in the 1970s. Taken on its own terms, though, Goldfinger certainly ranks as one of the best Bond films, and is much better than the later ones which tried hardest to mimic and outdo it. Personally I like the tougher films in the franchise the best, especially From Russia with Love, but Goldfinger is the most enjoyable Bond film of its kind, and deserves its classic status.","user":"Orpington","rank":[24,26]},{"title":"Best Bond movie ever.","rating":10,"date":"7 May 2004","review":"Goldfinger could best be described as the quintessential, definitive Bond film, the first of the series to set the necessities of the entire saga in motion. It is also the best of the Bond movies, arguably the most suave and sophisticated, far superior to the Roger Moore era and those who followed in Connery's footsteps. It is the Bond ultimatum, so to speak.<br><br>Goldfinger was the first of the iconic legacy to feature Q (Desmond Llewelyn) as a recurring comic relief figure. (He was introduced in From Russia with Love, the second film in the series, where he was credited as Major Boothroyd, and given little screen time.) It was also the first to truly setup the suave nature of 007, the tongue-in-cheek humor (absent in the first movie, Dr. No), the far-fetched gadgetry (including fast cars, this one being an Aston-Martin) and, arguably, the first of the series to feature the famous line, \"Bond, James Bond,\" as a 007 catchphrase, versus a mere line of dialogue. When Bond storms out onto the patio of the motel room, the camera zooms in towards his face, the 007 theme song roars through the speakers, and he says his motto with cool confidence. It's Bond, baby.<br><br>Both of Goldfinger's predecessors were darker, more serious motion pictures -- more in-tune with the writing of Fleming versus the suaveness to later be salvaged from the series with the third installment. Although Dr. No was a terrific movie, and although From Russia with Love is exciting, Goldfinger beats them both. It features the best (and most famous) Bond villain to ever grace the screen, constantly spoofed in countless productions: Goldfinger (Gert Fröbe), the target of Austin Powers in Goldmember and, according to IMDb, referenced and spoofed in well over 100 other productions.<br><br>There isn't much of a plot, really. Goldfinger plans to rob Fort Knox and become the richest man in the world. Bond finds out and tries to put a stop to his mission. What entices us, and what makes the film so entertaining despite the absurdity, is its leniency towards itself. It doesn't mind being silly because the entertainment value far outweighs any flaws. Plus, it has some of the most memorable scenes in history, and arguably the best Villain Explanation Scene to ever be recorded. \"Do you expect me to talk, Goldfinger?\" Bond (Sean Connery) asks as a laser beam slowly makes its way towards his groin. \"No, Mr. Bond, I expect you to die!\" he says with mock ridicule, before walking away. The following shots is one of the only sequences in James Bond history where the iconic character actually seems fairly worried that fate may be playing a deadly hand.<br><br>Released in 1964, forty years later it stands as one of the most risqué Bond films to date. Especially for its time, there is brief nudity during the opening credits, sexual scenes, constant innuendo (including a Bond girl named \"Pussy Galore,\" played by Honor Blackman) and implications of lesbianism.<br><br>Galore's sexual orientation is not delved into as deeply and explicitly as it may be dealt with in today's day and age, but the inclusion exists. Bond struggles verbally with Galore, trying to woo and seduce her, and she subtly implies from their very first meeting that she will not be seduced, claiming it is impossible for Bond to get very far with her, thereby insinuating that she is, in fact, a lesbian. According to the director of the film, Guy Hamilton, the entire situation is given much more emphasis in the novel by Ian Fleming, but it was simply too foul a subject for audiences back in 1964. Surprisingly, the verbal exchanges and implications behind the subject matter are much more effective.<br><br>All of the actors in Goldfinger are, at the very least, very good. But of course, it is really Sean Connery who demands our utmost attention and respect, for it is Connery whose inhumanly strong screen presence launched Bond into the heights of Movie Legend.<br><br>Recently in London I attended a James Bond exhibition, and as I made my way through a maze of Bond memorabilia and objects used in all twenty-something movies, I found myself realizing that the myth of 007 propels the films farther than anything else ever could. There is a sort of iconic legacy surrounding the entire Bond franchise that will probably never die. Different action heroes come and go, and nowadays Rambo looks criminally out of date, but Bond, in his black-and-white tuxedo, with all his suave sophistication, will never grow old, because he is a timeless hero who is comprised of all the greatest heroic attributes to ever be assembled, and although his style and looks may grow weary amid the changing ages, his character will remain the ultimate hero, and I very much doubt that we will ever live to see a day when Bond becomes outdated.","user":"MovieAddict2016","rank":[167,213]}]