[{"title":"The mystery of Kaspar Hauser","rating":7,"date":"7 November 2006","review":"EVERY MAN FOR HIMSELF AND GOD AGAINST ALL (Werner Herzog - West Germany 1974).<br><br>Lacking a traditional narrative or dramatic structure and full of obscure images, this film feels more like a hypnotic dreamlike experience. It also features one the more enduring trends in Herzog's work: the featuring of individuals with exceptional physical or psychological conditions.<br><br>The film is based on the true story of Kaspar Hauser, a young man who suddenly appears on the market square in the German town of Nuremberg in 1828. This strange occurrence has become one of the most enduring inspirations in German history, literature and science, with well over a thousand books written on the case. When Kaspar Hauser was found, he could barely grunt, let alone speak and caused a minor sensation among the locals. After living in a cellar for years with only a pet rocking horse, he is abandoned by his protector and provider, the mysterious \"Man in Black.\" Having been isolated from all humans except his mysterious protector, Kaspar is suddenly thrust into civilization, and is expected to adapt himself to 19th-century society. He becomes a public spectacle and everyone in town lines up to catch a glimpse of him. Soon the local officials in town decide he is too much of a (costly) burden and, in an attempt to profit from the public interest, he is turned over to a circus ringmaster, where he is added to the local carnival freak show, as one of \"The Four Riddles of the Spheres.\" The other three include \"a midget king\", \"A little Mozart\" (an autistic or catatonic child), and a lute playing \"savage\". When Hauser comes under the tutelage of a sympathetic professor (Walter Ladengast), he gradually acquires an impressive degree of socialization and learns to express himself with a reasonable degree of clarity, but most of society's conventions, manners and thoughts is more the young man is able to adjust to.<br><br>Herzog adopted a technique of incorporating film material shot by others filmmakers into the film. Early on in the film, just before Kaspar is found on the town square, Herzog used material shot on super 8 of a Bavarian landscape and the town of Dinkelsbühl, that was almost disposed off, but Herzog thought it would be ideal for his film. These grainy shots, accompanied by a requiem of Orlando DiLasso, make for one of the most haunting images I've ever seen on film. Dream sequences are another important aspect in this film. In one of them, Kaspar Hauser has dream images of the Sahara desert, for which Herzog used material he shot in the Western Sahara on earlier occasions. I don't know of any other director who used this technique to such avail up until now. One of the most stunning scenes is when the \"Man in black\" leaves him with the shot on the mountain and soon after the music with the requiem starts. It's almost like a romantic twist on 2001: A Space Odyssey. <br><br>Herzog has done a fantastic job recounting the legend of Kaspar Hauser to the screen. The casting of Bruno S. in the role of Kaspar Hauser is of particular interest. He was a street artist in Berlin, when Herzog found him and decided he would be ideal to play the role of Kaspar Hauser. Before this, Bruno S. had a troubled past. After being severely beaten by his mother, he became deaf and was placed in an institution for retarded children at the age of three. At nine, when he tried to escape, he was transferred to a correctional institution. With further escape attempts, he amassed a number of criminal offenses and was incarcerated for more than twenty years. The authenticity of Bruno's performance brings such an element of sincerity to the film, that makes it almost impossible not to root for his cause. Bruno S. also starred in Herzog's STROSZEK (1976).<br><br>Camera Obscura --- 10/10","user":"Camera-Obscura","rank":[59,63]},{"title":"The story of a soul","rating":9,"date":"9 February 2000","review":"\"This is the story of a soul\", someone said and I agree because loneliness is here described through a slow moving plot and endless silences which make us see Kaspar Hauser not as a man but as something more sulfuric, almost a being from outer space. The performance of Bruno S. is simply moving and caused me a lot of tears and the use of time through the narration is perfect for a film of this kind. The poetic vision of Werner Herzog is very peculiar and unique and you can love it or hate it but you cannot ignore it. Herzog doesn't care about the audience, he tells what it wants in the way he likes and that's the praise and the defect of European cinema and it's what makes the difference between European authors and American ones.","user":"solitaryman2","rank":[40,46]},{"title":"One of my top ten films of all time!","rating":10,"date":"10 November 2000","review":"Herzog has a way with documenting history as if it was our own past we were re-living.  It all seems strangely familiar, yet slightly surreal.  This film is rich with detail of the period (19th century), yet it's not the slightest bit in-your-face like so many of the current period films that seem to be about  nothing more than lush furniture and the people who sit on them.   Yet there are images here that you'll never forget!  There are some especially stunning sepia dream sequences of an Arabian caravan strolling in soft, slow-motion across a windswept desert.  They reminded me of Sam Fuller's effective use of raw colour footage of distant lands in \"Shock Corridor\".  Images that seem to burst out at us from the B&amp;W angst of a mental ward.   Such contradictory images seem perfectly normal in Herzog's world, since after all, they're from the world of our dreams. <br><br>\nAs always, Herzog finds great music for his score in this film, and he uses it in a very subtle way.  But he also is a master at allowing silences to tell part of his story.  If one is really listening, they can hear a great many things that define the world that his characters are inhabiting.  This of course, was more obvious in films like 'Aguirre', where one swears they can still hear the wild birds squawking in their head for days!  Can any film-going experience be more real?<br><br>But this film is not all just sound and imagery!  The story is a puzzle. It's up to us viewers to decide who this man is and how his mind functions. It also challenges us to think about how our own minds function.  While various \"instructors\" try to cram a lifetime of education into Kaspar's brain in just a few short years, we are forced to re-evaluate the logic that we have been taught.  This is illustrated with great tongue-in-cheek humour when Kaspar approaches a lesson in logic with a Zen-like understanding that leaves his instructors livid.  Needless to say, this film is a good preamble to \"Being There\", only more subtle, more haunting, and far more memorable.<br><br>The film will also bring to mind \"The Elephant Man\", not just in its depiction of circus \"freaks\", but in its illustrations of cruelty, madness, kindness and alienation.  It is in essence, a movie about humanity.  Told in a poetic vision with just the right doses of wit, intelligence and mystery. For this is, The MYSTERY of Kaspar Hauser.  The film never pretends to be a documentation.  It is simply an interpretation.  One man's imagining of what might have gone inside the mind of a man who was born into the world at sixteen. See it with that in mind, and you'll have one of the richest movie-going experiences in your life!","user":"Zen Bones","rank":[34,41]}]