[{"title":"Horror...80's style.","rating":22,"date":"22 November 2004","review":"Straight from the mid-80's comes the mild-mannered 'Nightmares,' a horror anthology of four seemingly unrelated tales of terror that hardly deserve the R-rating they so unjustly received (the film was released one year before 'Indiana Jones and the Temple of Doom,' which resulted in the PG-13 rating, a rating this film deserves, if not a PG).<br><br>Segment one, 'Terror in Topanga,' re-tells the old urban legend of a woman, an escaped psychopath, and a suspicious gas station attendant. In this case the woman is Lisa (Christina Raines), a cigarette smoker who needs a nic-fix so bad; she's willing to risk being horribly stabbed for some Marlboro 100's. I suspect the filmmakers were trying to comment on the health hazards of tobacco--something new in 1983. This is the third best, or second worst-depending on your point of view, segment of the film.<br><br>Segment two, 'The Bishop of Battle,' on the other hand, is undeniably the best! It stars none other than a very young Emilio Estevez ('the 'Mighty Ducks man himself!') as J.J. Cooney, a kid so good at arcade games, all the other kids stop playing to watch him. One game Cooney can't seem to beat is 'The Bishop of Battle,' which supposedly has 13 levels, although it is believed level 13 is a myth as nobody has gotten past level 12 (Cooney claims he heard about 'a kid in New Jersey' who did sotwice). Cooney becomes obsessed with surpassing level 12 and defeating 'The Bishop,' the digital master/boss of 'The Bishop of Battle,' he looks like an electronic-neon version of Magic Mirror from 'Snow White and the Seven Dwarfs.' So obsessed does Cooney become, that he alienates his parents, sneaks out of his bedroom in the middle of the night, and breaks back into the arcade to take on 'The Bishop' one more time. I won't spoil the funky ending; suffice to say it evokes 'Tron,' sort of a 'Tron-in reverse.' The most enjoyable aspect of Segment two is the lacquer of 1980's youth culture it evokes. Estevez sports a neon, sleeveless shirt and a Walkman the size of a toaster that blasts punk-rock as Cooney hustles amateurs in the tough arcades of Oakland. Back at the mall, one anonymously delivered line of dialog from an unseen member of Cooney's spectators is, I kid you not, 'Totally awesome!' At one point, a flirtatious female friend asks him if he wants to 'Get a pizza!' This isn't really the 1980's I remember, it's how I'd like to remember them.<br><br>Horror legend Lance Hendriksen gives arguably the best performance of all segments in #3, 'The Benediction,' as a priest in the American-Mexican wasteland who, after witnessing the pointless death of a child, loses his faith and begins the long trip home across the desert. On the way he encounters a demonic monster truck apparently intent on killing him 'Duel' style. The truck is loud and deep black, with an upside down cross hanging in its rear-view mirror. At the stories climax, we see the truck literally burst out from the desert earth as if it were a surfacing submarine. It's a surprisingly effective, and very cool, moment in the film.<br><br>Despite a well tuned cast, 'Night of the Rat,' the fourth segment, is terrible, the worst in the film, and a poor finale. It centers on the Houston family's encounter with, as the title so eloquently eludes, a giant rat. As if that weren't enough, the rat has psychic powers as well! Wife Claire is the protagonist, played by polished actor Veronica Cartwright, who tries to convince her arrogant husband Steven (mustached character actor Richard Massur, whose demeanor mirrors his dry-toast last name) to call an exterminator. But alas, Steve refuses, and it's not until the devil-rat almost kills their young daughter (future overdosee Bridgette Andersen in a phenomenal child performance) that he whips out the conveniently closet-stored shotgun and goes-a-rat huntin'. The finale of 'Night of the Rat,' is too awfully hilarious for words to define.<br><br>Overall, 'Nightmares,' is too gentle to be scary. It reminded me of Nickelodeon's soft-core, 'Are You Afraid of the Dark?' which also had happy endings and corny fables (although I remain a fan of that series). I would recommend this film only for the nostalgic 'The Bishop of Battle,' Hendrickson's performance in 'The Benediction,' and as an overall night of laughs for 80's horror connoisseurs. 'Creepshow,' and 'Creepshow 2' are far superior horror anthologies than this film. <br><br>However I must admit I enjoyed it, in some ways, more than 'The Twilight Zone, The Movie.'","user":"notdempsey","rank":[22,23]},{"title":"For those not afraid of the 80's","rating":9,"date":"9 August 2003","review":"For those not afraid of cheapo 80's television horror comes Nightmares. Essentially this was the remainder of the filmed episodes of Universals anthology series \"The Darkroom\", you know, the short lived one that was on ABC in the early eighties, had James Coburn as the host. Oh well, I tried. Anywho, the 4 story movie was very \"un-scary\" to most, but entertaining enough to sit through if you enjoy speculative fiction type stories. Of course the staple memory from this movie is the segment with E.Esteves called \"The Bishop of Battle\". After TRON failed to bag box office reciepts in the upper millions, I guess Universal thought they could do better with a video game nightmare story replete with computer graphics. Must have worked for this film as mentioning this segment, jars memories even in this day. Trivia bit: Eighties icon Moon Unit Zappa makes a guest appearance in the film, see if you can spot her.","user":"HyperPup","rank":[7,8]},{"title":"corny, dated but still fun cult horror anthology from Universal","rating":6,"date":"9 December 2017","review":"Directed by Joseph Sargent, it's split into 4 unconnected stories: 1) \"Terror in Topanga\" offers up that old chestnut about a dark night and an escaped killer on the prowl. Featuring Christina Raines and William Sanderson. 2) \"The Bishop of Battle\" stars Emilio Estevez as a video game expert determined to get to the final level on a new arcade game. Careful what you wish for! Also with Moon Unit Zappa. 3) \"The Benediction\" is a Duel take-off with Lance Henriksen as a priest who has lost his faith and may have run into the devil in the form of a menacing black truck on the highway. 4) \"Night of the Rat\" features a suburban family terrorized by, you guessed it, rats. With Richard Masur and Veronica Cartwright.<br><br>The effects are chintzy (including some very early computer effects), and a lot of it is one-note. But there's a camp charm to it, and it makes good viewing for those in the mood for some cheesy but not ghastly frights. Featuring some early 80's punk music by the likes of X, Black Flag, and Fear.","user":"AlsExGal","rank":[6,7]}]