[{"title":"A Gritty and Brutal Western","rating":7,"date":"6 May 2012","review":"In 1883, in South Dakota, the former buffalo hunter Sandy McKenzie (Stewart Granger) is tired of hunting the animals. He is approached by Charlie Gilson (Robert Taylor), a man that feels pleasure in killing buffalo and Indians, who proposes a high salary to him to hunt buffalo for him. They associate to each other and hire the skilled skinner Woodfoot (Lloyd Nolan) and the half-breed Jimmy O'Brien (Russ Tamblyn) to help them.<br><br>When a group of Indians steal their horses, Charlie hunts them down and kills them in their camp. Charlie finds a gorgeous Indian girl (Debra Paget) with a baby boy and he brings her to his camp to be his woman. However, Sandy and she are attracted to each other but they fear Charlie. Along the days, the tension between them increases until the day Charlie kills a white buffalo that is sacred for the Indians.<br><br>\"The Last Hunt\" is a gritty and brutal western in a period when the Old West is ending. Robert Taylor and Stewart Granger have great performances and Debra Paget is in top of her beauty and responsible for an increasing tension between the two lead characters.<br><br>The cruel scenes where the buffalo are killed by marksmen are for real and part of the reduction of the herd planned by the government of USA. My vote is seven.<br><br>Title (Brazil): \"A Última Caçada\" (\"The Last Hunt\")","user":"claudio_carvalho","rank":[17,17]},{"title":"A terse, brutish outdoor Western!","rating":8,"date":"17 July 2000","review":"The arrival of vast waves of white settlers in the 1800s and their conflict with the Native American residents of the prairies spelled the end for the buffalo... <br><br>The commercial killers, however, weren't the only ones shooting bison... Train companies offered tourist the chance to shoot buffalo from the windows of their coaches... There were even buffalo killing contests... \"Buffalo\" Bill Cody killed thousands of buffalo... Some U. S. government officers even promoted the destruction of the bison herds... The buffalo nation was destroyed by greed and uncontrolled hunting... Few visionaries are working today to rebuild the once-great bison herds... <br><br>\"The Last Hunt\" holds one of Robert Taylor's most interesting and complex performances and for once succeeded in disregarding the theory that no audience would accept Taylor as a heavy guy...<br><br>His characterization of a sadistic buffalo hunter, who kills only for pleasure, had its potential: The will to do harm to another... <br><br>When he is joined by his fellow buffalo stalker (Stewart Granger) it is evident that these two contrasted characters, with opposite ideas, will clash violently very soon...<br><br>Taylor's shooting spree was not limited to wild beasts... He also enjoy killing Indians who steal his horses... He even tries to romance a beautiful squaw (Debra Paget) who shows less than generous to his needs and comfort...<br><br>Among others buffalo hunters are Lloyd Nolan, outstanding as a drunken buffalo skinner; Russ Tamblyn as a half-breed; and Constance Ford as the dance-hall girl... But Taylor steals the show... Richard Brooks captures (in CinemaScope and Technicolor) distant view of Buffalos grazing upon the prairie as the slaughter of these noble animals...<br><br>The film is a terse, brutish outdoor Western with something to say about old Western myths and a famous climax in which the bad guy freezes to death while waiting all night to gun down the hero...","user":"Nazi_Fighter_David","rank":[30,34]},{"title":"A mature, realistic view of the bitter end of the 'Old West.'","rating":10,"date":"23 November 1998","review":"Have no illusions, this IS a morality story. Granger is the troubled ex-buffalo hunter, tempted back to the plains one more time by  kill-crazed Taylor. Granger can see the end is near, and feels deeply for the cost of the hunt-on the herds, the Indians and the land itself. Taylor, on the other hand admittedly equates killing buffalo, or Indians to 'being with a woman.' While Granger's role of the tortured hunter is superb, it's Taylor who steals the show, as the demented, immoral 'everyman' out for the fast buck and the goodtimes. There's not a lot of bang-bang here, but the story moves along quickly, and we are treated to a fine character performance by Nolan. The theme of this story is just as poignant today, as in the 1800s-man's relationship to the land and what's on it, and racism. Considering when this was made, the Censors must have been wringing their hankies during the scenes in the 'bawdy house', Taylor's relationship with the squaw, and much of the dialogue. Although downbeat, this is truly a great western picture.","user":"bux","rank":[20,24]}]