[{"title":"Sustained Suspense","rating":15,"date":"15 June 2001","review":"While in many respects one of Hitchcock's lesser films, \"Suspicion\" has some good performances and a degree of suspense that is as sustained as in any of his films.  The movie gets quite a lot out of a relatively simple plot.<br><br>Joan Fontaine gives an excellent performance as Lina, a quiet young woman who finds herself swept away by, and suddenly married to, the charming but irresponsible Johnnie, played by Cary Grant.  Not long afterwards, she begins to question his behavior and his intentions, and soon she is terribly afraid, both of what he might have done and of what he might do.  Whenever she manages to overcome one of her fears, no sooner does she do so than her husband gives her a new reason for suspicion.  There really isn't much more to it than that, but Hitchcock gets a lot out of this basic premise.  The tension keeps building, and Fontaine's performance allows the viewer to feel all of her fear and anxiety.  Not everyone likes the way that it all ends, but it is worth seeing and deciding for yourself what you think about it.<br><br>The rest of the cast have mostly limited roles, but give good performances that add to the portrayal of the main characters.  Especially good is Nigel Bruce, who provides a few lighter moments as one of Johnnie's old cronies.<br><br>While lacking the complexity and excitement of Hitchcock's best pictures, \"Suspicion\" is still a good example of his ability to keep the audience in lasting suspense.  Most Hitchcock fans will want to see it.","user":"Snow Leopard","rank":[74,82]},{"title":"\"Good night, Lina.\"","rating":7,"date":"27 October 2005","review":"That could have been Cary Grant's most chilling line in his long career.<br><br>*SPOILERS*<br><br>Except RKO didn't have the courage of its convictions. Having bought the rights to Francis Iles' novel, and despite Hitchcock's insistence on sticking with the original ending, neither preview audiences nor the studio were ready to accept Cary Grant as a murderer. So its present ending was hastily written and shot. It completely subverts all the fine work that's gone before.<br><br>Joan Fontaine was a brilliant actress and valiantly, passionately, breathlessly tries to make the shockingly amateurish dialogue in the final scene work -- \"Oh, Johnny! You were going to kill yourself instead of me, like the audience and I have thought for the last 90 minutes! Oh, Johnny! It's as much my fault as it is yours! Oh, Johnny! I was only thinking of myself . . . ,\" etc.<br><br>Cary Grant does his best with this final abomination of a climax. \"Lina! Lina! How much can one man bear! When you and the audience thought I was in Paris murdering Beaky I was really in Liverpool!\" Etc.<br><br>Huh?<br><br>In other words, this beautifully produced, directed, acted and written psychological suspense thriller turns out to be about a charming lazy n'er-do-well who's sponged and embezzled his way through life, who marries a beautiful but neurotic aristocrat who, from day one, increasingly assumes the worst about her husband -- convincing herself (and us) that he's killed before and now is about to kill her?<br><br>\"Just kidding,\" the tacked-on final scene says. \"It was all innocent. You eating popcorn out there in the dark, and Lina, should be ashamed for even THINKING such things! Go home now.\" <br><br>It helps, out of self defense, to watch \"Suspicion\" with the original ending in mind. Yes, the milk is poisoned. Yes Johnny killed Beaky in Paris. Yes, he's a psychopath who lies, cheats, steals and kills. Yes, Lina believed him and loved him deeply -- the only man she's ever loved. Yes, her life is no longer worth living, now that she knows the truth about Johnny. Yes, she rightly suspects that milk is poisoned. So she writes a letter to her mother, telling the truth about Johnny's exploits, and that he is poisoning her as she writes -- and that she intends to die. She seals the letter and gives it to Johnny to mail. She drinks the milk. Johnny leaves and unknowingly drops Lina's letter into a mailbox, thus sealing his fate.<br><br>THAT'S a rewarding ending.<br><br>It also makes everything that's gone before (including writing, directing, performances and cinematography) plausible. It gives \"Suspicion\" a reason to exist.<br><br>But that's the novel's ending.<br><br>The film's \"Lina and the audience are just paranoid\" ending makes fools out of all the talent on display here. And of us.<br><br>Hold mentally to the original ending and you'll love it.","user":"Holdjerhorses","rank":[167,193]},{"title":"I Suspect a Cop-Out Ending...","rating":9,"date":"26 October 2005","review":"If it weren't for the Code which did not allow murderers to get away with it at the end, or the apparent miscasting of Cary Grant as the ambiguous husband, SUSPICION would rank higher as a subtle masterpiece of sheer, romantic suspense.<br><br>Over the years many critics have stated that Grant, in his first collaboration with director Alfred Hitchcock, doesn't quite convince much as a man who progressively seems to have ulterior motives with the people around him, most notably his wife. I personally believe that evil is best expressed under a facade of deadpan deceptiveness, such as the friendly neighbors in a similar thriller, ROSEMARY'S BABY. Of course, you might think: isn't this film completely different from SUSPICION? Not really. Strip away the Satanic plot and all you have is a growing sense of paranoia surrounding a similarly mousy wife who slowly realizes her husband and everyone around her is not what they seem. And we know how that film ended.<br><br>Grant is a perfect choice to play Johnnie Aysgard. He has the dark, handsome looks, that gleaming smile and loving charm and he literally sweeps spinster Lina McLaidlaw (Joan Fontaine, Oscar winner for this role) off her feet. His presence only vaguely suggests the menace hidden underneath and this is perfect for a convincing psychological, cerebral thriller. If Lon Chaney, for example, had played Aysgard, or Joseph Cotten, Orson Welles, or even Basil Rathbone for that matter, it wouldn't be hard to yell at the screen and pinpoint the villain in the story. Grant, however, is so completely at home in his ambiguousness that even in the climactic scene where he drives Fontaine to her mother's home, we still can't quite decide what his intentions are even though every added piece of evidence leads to the mounting horror that he is about to kill her.<br><br>And his presence is the reason this movie works as an excellent psychological thriller even if the ending is a letdown. Using an actor like Grant misleads the public into being sucked into the lighthearted tone of the first third of the story. Introducing the most trivial of incidents surrounding his playboy-like character, which gradually lead to more sinister ones does the tone darken and before we know it we're in the middle of a tense drama of wills between husband and wife and staring at that ghostly glass of milk, wondering if to drink or nor to drink.","user":"nycritic","rank":[44,53]}]