[{"title":"Lighten up","rating":28,"date":"28 June 2013","review":"I am reading reviews of Mr Hobbs takes a vacation and can't believe some of the stuff I'm reading .. \"boring script?\" ... \"miscasted\" .. I firmly believe anyone who doesn't like this movie was not born in the 60's or never took a vacation with his family .. This is a simple story of a simple time .. sorry no sex violence .. Jimmy Stewart doesn't turn into a Zombie ... it's just a pure and simple movie filmed during a pure and simple time .. and yet some of the issues are still here today: family troubles, growing up with braces, identifying and communicating with a Grandfather ..<br><br>I smile ear to ear when I see this BECAUSE it doesn't have sex or violence .. it merely transports me to a simpler time when my Mom and Dad poured us all into the back of the station wagon .. me complaining the whole time .. and yet when it was over I was so sad to leave and have memories I still cherish ..<br><br>So sad they don't make these type of movies anymore... it simply wouldn't sell ...","user":"pisellimatt","rank":[18,20]},{"title":"They sure don't make 'em like this anymore.","rating":9,"date":"13 September 2005","review":"\"Mr. Hobbs Takes A Vacation\" is one of the most enjoyable family films ever made. When it was released back in 1962, it was a big hit. But if you are a sophisticate, don't write it off just yet. The plot is simple: Harried St. Louis banker Roger Hobbs (James Stewart) is looking forward to a quiet, romantic vacation with his wife Peggy (Maureen O'Hara) who, unknown to him, has instead opted for a family reunion in a rented Northern California beach house. Not only has she included her teenage daughter Katie and younger son Danny but her married daughters and their families as well. The beach house turns out to be a monstrosity which Hobbs describes as \"Dragonwyck\". When their daughter Susan and her husband Stan show up with their bratty kids, things quickly get worse. The family is complete when daughter Jane and her husband Byron arrive with their infant daughter. By now, both Mr. and Mrs. Hobbs are somewhat disenchanted with this \"family reunion\" as Susan and her husband fight until he walks out on them, while Jane's husband takes up with the local bathing suit-clad vamp Manika. Daughter Katie meanwhile, grows more sullen by the day, sulking because of her new braces and brother Danny simply glues himself to the television set. Add an unhappy Finnish maid and you really have a recipe for disaster. But thanks to the delightful performance by Stewart, the laughs come thick and fast. His dry wit enlivens the film and almost single-handedly keeps it alive. And I mean alive because in spite of a capable cast including Fabian, John McGiver and Marie Wilson, the film belongs to Stewart. He does wonders with his hapless father role and keeps the audience in his corner every second. With the support of the eternally beautiful O'Hara (who's hardly anyones idea of a grandmother) and a memorable Henry Mancini score, \"Mr. Hobbs\" may depict a harrowing \"vacation\" but it's one the the viewer will thoroughly enjoy taking. The film has just been released on a beautiful widescreen DVD, with an original trailer and a few other extras. Bon Voyage!","user":"phillindholm","rank":[70,90]},{"title":"more than just tossaway fluff","rating":7,"date":"15 August 2000","review":"I think this highly entertaining film is a bit better than Maltin gives it credit for being. More than just a light comedy about the travails of a summer vacation gone wrong, the movie has some hard edges that give it some bite. Among these are the frayed relationships between Hobbs and his elder daughters, the marital difficulties of one of them (bordering almost on being painful to watch), and the mutually hostile relationship of Hobbs with his grandson. Hobbs is no kindly buffoon; a well-meaning but irascible fellow, he has plenty of cutting and sarcastic comments for the family members that cause him so much grief, yet who he obviously cares for. There are some genuinely touching moments throughout the film, especially as Hobbs reconnects with his teen son. The script is excellent, with many sharp edges and plenty of crackling repartee. Stewart, in a fine performance, makes the movie; his expressive face completely reflects the frustrations, disasters, and surprises he encounters, as well as the warmth and pride he feels for his family. The brief narrative voiceovers he supplies (continuations of the letter he dictates at the beginning of the whole flashback movie) are well-placed and witty. Maureen O'Hara is perfect as the well-meaning Mrs. Hobbs. This is a thoroughly enjoyable 60's movie that stands up well to the passing years.","user":"rupie","rank":[43,55]}]