[{"title":"In Majorem Gloriam Dei","rating":10,"date":"28 June 2006","review":"Dreyer's pictures are absolutely mind-boggling .We seem to be in a Rembrandt's or Georges de la Tour's painting.He works with his camera the way a painter does with light to create different textures ,highlights and shadows.The scenes inside the minister's house where the world is still the prey of the good/evil concept are in direct contrast to those ,luminous and pastoral,where the lovers try to reinvent life:some kind of Garden of Eden,which the apple tree on the picture has promised.<br><br>Anne's passion was doomed from the start:her situation recalls that of Phaedra:both are pure even in sin,both are victims of an implacable heredity.Even before Martin's appearance ,the over-possessive mother leaves her no chance at all.<br><br>Remarkable sequences: the old woman's \"trial\",her tortures,her screams (I'm not afraid of Heaven or Hell ,I'm afraid to die!\" Her death at the stake ,with Ann looking through the window pane ,and realizing it's an omen.The children singing terrifying canticles about God's wrath.<br><br>The minister beginning to wonder if his faith is strong enough and the wife's infamous revelation.<br><br>The nature which was a refuge, the only sunlight the lovers could get,becomes misty ,almost dark,as the young man has lost all his hopes and illusions.\"No,Ann says ,it all begins\" It's the seventeenth century and Ann is too ahead of her time.She and the old woman are the real human beings in the movie:the minister and his sinister mother are already dead when the film begins as much as the dying man he comforts in his last hour .Martin has got himself tangled up in remorse,superstitions (You've got a magic power) and if life means rebellion and fight ,his surrender leaves him a living dead.<br><br>The old woman ,the \"witch\" ,is afraid to die,which is human:Jeanne D'Arc herself,another \"witch\" which inspired CT Dreyer had her moments of doubt and fear,and she abjured to save her life .<br><br>\"Vredens Dag\" can still grab today's audience.This is a must.","user":"dbdumonteil","rank":[49,57]},{"title":"No longer in need of restoration-- get Criterion DVD","rating":10,"date":"3 November 2001","review":"I had long avoided this film because I didn't want to see it in an inferior print such as that described by other reviewers.  Happily, the new Criterion DVD (as I write only available in a Dreyer box set, but I expect that will change) is absolutely gorgeous.  The print is just short of flawless-- a few speckles here and there-- but most importantly the tonal range is true to the superb cinematography, one of the best-looking B&amp;W DVDs available.<br><br>LOTS OF SPOILERS BELOW-- DON'T READ UNTIL YOU SEE!<br><br>Having said the above, I thought I'd add something about what I think the film means.  Which necessarily means spoiling the ending (not that you're likely to be in too much doubt as you watch a movie entitled Day of Wrath). At first, expecting something like The Crucible, with a clear message against religious intolerance-- which is certainly where the first part of the movie seems to be going, with obvious application toward other forms of intolerance prevalent in 1943-- I was a bit puzzled by the ending, in which Anna is not so much a victim as self-victimizing.  Having seen her throughout as something of a tragic heroine, and the movie as advocating a more liberal, tolerant Christianity (which, on the basis of other Dreyer films, I assumed was his outlook), I was unsatisfied by her willful self-destruction.<br><br>It was only after I did some reading (starting with Jonathan Rosenbaum's notes, where I learned that some think Dreyer was an atheist, or a rebel against his adoptive parents' atheism, or both) that I realized that the great genius of the film is its very ambiguity, the tragic ambiguity, that goes so far beyond a play like The Crucible, which assumes that everything will be all right if we stop being fundamentalists and become liberal and tolerant Christians.  (Not that it wouldn't help!)  Day of Wrath, it seems to me, is a depiction of how religious dogma destroys different people in different ways.  The pastor-- and in the end, his son also-- is an object lesson in how a seemingly decent man can do evil if he's blinded to it by a rigid faith.  That seems a clear enough message for 1943.<br><br>\nBut Anna is in an entirely different movie in some ways-- a feminist tale of sorts, in which she awakens to the reality of a female subculture of witchcraft in quiet rebellion to the male-dominated religious culture, and comes to believe that she has the powers it promises (what she really has is nothing supernatural, but an awakened sexuality as well).  Her tragedy, though, is that she cannot escape her childhood belief in conventional Christianity, and at the moment when she could be free, it makes her condemn herself to death.  Far from demonstrating Dreyer's actual belief in either Christianity or witchcraft (as Georges Sadoul, for one, claims), this seems to me to be as clear a statement of non-belief as anything in Bunuel.","user":"mgmax","rank":[33,39]},{"title":"like a trip back in time","rating":10,"date":"9 February 2013","review":"(BTW, I liked MisterWhiplash's 1/19/2006 comments.) <br><br>Dreyer's \"Day of Wrath\" is a terrifying trip back to the early seventeenth century, only without modern conveniences like motor vehicles to get one the Heck out of a crazy community on a perpetual witch hunt. It is a brave film made under military occupation. It depicts life under totalitarianism. It is slowly paced, but not boring.<br><br>The sequences up to and including the pyre scene are very moving; and certainly have inspired other films.<br><br>The principal story revolves around a family of four. There's Anne as the young wife of the aging pastor; Absalon, the pastor; Merete, the pastor's mother and Martin the pastor's son. Anne is hated by Merete, one of the most unreasonable figures in the history of cinema. Unfortunately, Merete is well represented by the rest of the community, which is perpetually on the lookout for witches. So, Anne naturally fears she will be denounced.<br><br>The pastor, psychopathic by today's standards, doesn't satisfy Anne in any way. So, Anne seeks it with Martin, at the risk of giving Merete some food for fodder. Dreyer depicts Anne's love very romantic. There's a scene on a rowboat, in a corn field, by the water. Each location is pleasant, hopeful, and a complete contrast to home life with Absalon.<br><br>Dreyer's film achieves greatness as he opens the scant possibility that maybe Anne is really a witch after all. In so doing, he takes us emotionally back to the seventeenth century and has us judge her, just as we've seen the grim-faced clergy members do before. He is making us think like members of the Inquisition! <br><br>This is a complex, brilliant movie made under Nazi occupation about totalitarianism in a parochial, seventeenth century community. It is a miracle it was made at all, and certainly inspires great interest during today's troubled times.","user":"cafescott","rank":[12,13]}]