[{"title":"To my surprise, a great subtle and rather sad movie","rating":9,"date":"20 November 2008","review":"This movie by Carol Reed (director of such great movies as The Third Man, Odd Man Out, The Key, and The Fallen Idol, who finally won the Oscar for Best Director for his musical, \"Oliver!\"(a musical adaptation of Oliver Twist) is simply superb.<br><br>Although this shares the circus setting as some others of the time, it's not primarily \"about\" the circus. It's a profound look at age, comeback, love (whether wanted or not), ambition. It's set in a dark and almost tawdry Paris of the mid-1950s, one that seems still tired and rather poor a dozen years after liberation.<br><br>The whole setting - and the love triangle - are fabulous yet realistic. This is a great bookend for An American in Paris - two entirely different images of Paris and France at the time.<br><br>The Burt Lancaster characterization is simply great - understated, powerful, moving - a man looking for a comeback, a last chance. Tony Curtis is also fine (I think Curtis has long been terribly underrated - he's a very good actor, wonderful in all kinds of parts from The Boston Strangler to Boeing, Boeing, from Sweet Smell of Success (with Lancaster again) to Some Like it Hot). Lollobrigida is great - a fine actress, yes unbelievably sexy but also just excellent at making us feel what her (desperate and cunning) character feels.<br><br>This is a great movie - amazingly set with a circus backdrop. I loved it. It's as good a depiction of post-war western Europe as can be imagined - in music, in light/shadow, in the fatigue you feel throughout. Watch it! You won't be disappointed.","user":"trpdean","rank":[15,15]},{"title":"Very Entertaining Film","rating":7,"date":"7 June 2008","review":"Enjoyed this great 1956 Classic film starring Burt Lancaster, (Mike Riddle) who gave an outstanding performance as an experienced trapeze artist. In real life, Burt left Northwestern University in Evanston, Illinois in his second year and decided to join a circus and traveled all around performing on the high wires. As Burt's movie career became successful, he had the opportunity to make this picture which he had longed to do for many years. Burt teams up with Tony Curtis, (Tino Orsini) who gave a great supporting role along with the beautiful Gina Lollobrigida, (Lola) who added her great charm to this picture and had two men fighting over her for her love. Thomas Gomez,(Bouglione) was the circus manager and gave an outstanding performance to his role as a man who ran his circus with an iron fist. This is a great picture with great veteran actors, enjoy.","user":"whpratt1","rank":[13,13]},{"title":"Almost a great circus movie","rating":8,"date":"24 April 2006","review":"Almost a great circus movie, (if such a thing could exist), \"Trapeze\" comes closer than most to capturing the tawdry excitement of the milieu. While most circus pictures are aimed at kids this is aimed, if not quite at adults, then at least at older kids. It's sexy and it makes the whole business of being a trapeze artist seem like the sexiest, most exciting thing in the world.<br><br>It's about the rivalry that can develop, both professionally and romantically, between artists and the director, Carol Reed, gives the film a charge that his more famous and infinitely more civilized films don't have. As the trio of artists who are almost consumed by their passions Burt Lancaster, Tony Curtis and Gina Lolobrigida have an instinctive rapport. Lancaster and Curtis' performances here seem like a dry run for their work a year later in \"Sweet Smell of Success\" and Lolobrigida never looked or acted better. Although Lancaster wasn't young when he made this, he's like the biggest kid in the playground and seems to be having a hell of a time while Lolobrigida is a dynamic tease.","user":"MOscarbradley","rank":[22,25]}]