[{"title":"Not as bad as you think","rating":5,"date":"28 January 2007","review":"A lot of people will tell you that this film is not that good. I didn't think that this film was that bad. I mean most 80's martial arts films, were not meant to be Oscar winners, it's your standard B movie of the 80's.<br><br>Basically when Sean was a young kid, he dad was killed, and he learned the ways of the Ninja from Izumo. Sean then becomes a karate champion and goes to a world championship karate tournament at a paradise type island.<br><br>The film itself has all of the typical things of a B grade martial arts movie from the 80's. Mediocre acting, cheesy one lines, but some good fight scenes.<br><br>I don't know why a lot of people think that Michele Chan it's not that good looking, I don't think she's unattractive, but that's my opinion.<br><br>If you like campy acting and cheesy one liners, then you will like this film.","user":"Jsimpson5","rank":[6,6]},{"title":"American Ninja 3-Blood Hunt","rating":8,"date":"18 April 2006","review":"I don't think any action movies they make are Oscar material. But,for the insomniac in all of us thank god they do make them. If you did watch the movie BLOOD HUNT, retribution was not on the agenda.!!!! Sean saving his master Izumo was the plot of the movie. It just so happens that he became the guinea pig and that the murderer of his father happened to be one of the bad guys. The movie sidekick Dex was utterly the worst even smegal would have been better. More of David's martial arts would have been better I do agree. And considering he was a martial artist who became an actor instead of an actor trying to martial arts like Michael Dudikoff..Hey don't get me wrong I like Micheal too. My favorite movie of his was AVENGING FORCE with our fav sidekick Jackson.","user":"retta-88","rank":[12,16]},{"title":"Different star, same old action!","rating":9,"date":"1 September 2005","review":"This sequel is slightly different from the other two movies. The star in this movie is David Bradley. What happened to Michael Dudikoff? Well that's not the problem there. The only person I know is Steve James; Curtis \"Powerhouse\" Jackson. Everyone including the young fighter who has some fire in him. I liked it when he deflects the ninja's action with an oar, and decks him with a crescent kick. Jackson grabs one of the ninjas and drops him on his knee and delivers an elbow strike to the chest. Kind of like a power-breaking feat. Sean(Bradley) was drugged at one point, and the lady ninja, teaches him mind of matter, which he uses at the end. The bad parts are which the ninja and the young guy was killed, the kid tried to catch the arrows, a little too late. The bright spots is when Jackson had the dual-bladed sword and slices one ninja, and orders him to \"DIE!\" on Jackson command. It was Steve James last AN movie, at least he'll be remembered as Curtis \"Powerhouse\" Jackson. RIP Steve James, you're the man!","user":"GOWBTW","rank":[10,14]}]