[{"title":"A grand effort from Federico Fellini. Wonderful in every way.","rating":10,"date":"25 September 2003","review":"This is likely the finest make-believe documentary that I have ever seen. The setting is a rundown Medieval Roman chapel, now an oratorio where an orchestra gathers. A television crew is making a documentary about this orchestra (while the orchestra is dealing with a union dispute). The bulk of the film's first half focuses on individual musicians, many of whom reminisce about their first encounter with the instrument they play. When the musicians talk about their instrument, they often share thoughtful and stimulating metaphors about the meaning and the function of their instrument. There are a few times during the film where the action is interrupted by a large rumble in the building. We don't know what this is exactly until the end of the film. The film transforms from poetic, to pure comical delight, to complete chaos, to lyrical beauty when the musicians play the music. <br><br>Composer Nino Rota's contribution was an immense one. He composed all of the pieces the musicians play in the film, and I believe they the music is absolutely wonderful (my personal favorite of Rota's compositions for \"Orchestra Rehearsal\" being the final piece the orchestra performs). This was the last time Rota scored a Fellini film, he died the next year.<br><br>I also must comment on the top-notch cinematography, which is quintessentially Felliniesque (ex. incredible long shots of the orchestra playing, shots of musicians lined up in very particular angles, and a couple of sweeping pans). <br><br>Anybody who loves orchestral music will like this film to some degree. I happen to immensely love Fellini, Rota, AND orchestral music, so for me, this film is nothing short of absolutely marvelous entertainment!","user":"Ymir4","rank":[27,33]},{"title":"the Orchestra as a microcosm of society, or a small Fellini exercise, you decide- I think it's both","rating":8,"date":"15 August 2005","review":"In most of Federico Fellini's best films, he made big statements about the way we live and socialize with each other and deal with ourselves as much as the past, all within exciting, tragic-comic film-making style. Orchestra Rehearsal does the same, though in a shorter amount of time. We are given a (union) orchestra in Italy, who's members vary from young adults to the old timers, women, introverts, trouble makers, and so forth, who each have their own music of choice (or sometimes of necessity). The conductor is frustrated- he can barely get the orchestra to concentrate much less really practice, and the union problems get things caught in the way as they rip through the ironically happy and (typically) carnival-like pieces. There's a break taken, which is when everything starts to slowly, but surely, wind down and breakdown among the musicians. In the meantime a television crew stands by taking 'interviews' of the musicians, their opinions, their little 'off' moments, signaling the anarchy that will soon ensue.<br><br>The interviews themselves are some of the strongest, funniest parts of the film- the interviewers get (sometimes begrudgingly) words on their instruments, why they play, how they play, and what role their music has in the world. These interviews can also be hit-or-miss sometimes, and because of the constant dialog (there's sometimes barely a breath to be had, as is the beautiful claustrophobic style in Fellini's characters), there's almost too much information going on. There's also the tendency for the character(s), whom are mostly portrayed by un-professionals (to acting, not to music of course), to not be very convincing, or even a little boring (the conductor's monologue in his room, for example, is one of the weaker parts of the film for me). But then it does start to pick up in insane, trademark Fellini fashion as the musicians rebel, and an unexpected surprise comes heading their way.<br><br>It's likely that Orchestra Rehearsal isn't one of Fellini's very best films, but it is one that captivates as it bemuses, brings laughs as it does thought, and it isn't necessarily a wasteful experience (some may not like it much at all, at least in comparison to his masterpieces). Not to forget the incalculable, lasting power of Nina Rota's music, which drives the film's bombastic, heart-racing rehearsing scenes (there is also humor underneath much of the music, like when the musicians have their own little solos as jokes). There's something always satisfying when a composer is on the same page as the director he's writing for, and few were ever so in tune as Fellini and Rota. And even during some parts that don't add up, their combination helps out a lot. As mentioned before, one could even think deeper into the ideas and thoughts and characters in the film as almost a microcosm of society itself, its easy-going people, its hard-nosed people, its incendiaries, its nostalgics, and its normals and eccentrics. Or, one can just take the Fellini ride, so to speak, and enjoy some 70 minutes with Fellini &amp; company.","user":"Quinoa1984","rank":[17,20]},{"title":"Great depiction of power struggle with excellent music","rating":9,"date":"26 May 2006","review":"This movie is one of my all-time favourites: through the \"metaphor\" of music, a universal picture of a power struggle is shown. Although this may appear 'thin', many layers of this struggle are peeled off. The German (looking) conductor appears to portray an easy comparison to Adolf Hitler, but another could be to Herbert von Karajan, the dictatorial conductor of the Berliner Philharmoniker. And then there is the great music score, that still lingers in my head, although I have not been able to find a recording of it (CD/LP?)(after almost 30 years!). I saw this movie again some years ago and it does not look dated. While I am not a Fellini adept and this movie was seen as one of his minor ones, this is a real classic to me.","user":"bertvleeuwen","rank":[17,22]}]