[{"title":"I love this movie!","rating":10,"date":"19 January 2005","review":"This movie is one of my all-time favorites! I saw it three times in the theater and thankfully was able to record it during a rare TV broadcast. I watch it at least once a year.<br><br>The costumes and set design are beautiful. I love the basic black and white color-scheme throughout. John Hillerman and Eileen Brennan are wonderful with their witty repartee. Cybil Shepherd is the ideal spoiled,dumb blonde. And Burt Reynolds truly is the consummate rich, playboy bachelor (probably actually type casting back in 1975) It's very campy and of course the songs are phenomenal.<br><br>Forget what the critics say. WATCH THIS MOVIE","user":"lengel46","rank":[27,34]},{"title":"Underrated, Ambitious Musical","rating":7,"date":"30 June 1999","review":"This is definitely a case of people running around saying a film is terrible they've probably never seen.  Upon release, the film was trashed, probably partially because of its type of cinema being out of favor (this was Scorsese/Altman time) and because of people's annoyance with Bogdanovich and Shepard on talk shows and such.  But with time as a distancer, watch this film and dare to tell me it isn't superiour to \"Everyone Says I Love You\" in every way!  I LIKE \"Everyone says...\" but this film, with its cinematography, and its use of Cole Porter tunes to advance the plot, while uneven, is much more ambitious than the charming Allen film.  If you didn't like the Allen film, you may well not like this -- but Reynolds, Shepard, Eileen Brennan singing, which got trashed upon release, is just as good as Roberts, Norton et al warbling in \"Everyone.\"  This is a funny, unique work that does occasionally suffer from the cutes -- but so what?  Polly Platt, Bogdanovich's ex-wife, always talks about this as one of his \"he's no good after he left me\" examples, but at least his musical retains its music (she's one of the creators of James L. Brooks' \"I'll Do Anything\").  This film is a target from so many for no good reason.  I recommend this and \"Nickelodeon\", another overlooked Bogdanovich picture, to be rediscovered as the just plain good films they are!","user":"JimFK","rank":[27,36]},{"title":"Ahead of its time","rating":10,"date":"5 January 2005","review":"This film was widely misinterpreted at the time of its release. As the other commentator on this page mentions, Bogdanovich not only used non-professional singers, but the songs were recorded live! Each actor had an earpiece through which they received a transmission of the basic melody. I was fond of the movie from the very beginning, being such a devoted fan of Madeline Kahn (just check out her Primitive Man number), but the true finds of the movie were the delicious Eileen Brennan and the deadpan John Hillerman, as the faithful servants. I do not hesitate to say that Eileen Brennan, with that incredible delivery and posture, a cigarette dangling from her lips, was the best thing to hit a Hollywood kitchen since Thelma Ritter in All About Eve! I hope this film will eventually be released in DVD. And by the way, shame on you Mr. Bodanovich for apologizing for your creation. Too bad she was not nominated for an Oscar.","user":"mcelesia-1","rank":[22,30]}]