[{"title":"\"This is the first time that we've been really alone ever since we married\"","rating":7,"date":"20 September 2008","review":"Even with the English language and two stars from Hollywood, Roberto Rossellini's 'Voyage in Italy (1954)' immediately distinguishes itself from every romantic drama to have ever come out of the United States. Rossellini was an Italian, and those Italians had a style that was all their own. The film opens with moving footage along a rough road, the camera mounted on the main characters' automobile. Shots like this lack the sheer smoothness and polish of Hollywood productions  which probably would have filmed everything before a rear-projection screen, anyway  and add an essential crudeness that breathes real-life into the settings and story; these are the lingering traces of Italian neorealism, which, by 1954, had already suffered an abrupt decline in popularity. Ingrid Bergman, then the director's wife, and George Sanders plays Katherine and Alex Joyce, a British couple who travel to Italy for a business/leisure trip. However, this disruption of their typical marital routine brings to the surface the couple's pressing conflicts and incompatibilities. Will the wonders of Naples sever or rejuvenate their love for each other?<br><br>'Voyage in Italy' is one of those pictures where nothing much happens, at least on the surface. However, this film is a narrow stream that runs deep. Behind every seemingly-inconsequential scene, every awkward glance, every moment of banal interaction, there lies the key to Katherine and Alex's marriage, and the reasons why it's falling apart. Katherine does a lot of lonely driving in Naples, observing the everyday comings-and-goings of the local folk from the vantage point of a passive, almost-nonexistent outsider. She counts the number of pregnant women in the street, and wonders dolefully whether or not her own refusal to bear children has torn apart her marriage. Alex, meanwhile, skirts the borders of infidelity, elevating his boredom by charming beautiful young ladies (none as beautiful as Bergman, it must be said) but thankfully pulling back at the crucial moment. If one were so inclined, the film also works just as well as a travelogue of sorts, exploring, with exquisite detail, the museums of Naples and Pompeii, and the Italian fascination with the dead.<br><br>By 1954, Ingrid Bergman had spent several years working in Italy, after her marital scandal with Rossellini temporarily lost her favour with American audiences. Here, as lovely as ever, she gives a subtle and touching performance, an unappreciated wife disillusioned by the lack of love in her marriage. George Sanders, the roguishly charismatic male suitor in countless 1940s dramas, here achieves a mature, refined level of charm, such that we're not surprised at his ability to woo even the younger ladies. Through their separate travels in Italy, both characters attain a catharsis of sorts, the focus to finally make a clear decision about the future of their relationship together. This leads to a simple but wonderful exchange of dialogue outside the Pompeii excavation site (\"Life is so short\"; \"that's why one should make the most of it\"), which seems as good a reason as any for the pair to abandon their seemingly-doomed marriage and start afresh. However, Hollywood sensibility here prevails over Rossellini's neorealism roots, and the realisation that life is fleeting instead encourages Katherine and Alex to reaffirm their love for each other.","user":"ackstasis","rank":[26,26]},{"title":"No longer bodies, but pure ascetic images","rating":6,"date":"6 August 2011","review":"This is the film that Truffaut writing for Cahiers proclaimed 'the first modern film', going on to praise Rossellini as the father of New Wave. If we don't want to be stridently literal about these things, I agree with him. A bunch of filmmakers who changed the face of cinema in the 60's are all connected to Rossellini and flow out from this film.<br><br>At the heart of it we have the familiar trope of a marriage falling apart, melodrama stuff. But modern, meaning understated and without the soaring emotion. We fill the gaps, providing our own understanding of how a relationship works. We participate as players.<br><br>So it's about this affair whose nothingness is revealed by the surrounding world, it withers away; the lavish villa with endless views of far horizon, the large, empty veranda where the two of them languish in comfortable lounge chairs. A little outside, it's the countryside of Naples that engulfs them with languid time and hot, lazy weather, a tabula rasa dotted with old ruins.<br><br>We're taken on a pilgrimage of these ruins, as the woman looking for a portent that will divine her predicament. The museum filled with statues, the old Roman fort, Vesuvius and Pompeii; Rossellini presents them as mute, ascetic images, images all pertaining to some austere representation into which the woman projects her own world coming to pass. None of them, of course, hold any answers, except as what they are - reminders of the perishable, impermanent world in which we try so hard to grow roots.<br><br>Meanwhile, back in Capri, the cynical husband is squandered in his own aimless voyage for something that will fill the time. He courts a woman, much like he did his wife perhaps all those years ago. He feigns and thrusts for desire. Finally he returns home with the same void gnawing inside. Passable stuff, as in La Notte some years later, but the important stuff is with the woman's journey; the Stromboli part of the film as it were.<br><br>It is all about the painful process by which ruins are made, time into memory. We are privy to one such enactment in ancient Pompeii (then still being excavated): into the hole once occupied by a dead body, that holds nothing now and is hollow except with shape, the archaeologists pour plaster in order to surmise the shape of that past. Yet what they retrieve is merely the replica of empty space.<br><br>Oh, there's the stupidly saccharine finale, no doubt imposed once again on Rossellini by his Italian distributors at Titanus. It's something to be on the lookout for, for how marvelously Rosssellini confounds his censors. <br><br>As the couple magically decide they finally love each other, the mob of peasants that surrounds them - participating in some local religious ceremony - cries out in jubilee about 'il miracolo!'. The two lovers are swept aside by people rushing to see, reunited in this nonsensical miracle. The final shot is of police offers looking stern as they inspect the scene, like the censors would the film. Whether or not we choose to accept the one miracle, boils down to whether or not we would the other. <br><br>I want to summarize Rossellini here; he's largely forgotten now - probably because when the cinema he envisioned finally took hold, he had already abandoned it. But he's one of the most important filmmakers we have known. You find out that so much of what eventually blossomed with film, grew first roots with him. His transcendent vision was exceptional.<br><br>The only misgiving - slight, very slight - is that everything is relatively precise with meaning. Empty space abounds here, the pure ascetic images, yet is mostly filled for us. We're left with simply unearthing the cast, reading the signs. Perhaps I'm saying this because he envisioned so far ahead that I'm comparing him in my mind with later filmmakers who abstracted deeper. No matter, Rossellini ushered cinema far enough.<br><br>Now it would be Antonioni's turn to shoulder it; he would supply the breathing, incomplete space into which the imagination can pour into. There is no cast that explains away with him, only the means of immersion into a space empty, waiting-to-be-filled with us (not by us). The ensuing voyage that finally brings us to The Passenger is one of the most fascinating that I know of, but that is covered elsewhere.","user":"chaos-rampant","rank":[44,46]},{"title":"A patient, beautiful film that portrays a convincing marriage in crisis against the beauty and details of Naples","rating":23,"date":"23 August 2004","review":"The death of her uncles brings married couple Catherine and Alex to Naples in order that they might handle the sale of their inherited villa. From the first journey they make together, there is a real frost in the air and an apparent lack of love between them. After several difficult nights together where they acknowledge the tenuous state of their relationship and decide to use the holiday to spend time apart as opposed to being alone together. As Catherine heads off to catch up on the history and museums of the area while Alex idles around Capri, flirting and enjoying the friendly company of the young ladies he meets there.<br><br>It has been said that not a great deal happens in this film and those that say this are mostly correct  but they are not being critical of this fact, merely stating it. The basic plot is: couple comes to Italy with marriage problems and, in between fights, travel around the area  and that's about it in terms of definable action. However to simply leave it at that is to do this film a great injustice because so much of it is about more than just what is happening at any given moment and it is actually a beautifully shot and moving story of love within marriage. We join the story where Catherine and Alex (in a very well drawn marriage) have both come to the conclusion that their marriage must nearly be over. Neither really wants that but neither can manage to make things change; frustrated they go off and travel around Naples alone.<br><br>At this point the film balances two aspects with real skill. On one hand the film is a really intimate travel film, not just focusing on the sweeping scenery of the region but getting closer, looking at the specific histories, sites of interest and the people that reside there. Its strength is that it is never just about this because the scenery is just the backdrop for the two characters to discover themselves undergoing soul searching  but in a casual manner, not a heavy, gut wrenching fashion, more of a dawning realisation than anything else. This is subtly down and all the better for it; a convincing marriage that has been worn away to the point that the couple have simply forgotten to just be in love and instead have allowed other aspects of their relationship (the sarcasm, the niggling, the familiarity) to become the main part of their daily interactions. Those who have not been married or in a long-term relationship may not 'get' this film but I can assure you that it will likely be recognisable to you if you have been.<br><br>The chemistry between Sanders and Bergman is very convincing  I felt like there had been love between them but it had just been forgotten. Individually they both played their parts really well  there was no real 'eureka in the bathtub' moment until the end but, up till then, we had seen both the characters pick up little things along the way in a very able manner. The support cast were all good trimming round the edges but, in the version I saw, the dubbing into English was a little heavy at times and made it difficult to judge their performances. However the three stars here are all very good and drive the film without anybody else. Three stars? Sanders, Bergman and Naples itself.<br><br>Overall this is a slow film that has very little happening in it and, for that reason, it may frustrate some modern audiences who prefer their romantic dramas to have more spark and energy to it  however this is much more convincing for being subtle and elegant. The playing of Sanders and Bergman is pitch perfect and help keep our interest in their marriage alive, while the detail and sweep of Naples is well used as a suitable backdrop for them to rediscover their love against. If it were remade today it would be a massively different film, but this should be enjoyed for what it is  a great film that is of its time and should be enjoyed as such even if it requires at least a bit of patience.","user":"bob the moo","rank":[56,61]}]