[{"title":"One of the most haunting and beautiful films ever made","rating":10,"date":"27 March 2002","review":"If any movie could be called filmed poetry, this would be it. From its first opening shot to its last frame, there is such lyricism and emotion and beauty that it almost leaves you speechless. I have not seen this movie in years, but it still affects me and I want to write about it. There is a pervading sadness to the movie, like a memory of something wonderful that could have been, that should have been, that almost was, and is all the more tragic because it was in your hands but slipped through your fingers. This is not a movie for everyone, but if you believe that film can be one of the highest forms of art, this is the film to see.","user":"katsat","rank":[140,169]},{"title":"In A Class By Itself","rating":10,"date":"26 October 2005","review":"This is truly a unique movie: in a class by itself. I had that opinion the first time I saw it on VHS and still feel the same way years later. It's been at the top of my list of favorite movies since I began compiling a list over a decade ago.<br><br>It's very dream-like, surreal, a film I never get tired of watching and I've watched this film more than any other in my large collection. If I had to pin it down to two reasons why, it would be the video and the audio.<br><br>The cinematography alone makes this movie worth watching repeatedly. Now that we all have access to a widescreen DVD version of this, the scenes are even more breathtaking. (I never had the pleasure of seeing this in a movie theater.)<br><br>The same superlatives can be used when discussing the soundtrack, a haunting music score that gets better and better each time one views this film. In fact, lately it's the music more than anything else I miss when I go periods without viewing this film.<br><br>The story is a simple one and is explained by others here. No need to repeat it. I find the narration to be unique, an unusual insight into the characters of the film and the thoughts of the little girl (Linda Manz), who does the narrating. The characters that continually fascinate me are Brooke Adams, as the lead female, and Robert J. Wilke, as the farm foreman. I guess it's their faces that intrigue me. Adams' down-turned mouth and sad look and Wilke's wrinklies catch my attention every time.<br><br>The story is interesting, generally low-key but with a few quick violent scenes that are quite memorable. More than that, one gets an incredible feel for the land and for the migrant workers of that time period. Another nice aspect of this film is the very small amount of profanity. Kids probably would be bored with this film but at least I wouldn't be afraid to show it to them.<br><br>But as many pluses as the story boasts, that haunting music and those incredible visuals are what drive me back for more. Great, great stuff.","user":"ccthemovieman-1","rank":[124,156]},{"title":"Up there with Casablanca & Citizen Kane","rating":1,"date":"1 March 2005","review":"I can understand why Malick didn't make another movie after he made Days of Heaven. The film was panned by the majority of the critics who could only find the cinematography worthy of praise. However, Malick was hugely misunderstood by these dumb critics.<br><br>They complain that the film is ponderously slow. This was the intention. Malick used pause to convey that the characters think. Too many actors rattle off their lines without letting their characters think of them. It also conveys the slow pace of their lives.<br><br>Critics complain that the characters are too remote - one feels removed from them and can't get involved. Hello! It is narrated by a 13 yr old and is essentially her view of the events that transpired. Naturally she does not grasp most of the more adult moments between them and thus is herself removed from being fully involved in Bill and Abby's relationship and that is what has to come across.<br><br>Then Malick, in a moment of genius, allied the four main characters to the four elements; Earth, Air, Fire &amp; Water. Bill is Fire - he is seen at first in front of the furnaces of a foundry where he works. We can see his temper is volatile. Abby is water - in the very first shot she is scavenging(?) by a stream and she is seen against the backdrop of the river. Linda is Earth - In her narration she says that she is close to the \"Oith\". The Farmer is Air - constantly tinkering with his weather vane, and his fields of wheat are often seen waving in the wind.<br><br>All in all a severely mies-judged film and the critics owe Malick a huge apology. The work is pure genius!","user":"rustyk-5","rank":[169,219]}]