[{"title":"Brutal, brilliant, and one of the best Westerns ever made","rating":10,"date":"16 April 2001","review":"A sprawling Western epic that follows the adventures of three gunfighters looking for $200,000 in stolen gold, Sergio Leone's `The Good, the Bad, and the Ugly' is a masterpiece, one that continues to get better and better with each viewing.  In a way, it's a morality play, weighing the consequences of good and evil, but it does so in a realistic manner.  Sometimes, crime does pay, at least in the short term, and sometimes good does go unrewarded. This film probably signaled the death knell of the traditional John Wayne `White Hat/Black Hat' Western.<br><br>The three main characters make the film.  Lee Van Cleef (`The Bad') is evil personified.  Totally ruthless, he'll do whatever it takes to get what he wants.  Clint Eastwood (`The Good') is the Man With No Name, not really `good' in a traditional sense . . . but he has a certain sense of honor and tries to do the right thing.  (Watch the scene when he gives a dying Confederate soldier a puff of his cigar - powerful, and it sums up everything that the Man With No Name is all about, without saying a single word.)  Eli Wallach (`The Ugly') is Tuco, and he's easily the most complex - if not the best - character in the film.  All impulse and rage, Tuco spins wildly throughout the movie, stealing, lying, pretending to be Clint Eastwood's best friend in one scene, trying to kill him in another - Tuco truly represents `the ugly' side of people.<br><br>The movie is long, but there's not a wasted scene in the film.  Each one slowly lets the film unfold with a certain style and grace, revealing more about each character and what's going on.  The pacing is incredible, as is the direction - Sergio Leone manages to build a lot of uncomfortable tension in the film, keeping the film from ever getting predictable.  Any typical Western cliché that you can possibly think of is either given a unique twist or utterly destroyed by Leone's masterful storytelling.  Of special mention is Ennio Morricone's score, which is absolutely perfect.  Two scenes - one in a Union prison camp, one in the climatic gunfight in the cemetery at the end of the film - are amazing on their own, but they become absolutely astonishing with combined with Morricone's powerful score. <br><br>This movie is absolutely brilliant.  If you haven't seen it yet, I strongly urge to do so.  Immediately.  (And then, go watch `Unforgiven' . . . in a way, I think that `Unforgiven' is the sequel to `The Good, the Bad, and the Ugly - it's the story of what eventually happened to the Man With No Name.) `The Good, the Bad, and the Ugly' is easily one of the best Westerns ever made.  A++","user":"MadReviewer","rank":[675,758]},{"title":"An epic Sergio Leone's masterpiece the best spaghetti gold Western film in the Dollars Trilogy!","rating":10,"date":"11 October 2015","review":"The Good, the Bad and the Ugly (1966) is an epic classic Sergio Leone's masterpiece film and a great conclusion to \"the Man with No Name\" Trilogy. This is my number 1 favorite Spaghetti Western about the Civil War and three gunslingers on a search for a lost gold. I love this film to death. It is my personal favorite western movie of all time. Clint Eastwood, Eli Wallach and Lee Van Cleef are the best of the film in their roles. It has a great showdown in the cemetery on the end of the film, the way how it is edited. The cuts with people's faces and close up shots. I love this film to death and it is my number one favorite western in the trilogy. If I had to put then into a 'favorite ranking' list? 1. The Good, The Bad and The Ugly, 2. A Fistful of Dollars and For a Few Dollars More. Those are all three best masterpieces ! They are my favorite Clint Eastwood western movies in the series and they are really my favorite westerns that I am still watching today. <br><br>I love the music score by Ennio Morricone that did wrote different and new theme music score for this film. The Action sequences are awesome and the bullets are flying, the guns in this film are plenty. The scene action are also good which this film makes such an entertainment from begging till end. It is the third entry in to The Dollars trilogy or better known the Man with No Name, it is the final installment of The Dollars Trilogy. This film is a classic that made Clint Eastwood in to a big star that he is today. <br><br>An epic Western that follows the adventures of three gunfighters looking for $200,000 in stolen gold, Sergio Leone's 'The Good, the Bad, and the Ugly' is one of his best masterpiece, one that continues to get better and better with each viewing. A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery. The inimitable \"Man With No Name\" teams with two gunslingers (Lee Van Cleef and Eli Wallach) to pursue a fortune in stolen gold. But teamwork doesn't come naturally to the outlaws, and they soon discover that their greatest challenge is to stay alive in a country ravaged by war. Forging and Vibrant and yet detached style of action never before seen and not matched since, The Good, the Bad and the Ugly shatters the western mold in true Eastwood Style! The film is known for Leone's use of long shots and close-up cinematography, as well as his distinctive utilization of violence, tension, and stylistic gunfights.<br><br>The plot revolves around three gunslingers competing to find fortune in a buried cache of Confederate gold amidst the violent chaos of the American Civil War (specifically the New Mexico Campaign in 1862), while participating in many battles and duels along the way. The film was the third collaboration between Leone and Clint Eastwood, and the second with Lee Van Cleef. Still the race and the three gunslingers were just fantastic who will get the first the gold. The final scene on the cemetery is one of the best action scenes ever. The iconic Mexican standoff, with Tuco, Angel-Eyes in the middle, and Blondie is the best scene in the film. The trio all separately are traveling trough American Civil War who doesn't want any part of the war to do.<br><br>Clint Eastwood as \"Blondie\" (a.k.a. the Man with No Name): a subdued, bounty hunter did a really wonderful job as the good person, he showed that he is honest a good kind gunslinger. I think Clint Eastwood as Blondie did made memorable character and one of his the best acting performance on screen I have ever saw. Lee Van Cleef as Angel Eyes: The Bad, a ruthless, unfeeling, and sociopathic mercenary who always finishes a job he is paid for. Did a terrific job as the villain in this film, gosh this movie is awesome! He convinced me of his acting skills that he is a professional actor. Eli Wallach as Tuco \"The Rat\" The Ugly, a comical, oafish was amazing in his role, Sergio Leone choose him for this film with natural talent as the main cast. Those trio actors did a wonderful job as a different gunslingers on searching for a gold. The film also has humor and it is also brilliant in the both terms, the scene on cemetery where Tuco arrives first and is looking for a tombstone was brilliant. It turned out the gold was buried in a unmarked grave, that was hard to find. I was laughing when Blondie throws a shovel to Tuco for digging up the grave and the Angles Eyes comes and throws another shovel for Blondie, where both of them have to dig now the grave the scene was funny. They are a lot of moments in this film. 10/10 my number1 favorite in the trilogy, I love this film to death.","user":"ivo-cobra8","rank":[125,136]},{"title":"the greatest of the great!","rating":10,"date":"24 August 2005","review":"I wasn't sure if I was going to comment on this film because everything has already been said by the hundreds of other people who have posted their thoughts, but I decided that I should really put my two cents in since this is my favorite movie.<br><br>This film, in my opinion, is not only the greatest spaghetti western of all time. It is the greatest movie of all time. Period. Regardless of genre. I could probably watch it every day, and be perfectly happy doing so.<br><br>The music is perfection. The way the music drives this movie is absolutely amazing. The musical genius of Morricone and the incredible direction of Sergio Leone is a combination that will probably never be equaled. The theme song will forever be etched in your brain. In fact, it probably already is, even if you haven't seen the movie! The scene where Tuco runs through the graveyard with the song \"Ecstacy of Gold\" is pure poetry. And the showdown at the end with that great music- just incredible.<br><br>The story is riveting. There is not a single dull moment. The movie is long, but Leone's direction is so good that you will love the fact that you can enjoy this movie for three hours.<br><br>Lee Van Cleef is my favorite spaghetti western actor, and he is incredible as \"Angel Eyes.\" It is the part he was born to play. Eli Wallach is perfect as Tuco. He really shines in this movie. Some people say he steals the show, and I can see why they think so. Eastwood is excellent as \"Blondie,\" although I don't think Eastwood has as strong of a presence as Van Cleef (I know many will disagree, and that's OK because all three actors are superb in this film so why split hairs?).<br><br>This movie is hypnotic. It's operatic. It's sad. It's funny. It's gritty. It's violent. It's art. It's action. It's pure entertainment. The film is just so incredible on so many different levels that EVERYONE should see it, regardless of what kinds of movies they are into. And it's so cool that the greatest flick ever just happens to be a spaghetti western. If you haven't seen this movie, stop what you are doing, and go get it now!!","user":"spider89119","rank":[441,500]}]