[{"title":"The Dream","rating":6,"date":"16 November 2019","review":"On the age of five, Akiko Kashiwagi had a weird dream that has traumatized her life. Eighteen years later, Akiko Kashiwagi (Midori Fujita) is a school teacher that lives with her younger sister Natsuko Kashiwagi (Sanae Emi) and their dog Leo in an isolated house by a lake. Her fiancé Dr. Takashi Saeki (Chôei Takahashi) visits her every now and then when possible. When a coffin is delivered in the boat house of her acquaintance nearby her house, he is subdue by a weird man (Shin Kishida). Soon victims without blood and two holes on the neck arrive in the hospital and Dr. Takashi Saeki is attacking them at the lakeshore where Akiko lives and he decides to investigate.<br><br>\"Noroi no yakata: Chi o suu me\", a.k.a. \"Lake of Dracula\", is another vampire movie produced by Toho studios. The flawed plot is entertaining and is funny to see Akiko and Takashi going to the vampire house during the night without any weapon. The age of the dog Leo is also intriguing. My vote is six.<br><br>Title (Brazil): \"O Lago de Drácula\" (\"The Lake of Dracula\")","user":"claudio_carvalho","rank":[6,6]},{"title":"Effective vampire horror.","rating":8,"date":"29 March 2018","review":"Otherwise known as 'Noroi no yakata-Chi o su me', this was the second in a vampire trilogy released by Toho, who were by this time coming to the end of the first wave of their Godzilla film series. It is a perhaps surprisingly effective chiller starring Shin Kishida as a gaunt, golden eyed vampire. His scenes are given great menace and shot in effective cold colours. His is a very alien, feral vampire and very eerie because of this, as are his doll-like brides. Tadao Futami should also receive special mention as a very quirky, unnerving 'truck driver.'<br><br>Director Michio Yamamoto infuses the picture with the classic ingredients of traditional horror - fine use of shadows, storms, rain lashing against skeleton trees and a deathly white pallor for the undead - and gives the limited locations a claustrophobic air.<br><br>Good guys Akiko (Midori Fujita) and Dr. Takashi Saeki (Chôei Takahashi) are full of resolve but never quite as interesting - their personalities are strictly confined to solving the various problems at hand leaving no room for characterisation.<br><br>That is my only real issue with this though. Everything works in a surprisingly restrained, sinister way, except the vampire's eventual demise, which is terrifying. It certainly won't change your world, but it is significantly more than the bygone horror curio I thought it was going to be.","user":"parry_na","rank":[6,6]},{"title":"Solid enough if a slight let down","rating":7,"date":"13 June 2017","review":"Arriving at a small lake-side town, a new teacher comes to suspect that someone is behind the strange incidents and dead bodies piling up around town, and when she learns that a master vampire has moved into the area she sets out to stop his blood-soaked reign against the villagers.<br><br>This was a decent enough if slightly flawed vampire effort. One of the few solid points involved here comes from the way this goes about trying to instill the idea of the vampire in the area as the build- up here is somewhat credible. Building the strange crate delivery alongside her arrival at the same time is quite nicely handled, and the first attacks, as well as the discovery of their aftermath, all come off rather well as the mystery starts to unfold. Even some of the fine action scenes throughout here, from the abduction in the woods before being startled away and the hospital resurrection of the first body to the idea of the nightly romps through the woods where he's able to feast on her friend despite continually denying it all makes for a rather fun time here and sells the idea of her mental competence rather well which runs through the first half of the film. Once it's confirmed that there are vampires involved, things pick up far more here with the Gothic action scenes really enhancing this one from the ambush in the car at the same time the two of them trap her in the home and begin tormenting her or the hospital awakening sequence give this some really energetic and lively moments. However, it's really the big confrontation at the end which really works best here with the Gothic imagery and action really making for a great finish and gives this one a lot to really like here with the way it all wraps up inside the basement and spreading throughout the rest of the house. Still, while these are the film's good points there are a few negative issues. One of the main problems is the fact that the film really suffers from a stiff and dragged out beginning where not a whole lot really makes an impact. Despite the series of events that play out here detailing the emergence of the vampire around the village, it's still a somewhat dull and dragged-out effort where those brief spurts feel like exceptions to the bland dialogue-heavy sequences that are much more commonly featured so this one really feels like it takes a while to get going. By focusing on her burgeoning mental instability doesn't make for a fun time here regardless of how well the vampire storyline is built through these events, this one really takes more time than it should in letting loose with its story and comes across as somewhat duller than it should be considering what goes on. Likewise, there's also the rather economical manner this one manages to make the heroine think of her predicament and how she buys into it all, as a few throwaway lines regarding the Western methods of dealing with vampires and yet it's completely bought into without so much as a real questionable thought. This makes for a tough time overall, although it does still have its moments.<br><br>Rated Unrated/R: Violence, Language and violence-against-animal aftermath.","user":"kannibalcorpsegrinder","rank":[3,3]}]