[{"title":"Brilliant, sad and very well written.","rating":10,"date":"19 January 2011","review":"\"Come Back, Little Sheba\" is a picture that will sneak up on you as you watch it. At first, it seems a bit mundane---perhaps even a bit dull. And, you'll most likely become annoyed with the wife. However, as the film slowly unfolds you suddenly see that it is brilliant--brilliantly written as well as acted.<br><br>Shirley Booth received an Oscar for her performance of a dowdy and not particularly interesting or effective housewife. In essence, she is a sloppy and particularly unattractive woman. The handsome Burt Lancaster (wearing makeup and playing a much older man than he really was) is married to this woman--and down deep this loveless marriage to a sad and rather annoying woman is eating him alive. He maintains a placid demeanor--stuffing his anger and resentment down deep as he consumes antacids and complains of stomachaches. He also is a recovering alcoholic who is on edge--and appears setting himself up to drink again. It's a living hell for him, as he is silently bitter about being forced to marry Booth decades before when she became pregnant. The fact that she subsequently lost the baby and is unable to have more doesn't make things any better. Booth's way to cope with this sad marriage is through her dog, Sheba, but since the dog has disappeared, the loneliness of their marriage has become more apparent. It also becomes more apparent when they take in a young boarder (Terry Moore), as she's young, vivacious and has an active and happy love life. All these factors (and more) work together to create a very sad and realistic portrait.<br><br>It's obvious that the writers knew a lot about psychology and alcoholism--and this is why I love this film. Not only are the characters wonderfully real, but they are realized correctly--and they definitely get the little details right. For example, it's one of the best films when it comes to alcoholism. Why this man drinks is fascinating--it's not just because he likes the booze, but it's to temporarily escape this awful life--something rarely talked about in films. It's also very interesting how all his hidden rage is released when he drinks--a year of pent-up anger comes exploding from him. Also, the way his sobriety and AA are shown is exceptional--it's a lot more realistic than the more famous (and overrated) \"Lost Weekend\" (which has a ridiculously upbeat ending). They show an open meeting, talk about the 12 Steps, the Serenity Prayer and the job of AA sponsors.<br><br>What's more fascinating for me are the psychological elements--and the writers clearly were putting in a lot of analytic psychology and symbolism. The juxtaposition of Moore's happy life to theirs is symbolic of the emptiness of the couple. It's also creepy and symbolic how this sick couple refer to each other as 'Baby' and 'Daddy'--especially since they cannot have kids. But what really made me excited was listening to Booth's dream at the end of the film--it was chocked full of Freudian symbolism and showed they knew a lot about the psyche. Booth's dream was symbolic of so much--you could listen to it and interpret the meanings at great, great length.<br><br>Aside from the exceptional writing, there are some other things to note. Moore is very sexual throughout the film--she is not some stereotypically nice college student but seethes with sexual desires--something very rare in 1950s films and not really seen much until the late 1960s. This helps the story a lot since Booth and Lancaster completely lack this element in their marriage. Also, I loved the acting of Booth and Lancaster. She is able to express so much with her face and body language--you really have to see it. Also, while Lancaster's performance is much more subdued, I loved how he walked through the house when he was intoxicated--slightly touching things to steady himself as he slowly makes his way though the house. It was a little thing--but the director did a fine job as did the actors as lots of little things were used to give the film a rich texture.<br><br>So is the film worth seeing? Of course--it is magnificent. But be forewarned that it isn't exactly fun viewing. Often you'll find yourself cringing and by the end there is a pervasive sense of sadness and emptiness that many will find disturbing. Plus I could imagine that the film could kick up a lot of baggage in some viewers.","user":"MartinHafer","rank":[21,22]},{"title":"Heartbreaking, heartfelt film with a world-class star turn","rating":9,"date":"31 August 2006","review":"Not everyone can make four films in an entire movie career and win an Oscar for one of them. Shirley Booth was already a 3-time Tony-winning actress when she repeated her stage success in the film \"Come Back, Little Sheba,\" and she would go on to win two Emmy Awards as the title character in the long-running TV series, \"Hazel.\" Shirley Booth was born to play Lola Delaney, and deserved every accolade that came her way for her performance.<br><br>The secret to playing Lola Delaney is something that we don't see enough of in contemporary American movies, and that is great acting, pure and simple. Shirley Booth simply becomes Lola. She isn't playing a real-life character, so there are no models by which to judge her skill at mimicry. She isn't playing a monster, or a woman triumphing over crippling adversity; she isn't a tragic figure or a powerful woman.<br><br>The Lola Delaneys of this world are so ordinary they practically fade into the wallpaper. They live their lives through and for other people. Lola is composed of bits of all such women. She is lonely in a childless marriage, desperate in her desire to please, overly sentimental, naive, guilt-ridden and utterly lacking in self-esteem. She and her husband, Doc (Burt Lancaster) have a marriage that consists mostly of tolerance of each other's foibles and occasional forced gaiety.<br><br>William Inge, the last century's most unjustly forgotten playwright, probably knew a great many Lolas growing up in Kansas. But many of Inge's female characters are stronger than they realize, including Lola. Madge in \"Picnic\" and Cherie in \"Bus Stop\" also come to mind. Many of them know what they want from life and have a clearer, more pragmatic idea of how to get it than the men around them.<br><br>Most of Inge's plays are deceptively simple not only in the characters they depict, but in setting and structure as well. \"Little Sheba\" derives a lot of its power from its author's constraints, and it's a bit more true to its source than some other movies adapted from his plays. As with most Inge plays, this one \"starts in the middle\", and as the story plays out we see how the characters got to where they are, and whether they will stick with what they've got or make a break for an unknown future.<br><br>In \"Come Back, Little Sheba,\" we meet Lola and Doc at a time when their marriage has become purely an exercise. It was the product of teenage lust, lived in shame and out of a sense of convention its first year. Gradually the couple lapsed into codependencynot a word that Lola and Doc would have knownbut appropriate to describe their existence as she made excuses for his alcoholism. He has been sober for a year, but he's on a slippery rope.<br><br>And now, Lola and Doc are in a holding pattern, that is, until they take in a college student, Marie (Terry Moore), as a boarder. Her mere presence, her youth and vitalitynot to mention the overt sexuality that she representsforces the Delaney house into crisis. It is likely that Marie leaves the Delaney home under the same cloud the Delaneys came into it, but her brief stay and sudden departure have grave lessons to teach both Lola and Doc.<br><br>Lola learns to stop dwelling in the past and yearning to undo past mistakes. Marie's smoldering affectalthough to be fair she really does not try to lead Doc onsends him reaching for the bottle again. In the end, Marie may never know that she has forced the Delaneys to re-examine their marriage. The final scene ends on an optimistic note, brighter than anything Lola has ever said in an effort to be a lively conversationalist or to feign happiness. It rings quite true, just as does everything in Shirley Booth's brilliant performance.","user":"ecjones1951","rank":[27,29]},{"title":"Forget \"Hazel\" - And Bring Tissues","rating":9,"date":"21 August 2004","review":"Shirley Booth was a remarkably versatile actress - she did comedies, musicals, and dramas - and won the adoration of critics and audiences in all. But as with Agnes Moorehead and Eve Arden, her success in a TV comedy, \"Hazel\" tended to over-shadow her work on stage or film.  A well-liked comedic actress on Broadway since the 1930s, she reinvented herself as a dramatic actress in 1949 with COME BACK, LITTLE SHEBA, winning every award in sight.  Although the film version was offered to the likes of Bette Davis (who turned it down because she felt she couldn't bring to the role the \"gorgeous vagueness\" Booth had), Hal Wallis wisely went with Booth to recreate her stage role, casting Burt Lancaster for box-office appeal. <br><br>\nBooth's performance as Lola is astonishing, filled with nervous energy and anxiety, living on the edge - ask anyone who's ever lived with an alcoholic - every gesture, every emotion she plays, is honest and accurate.  When I finally saw this film in the early 1990s, I was floored by Booth - where in heck had she done her research?  Help for families of alcoholics (the Al-Anon Family Groups) was still several years off when the stage version was done - the resources available to Booth would have been \"open\" AA meetings and perhaps talking with family members. (Incidentally, the director, Daniel Mann, wasn't finished with AA - a more realistic AA meeting figured in his 1956 I'LL CRY TOMORROW, in which he directed Susan Hayward to an Oscar nomination - ironically, she lost out to Anna Magnani's Mann-directed performance in THE ROSE TATTOO!)<br><br>Booth was still alive at the time I first saw this film (around 1991-92), and I knew after watching that, unfortunately, her great success as TV's \"Hazel\" over-shadowed SHEBA, and that when she died, the obit's would begin, \"Shirley Booth, TV's HAZEL, is Dead...\" and I was right.  Agnes Moorehead had a similar fate - the generation which grew up on \"Bewitched\" was clueless that Moorehead was one of the finest, most versatile and respected actresses around and, like Booth, every bit the equal of the other leading ladies (whom she'd usually supported).  I remember attending a screening for the 50th anniversary of CITIZEN KANE and hearing gasps of astonishment as the cast's names appeared \"That was AGNES MOOREHEAD!!!!\"<br><br>Yes, indeed.  And THAT was Shirley Booth, breaking our hearts in COME BACK, LITTLE SHEBA.  Forget \"Hazel,\" and bring tissues.","user":"Harold_Robbins","rank":[55,63]}]