[{"title":"Superb chilly chiller mystery from the house of Hammer.","rating":8,"date":"26 March 2010","review":"God bless the internet and god bless DVD. The reason I say that is because once hidden gems like this film are now being discovered by a bigger audience. Taste Of Fear (AKA:Scream Of Fear) is produced out of that bastion of British horror, Hammer Films, it's directed by Seth Holt (The Nanny), written by Jimmy Sangster (X:The Unknown/The Curse Of Frankenstein) and stars Susan Strasberg, Ronald Lewis, Ann Todd &amp; that cornerstone of Hammer Horror, Christopher Lee.<br><br>Shot in moody black &amp; white by Holt and cinematographer Douglas Slocombe, and eerily scored by Clifton Parker, the story sees a young paralysed woman return to her family home in France to visit her father who she hasn't seen for years; and to finally meet her new step-mother. Upon arrival she is informed that her father has had to go away on business, which becomes a problem as she starts to see his dead body, first in the summer house, then in the lounge! The mind can play tricks, especially to the traumatised, but she's convinced that what she is seeing is real. Even the family doctor (Lee in a suitably suspicious role) thinks there are mental issues here. Undaunted she enlists the help of friendly chauffeur Bob and sets about unravelling either her mind, or the mystery that lurks at the Appleby home.<br><br>The film opens with an attention grabbing sequence as police drag a lake for a body, from there on the film becomes essentially a four character piece. Now it's been said in some quarters that this structure telegraphs where the film is going to end up. There's a tiny bit of truth in that but there are at least three twisty kickers here to steer this far away from charges of predictability. In fact the finale has a double whammy that is most rewarding. The whole film pulses with atmosphere and is cloaked in shadows and low tone conversations. The sound work here is also top quality, the constant jabber of the crickets gnaw away at the ears, while the swish of the nearby sea instills a calm that ultimately sets up a false sense of security. The acting is on the money too, be it Strasberg perfectly conveying a multitude of emotions from her wheelchair, or Todd doing a nice line in the \"too good to be true?\" wholesome step-mom routine. All parties ensure that the story is built up right and that the pay off provides maximum impact.<br><br>Christopher Lee once said that this was one of the best Hammer Horror film's he was ever involved with, that's a fine selling point to be sure. A different kind of Hammer Horror, one that drips with dread and thrives on its mystery elements. Taste Of Fear is highly recommended to genre fans who prefer psychological chillers over blood letting and overkilled boo jump movies. 8/10","user":"hitchcockthelegend","rank":[47,50]},{"title":"A stylish chilling little thriller","rating":10,"date":"9 May 2007","review":"Yes, this is indeed a very nice little horror film. It is chilling and suspense. The acting of the three major actors is really well done, they all fit the roles, and the whole atmosphere of the film has maked it rather stylish. Using Susan Strasberg for that role is a good choice. She's rather pretty charming actually, especially when compared with those star actresses of nowadays. This is a small production of the early 60's, but none of the big budget Hollywood horror films can compare with it even though they might have tried to copy part of its shadow. I do not know how to explain, but you if have watched the movie, you will feel something, you will feel the film having the style in its own way. You simply cannot find such kind of stylish production often on TV or in theaters. Like the other film fan from UK, I have recorded it down few weeks ago, and watched it in the afternoon the day after. It's good that I have not watched it alone at night. I am really glad that I have now the whole movie in its original theatrical wide screen format on my own DVD. Here I specially thank for the TV-listing information of the Dutch inter net site and the film information in IMDb. They made me have a chance to know and discover this nice film and take action to record it down. If you have a chance to watch this film, don't miss it! You will surely like it in a way!","user":"ben-727","rank":[28,29]},{"title":"Almost Forgotten Classic","rating":22,"date":"22 April 2007","review":"As my title suggests, \"Scream of Fear\" (UK title) is barely known and this is hardly surprising since the film is very rarely shown in the UK and last time was put on at half past three in the morning - therefore unlikely to pick up many new admirers. I consider this to be very poor treatment of a movie that serves as a great example of the sort of thriller we used to be able to produce in this country.<br><br>A brief summary of the story is that wheel-chair bound Penny Appleby travels to France to re-unite with her father who she has not seen for some nine years and to meet her new step-mother. Her father is not there when she arrives however and she begins to get suspicious that all is not as it seems...<br><br>This can arguably be ranked among the best of the Hammer Horror series (though of course there are some other worthy contenders) with more emphasis on the cinematography, the script, the chilling atmosphere and great acting than things like painfully obvious plastic bats on strings that mar other efforts. The story is a little predictable and cliché, but it is well-worked and contains some genuine surprises and real chills. I saw some twists coming, but certainly not all. The similarity to Psycho is clear, but the tone also reminded me a little of another Hitchcock classic, Rebecca. The setting of the creepy French villa adds a great macabre touch to the proceedings, but the brilliant swimming pool scene is the one that sticks in the mind long after viewing. The filming of it in black and white is very effective and the lack of gaudy primary colours that dominate many of the Hammer films (due to the fact they were the first horror films in colour) is welcome. Of course this was filmed in Black Park in Buckinghamshire and not France but the production looks deceptively expensive.<br><br>For anybody who hasn't seen it, do not expect this to be a Christopher Lee film (though it has been billed as such on the BBC) per se as his actual screen time is limited at best, though he makes a solid contribution as always. Instead it is left to Susan Strasberg, Ann Todd and Ronald Lewis to carry the film and they play their parts to perfection.<br><br>\"Scream of Fear\" not available on DVD anywhere as far as I know except Japan, but this is well worth looking up for anybody who enjoys a good thriller or horror.","user":"bs3dc","rank":[20,21]}]