[{"title":"Excellent black comedy thriller","rating":8,"date":"6 July 2004","review":"This film is incredible. Polanski's best film behind Knife in the Water and Rosemary's Baby.<br><br>The plot revolves around a gangster (Lionel Stander) and his partner that seek refuge in a castle on a small island in England. The couple that inhabit the castle are played by the sublime Donald Pleasance and the beautiful Françoise Dorléac. The movie plays out like a three way triangle of hatred; we have the contempt between the couple and the gangster, who is invading their home; the gangster's mean streak is inflicted on the couple and the lady obviously holds her husband in low regard when he takes on the role of a wimp in front of the gun toting criminal. However, it is not as simple as that as in several points in the movie, the characters let their guard down and start to communicate with each other in an almost friendly way. This is the real beauty of this film; it is a character study, studying the relationship between a couple and a third party in their home. Three is a crowd, and the effects of that true to life phrase are felt by each of the three characters.<br><br>The three main players in Cul-De-Sac are fantastic, Lional Stander in particular who was surely born to play his role in this movie. He has the voice and the persona of a not very bright gangster spot on; his comic timing for some of his more obviously funny lines is also noteworthy. Donald Pleasance has never been better than he was here either; his portrayal as the 'lord of the manor' is both believable and intriguing. Last but not least, Françoise Dorléac, in undoubtedly the most overlooked role in the piece, although no less important than the other two, is also on time and believable in her role; making up a perfect cast.<br><br>From a relatively simple plot line and few characters, through excellent dialogue, restrained plotting and interesting scenarios, Roman Polanksi has managed to weave a story that is interesting and entertaining. Roman Polanski has a great flair for human relationships in his movies, the best example of this was in his best movie, Knife in the Water, and that element is abundant here too. The scenes in which all three characters are on screen interacting with each other are this movie's finest moments.<br><br>\nCul-De-Sac is an excellent black comedy thriller that fans of the genre and fans of the excellent Roman Polanski will not want to miss. Recommended viewing","user":"The_Void","rank":[55,75]},{"title":"Highly Intriguing Polanski Drama","rating":28,"date":"28 April 2002","review":"Two gangsters on the run hide out in a isolated castle that is occupied by Plesance and Dorleac.  The two share a rather bizarre passive, aggressive relationship that quickly disintegrates when interrupted by the strangers. Eventually a even more bizarre bonding develops between the couple and Stander, one of the gangsters.  Very, very intriguing psychological drama with wonderfully subversive elements lurking just beneath the surface.<br><br>Polanski makes full use of the castle showing it's dark, shadowy interior as a sort of symbolic equation to the dark recesses of the human mind.  The characters all have their odd traits yet are still believable and compelling to watch.  Wonderfully photographed with a strong visual style that really gives this film a distinct look and personality.<br><br>Stander, who is probably best known as Max on the old HART TO HART series, has one of his finest roles.  He plays a brute that mixes both savage and human traits all at the same time.  Plesance though is astounding, playing a truly pathetic character that is simply unforgettable","user":"rwint","rank":[19,24]},{"title":"Shallowness at its very best","rating":3,"date":"3 April 2003","review":"Cul-de-sac is a very beautiful black and white movie. It belongs to the lightweight category. The story is weird in an entertaining way, often amusing and sad at once. If the director tried to be willingly shallow, he was very successful. And I do not mean that ironically but say it with awe.<br><br>The place is Holy Island, on the east coast of Northern England. It actually gets cut off with the tide. Polanski makes very good use of the location and was very lucky with the casting. All characters are rather detestable in a detached sort of way. Donald Pleasance gives the performance of his life as the emasculated, utterly humiliated owner of the castle on the island. The other two main characters are the brisk yet elf like Françoise Dorléac and Lionel Stander as a gruff, brutal gangster. There is a very strange, truly unique chemistry between Dorléac and Stander. Dorléac does something to Stander. «We call dees a bicycle», she says gleefully with her funny accent, and it nearly knocks me off my chair every time I see that well filmed, suspenseful scene. I wont tell you what «de bicycle» is  it may need parental guidance to watch it but does not belong to the restrictable area. Cul-de-sac has a very memorable musical score.","user":"manuel-pestalozzi","rank":[29,50]}]