[{"title":"Wham! Bam! Thank You Ma'am!","rating":7,"date":"18 May 2006","review":"'Cold Sweat' is a 70's actioner I was actually quite pleasantly surprised by. Charles Bronson plays a guy whose cronies have caught up with him after spending many years in jail for a crime that he fled from. He's in sanctuary in France with his wife (played, rather slummingly wouldn't you say? By Liv Ullmann), and what do you know, his evil friends from the past catch up with him and takes his whole family hostage so that they can complete the One More Job together. Bronson accepts, but since this is a Bronson film, He's Got Other Tricks Up His Sleeve. So begins a fun little cat and mouse game, mainly dealing with the daughter or other of the bad guys (played hilariously by James Mason) and the trade-offs Manson and Mason are fun to watch. There's lots of chases too! Wee! Finally, I just want to comment on the print of the film I saw on DVD. It looked somewhat banged up, but I thought it just added to the viewing aesthetic of the movie! I just felt I was in a New York grindhouse movie theater, with this double featured with say, Dolomite or something.","user":"Spuzzlightyear","rank":[9,9]},{"title":"Write-Off that Vacation to the South of France!","rating":9,"date":"27 December 2003","review":"I watch movies for specific reasons. I don't always look for such things as a plot. What did I get out of \"Cold Sweat\"?<br><br>First, a reminder to mix business AND pleasure. The gentlemen who produced this could have filmed in New Jersey. Rather, they chose the south of France. Good choice! Beaulieau-sur-Mer in the south of France, as well as the lovely French countryside way down south.<br><br>Charles Bronson pumped up, as usual. It appears that he does a set of push-ups before every scene. He's cut, in a black T-Shirt for the whole film. And he's not in his famous revenge mode. Here, he calculates. And expresses himself, emotionally. See the quote section...<br><br>Terrance Young's direction. Yes, the early Bond-film director is at his bond-vivant! best, with rich panoramas and an eye for pretty things. I'll have another, garson.<br><br>Nice Airport and a really cool 1970 hair salon. Think Korova milk bar ala Clockwork Orange.<br><br>Old French cars from the late 60's. Those Citroens are cool. And that off-roading experience in that red sedan was hilarious. Also, the close-up of the bias-ply tire folding over...priceless.<br><br>Finally, attractive leading ladies.<br><br>If you can find this movie, watch it! I found my DVD at Fleet Farm coupled with another Bronson movie, \"Chino\" for the reasonable charge of $4.99.","user":"erichyoung","rank":[20,24]},{"title":"COLD SWEAT (Terence Young, 1970) **","rating":5,"date":"27 September 2007","review":"Though proudly billed as Terence Young's COLD SWEAT, this turned out to be a below-average international concoction: the plot is formulaic  albeit adapted from a novel by Richard Matheson  one that Bronson often returned to, of a man whose past catches up with him (in fact, I recently watched Sergio Sollima's similar but superior VIOLENT CITY [1970]).<br><br>The film is doubly disappointing, however, for wasting the talents of actors of the caliber of James Mason and Liv Ullmann  the latter clearly wishes she was elsewhere, while the former often resorts to hamminess (with a ridiculous American accent to match). As expected, the narrative flanks Bronson with real-life spouse Jill Ireland  here in perhaps her most embarrassing performance as a spoiled hippie brat; needless to say, the star more often than not lets his physique do the acting for him  but his is an undeniable screen presence and, as I've written elsewhere, he just happened to fit the bill for what was required of an action star in the late 60s/70s.<br><br>The supporting cast also includes Michel Constantin (who was also in VIOLENT CITY), \"Euro-Cult\" regular Luigi Pistilli, and Jean Topart  all of them appearing as members of Mason's gang, with the latter being the most villainous of the lot and who gets his just desserts in memorable fashion. The best thing the violent film has going for it are the plentiful and exciting action sequences, particularly a lengthy  if somewhat irrelevant  car chase towards the end (once again, the work of Remy Julienne). Though the budget DVD at least presented it in the correct aspect ratio, the print for COLD SWEAT (which, along with a few other Bronson titles, has fallen into the public domain) was still too soft and murky to do justice to its variety of European locations.","user":"Bunuel1976","rank":[12,14]}]