[{"title":"The Great Champagne Offensive","rating":8,"date":"4 October 2006","review":"Kings Go Forth is one of, maybe the only, film about the Allied offensive in Southern France in late summer of 1944. Several divisions who were fighting in Italy under Mark Clark were sent to invade France from the south. The action as compared to the larger shows movie east from Normandy and north up the Italian peninsula was light as the Germans were retreating to protect their own borders. It was called the champagne offensive because it was as you see it with Frank Sinatra and Tony Curtis, fighting one minute, and on a weekend pass the next.<br><br>Frank Sinatra narrates the story with him as one of the protagonists. He's an army lieutenant and he's just gotten some replacements for his company, one of them being Tony Curtis. Curtis is a spoiled rich kid, a real smooth operator. But he turns out to be a good soldier and he and Sinatra become friends despite Sinatra being an officer and Curtis non-com. <br><br>Then the two of them get interested in the same girl, Natalie Wood. She's an American expatriate living with her widowed mother, Leora Dana. Her father was a black man and they left the United States many years before to escape ruling prejudices. Ironic that they escape to France and then France gets occupied by the real prejudice merchants.<br><br>The film is divided equally, half of it concerning the war and half of it dealing with the romantic triangle. For the second time in his career, the first being in Sweet Smell of Success, Tony Curtis plays a heel and does it well. Curtis was really coming into his own as a player and not just a pretty face. Kings Go Forth was filmed on the heels of his Oscar nominated performance in The Defiant Ones.<br><br>Frank Sinatra gives one of his best screen performances in Kings Go Forth. None of the hipster slang, not the nebbish of his forties musicals, Sinatra plays a really good man trying to deal with his own inner conflicts about what he's been brought up to believe and the feelings he has for Wood. It's something different and Sinatra does it well.<br><br>Natalie Wood was as beautiful as they come and Leora Dana as her mother who's seen too much of the world and is determined to protect her daughter has some of her best screen moments. Tony Curtis liked working with Natalie Wood very much in the films they made together, but he does mention in his autobiography it would have really been great if someone like Dorothy Dandridge had been cast in her role. It might have made Kings Go Forth better remembered today, as much as classic as Guess Who's Coming To Dinner.<br><br>Elmer Bernstein did the film score and one of the themes was given a lyric by Sammy Cahn and became the song Monique after Natalie Wood's character. Frank Sinatra made a hit record of it though it is only heard instrumentally in the film. It's one of his loveliest ballads.<br><br>Viewers should see the film before hearing Sinatra's record of it. The whole premise of the film is the plain Sinatra and the smooth Curtis competing for Wood. You hear old Blue Eyes sing Monique and you'll find it hard to believe why he didn't just sing that song. <br><br>Why Natalie would have melted right away in his arms.","user":"bkoganbing","rank":[31,34]},{"title":"I'm upset about this film","rating":18,"date":"18 March 2002","review":"I'm still upset about this film. Its been over for 15 minutes and I'm still having bursts of tears and I want to settle down so I can go upstairs to sleep. Its a good war movie and a great love story about a triangle between Wood, Sinatra and Curtis. Sinatra plays the guy a lot of us feel like in high school when the slickster scum (Curtis) moves in on the one you're crazy about. The racial issue is not nearly as important as the basic trianglular struggle, with a not meagre war plot well mixed in. Obviously Wood does not remotely look half black (as she is supposed to be) and her French accent leaves a bit to be desired but she is beautiful, Curtis is handsome and Sinatra plays quite well the man whose beauty lies within. Most of today's movies are 50 cent scripts with 50 million dollar special effects and no class. This movie is the exact opposite on all counts. Super acting, story and heart. Made me cry more than once. This is why I like old movies better than new. A movie that its makers could be proud to offer their maker.","user":"mikedonovan","rank":[40,51]},{"title":"Nice Work If You Can Get It","rating":8,"date":"26 April 2007","review":"There are some tasty technical credits on offer here; two fine novelists fashioned the screenplay and versatile veteran Delmer Daves, no slouch as a writer himself, was behind the camera. Southern writer Joe David Brown had three of his novels adapted for the screen beginning with Stars In My Crown and ending with Addie Pray which became Paper Moon with this one in the middle. His fine novel was altered in keeping with the climate of the times yet although the girl survives we are still denied a happy ending.<br><br>This is one of Sinatra's finest acting jobs and his understated Sam Loggins surpasses the flashier Frankie Machine of The Man With The Golden Arm because he is saddled with the thankless task of portraying basic decency, if not goodness, and not being Jack Lemon, James Stewart or Gary Cooper, all of whom personify the quality before saying a word or doing a thing, Sinatra is obliged to ACT it and makes a first rate fist of it. The Sinatra persona we know is highlighted in the opening sequence; it's 1944 and Sinatra's company are in the South of France marching to a new base camp; Paris has just been liberated and the locals are cheering the arrival of the Americans but one old lady (Maris Isnard) silently offering a drink of wine - probably all she has - is totally ignored and even Sinatra's Lieutenant Sam Loggins passes her by at first but then he pauses, walks back to her and graciously accepts a glass of wine with a smile. They exchange pleasantries then Sinatra leaves and as he does so he gently takes the bottle from her and hands her the glass. Economically the screenplay introduces the second male lead, Sergeant Britt Harris, a replacement radio technician. This is the kind of part that Tony Curtis used to phone in; a brash, arrogant, smarmy,full of himself little s**t; this time around he's rich as well, the spoiled brat who's managed to avoid any dangerous assignments and treats a world war as a glorified night club. In the fullness of time Sinatra meets Monique Blair (Natalie Wood) and is instantly smitten. The following week he meets her mother, Leora Dana, and becomes a regular guest at their large villa on every weekend pass he gets. In nothing flat both mother and daughter are so comfortable with him that they reveal that Monique's father was Black (or, as they used to say in 1958, a Negro). The stage is now set for Curtis to upset the apple cart and he duly obliges when Sinatra foolishly takes Monique into Nice for a night on the town and they stumble into a club where, lo and behold, Curtis turns out to be a dab hand with the trumpet. From then on Sinatra gets less of a look-in than he did previously until the inevitable moment when Curtis informs all concerned that he never had any intention of going through with marriage to Monique on the grounds that he is a bigot but not averse to Black tail. In the novel Monique who had led a sheltered life to say the least - her parents had deliberately moved to France for her birth and Sinatra was the first American she had ever seen - commits suicide and Sam kills Britt but in the movie Sam sees to it that Britt is killed, loses an arm himself and visits Monique for a last farewell before returning to the States; since the death of her mother (for which no explanation is offered) she has taken to running a school for orphans and that's where we leave her. There are two excellent performances from respectively Sinatra and Leora Dana, who was actually some eight years younger than Sinatra and made up to look the forty-something she was meant to be. Curtis is just Curtis, mediocre to fair and Wood is unconvincing as a girl born and raised in France. Jazz buffs are catered for in the nightclub scene where the musos include Red Norvo, Pete Candoli, Mel Lewis and Richie Kamucha but playing the kind of 'modern' jazz more representative of the 1950s - as exemplified by the Chico Hamilton combo in another Curtis movie, The Sweet Smell Of Success - than 1944. On balance a good rather than a great film but more than worth a look.","user":"writers_reign","rank":[16,19]}]