[{"title":"A classic Lewis comedy","rating":8,"date":"20 March 2017","review":"Why this Jerry Lewis comedy isn't better known or more widely available is a mystery since it's a classic and as consistently funny as anything he did. Here the slapstick verges on the surreal while its 'thriller' plot is virtually irrelevant. As well as starring, Jerry wrote, produced and directed and if it never amounts to anything more than a series of sketches they are, at least, very funny. It's certainly a movie ripe for rediscovery that, for now at least, will have to settle for ultimate cult status.","user":"MOscarbradley","rank":[5,5]},{"title":"\"It certainly is smooth. Yes, a man can faint from such smoothness.\"","rating":7,"date":"24 March 2005","review":"\"The Big Mouth\" is one of the better Jery Lewis movies out there. While I have yet to see ALL of Lewis's earlier works, I have seen a good handful of the better known titles including \"The Family Jewels\" and \"The Nutty Professor.\" This one is better than both. I always felt that it deserved more attention and props than \"NP\" (his most well known) simply because the humor was more consistent throughout and the comedic timing, especially with Jerry as Gerald Clamson, couldn't have been better. Some great examples include him and the bellhop during an awkward moment involving a tip. Another one involves him and an elderly Chinese man at the pearl shop at Sea World. His remark about Confucious is the stuff of legend. So is the man's reaction. I also felt that \"NP\" was lacking in good supporting characters that were wacky enough to hold there own against Clamson. This is why the movie fizzles and becomes somewhat stale early on. Nothing for him to play off of. \"FJ\" had plenty of characters, but they were all played by Jerry Lewis. In other words, that movie suffered from Lewis overload. \"The Big Mouth\" is a perfect balance of all these elements. Though it may lose some of its pacing around the second half, the movie is well worth at least a rental simply for the first. If you suddenly crave some good silliness that will actually make you laugh from time to time, this is the Jerry Lewis movie for you, if you can find it.<br><br>p.s.-for Hojean, this is the one you're thinking of.","user":"gclamson","rank":[12,19]},{"title":"Tepid comedy.","rating":5,"date":"6 January 2000","review":"A tepid, extremely mild, fairly tedious, slightly overlong comedy. The first half has some reasonably funny bits (like the one that takes place in a phone-booth), but in the second half things get pretty desperate. Jerry Lewis himself is appealing when he is playing the \"straight man\", but irritating when he appears disguised. And the direction has no comic timing whatsoever.","user":"gridoon","rank":[12,19]}]