[{"title":"Mad Max 2: The Road Warrior is the best classic epic Post-Apocalyptic Action Science Fiction film in the Mad Max Franchise.","rating":10,"date":"3 October 2015","review":"Mad Max 2: The Road Warrior is a 1981 Australian post-apocalyptic action film directed by George Miller. The film is the second installment in the Mad Max film series, with Mel Gibson starring as Max Rockatansky.<br><br>I grew up with the Mad Max films and Mad Max 2: The Road Warrior Is my personal favorite best epic Post-Apocalyptic Action Classic Science Fiction film. I always loved The Road Warrior to death this film stayed in my heart. Fury Road and The Road Warrior are Equal for me so I am ranting them 10 and I always tried to take the first film of the Max series as the best one in the franchise but I couldn't, because it is just too dark is not post apocalyptic film enough, it has Drama between the film and the plot starts slow which becomes really boring. The Road Warrior is the opposite of Mad Max which just stayed in my heart and I just love this movie to death and I always will. Mad Max 2: The Road Warrior still remains one of the most exhilarating action films to ever grace the screen. The car chases are as excitingly pulse-pounding as ever and no film has yet to surpass the final chase as the best in movie history. Yes, in terms of pure action, not many films have been able to equal The Road Warrior's thrills.<br><br>Mel Gibson remains the only world-renowned actor in the whole film. He does a terrific job as the character Max, one of his best and most interesting characters. The development of Max is another intriguing component of The Road Warrior, and serves the film by giving it a human edge by featuring Max's slow transformation from loner to savior. Not only that, Gibson also creates a great action hero. There's not a moment in the film when we aren't rooting for Max to smash Humungus and his gang.The Humungus and Wez for me were the best villains ever in the film. Bruce Spence as the gyro-pilot is decent in his role and offers the film's few humorous moments. And also he has a lot of scenes and a lot of things to do in this film. Like flying that flayer helping Max saving him, fighting against Humungus thugs. Emil Minty as The Feral Kid is awesome. The old man as the narrator from the beginning of the film is The Feral Kid, I love the relationship between him and Max. That's what I love in this film the acting is TERRIFIC from the actors. Virginia Hey as Warrior Woman is beautiful and fantastic in this movie. I seriously loved how she acted towards Max that he isn't trust worthy, he needed to win her trust. I love Max's dog he was so better than in the first movie the other dog was. You could even see a personality in this dog. <br><br>I love this movie to death and will always be in my heart Forever. For me Mel Gibson is the only Mad Max Rockatansky!<br><br>Grade: Bad Ass Seal Of Approval 10/10 Awesome Post/Apocalyptic/Action Classic/Science Fiction film.","user":"ivo-cobra8","rank":[101,109]},{"title":"MAD MAX - back and better than ever","rating":8,"date":"20 June 2005","review":"After the enormous success of \"Mad Max\" in 1979, it was predictable that a sequel would follow. In fact, two sequels followed, and the first of these is \"Mad Max 2: The Road Warrior\".<br><br>Released in the U.S. simply as \"The Road Warrior\", \"Mad Max 2\" begins with a narration re-introducing us to wandering ex-cop Max (Gibson) ... and then we're off. In post-apocalyptic Australia, Max wanders the nuclear waste lands in search of Earth's most precious resource: gasoline. When he discovers a band of people guarding a large deposit of fuel, he lends his services as a driver to help them escape from a vicious group of bandits intent on taking the gas for themselves.<br><br>\"Mad Max 2\" is one of the best sequels ever. It's everything the original was and more. Mel Gibson is great, and the cast performs very well. Brian May's skills as a composer have improved, and he gives a very fast-paced score. George Miller's directing skills have also improved, and he deals us out some intense car sequences that have yet to be rivaled.<br><br>This film is special because, although it was very popular when released and is even more popular now, it is unique in that it is not afraid to be just that. If that confused you, let me put it this way: George Miller has created a film that, while trying to improve the flaws from past films, is not afraid to be original and un-Hollywood. And I must say, Mr. Miller pulls it off excellently.<br><br>I love \"The Road Warrior\" as well as the rest of the \"Mad Max\" series. I would say that \"Mad Max 2\" is quite possibly the greatest film to come out of Australia. It is one of Mel Gibson's best and one of the best sci-fi films ever. \"Mad Max 2\" is essential.","user":"KnightLander","rank":[119,135]},{"title":"Exhilarating action thriller.","rating":10,"date":"1 March 2001","review":"*** 1/2 out of ****<br><br>After so many years The Road Warrior still remains one of the most exhilarating action films to ever grace the screen.  The car chases are as excitingly pulse-pounding as ever and no film has yet to surpass the final chase as the best in movie history.  Yes, in terms of pure action, not many films have been able to equal The Road Warrior's thrills.<br><br>The film takes place presumably years after the conclusion of Mad Max.  The world has been devastated by a third world war and has suffered a setback by he rarity of gasoline. The loner, Max Rockatansky (Mel Gibson) is still wandering around the Australian wasteland, thousands of miles from civilization, in search of gasoline.  He comes across a gyro-pilot (Bruce Spence), who tells him of a compound that's producing fuel.<br><br>Max brings the pilot along with him and studies the compound from atop a cliff.  It seems a large gang also wants the gasoline and has been besieging the refinery for a long time now.  They are a pack of madmen, led by the Humungus, a hugely muscular man who wears a hockey mask to cover his face. An attempt is made by the people inside the compound to find a rig large enough to haul the fuel but the effort is brought down when Humungus' men take down all the cars.<br><br>Max, finding a perfect moment to strike a bargain, makes a deal with one of the survivors and makes it to the compound.  Eventually, he makes another deal there, as he tells the people inside that in return for as much gasoline as he can carry, he'll bring the rig to them.  What follows is classic edge-of-the-seat action entertainment.<br><br>Having inspired dozens of rip-offs, The Road Warrior still remains the best of the bunch due to the great lead performance from Mel Gibson and the unrivalled car chases, which are very much worth mentioning.  The movie begins with a rousing commentary over the events that led to the destruction of government.  What follows next is a short and exciting car chase.  True, the following half-hour does move by a bit slowly, but it all builds up to a lightning paced final 45 minutes.<br><br>The final chase, in particular, is an exercise in action craftsmanship. Director George Miller has staged one of the most brilliant and downright exciting action scenes ever.  So many spectacular stunts and on-road carnage occur during this sequence, to describe it simply wouldn't do it justice.<br><br>Miller's cinematography is decidedly Un-Hollywood.  He gives us many breathtaking camera angles, some of which are sometimes a bit shaky, which serves to make the action even more involving.  Looking back at the film now, it might not appeal to a wide range of viewers.  The odd characters (mainly the villains), ultra-violence, dark tone, and the sparse dialogue may seem a little too offbeat for some people.<br><br>Mel Gibson remains the only world-renowned actor in the whole film.  He does a terrific job as the character Max, one of his best and most interesting characters.  The development of Max is another intriguing component of The Road Warrior, and serves the film by giving it a human edge by featuring Max's slow transformation from loner to savior.  Not only that, Gibson also creates a great action hero.  There's not a moment in the film when we aren't rooting for Max to smash Humungus and his gang. Bruce Spence as the gyro-pilot is decent in his role and offers the film's few humorous moments.<br><br>Virginia Hey is also pretty good as the Warrior Woman, and though the script doesn't exactly give her a lot to do, she plays the part well.  Mike Preston also shows a lot of honor as the compound's leader.<br><br>On the other side of the equation are the actors who portray the villains. Surprisingly enough, though the characters are outlandish, no one ever goes over-the-top.  Vernon Wells and Kjell Nilson are absolutely menacing and frightening as the lead villains, Wez and Humungus.  They personify evil itself, creating characters who we truly grow to despise.<br><br>To be honest, I am a little surprised that the critics enjoyed this every bit as much as I did.  The film doesn't delve very deeply into philosophical issues and doesn't exactly have a lot of grand things to say.  I suppose with the acclaim this film received goes to show that critics do truly watch movies primarily for entertainment.<br><br>As I mentioned before, the film was the benchmark of a genre that grew in popularity.  The premise of a loner helping a group of people in need has been used a bit too much now.  Most notably is the big-budget flop, Waterworld (which is a good movie I recommend), though none have yet to match the outright intensity of The Road Warrior.","user":"jiangliqings","rank":[149,173]}]