[{"title":"Not your ordinary teen movie","rating":13,"date":"13 February 2005","review":"I recently saw this movie again (on video, not the uncut DVD). I hadn't seen it in about twenty years, but it affected me the same at 35 as it did when I saw it on cable at 14. It is one of the grittiest, rawest movies I have ever seen, and it works on a visceral level. The performances of Sean Penn and Esai Morales in this film go to show why they have both continued to be two of the hardest working actors in Hollywood. After seeing Penn as Jeff Spiccolli in \"Fast Times at Ridgemont High,\" I was amazed by his range in this film (although he was excellent in \"Racing With the Moon,\" which if memory serves me right also came out around this time). Morales took what could have been a one-note role and turned it into a caricature of a revenge-bent punk, but his talent even back then was clear that he was up to the challenge of putting emotion into the role and bringing some sympathy to Paco's plight. Clancy Brown and Ally Sheedy were excellent in their roles as well.<br><br>The movie worked not just because the acting was great, but because the story moved along at an exciting pace. It was suspenseful and was not overly cliché or pat. Overall, it was an unforgettable movie experience, a strong cautionary tale that still makes people think.","user":"Snoopymichele","rank":[44,50]},{"title":"Great Film with some heart-wrenching acting","rating":9,"date":"11 January 1999","review":"This film has to be one of the best youth crime dramas around. Sean Penn delivers a strong performance as a troubled youth, without the will but the courage to change his ways. Ally Sheedy also delivers a strong performance as the sole light in Penn's insane lifestyle. Esai Morales delivers a strong performance as a youth who has takes the wrong roads in life. Buckle up, and get ready for an emotional ride by some talented actors/writers/director in this movie.","user":"JCisneros","rank":[24,26]},{"title":"Penn At His Grittiest","rating":26,"date":"26 November 2003","review":"This is probably one of the grittiest teen flicks to ever come out.  This film puts all the films in the Dead End kids to shame.  Sean Penn is perfect as Mick and Esai Morales is great as Paco.  Also, this film as well as the similarly themed Born Innocent pulls no punches as it shows how the juvenile justice system which is supposed to rehabilitate young offenders does just the opposite and makes them even more hardened.  This truly is one of the best films of the 1980's.","user":"Sargebri","rank":[30,35]}]