[{"title":"provided serious food for thought at a time the world wasn't hungry.","rating":23,"date":"23 July 2001","review":"A very thought provoking movie that was not accepted at the time, but in retrospect, way way ahead of its time. In a racially charged world it put forth the premise that race, in the final analysis, is superficial and meaningless.  Once you strip away the layers of conditioning and socialization, you find, at the core, good and evil and the age old struggle as to which will prevail. A simple story, told directly and honestly.  On a scale of 1 to 10, its an 11.","user":"bobkat1138","rank":[52,66]},{"title":"the first time i watched the world end","rating":8,"date":"17 December 2005","review":"When I was in the 3rd grade I stayed home from school one day sick with the flu and watched this on a local TV station and some scenes from it have stuck with me ever since; I will never forget the sight of Harry Belafonte eating dinner with Inger Stevens and then cleaning up by casually throwing the entire contents of the dinner table out the high rise apartment window and calculating that it would be YEARS before the pile of smashed crockery reached his window; who can explain the eerie fascination of empty cities? This film is one of the first to successfully pull off the effect, setting the standard for what followed: The Omega Man, The Day of The Triffids, 28 Days later and especially The Quiet Earth.","user":"raegan_butcher","rank":[23,29]},{"title":"For Caring Hearts who Want to Think","rating":10,"date":"26 January 2001","review":"This movie will grab your interest and exercise your moral fiber. The setting of the movie is New York City after a catastrophe that eliminates all the people on the planet, except a few. Race, prejudice and pride are but minor subplots in this excellent film. A fair minded and humanitarian black man discovers the true nature of life and friendship in a white woman. A sheltered white woman finds the friendship of a black man who is everything she loves and desires in a lover, but nothing at all like her upbringing would endorse. Suddenly, her psychological paradise is shattered when a third person comes along who threatens to bring back all the old ways of thinking that separated people and cultures throughout generations. Black and white has never been so colorful.","user":"geoff33","rank":[39,53]}]