[{"title":"A surprisingly gnarly comedy!","rating":8,"date":"8 July 2002","review":"June 8, 2002 was an 80's renaissance for me. Playing an emulated ColecoVision on my PC, listening to Huey Lewis, Prince, and Men At Work, watching the A-Team on TNN, and seeing this film from 1989. I still enjoy the decade of feathered mullets, jerri-curled hair, acid-washed jeans, skinny ties, dominant pop music, and terrible fashions. The 90's will never have that to live down (except terrible fashions, but not as bad).<br><br>When Bill And Ted's Excellent Adventure became the surprise hit of 1989, it made a star of everyone's favorite Lebanese-Canadian-U.S. rock 'n rolling actor, Keanu Reeves, who is one of the top stars at the box office today and one of the few likeable people in Tinseltown. It seems that he still carries a bit of Theodore \"Ted\" Logan in all his movies.<br><br>He and Alex Winter (an indie film dynamo) play Bill and Ted, a couple of 80's California dudes who want to start their own rock band (Wyld Stallyons). However, both are flunking in high school and will be expelled unless they get an A+ in history. To make matters worse, Ted will be sent to the military by his father, therefore squashing their dreams of rock stardom. Enter Rufus (George Carlin), a man from the future who plays Clarence to the boys George (shades of It's A Wonderful Life) who gives them a telephone booth. With it, they decide to use it to collect great historical figures and bring them to San Dimas, California to show them how mankind has evolved.<br><br>Surprisingly, the film holds up today. Bill and Ted are truly likeable boneheads and both Reeves and Winter deliver fine performances. Carlin is funny in his appearances, showing that he doesn't need trash-talk to be entertaining. The dialogue is truly amusing, probably because no one talks like that any more. The only weakness is that it's an 80's film, so if you didn't grow up in that era, you might not understand why there's music playing throughout the film, or why everyone looks and dresses so weird (yes, that's how everyone looked in the 1980's). The DVD version is quite nice, but it only has a trailer as a bonus. Still, a must watch, and much better than all the copycat films (including the horrible Dude, Where's My Car?). Party On!","user":"BlackJack_B","rank":[64,76]},{"title":"\"Whoa...\"","rating":22,"date":"22 April 2004","review":"Despite the success of such films as \"Speed\" and \"The Matrix\" trilogy, to a lot of people, Keanu Reeves will ALWAYS be Ted, the taller, darker half of the Bill &amp; Ted duo. And it would seem that Ted, of all Reeves many characters, is possibly the only one where he really seemed to have put himself into the role and felt like a natural.<br><br>One of the great dopey dude slacker classics, the title characters Bill (Alex Winter) and Ted (the aforementioned Reeves) are a pair of aspiring musicians, the Wild Stallions, who are in danger of being both separated if Ted can't pull up a good enough grade (which = military school) and flunking history class in general. But since they are destined to be \"the 2 Great Ones\" who's music will unite the Earth and even alien races together in universal harmony, the most excellent dude Rufus (George Carlin) shows up and gives them a time traveling phone booth to help them pass their history class by bringing back real historical figures like Billy the Kid, Abraham Lincoln, Napoleon, Joan of Ark and what not. Now all they have to do is keep them from getting separated and jailed before they have to pass history! Along the way, Bill &amp; Ted also fall in love with two sexy virgin princesses from the medieval circa.<br><br>Yeah it's not great cinema, but it's a fun romp of slacker dude madness thanks to the energy and enthusiasm of Alex Winter and Keanu Reeves as the title characters.<br><br>Followed by \"Bill &amp; Ted's Bogus Journey\".","user":"DarthBill","rank":[55,68]},{"title":"Switch off your brain and enjoy the ride!","rating":16,"date":"16 April 2003","review":"This movie rules. Am I afraid to admit it? Nope, 'cause it's the truth! I know by reading some of my reviews I sound like some stuffy person who doesn't like any fluffy comedies or unintelligent humor, but that's not always the case. Yes, there are good fluffy comedies that promise a really fun watch.<br><br>I can't even count how many times I've seen this movie, but somehow it never gets old. 'Bill and Ted' is of course NOT a great movie, but it never pretends to be one, and I guess that's why I like it so much. <br><br>I've always had a huge fascination with the idea of time travel (why else would I love 'Back to the Future' so much?), and this movie actually makes it look really, really fun. Not to mention that Bill and Ted's mispronunciation of the historical figures' names (\"So-crates!\") makes it all the more hilarious.<br><br>Did I mention that Rufus is totally awesome? No? Well go ahead and kick me in the face!","user":"xxlittlekittenxx","rank":[86,110]}]