[{"title":"See this film.","rating":9,"date":"28 May 2000","review":"After years of debate, the courts have finally ordered the desegregation of the nation's schools.  A small (and fictitious) Missouri town must deal with the issue as black students go to the previously all white school for the first time.<br><br>Enter Adam Cramer (Shatner), a representative from Washington of the Patrick Henry Society.  He claims to be a social worker, but it turns out that this society is a racist organization opposed to desegregation.  Cramer hopes to interfere with the court-ordered policy and begins to stir up the community with fiery rhetoric and bold tactics.  Cramer soon discovers that the mob he has helped create is beyond is ability to control.<br><br>\"The Intruder\" is a little known film written by Charles Beaumont (a core writer for \"The Twilight Zone\" and a screenwriter for many of American International's classic 1960s horror films) and directed by Roger Corman.  It shouldn't be little known.  This is arguably the best and most important film ever made by Corman and perhaps by Beaumont as well.  Shatner puts in a sterling performance as the racist Cramer and the supporting cast, which included both veteran actors and local citizens from the town of Charleston, Missouri (where it was filmed), is also excellent.  Corman and Beaumont took on some seriously volatile subject matter and used both tact and intelligence to tell a story and send a message.  For those who are more sensitive to racist language or who are caught up with political correctness, \"The Intruder\" might be somewhat abrasive or uncomfortable to watch.  Personally, I think that this would be ideal for viewing in high schools and colleges that are studying the subject of racism and integration in the United States.  Regardless, for those seeking a well made, well acted film","user":"JHC3","rank":[71,76]},{"title":"Had it made any money, Roger Corman would have joined the big league!","rating":18,"date":"18 September 2004","review":"Roger Corman's \"The Intruder\" is both fascinating and frustrating to watch. Fascinating because you suddenly realize what a great and promising \"serious\" film-maker that was living in the young Corman, and frustrating because the movie was so provocative it scared Corman's investors and was such a financial failure that it discouraged the producer/director from ever trying to make a real serious piece of fiction again.<br><br>\"The Intruder\" is so harrowing, frightfully realistic and effective that had it gained the success and attention it deserved Corman today would be up there with names like Norman Jewison, Sidney Lumet, Milos Forman, John Schlesinger and other great film-makers of his generation!<br><br>The atmospheric use of real southern locations just adds to the drama, and the racism portrayed by many of the actors feels almost to close to comfort. One final note: Anyone who still considers William Shatner a grade-b actor should also try and get a hold of this film to witness a fine actor in good form.<br><br>Watch this if you can, one of the greatest unsung movies of the 1960's!","user":"Renaldo Matlin","rank":[67,72]},{"title":"Ageless, Yet Cannot Find It's Time !!","rating":9,"date":"9 February 2004","review":"William Shatner is very good in this film portraying a charismatic white supremacist who drifts into a small southern town to preach hate at the time the local high school is beginning to be integrated. <br><br>Extremely bold and brutally honest portrayal of race relations in the South in the early 60's when the film was made.  By viewing it I can see it must have been way too inflammatory for its time. Yet, some parts of this flim made me kind of tense/uncomfortable.  Therefore, I don't see it getting wide acceptance in today's politically correct world either.<br><br>Despite this, the film's theme and moral messages are ageless. The script is so intelligently written coupled with Shatner's convincing performance, I was not given impression that this is considered a \"B\" movie. OK, well maybe there are a few scenes that may indicate that but they are outnumbered by the compelling drama throughout the film. The final 5 to 10 minutes are particularly tense which may actually be hard to watch. <br><br>A commendable effort, I had no regrets in plucking down a few bucks to buy this flick.","user":"mikeghee","rank":[35,37]}]