[{"title":"In Love with India","rating":9,"date":"5 July 2007","review":"I just discovered this movie, which I must have missed when it was originally released. I am a big fan of Greta Scacchi since I saw her in \"White Mischief\" and I just lately admired Julie Christie in \"Away from her\". In the eighties, I went myself on an exploration trip through India and have been fascinated with this country forever. I was really looking forward to see the movie.<br><br>I was a little bit amused to see Greta Scacchi again cast in the role of the adulterous wife in colonial times. In White Mischief, she decides first against poor Hughes Grant and marries a much older wealthy man, only to fall later for a dashing tall British officer in Kenya. In \"Heat and Dust\", she, playing Olivia is happily married to the dashing tall British officer but cannot resist a pompous wealthy Indian prince. I wonder if casting directors think that beauties like Greta have to be the toys of rich men? While Greta is constantly naked in \"White Mischief\" there is only one half nude scene in \"Heat and Dust\" and she is not yet quite as stunning as she is in \"White Mischief\". However, her character dominates above the character of Julie Christie and not only because of her beauty. The movie's charm is supposed to be the juxtaposition of the India in the 1920s versus the India in the 1980s. Julie Christie, as Ann explores the life of her great-ant, Olivia, who scandalously left her husband for the Indian nawab, but ended up living alone in the Himalayas... <br><br>Both women fall for Indian men and both get pregnant. Olivia decides to abort the child, as she is not sure if it is her husbands or the nawab's child. <br><br>The movie is filmed at the same locations. In the colonial times everything looks splendid and well maintained, in the eighties things have deteriorated . But all in all it gives an interesting insight in Indian life.<br><br>Maybe the more exotic and luxurious costumes and decorations in the 1920segments make this part of the movie more memorable. The affairs in-between the British women and the Indian men are only sketchily shown, but it is made clear that they were as unacceptable in the 20s as they were in the 80s by both sides. The Indian society is governed by even more rules than the British one. <br><br>This was Greta Scacchi first major film out of drama school , but she leaves a much stronger impression than Julie Christie, who took this role over a better paying offer for another film. <br><br>Definitely, a very beautiful and entertaining film and worth while to have in a DVD collection.","user":"pefrss","rank":[14,14]},{"title":"East, West and Everything In Between : A BONAFIDE CLASSIC --","rating":10,"date":"25 December 2002","review":"Based on Ruth Prawer Jhabvala's Booker Prize winning novel of the same name, this film is not so much as being about India but rather using the country as an effective setting to tell a story spanning approximately 3 generations. Two story lines - one set in the past and one in the present - are juxtaposed and connected by the narrative of a young British woman who seeks to uncover the truth about an ancestor who once caused quite a scandal by having an affair with a local Nawab. The story lines examine the impact of Western and Indian cultures as lifestyles, social mores, and centuries of history clash and collide. A tapestry of India is woven, as seen through the eyes of the narrator, a foreigner, who sincerely attempts to grasp and interpret her observations. The story and the screenplay for this movie speak volumes about Ms. Jhabvala's extraordinary literary and cinematic talents as a social and historical commentator, storyteller, and screenwriter.","user":"valleycats","rank":[23,25]},{"title":"A double-edged sword","rating":8,"date":"12 November 2003","review":"This, the the first internationally successful Merchant-Ivory production, continues to be a major achievement. Effortlessly passing from post-sixties soul-searching to twenties scandal, it uses the stylistic freedom of the filmmaker to make solid what can be only suggested in the novel.<br><br>Ruth Prawer Jhabvala, long-time Merchant-Ivory scenarist, got most of the gongs - and rightly so - for her adaptation of her own novel is a copy-book to be studied by any aspiring scenarist. However, one should not overlook the unforced direction by James Ivory and Walter Lassally's truly wonderful cinematography.<br><br>One of the most endearing aspects of the film is that a great range of attitudes are expressed by the English characters towards India and the Indians. One suspects that less culturally confident filmmakers nowadays would feel obliged to be more black and white (no pun intended)about 'colonialism' and the like. Not so here. Anne (JC) exhibits a range of attitudes to modern India, as does her ancestral alter ego (GC). Such plurality make the film richer, more complex, less ideological and dogmatic and much, much less boring.<br><br>In a way, this is a twin film with Jefferson in Paris... see them both together and you will understand what I mean...<br><br>MO","user":"Balthazar-5","rank":[26,29]}]