[{"title":"Tribute to Israel's Military Genius and Fighting Heart","rating":9,"date":"17 August 2005","review":"The great fighting heart and spirit of the Israeli people was not developed by one man. It was embodied in the dream of every Jewish peasant who for two previous generations contributed even pennies to Theodore Herzl's Zionist organization. And for the holocaust survivors it represented their last chance for a place in the world that was truly their's. No longer to be a guest in everyone else's country.<br><br>The heart and spirit were there when part Palestine became the state of Israel, but the military leadership was provided by a man born like myself in Brooklyn, New York. Colonel David \"Mickey\" Marcus was a West Point graduate who opted for a civilian career as a lawyer and dabbled in politics. His political allies at one time or other were Fiorello LaGuardia and Tom Dewey. He held various appointive positions in the LaGuardia administration in New York. When World War II broke out, Marcus went back in the army and for the most part given his legal training worked in the Judge Advocate General's office, but later did see combat with the Third Army under George Patton.<br><br>Kirk Douglas plays Marcus and for him, this must have been a role he relished given his background as the son of Jewish immigrants from the Ukraine. The film opens with James Donald representing the Haganah literally accosting Douglas in Macy's 1947 and explaining he's about the fiftieth person they've contacted to be a military adviser to the provisional government in Palestine. Douglas explains he hasn't been in Temple since his bar mitzvah and really doesn't consider himself much of a religious Jew or even a cultural one. By the end of the film, he's developed pride in his religion and ethnicity and earnestly commits to the struggle.<br><br>You might have expected Douglas's own Bryna Productions to have produced Cast a Giant Shadow, but co-producing it with the Mirisch Brothers was Batjac Productions which was John Wayne's company. Wayne took a minor role in the production as General Mike Randolph who is clearly Patton. Made clear by the prominent two stars Wayne has on his helmet in flashbacks to World War II which later become three stars during the scene of a concentration camp liberation.<br><br>Well Patton as we all know was killed in December 1945 in that jeep accident in occupied Germany. So obviously a decision was made to fictionalize Wayne's name in order to give him a bigger part as a man who encourages his former subordinate in his work.<br><br>And if Wayne were fictionalized then some others had to be also. Yul Brynner as Asher was definitely Moshe Dayan who was winning the Six Day War when Cast a Giant Shadow came out. Luther Adler's character name was Jacob Zion and he was clearly David Ben-Gurion. Michael Hordern has a brief part and is just listed as British Ambassador in the credits and that would have been Lord Halifax then.<br><br>Also fictionalized was Marcus's fling with his female aide who is played by Senta Berger. She serves kind of like his Kay Summersby. Should never have been part of the film, but maybe the producers decided a little sex was needed. Marcus's wife in America is played by Angie Dickinson.<br><br>Even though Cast a Giant Shadow is based on a true story, the film does suffer in comparison to the film made of Leon Uris's novel about the founding of Israel, Exodus. Most of that novel did make it on the screen. It's characters were better developed in a much longer film that held the interest throughout.<br><br>Cast a Giant Shadow also had its moments of silliness. There was a whole scene with Frank Sinatra as a mercenary pilot joining the new Israeli army dropping seltzer bottles on the enemy. Whatever possessed the powers that be to let that into the film?<br><br>I will say that the battle scenes were well staged and the politics albeit one sided were clearly stated. Like Exodus in that way. One of the most moving scenes of the film was the announcement at the birth of Israel of the telegram from the American President Harry Truman announcing recognition of the new state accompanied with reverent singing of the Hatikvoh, Israel's national anthem. That same scene was also in Exodus, but both were done well.<br><br>Of course the climax of the film is when Luther Adler makes the American visitor the commander over all the forces on the Jerusalem/Negev front. As he says, the last man who held this title is found in the Old Testament of the Bible and his name was Joshua. That's the scene when Kirk Douglas finally realizes what his heritage truly is and it is moving.<br><br>Despite it's flaws, Cast a Giant Shadow is a wonderful tribute to the men and women who fought and still fight to maintain the State of Israel. Even though it does suffer in comparison to Exodus, it has plenty of merit on its own.","user":"bkoganbing","rank":[59,92]},{"title":"A good and spectacular epic film with all-star-cast and a lot of cameos","rating":6,"date":"27 May 2004","review":"The movie deals upon the birth of State of Israel . It's based on real deeds . Here David , ¨Mickey¨ , Marcus (Kirk Douglas) , an American Jew and general of the WW2 who helps the Jewish to build the State of Israel . There are various flashbacks remembering exploits of Marcus during second world War . After that , he goes to Israel and he commands the troops . Marcus formed an Israel's formidable army to fight during the 1947-1948 struggle for Independence . Mickey is in every military action , culminating in a dangerous mission through a risked pass to arrive in Jerusalem . <br><br>¨Cast a giant shadow¨ follows the fabulous career of Col. Mickey , he is Kirk Douglas who does a first-rate acting as the daredevil Israeli commandant . John Wayne plays as an American general , he is excellent , as always . Yul Brynner is a Jewish colonel who has the command of the army that will defeat the Arabs . There's a warmly glowing portrait of a woman warrior from Senta Berger . And Luther Adler gives an awesome acting as Ben Gurion . The ending with its spontaneous sentiment on the people when takes place the Independence declaration is the most moving moment in the movie . <br><br>The music from Elmer Bernstein is impressive and cinematography by the Italian Aldo Tonti is magnificent. The flick will appeal to history buffs . This propaganda motion picture was well directed by Mellville Shavelson . Rating : Acceptable and passable , well worth watching. Rating 6.5/10","user":"ma-cortes","rank":[30,49]},{"title":"CAST A GIANT SHADOW (Melville Shavelson, 1966) **1/2","rating":6,"date":"15 July 2007","review":"Earnest, well-mounted but essentially dreary epic about the real-life involvement of an American Jew in the post-war struggle for Israel's independence  thus sharing its theme with EXODUS (1960), and clearly aiming (but failing) for a \"Marcus Of Israel\" feel! <br><br>Kirk Douglas stars as Mickey Marcus  perhaps chosen due to the character's similarities to another historical figure forced by circumstances into leadership, Spartacus, whom Douglas had portrayed in 1960. He's supported by an eclectic cast which includes Angie Dickinson as his neglected(!) wife, Senta Berger as the Israeli girl he falls for, Topol as an ill-tempered Arab sheik, Luther Adler as a local politician, a plethora of reliable British character actors  and even guest appearances by Frank Sinatra (which doesn't amount to much), a glum Yul Brynner as a fellow freedom fighter, and John Wayne as a U.S. General whom Douglas initially falls foul of but the two eventually end up respecting one another (still, seeing Wayne at the liberation of the Dachau concentration camp is about as incongruous as his stint playing the Roman Centurion at Christ's crucifixion in THE GREATEST STORY EVER TOLD [1965]!).<br><br>Despite a sharp script and good individual sequences, the film is compromised by its necessity to be both a spectacle and a message picture (the WWII flashbacks, for instance, are unnecessary and merely render the film overlong); unsurprisingly, it works best during the action highlights (complemented by a typically fine Elmer Bernstein score). Apparently, the events have been partially fictionalized  I wonder whether these embellishments concerned the romantic complications and the Hollywood-style ironic ending. For the record, Shavelson had started out as a scriptwriter (and later director) of Bob Hope and Danny Kaye vehicles; this was his most serious effort  a brave try, but not quite the 'giant' film he clearly intended...","user":"Bunuel1976","rank":[14,21]}]