[{"title":"The \"Baby Queen\" Gets A Little Naughty","rating":6,"date":"7 December 2008","review":"You just have to love Li Ching. She is so, so cute with an impish smile. In this film she plays the Seventh Sister, a goddess from heaven who wants to see what the mortal world is all about. Shye goes to Hong Kong and eventually stumbles upon Zili, who is running a debt laden orphanage. The orphanage is sold via auction to Xu Caifa, a cigar chomping wise guy. They are looking to close the orphanage to build a villa. The film is basically about the relationship between Zili and the Seventh Sister and their efforts to save the orphanage. The film is uneven, but the casting of Li Ching was essential. She is so pretty and she means well. She does little things with her magical powers that are fun. This could have been a children's film, a strict good vs evil film. But this film veers into adult territory and while its not bad by any means, there are a few scenes that weren't really needed. The film is definitely watchable through to the end, but its not essential. as to the question of whether the orphanage is saved, you'll see if you watch. The film is better than average but not a must see.","user":"crossbow0106","rank":[3,3]},{"title":"A guilty pleasure","rating":6,"date":"2 June 2005","review":"'The Human Goddess' is a VERY guilty pleasure starring Shaw Brothers' \"Baby Queen\" Li Ching. Li Ching is the Seventh Sister, an angel who comes down from heaven to see what life in Hong Kong is like. In Hong Kong, she runs into Zili(Chin Feng), a reincarnated version of her deceased lover, Dong Yong. Zili, with help from cook Uncle Bull(the warm, portly Peng Peng), do their best to watch over homeless kids in an run-down orphanage. However, a heartless tycoon named Xu Caifa wants the land where the orphanage is and he's willing to go to extremes to get it. Armed with omnipotent powers, spirit, and help from her \"celestial sisters\", Seventh Sister works to defend Zili, Uncle Bull, and the orphans from Xu Caifa.<br><br>Scenes with nudity and some ribald, dyspeptic humor make 'Goddess' a questionable choice for children and prudent viewers, but this film still manages to be light-hearted and whimsical. Director Ho Meng Hua('The Flying Guillotine')does his best to hold the film together even though the film, at times, almost spins out of control like a broken merry-go-round. Li Ching is at the pinnacle of cuteness; she's almost like an HK Chinese Doris Day, to me, at least. 'The Human Goddess' does suffer from flaws such as overacting, stale puns, a dated 1970's look, etc., but it still manages to be a fun, enjoyable, and charming, albeit guilty pleasure.","user":"rudeboy8080","rank":[3,3]}]