[{"title":"A lyric piece of film making.","rating":9,"date":"13 August 2001","review":"This is John Wayne's first color film and my only complaint is that the cinematographer failed to pick up the unique almost purple color of his eyes!<br><br>Taken from a much-loved novel of the time, The Shepard of the Hills tells a simple story exceptionally well.<br><br>An older man appears at a cabin door and gives aid without a question as to how the accident happened.  He saves a child.  He wants to purchase a piece of property and settle down.<br><br>The mountain people of the Ozark region do not welcome strangers, yet this man seems to fit in with his quiet ways and his vast knowledge of the outside world most of the mountain people have never seen.<br><br>Harry Carey is this quiet man. He is splendid in every scene.  John Wayne plays 'Young Matt Matthews'a young man still mourning his mother and who has sworn a blood oath to kill the man responsible, his father.<br><br>Betty Field is marvelous as 'Young Matt's' girlfriend.  Harry Carey thoughtful and quietly charming at 'Mr. Howard', the Shepard of the Hills, as his new neighbors call him.  Beula Bondi is fascinating as 'Aunt Molly' and Margery Main shines as the blind woman that 'Mr. Howard' sends to the city to have her sight restored.<br><br>Many of the scenes are extraordinary for their detail and sense of authenticity.<br><br>Some are incredibly beautiful. For example, when 'Mr. Howard' meets the young man who was struck by lightning and can no longer speak.<br><br>A thoroughly absorbing and skillfully made film well worth watching again and again.","user":"countryway_48864","rank":[44,48]},{"title":"A film of great beauty and great, understated acting!","rating":9,"date":"10 August 2001","review":"A marvelous, if little known, early John Wayne film.  There are so many wonderful moments in this film that I can only list a few:  Harry Carey splendid as the mysterious man who comes to the Ozarks to purchase a piece of dirt land and settle down, and ends up purchasing Moanin' Meadow.  A gorgeous, seamless, seemingly effortless piece of acting.<br><br>Betty Field, always in bare feet saying that she nearly stepped in a cloud and reveling in the mud between her bare toes.<br><br>Marc Lawrence trying to catch dust motes in a sunbeam coming through a dirty windowpane.<br><br>Beulah Bondi making a circle of candles and lamp oil!!<br><br>Marjorie Main seeing for the first time in her life.<br><br>And John Wayne moving from bewildered and embittered young man with a curse on him, to a man in love who can't express his feeling because of the curse, and finally coming to terms with his real, inner self for the first time in his life.<br><br>Anyone who thinks John Wayne could not act, should see The Shepherd of the Hills.  He is not only beautiful to look at, but he brings charm, power and sympathy to a very difficult role.","user":"countryway_48864","rank":[36,39]},{"title":"Surprisingly good","rating":8,"date":"15 September 2003","review":"**possible spoilers**<br><br>Although it has John Wayne in the cast it is not really a western. It is more a study of the Ozarks and the people who live there. Although some scenes are filmed in the studio you do get a feeling of the landscape of the area and the kind of people it produces; sturdy, suspicious, superstitious, kindly, ignorant and wise. Much like any isolated community around the world. <br><br>The film is surprisingly good. The acting is solid all round. John Wayne makes a good attempt at the Young Matt role, bringing out well the confusion and conflicts in his mind. Beulah Bondi is riveting as the bitter Aunt Mollie. Harry Carey is good as ever. Betty Field as Sammy Lane is excellent and it is her who holds the film together. It is through her eyes we mainly see things. She is also quite sexy in her tight jeans and short tops.<br><br>\nSome of the scenes are exceptional; when Daniel Howitt is cashing a never seen before cheque, when Granny Becky has her eyes uncovered after an operation, when Young Matt talks about how love is so complicated, when Daniel Howitt takes possession of the old house in Moaning Meadow, when Aunt Mollie cremates her dead son and herself, when Pete the mute brother is discovered in a stream of light pouring through a window trying to catch dust motes. All directed without sentimentality but with real feeling.<br><br>It is one of those films which did not promise much from the TV listings but actually delivers much more than one expects.","user":"henry-girling","rank":[17,18]}]