[{"title":"The greatest action sequel masterpiece of all time!","rating":10,"date":"10 December 2015","review":"Magnum Force (1973) is the greatest action sequel of all time! Dirty Harry and Magnum Force are my two best favorite sequels of all time. It is one of my personal favorite movies. I always, always enjoy those two movies so much from Clint Eastwood, I grew up watching those two movie and they are the best action movies of all time! I just kept watching them. My second best favorite action flick of all time! <br><br>The movie had a good edition - good actors in this and Clint was his usual bad ass self. Hal Holbrook is a great villain in this. The flick is proof sequels can be damn fine films and not redundant. It is my favorite entry's of the series and no doubt one of the greats action flicks of the 70's! Magnum Force has...everything. Immortal perfection personified. Hal Holbrook does a marvelous job as do the three rookies who later became famous on their own. Robert Urich and David Soul well-performed the berserk cops. I do believe that Harry \"crosses the line,\" and obviously so do those berserk cops, but unlike them, he never kills innocent by-standers and women.<br><br>Magnum Force is old school 70's action flick with 'acting' and 'actors...none CGI or special effects in it. It is not that I hate CGI or special effects ...it's just so nice to watch the way it was done. Harry Callahan (Clint Eastwood) goes up against rogue cops here and he never waivers on his 'justice'. Great pistol shooting scenes and very well done film. Eastwood rocks. I forgot to mention Dirty Harry series are more similar to Charles Bronson's Death wish series. In my opinion I enjoy Dirty Harry Series much better than any other action movies. So the film is set when a mysterious wave of killings sweeps the Mafia underworld, it's Inspector \"Dirty Harry\" Callahan who answers with Magnum Force. Despite a demotion by Lt. Neil Briggs for his questionable methods, Harry will stop at nothing to find the killers. A rouge traffic cops are killing criminals who have escaped from court, they killing them brutally and they don't care if they kill an innocent person or not. Those cops are different from Scorpio from previous movie and they are more vicious than psycho sniper Scorpio. <br><br>A tough, hard-core and explosive action-thriller that gets the job done. It's sharply written and well-constructed action film that has lots of flavor. Clint Eastwood is in top form as Dirty Harry, showing that truly no cop series can stand next to his classic character or these films. Compared to the original, this was a much better movie: The main story and characters were more interesting, the writing was less uneven and the overall pacing was better. It was still quite dated but a lot easier to take than the original. And, once again, I enjoyed the \"retro-ness\" of it. Mr. Eastwood's unshakable cool-as he dismantles a bomb or refuses a local anesthetic for seven stitches. In the film, Harry is certainly not a dictator. The law is. The law decides who lives and who dies. Nor does Harry glorify the state; or in this case, the system. He hates the system--the liberal legal system that has made a mess of things and Harry's the janitor who must clean it up; which makes sense considering his name derives from always getting the dirty jobs. Well, somebody's got to do it. Ironically, he sometimes makes a mess of his own, but delivers efficient results in the end. In Magnum Force, there's some new enforcers in town, and they ride dark horses. If ever a fascistic label could be applied, it's on them. <br><br>Magnum Force is a 1973 American action film and the second to feature Clint Eastwood as maverick cop Harry Callahan after the 1971 film Dirty Harry. Ted Post, who also directed Eastwood in the television series Rawhide and the feature film Hang 'Em High, directed the film, the second in the Dirty Harry series.<br><br>I love this movie to death, it is my favorite best sequel of all time, Just like Terminator the first two movies, I love those two sequels to death! This movie deserves 10, it is almost so good as Dirty Harry, the only problem I have with the film is it 2 hrs. long, it could have been shorter. <br><br>All the actors did a great job acting and the story was amazing. I have enjoy this movie to death and I always will! Throughout, there's a stress on dear old hubris: Harry earnestly repeats that \"a man's got to know his limitations.\" Thus, it's reasoned that the killings he commits are justified - \"There's nothing wrong with shooting, as long as the right people get shot\" - but murderers do have to be discriminating. The action scenes are fabulous and the fantastic, the gun play is terrific, you will sea a lot of hand gun use and they are used well.","user":"ivo-cobra8","rank":[45,48]},{"title":"Bad-ass","rating":8,"date":"20 January 2019","review":"Sometimes you just want to spend your evening hanging out with someone cool. So maybe you hang out with the Fonz in 'Happy Days', or just crank some Tom Petty - or perhaps like me tonight, you opt for Clint Eastwood as 'Dirty Harry' Callahan.<br><br>I actually enjoyed 'Magnum Force' more than the original 'Dirty Harry'. With this the longest of all the Dirty Harry films, it truly has a bit of everything.<br><br>Classic instantly-quotable bad-ass one-liners? Check.<br><br>Attractive 1970s women and romance? Check.<br><br>Plane hijacking? Check.<br><br>Bombs and explosions? Check.<br><br>Lots of shooting? Check.<br><br>Controversial murder scenes? Check.<br><br>Crazy car and motorcycle chases? Check.<br><br>Stunning San Fransisco scenery? Check.<br><br>Corrupt cops? Check.<br><br>Plot twists? Check.<br><br>This film felt right at home in 2019, despite being made all the way back in 1973. Definitely ahead of its time. You can't help but smile when Clint Eastwood delivers killer lines throughout this film. It seems rare to encounter films so satisfying as this nowadays.<br><br>\"Nothing wrong with shooting as long as the right people get shot! \"<br><br>I won't be pulling over for any shady-looking motorcycle cops anytime soon.","user":"maccas-56367","rank":[9,9]},{"title":"Good Movie","rating":8,"date":"2 January 2005","review":"I sometimes wonder if \"Magnum Force\" is a better movie than \"Dirty Harry.\" In the latter, Harry Calahan is up against a psycho causing panic, while in \"Magnum Force\" Harry opposes a number of enemies: enemies he would not have expected at first. Crime is still on the rise, there is too much corruption and too few 'real' cops, like him. When he meets some young, aspiring cops he is amazed by their qualities. Great acting by Clint Eastwood who is just perfect in playing the old-fashioned Harry Callahan. There is violence, but the strange thing is you support Callahan in 'cleaning' the city. One of the best in the Dirty Harry-series.","user":"mrbrigante","rank":[55,74]}]