[{"title":"A guilty pleasure","rating":7,"date":"7 May 2003","review":"I thoroughly disagree with a previous reviewer.  This movie is a lot of fun! Anyone who loves Pam Grier as much as I do must see it, even as she is definitely not the \"action hero\" here.  She looks particularly sexy in a sweaty ceremony scene.  Unbelievable dialogue highlights this film; like when Blacula makes a new convert and the guy realizes he has no reflection in the mirror and says, \"Hey man, I don't mind bein' a vampire and all that sh**, but a man has got to see his face!\"  I was halfway through this movie before remembering William Marshall (Blacula) from Pee Wee's Playhouse as the Cartoon King (\"Let the cartoon...BEGIN!\")  Anyway, if you've seen this film's title and you're familiar with Pam's early work, you know what you're in for.  Have fun with it!","user":"dctrevil","rank":[21,22]},{"title":"The movie that got me out of the blues!","rating":7,"date":"14 October 2002","review":"As a film student at a university I will not identify, I must say that in spite of all its obvious limitations, I loved this film! In fact, I think it is equal if not better than the original \"Blacula.' It is disappointing to me that many liberals (well, I am a moderate one myself) see these films as being politically incorrect stereotypes. I would argue that these were African-Americans making their own films and that they effectively broke or modified the stereotypes by taking them to extremes their own way. I think William Marshall is great in this film. He almost makes a better vampire than Bela Lugosi, but I don't know if I can put him alongside the great Max Shrek (\"Nosferatu\"). I was battling a case of the blues when I saw this,now happy days are here once again! Isn't that what movies are all about anyway? But, I do want to add one thing. Obviously, it is not an exceptional work of art. I gave it a 7 out of 10, but I did really, really enjoy this one!","user":"turkam","rank":[12,12]},{"title":"The Man in Black Is Back in Town","rating":10,"date":"5 August 2005","review":"\"Scream Blacula Scream\" is actually better than the original. Of course, that may have a lot to do with Pam Grier.<br><br>Grier plays Lisa, who had just been given the title of head of a voodoo cult. However, Willis (Richard Lawson), the son of the recently deceased voodoo queen, is not pleased at all with the group's choice. And of course, when you're mad, you have a burning desire to get even.<br><br>Ragman (Bernie Hamilton), who is also mad about how he was treated, gives Willis a helping hand by giving him bones that will help him in his revenge quest. That night, Willis does a voodoo chant with the bones (And during which Lisa sees something rise through fire in a vision) and up comes Blacula (William Marshall), who is none too pleased with being brought back to life (or death, or whatever). And he shows his displeasure by giving Willis an undead hickey.<br><br>Willis, who is now in undead chic, wants to attend a party. However, Blacula goes instead. There he meets Lisa, who feels that they had met before (In a way she has, seeing him rise from the flames during his resurrection). Soon, mysterious deaths occur and Sheriff Dunlop (Michael Conrad) believes that Lisa's cult may have something to do with it. Lisa's boyfriend Justin (Don Mitchell) believes otherwise.<br><br>Lisa later discovers Blacula's secret and he wants her to help him: her voodoo know-how can drive out the evil spirit that's within him.<br><br>Marshall and Grier work pretty well together, and I think that is why this film is slightly better than the first one. Too bad this was pretty much the end of the Blacula films. By the late 1970's, the era was pretty much dead, and films made during this period are regarded as stereotypical or racist.<br><br>However, despite some faults, this is still a pretty good film to have in your collection.","user":"domino1003","rank":[10,10]}]