[{"title":"Great","rating":8,"date":"23 February 2020","review":"Not as good as the first, but those are huge shoes to fill as the first film was so amazing. This sequel takes Dr. Jones to India where he seeks holy stones and a village's missing children. Still a good story conceived by George Lucas and directed by Steven Spielberg.","user":"MR_Heraclius","rank":[40,45]},{"title":"One of my favorite sequels!","rating":9,"date":"23 November 2003","review":"I know that there are a lot of haters when it comes to Indiana Jones and the Temple of Doom, it has it's flaws and is by no means the strongest movie of the Indiana Jones series, but I just have so many good memories about this film and still to this day when I watch it, it gives me chills and excitement. The characters are memorable, the script is great, and Indiana is still pulling in the action packed excitement continuing from Raiders of the Lost Ark. The direction, editing, even the special effects are great. You have to love Short Round and Willy, the two new side kicks to Indiana's new adventure. Now I agree, Willy can get a little annoying here and there, but she was just so hilarious in that scene with the bugs and having to save Indiana and Short Round. Plus, Short Round has some of the most memorable lines of the entire series \"Okey, dokey, Dr. Jones, hold on to your potato!\", cheesy, but so funny. Harrison Ford still has Indiana down to a tee, this was the role that was meant for him.<br><br>In this prequel, we start off in China on a trade off gone wrong with Lao Che, he ends up meeting a beautiful and very high maintence American girl, Willie. They escape together with Indiana's little side kick, Short Round and accidentally without knowing, they've escaped onto Lao Che's air plane. They wind up in India, where they find out about these rocks that can restore the village they're in, also the children have been kidnapped by Mola Ram and Indiana must free the kids and restore the rocks so the village can be safe again.<br><br>Indiana Jones and the Temple of Doom is a fun sequel, I don't know why people complain so much about it. I can understand if people say it's the weakest of the series, but on it's own, this is a fantastic movie. It's one of my biggest recommendations to my friends as well as other film viewers. It just has everything you could want: action, romance, alligators, and heart sacrifices, lol, OK, that sounded gross, just trust me this that this is such a fun movie. It's one of my favorite films, I know that sounds bad, but I just love this film. It's a lot of fun and Indiana and Short Round are just the best buddies to watch argue on screen. This is an awesome sequel, definitely a must see.<br><br>9/10","user":"Smells_Like_Cheese","rank":[167,236]},{"title":"Kate Capshaw...","rating":7,"date":"19 September 2018","review":"...is annoying as hell, but otherwise this is a very entertaining, action filled movie!","user":"warrencorson280","rank":[24,30]}]