[{"title":"an-NO-END","rating":10,"date":"14 February 2005","review":"What an outstanding movie!! I have heard all the prior generation people rave about this movie, so, I decided to check this movie out myself. I only have faint memories of having watched parts of this movie from my mom's lap when she and dad were watching this in the theater. The other reason why I decided to check this out was a Super-bowl half-time debate on whether Amitabh was better than Rajesh Khanna. I could not participate in this debate for two reasons: first, I was eagerly awaiting another \"wardrobe malfunction\" for one of the cheerleaders and secondly, I only had memories of one Rajesh Khanna movie, Haathi Mere Saathi. I remember having enjoyed it very much as a child. But that alone was not enough to quantify anything. The more recent performances of AB were fresh in my mind, but after having seen this movie, I decided that Rajesh had a class of his own. His chirpy performance in this movie is really unparalleled! What an amazing performance! Amitabh, being more junior, has not equaled Rajesh, but has done his share very well. Thus, even after watching this movie, the debate will continue.<br><br>What's New? What can possibly be new in an old movie? Guess what? there is plenty for the younger generation to take away! There is no education in the movies these days, whatsoever, except perhaps bedroom or bar sequences. The inadequacies in the field of medicine are so nicely brought forward by this movie, which is certainly over 30 years old! Now, I can understand why Munnabhai MBBS was such a hit. It had so beautifully adapted from this movie to match the present generation. Kudos to Vidhu Vinod Chopra and Sanjay Dutt (&amp; Kamal Hassan too) for carrying this forward.<br><br>Noticeable: \"BaaabuMushaai\", the nick name for Amitabh, as heard from Rajesh throughout the movie, will ring in your ears even hours after you have seen the six letters \"The End\" on the screen. There really is no end to such people! Some sequences were simply amazing. Those that stood apart in my mind were the last scene, with a tape that had a significant pause in between; the moun-vrath guru, who so symbolically said that there is so much more than the decaying body to Anand's soul; then of course the Munirbhai sequences and the eventual backfiring of this strategy and so many more! The songs were so gentle and heart warming! The comic timing of Rajesh Khanna was simply amazing! Verdict Present day filmmakers really need to rework their brains and start thinking much much better! There is much more to Hindi cinema than just skin-show and catchy item number songs. This is a MUST-WATCH movie! I did not think so when others told me, but having experienced it myself, I believe them! I am gonna check out the other MUST-WATCH movies prescribed by the previous generation.","user":"ram-008","rank":[50,56]},{"title":"My Favourite Movie Ever","rating":10,"date":"15 May 2006","review":"Anand is the most impressive movie by the director \"Hrishikesh Mukherjee\". his other movies like \"Abhimaan\" and \"Milli\" that also shows his directional sensitivity. Anand is a movie which speaks more than it scripts. It tells us more than its characters narrates the story. The impressive character no doubt is of Rajesh Khannna, but Amitabh is too much impressive. The \"Anand\" tells us how a man decided and then spent rest of his short life. A Man who had short time, but he wanted to live too much. for him, not the quantity but quality of life does matter. I recommend to see this movies more than once. And every time u see this movie, u'll end up with more brighter definition of film and life. The movie is too simple to narrate here, and tooo deep to express what i actually think about it.","user":"khurram-imtiaz","rank":[25,27]},{"title":"One of the best Hindi movies ever made.","rating":10,"date":"13 February 2004","review":"It is very rare for guys to shed tears after watching a movie, this movie does make you shed tears for Anand, the main protagonist played by the superstar of the 70's Rajesh Khanna.<br><br>The movie has everything going for it. Acting, direction, story, music, dialogues etc... everything is fabulous. It has drama, humor, emotions in dollops. It is a story a dying man who looks at life with a positive attitude and enjoys his time knowing  fully well his disease is incurable and that he is going to die soon.<br><br>Rajesh Khanna as Anand is absolutely brilliant, this is his career-best performance , notwithstanding movies like Kati Patang, Roti, Aradhana, Amar Prem etc. You cannot think of any other actor in this role and to think Rajesh Khanna was not the original choice(Shashi Kapoor was). He makes you laugh and cry. He causes anxiety and goose bumps. Simply superb.<br><br>Amitabh Bachchan is fantastic as babumoshai( a name with which Raj Kapoor used to address the film's director Hrishikesh Mukherjee). He showed the world that the next superstar was coming, though he really \"arrived\" a couple of years later. The rest of the supporting cast is also brilliant be it Johhny Walker(stands out) or Ramesh Deo or Seema or Sumitra. Everyone is wonderful.<br><br>Music is the hallmark of all great hindi movies and this one has music ranking right up there, on the top. Be it \"Kahin door jab din dhal jaye\" or \" Maine tere liye hi saath rang\" or \"Zindagi kaisi hai paheli\".<br><br>\nMaverick composer Salil Chowdury comes up with an absolutely fantastic score and singers Mukhesh and Manna Dey do complete justice to his tunes.<br><br>About the director Hrishikesh Mukherjee, what can one say, he is one of the best directors ever in the Indian film history. A guy with a complete repertoire,a complete entertainer (though people consider other  directors to be more entertaining, but real movie buffs will agree with me). All his movies, he has been directing movies since 1957 are worth a watch. Some are brilliant and others watchable. None of his movies can be rated as unwatchable(except maybe Jooth bole Kauwa kaate and Jhooti).<br><br>Simply put, this is one of the best Hindi movies ever made.","user":"Indianmoviebuff","rank":[37,43]}]