[{"title":"An engrossing movie with one of the best endings in cinema.","rating":9,"date":"3 December 2003","review":"'Gallipoli' is the story of two young sprinters who join the war effort in Turkey during World War I.  There have been countless war films in cinema history covering the different wars, the horrors of war, etc.  What is unique about this story is its probing of two young friends and their journey into the military effort--unlike other war films, which deal directly with the war, 90% of this film follows the journey of these two young men before they transfer over to the war.  The special quality of this is that the viewer gets to know these two protagonists very well and their humble lives in Australia--which makes the tragic ending all the more devastating.  The last 20 or 30 minutes of the film is spent at the Gallipoli peninsula, inside the war trenches.  The generals vainly send men running toward the enemy and they are swiftly slaughtered.  These scenes demonstrate the horrible truth of war, that healthy young men with lives ahead of them are destroyed forever in a single, pointless instance.<br><br>The final minute of the film is truly heartbreaking, as a tragedy occurs between the two young friends.  The very last shot of the film is stunning, as a horrible image is frozen on screen.  Director Weir could have fallen into the sentimentality trap, but he was smart: the tragedy occurs, and the moment it does, the movie ends RIGHT THERE, leaving you with a haunting final image.<br><br>A landmark war film, highly recommended.","user":"seger_now","rank":[76,92]},{"title":"One of the great war films","rating":7,"date":"7 April 2003","review":"Once again, I've had the pleasure of showing this film to one of my College literature classes; we're studying the World War One poets of England, and this film shows my students in vivid detail what made this war so different from anything that had come before it.  The world lost its innocence with \"The Great War,\" and we are still reeling from the consequences a century later.  Peter Weir's magnificent film follows the story of two best \"mates\" from the Australian outback and their sudden thrust into the realities of a new world order.  Mel Gibson, Mark Lee, and a fine cast create the sense of brotherhood and horror that makes this film so profoundly moving.  The last 20 minutes spares the audience no detail, and while more recent films like \"Black Hawk Down\" and \"Saving Private Ryan\" are perhaps more graphic, \"Gallipoli\" immerses us in the human loss more fully.  In \"Gallipoli\" we get to know these friends in intimate detail, making the losses they suffer in the end truly gut wrenching.  Five stars out of five stars.","user":"BillThierfelder","rank":[97,119]},{"title":"Not in top 250??","rating":9,"date":"26 September 2006","review":"I taught HS history and used very few commercial movies in teaching...the exceptions included GALLIPOLI and PATHS OF GLORY and the newer remake of ALL QUIET. I've never watched a film that builds plot, mood and theme any better than Gallipoli. While there are many light-hearted and humorous forays which add to character development, the ongoing drum-beat of the film is war, war, war--attack, attack, attack. I can't imagine any better musical score or musical editing:the juxtaposition of elegant Strauss waltzes the night before debarkation with the funereal Adagio as the troops cross the water is genius. I'm surprised that we haven't seen more of Marc Lee-the idealistic Archie. He does a wonderful job along with a VERY young Mel Gibson. When I showed the movie to my classes I was careful to watch THE STUDENTS as the final scenes arrived rather than the film. Now THAT was telling! I absolutely commend this film to all! (ADDED)BTW...Brits---try not to take the criticism of the military operation as criticism of YOU...I think the entire film was meant to be an indictment of war as an instrument of national policy. Your very own John Keegan observed that once wars begin, they have a way of creating their own momentum and justification. It's for this reason that Herodotus said that \"all wars are popular in their inception\". The film, as I viewed it, was about the futility of war, the fixation of military commanders to fix the \"previous war\" and the price we pay for stupidity. The lesson should not be lost on the US in Iraq either.","user":"SpringsNoir","rank":[70,88]}]