[{"title":"A nightmarish, Kafkaesque chamber piece; Bergman at his most enigmatic","rating":23,"date":"23 May 2008","review":"This is a somewhat odd and enigmatic film from Bergman; perhaps in keeping with many of the other films that he produced during the mid-to-late 1960's, and one that seems to be an extension of the artistic and psychological themes established in his more widely-acknowledged masterpiece, Persona (1966). Like that particular film, The Rite (1969) is a carefully structured drama built around a small cast of characters warring with one another in a close and claustrophobic environment that stresses the theatrical nature of the script. By refusing to extend on the material as many other filmmakers would when adapting one of their own works from stage to screen, Bergman creates a much tighter situation that gives the drama a stark, nightmarish quality that removes us completely from reality. Here, we are isolated with these characters, with all notion of the outside world or life beyond those drab, grey, minimalist locations having been removed completely, creating a void that overwhelms us.<br><br>The film also extends on some of the director's more recognisable themes, such as performance and persecution, with the idea of actors playing actors creating a performance that is not simply a part of the film, but also a comment upon it. It's perhaps a little clumsy in some places, especially compared to the aforementioned Persona, or indeed, similarly themed films like Hour of the Wolf (1966) and A Passion (1968); with the deeply enigmatic nature and theatrical presentation working towards an incredibly cold and uncomfortable atmosphere that never quite explains itself. I suppose this is a result of the short-running time and the fact that it was produced quickly and cheaply for Swedish television. However, it is still an incredibly bold piece of work, and one that definitely needs to be experienced by those with a real taste and admiration for the filmmaker; with the typically \"Bergmanesque\" themes and the strong performances and intense and troubling characterisations created by the cast making this a much more interesting and rewarding film than the brief plot outline might suggest.<br><br>The structure of the film is intended to somewhat distance us from the drama in a way that many of Bergman's better films would. Here, he uses chapter headings to disrupt the narrative; bringing to our attention the theatrical nature of the presentation and the artificiality of the world to, in effect, remove us from it. It works on a similar level to the self-reflexive interview sequences that punctuate the narrative of the previous A Passion, albeit, on a much more subtle level. Again, it is intended to add a further dimension to the film, but also to make the viewing process even more difficult. It also denies us a central character, with both the central government figure and the three performers all moving from hateful to sympathetic from one scene to the next. There are also at least two scenes that seem to be even further disconnected from reality. One such scene involves the youngest of the performers setting fire to his hotel room, lying back on his bed with his sunglasses on and staring up at the ceiling with a cool detachment as the room is engulfed by flames. It is never referred to or explained whether this scene actually takes place or if it is merely symbolic; though I suppose it could be read on an analytical level in regards to that particular character and his somewhat damaged and detached personality.<br><br>The second scene I won't go into, as it's one of the most important moments in the film. However, it is interesting how it sets up the atmosphere for that troubling and enigmatic finale, which again, is never fully explained and seems to sway the film away from the performers and more towards the self-appointed judge. There's a definite Kafka-like influence developed here, not only with the characters but with the situation that they find themselves in. So, we have a small group of characters put on trial for what we later learn are \"obscenity charges\", but the actual scenes between the judge and the performers seems to be much more cryptic and personal. If you're fond of the mind games and psychological role-playing developed in Persona then you should get a real thrill out of the five interview scenes that form the backbone of the film in question, with each character playing up to their own emotional strengths and weaknesses whilst finding themselves in this hopeless and incomprehensible situation.<br><br>Given the nature of the film I won't discuss the ending too much, though suffice to say it changes the way we look at those preceding scenes and seems to open up the narrative to further ideas of self-reflexive interpretation. So, we have the idea of a film within a film, or perhaps something more literal. Or is it a metaphor for the struggle of creativity in the face of government oppression. Indeed, at the time this film was made, Bergman was fighting his own battles against both theatre and cinema and how they were being developed back in Sweden at this particular time. It seems like he had lost faith in his audience and those who were paying for his work to be developed and these fears and anxieties are presented in the film alongside a rage of fury and aggression. For certain, this is a dark, troubling and enigmatic psychological piece that rewards patient viewers with a thought-provoking, Kafkaesque moral dilemma with room for personal interpretation.","user":"ThreeSadTigers","rank":[11,11]},{"title":"Must-see for any Bergman fan","rating":9,"date":"20 August 2002","review":"Made for television during what is probably Bergman's most innovative period, around the same time as Persona, Shame, A Passion, and Cries and Whispers. Three actors, played by Bergman regulars Gunnar Bjornstrand, Anders Ek, and Ingrid Thulin, are brought up on an obscenities charge in an unnamed European country. A judge (Erik Hell) interviews them over a period of several days, first all together, and then each one separately. We also see scenes of the actors outside of these interviews interacting in pairs (never all three together). There is also a scene in which the judge visits a priest, in a re-enactment of a certain scene from The Seventh Seal, the one where Antonius Block confesses his chess strategy to death. Here, Bergman himself plays the priest/death (in the interview book Bergman on Bergman, he jokingly brags that he got paid extra for having a speaking part in the film). The film as a whole is difficult, as are the other films around this period. But it is an amazing film when taken scene for scene. It's a showcase for these amazing actors. Thulin, Bjornstrand, and Ek are amazing as these absolutely deranged characters. Ek plays the most arrogant person in the world, and he has a little problem with pyromania. Thulin, who is married to Bjornstrand but sleeps exclusively with Ek, has some serious mental problems (and a wig that makes her look like Anna Karina from Vivre sa vie). Her neuroses make Woody Allen seem relatively calm. Bjornstrand is a desperate character who wants to get away from his wife and her lover (also his best friend), but he's not sure if he can live without her. The Rite is actually quite graphic. There are a few very erotic scenes, and Thulin was never more desirable. In one scene, Ek asks Bjornstrand how he can bring Thulin to orgasm, and the description made me blush, of all people. The film would probably have been rated X in the United States. Needless to say, it would never appear on television! When it was originally broadcast, Bergman had a disclaimer placed before it telling everyone that they might want to read or go to the movies instead of watch The Rite! 9/10.","user":"zetes","rank":[17,21]},{"title":"My brief review of the film","rating":19,"date":"19 February 2006","review":"An intriguing sexually explicit and frank film about a number of different things, ranging from anti-censorship sentiments to neuroses, it is well directed by Ingmar Bergman, shot from interesting angles and making good use of close-ups, but still it is far off the level of Bergman's best work. The ideas are a bit all over the place and the film is too talkative for it to have much chance of establishing atmosphere. The events of the final ten or so minutes are contrived too, particularly concerning the main character. Either way, it makes an interesting enough watch, and if not for its cinematic virtues, at least for giving an idea of the very adult stuff allowed on Swedish television in 1969! Worthwhile for Bergman fans; others might want to try out a few of his other films before giving this a go.","user":"sol-","rank":[9,10]}]