[{"title":"Probably the best unknown movie ever made.","rating":10,"date":"20 July 1999","review":"Here is a tragedy -- a great film doomed by a terrible title.<br><br>I saw this movie as \"Duck, You Sucker\" in the theater in 1972 or '73. I still have images and haunting music burned in my brain from it. It has, for one thing, one of the biggest real explosions ever filmed, an absolutely awesome blast using real high explosives that makes today's fiery spectacles pale. I think the whole production company was stunned by it, certainly Sergio Leone was, because he gives it the full treatment: multiple cameras and angles, wide shots, lots of screen time giving us lots of looks. And it's worth it. If you're not a war veteran, you've never seen anything like this.<br><br>But this film is much more than its fx. It's a deep, moving story told on the grand scale, with Oscar-class cinematography. It is both a major outdoor adventure and a small, intimate story. It has some of the quirkiest scenes, blackest humor and darkest betrayals, too.<br><br>Don't look for it on TV, unless Turner Classic Movies shows it \"uncut.\" It was horribly mutilated in editing for television, and therefore unpopular and rarely shown. Get the original theatrical version, and watch it undisturbed. A party atmosphere would ruin it for you.<br><br>It's on my top-20 all time list!","user":"SquirePM","rank":[176,207]},{"title":"Leone's most underrated film,a rich masterpiece which gets better and better with each viewing","rating":23,"date":"23 April 2005","review":"It's generally thought that this film is Leone's weakest major film,and it is far less well known than the Dollars trilogy and the two Once Upon a Times. In actual fact,this is a masterpiece that deserves to be far better known and regarded than it actually is. It sees Leone attempting new things such as character development and political comment,while refining elements from his earlier films. It's really the bridge between Once Upon A Time In The West and Once Upon A Time In America,and it contains a great many elements of both films {which let's face it,despite both being Leone films are quite different}.<br><br>It starts in humorous vein,right from the opening sequence of the dirty,very poor Rod Steiger character Juan being taunted by some rich folk aboard a lavish carriage,the camera showing lots of close ups of mouths and eyes in what almost seems a parody of Leone's style. Juan is much like Tuco in The Good the Bad And The Ugly,loud,simple and very funny {he's even often accompanied by comical music }.Juan's first encounters with the other main protagonist,IRA man Sean {James Coburn} are treated like comical duels,and as they go to rob a bank it seems the picaresque tone will continue.<br><br>However,about a third of the way through the film becomes more and more serious. As Juan,thanks to Sean,becomes more and more involved in the Mexican Revolution,the tone becomes darker as more and more scenes take place at night and there is serious tragedy. The change in tone may jar to some people,but one can see the mature,contemplative Leone of Once Upon A Time In America reveal himself before our eyes.<br><br>Of course there are still some great action scenes,such as the taking of a bank which is superbly cut to Ennio Morricone's music {listen for the cheeky quotes from Mozart!},or Sean and Juan machine-gunning what seems like a whole army. There is as usual a great deal of violence,but it's less personal and graphic and instead is shown to have more consequence. The film's plot does move rather slowly,with Leone taking his time as usual,but this mean we can more enjoy the mannered Steiger and the laid back Coburn as one of the greatest partnerships in cinema history.<br><br>Of particular interest are the several flashbacks dotted throughout the movie,shot in dreamlike slow motion and usually set to what is quite simply one of the most beautiful film themes EVER {Morricone excels himself with the score for this film}. Representing Sean's past,they ask as many questions as they answer,Leone trusting his audience to work things out. The final one is missing from many versions of this film,a tragedy because as well as being sublimely beautiful {and ambiguous,is it Sean's memory?,a marijuana-enhanced hallucination?,a vision of Heaven?} it adds yet another element to the story.<br><br>A Fistful Of Dynamite {well,the French Once Upon A Time..The Revolution is the films' best title}is a masterpiece,it's extremely entertaining whilst also being full of complexity. Things become clearer and more interesting on second and third viewings. Don't expect the operatic ritualism of Once Upon in The West or the comic crowd pleasing of the Dollars films,but if you watch this you will be watching a cinematic master at the height of his powers.","user":"DrLenera","rank":[119,144]},{"title":"Sergio Leone's Sad, Funny, Beautiful Epic Western","rating":9,"date":"8 October 2004","review":"Coming off the triumphs of his \"Man With No Name\" series and his frustrations with the cutting of \"The Good, The Bad &amp; The Ugly\" and \"Once Upon a Time in the West,\" Sergio Leone directed the big budget, epic western, originally titled, \"Once Upon a Time in the Revolution\". Since \"...West\" had been released by Paramount and United Artists was releasing \"...Revolution,\" some executive decide the rename the movie \"Duck! You Sucker!\" after the phrase Sean (James Coburn) uses repeatedly before blowing someone or something up with dynamite. Likely the same executive choose an advertising campaign reminiscent of \"The Good, The Bad &amp; The Ugly,\" creating caricatures of Sean and Juan (Rod Steiger) adding the caption \"...the master of adventure, Sergio Leone\". Well, I doubt many theater audiences knew who Sergio Leone was, since he was yet to be recognized as a directoral genius the equal of John Ford or Howard Hawks. Worse, the advertising implied \"Duck! You Sucker! was a laugh romp, a parody of Leone's early masterpieces. This impression was made even worse when the film failed to perform. In any event, \"A Fistfull of Dyanmite\" was a dismal failure at the box office and Leone never made another big budget western drama.It's too bad, because \"A Fistfull of Dynamite\" is Leone's trueist work, his most accurate vision of life, politics and revolution. Neither Rod Steiger nor James Coburn were strongly associated with westerns, even though both played strong roles in earlier films (Steiger in \"Run of the Arrow\" and \"Jubal,\" Coburn in \"The Magnificent Seven\" and \"Ride Lonesome\". Worse, Steiger's Juan looked like something of a buffoon and the movies villains were bland and underdeveloped. However, I believe this was Leone's intention: corrupt politicians and Prussian officers are pretty well interchangeable. Kill one and another pops up. This isn't a very satisfying truth, but it is truth, nonetheless. Juan is a peasant, a bandit with a large family of bandits. Sean is a Irish Republican Army terrorist, an explosives expert. In Leone's world, or at least in all his films, there are only two types of people: predators and victims. His major characters are all predators. The only thing that distinguishes his protagonists from his antagonists is that his antagonists start with a large body count and his protagonists usually spare the innocent. That works with a taut enough storyline, but \"...Dynamite\" covers large areas of real estate and the goal is never clear. Juan didn't plan to become a hero of the revolution, and that is small payment for his losses. When one looks at history, the rewards of revolution and warfare are never worth the sacrifices, for just as we kill one bastard, another takes his place.<br><br>I think \"A Fistfull of Dynamite\" largely reflects Leone's fate as well. Leone proved he was the greatest western director in less than four years with only four major films. Yet, he was hardly appreciated during his short life and only a few films after his magnificent achievement. \"A Fistfull of Dynamite\" is also Leone's saddest movie. A beautiful, big budget metaphor for a man's talent wasted by underappreciate film executive and smug, self-serving critics.<br><br>Coburn should have won an \"Oscar\" for \"Dynamite.\" With the exception of some tabletop model trains, the effects are convincing and exciting. The color cinematography is phenomenal, clearly the equal of \"Once Upon a Time in the West. The sound and music (by Ennio Morricone) is phenomenal, as usual. While not as satisfying as Leone's best films, \"A Fistfull of Dynamite\" is an exemplary film. I give it a \"9\".","user":"Bob-45","rank":[102,125]}]