[{"title":"Underrated Keaton Film","rating":9,"date":"18 May 2000","review":"Go West is a movie that you seldom hear about and even Keaton did not consider it among his best.  However, every time I see it, I cannot help but think that it is one of his funniest and most touching films.  In his independent work, Keaton had an amazing ability to portray very unfortunate characters and yet not seem to be pandering to the audience for its pity. In this film, Keaton plays a character referred to as Friendless. The opening scenes of the film show him bouncing around from one unfortunate (and hilarious) situation to another.  Yet rather than feel pity for him, the audience can root for this character and good-naturedly laugh at how Friendless reacts to and deals with his misfortunes.  It's difficult not to admire the way he overcomes all challenges.  When he finds a friend in a cow named Brown Eyes, his loyalty to her and the rancher that employed him precipitates an amazing sequence of events, culminating in an unbelievable cattle stampede through the streets of LA.  Although, the scene may drag on a bit, I'll never forget the image of Buster Keaton running down a city street in a red devil's outfit being pursued by a giant herd of cattle. It is one of the most hilariously absurd scenes ever committed to film. There are great gags from beginning to end and, as usual for Keaton, the final sequence is very satisfying.  In addition, the Kino release has an outstanding soundtrack which enhances the film considerably.  I would highly recommend Go West to anyone as an introduction to Keaton, silent films, or comedies in general.","user":"prionboy","rank":[31,33]},{"title":"Gentle, off-beat satire of movie westerns and sentimentality","rating":8,"date":"7 August 2006","review":"There is a fundamental disagreement about Go West, between those who see it as Keaton's only sentimental movie, and those who think Buster is satirizing sentimentality. I'm in the latter group. Keaton's satire is so subtle, and so devoid of meanness, that people easily miss itbut I'm convinced he's playing the whole opening sequence with tongue firmly in cheek. His character, \"Friendless,\" is just a shade too pathetic to take seriously; even a dog turns away coldly when he tries to pat it. Buster is not appealing for pity here, he's getting in a gentle dig at other performers (particularly, perhaps, one whose initials were C.C.) who did.<br><br>In a later scene, mooning over a girl who won't give him the time of day, Buster leans wistfully against the edge of a well. His elbow knocks the bucket into the well, the rope unspools and the handle, spinning, clunks him smartly on the head. Don't feel sorry for me, he is saying: laugh at me. Buster's screen character is a stoic (as he was off-screen), and his sense of humor is part of his stoicism. His insistence on seeing the comedy even in painful and humiliating situations is the inexhaustible source of his dignity.<br><br>Buster had a natural rapport with animals. He shares their mute patience: \"They do not sweat and whine about their condition,\" as Walt Whitman wrote, and neither did he. The heart of Go West is the touchingthough faintly ridiculousfriendship between Friendless and Brown Eyes, a pretty little Holstein cow who is ostracized by other cows on the ranch where Friendless works as a hand. Buster trained Brown Eyes himself, and she follows him around with endearing, dopey devotion. In one of the film's best sight gags, he ties a pair of antlers on her head so that she can defend herself against horned steer. She looks like a seriously overweight reindeer. The plot is driven by Friendless's efforts to save Brown Eyes from being sent to the slaughterhouse with the rest of the cattle, and to save his employer from financial ruin. He shows some interest in his employer's attractive daughter, but not a whole lot; poor Kathleen Myers is left with little to do, and looks a bit miffed at playing second fiddle to a cow.<br><br>Go West is easily Keaton's oddest film, and it's not entirely successful. There's a limit to how much comedy you can get out of cows. Where Buster got the idea of making a movie that centers around cattle I don't know (though I do think \"Brown Eyes\" is a joke about the devoted, cow-eyed leading ladies featured by some other comedians.) But once he got an idea, Buster always explored it thoroughly and carried it as far as it would go. He dreamed up a promising finale: a herd of cattle turned loose in the streets of Los Angeles. Unfortunately, as he himself later said, it didn't work out as planned. There's an enjoyable zaniness and surrealism to the spectacle, but it's all a little overplayed, Mack Sennett style, which is uncharacteristic for a Keaton movie. Even more atypically, he fakes the final stampede by speeding up the film: it just wasn't possible to get the cows moving fast enough to provide a satisfying final chase.<br><br>The earlier part of Go West, however, contains a number of beautifully Keatonesque moments: his attempt to adopt a bowlegged walk to look like an old cowboy, the elegantly summarized sequence where he rides the rails, the perfect timing of the supper table scenes, in which Buster repeatedly arrives just as everyone is leaving, then finally \"turns the tables.\" Just hired at the ranch, Buster is handed a pail and stool and told to milk a cow. He approaches the cow, places the pail under her udders, sits down a discreet yard away and waits for the cow to do her thing. When nothing happens, he takes the pail and shows it to the cow, in case she didn't notice it was there, puts it back and keeps waiting patiently. Playing it straight, never italicizing his jokes, finding comedy in stillness and in not reacting, a comedy of negative spaces, is the essence of Keaton's style. He never \"milks\" his gagsnot even this one.<br><br>In my favorite scene, Buster pokes fun at his own \"stone face\" persona. He's playing cards with a couple of tough cowboys and accuses one of cheating. The cowboy pulls out his six-gun, levels it at Buster, and orders, \"When you say thatSMILE.\" Buster's reaction is one of his subtlest and most ineffably hilarious close-ups. He pauses; he pondersnot whether to smile, but how to get out of the jam since he CAN'T smile. He tries out the Lillian Gish, Broken Blossoms bit of pushing the corners of his mouth up with his fingers. Not good enough. He sighs. Then a crafty determination creeps into his eyes. He insinuates his pinky behind the cowboy's trigger finger, and with all his strength keeps him from squeezing the trigger while he pulls out his own tiny gun (which, for convenience, he has attached to a string like a child's mitten) and makes the guy back down. Not smiling is a matter of life and death.","user":"imogensara_smith","rank":[22,23]},{"title":"Enjoyable Change-of-Pace From Keaton","rating":30,"date":"30 July 2001","review":"\"Go West\" is an enjoyable change-of-pace from Keaton.  It has a creative story that enables Buster to demonstrate some different acting skills, while still having plenty of his trademark slapstick, chases, and stunts, especially in the last half of the film.  It's not one of his best-remembered films today, largely because it is rather old-fashioned and sometimes slow, but it has a great many merits for those who enjoy silent comedies.<br><br>Buster's character is down on his luck, and decides to head west.  He winds up on a ranch, working as a cowhand.  As he tries rather ineffectively to learn the trade, he becomes attached to a particular cow, 'Brown Eyes'. While trying to protect Brown Eyes from harm, he is caught in the middle of the desperate attempts of the rancher and the rancher's daughter to save their business.  Keaton is very good in evoking sympathy for his character while still being amusing, and the story is touching at times while remaining pleasantly silly at others.  There are times when it does move pretty slowly, but it is always pleasant to watch.<br><br>The film would be well worth seeing for the last portion alone.  Everything comes together in a madcap stampede sequence that is extremely funny and that contains a lot of inventive gags.  It's classic Keaton, and a great way to top off a rather different story.<br><br>If you are a fan of Buster or of silent comedy in general, make sure to give this one a try.  It's not the kind of film that could be expected to attract a wide audience today, but it's a pleasant and enjoyable film, and you might like it as much as those of us on this page have enjoyed it.","user":"Snow Leopard","rank":[20,21]}]