[{"title":"Got the Dracula thing right!","rating":8,"date":"30 October 2004","review":"I'm big on the older vampire films--Bela Lugosi, Frank Langella (although Gary Oldman was darned sexy). \"Love at First Bite\" was a brilliant spoof of the original Dracula. The update of Dracula in New York has been redone many times but not as well as this. Okay, it's a little dated with the disco vibe and the clothing, but George Hamilton's campy accent and deep Dracula gaze were perfect. The writer and George Hamilton had obviously studied the Bela Lugosi version carefully, and there are many references to famous lines, e.g., \"I never drink...wine.\" Reviewers who knock this movie don't know the source material very well. Richard Benjamin, Artie Johnson, and Susan St. James were a great supporting cast.","user":"marykateanswer42","rank":[25,26]},{"title":"Grungy-But-Very Funny Dracula Spoof","rating":9,"date":"20 April 2006","review":"Despite the '70s sleaze and feel to it, this is still a classic comedy with many laugh-out-loud scenes, similar to the Dracula spoof Mel Brooks put out in the '90s (Dracula: Dead And Loving It). Brooks must have been inspired watching this film.<br><br>Susan St. James is okay in the female lead role here but almost all the laughs are produced by three guys: George Hamilton IV, Arte Johnson and Richard Benjamin. This has to be Hamilton's best role by far. He excels with his deadpan humor and restrained style as the famous \"Count Dracula.\" Johnson, as \"Renfield,\" still makes me laugh with his stupid laugh in here and Benjamin added a lot of spark to the film the moment he entered, playing the ultra-liberal psychiatrist who knows who Dracula right off and tries in vain to stop him.<br><br>Speaking of \"liberal,\" this film is like something discovered out of a time capsule, if you want to see the most Liberal period in American history - the '60s and '70s - with the too-casual attitude toward sex, drugs and anything of moral value. St. James, as model \"Cindy Sonheim,\" gives us Exhibit A of that, with Benjamin close behind.<br><br>Since all four of the major characters in here provide tons of entertainment in this hour-and-a-half, this movie always is fun to watch, no matter what era.","user":"ccthemovieman-1","rank":[41,46]},{"title":"Dracula's tanned, in New York, in the 70's, in the disco...after all he loves the night life, he likes to boogie!","rating":10,"date":"15 November 2003","review":"Sad to think of vampire movies that get over looked, one of the big ones' that is in my opinion one of the funniest movies you'll ever see is called Love at first Bite. The first time we wonder what would life be like for Dracula if he came into the present world and to take on one of the toughest cities: New York City. Sure, he's big time in Transylvania, but when it comes to America, he sure does loose his fang. George Hamilton does a terrific job playing a tan Dracula and you can tell he had so much fun getting into the role. He had such great comedic timing and really created this movie. Love at first Bite is something very special to me and I promise that you'll love it too. My boyfriend makes fun of me all time on my love for vampire movies, but when I showed him this movie, he nearly died laughing and loves it now. Before Dracula: Dead and Loving it, there was Love at first Bite and it is one of the funniest movies you'll ever see.<br><br>Count Dracula is expelled from his castle by the Communist government of Romania, which plans to convert the structure into a training facility for gymnasts. The world-weary Count travels to New York City with his bug-eating assistant Renfield and establishes himself in a hotel, but only after a mix-up at the airport causes his coffin to be accidentally sent to be the centerpiece in a funeral at a church in Harlem. While Dracula learns that America contains such wonders as blood banks, he also proceeds to suffer the general ego-crushing that comes from modern life in the Big Apple as he romantically pursues fashion model Cindy Sondheim, whom he has admired from afar and believes to be the current reincarnation of his true love. Dracula is ineptly pursued in turn by Sondheim's psychiatrist and on and off boyfriend Jeffrey Rosenberg. Jeffrey is the grandson of Dracula's old nemesis Fritz van Helsing but changed his name to Rosenberg \"for professional reasons\". Rosenberg's numerous methods to combat Dracula: mirrors, garlic, a Star of David, silver bullets, fire and hypnosis which are easily averted by the Count. After all, he doesn't want the Count to have Cindy on the good chance that he might be in love with her.<br><br>Where to begin on the laughter? \"Children of the nightShut up!\" is very possibly one of the best lines of all time. Or the scene that will have you in stitches when Dracula's coffin is misplaced and put in the middle of Harlem during a funeral, Reverend Mike says \"Cuz when you is gone, you is gone! And there ain't no way, no how no one is ever gonna bring you back here once you is dead!\" and Dracula rises out of the coffin and sends everyone screaming hysterically out of the funeral home, you don't get great comedic timing like that any more! Dracula's first night trying to get victims and of course in New York, no one takes a bat seriously a starving family even mistakes him for a \"black chicken\", God, that scene nearly kills me! Then of course you have to love the outrageous antics of Dr. Jeffery Rosenberg, who is so over the top in trying to kill Dracula he ends up going crazy. Every character in this film is great and the actors looked like they had so much fun making Love at first Bite. That is what makes a film so special is when you can tell the cast and crew put love into the film. Love at first Bite flows very well and while dated, I promise there is no way you'll watch this movie without getting at least one good laugh. I love showing this film to people who have never seen it before, they always get a good kick out of it. It's just a great movie, please watch it, you won't regret it.<br><br>10/10","user":"Smells_Like_Cheese","rank":[19,20]}]